{"id":71091,"no":54,"title":"Page 54","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Poor starving baby. Want to brave the cameras and eat out? Or order room service?”\u003c/p\u003e\n\u003cp\u003e“How about if you use some of that Cooper clout and get us a table at the hotel restaurant? You look too goddamn good to waste sitting on a bed in our suite.” He grinned. “But feel free to leave them shoes on later.”\u003c/p\u003e\n\u003cp\u003eAfter a leisurely meal, which turned out to be romantic and fun, even amidst a crowd, they returned to their room. Chase led Ava to the bedroom and stripped her slowly. Silently. When she was bare before him, he murmured, “I knew I’d find my Ava under here.”\u003c/p\u003e\n\u003cp\u003eHer eyes, always so expressive, were oddly wary when she whispered, “Am I really your Ava, Chase?”\u003c/p\u003e\n\u003cp\u003e“Goddamn right you are. The rest of this stuff—country boy, city girl—doesn’t matter. You understand that, right? I’m not here with you because you’re a celebrity, or because you’re rich. I’m with you because whenever we are, whether it’s in Wyoming or Nebraska or New York City, it feels right. When I’m with you, Ava, I feel like I’m where I’m meant to be.”\u003c/p\u003e\n\u003cp\u003e“That’s not just the wine talking.”\u003c/p\u003e\n\u003cp\u003e“It’s me talkin’.” Chase inhaled slowly, trying to calm the mad beat of his heart. “Ava. I love you.”\u003c/p\u003e\n\u003cp\u003eA beat passed. She smiled cheekily. “I figured since you ain’t the type to wear your heart on your goddamn sleeve that I’d have to say I love you first.”\u003c/p\u003e\n\u003cp\u003eHe laughed at her perfect imitation of his way of speaking. This woman rarely reacted as he’d expected, which was just another reason he was so crazy in love with her.\u003c/p\u003e\n\u003cp\u003e“Meeting you is the best thing that’s ever happened to me.” She started in on his buttons. “I’m not here with you because you’re a famous bad boy bull rider or because of your slamming body…okay that might be part of it.” She kissed each inch of skin she exposed. “I love everything about you. We fit together in so many ways. I never thought…I’d find someone like you.”\u003c/p\u003e\n\u003cp\u003eWas she really choked up, telling him how she felt? “Ava. You undo me.”\u003c/p\u003e\n\u003cp\u003e“Take me to bed. I’m dying for you.”\u003c/p\u003e\n\u003cp\u003eYep. Definitely in love with her.\u003c/p\u003e\n\u003cp\u003e“It says what?” she practically shrieked.\u003c/p\u003e\n\u003cp\u003e“The City Star has an exclusive with Chase McKay. And a picture of him shopping in a western store. Get this, one of his purchases was a…rope. Apparently he was pretty vague on what he planned on using it for in Manhattan.”\u003c/p\u003e\n\u003cp\u003e“Oh my fucking God, I’m going to kill him.”\u003c/p\u003e\n\u003cp\u003eHannah laughed. “Chill out, Ava. This is funny stuff, because you know he did it to make the reporter for the Talk of the Town look like an idiot.”\u003c/p\u003e\n\u003cp\u003e“But why didn’t he tell me?” Shit. He had told her he’d handled it. And she shouldn’t be shocked he’d used a subversive tactic. “What else does it say?”\u003c/p\u003e\n\u003cp\u003e“The City Star says he visited FAO Schwartz and Tiffany’s, creating speculation you’re knocked up. So they’re postulating he’s buying you an engagement ring and baby items.”\u003c/p\u003e\n\u003cp\u003e“This is so ridiculous.”\u003c/p\u003e\n\u003cp\u003e“I imagine it is for him too.” Hannah giggled. “And he ended his day with a visit to the Museum of Sex.”\u003c/p\u003e\n\u003cp\u003eAva’s thoughts returned to their sweetly intense lovemaking last night and the new things he’d tried that’d sent her into orgasmic overdrive. Twice.\u003c/p\u003e\n\u003cp\u003e“I don’t hear you complaining about that one,” Hanna said with a rowr.\u003c/p\u003e\n\u003cp\u003e“No comment.”\u003c/p\u003e\n\u003cp\u003e“Then Talk of the Town has photos of you guys leaving the hotel last night. Fabulous dress. Vivienne Westwood?”\u003c/p\u003e\n\u003cp\u003e“Good eye.”\u003c/p\u003e\n\u003cp\u003e“More photos of you leaving Petra’s apartment. Lastly a really grainy shot of him feeding you something at the hotel restaurant.”\u003c/p\u003e\n\u003cp\u003e“Steak,” she said distractedly. “The man is a meat-eating machine.”\u003c/p\u003e\n\u003cp\u003e“So you plan to go out and tempt paparazzi today?”\u003c/p\u003e\n\u003cp\u003e“We’ll see. He’s at the gym. I talked to Arthur a little last night. He was very helpful.”\u003c/p\u003e\n\u003cp\u003e“How far are you in the project?”\u003c/p\u003e\n\u003cp\u003e“Waiting for her to send me stuff. It’s on hold until that point or until…” Ava scrolled over the images on the screen. Ryan smiling and talking to Chase.\u003c/p\u003e\n\u003cp\u003eWhen the door opened, she said, “Han, I’ve gotta go. I’ll touch base with you later,” and quickly closed the file on her laptop.\u003c/p\u003e\n\u003cp\u003eChase flopped into the chaise. “Who was that?”\u003c/p\u003e\n\u003cp\u003e“Hannah. Bringing me up to speed on today’s reporting. Seems someone had a very busy day yesterday.”\u003c/p\u003e\n\u003cp\u003eHis bottle of water stopped halfway to his mouth.\u003c/p\u003e\n\u003cp\u003e“Really, Chase? The Museum of Sex?”\u003c/p\u003e\n\u003cp\u003eHe grinned. “Hey, it is a museum. I was tryin’ to get a little culture while I’m in the big city, Hollywood.”\u003c/p\u003e\n\u003cp\u003e“Not funny. And for someone who was such a fit about going shopping with me, you managed to hit three different stores yesterday.”\u003c/p\u003e\n\u003cp\u003e“First of all, you told me I needed clothes. Then I had time to kill so I picked up a stick horse for my nephew and a stuffed panda for my niece at the toy store. I wandered down the street and saw a fancy crystal vase in the window and knew my mother would get a kick out of a box from Tiffany’s showing up in Wyoming. And while I was in there I found a lamp for Ben’s desk and a picture frame for Quinn and Libby.”\u003c/p\u003e\n\u003cp\u003eHe’d really been shopping for his family? That was so unbelievably sweet. And out of character for the rough cowboy.\u003c/p\u003e\n\u003cp\u003e“Did you buy anything for me?”\u003c/p\u003e\n\u003cp\u003e“Nope.” He cocked his head. “Did you buy anything for me when you went shopping yesterday?”\u003c/p\u003e\n\u003cp\u003e“Nope. But maybe we can pick out something for each other today when we go shopping together, since I now know you were lying through your pearly whites about hating to shop.”\u003c/p\u003e\n\u003cp\u003e“Ah, well, I have plans today.”\u003c/p\u003e\n\u003cp\u003e“What kind of plans?” And why didn’t you tell me?\u003c/p\u003e\n\u003cp\u003e“One of Arthur’s friends was talking about corporate sports sponsorships last night and I weighed in. Evidently I didn’t come across sounding like a hick idiot because he called me this morning and invited me to lunch and a Yankees game.”\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed. “Who invited you?”\u003c/p\u003e\n\u003cp\u003e“Bill Dahl.”\u003c/p\u003e\n\u003cp\u003e“Bill Dahl? Who used to work with Donald Trump? Who has box seats at Yankee Stadium invited you to his inner sanctum? God. Billion dollar deals are made in those seats. You realize that, right?”\u003c/p\u003e\n\u003cp\u003e“No. But it’s not a big deal, Ava. Just a couple of guys eating hot dogs and bullshitting while watching a ball game.” He popped to his feet. “I better get in the shower. He’s sending a car to get me in about fifteen minutes.”\u003c/p\u003e\n\u003cp\u003e“Fifteen minutes? That gives you enough time to get ready?”\u003c/p\u003e\n\u003cp\u003eChase rolled his eyes.\u003c/p\u003e\n\u003cp\u003e“You have clothes, right?”\u003c/p\u003e\n\u003cp\u003e“No, I thought I’d stroll in buck-assed nekkid. Christ. I can dress myself. Sometimes I think you forget that I’ve been on TV damn near once a week for the last eight years. So I have an idea how to conduct myself in a professional situation.”\u003c/p\u003e\n\u003cp\u003eNow she felt like a snob. “Sorry. I do forget that.”\u003c/p\u003e\n\u003cp\u003eWithout prompting, he said, “I love you,” and smooched her on the mouth. “That guy who holds the door said the manager wanted to talk to you in his office as soon as it was convenient for you.”\u003c/p\u003e\n\u003cp\u003e“I’ll see you later.”\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Six\u003c/p\u003e\n\u003cp\u003e“Come on. I have something to show you.” Ava draped a lightweight cashmere sweater over her arm and shouldered her purse. She was surprised Chase took her hand without asking questions.\u003c/p\u003e\n\u003cp\u003eJason waited for them at the elevators. “Ready?”\u003c/p\u003e\n\u003cp\u003e“All set.”\u003c/p\u003e\n\u003cp\u003eIn the elevator, Jason swiped a keycard and inserted a small key into the panel before punching in a code. He faced them as the elevator moved. “Everything is set up as you requested. We have an event scheduled for noon, so the cleaning crew will arrive at six a.m.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Jason.”\u003c/p\u003e\n\u003cp\u003e“My pleasure.” He stepped aside as the doors slid open. “Enjoy your evening.”\u003c/p\u003e\n\u003cp\u003e“We will.” Ava gripped Chase’s hand and stopped in the center of the round room.\u003c/p\u003e\n\u003cp\u003e“You wanna tell me what’s goin’ on, Hollywood?”\u003c/p\u003e\n\u003cp\u003e“We haven’t spent as much time together on this trip as I’d hoped. So tonight, it’s just us.”\u003c/p\u003e\n\u003cp\u003eHis gaze scanned the polished wood floors, the glass walls, and the three doors, which were open, allowing a breeze in. “Where are we?”\u003c/p\u003e\n\u003cp\u003e“The penthouse. It’s rented out mostly for parties because…come on. I’ll show you.” Ava tossed her purse and sweater on the settee. She lifted a brow. “You aren’t afraid of heights?”\u003c/p\u003e\n\u003cp\u003eHe snorted.\u003c/p\u003e\n\u003cp\u003eHolding his hand, she led him out the door and straight to the edge of the wide walkway.\u003c/p\u003e\n\u003cp\u003e“Holy shit.”\u003c/p\u003e\n\u003cp\u003eThat summed it up perfectly. The modified balcony surrounding the penthouse boasted a 360-degree view of the New York City skyline. A waist-high glass partition was the buffer between penthouse and the twenty-one stories to the busy street below.\u003c/p\u003e\n\u003cp\u003eNeither said anything for several long minutes as they drank in the spectacular view. Ava had timed it so they arrived just before twilight, which allowed them to watch day turn to night as the lights of the most famous skyline in the world came on.\u003c/p\u003e\n\u003cp\u003eThey walked the perimeter, stopping every few feet to gaze across the rooftops and the cityscape beyond. Ava pointed out landmarks. This time of day the light reflecting off the Chrysler Building gave it a pinkish-orange hue.\u003c/p\u003e\n\u003cp\u003eWhen they reached the opposite side, Chase said, “Holy shit,” again.\u003c/p\u003e\n\u003cp\u003e“I thought you might like this.”\u003c/p\u003e\n\u003cp\u003eA perpetual breeze blew due to the altitude. Ava’s dress flapped around her knees. Strands of hair drifted across her face and she wished she’d tied it back.\u003c/p\u003e\n\u003cp\u003eChase rested his forearms on the glass ledge and peered over side. “Long drop.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-54.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
