{"id":71100,"no":63,"title":"Page 63","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAva gave Hannah an arch look. “Besides I know how damn good the man looks in chaps?”\u003c/p\u003e\n\u003cp\u003e“Smartass. But really, what’s the point after Chase’s meltdown last night?”\u003c/p\u003e\n\u003cp\u003eHer heart seized, thinking about how Chase had lost it on live TV. She’d wanted to jump through the screen and drag him off to comfort him. Assure him that not every wreck would have the same outcome as Ryan’s. Assure him she’d be there for him no matter what.\u003c/p\u003e\n\u003cp\u003e“I know you can hear me, Ava, so stop ignoring—”\u003c/p\u003e\n\u003cp\u003e“Ssh… They’re giving the injury report on Dirk.”\u003c/p\u003e\n\u003cp\u003eThe camera cut to an interview with the head of the sports medicine team. When he finished detailing the bull rider’s injuries, the announcer asked his opinion on Chase McKay’s comments about mandatory safety helmets. The doctor looked directly into the camera and said, “Helmets save lives. Period.”\u003c/p\u003e\n\u003cp\u003eThe camera returned to the main announcers. Their on-air banter circled to rider standings on tour and current matchups with bulls for the final round. When the list of the fifteen riders scrolled on screen, Chase’s name wasn’t listed.\u003c/p\u003e\n\u003cp\u003e“What the hell? Why isn’t he riding?”\u003c/p\u003e\n\u003cp\u003eAs if they’d heard her question, the camera zoomed to the younger announcer. “After being off tour for two months, Chase McKay made a comeback with a vengeance the last two nights. So it’s a pity he won’t be riding in the final round this afternoon.”\u003c/p\u003e\n\u003cp\u003e“What!” Ava yelled at the TV.\u003c/p\u003e\n\u003cp\u003e“That is surprising, since he’s seated first,” the other announcer said. “Is his withdrawal due to a recurrence of his previous injury?”\u003c/p\u003e\n\u003cp\u003e“No. My understanding is he returned home for a family emergency. And we wish him, and his family, all the best.”\u003c/p\u003e\n\u003cp\u003eAva gasped. If that was true, why hadn’t he called? She fast-forwarded through the entire program but there wasn’t any other news.\u003c/p\u003e\n\u003cp\u003eSick with worry, she paced. She should just call Chase. Find out. She scrolled to his name and clicked. One ring. Two rings. Come on, cowboy, pick up. Six rings. Then it dumped her over to voicemail.\u003c/p\u003e\n\u003cp\u003eMaybe Chase was too busy dealing with family stuff to answer. Maybe he was dodging her calls. Dammit. She needed to talk to somebody who knew something.\u003c/p\u003e\n\u003cp\u003eGinger? No. Just in case the family emergency only affected Chase’s branch of the McKays.\u003c/p\u003e\n\u003cp\u003eBut Ava also knew Chase’s entire family watched the PBR, and if they weren’t aware there was a problem with Chase’s family, they’d know now.\u003c/p\u003e\n\u003cp\u003eMaybe the PBR had kicked Chase off for his diatribe and used his family as an excuse—they’d done it before with his injury story. Because really. Would Chase McKay give up his big comeback, his chance to win an event, especially riding in first place…to deal with family issues in Wyoming?\u003c/p\u003e\n\u003cp\u003eThe former bad boy Chase McKay might have blown off his family for eight seconds of glory, but the Chase McKay she knew had changed.\u003c/p\u003e\n\u003cp\u003eThat was it. She had to find out. She scrolled through her contact list. God, she needed to weed out about three quarters of these names. Bingo. She had saved his number. She hit Dial and returned to pacing until he answered. “It’s Ava.”\u003c/p\u003e\n\u003cp\u003eChase woke completely disoriented. He didn’t feel like warmed-over dog crap, so he hadn’t been drinking last night. He sat up and looked around. Right. He’d crashed in Ben’s spare bedroom.\u003c/p\u003e\n\u003cp\u003eHe squinted at the sun streaming through the window. Was it really late afternoon? He fumbled for his cell phone on the nightstand, only to remember he’d left it at his parents’ house. He stumbled into the kitchen.\u003c/p\u003e\n\u003cp\u003e“Glad you could join me at the crack of five in the afternoon,” Ben said slyly.\u003c/p\u003e\n\u003cp\u003e“Cut me some slack. I slept about two hours out of the forty-eight before I went comatose.”\u003c/p\u003e\n\u003cp\u003e“You’re in time to leave for supper at Mom and Dad’s with Gavin. Guess he’s leaving early in the morning.”\u003c/p\u003e\n\u003cp\u003eChase scratched his head. His hair needed a damn trim. He’d gotten so used to wearing it short, he wondered if he’d ever go back to longer hair. Especially remembering how good Ava’s hands felt on his scalp.\u003c/p\u003e\n\u003cp\u003eAva.\u003c/p\u003e\n\u003cp\u003eHe needed her. He loved her. He had to make this right with her. But he couldn’t do it from here.\u003c/p\u003e\n\u003cp\u003eNaturally when he found his cell phone it was completely dead.\u003c/p\u003e\n\u003cp\u003eSupper was strained. Adam and Amelia made mealtime entertaining, until they both started shrieking and Quinn and Libby took them home.\u003c/p\u003e\n\u003cp\u003eSaying goodbye to Gavin was awkward amidst half-assed promises of staying in touch, would any of them ever see him again?\u003c/p\u003e\n\u003cp\u003eBen sighed as they sat in his pickup in front of his house. “Look, don’t think I’m an asshole, but something came up and I’m gonna need you to stay somewhere else tonight.”\u003c/p\u003e\n\u003cp\u003eThat fucking blew. He’d looked forward to hanging with Ben. Playing pool. Picking his brain about how to handle the situation with Ava once he reached LA. “It’s more a douchebag move than an asshole move, kicking me to the curb at eight o’clock on a Sunday night.”\u003c/p\u003e\n\u003cp\u003e“I’d hope you’d do the same for me if a good woman was involved.”\u003c/p\u003e\n\u003cp\u003e“Probably. It’s for the best anyway. I’d planned on driving to Denver in the morning to catch a flight to LA, but if I leave now, I’ll get an earlier one.”\u003c/p\u003e\n\u003cp\u003e“You’re still dragging ass, Chase. Why don’t you head over to Kane’s old trailer, get some rest in the peace and quiet? You know you ain’t gonna get that at Quinn and Libby’s place. Without bein’ a dick, Mom and Dad don’t need you hanging around tonight.”\u003c/p\u003e\n\u003cp\u003eKane’s place. How hard would it be to stay where he’d met Ava and she wasn’t there? But it wasn’t like he had another choice. “Will you at least let me plug my phone in for five minutes so I can check my messages?”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eChase had quite a few missed calls, including one from Ava last night. No voice message. Dammit. He stopped at the call from HeadGame, a sports safety equipment manufacturer. They’d only called thirty minutes ago. Intrigued, he kept his phone plugged in as he called the number, expecting to get a recording. But a live person answered. “This is Chase McKay. I received a message from this number tonight.” He listened. “Yes, sir. That sounds fine. Actually, I’d planned to be in California tomorrow. Sure. I’ll call you in the next couple days after I figure out my schedule. The event in Salinas starts Friday. After blasting my opinion across VERSUS airwaves…I ain’t sure they’ll let me compete.” Chase laughed. “No idea. I’m putting off returning phone calls to my PBR rep until tomorrow. Good enough. Thanks. Talk to you soon.”\u003c/p\u003e\n\u003cp\u003e“What the devil was that about?” Ben asked.\u003c/p\u003e\n\u003cp\u003eChase unplugged the charger. “A company that specializes in sports helmets wants to meet with me about possibly becoming a spokesman. Which would be cool, since I’ve been thinking about putting my…celebrity, for lack of a better term, to good use. Advocate safety in bull ridin’. Some of the older riders ain’t ever gonna change. But if I can connect with the younger kids, the ones in high school, or even elementary kids who dream of ridin’ bulls, about the need for proper safety equipment, maybe I can save some kids lives. Save some parents from what Jackie Ackerman is going through.”\u003c/p\u003e\n\u003cp\u003e“That’s ambitious. And it’s great to see you—”\u003c/p\u003e\n\u003cp\u003e“Acting like a grown up?” Chase supplied with a grin.\u003c/p\u003e\n\u003cp\u003e“No, smartass. It’s great to see you believe in a cause enough to actually do something about it.”\u003c/p\u003e\n\u003cp\u003e“Thanks. I better scoot so your mysterious lady friend can come over under the cover of darkness.”\u003c/p\u003e\n\u003cp\u003eBen gave him a smug smile. “Don’t be a stranger, bro.”\u003c/p\u003e\n\u003cp\u003eHe said, “I won’t,” and meant it.\u003c/p\u003e\n\u003cp\u003eChase’s mind raced as he drove to Kane’s trailer. First he’d book his ticket online. No, first he’d call Ava. He wasn’t taking any chance there’d be miscommunication.\u003c/p\u003e\n\u003cp\u003eOnce he was inside the quiet trailer, he caught a whiff of flowers. But this time he didn’t attribute it to cleaning supplies. This time, he recognized the scent.\u003c/p\u003e\n\u003cp\u003eAva.\u003c/p\u003e\n\u003cp\u003eHis skeptical side warned about wishful thinking, while his optimistic side urged him to hurry the hell up.\u003c/p\u003e\n\u003cp\u003eChase threw open the bedroom door. There she was, standing on the bed. Just like before. Except this time she wasn’t nekkid. This time Ava didn’t look like she wanted to kick his ass.\u003c/p\u003e\n\u003cp\u003eShe looked like she wanted to kiss him.\u003c/p\u003e\n\u003cp\u003eHe hopped up on the bed and kissed her first. “My God, woman, tell me I’m not dreaming.”\u003c/p\u003e\n\u003cp\u003e“You’re not dreaming.”\u003c/p\u003e\n\u003cp\u003e“As much as I’m thanking my lucky stars…why are you here?”\u003c/p\u003e\n\u003cp\u003e“When I didn’t hear what constituted a family emergency that had you pulling out of an event you were winning, I called Ben last night. He told me you were here. So I hopped a plane in LA—not a word about me using the family jet—last night and drove over from Rapid City.”\u003c/p\u003e\n\u003cp\u003eHis wily brother hadn’t been expecting a lady friend after all. “I missed you like crazy.”\u003c/p\u003e\n\u003cp\u003eAva rested her forehead to Chase’s. “I missed you.” She tugged him down until they sat on the bed. “What happened with your family?”\u003c/p\u003e\n\u003cp\u003e“Short version? My teenage mom had a baby out of wedlock with my dad, and I have a brother no one knew anything about. He showed up out of the blue this weekend.”\u003c/p\u003e\n\u003cp\u003e“Wow. That’s TV-movie-of-the-week stuff. How’s your family taking it?”\u003c/p\u003e\n\u003cp\u003e“We’re in shock. This Gavin guy…my brother…he’s pretty tight-lipped.”\u003c/p\u003e\n\u003cp\u003e“So there is a family resemblance,” she teased.\u003c/p\u003e\n\u003cp\u003eChase smiled. “Maybe.” He kissed her knuckles. “Ava. I don’t even know where to start to make this right between us again.”\u003c/p\u003e\n\u003cp\u003e“Do you love me?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Let’s start there.” She inhaled deeply and let it out. “First let me say I’m so, so sorry I slapped you. There is no excuse for my behavior but it’ll never happen again. I swear.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-63.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
