{"id":73006,"no":32,"title":"Page 32","content":"\u003cp\u003eEthan stared at her without blinking. “Hold up. Long-lost twin? Like, for real?” He shook his head. “Start from the beginning.”\u003c/p\u003e\n\u003cp\u003eAnd then the whole story exploded from inside Emma, desperate to get out. “I tried to leave,” she explained when she got through explaining the SUTTON’S DEAD note. “I didn’t want to be stuck in her life. But her killer saw me at the bus station, I guess. And they cornered me in Charlotte’s house and said they’d kill me if I tried to leave again.” She shut her eyes, the feeling of the locket against her neck was as fresh and vivid as though it had happened just moments ago. “Sutton’s friends and her sister were the only people who knew I’d tried to leave. And Charlotte’s house is locked up like a fortress. It must have been someone who was already inside—one of Sutton’s friends. They tried to strangle me just like they strangled Sutton that night in the woods. The night they killed her.”\u003c/p\u003e\n\u003cp\u003eEthan shook his head vehemently. “I’m not saying her friends didn’t kill Sutton, but if they did, it wasn’t the night the video was made. That happened two weeks before you got here. And everyone left after I stopped it. Sutton included. She was fine.”\u003c/p\u003e\n\u003cp\u003e“She left with them?” Emma asked, shocked.\u003c/p\u003e\n\u003cp\u003eA conflicted look crossed Ethan’s face. “Sutton and her friends pull crap like that all the time.”\u003c/p\u003e\n\u003cp\u003e“I know.” Emma rubbed her temples. “I never realized they got that dangerous though.”\u003c/p\u003e\n\u003cp\u003eAll at once, it began to rain. The drops on the windshield sounded like tiny bombs going off. Emma looked at Ethan. “I have to get out of here.”\u003c/p\u003e\n\u003cp\u003eEthan frowned. “Where will you go?”\u003c/p\u003e\n\u003cp\u003e“Anywhere.” Fresh, terrified tears cascaded down Emma’s cheeks. “I’ll get on the first bus that comes along. I can’t stay. This is insane.”\u003c/p\u003e\n\u003cp\u003eEthan sat back in the seat, the leather making a crinkling noise. “Are you sure that’s a good idea?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003eHe turned toward her, biting hard on his thumb. “It’s just . . . you tried to leave once already, and that didn’t work out. Who’s to say this time will go any better?”\u003c/p\u003e\n\u003cp\u003e“But . . .” Emma stared frantically out the window at the tall cacti silhouettes. “It’s my only chance.”\u003c/p\u003e\n\u003cp\u003eThey were both silent for a moment. A police car whipped past on a road in the distance. Its blue and red lights punctuated the otherwise coal-black night. “But . . .” Ethan began, tentatively. “What if leaving is what the killer wants you to do?”\u003c/p\u003e\n\u003cp\u003e“No.” Emma crossed her arms over her chest. “The killer wants me to stay here and be her.”\u003c/p\u003e\n\u003cp\u003e“Hear me out. If Sutton’s really . . . dead, maybe whoever did this is trying to frame you for her murder. They know you’re a foster kid. They know your life was probably hard. It won’t be rocket science to prove. If you leave, everyone will know Sutton is missing. Don’t you think whoever did this will tip off the cops that you’ve been impersonating her for two weeks? And don’t you think you’ll be the person the cops will immediately suspect of killing Sutton?”\u003c/p\u003e\n\u003cp\u003eEmma let her hands fall limply to her lap. Would they?\u003c/p\u003e\n\u003cp\u003e“It’s just, Sutton had a really charmed life,” Ethan said quietly, gazing out the window at the crescent moon. “She’s popular, she’s well-off, she gets everything she wants. And from everything you’ve said . . . you’re not. While Sutton got a nice house in Scottsdale, you ended up in foster care. It’s seriously not fair, Emma. Lots of people in your position would do anything to switch places with their twin sister.”\u003c/p\u003e\n\u003cp\u003eEmma’s mouth fell open. “I’d never kill her!”\u003c/p\u003e\n\u003cp\u003eEthan waved his hands in surrender. “I know you wouldn’t. But . . . some people are awful. Some people automatically assume the worst. They might make judgments about you without looking into who you really are.”\u003c/p\u003e\n\u003cp\u003eEmma blinked. The walls of the car began to close in on her. She certainly knew about the awful people in this world making judgments. Look at Clarice—she’d assumed Emma had stolen her money over her thuggish son, simply because she thought that was what foster kids always did.\u003c/p\u003e\n\u003cp\u003e“Oh my God,” Emma whispered, covering her head with her arms. Ethan was right. He leaned in and, after a moment, pulled her into a hug. He squeezed hard and buried his head into the crook of her neck. Sobs shook Emma’s body.\u003c/p\u003e\n\u003cp\u003eI watched as they stayed that way for minutes, clinging to each other. I wished I was Emma so badly. I wanted to hug someone—maybe Ethan—right now, too.\u003c/p\u003e\n\u003cp\u003eThen Ethan sat back and gazed at Emma. His light eyes crinkled with concern. The corners of his pink, kissable lips arced up in a compassionate smile. He had a sooty splotch on his cheek that Emma wanted to reach out and wipe away. “God,” he whispered. “You look exactly like her.”\u003c/p\u003e\n\u003cp\u003e“That’s how it works with identical twins,” Emma said softly. Her mouth wobbled into a smile, but then a new sob rushed in.\u003c/p\u003e\n\u003cp\u003eEthan touched her chin. “Stay. If Sutton really was killed, we’ll find who did it.”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Emma murmured.\u003c/p\u003e\n\u003cp\u003e“You can’t let whoever did this get away with it,” Ethan insisted. “I’ll help you. I promise. And when we have proof, we can go back to the cops and they’ll have to believe you.”\u003c/p\u003e\n\u003cp\u003eThe rain abruptly stopped. Far in the distance, a coyote howled. Emma felt like she’d been holding her breath for hours.\u003c/p\u003e\n\u003cp\u003eShe gazed into Ethan’s endless blue eyes. “Okay,” she whispered. “I’ll stay.”\u003c/p\u003e\n\u003cp\u003e“Good.” Ethan leaned forward and squeezed her shoulder. Emma shut her eyes, the touch of his hands on her bare skin sending sparks down her back. She hoped this was the right decision. She hoped she hadn’t just made an enormous mistake.\u003c/p\u003e\n\u003cp\u003eI hoped so, too.\u003c/p\u003e\n\u003cp\u003eChapter 33\u003c/p\u003e\n\u003cp\u003eLOOK OUT, SUTTON’S BACK\u003c/p\u003e\n\u003cp\u003eA while later, Ethan dropped Emma off at the foot of Sutton’s driveway. Most of the lights in the house were still on, though all of the cars were gone. When Emma opened the door, Drake bounded over to her and licked her arm. The same fear didn’t paralyze her muscles anymore. She supposed she was getting used to him.\u003c/p\u003e\n\u003cp\u003e“There you are!” Laurel ran in from the living room and threw her arms around Emma’s neck. “We’ve been looking all over for you!” Then she stood back and looked Emma up and down. “Why did you run off like that? You took off from us like the driveway was on fire!”\u003c/p\u003e\n\u003cp\u003e“I just needed to be alone,” Emma admitted, hoping the lie she’d concocted in Ethan’s car sounded believable. “I—something weird happened with Garrett.”\u003c/p\u003e\n\u003cp\u003eLaurel’s eyes were saucers. “What?”\u003c/p\u003e\n\u003cp\u003eEmma sank into the love seat and hugged a pillow into her chest. “It’s a long story.” She stared at the credenza across the room. Someone had brought all of the birthday presents in from the patio. She wondered if Sutton’s room still looked like a honeymoon suite.\u003c/p\u003e\n\u003cp\u003e“Did you have fun tonight, otherwise?” Laurel asked. An apprehensive look crossed her face.\u003c/p\u003e\n\u003cp\u003eEmma looked away. “Oh yeah. Definitely,” she lied. Informative, yes. Terrifying, definitely. But fun? Not even close.\u003c/p\u003e\n\u003cp\u003e“You weren’t . . . mad about anything?” Laurel flicked the tassels on the pillow. “Charlotte said you might’ve gone into my room. And that you might’ve . . . seen something. And then you ran crazily from us in the driveway. . . .”\u003c/p\u003e\n\u003cp\u003eEmma leaned into the cushions. Even though she wanted to admit that she’d seen the video, even though she wanted to believe Laurel, Sutton’s sister, was innocent in all this, trusting her was dangerous.\u003c/p\u003e\n\u003cp\u003eEmma’s brain swirled with what she needed to do. According to Ethan, the snuff film had happened almost a month ago—not the day before Emma had arrived. That meant Sutton had been around for weeks after that video was made and before her death. For all Emma knew, the strangling incident, the snuff film, had blown over long ago. But what had happened in between?\u003c/p\u003e\n\u003cp\u003eEmma looked up and regarded Laurel coldly, her face drained of feeling. All at once she knew what she should do. “I did see something in your room,” she said in a monotone.\u003c/p\u003e\n\u003cp\u003eColor drained from Laurel’s face. “What?”\u003c/p\u003e\n\u003cp\u003eEmma rose to her feet and slowly advanced toward Laurel. Laurel gasped when Emma wrapped her hands around her neck. Her eyes bulged. “Sutton!” she whimpered.\u003c/p\u003e\n\u003cp\u003eEmma froze for a long moment, her hands lightly around Laurel’s throat. Then she pulled away, rolled her eyes, and smacked Sutton’s sister playfully on the cheek. “Gotcha, bitch.”\u003c/p\u003e\n\u003cp\u003eIt took a few seconds for relief to flood across Laurel’s face. She sat back in the chair and ran her hands over her throat. “You are so evil.”\u003c/p\u003e\n\u003cp\u003e“I know. But now we’re even.” Emma breezily returned to her seat. But her hands trembled as she moved a pillow out of the way. None of this was going to be easy. She was back to square one again—everyone was a suspect.\u003c/p\u003e\n\u003cp\u003e“There’s our birthday girl!” Mrs. Mercer’s voice rang out from the hall. She swept into the living room. Mr. Mercer followed with four cupcakes on a pink plate. A sparkler candle stuck out of the biggest one, which he positioned on the coffee table right in front of Emma. Red velvet. Her favorite.\u003c/p\u003e\n\u003cp\u003eMrs. Mercer perched on the ottoman, lifting her hands as though conducting an orchestra. “Ready, everyone?”\u003c/p\u003e\n\u003cp\u003eThey launched into a rousing version of “Happy Birthday,” Mr. Mercer trilling the high notes, Laurel singing loudly and strongly off-key. This was the first time this many people had sung “Happy Birthday” to Emma all at the same time.\u003c/p\u003e\n\u003cp\u003eWhen the song was over, Mrs. Mercer wrapped her arms around Emma’s shoulders. Mr. Mercer followed, then Laurel.\u003c/p\u003e\n\u003cp\u003e“Happy birthday, baby girl,” Mrs. Mercer said. “We love you.”\u003c/p\u003e\n\u003cp\u003e“Now make a wish,” Mr. Mercer instructed.\u003c/p\u003e\n\u003cp\u003eThe sparkler on the cupcake crackled and snapped. Emma leaned forward and closed her eyes. Her birthday wish had been the same ever since Becky vanished: for a family. And now, amazingly, backwardly, technically, it had finally come true. But there was something bigger Emma needed to wish for now, something that eclipsed all of that: to find who had murdered her twin sister, Sutton. Once and for all.\u003c/p\u003e\n\u003cp\u003eI leaned in close. That was what I wanted, too. Even dead girls deserved birthday wishes.\u003c/p\u003e\n\u003cp\u003eEmma repeated the wish once, twice, three times in her head and exhaled strongly, like she was blowing away all her past. The sparkler flickered and went out. Everyone applauded and Emma smiled.\u003c/p\u003e\n\u003cp\u003eAnd so did I. My sister had blown out the candle in one breath. That meant our wishes were definitely going to come true.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eI hung around my bedroom as she got ready to go to sleep that night, waiting, thinking. Staring at the items that used to be mine. Waiting for memories to come. They didn’t.\u003c/p\u003e\n\u003cp\u003eThe three flashbacks I’d been given back blazed through my head on a continuous loop: my friends’ cruel giggles. The necklace pulling at my throat. The desperate look in Ethan’s eyes as he waited for me to breathe again. But what had happened after that memory—and that video—ended? My friends might not have killed me that night, but someone got me later. It could have been Madeline or Charlotte or Laurel . . . but it also could have been someone else. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-lying-game-the-lying-game-1/page-32.html","bookId":2393,"creation":"Oct 5, 2019 10:26:33 AM","modification":"Oct 5, 2019 10:26:33 AM"}
