{"id":100318,"no":30,"title":"Page 30","content":"\u003cp\u003eRaised in Menzoberranzan, a male drow in the matriarchal city of Menzoberranzan, Tos\u0027un Armgo didn\u0027t as much as grimace when Drizzt tugged his arms back hard and secured the rope on the other side of the large tree. He was caught, with nowhere to run or hide. He glanced to the side - or tried to, for Drizzt had expertly looped the rope under his chin to secure him against the tree trunk - where Khazid\u0027hea rested, stabbed into a stone by Drizzt. He could feel the sword calling to him, but he couldn\u0027t reach out to it.\u003c/p\u003e\n\u003cp\u003eDrizzt studied Tos\u0027un as if he understood the silent pleas exchanged between drow and sentient sword - and likely, he did, Tos\u0027un realized.\u003c/p\u003e\n\u003cp\u003e\"You have nothing further to gain or lose,\" Drizzt said. \"Your day in the service of Obould is done.\"\u003c/p\u003e\n\u003cp\u003e\"I have not been in his service for many tendays,\" Tos\u0027un stubbornly argued. \"Not since before the winter. Not since that day you battled him, and even before that, truth be told.\"\u003c/p\u003e\n\u003cp\u003e\"Truth told by a son of House Barrison Del\u0027Armgo?\" Drizzt asked with a scoff.\u003c/p\u003e\n\u003cp\u003e\"I have nothing to gain or lose, just as you said.\"\u003c/p\u003e\n\u003cp\u003e\"A friend of mine, a dwarf named Bill, would speak with you about that,\" Drizzt said. \"Or whisper at you, I should say, for his throat was expertly cut to steal the depth of his voice.\"\u003c/p\u003e\n\u003cp\u003eTos\u0027un grimaced at that inescapable truth, for he had indeed cut a dwarf\u0027s throat in preparation for Obould\u0027s first assault on Mithral Hall\u0027s eastern door.\u003c/p\u003e\n\u003cp\u003e\"I have other friends who might have wished to speak with you, too,\" said Drizzt. \"But they are dead, in no small part because of your actions.\"\u003c/p\u003e\n\u003cp\u003e\"I was fighting a war,\" Tos\u0027un blurted. \"I did not understand - \"\u003c/p\u003e\n\u003cp\u003e\"How could you not understand the carnage to which you contributed? Is that truly your defense?\"\u003c/p\u003e\n\u003cp\u003eTos\u0027un shook his head, though it would hardly turn to either side.\u003c/p\u003e\n\u003cp\u003e\"I have learned,\" the captured drow added. \"I have tried to make amends. I have aided the elves.\"\u003c/p\u003e\n\u003cp\u003eDespite himself and his intentions that he would bring no harm to his prisoner, Drizzt slapped Tos\u0027un across the face. \"You led them to the elves,\" he accused.\u003c/p\u003e\n\u003cp\u003e\"No,\" said Tos\u0027un. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"I have heard the details of the raid.\"\u003c/p\u003e\n\u003cp\u003e\"Facilitated by Chieftain Grguch of Clan Karuck, and a trio of conspirators who seek to force Obould back to the road of conquest,\" said Tos\u0027un. \"There is more afoot here than you understand. Never did I side with those who attacked the Moonwood, and who have marched south, I am sure, with intent to strike at Mithral Hall.\"\u003c/p\u003e\n\u003cp\u003e\"Yet you just said that you were no ally of Obould,\" Drizzt reasoned.\u003c/p\u003e\n\u003cp\u003e\"Not of Obould, nor of any other orc,\" said Tos\u0027un. \"I admit my role, though it was a passive one, in the early stages, when Donnia Soldou, Ad\u0027non Kareese, and Kaer\u0027lic Suun Wett decided to foster an alliance between Obould and his orcs, Gerti Orelsdottr and her giants, and the two-headed troll named Proffit. I went along because I did not care - why would I care for dwarves, humans, and elves? I am drow!\"\u003c/p\u003e\n\u003cp\u003e\"A point I have never forgotten, I assure you.\"\u003c/p\u003e\n\u003cp\u003eThe threat took much of Tos\u0027un\u0027s bluster, but he pressed on anyway. \"The events surrounding me were not my concern.\"\u003c/p\u003e\n\u003cp\u003e\"Until Obould tried to kill you.\"\u003c/p\u003e\n\u003cp\u003e\"Until I was chased away by the murderous Obould, yes,\" said Tos\u0027un. \"And into the camp of Albondiel and Sinnafain of the Moonwood.\"\u003c/p\u003e\n\u003cp\u003e\"Whom you betrayed,\" Drizzt shouted in his face.\u003c/p\u003e\n\u003cp\u003e\"From whom I escaped, though I was not their captive,\" Tos\u0027un yelled back.\u003c/p\u003e\n\u003cp\u003e\"Then why did you run?\"\u003c/p\u003e\n\u003cp\u003e\"Because of you!\" Tos\u0027un cried. \"Because of that sword I carried, who knew that Drizzt Do\u0027Urden would never allow me to keep it, who knew that Drizzt Do\u0027Urden would find me among the elves and strike me down for possessing a sword that I had found abandoned in the bottom of a ravine.\"\u003c/p\u003e\n\u003cp\u003e\"That is not why, and you know it,\" said Drizzt, backing off just a step. \"\u0027Twas I who lost the sword, recall?\"\u003c/p\u003e\n\u003cp\u003eAs he spoke he glanced over at Khazid\u0027hea, and an idea came to him. He wanted to believe Tos\u0027un, as he had wanted to believe the female, Donnia, when he had captured her those months before.\u003c/p\u003e\n\u003cp\u003eHe looked back at Tos\u0027un, smiled wryly, and said, \"It is all opportunity, is it not?\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"You ally with Obould as he gains the upper hand. But he is held at bay, and you face his wrath. So you find your way to Sinnafain and Albondiel and the others and think to create new opportunities where your old ones have ended. Or to recreate the old ones, at the expense of your new \u0027friends.\u0027 Once you have gained their trust and learned their ways, you again have something to offer to the orcs, something that will perhaps bring Obould back to your side.\"\u003c/p\u003e\n\u003cp\u003e\"By helping Grguch? You do not understand.\"\u003c/p\u003e\n\u003cp\u003e\"But I shall,\" Drizzt promised, moving off to the side, toward Khazid\u0027hea. Without hesitation, he grabbed the sword by the hilt. Metal scraped and screeched as he withdrew the blade from the stone, but Drizzt didn\u0027t hear that, for Khazid\u0027hea already invaded his thoughts.\u003c/p\u003e\n\u003cp\u003eI had thought you lost to me.\u003c/p\u003e\n\u003cp\u003eBut Drizzt wasn\u0027t listening to any of that, had not the time for it. He forced his thoughts into the sword, demanding of Khazid\u0027hea a summary of its time in the hands of Tos\u0027un Armgo. He did not coddle the sword with promises that together they would find glory. He did not offer to the sword anything. He simply asked of it, Were you in the Moonwood? Have you tasted the blood of elves?\u003c/p\u003e\n\u003cp\u003eSweet blood... Khazid\u0027hea admitted, but with that thought came to Drizzt a sense of a time long past. And the sword had not been in the Moonwood. Of that much, the drow was almost immediately certain.\u003c/p\u003e\n\u003cp\u003eIn light of Khazid\u0027hea\u0027s open admission of its fondness for elf blood, Drizzt considered the unlikely scenario that Tos\u0027un could have been an integral part of the planning for that raid and yet still have remained on the western side of the Surbrin. Would Khazid\u0027hea have allowed that participation from afar, knowing that blood was to be spilled, and particularly since Khazid\u0027hea had been in Tos\u0027un\u0027s possession when he had been with the elves?\u003c/p\u003e\n\u003cp\u003eDrizzt glanced back at the captured drow and considered the relationship between Tos\u0027un and the sword. Had Tos\u0027un so dominated Khazid\u0027hea?\u003c/p\u003e\n\u003cp\u003eAs that very question filtered through Drizzt\u0027s thoughts, and thus was offered to the telepathic sword, Khazid\u0027hea\u0027s mocking response chimed in.\u003c/p\u003e\n\u003cp\u003eDrizzt put the sword down for a few moments to let it all sink in. When he retrieved the blade, he directed his questioning toward the newcomer.\u003c/p\u003e\n\u003cp\u003eGrguch, he imparted.\u003c/p\u003e\n\u003cp\u003eA fine warrior. Fierce and powerful.\u003c/p\u003e\n\u003cp\u003eA worthy wielder for Khazid\u0027hea? Drizzt asked.\u003c/p\u003e\n\u003cp\u003eThe sword didn\u0027t deny it.\u003c/p\u003e\n\u003cp\u003eMore worthy than Obould? Drizzt silently asked.\u003c/p\u003e\n\u003cp\u003eThe feeling that came back at him seemed not so favorably impressed. And yet, Drizzt knew that King Obould was as fine a warrior as any orc he had ever encountered, as fine as Drizzt himself, whom the sword had long coveted as a wielder. Though not of that elite class, Catti-brie, too, was a fine warrior, and yet Drizzt knew from his last experience with the sword that she had fallen out of Khazid\u0027hea\u0027s favor, as she opted to use her bow far too often for Khazid\u0027hea\u0027s ego.\u003c/p\u003e\n\u003cp\u003eA long time passed before Drizzt set the sword down once again, and he was left with the impression that the ever-bloodthirsty Khazid\u0027hea clearly favored Grguch over Obould, and just for the reasons that Tos\u0027un had said. Obould was not pressing for conquest and battle.\u003c/p\u003e\n\u003cp\u003eDrizzt looked at Tos\u0027un, who rested as comfortably as could be expected given his awkward position tied to the tree. Drizzt could not dismiss the plausibility of Tos\u0027un\u0027s claims, all of them, and perhaps, whether through heartfelt emotion or simple opportunity, Tos\u0027un was not now an enemy to him and his allies.\u003c/p\u003e\n\u003cp\u003eBut after his experiences with Donnia Soldou - indeed, after his experiences with his own race from the earliest moments of his conscious life, Drizzt Do\u0027Urden wasn\u0027t about to take that chance.\u003c/p\u003e\n\u003cp\u003eThe sun had long set, the dark night made murkier by a fog that curled up from the softening snow. Into that mist disappeared Bruenor, Hralien, Regis, Thibble dorf Pwent, Torgar Hammerstriker and Shingles McRuff of Mirabar, and Cordio the priest.\u003c/p\u003e\n\u003cp\u003eOn the other side of the ridgeline, behind the wall where Bruenor\u0027s dwarves and Alustriel\u0027s wizards worked vigilantly, Catti-brie watched the receding group with a heavy heart.\u003c/p\u003e\n\u003cp\u003e\"I should be going with them,\" she said.\u003c/p\u003e\n\u003cp\u003e\"You cannot,\" said her companion, Lady Alustriel of Silverymoon. The tall woman moved nearer to Catti-brie and put her arm around the woman\u0027s shoulders. \"Your leg will heal.\"\u003c/p\u003e\n\u003cp\u003eCatti-brie looked up at her, for Alustriel was nearly half a foot taller than she.\u003c/p\u003e\n\u003cp\u003e\"Perhaps this is a sign that you should consider my offer,\" Alustriel said.\u003c/p\u003e\n\u003cp\u003e\"To train in wizardry? Am I not too old to begin such an endeavor?\"\u003c/p\u003e\n\u003cp\u003eAlustriel laughed dismissively at the absurd question. \"You will take to it naturally, even though you were raised by the magically inept dwarves.\"\u003c/p\u003e\n\u003cp\u003eCatti-brie considered her words for a moment, but soon turned her attention to the view beyond the wall, where the fog had swallowed her father and friends. \"I had thought that you would walk beside my father, as he bade,\" she said, and glanced over at the Lady of Silverymoon.\u003c/p\u003e\n\u003cp\u003e\"As you could not, neither could I,\" Alustriel replied. \"My position prevented me from it as fully as did your wounded leg.\"\u003c/p\u003e\n\u003cp\u003e\"You do not agree with Bruenor\u0027s goal? You would side with Obould?\"\u003c/p\u003e\n\u003cp\u003e\"Surely not,\" said Alustriel. \"But it is not my place to interject Silverymoon in a war.\"\u003c/p\u003e\n\u003cp\u003e\"You did exactly that when you and your Knights in Silver rescued the wandering Nesmians.\"\u003c/p\u003e\n\u003cp\u003e\"Our treaties with Nesme demanded no less,\" Alustriel explained. \"They were under attack and running for their lives. Small friends we would be if we did not come to them in their time of need.\"\u003c/p\u003e\n\u003cp\u003e\"Bruenor sees it just that way right now,\" said Catti-brie.\u003c/p\u003e\n\u003cp\u003e\"Indeed he does,\" Alustriel admitted.\u003c/p\u003e\n\u003cp\u003e\"So he plans to eradicate the threat. To decapitate the orc army and send them scattering.\"\u003c/p\u003e\n\u003cp\u003e\"And I hope and pray that he succeeds. To have the orcs gone is a goal agreed upon by all the folk of the Silver Marches, of course. But it is not my place to bring Silverymoon into this provocative attack. My council has determined that our posture is to remain defensive, and I am bound to abide by their edicts.\"\u003c/p\u003e\n\u003cp\u003eCatti-brie shook her head and did not hide her disgusted look. \"You act as if we are in a time of peace, and Bruenor is breaking that peace,\" she said. \"Does a needed pause in the war because of the winter\u0027s snows cancel what has gone before?\"\u003c/p\u003e\n\u003cp\u003eAlustriel hugged the angry woman a bit tighter. \"It is not the way any of us wish it to be,\" she said. \"But the council of Silverymoon has determined that Obould has stopped his march, and we must accept that.\"\u003c/p\u003e\n\u003cp\u003e\"Mithral Hall was just attacked,\" Catti-brie reminded. \"Are we to sit back and let them strike at us again and again?\"\u003c/p\u003e\n\u003cp\u003eAlustriel\u0027s pause showed that she had no answer for that. \"I cannot go after Obould now,\" she said. \"In my role as leader of Silverymoon, I am bound by the decisions of the council. I wish Bruenor well. I hope with all my heart and soul that he succeeds and that the orcs are chased back to their holes.\"\u003c/p\u003e\n\u003cp\u003eCatti-brie calmed, more from the sincerity and regret in Alustriel\u0027s tone than from her actual words. Alustriel had helped, despite her refusal to go along, for she had given to Bruenor a locket enchanted to lead the dwarf toward Drizzt, an identical locket to the one she had given to Catti-brie many years before when she, too, had gone off to find a wandering Drizzt.\u003c/p\u003e\n\u003cp\u003e\"I hope that Bruenor is correct in his guess,\" Alustriel went on, trepidation in her voice. \"I hope that killing Obould will bring the results he desires.\"\u003c/p\u003e\n\u003cp\u003eCatti-brie didn\u0027t reply, but just stood there and absorbed the words. She couldn\u0027t bring herself to believe that Obould, who had started the war, might actually have become a stabilizing force, and yet she could not deny her doubts.\u003c/p\u003e\n\u003cp\u003eThe two orcs stood under a widespread maple, the sharp, stark lines of its branches not yet softened by the onset of buds. They talked and chuckled at their own stupidity, for they were completely lost, and far separated from their kin at the small village. A wrong turn on a trail in the dark of night had put them far afield, and they had long ago abandoned the firewood they had come out to collect.\u003c/p\u003e\n\u003cp\u003eOne lamented that his wife would beat him red, to warm him up so he could replace the fire that wouldn\u0027t last half the night.\u003c/p\u003e\n\u003cp\u003eThe other laughed and his smile lingered long after his mirth was stolen by an elven arrow, one that neatly sliced into his companion\u0027s temple. Standing in confusion, grinning simply because he hadn\u0027t the presence of mind to remove his own smile, the orc didn\u0027t even register the sudden thump of heavy boots closing in fast from behind him. He was caught completely unawares as the sharp tip of a helmet spike drove into his spine, tearing through muscle and bone, and blasted out the front of his chest, covered in blood and pieces of his torn heart.\u003c/p\u003e\n\u003cp\u003eHe was dead before Thibble dorf Pwent straightened, lifting the orc\u0027s flopping body atop his head. The dwarf hopped around, looking for more enemies. He saw Bruenor and Cordio scrambling in the shadows south of the maple, and noted Torgar and Shingles farther to the east. With Hralien in the northwest, and Regis following in the shadows behind Pwent, the group soon surmised that the pair had been out alone.\u003c/p\u003e\n\u003cp\u003e\"Good enough, then,\" said Bruenor, nodding his approval. He held up the locket Alustriel had given him. \"Warmer,\" he explained. \"Drizzt is nearby.\"\u003c/p\u003e\n\u003cp\u003e\"Still north?\" Hralien asked, coming in under the maple to stand beside Bruenor.\u003c/p\u003e\n\u003cp\u003e\"Back from where ye just walked,\" Bruenor confirmed, holding forth his fist, which held the locket. \"And getting warmer by the step.\"\u003c/p\u003e\n\u003cp\u003eA curious expression showed on Bruenor\u0027s face. \"And getting warmer as we\u0027re standin\u0027 here,\" he explained to the curious glances that came his way.\u003c/p\u003e\n\u003cp\u003e\"Drizzt!\" Regis cried an instant later.\u003c/p\u003e\n\u003cp\u003eFollowing the halfling\u0027s pointing finger, the others spied a pair of dark elves coming toward them, with Tos\u0027un bound and walking before their friend.\u003c/p\u003e\n\u003cp\u003e\"Taked ye long enough to find him, eh?\" Thibble dorf Pwent said with a snort. He bent and slapped his leg for effect, which sent the dead orc flopping weirdly.\u003c/p\u003e\n\u003cp\u003eDrizzt stared at the bloody dwarf, at the cargo he carried on his helmet spike. Realizing that there was simply nothing he might say against the absurdity of that image, he just prodded Tos\u0027un on, moving to the main group.\u003c/p\u003e\n\u003cp\u003e\"They hit the wall east of Mithral Hall,\" Hralien explained to Drizzt. \"As you had feared.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, but know that we sent them running,\" Bruenor added.\u003c/p\u003e\n\u003cp\u003eDrizzt\u0027s confused expression didn\u0027t change as he scanned the group.\u003c/p\u003e\n\u003cp\u003e\"And now we\u0027re out for Obould,\" Bruenor explained. \"I\u0027m knowing ye were right, elf. We got to kill Obould and break it all apart, as ye thought afore when ye went after him with me girl\u0027s sword.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re out for him?\" Drizzt asked doubtfully, looking past the small group. \"You\u0027ve brought no army, my friend.\"\u003c/p\u003e\n\u003cp\u003e\"Bah, an army\u0027d just muddle it all,\" Bruenor said with a wave of his hand.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t hard for Drizzt to catch the gist of that, and in considering it for a moment, in considering Bruenor\u0027s leadership methodology, he realized that he should not be the least bit surprised.\u003c/p\u003e\n\u003cp\u003e\"We wish to get to Obould, and it seems that we have a captive who might aid in exactly that,\" Hralien remarked, stepping up before Tos\u0027un.\u003c/p\u003e\n\u003cp\u003e\"I have no idea where he is,\" Tos\u0027un said in his still-stinted command of the Elvish tongue.\u003c/p\u003e\n\u003cp\u003e\"You would have to say that,\" said Hralien.\u003c/p\u003e\n\u003cp\u003e\"I helped you...your people,\" Tos\u0027un protested. \"Grguch had them caught in the failed raid and I showed them the tunnel that took them to safety.\"\u003c/p\u003e\n\u003cp\u003e\"True,\" Hralien replied. \"But then, isn\u0027t that what a drow would do? To gain our trust, I mean?\"\u003c/p\u003e\n\u003cp\u003eTos\u0027un\u0027s shoulders sagged and he lowered his eyes, for he had just fought that same battle with Drizzt, and there seemed no way for him to escape it. Everything he had done leading up to that point could be interpreted as self-serving, and for the benefit of a larger and more nefarious plot.\u003c/p\u003e\n\u003cp\u003e\"Ye should\u0027ve just killed him and been done with it,\" Bruenor said to Drizzt. \"If he\u0027s not for helping us then he\u0027s just slowing us down.\"\u003c/p\u003e\n\u003cp\u003e\"Meself\u0027ll be there for the task in a heartbeat, me king!\" Pwent shouted from the side, and all eyes turned to see the dwarf, bent low with head forward, backing through the narrow opening between a pair of trees. Pwent set the back of the dead orc\u0027s thighs against one trunk, the poor creature\u0027s shoulder blades against another, and with a sudden burst, the dwarf tugged backward. Bones and gristle popped and ground as the barbed spike tore back through, freeing the dwarf of his dead-weight burden.\u003c/p\u003e\n\u003cp\u003ePwent stumbled backward and fell to his rump, but hopped right back to his feet and bounced around to face the others, shaking his head so vigorously that his lips flapped. Then, with a smile, Pwent brought his hands up before him, palms facing out, extended thumbs touching tip-to-tip, lining up his charge.\u003c/p\u003e\n\u003cp\u003e\"Turn the dark-skinned dog just a bit,\" he instructed.\u003c/p\u003e\n\u003cp\u003e\"Not just yet, good dwarf,\" Drizzt said, and Pwent straightened, disappointment clear on his face.\u003c/p\u003e\n\u003cp\u003e\"Ye thinkin\u0027 to take him along?\" Bruenor asked, and Drizzt nodded.\u003c/p\u003e\n\u003cp\u003e\"We could divert our course to the Moonwood, or back to Mithral Hall,\" Hralien offered. \"We would lose no more than a day or so, and would be rid of our burden.\"\u003c/p\u003e\n\u003cp\u003eBut Drizzt shook his head.\u003c/p\u003e\n\u003cp\u003e\"Easier just to kill him,\" said Bruenor, and to the side, Pwent began scraping his feet across the ground like a bull readying for a charge.\u003c/p\u003e\n\u003cp\u003e\"But not wiser,\" Drizzt said. \"If Tos\u0027un\u0027s claims are true, he might prove to be a valuable asset to us. If not, we have lost nothing because we have risked nothing.\" He looked to his fellow drow. \"If you do not deceive us, on my word I will let you leave when we are done.\"\u003c/p\u003e\n\u003cp\u003e\"You cannot do this,\" said Hralien, drawing all eyes his way. \"If he has committed crimes against the Moonwood, his fate is not yours alone to decide.\"\u003c/p\u003e\n\u003cp\u003e\"He has not,\" Drizzt assured the elf. \"He was not there, for Khazid\u0027hea was not there.\"\u003c/p\u003e\n\u003cp\u003eBruenor yanked Drizzt aside, pulling him away from the others. \"How much o\u0027 this is yer way o\u0027 hoping for a drow akin to yerself?\" the dwarf asked bluntly.\u003c/p\u003e\n\u003cp\u003eDrizzt shook his head, with sincerity and certainty. \"On my word, Bruenor, this I do because I think it best for us and our cause - whatever that cause may be.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that meaning?\" the dwarf demanded. \"We\u0027re for killing Obould, don\u0027t ye doubt!\" He raised his voice with the proclamation, and the others all looked his way.\u003c/p\u003e\n\u003cp\u003eDrizzt didn\u0027t argue. \"Obould would kill Tos\u0027un if given the chance, as Obould murdered Tos\u0027un\u0027s companion. We will gamble nothing with Tos\u0027un, I promise you, my friend, and the possibility of gain cannot be ignored.\"\u003c/p\u003e\n\u003cp\u003eBruenor looked long and hard at Drizzt then glanced back at Tos\u0027un, who stood calmly, as if resigned to his fate - whatever that fate may be.\u003c/p\u003e\n\u003cp\u003e\"On my word,\" Drizzt said.\u003c/p\u003e\n\u003cp\u003e\"Yer word\u0027s always been good enough, elf,\" said Bruenor. He turned and started back for the others, calling to Torgar and Shingles as he went. \"Think yerselves are up to guardin\u0027 a drow?\" he asked, or started to, for as soon as his intent became clear, Drizzt interrupted him.\u003c/p\u003e\n\u003cp\u003e\"Let Tos\u0027un remain my responsibility,\" he said.\u003c/p\u003e\n\u003cp\u003eAgain Bruenor granted Drizzt his wish. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-orc-king-transitions-1/page-30.html","bookId":2187,"creation":"Oct 5, 2019 6:52:14 PM","modification":"Oct 5, 2019 6:52:14 PM"}
