{"id":89600,"no":12,"title":"Page 12","content":"\u003cp\u003eI opened the evidence room door and let out a yelp. Mandenauer stood on the threshold, emaciated arm raised to knock.\u003c/p\u003e\n\u003cp\u003e\"Ah, Officer, good evening.\"\u003c/p\u003e\n\u003cp\u003eHis good sounded like goot, and he drew out the word evening like a bad Dracula imitation. I would have laughed, if I hadn\u0027t been close to crying.\u003c/p\u003e\n\u003cp\u003eI stepped into the hall and slammed the door behind me. There\u0027d already been one too many people in the evidence room in the past twenty-four hours.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here? This area is off-limits to civilians.\"\u003c/p\u003e\n\u003cp\u003e\"I am not a civilian. The sheriff has given me temporary clearance.\"\u003c/p\u003e\n\u003cp\u003e\"You have a key?\"\u003c/p\u003e\n\u003cp\u003e\"Certainly.\"\u003c/p\u003e\n\u003cp\u003e\"Have you been in this room?\"\u003c/p\u003e\n\u003cp\u003eHe glanced at the door, his gaze flicked over the word evidence, and he shook his head. \"No need.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t believe him. That was going around.\u003c/p\u003e\n\u003cp\u003e\"What did you want to see me about?\"\u003c/p\u003e\n\u003cp\u003e\"Do you have your rifle?\"\u003c/p\u003e\n\u003cp\u003e\"Rifle? What the hell for?\"\u003c/p\u003e\n\u003cp\u003e\"Tonight we hunt.\"\u003c/p\u003e\n\u003cp\u003eI had been heading for the front office to receive my assignment from Zee. I stopped and turned very slowly. \"I\u0027m assigned to you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Why? Don\u0027t guys like you work alone?\"\u003c/p\u003e\n\u003cp\u003eHis lips twitched. \"I am not a cowboy.\"\u003c/p\u003e\n\u003cp\u003eI looked him over from the tip of his head -\u0026nbsp;\u0026nbsp;white blond hair now covered with a black skullcap -\u0026nbsp;\u0026nbsp;past his camouflage jumpsuit, to the toes of his black commando boots. \"No shit.\"\u003c/p\u003e\n\u003cp\u003eHe ignored me. The man was catching on.\u003c/p\u003e\n\u003cp\u003e\"Get a rifle. Follow me.\"\u003c/p\u003e\n\u003cp\u003e\"Shouldn\u0027t you be following me? I know these woods.\"\u003c/p\u003e\n\u003cp\u003e\"But I know wolves. Especially wolves like these. I will teach you things you never thought to learn.\"\u003c/p\u003e\n\u003cp\u003eThere was something cryptic in that statement, but my mind was still fuddled with sex and the mystery of the missing plastic.\u003c/p\u003e\n\u003cp\u003e\"Clyde\u0027s okay with this?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"It was Clyde\u0027s idea.\"\u003c/p\u003e\n\u003cp\u003eI frowned. Why hadn\u0027t Clyde told me?\u003c/p\u003e\n\u003cp\u003eI moved down the back hall to the weapons room and Mandenauer followed me. The rifle I\u0027d been assigned for use in tactical situations had never been out of the case. There weren\u0027t a helluva lot of tactical situations in Miniwa. Until lately anyway.\u003c/p\u003e\n\u003cp\u003eFor long-range shooting I preferred my own rifle, but since no one had seen fit to tell me of my change in status from Three Adam One to Mandenauer\u0027s backup, my rifle was home in the gun safe. I\u0027d have to make do with city-issue.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s so special about these wolves, besides what you already told me?\" I pulled out my gun and checked it over. \"They\u0027re overly aggressive, extremely violent, fearless.\"\u003c/p\u003e\n\u003cp\u003e\"And smart.\" I glanced at him and he shrugged. \"The virus appears to increase their brainpower.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got to be kidding me.\"\u003c/p\u003e\n\u003cp\u003e\"I do not kid.\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t surprised. After pulling out a box of ammo, I relocked the gun cabinet. \"So we\u0027ve got super-pissed-off wolves that are also very smart.\" My gaze met his. \"How smart?\"\u003c/p\u003e\n\u003cp\u003eSomething flickered in the depths of his eerily light eyes. Not fear but close.\u003c/p\u003e\n\u003cp\u003e\"How smart, Mandenauer? What are we dealing with here?\"\u003c/p\u003e\n\u003cp\u003eHe sighed and glanced away. \"Human-level intelligence.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t seem to find my voice, a novelty for me. When I did, all I could manage was, \"That\u0027s... That\u0027s... \"\u003c/p\u003e\n\u003cp\u003eWhat I meant to say was \"impossible.\" Mandenauer filled in another word entirely. \"Hazardous. I know. I\u0027ve seen them formulate a plan, work together, and destroy those who try to destroy them. It\u0027s -\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"Creepy.\"\u003c/p\u003e\n\u003cp\u003eHe raised a brow. \"I was going to say \u0027 fascinating.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"You would,\" I muttered.\u003c/p\u003e\n\u003cp\u003e\"Shall we go?\"\u003c/p\u003e\n\u003cp\u003e\"Shouldn\u0027t we have a plan of our own?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I do, Officer. I do.\"\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Come with me and you\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003eI really didn\u0027t like the sound of that.\u003c/p\u003e\n\u003cp\u003eAn hour later, I didn\u0027t like the looks of the plan, either. We were deep in the forest, high up in a tree.\u003c/p\u003e\n\u003cp\u003eNot that I hadn\u0027t been in trees before; I\u0027d just never liked it much. I preferred to hunt on the ground.\u003c/p\u003e\n\u003cp\u003eMandenauer had vetoed that idea immediately.\u003c/p\u003e\n\u003cp\u003e\"One thing these wolves cannot do, yet, is fly. The only place we are safe is in the sky.\"\u003c/p\u003e\n\u003cp\u003eThere was one word in that statement that bugged me quite a bit. I wasn\u0027t going to let it pass. \"Yet?\" I repeated.\u003c/p\u003e\n\u003cp\u003eMandenauer had spent the day scouting the woods and found a tree stand big enough for two, which he\u0027d confiscated for our use. Since it was June, no one would care. Hunting season was still three months away.\u003c/p\u003e\n\u003cp\u003e\"The virus evolves,\" he murmured. \"It is very upsetting.\"\u003c/p\u003e\n\u003cp\u003e\"Upsetting? Do the Centers for Disease Control know about this mutating virus? How about the president?\"\u003c/p\u003e\n\u003cp\u003e\"Everyone who needs to know does.\"\u003c/p\u003e\n\u003cp\u003eYeah, right. Perhaps I\u0027d make a little call to the CDC in the morning.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t we need bait?\" I asked. \"A sheep or something?\"\u003c/p\u003e\n\u003cp\u003e\"No. They will come. It is only a matter of time.\"\u003c/p\u003e\n\u003cp\u003eThe light dawned. \"We\u0027re the bait.\"\u003c/p\u003e\n\u003cp\u003eMandenauer didn\u0027t answer, which was answer enough.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like this.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have a better idea, Jessie?\"\u003c/p\u003e\n\u003cp\u003e\"We could go searching for them in the daylight, when they\u0027re sleeping.\"\u003c/p\u003e\n\u003cp\u003e\"These animals disappear in the daylight.\"\u003c/p\u003e\n\u003cp\u003e\"Poof! Shazam! They\u0027re invisible?\"\u003c/p\u003e\n\u003cp\u003e\"Hardly, Officer. But believe me, it is easier to pick them off one by one in the night than waste days trying to find an animal that isn\u0027t there.\"\u003c/p\u003e\n\u003cp\u003eIsn\u0027t there? The guy didn\u0027t make any sense. But he was right about one thing -\u0026nbsp;\u0026nbsp;he knew more than me about these wolves -\u0026nbsp;\u0026nbsp;so I\u0027d let him be the leader. For now.\u003c/p\u003e\n\u003cp\u003eThe moon was headed toward full and shiny bright. The night had a nip. Warm evenings would not come to the north woods for at least a few weeks.\u003c/p\u003e\n\u003cp\u003eI wanted to ask Mandenauer a hundred things. Where had he seen wolves like these before? Had he been able to wipe them out before they did serious harm? Where was he from? Were there others like him?\u003c/p\u003e\n\u003cp\u003eBut he put his finger to his lips, then pointed to the silver-tinged forest. We had to be quiet. Wolves could hear for miles, and these could probably hear for hundreds of miles.\u003c/p\u003e\n\u003cp\u003eI settled in to wait, something I was very good at. Though patience might seem against my nature, patience was needed to hunt, and I\u0027d been hunting over half of my life.\u003c/p\u003e\n\u003cp\u003eI\u0027d gone along at first to be one of the guys. I\u0027d continued to hunt, year after year, because I was good at it -\u0026nbsp;\u0026nbsp;and I\u0027d been good at precious little as a teen. I certainly had no talent for being a girl and therefore none for pleasing my mother. But I could sit in a tree and wait, then wait some more.\u003c/p\u003e\n\u003cp\u003eAn hour passed, then another. Mandenauer was good at waiting, too. He didn\u0027t move; he barely breathed. A couple of times I had to fight the urge to reach over and make sure he hadn\u0027t died in that tree. Only the intermittent blinking of his eyes signaled he was alive and awake.\u003c/p\u003e\n\u003cp\u003eAround 1:00 a.m. a solitary howl split the night. It was answered by several more. Our gazes met. We sat up straighter and slid our rifles into position.\u003c/p\u003e\n\u003cp\u003eI heard them first -\u0026nbsp;\u0026nbsp;a rustle to the right slinking closer, one to the left, another behind, then in front. They were approaching from every direction. Even though I was high in the sky, I was uneasy.\u003c/p\u003e\n\u003cp\u003eMy ringer twitched on the trigger. Mandenauer cut a quick glance my way and frowned. He held up his free hand in a staying gesture. I scowled back. I knew what I was doing. I wouldn\u0027t fire until I had a clear shot.\u003c/p\u003e\n\u003cp\u003eWhen I returned my gaze to the clearing, a black wolf had appeared. He paused, half in and half out of cover, scanning the area in a wary manner.\u003c/p\u003e\n\u003cp\u003eThe thing was huge -\u0026nbsp;\u0026nbsp;much bigger than any wolf I\u0027d ever seen. The average Wisconsin timber wolf runs about 80 pounds. I\u0027d read they could weigh close to 120 in Alaska. This one had to be even larger than that.\u003c/p\u003e\n\u003cp\u003eNone of the other wolves showed themselves, but I could feel them all around us, waiting for the leader\u0027\u003c/p\u003e\n\u003cp\u003eThe wolf took one step forward, and the bushes flipped closed behind him. His entire body shone blue-black beneath the light of the moon. God, he was beautiful.\u003c/p\u003e\n\u003cp\u003eMy finger hesitated on the trigger. How was I supposed to know which wolves had super-rabies and which ones did not? That would have been a good question for Mandenauer.\u003c/p\u003e\n\u003cp\u003eWe weren\u0027t supposed to shoot every wolf we saw. Or were we? DNR policy on Chronic Wasting Disease was to kill as many deer as possible. Maybe the DNR had the same rules for super-rabies.\u003c/p\u003e\n\u003cp\u003eSuddenly the ruff at his neck rose, and a low growl vibrated from his throat. His head snapped upward and his eyes met mine.\u003c/p\u003e\n\u003cp\u003e\"Shit!\"\u003c/p\u003e\n\u003cp\u003eThe word burst from my mouth as my finger clenched on the trigger. The resulting explosion was so loud my ears rang.\u003c/p\u003e\n\u003cp\u003eThe wolf leaped into the air, twisted, fell. I experienced a momentary pang to have shot something so gorgeous. But at least I knew now how to tell if the animal was infected.\u003c/p\u003e\n\u003cp\u003eThe wolf\u0027s eyes had been human. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-12.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
