{"id":89602,"no":14,"title":"Page 14","content":"\u003cp\u003e\"Cadotte,\" she said. \"William Cadotte.\"\u003c/p\u003e\n\u003cp\u003eOne thing I did not need today was a face-to-face encounter with the man who\u0027d had his tongue in my mouth last night.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take the domestic,\" I offered, which only proved how desperate I was.\u003c/p\u003e\n\u003cp\u003eDomestic disturbances were the most dangerous calls. You never knew what you were going to run into when love turned to hate. Besides, I\u0027d never been very good at dealing with family squabbles, never having had one of my own.\u003c/p\u003e\n\u003cp\u003eThe dispatcher shook her head, destroying my hopes. \"One Adam Three is already there. One Adam One and Two are en route to the accident. Which leaves you.\"\u003c/p\u003e\n\u003cp\u003eI gave up. Sometimes fate was a malicious bitch.\u003c/p\u003e\n\u003cp\u003eSurrendering any delusion that I might get to sleep soon, I grabbed coffee at the Gas n\u0027 Go, then snagged a doughnut, too.\u003c/p\u003e\n\u003cp\u003eThe route to the university was becoming familiar, as was the route to Cadotte\u0027s cubbyhole of an office.\u003c/p\u003e\n\u003cp\u003eStudents, teachers, security milled aimlessly in the hall. There was no sign of the man himself.\u003c/p\u003e\n\u003cp\u003eThe crowd parted for me like the proverbial Red Sea.\u003c/p\u003e\n\u003cp\u003eHowever, I wasn\u0027t feeling much like Moses. The land of milk and honey was my apartment, and it felt farther away right now than Egypt.\u003c/p\u003e\n\u003cp\u003eI likened myself to Pharaoh\u0027s soldiers. If I went through these people and into the belly of the sea, I was going to drown, but I had to go. Orders were orders and duty just that, as much now as they had been countless centuries before.\u003c/p\u003e\n\u003cp\u003eI paused on the threshold of the office. Cadotte sat at his desk, his forehead in his hands. Several colleagues hovered around, trying not to disturb the mess.\u003c/p\u003e\n\u003cp\u003eCadotte glanced up, almost as if he\u0027d sensed me there. Our gazes met. The air between us sizzled. I was in way over my head with William Cadotte.\u003c/p\u003e\n\u003cp\u003e\"Jessie,\" he whispered, and stood.\u003c/p\u003e\n\u003cp\u003eIf I hadn\u0027t come here before, I might have thought he was just a pig or a spacey egghead who had better things to do than clean. But I had come, and while the place had been full of stuff, the stuff had been in neat piles. Now it was spread to hell and gone in every corner and all across the floor.\u003c/p\u003e\n\u003cp\u003e\"Everyone out,\" I ordered.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t stop staring at Cadotte. Though he appeared as exhausted as I was, he was still something to see. His hair stood on end, as if he\u0027d run agitated fingers through the strands over and over again. His glasses were hooked in the pocket of his shirt, so I could see his dark eyes flare hot in an unusually pale face. He was pissed, and I couldn\u0027t say that I blamed him.\u003c/p\u003e\n\u003cp\u003eI\u0027d been burglarized once. I still remembered how it had felt to know some stranger had invaded my place, touched my things, perhaps seen something private. I\u0027d lost money, my CD player, but more important, I\u0027d lost my sense of security for a long, long time.\u003c/p\u003e\n\u003cp\u003eThe door closed and we were alone. \"What happened?\" 1 asked.\u003c/p\u003e\n\u003cp\u003e\"I already went over this with Security.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027ll get that information. I want you to tell me.\"\u003c/p\u003e\n\u003cp\u003eHe sat on the edge of the desk and I was reminded of how easily he moved -\u0026nbsp;\u0026nbsp;at home in his skin, confident with his body -\u0026nbsp;\u0026nbsp;he\u0027d be attractive for the way he held himself alone. The handsome face, rippling muscles, and great big... brain were all gravy.\u003c/p\u003e\n\u003cp\u003e\"I came in to work early this morning,\" he began.\u003c/p\u003e\n\u003cp\u003eI wanted to ask why, but I knew better. When taking a statement it was best to let the person tell you everything without interruptions first. You didn\u0027t want them to forget something important because they were distracted. The second time through was the time for questions.\u003c/p\u003e\n\u003cp\u003e\"My door was ajar. I figured the cleaning crew was running late. I walked right in.\" He gave an annoyed grunt. \"Sorry, I touched the doorknob.\"\u003c/p\u003e\n\u003cp\u003eI shrugged and made a circular motion with my finger indicating he should keep rolling. People would be amazed to know -\u0026nbsp;\u0026nbsp;despite countless hours of NYPD Blue -\u0026nbsp;\u0026nbsp;how many times evidence was fucked long before we got there.\u003c/p\u003e\n\u003cp\u003e\"The place was like this.\" He spread his hands to indicate the mess. \"I called nine-one-one, then Security.\u003c/p\u003e\n\u003cp\u003eSomeone was searching for something.\"\u003c/p\u003e\n\u003cp\u003eSince he appeared to be done with his story, I asked, \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Do you still have the totem?\"\u003c/p\u003e\n\u003cp\u003eI started, frowned, forced my hand to stay at my side and not creep to my pocket to check. I could feel the talisman there, sharp against my upper thigh. If Cadotte had been looking, he\u0027d have been able to see it, too, although the small piece of stone could easily be mis-taken for a key or any other paraphernalia of the pocket.\u003c/p\u003e\n\u003cp\u003e\"Not on me,\" I lied. Then, \"You think someone was after the totem, so they trashed your office?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing was taken. I checked.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps you gave a student one too many zeros.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t give zeros.\"\u003c/p\u003e\n\u003cp\u003e\"Too many Fs then.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t give those, either.\"\u003c/p\u003e\n\u003cp\u003e\"Well, sign me up, Professor. Sounds like my kind of class.\"\u003c/p\u003e\n\u003cp\u003eHis lips twitched. I was glad to see him coming out of that frozen, zombielike state. \"Who else knows I had the totem?\"\u003c/p\u003e\n\u003cp\u003eMyself. Cadotte. Clyde.\u003c/p\u003e\n\u003cp\u003eI frowned. The only one of us who didn\u0027t know I had the totem now was Clyde. But what possible reason would he have for trashing Cadotte\u0027s office? Clyde might not like him but wouldn\u0027t risk his job just to be pissy.\u003c/p\u003e\n\u003cp\u003eThen I remembered the paper Cadotte had signed for the totem and that it was missing. Hell, anyone with access to the evidence room, or the stolen evidence, could have done this. But why?\u003c/p\u003e\n\u003cp\u003e\"Jessie?\"\u003c/p\u003e\n\u003cp\u003eI raised my gaze. \"Maybe the person who lost it was searching for it?\"\u003c/p\u003e\n\u003cp\u003e\"And they would come to me instead of you, why?\"\u003c/p\u003e\n\u003cp\u003eHmm, good point.\u003c/p\u003e\n\u003cp\u003e\"Who knows that I had the thing besides you and me?\" he repeated.\u003c/p\u003e\n\u003cp\u003e\"Clyde.\" I shrugged. \"And anyone with access to the evidence room.\"\u003c/p\u003e\n\u003cp\u003eQuickly I explained about the receipt, the evidence log, and the missing evidence.\u003c/p\u003e\n\u003cp\u003eCadotte gave a long, slow blink. \"That makes no sense.\"\u003c/p\u003e\n\u003cp\u003eI had to agree. \"This was probably an unrelated incident.\"\u003c/p\u003e\n\u003cp\u003e\"Why my office and no one else\u0027s? Why take nothing but look at everything?\"\u003c/p\u003e\n\u003cp\u003eMy gaze swept the room. There was an awful lot of paper. Books, notes.\u003c/p\u003e\n\u003cp\u003e\"Axe you working on something?\"\u003c/p\u003e\n\u003cp\u003eCadotte had been staring at the ground, fingering his glasses, and scowling. \"Huh?\"\u003c/p\u003e\n\u003cp\u003eHe glanced up and I started. For a second there his dark, angry eyes had reminded me of the wolf I had seen in the clearing last night.\u003c/p\u003e\n\u003cp\u003eI rubbed my own eyes, and when I tried again, all I saw in his was curiosity. Why on earth would I remember a rabid wolf when I looked into Cadotte\u0027s eyes?\u003c/p\u003e\n\u003cp\u003eBecause I was way too tired to be working, way too deprived to be anywhere near him. 1 had a hard time thinking beyond how he tasted, how he smelled, how he had appeared naked in the moonlight and fully clothed on my porch with his tongue between my breasts.\u003c/p\u003e\n\u003cp\u003eYet ever since I\u0027d walked into this room, he had given no indication that we were any more than acquaintances. Perhaps in his mind we were. He probably brought women to orgasm with his kiss alone all the time.\u003c/p\u003e\n\u003cp\u003eSince the idea of him touching anyone else as he had touched me made me angry -\u0026nbsp;\u0026nbsp;how crazy was that?\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t even bring myself to call him by his first name -\u0026nbsp;\u0026nbsp;I forced myself back to the matter at hand.\u003c/p\u003e\n\u003cp\u003eDespite all evidence to the contrary, I was a cop, not a silly, hormonal teenager.\u003c/p\u003e\n\u003cp\u003e\"Are you working on a paper? A book? A theory? Something a colleague might want to take a peek at?\u003c/p\u003e\n\u003cp\u003eSteal? Screw up?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"I just finished a book.\"\u003c/p\u003e\n\u003cp\u003e\"You wrote a book?\" Although I had asked, that he\u0027d actually written an entire book made me gape.\u003c/p\u003e\n\u003cp\u003eCadotte laughed. \"I\u0027ve written several. That\u0027s what professors do when they aren\u0027t teaching. Publish or perish. Ever hear of it?\"\u003c/p\u003e\n\u003cp\u003eNo. I\u0027d never been much of a student -\u0026nbsp;\u0026nbsp;although I liked to read. What else was a girl supposed to do alone, Friday night after Friday night?\u003c/p\u003e\n\u003cp\u003e\"What are all these notes for?\" I waved my hand at the fire hazard living in his office.\u003c/p\u003e\n\u003cp\u003e\"Mostly for you.\"\u003c/p\u003e\n\u003cp\u003e\"Me?\"\u003c/p\u003e\n\u003cp\u003eI might not be the flowers and chocolate type, but crumpled paper and dusty books didn\u0027t do a thing for me.\u003c/p\u003e\n\u003cp\u003e\"The totem, Jessie.\"\u003c/p\u003e\n\u003cp\u003ePoof went my ideas of romance. Everything came back to that damn piece of rock.\u003c/p\u003e\n\u003cp\u003e\"You never told me what you found out.\"\u003c/p\u003e\n\u003cp\u003e\"1 wanted to.\" He lifted one inky brow. \"But I was distracted.\"\u003c/p\u003e\n\u003cp\u003eMy face heated at the memory of that distraction. Suddenly he was staring at me with an expression I could only describe as hungry.\u003c/p\u003e\n\u003cp\u003eHe pushed away from the desk and crossed the space between us in one stride. I should have done something to stop him, but I caught the scent of his skin and my body responded, going tight and wet without him touching me at all.\u003c/p\u003e\n\u003cp\u003eHe stopped less than an inch away. I had to tilt my head back to see his eyes. I wasn\u0027t used to being so much smaller than a man -\u0026nbsp;\u0026nbsp;one of the reasons there\u0027d been so few men. Not only did they not like me being as tall as them or as strong; I didn\u0027t like it, either.\u003c/p\u003e\n\u003cp\u003eCall me sexist, but I wanted a guy to tower over me. Right now I wanted this one to do a lot more than tower -\u0026nbsp;\u0026nbsp;I wanted him to touch me, teach me, take me.\u003c/p\u003e\n\u003cp\u003eAs if he had heard what I wanted, his eyes narrowed; his nostrils flared. He grabbed my hips and pulled me against him, then crushed his mouth to mine.\u003c/p\u003e\n\u003cp\u003eHe was rough. 1 didn\u0027t mind. Our teeth clicked together; his scraped my lip; then he licked the tiny hurt.\u003c/p\u003e\n\u003cp\u003eI shuddered. I wanted to take his flesh into my mouth and suckle. I wanted to feel him skin to skin.\u003c/p\u003e\n\u003cp\u003eHe spread his hands over my ass and ground us together. He was hard. It felt so good. I was going to come again, right there in his office. While on duty. Shit.\u003c/p\u003e\n\u003cp\u003eI shoved at his chest. He wouldn\u0027t let me go. I wasn\u0027t afraid. I was the one with the gun, but how could I explain shooting him? It wouldn\u0027t be easy.\u003c/p\u003e\n\u003cp\u003eHis mouth was doing amazing things, and I had a difficult time remembering why I wanted him to stop.\u003c/p\u003e\n\u003cp\u003eWhile I hesitated, he backed me up against the door, then laid his body flush with mine.\u003c/p\u003e\n\u003cp\u003eMy hands were still pressed to his chest, but instead of shoving, as I should be, my treacherous fingers had found their way into the collar of his shirt and stroked the smooth skin of his throat. One thumb slid into the hollow beneath his Adam\u0027s apple. I ran my fingernail lightly across his skin. He growled and the sound vibrated from the tip of my thumb to far more interesting places.\u003c/p\u003e\n\u003cp\u003eGoose bumps erupted, enhancing my sensitivity. I already felt as if the air ifself sizzled. Now my skin was on fire.\u003c/p\u003e\n\u003cp\u003eThe door at my back moved -\u0026nbsp;\u0026nbsp;opened an inch, then slammed shut beneath the weight of both my body and his. Someone knocked, the sound right next to my ear.\u003c/p\u003e\n\u003cp\u003e\"Professor?\"\u003c/p\u003e\n\u003cp\u003eI jumped and Cadotte pulled his tongue out of my mouth. His eyes were so close I could see his pupils dilated almost to the rim of the iris. If I\u0027d been any farther away, I wouldn\u0027t have been able to distinguish one from the other, so similar were they in color.\u003c/p\u003e\n\u003cp\u003eHis mouth was swollen and wet. His breath puffed along my face, chilling my own damp lips.\u003c/p\u003e\n\u003cp\u003e\"Yes?\" he called, in a cool, distant, nearly normal voice. How could he do that when he was still plastered all over me?\u003c/p\u003e\n\u003cp\u003eHe flexed his hips, riding his erection against the zipper in my pants. My eyes crossed and he chuckled, then kissed my forehead.\u003c/p\u003e\n\u003cp\u003e\"Will you be teaching your first class, Professor, or should I dismiss them?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right there.\"\u003c/p\u003e\n\u003cp\u003eI must be losing my mind, but having him talk to the department secretary about mundane daily tasks while his body was doing a vertical tango with mine on the other side of the door was the most erotic moment of my life. Pathetic, but true.\u003c/p\u003e\n\u003cp\u003eHeels clicked in the other direction, sounding sharp and somewhat annoyed. Why hadn\u0027t I heard them approach? Stupid question.\u003c/p\u003e\n\u003cp\u003eCadotte brushed his knuckles against the underside of my breast. A moan escaped my lips before I could stop myself. \"Though I\u0027d like to stay here and kiss you until you beg, I\u0027ve gotta go.\"\u003c/p\u003e\n\u003cp\u003eBeg? Me? Where was my quick and cutting comeback? I couldn\u0027t think of a thing to say.\u003c/p\u003e\n\u003cp\u003e\"I need to go, too.\" I shifted against him. He stayed right where he was. I stared at a place on the far wall and refused to look at him.\u003c/p\u003e\n\u003cp\u003e\"Jessie,\" he murmured.\u003c/p\u003e\n\u003cp\u003eCrap. He wasn\u0027t going to let me go until we talked about this. Why did everyone always want to talk about sex, even when they hadn\u0027t really had it yet?\u003c/p\u003e\n\u003cp\u003eYet? I was going to have sex with William Cadotte?\u003c/p\u003e\n\u003cp\u003eMy eyes met his. He smiled. I sighed.\u003c/p\u003e\n\u003cp\u003eYeah. I was. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-14.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
