{"id":89605,"no":17,"title":"Page 17","content":"\u003cp\u003e\"Maybe we\u0027d better keep all of this between us for the time being,\" he murmured.\u003c/p\u003e\n\u003cp\u003e\"No problem.\"\u003c/p\u003e\n\u003cp\u003eLike I was going to tell Clyde about the wolf god or that Cadotte believed in werewolves. Hell, I wasn\u0027t going to tell Clyde anything about Cadotte at all, unless I had to.\u003c/p\u003e\n\u003cp\u003e\"What else do you know?\" I asked. As long as he was sharing his delusion, I preferred he share it all.\u003c/p\u003e\n\u003cp\u003e\"The army is begun by the one who will become the wolf god.\"\u003c/p\u003e\n\u003cp\u003e\"Begun, how?\"\u003c/p\u003e\n\u003cp\u003e\"\u0027 They\u0027re werewolves; how do you think?\"\u003c/p\u003e\n\u003cp\u003eI blinked. \"So the wolf god is a werewolf, too?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. There\u0027s a ceremony that involves the totem, the werewolf army, the one who will become the wolf god, and... \"\u003c/p\u003e\n\u003cp\u003e\"And what?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all I know. The information I have is incomplete. So I ordered a book.\"\u003c/p\u003e\n\u003cp\u003e\"A book? There\u0027s a book on this stuff?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a book on everything. Sadly, this one is out of print. But I found a copy.\"\u003c/p\u003e\n\u003cp\u003e\"Let me guess -\u0026nbsp;\u0026nbsp;on the Internet.\"\u003c/p\u003e\n\u003cp\u003e\"Of course. Cost me a bundle, but it should explain a few things. When it shows up.\"\u003c/p\u003e\n\u003cp\u003eI grunted, staring at the drawings, thinking of the wolf I\u0027d seen last night. The behavior of Karen Larson.\u003c/p\u003e\n\u003cp\u003eThe weird things I\u0027d imagined about the totem. If I were a believer, I just might believe.\u003c/p\u003e\n\u003cp\u003eThen again...\u003c/p\u003e\n\u003cp\u003e\"I talked to the CDC this morning. The doctor said there is a new strain of rabies.\"\u003c/p\u003e\n\u003cp\u003e\"Did you think they\u0027d deny it?\"\u003c/p\u003e\n\u003cp\u003e\"But -\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"You expected them to say, \u0027 Oh, no, we don\u0027t know what that is. Why don\u0027t you panic?\u0027Or maybe, \u0027\u003c/p\u003e\n\u003cp\u003eSounds like a werewolf to me. Have a good time.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"You aren\u0027t funny.\"\u003c/p\u003e\n\u003cp\u003e\"And I thought I was.\"\u003c/p\u003e\n\u003cp\u003eHe patted my knee. Skin against skin, my body reacted, even though the touch had been anything but sexual.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure the CDC is working on something. But I highly doubt it\u0027s a vaccine against a new strain of super-rabies.\"\u003c/p\u003e\n\u003cp\u003e\"You think they lied to me?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. The government never lies to keep the panic at bay.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re being sarcastic.\"\u003c/p\u003e\n\u003cp\u003eHe merely raised an eyebrow and shuffled his papers into a single stack.\u003c/p\u003e\n\u003cp\u003eConsidering Cadotte was an Indian, an activist, and a professor, I couldn\u0027t say I was surprised he had a low opinion of the federal government. But conspiracy theories had never been my forte. They appeared to be his.\u003c/p\u003e\n\u003cp\u003e\"Let me ask you this,\" he continued. \"Did the CDC give you any advice on dealing with these superwolves?\"\u003c/p\u003e\n\u003cp\u003eI thought back to my conversation with Dr. Hanover. There had been one thing.\u003c/p\u003e\n\u003cp\u003e\"Shit.\" I lifted my gaze to his. \"She told me to use silver bullets.\"\u003c/p\u003e\n\u003cp\u003eCadotte started to laugh. He laughed so hard he choked. I pounded him on the back, none too gently.\u003c/p\u003e\n\u003cp\u003e\"Hey!\" he protested. \"Take it easy.\"\u003c/p\u003e\n\u003cp\u003eHe picked up his wineglass and tossed back the remainder of the content. \"Silver bullets?\" He shook his head. \"You thought that was a normal thing to recommend?\"\u003c/p\u003e\n\u003cp\u003e\"She had a good reason.\"\u003c/p\u003e\n\u003cp\u003e\"Wanna share it?\"\u003c/p\u003e\n\u003cp\u003e\"The mutated virus reacts negatively to silver.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll just bet it does.\"\u003c/p\u003e\n\u003cp\u003eI shook my head. I couldn\u0027t believe we were having this conversation.\u003c/p\u003e\n\u003cp\u003e\"I wish we had those bodies,\" I murmured.\u003c/p\u003e\n\u003cp\u003e\"Mighty convenient that they disappeared, wouldn\u0027t you say?\"\u003c/p\u003e\n\u003cp\u003e\"I suppose you have a theory on that, too.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"Wanna share it?\" I mocked.\u003c/p\u003e\n\u003cp\u003eHis lips twitched, and he cast me a glance that puzzled me. Most guys would have been sick of my mouth by now. Cadotte appeared to like it quite a bit.\u003c/p\u003e\n\u003cp\u003e\"They changed.\"\u003c/p\u003e\n\u003cp\u003e\"You think Karen Larson and her principal are running through the woods howling at the moon?\"\u003c/p\u003e\n\u003cp\u003e\"You got a better idea?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, a million of \u0027 em.\"\u003c/p\u003e\n\u003cp\u003e\"Name one.\"\u003c/p\u003e\n\u003cp\u003e\"Someone took them.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eI tried to come up with a good reason, but I couldn\u0027t. I threw up my hands. \"How should I know?\"\u003c/p\u003e\n\u003cp\u003e\"You have to admit strange things are happening around here.\"\u003c/p\u003e\n\u003cp\u003e\"That doesn\u0027t mean we\u0027ve got werewolves. Honestly, Cadotte, have you lost your mind?\"\u003c/p\u003e\n\u003cp\u003eHe studied me for a moment. \"Why are you so dead set against this?\"\u003c/p\u003e\n\u003cp\u003e\"Because I haven\u0027t lost mine?\"\u003c/p\u003e\n\u003cp\u003e\"You should keep your mind open. Isn\u0027t that what they tell you in cop school?\"\u003c/p\u003e\n\u003cp\u003e\"They tell us to observe only facts. Study what we can document. What we see, hear, touch is what\u0027s real. A theory means nothing. A legend even less.\"\u003c/p\u003e\n\u003cp\u003eHe sighed. \"Jessie, I worry over you.\"\u003c/p\u003e\n\u003cp\u003e\"I can take care of myself.\"\u003c/p\u003e\n\u003cp\u003e\"Against human bad guys. But if you won\u0027t believe in the inhuman ones, you could get really hurt.\" He moved closer and ran his hand up my thigh. \"You could get dead.\"\u003c/p\u003e\n\u003cp\u003eI shook my head. I couldn\u0027t believe we were even discussing whether werewolves were real and running around in my forest. I couldn\u0027t believe he\u0027d supped his fingers beneath the hem of my shorts and was stroking the soft skin where my thigh met my hip.\u003c/p\u003e\n\u003cp\u003e\"You really believe in werewolves?\" I managed.\u003c/p\u003e\n\u003cp\u003eHe leaned close and his breath brushed my hair. \"There\u0027s more to this world than what we can see, hear, and touch.\"\u003c/p\u003e\n\u003cp\u003e\"Like what?\"\u003c/p\u003e\n\u003cp\u003e\"There are things out there for which there\u0027s no explanation.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never heard or seen them.\"\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t listened; you haven\u0027t looked.\"\u003c/p\u003e\n\u003cp\u003eTrue. Maybe I would.\u003c/p\u003e\n\u003cp\u003eHis finger slipped beneath the elastic leg of my panties.\u003c/p\u003e\n\u003cp\u003eLater. I\u0027d look later.\u003c/p\u003e\n\u003cp\u003eHis nails scraped me, his thumb rode me hard as he slid a finger inside. His mouth swallowed my cries of completion and I tasted red wine on his tongue. His moan made my lips vibrate.\u003c/p\u003e\n\u003cp\u003eHe continued to stroke me, slower, gentler, then more quickly. More quickly still until I was ready to explode again. What was it about this man that made all my usual inhibitions vanish the instant he touched me?\u003c/p\u003e\n\u003cp\u003e\"My turn,\" he whispered, taking his hand out of my pants and unzipping his own.\u003c/p\u003e\n\u003cp\u003eI should have been limp, sated, half-asleep; instead the thought of having him inside me at last revved me up so high I couldn\u0027t sit still.\u003c/p\u003e\n\u003cp\u003eI reached for him, clasped him, tugged him forward and back. He put his hand over mine and showed me what he liked. He was hard, smooth, and hot. I wanted him more than I\u0027d wanted anything for a long, long time.\u003c/p\u003e\n\u003cp\u003eHe seemed to feel the same, since he practically tore the button off my shorts. Neither one of us heard the knock on the door. Hell, they could have been knocking for half an hour and I wouldn\u0027t have heard them. Then someone shouted my name and started to pound. The door rattled and shook.\u003c/p\u003e\n\u003cp\u003eTogether we cursed and tugged our clothes back where they belonged. I hurried to the door.\u003c/p\u003e\n\u003cp\u003e\"This had better be good,\" I said as I opened it.\u003c/p\u003e\n\u003cp\u003eEdward Mandenauer stood in the hall. Some of my neighbors had come out to see what the fuss was about. They stared at him as if he were crazy. Of course they rarely saw an emaciated old man with a rifle in each hand and a bandolier full of bullets slung over each shoulder in our neck of the woods. He resembled Rambo, sixty years after his last war.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s with me,\" I told my neighbors, and shooed them back inside.\u003c/p\u003e\n\u003cp\u003eWhen they disappeared, albeit slowly -\u0026nbsp;\u0026nbsp;we didn\u0027t get much excitement in our neck of the woods, either -\u0026nbsp;\u0026nbsp;I turned to Mandenauer. \"What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"We must hunt, Jessie.\" He tossed me a rifle. I had no choice but to catch the weapon or eat it.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nine o\u0027 clock. I thought we were supposed to meet at eleven.\"\u003c/p\u003e\n\u003cp\u003e\"We meet now.\"\u003c/p\u003e\n\u003cp\u003eI heard Cadotte get to his feet behind me. His movement drew Mandenauer\u0027s gaze. The old man\u0027s eyes narrowed, and he gave Cadotte the once-over, then turned to me and did the same.\u003c/p\u003e\n\u003cp\u003eMy cheeks heated. It was like being caught in the backseat of a car by your grandfather.\u003c/p\u003e\n\u003cp\u003eBut he wasn\u0027t my grandfather. I was over twenty-one and I was off duty, for crying out loud.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m busy.\"\u003c/p\u003e\n\u003cp\u003e\"Someone has been bitten. We must go.\" He turned and started down the hall.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" I called.\u003c/p\u003e\n\u003cp\u003eThis changed everything.\u003c/p\u003e\n\u003cp\u003eMandenauer paused. \"We must get to the scene. Quickly.\"\u003c/p\u003e\n\u003cp\u003eI glanced down. I couldn\u0027t go running through the woods in shorts and a shirt with no sleeves. I\u0027d not only be scratched to pieces; I\u0027d be eaten alive by bugs. Distractions like that destroyed a person\u0027s concentration. Without my concentration, I could get killed -\u0026nbsp;\u0026nbsp;and Mandenauer along with me.\u003c/p\u003e\n\u003cp\u003e\"Two minutes,\" I said, and ran for the bedroom.\u003c/p\u003e\n\u003cp\u003eI took three, but tough. I had to get my rifle out of the safe. I put the company issue inside, grabbed a box of bullets, and ran.\u003c/p\u003e\n\u003cp\u003eCadotte and Mandenauer were staring at each other like two dogs who\u0027d found the same bone. What was the matter with them?\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got to go,\" I told Cadotte. \"Sorry.\"\u003c/p\u003e\n\u003cp\u003eAnd I was sorry. My life had been rolling along quite nicely when Mandenauer showed up.\u003c/p\u003e\n\u003cp\u003eCadotte nodded. \"I know. I\u0027ll just clean up and let myself out.\"\u003c/p\u003e\n\u003cp\u003eI hesitated. I didn\u0027t want to leave him alone in my apartment, but his nicely stacked papers were now scattered all over my table -\u0026nbsp;\u0026nbsp;we must have knocked them over while we were otherwise occupied. His shoes were off. Damn, his jeans weren\u0027t buttoned. I could see a slice of smooth, dark skin across his belly. My mouth still tasted of him.\u003c/p\u003e\n\u003cp\u003eI had to get out of here. \"Thanks. I -\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll call you,\" he said.\u003c/p\u003e\n\u003cp\u003eMandenauer snorted. I gave him a dirty look and he shrugged. \"Your phones are not working. The sheriff tried to call, as did that foulmouthed harpy who says she is your friend.\"\u003c/p\u003e\n\u003cp\u003eHell. I had turned off the phones. I wasn\u0027t going to have much of an ass left when Clyde got done chewing on it. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-17.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
