{"id":89613,"no":25,"title":"Page 25","content":"\u003cp\u003eBy the time my shift was over and the sun had risen on another day, I\u0027d decided to name the game \"pandemonium.\"\u003c/p\u003e\n\u003cp\u003eWe\u0027d had four arrests, three accidental shootings, two dead dogs -\u003c/p\u003e\n\u003cp\u003e\"And a partridge in a pear tree,\" I muttered as I filled out my reports.\u003c/p\u003e\n\u003cp\u003eI\u0027d never had a chance to meet with Mandenauer. Hunting would have been pointless anyway, since the woods were overrun with morons.\u003c/p\u003e\n\u003cp\u003eAmazingly, not a wolf had been shot. I had to wonder if they\u0027d all turned tail and run to the next county.\u003c/p\u003e\n\u003cp\u003eIt wouldn\u0027t break my heart any.\u003c/p\u003e\n\u003cp\u003eI was also unable to meet Cadotte. I\u0027d called his house, but he wasn\u0027t there, so I left a short, apologetic message. I suspected he was at my place, and I felt kind of bad that I\u0027d left him sitting on my doorstep.\u003c/p\u003e\n\u003cp\u003eBut I couldn\u0027t leave just yet. He knew where to find me.\u003c/p\u003e\n\u003cp\u003eAs I was looking through my notes, I discovered that while I might thrive on third shift, my memory did not. I\u0027d forgotten about Tina Wilson.\u003c/p\u003e\n\u003cp\u003eI decided to stop by her apartment later today, if not tonight. My days of working in the dark and sleeping in the light appeared to be over -\u0026nbsp;\u0026nbsp;for the duration of our wolf problem.\u003c/p\u003e\n\u003cp\u003e\"Ha!\"\u003c/p\u003e\n\u003cp\u003eThe door slammed. Everyone in the room -\u0026nbsp;\u0026nbsp;me, First Shift, Brad, several of the Clearwater cops -\u003c/p\u003e\n\u003cp\u003ejumped. Clyde held a legal-sized sheet of paper in his fist.\u003c/p\u003e\n\u003cp\u003e\"Got it,\" he told the room at large.\u003c/p\u003e\n\u003cp\u003eWe glanced at one another, then back at him.\u003c/p\u003e\n\u003cp\u003e\"Got what?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"A proclamation from the DNR.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s it say?\"\u003c/p\u003e\n\u003cp\u003e\"Any private citizen caught in the woods with a gun will lose their license for a year.\"\u003c/p\u003e\n\u003cp\u003e\"Ouch,\" I murmured. Clyde just smiled.\u003c/p\u003e\n\u003cp\u003eWhile folks in and around Miniwa wouldn\u0027t blink at a few days in jail for illegal firearms transportation, threatening to take away their hunting and fishing privileges -\u0026nbsp;\u0026nbsp;which was the DNR\u0027s specialty -\u0026nbsp;\u0026nbsp;would make people sit up and take notice.\u003c/p\u003e\n\u003cp\u003e\"Post this at the Coffee Pot.\" He handed the paper to Brad. \"Then put out the word.\"\u003c/p\u003e\n\u003cp\u003eWhich meant get some coffee, gas up your squad car, have a doughnut, and while you were at it, let everyone know that the DNR was behind us. The woods were going to be more deserted than a ski hill on the Fourth of July.\u003c/p\u003e\n\u003cp\u003e\"This time tomorrow everything should be back to normal.\" Clyde went into his office and shut the door.\u003c/p\u003e\n\u003cp\u003eGreat. Now he was delusional, too. Had he forgotten the wolf problem?\u003c/p\u003e\n\u003cp\u003eAs everyone dispersed to spread the news, I knocked on Clyde\u0027s door.\u003c/p\u003e\n\u003cp\u003e\"Come!\"\u003c/p\u003e\n\u003cp\u003eI went in.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s up, Jessie?\" Clyde\u0027s grin didn\u0027t mask the cir-cles under his eyes, the pallor beneath his tan, the sag of his shoulders. He hadn\u0027t forgotten the wolf problem. In fact, he probably remembered it better than I did. Especially when I was in Cadotte\u0027s arms, where I forgot everything.\u003c/p\u003e\n\u003cp\u003eI straightened and got down to business. \"I wasn\u0027t able to go out with Mandenauer last night.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. That would have been suicide. Edward and I had dinner.\"\u003c/p\u003e\n\u003cp\u003e\"Edward?\"\u003c/p\u003e\n\u003cp\u003eHe ignored me. \"We also had quite a conversation.\" From the narrowing of Clyde\u0027s eyes, I knew what was coming. \"Didn\u0027t I tell you Cadotte was trouble?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Yet you\u0027re sleeping with him?\"\u003c/p\u003e\n\u003cp\u003e\"How the hell did you know that?\"\u003c/p\u003e\n\u003cp\u003eHe raised one dark eyebrow. \"I didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eDamn Clyde. He was the best interrogator on the force -\u0026nbsp;\u0026nbsp;and he\u0027d just played me like a green kid with her first felony.\u003c/p\u003e\n\u003cp\u003e\"Jessie.\" He shook his head and sat on the edge of his desk. \"I thought better of you.\"\u003c/p\u003e\n\u003cp\u003eI lifted my chin. \"I haven\u0027t done anything wrong. I\u0027m an adult. So is he.\"\u003c/p\u003e\n\u003cp\u003e\"You find that totem yet?\"\u003c/p\u003e\n\u003cp\u003eI blinked at the sudden change of subject. As if the stone had heard us, it swayed between my breasts. I jumped, then had to clench my ringers into fists to keep from reaching for the thing and rousing Clyde\u0027s suspicions.\u003c/p\u003e\n\u003cp\u003e\"No. Why?\"\u003c/p\u003e\n\u003cp\u003e\"Ever ask Cadotte about it?\"\u003c/p\u003e\n\u003cp\u003e\"Why should I?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, Jessie; maybe because he\u0027s an expert on totems. You find one, show it to him, then poof, the next thing we know, the stone is gone.\"\u003c/p\u003e\n\u003cp\u003e\"You think he took the totem?\"\u003c/p\u003e\n\u003cp\u003eSince I knew he hadn\u0027t, Clyde\u0027s attempt to make me suspicious of Will only convinced me to keep the thing under my shirt -\u0026nbsp;\u0026nbsp;so to speak.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure what to think.\"\u003c/p\u003e\n\u003cp\u003eWhich only made two of us. Everyone was acting weird lately. Except Cadotte. But he\u0027d been strange to begin with.\u003c/p\u003e\n\u003cp\u003eMy cell phone rang. I glanced at the caller ID. Speak of the Devil. 1 hooked the thing back onto my belt.\u003c/p\u003e\n\u003cp\u003eRaising my eyes, I met Clyde\u0027s. From the expression in his, he knew who\u0027d been on the phone.\u003c/p\u003e\n\u003cp\u003eHe heaved a sigh. \"Be careful. I don\u0027t want you to get hurt.\"\u003c/p\u003e\n\u003cp\u003eZee had said the same thing. Was I such a social reject that everyone took one look at Cadotte and labeled me \"soon to be hurt\"?\u003c/p\u003e\n\u003cp\u003eThat was a rhetorical question.\u003c/p\u003e\n\u003cp\u003eA knock on Clyde\u0027s door had us both lifting our heads. Mandenauer walked in.\u003c/p\u003e\n\u003cp\u003e\"Just the guy I wanted to see,\" I began.\u003c/p\u003e\n\u003cp\u003eHe raised a slightly yellowed brow and shut the door behind him. \"I am at your service.\"\u003c/p\u003e\n\u003cp\u003eHe bowed, just his head and shoulders in what I was beginning to think of as the German fashion. I half-expected him to click his heels, but he didn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"The doctor at the hospital didn\u0027t know anything about the super-rabies.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not.\"\u003c/p\u003e\n\u003cp\u003e\"Why not? Don\u0027t you think that\u0027s something the doctors ought to know?\"\u003c/p\u003e\n\u003cp\u003eMandenauer shrugged. \"Rabies is rabies to them. The vaccine works on both.\"\u003c/p\u003e\n\u003cp\u003e\"Not so much. Didn\u0027t you hear that Mel died? Have you seen the body?\"\u003c/p\u003e\n\u003cp\u003e\"Yes to both questions. Sometimes that happens.\"\u003c/p\u003e\n\u003cp\u003e\"Well, don\u0027t get too broken up about it,\" I mumbled.\u003c/p\u003e\n\u003cp\u003e\"Jessie,\" Clyde warned.\u003c/p\u003e\n\u003cp\u003e\"Yeah, yeah.\"\u003c/p\u003e\n\u003cp\u003eI rubbed my forehead. I was getting tired, dopey, crankier than usual. I had another question for Manden-auer -\u0026nbsp;\u0026nbsp;it was on the tip of my brain.\u003c/p\u003e\n\u003cp\u003e\"Oh!\" I smacked my forehead. \"Ouch.\" I forced myself to lower my hand so I could see Mandenauer. \"I called the CDC.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t react.\u003c/p\u003e\n\u003cp\u003e\"The Centers for Disease Control?\"\u003c/p\u003e\n\u003cp\u003eHe spread his bony hands wide.\u003c/p\u003e\n\u003cp\u003e\"Something is funny there.\"\u003c/p\u003e\n\u003cp\u003e\"I have never known the CDC to be very funny.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly. The first time I called, they had heard about the virus. When I called back and asked to talk to the doctor, they\u0027d never heard of her.\"\u003c/p\u003e\n\u003cp\u003eMandenauer and Clyde exchanged glances.\u003c/p\u003e\n\u003cp\u003e\"Sounds like someone was yanking your chain, Jessie.\"\u003c/p\u003e\n\u003cp\u003e\"At the CDC?\"\u003c/p\u003e\n\u003cp\u003e\"How long since you slept?\"\u003c/p\u003e\n\u003cp\u003e\"I forget.\"\u003c/p\u003e\n\u003cp\u003e\"Sleep.\" Mandenauer turned me toward the door. \"Forget about anything but ridding your forest of the wolves. Tonight we hunt at dusk.\"\u003c/p\u003e\n\u003cp\u003e\"Dusk?\"\u003c/p\u003e\n\u003cp\u003e\"When the sun just sets.\"\u003c/p\u003e\n\u003cp\u003e\"I know when the hell dusk is. But why then?\"\u003c/p\u003e\n\u003cp\u003e\"It is the time when the wolves come to life. I will be at your house an hour before that.\"\u003c/p\u003e\n\u003cp\u003e\"Fine. Whatever.\"\u003c/p\u003e\n\u003cp\u003eI was starting to wonder about that first phone call to the CDC. Had someone been screwing with me?\u003c/p\u003e\n\u003cp\u003eHow could that be?\u003c/p\u003e\n\u003cp\u003eA tap on the phone? Interception of my calls?\u003c/p\u003e\n\u003cp\u003ePut me and Oliver Stone in the same padded room, thank you. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-25.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
