{"id":89621,"no":33,"title":"Page 33","content":"\u003cp\u003e\"What happened?\" Elise cried. \"Has he been killed?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. Why would you think that?\"\u003c/p\u003e\n\u003cp\u003e\"This is my private line. Only Jdger-Suchers have this number.\"\u003c/p\u003e\n\u003cp\u003e\"Mandenauer gave it to me. I need information.\"\u003c/p\u003e\n\u003cp\u003e\"I need to talk to him.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s sleeping.\"\u003c/p\u003e\n\u003cp\u003eThe line went dead. I cursed and hit redial. When she didn\u0027t answer, I hit redial over and over again until Dr. Hanover picked up. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"I need information,\" I repeated.\u003c/p\u003e\n\u003cp\u003e\"Without Edward\u0027s okay, you get nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Listen.\" Quickly I told her what had happened that day and what I wanted. \"I\u0027m not waking him. You can forget about it.\"\u003c/p\u003e\n\u003cp\u003eSilence met my declaration. For an instant, I thought she\u0027d hung up while I ranted. I waited for a dial tone. Instead I heard a soft sigh.\u003c/p\u003e\n\u003cp\u003e\"Fine. But I want to talk to him as soon as he\u0027s able.\"\u003c/p\u003e\n\u003cp\u003e\"And my information?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have it. What harm can it do?\" she mumbled. \"Fax number?\"\u003c/p\u003e\n\u003cp\u003e\"Hold on.\" I got the number from the nurses\u0027station and gave it to her.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll stay with him?\" she asked. \"He shouldn\u0027t be alone when he can\u0027t protect himself.\"\u003c/p\u003e\n\u003cp\u003e\"You think the wolves will come after him here?\"\u003c/p\u003e\n\u003cp\u003e\"With Edward, there are more than wolves to worry about.\"\u003c/p\u003e\n\u003cp\u003e\"Peachy.\"\u003c/p\u003e\n\u003cp\u003eMoments later a nurse brought me the faxed information from Dr. Hanover.\u003c/p\u003e\n\u003cp\u003e\"Interesting reading, Jessie,\" she said.\u003c/p\u003e\n\u003cp\u003eI glanced at the top sheet. \"Ways to Cure a Werewolf.\" Well that was succinct and to the point. Not very secretive, either. But then again, who\u0027d believe this shit was real -\u0026nbsp;\u0026nbsp;unless they\u0027d seen what I had?\u003c/p\u003e\n\u003cp\u003eI gave the nurse a sheepish smile and pointed to Man-denauer. \"It\u0027s for him.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh,\" she said, and left.\u003c/p\u003e\n\u003cp\u003eI spent the next hour reading Elise\u0027s fascinating material. Not only were there several methods for curing a werewolf; there was a lot of historical information included.\u003c/p\u003e\n\u003cp\u003eFrom the Romans through the Greeks, to the Middle Ages, then on to the present time, there were tales of strange goings-on, explicable and inexplicable behavior. Funny, but most of the documented cases of lycanthropy in the twentieth and twenty-first centuries had never come to light in the newspapers or on television. Imagine that?\u003c/p\u003e\n\u003cp\u003eUp until a few weeks ago I\u0027d have said this made them untrue. Now I knew better. There were ways to make the truth disappear along with the evidence. Obviously Jdger-Suchers were involved with more than just the elimination of the monsters themselves; they also had a hand in the elimination of any evidence of the werewolves\u0027existence.\u003c/p\u003e\n\u003cp\u003e\"Pentagram,\" I read. \"Protection against a werewolf.\"\u003c/p\u003e\n\u003cp\u003eI could imagine wearing a symbol of witchcraft in this neck of the woods. I might find myself the victim of a little Jessie bonfire. Twenty-first century or not, folks in the north woods didn\u0027t take kindly to pentagram-wearing women.\u003c/p\u003e\n\u003cp\u003e\"Skip that,\" I murmured, even before I saw Elise\u0027s notation in the margin.\u003c/p\u003e\n\u003cp\u003e\"No good.\"\u003c/p\u003e\n\u003cp\u003eI kept reading. Next to many of the cures Elise had written the results. Most of them didn\u0027t work, as Man-denauer had said. But there were several next to which she\u0027d jotted encouraging words like:\u003c/p\u003e\n\u003cp\u003e\"Sometimes.\"\u003c/p\u003e\n\u003cp\u003e\"maybe\" and \"what the hell?\"\u003c/p\u003e\n\u003cp\u003eI was beginning to like Elise.\u003c/p\u003e\n\u003cp\u003e\" \u0027 Call the animal by its human name while in wolf form.\u0027Well, that works if we know who in hell it is in the first place.\"\u003c/p\u003e\n\u003cp\u003eThat could work with Cadotte. Wouldn\u0027t hurt to try.\u003c/p\u003e\n\u003cp\u003e\" \u0027 Remove ten drops of blood from the beast. Hold a piece of steel over its head.\u0027\" I scowled at the paper. \"Those could hurt. Me. I\u0027ll pass.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027 Cut off a limb. The werewolf will change back, sans limb.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003eThere were quite a few ideas that hadn\u0027t been tried. Most of them were violent and involved hacking the beast in some way. Not only was I not willing to get that close to a werewolf, but I didn\u0027t want to injure Cadotte in the process.\u003c/p\u003e\n\u003cp\u003eIf I had to kill him, so be it. But I wasn\u0027t going to torture him on the off chance he might be cured. That smacked a little too close to the Nazi way of doing things, which was what had gotten us into this mess in the first place.\u003c/p\u003e\n\u003cp\u003eIn the end I had two methods I could try. The name game and one other. \"Profess your love to the man within the beast. If your love is true, he will become human again and stay that way forever.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know if I loved Cadotte, but I\u0027d give it a shot. I\u0027d be a lot less embarrassed to profess true love to a wolf than a human anyway. If my love was true, I guess we\u0027d both win.\u003c/p\u003e\n\u003cp\u003eI used my cell phone to contact Brad. He was an idiot, but he was my idiot. Brad was as loyal as a Labrador retriever and only half as stupid. If I told him to watch Mandenauer like a hawk, he would. If I told him to protect the old man with his life, he\u0027d do that, too.\u003c/p\u003e\n\u003cp\u003eTen minutes later, Brad arrived. I explained the basics: Mandenauer had been shot; I wasn\u0027t sure by who, so I wanted him protected.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to check out a few leads,\" I said, and left the two of them together.\u003c/p\u003e\n\u003cp\u003eI headed for the emergency room exit at the back of the clinic. I planned to find Will and test Dr.\u003c/p\u003e\n\u003cp\u003eHanover\u0027s theories.\u003c/p\u003e\n\u003cp\u003eSince it was after midnight in a small northern town, the parking lot was deserted. A few cars, most likely belonging to employees, butted up against the bank of trees that made a half-circle at the back of the clinic.\u003c/p\u003e\n\u003cp\u003eBeneath the bright and shiny moon, the hood of my car sparked silver shreds of light into my eyes. Which was my only excuse for not seeing the huge black wolf until he growled at me.\u003c/p\u003e\n\u003cp\u003eMy hand went to my gun. The wolf was between me and my car, where I\u0027d left my rifle. And I\u0027d called Brad stupid. Although at this range I shouldn\u0027t need anything stronger than my pistol.\u003c/p\u003e\n\u003cp\u003eI stared at the wolf. God, he was huge. I\u0027d never seen one bigger. I recalled reading somewhere that black wolves were the largest. The zoologists couldn\u0027t figure out why.\u003c/p\u003e\n\u003cp\u003eI tightened my fingers around my gun. The wolf snarled.\u003c/p\u003e\n\u003cp\u003e\"Smarter than you look, aren\u0027t you?\" I murmured.\u003c/p\u003e\n\u003cp\u003eThe wolf cocked his head like a dog. The eyes nearly blended into the fur -\u0026nbsp;\u0026nbsp;black pupils, dark brown irises, a little bit of white at the edges. This was the same wolf I\u0027d seen that first night with Mandenauer.\u003c/p\u003e\n\u003cp\u003e\"William Cadotte,\" I said.\u003c/p\u003e\n\u003cp\u003eThe animal\u0027s lip curled and a low, vicious rumble came from his chest. The hair on the back of my neck tingled.\u003c/p\u003e\n\u003cp\u003e\"That went well.\"\u003c/p\u003e\n\u003cp\u003eEither the wolf wasn\u0027t Cadotte or the name thing didn\u0027t work. I\u0027d have to tell Elise. If I lived.\u003c/p\u003e\n\u003cp\u003eI\u0027d gone this far. I took a deep breath. \"I love you, Will.\"\u003c/p\u003e\n\u003cp\u003eThe wolf stopped snarling and tilted his head in the other direction. Sadly, he remained a wolf.\u003c/p\u003e\n\u003cp\u003eEither the animal wasn\u0027t Cadotte or my love wasn\u0027t true. I was back to square one.\u003c/p\u003e\n\u003cp\u003eNow what?\u003c/p\u003e\n\u003cp\u003eWe could stand here staring at each other all night. I could shoot him, just for fun. I could let him bite or kill me. None of those options was very appealing.\u003c/p\u003e\n\u003cp\u003eMy radio crackled and the wolf jumped straight up in the air. \"Nervous?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe lifted his lip in a silent snarl, or maybe a sneer, then sat down again.\u003c/p\u003e\n\u003cp\u003e\"Three Adam One, where the hell are you?\"\u003c/p\u003e\n\u003cp\u003eThe way Zee was behaving lately, you\u0027d think I was MIA every minute of my shift.\u003c/p\u003e\n\u003cp\u003eI reached for my radio with my left hand. It was times like these when I wished Miniwa had the tax base to afford shoulder mikes.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m outside the clinic. I\u0027ve got a little situation here.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of situation?\"\u003c/p\u003e\n\u003cp\u003e\"Big black nasty wolf doesn\u0027t want to let me leave.\"\u003c/p\u003e\n\u003cp\u003eSilence met my declaration. The doors swished open behind me and voices swept out ahead of the young couple.\u003c/p\u003e\n\u003cp\u003e\"Stay back!\" I shouted.\u003c/p\u003e\n\u003cp\u003eThey did, and so did the wolf. But the woman shrieked -\u0026nbsp;\u0026nbsp;an ear-piercing sound that made me blink on a wince. In that split second, the wolf disappeared. I was left standing in the parking lot, gun drawn and trained on thin air.\u003c/p\u003e\n\u003cp\u003eI turned to the couple but kept my eyes peeled and my gun ready. \"He\u0027s gone. You can stop screaming now.\"\u003c/p\u003e\n\u003cp\u003eAs if I\u0027d pressed a button, she shut off.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s gone?\" the man asked.\u003c/p\u003e\n\u003cp\u003e\"The wolf.\"\u003c/p\u003e\n\u003cp\u003e\"What wolf?\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t see him?\" I glanced at the trees, saw nothing, and reluctantly holstered my weapon. \"Then what was she yammering about?\"\u003c/p\u003e\n\u003cp\u003eThe woman\u0027s bottom lip puffed out. She sniffed and turned away.\u003c/p\u003e\n\u003cp\u003e\"I think the gun might have upset her, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Uh, well, carry on.\"\u003c/p\u003e\n\u003cp\u003eThey hadn\u0027t seen the wolf. How could they have missed him? I knew he had been there. I wasn\u0027t delusional. I watched them get in their car and drive away.\u003c/p\u003e\n\u003cp\u003eCrackle. Pop. Zee was back.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"Did you get rid of the wolf?\"\u003c/p\u003e\n\u003cp\u003e\"He ran off.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Clyde wants to know if you ever found that missing evidence.\"\u003c/p\u003e\n\u003cp\u003eI crossed the parking lot, watching every corner, twitching at every shadow. After climbing into my car, I locked all the doors. The wolf might lack the opposable thumbs necessary to open the doors, and then again he might not.\u003c/p\u003e\n\u003cp\u003e\"Let me talk to him.\"\u003c/p\u003e\n\u003cp\u003e\"Have you looked at your watch? Right now he\u0027s probably glued to TBS. It\u0027s all Clint, all night.\"\u003c/p\u003e\n\u003cp\u003e\"Must have missed that.\"\u003c/p\u003e\n\u003cp\u003eI sat in my car and thought awhile before I answered Zee\u0027s question in regard to the evidence. \"Trust no one,\" Mandenauer had said. And though I hated to continue lying to my best friend and my colleagues, in this instance I\u0027d just have to do it anyway.\u003c/p\u003e\n\u003cp\u003e\"Jessie?\" Zee prompted.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said as 1 rolled the totem between my ringers. \"I never found anything.\"\u003c/p\u003e\n\u003cp\u003eShe cursed, low and quite viciously, even for her.\u003c/p\u003e\n\u003cp\u003e\"Sheesh, lighten up. It\u0027s not your ass.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I\u0027m just sick of hearing him bitch. Get over it already.\"\u003c/p\u003e\n\u003cp\u003eI had to agree. I spent the rest of the night trolling the town, the highway, the woods. I even went back to Cadotte\u0027s, but he wasn\u0027t there. That made me more nervous than anything. Where in hell had he gone in the middle of the night?\u003c/p\u003e\n\u003cp\u003eWhen morning came, I returned to the clinic and drove Mandenauer home. He was still tired, but he\u0027d be all right.\u003c/p\u003e\n\u003cp\u003e\"Get some rest, Jessie.\" He collapsed onto the ancient stained couch in the cottage. \"We win or we lose tonight.\"\u003c/p\u003e\n\u003cp\u003e\"But how can they perform the ceremony without the totem? Haven\u0027t we already won?\"\u003c/p\u003e\n\u003cp\u003e\"I do not know. Perhaps they will find another totem.\"\u003c/p\u003e\n\u003cp\u003e\"How?\"\u003c/p\u003e\n\u003cp\u003e\"If I knew, then I could prevent them from doing so. But how they got the first one is a mystery.\"\u003c/p\u003e\n\u003cp\u003e\"Swell,\" I muttered.\u003c/p\u003e\n\u003cp\u003e\"Since blue moons are few and far between, for the most part, I doubt whoever is behind this will let something so small as a missing item keep them from becoming.\"\u003c/p\u003e\n\u003cp\u003eI pulled the totem from beneath my shirt. \"Maybe we should destroy this?\"\u003c/p\u003e\n\u003cp\u003eHe lifted a brow. \"Maybe we should.\"\u003c/p\u003e\n\u003cp\u003e\"Got a hammer?\"\u003c/p\u003e\n\u003cp\u003e\"In the kitchen.\"\u003c/p\u003e\n\u003cp\u003eI found the tool and came back. After placing the icon on the floor, I lifted the hammer and hit the thing as hard as I could. The blow reverberated up my arms. I peered at the stone.\u003c/p\u003e\n\u003cp\u003eThere wasn\u0027t a mark on it.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s impossible,\" I muttered.\u003c/p\u003e\n\u003cp\u003eMandenauer sighed. \"More impossible than humans becoming wolves?\"\u003c/p\u003e\n\u003cp\u003eHe had me there. \"What next?\"\u003c/p\u003e\n\u003cp\u003e\"Fire won\u0027t melt rocks -\u0026nbsp;\u0026nbsp;or at least any fire we can produce.\"\u003c/p\u003e\n\u003cp\u003e\"I could throw it into the lake.\"\u003c/p\u003e\n\u003cp\u003e\"You could. But I\u0027ve seen mystical items float right back to the surface. What if the one who wants the totem the most finds it?\"\u003c/p\u003e\n\u003cp\u003e\"I could bury the thing.\"\u003c/p\u003e\n\u003cp\u003e\"It could pop out of the ground like a zombie.\"\u003c/p\u003e\n\u003cp\u003e\"Zombie? Are you serious?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d be amazed at the things I have seen.\" He shook his head. \"Perhaps Elise will discover some way to use the icon against them. Then we will need it, yes?\"\u003c/p\u003e\n\u003cp\u003eI shrugged and dropped the stone back down the front of my shirt. Being unable to destroy the thing had creeped me out more than I wanted to admit.\u003c/p\u003e\n\u003cp\u003eWhat was the totem made of? Moon rock? Had it been forged in hellfire? I didn\u0027t want to know.\u003c/p\u003e\n\u003cp\u003eThe icon shifted between my breasts and I shuddered, then slapped my hand over it. \"Stop that,\" I muttered.\u003c/p\u003e\n\u003cp\u003eMandenauer coughed. I blushed. I\u0027d come a long way from believing in nothing I couldn\u0027t see, hear, or touch to talking to stones and telling wolves that I loved them.\u003c/p\u003e\n\u003cp\u003e\"Do you need help getting into bed?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Not since I was two.\" He rose, swayed, then glared when I would have grabbed his elbow.\u003c/p\u003e\n\u003cp\u003eI lifted my hands in a gesture of surrender. \"Fall on your face. See if I care.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, Jessie, you are so good to me.\"\u003c/p\u003e\n\u003cp\u003eI left him in bed with a high-powered rifle and a laser scope, which was the most action he got at his age. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-33.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
