{"id":89623,"no":35,"title":"Page 35","content":"\u003cp\u003eWill disentangled himself from me and jumped to his feet. Startled, I just lay on the floor, naked and alone. This wasn\u0027t going at all as I\u0027d imagined it might once I loved a man and he loved me back.\u003c/p\u003e\n\u003cp\u003eLeaning down, Will scooped me into his arms and lifted. Then he strode toward the bedroom.\u003c/p\u003e\n\u003cp\u003e\"Hey! What the hell?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m taking you to bed, Jessie. I want you again.\"\u003c/p\u003e\n\u003cp\u003eThat was mighty obvious from the steady poke I was getting in my backside.\u003c/p\u003e\n\u003cp\u003e\"What, are you a machine?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe laughed. \"I just want to enthrall you sexually while I have the chance.\"\u003c/p\u003e\n\u003cp\u003e\"I think you have.\"\u003c/p\u003e\n\u003cp\u003eHe carried me as if I weighed no more than a child, and I knew that wasn\u0027t true. I was not now nor have I ever been a small girl. I probably weighed as much as he did, or near enough.\u003c/p\u003e\n\u003cp\u003eThat he could sling me around like a sack of potatoes should have annoyed me. Instead, I found myself enchanted by his great big muscles and aroused by his Neanderthal tactics. Yep, I definitely had it bad.\u003c/p\u003e\n\u003cp\u003eFor a man who could be a werewolf.\u003c/p\u003e\n\u003cp\u003eI figured the sex would be better in the bed, but it wasn\u0027t. The sex was spectacular wherever we had it - in a bed, at the pond, on the floor.\u003c/p\u003e\n\u003cp\u003eHis fingers lazily played with my hair, then drifted across my spine. I lay facedown, arm hanging limply off the bed, legs all tangled with his. When I turned my head, he was so close his nose brushed mine.\u003c/p\u003e\n\u003cp\u003e\"Jessie?\"\u003c/p\u003e\n\u003cp\u003eWe were still nose to nose, breath mingling, hips touching.\u003c/p\u003e\n\u003cp\u003e\"Will?\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"You hardly ever call me that.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"I think you called me Cadotte until about an hour ago.\"\u003c/p\u003e\n\u003cp\u003e\"It seems bad form to call a guy who\u0027s making you scream by his last name.\"\u003c/p\u003e\n\u003cp\u003eHis smile faded; uncertainty flickered in his eyes.\u003c/p\u003e\n\u003cp\u003e\"Hey, what\u0027s the matter?\" I reached for him, but he was already moving away.\u003c/p\u003e\n\u003cp\u003e\"You aren\u0027t with me for the sex, are you?\"\u003c/p\u003e\n\u003cp\u003eI sat up. \"Are you that insecure?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eMy eyebrows shot up. He\u0027d never seemed insecure to me. He was beautiful, built, brilliant. What did he have to be insecure about? I asked him.\u003c/p\u003e\n\u003cp\u003e\"Do you know how many women have slept with me because of my face? Because I\u0027m good in bed?\"\u003c/p\u003e\n\u003cp\u003e\"Do I want to know?\"\u003c/p\u003e\n\u003cp\u003eHis lips twitched, relieving some of the tension. \"Probably not.\"\u003c/p\u003e\n\u003cp\u003e\"Then let\u0027s leave them in the past where they belong. Don\u0027t we have enough to worry about right now?\"\u003c/p\u003e\n\u003cp\u003eHis gaze met mine. The uncertainty was gone, replaced by a wariness that made the hair on my forearms prickle. We had a helluva lot more to worry about tonight than old lovers.\u003c/p\u003e\n\u003cp\u003eHe nodded and opened his arms. \"Come here.\"\u003c/p\u003e\n\u003cp\u003e\"Again?\"\u003c/p\u003e\n\u003cp\u003e\"Got a problem with that?\"\u003c/p\u003e\n\u003cp\u003eI pretended to think. \"Not really.\"\u003c/p\u003e\n\u003cp\u003eI slid across the bed and kissed him. I didn\u0027t want to stop; I didn\u0027t want to think. There\u0027d be time enough for that later. Maybe. Right now I only wanted to be with him, to feel the things only Will could make me feel.\u003c/p\u003e\n\u003cp\u003eBut as he moved inside of me, my treacherous mind went clickety-clack. The blue moon threatened.\u003c/p\u003e\n\u003cp\u003eTonight was the night when everything changed -\u0026nbsp;\u0026nbsp;or maybe everyone.\u003c/p\u003e\n\u003cp\u003eWhat if Will was not only the love of my life but the monster I\u0027d been searching for? What if he\u0027d killed people? What if he\u0027d eaten them? What if he was a power-hungry nutcase bent on ruling the world?\u003c/p\u003e\n\u003cp\u003eWhat if... ?\u003c/p\u003e\n\u003cp\u003eMy body betrayed me, shutting down my mind, making me come apart in his arms. Love was wearing me out -\u0026nbsp;\u0026nbsp;and the sex wasn\u0027t bad, either. I could no longer keep my eyes open.\u003c/p\u003e\n\u003cp\u003eAs I fell asleep with his cheek nuzzling my hair, the answer to my questions came to me with brilliant clarity. Whatever he was, I loved him. If he was cursed, I\u0027d try to cure him. There must be a way. I only had to find it.\u003c/p\u003e\n\u003cp\u003eI awoke to the twilight and an empty bed. I wasn\u0027t worried; not at first. I actually believed he loved me.\u003c/p\u003e\n\u003cp\u003eBut as I wandered through my empty apartment and realized Will was gone and the moon was rising, uncertainty set in. I reached for the totem I\u0027d been wearing around my neck for weeks, but it wasn\u0027t there.\u003c/p\u003e\n\u003cp\u003eMy heart gave one painful, panicked thud before I remembered I\u0027d taken it off as I always did when I went to bed. If I\u0027d actually been wearing the thing, it would have strangled me during our energetic bedroom activities. Not to mention I\u0027d have had to explain to Will that I\u0027d had the thing all along.\u003c/p\u003e\n\u003cp\u003eI went back into my room, crossed to the dresser, reached for the totem. My fingers came up empty.\u003c/p\u003e\n\u003cp\u003eI dropped to my knees, crawled around the floor patting the carpet. Tore the room apart in a frenzy. But nothing changed what I knew in my gut.\u003c/p\u003e\n\u003cp\u003eWill was gone, and so was the stone. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-35.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
