{"id":89624,"no":36,"title":"Page 36","content":"\u003cp\u003eI would have liked a shower, but I didn\u0027t have the luxury. Instead, I threw on my uniform, retrieved my weapons, and was on my way out the door when the doorbell rang. Expecting Mandenauer, I could only stare stupidly at Clyde,\u003c/p\u003e\n\u003cp\u003e\"Where you goin\u0027 in such a hurry?\"\u003c/p\u003e\n\u003cp\u003e\"Um. Uh.\"\u003c/p\u003e\n\u003cp\u003eI should tell Clyde everything, but I was in a bit of a rush. Besides, he hated Will already. He\u0027d be thrilled to shoot him with silver and say \"whoops\" later.\u003c/p\u003e\n\u003cp\u003e\"Mandenauer,\" I blurted. \"T said I\u0027d come over early.\"\u003c/p\u003e\n\u003cp\u003e\"I was just there, and I woke him up. Definitely a \u0027 don\u0027t go away mad; just go away\u0027moment.\u003c/p\u003e\n\u003cp\u003eHeartbreak Ridge was on last night. Not exactly Clint\u0027s words, but near \u0027 nough. Mandenauer was going back to sleep. Since you\u0027ve got hours yet before your shift, why don\u0027t we have a little chat?\"\u003c/p\u003e\n\u003cp\u003eI glanced through my living room toward the window. I might have hours before my shift, but sundown was soon.\u003c/p\u003e\n\u003cp\u003eIt was then I saw my panties lying on the carpet in the middle of the room.\u003c/p\u003e\n\u003cp\u003eClyde sniffed, once, twice, and I turned to find him so close I leaped back.\u003c/p\u003e\n\u003cp\u003e\"What the hell?\" I demanded, embarrassed, nervous, betrayed, and cranky.\u003c/p\u003e\n\u003cp\u003e\"I can smell him on you.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know what to say to that. Luckily I didn\u0027t have to say anything, since Clyde kept talking.\u003c/p\u003e\n\u003cp\u003e\"Jesus, Jessie, I\u0027d have thought you of all people would be able to resist a pretty face. Have you no pride?\"\u003c/p\u003e\n\u003cp\u003eApparently not.\u003c/p\u003e\n\u003cp\u003e\"Clyde, I\u0027ve got to go.\"\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003e\"None of your business.\"\u003c/p\u003e\n\u003cp\u003e\"When you\u0027re wearing that uniform, everything you do is my business.\"\u003c/p\u003e\n\u003cp\u003eI had a flash of what I\u0027d been doing a few times in this uniform. Definitely not Clyde\u0027s business. But I wasn\u0027t going to tell him that. My cheeks heated in spite of myself.\u003c/p\u003e\n\u003cp\u003e\"I need to see Mandenauer,\" I repeated. \"I\u0027ll just have to wake him up.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Cadotte?\"\u003c/p\u003e\n\u003cp\u003e\"Not here.\"\u003c/p\u003e\n\u003cp\u003eI stepped into the hallway and Clyde had no choice but to move back; then I closed the door firmly behind me.\u003c/p\u003e\n\u003cp\u003e\"I want to talk to him.\"\u003c/p\u003e\n\u003cp\u003e\"Join the club.\" I started down the hall.\u003c/p\u003e\n\u003cp\u003e\"He sneak out on you?\"\u003c/p\u003e\n\u003cp\u003eI turned. \"Why are you so damned interested in Cadotte all of a sudden?\"\u003c/p\u003e\n\u003cp\u003e\"I want to talk to him about the attempted murder of Edward Mandenauer.\"\u003c/p\u003e\n\u003cp\u003e\"Have you lost your mind?\"\u003c/p\u003e\n\u003cp\u003e\"Have you?\"\u003c/p\u003e\n\u003cp\u003e\"What possible reason could Will have to shoot Man-denauer? He barely knows the man.\"\u003c/p\u003e\n\u003cp\u003e\"Mandenauer and I had quite a chat when I stopped into the clinic earlier. I hear he was shot with a crossbow.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"Cadotte has a crossbow.\"\u003c/p\u003e\n\u003cp\u003e\"So does every old man between here and Minoqua. That doesn\u0027t make him guilty.\" I turned and headed down the hall. \"He\u0027s got no motive.\"\u003c/p\u003e\n\u003cp\u003eTrust Clyde to fuck that up.\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t a werewolf want to kill the wolf hunter?\"\u003c/p\u003e\n\u003cp\u003eI froze. \"A what?\"\u003c/p\u003e\n\u003cp\u003e\"Come off it, Jessie. Mandenauer told me everything.\"\u003c/p\u003e\n\u003cp\u003eSlowly I faced him. \"And you believed him?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"I was raised Ojibwe. Just because I\u0027ve had to play that down to get where I am doesn\u0027t mean I don\u0027t believe in the legends. I\u0027ve seen things... \" He shook his head. \"Let\u0027s just say werewolves are the least of them.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t quite get my mind around the fact that my boss believed in the unbelievable. Had everyone gone over to the dark side?\u003c/p\u003e\n\u003cp\u003eI set my rifle against the wall. The weapon was getting too heavy to cart up and down the hallway. \"So you know about the blue moon? The werewolf army? The wolf god?\"\u003c/p\u003e\n\u003cp\u003e\"Everything.\" He held out his hand. \"Why don\u0027t you give me that totem for safekeeping?\"\u003c/p\u003e\n\u003cp\u003eI stared at his palm, then lifted my gaze to his face. \"I don\u0027t have it.\"\u003c/p\u003e\n\u003cp\u003eAnger flickered in his eyes. \"Jessie, you\u0027re playing with something you don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003eIt was on the tip of my tongue to tell him that Will had taken the stone, but he grabbed me by the upper arms and shook me. My teeth rattled, and I decided to keep the information to myself. I didn\u0027t care for the way he was acting.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have the totem, Clyde. I swear.\"\u003c/p\u003e\n\u003cp\u003e\"Only one way to find out.\"\u003c/p\u003e\n\u003cp\u003eHe spun me around and patted me down. I was tempted to fight back, but Clyde was a lot bigger than I was. Besides, he wasn\u0027t going to find anything, thanks to Cadotte.\u003c/p\u003e\n\u003cp\u003eMy boss released me with a little shove and a mutter of annoyance. I stepped out of his reach and nearer to my rifle. My fingers rested on the butt of my pistol.\u003c/p\u003e\n\u003cp\u003eClyde ran a hand over his face and sighed. \"He\u0027s been keeping an eye on you. Discovering what you know. Putting you off balance. If he\u0027s got you in his bed, then you aren\u0027t out doing your job, are you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been doing my job,\" I snapped.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been doing him.\" Clyde bit off a stub of chew and chomped ferociously for a few seconds. \"I like you, Jessie, and I don\u0027t want to hurt your feelings.\"\u003c/p\u003e\n\u003cp\u003e\"Why stop now?\" I muttered.\u003c/p\u003e\n\u003cp\u003eClyde ignored me. \"I\u0027ve seen the women Cadotte fucks. You don\u0027t fit in.\"\u003c/p\u003e\n\u003cp\u003eWhat else was new? I never had. But I\u0027d started to think that I might, with him.\u003c/p\u003e\n\u003cp\u003e\"Cadotte\u0027s up to something,\" Clyde continued. \"I just can\u0027t figure out what.\"\u003c/p\u003e\n\u003cp\u003eI wanted to say Cadotte loved me. He thought I was beautiful. Funny, sexy, special. Everything I\u0027d ever wanted to be, I was to him. But I wasn\u0027t so sure anymore.\u003c/p\u003e\n\u003cp\u003eHe had taken the totem. To protect me? Or to ruin me? Until I knew, I was keeping my mouth shut.\u003c/p\u003e\n\u003cp\u003e\"Did he tell you anything about the ceremony?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t told me. I\u0027d read it in a book.\u003c/p\u003e\n\u003cp\u003eI frowned. But not all of the ceremony. There\u0027d been a page missing. Which was more troublesome now than ever before.\u003c/p\u003e\n\u003cp\u003e\"What do you know?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Blue moon. Werewolf army. Matchi-auwishuk totem.\"\u003c/p\u003e\n\u003cp\u003eClyde knew about as much as I did.\u003c/p\u003e\n\u003cp\u003e\"Blood of the one who loves you.\"\u003c/p\u003e\n\u003cp\u003eI blinked. \"The what of the who?\"\u003c/p\u003e\n\u003cp\u003e\"Blood of the one who loves you,\" he repeated slowly. \"It\u0027s needed for the ceremony.\"\u003c/p\u003e\n\u003cp\u003eI turned and headed for the door.\u003c/p\u003e\n\u003cp\u003e\"Jessie? Where you going?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer. I couldn\u0027t very well tell the sheriff that I was going to kill someone. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-36.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
