{"id":89626,"no":38,"title":"Page 38","content":"\u003cp\u003eI should have slammed the door, but I couldn\u0027t. I was rooted to the floor in the hallway, unable to drag my eyes from the sight in front of me.\u003c/p\u003e\n\u003cp\u003eClyde\u0027s body contorted; his shoulders hunched; his legs bowed. He threw back his head and howled.\u003c/p\u003e\n\u003cp\u003eThe sound shot ice down my spine. The wolves in the forest paused in their flight and answered.\u003c/p\u003e\n\u003cp\u003eHis clothes split open with a shriek of rending cloth and bursting seams. His shoes seemed to explode and paws popped out. He dropped to all fours and the hands that caught him had claws.\u003c/p\u003e\n\u003cp\u003eBlack hair sprouted from every pore, thickening, lengthening, becoming fur. A tail erupted from his spine.\u003c/p\u003e\n\u003cp\u003eThe last thing to change was his head.\u003c/p\u003e\n\u003cp\u003eI sensed movement behind me, but I couldn\u0027t tear my gaze away. I braced myself, expecting Mandenauer to shoot. But he didn\u0027t. Odd, he\u0027d never hesitated before.\u003c/p\u003e\n\u003cp\u003eThe popping of bones, the stretching of skin, caused a horrible sound. I winced as Clyde finished the change.\u003c/p\u003e\n\u003cp\u003eHis nose and his mouth stretched, melding into a snout. His teeth grew; his tongue must have, too, since it lolled out the side of his mouth. His brow bulged. When he swung his head in our direction his face was that of a skinned wolf with Clyde\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eNasty. I wished for the fur to arrive. My wish was soon granted.\u003c/p\u003e\n\u003cp\u003eBlack hair flowed over his face, obscuring the bones that marred his cinnamon skin. He shook himself as if he\u0027d just come out of the water, then turned toward me.\u003c/p\u003e\n\u003cp\u003eI gasped. Clyde was the black wolf that had dogged my steps and haunted my dreams. He was most likely the wolf that had bitten Karen Larson and countless others.\u003c/p\u003e\n\u003cp\u003eThe gunshot made me scream and fall to the floor, throwing my hands up in front of my face. My ears rang, but I still heard Clyde shriek. I didn\u0027t want to look, but I had to.\u003c/p\u003e\n\u003cp\u003eFlames burst from a neat hole near his heart. The scent of scorched hair and cooking meat filled the air.\u003c/p\u003e\n\u003cp\u003eThe howl of a wolf, the cry of a man -\u0026nbsp;\u0026nbsp;he writhed in pain, twisting, turning, his claws scrabbling against the planks of the porch as he died.\u003c/p\u003e\n\u003cp\u003eI stayed on the ground. I couldn\u0027t gain my feet. Man-denauer stepped around me and shoved at Clyde wkh his boot. The wolf\u0027s head lolled sickeningly.\u003c/p\u003e\n\u003cp\u003eI leaned my back against the cabin wall. I was weak, limp. I couldn\u0027t stop staring at what had once been my boss. I\u0027d liked Clyde, trusted him as much as I trusted anyone -\u0026nbsp;\u0026nbsp;except maybe Zee. I couldn\u0027t get my mind around the idea that he\u0027d forever be a wolf. That Clyde would never again spit chew or quote Clint.\u003c/p\u003e\n\u003cp\u003e\"Why did you let him finish the change before you shot him?\"\u003c/p\u003e\n\u003cp\u003e\"It is easier to explain a dead wolf than a dead sheriff.\" His gaze swept the forest. \"We must go.\"\u003c/p\u003e\n\u003cp\u003e\"Go? Where? We got him.\"\u003c/p\u003e\n\u003cp\u003e\"The sheriff was nothing more than a minion of evil. The one who will become remains.\"\u003c/p\u003e\n\u003cp\u003e\"How you figure?\"\u003c/p\u003e\n\u003cp\u003eMandenauer flicked me a contemptuous glance. \"If he was the one, why did he give the totem to the others?\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t thought of that. Damn.\u003c/p\u003e\n\u003cp\u003e\"Listen,\" Mandenauer whispered.\u003c/p\u003e\n\u003cp\u003eIn the distance the wolves called to one another. There were more of them now. The ones who had been here had joined those who waited there. With their leader.\u003c/p\u003e\n\u003cp\u003eI glanced at the sky. The blue moon had not yet reached the apex. Our night had only begun.\u003c/p\u003e\n\u003cp\u003eI struggled to my knees, gained my feet without help. I looked for Will and didn\u0027t find him.\u003c/p\u003e\n\u003cp\u003eHad he passed out from blood loss? I took a step toward the door and Mandenauer stopped me. \"Your lover is putting a bandage on his scratch. He does not need your aid.\"\u003c/p\u003e\n\u003cp\u003e\"You call that a scratch?\"\u003c/p\u003e\n\u003cp\u003e\"You do not?\"\u003c/p\u003e\n\u003cp\u003e\"I say a hole through the arm is a wound and not a scratch.\"\u003c/p\u003e\n\u003cp\u003e\"I say if you can walk, then walk.\"\u003c/p\u003e\n\u003cp\u003eI tore my gaze from the cabin. \"You trying to tell me something?\"\u003c/p\u003e\n\u003cp\u003e\"Follow those wolves.\"\u003c/p\u003e\n\u003cp\u003e\"I just knew you were gonna say that.\"\u003c/p\u003e\n\u003cp\u003eI stalked inside, retrieved my rifle, went searching for Will. To hell with Mandenauer; I wasn\u0027t going to leave until I saw with my own eyes that Will was all right.\u003c/p\u003e\n\u003cp\u003eI followed the blood trail to the bathroom. Will struggled to fasten gauze around his arm with one hand.\u003c/p\u003e\n\u003cp\u003eHe glanced up and his eyes met mine in the mirror. He didn\u0027t appear happy to see me.\u003c/p\u003e\n\u003cp\u003e\"Let me.\" I stepped into the room, leaning my rifle against the wall.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s done.\" He grabbed one end of the gauze with his teeth, the other with his free hand, and jerked. His breath hissed in sharply when the material tightened on the wound.\u003c/p\u003e\n\u003cp\u003e\"Maybe you should go to the clinic and get stitches.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need stitches. It\u0027s just a scratch.\"\u003c/p\u003e\n\u003cp\u003eMy lips twitched. \"Scratch. Right. What about your ear?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged one shoulder. The blood that had bathed his neck cracked, and rust-colored flecks rained down on his already ruined clothes. \"I\u0027ll live.\"\u003c/p\u003e\n\u003cp\u003e\"Jessie!\" Mandenauer shouted. \"Today if you please?\"\u003c/p\u003e\n\u003cp\u003eI stepped closer and smoothed his hair away from his brow. \"I have to go.\"\u003c/p\u003e\n\u003cp\u003eHe shifted abruptly, his body bumping against mine in ways that would have been interesting if he weren\u0027t covered in blood and I didn\u0027t have places to be, werewolves to kill.\u003c/p\u003e\n\u003cp\u003e\"Let me change my shirt.\"\u003c/p\u003e\n\u003cp\u003e\"You aren\u0027t coming.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" His eyes met mine. \"I am.\"\u003c/p\u003e\n\u003cp\u003e\"Now that Clyde\u0027s dead they need a wolf clan member. Bringing you along would be downright stupid.\"\u003c/p\u003e\n\u003cp\u003e\"I can take care of myself.\"\u003c/p\u003e\n\u003cp\u003e\"So can I. Stay here. Clean up. Rest. I\u0027ll come back when it\u0027s over.\"\u003c/p\u003e\n\u003cp\u003e\"You think I can just sit here while you face a werewolf army? Wait like a good little boy until you have time to come to me again? I love you, Jessie. If you die, so do I.\"\u003c/p\u003e\n\u003cp\u003eThe thought of him dying made my palms clammy and my voice sharp. \"I\u0027m not going to die and neither are you. Just let me do my job, Will.\"\u003c/p\u003e\n\u003cp\u003e\"Let me help.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need your help.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. You don\u0027t need anyone.\" His voice rose and anger warred with the pain in his eyes.\u003c/p\u003e\n\u003cp\u003e\"You certainly don\u0027t need me. You never did.\"\u003c/p\u003e\n\u003cp\u003e\"Jessie.\" Mandenauer stood in the hall. Urgency tightened his features.\u003c/p\u003e\n\u003cp\u003eI glanced at Will. I wanted to stay, but I had to go. I wanted to kiss him, but he turned away and started the shower.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be back,\" I promised.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t answer, and that bothered me more than his anger and pain had. Torn between my job, my duty, and my love, I hesitated.\u003c/p\u003e\n\u003cp\u003eIn the end, I had no choice. I followed Mandenauer and he followed the wolves. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-38.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
