{"id":89627,"no":39,"title":"Page 39","content":"\u003cp\u003e\"What\u0027s the plan?\" I asked.\u003c/p\u003e\n\u003cp\u003eThe trail widened. I was able to quicken my pace and walk shoulder to shoulder with Mandenauer.\u003c/p\u003e\n\u003cp\u003eHe gave me a quick glance and a rare smile. \"You are not moping about leaving your lover behind?\"\u003c/p\u003e\n\u003cp\u003eI frowned, confused. \"Should I be?\"\u003c/p\u003e\n\u003cp\u003e\"Most women would. I like you, Jessie. You are an able officer.\"\u003c/p\u003e\n\u003cp\u003e\"Gee, thanks. I\u0027m so glad you approve.\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t felt like an able officer lately. I\u0027d broken a shitload of rules, withheld information, stolen evidence, and protected a suspect. I\u0027d most likely be thrown off the force, if I didn\u0027t die first.\u003c/p\u003e\n\u003cp\u003eMandenauer, who either didn\u0027t get my sarcasm or was learning to ignore it, continued. \"The plan is to follow the wolves to the ceremony and put a bullet in every single one.\"\u003c/p\u003e\n\u003cp\u003e\"I can do that.\"\u003c/p\u003e\n\u003cp\u003e\"However, if the wolf god rises, we may have a problem.\"\u003c/p\u003e\n\u003cp\u003eI gave him a quick glance. \"What kind of problem?\"\u003c/p\u003e\n\u003cp\u003e\"I do not think the wolf god can be killed with silver.\"\u003c/p\u003e\n\u003cp\u003e\"Why the hell not?\"\u003c/p\u003e\n\u003cp\u003eI must have sounded slightly hysterical, because he reached over and patted me on the shoulder with a heavy, awkward hand. \"Otherwise it would be no more than a werewolf, yes?\"\u003c/p\u003e\n\u003cp\u003eI saw his point. I didn\u0027t like it, but I saw it.\u003c/p\u003e\n\u003cp\u003e\"Then how do we kill a wolf god?\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea.\"\u003c/p\u003e\n\u003cp\u003e\"Great. Swell. Wonderful.\"\u003c/p\u003e\n\u003cp\u003e\"My sentiments exactly.\"\u003c/p\u003e\n\u003cp\u003eWe had no trouble following the wolves. The trail was damp. It must have rained while I\u0027d been sleeping - and doing other things. Unnaturally large paw prints padded to the west like a neon arrow.\u003c/p\u003e\n\u003cp\u003e\"They aren\u0027t trying to hide where they\u0027re going,\" I said.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"That can\u0027t be good.\"\u003c/p\u003e\n\u003cp\u003e\"I agree. But what choice do we have?\"\u003c/p\u003e\n\u003cp\u003eNone.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t suppose you have any idea who\u0027s behind this?\"\u003c/p\u003e\n\u003cp\u003eMandenauer adjusted his bandolier, which kept slipping to the edge of his bony shoulder. \"Do you?\"\u003c/p\u003e\n\u003cp\u003e\"Question with a question,\" I muttered.\u003c/p\u003e\n\u003cp\u003eWas he trying to annoy me?\u003c/p\u003e\n\u003cp\u003e\"I thought I did.\"\u003c/p\u003e\n\u003cp\u003e\"You believed your lover was the one.\"\u003c/p\u003e\n\u003cp\u003eI shrugged. Hard to admit you\u0027d been sleeping with the enemy. Easier to just do it -\u0026nbsp; or do him, as Clyde had so kindly pointed out -\u0026nbsp; than talk about it.\u003c/p\u003e\n\u003cp\u003eMy eyes burned at the thought of Clyde. I\u0027d miss him. Werewolf or not, he\u0027d been good to me. He\u0027d been a decent boss, a likable guy. What had happened?\u003c/p\u003e\n\u003cp\u003eI thought back on all that had occurred in the last week. Clyde had made me suspicious of Will. He\u0027d given me false information. He\u0027d out-and-out lied.\u003c/p\u003e\n\u003cp\u003eThat left a bad taste in my mouth. We were the good guys -\u0026nbsp; or at least we were supposed to be. But who was I to throw stones after all I\u0027d done?\u003c/p\u003e\n\u003cp\u003e\"You are thinking about your friend the sheriff?\"\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e\"And how he could have done what he did?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"He had little choice in the matter. Once you are bitten, you do what you are told.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t like the sound of that. I\u0027d never been very good at doing what I was told.\u003c/p\u003e\n\u003cp\u003eI stopped and he glanced at me with a raised brow. \"Problem?\"\u003c/p\u003e\n\u003cp\u003eI\u0027ll say.\u003c/p\u003e\n\u003cp\u003e\"If everything goes to hell... I mean if we -\u0026nbsp; \"\u003c/p\u003e\n\u003cp\u003e\"Are unable to stop them and are bitten?\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t speak, so I nodded.\u003c/p\u003e\n\u003cp\u003e\"We have a saying in the Jdger-Sucher society: Always save the last bullet for yourself.\"\u003c/p\u003e\n\u003cp\u003eThe stark words made me wince, but I could see their practicality, and I\u0027d always been a practical gal.\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t I hear that in an old Western once?\"\u003c/p\u003e\n\u003cp\u003e\"I never said it was an original saying.\" Mandenauer winked and kept walking.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s one thing that bothers me.\"\u003c/p\u003e\n\u003cp\u003e\"Only one?\"\u003c/p\u003e\n\u003cp\u003e\"Actually there are about a hundred, but for now -\u0026nbsp; \"\u003c/p\u003e\n\u003cp\u003eHe waved a thin, heavily veined hand. \"Ask.\"\u003c/p\u003e\n\u003cp\u003e\"Why did you tell Clyde who you were?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t tell him anything.\"\u003c/p\u003e\n\u003cp\u003eI stopped again, but this time Mandenauer kept walking. I hurried to catch up. \"He told me that he knew what you were. That you\u0027d told him everything.\"\u003c/p\u003e\n\u003cp\u003e\"He told you a lot of things, Jessie.\"\u003c/p\u003e\n\u003cp\u003eTrue. What was one more lie on top of all the others? I\u0027d never been a trusting soul. I had a feeling I\u0027d be even less so now.\u003c/p\u003e\n\u003cp\u003eAnother thought occurred to me. \"The crossbow.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d rather not think about that any longer, thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Just a sec.\" My mind churned, trying to put all the pieces in place. It wasn\u0027t easy. \"He told me that Will had one. But how would he have known that unless he was in Will\u0027s house?\"\u003c/p\u003e\n\u003cp\u003eMandenauer shrugged.\u003c/p\u003e\n\u003cp\u003e\"Will said someone had planted the evidence.\" I rubbed my forehead. \"I\u0027m such an idiot.\"\u003c/p\u003e\n\u003cp\u003e\"Clyde manipulated you. He had his reasons.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think he shot you?\"\u003c/p\u003e\n\u003cp\u003e\"Does it matter now?\"\u003c/p\u003e\n\u003cp\u003eIn the scheme of things... ? \"I guess not.\"\u003c/p\u003e\n\u003cp\u003eWe continued to walk, and then we walked some more. Where in hell were these wolves headed?\u003c/p\u003e\n\u003cp\u003eCanada?\u003c/p\u003e\n\u003cp\u003eI was in good shape, but a timber wolf could run me into the ground any day. I wondered if that was what they were up to. They knew we were coming. We hadn\u0027t been quiet. What was the point when they could hear a pin drop one hundred yards away?\u003c/p\u003e\n\u003cp\u003eMandenauer wasn\u0027t even breathing hard. I hoped I could walk a million miles at his age. I hoped I could walk at all in the morning.\u003c/p\u003e\n\u003cp\u003eHe stopped, raised a hand, gestured for silence. The sound of chanting rose toward the blue moon.\u003c/p\u003e\n\u003cp\u003eI peered through the trees, which wasn\u0027t easy. The forest was thick, the trail we were on a deer trail and very narrow. But several hundred feet ahead I saw the flicker of a flame.\u003c/p\u003e\n\u003cp\u003eMandenauer fixed me with a serious stare from his eerie blue eyes and patted his rifle, then he pointed to-ward the flames. With his finger and thumb he made a motion. I nodded.\u003c/p\u003e\n\u003cp\u003eBang, bang, bang. They would all be dead.\u003c/p\u003e\n\u003cp\u003eHis pace picked up. We were nearly there.\u003c/p\u003e\n\u003cp\u003eThe trees rustled with a summer breeze, and I saw the clearing, recognized it instantly. They\u0027d led us to their lair at the cave. I should have known.\u003c/p\u003e\n\u003cp\u003eMandenauer didn\u0027t hesitate. He braced his back against a tree and started shooting.\u003c/p\u003e\n\u003cp\u003eI followed his lead, finding a nearby tree with a decent view. The view was what screwed me. I\u0027d have been all right if there\u0027d only been wolves. But there weren\u0027t.\u003c/p\u003e\n\u003cp\u003eThe sight of several naked people -\u0026nbsp; men, women, white and Indian -\u0026nbsp; made me hesitate. The hesitation got me knocked over the bead with something really hard.\u003c/p\u003e\n\u003cp\u003eI fell on my face. A gun was pressed to my head.\u003c/p\u003e\n\u003cp\u003eMan, I hated when that happened.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve been waiting for you.\"\u003c/p\u003e\n\u003cp\u003eThe voice made me blink. I tried to turn so I could see with my own eyes what my brain refused to accept. But the poking of the gun barrel at the base of my neck stopped me.\u003c/p\u003e\n\u003cp\u003eA groan from Mandenauer\u0027s direction, and the cessation of the shots, told me he was in the same predicament. Too bad we hadn\u0027t climbed a tree this time. Of course there were no handy tree stands around -\u0026nbsp; no doubt one of the reasons this place was theirs.\u003c/p\u003e\n\u003cp\u003eMy weapons and ammo disappeared. The pressure of the gun lessened, and I raised myself to my knees.\u003c/p\u003e\n\u003cp\u003eMy head hurt like a son of a bitch. Thankfully I didn\u0027t have to lift it very far to have a confirmation on that voice.\u003c/p\u003e\n\u003cp\u003ePerfectly manicured toes peaked out of obscenely high-heeled sandals right beneath my nose.\u003c/p\u003e\n\u003cp\u003eHigh heels in the forest. What a moron. But then, look who I was dealing with.\u003c/p\u003e\n\u003cp\u003e\"Get up,\" Cherry demanded, tapping me again with the barrel of the gun.\u003c/p\u003e\n\u003cp\u003eMy breath hissed in as a shaft of pain went through my head. But I got up before she could smack me a third time. I glanced toward Mandenauer, but he was already gone. My eyes met Cherry\u0027s and she smirked. \"Not so smart now, are you?\"\u003c/p\u003e\n\u003cp\u003e\"Guess not. I never would have believed you\u0027d let yourself get furry. Doesn\u0027t that ruin your makeup?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d be surprised.\" She motioned toward the clearing with the gun.\u003c/p\u003e\n\u003cp\u003eCherry was the culprit? I had a hard time with that. She didn\u0027t have the brains, and I couldn\u0027t imagine Clyde taking orders from her.\u003c/p\u003e\n\u003cp\u003eMandenauer sat in the center of a snarling, snapping circle of wolves. The ones he\u0027d shot smoldered, the scent of burning flesh reminding me of a tailgate party at Lam-beau Field. BBQ was always on the menu.\u003c/p\u003e\n\u003cp\u003eThe chanting had continued right through our altercation. I didn\u0027t recognize either of the men or the woman at the bonfire. I did, however, recognize the totem hanging over the flames.\u003c/p\u003e\n\u003cp\u003eThe only word I understood was Matchi-auwishuk. I figured they were calling on the Evil Ones to raise the wolf god.\u003c/p\u003e\n\u003cp\u003eCherry shoved me across the clearing with several nicely placed jabs to the small of my back with her pistol.\u003c/p\u003e\n\u003cp\u003e\"Sit.\" She kicked the back of my knees and I hit the ground. She certainly was a nasty little thing, but I\u0027d figured that out a long time ago.\u003c/p\u003e\n\u003cp\u003e\"Now what?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Now we wait for -\u0026nbsp; \" One of the wolves snarled and she bit her lip. \"You\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003eI frowned. \"You aren\u0027t going to become the wolf god?\"\u003c/p\u003e\n\u003cp\u003eHer eyes widened. \"Me? Hardly.\"\u003c/p\u003e\n\u003cp\u003eSheesh, how many surprises did I have in store for me tonight? At least a few more.\u003c/p\u003e\n\u003cp\u003e\"Why did you let Tina bite Mel?\"\u003c/p\u003e\n\u003cp\u003eSurprise flickered in her eyes for a moment before they started to water. \"I wanted him to be like me, but I couldn\u0027t do it. He would have been, too, but you killed him!\"\u003c/p\u003e\n\u003cp\u003eThe gun wobbled alarmingly. Why had I felt the need to chat?\u003c/p\u003e\n\u003cp\u003e\"I thought I was helping.\"\u003c/p\u003e\n\u003cp\u003e\"You thought!\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t you know better?\"\u003c/p\u003e\n\u003cp\u003e\"I thought once he was bitten it wouldn\u0027t matter. And everyone was so damn determined that he have the shot. I got confused.\" Her mouth trembled, but she tightened it and gave me a glare. \"You\u0027ll get yours soon enough.\"\u003c/p\u003e\n\u003cp\u003e\"I will?\"\u003c/p\u003e\n\u003cp\u003eShe smiled. The expression did not bode well for me.\u003c/p\u003e\n\u003cp\u003e\"You know how to make a wolf god, bitch?\"\u003c/p\u003e\n\u003cp\u003e\"Kind of.\"\u003c/p\u003e\n\u003cp\u003e\"Blood. Yours. Soon.\" She licked her lips. My stomach rolled -\u0026nbsp; from the headache or the discussion of my blood I wasn\u0027t sure, maybe both.\u003c/p\u003e\n\u003cp\u003eI took a few deep breaths, stared at the ground awhile and not the gun. I had just started to feel better when Cherry whispered, \"They come.\"\u003c/p\u003e\n\u003cp\u003eI lifted my head too fast; the world spun. I had to swallow back bile. I heard footsteps, more than one person, perhaps two.\u003c/p\u003e\n\u003cp\u003eThe brash parted and Will stumbled into the clearing. My heart gave a hard, painful thump. Confusion clouded my mind. He wasn\u0027t a werewolf, so... why me?\u003c/p\u003e\n\u003cp\u003eI saw the lump on his forehead, new blood on his clean shirt, the way his hands were bound.\u003c/p\u003e\n\u003cp\u003eHe had not come willingly.\u003c/p\u003e\n\u003cp\u003eThe brush rustled once more, and I turned my gaze toward the new arrival. The wind kicked up and seemed to whisper: The blood of one who loves you.\u003c/p\u003e\n\u003cp\u003eI\u0027d wondered, Why me? Now I knew.\u003c/p\u003e\n\u003cp\u003eZelda Hupmen stepped out of the forest.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-39.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
