{"id":89628,"no":40,"title":"Page 40","content":"\u003cp\u003e\"Quit starin\u0027 at me like you\u0027re brain-dead, girl. Don\u0027t tell me you didn\u0027t imagine I was the one.\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t. Not for a minute. Not once had I suspected my best and only friend of being a werewolf.\u003c/p\u003e\n\u003cp\u003eBut now... so many things made sense.\u003c/p\u003e\n\u003cp\u003eShe smoked like a chimney, drank like a fish, Lord knows how old she was -\u0026nbsp;\u0026nbsp;yet she had the nose and ears of a... wolf.\u003c/p\u003e\n\u003cp\u003eMost important, she ran this town -\u0026nbsp;\u0026nbsp;or near enough. She received all the information before anyone else.\u003c/p\u003e\n\u003cp\u003eShe could control what the police learned, where they went.\u003c/p\u003e\n\u003cp\u003eHaving the sheriff as her compatriot was brilliant. Between the two of them it was little wonder they\u0027d been able to get this far.\u003c/p\u003e\n\u003cp\u003e\"I should have known,\" 1 muttered. \"If Clyde wasn\u0027t the leader, it had to be you.\"\u003c/p\u003e\n\u003cp\u003e\"How you figure?\"\u003c/p\u003e\n\u003cp\u003e\"Because no one told Clyde what to do.\"\u003c/p\u003e\n\u003cp\u003e\"Except for me.\"\u003c/p\u003e\n\u003cp\u003e\"Bingo.\"\u003c/p\u003e\n\u003cp\u003eThe Indians continued to chant; they seemed to be in a trance. I glanced at Will and he took one step in my direction. A wolf lunged for his crotch. He jumped back and the animal\u0027s teeth snapped shut centimeters away from his jewels.\u003c/p\u003e\n\u003cp\u003e\"Ah, ah, ah, Horace,\" Zee admonished. \"I need him for a little while. You can eat him later.\"\u003c/p\u003e\n\u003cp\u003eThe wolf sat in front of Will and stared at him as if he were a lamb chop.\u003c/p\u003e\n\u003cp\u003e\"You know why you\u0027re here?\" she asked him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a bit fuzzy on the details since my book has a page missing.\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"Clever of me, hmm?\"\u003c/p\u003e\n\u003cp\u003e\"You took the page?\" I blurted.\u003c/p\u003e\n\u003cp\u003eZee nodded. \"I broke into his office looking for the totem, but I found the book. I didn\u0027t want to steal it, too obvious, so I tore out the end of the ceremony.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t think he might order another one?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Of course. That\u0027s why I had Horace here keep an eye on pretty boy\u0027s mail. Any packages he was to bring to me, which he did.\"\u003c/p\u003e\n\u003cp\u003eI glanced at Horace and realized he was the mailman. He was a little hard to recognize all furry like that.\u003c/p\u003e\n\u003cp\u003eDid Zee have a werewolf planted in every walk of our lives? It appeared so.\u003c/p\u003e\n\u003cp\u003e\"What was on the page you tore out?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"The part that matters the most. What happens tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Which is?\"\u003c/p\u003e\n\u003cp\u003e\"I become invincible.\"\u003c/p\u003e\n\u003cp\u003eMandenauer, who\u0027d been unnaturally silent until now, snorted. Zee turned in his direction. A snap of her fingers and the wolves parted. She crossed the distance between them. \"You have something to say, Herr Mandenauer?\"\u003c/p\u003e\n\u003cp\u003e\"No one is invincible. I have learned that much in all my years on the hunt.\"\u003c/p\u003e\n\u003cp\u003e\"You will learn something new tonight. The wolf god cannot be destroyed. I will live forever and I will rule everyone.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" I asked.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t think of anything I\u0027d less like to do than rule the world. What a shitty job.\u003c/p\u003e\n\u003cp\u003eZee spun toward me, and the wolves encircled Man-denauer once more. Anger brightened her eyes.\u003c/p\u003e\n\u003cp\u003e\"Because once I was powerless and Mengele made me a monster.\"\u003c/p\u003e\n\u003cp\u003e\"Mengele?\" I remembered what Mandenauer had told me about the Nazi. \"You were one of his experiments?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But you haven\u0027t got an accent,\" I blurted.\u003c/p\u003e\n\u003cp\u003eZee\u0027s penciled-on eyebrows lifted. \"That\u0027s all you can say?\"\u003c/p\u003e\n\u003cp\u003eI was in shock. I knew that much. But I\u0027d never met a native-born German who could lose the accent.\u003c/p\u003e\n\u003cp\u003eShe waved her hand. \"I had plenty of time to practice my English. That was the least of my worries.\"\u003c/p\u003e\n\u003cp\u003eI glanced at Will. He made a swirling motion with his finger. Horace followed the movement as if Will\u0027s hand were a prepackaged doggy treat.\u003c/p\u003e\n\u003cp\u003eI got the message. Keep her talking. Why not? I didn\u0027t want to get to the part where she needed my blood.\u003c/p\u003e\n\u003cp\u003e\"What were your worries?\"\u003c/p\u003e\n\u003cp\u003eShe gave me an incredulous snort. \"Look at me. Mengele couldn\u0027t have infected me with his crap when I was twenty and beautiful? No, he had to do it when I was eighty and ugly.\"\u003c/p\u003e\n\u003cp\u003eI blinked. \"You were eighty in the nineteen-forties?\"\u003c/p\u003e\n\u003cp\u003e\"Werewolves don\u0027t die, Jessie. Unless you shoot them with silver.\"\u003c/p\u003e\n\u003cp\u003e\"I can take care of that for you!\" Mandenauer called. \"If you just return my gun!\"\u003c/p\u003e\n\u003cp\u003e\"I could have killed myself if I wanted to die. If I do, that pig wins. I wanted a cure. I spent decades searching for one. I traveled the globe, investigated every werewolf legend, tried lotions and potions and incantations until I was so damn tired.\"\u003c/p\u003e\n\u003cp\u003e\"And then?\"\u003c/p\u003e\n\u003cp\u003e\"Then I came to Wisconsin, and I found something much better than a cure.\" She smiled. \"Ever hear \u0027 if you can\u0027t beat \u0027em, join \u0027 em\u0027? I much prefer \u0027 if you can\u0027t be cured, then become.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a bit confused as to how you get to rule the world by becoming a wolf god.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not all that hard. If my army spreads, bit by bit, country by country, soon everyone is a werewolf.\"\u003c/p\u003e\n\u003cp\u003eAha!\u003c/p\u003e\n\u003cp\u003e\"And you are their god.\"\u003c/p\u003e\n\u003cp\u003e\"Works out quite nicely, doesn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eAbruptly Zee crossed to the fire, grabbed a machete that had been heating at the edge of the flames. She beckoned to Will and to me,\u003c/p\u003e\n\u003cp\u003e\"Nuh-uh,\" I said at the same time Will muttered, \"No, thanks.\"\u003c/p\u003e\n\u003cp\u003eZee gave an impatient sigh. \"Jessie, I need your blood, but it really doesn\u0027t matter to me if I get it after you\u0027re dead.\"\u003c/p\u003e\n\u003cp\u003e\"I thought you were my friend.\"\u003c/p\u003e\n\u003cp\u003e\"I was. I am. I will be again if you help me. In fact... \" Her once dear face took on a feral yet speculative gleam. \"You could join me. The world isn\u0027t going to be fit for just plain folks. Let me give you a little nip -\u0026nbsp;\u0026nbsp;after, of course.\" She wiggled the huge knife. \"Then we can be together forever.\"\u003c/p\u003e\n\u003cp\u003e\"As appealing as that sounds, I\u0027ll have to pass.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, you don\u0027t get to decide. Now get over here, and your little friend, too.\"\u003c/p\u003e\n\u003cp\u003e\"What do you need Will for? If I come, you can let him go.\"\u003c/p\u003e\n\u003cp\u003e\"Jessie.\" Will sounded exasperated.\u003c/p\u003e\n\u003cp\u003eZee ignored him. \"You haven\u0027t been listening, girl, and that\u0027s not like you. I need wolf clan boy for the ceremony.\"\u003c/p\u003e\n\u003cp\u003eA cold chill wafted over me. \"What are you going to do?\"\u003c/p\u003e\n\u003cp\u003eHorrible images danced through my head. Human sacrifice. Sadomasochistic sex. And those were just the ones I knew the names for.\u003c/p\u003e\n\u003cp\u003e\"He has to draw the blood.\"\u003c/p\u003e\n\u003cp\u003eMy mouth fell open. \"That\u0027s it?\"\u003c/p\u003e\n\u003cp\u003eZee\u0027s lips twitched. \"What did you think? That I\u0027d screw him here in front of you and everyone? You did say he was good in bed, girl, but I\u0027m too old for that shit.\"\u003c/p\u003e\n\u003cp\u003eMy cheeks heated. How I could be embarrassed at a time like this I\u0027ll never understand.\u003c/p\u003e\n\u003cp\u003e\"Time\u0027s a-wastin\u0027 . Don\u0027t make me send them to get you. I promise you won\u0027t like it.\"\u003c/p\u003e\n\u003cp\u003eTwo of the wolves growled, the fur along their backs lifting. Zee was no doubt right. I wouldn\u0027t like it.\u003c/p\u003e\n\u003cp\u003eBut I\u0027d like being a werewolf even less.\u003c/p\u003e\n\u003cp\u003eWill cleared his throat. I looked at him. He looked toward Zee. I frowned and followed his gaze.\u003c/p\u003e\n\u003cp\u003eThe guns were in a pile near the edge of the forest, nearly out of sight. Zee didn\u0027t seem to know they were there. Goody.\u003c/p\u003e\n\u003cp\u003eWill and I joined Zee near the fire. She didn\u0027t waste any time. As the Indians continued to chant, then throw a little magic dirt into the fire, the flames turned from orange, to crimson, to neon blue -\u0026nbsp;\u0026nbsp;she put the machete into Will\u0027s hand. Holding on to his wrist, she grabbed mine.\u003c/p\u003e\n\u003cp\u003eWill and I both struggled, but it was no use. Zee had the strength of a werewolf, not a little old lady. One quick slice across my forearm and it was over.\u003c/p\u003e\n\u003cp\u003eOr maybe not. She dragged both of us nearer the fire, held my arm over the flames, squeezed the cut until a stream of red bathed the totem and dripped into the fire.\u003c/p\u003e\n\u003cp\u003eWhoosh.\u003c/p\u003e\n\u003cp\u003eThe flames shot skyward. I shrieked and fell back, hitting the ground hard enough to make my teeth rattle. The machete clattered in one direction, Will in the other. But my gaze was riveted on Zee.\u003c/p\u003e\n\u003cp\u003eThe moon shone in a bright silver stream through the trees, hitting her and her alone. The light bathed her face, turning her skin an ethereal white as if she glowed from within.\u003c/p\u003e\n\u003cp\u003eZee plucked the totem from the fire, tossed the icon around her neck. The eyes of the stone wolf flared flame red. My blood stained her uniform shirt. It didn\u0027t matter. The shirt ripped open as she changed.\u003c/p\u003e\n\u003cp\u003eThe Indians\u0027chanting grew louder. The wolves began to howl. Mandenauer shouted something, but I couldn\u0027t hear him, and I couldn\u0027t take my eyes from Zee.\u003c/p\u003e\n\u003cp\u003eThe change was unlike anything I\u0027d seen before. She didn\u0027t become a wolf like Clyde -\u0026nbsp;\u0026nbsp;not completely. Instead, she remained upright, bipedal. White fur sprouted from her pores. Her feet became paws, but her hands stayed the same, as ears appeared on top of her head. Whiskers sprang from her lip; her nose and her mouth didn\u0027t change.\u003c/p\u003e\n\u003cp\u003eI blinked and she was a woman-beast.\u003c/p\u003e\n\u003cp\u003eAs if a switch had been thrown in the sky, the silver light of the moon went under a cloud. The Indians stopped chanting. The wolves went silent. Zee turned to me.\u003c/p\u003e\n\u003cp\u003eUgh, that just wasn\u0027t right.\u003c/p\u003e\n\u003cp\u003eWerewolves had human eyes. But Zee\u0027s eyes had gone wolf. With fur all over her face, and the canines she revealed when she smiled, the effect was pretty repulsive. That wasn\u0027t even taking into account the body of a human, covered with fur. She twirled for me, as if showing off a new dress.\u003c/p\u003e\n\u003cp\u003e\"Uh, nice tail,\" I managed.\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003eHer voice was different -\u0026nbsp;\u0026nbsp;gravelly, more a growl than a smoker\u0027s grumble.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t resemble the wolf god in the drawing, but I doubted the artist had ever seen one, either.\u003c/p\u003e\n\u003cp\u003e\"Walking upright is good,\" Zee murmured. \"And talking.\" She wiggled her fingers. \"Opposable thumbs will come in handy.\"\u003c/p\u003e\n\u003cp\u003e\"I bet.\"\u003c/p\u003e\n\u003cp\u003eThere was a flash of movement behind her and a sudden snarl from one of the wolves. Zee turned, and Will plunged the machete into her chest.\u003c/p\u003e\n\u003cp\u003eAll I could do was blink, shocked. Zee stared down at the hilt of the knife; then she lifted her gaze to Will. \"You have got to be kidding me with this.\"\u003c/p\u003e\n\u003cp\u003eShe grasped the machete and yanked it out, then tossed the thing into the bushes. A sickening slurping, sucking sound came from her chest. As I watched, the wound closed before it even had time to bleed.\u003c/p\u003e\n\u003cp\u003e\"Told you they\u0027d come in handy.\" She wiggled her thumbs. Then she backhanded Will so hard he flew into the forest in the wake of the knife.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t realize I\u0027d jumped to my feet and taken several steps after him until Zee grabbed me.\u003c/p\u003e\n\u003cp\u003e\"Not so fast.\" She leaned closer. \"How about a little nibble?\"\u003c/p\u003e\n\u003cp\u003eI backed up; she let me go. The guns were still behind her. I wasn\u0027t going to get to them anytime soon.\u003c/p\u003e\n\u003cp\u003eWill was unconscious, maybe dead. Mandenauer was still surrounded by wolves, if they hadn\u0027t eaten him already.\u003c/p\u003e\n\u003cp\u003eWe were, to put it in the usual vernacular, screwed.\u003c/p\u003e\n\u003cp\u003e\"Join me, Jessie. I\u0027ll rule; you can be my right-hand woman. We\u0027ll have so much fun.\"\u003c/p\u003e\n\u003cp\u003e\"All I have to do is get furry.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not so bad. You might even grow to like it.\" She waved her hand at the werewolf army. \"Most of them do. Embrace your inner wolf, girl. Or die.\"\u003c/p\u003e\n\u003cp\u003eA movement from the forest caught my attention. I cast my eyes toward the ground. \"Let me think a minute.\"\u003c/p\u003e\n\u003cp\u003e\"A minute, starting now.\"\u003c/p\u003e\n\u003cp\u003eI made a great show of rubbing my head. It still hurt, but what I really wanted to do was see behind Zee without her following my gaze.\u003c/p\u003e\n\u003cp\u003eWill hovered in the sparse tree line at the edge of the forest. Though his lip was bloody, his cheek already swollen, he didn\u0027t hesitate. He grabbed my pistol from the pile. Unfortunately, his hands were still bound and he fumbled, unable to lift the thing or fire it.\u003c/p\u003e\n\u003cp\u003eHis dismayed gaze met mine and I held out my hand. He tossed me the pistol just as I kicked Zee in the chest. Her wound might have healed, but from the way she howled it still hurt like a bitch.\u003c/p\u003e\n\u003cp\u003eThe gun connected with my palm as she gained her feet. Would silver bullets work on the wolf god? Only one way to find out. I shot her as she whispered my name.\u003c/p\u003e\n\u003cp\u003eAfter the incident with the machete, I half-expected Zee to laugh and kick my ass. Instead, flames shot from the wound, so bright I had to shield my eyes. The wolves howled mournfully.\u003c/p\u003e\n\u003cp\u003eWhen I lowered my hands, a great white wolf lay at my feet. She was beautiful and she was dead. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-40.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
