{"id":89596,"no":8,"title":"Page 8","content":"\u003cp\u003eAfter Clyde reamed out Bozeman one more time for the road, he beckoned to me. Leaving Mandenauer with a map of the area that the teeny-tiny secretary had found - I really needed to ask her name, or not -\u0026nbsp;\u0026nbsp;I joined him in the ME\u0027s office.\u003c/p\u003e\n\u003cp\u003eHe closed the door. \"Jessie, you wound me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry?\"\u003c/p\u003e\n\u003cp\u003eClyde frowned, uncertain if I was apologizing or asking what in hell I\u0027d done to disappoint him now.\u003c/p\u003e\n\u003cp\u003eSince I\u0027d never been much for apologizing, he chose the latter, and he was right.\u003c/p\u003e\n\u003cp\u003e\"You have information about this case, which is now on the front burner for all of us, and you don\u0027t tell me?\"\u003c/p\u003e\n\u003cp\u003e\"Clyde, I -\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"What else do you know?\"\u003c/p\u003e\n\u003cp\u003eHis black eyes were intense, and his jaw pumped up and down even though he had no tobacco. I resisted the urge to point out that he shouldn\u0027t bother with the mouth cancer aid if he could get the same relief with phantom chewing. Clyde wasn\u0027t in the mood for my wit.\u003c/p\u003e\n\u003cp\u003eQuickly I told him everything I knew. When I got to the part about Professor Cadotte, he interrupted.\u003c/p\u003e\n\u003cp\u003e\"William Cadotte?\"\u003c/p\u003e\n\u003cp\u003eHell. I should have left the guy\u0027s name out of it.\u003c/p\u003e\n\u003cp\u003e\"Yeah. That\u0027s him.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s trouble, Jess. Big trouble.\"\u003c/p\u003e\n\u003cp\u003eI frowned. When Clyde called me Jess, he was serious. \"He seemed harmless enough to me.\"\u003c/p\u003e\n\u003cp\u003eNot really. He\u0027d seemed very, very dangerous. To my celibacy.\u003c/p\u003e\n\u003cp\u003eClyde paced the room, tense, edgy. He reminded me of a caged animal, and that just wasn\u0027t like Clyde.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s an egghead. An activist.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s Ojibwe, just like you.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not like me. I\u0027m Lac du Flambeau. He\u0027s Grand Portage. That\u0027s as different as the Welsh and the English.\"\u003c/p\u003e\n\u003cp\u003eOkay. I knew each band considered themselves separate from the other. I hadn\u0027t realized how separate.\u003c/p\u003e\n\u003cp\u003eOr maybe that was just Clyde\u0027s point of view.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d think you\u0027d approve of someone who stood up for the Indians.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s standing up and stirring up. I just want to live my life. Do my job. Be myself. I don\u0027t need some pretty boy smart-mouth getting everyone angry at me on principle.\"\u003c/p\u003e\n\u003cp\u003eCadotte had certainly stirred me up, but I had a hard time believing he would spend time stirring up the community just for the fun of it, and I told Clyde so.\u003c/p\u003e\n\u003cp\u003eThe last part. Not the first.\u003c/p\u003e\n\u003cp\u003e\"Maybe he\u0027s changed. But I doubt it. Stay away from him, Jess.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll do my best.\"\u003c/p\u003e\n\u003cp\u003eAnd I would. Cadotte made me nervous in more ways than one, something I did not need when all hell was about to break loose in Miniwa. Then I remembered.\u003c/p\u003e\n\u003cp\u003e\"I will have to see him one more time.\"\u003c/p\u003e\n\u003cp\u003e\"What for?\"\u003c/p\u003e\n\u003cp\u003e\"To get the totem back.\"\u003c/p\u003e\n\u003cp\u003e\"You gave him the totem?\" His shout rattled the windows in Bozeman\u0027s office. \"Are you nuts?\"\u003c/p\u003e\n\u003cp\u003eI was getting mighty sick of being yelied at. \"I was doing my job, Clyde.\"\u003c/p\u003e\n\u003cp\u003e\"By giving evidence to a convict?\"\u003c/p\u003e\n\u003cp\u003e\"Convict?\"\u003c/p\u003e\n\u003cp\u003e\"William Cadotte has been arrested more times than he\u0027s been laid.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027 And how would you know how many times he\u0027s been laid?\"\u003c/p\u003e\n\u003cp\u003e\" \u0027 With a face like his, it\u0027s no doubt daily.\"\u003c/p\u003e\n\u003cp\u003eSince I had to agree, I let that one pass.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s he been arrested for?\"\u003c/p\u003e\n\u003cp\u003e\"Disturbing the peace. Inciting a riot.\"\u003c/p\u003e\n\u003cp\u003e\"Nuisance stuff.\"\u003c/p\u003e\n\u003cp\u003e\"Breaking the law isn\u0027t a nuisance.\"\u003c/p\u003e\n\u003cp\u003e\"You know as well as I do that half the folks above the age of fifty have those charges on their records. It was called protesting if I remember my history books correctly.\"\u003c/p\u003e\n\u003cp\u003e\"Cadotte isn\u0027t over fifty.\"\u003c/p\u003e\n\u003cp\u003e\"I noticed.\"\u003c/p\u003e\n\u003cp\u003eHis gaze had been intense before, now it went sharp and suspicious. \"You\u0027d better watch yourself.\u003c/p\u003e\n\u003cp\u003eAssociating with a known troublemaker will not improve your career options.\"\u003c/p\u003e\n\u003cp\u003eMy heart gave a sharp thud. All I had was my job, and I loved it. Being a cop was what I did, who I was. It was the only thing I\u0027d ever been any good at.\u003c/p\u003e\n\u003cp\u003e\"Are you threatening me, Clyde?\"\u003c/p\u003e\n\u003cp\u003e\"No. Just givin\u0027 you good advice.\"\u003c/p\u003e\n\u003cp\u003eI knew a threat when I heard one, having given enough of my own to know the difference.\u003c/p\u003e\n\u003cp\u003e\"Get that totem back, Officer. Now.\"\u003c/p\u003e\n\u003cp\u003eI executed a military salute, then clicked my heels and goose-stepped out of the office. From the expression on Clyde\u0027s face, he did not find me funny.\u003c/p\u003e\n\u003cp\u003eMy thoughts turned to the professor, and I sighed, then pulled out my cell phone. Best put an end to any contact with him before 1 lost my head and my job.\u003c/p\u003e\n\u003cp\u003eI dialed his office. A machine picked up. \"This is William Cadotte. I\u0027m not in right now, but if you\u0027ll leave a message I\u0027ll call you back as soon as I am. My office hours are Monday through Friday from one to three.\"\u003c/p\u003e\n\u003cp\u003eI glanced at my watch. I\u0027d just missed him.\u003c/p\u003e\n\u003cp\u003eBeeep!\u003c/p\u003e\n\u003cp\u003eI started at the loud noise. \"I... um, this is J -\u0026nbsp;\u0026nbsp;I mean Officer McQuade. We met yesterday?\"\u003c/p\u003e\n\u003cp\u003eI must have sounded as stupid as I felt, because Man-denauer lifted his head from his perusal of the map and contemplated me with a lift of his off-white brows.\u003c/p\u003e\n\u003cp\u003eI turned my back on him and came face-to-face with Clyde, who stood in the doorway to Bozeman\u0027s office. Sheesh, could I even finish the call before he was on my case?\u003c/p\u003e\n\u003cp\u003e\"I need the totem right away. Call me.\" hit the end button, then tucked the phone back into its pocket on my belt. \"Let\u0027s go!\" I called to Manden-auer. \"I\u0027ll take you out to the accident site.\"\u003c/p\u003e\n\u003cp\u003e\"Jessie,\" Clyde said.\u003c/p\u003e\n\u003cp\u003eI gave an exaggerated sigh. \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll check out Karen Larson\u0027s place. Then you don\u0027t have to.\"\u003c/p\u003e\n\u003cp\u003eI gave a sharp nod and escaped the ME\u0027s office. Moments later Mandenauer and I were headed down Highway 199 in my patrol car.\u003c/p\u003e\n\u003cp\u003eI was still a bit steamed over Clyde\u0027s telling me to stay away from Cadotte. Not that I\u0027d planned on being near him more than was necessary -\u0026nbsp;\u0026nbsp;I may be sarcastic, but I\u0027m not stupid -\u0026nbsp;\u0026nbsp;however, Clyde\u0027s threat only made me want to see Cadotte a few times just for the hell of it. I guess that makes me stubborn, too.\u003c/p\u003e\n\u003cp\u003eHow convenient that Cadotte\u0027s cabin was right on the trail I had been ordered -\u0026nbsp;\u0026nbsp;by Clyde -\u0026nbsp;\u0026nbsp;to show our guest.\u003c/p\u003e\n\u003cp\u003eMandenauer was quiet on the drive to the scene of the accident. I glanced at him once. He appeared asleep, his head tilted back against the headrest, but his eyes weren\u0027t all the way closed. I could see the whites beneath his fluttering eyelids.\u003c/p\u003e\n\u003cp\u003eCreepy. I\u0027d have been afraid he was dead except I could see his sunken chest rising slow and steady.\u003c/p\u003e\n\u003cp\u003eThat would be all I\u0027d need. To have Clyde\u0027s precious Jdger-Sucher turn up dead in my car.\u003c/p\u003e\n\u003cp\u003eI parked the Crown Victoria on the shoulder of the road. The skid marks from Karen\u0027s SUV stood out dark against the gray pavement. I glanced at Mandenauer. He was awake.\u003c/p\u003e\n\u003cp\u003e\"Is there anything you would like to tell me about the accident? Anything I should know that will help me to finish this as quickly as I can?\"\u003c/p\u003e\n\u003cp\u003eHe stared at me intently, as if he could force me by his will alone to spill some secret I was guarding. But I didn\u0027t have any. Except my embarrassing sexual infatuation with the professor. But that wouldn\u0027t help Mandenauer kill the wolf -\u0026nbsp;\u0026nbsp;or most likely wolves by now.\u003c/p\u003e\n\u003cp\u003e\"You read my accident report?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Before you arrived at the station. Cut-and-dried, as you say.\"\u003c/p\u003e\n\u003cp\u003eI thought about the totem, Karen\u0027s strange behavior at the scene, and her even stranger behavior later.\u003c/p\u003e\n\u003cp\u003e\"Or perhaps not?\" he murmured.\u003c/p\u003e\n\u003cp\u003eI considered what I should tell and what I shouldn\u0027t.\u003c/p\u003e\n\u003cp\u003eIt wouldn\u0027t help Mandenauer to find the wolf if I told him about the totem. But I\u0027d already been bitched at enough today for not spilling everything I knew, so I gave him the basics.\u003c/p\u003e\n\u003cp\u003e\"This is what your sheriff was angry about?\"\u003c/p\u003e\n\u003cp\u003eI glanced at him quickly. The door to the office had been closed while Clyde and I talked.\u003c/p\u003e\n\u003cp\u003e\"Sheriff Johnston has a very loud voice and I, despite so many years on this earth, have very good ears.\"\u003c/p\u003e\n\u003cp\u003eI shrugged. \"I don\u0027t know what the totem means. It could have been there for weeks and have nothing to do with this accident at all.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps.\" Mandenauer got out of the car. I joined him. \"Or perhaps not,\" he repeated.\u003c/p\u003e\n\u003cp\u003e\"You sure are a decisive son of a gun, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eHis lips twitched. From what I\u0027d observed of Mandenauer thus far, he was almost snickering. \"I like to keep my mind open.\"\u003c/p\u003e\n\u003cp\u003e\"To what?\"\u003c/p\u003e\n\u003cp\u003e\"To all the possibilities that exist. You never know when something you think is irrelevant is in fact quite relevant.\"\u003c/p\u003e\n\u003cp\u003eI agreed with him there. Good police work involved observing from every angle and never letting a thing get by unnoticed. Which was why I wasn\u0027t allowing the totem issue to slide.\u003c/p\u003e\n\u003cp\u003e\"Now, if you\u0027ll walk me through the scene, show me where the wolf went and where you lost him, I will be most grateful.\"\u003c/p\u003e\n\u003cp\u003eI pointed to the skid marks from Miss Larson\u0027s SUV. \"Their length indicates she wasn\u0027t going all that fast, but she didn\u0027t have much warning. I hit a deer once, and it was as if the thing appeared out of the pavement. One minute the road was clear; the next I had venison on my grille.\"\u003c/p\u003e\n\u003cp\u003e\"Charming,\" Mandenauer murmured.\u003c/p\u003e\n\u003cp\u003eCharming. Yep, that was me.\u003c/p\u003e\n\u003cp\u003eI pointed toward the woods. \"Blood trail led this way.\"\u003c/p\u003e\n\u003cp\u003eHe followed me off the road. Not a car had gone by while we\u0027d been examining the evidence. Nothing new. Peak traffic for Highway 199 was Friday night and Sunday afternoon. Then it would be bumper-to-bumper from here to Stevens Point. Otherwise two cars every hour was a convention.\u003c/p\u003e\n\u003cp\u003eI inched down the slight embankment and stepped from the bright sunlight into the cool shadow of the woods. There were places in this forest so deep and dank the sun had never penetrated. I didn\u0027t like those places, avoided them if I could, but they were there.\u003c/p\u003e\n\u003cp\u003eI walked in the general direction of Cadotte\u0027s cottage. The blood trail was long gone, covered by dirt or leaves, erased by rain, perhaps eaten by another animal. If I hadn\u0027t followed the shiny black splotches through the moonlight myself, I would have a hard time believing today that they\u0027d existed at all.\u003c/p\u003e\n\u003cp\u003e\"You are sure this is the way?\" Mandenauer was keeping up without even breathing hard. He was in damn fine shape for an old guy.\u003c/p\u003e\n\u003cp\u003e\"I have a pretty good sense of direction.\"\u003c/p\u003e\n\u003cp\u003eTo be honest, in the light of day I didn\u0027t need my sense of direction or even the blood trail, because there was a footpath leading directly to Cadotte\u0027s cabin. In the dark, even with the moon shining so bright, the forest had seemed overgrown and tangled.\u003c/p\u003e\n\u003cp\u003eBut if I\u0027d been thinking clearly -\u0026nbsp;\u0026nbsp;then and now -\u0026nbsp;\u0026nbsp;I\u0027d have realized Cadotte had to get to his house someway. He couldn\u0027t drive, since there wasn\u0027t a road. He had to park somewhere and walk in.\u003c/p\u003e\n\u003cp\u003eJust as they had on my previous visit, the trees gave way to the clearing, and there was the cabin. Poof.\u003c/p\u003e\n\u003cp\u003eMandenauer\u0027s breath caught and he stopped. At least wasn\u0027t the only one who thought Cadotte\u0027s cottage seemed to pop up like something out of a fairy tale.\u003c/p\u003e\n\u003cp\u003eGrimms\u0027Fairy Tales, of course. The north woods were a little too creepy and dark to play a part in stories that featured silver-winged fairies and dancing mice. They leaned more toward little-girl-devouring wolves and cannibalistic witches.\u003c/p\u003e\n\u003cp\u003e\"I lost him over here.\"\u003c/p\u003e\n\u003cp\u003eI walked across the clearing and down the path a few feet. Mandenauer followed. He crouched and peered at the ground. Picked up some dirt, smelled it, and let the earth sift back through his fingers. Then he sniffed the wind.\u003c/p\u003e\n\u003cp\u003eI shrugged. Whatever tripped his trigger.\u003c/p\u003e\n\u003cp\u003e\"I need to speak with the owner of the cabin.\"\u003c/p\u003e\n\u003cp\u003eMandenauer nodded, waved his hand in an imperial dismissal, and moved a little farther into the woods.\u003c/p\u003e\n\u003cp\u003eI returned to the clearing and climbed the steps to the front door. No one appeared to be home, although why I thought that, since there was no car and never had been, I don\u0027t know. I knocked. No one answered, proving my theory.\u003c/p\u003e\n\u003cp\u003eI shaded my eyes and pressed my nose to the window in the door. A snarling wolf stared back at me.\u003c/p\u003e\n\u003cp\u003e\"Shit!\"\u003c/p\u003e\n\u003cp\u003eI leaped back, heart thundering, breath coming in sharp gasps, palm slapping onto the butt of my gun, any second expecting the animal to crash through the glass and go for my throat.\u003c/p\u003e\n\u003cp\u003eNothing happened.\u003c/p\u003e\n\u003cp\u003eI crept back to the window and glanced inside. The wolf was still there. But the animal wasn\u0027t going to come and get me anytime soon, since it was very, very dead.\u003c/p\u003e\n\u003cp\u003eOr at least it had better be, since it was hanging on the wall opposite the front door.\u003c/p\u003e\n\u003cp\u003eI don\u0027t know why the wolf bothered me so much. I have head-and-shoulder deer mounts on my walls.\u003c/p\u003e\n\u003cp\u003eWhy shoot trophy bucks if you aren\u0027t going to display them? You certainly can\u0027t eat them. They taste like smelly shoes boiled in rancid garbage water.\u003c/p\u003e\n\u003cp\u003eBut in my apartment the racks are used to hold my first-place shooting medals and, on occasion, my air-drying unmentionables. A head-and-shoulders mount of a wolf would be of no use to me at all.\u003c/p\u003e\n\u003cp\u003eI wondered why Cadotte had one.\u003c/p\u003e\n\u003cp\u003eI moved to the edge of the porch. \"You about ready to go?\" I called.\u003c/p\u003e\n\u003cp\u003eMy answer was the distant howl of a wolf.\u003c/p\u003e\n\u003cp\u003eToo far away to catch, still the sound made me jump off the top step and hurry toward where I\u0027d left the old man.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t there.\u003c/p\u003e\n\u003cp\u003eI cursed as I followed the trail. I shouldn\u0027t have had to warn him not to wander off. He was a big boy.\u003c/p\u003e\n\u003cp\u003eBut the number of people who got lost and died in the woods every year was staggering.\u003c/p\u003e\n\u003cp\u003eIf I lost Clyde\u0027s elite wolf hunter my name would be dumbshit for the rest of my life.\u003c/p\u003e\n\u003cp\u003eI shouted and heard nothing. I thrashed around and found the same. Suddenly I realized that the forest had gone still. Too still. Even the birds were quiet. Something was coming.\u003c/p\u003e\n\u003cp\u003eThe cry of the wolf sounded again -\u0026nbsp;\u0026nbsp;closer this time - and a second wolf answered.\u003c/p\u003e\n\u003cp\u003eWhy were they howling in the daylight? Had Man-denauer gone after them? He didn\u0027t have a gun, or at least one that I could see.\u003c/p\u003e\n\u003cp\u003eThe whisper of stirring foliage wended my way. I glanced up. The tops of the trees were as still as a lake beneath a new moon. Any wind there had been earlier had died. Then what was moving through the bushes?\u003c/p\u003e\n\u003cp\u003eA twig snapped. I froze. So did whatever was out there. I had my pistol in my hand. I don\u0027t know when I pulled it. I was merely glad that I had.\u003c/p\u003e\n\u003cp\u003eIn the dark, in the forest, it\u0027s nearly impossible to tell from which direction a sound is coming. I discovered it was just as impossible in the bright light of day. I stood amid the bushes and the trees as the back of my neck prickled. I was being watched.\u003c/p\u003e\n\u003cp\u003e\"Mandenauer?\" I shouted. \"Get back here, right now!\"\u003c/p\u003e\n\u003cp\u003eThat oughta work, my mind mocked. If he was here, he\u0027d be here.\u003c/p\u003e\n\u003cp\u003eMy breath rasped; my heart thundered; a trickle of sweat ran between my breasts and skated down my belly. I cocked the gun, and the birds began to chirp again.\u003c/p\u003e\n\u003cp\u003eA movement at the corner of my vision had me crouching and swinging my weapon in that direction.\u003c/p\u003e\n\u003cp\u003eMandenauer raised a brow. \"My, aren\u0027t we jumpy?\"\u003c/p\u003e\n\u003cp\u003eI uncocked the gun, but I didn\u0027t put it back into the holster. \"Yes, we are. Where were you?\"\u003c/p\u003e\n\u003cp\u003e\"Out there.\"\u003c/p\u003e\n\u003cp\u003eHe waved in a vague circular motion. The movement pulled his shirt tightly against his body and I saw the outline of a gun. I should have known.\u003c/p\u003e\n\u003cp\u003e\"Did you hear the wolves?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m old; I\u0027m not deaf.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t go after them, did you?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Those are not the animals I seek.\"\u003c/p\u003e\n\u003cp\u003eI frowned. \"How would you know?\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003eWhatever. I wanted to get out of here. I hated to admit it, but I\u0027d been well and truly spooked. Birds didn\u0027t stop twittering for no reason. And I didn\u0027t feel as if I were being watched unless I was.\u003c/p\u003e\n\u003cp\u003e\"Done?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Most certainly.\"\u003c/p\u003e\n\u003cp\u003eWe headed for the car and if we left more quickly than we\u0027d come, tough. I didn\u0027t get spooked often; when I did, it shook me.\u003c/p\u003e\n\u003cp\u003e\"You can put up the pistol, Officer.\"\u003c/p\u003e\n\u003cp\u003eI glanced down, surprised I still held my weapon in my hand. I was also surprised to discover I didn\u0027t want to put the gun away.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s your rifle?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Locked and loaded and back at the Eagle\u0027s Nest.\"\u003c/p\u003e\n\u003cp\u003eSo Mandenauer was staying at the Eagle\u0027s Nest Resort and Spa, spa being a relative term in Miniwa. It meant there were towels available by the lake and an ancient sauna that tilted drunkenly toward the water from its perch on a nearby hill.\u003c/p\u003e\n\u003cp\u003e\"A gun doesn\u0027t do you much good in the case under your bed.\" Or hidden beneath his shirt, for that matter.\u003c/p\u003e\n\u003cp\u003eMandenauer put a hand on my shoulder and I paused. \"The wolf will not attack us in broad daylight.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003eHe smiled as if I were simpleminded. \"It will not. Trust me.\"\u003c/p\u003e\n\u003cp\u003eI snorted. I trusted no one -\u0026nbsp;\u0026nbsp;except Zee and sometimes Clyde. I\u0027d learned the hard way that those you trusted the most were the ones who could hurt you the most, too. So my circle of trust was a very small circle.\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t trust me?\"\u003c/p\u003e\n\u003cp\u003eI gave him my \"do you think I\u0027m stupid?\" glare and he nodded. \"Good. Trust no one, Jessie. You will live longer that way.\"\u003c/p\u003e\n\u003cp\u003eMandenauer and I were in agreement on a lot more than I would have imagined.\u003c/p\u003e\n\u003cp\u003eI tightened my ringers on the grip of my pistol and was comforted. Other women might keep relics from their childhood -\u0026nbsp;\u0026nbsp;dolls, stuffed animals, blankets -\u0026nbsp;\u0026nbsp;and pull them out when the going got tough. Me? I preferred a .44 Magnum anytime.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t care how many wolves Mandenauer had killed, how many times those animals had behaved in a predictable manner; I wasn\u0027t going to bet my life, or even his, that this one -\u0026nbsp;\u0026nbsp;or twenty -\u0026nbsp;\u0026nbsp;would behave appropriately.\u003c/p\u003e\n\u003cp\u003eI remembered Karen Larson\u0027s eyes. I would remember them in my sleep for years to come. Right before she\u0027d died there\u0027d been a flicker of knowledge. She\u0027d still been in there behind the insanity caused by the virus, and she\u0027d been very, very afraid.\u003c/p\u003e\n\u003cp\u003eI hated being afraid. Fear smelled of weakness, and the weak did not survive. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-8.html","bookId":2088,"creation":"Oct 5, 2019 5:37:08 PM","modification":"Oct 5, 2019 5:37:08 PM"}
