{"id":77724,"no":3,"title":"Page 3","content":"\u003cp\u003eQuivering, Poppy endured his kneading, probing fingers and wondered if she were at the mercy of a madman. He pressed harder, exacting a sensation that was neither pleasure nor pain but some unfamiliar mingling of the two. She made a sound of distress, writhing helplessly. To her surprise, the burn of the pinched nerve eased, and her rigid muscles went lax with relief. She went still and let out a long breath, her head dropping.\u003c/p\u003e\n\u003cp\u003e“Better?” he asked, using both hands now, his thumbs stroking the back of her neck, slipping beneath the soft lace that trimmed the high-throated bodice of her dress.\u003c/p\u003e\n\u003cp\u003eThoroughly unnerved, Poppy tried to step away from him, but his hands clamped on her shoulders instantly. She cleared her throat and attempted a dignified tone. “Sir, I—I should like you to guide me out of here. My family will reward you. No questions will be—”\u003c/p\u003e\n\u003cp\u003e“Of course.” He released her slowly. “No one ever uses this passageway without my permission. I assumed that anyone in here was up to no good.”\u003c/p\u003e\n\u003cp\u003eThe comments bore a resemblance to an apology, although his tone wasn’t regretful in the least.\u003c/p\u003e\n\u003cp\u003e“I assure you, I had no intention of doing anything other than retrieving this atrocious animal.” She felt Dodger rustling near the hem of her skirts.\u003c/p\u003e\n\u003cp\u003eThe stranger bent and scooped up the ferret. Holding Dodger by the scruff of his neck, he handed him to Poppy.\u003c/p\u003e\n\u003cp\u003e“Thank you.” The ferret’s supple body went limp and compliant in Poppy’s grasp. As she might have expected, the letter was gone. “Dodger, you blasted thief—where is it? What have you done with it?”\u003c/p\u003e\n\u003cp\u003e“What are you looking for?”\u003c/p\u003e\n\u003cp\u003e“A letter,” Poppy said tensely. “Dodger stole it and carried it in here . . . it must be somewhere nearby.”\u003c/p\u003e\n\u003cp\u003e“It will be found later.”\u003c/p\u003e\n\u003cp\u003e“But it’s important.”\u003c/p\u003e\n\u003cp\u003e“Obviously, if you’ve gone to such trouble to recover it. Come with me.”\u003c/p\u003e\n\u003cp\u003eReluctantly Poppy murmured her assent and allowed him to take her elbow. “Where are we going?”\u003c/p\u003e\n\u003cp\u003eThere was no reply.\u003c/p\u003e\n\u003cp\u003e“I would prefer that no one knew about this,” Poppy ventured.\u003c/p\u003e\n\u003cp\u003e“I’m sure you would.”\u003c/p\u003e\n\u003cp\u003e“May I rely on your discretion, sir? I must avoid scandal at all costs.”\u003c/p\u003e\n\u003cp\u003e“Young women who wish to avoid scandal should probably stay in their hotel suites,” he pointed out unhelpfully.\u003c/p\u003e\n\u003cp\u003e“I was perfectly content to stay in my room,” Poppy protested. “It was only because of Dodger that I had to leave. I must have my letter back. And I’m certain my family will compensate you for your trouble, if you would—”\u003c/p\u003e\n\u003cp\u003e“Quiet.”\u003c/p\u003e\n\u003cp\u003eHe found his way through the shadow-tricked passageway with no difficulty at all, his grip on Poppy’s elbow gentle but inexorable. They did not go toward Mr. Brimbley’s office but instead went the opposite direction, for what seemed an interminable distance.\u003c/p\u003e\n\u003cp\u003eFinally the stranger stopped and turned to a place in the wall, and pushed a door open. “Go in.”\u003c/p\u003e\n\u003cp\u003eHesitantly Poppy preceded him into a well-lit room, a sort of parlor, with a row of Palladian windows overlooking the street. A heavy oak drafting table occupied one side of the room, and bookshelves lined nearly every inch of wall space. There was a pleasant and oddly familiar mixture of scents in the air—candle wax and vellum and ink and book dust—it smelled like her father’s old study.\u003c/p\u003e\n\u003cp\u003ePoppy turned toward the stranger, who had come into the room and closed the concealed door.\u003c/p\u003e\n\u003cp\u003eIt was difficult to ascertain his age—he appeared to be on the early side of his thirties, but there was an air of hard-bitten worldliness about him, a sense that he had seen enough of life to cease being surprised by anything. He had heavy, well-cut hair, black as midnight, and a fair complexion in which his dark brows stood out in striking contrast. And he was as handsome as Lucifer, his brows strong, the nose straight and defined, the mouth brooding. The angle of his jaw was sharp, tenacious, anchoring the grave features of a man who perhaps took everything—including himself—a bit too seriously.\u003c/p\u003e\n\u003cp\u003ePoppy felt herself flush as she stared into a pair of remarkable eyes . . . intense cool green with dark rims, shadowed by bristly black lashes. His gaze seemed to take her in, consuming every detail. She noticed faint shadows beneath his eyes, but they did nothing to impair his hard-faced good looks.\u003c/p\u003e\n\u003cp\u003eA gentleman would have uttered some pleasantry, something reassuring, but the stranger remained silent.\u003c/p\u003e\n\u003cp\u003eWhy did he stare at her like that? Who was he, and what authority did he wield in this place?\u003c/p\u003e\n\u003cp\u003eShe had to say something, anything, to break the tension. “The smell of books and candle wax,” she remarked inanely, “. . . it reminds me of my father’s study.”\u003c/p\u003e\n\u003cp\u003eThe man stepped toward her, and Poppy shrank back reflexively. They both went still. It seemed that questions filled the air between them as if they had been written in invisible ink.\u003c/p\u003e\n\u003cp\u003e“Your father passed away some time ago, I believe.” His voice matched the rest of him, polished, dark, inflexible. He had an interesting accent, not fully British, the vowels flat and open, the r’s heavy.\u003c/p\u003e\n\u003cp\u003ePoppy gave a bewildered nod.\u003c/p\u003e\n\u003cp\u003e“And your mother soon after,” he added.\u003c/p\u003e\n\u003cp\u003e“How . . . how do you know that?”\u003c/p\u003e\n\u003cp\u003e“It’s my business to know as much about the hotel guests as possible.”\u003c/p\u003e\n\u003cp\u003eDodger wriggled in her grasp. Poppy bent to set him down. The ferret pranced to an oversized chair near a small hearth, and settled deep into the velvet upholstery. \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-3.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
