{"id":77753,"no":32,"title":"Page 32","content":"\u003cp\u003eHarry tilted his head a little, studying her intently. “Ask for anything.”\u003c/p\u003e\n\u003cp\u003e“What if I wanted a castle?”\u003c/p\u003e\n\u003cp\u003e“Done,” he said promptly.\u003c/p\u003e\n\u003cp\u003e“Actually, I don’t want a castle. Too drafty. What about a diamond tiara?”\u003c/p\u003e\n\u003cp\u003e“Certainly. A modest one suitable for daytime wear, or something more elaborate?”\u003c/p\u003e\n\u003cp\u003ePoppy began to smile, when a few minutes earlier she had thought she would never smile again. She felt a surge of liking and gratitude. She couldn’t think of anyone else who would have been able to console her in these circumstances. But the smile turned bittersweet as she looked up at him once more.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said. “But I’m afraid no one can give me the one thing I truly want.”\u003c/p\u003e\n\u003cp\u003eRising on her toes, she pressed her lips sweetly to his cheek. It was a friendly kiss.\u003c/p\u003e\n\u003cp\u003eA good-bye kiss.\u003c/p\u003e\n\u003cp\u003eHarry looked down at her intently. His gaze flicked to something beyond her, before his mouth came down over hers with smoldering demand. Confounded by his sudden aggression, thrown off balance, she reached out for him reflexively. It was the wrong reaction, the wrong time and place . . . wrong to feel a surge of pleasure as he tasted and sweetly delved inside her mouth . . . but, as she was discovering, there were some temptations impossible to resist. And his kisses seemed to wring a helpless response from every part of her, a bonfire of feeling. She couldn’t catch up with her own pulse, her own breath. Her nerves lit with sparks of sensation, while stars cascaded all around her, little bursts of light striking the tiles of the terrace floor with the sound of breaking crystal . . .\u003c/p\u003e\n\u003cp\u003eTrying to ignore the harsh noise, Poppy leaned harder against him. But Harry eased her away with a quiet murmur, and guided her head to his chest as if he were trying to protect her.\u003c/p\u003e\n\u003cp\u003eHer lashes lifted, and she went cold and still as she saw that someone . . . several someones . . . had come out to the balcony.\u003c/p\u003e\n\u003cp\u003eLady Norbury, who had dropped a glass of champagne in her surprise. And Lord Norbury, and another elderly couple.\u003c/p\u003e\n\u003cp\u003eAnd Michael, with a blonde woman on his arm.\u003c/p\u003e\n\u003cp\u003eThey all stared at Poppy and Harry in shock.\u003c/p\u003e\n\u003cp\u003eHad the angel of death appeared at that moment, complete with black wings and a gleaming scythe, Poppy would have run to him with open arms. Because being caught on the balcony kissing Harry Rutledge was not just a scandal . . . it would be the stuff of legend. She was ruined. Her life was ruined. Her family was ruined. Everyone in London would know by sunrise.\u003c/p\u003e\n\u003cp\u003eDumbstruck by the sheer awfulness of the situation, Poppy looked helplessly up at Harry. And for one confusing moment, she thought she saw a flicker of predatory satisfaction in his eyes. But then his expression changed.\u003c/p\u003e\n\u003cp\u003e“This might be difficult for us to explain,” he said.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eAs Leo made his way through the Norbury mansion, he was privately amused as he saw some of his friends—young lords whose debauchery had put even his past exploits to shame—now starched and buttoned up and impeccably mannered. Not for the first time, Leo reflected how unfair it was that men were allowed to get away with so much more than women.\u003c/p\u003e\n\u003cp\u003eThis business of manners, for example . . . he had seen his sisters struggling to remember hundreds of inane points of etiquette that were expected of upper-class society. Whereas Leo’s main interest in the rules of etiquette was how to break them. And he, as a man with a title, was unfailingly excused for nearly anything. Ladies at a supper party were criticized behind their backs if they used the wrong fork for the fish course, while a man could drink to excess or make some off-color remark, and everyone pretended not to notice.\u003c/p\u003e\n\u003cp\u003eNonchalantly, Leo entered the ballroom and stood to the side of the triple-width doorway, surveying the scene. Dull, dull, dull. There was the ever-present row of virgins and their chaperones, and clusters of gossiping women that reminded him of nothing so much as a hen yard.\u003c/p\u003e\n\u003cp\u003eHis attention was snared by the sight of Catherine Marks, standing in the corner and watching as Beatrix and her partner danced.\u003c/p\u003e\n\u003cp\u003eMarks looked tense as usual, her slender dark-clad figure as straight as a ramrod. She never missed an opportunity to disdain Leo and treat him as if he had all the intellectual prowess of an oyster. And she was resistant to any attempts at charm or humor. Like any sensible man, Leo did his best to avoid her.\u003c/p\u003e\n\u003cp\u003eBut to his chagrin, Leo couldn’t stop himself from wondering what Catherine Marks would look like after a good, thorough tupping. Her spectacles cast aside, her silky hair loose and tumbled, her pale body released from the contraption of stays and laces . . .\u003c/p\u003e\n\u003cp\u003eSuddenly nothing at the ball seemed quite so interesting as his sisters’ companion.\u003c/p\u003e\n\u003cp\u003eLeo decided to go bother her.\u003c/p\u003e\n\u003cp\u003eHe sauntered to her. “Hello, Marks. How is the—”\u003c/p\u003e\n\u003cp\u003e“Where have you been?” she whispered violently, her eyes flashing furiously behind her spectacles.\u003c/p\u003e\n\u003cp\u003e“In the card room. And then I had a plate of supper. Where else should I have been?”\u003c/p\u003e\n\u003cp\u003e“You were supposed to have been helping with Poppy.”\u003c/p\u003e\n\u003cp\u003e“Helping with what? I promised I would dance with her, and here I am.” Leo paused and glanced around them. “Where is she?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003eHe frowned. “How can you not know? You mean to say you’ve lost her?”\u003c/p\u003e\n\u003cp\u003e“The last time I saw Poppy was approximately ten minutes ago, when she went to dance with Mr. Rutledge.”\u003c/p\u003e\n\u003cp\u003e“The hotel owner? He never appears at these things.”\u003c/p\u003e\n\u003cp\u003e“He did this evening,” Miss Marks said grimly, keeping her tone low. “And now they’ve disappeared. Together. You must find her, my lord. Now. She is in danger of being ruined.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-32.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
