{"id":77754,"no":33,"title":"Page 33","content":"\u003cp\u003e“Why haven’t you gone after her?”\u003c/p\u003e\n\u003cp\u003e“Someone has to keep an eye on Beatrix, or she’ll disappear as well. Besides, I didn’t want to draw attention to Poppy’s absence. Go find her, and be quick about it.”\u003c/p\u003e\n\u003cp\u003eLeo scowled. “Marks, in case you hadn’t noticed, other servants don’t snap out orders to their masters. So if you don’t mind—”\u003c/p\u003e\n\u003cp\u003e“You’re not my master,” she had the nerve to say, glaring insolently at him.\u003c/p\u003e\n\u003cp\u003eOh, I’d like to be, Leo thought in a quick, angry flush of arousal, every hair on his body standing erect. Along with a certain feature of his anatomy. He decided to leave before her effect on him became obvious. “All right, settle your feathers. I’ll find Poppy.”\u003c/p\u003e\n\u003cp\u003e“Start looking in all the places where you would take a woman to compromise her. There can’t be that many.”\u003c/p\u003e\n\u003cp\u003e“Yes, there can. You’d be amazed at the variety of places I’ve—”\u003c/p\u003e\n\u003cp\u003e“Please,” she muttered. “I’m feeling nauseous enough at the moment.”\u003c/p\u003e\n\u003cp\u003eCasting an assessing glance around the ballroom, Leo spied the row of French doors at the far end. He headed for the balcony, trying to go as fast as possible without appearing to be in a hurry. It was his cursed luck to be snared in two separate conversations on the way, one with a friend who wanted his opinion of a certain lady, the other with a dowager who thought the punch was “off” and wanted to know if he’d tried it.\u003c/p\u003e\n\u003cp\u003eFinally Leo made it to one of the doors and slipped outside.\u003c/p\u003e\n\u003cp\u003eHis eyes widened as he beheld an astonishing tableau. Poppy, clasped in the arms of a tall black-haired man . . . being watched by a small group of people who had come onto the balcony through another set of doors. And one of them was Michael Bayning, who looked sick with jealousy and outrage.\u003c/p\u003e\n\u003cp\u003eThe black-haired man lifted his head, murmured something to Poppy, and leveled a cool glance at Michael Bayning.\u003c/p\u003e\n\u003cp\u003eA glance of triumph.\u003c/p\u003e\n\u003cp\u003eIt only lasted a moment, but Leo saw it, and recognized it for what it was.\u003c/p\u003e\n\u003cp\u003e“Holy hell,” Leo whispered.\u003c/p\u003e\n\u003cp\u003eHis sister was in considerable trouble.\u003c/p\u003e\n\u003cp\u003eWhen a Hathaway caused a scandal, they never did it by half measures.\u003c/p\u003e\n\u003cp\u003eBy the time Leo steered Poppy back into the ballroom and collected Miss Marks and Beatrix, the scandal had started to spread. In no time at all, Cam and Amelia had found them, and the family drew together in a protective cluster around Poppy.\u003c/p\u003e\n\u003cp\u003e“What happened?” Cam asked, looking deceptively relaxed, his hazel eyes alert.\u003c/p\u003e\n\u003cp\u003e“Harry Rutledge happened,” Leo muttered. “I’ll explain everything shortly. For now, let’s leave here as quickly as possible and meet Rutledge at the hotel.”\u003c/p\u003e\n\u003cp\u003eAmelia leaned close to murmur into Poppy’s scarlet ear. “It’s all right, dear. Whatever it is, we’ll fix it.”\u003c/p\u003e\n\u003cp\u003e“You can’t,” Poppy whispered. “No one can.”\u003c/p\u003e\n\u003cp\u003eLeo looked past his sisters and saw the subdued uproar of the crowd. Everyone was staring at them. “It’s like watching an ocean wave,” he remarked. “One can literally see the scandal sweep through the room.”\u003c/p\u003e\n\u003cp\u003eCam looked sardonic and resigned. “Gadjos,” he muttered. “Leo, why don’t you take your sister and Miss Marks in your carriage? Amelia and I will make our farewells to the Norburys.”\u003c/p\u003e\n\u003cp\u003eIn a daze of wretchedness, Poppy allowed Leo to usher her outside to his carriage. All of them were silent until the vehicle had pulled away from the mansion with a sharp lurch.\u003c/p\u003e\n\u003cp\u003eBeatrix was the first to speak. “Have you been compromised, Poppy?” she asked with concern. “As Win was last year?”\u003c/p\u003e\n\u003cp\u003e“Yes, she has,” Leo replied, while Poppy let out a little moan. “It’s a bad habit our family’s gotten into. Marks, you’d better write a poem about it.”\u003c/p\u003e\n\u003cp\u003e“This disaster could have been avoided,” the companion told him tersely, “had you found her sooner.”\u003c/p\u003e\n\u003cp\u003e“It could also have been avoided if you hadn’t lost her in the first place,” Leo shot back.\u003c/p\u003e\n\u003cp\u003e“I’m responsible,” Poppy broke in, her voice muffled against Leo’s shoulder. “I went off with Mr. Rutledge. I had just seen Mr. Bayning in the ballroom, and I was distraught, and Mr. Rutledge asked me to dance but I needed air and we went out to the balcony—”\u003c/p\u003e\n\u003cp\u003e“No, I’m responsible,” Miss Marks said, looking equally as upset. “I let you dance with him.”\u003c/p\u003e\n\u003cp\u003e“It does no good to assign blame,” Leo said. “What’s done is done. But if anyone is responsible, it’s Rutledge, who apparently came to the ball on a hunting expedition.”\u003c/p\u003e\n\u003cp\u003e“What?” Poppy lifted her head and looked at him in bewilderment. “You think he . . . no, it was an accident, Leo. Mr. Rutledge didn’t intend to compromise me.”\u003c/p\u003e\n\u003cp\u003e“It was deliberate,” Miss Marks said. “Harry Rutledge never gets ‘caught’ doing anything. If he was seen in a compromising situation, it was because he wanted to be seen.”\u003c/p\u003e\n\u003cp\u003eLeo looked at her alertly. “How do you know so much about Rutledge?”\u003c/p\u003e\n\u003cp\u003eThe companion flushed. It seemed to require an effort for her to hold his gaze. “His reputation, of course.”\u003c/p\u003e\n\u003cp\u003eLeo’s attention was diverted as Poppy buried her face against his shoulder. “I’m going to die of humiliation,” she said.\u003c/p\u003e\n\u003cp\u003e“No, you won’t,” Leo replied. “I’m an expert on humiliation, and if it were fatal, I’d have died a dozen times by now.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-33.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
