{"id":77757,"no":36,"title":"Page 36","content":"\u003cp\u003e“Wait. Before you make a decision, I’d like to hear what you have to say. What your feelings are.”\u003c/p\u003e\n\u003cp\u003eWell. That was a change. Poppy blinked in disconcertion as she reflected that her family and Miss Marks, well intentioned as they had been, had told her what they thought she should do. Her own thoughts and feelings hadn’t received much attention.\u003c/p\u003e\n\u003cp\u003e“Well . . . you’re a stranger,” she said. “And I don’t think I should make a decision about my future when I’m in love with Mr. Bayning.”\u003c/p\u003e\n\u003cp\u003e“You still have hopes of marrying him?”\u003c/p\u003e\n\u003cp\u003e“Oh, no. All possibility of that is gone. But the feelings are still there, and until enough time passes for me to forget him, I don’t trust my own judgment.”\u003c/p\u003e\n\u003cp\u003e“That’s very sensible of you. Except that some decisions can’t be put off. And I’m afraid this is one of them.” Harry paused before asking gently, “If you go back to Hampshire under the cloud of scandal, you know what to expect, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes. There will be . . . unpleasantness, to say the least.” It was a mild word for the disdain, pity and scorn she would receive as a fallen woman. And worse, it might ruin Beatrix’s chances of marrying well. “And my family won’t be able to shield me from it,” she added dully.\u003c/p\u003e\n\u003cp\u003e“But I could,” Harry said, reaching for the braided coil at the top of her head, using a fingertip to nudge an anchoring pin further into place. “I could if you marry me. Otherwise, I’m powerless to do anything for you. And no matter how anyone else advises you, Poppy, you’re the one who will bear the brunt of the scandal.”\u003c/p\u003e\n\u003cp\u003ePoppy tried, but couldn’t quite manage, a weary smile. “So much for my dreams of a quiet, ordinary life. My choice is either to live as a social outcast or as the wife of a hotelier.”\u003c/p\u003e\n\u003cp\u003e“Is the latter choice so unappealing?”\u003c/p\u003e\n\u003cp\u003e“It’s not what I’ve always hoped for,” she said frankly.\u003c/p\u003e\n\u003cp\u003eHarry absorbed that, considered it, while reaching out to skim his fingers over clusters of pink roses. “It wouldn’t be a peaceful existence in a country cottage,” he acknowledged. “We would live at the hotel most of the year. But there are times we could go to the country. If you want a house in Hampshire as a wedding present, it’s yours. And a carriage of your own, and a team of four at your disposal.”\u003c/p\u003e\n\u003cp\u003eExactly what they said he’d do, Poppy thought, and sent him a wry glance. “Are you trying to bribe me, Harry?”\u003c/p\u003e\n\u003cp\u003e“Yes. Is it working?”\u003c/p\u003e\n\u003cp\u003eHis hopeful tone made her smile. “No, although it was a very good effort.” Hearing the rustling of foliage, Poppy called out, “Beatrix, are you there?”\u003c/p\u003e\n\u003cp\u003e“Two rows away,” came her sister’s cheerful reply. “Medusa found some worms!”\u003c/p\u003e\n\u003cp\u003e“Lovely.”\u003c/p\u003e\n\u003cp\u003eHarry gave Poppy a bemused glance. “Who . . . or should I say what . . . is Medusa?”\u003c/p\u003e\n\u003cp\u003e“Hedgehog,” she replied. “Medusa’s getting a bit plump, and Beatrix is exercising her.”\u003c/p\u003e\n\u003cp\u003eTo Harry’s credit, he remained composed as he remarked, “You know, I pay my staff a fortune to keep those out of the garden.”\u003c/p\u003e\n\u003cp\u003e“Oh, have no fear. Medusa is merely a guest hedgehog. She would never run away from Beatrix.”\u003c/p\u003e\n\u003cp\u003e“Guest hedgehog,” Harry repeated, a smile working across his mouth. He paced a few impatient steps before turning to face her. A new urgency filtered through his voice. “Poppy. Tell me what your worries are, and I’ll try to answer them. There must be some terms we can come to.”\u003c/p\u003e\n\u003cp\u003e“You are persistent,” she said. “They told me you would be.”\u003c/p\u003e\n\u003cp\u003e“I’m everything they told you and worse,” Harry said without hesitation. “But what they didn’t tell you is that you are the most desirable and fascinating woman I’ve ever met, and I would do anything to have you.”\u003c/p\u003e\n\u003cp\u003eIt was insanely flattering to have a man like Harry Rutledge pursuing her, especially after the hurt inflicted by Michael Bayning. Poppy flushed with cheek-stinging pleasure, as if she’d been lying too long in the sun. She found herself thinking, Perhaps I’ll consider it, just for a moment, in a purely hypothetical sense. Harry Rutledge and me . . .\u003c/p\u003e\n\u003cp\u003e“I have questions,” she said.\u003c/p\u003e\n\u003cp\u003e“Ask away.”\u003c/p\u003e\n\u003cp\u003ePoppy decided to be blunt. “Are you dangerous? Everyone says you are.”\u003c/p\u003e\n\u003cp\u003e“To you? No.”\u003c/p\u003e\n\u003cp\u003e“To others?”\u003c/p\u003e\n\u003cp\u003eHarry shrugged innocently. “I’m a hotelier. How dangerous could I be?”\u003c/p\u003e\n\u003cp\u003ePoppy gave him a dubious glance, not at all deceived. “I may be gullible, Harry, but I’m not brainless. You know the rumors . . . you’re well aware of your reputation. Are you as unscrupulous as you’re made out to be?”\u003c/p\u003e\n\u003cp\u003eHarry was quiet for a long moment, his gaze fixed on a distant cluster of blossoms. The sun threw its light into the filter of branches, scattering leaf shadows over the pair in the arbor.\u003c/p\u003e\n\u003cp\u003eEventually he lifted his head and looked at her directly, his eyes greener than the sunstruck rose leaves. “I’m not a gentleman,” he said. “Not by birth, and not by character. Very few men can afford to be honorable while trying to make a success of themselves. I don’t lie, but I rarely tell everything I know. I’m not a religious man, nor a spiritual one. I act in my own interests, and I make no secret of it. However, I always keep my side of a bargain, I don’t cheat, and I pay my debts.”\u003c/p\u003e\n\u003cp\u003ePausing, Harry fished in his coat pocket, pulled out a penknife, and reached up to cut a rose in full bloom. After neatly severing the stem, he occupied himself with stripping the thorns with the sharp little blade. “I would never use physical force against a woman, or anyone weaker than myself. I don’t smoke, take snuff, or chew tobacco. I always hold my liquor. I don’t sleep well. And I can make a clock from scratch.” Removing the last thorn, he handed the rose to her, and slipped the knife back into his pocket. \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-36.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
