{"id":77764,"no":43,"title":"Page 43","content":"\u003cp\u003eAlthough Harry knew a great deal about people, he knew nothing about being part of a family.\u003c/p\u003e\n\u003cp\u003eAfter Harry’s mother had run off with one of her lovers, his father had tried to get rid of every remaining trace of her existence. And he had done his best to forget that he even had a son, leaving Harry to the hotel staff and a succession of tutors.\u003c/p\u003e\n\u003cp\u003eHarry had few memories of his mother, only that she had been beautiful and had had golden hair. It seemed she had always been going out, away from him, forever elusive. He remembered crying for her once, clutching his hands in her velvet skirts, and she had tried to make him let go, laughing softly at his persistence.\u003c/p\u003e\n\u003cp\u003eIn the wake of his parents’ abandonment, Harry had taken his meals in the kitchen with the hotel employees. When he was sick, one or another of the maids had taken care of him. He saw families come and go, and he had learned to view them with the same detachment that the hotel staff did. Deep down Harry harbored a suspicion that the reason his mother had left, the reason his father never had anything to do with him, was because he was unlovable. And therefore he had no desire to be part of a family. Even if or when Poppy bore him children, Harry would never allow anyone close enough to form an attachment. He would never let himself be shackled that way. And yet he sometimes knew a fleeting envy for those who were capable of it, like the Hathaways.\u003c/p\u003e\n\u003cp\u003eThe breakfast wore on, with endless rounds of toasting. When Harry saw the betraying droop of Poppy’s shoulders, he deduced she’d had enough. He rose and made a short, gracious speech, offering his thanks for the honor of the guests’ presence on such a significant day.\u003c/p\u003e\n\u003cp\u003eIt was the signal for the bride to retire along with her bridesmaids. They would soon be followed by the general company, who would disperse to attend a variety of amusements for the rest of the day. Poppy paused at the doorway. As if she could feel Harry’s gaze on her, she turned to glance over her shoulder.\u003c/p\u003e\n\u003cp\u003eA warning flashed in her eyes, and it aroused him instantly. Poppy would not be a complacent bride, nor had he expected her to be. She would try to exact compensation for what he had done, and he would indulge her . . . up to a point. He wondered how she would react when he came to her that evening.\u003c/p\u003e\n\u003cp\u003eHarry tore his gaze away from his bride as he was approached by Kev Merripen, Poppy’s brother-in-law, a man who managed to stay relatively inconspicuous despite his size and striking appearance. He was a Romany Gypsy, tall and black haired, his austere exterior concealing a nature of dark intensity.\u003c/p\u003e\n\u003cp\u003e“Merripen,” Harry said pleasantly. “Did you enjoy the breakfast?”\u003c/p\u003e\n\u003cp\u003eThe Rom was in no mood for small talk. He stared at Harry with a gaze promising death. “Something is wrong,” he said. “If you’ve done something to harm Poppy, I will find you and rip your head from your—”\u003c/p\u003e\n\u003cp\u003e“Merripen!” came a cheerful exclamation as Leo suddenly appeared beside them. Harry didn’t miss the way Leo jabbed a warning elbow against the Gypsy’s ribs. “All charm and lightness, as usual. You’re supposed to congratulate the bridegroom, phral. Not threaten to dismember him.”\u003c/p\u003e\n\u003cp\u003e“It’s not a threat,” the Rom muttered. “It’s a promise.”\u003c/p\u003e\n\u003cp\u003eHarry met Merripen’s gaze directly. “I appreciate your concern for her. I assure you, I’ll do everything in my power to make her happy. Poppy will have anything she wants.”\u003c/p\u003e\n\u003cp\u003e“I believe a divorce would top the list,” Leo mused aloud.\u003c/p\u003e\n\u003cp\u003eHarry leveled a cool stare at Merripen. “I’d like to point out that your sister married me voluntarily. Michael Bayning should have had the bollocks to come to the church and carry her out bodily if necessary. But he didn’t. And if he wasn’t willing to fight for her, he didn’t deserve her.” He saw from Merripen’s quick blink that he had scored a point. “Moreover, after going through these exertions to marry Poppy, the last thing I would do is mistreat her.”\u003c/p\u003e\n\u003cp\u003e“What exertions?” the Rom asked suspiciously, and Harry realized that he hadn’t yet been told the entire story.\u003c/p\u003e\n\u003cp\u003e“Never mind that,” Leo told Merripen. “If I told you now, you’d only make an embarrassing scene at Poppy’s wedding. And that’s supposed to be my job.”\u003c/p\u003e\n\u003cp\u003eThey exchanged a glance, and Merripen muttered something in Romany.\u003c/p\u003e\n\u003cp\u003eLeo smiled faintly. “I have no idea what you just said. But I suspect it’s something about battering Poppy’s new husband into forest mulch.” He paused. “Later, old fellow,” he said. A look of grim understanding passed between them.\u003c/p\u003e\n\u003cp\u003eMerripen gave him a curt nod and left without another word to Harry.\u003c/p\u003e\n\u003cp\u003e“And that was one of his good moods,” Leo remarked, staring after his brother-in-law with rueful affection. He returned his attention to Harry. Suddenly, his eyes were filled with a world-weariness that should have taken lifetimes to acquire. “I’m afraid no amount of discussion would ease Merripen’s concern. He’s lived with the family since he was a boy, and my sisters’ welfare is everything to him.”\u003c/p\u003e\n\u003cp\u003e“I will take care of her,” Harry said.\u003c/p\u003e\n\u003cp\u003e“I’m sure you’ll try. And whether you believe it or not, I hope you succeed.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eLeo focused on him with an astute gaze that would have troubled a man with a conscience. “Incidentally, I’m not going with the family when they depart for Hampshire on the morrow.”\u003c/p\u003e\n\u003cp\u003e“Business in London?” Harry asked politely.\u003c/p\u003e\n\u003cp\u003e“Yes, a few last parliamentary obligations. And a bit of architectural dabbling—a hobby of mine. But mainly I’m staying for Poppy’s sake. You see, I expect she’ll want to leave you quite soon, and I intend to escort her home.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-43.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
