{"id":77791,"no":70,"title":"Page 70","content":"\u003cp\u003e“Of course I will. We’re in the country. There’s nothing else to do.” Heaving a sigh, Leo shoved his hands in his pockets and observed their picturesque surroundings as if he’d just been assigned a cell at Newgate. Then, with perfectly calibrated offhandedness he asked, “Where’s Marks? You didn’t mention her.”\u003c/p\u003e\n\u003cp\u003e“She is well, but . . .” Win paused, obviously searching for words. “She had a small mishap today, and she’s rather upset. Of course, any woman would be, considering the nature of the problem. Therefore, Leo, I insist that you not tease her. And if you do, Merripen has already said that he will give you such a drubbing—”\u003c/p\u003e\n\u003cp\u003e“Oh, please. As if I’d care enough to notice some problem of Marks’s.” He paused. “What is it?”\u003c/p\u003e\n\u003cp\u003eWin frowned. “I wouldn’t tell you, except that the problem is obvious and you’ll notice immediately. You see, Miss Marks dyes her hair, which I never knew before, but apparently—”\u003c/p\u003e\n\u003cp\u003e“Dyes her hair?” Poppy repeated in surprise. “But why? She’s not old.”\u003c/p\u003e\n\u003cp\u003e“I have no idea. She won’t explain why. But there are some unfortunate women who start to gray in their twenties, and perhaps she’s one of them.”\u003c/p\u003e\n\u003cp\u003e“Poor thing,” Poppy said. “It must embarrass her. She’s certainly taken great pains to keep it secret.”\u003c/p\u003e\n\u003cp\u003e“Yes, poor thing,” Leo said, sounding not at all sympathetic. In fact, his eyes fairly danced with glee. “Tell us what happened, Win.”\u003c/p\u003e\n\u003cp\u003e“We think the London apothecary who mixed her usual solution must have gotten the proportions wrong. Because when she applied the dye this morning, the result was . . . well, distressing.”\u003c/p\u003e\n\u003cp\u003e“Did it fall out?” Leo asked. “Is she bald?”\u003c/p\u003e\n\u003cp\u003e“No, not at all. It’s just that her hair is . . . green.”\u003c/p\u003e\n\u003cp\u003eTo look at Leo’s face, one would think it was Christmas morning. “What shade of green?”\u003c/p\u003e\n\u003cp\u003e“Leo, hush,” Win said urgently. “You are not to torment her. It’s been a very trying experience. We mixed a peroxide paste to take the green out, and I don’t know if it worked or not. Amelia was helping her to wash it a little while ago. And no matter what the result is, you are to say nothing.”\u003c/p\u003e\n\u003cp\u003e“You’re telling me that tonight, Marks will be sitting at the supper table with hair that matches the asparagus, and I’m not supposed to remark on it?” He snorted. “I’m not that strong.”\u003c/p\u003e\n\u003cp\u003e“Please, Leo,” Poppy murmured, touching his arm. “If it were one of your sisters, you wouldn’t mock.”\u003c/p\u003e\n\u003cp\u003e“Do you think that little shrew would have any mercy on me, were the situations reversed?” He rolled his eyes as he saw their expressions. “Very well, I’ll try not to jeer. But I make no promises.”\u003c/p\u003e\n\u003cp\u003eLeo sauntered toward the house in no apparent hurry. He didn’t deceive either of his sisters.\u003c/p\u003e\n\u003cp\u003e“How long do you think it will take him to find her?” Poppy asked Win.\u003c/p\u003e\n\u003cp\u003e“Two, perhaps three minutes,” Win replied, and they both sighed.\u003c/p\u003e\n\u003cp\u003eIn precisely two minutes and forty-seven seconds, Leo had located his archenemy in the fruit orchard behind the house. Marks sat on a low stone wall, her narrow frame slightly hunched, her elbows close together. She had some kind of cloth wrapped around her head, a knotted turban that concealed her hair entirely.\u003c/p\u003e\n\u003cp\u003eSeeing the dispirited droop of her slender frame, anyone else might have been moved to pity. But Leo had no compunction about taking a few jabs at Catherine Marks. From the beginning of their acquaintance, she had never missed an opportunity to nag, insult or deflate him. On the few occasions he had said something charming or nice—purely as an experiment, of course—she willfully misinterpreted him.\u003c/p\u003e\n\u003cp\u003eLeo had never understood why they had started off on such bad footing, or why she was so determined to hate him. And even more perplexing, why it mattered. Prickly, narrow-minded, sharp-tongued, secretive woman, with her stern mouth and haughty little nose . . . she deserved green hair, and she deserved to be mocked for it.\u003c/p\u003e\n\u003cp\u003eThe time for revenge was at hand.\u003c/p\u003e\n\u003cp\u003eAs Leo approached nonchalantly, Marks lifted her head, the sunlight flashing on the lenses of her spectacles. “Oh,” she said sourly. “You’re back.”\u003c/p\u003e\n\u003cp\u003eShe said it as if she had just discovered a vermin infestation.\u003c/p\u003e\n\u003cp\u003e“Hello, Marks,” Leo said cheerfully. “Hmmm. You look different. What can it be?”\u003c/p\u003e\n\u003cp\u003eShe glowered at him.\u003c/p\u003e\n\u003cp\u003e“Is it some new fashion, that wrapping on your head?” he asked with polite interest.\u003c/p\u003e\n\u003cp\u003eMarks maintained a stony silence.\u003c/p\u003e\n\u003cp\u003eThe moment was delicious. He knew, and she knew that he knew, and mortified color was creeping over her face.\u003c/p\u003e\n\u003cp\u003e“I brought Poppy with me from London,” Leo volunteered.\u003c/p\u003e\n\u003cp\u003eHer eyes turned alert behind the spectacles. “Did Mr. Rutledge come, too?”\u003c/p\u003e\n\u003cp\u003e“No. Although I imagine he’s not far behind us.”\u003c/p\u003e\n\u003cp\u003eThe companion stood from the stone wall and brushed at her skirts. “I must see Poppy—”\u003c/p\u003e\n\u003cp\u003e“There’ll be time for that.” Leo moved to block her way. “But before we return to the house, I think you and I should reacquaint ourselves. How are things with you, Marks? Anything interesting happen lately?”\u003c/p\u003e\n\u003cp\u003e“You’re no better than a ten-year-old,” she said vehemently. “All ready to sneer at someone else’s misfortune. You immature, mean-spirited—”\u003c/p\u003e\n\u003cp\u003e“I’m sure it’s not that bad,” Leo said kindly. “Let me have a look, and I’ll tell you if—” \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-70.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
