{"id":77793,"no":72,"title":"Page 72","content":"\u003cp\u003e“Please do,” Poppy said. Throwing a quick glance at Amelia, she saw that her older sister was already aware of what Miss Marks intended to tell her.\u003c/p\u003e\n\u003cp\u003eThey sat together, the sisters on the settee and Catherine Marks on a nearby chair.\u003c/p\u003e\n\u003cp\u003eA long, supple shape streaked through the doorway and paused. It was Dodger, who caught sight of Poppy, did a few hops of joy, and raced to her.\u003c/p\u003e\n\u003cp\u003e“Dodger,” Poppy exclaimed, almost happy to see the ferret. He loped to her, regarded her with bright eyes and chirped happily as she petted him. After a moment, he left her lap and stole toward Miss Marks.\u003c/p\u003e\n\u003cp\u003eThe companion glanced at him sternly. “Don’t come near me, you loathsome weasel.”\u003c/p\u003e\n\u003cp\u003eUndeterred, he stopped by her feet and executed a slow roll, showing her his belly. It was a source of amusement to the Hathaways that Dodger adored Miss Marks, no matter that she despised him. “Go away,” she told him, but the lovestruck ferret continued his efforts to entice her.\u003c/p\u003e\n\u003cp\u003eSighing, she reached down and removed one of her shoes, a sturdy black leather affair that laced up to the ankle. “It’s the only way to keep him quiet,” she said dourly.\u003c/p\u003e\n\u003cp\u003eImmediately, the ferret’s chatter ceased, and he buried his head inside the shoe.\u003c/p\u003e\n\u003cp\u003eSuppressing a grin, Amelia turned her attention to Poppy. “Did you have a row with Harry?” she asked gently.\u003c/p\u003e\n\u003cp\u003e“Not really. Well, it began as one, but—” Poppy felt a wash of heat over her face. “Ever since the wedding we’ve done nothing more than circle around each other. And then last evening it seemed that we would finally—” The words seemed to bottle up in her throat, and she had to force them out in a jumble. “I’m so afraid it will always be this way, this push and pull . . . I think he cares for me, but he doesn’t want me to care for him. It’s as if he both wants and fears affection. And that leaves me in an impossible position.” She let out a shaky, mirthless laugh and looked at her sister with a helpless grimace, as if to ask what can be done with such a man?\u003c/p\u003e\n\u003cp\u003eInstead of replying, Amelia turned her gaze to Miss Marks.\u003c/p\u003e\n\u003cp\u003eThe companion appeared vulnerable, uneasy, turmoil churning beneath the veneer of composure. “Poppy. I may be able to shed some light on the situation. On what makes Harry so unreachable.”\u003c/p\u003e\n\u003cp\u003eStartled by the familiar way she had referred to Harry, Poppy stared at her without blinking. “You have some knowledge of my husband, Miss Marks?”\u003c/p\u003e\n\u003cp\u003e“Please call me Catherine. I would like very much for you to consider me as a friend.” The fair-haired woman drew in a tense breath. “I was acquainted with him in the past.”\u003c/p\u003e\n\u003cp\u003e“What?” Poppy asked faintly.\u003c/p\u003e\n\u003cp\u003e“I should have told you before. I’m sorry. It’s not something I can speak of easily.”\u003c/p\u003e\n\u003cp\u003ePoppy was silent with amazement. It wasn’t often that someone she had known for a long time was suddenly revealed in a new and surprising way. A connection between Miss Marks and Harry? That was profoundly unnerving, especially since both of them had kept it secret. She suffered a chill of confusion as an awful thought occurred to her. “Oh, God. Were you and Harry—”\u003c/p\u003e\n\u003cp\u003e“No. Nothing like that. But it’s a complicated story, and I’m not certain how to . . . well, let me start by telling you what I know about Harry.”\u003c/p\u003e\n\u003cp\u003ePoppy responded with a dazed nod.\u003c/p\u003e\n\u003cp\u003e“Harry’s father, Arthur Rutledge, was an exceptionally ambitious man,” Catherine said. “He built a hotel in Buffalo, New York, around the time they had started to expand the port and the harbor. And he made a moderate success of it, although he was by all accounts a poor manager—proud and obstinate and domineering. Arthur didn’t marry until he was in his forties. He chose a local beauty, Nicolette, known for her high spirits and charm. She was less than half his age, and they had little in common. I don’t know if Nicolette married him solely for his money, or if there was affection between them at the beginning. Unfortunately, Harry was born a bit too early on in the marriage—there was a great deal of speculation as to whether or not Arthur was the father. I think the rumors helped to bring about an estrangement. Whatever the cause, the marriage turned bitter. After Harry’s birth, Nicolette was indiscreet in her affairs, until finally she ran away to England with one of her lovers. Harry was four years old at the time.”\u003c/p\u003e\n\u003cp\u003eHer expression turned pensive. She was so deep in thought, in fact, that she didn’t appear to notice that the ferret had crawled into her lap. “Harry’s parents had taken little enough notice of him before. After Nicolette left, however, he was utterly neglected. Worse than neglected—he was deliberately isolated. Arthur put him in a kind of invisible prison. The hotel staff was instructed to have as little to do with the boy as possible. He was often locked alone in his room. Even when he took his meals in the kitchen, the employees were afraid to talk to him, for fear of reprisal. Arthur had made certain that Harry was given food, clothing, and education. No one could say Harry was being maltreated, you see, because he wasn’t beaten or starved. But there are ways to break someone’s spirit other than physical punishment.”\u003c/p\u003e\n\u003cp\u003e“But why?” Poppy asked with difficulty, trying to absorb the idea of it, a child being brought up in such a cruel manner. “Was the father so vindictive that he could blame a child for his mother’s actions?”\u003c/p\u003e\n\u003cp\u003e“Harry was a reminder of past humiliation and disappointment. And in all likelihood, Harry isn’t even Arthur’s son.”\u003c/p\u003e\n\u003cp\u003e“That’s no excuse,” Poppy burst out. “I wish . . . oh, someone should have helped him.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-72.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
