{"id":77799,"no":78,"title":"Page 78","content":"\u003cp\u003e“Let me,” Harry said brusquely.\u003c/p\u003e\n\u003cp\u003e“I will,” she insisted, determined to learn this bit of wifely knowledge. She felt his stomach against her knuckles, hard as a board. Finding the elusive button, she worked on it with both hands while Harry forced himself to wait. They both jumped as her delving fingers inadvertently brushed against his erection.\u003c/p\u003e\n\u003cp\u003eHe made a choked sound, something between a groan and a laugh. “Poppy.” He was breathless. “Damn it, please let me do it.”\u003c/p\u003e\n\u003cp\u003e“It wouldn’t be so difficult—” she protested, finally managing to free the button, “—if your trousers weren’t so tight.”\u003c/p\u003e\n\u003cp\u003e“They’re not usually.”\u003c/p\u003e\n\u003cp\u003eComprehending what he meant, she paused and met his gaze, and a shy, rueful grin curved her mouth. He took her head in his hands, staring at her with a longing that raised the hairs on the back of her neck.\u003c/p\u003e\n\u003cp\u003e“Poppy,” he said raggedly, “I thought about you every minute of that twelve-hour carriage drive. About how to make you come back with me. I’ll do anything. I’ll buy you half of bloody London, if that will suffice.”\u003c/p\u003e\n\u003cp\u003e“I don’t want half of London,” she said faintly. Her fingers tightened on the waist of his trousers. This was Harry as she had never seen him before, all defenses down, speaking to her with raw honesty.\u003c/p\u003e\n\u003cp\u003e“I know I should apologize for coming between you and Bayning.”\u003c/p\u003e\n\u003cp\u003e“Yes, you should,” she said.\u003c/p\u003e\n\u003cp\u003e“I can’t. I’ll never be sorry about it. Because if I hadn’t done it, you’d be his now. And he only wanted you if it was easy for him. But I want you any way I can get you. Not because you’re beautiful or clever or kind or adorable, although the devil knows you’re all those things. I want you because there’s no one else like you, and I don’t ever want to start a day without seeing you.”\u003c/p\u003e\n\u003cp\u003eAs Poppy opened her mouth to reply, he smoothed his thumb across her lower lip, coaxing her to wait until he had finished. “Do you know what a balance wheel is?”\u003c/p\u003e\n\u003cp\u003eShe shook her head slightly.\u003c/p\u003e\n\u003cp\u003e“There’s one in every clock or watch. It rotates back and forth without stopping. It’s what makes the ticking sound . . . what makes the hands move forward to mark the minutes. Without it, the watch wouldn’t work. You’re my balance wheel, Poppy.” He paused, his fingers compulsively following the fine curve of her jaw up to the lobe of her ear. “I spent today trying to think of what I could apologize for and maybe sound at least half sincere. And I finally came up with something.”\u003c/p\u003e\n\u003cp\u003e“What is it?” she whispered.\u003c/p\u003e\n\u003cp\u003e“I’m sorry I’m not the husband you wanted.” His voice turned gravelly. “But I swear on my life, if you’ll tell me what you need, I’ll listen. I’ll do anything you ask. Just don’t leave me again.”\u003c/p\u003e\n\u003cp\u003ePoppy stared at him in wonder. Perhaps most women wouldn’t find this talk of watch mechanisms to be terribly romantic, but she did. She understood what Harry was trying to say, perhaps even more than he himself did.\u003c/p\u003e\n\u003cp\u003e“Harry,” she said softly, daring to reach out and caress his jaw, “what am I to do with you?”\u003c/p\u003e\n\u003cp\u003e“Anything,” he said with a heartfelt vehemence that almost made her laugh. Leaning forward, Harry pressed his face into the silky mass of her hair.\u003c/p\u003e\n\u003cp\u003eShe continued to work on his trousers, popping the last two buttons from their holes. Her fingers trembled as she gripped him tentatively. He let out a growl of pleasure, his arms sliding around her back. Unsure of how to touch him, she clasped him, squeezed gently, drew her fingertips up the hot length. She was fascinated by him, the silk and hardness and contained force of him, the way his entire body shivered as she stroked him.\u003c/p\u003e\n\u003cp\u003eHis mouth sought hers in a full-open kiss, obliterating all thought. He rose above her, powerful and predatory, famished for the pleasures that were still so new to her. As he lowered her to the carpet, she realized that he was going to take her, now, here, instead of seeking the more civilized comforts of the bedroom. But he hardly seemed aware of where they were, his eyes focused only on her, his color high, his lungs pumping like hearth bellows.\u003c/p\u003e\n\u003cp\u003eMurmuring his name, she lifted her arms to him. He struggled out of the rest of his clothes and bent to feast on her br**sts . . . hot, wet mouth . . . restless tongue. She kept trying to pull him farther over her, seeking the weight of his body, needing to be anchored. She groped for the hard, aching length of him, and urged him against her.\u003c/p\u003e\n\u003cp\u003e“No,” he said thickly. “Wait . . . I have to make sure you’re ready.”\u003c/p\u003e\n\u003cp\u003eBut she was determined, her grip insistent, and somewhere amid his groans and pants, a husky laugh emerged. He mounted her, adjusted her hips, and paused as he struggled for a measure of self-restraint.\u003c/p\u003e\n\u003cp\u003ePoppy wriggled helplessly as she felt the gradual pressure of his entry . . . torturously slow . . . maddening, heavy, sweet.\u003c/p\u003e\n\u003cp\u003e“Does it hurt?” Harry panted, hanging over her, bracing his weight on his arms to keep from crushing her. “Shall I stop?”\u003c/p\u003e\n\u003cp\u003eThe concern on his face was her undoing, filling her with warmth. Her arms slid around his neck, and she pressed kisses on his cheek, neck, ear, everywhere she could reach. Her body held him tightly down below. “I want more of you, Harry,” she whispered. “All of you.”\u003c/p\u003e\n\u003cp\u003eHe groaned her name and surged into her, alert to every subtle response . . . lingering when it pleased her, pressing deeper when she lifted, every slow plunge tamping more sensation inside her. She let her hands glide over his sleek, flexing back, the burning silk of his skin, loving the feel of him. \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-78.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
