{"id":77730,"no":9,"title":"Page 9","content":"\u003cp\u003eIn the beginning, Poppy and Beatrix had been daunted by the challenge of learning so many social rules. “We’ll make a game of it,” Miss Marks had declared, and she had written a series of poems for the girls to memorize.\u003c/p\u003e\n\u003cp\u003eFor example:\u003c/p\u003e\n\u003cp\u003eIf a lady you wish to be,\u003c/p\u003e\n\u003cp\u003eBehave with all formality.\u003c/p\u003e\n\u003cp\u003eAt supper when you sit to eat,\u003c/p\u003e\n\u003cp\u003eDon’t refer to beef as “meat.”\u003c/p\u003e\n\u003cp\u003eNever gesture with your spoon,\u003c/p\u003e\n\u003cp\u003eOr use your fork as a harpoon.\u003c/p\u003e\n\u003cp\u003ePlease don’t play with your food,\u003c/p\u003e\n\u003cp\u003eAnd try to keep your voice subdued.\u003c/p\u003e\n\u003cp\u003eWhen it came to taking public walks:\u003c/p\u003e\n\u003cp\u003eDon’t go running in the street,\u003c/p\u003e\n\u003cp\u003eAnd if a stranger you should meet,\u003c/p\u003e\n\u003cp\u003eDo not acknowledge him or her,\u003c/p\u003e\n\u003cp\u003eBut to your chaperone defer.\u003c/p\u003e\n\u003cp\u003eWhen crossing mud, I beg,\u003c/p\u003e\n\u003cp\u003eDon’t raise your skirts and show your leg.\u003c/p\u003e\n\u003cp\u003eInstead draw them slightly up and to the right,\u003c/p\u003e\n\u003cp\u003eKeeping ankles out of sight.\u003c/p\u003e\n\u003cp\u003eFor Beatrix, there were also special codas:\u003c/p\u003e\n\u003cp\u003eWhen paying calls, wear gloves and hat,\u003c/p\u003e\n\u003cp\u003eAnd never bring a squirrel, or rat,\u003c/p\u003e\n\u003cp\u003eOr any four-legged creatures who\u003c/p\u003e\n\u003cp\u003eDo not belong indoors with you.\u003c/p\u003e\n\u003cp\u003eThe unconventional approach had worked, giving Poppy and Beatrix enough confidence to participate in the season without disgracing themselves. The family had praised Miss Mark for her cleverness. All except for Leo, who had told her sardonically that Elizabeth Barrett Browning had nothing to fear. And Miss Marks had replied that she doubted Leo had sufficient mental aptitude to judge the merits of any kind of poetry at all.\u003c/p\u003e\n\u003cp\u003ePoppy had no idea why her brother and Miss Marks displayed such antagonism toward each other.\u003c/p\u003e\n\u003cp\u003e“I think they secretly like each other,” Beatrix had said mildly.\u003c/p\u003e\n\u003cp\u003ePoppy had been so astonished by the idea, she had laughed. “They war with each other whenever they’re in the same room, which, thank heavens, isn’t often. Why would you suggest such a thing?”\u003c/p\u003e\n\u003cp\u003e“Well, if you consider the mating habits of certain animals—ferrets, for example—it can be quite a rough-and-tumble business—”\u003c/p\u003e\n\u003cp\u003e“Bea, please don’t talk about mating habits,” Poppy said, trying to suppress a grin. Her nineteen-year-old sister had a perpetual and cheerful disregard for propriety. “I’m sure it’s vulgar, and . . . how do you know about mating habits?”\u003c/p\u003e\n\u003cp\u003e“Veterinary books, mostly. But also from occasional glimpses. Animals aren’t very discreet, are they?”\u003c/p\u003e\n\u003cp\u003e“I suppose not. But do keep such thoughts to yourself, Bea. If Miss Marks heard you, she would write another poem for us to memorize.”\u003c/p\u003e\n\u003cp\u003eBea looked at her for a moment, her blue eyes innocent. “Young ladies never contemplate . . . the ways that creatures procreate . . .”\u003c/p\u003e\n\u003cp\u003e“Or their companion will be irate,” Poppy finished for her.\u003c/p\u003e\n\u003cp\u003eBeatrix had grinned. “Well, I don’t see why they shouldn’t be attracted to each other. Leo is a viscount, and he’s quite handsome, and Miss Marks is intelligent and pretty.”\u003c/p\u003e\n\u003cp\u003e“I’ve never heard Leo aspire to marry an intelligent woman,” Poppy had said. “But I agree—Miss Marks is very pretty. Especially of late. She used to be so dreadfully thin and white, I didn’t think much of her looks. But now she’s filled out a bit.”\u003c/p\u003e\n\u003cp\u003e“At least a stone,” Beatrix had confirmed. “And she seems much happier. When we first met her, I think she had been through some dreadful experience.”\u003c/p\u003e\n\u003cp\u003e“I thought so, too. I wonder if we’ll ever find out what it was?”\u003c/p\u003e\n\u003cp\u003ePoppy hadn’t been certain of the answer. But as she glanced at Miss Marks’s weary face this morning, she thought there was a good chance that her recurrent nightmares had something to do with her mysterious past.\u003c/p\u003e\n\u003cp\u003eGoing to the wardrobe, Poppy viewed the row of tidy, neatly pressed dresses made up with quiet colors and prim white collars and cuffs. “Which dress shall I find for you?” she asked softly.\u003c/p\u003e\n\u003cp\u003e“Any of them. It doesn’t matter.”\u003c/p\u003e\n\u003cp\u003ePoppy chose a dark blue wool twill, and laid the dress out on the rumpled bed. Tactfully she looked away as her companion removed her nightgown and donned a chemise and drawers and stockings.\u003c/p\u003e\n\u003cp\u003eThe last thing Poppy wanted to do was trouble Miss Marks when her head was aching. However, the events of the morning had to be confessed. If any hint of her misadventure involving Harry Rutledge ever got out, it was far better for her companion to be prepared.\u003c/p\u003e\n\u003cp\u003e“Miss Marks,” she said carefully, “I don’t wish to make your headache worse but I have something to tell you . . .” Her voice trailed away as Miss Marks shot her a brief, pained glance.\u003c/p\u003e\n\u003cp\u003e“What is it, Poppy?”\u003c/p\u003e\n\u003cp\u003eNow was not a good time, Poppy decided. In fact . . . was there any obligation to say anything ever? In all likelihood, she would never see Harry Rutledge again. He certainly didn’t attend the same social events the Hathaways did. And really, why would he bother causing trouble for a girl who was so far beneath his notice? He had nothing to do with her world, nor she with his.\u003c/p\u003e\n\u003cp\u003e“I dropped a bit of something-or-other on the bodice of my pink muslin frock the other evening at supper,” Poppy improvised. “And now there’s a grease stain on it.”\u003c/p\u003e\n\u003cp\u003e“Oh, dear.” Miss Marks paused in the middle of hooking up the front of her corset. “We’ll mix a solution of hartshorn powder and water and sponge the stain. Hopefully that will take it out.”\u003c/p\u003e\n\u003cp\u003e“I think that’s an excellent idea.”\u003c/p\u003e\n\u003cp\u003eFeeling only the tiniest bit guilty, Poppy picked up Miss Marks’s discarded nightgown and folded it. \u003c/p\u003e","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-9.html","bookId":1787,"creation":"Oct 5, 2019 3:41:05 PM","modification":"Oct 5, 2019 3:41:05 PM"}
