{"id":85603,"no":8,"title":"Page 8","content":"\u003cp\u003e\"Take your shirt off,\" Doo-Doo suggests.\u003c/p\u003e\n\u003cp\u003eMoron pulls his shirt over his head, then raises his eyebrows. \"Be gentle with me, girls,\" he teases.\u003c/p\u003e\n\u003cp\u003e\"Keep your pants on,\" Ofra jokes and everyone, including me, laughs.\u003c/p\u003e\n\u003cp\u003eSnotty makes the first stripe down the middle of Moron\u0027s head as he squints his eyes shut.\u003c/p\u003e\n\u003cp\u003eO\u0027dead takes a picture just as Snotty finishes one line. Then Ofra takes the razor and makes another stripe. They\u0027re all having a good time. Even, dare I admit it, me.\u003c/p\u003e\n\u003cp\u003e\"Give Amy a turn,\" Doo-Doo suggests, then gives me a little push of encouragement.\u003c/p\u003e\n\u003cp\u003eI shake my head. \"I\u0027m not great with a razor,\" I say. Especially electric ones next to people\u0027s scalps.\u003c/p\u003e\n\u003cp\u003eOfra and Snotty finish shaving Moron\u0027s head. They\u0027re having fun making designs with his hair as they do the job.\u003c/p\u003e\n\u003cp\u003eAfter they\u0027re done, O\u0027dead stands next to Moron. \"We\u0027ve been friends since we were three, and I know how scared you are of the dark.\" O\u0027dead pulls out a small flashlight. \"So now, when they stick you in the Negev desert, you won\u0027t have anything to fear.\"\u003c/p\u003e\n\u003cp\u003e\"Except the deadly snakes,\" Doo-Doo chimes in, making everyone laugh again.\u003c/p\u003e\n\u003cp\u003e\"As long as I have females in my unit,\" Moron says, \"I won\u0027t need any light, if you know what I mean.\"\u003c/p\u003e\n\u003cp\u003e\"Which brings me to my gift,\" Doo-Doo says, then pulls out a small, pink, stuffed teddy bear. \"This is for you to sleep with when you\u0027re alone at night and need something to hug.\"\u003c/p\u003e\n\u003cp\u003e\"Our piece of advice is ...when you sleep with your gun, make sure the safety is on.\"\u003c/p\u003e\n\u003cp\u003eMoron nods his head. \"Great advice, guys.\"\u003c/p\u003e\n\u003cp\u003e\"Now it\u0027s Amy\u0027s turn,\" Ofra says.\u003c/p\u003e\n\u003cp\u003eI look over at Snotty. The girl won\u0027t even acknowledge me. Then I turn to Ofra. \"Go ahead,\" she says, urging me with her hand to get up.\u003c/p\u003e\n\u003cp\u003eTentatively, I walk over to Moron and hold out a piece of material. \"It\u0027s a bandana,\" I explain. \"With a peace sign on it.\"\u003c/p\u003e\n\u003cp\u003eHe takes the material from my hand and studies it. \"Todah, thank you.\"\u003c/p\u003e\n\u003cp\u003e\"They told me I should give you a piece of advice, too,\" I say. Then I clear my throat. Everyone is looking at me, even Snotty. And it makes me feel all sweaty inside. Talk about pressure.\u003c/p\u003e\n\u003cp\u003e\"My piece of advice is ...\"\u003c/p\u003e\n\u003cp\u003eI swear, I had something to say, but forgot it. I\u0027m on the spot here and my mind draws a blank. Shit. I look at the horizon, where the sun is falling into the water. The first thing that comes into my mind and out of my mouth is, \"don\u0027t swim on a full stomach.\"\u003c/p\u003e\n\u003cp\u003eOh my God. I can\u0027t believe I just said that. The guy is going to the desert for basic training. What are the chances that he\u0027s going to be swimming in the middle of the desert during military training?\u003c/p\u003e\n\u003cp\u003eMy advice is met with silence.\u003c/p\u003e\n\u003cp\u003e\"That was very ...deep, Amy,\" Snotty says, clearly making fun of me.\u003c/p\u003e\n\u003cp\u003eI hear Doo-Doo ask O\u0027dead, \"Is she joking?\"\u003c/p\u003e\n\u003cp\u003eIf I knew how to get back to the moshav, I\u0027d run there right now without turning back. But I can\u0027t, so I sit back down and try and shrink as much as I can into the sand.\u003c/p\u003e\n\u003cp\u003e\"Well, I guess I should say something,\" Moron says, then stands. \"Thank you for this great party, the gifts, and advice. Your friendship means a lot to me. Now, I know you\u0027re supposed to throw me into the Kineret, but you better not even try it.\"\u003c/p\u003e\n\u003cp\u003e\"You have to get wet,\" Avi says matter-of-factly, gesturing toward the lake.\u003c/p\u003e\n\u003cp\u003eDoo-Doo and O\u0027dead are ready to back Avi as he chases Moron around the beach.\u003c/p\u003e\n\u003cp\u003eI\u0027m shocked when they tackle him and throw him into the water, making a huge splash. Moron is soaking wet, but he\u0027s not pissed. I would be if my friends tossed me, clothes and all, into a lake. But he\u0027s laughing right along with the rest of them.\u003c/p\u003e\n\u003cp\u003eOfra goes to help Moron out of the water, until he grabs her arm and pulls her in with him.\u003c/p\u003e\n\u003cp\u003eSnotty joins the group. I watch as she puts her arms around Avi, and they both splash in the water together.\u003c/p\u003e\n\u003cp\u003eHel-lo. Don\u0027t these people know it\u0027s usually the custom to swim with bathing suits, not fully clothed? Of course I\u0027m not jealous they\u0027re in the water, laughing and having fun. I am absolutely content to stand here all alone.\u003c/p\u003e\n\u003cp\u003e\"Amy, join us!\" Moron calls out to me.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Ofra says. \"The water\u0027s great.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m a land person, and don\u0027t particularly love water. \"No, thanks,\" I say.\u003c/p\u003e\n\u003cp\u003eThe first one out of the lake is my cousin. She stands straight in front of the bonfire, warming herself. I try to avoid making eye contact with her--I\u0027m afraid if I do my mouth might get me in trouble.\u003c/p\u003e\n\u003cp\u003eBut maybe I should try, like Ron said, to get to know her. Even though she\u0027s been rude, it could be because she doesn\u0027t know what a great and fun person I am. I guess I really haven\u0027t given her much of a chance. I\u0027ll attempt to soften her up a bit first. \"Osnat, I really enjoyed meeting your friends,\" I say, thinking of how Ron said her name is spelled.\u003c/p\u003e\n\u003cp\u003eI swear, I deserve a medal for being so nice. She\u0027s probably going to say how much she\u0027s glad I opened up the lines of communication. Maybe by the end of the summer she\u0027ll be like the sister I never had.\u003c/p\u003e\n\u003cp\u003eMy wayward thoughts are squashed as I watch her turn to me with a toss of her hair and say, \"Just remember, Amy. They\u0027re my friends, not yours.\"\u003c/p\u003e\n\u003cp\u003eAnd just like that she goes back to being Snotty.\u003c/p\u003e\n\u003cp\u003eCHAPTER 10\u003c/p\u003e\n\u003cp\u003eSometimes we have to prove to others we\u0027re strong even when we\u0027re not.\u003c/p\u003e\n\u003cp\u003eI\u0027ve been in Israel for three weeks now.\u003c/p\u003e\n\u003cp\u003eThankfully, I\u0027m able to avoid Snotty and Avi. That means I\u0027m spending a lot of time in the house with Safta, which is just fine with me.\u003c/p\u003e\n\u003cp\u003eShe relayed stories about when she was a kid here in Israel and more about my grandfather, who died before I was born. She also told me about her parents, who escaped from Germany during World War II. Learning about my extended family has opened my eyes to another world.\u003c/p\u003e\n\u003cp\u003eAs I wake up one morning to Ron\u0027s cheery, \"Rise and shine, sleepyhead,\" I just want to go back to sleep.\u003c/p\u003e\n\u003cp\u003eWhat time is it anyway?\u003c/p\u003e\n\u003cp\u003eSD\u0027s words are buzzing around in my head like one of those bees that wouldn\u0027t leave me alone. I glance at my watch.\u003c/p\u003e\n\u003cp\u003e\"Six thirty!\" I say with a groggy voice. \"Please have a very good reason why you\u0027re waking me before the sun shines through that window.\"\u003c/p\u003e\n\u003cp\u003eNow I know I\u0027m being crabby, but I\u0027m just not a morning person. Never have been, never will be. In my opinion, six thirty isn\u0027t even morning; it\u0027s still the middle of the night.\u003c/p\u003e\n\u003cp\u003e\"Amy, we\u0027ve been here a while now and I\u0027ve left you alone. If you keep sleeping all day, you\u0027ll never get over your jet lag. Besides, work needs to be done around here and everyone pitches in. I want you to at least act like you\u0027re my daughter and help out.\"\u003c/p\u003e\n\u003cp\u003eI sit up and say, \"Listen, I\u0027m still tired and cranky. Just come back in, let\u0027s say, a couple of hours and we can discuss whatever you want.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re always tired and cranky and you need to get out of bed so Yucky can wash the sheets. There\u0027s probably mushrooms growing on them.\"\u003c/p\u003e\n\u003cp\u003e\"Very funny.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve promised to help your uncle sell some of the sheep these next few weeks. After that, I want to show you my country.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, let\u0027s do that. In a couple of weeks,\" I say just so he\u0027ll leave me alone.\u003c/p\u003e\n\u003cp\u003eI lie back down and pull the covers over my head. A little more sleep is what I need, not to work on my summer vacation or go sightsee. I\u0027ll have to convince the\u003c/p\u003e\n\u003cp\u003eSperm Donor just because I happen to be on this stupid trip doesn\u0027t mean I have to do anything on it.\u003c/p\u003e\n\u003cp\u003eI let out a breath when I hear him leave the room. Looking over at Snotty\u0027s bed, I see it\u0027s empty. She\u0027s probably over at Avi\u0027s house.\u003c/p\u003e\n\u003cp\u003eNot that I\u0027m jealous, \u0027cause I\u0027m not. I just don\u0027t know why he\u0027s friends with her. She might be pretty, but she\u0027s mean.\u003c/p\u003e\n\u003cp\u003eOr maybe she\u0027s just mean to me. Which makes me hate her even more.\u003c/p\u003e\n\u003cp\u003eI close my eyes and try to think about good things, like going back home.\u003c/p\u003e\n\u003cp\u003eNothing really makes me happy now. Is that what being sixteen is all about? If so, I can understand why teenagers express themselves in so many different ways. It\u0027s not as if we\u0027re stupid, we\u0027re just trying to figure out where we fit.\u003c/p\u003e\n\u003cp\u003eMe? I don\u0027t seem to fit anywhere these days. I\u0027m like a square peg trying to fit into a round society. Now that I think about it more, I\u0027m not square or round. More like an octagon. And I don\u0027t fit anywhere now. I thought I did, but my nice, super-dictated world has complicated all that. I wonder how Mitch is doing without me. Does he miss me?\u003c/p\u003e\n\u003cp\u003eI fall asleep again and when I wake up my stomach growls so I head to the kitchen. Everyone is gone and the house is quiet.\u003c/p\u003e\n\u003cp\u003eI glance over at Sofia, who\u0027s sitting in a velour chair reading some book.\u003c/p\u003e\n\u003cp\u003e\"Boker tov, Amy,\" she says in this dignified voice as I reach into the refrigerator and scan the contents.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" I say. \"I don\u0027t know what that means.\"\u003c/p\u003e\n\u003cp\u003eI finally learned shalom means three things: hello, goodbye, and peace. My Hebrew knowledge is pathetic, at best.\u003c/p\u003e\n\u003cp\u003e\"Boker tov means \u0027good morning.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Boker tov to you, too.\"\u003c/p\u003e\n\u003cp\u003eGram seems a little quiet this morning. I\u0027ll sit with her and chitchat while I eat breakfast, maybe that\u0027ll cheer her up. In fact, I\u0027ll prepare something special for her.\u003c/p\u003e\n\u003cp\u003eAs I arrange a plate of fruit, I take my time and cut little pieces of banana and melon in these shapes Jessica\u0027s mom taught me. Jessica calls things people rave about \"crowd pleasers.\" Little cut-up fruit in the shape of a clown face is a definite crowd pleaser.\u003c/p\u003e\n\u003cp\u003eI set the plate down in front of her on a side table. \"Todah\" she says.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re welcome.\" I look down at my masterpiece. \"It\u0027s a clown face.\"\u003c/p\u003e\n\u003cp\u003e\"Very creative. Do you like cooking?\"\u003c/p\u003e\n\u003cp\u003e\"Not really. Eating I like. We go to restaurants mostly back home.\"\u003c/p\u003e\n\u003cp\u003e\"Your father doesn\u0027t cook for you?\"\u003c/p\u003e\n\u003cp\u003eI know what you\u0027re thinking. This is a great opportunity for me to tell Sofia how it really is back home. But as I look at the old lady\u0027s glowing blue eyes I feel protective of her. As much as I\u0027d like my gram to be ashamed of the Sperm Donor, I just can\u0027t make myself upset her.\u003c/p\u003e\n\u003cp\u003e\"Well, every Friday he makes this great lasagna,\" I say, my mouth moving without my brain thinking too long about it. \"And his chicken picatta is out of this world. He even bakes blueberry muffins for me on Sunday mornings.\"\u003c/p\u003e\n\u003cp\u003eThe of lady has this little twinkle in her eye that I can\u0027t decipher.\u003c/p\u003e\n\u003cp\u003e\"Chicken picatta, huh?\" she says.\u003c/p\u003e\n\u003cp\u003eOh, shit. She\u0027s onto me. I probably should have left out the muffins or made it BBQ chicken instead of picatta. But I\u0027m stickin\u0027 with my story for better or worse.\u003c/p\u003e\n\u003cp\u003e\"Yep. I\u0027m sure if you ask him he\u0027ll make you some,\" I say as I look down at my feet and notice my toenail polish is chipped.\u003c/p\u003e\n\u003cp\u003eI hear the door open and Doda Yucky comes floating into the house. \"Amy, Safta is starting her chemotherapy treatment in an hour,\" she says. We both help my grandma up. \"Everyone is with the sheeps,\" Doda Yucky says. \"They\u0027re waiting for you.\"\u003c/p\u003e\n\u003cp\u003eI am bowled over by a terrible sense of worry about Safta. Chemotherapy? Oh no ...that means cancer.\u003c/p\u003e\n\u003cp\u003e\"Can I go with you?\" I ask. \"I can read to you if you\u0027d like.\"\u003c/p\u003e\n\u003cp\u003eSafta pats the back of my hand lightly. \"Don\u0027t worry, I\u0027ll be fine. Go with the young people and enjoy your stay here. You don\u0027t want to be hanging around a hospital all day. Okay?\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003eI want to go with her, to make sure the doctors know she\u0027s my Safta and she needs the best care possible. Do they know how important she is? \u003c/p\u003e","sourceLink":"https://allnovel.net/how-to-ruin-a-summer-vacation-how-to-ruin-1/page-8.html","bookId":2764,"creation":"Oct 5, 2019 5:08:04 PM","modification":"Oct 5, 2019 5:08:04 PM"}
