{"id":91296,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“What is it exactly?”\u003c/p\u003e\n\u003cp\u003e“Mariah Naughton. Remember, she was talking about it at the diner last night? We take the horses and ride out to sites that aren’t part of the National Battlefield Parks. I mean, they can’t own everything, and there was Civil War action all around here. She talks about Tennessee battles, the ghosts that remain, and then we go set up camp by the stream. It’s really cool.”\u003c/p\u003e\n\u003cp\u003e“Seriously, nothing here is really cool, man,” Sean said, sticking his head back in and placing his hands on Joey’s shoulders. “But it’s the coolest thing we get while we’re in purgatory.”\u003c/p\u003e\n\u003cp\u003e“You’re right. I do remember. Sounds great,” Dustin said.\u003c/p\u003e\n\u003cp\u003eOlivia glanced at him, trying not to frown. Ping-Pong and camping? That was how an agent worked?\u003c/p\u003e\n\u003cp\u003eJoey scribbled on the sheet and turned back to Dustin. “I put your name down, okay?”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eAaron had come out of his office. Sandra—herding the boys out the door—was now behind Dustin.\u003c/p\u003e\n\u003cp\u003e“Guess I need to get out of here, too,” Dustin said. “Thank you. I’ve heard about this place for years. It’s fantastic. Good day for me.”\u003c/p\u003e\n\u003cp\u003e“Glad to have you, Agent—Dustin,” Aaron said.\u003c/p\u003e\n\u003cp\u003eAs he walked out, Aaron turned to them. “Drew, can you get Sydney? And, Sandra, can you find Mariah and Mason? We need a little meeting.”\u003c/p\u003e\n\u003cp\u003eFive minutes later, they were all seated on the couches and chairs in the entry room. Once everyone had settled in, Aaron said, “We have to decide how to handle this situation. First, just to let you know, Sandra and I have rescheduled all our sessions for tomorrow—the lawyer’s coming in the morning.” He cleared his throat. “I guess you’re all aware that Marcus was the end of his line. I believe, since he and I discussed it many times, that the facility was left to me, but no one can be certain of anything until his attorney reads his final will and testament. I know, as well, that he left something from his life for every one of you. There are also clauses that protect the property and the livestock in the event of my death. So...that’s one thing. The other is...we have to decide on spin.”\u003c/p\u003e\n\u003cp\u003e“Spin?” Mariah asked.\u003c/p\u003e\n\u003cp\u003eAaron exhaled. “Well, the information about the autopsy is out. Naturally, in today’s age of instant information and social media, it was inevitable, and some people are going to make a big deal of it. We all know the autopsy revealed he was on drugs. The blood tests made that clear. I saw Marcus that morning—he was fine. In fact, he was in a great mood. What happened to make him relapse after all those years...I don’t know. The thing is, it puts us in a bad light. What good does any of this therapy do if the man who founded the Horse Farm died while on drugs?”\u003c/p\u003e\n\u003cp\u003e“He didn’t take drugs willingly,” Olivia said firmly.\u003c/p\u003e\n\u003cp\u003eThey were all silent, looking at her. She knew that pitying stare. They all believed she just couldn’t accept it.\u003c/p\u003e\n\u003cp\u003eTo her surprise, Sydney Roux, Drew’s partner in looking after the stables, spoke up, too. He stood to do so; Sydney was an old Tennessean. His grandparents and their grandparents had grown up in the nearby hills. He was a gentleman to the nth degree. He fingered the baseball cap he’d removed when he entered the office as he said, “I can’t believe it, either. I remember I was in my room above the stables one evening when he came by. I’d been drinking a beer and I tried to hide it. He told me, ‘Sydney, I’m an addict. You’re not. Don’t go thinking you can’t have that brew because I stopped by. I’m long past my trigger days.’ And I believe that—just like Olivia believes it. Something happened. Someone tricked him.”\u003c/p\u003e\n\u003cp\u003e“If only,” Sandra murmured.\u003c/p\u003e\n\u003cp\u003e“How could we ever find out? How could we prove such a thing?” Mariah asked. “We had cops out here. They searched with us that day.”\u003c/p\u003e\n\u003cp\u003e“They didn’t find anything!” Olivia said, sitting up straight.\u003c/p\u003e\n\u003cp\u003eAaron looked at her. “Right.”\u003c/p\u003e\n\u003cp\u003e“Don’t you see? They didn’t find anything. They didn’t find heroin, crack or anything else on him—and they didn’t find a needle in his possession. Where were the drugs or the paraphernalia he would have needed?”\u003c/p\u003e\n\u003cp\u003eSandra came and sat on the edge of the sofa by her. “Oh, Liv, the acreage here seems to go on forever and we’re surrounded by forests. He could’ve left stuff anywhere on the property and we might never find it. A hundred years from now, when they’re digging the place up to build condos, they might come across a broken needle or something and wonder what the hell?”\u003c/p\u003e\n\u003cp\u003e“Someone else could have put it in him,” Olivia said stubbornly.\u003c/p\u003e\n\u003cp\u003eSandra looked helplessly at Aaron.\u003c/p\u003e\n\u003cp\u003e“I don’t know what happened and I probably never will. And it doesn’t matter. Marcus was one of the greatest men I’ve ever known,” Aaron said. “The point is how do we handle this?”\u003c/p\u003e\n\u003cp\u003e“With honesty,” Mariah said. “What other way is there?”\u003c/p\u003e\n\u003cp\u003e“We downplay it,” Mason insisted. “We tell the truth. We’re honest. But we say that it never happened before—and that is the truth. We say that Marcus had thirty years of clean living, and many people—and animals—benefited because of him. And that we’re continuing on in that fine tradition of faith and belief.”\u003c/p\u003e\n\u003cp\u003e“Mason,” Mariah said. “That was wonderful! If you get tired of being a therapist, you can go into public relations.”\u003c/p\u003e\n\u003cp\u003eOlivia nodded. “It really was a good statement.”\u003c/p\u003e\n\u003cp\u003e“And it’s the truth,” Aaron agreed. “All right, then. We just lie low. When asked, we say that we don’t know what was going on in his mind at the end but that we loved him and he did a world of good. We’ll say that we’ll never forget him or what he gave to others. However, don’t bring up the subject unless you’re asked. So, everyone, have a good night.”\u003c/p\u003e\n\u003cp\u003e“Wait, wait, wait,” Olivia said, rising. “I think what we’ve talked about here is important. We also need to find out what happened.” She looked around at all of them. “Do you honestly think Marcus just had a stash out in the woods? That he had it there for a long time—just in case the day came when he suddenly broke after decades of clean living? We need to pursue the truth.”\u003c/p\u003e\n\u003cp\u003e“How?” Mariah asked. “We’d need an army to comb the property and the woods. There are just seven of us. The police have other things to do, and we’re not asking clients—some of them addicts—to look for drug paraphernalia!”\u003c/p\u003e\n\u003cp\u003e“There’s his house,” Olivia said, turning to Aaron. “If his house was searched, we’d at least know he wasn’t using there—or considering it.”\u003c/p\u003e\n\u003cp\u003eAaron left out a soft sigh. “I believe that, as of tomorrow, the house will be mine. You can search to your heart’s content, Liv. And if any of us thinks of a forest hidey-hole, we can search that, too. Liv, I don’t know what else to do!”\u003c/p\u003e\n\u003cp\u003e“I’ve been in his house,” Sydney said. He worked the cap furiously in his hands. “I went to get his suit for the funeral home. I didn’t search the place, but it’s not big, and I sure as hell didn’t see anything that would indicate Marcus had lost it. Of course, that was before they released the autopsy report.”\u003c/p\u003e\n\u003cp\u003e“Maybe tomorrow night you and I can go back,” Olivia suggested.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Sandra said. “Oh, Olivia, honey, I know how much you loved Marcus. But what can we possibly prove?”\u003c/p\u003e\n\u003cp\u003e“That he didn’t fall back on drugs, Sandra! It could mean everything for the Horse Farm.”\u003c/p\u003e\n\u003cp\u003e“You search his house tomorrow night if you want,” Aaron said. “Olivia, you can do anything that’ll make you feel better, and when you need our help, just say so.”\u003c/p\u003e\n\u003cp\u003eShe had the feeling that what he really meant was emotional help; still, it seemed that Aaron was on her side, and that mattered.\u003c/p\u003e\n\u003cp\u003e“Thanks,” she told him.\u003c/p\u003e\n\u003cp\u003e“So the attorney is coming here at ten,” Aaron said. “See you in the morning.”\u003c/p\u003e\n\u003cp\u003eThey all moved. Some of them would get into conversations about Marcus—or about Dustin, Olivia knew.\u003c/p\u003e\n\u003cp\u003eShe didn’t want to get into a conversation.\u003c/p\u003e\n\u003cp\u003eShe drove home. Sammy greeted her and she stroked the dog’s back and spoke to him for a minute before she looked around downstairs.\u003c/p\u003e\n\u003cp\u003e“Marcus?” she called.\u003c/p\u003e\n\u003cp\u003eThere was no answer. She went up to her room and changed into comfortable sweats, then came back downstairs.\u003c/p\u003e\n\u003cp\u003eMarcus was there, in the kitchen. “Wish I could’ve put the teakettle on for you,” he told her.\u003c/p\u003e\n\u003cp\u003e“That would have been nice.” She put the kettle on and leaned against the stove. “Maybe in time,” she said.\u003c/p\u003e\n\u003cp\u003e“In time!” he protested, then smiled at her. “That’s almost Biblical. A time to reap, a time to sow—and a time to walk into the light. I want to walk into that light, Liv. I’ve seen it. It’s beautiful. I should go there.”\u003c/p\u003e\n\u003cp\u003e“Oh, Marcus.” She wanted to give him a hug—but she couldn’t hug a ghost. “Marcus, if the light is there...and it’s what you want, then you should go into it. We’ll get along here, I promise. I’ll do everything I can. Malachi sent an agent out to investigate.” She paused. Yeah, and he likes to play Ping-Pong and go camping!\u003c/p\u003e\n\u003cp\u003e“Marcus, have faith. In me, I mean. You can go to the light.”\u003c/p\u003e\n\u003cp\u003e“No, actually, I can’t. Not yet. Not until I’m proven innocent. People do fall back into drugs. But the thing is—I didn’t. So I just can’t leave.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“I don’t know why not!” he said, aggrieved. “You figure out the meaning of life and death—I sure as hell don’t know it!”\u003c/p\u003e\n\u003cp\u003eBefore she could respond, Sammy suddenly stood up and barked. Right after that, there was a knock on her door.\u003c/p\u003e\n\u003cp\u003eOlivia stared at Marcus, wondering why she should feel so alarmed. “Why don’t you answer that?” Marcus asked.\u003c/p\u003e\n\u003cp\u003eShe nodded. “Fine. You stay put.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-10.html","bookId":2285,"creation":"Oct 5, 2019 5:49:43 PM","modification":"Oct 5, 2019 5:49:43 PM"}
