{"id":91305,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Did you ever meet Marcus?” Andrew asked him, hoisting a saddle onto Shiloh.\u003c/p\u003e\n\u003cp\u003e“No, I never did.”\u003c/p\u003e\n\u003cp\u003e“But you’re from the area?”\u003c/p\u003e\n\u003cp\u003e“From the city, originally,” Dustin said.\u003c/p\u003e\n\u003cp\u003e“Nashville’s the best city in the world, but I love these rolling hills out here,” Drew told him. He shrugged. “I guess even though it’s small in comparison to New York, Atlanta or Chicago, Nashville’s actually pretty big. Folks could wander around for years and never meet one another. Out here, we do.” He grinned. “And regardless of how long I’ve lived in the state, I’ll never be a real homeboy to people who are from here—like Mariah or Sydney. They can trace their families back for generations. But Olivia used to come out here all the time with her parents, and I know she and Mariah never met.” He shrugged. “A lot of life is an accident of timing, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“I guess so,” Dustin said. “It’s easy to go through life not knowing everyone—even in a small town, let alone a big city,” he added wryly.\u003c/p\u003e\n\u003cp\u003e“That’s true enough.” Drew grinned. “Listen, thanks for the help.”\u003c/p\u003e\n\u003cp\u003e“Not a problem. I love horses,” Dustin said. “And cats—and dogs.”\u003c/p\u003e\n\u003cp\u003e“Plenty around here,” Andrew said. “In fact, you really would be a good candidate to take home a pup or a kitten.”\u003c/p\u003e\n\u003cp\u003e“I wish I was. I’m never in one place long enough to be a good owner.”\u003c/p\u003e\n\u003cp\u003e“Because of your work.”\u003c/p\u003e\n\u003cp\u003e“I’m a field agent. That means going out in the field.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, takes a good man to know when he can’t have an animal, too. That’s the problem, people picking up cute kittens or pups and not realizing the little critters are going to get big. So they dump them. Or the dog messes in the house. Or they get the pet and then have kids and forget they have the pet. But all the animals lucky enough to come here, well, they’ll still be taken care of.”\u003c/p\u003e\n\u003cp\u003e“No surprises in the will, huh?” Dustin asked.\u003c/p\u003e\n\u003cp\u003eDrew shook his head, adjusting the saddle on Shiloh. “Not really. Oh, yeah, there was one. Marcus left his home and the property it’s on to Olivia.”\u003c/p\u003e\n\u003cp\u003e“That was a surprise, then?”\u003c/p\u003e\n\u003cp\u003e“We thought it would go to Aaron. Aaron loves this place and manages it really well. It would’ve been easy for him to live there, and go back and forth to the Horse Farm.”\u003c/p\u003e\n\u003cp\u003e“Actually, couldn’t he just live here if he chose? You and Sydney do, right?”\u003c/p\u003e\n\u003cp\u003e“Yeah, but...we’re not management types. We keep our places pretty nice, but hey...this is a stable, and it smells like a stable. But...”\u003c/p\u003e\n\u003cp\u003e“I’m sure your living arrangements are fine,” Dustin said. “So where does Aaron live now?”\u003c/p\u003e\n\u003cp\u003e“Oh, he rents a house down the road. He should’ve bought a house when the buying was good. Guess he figured maybe he didn’t have to,” Drew said with another shrug. “I doubt it’s a problem. The Horse Farm being nonprofit doesn’t mean he doesn’t get a nice salary.”\u003c/p\u003e\n\u003cp\u003e“What about you guys?” Dustin asked.\u003c/p\u003e\n\u003cp\u003eAndrew laughed. “I like my life just fine. I have a comfortable place to lay my head at night. I love my work. I enjoy working with kids. I wake up every morning to fresh air and beautiful country. No rush hour. Yeah, I’m pretty happy with my life.”\u003c/p\u003e\n\u003cp\u003e“Good to hear,” Dustin said.\u003c/p\u003e\n\u003cp\u003eHe saw that Olivia was coming out of the office. He’d gotten a brief text from her, saying that she planned to stay at the office where there’d be several people around until her afternoon sessions.\u003c/p\u003e\n\u003cp\u003eBut now she was headed his way. “Hi, Dustin. And thanks, Andrew.” She patted Shiloh’s neck. “I could have saddled him.”\u003c/p\u003e\n\u003cp\u003e“I get restless with nothing to do,” Andrew told her. “So, things have changed a bit. Are you going to keep Shiloh here? Or do you plan on building a barn?”\u003c/p\u003e\n\u003cp\u003e“I’m here most of the time, and you and Sydney are always here,” she said. “I’m happier having him stabled where someone’s on duty 24/7.”\u003c/p\u003e\n\u003cp\u003e“That makes sense.” Andrew looked at Dustin. “You never know with a horse. I had some friends who lost two of their horses a few years back. No one was home. Somehow a pasture gate was left open. The horses got onto the road and were hit by a semi and they had to be put down. You just never know.”\u003c/p\u003e\n\u003cp\u003e“Have you seen Joey yet?” Olivia asked.\u003c/p\u003e\n\u003cp\u003e“On his way right now,” Dustin said.\u003c/p\u003e\n\u003cp\u003eJoey had been let out of a van that had the words Parsonage House written in script on the side. Two other boys stepped out—Matt and Sean, Dustin saw. They headed into the office, while Joey walked toward them, smiling.\u003c/p\u003e\n\u003cp\u003e“We get to ride today, right?” he asked Olivia. “Oh, hello, Dustin, Drew.”\u003c/p\u003e\n\u003cp\u003e“We’re still riding today,” Olivia said. “Joey, I have you on Trickster, and Andrew, I see you’ve gotten Chapparal saddled. He’ll be perfect for Dustin, unless he was saddled for someone else?”\u003c/p\u003e\n\u003cp\u003e“He’s all yours. In fact, Dustin brought him in. He’s been here helping me.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” Olivia nodded. “Well, then, shall we?”\u003c/p\u003e\n\u003cp\u003eTen minutes later, they were mounted and striking out beyond the pastures. The hills rose and fell until they reached a stretch of relatively flat land. Olivia said, “Okay, Joey, we’ll run them for a minute here, but we’re not racing. Remember that everything we’ve learned about trust and boundaries works when you’re riding, too. Don’t let Trickster take you. You’re taking her.”\u003c/p\u003e\n\u003cp\u003eJoey nodded, flushing with pleasure. Olivia glanced at him and Dustin nodded; she was going to head out first. He’d bring up the rear.\u003c/p\u003e\n\u003cp\u003eIt wasn’t a wild ride. It was a pleasant canter and then a brief gallop across the flat land. Olivia reined in first, waiting for the other two. Joey slipped sideways when Trickster reverted to a trot, but he gripped the horn of his western saddle for a moment, regaining his balance. He beamed at Olivia.\u003c/p\u003e\n\u003cp\u003e“We’re doing okay,” he said.\u003c/p\u003e\n\u003cp\u003eOlivia smiled at him but her smile faded. Dustin saw that she was gazing past Joey—back up to the hill that rose between them and the Horse Farm.\u003c/p\u003e\n\u003cp\u003eHe followed her line of vision. The sun was high; it seemed to cast shadows on the mound.\u003c/p\u003e\n\u003cp\u003eBut Dustin saw someone there.\u003c/p\u003e\n\u003cp\u003eThere, but not really there.\u003c/p\u003e\n\u003cp\u003eThe image of a tall rider sitting proudly on a great steed gradually appeared. He wore a plumed hat and the gray-caped dress-coat of a Confederate general. Dustin thought he lifted a hand, almost as if in warning. Then the sun blazed brightly, coming from behind a white cloud, and the general was gone.\u003c/p\u003e\n\u003cp\u003e“Hey, Liv, you’re coming on the camping trip tomorrow night, aren’t you?” Joey said, unaware.\u003c/p\u003e\n\u003cp\u003e“Pardon?” Olivia brought her attention back to the boy.\u003c/p\u003e\n\u003cp\u003e“The camping trip. You’re coming, right?”\u003c/p\u003e\n\u003cp\u003e“Uh, yes. I suppose so,” Olivia said.\u003c/p\u003e\n\u003cp\u003e“And you’re coming, too,” Joey looked at Dustin. “You said you would.”\u003c/p\u003e\n\u003cp\u003e“Yes, sounds like fun. I used to go on camping trips around here years ago,” Dustin told him.\u003c/p\u003e\n\u003cp\u003e“Mariah’s going to tell ghost stories,” Joey said.\u003c/p\u003e\n\u003cp\u003e“She’s good at talking about history, too,” Olivia added a little sharply.\u003c/p\u003e\n\u003cp\u003e“Yes, but you can only have a ghost if you have the history of someone who lived,” Joey said reasonably.\u003c/p\u003e\n\u003cp\u003e“Yes, of course, but...history is important, Joey,” Olivia said. “There was a famous philosopher named George Santayana who explained why it’s so important to understand history. His words are often quoted. ‘Those who cannot remember the past are condemned to repeat it.’ We need to learn from all the things that came before. It’s a good thing that we remember the American Civil War—especially when we see politics get heated today. Tennessee was the last state to secede from the Union, and the people were split on their beliefs throughout the war. East Tennessee actually tried to secede from Tennessee when it left the Union, but troops were sent in. The state was truly divided. The east was for the North, the west for the South—and the middle of the state cast the deciding ballot. It was horribly sad and tragic here. Only the state of Virginia saw more battles. The Battle of Shiloh was, at the time, the bloodiest in the nation’s history. But we learned from the war, Joey.”\u003c/p\u003e\n\u003cp\u003e“In many ways,” Dustin murmured.\u003c/p\u003e\n\u003cp\u003eJoey turned to face him, “Yeah, I know,” he said dryly. “My dad told me they still study Civil War strategy. Like today, you wouldn’t fight the same—we have automatic weapons and bombs and drones and stuff. But the military today can still learn from the strategies they used back then.”\u003c/p\u003e\n\u003cp\u003e“We also learned about compromise and holding a country together,” Dustin said, hoping he didn’t sound too much as though he was lecturing. “It’s easy to be harsh now when we look at the past. Sometimes you have to wonder what the hell were they thinking, and you have to try to understand the context and the reasons—and the mistakes. That’s history, and that’s why it’s important.”\u003c/p\u003e\n\u003cp\u003e“And why we get ghosts!” Joey threw in cheerfully.\u003c/p\u003e\n\u003cp\u003e“But ghosts are good, too,” Olivia said. “For instance, General Rufus Cunningham is a famous ghost around here, and he tells us a lot about humanity. He was a leader, but he didn’t consider any of his men expendable. And he valued human life even when that life belonged to the enemy.”\u003c/p\u003e\n\u003cp\u003e“Yeah, and he died. ‘No good deed goes unpunished,’” Joey blurted out, grinning.\u003c/p\u003e\n\u003cp\u003eOlivia groaned. “Oh, I give up!”\u003c/p\u003e\n\u003cp\u003e“Kidding, just kidding!” Joey said. “I love the stories about the general. Are we going to ride? Or are we going to just sit here?”\u003c/p\u003e\n\u003cp\u003e“We’ll take the forest trail to the curve, come back around and let them run again for a few minutes. It’s beautiful riding through the trees,” Olivia said.\u003c/p\u003e\n\u003cp\u003eShe led the way. Trickster tried to stop for grass, but Olivia reminded Joey that the horse shouldn’t be calling the shots; he could give Trickster an apple back at the stables. Joey regained control, grinning at her proudly as he did. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-19.html","bookId":2285,"creation":"Oct 5, 2019 5:49:43 PM","modification":"Oct 5, 2019 5:49:43 PM"}
