{"id":91308,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“What about today?” Olivia asked.\u003c/p\u003e\n\u003cp\u003e“I think they were arguing. This was before Sandra left—she said she was going straight home, by the way—then you came in. I didn’t have a chance to find out what the argument was about, though. My, uh, eavesdropping was interrupted by Mariah, who started talking about the camping trip tomorrow night.”\u003c/p\u003e\n\u003cp\u003eMarcus nodded. “The camping trip. If you’re together, then Liv will be safe. But what about tonight? Someone could come looking for her here—or at her own house.”\u003c/p\u003e\n\u003cp\u003e“I thought about that. I figured we’d go into Nashville. There’s a small chain motel on the outskirts. Actually,” he said, glancing at Olivia, “I was going to suggest a break. We could go in for dinner and get a couple of rooms at the motel. Olivia can leave her car at her place in case anyone’s watching. It’s more plausible that I might be in the city, since people know I have a sister who lives there. She’s not in town at the moment, but no one knows that.”\u003c/p\u003e\n\u003cp\u003e“Sounds good,” Marcus said approvingly.\u003c/p\u003e\n\u003cp\u003e“Wait a minute.” Olivia decided she had to put a stop to the way they were assuming control—or at least get them to acknowledge her rights in this situation. “I truly appreciate all the responsibility you two feel you need to take, but I’d prefer to be involved in these decisions,” Olivia told them.\u003c/p\u003e\n\u003cp\u003e“Okay. Olivia, I would like us to have dinner in Nashville. Would that be all right? And in the interests of keeping you alive—without me sleeping in your living room, which will certainly elicit an eternal round of gossip—would you like to stay in that lovely little motel off I-40?”\u003c/p\u003e\n\u003cp\u003e“Yes, that sounds lovely, thank you,” she said primly. “I just need to be kept in the loop, okay?”\u003c/p\u003e\n\u003cp\u003eLoop? The two of them were talking to a ghost.\u003c/p\u003e\n\u003cp\u003eYet, even as she spoke, she saw that Marcus seemed to be fading.\u003c/p\u003e\n\u003cp\u003e“Be safe, kiddies,” Marcus said, his voice growing as faint as his image. “I can’t seem to stay around that long.... Still getting the hang of this....”\u003c/p\u003e\n\u003cp\u003eHe was gone. They were talking to an empty space on the sofa.\u003c/p\u003e\n\u003cp\u003eFor a moment, Olivia felt awkward. She was so intensely aware of being there alone with Dustin. There was something about him, a quality that made him the focus in any room. And it was attractive and seductive.\u003c/p\u003e\n\u003cp\u003eShe cleared her throat, trying to concentrate. “You’re really afraid for me to stay by myself?”\u003c/p\u003e\n\u003cp\u003e“Aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she admitted.\u003c/p\u003e\n\u003cp\u003e“You’ll need a few things. Just pack an overnight bag. We’ll go to your house, so you can deal with the dog and collect your things. I’ll follow you and keep watch from a safe distance.”\u003c/p\u003e\n\u003cp\u003e“What about you? Don’t you need to pack a bag?”\u003c/p\u003e\n\u003cp\u003e“I have extra clothes in the rental car.”\u003c/p\u003e\n\u003cp\u003e“So, we’re going to dinner?” she asked. “Shouldn’t we be doing...something to solve this?”\u003c/p\u003e\n\u003cp\u003e“Tomorrow I intend to search the woods until I find what flew by you.”\u003c/p\u003e\n\u003cp\u003e“You think that someone’s—”\u003c/p\u003e\n\u003cp\u003e“I think someone’s afraid of you. I think you’re in danger. You have to make sure you’re always with a group of people—or with me.”\u003c/p\u003e\n\u003cp\u003e“That’s not going to be easy.”\u003c/p\u003e\n\u003cp\u003e“We’ll take it day by day,” he said. “I’ll let Malachi and Jackson know that we have to get some members of the Krewe units out here. In fact, I’ll call Malachi while I wait for you.”\u003c/p\u003e\n\u003cp\u003eShe smiled. “So where are we going for dinner?”\u003c/p\u003e\n\u003cp\u003e“A place my sister loves. F. Scott’s.”\u003c/p\u003e\n\u003cp\u003e“But you said your sister’s not in Nashville right now.”\u003c/p\u003e\n\u003cp\u003e“True. She’s in London on tour.”\u003c/p\u003e\n\u003cp\u003e“Tour? What does she do?”\u003c/p\u003e\n\u003cp\u003e“She’s a country music singer.”\u003c/p\u003e\n\u003cp\u003eOlivia stared at him, bemused. “Really? That’s fascinating.”\u003c/p\u003e\n\u003cp\u003e“I might be prejudiced, but she’s pretty good.”\u003c/p\u003e\n\u003cp\u003e“What’s her name?”\u003c/p\u003e\n\u003cp\u003e“Rayna Blake.”\u003c/p\u003e\n\u003cp\u003e“Wow! Rayna Blake’s your sister?”\u003c/p\u003e\n\u003cp\u003e“You’ve heard of her?”\u003c/p\u003e\n\u003cp\u003e“I saw her as the opening act for the Band Perry. She’s extremely talented.”\u003c/p\u003e\n\u003cp\u003eShe kept smiling.\u003c/p\u003e\n\u003cp\u003e“What?” he asked.\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know. Country music star, federal agent. Your parents must be very interesting people!”\u003c/p\u003e\n\u003cp\u003e“Oh, they are,” he assured her. “Historians. Very interesting.”\u003c/p\u003e\n\u003cp\u003e“Too bad she’s not here doing a concert. I’m sure you could get really good tickets.”\u003c/p\u003e\n\u003cp\u003e“We’d have to go to London for that—which is where my parents happen to be. And...”\u003c/p\u003e\n\u003cp\u003e“No London.” Olivia laughed. “Way too complicated. Just Nashville,” she said. “Wanna do a ghost tour?”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “We’ll be in a group.”\u003c/p\u003e\n\u003cp\u003e“Sure. Why not?”\u003c/p\u003e\n\u003cp\u003eHe stood and she did the same. She felt strange, awkward, yet somehow exhilarated and even a little frightened. That fear wasn’t about the threat of death or attack, but the thought of an evening with him.... She quickly turned and headed for the door. None of this was real, she told herself.\u003c/p\u003e\n\u003cp\u003eOnly, Marcus’s death had been real.\u003c/p\u003e\n\u003cp\u003eDustin parked down on the road while Olivia drove up to her house. Although she lived in an area where every home had acreage around it—whether that was owned by the household, pasture belonging to nearby farmers or land owned by the park service—the front of her house was clearly visible from the road. No large bushes provided hiding.\u003c/p\u003e\n\u003cp\u003eThe hiding places lay to the sides and the rear, where forests flourished.\u003c/p\u003e\n\u003cp\u003eIn this section of the countryside, “neighbors” were far away.\u003c/p\u003e\n\u003cp\u003eHe watched, trying not to smile as she came out. He’d given her a small bag of dirt to scatter on the front porch. He wanted to know if anyone tried to drop in on her that night.\u003c/p\u003e\n\u003cp\u003eShe was actually pretty good at being unobtrusive as she spread the dirt around. He didn’t think anyone was watching the house at that time. He kept a careful eye on the front; he doubted that anyone hiding in the woods would be able to see exactly what she was doing.\u003c/p\u003e\n\u003cp\u003eHe didn’t believe they were dealing with a master criminal, although he was equally certain the killer wasn’t stupid.\u003c/p\u003e\n\u003cp\u003eShe hurried down the dirt-and-stone drive to the street where he was parked and slid into the car. She carried a large backpack rather than a suitcase, and he found himself pleased that she’d evidently realized a backpack might go anywhere while a suitcase would advertise the fact that she was going away.\u003c/p\u003e\n\u003cp\u003e“Is this the right thing to do?” she asked anxiously, fastening her seat belt. “I mean, shouldn’t we be doing more to pursue the killer?”\u003c/p\u003e\n\u003cp\u003e“I can’t burst into homes and demand that people let me interrogate them,” he said. “At the moment, we’re doing what’s most important.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“Making sure the killer doesn’t strike again.” He drove in silence as they headed for the highway.\u003c/p\u003e\n\u003cp\u003e“You do know exactly where you’re going,” she murmured.\u003c/p\u003e\n\u003cp\u003eHe lifted one shoulder in a shrug. “I’ve told you—I really am from Nashville.”\u003c/p\u003e\n\u003cp\u003e“That was convenient for us all.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t quite tell what the tone of her voice meant so he didn’t respond. It was already growing late so he drove straight to the restaurant. F. Scott’s was a casual place where some dressed up and some dressed down and the music and food were good. Their table was in a corner by the wall; when they were seated, it seemed intimate. He couldn’t help marveling again that she could look like her cousin—and be so beautiful.\u003c/p\u003e\n\u003cp\u003e“Why are you staring at me?”\u003c/p\u003e\n\u003cp\u003eHe grinned. “Honestly? I was finding it incredible that you could look so much like Malachi—but be so attractive.”\u003c/p\u003e\n\u003cp\u003e“Malachi is very handsome!” she said, defending her cousin. “And thank you. I think.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” he murmured. “I think.”\u003c/p\u003e\n\u003cp\u003eThe waitress arrived. Olivia ordered a Jack Daniel’s on the rocks; he opted for the same. They both decided on steak and their order was in.\u003c/p\u003e\n\u003cp\u003eShe sipped her drink when it was served but still looked restless. “I just wish we could be doing something more.”\u003c/p\u003e\n\u003cp\u003e“We actually are,” he told her.\u003c/p\u003e\n\u003cp\u003e“We are? How?”\u003c/p\u003e\n\u003cp\u003e“Back in the offices, they’re sifting through backgrounds and finding out everything that they can about everyone involved with the Horse Farm.”\u003c/p\u003e\n\u003cp\u003e“But you’ve done that, haven’t you?”\u003c/p\u003e\n\u003cp\u003e“We just keep going deeper and deeper,” he said. “Trying different approaches and looking for new connections.”\u003c/p\u003e\n\u003cp\u003e“And does that help?” she asked. She rubbed the condensation on her glass. “I guess I’m afraid we’ll never get to the truth.”\u003c/p\u003e\n\u003cp\u003eHe was surprised when he found himself reaching across the table to take her hand. “We will. That’s what the Krewe units do.”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eAnd she didn’t pull away.\u003c/p\u003e\n\u003cp\u003e“This is all new to me,” she said. “Malachi was working for himself and the next thing I know he’s at the academy. I researched the Krewe of Hunters and read between the lines. I asked him a lot of questions. I was stunned to discover that he’s really happy. He’s engaged to a coworker and...and then when this happened and I called him...”\u003c/p\u003e\n\u003cp\u003e“You ended up with me.”\u003c/p\u003e\n\u003cp\u003eShe didn’t reply; their food arrived. When the waitress left, Olivia cut a piece of meat and asked, “How did you come to be part of...this? How did you find the Krewe?”\u003c/p\u003e\n\u003cp\u003e“They found me. Actually, Malachi was partnered in New Orleans with a detective who joined the force in Savannah. And I worked with the same guy, David Caswell, in Savannah. He’d suggested me before your situation came up, and since I do know Nashville and vicinity, it seemed like a good time and place to start.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-22.html","bookId":2285,"creation":"Oct 5, 2019 5:49:43 PM","modification":"Oct 5, 2019 5:49:43 PM"}
