{"id":91313,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“A side note of interest—what we celebrate now as Memorial Day was begun by Confederate women who decorated the graves of their loved ones. Many places lay claim to having the first true ‘Decoration Day,’ but most historians agree that the widows and other grieving women of the South began what became our national holiday before the end of the Civil War—or, as we were sometimes taught to call it, the War of Northern Aggression.” Mariah grinned. “No one get mad at me for getting my history wrong tonight, huh? Remember, Tennessee was always a divided state and we’re all darned glad we’re one Union now!” Mariah stopped speaking, reaching for the water bottle attached to her saddle. She looked at Olivia. “Want to take it for a minute?”\u003c/p\u003e\n\u003cp\u003e“Sure,” Olivia said. “Mariah was preparing you for the first step in the ‘ghost’ tour part of this. We’ll tell more stories when we’ve made camp. But right now, we’re in a little graveyard begun by locals who found their own boys, and other dead soldiers, left behind after the Battle of Nashville. In some instances, those who lived in this area stumbled upon the dead and did their best to bury them in accordance with whatever identification they found on the bodies—you know, sometimes they got them back to their states or buried them here with others from their homes or regiments, Feds or Rebs. Sometimes the dead they found were their own. Some of them were brought out here for burial.\u003c/p\u003e\n\u003cp\u003e“During the Civil War, the forest was different from the way it looks now. There’d been a farmhouse just up the ridge, and this had been land that belonged to a George C. Turner. George and one of his sons were killed in the battle, and when Mrs. Evelyn Turner discovered the bodies—and those of others—she got the local preacher and a stone carver to create a little cemetery. Actually, Evelyn Turner herself wound up in this little burial ground. It’s said that on a misty evening she can be seen walking through the trees, searching for more dead, determined that they be given a Christian burial. She’s buried just down that path with her husband and her son—and our area’s most famous ghost, General Rufus Cunningham. So we’ll take a walk down the path, pay our respects and then go on to the campsite. Once we’re there, we’ll set up our tents and start a fire, cook our dinner—and settle in for some good stories.”\u003c/p\u003e\n\u003cp\u003eShe glanced back at Mariah, a question in her eyes.\u003c/p\u003e\n\u003cp\u003e“You want to lead them through with Mason? Drew, Aaron and I can watch the horses,” Mariah said.\u003c/p\u003e\n\u003cp\u003e“Let’s go, then,” Olivia urged. She noticed that Brent looked frightened.\u003c/p\u003e\n\u003cp\u003e“You don’t have to come,” she told him. “You can stay with Mariah and the guys and watch the horses.”\u003c/p\u003e\n\u003cp\u003eBrent shook his head. “I—I want to go.”\u003c/p\u003e\n\u003cp\u003eDustin walked over and slipped an arm around his shoulders. “I’m a little scared, too,” he said. “We’ll go together.”\u003c/p\u003e\n\u003cp\u003eOlivia smiled at Dustin. “Well, then, we forge ahead.”\u003c/p\u003e\n\u003cp\u003eShe accepted a lantern from Mariah and started through the pine-and leaf-covered trail. The others followed. They entered a small graveyard. Perhaps twenty stones remained, some broken, most at an angle, all shrouded with lichen. The break in the trees allowed the last light of the day to seep through, but it cast an aura of something mysterious, perhaps sacred, over the stones.\u003c/p\u003e\n\u003cp\u003e“Here!” Sean called. “Here, right here! I found Evelyn Turner’s grave—and her son’s grave and...here’s the dad!”\u003c/p\u003e\n\u003cp\u003eThe other boys rushed over. Holding the lantern high, Olivia saw that Dustin—Brent close at his side—had come upon the most famous grave, the one with the largest stone and flowers strewn upon it.\u003c/p\u003e\n\u003cp\u003e“General Rufus Cunningham,” Dustin read aloud. He went down on his knees to study the writing on the stone. “‘Hero of the Battle of Nashville. To save lives, he gave his own.’”\u003c/p\u003e\n\u003cp\u003eSean let out a creepy sound. “He’s here! I can feel him. Can you feel him? He’s here with us!”\u003c/p\u003e\n\u003cp\u003e“Where? Where?” Brent asked, alarmed.\u003c/p\u003e\n\u003cp\u003e“It’s all right, Brent,” Dustin said. “If his spirit’s still around, he doesn’t mean us any harm. He was an exceptional man who wanted the best for everyone.”\u003c/p\u003e\n\u003cp\u003e“Don’t mock the dead!” Joey snapped at Sean.\u003c/p\u003e\n\u003cp\u003e“Oh, come on, Joey,” Sean said. “Have some fun!”\u003c/p\u003e\n\u003cp\u003eOlivia hadn’t seen the general among them; Malachi had told her once that it didn’t really make sense for a spirit like Rufus Cunningham to hang around his grave. Malachi believed he still watched over the living. But just as she opened her mouth to speak again, she saw him.\u003c/p\u003e\n\u003cp\u003eHe was on foot.\u003c/p\u003e\n\u003cp\u003eMaybe ghost horses couldn’t make it through the dense growth of trees and brush that now surrounded the little burial ground.\u003c/p\u003e\n\u003cp\u003eBut the general was among them. He wore his uniform, passing by the others, pausing to give Sean a stern pat on the back of his head.\u003c/p\u003e\n\u003cp\u003eSean jumped a mile high.\u003c/p\u003e\n\u003cp\u003eMatt burst into laughter. “Scared?” he demanded.\u003c/p\u003e\n\u003cp\u003e“Who did that? Stop it—that wasn’t funny!” Sean yelled.\u003c/p\u003e\n\u003cp\u003e“Neither is disrespect for the dead,” Dustin said quietly.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, I’m sorry! Can we go now? I’m starving,” Sean muttered.\u003c/p\u003e\n\u003cp\u003e“Everyone okay with that?” Olivia asked.\u003c/p\u003e\n\u003cp\u003e“One minute. Can I take just one minute?” Brent looked up at her.\u003c/p\u003e\n\u003cp\u003eShe nodded. Brent went down on his knees and bowed his head, hands folded in prayer.\u003c/p\u003e\n\u003cp\u003eOne by one, the other boys joined him. Olivia held the lantern and watched, deeply touched.\u003c/p\u003e\n\u003cp\u003eWhen they started back, Matt asked her, “How come we can read some of those stones so clearly?”\u003c/p\u003e\n\u003cp\u003e“Because volunteers come out now and then and see that the headstones are kept clean,” Olivia told him. “Some of the graves were known, and some weren’t after time took its toll, so the carving was scrubbed on all of them.”\u003c/p\u003e\n\u003cp\u003e“But everyone knew the general, right? And they knew about Mr. and Mrs. Turner and their son.”\u003c/p\u003e\n\u003cp\u003e“Right,” Olivia assured them.\u003c/p\u003e\n\u003cp\u003eWhen she reached the end of the trail and the boys had gone on ahead of her, she looked back. She could see the general; he stood in a military position, watching as they left.\u003c/p\u003e\n\u003cp\u003eShe smiled. He was still keeping guard over the land. But then her smile faded. She’d seen him when Marcus died. What had he been trying to tell her? Had he come upon Marcus too late?\u003c/p\u003e\n\u003cp\u003e“Liv? You ready?” Mariah called.\u003c/p\u003e\n\u003cp\u003e“Coming.”\u003c/p\u003e\n\u003cp\u003eBrent was riding Battle-ax, a truly big boy, although gentle. She went to give him a boost up but Dustin was already with him, helping him onto the horse.\u003c/p\u003e\n\u003cp\u003eAs they rode, she noted that although Dustin was keeping an eye on Brent, he was staying close to her.\u003c/p\u003e\n\u003cp\u003eHe was also watching everyone riding with them—and the forest around them, as well.\u003c/p\u003e\n\u003cp\u003eSoon, they reached the open ground that led to the stream and the bluff that forded it, where they usually camped. The rocks created an overhang that had been useful whenever they were surprised by rain. Tonight, however, promised to be beautiful.\u003c/p\u003e\n\u003cp\u003eThey pitched the tents, the work going well, everyone helping. Sean now seemed subdued; he looked over his shoulder frequently—and kept close to the others. Aaron sent the boys to gather wood for the fire. They used the camping area often and had a fire site ready. It was on clean, swept soil and surrounded by rocks to prevent the fire from spreading.\u003c/p\u003e\n\u003cp\u003eWithin forty minutes of their arrival, the tents were pitched and the fire was blazing. Aaron quickly had coffee going, while Mariah and Mason set up the grill. They’d brought hot dogs and beans and the makings for s’mores. Everyone seemed hungry, and it wasn’t until they’d eaten and had gorged themselves on the s’mores that Joey asked Mariah when she was going to get to the ghost stories.\u003c/p\u003e\n\u003cp\u003e“Ah, well, now!” Mariah smiled at him and gestured grandly. “Now that the moon is high, and the mist will soon gather and rise on the moor!”\u003c/p\u003e\n\u003cp\u003e“Is this a moor?” Joey asked.\u003c/p\u003e\n\u003cp\u003e“No, not really. It’s a field in the foothills, but close enough,” Mason said.\u003c/p\u003e\n\u003cp\u003e“Remember, I don’t just tell ghost stories. A ghost story doesn’t amount to anything unless you know why the ghost stayed behind,” Mariah said. “And that means knowing the history.”\u003c/p\u003e\n\u003cp\u003e“So you’re going to tell us about General Rufus Cunningham, right?” Joey asked excitedly.\u003c/p\u003e\n\u003cp\u003e“With a little help from my friends,” Mariah said. “Liv, you want to start?”\u003c/p\u003e\n\u003cp\u003e“Okay, if you’d like,” Olivia said. She looked around at all the boys, and forced herself not to smile. Brent was sitting on Dustin’s left side.\u003c/p\u003e\n\u003cp\u003eSean was on his right—sitting even closer than Brent.\u003c/p\u003e\n\u003cp\u003e“The best stories always come with truth and time,” she began. “And to understand what brought about a ghost, you first have to understand some history, just like Mariah said. As I’m sure you already know, Tennessee was the last state to join the Confederacy. That happened on June 24, 1861. As soon as Tennessee seceded, it was like Nashville had a target painted on her. Because the city was a major shipping center and had a major port on the Cumberland River, both sides saw Nashville as extremely important. Battles couldn’t be fought without supplies, without a way to keep soldiers clothed and fed. And, of course, Nashville was also the capital of Tennessee. It was important for the Union to take a capital, because that affected morale. One thing we learn in therapy of any kind is that morale can dictate what happens. We can create self-fulfilling prophesies—believe there’s no choice but to fail and you will. Believe you can make it and you will.”\u003c/p\u003e\n\u003cp\u003eJoey cleared his throat. “Uh, Olivia, the South did lose the war.”\u003c/p\u003e\n\u003cp\u003e“Yeah, didn’t you hear?” Matt asked her, giggling.\u003c/p\u003e\n\u003cp\u003e“Okay, it doesn’t always work.” She smiled. “Hard and bitter as that defeat must have been for the Confederates, time has shown us that we’re better and stronger as one country. To many people living in the nineteenth century, the main focus was states’ rights, and, okay, that was connected to slavery—and the economy. But one of Lincoln’s great triumphs was that slavery was abolished. Today, we can look back and wonder how any human being believed he could own another human being.” She paused to let the boys think about that. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-27.html","bookId":2285,"creation":"Oct 5, 2019 5:49:43 PM","modification":"Oct 5, 2019 5:49:43 PM"}
