{"id":91336,"no":50,"title":"Page 50","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“His eyes are brighter,” Drew remarked. “Sloan, you made the right call.”\u003c/p\u003e\n\u003cp\u003e“I hope so,” Sloan said.\u003c/p\u003e\n\u003cp\u003e“Thank you, Sloan,” Olivia was kneeling on the ground by her horse. She looked up at Dustin, and there was anger in her eyes now. “Go to the station,” she told him. “Go! I’m fine. I want you to find out who did this!”\u003c/p\u003e\n\u003cp\u003e“You...you think someone poisoned the horse?” Drew asked.\u003c/p\u003e\n\u003cp\u003e“I do—and I’ll find out who did it!” Olivia said. “Or, rather, we’ll find out.”\u003c/p\u003e\n\u003cp\u003eDustin nodded. “All right. I’m on my way. Don’t make a move without Sloan or Jane, Olivia.”\u003c/p\u003e\n\u003cp\u003e“I won’t be making a move, period—not until the vet comes and we’re sure Shiloh’s okay,” Olivia said. “Go. Sandra knows something—and I want to know what!”\u003c/p\u003e\n\u003cp\u003eDustin looked at Sloan and turned back to the car. He drove fast. If a deputy stopped him now, he’d just say he was on his way to see Frank Vine.\u003c/p\u003e\n\u003cp\u003eIt was wrong, Olivia told herself, to feel such intense anger and fear over Shiloh when people were dead. But the general, who’d kept his horse haunting the hills with him for a century and a half, and Marcus, who had loved all living creatures, would understand. Aaron... Maybe he wouldn’t understand completely.\u003c/p\u003e\n\u003cp\u003eShe was encouraged, though. Drew had described how the horse was at first—eyes rheumy, unable to stand, wobbling. Now, since they’d pumped his stomach, he seemed to be on the mend.\u003c/p\u003e\n\u003cp\u003eShe hugged the horse’s neck, just sitting with him. He nudged her and gave a little whinny. She stroked his big, beautiful head and curled his forelock with her fingers.\u003c/p\u003e\n\u003cp\u003e“You’re going to be okay. It’s not a bad thing to have a cowboy around, huh?”\u003c/p\u003e\n\u003cp\u003e“Liv, I’ll go in and get you a cup of coffee,” Drew told her. “Sloan’s right here, and Sydney’s in his room, within shouting distance. I’ll be back in a minute.”\u003c/p\u003e\n\u003cp\u003e“That sounds great, Drew.” Olivia said gratefully. She glanced up. Sloan was on guard, smiling at her from the stall gate. “The horse is going to make it, Liv.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Thanks to you.”\u003c/p\u003e\n\u003cp\u003e“It’s also thanks to Drew and Sydney. They run a good stable here.”\u003c/p\u003e\n\u003cp\u003eShe nodded, but before Sloan could speak again, they heard a shout from the office.\u003c/p\u003e\n\u003cp\u003e“Hey!”\u003c/p\u003e\n\u003cp\u003eSloan frowned and backed away from the stall, peering through the stable entrance to the office. Olivia jumped up to join him and together they started toward the office.\u003c/p\u003e\n\u003cp\u003eDrew was running in their direction.\u003c/p\u003e\n\u003cp\u003e“Jane! It’s Jane. I don’t know what the hell’s wrong with her. She’s down.”\u003c/p\u003e\n\u003cp\u003e“Down?” Sloan shouted. “Stay with me!” he ordered Olivia, and tore for the house.\u003c/p\u003e\n\u003cp\u003eOlivia did stay with him—right on his heels. Sloan burst into the office and she ran in behind him.\u003c/p\u003e\n\u003cp\u003eJane Everett was on the sofa; she’d been there with her computer, a cup of coffee on the driftwood coffee table in front of her.\u003c/p\u003e\n\u003cp\u003eShe had collapsed onto her side. Her computer lay haphazardly on the floor.\u003c/p\u003e\n\u003cp\u003eSloan rushed to her.\u003c/p\u003e\n\u003cp\u003e“A dart! Look for a dart—a small dart somewhere!” Olivia told him. She fell onto her knees by Jane’s left side as Sloan took the right.\u003c/p\u003e\n\u003cp\u003eOlivia saw the tiny dart that had struck Jane; she reached for it. “Sloan! I’ve got the dart.”\u003c/p\u003e\n\u003cp\u003eBut even as he turned to her, reaching for his gun, she heard a “zzzz” in the air.\u003c/p\u003e\n\u003cp\u003eThe big cowboy fell onto his partner and beloved. Olivia ducked close to the couch, trying to see who was in the office shooting the darts.\u003c/p\u003e\n\u003cp\u003eShe stared at the door, but the sunlight was streaming in. She couldn’t see the man’s face. And then...\u003c/p\u003e\n\u003cp\u003e“Drew!” she gasped.\u003c/p\u003e\n\u003cp\u003e“I just don’t know what you’re going to get out of the woman,” Frank Vine muttered to Dustin. “She has an answer for everything—and I don’t have a single thing to hold her on.”\u003c/p\u003e\n\u003cp\u003eThey were in the observation room. Jimmy Callahan stood watching Sandra while Frank and Dustin talked.\u003c/p\u003e\n\u003cp\u003e“Hold her on suspicion of murder,” Dustin said.\u003c/p\u003e\n\u003cp\u003e“With what proof? We have nothing! No district attorney would be able to take this case to court!”\u003c/p\u003e\n\u003cp\u003e“I doubt if Sandra knows that. Just tell her she’s going to be booked for murder. Then I’ll go in.”\u003c/p\u003e\n\u003cp\u003eDustin watched as Frank went to talk to Sandra. She immediately flew from her chair in a fury, telling him he was an idiot.\u003c/p\u003e\n\u003cp\u003e“Strange, huh, that they called her Mama Cheever? She’s a real virago. I guess she ran a tight ship, though. But it seems like she did love Aaron. You really think she might have killed him?” Callahan asked.\u003c/p\u003e\n\u003cp\u003e“She didn’t do the deed—but I think that, somehow or other, she was in on it.”\u003c/p\u003e\n\u003cp\u003eFrank returned to the observation area. “She’s all yours,” he said.\u003c/p\u003e\n\u003cp\u003eDustin nodded and walked into the interrogation room. Sandra watched him suspiciously, radiating pure tension. “You,” she spat. “You are a despicable federal ass!”\u003c/p\u003e\n\u003cp\u003e“Sandra, you were the only one who had a key to Aaron’s house—besides Aaron.” Something in her manner changed slightly.\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous!”\u003c/p\u003e\n\u003cp\u003e“You loved him and you were having an affair with him. Are you telling me you didn’t have his key?”\u003c/p\u003e\n\u003cp\u003e“Of course I had his key! But how the hell would I know just how many keys Aaron had out there?”\u003c/p\u003e\n\u003cp\u003e“He didn’t have any other keys out there, Sandra.”\u003c/p\u003e\n\u003cp\u003e“How do you know that?”\u003c/p\u003e\n\u003cp\u003e“Aaron told me.”\u003c/p\u003e\n\u003cp\u003e“Aaron? Aaron is dead.”\u003c/p\u003e\n\u003cp\u003e“Yes. Yes, he is.”\u003c/p\u003e\n\u003cp\u003eShe stared at him, her lips twitching with derision. “You spoke to a dead man?”\u003c/p\u003e\n\u003cp\u003e“He spoke to me,” Dustin said. He could well imagine Frank Vine and Jimmy Callahan frowning at each other in the observation room. Their lips would be twitching, as well.\u003c/p\u003e\n\u003cp\u003eDustin leaned forward. “You had the only extra key, Sandra.”\u003c/p\u003e\n\u003cp\u003e“I didn’t kill Aaron! I loved him.”\u003c/p\u003e\n\u003cp\u003eDustin eased back in his chair. “You know,” he said slowly, “I don’t think you realized he was going to be killed.”\u003c/p\u003e\n\u003cp\u003e“He wasn’t killed. It was an accident.”\u003c/p\u003e\n\u003cp\u003e“I just told you—I’ve talked to Aaron. Or, as I said, he talked to me. It wasn’t an accident. He didn’t reach for anything electrical, including his iPod charger, while he was in the bath. Someone was in his house. Someone who probably knew he liked baths.” He shook his head. “I never took you for stupid, Sandra.”\u003c/p\u003e\n\u003cp\u003e“Stupid! You bastard, I’m hardly stupid!”\u003c/p\u003e\n\u003cp\u003e“No? Then you did know what was going on. So, which is it? Are you stupid—or guilty?”\u003c/p\u003e\n\u003cp\u003e“Neither!” she yelled.\u003c/p\u003e\n\u003cp\u003e“Who had the key? Who did you tell about your affair? What was the real plan—if you didn’t want Aaron dead? And, if you loved him so much, why did you leave his house when you knew your accomplice was in there, lying in wait for him?”\u003c/p\u003e\n\u003cp\u003eShe didn’t answer.\u003c/p\u003e\n\u003cp\u003eHe stood up. “Frank? Frank, come and book her for murder. She’s definitely involved. She didn’t do the killing, but she was in on the conspiracy. She facilitated the killer.” He turned back to Sandra. “But then the whole thing got away from you, didn’t it? Then you started fearing for your own life, right? So you figured you had to keep quiet. Because unless we caught the killer—”\u003c/p\u003e\n\u003cp\u003eHe broke off. He was pretty sure he had it figured out, but he needed to trip Sandra up just once.\u003c/p\u003e\n\u003cp\u003eHe slammed his palms down on the table. “The Horse Farm was supposed to go under, right? But not so it could be sold to a Nashville lawyer. Right?”\u003c/p\u003e\n\u003cp\u003eSandra glared at him. Then she jumped to her feet and pointed to the one-way mirror.\u003c/p\u003e\n\u003cp\u003e“It’s his fault—all his fault! Jimmy Callahan! He was always talking about the countryside and how wonderful it is, but he said the Horse Farm was a nothing place. He’s the one who talked about the land, and how someone who came from such a long line of Tennesseans should be the one to own it! Someone like that could turn it into a special destination, he said. It was him—he started it all!”\u003c/p\u003e\n\u003cp\u003eDustin turned and stared at the mirror himself; that wasn’t the direction he’d been going with this at all.\u003c/p\u003e\n\u003cp\u003eBefore he could move, Jimmy Callahan burst into the room.\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” he shrieked. “Oh, my God!”\u003c/p\u003e\n\u003cp\u003eEven as Olivia watched Drew, a dark silhouette in the doorframe with sunlight pouring in behind him, he pitched over. She hadn’t heard the whizzing sound that time; she’d been watching Sloan fall before she turned to Drew.\u003c/p\u003e\n\u003cp\u003eSomething told her she needed to get the dart out of Sloan’s back.\u003c/p\u003e\n\u003cp\u003eShe managed to rip out the tiny shaft and drop down by the sofa, ruining anyone’s clear shot at her.\u003c/p\u003e\n\u003cp\u003eIt wasn’t Drew trying to kill her, though, because poor Drew was out on the floor. Sydney?\u003c/p\u003e\n\u003cp\u003eBut Sydney was in the stables.\u003c/p\u003e\n\u003cp\u003eNo, he wasn’t.\u003c/p\u003e\n\u003cp\u003e“Drew? Hey, Drew! Liv? Sloan? Where the hell is everyone?” Sydney had left the stables; he sounded perplexed, and he was on his way to the office.\u003c/p\u003e\n\u003cp\u003e“Sydney, no! Go back, get on the phone! Call for help!” Olivia shouted, staying down, hoping she was protected by the sofa—and the drugged bodies of the two agents with her.\u003c/p\u003e\n\u003cp\u003eToo late.\u003c/p\u003e\n\u003cp\u003eThis time she heard the strange “zzzz” sound.\u003c/p\u003e\n\u003cp\u003eAnd she heard Sydney’s body hit the earth, a few feet from the door.\u003c/p\u003e\n\u003cp\u003eFBI agents are always armed!\u003c/p\u003e\n\u003cp\u003eDown in front of the sofa, she groped at Sloan’s body until she found the holster at his side. She struggled to find the gun—and get it out without killing herself. She had no idea how to use it.\u003c/p\u003e\n\u003cp\u003eIt was a gun, she told herself; you took the safety off, you pointed and fired.\u003c/p\u003e\n\u003cp\u003eBut even as her fingers curled around it, she heard movement behind her.\u003c/p\u003e\n\u003cp\u003e“Come on out, Olivia. They’re all down. And I don’t want to hurt you. Not yet. We’re going for a little ride. Don’t you want to buy all the time you can? Come on, now, get up—slowly.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-50.html","bookId":2285,"creation":"Oct 5, 2019 5:49:43 PM","modification":"Oct 5, 2019 5:49:43 PM"}
