{"id":91688,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Oh, yeah. But it would have been easier to hit the folks we know—and whose work and work ethic we know,” David said.\u003c/p\u003e\n\u003cp\u003e“Everyone has to start somewhere,” Vanessa said.\u003c/p\u003e\n\u003cp\u003e“That’s true, and now I have to go to work,” Katie said. “I’m counting on both of you if it’s a dead crowd,” she added.\u003c/p\u003e\n\u003cp\u003eVanessa smiled and shook her head. “A group number!” Katie said.\u003c/p\u003e\n\u003cp\u003eThere were about twenty people in the bar when Katie started up, singing a number with a friend of hers, Clarinda, who was also one of the night servers at O’Hara’s. The two sang a country number that was beautiful and sexy. By the time they finished, other people were walking in the door.\u003c/p\u003e\n\u003cp\u003e“I don’t think that she’s going to have any problem with this crowd not getting up,” Vanessa told David.\u003c/p\u003e\n\u003cp\u003e“Probably not. We’re off the hook. Oh, and she’s trying to get Clarinda to get up enough confidence to take it over when she’s not here,” David said.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eDavid smiled. “You don’t think we’ll all be going on this excursion without Katie, do you?”\u003c/p\u003e\n\u003cp\u003eVanessa smiled. “So it’s a done deal?” she asked.\u003c/p\u003e\n\u003cp\u003e“It seems to be so,” David told her. “I heard about your dive today—and that you might have discovered a relic of some kind.”\u003c/p\u003e\n\u003cp\u003e“Hopefully. And hopefully, it is a real relic, and not a watch lost recently that encrusted quickly,” Vanessa said.\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” David said, “Sean has a good eye for things like that. The sea can play games, that’s for certain, but anyone who has grown up diving down here has found something lost from a boat from some period of time—he’d probably know if it was just a twenty-year-old barnacle crustation.”\u003c/p\u003e\n\u003cp\u003e“I found it awfully easily.”\u003c/p\u003e\n\u003cp\u003e“The current is always moving and the sand is always shifting,” David reminded her.\u003c/p\u003e\n\u003cp\u003eShe faced the doorway where, in ones, twos and threes, others were now coming into the bar. She saw Marty and he waved to her as he headed up to Katie and her computer area to request a song.\u003c/p\u003e\n\u003cp\u003e“Ah, good, Marty is here. We’ll be getting a good sea shanty,” David said.\u003c/p\u003e\n\u003cp\u003eShe smiled at him and noted the door again.\u003c/p\u003e\n\u003cp\u003eShe stiffened where she sat at the stool, dead straight.\u003c/p\u003e\n\u003cp\u003eShe didn’t believe it, didn’t believe that she was seeing the man who was walking in.\u003c/p\u003e\n\u003cp\u003eA man obviously looking for someone.\u003c/p\u003e\n\u003cp\u003eHer.\u003c/p\u003e\n\u003cp\u003e5\u003c/p\u003e\n\u003cp\u003eSean arrived at his uncle’s bar around nine-thirty. Katie-oke was in full swing.\u003c/p\u003e\n\u003cp\u003eHe saw David at one of the high-top tables in the rear of the karaoke area and came to sit by him at one of the free bar stools. There was one left; Bartholomew sat in it as if he and Sean had come in together like any friends out for a drink together.\u003c/p\u003e\n\u003cp\u003eDavid acknowledged Bartholomew’s presence with a nod. He could hear Bartholomew at times and see his faint outline at certain times, too. Sean didn’t think that David had any kind of a sixth sense, but Bartholomew had become so entwined in the events that had nearly cost all of them their lives that David did have a sense of him. It was often a relief for Sean to be with his sister and David, who knew about Bartholomew’s presence. That way, when the pirate goaded him, he could reply without appearing to be talking to an imaginary friend.\u003c/p\u003e\n\u003cp\u003e“Liam here yet?” he asked.\u003c/p\u003e\n\u003cp\u003e“Not yet. But I talked to him after you did. Seems he’s in on this one way or the other,” David said.\u003c/p\u003e\n\u003cp\u003e“Which is great—having a skilled cop with us cannot be bad,” Sean said.\u003c/p\u003e\n\u003cp\u003e“You really think that we might have trouble?” David asked.\u003c/p\u003e\n\u003cp\u003e“Two people were murdered, maybe three, when they were making the film. I think that the only rational explanation is that Carlos Roca was the killer, and that he’s out there somewhere. But will he come after our crew? Probably not. He got away with murder—and a good boat. I don’t think he’d come back. Is there the possibility of something going wrong, such as idiot drug smugglers, human traffickers? Sure, always. We both know that. So it’s good to have a cop along. We can watch each other’s backs. Yeah, I like that,” Sean said.\u003c/p\u003e\n\u003cp\u003e“The pickings seemed slim today at the interviews,” David said.\u003c/p\u003e\n\u003cp\u003eSean shrugged. They had talked to a couple of “possible people.” He wished he could have Frazier, from Key Largo, but he was working on a National Geographic project. There were other friends he’d known for years and years. Of course, they could delay the project. But now, he didn’t want to.\u003c/p\u003e\n\u003cp\u003e“We’ll be all right,” David said. “You know Katie is coming. And she can help with lights, sound…cameras. She says she hung around you enough when you first got into it, and we’ve been out doing some fooling around filming on the reefs since we decided to do this.”\u003c/p\u003e\n\u003cp\u003e“Two and two,” Bartholomew said. “Always close enough to be in easy vision, that’s the way to do it.”\u003c/p\u003e\n\u003cp\u003eDavid gazed in his direction. “And which boat will you be on?”\u003c/p\u003e\n\u003cp\u003e“Whichever appears to be more comfortable. Or, perhaps, more in danger,” he said.\u003c/p\u003e\n\u003cp\u003e“You’ll leave Lucinda, Lucy—your lady in white—for that kind of time?” Sean asked Bartholomew. He realized, oddly enough, that as much as he didn’t want to be “haunted,” he did think it was a good thing that Bartholomew was ready for the trip.\u003c/p\u003e\n\u003cp\u003e“Can’t leave you folks alone. And who knows, maybe Lucy will be up for the voyage. Though she does hate the water. And boats,” Bartholomew admitted.\u003c/p\u003e\n\u003cp\u003e“A long time to be away,” Sean noted, mumbling so that only David could hear him.\u003c/p\u003e\n\u003cp\u003eBartholomew slowly lifted an aristocratic brow. “Time is irrelevant, my dear boy. You must remember, Lucy and I have both been drifting these streets for many, many a year now. We’ll be fine with a few weeks apart—as they say, absence makes the heart grow fonder.” He frowned. “Alas, you should be worrying about a living vision of grace and beauty!” Bartholomew said gravely, looking toward the booths in the bar area.\u003c/p\u003e\n\u003cp\u003e“What?” Sean turned to stare.\u003c/p\u003e\n\u003cp\u003eVanessa Loren was seated in one of the booths, oblivious to his presence—and all else, including the slightly inebriated college student attempting a rap number on stage. She was facing a man; Sean could see shoulders and a head of dark hair. She was speaking passionately, and seemed to be upset.\u003c/p\u003e\n\u003cp\u003e“Who is it?” Sean asked David, frowning. “I didn’t know Vanessa was in here.”\u003c/p\u003e\n\u003cp\u003e“I don’t know who it is, and you didn’t ask about her. We were talking. She saw that fellow in the doorway and excused herself, telling me it was an old friend she was surprised to see.”\u003c/p\u003e\n\u003cp\u003e“Really?” Sean said.\u003c/p\u003e\n\u003cp\u003eSo who was the guy?\u003c/p\u003e\n\u003cp\u003eYeah, right, and what was it to him?\u003c/p\u003e\n\u003cp\u003eThat morning she had attracted him. In fact, he realized, he was more than attracted, and he didn’t want to be. He wanted everything professional, every single decision he made. But she had slipped into him, mind, soul and substance, since he had first seen her sitting here in O’Hara’s, and he wondered if that was why he had wanted to fight anything she had to say to him—it was far safer, it was far more professional not to be attracted to an employee, especially when employment started out with such a story.\u003c/p\u003e\n\u003cp\u003eAll right, face it, he didn’t want her bothered by anyone. All right, in all honesty, he wasn’t sure what he wanted, but he didn’t want her there with anyone else.\u003c/p\u003e\n\u003cp\u003eHe had no right to feel that way—he still barely knew her. A day of diving did not a long-term friend make, nor did standing near her, realizing just what a chemical mystique she possessed, give him the right to go interrupting her conversations with other men.\u003c/p\u003e\n\u003cp\u003eHe stood. He suddenly felt as if he were a jealous boyfriend, irked that his girlfriend was flirting with someone else. Ridiculous feeling—but she had pursued him, determined on her course of action. And people had been murdered. He’d agreed to what she wanted—he did have a right to find out why she appeared to be so disturbed.\u003c/p\u003e\n\u003cp\u003eIf she was happy speaking with an old friend, fine. But if she wasn’t, well, she had appealed to him for help in one way already.\u003c/p\u003e\n\u003cp\u003eEven as he approached the booth, he didn’t think that this was anyone with whom Vanessa had an intimate relationship. They were on opposite sides of the booth. Her hands went from the table to the air as she spoke but never touched his. When he was speaking, she sat leaning back, arms crossed over her chest, and she seemed annoyed.\u003c/p\u003e\n\u003cp\u003eHe reached the end of the booth. The man was talking, but he fell silent when Sean arrived and started to get up. He was about Vanessa’s age, tall, well built and well bronzed, as if he spent a lot of time in the sun.\u003c/p\u003e\n\u003cp\u003eSean set a hand on his shoulder. “Sit, sit, sorry, I didn’t mean to interrupt a conversation. I just came by to say hello to Vanessa.”\u003c/p\u003e\n\u003cp\u003e“Hello, Sean,” Vanessa said, her voice tight.\u003c/p\u003e\n\u003cp\u003e“Sean—Sean O’Hara?” the man asked.\u003c/p\u003e\n\u003cp\u003e“Yes. And…you are?”\u003c/p\u003e\n\u003cp\u003eThe young man stood quickly, offering his hand. “Jay. Jay Allen.”\u003c/p\u003e\n\u003cp\u003eJay Allen.\u003c/p\u003e\n\u003cp\u003eProducer, director and the man who had lost a small fortune because of the murders on Haunt Island.\u003c/p\u003e\n\u003cp\u003e“Please, sit down, please, please, join us,” Jay said.\u003c/p\u003e\n\u003cp\u003eVanessa didn’t seem to want to have anyone—more specifically him—join them. Her jaw was set at a rigid angle and she stared at Jay as if her eyes were vivid blue daggers.\u003c/p\u003e\n\u003cp\u003eHe was definitely going to join them.\u003c/p\u003e\n\u003cp\u003eVanessa didn’t move; she didn’t look away from Jay and she appeared rigidly angry. Sean slid in beside Jay as he scooted to the inside edge of the booth.\u003c/p\u003e\n\u003cp\u003e“Frankly, I’m here to apply for work—with you,” Jay said.\u003c/p\u003e\n\u003cp\u003eSean thought that Vanessa kicked Jay under the table.\u003c/p\u003e\n\u003cp\u003e“Oh?” Sean asked.\u003c/p\u003e\n\u003cp\u003eJay nodded. “I heard that Vanessa was down here and that there were filmmakers about to embark on a historical documentary. I was working—filming tourists while they played with dolphins—in the Bahamas.” \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-night-bone-island-trilogy-2/page-15.html","bookId":2287,"creation":"Oct 5, 2019 5:52:42 PM","modification":"Oct 5, 2019 5:52:42 PM"}
