{"id":91710,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSean hesitated. “I think I feel now more than ever that we have to,” he said. “Maybe stealing the body was someone’s idea of a prank. And maybe there is something here that we’re not seeing—but maybe we’re close, and there was something we weren’t meant to discover. I don’t know. Not much makes sense yet. But yes. With what and who we have—hell, yes, we have to move forward now.”\u003c/p\u003e\n\u003cp\u003eWhile Sean was gone, Vanessa continued to study the schedule, adding in notes and suggestions. She liked reviewing his work, and going over all the notes he had made about supplies, lighting and editing in the scenes that would go with the narrative.\u003c/p\u003e\n\u003cp\u003eShe rose at one point, realizing that they’d had coffee but not breakfast. Now it was nearly lunchtime, and she was hungry.\u003c/p\u003e\n\u003cp\u003eShe heard the sound of the air-conditioner kicking on as she walked to the kitchen. It might be late fall, but the day was growing warm. The sun was bright outside, casting the dancing rays of rebounding sunlight into the room to play with dust motes in the air again.\u003c/p\u003e\n\u003cp\u003eShe froze again.\u003c/p\u003e\n\u003cp\u003eHe was there again.\u003c/p\u003e\n\u003cp\u003eSomeone by the window. Someone in pirate attire.\u003c/p\u003e\n\u003cp\u003eShe nearly screamed. She felt again the weakness of her legs buckling.\u003c/p\u003e\n\u003cp\u003eAt first, her mind raced in a somewhat rational direction.\u003c/p\u003e\n\u003cp\u003eCarlos. It was Carlos Roca. She had seen him, and he was real, and she was wrong, and Sean was right, and he was guilty of murder, and now he had come for her.\u003c/p\u003e\n\u003cp\u003eBut it wasn’t Carlos.\u003c/p\u003e\n\u003cp\u003eIt was the pirate—the dandy pirate.\u003c/p\u003e\n\u003cp\u003eThe tall, striking fellow with the sweeping hat and brocade coat. The one she had seen yesterday, and then briefly again just this morning.\u003c/p\u003e\n\u003cp\u003eShe would blink, and he would go away. He wasn’t real. He was her mind playing tricks.\u003c/p\u003e\n\u003cp\u003eReally no. She was seeing things.\u003c/p\u003e\n\u003cp\u003eBut she blinked, and this time he remained. She realized that he was staring at her with equal consternation. He jumped up, his eyes locked with hers, and gasped.\u003c/p\u003e\n\u003cp\u003e“Oh my God!” he cried.\u003c/p\u003e\n\u003cp\u003eShe was hearing things, as well as seeing them. Not just a figurehead through a camera lens. Oh, no, this was much worse. This was a walking, talking pirate ghost.\u003c/p\u003e\n\u003cp\u003eIn her room.\u003c/p\u003e\n\u003cp\u003eShe let out a weak scream.\u003c/p\u003e\n\u003cp\u003eHe let out a weak scream.\u003c/p\u003e\n\u003cp\u003eHer mouth worked hard.\u003c/p\u003e\n\u003cp\u003e“Mad Miller!” she gasped.\u003c/p\u003e\n\u003cp\u003e“Good God, no!” the apparition replied in horror.\u003c/p\u003e\n\u003cp\u003eReplied. It was talking to her, the images talked to her now, even when she was awake.\u003c/p\u003e\n\u003cp\u003eShe fell back against the door, her hand flying to her throat.\u003c/p\u003e\n\u003cp\u003e“You’re not there,” she gasped out.\u003c/p\u003e\n\u003cp\u003e“My God! You can see me!” he cried. “You can really see me!”\u003c/p\u003e\n\u003cp\u003eHer knees were really buckling now. And he seemed to be fading in and out, and she wasn’t sure what she saw, or what she heard.\u003c/p\u003e\n\u003cp\u003e“Who are you?” she demanded.\u003c/p\u003e\n\u003cp\u003e“A friend, I swear. All right, I’m dead, I’m a ghost—but I’m a friend, honest to God, please don’t scream again!”\u003c/p\u003e\n\u003cp\u003eShe didn’t.\u003c/p\u003e\n\u003cp\u003eSo much for being strong. So much for being the kind of woman who just didn’t pass out.\u003c/p\u003e\n\u003cp\u003eShe slumped against the wall and sank to the floor, entering a sweet world of darkness and silence.\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eAs he headed back to his house, Sean tried not to dwell on the stolen corpse. He called different suppliers, making sure that everything was set for them to leave in the morning. He had a few calls to make, since they needed everything from diving supplies to film, memory cards, backup equipment and groceries.\u003c/p\u003e\n\u003cp\u003eDavid called to let him know that he and Jamie were at the dock and that things were coming as promised.\u003c/p\u003e\n\u003cp\u003eHe tried calling Vanessa, but she didn’t pick up.\u003c/p\u003e\n\u003cp\u003eShe was at his house—locked in.\u003c/p\u003e\n\u003cp\u003eBut he found himself hurrying. He didn’t know why the theft of the body disturbed him so much. Liam had been right—it had probably been some kind of a prank. Or, God knew, maybe an eccentric collector had decided that he just had to have a mummified murder victim from the early eighteen hundreds.\u003c/p\u003e\n\u003cp\u003eStill, as he neared his house, he was almost running. It occurred to him that he’d been gone a long time. Liam had not been able to leave the station then—he’d been tying up his paperwork and transferring his workload to other detectives throughout the day in preparation for taking his vacation time with Sean and David and the crew.\u003c/p\u003e\n\u003cp\u003eAn hour at the range had been good. He’d always had a clear eye and a steady aim, but since guns weren’t in his workaday world, he hadn’t carried one in a long time.\u003c/p\u003e\n\u003cp\u003eThe day’s events at the fort and beach would be drawing to a close, but there would be parties, lectures and “pirate” entertainment as the night arrived. Once again, pirates and their consorts would be roaming the streets. At the moment, it was one of the most beautiful times of the day; there was nothing like a Key West sunset. The bright sunlight gave way to a gentle, pale yellow, and the brilliant blue of the sky overhead became a silver-gray. Then the sun started down, and it seemed that the horizon and everything around was shot full with a palette of unbelievable colors, from deep magenta to the most delicate pink, shimmering gold to gentle rose. It was most amazing to watch the sun set over the water, but to Sean, the colors were still visible, and the colors were what created the beauty.\u003c/p\u003e\n\u003cp\u003eThe brighter shades were just giving way to violet, silver and gray when he reached his house. Once there, he bounded up the walk and fitted his key into the lock, calling Vanessa’s name.\u003c/p\u003e\n\u003cp\u003eIn the foyer, he paused, calling her name again.\u003c/p\u003e\n\u003cp\u003eVanessa was there. She walked to the foyer from the center of the house and the kitchen and dining-room area.\u003c/p\u003e\n\u003cp\u003eShe stared at him with immense eyes that seemed to accuse him of the foulest of heinous deeds.\u003c/p\u003e\n\u003cp\u003e“Sean,” she said.\u003c/p\u003e\n\u003cp\u003eHe noticed that she had shampooed her hair and that she was wearing a white halter dress that showed off the tan of her skin.\u003c/p\u003e\n\u003cp\u003e“Are we going somewhere?” he asked.\u003c/p\u003e\n\u003cp\u003e“Oh, yes. Bon voyage party at O’Hara’s. All of our friends will be joining us,” she told him. “It will be Katie’s last night for now, so she’s going to be there in case Clarinda needs her. David said as long as we’re all ready and aboard by ten we’ll be fine…oh, and Marty has turned his booth over to his friend for pirate fest—you have been gone awhile. Did you learn anything?”\u003c/p\u003e\n\u003cp\u003e“No. The police barely know where to start searching for the chest. I went—I went to target practice with Liam.”\u003c/p\u003e\n\u003cp\u003e“We’re having guns aboard?” she asked, frowning.\u003c/p\u003e\n\u003cp\u003e“Think about it. Yes,” he said.\u003c/p\u003e\n\u003cp\u003e“Well, we don’t have to leave right away. Come in and sit down and let’s talk for a minute, shall we? Sit, please. Can I get you something? It is your house, of course. Thank goodness, the choices here are much broader than what I have up in my room. Beer? Wine? Soda, soda and whiskey, or whiskey. Rum! That’s right. It’s a pirate drink. Strange, I’ve had this growing affection for a good stiff drink from just about the time I arrived here.”\u003c/p\u003e\n\u003cp\u003eShe was definitely behaving strangely, and yet she certainly seemed stone-cold sober.\u003c/p\u003e\n\u003cp\u003eHe followed her to the dining room. He noticed that Bartholomew was there. He was seated at the dining-room table. He looked at Sean with a guilty expression.\u003c/p\u003e\n\u003cp\u003eSean frowned, feeling a sensation of dread.\u003c/p\u003e\n\u003cp\u003e“I’ll take a beer,” Sean said. “But I can get it myself.”\u003c/p\u003e\n\u003cp\u003e“No, no, let me. Sit,” she said.\u003c/p\u003e\n\u003cp\u003eHe took a chair at the end of the table. Bartholomew—for once—was silent.\u003c/p\u003e\n\u003cp\u003eVanessa set a beer in front of him. She had taken one for herself, and walked around to take a seat at the other end of the dining-room table.\u003c/p\u003e\n\u003cp\u003e“Sean, I mentioned to you that I see a figurehead—with Dona Isabella’s face on it—in the water, and it leads me to things beneath.”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said slowly. Carefully.\u003c/p\u003e\n\u003cp\u003eShe learned toward him, eyes snapping with light and anger. “You hypocrite!”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You tell me everything is a trick of the mind—when you live with a ghost!”\u003c/p\u003e\n\u003cp\u003eHe was certain that his jaw fell. Then, of course, he gave himself away by staring at Bartholomew. She saw him! She saw Bartholomew.\u003c/p\u003e\n\u003cp\u003e“What a jerk!” she told him. “You might have mentioned your pirate friend to me!”\u003c/p\u003e\n\u003cp\u003e“Privateer,” Bartholomew said, but weakly.\u003c/p\u003e\n\u003cp\u003e“You see him,” he said, his voice just as pale.\u003c/p\u003e\n\u003cp\u003e“Yes, and he nearly gave me a heart attack. You should have told me. When I saw him, I thought that he might have been Mad Miller—”\u003c/p\u003e\n\u003cp\u003e“That was terribly insulting,” Bartholomew interjected.\u003c/p\u003e\n\u003cp\u003e“How was I supposed to know?” Vanessa snapped to him. She wagged a finger at Sean. “You should have told me!”\u003c/p\u003e\n\u003cp\u003eHe opened his mouth but no sound came. He cleared his throat and tried again. “You would have thought that I was crazy.”\u003c/p\u003e\n\u003cp\u003e“Really? That’s great. Instead, I’ve been thinking that I’m crazy.”\u003c/p\u003e\n\u003cp\u003e“You can see him—clearly?” Sean asked.\u003c/p\u003e\n\u003cp\u003e“She’s far more perceptive than you’ll ever be,” Bartholomew said.\u003c/p\u003e\n\u003cp\u003e“Thank you so much,” Sean said dryly.\u003c/p\u003e\n\u003cp\u003e“You want everything to be black and white,” Bartholomew said. “You want science and explanations.”\u003c/p\u003e\n\u003cp\u003e“There is probably a science to everything,” Sean said. He looked at Bartholomew. “We just haven’t figured it all out yet.”\u003c/p\u003e\n\u003cp\u003e“I hope not—I hope something is left to a—a dimension of faith, or the next world, be it Heaven or Hell,” Bartholomew said earnestly. “God forbid someone discovers how to force a soul to stay on this earthly plain.”\u003c/p\u003e\n\u003cp\u003eSean looked from Bartholomew to Vanessa. “You hear him clearly, too?”\u003c/p\u003e\n\u003cp\u003e“Perfectly. Actually, we had a lovely discussion this afternoon. He’s been around watching out for me a great deal of the time. I kept feeling as if there were…something. Of course, I didn’t believe in ghosts,” she said. “But now…”\u003c/p\u003e\n\u003cp\u003e“Oh, please,” Bartholomew said. “You are not all sharing a mental experience, or conjuring the same imaginary friend.” \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-night-bone-island-trilogy-2/page-37.html","bookId":2287,"creation":"Oct 5, 2019 5:52:42 PM","modification":"Oct 5, 2019 5:52:42 PM"}
