{"id":91717,"no":44,"title":"Page 44","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eZoe laughed softy, but the sound seemed a little nervous. “Lew! You don’t believe that story, do you?”\u003c/p\u003e\n\u003cp\u003eLew smiled. “It is a tale, it is a legend. All people have tales and legends, and perhaps they come from a grain of truth.” He shrugged. “I do believe in good and evil, and they dwell within all of us.”\u003c/p\u003e\n\u003cp\u003e“On that, I’ll have more coffee!” Bill said. He stood, and having been sitting next to Zoe, he asked her, “Zoe, more coffee? You’re shivering.”\u003c/p\u003e\n\u003cp\u003e“I admit to being a little nervous,” she said.\u003c/p\u003e\n\u003cp\u003eHe smiled at her. “Don’t be. I’ll protect you,” he said.\u003c/p\u003e\n\u003cp\u003eWatching them, Vanessa smiled. She hadn’t realized—though perhaps she should have—that Bill seemed to have a crush on Zoe. Ah, the slightly older woman. She smiled back at Bill. Maybe Zoe had a crush on the younger man, as well. “Thanks,” Zoe said. “I’ll hold you to that!”\u003c/p\u003e\n\u003cp\u003eWell, that was good. Zoe would have Bill with her, and she wouldn’t be as nervous, and there was always safety in numbers.\u003c/p\u003e\n\u003cp\u003e“I think I’m just calling it a night,” Katie said, yawning. “I imagine we want to start out on a dive pretty early?” she asked.\u003c/p\u003e\n\u003cp\u003e“Actually, I was thinking just after twelve tomorrow,” Sean said. “I want to take some footage with the original film crew, each person talking a bit more about what they did. And we’ll take a walk down the beach, see what we see. Maybe discern if another boat might have come in during the night.”\u003c/p\u003e\n\u003cp\u003e“Well, a boat had to have come in—I think,” Barry said. He was frowning. “I mean, if a boat didn’t come in, it means…Carlos…or…” He fell silent.\u003c/p\u003e\n\u003cp\u003eThe group was silent.\u003c/p\u003e\n\u003cp\u003eThe fire snapped and crackled.\u003c/p\u003e\n\u003cp\u003e“One of us will be on guard all night, every night,” Sean said.\u003c/p\u003e\n\u003cp\u003e“One of us?” Jake asked.\u003c/p\u003e\n\u003cp\u003e“One of us who wasn’t with the original crew,” Sean said.\u003c/p\u003e\n\u003cp\u003eThere was silence again. “Well, good night, all,” Katie said, and she left the group.\u003c/p\u003e\n\u003cp\u003eSean rose and talked to Marty for a moment. The others began to rise and murmur good-nights and head for their tents.\u003c/p\u003e\n\u003cp\u003eVanessa realized that Marty was going to bed; that Sean was taking the first watch.\u003c/p\u003e\n\u003cp\u003eHe looked at her and she smiled, nodded and turned to head for their tent. She slipped inside and almost started—she still wasn’t accustomed to Bartholomew showing up all the time.\u003c/p\u003e\n\u003cp\u003e“Sean is on first watch,” he said softly.\u003c/p\u003e\n\u003cp\u003eShe sat at the foot of her canvas bunk, smiling. “And you’re watching over me?”\u003c/p\u003e\n\u003cp\u003eHe winced. “Hey, I can watch over you at least. And I can make a few things happen. I can push buttons…I can trip people. I’m not bad at manifestations, but…”\u003c/p\u003e\n\u003cp\u003e“What?” Vanessa asked.\u003c/p\u003e\n\u003cp\u003e“I was listening to that fellow tonight, the Bahamian, Lew Sanderson,” Bartholomew said.\u003c/p\u003e\n\u003cp\u003e“He was telling a story,” Vanessa said. “An African legend.”\u003c/p\u003e\n\u003cp\u003e“Yes, of course. But often…well, gods and goddesses, angels and demons…it’s strange how the world can be so different, and yet so much the same. The Norse had Odin, the Romans, Jupiter, and the Greeks had Zeus, and he was nearly one and the same. The Christian, Jewish and Muslim faiths recognize one God, but he lives in Heaven with the angels, and the angels often have characteristics that line up with the lesser gods in other religions.”\u003c/p\u003e\n\u003cp\u003eShe was startled at first that he seemed so philosophical, but then she realized that he was seriously troubled by Lew’s story.\u003c/p\u003e\n\u003cp\u003e“You’re talking about the fact that people here thought the bitter sister’s soul haunted the ocean, while many people now believe there’s something eerie about the Bermuda Triangle?” Vanessa asked.\u003c/p\u003e\n\u003cp\u003eHe nodded. He stared at her. “Well, I told you—the legend that has come down about Mad Miller and Kitty Cutlass…well, there’s just something wrong with it. Mad Miller got his name because another fellow was making fun of him one day and called him mad because he was…well, he was a bit of a fop. He hated blood. And Kitty…Kitty was in love with Mad Miller because he was the best thing that ever came along in her sad and pathetic life. You were making a film about them and Dona Isabella. I was thinking that…well, obviously, I’m still around, and maybe they are, too.”\u003c/p\u003e\n\u003cp\u003e“Bartholomew, we’ve all agreed that ghosts couldn’t have committed the murders,” Vanessa said. “I mean, thank God…thank God we do have you, because we know what ghosts can and can’t do. And I always believed that ghosts stayed behind because…they were lost, or they needed help, or justice, or they stayed behind to help others.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Bartholomew said.\u003c/p\u003e\n\u003cp\u003e“What do you mean maybe? You are a ghost!” Vanessa reminded him.\u003c/p\u003e\n\u003cp\u003eHe nodded. “It doesn’t mean I have all the answers. Hey, I was a decent fellow in life. I’m a damned decent fellow in death. But perhaps, if you were a bastard in life, you stay a bastard in death.”\u003c/p\u003e\n\u003cp\u003e“You keep telling me that Mad Miller was basically a prissy-ass pansy,” Vanessa said with a sigh.\u003c/p\u003e\n\u003cp\u003e“Yes, I know, though your language is quite colorful,” Bartholomew said.\u003c/p\u003e\n\u003cp\u003e“Sorry.”\u003c/p\u003e\n\u003cp\u003e“That’s why I’m perplexed,” Bartholomew said. “Ah, well, you had best get some sleep. I think you’ll need it in the days to come.” He stood. “I’ll be near,” he promised her.\u003c/p\u003e\n\u003cp\u003eShe smiled, thanked him and bid him good-night.\u003c/p\u003e\n\u003cp\u003eIt wasn’t until he was gone and she lay back and watched the fire dancing on the canvas of the tent that she felt alone and uneasy—and suddenly fully aware of the last time she had lain in a tent on the beach at Haunt Island.\u003c/p\u003e\n\u003cp\u003eShe remembered dreaming first that Georgia had come to her. She had almost heard the young woman’s voice in the shadows of the night as tears streamed down her cheeks.\u003c/p\u003e\n\u003cp\u003eI told you there were monsters.\u003c/p\u003e\n\u003cp\u003eThen Georgia’s image had faded, and she must have seen the shadows against the canvas of the tent even in her sleep, because they had seemed like giant monsters rising from the sea, made of seaweed, forming arms, reaching into the sky.\u003c/p\u003e\n\u003cp\u003eShe sighed and lay awake, and thought that she would do so until Sean’s watch was over.\u003c/p\u003e\n\u003cp\u003eBut somewhere along the line, she fell asleep, and she didn’t dream. She was vaguely aware of Sean coming into the tent, and she was comfortably aware that she tried to get close to him.\u003c/p\u003e\n\u003cp\u003eThen she let out a startled little cry—completely unaware that she had fallen.\u003c/p\u003e\n\u003cp\u003e“Vanessa!” It was Sean’s voice, and a light suddenly flared in their little tent. She was on the ground between the two cots. They’d been pushed together, but in trying to get too close, she had wedged them apart.\u003c/p\u003e\n\u003cp\u003eSean was stretched out on his own, flashlight in one hand as he smiled and reached for her hand with the other.\u003c/p\u003e\n\u003cp\u003eShe grimaced ruefully. “I suppose I forgot where we were.”\u003c/p\u003e\n\u003cp\u003e“Hey!”\u003c/p\u003e\n\u003cp\u003e“Vanessa!”\u003c/p\u003e\n\u003cp\u003e“What’s going on?”\u003c/p\u003e\n\u003cp\u003eThere was a chorus of voices just outside the tent. She scrambled up, glad that she had chosen to sleep in an encompassing flannel gown. She pushed open the flap to the tent just as Katie was nervously opening it.\u003c/p\u003e\n\u003cp\u003e“Vanessa!” Katie said.\u003c/p\u003e\n\u003cp\u003eDavid was behind her, Liam was behind him, and it seemed that everyone was gathered outside their little tent.\u003c/p\u003e\n\u003cp\u003e“You screamed!” Zoe said.\u003c/p\u003e\n\u003cp\u003eBarry cleared his throat. “Um, it didn’t sound like a scream of…um, er, happiness.”\u003c/p\u003e\n\u003cp\u003eSean was behind her then. “Sorry, all.”\u003c/p\u003e\n\u003cp\u003e“I fell off the cot,” Vanessa said, aware of the flush that was rising to her cheeks like fire.\u003c/p\u003e\n\u003cp\u003e“What?” Bill said, and then started to laugh.\u003c/p\u003e\n\u003cp\u003e“Oh, Lord! You scared us silly,” Zoe said, laughing, as well.\u003c/p\u003e\n\u003cp\u003e“No more even slightly scary stories around the campfire,” Lew Sanderson said, shaking his head. “May I suggest you pull the cot mattresses down and leave them on the sand?”\u003c/p\u003e\n\u003cp\u003e“Great idea, Lew, thanks,” Sean said. “Forgive us, folks, and get some sleep.”\u003c/p\u003e\n\u003cp\u003eThe good thing was that everyone seemed to be amused. The negative, of course, was seeing just how on edge they had all been.\u003c/p\u003e\n\u003cp\u003eAnd probably would remain.\u003c/p\u003e\n\u003cp\u003eSean looked down at her, his grin broad. He pulled her into his arms. “Let’s get those mattresses down, huh? We’ll fold up the bunks—I think we’ll wind up with more room.”\u003c/p\u003e\n\u003cp\u003eShe agreed. It was really late; they were both exhausted, and aware of the thinness of the canvas that separated them from the others.\u003c/p\u003e\n\u003cp\u003eAnd still…\u003c/p\u003e\n\u003cp\u003eIt was good to be close. Seaweed monsters were just shadows on canvas, and Georgia Dare did not return that night with tears streaming down her face to plague Vanessa’s dreams.\u003c/p\u003e\n\u003cp\u003eShe thought the morning might be bad as well, with the interviews on the beach. But the sun was shining, the day was bright, and it was hard to imagine that anything horrible had happened in such a beautiful place on such a pristine beach.\u003c/p\u003e\n\u003cp\u003eThey were surrounded by people.\u003c/p\u003e\n\u003cp\u003eThat was good.\u003c/p\u003e\n\u003cp\u003eMarty and Jamie O’Hara seemed large, wise and imposing, and as she watched the men, naturally taking positions that seemed to guard the group from opposite angles, she realized that they had been asked along from the very beginning because Sean had felt that he needed a security force of those he knew and trusted. They were able seaman, divers and outdoorsmen, but they took no part in any of the filming. They simply watched, interested.\u003c/p\u003e\n\u003cp\u003eThe only one missing during the morning was Liam. Sean told her he was doing some work on his computer on the boat. He didn’t mention what. But Liam was a police officer, and he had taken leave at a time when the force was short, and she assumed he was keeping in contact with his colleagues, keeping up on events in Key West.\u003c/p\u003e\n\u003cp\u003eShe was interviewed with Jay, who was matter-of-fact. She spoke about seeing the heads when she had come down the beach. Jay walked to the sand and winced as he told about his disbelief at what they had come upon.\u003c/p\u003e\n\u003cp\u003eThey were all quiet and somewhat mournful when they finished the segment. They walked back to the encampment in comparative silence. Once there, however, everyone set about the business of a light lunch, since they’d head out to the reefs and an afternoon dive soon after. Zoe and Katie went about setting out the sandwich meats, cheeses, lettuce, tomatoes and condiments, but everyone helped themselves, and everyone picked up after themselves. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-night-bone-island-trilogy-2/page-44.html","bookId":2287,"creation":"Oct 5, 2019 5:52:42 PM","modification":"Oct 5, 2019 5:52:42 PM"}
