{"id":91682,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSean stared at him, hiding a smile.\u003c/p\u003e\n\u003cp\u003e“I have spent some time in the police station, obviously,” Bartholomew said. “Actually, it’s quite something. People are always saying ‘I’d just love to be a fly on the wall.’ Well, that is one thing about departing one’s earthly form. I am able to be a fly on the wall.”\u003c/p\u003e\n\u003cp\u003e“Ah, so you’re an expert now on all things law enforcement,” Sean teased.\u003c/p\u003e\n\u003cp\u003e“No, I’m gifted at listening to other people—and you may never know when you need the services of an excellent eavesdropper.”\u003c/p\u003e\n\u003cp\u003e“Point noted, thank you. Isn’t it time for high tea, or something like that?” Sean asked.\u003c/p\u003e\n\u003cp\u003e“I’m off to find my dear beauty in white,” Bartholomew said. “Be nice to me, Sean O’Hara—I believe I’m still here to watch out for you, so you just may find that you need me!”\u003c/p\u003e\n\u003cp\u003eBartholomew walked to the door, and disappeared through it.\u003c/p\u003e\n\u003cp\u003eSean turned back to the computer and keyed in the name Vanessa Loren.\u003c/p\u003e\n\u003cp\u003e“Fascinating!” Marty said to Vanessa. She and Katie had joined him at his house on Fleming Street. It was what they called a “shotgun” house, built with a long hall or breezeway, so that if the front and back doors were both open, you could fire a shotgun and the bullet would run right through the house. Basically, the plan was to keep the air going through the house at all times, since it had been built long before air-conditioning became a customary feature in homes in the hot, subtropical climes of the Keys.\u003c/p\u003e\n\u003cp\u003eMarty seemed like a very nice guy. Vanessa had actually seen him before, stopping in at O’Hara’s for Katie’s business, Katie-oke. O’Hara’s was always pleasant and laid-back, and a lot of locals planning acts for different festivals, private parties or any such ventures spent time there. The bar had the kind of comfortable feel that worked for locals and tourists alike. Vanessa hadn’t met Marty formally before, but she’d seen him do a good job with a pirate bellow in a rollicky sea shanty.\u003c/p\u003e\n\u003cp\u003eHis house was decorated to fit the man. There were a number of ship’s bells, ships in bottles, old figureheads, anchors and other paraphernalia from the past set up around the house; he was a collector of books, music, logs, parchments, deeds, old money and more. The place was eclectic and comfortable. Vanessa thought that he must have a small fortune in the place as far as the value of some of the antiques would go, but it was still comfortable and casual.\u003c/p\u003e\n\u003cp\u003e“Fascinating!” Marty repeated, then he looked sheepish and rueful. “Oh, that’s terrible, that’s really terrible of me to say. I’m so, so sorry about your friends, of course. And I suppose it all did terrible things to the futures of those who survived. But that it all happened when you were working on a movie about Mad Miller and Kitty Cutlass… I’ve always been intrigued by the tales of people that have come down to us. History. People make it so dry. This date and that date. It’s not dates schoolchildren should be remembering—it’s the people. History should be like a reality show—or Oprah. No, Jerry Springer. People love the weaknesses, the cruelty and sometimes even the honor of others!”\u003c/p\u003e\n\u003cp\u003e“Maybe an enterprising person will get it together that way one day, Marty,” Katie said.\u003c/p\u003e\n\u003cp\u003e“Aha!” Marty told her happily. “That’s exactly what I’m doing at the fort this year. An interview with a few of our notorious pirates and their consorts. You have to come. Better yet, you could be consorts, harlots, barmaids—”\u003c/p\u003e\n\u003cp\u003e“I have to work, Marty,” Katie reminded him.\u003c/p\u003e\n\u003cp\u003e“I’m hoping to be working,” Vanessa said.\u003c/p\u003e\n\u003cp\u003eMarty sighed, disappointed, and studied Vanessa. “Have you not worked for the last two years—since the incident on Bimini?”\u003c/p\u003e\n\u003cp\u003e“No, no, I’ve been working, Marty. I’m doing all right. You know the commercial for the new under water camera that any two-year old can use? I wrote it.”\u003c/p\u003e\n\u003cp\u003eMarty shuddered. “All those two-year-olds!”\u003c/p\u003e\n\u003cp\u003e“It was fun, actually. We shot in a lovely private pool, and the kids were really adorable,” Vanessa assured him.\u003c/p\u003e\n\u003cp\u003eMarty still looked at her worriedly. “You okay down here? Where are you staying?”\u003c/p\u003e\n\u003cp\u003e“She’s got a perfectly good room at my house or with David and me—she won’t take either,” Katie said.\u003c/p\u003e\n\u003cp\u003e“I’m just down Duval, perfect location, a little room for rent above one of the shops,” Vanessa told him. “And I’m quite happy.”\u003c/p\u003e\n\u003cp\u003e“But what if you’re not safe?” Marty asked.\u003c/p\u003e\n\u003cp\u003e“I’m right on Duval, in the midst of the tourist horde. There’s someone up just about all hours of the night, and the cops are out in droves. I’m safe. Look, I’ve been bugging police and anyone else you can think of for two years—whatever happened, happened. It’s sliding by, and that’s why I’m so concerned. This killer might lie dormant for a long time, then swoop down on another group of unsuspecting boaters.”\u003c/p\u003e\n\u003cp\u003eMarty stood. “Well. Just in case you didn’t come across this in your research, I have something to show you.”\u003c/p\u003e\n\u003cp\u003eHe walked over to the large buffet where a ship’s dining bell held the central position. Reaching behind it, he pulled out a framed picture. He turned to her with pleasure in his eyes. “Dona Isabella!” he told her.\u003c/p\u003e\n\u003cp\u003eVanessa walked over to study the picture. It was a pen-and-ink drawing of a woman in an elegant gown circa the early eighteen hundreds. Her hair was loose, curling around her shoulders. The artist had captured the beauty of the woman, and something more—something that was partly flirtatious and might also be cunning. She could see that the sketch had been titled “The Mystery of a Woman.”\u003c/p\u003e\n\u003cp\u003e“How do you know that this is Dona Isabella?” Vanessa asked.\u003c/p\u003e\n\u003cp\u003eMarty smiled, proud of his acquisition. He opened the frame, showing the old parchment on which the portrait had been sketched, and the signature of the artist. Len Adams had sketched the picture, and he had written, “Dona Isabella at Tea with a Friend, 1834.”\u003c/p\u003e\n\u003cp\u003e“I’ve had it authenticated, of course,” Marty said. “Len Adams is known down here—his pieces are coveted. He died very young of tuberculosis, so he doesn’t have an extensive body of work. He came here because he was dying in the north. He died anyway. But he sketched many wonderful portraits.”\u003c/p\u003e\n\u003cp\u003eVanessa was fascinated by the picture, and suddenly felt guilty about her slasher-film script. Of course, in the movie, Dona Isabella had been the victim of Kitty Cutlass, quickly in the film, and quickly out. It had been Kitty Cutlass who’d returned from her watery grave to join with the ghost of Mad Miller to wreak murder, mayhem and havoc upon the unsuspecting teens sailing to Bimini and on Haunt Island.\u003c/p\u003e\n\u003cp\u003e“Oh, girl, you’re one after my own heart!” Marty said, appreciating the way she looked at the picture. “I’ll copy it for you—won’t be the original, but you’ll have the beauty anytime you choose. Poor thing! So lovely, such a coquette and so tragically young to be a victim.” He looked at Vanessa. “Boy, that would be something, wouldn’t it? What if your people were killed because the ghosts of Mad Miller and Kitty Cutlass are out there, cruising between Key West and Bimini, right into the Triangle, alive through some wild magnetic source?”\u003c/p\u003e\n\u003cp\u003eVanessa stared at him.\u003c/p\u003e\n\u003cp\u003eHe gave her a tap on the shoulder. “Joshing with you, girl. But if you want more pirate history, you come on back here anytime, all right? And if you need anything at all, you come to see me. I’m like a Key West structure, an institution, always here, and I wouldn’t be anywhere else in the world.”\u003c/p\u003e\n\u003cp\u003eShe thanked him, and she and Katie said goodbye.\u003c/p\u003e\n\u003cp\u003e“Do you think that the murders might have had something to do with the story you were filming?” Katie asked as they walked. “No, wait. We’ll wait until we all get together, and then we’ll talk about it. I don’t want to make you repeat it all over and over.”\u003c/p\u003e\n\u003cp\u003eThey stopped in front of the Beckett house and Vanessa looked up at the grand facade. “So you’re living in the Beckett house!” Vanessa teased.\u003c/p\u003e\n\u003cp\u003eKatie shrugged. “Life is pretty bizarre, just like death.”\u003c/p\u003e\n\u003cp\u003e“So it seems,” Vanessa agreed.\u003c/p\u003e\n\u003cp\u003eKatie opened the front door with a key and they stepped into the hallway. She paused. “I guess they’re already here,” she said. They walked through the large parlor, through the kitchen and to the back porch, handsomely furnished with white wicker and plush jungle-colored cushions. There were three men there already—not just the two tall, dark-haired men Vanessa assumed to be Liam and David Beckett, but Sean O’Hara, as well.\u003c/p\u003e\n\u003cp\u003eThey all stood as Vanessa and Katie came into the room.\u003c/p\u003e\n\u003cp\u003eShe envied Katie, who walked comfortably up to David Beckett and slipped an arm around him. There was something nicely sure and confident in the motion, and more so in David’s smile of response. They were happy.\u003c/p\u003e\n\u003cp\u003eDavid and Liam shook hands with Vanessa and were pleasant and cordial. Sean, of course, she had already met.\u003c/p\u003e\n\u003cp\u003eHe waited quietly.\u003c/p\u003e\n\u003cp\u003eThen the awkward silence fell at last.\u003c/p\u003e\n\u003cp\u003e“Why doesn’t everyone sit, and I’ll get some drinks and snacks,” Katie suggested.\u003c/p\u003e\n\u003cp\u003eGreat! Vanessa glared at her, feeling as if she had suddenly been thrown to the wolves.\u003c/p\u003e\n\u003cp\u003eBut she was the one who wanted help!\u003c/p\u003e\n\u003cp\u003eShe sat stiffly, folding her hands around her knees as she looked at the three. “Perhaps this is way out of bounds. But I don’t know where else to go from here.”\u003c/p\u003e\n\u003cp\u003e“Start at the beginning,” David suggested. “Sean has told us what you want us to do—but start back at the beginning, the film shoot you did, everything that happened that night and everything that happened after.”\u003c/p\u003e\n\u003cp\u003eVanessa decided to start out looking straight ahead, and then she decided to speak as naturally as possible and not avoid anyone’s eyes. “I’ve loved Key West since I was a child, since my father first brought me down here. When my friend Jay Allen came to me saying that he wanted to make a film, the first thing that came to my mind was the story of Mad Miller, his mistress, Kitty Cutlass, and the murder of poor Dona Isabella. Everything went fine, and we were down to a skeleton crew—Georgia and Travis, the last characters who remained alive, Jay and myself, of course, two young production assistants, Bill Hinton and Jake Magnoli, and Barry Melkie, our soundman. Zoe was everything as far as props, costume and makeup, with the help of Bill and Jake. Oh, and of course, Carlos Roca. Lew, our Bahamian guide, was there, too. That night, we had just about wrapped, and I was by the fire… Jay was there, I’m not sure who else at first, but everyone was just winding down. Suddenly, Georgia came screaming down the beach—she’d seen heads sticking out of the sand, arms. She described a scene that was the exact one in which we found her and Travis the following morning.” \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-night-bone-island-trilogy-2/page-9.html","bookId":2287,"creation":"Oct 5, 2019 5:52:42 PM","modification":"Oct 5, 2019 5:52:42 PM"}
