{"id":15930,"no":6,"title":"CHAPTER V. Increasing Life.","content":"\u0026nbsp;You must get rid of the last vestige of the old idea that there is a Deity whose will it is that you should be poor, or whose purposes may be served by keeping you in poverty. \n\u003cdiv\u003e\n The Intelligent Substance which is All, and in all, and which lives in All and lives in you, is a consciously Living Substance. Being a consciously living substance, It must have the natural and inherent desire of every living intelligence for increase of life. Every living thing must continually seek for the enlargement of its life, because life, in the mere act of living, must increase itself.\n\u003c/div\u003e \n\u003cdiv\u003e\n A seed, dropped into the ground, springs into activity, and in the act of living produces a hundred more seeds;[43] life, by living, multiplies itself. It is forever Becoming More; it must do so, if it continues to be at all.\n\u003c/div\u003e \n\u003cdiv\u003e\n Intelligence is under this same necessity for continuous increase. Every thought we think makes it necessary for us to think another thought; consciousness is continually expanding. Every fact we learn leads us to the learning of another fact; knowledge is continually increasing. Every talent we cultivate brings to the mind the desire to cultivate another talent; we are subject to the urge of life, seeking expression, which ever drives us on to know more, to do more, and to be more.\n\u003c/div\u003e \n\u003cdiv\u003e\n In order to know more, do more, and be more we must have more; we must have things to use, for we learn, and do, and become, only by using things. We must get rich, so that we can live more.\n\u003c/div\u003e \n\u003cdiv\u003e\n The desire for riches is simply the capacity for larger life seeking fulfillment; every desire is the effort of an[44] unexpressed possibility to come into action. It is power seeking to manifest which causes desire. That which makes you want more money is the same as that which makes the plant grow; it is Life, seeking fuller expression.\n\u003c/div\u003e \n\u003cdiv\u003e\n The One Living Substance must be subject to this inherent law of all life; it is permeated with the desire to live more; that is why it is under the necessity of creating things.\n\u003c/div\u003e \n\u003cdiv\u003e\n The One Substance desires to live more in you; hence it wants you to have all the things you can use.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is the desire of God that you should get rich. He wants you to get rich because he can express himself better through you if you have plenty of things to use in giving him expression. He can live more in you if you have unlimited command of the means of life.\n\u003c/div\u003e \n\u003cdiv\u003e\n The universe desires you to have everything you want to have.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nature is friendly to your plans.\n\u003c/div\u003e \n\u003cdiv\u003e\n [45]\n\u003c/div\u003e \n\u003cdiv\u003e\n Everything is naturally for you.\n\u003c/div\u003e \n\u003cdiv\u003e\n Make up your mind that this is true.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is essential, however, that your purpose should harmonize with the purpose that is in All.\n\u003c/div\u003e \n\u003cdiv\u003e\n You must want real life, not mere pleasure or sensual gratification. Life is the performance of function; and the individual really lives only when he performs every function, physical, mental, and spiritual, of which he is capable, without excess in any.\n\u003c/div\u003e \n\u003cdiv\u003e\n You do not want to get rich in order to live swinishly, for the gratification of animal desires; that is not life. But the performance of every physical function is a part of life, and no one lives completely who denies the impulses of the body a normal and healthful expression.\n\u003c/div\u003e \n\u003cdiv\u003e\n You do not want to get rich solely to enjoy mental pleasures, to get knowledge, to gratify ambition, to outshine others, to be famous. All these are a legitimate part of life, but the man who[46] lives for the pleasures of the intellect alone will only have a partial life, and he will never be satisfied with his lot.\n\u003c/div\u003e \n\u003cdiv\u003e\n You do not want to get rich solely for the good of others, to lose yourself for the salvation of mankind, to experience the joys of philanthropy and sacrifice. The joys of the soul are only a part of life; and they are no better or nobler than any other part.\n\u003c/div\u003e \n\u003cdiv\u003e\n You want to get rich in order that you may eat, drink, and be merry when it is time to do these things; in order that you may surround yourself with beautiful things, see distant lands, feed your mind, and develop your intellect; in order that you may love men and do kind things, and be able to play a good part in helping the world to find truth.\n\u003c/div\u003e \n\u003cdiv\u003e\n But remember that extreme altruism is no better and no nobler than extreme selfishness; both are mistakes.\n\u003c/div\u003e \n\u003cdiv\u003e\n Get rid of the idea that God wants you to sacrifice yourself for others, and[47] that you can secure his favor by doing so; God requires nothing of the kind.\n\u003c/div\u003e \n\u003cdiv\u003e\n What he wants is that you should make the most of yourself, for yourself, and for others; and you can help others more by making the most of yourself than in any other way.\n\u003c/div\u003e \n\u003cdiv\u003e\n You can make the most of yourself only by getting rich; so it is right and praiseworthy that you should give your first and best thought to the work of acquiring wealth.\n\u003c/div\u003e \n\u003cdiv\u003e\n Remember, however, that the desire of Substance is for all, and its movements must be for more life to all; it cannot be made to work for less life to any, because it is equally in all, seeking riches and life.\n\u003c/div\u003e \n\u003cdiv\u003e\n Intelligent Substance will make things for you, but it will not take things away from some one else and give them to you.\n\u003c/div\u003e \n\u003cdiv\u003e\n You must get rid of the thought of competition. You are to create, not to compete for what is already created.\n\u003c/div\u003e \n\u003cdiv\u003e\n [48]\n\u003c/div\u003e \n\u003cdiv\u003e\n You do not have to take anything away from any one.\n\u003c/div\u003e \n\u003cdiv\u003e\n You do not have to drive sharp bargains.\n\u003c/div\u003e \n\u003cdiv\u003e\n You do not have to cheat, or to take advantage. You do not need to let any man work for you for less than he earns.\n\u003c/div\u003e \n\u003cdiv\u003e\n You do not have to covet the property of others, or to look at it with wishful eyes; no man has anything of which you cannot have the like, and that without taking what he has away from him.\n\u003c/div\u003e \n\u003cdiv\u003e\n You are to become a creator, not a competitor; you are going to get what you want, but in such a way that when you get it every other man will have more than he has now.\n\u003c/div\u003e \n\u003cdiv\u003e\n I am aware that there are men who get a vast amount of money by proceeding in direct opposition to the statements in the paragraph above, and may add a word of explanation here. Men of the plutocratic type, who become very rich, do so sometimes purely by[49] their extraordinary ability on the plane of competition; and sometimes they unconsciously relate themselves to Substance in its great purposes and movements for the general racial upbuilding through industrial evolution. Rockefeller, Carnegie, Morgan, et al., have been the unconscious agents of the Supreme in the necessary work of systematizing and organizing productive industry; and in the end, their work will contribute immensely toward increased life for all. Their day is nearly over; they have organized production, and will soon be succeeded by the agents of the multitude, who will organize the machinery of distribution.\n\u003c/div\u003e \n\u003cdiv\u003e\n The multi-millionaires are like the monster reptiles of the prehistoric eras; they play a necessary part in the evolutionary process, but the same Power which produced them will dispose of them. And it is well to bear in mind that they have never been really rich; a record of the private lives of most of[50] this class will show that they have really been the most abject and wretched of the poor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Riches secured on the competitive plane are never satisfactory and permanent; they are yours to-day, and another’s to-morrow. Remember, if you are to become rich in a scientific and certain way, you must rise entirely out of the competitive thought. You must never think for a moment that the supply is limited. Just as soon as you begin to think that all the money is being “cornered” and controlled by bankers and others, and that you must exert yourself to get laws passed to stop this process, and so on; in that moment you drop into the competitive mind, and your power to cause creation is gone for the time being; and what is worse, you will probably arrest the creative movements you have already instituted.\n\u003c/div\u003e \n\u003cdiv\u003e\n KNOW that there are countless millions of dollars’ worth of gold in the mountains of the earth, not yet brought[51] to light; and know that if there were not, more would be created from Thinking Substance to supply your needs.\n\u003c/div\u003e \n\u003cdiv\u003e\n KNOW that the money you need will come, even if it is necessary for a thousand men to be led to the discovery of new gold mines to-morrow.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never look at the visible supply; look always at the limitless riches in Formless Substance, and KNOW that they are coming to you as fast as you can receive and use them. Nobody, by cornering the visible supply, can prevent you from getting what is yours.\n\u003c/div\u003e \n\u003cdiv\u003e\n So never allow yourself to think for an instant that all the best building spots will be taken before you get ready to build your house, unless you hurry. Never worry about the trusts and combines, and get anxious for fear they will soon come to own the whole earth. Never get afraid that you will lose what you want because some other person “beats you to it.” That cannot possibly happen; you are not seeking anything[52] that is possessed by anybody else; you are causing what you want to be created from Formless Substance, and the supply is without limits. Stick to the formulated statement:—\n\u003c/div\u003e \n\u003cdiv\u003e\n There is a thinking stuff from which all things are made, and which, in its original state, permeates, penetrates, and fills the interspaces of the universe.\n\u003c/div\u003e \n\u003cdiv\u003e\n A thought, in this substance, produces the thing that is imaged by the thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n Man can form things in his thought, and, by impressing his thought upon formless substance, can cause the thing he thinks about to be created.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3315/90581.html","bookId":401,"creation":"Aug 2, 2019 7:21:44 AM","modification":"Aug 2, 2019 7:21:44 AM"}
