{"id":73621,"no":18,"title":"Page 18","content":"\u003cp\u003e“Death,” Celeste whispered.\u003c/p\u003e\n\u003cp\u003eEmma realized she’d squeezed her fists tight against her thighs, and she concentrated on releasing them. She willed herself to open her mouth and say something cutting, to sneer at the whole process. But her entire life seemed laid out before her in cardboard. She couldn’t bring herself to move.\u003c/p\u003e\n\u003cp\u003eThe hint of a smile played across Celeste’s lips. “The cards don’t lie,” she whispered. With that, she gathered up her deck and swept away.\u003c/p\u003e\n\u003cp\u003eEmma kept staring down at the table as if the cards were still there. Had something … supernatural just happened?\u003c/p\u003e\n\u003cp\u003eThayer touched her elbow. “Don’t tell me you believe in that crap.”\u003c/p\u003e\n\u003cp\u003eEmma swallowed. “She was right, Thayer. About my mom.”\u003c/p\u003e\n\u003cp\u003eHe rolled his eyes. “She just saw what you were reading and made some guesses. She’s trying to mess with your head.”\u003c/p\u003e\n\u003cp\u003eEmma blinked hard. Of course. The books scattered around her were titled things like Clinical Insanity and A Guide to Psychosis. Celeste had played her. She breathed out, relieved. “Now I feel even stupider.”\u003c/p\u003e\n\u003cp\u003e“You’re not stupid,” he murmured. “You’re scared. But it’s all going to be okay.”\u003c/p\u003e\n\u003cp\u003eIf I crowded as close to my twin as possible, I could almost believe he was speaking to me. That it was my face he looked at like that.\u003c/p\u003e\n\u003cp\u003eEmma shoved the books away from her and gritted her teeth.\u003c/p\u003e\n\u003cp\u003eWe both knew what she needed to do: find out more about Becky, one way or another, and discover what our mad mother was capable of.\u003c/p\u003e\n\u003cp\u003e18\u003c/p\u003e\n\u003cp\u003eMOM, INTERRUPTED\u003c/p\u003e\n\u003cp\u003eAs soon as tennis practice ended, Emma drove straight to the hospital and rode the elevator to the fourth floor. The pungent smell of air freshener stung her nostrils, along with a harsher, antiseptic odor. The hallway was eerily silent, as if the whole ward was bowed under the pressure of its own secrets and delusions. She tightened her jaw and strode to the nurses’ station, her heart beating like a drumroll in her chest.\u003c/p\u003e\n\u003cp\u003eThe young male nurse, bespectacled and prematurely balding, looked up from his computer screen. The reflection from his monitor made twin glowing squares in the lenses of his glasses. “Can I help you?” he asked.\u003c/p\u003e\n\u003cp\u003eShe clenched her fist around the strap of her messenger bag. “I’m here to visit Becky—I mean, Rebecca Mercer.”\u003c/p\u003e\n\u003cp\u003eHe gestured to a sheet of paper attached to a clipboard. “Sign in.”\u003c/p\u003e\n\u003cp\u003eThe page was depressingly blank. Emma printed Sutton’s name neatly. The nurse stepped out from behind the desk and read the inscription with a raised eyebrow. “You’re the daughter, right?”\u003c/p\u003e\n\u003cp\u003eWhat was the right answer? Sort of. Used to be. Just genetically. Instead she just nodded.\u003c/p\u003e\n\u003cp\u003e“She’s been asking for you,” he said, jerking his head to indicate she should follow. Emma trailed behind him. “That’s all any of us can get out of her. ‘I want my daughter.’”\u003c/p\u003e\n\u003cp\u003eWhich one? Emma wondered.\u003c/p\u003e\n\u003cp\u003eThere was a large social room on their left, a half dozen people visible through the windows. Their eyes were trained on a TV tuned to Dancing with the Stars. A bathrobe-clad girl only a little older than Emma stood swaying in time to the music. A middle-aged woman sat by the window, her head in her hands. One of the patients in front of the TV, a man with gray, greasy hair curling down over his neck, looked into the hall and gave Emma a wink. His grin was missing several teeth. Emma hurried after the nurse, swallowing her almost palpable fear. For a moment, she wanted to run back to the elevator, back to Sutton’s car, back home. But she had to do this. She had to talk to Becky.\u003c/p\u003e\n\u003cp\u003eI drifted behind Emma, wishing I could warn her to be careful. This was not a good place. Maybe I was more sensitive now that I was dead, or maybe I was just feeding off of Emma’s anxiety, but all around me I could feel sadness and rage and fear. It was even stronger now than the first time we’d come here—emotions buffeted me from all sides. I felt like a raw nerve.\u003c/p\u003e\n\u003cp\u003e“Sutton?”\u003c/p\u003e\n\u003cp\u003eA hand curled around Emma’s bicep. A scream caught in Emma’s throat. For a split second she was sure it was the gray-haired man from the social room, and a shudder of revulsion swept through her. But then her eyes refocused.\u003c/p\u003e\n\u003cp\u003e“N-nisha?” she asked.\u003c/p\u003e\n\u003cp\u003eNisha’s red-and-white striped uniform was immaculate, and her thick hair had been pinned up in a French twist. A few feet away rested a cart loaded with outdated magazines and beat-up paperbacks. Her lips parted in surprise. “What’re you doing here?”\u003c/p\u003e\n\u003cp\u003eEmma swallowed hard. She hadn’t planned on being seen by anyone she knew. How could she have forgotten that Nisha volunteered here? Ahead of her she could see the balding nurse waiting impatiently for her outside Becky’s room. She leaned toward Nisha’s ear.\u003c/p\u003e\n\u003cp\u003e“I’m … visiting a friend. But this has to be a secret. Please don’t tell anyone you saw me here. I’ll explain later.”\u003c/p\u003e\n\u003cp\u003eNisha nodded. She opened her mouth as if to say something else, then seemed to change her mind. Emma turned back toward the male nurse, acutely aware of Nisha’s eyes on her as she walked away.\u003c/p\u003e\n\u003cp\u003eBecky’s room hadn’t changed, except for the addition of a small vase full of irises and yellow roses on the side table. Emma wondered if Mr. Mercer had brought them. A fluorescent light flickered and buzzed overhead, and from the tiny attached bathroom came the erratic plink of a dripping faucet. A tray of mushy food sat untouched on the counter.\u003c/p\u003e\n\u003cp\u003eBecky sprawled across the bed, asleep. She was wearing flannel pajama pants and an oversized Arizona Wildcats T-shirt instead of the hospital gown, and her hair had been washed and combed, her fingernails scrubbed. But her complexion was still ashen and marked with deep shadows. Emma noticed that she wasn’t tied to the bed—that had to be a good sign, right?\u003c/p\u003e\n\u003cp\u003eI felt a low boil of emotion roiling off Becky’s mind. It was hard to sense what she was feeling—everything was all mixed up in her head. But through the confusion, one burning thought came through louder than anything else, repeated over and over like a chant. I’m so sorry. I’m so sorry for what I did.\u003c/p\u003e\n\u003cp\u003e“You have thirty minutes,” said the nurse. He nodded at Emma and retreated down the hall.\u003c/p\u003e\n\u003cp\u003eEmma pulled out Sutton’s iPhone, opened the voice recorder app, and pressed RECORD, then gently nudged the door shut with her foot. Becky’s eyes fluttered open when she heard the snick of the latch falling in place, her gaze darting around like a wild animal’s. She tried to sit up, but she seemed weak and uncoordinated. Then she saw Emma. Her eyes bulged.\u003c/p\u003e\n\u003cp\u003e“It’s you,” she croaked. “Emma.”\u003c/p\u003e\n\u003cp\u003e“No,” Emma said softly. “No, my name is Sutton.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Becky’s eyes went glassy as she laid her head back against the pillows.\u003c/p\u003e\n\u003cp\u003eEmma took a step toward the bed. A chemical, medicinal odor came off her mother’s body. She bit her lip. “How long have you been in town?” she asked, keeping her voice low and controlled.\u003c/p\u003e\n\u003cp\u003e“A while,” Becky slurred.\u003c/p\u003e\n\u003cp\u003e“What have you been doing here?”\u003c/p\u003e\n\u003cp\u003eA slow, strange smile crept across Becky’s face. “Watching you, of course.”\u003c/p\u003e\n\u003cp\u003eI shivered, looking down into that ravaged, slack face. Watching her because she knew she was Emma? Watching her to make sure she played me? Watching her and putting threatening messages under Laurel’s windshield, choking her in the Chamberlains’ kitchen?\u003c/p\u003e\n\u003cp\u003eEmma clutched the rail. “When was the last time we talked?” she asked. “When did we see each other last, I mean?”\u003c/p\u003e\n\u003cp\u003eBecky’s mouth twisted downward. “When you were five years old, Emma.”\u003c/p\u003e\n\u003cp\u003eThe fluorescent light flickered again, its electrical hum deafening in the silence. Emma leaned over the bed. “My name is Sutton,” she insisted softly.\u003c/p\u003e\n\u003cp\u003eBut Becky’s head rolled from side to side on the pile of pillows, her eyes far away. “You used to love doing my scavenger hunts when you were little. Did you like the one I left you at the hotel, Emma?”\u003c/p\u003e\n\u003cp\u003e“I’m Sutton,” Emma said again, but Becky ignored her.\u003c/p\u003e\n\u003cp\u003e“Remember the princess dress I bought you at Goodwill? You used to dance around the motel room.” Becky raised her hands as if she were directing music only she could hear. “You’d twirl around and around and around … so pretty.”\u003c/p\u003e\n\u003cp\u003eEmma focused on breathing slowly, carefully. If she didn’t, she might scream, or burst into tears.\u003c/p\u003e\n\u003cp\u003e“You were a good little girl, Emmy, but a bad little girl, too. You were too much to handle.” A single tear rolled down Becky’s sunken cheek.\u003c/p\u003e\n\u003cp\u003eEmma gritted her teeth. “I’m Sutton,” she said. “My name is Sutton. So one more time. When was the last time you saw me?”\u003c/p\u003e\n\u003cp\u003eBecky edged up on the pillow. “At the canyon,” she said, her voice suddenly steady, the words no longer slurred. “That night at the canyon.”\u003c/p\u003e\n\u003cp\u003eHer hand grabbed Emma’s forearm, her nails cutting into Emma’s skin. A scream tore from Emma’s throat as she tried to pull away. Becky’s fingers clenched, her face staring and blank. Bubbles of foam gathered at the corners of her lips and trickled down her chin.\u003c/p\u003e\n\u003cp\u003e“Help!” Emma screamed. She fumbled to pry Becky’s fingers away, but it was like a bad dream—Becky’s grip just got tighter and tighter. The door flew open and nurses quickly flocked into the room. The man who’d escorted Emma earlier helped release her wrist. “She’s convulsing,” he shouted at the others as he pushed Emma back toward the doorway. Emma saw one woman deftly preparing a syringe, flicking it with her forefinger.\u003c/p\u003e\n\u003cp\u003eThe place where Becky had squeezed Emma’s arm throbbed, and I could feel it, too. Then, without my willing it to happen, the heat of my birth mother’s touch blossomed into a memory. A memory of that night in the canyon, when I’d met Becky for the first—and last—time …\u003c/p\u003e\n\u003cp\u003e19\u003c/p\u003e\n\u003cp\u003eMOMMIE DEAREST\u003c/p\u003e\n\u003cp\u003eThe woman’s smile broadens as she reaches out her hand to help me to my feet. “Hello, Sutton. I’m your mother. Becky,” she singsongs again. “It’s so nice to meet you.”\u003c/p\u003e\n\u003cp\u003eI stare at her outstretched palm. Something tells me not to take it. I try to get up on my own, but I stumble again, my shirt snagging on a branch behind me. I immediately curse my decision to come back here to this pitch-black, end-of-the-earth place. Why didn’t I go to Nisha’s, or call a cab to take me home?\u003c/p\u003e\n\u003cp\u003eI sneak a peek at the woman who claims to be my mother and take in her tangled hair, her glowing eyes, her jittery mouth. My stomach tightens the way it does when Thayer and I watch horror movies. The air crackles with tension.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” Becky croons softly, kneeling down to me. Sticks and leaves cling to her torn clothes, as if she’s been wandering in the desert for days. Then I see a shallow gash across her forehead and a smear of blood on her cheek.\u003c/p\u003e\n\u003cp\u003e“What happened to you?” I ask, pointing. My voice is pitched too high, like a scared little girl’s.\u003c/p\u003e\n\u003cp\u003eBecky’s hand flies to her wound. “Oh. Just an accident.” She giggles cagily. “A little stumble.” But it doesn’t look like a cut from a stumble to me. It looks like the type of gash a steering wheel might make if one’s head were to bash into it after ramming into a seventeen-year-old boy. \u003c/p\u003e","sourceLink":"https://allnovel.net/cross-my-heart-hope-to-die-the-lying-game-5/page-18.html","bookId":2397,"creation":"Oct 5, 2019 10:28:27 AM","modification":"Oct 5, 2019 10:28:27 AM"}
