{"id":74442,"no":17,"title":"Page 17","content":"\u003cp\u003eThe songs vary from jazz standards to boy band covers, but all the performers have one thing in common: they sort of suck. I mean, certainly, not everyone sucks in the same way, and not everyone sucks equally, but everyone sucks at least a little. I’m stunned when my lunch companion Ethan, Number 19, proves to be the best singer so far, singing a song from some musical called Spring Awakening. The dude can belt.\u003c/p\u003e\n\u003cp\u003e“He could play you,” Jane says. “If he grew his hair out and developed a bad attitude.”\u003c/p\u003e\n\u003cp\u003e“I don’t have a bad attitude—”\u003c/p\u003e\n\u003cp\u003e“—is the kind of thing that people with bad attitudes say.” Jane smiles.\u003c/p\u003e\n\u003cp\u003eI see a couple potential Janes over the next hour. Number 24 sings a weirdly good sticky-sweet version of a song from Guys and Dolls. The other girl, Number 43, has straight bleached hair streaked with blue and sings “Mary Had a Little Lamb.” Something about the distance between children’s songs and blue hair seems pretty Janeish to me.\u003c/p\u003e\n\u003cp\u003e“I vote for her,” Jane says as soon as the girl gets to the second Mary.\u003c/p\u003e\n\u003cp\u003eThe last auditionee is a diminutive, large-eyed creature named Hazel who sings a song from Rent. After she’s finished, Tiny runs up onto the stage to thank everyone, and to say how brilliant they all were, and how impossibly hard this will be, and how callbacks will be posted the day after tomorrow. Everyone files out past us, and then finally Tiny slouches up the aisle.\u003c/p\u003e\n\u003cp\u003e“You’ve got your work cut out for you,” I tell him.\u003c/p\u003e\n\u003cp\u003eHe makes a dramatic gesture of futility. “We did not see a lot of future Broadway stars,” he acknowledges.\u003c/p\u003e\n\u003cp\u003eGary comes up and says, “I liked numbers six, nineteen, thirty-one, and forty-two. The others, well,” and then Gary puts his hand to his chest and begins to sing, “Somewhere over the rainbow, way up high / The sound of singing Wildkits, makes me want to die.”\u003c/p\u003e\n\u003cp\u003e“Jesus,” I say. “You’re like a real singer. You sound like Pavarotti.”\u003c/p\u003e\n\u003cp\u003e“Well, except he’s a baritone,” Jane says, her music pretension apparently extending even to the world of opera.\u003c/p\u003e\n\u003cp\u003eTiny snaps the fingers of one hand excitedly while pointing at Gary. “You! You! You! For the part of Kaleb. Congratulations.”\u003c/p\u003e\n\u003cp\u003e“You want me to play a fictionalized version of my own ex-boyfriend?” Gary asks. “I think not.”\u003c/p\u003e\n\u003cp\u003e“Then Phil Wrayson! I don’t care. Pick your part. My God, you sing better than all of them.”\u003c/p\u003e\n\u003cp\u003e“Yes!” I say. “I cast you.”\u003c/p\u003e\n\u003cp\u003e“But I’d have to kiss a girl,” he says. “Ew.” I don’t remember my character kissing any girls, and I start to ask Tiny about it, but he cuts me off, saying, “I’ve been in rewrites.” Tiny flatters Gary some more and then he agrees to play the part of me, and honestly, I’ll take it. As we walk up the aisle on the way out of the cafeteria, Gary turns to me, cocking his head and squinting. “What’s it like to be Will Grayson? I need to know what it’s like from the inside.” He’s laughing, but then he also seems to be waiting for an answer. I always thought that being Will Grayson meant being me, but apparently not. The other Will Grayson is also Will Grayson, and now Gary will be, too.\u003c/p\u003e\n\u003cp\u003e“I just try to shut up and not care,” I say.\u003c/p\u003e\n\u003cp\u003e“Such stirring words.” Gary smiles. “I will base your character upon the attributes of the boulders on the lake-shore: silent, apathetic, and—considering how little they exercise—surprisingly chiseled.” Everybody laughs, except Tiny, who’s texting. As we exit the hallway, I see Ethan standing against the Wildkit trophy stand, his backpack on. I walk up to him and say, “Not bad today,” and he smiles and says, “I just hope I’m not too hot to play you.” He smiles. I smile back, even though he seems a little serious. “See you on Friday at Clint’s?” he asks.\u003c/p\u003e\n\u003cp\u003e“Yeah, maybe,” I say. He adjusts the backpack over one shoulder and takes off with a nod. Behind me, I hear Tiny dramatically plead, “Someone tell me it will be okay!”\u003c/p\u003e\n\u003cp\u003e“It’ll be okay,” Jane says. “Mediocre actors rise to great material.”\u003c/p\u003e\n\u003cp\u003eTiny takes a deep breath, shakes some thought out of his mind, and says, “You’re right. Together they will be greater than the sum of their parts. Fifty-five people tried out for my play! My hair looks amazing today! I got a B on an English paper!” His phone chirps. “And I just got a text from my new favorite Will Grayson. You’re totally right, Jane: everything’s coming up Tiny.”\u003c/p\u003e\n\u003cp\u003eChapter twelve\u003c/p\u003e\n\u003cp\u003eIt starts when i get home from chicago. i already have twenty-seven texts from tiny on my phone. and he has twenty-seven texts from me. that took up most of the train ride. the rest of the time, i figured out what i needed to do the moment i walked through the door. because if isaac’s nonexistence is going to weigh me down, i have to let go of some other things in order not to crash right into the ground. i no longer give a fuck. i mean, i didn’t think i gave a fuck before. but that was amateur not-giving-a-fuck. this is stop-at-nothing, don’t-give-a-fuck freedom.\u003c/p\u003e\n\u003cp\u003emom’s waiting for me in the kitchen, sipping some tea, flipping through one of those stupid rich-celebrities-show-off-their-houses magazines. she looks up when i come in.\u003c/p\u003e\n\u003cp\u003emom: how was chicago?\u003c/p\u003e\n\u003cp\u003eme: look, mom, i’m totally gay, and i’d appreciate it if you could get the whole freakout over with now, because, yeah, we have the rest of our lives to deal with it, but the sooner we get through the agony part, the better.\u003c/p\u003e\n\u003cp\u003emom: the agony part?\u003c/p\u003e\n\u003cp\u003eme: you know, you praying for my soul and cursing me for not giving you grandbabies with a wifey and saying how incredibly disappointed you are.\u003c/p\u003e\n\u003cp\u003emom: you really think i’d do that?\u003c/p\u003e\n\u003cp\u003eme: it’s your right, i guess. but if you want to skip that step, it’s fine with me.\u003c/p\u003e\n\u003cp\u003emom: i think i want to skip that step.\u003c/p\u003e\n\u003cp\u003eme: really?\u003c/p\u003e\n\u003cp\u003emom: really.\u003c/p\u003e\n\u003cp\u003eme: wow. i mean, that’s cool.\u003c/p\u003e\n\u003cp\u003emom: can i at least have a moment or two for surprise?\u003c/p\u003e\n\u003cp\u003eme: sure. i mean, it can’t be the answer you were expecting when you asked me how chicago was.\u003c/p\u003e\n\u003cp\u003emom: i think it’s safe to say that wasn’t the answer i was expecting.\u003c/p\u003e\n\u003cp\u003eI’m looking at her face to see if she’s holding things back, but it seems like it is what it is. which is pretty spectacular, all things considered.\u003c/p\u003e\n\u003cp\u003eme: are you going to tell me you knew all along?\u003c/p\u003e\n\u003cp\u003emom: no. but i was wondering who isaac was.\u003c/p\u003e\n\u003cp\u003eoh, shit.\u003c/p\u003e\n\u003cp\u003eme: isaac? were you spying on me, too?\u003c/p\u003e\n\u003cp\u003emom: no. it’s just—\u003c/p\u003e\n\u003cp\u003eme: what?\u003c/p\u003e\n\u003cp\u003emom: you would say his name in your sleep. i wasn’t spying. but i could hear it.\u003c/p\u003e\n\u003cp\u003eme: wow.\u003c/p\u003e\n\u003cp\u003emom: don’t be mad.\u003c/p\u003e\n\u003cp\u003eme: how could i be mad?\u003c/p\u003e\n\u003cp\u003eI know that’s a silly question. i’ve proven that i can be mad about pretty much anything. there was this one time i woke up in the middle of the night and swore that my mother had installed a smoke alarm on the ceiling while i was asleep. so i burst into her room and started yelling about how could she just go and put something in my room without telling me, and she woke up and calmly told me the smoke alarm was in the hallway, and i actually dragged her out of bed to show her, and of course there wasn’t anything on the ceiling - i’d just dreamed it. and she didn’t yell at me or anything like that. she just told me to go back to sleep. and the next day was total crap for her, but not once did she say it was tied to me waking her up in the middle of the night.\u003c/p\u003e\n\u003cp\u003emom: did you see isaac when you were in chicago?\u003c/p\u003e\n\u003cp\u003ehow can i explain this to her? i mean, if i tell her i just traveled into the city to go to a porn store to meet some guy who didn’t end up existing, the next few weeks’ poker night earnings are going to be spent on a visit to dr. keebler. but she can tell when i’m lying if she’s looking for it. i don’t want to lie right now. so i bend the truth.\u003c/p\u003e\n\u003cp\u003eme: yeah, i saw him. his nickname’s tiny. that’s what i call him, even if he’s huge. he’s actually, you know, really nice.\u003c/p\u003e\n\u003cp\u003ewe are in completely uncharted mother-son territory here. not just in this house - maybe in all of america.\u003c/p\u003e\n\u003cp\u003eme: don’t get all worried. we just went to millennium park and talked a while. some of his friends were there, too. i’m not going to get pregnant.\u003c/p\u003e\n\u003cp\u003emom actually laughs.\u003c/p\u003e\n\u003cp\u003emom: well, that’s a relief.\u003c/p\u003e\n\u003cp\u003eshe gets up from the kitchen table and, before i know it, she’s giving me a hug. and it’s like for a moment i don’t know what to do with my hands, and then i’m like, you dumbfuck, hug her back. so i do, and i expect her to start crying, because one of us should be crying. but she’s dry-eyed when she pulls away - a little misty, maybe, but i’ve seen her when things aren’t all right, when things have totally gone to shit, and so i know enough to recognize that this isn’t one of those times. we’re okay.\u003c/p\u003e\n\u003cp\u003emom: maura called a few times. she sounded upset.\u003c/p\u003e\n\u003cp\u003eme: well, she can go to hell.\u003c/p\u003e\n\u003cp\u003emom: will!\u003c/p\u003e\n\u003cp\u003eme: sorry. i didn’t mean to say that out loud.\u003c/p\u003e\n\u003cp\u003emom: what happened?\u003c/p\u003e\n\u003cp\u003eme: i don’t want to get into it. i’m just going to tell you that she really, really hurt me, and i need for that to be enough. if she calls here, i want you to tell her that i never want to speak to her again. don’t tell her i’m not here. don’t lie when i’m in the other room. tell her the truth - that it’s over and it’s never going to be un-over. please.\u003c/p\u003e\n\u003cp\u003ewhether it’s because she agrees or whether it’s because she knows there’s no point in disagreeing when i’m like this, mom nods. i have a very smart mom, all things considered. it’s time for her to leave the room - i thought that’s what was going to happen after the hug - but since she’s still hovering, i make the move.\u003c/p\u003e\n\u003cp\u003eme: i’m going to head off to bed. i’ll see you in the morning.\u003c/p\u003e\n\u003cp\u003emom: will . . .\u003c/p\u003e\n\u003cp\u003eme: really, it’s been a long day. thank you for being so, you know, understanding. i owe you one. a big one.\u003c/p\u003e\n\u003cp\u003emom: it’s not about owing - me: i know. but you know what i mean.\u003c/p\u003e\n\u003cp\u003eI don’t want to leave until it’s clear it’s okay for me to leave. i mean, that’s the least i can do.\u003c/p\u003e\n\u003cp\u003eshe leans in and kisses me on the forehead.\u003c/p\u003e\n\u003cp\u003emom: good night.\u003c/p\u003e\n\u003cp\u003eme: good night.\u003c/p\u003e\n\u003cp\u003ethen i go back to my room, turn on my computer, and create a new screenname.\u003c/p\u003e\n\u003cp\u003ewillupleasebequiet: tiny?\u003c/p\u003e\n\u003cp\u003ebluejeanbaby: here!\u003c/p\u003e\n\u003cp\u003ewillupleasebequiet: are you ready?\u003c/p\u003e\n\u003cp\u003ebluejeanbaby: for what?\u003c/p\u003e\n\u003cp\u003ewillupleasebequiet: the future\u003c/p\u003e\n\u003cp\u003ewillupleasebequiet: because i think it just started\u003c/p\u003e\n\u003cp\u003etiny sends me a file of one of the songs from tiny dancer. he says he hopes it will give me inspiration. i put it on my ipod and listen to it as i’m heading to school the next morning.\u003c/p\u003e\n\u003cp\u003eThere was a time\u003c/p\u003e\n\u003cp\u003eWhen I thought I liked vagina\u003c/p\u003e\n\u003cp\u003eBut then came a summer\u003c/p\u003e\n\u003cp\u003eWhen i realized something finer\u003c/p\u003e\n\u003cp\u003eI knew from the moment he took top bunk\u003c/p\u003e\n\u003cp\u003eHow desperately i wanted into his trunk\u003c/p\u003e\n\u003cp\u003eJoseph Templeton Oglethorpe the Third\u003c/p\u003e\n\u003cp\u003eLeft my heart singing like a little bird\u003c/p\u003e\n\u003cp\u003eSummer of gay!\u003c/p\u003e\n\u003cp\u003eSo lovely! So queer!\u003c/p\u003e\n\u003cp\u003eSummer of gay!\u003c/p\u003e\n\u003cp\u003eSet the tone for my year!\u003c/p\u003e\n\u003cp\u003eMama and Papa didn’t know they were lighting the lamp\u003c/p\u003e\n\u003cp\u003eThe moment they sent me to Starstruck Drama Camp\u003c/p\u003e\n\u003cp\u003eSo many Hamlets to choose from\u003c/p\u003e\n\u003cp\u003eSome tortured, some cute\u003c/p\u003e\n\u003cp\u003eI was all ready to swordfight\u003c/p\u003e\n\u003cp\u003eOr take the Ophelia route\u003c/p\u003e\n\u003cp\u003eThere were boys who called me sister\u003c/p\u003e\n\u003cp\u003eAnd sistahs who taught me about boys\u003c/p\u003e\n\u003cp\u003eJoseph whispered me sweet nothings\u003c/p\u003e\n\u003cp\u003eAnd i fed him Almond Joys\u003c/p\u003e\n\u003cp\u003eSummer of gay!\u003c/p\u003e\n\u003cp\u003eSo fruity! So whole!\u003c/p\u003e\n\u003cp\u003eSummer of gay!\u003c/p\u003e\n\u003cp\u003eI realized Angel would be my role!\u003c/p\u003e\n\u003cp\u003eMama and Papa didn’t know how well their money was spent\u003c/p\u003e\n\u003cp\u003eWhen I learned about love from our production of Rent\u003c/p\u003e\n\u003cp\u003eSuch kissing on the catwalks\u003c/p\u003e\n\u003cp\u003eSuch competition for the leads\u003c/p\u003e\n\u003cp\u003eWe fell in love so often and fully\u003c/p\u003e\n\u003cp\u003eAcross all races and sexualities and creeds . . .\u003c/p\u003e\n\u003cp\u003eSummer of gay!\u003c/p\u003e\n\u003cp\u003eEnded soon! Lasted long!\u003c/p\u003e\n\u003cp\u003eSummer of gay!\u003c/p\u003e\n\u003cp\u003eMy heart still carries its song!\u003c/p\u003e\n\u003cp\u003eJoseph and I didn’t make it to September\u003c/p\u003e\n\u003cp\u003eBut you can’t unlight a gay-colored ember\u003c/p\u003e\n\u003cp\u003eI will never go back\u003c/p\u003e\n\u003cp\u003eTo the heterosexual way\u003c/p\u003e\n\u003cp\u003e’Cause now every day\u003c/p\u003e\n\u003cp\u003e(Yes, every day)\u003c/p\u003e\n\u003cp\u003eIs the sum-mer\u003c/p\u003e\n\u003cp\u003eof gay!\u003c/p\u003e\n\u003cp\u003esince i’ve never really listened to musicals, i don’t know if they all sound this gay, or if it’s just tiny’s. i suspect that i would find all of them this gay. i’m not entirely sure how this is supposed to inspire me to do anything except join drama club, which right now is about as likely as me asking maura on a date. still, tiny told me i was the first person to hear the song besides his mom, so that counts for something. even if it’s lame, it’s a sweet kind of lame.\u003c/p\u003e\n\u003cp\u003eIt even manages to take my mind off of school and maura for a few minutes. but once i get there, she’s right in front of me, and the mountain reminds me it’s a volcano, and i can’t help but want to spray lava everywhere. i walk right past the place we usually meet up, but that doesn’t stop her. she launches right behind me, saying all the things that would be in a hallmark card if hallmark made cards for people who invented internet boyfriends for other people and then were suddenly caught in the lie.\u003c/p\u003e\n\u003cp\u003emaura: i’m sorry, will. i didn’t mean to hurt you or anything. i was just playing around. i didn’t realize how serious you were taking it. and i’m a total bitch for that, i know. but i was only doing it because it was the only way to get through to you. don’t ignore me, will. talk to me!\u003c/p\u003e\n\u003cp\u003eI am just going to pretend that she doesn’t exist. because all the other options would get me expelled and/or arrested.\u003c/p\u003e\n\u003cp\u003emaura: please, will. i’m really, really sorry.\u003c/p\u003e\n\u003cp\u003eshe’s crying now, and i don’t care. the tears are for her own benefit, not mine. let her feel the pain her poetry desires. it has nothing to do with me. not anymore.\u003c/p\u003e\n\u003cp\u003eshe tries to pass me notes during class. i knock them off my desk and leave them on the ground. she sends me texts, and i delete them unread. she tries to come up to me at the beginning of lunch, and i build a wall of silence that no goth sorrow can climb. \u003c/p\u003e","sourceLink":"https://allnovel.net/will-grayson-will-grayson/page-17.html","bookId":2712,"creation":"Oct 5, 2019 10:31:26 AM","modification":"Oct 5, 2019 10:31:26 AM"}
