{"id":110968,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“A worthy cause.” Her finger stroked his knuckle, but her mind was miles away. She frowned. “You should come and meet my uncle. He may be interested in what you speak of.”\u003c/p\u003e\n\u003cp\u003e“Your uncle?”\u003c/p\u003e\n\u003cp\u003e“Magnus.”\u003c/p\u003e\n\u003cp\u003eWill considered it. Then nodded. He gestured to the plate. “Let me just take this to my companion, Lena.”\u003c/p\u003e\n\u003cp\u003eTwelve\u003c/p\u003e\n\u003cp\u003eIt had taken him all of ten minutes to ingratiate himself with the Norwegians.\u003c/p\u003e\n\u003cp\u003eLena bit into a lemon tart, smiling at the young lord in front of her as she surreptitiously glanced over his shoulder. Will clasped hands with the grizzled Fenrir and greeted his son, Eric.\u003c/p\u003e\n\u003cp\u003eMovement shifted. A hand, sliding over the small of his back. Lena nearly choked on her tart. Her eyes narrowed. That Norwegian witch. She’d known him barely a quarter of an hour and she was already trying to stake a claim.\u003c/p\u003e\n\u003cp\u003eStammering a vague reply to something Lord Folsom asked her, she maneuvered herself for a better look. The blond goddess smiled up at him, her hand possessively stroking the smooth tailoring of his coat. Will looked down at her with an amused expression crinkling his eyes.\u003c/p\u003e\n\u003cp\u003eAnd Lena’s heart twisted in her chest.\u003c/p\u003e\n\u003cp\u003e“Are you all right, my dear?” Lord Folsom asked. He was only human, his family not deemed important enough to receive the gift of the blood rites.\u003c/p\u003e\n\u003cp\u003e“Quite fine,” she managed to say, passing him her plate. “Just a slight hint of nausea. I believe I might need to escape the crush.”\u003c/p\u003e\n\u003cp\u003eShe should have been working against Will instead, but she found she didn’t have the heart for it. She needed to clear her head. Gather herself. Before she did something foolish like ask Eric to dance the assah with her.\u003c/p\u003e\n\u003cp\u003eShe knew precisely how Will would take that.\u003c/p\u003e\n\u003cp\u003ePushing through the crowd, she found herself at the edge of the ballroom. The room was located on the second highest floor of the Ivory Tower, with breathtaking views over the entirety of London. A colonnade circled the outside, a chance for a young lady to stroll within watchful distance of the ballroom.\u003c/p\u003e\n\u003cp\u003eShe pushed through the French doors, the wind whipping her hair out of her face as she leaned against the rail. Hundreds of feet below, the grass beckoned. More than one blue blood had been thrown to his death here. But never when a ball was in progress. Such things weren’t done.\u003c/p\u003e\n\u003cp\u003eTugging her gloves off, she risked another glance back into the ballroom. With the ballroom lit up so well, everything within was fully visible whilst she would remain hidden in the shadows. She found Will easily enough. His nerves appeared to have settled, for he shared a rare smile with the Norwegian clans as they wooed him.\u003c/p\u003e\n\u003cp\u003eHis own people.\u003c/p\u003e\n\u003cp\u003eDress him in furs and let him stop shaving for a day or so and he might have been mistaken for one of them.\u003c/p\u003e\n\u003cp\u003eTurning around, she balled her gloves in her fist and leaned on the rail. Foolishness. You knew he was never for you. Yet the last week had lulled her into a sense of false hope. A smile here, the brush of his body against hers, their teasing…\u003c/p\u003e\n\u003cp\u003eIf he knew what she was about, he’d never speak to her again.\u003c/p\u003e\n\u003cp\u003eLost in her own misery, she barely heard the door open. The wind chilled her skin, but the hairs that rose on the back of her neck had nothing to do with the breeze.\u003c/p\u003e\n\u003cp\u003eSpinning around, she froze against the rail. Colchester smiled at her, easing the door shut with a soft click. Behind him dancers swept past, their images distorted by the windows. So close and yet so far away.\u003c/p\u003e\n\u003cp\u003eLena took a step to the side and Colchester echoed her. A chill ran down her spine.\u003c/p\u003e\n\u003cp\u003eTipping her chin up, she tugged her gloves back on. If anyone caught them, there was no need to promote rumors that she’d encouraged him. A bare wrist was tantamount to exposing her breast.\u003c/p\u003e\n\u003cp\u003eColchester watched the silk slither over her arms. “That’s not going to help, you realize?”\u003c/p\u003e\n\u003cp\u003e“I’m only observing the proprieties.”\u003c/p\u003e\n\u003cp\u003eHe strolled closer, using his body to trap her against the rail. Reaching out with both hands, he caged each side of her waist.\u003c/p\u003e\n\u003cp\u003eShe risked a look toward the ballroom. A man’s broad back blocked the doors she’d come through. Cavendish, by the look of it. Preventing anyone from exiting. “I told you I haven’t decided,” she said, her breath catching as he leaned closer.\u003c/p\u003e\n\u003cp\u003eHis gaze ran smokily down her throat. “Perhaps the offer’s been rescinded anyway. Why would I want soiled goods?”\u003c/p\u003e\n\u003cp\u003eFingertips brushed against the curve of her clavicle. She pressed against the rail, but there was nowhere to go. Only empty air and wind behind her. “Soiled goods?”\u003c/p\u003e\n\u003cp\u003e“Another blue blood I could have forgiven you for. But not one of those filthy beasts.” His hand closed over her throat lightly.\u003c/p\u003e\n\u003cp\u003eLena couldn’t breathe. She looked in those insane eyes and knew he’d do it. “Don’t. Not here. People are watching.”\u003c/p\u003e\n\u003cp\u003eHis fingers tightened. “Do you think I give a damn?” A bark of laughter. “I’m a duke, Helena. And you…you are nothing.”\u003c/p\u003e\n\u003cp\u003eShe grabbed his wrist, trying to ease his choking hold. Her head was swimming. “P-please…”\u003c/p\u003e\n\u003cp\u003eHis grip eased. “I’m sorry? Are you begging for your pathetic little life? You’re not doing a very good job, my dear.”\u003c/p\u003e\n\u003cp\u003eThink, damn it.\u003c/p\u003e\n\u003cp\u003e“You’re mistaken. Whatever you think has been happening, you’re wrong. Leo asked me to teach Will to move through the Echelon. This is…strictly business, nothing else.”\u003c/p\u003e\n\u003cp\u003eA considering look entered his eyes. He stroked her throat. “Business? After that dance? The beast seems awfully possessive of you, my dear.”\u003c/p\u003e\n\u003cp\u003eShe forced a smile. “A crude habit I’m trying to break him of. Really…” She gave a brittle laugh. “Accusing me of such a thing. You know I prefer the finer things in life. Something…sophisticated.”\u003c/p\u003e\n\u003cp\u003e“Mmm.” His eyes narrowed. “I’m not entirely certain you’ve convinced me.”\u003c/p\u003e\n\u003cp\u003eWith a sharp move, he grabbed her and spun her toward the rail, pressing her hard against it. Her slippers teetered against the ground, and she clutched at the rail with a scream. The cobbles below seemed miles away.\u003c/p\u003e\n\u003cp\u003e“Twenty-four people have gone over this rail,” he whispered in her ear. “With you sipping champagne all night, it would be terribly easy to convince everyone you’d slipped.”\u003c/p\u003e\n\u003cp\u003eGrabbing her by the bustle, he shoved her inexorably forward. He’d let go of the back of her head for the moment and with an instinct she didn’t know she possessed, she slammed her head back.\u003c/p\u003e\n\u003cp\u003eA deafening crack sounded in her ear and Colchester screamed. The pressure at her back was gone and she tumbled against the rail. So close. Too close… Colchester cupped his face, blood pouring between his fingers. He caught a glimpse of her and murder gleamed in his eyes.\u003c/p\u003e\n\u003cp\u003eLena darted for the door. A slashing pain caught her across the upper arm and blood spattered across the glass. He’d drawn his blade, the little one he used for bloodletting. Avoiding his grasping hand, she yanked the door open and shoved into the room.\u003c/p\u003e\n\u003cp\u003eCavendish staggered out of her way, surprise widening his eyes. Heads turned and Lena pasted a smile on her lips, her teeth clenched together. The room swam in her panic, gems and faces and dresses leeching into one another. Clapping a hand to her arm, she pushed through the whispering crowd.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t dare attack her here. Not with a broken nose. No blue blood would live down the indignity of being outmaneuvered by a simple human girl.\u003c/p\u003e\n\u003cp\u003eThe heartbeat that threatened to choke her began to slow. All she had to do was find Leo or Will. Safe. She was safe now.\u003c/p\u003e\n\u003cp\u003eBut she didn’t feel it. Blood dripped between her gloved fingers as she made her way through the crowd of blue bloods. They eyed her with far too much interest for her comfort. The music grated harshly on her nerves.\u003c/p\u003e\n\u003cp\u003eA gap opened up and suddenly she was staring at Will. His gaze flickered over her, then narrowed on her bleeding arm. The room might as well have gone quiet. No change to his expression, nothing to indicate his mood, but suddenly she realized just how dangerous he was.\u003c/p\u003e\n\u003cp\u003eBright copper glowed in his eyes. The woman at his side asked him a question, gently stroking his sleeve. He pushed away from the table he’d been leaning against, ignoring her completely. Lena couldn’t make her feet move. All she could do was stare at him and silently will him not to make a scene.\u003c/p\u003e\n\u003cp\u003eBehind her she heard Cavendish’s voice, growing nearer as he looked for her. Will heard it too, his head shooting in that direction with a murderous gleam in his eyes.\u003c/p\u003e\n\u003cp\u003e“Don’t,” she whispered.\u003c/p\u003e\n\u003cp\u003eBut it was too late. He turned toward Cavendish, his fists tightening. Striding carelessly into the path of a pair of dancers, he stopped the entire waltz.\u003c/p\u003e\n\u003cp\u003eIf she didn’t do something he’d kill Cavendish. Then they’d have no choice but to execute him. Suddenly she could move again. Cutting him off halfway, she grabbed his sleeve.\u003c/p\u003e\n\u003cp\u003e“Stop,” she hissed. “Don’t you dare!”\u003c/p\u003e\n\u003cp\u003eNo man looked out at her through those burning coppery eyes. She’d been so certain he’d never, ever hurt her, yet for a moment even she froze at the fury that looked back at her. The wild within.\u003c/p\u003e\n\u003cp\u003e“Will.” There was only one way to stop him in this mood, only one thing that could distract him. “Will, I’m bleeding. I need to go home, to have my arm seen to. I don’t feel very well.” She made her knees soften, her weight leaning into him.\u003c/p\u003e\n\u003cp\u003eHe caught her, as she knew he would. Blade had once said that Will was the most dangerous man he’d ever met, but his protective instincts overrode his violent ones. A wolf to the core.\u003c/p\u003e\n\u003cp\u003eAs he swept her up in his arms, Lena buried her face against his shoulder. This was it. The end of any chance she had with the Echelon. She might be able to walk its verge, but she would never be a part of it again. Whispers followed them as Will strode from the room.\u003c/p\u003e\n\u003cp\u003eOne last glance over his shoulder as they passed through the doors. The gowns, the jewels, the fancy ladies in all their finery. Gone. Her chance at this was gone the instant she curled into his arms. And strangely enough a weight lifted from her shoulders.\u003c/p\u003e\n\u003cp\u003eLena turned her face into his neck, breathing in the masculine scent of his skin. She didn’t know what she would do. There was nothing for her in the rookery, nothing for her in the Echelon. Her fingers curled against his collar. Only one thing that she had always wanted and he had not wanted her back.\u003c/p\u003e\n\u003cp\u003eBut did you fight hard enough?\u003c/p\u003e\n\u003cp\u003eShe buried her face in his coat, too afraid to look at the answer to that question. She hadn’t fought, hadn’t told him how she felt. Too afraid to have her heart dashed to pieces, and so she’d never dared display it.\u003c/p\u003e\n\u003cp\u003eHe would never know how much her games with him were all she would risk.\u003c/p\u003e\n\u003cp\u003e“Where?” he asked.\u003c/p\u003e\n\u003cp\u003eShe glanced at the enormous circular staircase that spiraled through the heart of the Ivory Tower. A thousand steps, some said, though she’d never bothered to count them.\u003c/p\u003e\n\u003cp\u003e“The elevation chamber. I want some privacy.”\u003c/p\u003e\n\u003cp\u003eHe glanced at the pair of ladies who’d followed them from the ballroom and sent them fleeing with a glare. “Problem solved.”\u003c/p\u003e\n\u003cp\u003e“Don’t argue. You can’t carry me the entire way down those stairs. We’re on the ninth floor.”\u003c/p\u003e\n\u003cp\u003eHis face turned to hers, hints of amber burning around his pupil. “What happened?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. She had to get him out of here before he erupted again. “The elevation chamber.”\u003c/p\u003e\n\u003cp\u003eThe liveried footman nodded to them as if he saw ladies being carried out of the ballroom every night. The polished brass doors to the elevation chamber slowly opened, revealing the smooth brass panels of the walls.\u003c/p\u003e\n\u003cp\u003eWill carried her inside and the doors slid shut.\u003c/p\u003e\n\u003cp\u003eShe gestured for him to put her down. A frown drew his eyebrows together, but he complied.\u003c/p\u003e\n\u003cp\u003e“What the hell happened?” The chamber lurched into movement and he grabbed at the wall, his eyes wild.\u003c/p\u003e\n\u003cp\u003e“I went for some air on the balcony.” There was no getting around the truth. “Colchester came out after me.”\u003c/p\u003e\n\u003cp\u003eWill’s gaze dropped to her bloodied glove. His nostrils flared. “He cut you.”\u003c/p\u003e\n\u003cp\u003eThe words were a promised threat. She had to diffuse the situation. “I broke his nose. It’s an even trade.”\u003c/p\u003e\n\u003cp\u003e“Lena.”\u003c/p\u003e\n\u003cp\u003e“It’s barely even a scratch—”\u003c/p\u003e\n\u003cp\u003e“You were terrified,” he snapped. Turning, he swung a fist at the wall and the brass panel caved beneath his fist.\u003c/p\u003e\n\u003cp\u003eShe flinched. “Please. Don’t.”\u003c/p\u003e\n\u003cp\u003eReining himself in with a visible clenching of his will, he slid a hand down the wall. “I wouldn’t hurt you. You know that. I’d never hurt you.”\u003c/p\u003e\n\u003cp\u003eShe realized she was pressed back against the far wall, her nerves strung too tightly to relax with his temper riding the chamber like a cyclone.\u003c/p\u003e\n\u003cp\u003e“Yes, I was scared,” she said. “But I’m safe now. That’s all that matters.”\u003c/p\u003e\n\u003cp\u003e“What did he do to you? What did he say?” \u003c/p\u003e","sourceLink":"https://allnovel.net/heart-of-iron-london-steampunk-2/page-21.html","bookId":1583,"creation":"Oct 6, 2019 12:15:32 AM","modification":"Oct 6, 2019 12:15:32 AM"}
