{"id":110952,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eResting his backside against the table, he bit into his meal and stared at his shirt. There was something sticking out of it. A piece of paper. The note the fat man had carried.\u003c/p\u003e\n\u003cp\u003eHe padded across the room and knelt, chewing slowly. The paper was thick with wax. Whoever had written it had wanted it to stay dry, which meant he thought the recipient of it would get wet at some stage. Will frowned. Just where had those two been heading—in the sewers? The water this time of year was barely knee high.\u003c/p\u003e\n\u003cp\u003eThere were whispers that it was deeper down below, though. In some parts of Undertown.\u003c/p\u003e\n\u003cp\u003eFishing it open, he tilted it toward the single lamp. Lines of symbols crisscrossed the parchment—letters, numbers, and odd slashing marks. An incomprehensible mess.\u003c/p\u003e\n\u003cp\u003eWhat the hell had he stumbled upon? Will took another bite of his bread and cheese and stood, crossing closer to the lamp. The better light made no sense of the symbols, not that he’d expected them to.\u003c/p\u003e\n\u003cp\u003eWill flipped the paper over, but there was nothing on the back. No scent but the odd waxy substance. He frowned. Burning down the draining factories, coded letters, strange devices that had obviously been made to incapacitate blue bloods… Somebody was looking to start a war.\u003c/p\u003e\n\u003cp\u003eTwo\u003c/p\u003e\n\u003cp\u003e“How spectacularly…gaudy.”\u003c/p\u003e\n\u003cp\u003eLena glanced away from the curtained platform, her attention drawn by the dripping malice in her friend’s tone. “Whatever do you mean, Adele?”\u003c/p\u003e\n\u003cp\u003eAdele Hamilton—a former diamond of society—leaned closer and turned her lip up. “They’ve got puppets. I’m surprised Miss Bishop hasn’t invited an entire menagerie to perform for us this evening. Or a circus troupe.”\u003c/p\u003e\n\u003cp\u003e“You’re just jealous because she signed a thrall contract with Lord Macy and you thought he was going to offer for you.” Lena turned her head to the balcony where Miss Bishop was sipping champagne and glowing with happiness. Having signed a thrall contract with Lord Macy, Miss Bishop was now set for life. It was the highest ambition of any debutante. To be protected. Showered in diamonds and fancy golden steam carriages. Dripping in pearls.\u003c/p\u003e\n\u003cp\u003eAll it cost was a little something in return.\u003c/p\u003e\n\u003cp\u003eBlood.\u003c/p\u003e\n\u003cp\u003eLena shivered and looked down into her half-empty glass.\u003c/p\u003e\n\u003cp\u003e“As if I’d accept someone like Macy.” Adele sniffed and drained her glass. Yet her pretty almond-shaped eyes watched the pair on the balcony like a hawk.\u003c/p\u003e\n\u003cp\u003eMacy rested his hand on Miss Bishop’s gloved one and slowly stroked her fingers. Even from the gardens below, Lena could see her breathing quicken and Macy’s eyes darken with desire. He seemed so much older than Miss Bishop in that moment. So much more powerful. It made Lena feel sick to her stomach.\u003c/p\u003e\n\u003cp\u003eStop it, she told herself sharply. Don’t think about it. It was Miss Bishop’s choice. She wasn’t being forced into this.\u003c/p\u003e\n\u003cp\u003eExcept by circumstances.\u003c/p\u003e\n\u003cp\u003e“I can’t believe they’re carrying on so in public,” Adele continued. “He might as well throw her down now and have her.”\u003c/p\u003e\n\u003cp\u003eCaught in her own discomfort, Lena’s voice was sharper than she intended. “Sheathe your claws before you cut yourself.”\u003c/p\u003e\n\u003cp\u003eAdele shot her a devastating smile, one that had won half the hearts in the Echelon. And then broken them. “Miaow,” she purred.\u003c/p\u003e\n\u003cp\u003eDespite her unease, Lena couldn’t stop an answering smile from tugging at her lips. Adele was the kind of friend you certainly couldn’t trust, but after the debacle last year where she was caught in the gardens with Lord Fenwick—who later refused to contract her—Adele was also an outcast of sorts. She’d clawed her way back into society via an icy heart and an unwavering smile, but her time, like Lena’s, was running out. And unlike Lena, who was here for a purpose, Adele had no other options in life.\u003c/p\u003e\n\u003cp\u003eA crowd was gathering in front of the curtained stage. Service drones hovered, the silver platters fitted on their heads offering an array of beverages. Lena slipped another pair of champagne flutes from the tray, avoiding the drone’s steam vent. They were highly practical, rolling quietly through the crowds, but more than one young lady’s dress had been ruined and Lena was wearing crushed violet silk.\u003c/p\u003e\n\u003cp\u003eShe kept an ear open as she moved through the crowd, idly listening—and then discarding—conversations. Being a debutante was the perfect disguise. In a way, she was almost invisible. People said things in front of her that they would otherwise have kept quiet.\u003c/p\u003e\n\u003cp\u003eIt was a most convenient way to spy. She barely had to do anything at all.\u003c/p\u003e\n\u003cp\u003e“Puppets.” Adele shook her head. Yet, she too gathered in front of the stage, desperate not to miss a thing.\u003c/p\u003e\n\u003cp\u003eThe night was mild, stars glittering overhead. Lena looked up, her vision adjusting to the light. A thousand diamonds, her mother used to say when she was a little girl. “All for me,” Lena would cry, and her mother would laugh and kiss her good night.\u003c/p\u003e\n\u003cp\u003eNow the stars seemed to have lost some of their luster, and the diamonds too. The world around her was too bright, too shiny, all silk and gold and malicious laughter. The world of the Echelon had once been the only thing she’d ever wanted, and now that she danced along its verge, she couldn’t help wondering if there was something more out there for her.\u003c/p\u003e\n\u003cp\u003eNot that she would ever admit that.\u003c/p\u003e\n\u003cp\u003eShe’d begged her sister, Honoria, for this chance when it became clear that there was nothing left in Whitechapel for her. Pleaded for weeks to be allowed back to her former life, and the possibility of making a thrall contract.\u003c/p\u003e\n\u003cp\u003eStrangely enough, an ally had come from an unexpected source: Leo Barrons, her half brother. As heir to the Duke of Caine, Leo could never reveal the truth of their connection—and his own illegitimacy—but he’d offered to take her as his ward and Lena had gratefully accepted. When her father had been alive, she’d hovered on the edge of the Echelon. Now, with a man as powerful as Leo as her guardian, she was embraced completely.\u003c/p\u003e\n\u003cp\u003eAnd she’d never felt more alone.\u003c/p\u003e\n\u003cp\u003eAn uneasy feeling lifted the hairs on the back of her neck. The sharp, horrible sensation of being watched. Lena looked around but there was no one there. Something hissed and she flinched. It sounded like a kettle giving vent to its rage. The crowd pressed closer and conversation dimmed. On stage, the tinny sound of an organ grinder began to play.\u003c/p\u003e\n\u003cp\u003eIt struck a chord in her memory; the raucous sounds and laughter of Whitechapel, the press of unwashed bodies, and the bawdy language that she’d pretended not to memorize. Music on the streets, in the penny gaff houses. A sound best forgotten. She’d left Whitechapel behind a year ago. It felt longer. In that time, she’d lost all of her youthful pretensions and realized exactly what type of world she lived in—and the fact that there was very little she could do about it.\u003c/p\u003e\n\u003cp\u003eBut what she could do about it, she would. There was a movement brewing to restore humans to equal status as blue bloods—no more blood taxes, no more martial law, no more involuntary thralls—and she was in an ideal position to help them. Lena had access to a host of the Echelon’s secrets…if she kept her ears open.\u003c/p\u003e\n\u003cp\u003e“It seems Miss Bishop has a monkey after all,” Adele whispered.\u003c/p\u003e\n\u003cp\u003e“Shush,” Lena said, rising on her toes to see. As she did, she ran her gaze across the crowd, relaxing only when she realized there was no one watching her.\u003c/p\u003e\n\u003cp\u003eJust nerves… She was safe here, with the crowd and Adele at her side.\u003c/p\u003e\n\u003cp\u003eThe curtains parted with a melodramatic jerk. On the terrace, the gas lamps suddenly faded, the muted flames casting a surreal blue light across the gathering. Steam curled out, obscuring a figure on the center of the stage. Its arms jerked into the air, the strings clearly visible against the gaslight.\u003c/p\u003e\n\u003cp\u003e“Marionettes,” Adele dismissed.\u003c/p\u003e\n\u003cp\u003eThe Contract Ball of Miss Bishop had been talked about for the last month as the event of the Season. Gossip had promised delights and curios far beyond anything ever seen, but so far the night had been disappointing. Lena relaxed down onto her heels just as the crowd gave an appreciative gasp.\u003c/p\u003e\n\u003cp\u003e“Oh my,” Adele said. “Look, the strings have fallen!”\u003c/p\u003e\n\u003cp\u003eAnd so they had. The marionette gave a feeble jerk, its arms collapsing to its sides. And then slowly, with the mysterious steam curling around its feet, it began to straighten.\u003c/p\u003e\n\u003cp\u003e“It’s an automaton,” Lena said.\u003c/p\u003e\n\u003cp\u003eThe metal creature began to move, his hands coming up as though he held someone in his arms. Against the tinny organ-grinder music, he began to waltz.\u003c/p\u003e\n\u003cp\u003eLena’s mouth dropped open. She’d seen numerous service drones and dozens of the armored metaljackets that protected the streets and imposed the Echelon’s will, but she’d never seen anything like this. Why, the joints were streamlined, and the movement of the automaton was peculiarly fluid, almost human.\u003c/p\u003e\n\u003cp\u003eThe performance came to an end, the organ-grinder winding down slowly. The automaton’s pace slowed and it began to falter in time to the music. Whoever the handler was, he was a man of great skill.\u003c/p\u003e\n\u003cp\u003eLena clapped enthusiastically. She wanted a closer look. She was talented with her steel clockworks, but this was artistry on a level she could barely comprehend.\u003c/p\u003e\n\u003cp\u003eUnfortunately, most of the crowd wanted a closer look too. Lena found herself separated from Adele and eddied to the side, like a piece of flotsam in a raging current.\u003c/p\u003e\n\u003cp\u003eDashing a feather out of her vision, she looked for Adele.\u003c/p\u003e\n\u003cp\u003eAnd that was when she saw him.\u003c/p\u003e\n\u003cp\u003eThe warmth drained from her face. Alaric Colchester, the Duke of Lannister, watched her from across the crowd, a predatory smile on his thin lips as he sipped a flute of blud-wein. Her heart skipped a beat. Against the pale, powdered skin of his face, his red-stained lips flashed through her mind, reminiscent of a time long ago. But that time, the blood had not been watered with wine.\u003c/p\u003e\n\u003cp\u003eHe wasn’t supposed to be here. She made certain of that before she accepted any invitations these days. With a meeting called in the Ivory Tower between the Council of Dukes that ruled the city, she’d been sure she’d be safe.\u003c/p\u003e\n\u003cp\u003eIt must have finished early.\u003c/p\u003e\n\u003cp\u003eLena tore her gaze away, her heart thundering in her ears. Don’t run. If she’d learned anything over the years, it was that fear roused a blue blood to uncontrollable hungers.\u003c/p\u003e\n\u003cp\u003eA swift glance showed movement through the crowd. The pale, shining blond of his hair as he stalked her. Lena strained on her toes. Where had Adele gone? There was sometimes safety in numbers.\u003c/p\u003e\n\u003cp\u003eIf Colchester felt like playing by the rules.\u003c/p\u003e\n\u003cp\u003eHe was a duke, after all. Head of one of the seven great Houses that ruled the city. If he wanted to take her here, right now, then he could drag her off and no one would dare say a thing. Her guardian, Leo, the only man with the strength to counter Colchester, had been at the Ivory Tower meeting, standing in for his father, the Duke of Caine.\u003c/p\u003e\n\u003cp\u003eLena moved into the crowd, a smile pasted on her face. The patch of bare skin at the back of her neck tingled. Lifting her glass, she tried to catch a hint of his reflection, but the crowd was too dense.\u003c/p\u003e\n\u003cp\u003eDamn him. She shot a look over her shoulder.\u003c/p\u003e\n\u003cp\u003eToo many people, pressed together and laughing at the mechanized puppetry. No sign of Colchester.\u003c/p\u003e\n\u003cp\u003eMusic and laughter assaulted her ears. The crowd was a riot of bright colors as she whipped her head around, a fist clenched in her skirts. Don’t run. God, don’t run. But where the devil had he gone?\u003c/p\u003e\n\u003cp\u003eA large pink ostrich feather floated through her vision. Adele. Lena pushed toward her. A pair of ladies gossiped behind their fans and Lena staggered between them, straight into a firm chest. Gloved hands caught her shoulders, as if to steady her.\u003c/p\u003e\n\u003cp\u003e“So sorry,” she murmured, then froze as she saw the ink-black velvet coat, with its gold epaulets and a tassel draped from his right shoulder.\u003c/p\u003e\n\u003cp\u003e“You look pale, my dear.” Colchester smiled his shark’s smile and his hands tightened as she instinctively tried to draw back. “Like you need some air.”\u003c/p\u003e\n\u003cp\u003eHis grip urged her to the side, toward the garden. Lena dug her slippers in and shook her head, a desperate smile pasted on her face. She couldn’t let anyone see her distress. It would only start rumors she couldn’t afford. A lady’s reputation was all that kept her from being claimed by any blue blood as his blood whore for the night.\u003c/p\u003e\n\u003cp\u003eSomehow she forced a laugh. It was her only defense. “Au contraire, Your Grace.” A swift gesture at the gardens around them. “I have nothing but air, it seems.”\u003c/p\u003e\n\u003cp\u003eHis eyes glittered with dark enjoyment. The hairs along her spine rose, but somehow she managed an insouciant shrug. Colchester would scent the rising spike of fear, acrid on her skin. A delicate sauce, he’d once told her, to flavor the meal…\u003c/p\u003e\n\u003cp\u003e“Thank you for catching me, Your Grace. But I’m afraid I must find my friend, Adele. She was feeling poorly. I was supposed to fetch her some water.”\u003c/p\u003e\n\u003cp\u003e“A pity,” he soothed, his hand dropping to hers. He stroked her fingers through the silk of her gloves. “I was hoping you would save a dance for me. The assah, if you will.”\u003c/p\u003e\n\u003cp\u003eA dance designed to tempt, to best display a potential thrall’s assets to a blue blood. The smoky eroticism of it was something she’d never surrendered to in public, but to witness it… Oh, to witness it was something else. “I’m afraid I—” \u003c/p\u003e","sourceLink":"https://allnovel.net/heart-of-iron-london-steampunk-2/page-3.html","bookId":1583,"creation":"Oct 6, 2019 12:15:32 AM","modification":"Oct 6, 2019 12:15:32 AM"}
