{"id":110978,"no":31,"title":"Page 31","content":"\u003cp\u003e“Buck up, luv. You’re safe. For now.” Mendici unsnapped his hanger and tucked it away again. He hauled her to her feet, then peered closer. “Here, you don’t look so good.”\u003c/p\u003e\n\u003cp\u003e“I’m not feeling quite myself.”\u003c/p\u003e\n\u003cp\u003eHe clutched her chin, then felt her cheeks with the back of his hand. “Christ, you’re burnin’ up.”\u003c/p\u003e\n\u003cp\u003e“My head’s been pounding all afternoon,” she admitted. “I believe I’m coming down with a chill.”\u003c/p\u003e\n\u003cp\u003eThe flare stick lit his face with an eerie green, highlighting the dark gleam of his good eye and the steel eye patch. Thought flickered behind his eye. “Aye, well don’t come near me men. None of us need to be sick right now.”\u003c/p\u003e\n\u003cp\u003eThe young boy, Jeremy, came flying out of the darkness, his face alight with glee. He landed and staggered to a halt, then unsnapped his handle. “I’m done, boys!”\u003c/p\u003e\n\u003cp\u003eOne after the other they came sailing through the darkness until only two remained on the far ledge. Mendici dragged a pocket watch out and checked the time, pacing restlessly on the edge of the ledge. Lena leaned against the cavern wall, too exhausted to do anything. There was no point in trying to escape. They’d run her down in seconds, and the idea of getting lost in these tunnels terrified her. Who knew what else lurked in the darkness, like the Gatekeeper?\u003c/p\u003e\n\u003cp\u003eA massive roar echoed through the tunnels. Mendici spun on his heel and squinted up into the dark.\u003c/p\u003e\n\u003cp\u003e“What was that?” the young boy asked. “Mendici?”\u003c/p\u003e\n\u003cp\u003eMendici held up a hand to quiet him. Another roar shattered the stillness of the tunnels. The two men on the ledge above raced to hook their hangers onto the cable, glancing over their shoulders. In the tunnel, flares of orange light flickered and died.\u003c/p\u003e\n\u003cp\u003e“Rollins,” Mendici grunted. He cast her a dark look. “Looks like them friends of yours decided to come play in our world. Hope you weren’t too fond of ’em?”\u003c/p\u003e\n\u003cp\u003eLena drew herself to her feet, leaning hard against the wall. Will. The source of that enraged sound was suddenly apparent. “Don’t be so sure,” she said, staring up. Please be all right. Please don’t be hurt.\u003c/p\u003e\n\u003cp\u003eSilence fell. The two men on the ledge glanced over their shoulders, their movements slowing. A relieved smile flickered over one of their faces.\u003c/p\u003e\n\u003cp\u003eThen one of the men stiffened. He shouted something and jumped for the cable. His body arced out into the air erratically. Barely a second later, the second man made his leap, dropping his flare stick on the ledge behind him.\u003c/p\u003e\n\u003cp\u003eLena found herself holding her breath. Could Will truly take on the monstrous Percy and survive? The Greek fire that the Spitfires used could burn through anything, and she’d seen the barrel of the flamethrower attached to Percy’s mechanical arm.\u003c/p\u003e\n\u003cp\u003eA shadow detached itself from the mouth of the tunnel, becoming a man with familiar broad shoulders. Lena let out a shuddering breath. He was alive.\u003c/p\u003e\n\u003cp\u003eWill stepped up to the ledge, the phosphorescent gleam highlighting his singed shirt. The light cast a play of shadows over the stark bones of his face. There was something in his hand. He held it up; Percy’s square head.\u003c/p\u003e\n\u003cp\u003eMendici sucked in a breath. “Bring me the girl.”\u003c/p\u003e\n\u003cp\u003eSomeone shoved her toward him. He grabbed a handful of her hair and pushed her forward, her slippers teetering on the edge of the ledge. Lena froze, staring up into the darkness. Will had stepped forward too, fury and frustration playing over his features. Only fifty feet separated them, but it might as well be a mile.\u003c/p\u003e\n\u003cp\u003e“You want ’er?” Mendici roared. “Then come and get ’er.”\u003c/p\u003e\n\u003cp\u003eLena glanced up at the nasty little smile on his face. “No! Don’t, Will! I’ll be fine—”\u003c/p\u003e\n\u003cp\u003eA hand wrapped around her mouth, cutting off her words.\u003c/p\u003e\n\u003cp\u003eWill wrapped a meaty fist around the cable and swung out, a grim look of determination on his face. Lena’s heart leaped into her throat. Damn him. Why wouldn’t he listen to her? Her heart hammered against her ribs. If he was hurt trying to save her, she’d never forgive herself.\u003c/p\u003e\n\u003cp\u003e“Ready, Lowerston?” Mendici asked, watching Will swing hand after hand across the cable.\u003c/p\u003e\n\u003cp\u003e“Got him,” someone muttered behind her.\u003c/p\u003e\n\u003cp\u003eA thin, tubular shape lifted out of the corner of her eye. Lena turned her head, Mendici’s hand sliding from her mouth loosely. Five feet behind her, a man peered through the sight on a rifle.\u003c/p\u003e\n\u003cp\u003eShe didn’t think. She’d never reach him in time. Instead, watching his finger caress the trigger, she stepped in front of the rifle.\u003c/p\u003e\n\u003cp\u003eWith a muttered curse he jerked the weapon up, an explosion of sound shooting into the darkened gloom of the cavern’s roof. As soon as the bullet hit, it exploded, sparks cascading above like fireworks. A dozen screeching bats flew out of the shadows and a heavy silence fell, marred only by the sinuous stir of water far below.\u003c/p\u003e\n\u003cp\u003eLena stared at the man with the rifle, her breath freezing in her chest. What the hell had she just done? If that had hit her, she’d be little more than pieces of flesh and viscera, scattered across the ledge.\u003c/p\u003e\n\u003cp\u003e“Are you insane?” Mendici roared, ripping her out of the way and shaking her.\u003c/p\u003e\n\u003cp\u003eIcy dread slithered through her veins. “No,” she heard herself say, the words clear and distinct. Her knees gave out and Mendici let her drop to the ground.\u003c/p\u003e\n\u003cp\u003e“Reload!” he snapped at the rifleman, glancing sharply at Will as if to gauge his distance. “Bloody hell.”\u003c/p\u003e\n\u003cp\u003eLowerston fumbled for bullets, his fingers shaking. Mendici’s nostrils flared. “Looks like I’ll have to do this meself.”\u003c/p\u003e\n\u003cp\u003eDragging something out of his pocket, he held up a small metal cylinder. As his thumb pressed the button on top, she waited for the explosion.\u003c/p\u003e\n\u003cp\u003eNothing came.\u003c/p\u003e\n\u003cp\u003eBut Will lost his grip on the cable with one hand, his body jerking almost in pain. He clapped his arm over his ears and face, his body tucking up on itself. The other fist curled around the cable in an iron grip, his knuckles whitening.\u003c/p\u003e\n\u003cp\u003e“Come on, you bastard.” Mendici muttered, staring at him with a glittering eye.\u003c/p\u003e\n\u003cp\u003e“He can’t hold out for long,” the young lad piped up. “Nobody’s held up against a screamer before.”\u003c/p\u003e\n\u003cp\u003eWill slowly straightened, the muscles in his body rigid. Teeth ground together, his eyes flaring wild, he reached for the cable with the other hand, each movement slow and precise, as if he had to force his body to work properly.\u003c/p\u003e\n\u003cp\u003eCome on, she whispered silently, her hands clenched at his side. Barely twenty feet away now.\u003c/p\u003e\n\u003cp\u003e“Bloody ’ell,” Lowerston said, sounding slightly awed. “’E’s doin’ it.”\u003c/p\u003e\n\u003cp\u003e“Not for long,” Mendici snarled, snatching an ax off one of his men. He strode toward the edge of the ledge, fist curled around the wooden haft. Not that it would do much good against a verwulfen in the full grip of the battle-fury. “Time to meet the Gatekeeper.”\u003c/p\u003e\n\u003cp\u003eHe swung it—not at the heavy iron cable, as she’d expected—but at the timber pulley that held it rigged to the wall.\u003c/p\u003e\n\u003cp\u003eThe timber sheared away, hitting the floor then jerking out into the gaping darkness of the chasm.\u003c/p\u003e\n\u003cp\u003e“No!” Lena screamed.\u003c/p\u003e\n\u003cp\u003eWill flew away into the darkness, his white shirt like a wraith. He hit the far side of the cliff, sliding several feet down the cable. Then he shuddered and plunged into the darkness below.\u003c/p\u003e\n\u003cp\u003eSeconds later—what felt like hours—she heard the splash as he hit the water and the hungry thrashing sound of whatever lurked below.\u003c/p\u003e\n\u003cp\u003eNineteen\u003c/p\u003e\n\u003cp\u003eWill crawled out of the water with a snarl, his hands coated with grease and blood and a steel tentacle in his fist. His ears still rang, and the pain in his cheek told him he might have broken something. Fury boiled in his blood, along with the creeping lassitude of the aftermath of a rousing fight. He ignored it.\u003c/p\u003e\n\u003cp\u003eForcing himself to his feet, he stared down at the limp steel tentacle. Whatever the hell that had been, it was vicious. He’d barely found himself in the water before it was on him, steel limbs thrashing and reaching for him.\u003c/p\u003e\n\u003cp\u003eHe couldn’t remember much of the fight—he never could, really, beyond flashing images of sight and sound—but he could vaguely recall the gaping maw that sucked in water to fuel its steam-driven core, and the razor-sharp threshing blades of its teeth. Smashing his fist straight through the thin steel sheeting of its body. The burning exhale of steam in his face as he tore a tentacle off it, using the weakness of the rivets to his own advantage.\u003c/p\u003e\n\u003cp\u003eThat was where inventors made their fatal flaw with the metal monsters and automatons they created. For a metaljacket, it was the hinge of their knees and arms; for the steel-squid, it was the segmented join of the tentacles to its body. Tear that apart and all you had was a wounded shell that flopped around like a turtle on its back.\u003c/p\u003e\n\u003cp\u003eDestroying it hadn’t been without cost, however.\u003c/p\u003e\n\u003cp\u003eWill staggered against a stalactite and pressed a hand to his side. His fingers came away sticky, a result of those iron teeth. Every muscle in his body throbbed with the ache of the fall and the way the smooth surface of the water had felt like he plunged onto heavy cobbles.\u003c/p\u003e\n\u003cp\u003eHe wanted to stumble to the ground and sleep away the hurt. A fatal weakness for his species. Almost unstoppable once they were in a full fury, barely cognizant of injury or pain, verwulfen dropped like stones after the excitement wore off.\u003c/p\u003e\n\u003cp\u003eWill wiped the blood out of his eyes and staggered forward. Couldn’t sleep. Not yet. Lena was out there. He’d heard her scream as he plunged toward the water, heard the soul-shattering loss in her voice as she cried out.\u003c/p\u003e\n\u003cp\u003eWhoever had her—and he was starting to get an idea of their identity—they were going to wish they’d never dared touch his woman.\u003c/p\u003e\n\u003cp\u003eThey traveled along tunnels worn smooth from feet.\u003c/p\u003e\n\u003cp\u003eShe saw none of it.\u003c/p\u003e\n\u003cp\u003eThe men spoke and laughed amongst themselves, clapping Mendici on the back as though he were a hero.\u003c/p\u003e\n\u003cp\u003eShe heard none of it.\u003c/p\u003e\n\u003cp\u003eShe existed only in a world of dull color and muted sound, seeing Will tumble into the gloomy pit again and again.\u003c/p\u003e\n\u003cp\u003eHe couldn’t survive that. Could he? The thought made her feel ill, a heavy weight sitting on her chest until she was afraid she couldn’t breathe. Oh God, what had she done? She’d blown that bloody whistle, afraid for her life, knowing that he would come for her and make everything safe for her again. But he hadn’t. He wasn’t invincible. No matter how quickly he could heal, how strong he was, he was only flesh and bone in the end, the same as she was.\u003c/p\u003e\n\u003cp\u003eI’ll always come for you. But this time she was on her own, for Will was…lost. She couldn’t think of the alternative or she’d break, becoming a blind, shivering thing, hovering in her own misery. She had to survive whatever was coming, had to find him, find out if…\u003c/p\u003e\n\u003cp\u003eShe shook the thought away and looked up, trying to focus. Light bloomed ahead. A heavy iron door hung in the shadows, with a man guarding it. She glimpsed cold steel. His hand, a gauntlet of metal, with heavy, slatted plates to his elbow.\u003c/p\u003e\n\u003cp\u003eMech work.\u003c/p\u003e\n\u003cp\u003eCold etched its way down to her bones, but she felt strangely removed. To endure she’d wrapped away that part that was screaming in grief and forced her mind to work analytically. To examine, understand, find a weakness…\u003c/p\u003e\n\u003cp\u003eMech. The word whispered in her head. A mech. Bound to the enclaves and forced to work out their contracts to pay for the technology that had given them life or limb. Less than human, the Echelon decreed. Kept out of sight and out of mind.\u003c/p\u003e\n\u003cp\u003e“Well met, brother,” the guard said, stepping forward and clasping Mendici’s arm. His curious gaze slid over her. “They’re inside. Waiting. You weren’t followed?”\u003c/p\u003e\n\u003cp\u003e“We were,” Mendici replied. “The Gatekeeper’s probably picking the remains of ’im out of ’is teeth.”\u003c/p\u003e\n\u003cp\u003eAnother stab to the heart. Lena sucked in a sharp breath. She couldn’t go there, to that cold, empty place deep inside. Not yet.\u003c/p\u003e\n\u003cp\u003eThe stranger nodded, running his gaze over the ragged group. “Get yourself something to warm your bellies. I’ll take her through.”\u003c/p\u003e\n\u003cp\u003e“I believe I’ll come,” Mendici announced, tucking his thumbs behind his belt. “I’m wonderin’ as to what this is all about.”\u003c/p\u003e\n\u003cp\u003e“Himself’s in a curious mood,” the stranger warned.\u003c/p\u003e\n\u003cp\u003e“I’ve as much a right to be there as ’im. I’ve as much a right as any free man.”\u003c/p\u003e\n\u003cp\u003e“You can explain that to him. Come.” The stranger gestured to her.\u003c/p\u003e\n\u003cp\u003eShoving open the iron door revealed a room in the middle of all the tunnels. Crates were stacked floor to ceiling, and candlelight flickered, warming the shadows. Its glow stretched only so far, though. She couldn’t see where the walls began. Only an endless maze of crates.\u003c/p\u003e\n\u003cp\u003eThe murmur of voices drew them out of the darkness like a beacon. Mendici rapped at another door, his gaze dropping away. Not as confident as he appeared.\u003c/p\u003e\n\u003cp\u003eA slit in the door slid open and a single gray eye stared through. Then the slit slammed shut and the clicking of a lock sounded. \u003c/p\u003e","sourceLink":"https://allnovel.net/heart-of-iron-london-steampunk-2/page-31.html","bookId":1583,"creation":"Oct 6, 2019 12:15:32 AM","modification":"Oct 6, 2019 12:15:32 AM"}
