{"id":71512,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Or we could go to my hotel. It’s got a king-size bed.”\u003c/p\u003e\n\u003cp\u003e“Better yet.” Tell tucked a strand of hair behind her ear. “You have anything else to do around here?”\u003c/p\u003e\n\u003cp\u003e“I’m free to go. Someone else will lock up.”\u003c/p\u003e\n\u003cp\u003eAn odd expression crossed her face when he reached for her hand. “Is there a problem with your job if people see us together?”\u003c/p\u003e\n\u003cp\u003e“No. I’m just…surprised that you aren’t keeping this under wraps. I mean, us being out together in Sundance is one thing. But here?”\u003c/p\u003e\n\u003cp\u003e“Why would here be any different?”\u003c/p\u003e\n\u003cp\u003eHer gaze dropped to his chest. “Because you have a reputation as a player, Tell. Rumor has it that as many buckle bunnies wait for you after an event as for the riders.”\u003c/p\u003e\n\u003cp\u003eTell grabbed her chin, looking into her eyes. “We are together, here, there and everywhere else. I won’t deny my reputation, but I will point out that I don’t fuck around. You are the only woman I’m with.”\u003c/p\u003e\n\u003cp\u003eWhen Georgia still didn’t look convinced, he picked her up and plopped her on the conference table. He made room for himself between her thighs and loomed over her, forcing her to rest her hands on the table behind her. “You want me to prove that right now?”\u003c/p\u003e\n\u003cp\u003e“That’s not necessary—”\u003c/p\u003e\n\u003cp\u003e“Oh, darlin’, I surely believe it is.” He placed a soft kiss on the hollow of her throat. “Move your head to the side.”\u003c/p\u003e\n\u003cp\u003eGeorgia arched her neck.\u003c/p\u003e\n\u003cp\u003eHe nuzzled that warm sweep of flesh, letting his breath tease before he used his mouth to kiss and suck. He dragged his lips over the smooth muscles of her throat. Inhaling her fragrance and absorbing the vibrations of her body reacting to his touch. When she began to squeeze her thighs together, he whispered, “Think I’d be embarrassed and back away from you if someone walked on us?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“If I hadn’t fucked you so fast and hard the first time, I’d fuck you hard and fast right now on this table.”\u003c/p\u003e\n\u003cp\u003eThen her hands were on his chest, pushing him back. “Let’s get out of here before the temptation is too much for me to resist.”\u003c/p\u003e\n\u003cp\u003eHot damn. “Can you leave your car here?”\u003c/p\u003e\n\u003cp\u003e“I guess. But I really hate being without a vehicle.”\u003c/p\u003e\n\u003cp\u003eTell brought Georgia to her feet. “I’ll keep you too goddamn busy to even think about leavin’.”\u003c/p\u003e\n\u003cp\u003eAnd didn’t that put a hungry look in her eyes?\u003c/p\u003e\n\u003cp\u003e“I’ll drive. You tell me where we’re goin’.”\u003c/p\u003e\n\u003cp\u003eAs much as he wanted to run for his pickup, he didn’t. As much as he wanted to swing Georgia into his arms and carry her, kissing that tempting mouth of hers the entire way, he didn’t. He patted himself on the back for his control.\u003c/p\u003e\n\u003cp\u003eBut as soon as they reached their destination? Tell knew his control would be nonexistent.\u003c/p\u003e\n\u003cp\u003eGeorgia said, “I’m staying at the Holiday Inn.”\u003c/p\u003e\n\u003cp\u003eThen he remembered he’d left his duffel bag in his motel room. “We have to stop by my motel first.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“That’s where the condoms are.”\u003c/p\u003e\n\u003cp\u003e“Oh.” She smirked.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I’m pretty sure we won’t be seeing that big bed at the Holiday Inn tonight.” She picked up his hand and rubbed the back of his knuckles over her cleavage. “But at this point, any bed will do.”\u003c/p\u003e\n\u003cp\u003e“Damn straight.”\u003c/p\u003e\n\u003cp\u003e“Drive faster.”\u003c/p\u003e\n\u003cp\u003eHe hit the gas.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eProbably it wasn’t the first time pickup tires screeched to a stop at the Sage and Spurs Motel.\u003c/p\u003e\n\u003cp\u003eTell had the old-fashioned key fob in his hand when he skirted the back end of his pickup.\u003c/p\u003e\n\u003cp\u003eWhen he went to help Georgia out, the woman launched herself at him and locked her arms around his neck. He clamped his hands on her ass and half-carried her to the door.\u003c/p\u003e\n\u003cp\u003eHe released her long enough to get the key positioned. But with the way her hands were clawing at his chest, he fumbled the key twice before he fit it in the lock.\u003c/p\u003e\n\u003cp\u003eAs soon as they were in the room, before he’d turned on a single light, Georgia was all over him. Her mouth attacking his throat as she started popping buttons on his shirt. Her pelvis rubbing against his. Making those sexy-ass moans.\u003c/p\u003e\n\u003cp\u003eHe put his hands over hers, stopping her frantic motions. “Georgia. Hold that thought for a sec.” He took off his hat, reached over and hit the light switch.\u003c/p\u003e\n\u003cp\u003eThis was a pretty shitty room. Maybe keeping the lights off hadn’t been such a bad idea. But then he looked at the beautiful woman standing in front of him. Her breathing uneven. Her lips so full and ripe. The blush of arousal on her cheeks, those magnetic eyes of hers so completely focused on him.\u003c/p\u003e\n\u003cp\u003e“Look at you. God. You are something else.” He traced her prominent jawline with the backs of his fingers. “Take off your clothes.”\u003c/p\u003e\n\u003cp\u003eThat stubborn chin came up. “I’m not stripping solo again.”\u003c/p\u003e\n\u003cp\u003e“Fair enough. Then I’ll strip you.” He yanked her denim dress over her head. He unsnapped her bra. He hooked his fingers into the sides of her bikini panties and tugged them down to her ankles.\u003c/p\u003e\n\u003cp\u003eGeorgia tried to take a step back, but hobbled by her underwear, she fell ass-first on the bed.\u003c/p\u003e\n\u003cp\u003eTell dropped to his knees in front of her. He kept his caresses easy, wanting to take hours to touch and taste every inch of her bared skin. The explosive passion wasn’t going anywhere so he’d just put it on simmer while he savored her.\u003c/p\u003e\n\u003cp\u003eBut Georgia seemed a little unsure about being naked.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t allow it. He lightly pushed on the insides of her thighs and demanded, “Let me see you. All of you.” He heard a swift intake of breath and then she scooted her bottom to the end of the bed.\u003c/p\u003e\n\u003cp\u003e“Watch my eyes. See how goddamned turned on I am by your body.” He grinned. “And baby, if that doesn’t convince you? Look at the crotch of my jeans.”\u003c/p\u003e\n\u003cp\u003eThat brought her sweet, lopsided smile.\u003c/p\u003e\n\u003cp\u003eHe pressed a kiss below her belly button. Then lower. Then lower again. Leaving a longer kiss on the small strip of black curls pointing the way to his ultimate destination.\u003c/p\u003e\n\u003cp\u003eWhen his tongue followed that silken trail, she moaned.\u003c/p\u003e\n\u003cp\u003eHe glanced up at her, his mouth hovering over her sex. Then he shoved his tongue deeply into her slick core.\u003c/p\u003e\n\u003cp\u003eSo sweet. So wet. God, he wanted to suck and lick and make her come undone at least five times before he moved from this paradise. His intent to leisurely explore every delicate pink fold, to keep her hanging until she begged him to make her come…vanished.\u003c/p\u003e\n\u003cp\u003eTell used his thumbs to pull her pussy lips apart, settled his mouth over the skin hiding her clit and began to suck.\u003c/p\u003e\n\u003cp\u003eGeorgia’s body quivered. A strangled moan escaped and she arched, shoving her pelvis forward.\u003c/p\u003e\n\u003cp\u003eHe loved this part of sex. Losing himself in this first taste of her. Hearing her moan louder when he lightly flicked his tongue over that swollen little pearl.\u003c/p\u003e\n\u003cp\u003eHer fingers tangled in his hair as he kept up his relentless assault. She kept murmuring, “Yes, yes, yes…” Then her body went stiff and she cried out.\u003c/p\u003e\n\u003cp\u003eGeorgia’s sex pulsed beneath his lips and against his tongue. Tell stayed right there, his sucking mouth keeping rhythm until the spasms ended. He scattered kisses to the creases of her thighs, stopping to dip his tongue into that sweet, sweet honey again.\u003c/p\u003e\n\u003cp\u003eShe rolled back onto the mattress, her body limp.\u003c/p\u003e\n\u003cp\u003eThat was the only limp thing around here.\u003c/p\u003e\n\u003cp\u003eAs he unbuckled his belt, she rallied and pushed upright. She didn’t say anything, she just watched from beneath heavy-lidded eyes as he removed his boots, shucked his jeans, boxers and socks.\u003c/p\u003e\n\u003cp\u003eWhen his hand tugged on the remaining buttons on his shirt, Georgia shook her head. “I get to do that.”\u003c/p\u003e\n\u003cp\u003e“That right?”\u003c/p\u003e\n\u003cp\u003eShe still had her shoes on, so when she stepped off the bed, the top of her head brushed the underside of his jawline. “I’ve wanted to put my hands all over you since Sunday when we played basketball. Last night we were too…”\u003c/p\u003e\n\u003cp\u003eTell touched her cheek. “Should I apologize?”\u003c/p\u003e\n\u003cp\u003e“God no. It was fantastic. One minute we’re arguing and the next you’re stripping me and fucking me.” She popped the next button. “You had that look of animal lust and I…”\u003c/p\u003e\n\u003cp\u003eHe stayed her hand. “What?”\u003c/p\u003e\n\u003cp\u003e“I liked that you didn’t treat me like a fragile doll. You wanted me, you took me. That type of intensity is powerful, Tell. Especially when it’s new to me.” Her cheeks reddened. “I haven’t been with a lot of guys. And it’s been pretty basic sex.” She met his gaze. “But from the first time you kissed me at the Golden Boot, I knew it’d be different with you.”\u003c/p\u003e\n\u003cp\u003eTell groaned. “And then what did I do? Became that same type of guy you didn’t want. With the innocent dates and the waiting to get nekkid and wild.”\u003c/p\u003e\n\u003cp\u003e“You don’t need to read up on the Kama Sutra to impress me, but I don’t want you to hold back.” She focused on unsnapping his buttons and ridding him of his shirt.\u003c/p\u003e\n\u003cp\u003eNow that he wouldn’t have to worry about holding back with her…didn’t that just bust open the vault to all his kinkiest fantasies?\u003c/p\u003e\n\u003cp\u003eGeorgia ran her hands over his chest. Tracing the ridges of his pectorals. Following the edge of his rib cage down to his lower abdomen. Then she locked her gaze to his as she wrapped her hand around his cock, delicately sweeping her thumb over the spot beneath the head.\u003c/p\u003e\n\u003cp\u003eAs much as Tell wanted to see those hot lips circling his cock, it could wait. “We sorta slowed down. Maybe I shoulda gone with my first instinct and fucked you against the door as soon as we walked in.” He bent to align his mouth with her right nipple. Licking the hardened point with the very tip of his tongue. “On the bed. Now.”\u003c/p\u003e\n\u003cp\u003eGeorgia placed a soft kiss on his sternum and scooted onto the bed.\u003c/p\u003e\n\u003cp\u003eTell ripped open a condom, rolled it on and crawled across the mattress. She’d parted her thighs, keeping her arms above her head, making her body one long line of curves he couldn’t wait to explore. Lowering himself over her, hips to hips, he fit his cock to her core, gliding into that tight heat. Then he ran his palms up her arms until he reached her wrists. Threading his fingers through hers, be began to move. \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-19.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
