{"id":71515,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Good idea.”\u003c/p\u003e\n\u003cp\u003eWas it funny or sad that neither mentioned calling their dad?\u003c/p\u003e\n\u003cp\u003e“Now go track down your kid, Brandt. That way when Mama Jess wakes up, you can fill her in on what happened to the little tyke. ’Cause she’s gonna want to know.”\u003c/p\u003e\n\u003cp\u003e“Thanks. I just… I need you here, okay?”\u003c/p\u003e\n\u003cp\u003eHad he ever heard such a note of panic in his older brother’s voice? “I’ve got some things to finish up here first, so it’ll be a couple, three hours before I’m there.”\u003c/p\u003e\n\u003cp\u003eGeorgia rubbed Tell’s arm after he stood there for several long seconds without speaking. “Sounds like congratulations are in order.”\u003c/p\u003e\n\u003cp\u003e“Yeah. I’m happy Jessie didn’t have complications. But man. Brandt is still uptight as hell.”\u003c/p\u003e\n\u003cp\u003e“Then it’s a good thing you’re going in. Maybe you’ll calm him down.”\u003c/p\u003e\n\u003cp\u003eTell leaned down to kiss her. On impulse he asked, “Will you come with me?”\u003c/p\u003e\n\u003cp\u003eRegret flashed in her eyes. “No. The first time seeing your nephew will be special. Jessie will have a ton of visitors and I don’t need to add to her stress, especially since she doesn’t know me.”\u003c/p\u003e\n\u003cp\u003eBut I want her to know you.\u003c/p\u003e\n\u003cp\u003eWhoa. That’d come out of left field. Normally he kept the woman sharing his bed far away from the McKay family madness, so as not to give her ideas that he was serious about wanting her to become a part of his family.\u003c/p\u003e\n\u003cp\u003e“Besides, I have work to do today. Somebody—” she pecked his mouth, “—has distracted me. Not that I’m complaining.”\u003c/p\u003e\n\u003cp\u003e“Good. ’Cause I don’t plan to stop distracting you anytime soon.”\u003c/p\u003e\n\u003cp\u003eShe gave him that goofy smile. “Call me later?”\u003c/p\u003e\n\u003cp\u003e“Sure. I’ll be in town. Wanna do something?”\u003c/p\u003e\n\u003cp\u003e“If that’s your way of asking if I want you to fuck me senseless again? The answer is yes.” One last kiss and she sailed out the door.\u003c/p\u003e\n\u003cp\u003eThe odd thing was, Tell hadn’t been talking about sex.\u003c/p\u003e\n\u003cp\u003eHe killed an hour doing stuff around the house he’d been putting off. Stalling wasn’t normally his style, but he suspected Jessie might be as overwhelmed as Brandt.\u003c/p\u003e\n\u003cp\u003eAfter he checked on Jessie and Brandt’s dog, he stopped at the grocery store to grab some flowers. The selection was shitty, so he drove to Spearfish.\u003c/p\u003e\n\u003cp\u003eSomehow he managed to leave Walmart with flowers, a stuffed horse, a DVD of Parenthood, a box of chocolates and a bottle of booze.\u003c/p\u003e\n\u003cp\u003eHe felt like a dork schlepping all the stuff into the hospital. When he asked at the visitor information center for Jessie’s room number, the woman made him wait.\u003c/p\u003e\n\u003cp\u003eHis heart sped up. “Is something wrong?”\u003c/p\u003e\n\u003cp\u003eThe older gal shook her head. “Doc Monroe put a limit on visitors for the first twenty-four hours. The McKays could overtake the whole wing if y’all showed up at the same time.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “That’s true.”\u003c/p\u003e\n\u003cp\u003e“You’re cleared to go in, Tell. Room one nineteen.”\u003c/p\u003e\n\u003cp\u003eHe cut down the left hallway—due to various injuries over the years he’d been in this hospital several times—and stopped in front of the door. After shifting everything into one hand, he knocked.\u003c/p\u003e\n\u003cp\u003eBrandt opened the door a crack. Then he threw it open wide. “Tell. Man. I’m glad you’re here. What took you so damn long?”\u003c/p\u003e\n\u003cp\u003e“Had to get a few things to mark the occasion.”\u003c/p\u003e\n\u003cp\u003eBrandt’s eyes were dark with guilt when he saw the bouquet. Dammit. His brother hadn’t gone out and brought Jessie flowers yet? Dumb-ass.\u003c/p\u003e\n\u003cp\u003eJess was sitting up, a blanket-wrapped bundle tucked against her body. She looked tired, but happy. She beamed at him. “Hey, Uncle Tell. Whatcha got there?”\u003c/p\u003e\n\u003cp\u003e“Flowers from your adoring husband. He asked me to pick them up for him because he couldn’t bear to leave you guys.” Tell passed her the bouquet of yellow, white and pink daisies.\u003c/p\u003e\n\u003cp\u003eHer lip trembled. She looked over at Brandt. “Thank you. Daisies are my favorite.”\u003c/p\u003e\n\u003cp\u003eBrandt said, “I’ll get ’em in some water.”\u003c/p\u003e\n\u003cp\u003eThen Tell pulled out the tie-dyed plush pony. “Looks like a hippie horse, but I’ve heard babies like bright things. And so you didn’t think I forgot you…” He waggled the two-pound box of chocolates and the DVD at her.\u003c/p\u003e\n\u003cp\u003eShe laughed.\u003c/p\u003e\n\u003cp\u003eHe took the bottle out of the paper bag. “My gift to the proud daddy. Koltiska liquor made right here in Wyoming. Figured my big brother and I needed to celebrate Wyoming’s newest resident.”\u003c/p\u003e\n\u003cp\u003e“Maybe you oughta give Brandt a shot now,” she said dryly. “Anyway. Come see our son.” Jessie peeled back the blanket covering the baby’s face.\u003c/p\u003e\n\u003cp\u003eHis eyes were squeezed shut. In fact, his whole face was squished and red—not that Tell would point that out. The baby had a full head of dark hair.\u003c/p\u003e\n\u003cp\u003eJess murmured and stroked Tucker’s cheek. His eyes opened.\u003c/p\u003e\n\u003cp\u003e“Whoa. He’s lookin’ at me.”\u003c/p\u003e\n\u003cp\u003e“He’s actually awake more than I thought he’d be.”\u003c/p\u003e\n\u003cp\u003e“Heya, buddy. Welcome to the family.” Tell kissed Jessie’s forehead. “Ya done good, Mama. He’s perfect. And so little.”\u003c/p\u003e\n\u003cp\u003eShe snorted. “He didn’t feel little when I was tryin’ to push him out.”\u003c/p\u003e\n\u003cp\u003eTell chuckled.\u003c/p\u003e\n\u003cp\u003e“Do you wanna hold him?”\u003c/p\u003e\n\u003cp\u003e“In a bit. He looks content. I ain’t gonna mess with him.”\u003c/p\u003e\n\u003cp\u003eJessie frowned.\u003c/p\u003e\n\u003cp\u003e“Has Dalton been by yet?”\u003c/p\u003e\n\u003cp\u003e“He’s on his way. Now that Tell’s here to keep you company, I’m gonna fill out that paperwork.” Brandt softly closed the door behind him.\u003c/p\u003e\n\u003cp\u003eTell’s gaze connected with Jessie’s. “Is everything all right?”\u003c/p\u003e\n\u003cp\u003e“No. Brandt… He…” She shook her head. “This is gonna sound stupid, but I don’t think he likes Tucker.”\u003c/p\u003e\n\u003cp\u003e“Why would you say that?”\u003c/p\u003e\n\u003cp\u003e“Brandt was great during the delivery. He stayed right beside me and he didn’t blink when I sort of…took a swing at him.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Yeah. It didn’t faze him. He just kept me focused on getting through the next contraction. After I delivered Tucker and it was just the three of us alone in the room, Brandt was so quiet. When I finally made him hold his son, he just looked at Tucker like I’d handed him a rabid raccoon.” Jessie started to cry.\u003c/p\u003e\n\u003cp\u003eTell was going to slap his stupid fucking brother right upside the head when he got him alone.\u003c/p\u003e\n\u003cp\u003e“What if he didn’t really want this baby? What if Brandt just said he did to make me happy and now he regrets it—”\u003c/p\u003e\n\u003cp\u003e“Hey.” Tell wrapped his hands around Jessie’s face, wiping away her tears. “I promise you, I will find out what is wrong with him. But get it outta your head, right now, Jess, that he doesn’t love this kid.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eThen Tucker squirmed and grunted and made the funniest face that both Tell and Jessie laughed.\u003c/p\u003e\n\u003cp\u003eThree knocks and the door swung open.\u003c/p\u003e\n\u003cp\u003eKeely McKay Donohue sauntered in, holding a shiny blue bag covered in rocking horses. “Thank God that baby is finally here.” She hugged Tell and then hip-checked him, completely horning in on his spot.\u003c/p\u003e\n\u003cp\u003eHe knew Keely would stick around awhile and he considered tracking down his shit-for-brains older brother. But he opted to stay in case Keely needed encouragement to leave because Jess was too nice to point her toward the door.\u003c/p\u003e\n\u003cp\u003e“Do you wanna hold him?” Jessie asked Keely.\u003c/p\u003e\n\u003cp\u003e“Yep. Lemme pull a chair over first.” She scooped Tucker up like a pro. “He’s hefty. Colt and India’s McKenna weighed in at seven pounds. That one pound makes a big difference.”\u003c/p\u003e\n\u003cp\u003e“Tell me about it.”\u003c/p\u003e\n\u003cp\u003eKeely kissed Tucker’s forehead. “God. I love the way babies smell. And they’re so warm and cuddly.”\u003c/p\u003e\n\u003cp\u003e“After that remark, you know I’m gonna ask when you and Jack are going to start a family,” Jessie said.\u003c/p\u003e\n\u003cp\u003e“I know.” Keely fussed with the blanket. “Can I ask you something? On a scale of one to ten, how bad did it hurt to have these eight pounds squeezed out of your va-jay-jay?”\u003c/p\u003e\n\u003cp\u003eJessie paused. “A nine.”\u003c/p\u003e\n\u003cp\u003eTell did not want to hear this conversation but now he was trapped.\u003c/p\u003e\n\u003cp\u003e“Crap. That’s what I thought. See, AJ spews this ‘it’s a beautiful thing’ when she talks about giving birth, even when I saw her screaming at Cord when she was in labor with Beau.”\u003c/p\u003e\n\u003cp\u003e“Yikes.”\u003c/p\u003e\n\u003cp\u003e“And that was her second baby.”\u003c/p\u003e\n\u003cp\u003e“Well, it hurts like nothing I’ve ever felt. I mean, I wanted to punch and scratch and scream at Brandt because I had to go through all of this and he didn’t. Yet the baby would still be half his. How is that fair? At the very least he should have to suffer somehow, right? I mean, months of being sick, being hormonal, being fat, being so desperately horny and then wanting to chop off Brandt’s hand or his dick if either so much as touched me again.”\u003c/p\u003e\n\u003cp\u003eTell’s legs automatically snapped together.\u003c/p\u003e\n\u003cp\u003e“And now after the blessed event, not only is there no sex for six weeks, I’ve been warned that my nipples might crack and bleed while I’m breastfeeding. Not to mention milk leaks everywhere. And I have this extra pooch of skin on my gut that I’ll probably never get rid of. I’m pretty sure my hips or my ass won’t ever be the same pre-baby size.”\u003c/p\u003e\n\u003cp\u003eMaybe they wouldn’t notice if he dropped to the floor and crawled out. Knowing women talked about shit like this and hearing it? Two. Different. Things.\u003c/p\u003e\n\u003cp\u003e“See?” Keely pointed out. “Pregnancy sounds like a raw deal for women, doesn’t it?”\u003c/p\u003e\n\u003cp\u003eJessie’s face softened. “But look at him, Keely. He’s so perfect. He’s part me and part Brandt. I just stare at his sweet little face and wonder if he’ll have my personality or his father’s, or maybe his own. I wonder who he will look like.”\u003c/p\u003e\n\u003cp\u003e“Hate to break it to you, but this boy already looks like a McKay. He’s beautiful.” Keely sniffled.\u003c/p\u003e\n\u003cp\u003eHoly fuck. His cowgirl-tough cousin was…crying? \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-22.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
