{"id":71517,"no":24,"title":"Page 24","content":"\u003cp\u003eGreat. But it bothered Tell that his older brother hadn’t been paying attention to things going on in his life. Then again, Brandt hadn’t been paying attention to anything.\u003c/p\u003e\n\u003cp\u003eYou cut him too much slack.\u003c/p\u003e\n\u003cp\u003eDalton smirked at him. “Didja finally get into her pants?”\u003c/p\u003e\n\u003cp\u003eAfter several belts, Tell didn’t have the tact to deal with his younger brother, so he ignored him and slid off the tailgate. He looked at Brandt. “I know you’ll get a handle on this. Call me if you need anything.”\u003c/p\u003e\n\u003cp\u003eChapter Twelve\u003c/p\u003e\n\u003cp\u003eGeorgia was mighty shocked to see Tell on her doorstep.\u003c/p\u003e\n\u003cp\u003e“Tell? What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I was at the hospital to meet my nephew. Brandt and I knocked back a few celebratory shots, and I realized I oughten be drivin’, so I walked over to see if you’d be interested in goin’ out for supper with me.”\u003c/p\u003e\n\u003cp\u003e“That’s thoughtful, but I just finished cooking.”\u003c/p\u003e\n\u003cp\u003eHe took a step back. “I probably shoulda called first. No big deal. I’ll go.”\u003c/p\u003e\n\u003cp\u003eShe grabbed a fistful of his T-shirt, holding him in place. “Not so fast. I have plenty of food if you’d like stay and eat with me.”\u003c/p\u003e\n\u003cp\u003eTell curled his hand around her cheek. “You’re so damn sweet. Thank you. I’d like that. A lot.”\u003c/p\u003e\n\u003cp\u003eJust the simple stroke of his thumb made her belly flip. “I hope you like curry.”\u003c/p\u003e\n\u003cp\u003e“Don’t know that I’ve ever had it.”\u003c/p\u003e\n\u003cp\u003eGeorgia stood on tiptoe to press her mouth to his. “So come in and try it.”\u003c/p\u003e\n\u003cp\u003eHe let her lead him into the kitchen after protesting that he needed to remove his boots. She gently shoved him into a chair and grabbed another plate from the cupboard. “Tea would be better for you than beer.”\u003c/p\u003e\n\u003cp\u003e“Yeah. I ain’t drunk, but I’m definitely feeling the shots.”\u003c/p\u003e\n\u003cp\u003e“How is the newest McKay?”\u003c/p\u003e\n\u003cp\u003e“Perfect, strapping, eight-pound baby boy.”\u003c/p\u003e\n\u003cp\u003e“And your sister-in-law?”\u003c/p\u003e\n\u003cp\u003e“She’s doin’ great.” He frowned and traced the edges of the place mat.\u003c/p\u003e\n\u003cp\u003eBetween Tell showing up unannounced and the uncertainty surrounding him, Georgia knew something was up. If he wanted to talk about it, he would, but she wouldn’t pry. She dished up two plates of basmati rice and poured coconut chicken curry over the top.\u003c/p\u003e\n\u003cp\u003e“Georgia, darlin’, this smells awesome.”\u003c/p\u003e\n\u003cp\u003e“It’s a little spicy.” She filled two glasses of iced tea and sat across from him. “Dig in. Don’t be shy.”\u003c/p\u003e\n\u003cp\u003eTell stirred his food before taking a bite.\u003c/p\u003e\n\u003cp\u003eGeorgia waited to see if he made a face. She remembered from living with her dad and Deck that cowboys weren’t adventurous eaters.\u003c/p\u003e\n\u003cp\u003eHe swallowed and immediately scooped up another forkful. “Hey. This is tasty.” After a few more bites, he reached for his tea and sputtered. “Is there sugar in here?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eTell shook his head. “Iced tea ain’t supposed to be sweet.”\u003c/p\u003e\n\u003cp\u003e“Sweet tea is the norm where I’m from in Texas.”\u003c/p\u003e\n\u003cp\u003e“So you ain’t claiming Wyoming as your home at all?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “We moved a lot before we ended up in Sundance. I might’ve considered it home if I’d stayed married to Deck.”\u003c/p\u003e\n\u003cp\u003eHe dumped his tea in the sink and refilled the glass with water. “You’ve never talked about your life before you moved here.”\u003c/p\u003e\n\u003cp\u003e“It’s not that exciting. Me and RJ were born at Fort Bragg. My dad was stationed at two different army bases before he got out of the service. After that we moved to Nebraska. When Granddad died, my dad and his brother sold the farm, split the money and went their separate ways. My dad had always wanted to live in Wyoming, so he bought a small ranch and cattle operation.”\u003c/p\u003e\n\u003cp\u003e“Your mom didn’t mind movin’?”\u003c/p\u003e\n\u003cp\u003e“If she did, she didn’t say anything.” Georgia swirled her fork through the mixture, thinking back on those years. When everything thing had been somewhat normal in their family.\u003c/p\u003e\n\u003cp\u003eStartled by the rough fingertips caressing her hand, she looked up into Tell’s beautiful blue eyes. “I didn’t mean to upset you.”\u003c/p\u003e\n\u003cp\u003eHis concern touched her, because she hadn’t expected it. “You didn’t. It was just a reminder that Sundance will never be my home.” She managed a smile. “So what do you think of the curry?”\u003c/p\u003e\n\u003cp\u003e“I really like it.”\u003c/p\u003e\n\u003cp\u003e“You want the recipe?”\u003c/p\u003e\n\u003cp\u003e“I’m not really much of a cook.”\u003c/p\u003e\n\u003cp\u003eIt amazed her how many bachelors were clueless in the kitchen. “So what do you eat?”\u003c/p\u003e\n\u003cp\u003e“I stick to the basics. Meat. Potatoes. Chili. Eggs. Sandwiches. Frozen dinners. Or I eat out.”\u003c/p\u003e\n\u003cp\u003e“I’ll bet lots of ladies offer to fix you a home-cooked meal.”\u003c/p\u003e\n\u003cp\u003e“I usually take them up on it too.” He gave her a sly smile. “But none of those vittles have ever been as good as this.”\u003c/p\u003e\n\u003cp\u003eGeorgia rolled her eyes.\u003c/p\u003e\n\u003cp\u003e“I’d offer to whip something up for you, but now that I’ve admitted I’m a lousy cook…”\u003c/p\u003e\n\u003cp\u003e“I’ll take you up on the offer, McKay, if for no other reason than to watch you squirm.”\u003c/p\u003e\n\u003cp\u003eHis gaze settled on her chest. “I know a thing or two about making you squirm, don’t I?”\u003c/p\u003e\n\u003cp\u003eHe laughed when she blushed.\u003c/p\u003e\n\u003cp\u003eAfter they finished eating, Tell insisted on doing the dishes. She wandered out the back door onto the patio.\u003c/p\u003e\n\u003cp\u003eThe backyard was enclosed on three sides by a six-foot wooden fence with no trees obstructing the view of the sky. She’d even planted a vegetable garden, something she hadn’t done since living at the ranch. The lush green grass was soft beneath her bare feet. She spent most nights out here. Gazing at the stars. Listening to the night noises that were absent in a big city.\u003c/p\u003e\n\u003cp\u003eThe screen door banged. Then Tell’s arms were around her. “I wondered where you’d gone off to.” He kissed the top of her head. “I checked your bedroom first.”\u003c/p\u003e\n\u003cp\u003e“Were you disappointed not to find me there?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eGeorgia spun around and faced him. “It’s peaceful out here.”\u003c/p\u003e\n\u003cp\u003eHis eyes were so serious. “Is that what you’re lookin’ for? Peace?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” she answered honestly.\u003c/p\u003e\n\u003cp\u003e“That makes two of us.” Tell spread out the blanket from the porch swing on the grass. He’d taken off his boots and his socks. And did he ever look sexy: dark stubble on his lean cheeks, wearing a tight T-shirt and low-slung jeans, his feet bare. He dropped onto the blanket with a deep sigh.\u003c/p\u003e\n\u003cp\u003eAnd Georgia continued staring at him.\u003c/p\u003e\n\u003cp\u003e“Something wrong?”\u003c/p\u003e\n\u003cp\u003e“No. You’re just so easy on the eyes, Tell McKay.”\u003c/p\u003e\n\u003cp\u003e“You’re just sweet-talkin’ me, hoping it’ll get you laid.”\u003c/p\u003e\n\u003cp\u003e“Is it working?”\u003c/p\u003e\n\u003cp\u003eSmirking, Tell crooked his finger at her. “Gotta come closer, my sweet, to find out.”\u003c/p\u003e\n\u003cp\u003eShe straddled his groin, pinning his arms above his head. “Whatcha gonna do now, cowboy?”\u003c/p\u003e\n\u003cp\u003e“Remind you that what goes around comes around.”\u003c/p\u003e\n\u003cp\u003eAngling across his body, she smashed her breasts into his chest, taking one teeny nibble of his bottom lip. “That sounds intriguing. What does that mean?”\u003c/p\u003e\n\u003cp\u003e“That means…restraining me now gives me the right to do the same to you in the future.”\u003c/p\u003e\n\u003cp\u003e“Just like this? Just my hands?”\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eWow. Tell’s dark look of challenge unfurled a long lick of want inside her. Imagining her arms tied behind her back. Or in front of her. Or above her head. Or tied to a four-poster bed.\u003c/p\u003e\n\u003cp\u003e“Sweetness, gazing at me all wide-eyed like that is bound to get you…bound in all sorts of interesting ways.”\u003c/p\u003e\n\u003cp\u003e“Promise?” she whispered against his lips.\u003c/p\u003e\n\u003cp\u003eTell made a low growling sound and took her mouth in a savage kiss. Swamping her body with a wave of heat. His tongue swirled around hers aggressively as he cranked her lust higher.\u003c/p\u003e\n\u003cp\u003eGeorgia returned his passion, rolling her hips against his pelvis and across the hard ridge in his jeans.\u003c/p\u003e\n\u003cp\u003eHe dragged an openmouthed kiss down the center of her throat, commanding, “Shirt off. I want your nipples in my mouth.”\u003c/p\u003e\n\u003cp\u003eShe released his hands long enough to yank off her shirt and pop the clasp on her bra. She expected him to gather her breasts in his hands, feeling that delicious shock of wet heat as his mouth enclosed the tip.\u003c/p\u003e\n\u003cp\u003eBut Tell’s arms remained above his head. His gaze hooked hers. “Bring them to me.”\u003c/p\u003e\n\u003cp\u003eShe scooted up, bracing one hand on the ground as she leaned closer to his open mouth, intending to tease his lips with the hardened tip, then pulling away when his wicked tongue popped out to lick.\u003c/p\u003e\n\u003cp\u003eHe had other ideas. He arched his neck and sucked the tight point, closing his eyes as he attempted to work more of her into his mouth.\u003c/p\u003e\n\u003cp\u003eGooseflesh broke out, starting at her nape, inching down her spine a vertebra at a time with every rhythmic pull.\u003c/p\u003e\n\u003cp\u003eHe bit down harder than she was expecting and she jerked back, which allowed him to shift oral focus to her other breast. “Stay. Still.”\u003c/p\u003e\n\u003cp\u003eShe tried, but her body was twitchy.\u003c/p\u003e\n\u003cp\u003eHe’d latch his suctioning mouth to the hard point and then back off, teasing with little whips of his tongue. Blowing a stream of air on the wetness. Rubbing his face over the center of her breasts, scraping the bristly five o’clock shadow across the puckered tips until they ached. She ached. Everywhere. She wanted more.\u003c/p\u003e\n\u003cp\u003eShe shifted, putting both hands on the ground, and began to grind on him.\u003c/p\u003e\n\u003cp\u003eTell released her nipple. “You can grind on me all you want, but you don’t get to come.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“’Cause I said so.”\u003c/p\u003e\n\u003cp\u003eGeorgia glanced at him. The ferocity in his eyes was a little scary, until she remembered this was Tell. Laid-back Tell. Tell with the sexy, dimpled grin. Tell with the dancing eyes. Tell with the silver-tongued sweetness. Fun-loving Tell who teased her.\u003c/p\u003e\n\u003cp\u003eBut there was not a hint of that man staring back at her right now.\u003c/p\u003e\n\u003cp\u003e“Why do you have that deer in the headlights look?” \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-24.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
