{"id":71519,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Thanks.” He seemed embarrassed by the compliment.\u003c/p\u003e\n\u003cp\u003eGeorgia grabbed her clutch. As soon as they stepped outside and approached his truck, Tell apologized.\u003c/p\u003e\n\u003cp\u003e“I’m afraid we ain’t showing up to the school tonight in a fancy sports car. The only person I know who has one is Keely’s husband, Jack, and it seemed a little forward to ask to borrow it.”\u003c/p\u003e\n\u003cp\u003eShe waited while he opened the door. Then he helped her into the cab. She wrapped her fingers around the braided leather strings of his bolo tie and pulled him closer. “I’m very fond of this truck. Especially after last night. Now I know it is possible to steam up the windows in July.”\u003c/p\u003e\n\u003cp\u003eTell held her hand on the short drive to the school. She checked her reflection again, adding a coat of lip gloss.\u003c/p\u003e\n\u003cp\u003eThe parking lot was nearly full, and her stomach tightened.\u003c/p\u003e\n\u003cp\u003eThis was it.\u003c/p\u003e\n\u003cp\u003eAs they walked up to the gymnasium doors, Tell casually asked, “You nervous?”\u003c/p\u003e\n\u003cp\u003e“A little. How about you?”\u003c/p\u003e\n\u003cp\u003e“Nope.” He tucked her hand around his bicep. “I’m with the hottest girl in our graduating class, who also happens to be the sexiest woman I know. I remember promising myself ten years ago that I’d show up at this reunion bein’ the envy of all the other guys.”\u003c/p\u003e\n\u003cp\u003e“Did that fantasy include making all the girls in our class take notice of what a gorgeous hunk of man you turned out to be?”\u003c/p\u003e\n\u003cp\u003eTell grinned. “Busted.”\u003c/p\u003e\n\u003cp\u003e“Then it appears both wishes will come true, since I will be the envy of all the women.”\u003c/p\u003e\n\u003cp\u003e“And that would be different from high school for you…how? Didn’t everyone want to be you?”\u003c/p\u003e\n\u003cp\u003eShe didn’t crack a smile.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“That’s an ironic statement because I didn’t want to be me in high school.” She withheld a frustrated sigh. “Do you think that’s what tonight will be about? Just an exercise in our classmates going out of their way to prove how much they’ve changed?”\u003c/p\u003e\n\u003cp\u003e“Possibly.” He smoothed a piece of her flyaway hair back in place. “Isn’t that why we’re here?”\u003c/p\u003e\n\u003cp\u003e“Now that I am here, I’m wondering why I came. Can we just go? Out for dinner or something? I’ll buy.”\u003c/p\u003e\n\u003cp\u003e“No. But I promise we’ll leave if it sucks, okay?” He kissed her. “I like the coconut-flavored lip gloss.”\u003c/p\u003e\n\u003cp\u003eThe registration table was directly in front of one set of doors. And who was manning the table? Denille Swedlund. A fellow cheerleader. An easy piece for any of the jocks, anytime they wanted—a fact Denille used to brag about to Georgia, staring with disdain at her purity ring. Denille had offered Deck a hand job—a fact Georgia had found out from Denille herself after Deck had taken Denille up on the skanky proposition.\u003c/p\u003e\n\u003cp\u003eDenille looked good—but Denille wasn’t scoping her out at all. Her gaze stayed glued on Georgia’s date. “My God. Tell McKay, is that really you?”\u003c/p\u003e\n\u003cp\u003e“Yes indeed. Nice to see you, Denille, you haven’t changed a bit.”\u003c/p\u003e\n\u003cp\u003eDenille preened and handed over his badge. “The number on the bottom is the table you’ve been assigned.”\u003c/p\u003e\n\u003cp\u003eTell raised his eyebrows. “You’re kiddin’, right? About the assigned seating?”\u003c/p\u003e\n\u003cp\u003e“No. The committee thought it would be fun.”\u003c/p\u003e\n\u003cp\u003eThe other woman at the table, Nicki DeSoto, was also ogling Tell. “Hey, Tell, remember me?”\u003c/p\u003e\n\u003cp\u003e“Of course I do, Nicki. We had geometry together. So I’m guessing, since you were good at math, you’re an engineer or something?”\u003c/p\u003e\n\u003cp\u003eNicki laughed. “No. I’m married. Living in Lander.” She scooted her chair out and patted her rounded belly. “Our first baby is due in October.”\u003c/p\u003e\n\u003cp\u003e“Congratulations.”\u003c/p\u003e\n\u003cp\u003eDenille finally deigned to look at Georgia. She handed over the button and said coolly, “Georgia. You’re looking…well.”\u003c/p\u003e\n\u003cp\u003eGeorgia smiled. “You too. Do you still live in Sundance?”\u003c/p\u003e\n\u003cp\u003e“No. I live in Longmont, Colorado. I teach high school biology and I’m the head cheerleading coach.”\u003c/p\u003e\n\u003cp\u003eNo surprise Denille taught biology since she’d had so much previous experience with male anatomy. Ooh. Snap. And as long as she was being bitchy, the phrase you can always tell the head cheerleader by her dirty knees popped into her head, which allowed her to give her former nemesis a genuine smile. “That’s great, Denille.”\u003c/p\u003e\n\u003cp\u003e“We weren’t sure whether you were even gonna show up,” Denille said.\u003c/p\u003e\n\u003cp\u003e“Someone convinced me it was a good idea,” Georgia said, slightly nudging Tell.\u003c/p\u003e\n\u003cp\u003eTell plucked the button out of Georgia’s hand and murmured, “Hold still, sweetness,” pinning it above her left breast. Then he straightened it, letting his fingers brush over the swell of her cleavage with obvious familiarity. “There. Perfect.”\u003c/p\u003e\n\u003cp\u003eAnd perfectly sweet, his I’m with her display. “Thanks.”\u003c/p\u003e\n\u003cp\u003eHe draped his arm over her shoulder, said, “See you lovelies inside,” to Nicki and Denille, and led her into the mouth of the beast—aka the gymnasium.\u003c/p\u003e\n\u003cp\u003eGeorgia hadn’t realized she was holding her breath until Tell leaned over and whispered, “Come on, baby, breathe.”\u003c/p\u003e\n\u003cp\u003eA bar had been set up in the far back corner. He ordered a vodka tonic for her and a Bud Light for himself. Tell tapped his bottle to her plastic glass. “To makin’ our own rules tonight.”\u003c/p\u003e\n\u003cp\u003e“Good plan.”\u003c/p\u003e\n\u003cp\u003ePopular music from their senior year flowed from the speakers. They drank in silence, watching the action up by the makeshift stage—not that they could see much through the crowd. Georgia’s spine stiffened when she realized the crowd was gathered around Deck.\u003c/p\u003e\n\u003cp\u003e“You’ll spill all over your pretty dress if you keep crushing the glass.”\u003c/p\u003e\n\u003cp\u003eShe glanced down. The sides of the cup were dented in. God. Why was she hiding in the corner? It wasn’t fair to make Tell her babysitter because she didn’t want to see her ex-husband and his groupies.\u003c/p\u003e\n\u003cp\u003eLike it or not, she had to deal with Deck, and it might as well be on her terms, not his. She drained her drink and set the empty on the closest table. “Let’s get the bullshit out of the way.”\u003c/p\u003e\n\u003cp\u003e“Now?”\u003c/p\u003e\n\u003cp\u003e“Right now.”\u003c/p\u003e\n\u003cp\u003eTell grinned. “There’s my girl. Not a wallflower, just balls to the wall.” He drained his beer. Then he put his lips on hers. “Let’s go stir things up.”\u003c/p\u003e\n\u003cp\u003eOnce they reached the group, people began to recognize her and hugs were exchanged. She was on the receiving end of some dirty looks too. Tell laughed and joked with several guys, but he was never more than an arm’s length away from her.\u003c/p\u003e\n\u003cp\u003eNo one came right out and asked them about their relationship. Because it was obvious they were a romantic couple? Or because it was old news? She estimated more than a third of their graduating class still lived in the Sundance area and gossip was a way of life around here. And she and Tell had been all over the place in the last two weeks.\u003c/p\u003e\n\u003cp\u003eDeck was at the center of it all. Smitty said something in his ear, and Deck turned and looked at her.\u003c/p\u003e\n\u003cp\u003eGeorgia could admit Deck looked good. He hadn’t packed on a beer belly or spare tire like many of their male classmates. He hadn’t gone bald; he still had a head of wavy blond hair. His face showed more creases than the last time she’d seen him seven years ago. But he was still a handsome man.\u003c/p\u003e\n\u003cp\u003eHe seemed to be sizing her up. He kept his arms crossed over his chest and a scowl on his lips. She was grateful when Tell placed his hand on the small of her back, possessively sliding his fingers around the curve of her hip.\u003c/p\u003e\n\u003cp\u003e“Hello, Deck.” Thankfully her voice stayed friendly and not cold.\u003c/p\u003e\n\u003cp\u003e“Georgia. It’s been a while.”\u003c/p\u003e\n\u003cp\u003e“Yes, it has.”\u003c/p\u003e\n\u003cp\u003e“I was surprised to hear you’re living in Sundance now.”\u003c/p\u003e\n\u003cp\u003e“For about the last month.”\u003c/p\u003e\n\u003cp\u003e“Funny. You couldn’t wait to get the hell out of Wyoming and yet…here you are. Back again.”\u003c/p\u003e\n\u003cp\u003eShe shrugged.\u003c/p\u003e\n\u003cp\u003e“Robert said he talked to you last week.”\u003c/p\u003e\n\u003cp\u003e“It’d been a while since we’d spoken.”\u003c/p\u003e\n\u003cp\u003e“I know.” Deck rolled his shoulders back. “He said you ain’t gonna come see him.”\u003c/p\u003e\n\u003cp\u003e“I never said that.”\u003c/p\u003e\n\u003cp\u003e“That’s not what he said.”\u003c/p\u003e\n\u003cp\u003e“Well, I’m pretty sure he knows the road runs both ways.”\u003c/p\u003e\n\u003cp\u003eAll the talking around them had stopped as everyone listened in to their conversation.\u003c/p\u003e\n\u003cp\u003eDeck’s eyes scanned Tell head to toe. He didn’t offer his hand. “McKay.”\u003c/p\u003e\n\u003cp\u003e“Veldekamp.”\u003c/p\u003e\n\u003cp\u003eDeck pointed with his head to the woman next to him. “This is my wife Tara-Lee.”\u003c/p\u003e\n\u003cp\u003eTell said, “I remember Tara-Lee. You graduated a year behind us.”\u003c/p\u003e\n\u003cp\u003e“I didn’t look like this the last time you saw me.” She laughed and lovingly rubbed her hand over her contoured belly.\u003c/p\u003e\n\u003cp\u003eGeorgia didn’t acknowledge the woman at all. Too much risk of saying the last time I saw you, you were bouncing on my husband’s dick.\u003c/p\u003e\n\u003cp\u003eSam, one of Deck’s longtime buddies, started talking about some of the crazy stuff they’d gotten away with senior year. Georgia listened politely, not remembering those memories with such fondness.\u003c/p\u003e\n\u003cp\u003eWhen Deck’s friends started chiming in, talking about RJ, Tell discreetly pushed her to the edge of the group to make their escape. And he didn’t stop moving until they were hidden by the bleachers.\u003c/p\u003e\n\u003cp\u003eHe framed her face in his hands. “You all right?”\u003c/p\u003e\n\u003cp\u003e“Yes. I really am.”\u003c/p\u003e\n\u003cp\u003e“Good. Let’s fuck up Sally’s seating chart. I see my buddies are here. Or is there a group you’d rather sit with?”\u003c/p\u003e\n\u003cp\u003e“Just you. But we need to save a seat for Stephanie.”\u003c/p\u003e\n\u003cp\u003eThey shared a table with Thurman, Leah and Warner, Roxanne and Ned, and Stephanie, who’d brought Len Allen, the president of the chess club. Now the guy looked like he could be president of the steroid club.\u003c/p\u003e\n\u003cp\u003eLeah and Roxanne were surprisingly friendly, and had both her and Stephanie laughing at the stories about the hair and nail salon they co-owned. \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-26.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
