{"id":71522,"no":29,"title":"Page 29","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“A bare hand is a much better instrument than a paddle for spankings anyway.”\u003c/p\u003e\n\u003cp\u003e“An instrument of what? Pleasure? Or pain?”\u003c/p\u003e\n\u003cp\u003eTell smirked at her. “You’ll just have to wait and see which one you like better, won’t you?”\u003c/p\u003e\n\u003cp\u003eThe dancing was in full swing when they returned to the gym.\u003c/p\u003e\n\u003cp\u003e“What’s shaking, kids? Where you been?” Stephanie asked.\u003c/p\u003e\n\u003cp\u003e“We toured the school. You know, reliving old memories.” He grinned when Georgia smacked his knee under the table. “Why? What’d we miss?”\u003c/p\u003e\n\u003cp\u003e“A fucking limbo contest, if you can believe it,” Roxanne grumbled. “Who did the planning for this event? Chuck E. Cheese?”\u003c/p\u003e\n\u003cp\u003eGeorgia choked on her drink.\u003c/p\u003e\n\u003cp\u003e“No wonder no one wanted to help Sally. And can you believe she tried to assign us seats?”\u003c/p\u003e\n\u003cp\u003eStephanie leaned across the table. “I had a run-in with Sally. I told her if she pulled a bitch move and tried to get you and Deck to dance together as the class couple, I would make myself projectile barf all over her.”\u003c/p\u003e\n\u003cp\u003e“Thanks for having my back, Stephanie.”\u003c/p\u003e\n\u003cp\u003e“Always.”\u003c/p\u003e\n\u003cp\u003eThe dancing ended and Sally took the stage to hand out the decade awards.\u003c/p\u003e\n\u003cp\u003eAnd just like high school, the awards were stupid, dragged on way too long and were handed to the popular crowd. With the exception of Georgia. Her face was a blank mask so Tell had no idea what she was thinking.\u003c/p\u003e\n\u003cp\u003e“The award for most changed goes to…Tell McKay.”\u003c/p\u003e\n\u003cp\u003e“Christ. Really?” he muttered.\u003c/p\u003e\n\u003cp\u003e“Tell, you have to go up there,” Georgia said.\u003c/p\u003e\n\u003cp\u003eHe drained his beer before heading to the podium.\u003c/p\u003e\n\u003cp\u003eSally gave him a hug and the small trophy. He started toward the stairs, but someone yelled, “Speech!”\u003c/p\u003e\n\u003cp\u003eFuck. He hated talking in front of people. “I, ah, think everyone in this room deserves a trophy, because it’d be a sad freakin’ thing if we all stayed the same people we were in high school.” He walked off to meager applause.\u003c/p\u003e\n\u003cp\u003e“Now we look back on the classmates we lost.” The first picture on the screen behind the stage was of Matt Wilson, who’d died in combat in Iraq.\u003c/p\u003e\n\u003cp\u003eSally went on about all that Matt had accomplished before his death. She called Matt’s widow to the stage for a memorial plaque from the class.\u003c/p\u003e\n\u003cp\u003eThe second picture on the screen was of RJ Hotchkiss.\u003c/p\u003e\n\u003cp\u003eGeorgia tensed, but there wasn’t a perceptible change in her expression. When Tell noticed everyone in the room looked for her, he reached under the table and set his hand on her knee.\u003c/p\u003e\n\u003cp\u003eSally talked briefly about RJ, mostly about his life because his death wasn’t noble. Then she called Georgia to accept the memorial plaque.\u003c/p\u003e\n\u003cp\u003eShe didn’t budge.\u003c/p\u003e\n\u003cp\u003eTell squeezed her leg. “Georgia. You have to go up there.”\u003c/p\u003e\n\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“Yes, you can. Go on now. I’ll be right here when you’re done.”\u003c/p\u003e\n\u003cp\u003eGeorgia walked toward the stage like she was facing an executioner. She let Sally give her a stiff hug and she read the plaque before she glanced up at the crowd.\u003c/p\u003e\n\u003cp\u003e“It’ll be nine years on August third since I lost my twin brother, my best friend, the person who meant the most to me in the world. I know you all remember RJ as the guy with the perpetual smile. The guy who lived for a dare. The guy with a larger-than-life personality. I remember him as all those things too. But he was so much more. I miss him every day and I wish…” Georgia looked at the plaque, her hair falling forward to obscure her face.\u003c/p\u003e\n\u003cp\u003eWhen her shoulders started to shake and Sally made no move to comfort her like she had Matt Wilson’s widow, Tell was on his feet, his heart in his throat. He couldn’t stomach seeing her standing up there alone, forced into public grief.\u003c/p\u003e\n\u003cp\u003eHe scaled the steps, sidestepped Sally and stood in front of Georgia, blocking her from the room. “Georgia. Come on, sweetness, I gotcha.”\u003c/p\u003e\n\u003cp\u003eGeorgia peered up at him. “Please get me out of here.”\u003c/p\u003e\n\u003cp\u003eHe tucked her into the side of his body as they left the stage. Stephanie intercepted them with Georgia’s purse and they made their way out the door.\u003c/p\u003e\n\u003cp\u003eTell didn’t stop until he reached his pickup. He dropped the tailgate and lifted her into his arms. Then he sat, holding her tightly as her body shook.\u003c/p\u003e\n\u003cp\u003eHer voice was whisper-thin when she finally spoke. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Don’t be.” He kissed the top of her head. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eChapter Fifteen\u003c/p\u003e\n\u003cp\u003eShe’d cried. In front of a room full of people.\u003c/p\u003e\n\u003cp\u003eMost of them had probably been happy to see her break down. They probably thought she deserved misery in her life after leading such a supposedly charmed existence.\u003c/p\u003e\n\u003cp\u003eThe memory of RJ complaining he never won anything had hit her as she’d accepted the award. There was no irony in that, only sadness.\u003c/p\u003e\n\u003cp\u003eAnd then Tell had been there. Rescuing her. Going above and beyond. Showing her yet another facet of his personality—a protective side. She’d only scratched the surface in getting to know the man he’d become and she wanted so much more than the small glimpse she’d had the past two weeks.\u003c/p\u003e\n\u003cp\u003eBefore he started the truck, he said, “You okay?” and brought her hand to his mouth for a gentle kiss.\u003c/p\u003e\n\u003cp\u003e“Yes. Thank you for…” She cleared her throat. “It’s weird to think back on the awards they gave out senior year right before graduation. RJ was so bummed he hadn’t won class troublemaker.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t for lack of tryin’,” Tell muttered.\u003c/p\u003e\n\u003cp\u003eThe hair on the back of her neck prickled. “What is that supposed to mean?”\u003c/p\u003e\n\u003cp\u003eTell shifted in his seat.\u003c/p\u003e\n\u003cp\u003eWhat was up with his guilty look? “Something you wanna share with the class, Mr. McKay?”\u003c/p\u003e\n\u003cp\u003e“Not really, but I’m sure you won’t let it go now.”\u003c/p\u003e\n\u003cp\u003e“You’d be right about that, especially if it has something to do with my brother.”\u003c/p\u003e\n\u003cp\u003e“It does.” He ran his hand through his hair. “You know me’n RJ had shop together senior year? We were partnered during the sheet metal unit. RJ came up with the idea to make an animal trap. We worked on that sucker for a week and grumpy Mr. Krystanski gave us a D on it, citing a design flaw. So RJ decided we should prove Mr. K wrong by trapping an animal in our new, improved cage and showing him that it did work.”\u003c/p\u003e\n\u003cp\u003eGeorgia stared at him. “You and my brother were responsible for letting the skunks loose in the school?”\u003c/p\u003e\n\u003cp\u003e“That’s the thing. The mama skunk and her four babies were in the cage the night we snuck it into the classroom. So when we saw the cage was empty the next morning…we had no idea what’d happened. Mr. K never said a word and me’n RJ chalked it up to a failed prank…until a few days later—”\u003c/p\u003e\n\u003cp\u003e“When the entire school reeked like skunk.”\u003c/p\u003e\n\u003cp\u003e“Hey, we had no way of knowin’ the mama skunk had escaped and took her litter into the ductwork. By then, no way could we come clean, since they had to rip out the ceiling to free the skunk family and neither of us wanted to pay for the damage.”\u003c/p\u003e\n\u003cp\u003eShe smirked. “So Mr. K was right? Your trap had a design flaw since the skunks escaped?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Or someone let them loose. “\u003c/p\u003e\n\u003cp\u003e“And which one of you initially rounded up the skunks?”\u003c/p\u003e\n\u003cp\u003e“It was a joint effort after I told RJ I’d stumbled across a nest. The buggers are cute when they’re little. But the mama was pissed we were touchin’ them.”\u003c/p\u003e\n\u003cp\u003e“Did she spray you?”\u003c/p\u003e\n\u003cp\u003e“Both of us.”\u003c/p\u003e\n\u003cp\u003eGeorgia wrinkled her nose. “I don’t remember RJ coming home smelling like skunk.”\u003c/p\u003e\n\u003cp\u003e“That’s because we snuck into the showers at the truck stop and cleaned ourselves up. Hell, I think we even tossed our clothes.”\u003c/p\u003e\n\u003cp\u003e“No one ever knew?”\u003c/p\u003e\n\u003cp\u003e“Nope. Me’n RJ swore we’d take the secret to our graves.” Tell went motionless after he said that. “Shit. I’m sorry. I wasn’t thinkin’.”\u003c/p\u003e\n\u003cp\u003eShe leaned across the seat, bussing his cheek, feeling an odd kinship with him for the secret he’d shared with her brother. “It’s okay. I’m pretty sure RJ won’t mind that you told me.”\u003c/p\u003e\n\u003cp\u003eHe rested his forehead against hers. “You ready to go to my place?”\u003c/p\u003e\n\u003cp\u003e“As long as you have ice cream. Because I’m in the mood to eat ice cream and wallow in front of the TV.”\u003c/p\u003e\n\u003cp\u003eTell grinned. “I have such a bad sweet tooth that I have four different kinds of ice cream.”\u003c/p\u003e\n\u003cp\u003eThey didn’t speak on the drive to Tell’s trailer. When they started down the long driveway, Georgia realized she hadn’t brought other clothes. “You’ve got an extra T-shirt I can borrow?”\u003c/p\u003e\n\u003cp\u003e“Sure. But it’s gonna cost you.”\u003c/p\u003e\n\u003cp\u003e“Cost me what?”\u003c/p\u003e\n\u003cp\u003eHe didn’t respond until he’d parked. He faced her with a lascivious grin. “Two things are gonna happen if you borrow one of my shirts. One, you don’t get to wear a bra. Two, I can ask for my shirt back at any time.”\u003c/p\u003e\n\u003cp\u003e“Which means I’ll be naked.”\u003c/p\u003e\n\u003cp\u003e“I’ll let you leave them sexy panties on.” He smirked. “Unless they’re in my way and then they’re gone too.”\u003c/p\u003e\n\u003cp\u003e“Is this your way of distracting me?” she asked softly.\u003c/p\u003e\n\u003cp\u003eHe touched her face. “One of the ways I’ve got planned for tonight.”\u003c/p\u003e\n\u003cp\u003eShe bit back a girly sigh.\u003c/p\u003e\n\u003cp\u003eIt was stuffy inside. As Tell started opening windows, Georgia looked around. The space was as tidy as the last time she’d been here.\u003c/p\u003e\n\u003cp\u003e“It’ll cool down fast, but we might wanna sit outside until it does.”\u003c/p\u003e\n\u003cp\u003e“Do you want me to dish up the ice cream?”\u003c/p\u003e\n\u003cp\u003e“You’d better ditch that sexy dress first so you don’t spill on it. Hang tight. I’ll be back with something for you to wear.”\u003c/p\u003e\n\u003cp\u003eShe wandered to the kitchen and opened the cupboards, looking for bowls. Why did she have a pang of sadness at seeing his meager selection of dishware? He had five mismatched dinner plates, four mismatched salad plates and three mismatched bowls. The plastic bowls were adorned with characters from animated movies: Cars, Finding Nemo and Toy Story. The selection of glassware followed those same lines: four Tupperware plastic glasses from the 1980s, a few small, plastic Happy Meal cups, three beer mugs, two wineglasses and four coffee cups. \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-29.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
