{"id":71523,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWhat did it say about her that her cupboards looked like his? She’d left everything behind when she left Deck, except for one suitcase full of clothes and one box of personal items. When she got her own place, purchasing matching dishes and household items hadn’t mattered. Sort of pathetic that she’d never cooked for anyone in her condo in Dallas besides her mother.\u003c/p\u003e\n\u003cp\u003eAs busy as Tell’s social life was, it didn’t appear that extended to his home.\u003c/p\u003e\n\u003cp\u003eStrong arms hauled her back against a broad, hard chest. “Didja find anything interesting while you were snooping in my cupboards?”\u003c/p\u003e\n\u003cp\u003e“No. But I am wondering if I’ll have to fight you for the Toy Story bowl. Woody is my favorite.”\u003c/p\u003e\n\u003cp\u003e“I have a woody for you,” he breathed in her ear.\u003c/p\u003e\n\u003cp\u003eGeorgia faced him, noticing he’d changed into a tight black tank top and athletic shorts. “Your woody will have to wait. I’m fixated on ice cream right now.”\u003c/p\u003e\n\u003cp\u003e“Then I’d better get you outta this dress. Does it come off over your head? Or drop to the floor?”\u003c/p\u003e\n\u003cp\u003e“To the floor.”\u003c/p\u003e\n\u003cp\u003eTell slipped his fingers beneath the fabric above her cleavage and followed the neckline to her shoulders. He peeled it down her arms and tugged the dress over her breasts and hips until it pooled at her feet.\u003c/p\u003e\n\u003cp\u003eThen he unhooked her bra. But this time the tease wasn’t in how slowly he removed it, but what those clever fingers were doing to her nipples after her bra was gone.\u003c/p\u003e\n\u003cp\u003eShe stayed still, although the way he was touching her made it damn difficult.\u003c/p\u003e\n\u003cp\u003eHe murmured, “Hands up.”\u003c/p\u003e\n\u003cp\u003eA super soft, super large T-shirt dropped over her head. The hem grazed her knee. “I could wear this as a dress. Except for this part.” The deep V-cut of the neckline would reveal both her breasts if she bent over.\u003c/p\u003e\n\u003cp\u003e“I happen to like that aspect of the design.” Tell pulled the fabric to the left, exposing the hardened nipple. He bent his head, pressing a soft kiss on the tip, before he straightened the shirt. “You’re distracting me, woman. I’m supposed to be givin’ you ice cream choices.” He retreated to the freezer. “Looks like…rocky road, butterscotch ripple, cookie dough or chocolate and caramel swirl.”\u003c/p\u003e\n\u003cp\u003e“A scoop of chocolate and caramel swirl and a scoop of rocky road, please.”\u003c/p\u003e\n\u003cp\u003eTell dished up two identical bowls and handed her one with a spoon. “You wanna sit outside on the back deck? It’s a beautiful night.”\u003c/p\u003e\n\u003cp\u003e“I’d love to.”\u003c/p\u003e\n\u003cp\u003eThey sat at a small wooden picnic table. It was too dark to see the view beyond the fence line, but she remembered the McKay Ranch had diverse vistas. “How long have you lived here?”\u003c/p\u003e\n\u003cp\u003e“A little over a year. This used to be Brandt and Jessie’s place. Before that I lived in Luke’s old place. Before that Dalton and I shared a crappy trailer. Now he’s livin’ in Luke’s trailer.”\u003c/p\u003e\n\u003cp\u003e“Sounds like your family plays musical houses?”\u003c/p\u003e\n\u003cp\u003e“Death, divorce and discontent sorta forces it. I think we’re all kinda lazy because we like where the houses are located. Close, but not too close.”\u003c/p\u003e\n\u003cp\u003eGeorgia let the last bite of chocolate and caramel swirl melt on her tongue. “Do any of you get along with your dad?”\u003c/p\u003e\n\u003cp\u003e“Some days we all do. But they’re few and far between. I never expected his sobriety would stick. I’m glad it has, because he was killin’ himself. But the really sobering part for all of us? It wasn’t the alcohol that made him a mean, grumpy jackass. Take away the booze? He’s still a mean, grumpy jackass.”\u003c/p\u003e\n\u003cp\u003eShe threaded her fingers through his.\u003c/p\u003e\n\u003cp\u003eSurprisingly, Tell kept talking. “There are times when I wish he’d just go on a mission trip indefinitely. When he’s not around, I feel guilty as hell for thinkin’ that, then he shows up, still actin’ like the same SOB he always was, minus the blackout-drunk moments. Ever since I was a little kid, the man terrified me. He did all of us. We were all afraid of doin’ something wrong to earn one of them ass-chewings that strip you down to nothin’. Might sound stupid, but after he got done rippin’ into me, I wished he’d taken after me with a switch. At least them marks would heal. The lash of his tongue always hurt far more than a belt.”\u003c/p\u003e\n\u003cp\u003eThis was the most he’d ever spoken to her of the issues he had with his father. And her heart hurt for him. It got her to thinking… Was a mean father worse than one who preferred a stranger to his own child?\u003c/p\u003e\n\u003cp\u003eTell shoved his bowl aside. “Do Deck and Tara-Lee live with your dad?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Deck and I lived with my parents until RJ died. When Dad bought the hog farm, we had a small cabin to ourselves on the property. Deck didn’t like it because it was pretty basic, so he stayed in the house. And I didn’t like being in the house with my parents because they fought all the time, so I slept at the cabin. Because Tara-Lee and RJ were supposed to get married that fall, Tara-Lee had already moved in with my folks, so they let her come with us to the new place. I was still in grief, still trying to take college classes. I’ll admit I wasn’t the most attentive wife.”\u003c/p\u003e\n\u003cp\u003e“That didn’t give Deck the right to cheat on you,” Tell said hotly. “For Christsake, you’d lost your brother, you were forced to move, your parents split up. He shoulda been takin’ care of you.”\u003c/p\u003e\n\u003cp\u003e“Thanks. Evidently my dad didn’t see it that way since he took Deck’s side. When I talked to him last week, he basically defended his actions and Deck’s by telling me nothing is as cut and dried as it looks. He doesn’t understand why I don’t just drive over to his place and we can hug it out.”\u003c/p\u003e\n\u003cp\u003eNeither said anything for a few minutes.\u003c/p\u003e\n\u003cp\u003eThen Tell stood and held out his hand. “I wanna show you something.”\u003c/p\u003e\n\u003cp\u003e“Is this more of your forced fun?”\u003c/p\u003e\n\u003cp\u003e“Yep and there’s gonna come a day when you don’t dread that word, sweetness.”\u003c/p\u003e\n\u003cp\u003eGeorgia allowed him to lead her down the steps and around the corner of the trailer. A two-person hammock was set up on the rise of a small hill. The ground was rocky and rough—no soft, pampered grass here—and she sucked in a breath when something jabbed the bottom of her foot.\u003c/p\u003e\n\u003cp\u003eTell lifted her into his arms, carrying her the rest of the way.\u003c/p\u003e\n\u003cp\u003eAs much as she liked being held against his warm, hard chest, she couldn’t help but snicker. “Is this where you call me a tenderfoot?”\u003c/p\u003e\n\u003cp\u003eHe grunted with exaggeration. “I’m stoically bearing the pain for you, little lady, ’cause that’s what us cowboy types do.” He set her down and stretched on the hammock before extending a hand to her.\u003c/p\u003e\n\u003cp\u003eIt wobbled, but she found a balance point, which placed her right on top of Tell, luckily for her.\u003c/p\u003e\n\u003cp\u003eShe sighed. “It’s the perfect temperature.”\u003c/p\u003e\n\u003cp\u003e“I crash out here in the summer when it’s too hot to sleep inside.”\u003c/p\u003e\n\u003cp\u003e“Don’t you get eaten alive by bugs?”\u003c/p\u003e\n\u003cp\u003e“Nah. I must not be sweet enough.”\u003c/p\u003e\n\u003cp\u003e“I think you’re plenty sweet.” She kissed his pectoral and snuggled into his side.\u003c/p\u003e\n\u003cp\u003eTell shifted to tangle their legs together.\u003c/p\u003e\n\u003cp\u003eAll the turmoil from the last few hours faded, and a feeling of contentment filled her as he trailed his rough fingertips over her skin.\u003c/p\u003e\n\u003cp\u003eAfter a bit, Tell said, “So what’s the craziest, riskiest thing you’ve ever done?”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003e“Come on, there’s gotta be something.”\u003c/p\u003e\n\u003cp\u003e“I’ve always done what was expected of me. Either by my parents or by my boss.” Rather than dissect her boring choices, she posed the same question to him. “What’s the craziest, riskiest thing you’ve ever done, wild man McKay?”\u003c/p\u003e\n\u003cp\u003eHe continued stroking the underside of her arm from her wrist to her armpit. “I was tired of bein’ the poor McKay relation. So I took all my money, except for fifty bucks, and entered a poker tournament. I was either gonna go big or go home broke.”\u003c/p\u003e\n\u003cp\u003e“So what happened?”\u003c/p\u003e\n\u003cp\u003e“It paid off. I won first place. So I banked half of what I’d won, and used the other half to enter another tournament the next weekend.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003eTell chuckled. “I had a winning streak that lasted an entire year. Made a really good chunk of change. Dalton was my partner in crime, so to speak, so we won enough to buy more land to add to our part of the McKay ranch.”\u003c/p\u003e\n\u003cp\u003eGeorgia raised her head from his chest and looked at him. “Good for you. But now that you’ve told me, a game of strip poker ain’t in the cards for us.”\u003c/p\u003e\n\u003cp\u003e“You’d win. I’d get you half-nekkid and I’d start thinkin’ raunchy thoughts…”\u003c/p\u003e\n\u003cp\u003eShe smiled. “I like your raunchy mind.”\u003c/p\u003e\n\u003cp\u003e“And sweetness, you ain’t seen the raunchiest parts.” He nipped the top of her ear. “Yet.”\u003c/p\u003e\n\u003cp\u003e“Are you still sandbagging tournaments?”\u003c/p\u003e\n\u003cp\u003e“Once in a while. Dalton is still goin’ strong. That runner’s high after winnin’ big is dangerous stuff. But it ain’t like he’s blowing money left and right. We are each other’s checks and balances system, so it didn’t happen to either of us, because we saw so many guys who fell prey to that mindset. Always wanting that next big win. Quarter of a million dollars one week; then they’d lose it all the following week. We treated gambling like a business. Only playing one type of game. Only entering events where the buy-in was high because the payout was high.”\u003c/p\u003e\n\u003cp\u003eShe stared at him, fascinated again by another facet of this man. “I’ve never heard you talk about this.”\u003c/p\u003e\n\u003cp\u003e“That’s because me’n Dalton keep it to ourselves. Brandt knows we won some money because he’s on the land deed. Our cousin Ben knows because we tried to do a business deal with him a year and a half ago, but it fell through. But no one in my family knows and that’s the way we wanna keep it.”\u003c/p\u003e\n\u003cp\u003e“I won’t breathe a word, I promise.” She sighed. “I’m boring compared to you. You have this secret life and—”\u003c/p\u003e\n\u003cp\u003eTell stopped her protest with a kiss. \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-30.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
