{"id":71524,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAfter he released her mouth, she rested the side of her face on his chest. He nuzzled the top of her head and continued his caresses on her arm.\u003c/p\u003e\n\u003cp\u003eA soft breeze blew. Between the sway of the hammock, the comforting beat of Tell’s heart beneath her ear, and the chirping crickets, Georgia could’ve easily fallen asleep. Being with him like this settled every ragged nerve inside her.\u003c/p\u003e\n\u003cp\u003e“You up for more ice cream?” he murmured a little while later. “Because one bowl doesn’t count as wallowing.”\u003c/p\u003e\n\u003cp\u003e“Sure. But I am pretty comfy right now.”\u003c/p\u003e\n\u003cp\u003e“I could tell, bein’s you were snoring.”\u003c/p\u003e\n\u003cp\u003e“Maybe I did doze off. But I’m blaming you. You’re so easy to be with.”\u003c/p\u003e\n\u003cp\u003e“I don’t know whether I oughta take that as a compliment or not,” he grumbled.\u003c/p\u003e\n\u003cp\u003eGeorgia pecked his pouting lips. “Fine. I’ll eat another bowl of ice cream if it’ll make you happy. How do we get out of this contraption?”\u003c/p\u003e\n\u003cp\u003e“Straddle me.”\u003c/p\u003e\n\u003cp\u003eShe sighed. “Nice try, Mr. Insatiable.”\u003c/p\u003e\n\u003cp\u003eHe grinned and lightly tapped her ass. “I’m serious. You bein’ on my center of gravity will stabilize us.”\u003c/p\u003e\n\u003cp\u003e“Okay. But if I feel your dick get hard, I can’t be held accountable for attacking you.” She balanced one hand on his shoulder and threw her other leg over his pelvis.\u003c/p\u003e\n\u003cp\u003e“Too late. I’m always hard around you. Hang on.” Gripping her hips, Tell twisted and the hammock swung upward as he dropped both feet to the ground. Then he stood, sliding his hands down to cup her ass as he carried her into the house.\u003c/p\u003e\n\u003cp\u003e“You don’t have to carry me everywhere,” she said halfheartedly.\u003c/p\u003e\n\u003cp\u003e“I like it. You’re pocket-size.” He laughed when she drummed her heels into his butt. “Besides, you ain’t wearin’ pants. It’s the least I could do.”\u003c/p\u003e\n\u003cp\u003eTell set her on a kitchen chair. Looking at him now, she understood Mr. Sweet and Funny had taken a powder, leaving Mr. Intense in charge.\u003c/p\u003e\n\u003cp\u003e“I’m gonna want that shirt back now.”\u003c/p\u003e\n\u003cp\u003eHer heart rate sped up and a tingle of anticipation rolled through her.\u003c/p\u003e\n\u003cp\u003e“Also, I don’t want you dripping ice cream on your panties, so you’d better take them off too.”\u003c/p\u003e\n\u003cp\u003eOnce she stood naked before him, he offered a wolfish grin. “I’ll be feeding you. My way. If you don’t stay still, well, darlin’, I’m gonna be forced to tie you up.”\u003c/p\u003e\n\u003cp\u003eHer midsection went hot and tight. And wet, a little further south.\u003c/p\u003e\n\u003cp\u003e“Understood?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“Good. Now sit in the chair so I can reach all parts of you while I dish up.”\u003c/p\u003e\n\u003cp\u003eWhat the heck did he mean so I can reach all parts of you? Georgia slid her naked, flabby ass to the edge of the seat. But being short, it put her head and her neck at a weird angle. She’d been so busy trying to get herself situated that she hadn’t noticed Tell stood not two feet away, holding a bowl.\u003c/p\u003e\n\u003cp\u003eHe frowned. “That ain’t gonna work. Hop up on the table.”\u003c/p\u003e\n\u003cp\u003eAlthough it was still warm in the house, the table surface was cool on her butt. Her legs dangled over the edge and she braced her hands behind her.\u003c/p\u003e\n\u003cp\u003eWhen she saw the flour sack dishtowel in Tell’s hand, she said, “What’s that for?” with just a little trepidation.\u003c/p\u003e\n\u003cp\u003e“To keep your arms outta my way. ’Cause I have the feeling this is gonna make you a little jumpy.”\u003c/p\u003e\n\u003cp\u003eGeorgia didn’t fidget as he bound her, but her body was hyperaware of his. Then he ran his fingertips up the outside of her arms, over her shoulders, stopping to cup her face in his hands.\u003c/p\u003e\n\u003cp\u003e“Ready for your ice cream?”\u003c/p\u003e\n\u003cp\u003e“Umm. Yeah.”\u003c/p\u003e\n\u003cp\u003e“Open up.”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes after he spooned in the first bite of butterscotch ripple. The creamy goodness slid down her throat.\u003c/p\u003e\n\u003cp\u003e“Huh-uh. Eyes on me.”\u003c/p\u003e\n\u003cp\u003eShe gazed at him as he slipped the spoon into her mouth. As soon as she swallowed, Tell’s lips were on hers; his tongue was diving into her mouth. The shock of his warm tongue against her cold one, the sweet taste of the ice cream and the familiar taste of Tell had her moaning. She wanted to curl her hand around the back of his neck, holding him in place as she lapped up every bit of this new taste combo, but her hands were out of commission. So when Tell broke the kiss, she whimpered.\u003c/p\u003e\n\u003cp\u003e“Take another bite before it melts.” He fed her three bites, hungrily watching her mouth as she licked her lips. After the next spoonful, he kissed her again. Talk about melting. Hot and cold. Sweet and intense.\u003c/p\u003e\n\u003cp\u003eKeeping his lust-filled blue eyes on hers, he held the spoon at chin level. He tipped the spoon to the side and ice cream dribbled on her breast, sliding down the center of her chest.\u003c/p\u003e\n\u003cp\u003eShe gasped.\u003c/p\u003e\n\u003cp\u003e“Oops. Looks like I’ll be havin’ a taste too.” His tongue started at the bottom of the drip and he slowly licked up, savoring her ice-cream-flavored skin.\u003c/p\u003e\n\u003cp\u003eWith the way Tell stood between her thighs, he had to know how wet this was making her.\u003c/p\u003e\n\u003cp\u003eThe next pass, he used the end of the spoon to paint her lips with ice cream. Then he licked and nibbled, teasing her endlessly with mouth-on-mouth action, but denying her a full-blown kiss.\u003c/p\u003e\n\u003cp\u003eTalk about erotic. He’d feed her a bite. Then he’d hold the spoon just out of her reach and angle it, so the thick droplets never landed in the same place on her body twice. And only once on her nipple.\u003c/p\u003e\n\u003cp\u003eBut he cleaned off every last speck of melted ice cream. Suckling to the point that she started to shake. Inside. Outside.\u003c/p\u003e\n\u003cp\u003eGeorgia was damn close to begging.\u003c/p\u003e\n\u003cp\u003eAnd he knew it.\u003c/p\u003e\n\u003cp\u003eThen he hooked his foot around the chair, bringing it to the table, sitting so close her crotch was right in his face.\u003c/p\u003e\n\u003cp\u003eHer entire body flushed at the intense way he stared at the most intimate part of her.\u003c/p\u003e\n\u003cp\u003e“Goddamn, you look so pretty like this.” He traced her slit from the top of her pubic bone down to her entrance. “Judging by how wet you are, you must really like ice cream.”\u003c/p\u003e\n\u003cp\u003e“Tell. Please.”\u003c/p\u003e\n\u003cp\u003eHe looked up at her, desire burning in his eyes. “Oh. Sorry. I’m bein’ selfish. Did you want another bite?”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“Then you don’t mind if I finish it off?”\u003c/p\u003e\n\u003cp\u003eDear God. She would not survive this. Would. Not. Survive.\u003c/p\u003e\n\u003cp\u003eGeorgia was helpless to do anything but watch as Tell used one hand to pull back the skin surrounding her clit. Then he took the spoon out of the ice cream dish and placed the cold metal directly on that swollen flesh.\u003c/p\u003e\n\u003cp\u003eHer body jerked and she yelled, “Sweet Jesus, that’s cold!”\u003c/p\u003e\n\u003cp\u003e“Really? Huh. Imagine that. Lemme warm it up for you.” He removed the spoon and placed his mouth over the spot.\u003c/p\u003e\n\u003cp\u003eHis hot, wet, sucking mouth.\u003c/p\u003e\n\u003cp\u003eBut he only sucked briefly. He switched it up and licked her pussy as if he were eating an ice cream cone. One long lap after another. Then he nuzzled the inside of her thigh…and again reached for the spoon.\u003c/p\u003e\n\u003cp\u003e“Oh. No.”\u003c/p\u003e\n\u003cp\u003e“Oh. Yes. ’Cause you don’t know how much I love me some sweet, sticky cream.” Tell coated the back of the spoon with more melted butterscotch swirl. Except this time, he squeezed her nipple as he placed the spoon on her clit.\u003c/p\u003e\n\u003cp\u003eGeorgia bowed back as if he’d attached jumper cables to her body. Every pulse point screamed for release. Even her toes were twitchy. Her mind was focused on one thing: must come.\u003c/p\u003e\n\u003cp\u003eTell left the spoon in place, rubbing the curve over the sensitive nub until the metal warmed from her body heat.\u003c/p\u003e\n\u003cp\u003eThis was torture.\u003c/p\u003e\n\u003cp\u003e“Georgia. Look at me.”\u003c/p\u003e\n\u003cp\u003eHer gaze winged to his. He exposed her swollen clitoris. He lowered the spoon, tilting it so the drop of ice cream landed right on her clit.\u003c/p\u003e\n\u003cp\u003eThis time, she screamed. One more drop and she’d explode.\u003c/p\u003e\n\u003cp\u003eAnd like he’d read her mind, he poised the spoon higher above her sex. When he tipped it, the droplet hung in the air, falling in slow motion. When that icy drop connected with her hot button, she started to come.\u003c/p\u003e\n\u003cp\u003eThen Tell’s hot mouth was there, sucking on her ice-cream-cooled clit. Tonguing her through an orgasm of epic proportions. When the powerful climax ended, she floated down to the table like a butterfly.\u003c/p\u003e\n\u003cp\u003eHer butterfly haze didn’t last long.\u003c/p\u003e\n\u003cp\u003eTell pulled her up by her shoulders and put his mouth on her ear. “I need to fuck you, Georgia. Given how hard I am, it’s gonna be short.\u003c/p\u003e\n\u003cp\u003eBut not sweet.\u003c/p\u003e\n\u003cp\u003eHe flipped her over on her belly. Something soft and nubby kept her hips from digging into the edge of the table. With her hands bound and her feet unable to touch the floor, Georgia was completely at Tell’s mercy.\u003c/p\u003e\n\u003cp\u003eCallused hands lifted her butt higher. Then the head of his cock nudged her wet center and he snapped his hips, driving into her at full throttle. “Come for me again.”\u003c/p\u003e\n\u003cp\u003e“I can’t. The last one—”\u003c/p\u003e\n\u003cp\u003e“I can feel it, baby, it’s right there.”\u003c/p\u003e\n\u003cp\u003eHe bottomed out on his next thrust and she almost lost her mind. He fucked her so hard the table moved. He fucked her so hard each fast stroke was like a mini-orgasm—the head of his cock scraped her G-spot and then immediately connected with her cervix, making her pussy muscles repeatedly spasm around his thick shaft.\u003c/p\u003e\n\u003cp\u003eOn the next plunge, Tell roared his release. The frantic pumping of his hips slowed and stopped, although he maintained a firm grip on the outside of her thighs, as if he needed something solid to hold him up.\u003c/p\u003e\n\u003cp\u003eGeorgia felt the hard wall of his chest and stomach when he layered his body over hers.\u003c/p\u003e\n\u003cp\u003eHis breathing was ragged. His body shook. Heady stuff that she affected this man this way.\u003c/p\u003e\n\u003cp\u003e“Baby. You… Wow. That…” He laughed softly. “There are no words for what that was.”\u003c/p\u003e\n\u003cp\u003eSuch a sweet, hot man. She turned her head and kissed the corner of his mouth. “For me too. But cowboy, I think my arms are numb.”\u003c/p\u003e\n\u003cp\u003e“Shit. Sorry.” He stood and pulled out slowly. When he tried to set her on her feet, her knees buckled.\u003c/p\u003e\n\u003cp\u003e“Whoa, darlin’. Hang on. I gotcha.” Tell swept her into his arms and headed to his bedroom.\u003c/p\u003e\n\u003cp\u003eShe rested her face against his neck, still happily muddled from the hour-long—or so it seemed—orgasm. He held her closely against his strong body. She felt his erratic pulse beneath her lips and tasted the salt on his skin. Everything about him was so devastatingly masculine. \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-31.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
