{"id":71527,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eGeorgia shared the edited version of her life, finishing with, “It’s strange to be back. We had our ten-year high school reunion Saturday night.”\u003c/p\u003e\n\u003cp\u003e“My husband is a deputy. He was disappointed the police didn’t get called to the gym to break up any fights.”\u003c/p\u003e\n\u003cp\u003e“Who is your husband?”\u003c/p\u003e\n\u003cp\u003e“Cam McKay.”\u003c/p\u003e\n\u003cp\u003eDidn’t it just figure? Another McKay. “Tell was my date to the reunion.”\u003c/p\u003e\n\u003cp\u003eDomini pointed at her. “Aha! You’re the one they were talking about. The beautiful woman from Tell’s past.”\u003c/p\u003e\n\u003cp\u003eShe muttered, “We didn’t have a past.”\u003c/p\u003e\n\u003cp\u003e“Maybe that’s the problem? Tell’s definitely got a past now, with his love ‘em and leave ‘em reputation. So watch your step with him. Now that I’ve done my duty in warning you—” Domini gestured to the pile of papers, “—what are you selling?”\u003c/p\u003e\n\u003cp\u003e“Ads for the Devil’s Tower Rodeo program guide.” Georgia grinned. “Wanna buy one or ten? All the other restaurants in town have bought space.”\u003c/p\u003e\n\u003cp\u003eDomini rubbed her hands together. “Absolutely. Can’t let our competition get the jump on us. What are the options?”\u003c/p\u003e\n\u003cp\u003eWhen Georgia hesitated, Domini said, “My sister-in-law Macie McKay owns this restaurant, so I do have the authority to make these decisions. But you can call her directly if you prefer.”\u003c/p\u003e\n\u003cp\u003e“No. That’s okay. It’s just… I thought the McKays were ranchers.”\u003c/p\u003e\n\u003cp\u003e“Most are. But one McKay spouse or another owns each of the businesses on this side of the block. And Keely’s husband Jack owns the whole building. But that is a good thing because you’re involved with Tell. They should all be easy sales for you.”\u003c/p\u003e\n\u003cp\u003eBefore Georgia could assure her she’d never use Tell that way, Domini gave her a shrewd look. “I’ll make you a deal. If I buy ad space, will you help me out? The community center is hosting a heritage festival Thursday night. In addition to the ethnic food, I planned on teaching the kids how to count to ten in Ukrainian. If you came, you could teach them to count in Russian. It’d only be for two hours.”\u003c/p\u003e\n\u003cp\u003eHer knee-jerk reaction was to say no. But it’d be good for business if she showed a presence at and an interest in community events. “I don’t have to wear a costume or anything?”\u003c/p\u003e\n\u003cp\u003eDomini laughed. “No kokoshnik. I promise.”\u003c/p\u003e\n\u003cp\u003e“Well, since you’re not insisting I wear one of those weird Russian headdresses my mother tried to foist on me… I’ll do it.”\u003c/p\u003e\n\u003cp\u003eBy the time seven o’clock rolled around, Georgia had taken a break from the task lists Barbara had e-mailed and had poured herself a glass of white wine. She curled up on the porch swing, soaking in the last golden rays of sunlight. When her phone rang, she had the tiny hope it was Tell. But it was her mother. “Hey, Mom.”\u003c/p\u003e\n\u003cp\u003e“Moyah krasivaya doch.”\u003c/p\u003e\n\u003cp\u003eHer mother always called her my beautiful daughter.\u003c/p\u003e\n\u003cp\u003e“I haven’t heard from you. How was the reunion?”\u003c/p\u003e\n\u003cp\u003e“Meh. It was sort of fun to see everyone, with the exception of Deck and Tara-Lee.” She pushed off the railing, setting the swing in motion.\u003c/p\u003e\n\u003cp\u003e“No issues with Deck?”\u003c/p\u003e\n\u003cp\u003e“He cornered me. But it got handled.” Georgia sipped her wine. “The worst part of the night was when they did the memorial tribute to RJ.”\u003c/p\u003e\n\u003cp\u003eHer mother was very quiet. “Have you been…?”\u003c/p\u003e\n\u003cp\u003e“No. Not yet. I’ll go. I promise.”\u003c/p\u003e\n\u003cp\u003e“I know you will. You’re a good daughter and a good sister.” She laughed softly. “I had a weird flashback the other day. A coworker’s daughter is getting her tonsils taken out, and I remembered when you had your tonsillectomy. When they finally brought you back to your room, RJ wouldn’t leave your side. He just crawled right into your bed with you and announced he was staying there all night because he didn’t want you to be scared.” She sniffled. “The little sneak had packed his backpack with a flashlight, your favorite stuffed animals and a bag of marshmallows because they’d be soft enough for you to eat.”\u003c/p\u003e\n\u003cp\u003eGeorgia closed her eyes against the grief that could still slice her to the bone. For all his wild ways, RJ had always been so sweet and protective of her. He’d brought the flashlight so they could cuddle up under the covers and read his comic book stash, trying to convince her that being in the hospital was just like camping out, so she wouldn’t be afraid. “I’d forgotten about that. I do remember that RJ convinced the nurses we had to have ice cream every hour. “\u003c/p\u003e\n\u003cp\u003e“My boy did inherit his father’s knack for using charm to get what he wanted.” She cleared her throat. “Speaking of… What did your father have to say when he called you?”\u003c/p\u003e\n\u003cp\u003eGeorgia frowned. “He called you after he talked to me, didn’t he?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“How often does he call you?”\u003c/p\u003e\n\u003cp\u003e“Every couple of months. Usually after he’s been drinking. That’s the only time he can open up.”\u003c/p\u003e\n\u003cp\u003e“Mom. You don’t have to—”\u003c/p\u003e\n\u003cp\u003e“It’s fine. I can handle Robert. So anyway… How is work?”\u003c/p\u003e\n\u003cp\u003e“All right. You know how much I dislike cold-call ad selling, which is probably why Barbara is making me do it. So far I haven’t run into any businesses that were screwed by the promotion company we took over.”\u003c/p\u003e\n\u003cp\u003e“And it’s okay? Being back in Wyoming?”\u003c/p\u003e\n\u003cp\u003e“I guess. I just keep telling myself it’s temporary.”\u003c/p\u003e\n\u003cp\u003e“I might drive up to see you.”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes. “I’d like that.”\u003c/p\u003e\n\u003cp\u003eThey talked for ten more minutes, firming up the date for her mother’s visit. After she hung up, Georgia had a melancholy feeling she couldn’t shake. After spending the last two weeks with Tell, it’d hit her tonight, how alone she was in her life. Physically distant from her mother. Estranged from her father. If she was honest, her friends in Dallas were her coworkers and she wasn’t close to any of them. She didn’t know her neighbors in the gated community where she rented her condo. She went to the movies alone. She ate dinner by herself in front of the TV most evenings. She occasionally went out on a date. Most men weren’t what she expected and certainly not what she wanted.\u003c/p\u003e\n\u003cp\u003eDefinitely none were as fun, funny, insightful and sexy as Tell McKay.\u003c/p\u003e\n\u003cp\u003eIt’d been one day and she missed him.\u003c/p\u003e\n\u003cp\u003eLooked to be a long week.\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003eGeorgia hadn’t called him Monday. Not that he’d expected it. He’d spent way too much time thinking about her, weighing Ben’s advice against his gut instinct of driving to her house and kissing her stupid as a conversation starter. But he held off. Going a couple days without contact wouldn’t hurt either of them. He told himself that, yet he couldn’t figure out why he was on edge with an odd feeling of gloom until he realized it was because he missed her.\u003c/p\u003e\n\u003cp\u003eSo when Tell’s phone rang on Tuesday afternoon, he was disappointed it wasn’t Georgia’s number on the caller ID.\u003c/p\u003e\n\u003cp\u003e“Hey, Mom, what’s up?”\u003c/p\u003e\n\u003cp\u003e“Samantha has a last-minute overnight seminar in Riverton. I already promised Bart I’d go to the VA in Cheyenne with him for his outpatient surgery, and I can’t bring Landon along.”\u003c/p\u003e\n\u003cp\u003eNo Hi, son, how are you? No What’s new in your world? She cut straight to the chase; no pleasantries. Just like his father did. “So you’re callin’ because you need me to baby-sit Landon again.”\u003c/p\u003e\n\u003cp\u003e“Yes. I know it’s last minute, but I have no choice.”\u003c/p\u003e\n\u003cp\u003eBut I do. “I’m guessing you expect me to drop everything right now and drive to Casper? I’m sorry. I can’t.”\u003c/p\u003e\n\u003cp\u003eHer silence felt accusatory and Tell almost caved in.\u003c/p\u003e\n\u003cp\u003e“What’s going on with you?” she demanded. “You never—”\u003c/p\u003e\n\u003cp\u003e“Say no?” Tell paced to the window. “I have plans tonight.” No point in wishing he’d told his mother no last week when he’d cancelled a date with Georgia, but he could change the parameters from here on out. “Did you ask Dalton or Brandt if they could help?”\u003c/p\u003e\n\u003cp\u003e“Brandt and Jessie have their hands full right now, doncha think?”\u003c/p\u003e\n\u003cp\u003e“Yep. But I’m plenty busy myself picking up the slack around the ranch since Brandt is embracing fatherhood.”\u003c/p\u003e\n\u003cp\u003e“What’s going on at the ranch isn’t my concern,” she said with a sniff.\u003c/p\u003e\n\u003cp\u003e“That’s because Landon had been your only concern the past few years.” Just like Luke was always your number one priority.\u003c/p\u003e\n\u003cp\u003eChildish, probably, but accurate, and not the first time he’d had that thought. But it was the first time he’d voiced it to her.\u003c/p\u003e\n\u003cp\u003e“Tell McKay. That’s not true. I thought you liked taking care of Landon.”\u003c/p\u003e\n\u003cp\u003e“I do. I love the kid. But I hate that the only time I see him is when I’m the last resort for childcare. How long before Landon will resent getting shuttled off to his bachelor uncle’s at the last minute?”\u003c/p\u003e\n\u003cp\u003e“Now you’re just being ridiculous.”\u003c/p\u003e\n\u003cp\u003e“That’s me. Silly Tell, flitting around like a damn butterfly without a care in the world.”\u003c/p\u003e\n\u003cp\u003eA long pause. “Son. Have you been drinking?”\u003c/p\u003e\n\u003cp\u003eHe forced a laugh. “Look, Mom, I gotta go. I’ll talk to you soon, okay?”\u003c/p\u003e\n\u003cp\u003e“You’re really saying no?”\u003c/p\u003e\n\u003cp\u003e“Yep, I really am. Bye.” He hung up. And it felt good.\u003c/p\u003e\n\u003cp\u003eAn hour later Tell was thinking about a prime rib sandwich as he got ready for dart league, when he heard someone at his door. Doubtful it was his sweet woman, but he kept a goofy smile in place just in case as he snapped the last pearl button on his short-sleeved shirt and answered the door.\u003c/p\u003e\n\u003cp\u003eBut his brother Brandt stood on the front porch.\u003c/p\u003e\n\u003cp\u003e“Hey, bro. Is everything all right?”\u003c/p\u003e\n\u003cp\u003e“Not according to Mom.” Brandt bulled his way inside.\u003c/p\u003e\n\u003cp\u003e“Mom called you?”\u003c/p\u003e\n\u003cp\u003e“Yep. She thought you were drunk or high or some damn thing, so she sent me to check on you.” Brandt squinted at him. “Are you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-34.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
