{"id":71536,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAfter the ninth hole out of eighteen, Georgia realized why she never played mini golf: because she sucked at it.\u003c/p\u003e\n\u003cp\u003eShe sighed and smacked the crap out of her stupid pink ball, and it bounced out of the stupid maze into the stupid grass.\u003c/p\u003e\n\u003cp\u003e“Ah, sweetness? That was your eleventh stroke. Why did you hit it so hard?”\u003c/p\u003e\n\u003cp\u003e“Because I was hoping the ball would blow up so I didn’t have to finish this dumb game.”\u003c/p\u003e\n\u003cp\u003eHe grinned and his damn dimples winked at her.\u003c/p\u003e\n\u003cp\u003eArgh. She wanted to whack the golf club against the wooden bridge out of pure frustration. How could Mr. Mini Golf Pro Tell have such a great disposition when she was having a lousy time?\u003c/p\u003e\n\u003cp\u003eThen those devilish dimples were right in her face. “Such a sexy pout.”\u003c/p\u003e\n\u003cp\u003e“I’m not pouting.”\u003c/p\u003e\n\u003cp\u003e“Yes, you are. Want me to tickle a smile out of you again?”\u003c/p\u003e\n\u003cp\u003eGeorgia swung the golf club like a baseball bat and snarled.\u003c/p\u003e\n\u003cp\u003eTell held up his hands in surrender and backed off. “Okay, I’d rather see you pout than let you brain me with a putter because I’m winning.” His lips twitched. “So let’s see if we can’t make the game more interesting.”\u003c/p\u003e\n\u003cp\u003e“How? Are you gonna let me turn that replica gold-miner’s shack into a real fire trap when I throw a match on the roof?”\u003c/p\u003e\n\u003cp\u003eHe sighed. “Ever notice you have violent tendencies when you’re not winning?”\u003c/p\u003e\n\u003cp\u003e“Who likes losing?”\u003c/p\u003e\n\u003cp\u003e“It’s a game. It’s supposed to be fun. F-u-n, Georgia. Spell it with me.”\u003c/p\u003e\n\u003cp\u003e“F-u-c-k your f-u-n, McKay.”\u003c/p\u003e\n\u003cp\u003eThe man busted a gut, which made it impossible to stay mad at him. She smiled. “Fine. What’s your suggestion for f-u-n?”\u003c/p\u003e\n\u003cp\u003e“Since you went thirty-seven strokes over in the first round, let’s make the extra strokes…count in the second game.”\u003c/p\u003e\n\u003cp\u003eThis could be entertaining. “I’m listening.”\u003c/p\u003e\n\u003cp\u003e“Every penalty stroke—meaning anything over six shots per hole—will earn you a penalty when we get home.”\u003c/p\u003e\n\u003cp\u003e“What kind of penalty?”\u003c/p\u003e\n\u003cp\u003e“A hard smack on your butt. You across my knee. Bare-assed.” He shrugged and tossed the neon-green golf ball in the air and caught it. “I’d probably tie your hands. Maybe even gag you.”\u003c/p\u003e\n\u003cp\u003eGulp. “And what about you?”\u003c/p\u003e\n\u003cp\u003eA smirk. “Same deal.”\u003c/p\u003e\n\u003cp\u003e“But that’s not fair! You haven’t had a single hole over three strokes this entire game!”\u003c/p\u003e\n\u003cp\u003e“Then you’d better concentrate, hadn’t you? If you don’t want your ass smarting come morning.” He plundered her mouth with a toe-curling kiss. “You can ask for my assistance at any time. Because, hot lips, you’re gonna need all the help you can get. I am so lookin’ forward to meting out your penalties.”\u003c/p\u003e\n\u003cp\u003eHah! She’d show him. She’d win this damn game. Or at least keep herself from getting a minimum of nine butt slaps.\u003c/p\u003e\n\u003cp\u003eThat’s when Georgia started to have fun. Tell teased her endlessly. Trash-talked her at every hole. Copped a feel whenever possible. Snuck kisses. Touched her just because he always had to be touching her. Which was really hot. He touched her in a way that was sweet to her, but held the back the fuck off she’s mine vibe to any guy giving her a once-over.\u003c/p\u003e\n\u003cp\u003eBy the time they reached the last hole, she’d had a miraculous improvement in her golf game. Only three penalty strokes, which Tell offered to waive if she gave his cock three long, thorough strokes. With her mouth.\u003c/p\u003e\n\u003cp\u003eHeckuva deal, in her opinion.\u003c/p\u003e\n\u003cp\u003eAt Applebee’s, Tell insisted on sitting on the same side of the booth as her. She ordered a dirty-girl lemonade and he opted for Crown and water.\u003c/p\u003e\n\u003cp\u003eThey talked while waiting for their food. Easy conversation about their work plans for the upcoming week. She told him about the rodeo, but decided not to mention the committee had hired Deck as a judge.\u003c/p\u003e\n\u003cp\u003eShe felt like a complete idiot that she’d missed Deck’s name on both the PRCA and non-PRCA judges’ list. Granted, his name was at the bottom, since he didn’t judge much, but after their run-in, she’d flipped through her paperwork and discovered they were working at another event this summer. All three of them—Deck, Tell and her. Together. That oughta be a laugh riot—not.\u003c/p\u003e\n\u003cp\u003eShe decided to avoid mentioning it until right before the actual event. It wasn’t worth getting Tell’s back up or setting them both on edge. And who knew what would happen between her and Tell between now and then? Maybe they’d break up.\u003c/p\u003e\n\u003cp\u003eThe thought of that caused her stomach to somersault. Letting him know she was leaving at summer’s end would be the responsible thing to do, but the more time she spent with Tell, the more time she wanted to spend with him. And she knew if she told him, he’d end it now. She wasn’t ready for that.\u003c/p\u003e\n\u003cp\u003eGeorgia sighed softly and laid her head on his shoulder—just because she could.\u003c/p\u003e\n\u003cp\u003e“Be honest. Did you have fun today?” Tell had one arm around her and gently trailed his fingertips across her bicep.\u003c/p\u003e\n\u003cp\u003e“Yes. I always have a great time with you. No matter if we’re having a popcorn fight, or if we’re out at a bar, or if we’re in bed. I like being with you, Tell.”\u003c/p\u003e\n\u003cp\u003eHe cupped his hand around her jaw, turning her face toward his. Georgia expected a gentle peck, but he flipped all her switches to overload with a hungry kiss.\u003c/p\u003e\n\u003cp\u003eThe insistent mating of mouths was a little much for a public restaurant. But again, Tell lived in the moment. He’d just told her he felt the same way, without saying anything at all.\u003c/p\u003e\n\u003cp\u003e“For pity’s sake, Tell McKay, what is wrong with you?”\u003c/p\u003e\n\u003cp\u003eTell didn’t rip his mouth from hers as he ended the kiss, but every muscle in his body seized up. He glanced at the man standing at the end of the table.\u003c/p\u003e\n\u003cp\u003eThe resemblance was obvious.\u003c/p\u003e\n\u003cp\u003e“Dad. What are you doin’ here?”\u003c/p\u003e\n\u003cp\u003e“Didja forget I spend Sundays in Spearfish goin’ to church? Not that you’ve ever bothered to visit my house or the Lord’s house.”\u003c/p\u003e\n\u003cp\u003eThe man’s mean blue-eyed gaze landed on Georgia. “Who’re you?”\u003c/p\u003e\n\u003cp\u003e“Georgia Hotchkiss. Who are you?”\u003c/p\u003e\n\u003cp\u003e“Tell’s father. Not that I wanna claim him some days when he does stupid stuff like this.”\u003c/p\u003e\n\u003cp\u003eBefore she responded, Casper McKay slid into the opposite bench seat. He scrutinized Tell. “So I hadta hear from my brothers the annual meeting was held last week. Why didn’t one of you boys tell me?”\u003c/p\u003e\n\u003cp\u003e“Because you can’t vote, and after what happened last time, you can’t honestly be surprised.”\u003c/p\u003e\n\u003cp\u003e“Sure, they can talk about drinkin’ and whorin’ all day long, but when I asked to say a prayer before the meeting started, you’da thought I’d asked to rape a goat.”\u003c/p\u003e\n\u003cp\u003eTell’s cheeks turned bright red. “Jesus, Dad. Do you have to do this now?”\u003c/p\u003e\n\u003cp\u003e“Watch your language,” Casper snapped. “I can’t imagine this lady wants to hear your filthy mouth.”\u003c/p\u003e\n\u003cp\u003eOh, I wanna hear his dirty talk more than you can fathom, you clueless SOB.\u003c/p\u003e\n\u003cp\u003eTell said nothing. Just sipped his drink.\u003c/p\u003e\n\u003cp\u003e“I haven’t heard from Brandt since I saw my new grandson last Sunday. You were there when he promised to call me.”\u003c/p\u003e\n\u003cp\u003eGeorgia realized that one thing Dalton and Tell had referred to was code for a family situation involving the prickly Casper. What a relief.\u003c/p\u003e\n\u003cp\u003e“I imagine he didn’t call because he’s tired of hearin’ you just rag on them to get the baby baptized according to your time frame.”\u003c/p\u003e\n\u003cp\u003eCasper’s nostrils flared. “Always gotta place the blame on me, doncha?”\u003c/p\u003e\n\u003cp\u003e“That’s because it usually falls on you.”\u003c/p\u003e\n\u003cp\u003eWhat was taking their food so long?\u003c/p\u003e\n\u003cp\u003eGeorgia looked up to see Casper staring at her. “Hotchkiss, huh? You Robert’s kid?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Huh. What church do you go to?”\u003c/p\u003e\n\u003cp\u003e“Dad, that’s not—”\u003c/p\u003e\n\u003cp\u003e“It’s okay, Tell.” She smiled at Casper. “When I lived here before, we were Evangelical Free.”\u003c/p\u003e\n\u003cp\u003e“Georgia recently moved back to Sundance from Dallas,” Tell offered.\u003c/p\u003e\n\u003cp\u003e“The girl can speak for herself, can’t she?” Casper retorted. “It’s so like you, boy, always trying to smooth things over. We’re just talkin’. Ain’t like I’m gonna tell her embarrassing secrets about you.”\u003c/p\u003e\n\u003cp\u003e“Dad. Stop.”\u003c/p\u003e\n\u003cp\u003eCasper stretched his arm across the back of the booth. “Didja talk to your mother about her?”\u003c/p\u003e\n\u003cp\u003e“Her name is Georgia. And I don’t see how it’s any of your business what Mom and I talk about.”\u003c/p\u003e\n\u003cp\u003eCasper grinned meanly at Tell and addressed Georgia. “Better watch this one. He ain’t interested in settling down. Especially if he ain’t mentioned you to his mama yet.”\u003c/p\u003e\n\u003cp\u003eTell drained his drink.\u003c/p\u003e\n\u003cp\u003eGeorgia hadn’t been raised to backtalk her elders. So as much as she wanted to brag that the kinky, anything-goes sex was keeping her interest, not the chance to snag a McKay, she wouldn’t dare. But it broke her heart to watch Tell being miserable.\u003c/p\u003e\n\u003cp\u003e“His mother and I got divorced,” Casper said out of the blue.\u003c/p\u003e\n\u003cp\u003e“My folks got divorced too, after my brother, RJ, died in a car accident.”\u003c/p\u003e\n\u003cp\u003e“I remember that. But it wasn’t no accident. He was drivin’ drunk, wasn’t he?”\u003c/p\u003e\n\u003cp\u003e“Yes.” And thank you for pointing that out.\u003c/p\u003e\n\u003cp\u003e“I done my share of that. Ain’t proud to say it even when I know now I had angels watching over me. Praise the Lord he’s on my side, helpin’ me stay outta the bottle. You’re lucky he didn’t take no one else with him. Not like what happened with my oldest son, Luke. Some jackass didn’t know how to drive in the fog and my boy paid the price.”\u003c/p\u003e\n\u003cp\u003eFinally their food arrived and Georgia hoped Casper would take a hike. But she feared he might be inclined to stay and say grace.\u003c/p\u003e\n\u003cp\u003eTell started shoveling in the side of mixed veggies.\u003c/p\u003e\n\u003cp\u003eCasper said, “You know it wouldn’t kill ya to say thanks to the Lord for all you’ve got before you eat like you’ve never seen food.” \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-43.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
