{"id":71546,"no":53,"title":"Page 53","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I’m not kidding. If you want me to jump nekkid, then you will be stroking yourself while you watch me.”\u003c/p\u003e\n\u003cp\u003eTen whole seconds passed until Tell yanked down his board shorts. “Take off the top.”\u003c/p\u003e\n\u003cp\u003eShe untied the swimsuit top, spun it around her finger and tossed it at him. The hook caught on the netting.\u003c/p\u003e\n\u003cp\u003eTell wrapped his hand around his girth and started to stroke slowly.\u003c/p\u003e\n\u003cp\u003eShe fell onto her back and bounced a couple times before spreading her legs as she moved her pelvis up, directly in line with Tell’s eyes.\u003c/p\u003e\n\u003cp\u003e“Oh yeah. Sweet Georgia has left the building. Bring on Bad Georgia.” He whistled a few bars from “The Strip” and she laughed.\u003c/p\u003e\n\u003cp\u003ePut on a good show. Make him drool. Make him shoot Make him yours forever.\u003c/p\u003e\n\u003cp\u003eTell’s left hand was curled into the mesh; his right hand firmly jacked his cock. His eyes were that deep blue as he stared at her from beneath lowered lashes. His lips were parted, releasing broken breaths.\u003c/p\u003e\n\u003cp\u003eRolling to her feet, Georgia began to jump. Her boobs jiggled and immediately her nipples hardened.\u003c/p\u003e\n\u003cp\u003eAnd his focus zoomed to her chest.\u003c/p\u003e\n\u003cp\u003eImagine that.\u003c/p\u003e\n\u003cp\u003eAfter a few high jumps, she spun around. Letting him watch her ass shake.\u003c/p\u003e\n\u003cp\u003eHe groaned behind her.\u003c/p\u003e\n\u003cp\u003eShe performed a frog leap around the perimeter of the trampoline. Then she did a few twists and faced him again.\u003c/p\u003e\n\u003cp\u003eBouncety-bouncety.\u003c/p\u003e\n\u003cp\u003eThat hand started moving faster after her first straddle-split jump. She did jumping toe touches. Pikes. More straddle splits.\u003c/p\u003e\n\u003cp\u003eHer wiggle, jiggle, flounce and bounce routine really got to him because he let go of his dick and croaked, “Stop. Goddammit, stop, I can’t take any more.” Then both his hands were white-knuckling the netting.\u003c/p\u003e\n\u003cp\u003eWhen Georgia dropped to her knees to catch her breath, her body started to stiffen up in places. She’d be sore tomorrow. Really sore in more places than her little-used gymnastics muscles if she had her way.\u003c/p\u003e\n\u003cp\u003eShe crawled across the trampoline, but Tell didn’t open his eyes. But his gaze did snap to hers when she licked his fingers through the mesh. “So? Did this live up to your fantasy?”\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eA tiny spark of fear began to burn.\u003c/p\u003e\n\u003cp\u003eThen his fingertip was tracing her lip. “This is a million times better.”\u003c/p\u003e\n\u003cp\u003eHis words stirred the bad girl into action. She sucked his thumb into her mouth, swirling her tongue around it. Moaning that she could taste his musky essence lingering there.\u003c/p\u003e\n\u003cp\u003eHe groaned, “Fuck. Me.”\u003c/p\u003e\n\u003cp\u003eThe digit slid out with a wet pop. “Good plan.” Georgia rolled herself up, letting her nipples poke through the mesh.\u003c/p\u003e\n\u003cp\u003eWhen Tell tried to capture one, she pulled back and laughed seductively. “You can have me any way you want me, McKay, but you’ve gotta catch me first.”\u003c/p\u003e\n\u003cp\u003eTell scrambled over the edge of the trampoline like a primate scaling a banana tree.\u003c/p\u003e\n\u003cp\u003eGod he was amazing. All focused, aroused male.\u003c/p\u003e\n\u003cp\u003eHe yanked his shirt over his head so they were both naked. Wild. Circling each other like wrestlers in the ring.\u003c/p\u003e\n\u003cp\u003eThen Tell said, “Fuck this,” and launched himself at her, taking the brunt of their bounce on his back as he knocked her off her feet.\u003c/p\u003e\n\u003cp\u003eShe shrieked and he spun her facedown, resting on his haunches as he hiked up her hips.\u003c/p\u003e\n\u003cp\u003e“I caught you.” He slid her knees out, making a place for himself behind her. He spread her thighs and impaled her to the root on the first deep stroke. “And you’re all mine now. Say it.”\u003c/p\u003e\n\u003cp\u003e“I’m all yours.” Georgia pushed back to meet his thrusts. Losing her balance when they bounced together, but it felt too good to stop. He’d find the rhythm; he always did.\u003c/p\u003e\n\u003cp\u003eHe pulled out and she whimpered. He sat back, legs out in front of him, and brought her on top of his lap. “That ain’t workin’. You drive.”\u003c/p\u003e\n\u003cp\u003eShe took his hard length in her hand, aligned it to her core and dropped her hips until he filled her completely.\u003c/p\u003e\n\u003cp\u003eTell groaned against her chest, his mouth following the damp curve of her breast to her nipple.\u003c/p\u003e\n\u003cp\u003eGeorgia threw her head back and dug her nails into his shoulders. Trying to find the right tempo of when to lift and lower. Every time she tried to bring that thickness in deeper, they’d bounce—not in a productive way, but in a way that sent them off-kilter. Tell tried to balance them by keeping his hands on the trampoline behind him, but between the suntan oil, the sweat and the bouncing, they slid sideways whenever she moved.\u003c/p\u003e\n\u003cp\u003eHe winced and said, “Stop.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“This is pinching my balls.”\u003c/p\u003e\n\u003cp\u003e“Oh. Sorry.” She carefully scrambled off him.\u003c/p\u003e\n\u003cp\u003eTell reached between his thighs and readjusted himself.\u003c/p\u003e\n\u003cp\u003eShe was sweaty, frustrated and she needed a goddamn orgasm. Now. Maybe they should just go in the house.\u003c/p\u003e\n\u003cp\u003eGeorgia looked up to see Tell stalking her on all fours, planting random kisses on her quivering flesh as he positioned his body over hers.\u003c/p\u003e\n\u003cp\u003eThe heat in his eyes made her mouth dry.\u003c/p\u003e\n\u003cp\u003eHe scooped her up, clutching her butt cheeks in his hands and said, “Wrap your legs around my waist.”\u003c/p\u003e\n\u003cp\u003eAs soon as she did, he slid her onto his straining dick in one sure and sexy move.\u003c/p\u003e\n\u003cp\u003eYes. She glanced down, his knees splayed wide, his flat belly rubbing against hers with every roll of his hips as his shaft disappeared inside her.\u003c/p\u003e\n\u003cp\u003eHe murmured, “Goddamn you feel good on me.”\u003c/p\u003e\n\u003cp\u003eShe surrendered to the sensations of hot, sweaty, intense sex. Feeling those big hands of his squeezing her ass as he helped her ride his cock. Feeling his mouth attacking her throat as their slick bodies glided in opposition.\u003c/p\u003e\n\u003cp\u003eWhen their joined bodies bounced, it drove him deeper inside. Every. Time. And she cried out every time. Despite the heat of his body and the rays of sun beating down, her entire body was a mass of goose bumps.\u003c/p\u003e\n\u003cp\u003eSo close. The tightening sensation started in her tailbone and radiated upward.\u003c/p\u003e\n\u003cp\u003e“You’re there, baby. Take me with you.”\u003c/p\u003e\n\u003cp\u003eAnd when Tell gently bit on her earlobe, she lost it.\u003c/p\u003e\n\u003cp\u003eThe orgasm hit her with the force of a hurricane; no storm warning, it just swamped her. Wave after wave of pleasure crashed over her, making it hard to breathe, to think, to hold on as the power of it inundated her.\u003c/p\u003e\n\u003cp\u003eThe roaring in her ears stopped. Her body quit vibrating from the last storm surge and she slumped against Tell. Sated. And sleepy. The climax flattened her completely.\u003c/p\u003e\n\u003cp\u003eThen Tell’s hands were holding her face. His sweet, hot mouth was on hers, kissing her with that perfect mix of reverence and gratitude.\u003c/p\u003e\n\u003cp\u003e“Holy fuck,” he whispered against her lips. “Did you get the name of the coal train that hit us?”\u003c/p\u003e\n\u003cp\u003eShe snickered. “No, but at one point I’m pretty sure I heard circus music.”\u003c/p\u003e\n\u003cp\u003e“Damn, woman. Once you started to come, you kept coming, and I was toast.” He placed soft kisses on wherever his lips could land. “So fuckin’ hot.”\u003c/p\u003e\n\u003cp\u003e“I think you broke me. I’m pretty sure I have trampoline burns on my knees and elbows.”\u003c/p\u003e\n\u003cp\u003e“At least you don’t have them on your balls,” he muttered.\u003c/p\u003e\n\u003cp\u003eGeorgia thrust her hands into his hair, tilting his head back to gaze into his eyes. “Buck up, cowboy. The trampoline was your idea.”\u003c/p\u003e\n\u003cp\u003e“You really think I’m gonna complain about a sex injury that I got after fucking on a trampoline?” He grinned and punctuated each word with a kiss. “Not. On. Your. Life. Baby.”\u003c/p\u003e\n\u003cp\u003e“You’re such a guy.”\u003c/p\u003e\n\u003cp\u003e“And I just proved it.” He swatted her ass. “Come on. Let’s go in and get cleaned up.”\u003c/p\u003e\n\u003cp\u003eAlthough the suntan oil and sweat was scrubbed clean from her body, Georgia wasn’t anxious to leave the enclosed shower. Hot water, hot man, after hot sex—what more could she want?\u003c/p\u003e\n\u003cp\u003e“God. Your skin is amazing. I could spend all day just touchin’ it. So soft. So perfect.” Tell’s finger followed the arch of her spine from the middle of her back, down the crack of her ass.\u003c/p\u003e\n\u003cp\u003eShe didn’t move.\u003c/p\u003e\n\u003cp\u003eThose hypnotic blue eyes never left hers. The shower pelted her shoulders, spraying fine water particles on his face. The misty droplets caught on the dark hair on his cheeks and on his long eyelashes. In that moment, with his intense gaze, he was the most breathtaking man she’d ever seen.\u003c/p\u003e\n\u003cp\u003eOh, he was dangerous. She’d do anything he wanted, be anything he desired, if only he’d look at her like that forever.\u003c/p\u003e\n\u003cp\u003eBut you’re leaving, remember?\u003c/p\u003e\n\u003cp\u003eShe didn’t want to think about it now. Not when Tell was setting her blood on fire with the heat in his eyes and turning her world upside down with the addictive power of his touch.\u003c/p\u003e\n\u003cp\u003eHis finger stopped on her anus. He insistently stroked the pucker. Pressing a little harder, inserting just a fingertip inside, continuing to gently swirl against the clenched muscle.\u003c/p\u003e\n\u003cp\u003eShe couldn’t look away even when her cheeks turned bright red. No man had ever breached that part of her.\u003c/p\u003e\n\u003cp\u003e“Ever been fucked here?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eTell made a soft snarl. “This is mine. If you hadn’t noticed, I ain’t a patient man when it comes to what I want from you. And I want everything.”\u003c/p\u003e\n\u003cp\u003eGeorgia lost the ability to breathe.\u003c/p\u003e\n\u003cp\u003e“You will give it to me, won’t you?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“I want it now.” He angled the shower spray so it hit the floor. Then he reached for a small tube, cracked it open and coated his fingers.\u003c/p\u003e\n\u003cp\u003e“You keep lube in your shower?”\u003c/p\u003e\n\u003cp\u003e“Yep. I like to jack off in here.”\u003c/p\u003e\n\u003cp\u003eHer heart raced when he lowered his head.\u003c/p\u003e\n\u003cp\u003eHe allowed two soft brushes of his lips over hers and whispered, “Relax.” Then he plunged his tongue into her mouth as he slipped his finger into her ass.\u003c/p\u003e\n\u003cp\u003eThat felt weird. Not bad, just not normal. She kissed him as that slippery digit moved in and out, her body tensed with anticipation and a little fear.\u003c/p\u003e\n\u003cp\u003eHis mouth slid to her chin and he scattered kisses up the line of her jaw, dipping down to suck on the spot on her neck that made her crazy. Dizzy. Mad with want.\u003c/p\u003e\n\u003cp\u003eThose warm, full lips feathered across her ear. “Come like this. Touch your clit.”\u003c/p\u003e\n\u003cp\u003eReaching between her legs, she reveled in the eroticism of Tell’s hand already there. She placed her hand on his, feeling him slide his finger deep into her anal passage. \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-53.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
