{"id":71554,"no":62,"title":"Page 62","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eGeorgia was babbling? He put his hands on her cheeks. “Sweetness. Calm down. And if you’re sayin’ what I think you’re sayin’, well, I need to hear every word. Loud and clear.”\u003c/p\u003e\n\u003cp\u003eShe blurted out, “I love you.”\u003c/p\u003e\n\u003cp\u003eThere was that falling sensation again. “Run that by me one more time.”\u003c/p\u003e\n\u003cp\u003e“I love you. I love you so much it scares me.”\u003c/p\u003e\n\u003cp\u003e“Why does it scare you?”\u003c/p\u003e\n\u003cp\u003e“After RJ died, I closed myself off from all relationships. I couldn’t lose anyone else I cared about if I didn’t bother to care about anyone—a friend or a lover.\u003c/p\u003e\n\u003cp\u003e“I’ve needed to deal with this for a long time. It’s not surprising it came full circle in Sundance. When I was forced to take this job, I swore I’d come back here, exorcise my demons and move on. Then I got involved with you. You changed everything. You challenged me. You accepted me. You freed me.”\u003c/p\u003e\n\u003cp\u003eHe had to breathe slowly, steadily, because the roaring in his ears threatened to drown out the sound of her words.\u003c/p\u003e\n\u003cp\u003e“I only just realized I’m tired of blaming everything that’s wrong with my life on someone else. On my early, crappy marriage to Deck. On RJ dying. On my parents splitting up. On the way my dad grieved. On my job. Over the last day, it’s become obvious I need to take responsibility for myself and my own happiness and live my life on my terms.\u003c/p\u003e\n\u003cp\u003e“The God’s honest truth is you make me happy. Happier than I’ve ever been in my life. And isn’t that feeling worth something when making a life-changing decision? Shouldn’t that feeling of happiness determine everything? Yes. So I quit my job yesterday.”\u003c/p\u003e\n\u003cp\u003eHis voice was barely above a whisper when he asked, “Are you sure that’s what you want?”\u003c/p\u003e\n\u003cp\u003e“Yes. So my decision to give up my life in Dallas to be with you here in Sundance is not politically correct. I’m supposed to believe I don’t need a man to make me happy. But you know what? That’s crap. That’s me listening to other people’s opinions instead of listening to my heart. My heart is telling me to stay here with you, Tell McKay. My heart loves you. I love you. I love everything about you.\u003c/p\u003e\n\u003cp\u003e“I can’t imagine anything better than waking up with you every morning. I love how much you make me laugh. I love how you’ve taught me how to have fun. I love how you’ve shown me what a sense of community means. What friendships mean. I love how you understand family issues and don’t believe everything has to have a quick fix. I hate that we’ve both dealt with sadness and loss, but I love I have you to talk to about it. You accept it all. Every part of me.”\u003c/p\u003e\n\u003cp\u003eIf Tell’s mouth weren’t so damn dry and his heart weren’t beating a million miles an hour, he might have thought he was actually dreaming.\u003c/p\u003e\n\u003cp\u003e“I’ve had so many choices made for me throughout my life. This time I’m taking a stand and making my own choice. This time I’m choosing you.”\u003c/p\u003e\n\u003cp\u003eAs calm as he appeared on the outside, on the inside his inner teenage boy was yelling, In your face, suckas, this girl is mine!\u003c/p\u003e\n\u003cp\u003eShe blushed and fiddled with the collar of his shirt. “So, ah, please don’t tell me you were coming here to break up with me or something.”\u003c/p\u003e\n\u003cp\u003eHe laughed. He laughed until he cried. Or maybe he was crying because this woman had just made him the happiest man alive. He brought her close enough to stare into her eyes and feel her stuttered breath on his lips. “I’m not breaking up with you, but you should understand that I’m not good at this because I’ve never said it before.”\u003c/p\u003e\n\u003cp\u003e“Tell, you don’t have to—”\u003c/p\u003e\n\u003cp\u003e“Yes, I do. I love you, Georgia. I’ve come to some of those same realizations too. I wanna be with you so much that I was ready to move to Dallas if that’s what it’d take for us to be together.”\u003c/p\u003e\n\u003cp\u003e“You’d do that?”\u003c/p\u003e\n\u003cp\u003e“In a fuckin’ heartbeat. I want a lifetime with you. Marriage, babies, havin’ our family and friends over for dinner, goin’ out on the town, planting a garden and sinking our roots in deep. I’ve seen my cousins so happy, and they’ve each built their own family. I’ve wanted that for myself, but I didn’t think it was possible until you. You make me feel so much. Make me feel things I’ve never felt before. And yes, it’s scary as hell for me too.”\u003c/p\u003e\n\u003cp\u003eThey stared at each other.\u003c/p\u003e\n\u003cp\u003eShe grinned and said, “Wow. That’s some grown-up stuff.”\u003c/p\u003e\n\u003cp\u003e“Yeah. Mushy stuff too.” He kissed her fingertips. “I love everything about you. I love that you get everything about me, and apparently you still love me anyway.”\u003c/p\u003e\n\u003cp\u003eShe laughed softly.\u003c/p\u003e\n\u003cp\u003e“You make me happy, Georgia. And I will spend the rest of my life makin’ sure you don’t regret choosing me.”\u003c/p\u003e\n\u003cp\u003e“I already don’t have any regrets.” She kissed him with passion, heart and fire; he sucked it down like a narcotic. Drugged on the taste of her, the feel of her, this woman who loved him.\u003c/p\u003e\n\u003cp\u003eHe broke the kiss to murmur, “And don’t take this wrong, but you don’t hafta get a job right away if you don’t want to. I’ll support you.”\u003c/p\u003e\n\u003cp\u003e“See how sweet you are?” She nipped his chin. “Thank you. I appreciate it, but I’ve got a few offers.”\u003c/p\u003e\n\u003cp\u003e“Already?”\u003c/p\u003e\n\u003cp\u003e“Leah and Roxanne have offered me a job at the beauty shop. Stephanie said she’d hire me to organize her filing system. Domini mentioned they’re always shorthanded at Dewey’s, so I could probably wait tables. At the fundraiser, the cheerleading coach said there was an assistant cheer coach’s job for me at the school if I wanted it. And the Sundance Chamber of Commerce might be looking for a part-time PR person. So I’ve got options. The job doesn’t matter as long as I get to come home to you every night.”\u003c/p\u003e\n\u003cp\u003e“Well, now that you mention it, I was sorta kicking around the idea of takin’ on a roommate.”\u003c/p\u003e\n\u003cp\u003e“That right?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. But it’s gotta be someone special. A woman who doesn’t care that I’m gonna be a rancher the rest of my life. A woman who is okay with me judging the occasional rodeo. A woman who knows I can’t cook. A woman who understands that once she moves in, she ain’t ever movin’ out. A woman who knows that I’ll love her and cherish her and protect her every day of her life. That this is for keeps.”\u003c/p\u003e\n\u003cp\u003eGeorgia’s eyes filled with tears. “I’m so ready to sign on the dotted line for that.”\u003c/p\u003e\n\u003cp\u003e“And ain’t it lucky I just happen to have a pen?”\u003c/p\u003e\n\u003cp\u003eShe laughed. “God. I love you, Tell McKay. My very own cowboy hottie. I will take you up on your roommate offer, if it includes trampoline and zip-line privileges.”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003e“I have to go to Dallas and load up my stuff and cancel the lease on my condo, but that should only take a couple of days.”\u003c/p\u003e\n\u003cp\u003e“I’m goin’ with you.”\u003c/p\u003e\n\u003cp\u003eHer eyebrows rose. “Really?”\u003c/p\u003e\n\u003cp\u003e“I sure as hell ain’t gonna let you drive across the damn country by yourself dragging a U-Haul. You’ll need help loading your stuff. And I wanna see where you lived and worked because that’s part of who you are.”\u003c/p\u003e\n\u003cp\u003e“Who I was,” she corrected. “You also want my colleagues and former boss to know exactly who I’m leaving Dallas for.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “That too. You’re mine now, hot lips, and I’m gonna take great pride in letting everyone know it. Especially letting you know it.” He brushed his lips over hers softly. “Despite you actin’ so tough, I suspect you’ll shed a few tears, sayin’ goodbye to that life, and you’ll need me around for comic relief on the long drive back home.”\u003c/p\u003e\n\u003cp\u003e“I need you for a lot more than comic relief.”\u003c/p\u003e\n\u003cp\u003e“That’s good to know. I love you. You’re gonna get mighty sick of hearing me say that.”\u003c/p\u003e\n\u003cp\u003e“Never.”\u003c/p\u003e\n\u003cp\u003e“And I’m pretty sure I can find a whole bunch of fun things to do between here and Dallas. Amusement parks and the like.”\u003c/p\u003e\n\u003cp\u003e“Oh hell no. You’re never getting me on a roller coaster, McKay.”\u003c/p\u003e\n\u003cp\u003eTell just grinned and kissed her, knowing how sweet it would be when they teetered on the edge of the first drop, seeing the loops and turns ahead, and then experienced that sudden fall. She’d be screaming her head off, hanging on for dear life, but having the time of her life because she was with him. \u003c/p\u003e","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-62.html","bookId":2694,"creation":"Oct 5, 2019 10:20:54 AM","modification":"Oct 5, 2019 10:20:54 AM"}
