{"id":7313,"no":21,"title":"Chapter 21","content":"21:1 [hgb]\u0026nbsp; 那 时 ， 利 未 人 的 众 族 长 来 到 祭 司 以 利 亚 撒 和 嫩 的 儿 子 约 书 亚 ， 并 以 色 列 各 支 派 的 族 长 面 前 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Then came near the heads of the fathers of the Levites unto Eleazar the priest, and unto Joshua the son of Nun, and unto the heads of the fathers of the tribes of the children of Israel; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then the heads of the families of the Levites came to Eleazar the priest and Joshua, the son of Nun, and to the heads of families of the tribes of the children of Israel; \n\u003cbr\u003e21:2 [hgb]\u0026nbsp; 在 迦 南 地 的 示 罗 对 他 们 说 ， 从 前 耶 和 华 借 着 摩 西 吩 咐 给 我 们 城 邑 居 住 ， 并 城 邑 的 郊 野 可 以 牧 养 我 们 的 牲 畜 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they spake unto them at Shiloh in the land of Canaan, saying, The LORD commanded by the hand of Moses to give us cities to dwell in, with the suburbs thereof for our cattle. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And said to them in Shiloh in the land of Canaan, The Lord gave orders by Moses that we were to have towns for living in, with their grass-lands for our cattle. \n\u003cbr\u003e21:3 [hgb]\u0026nbsp; 于 是 以 色 列 人 照 耶 和 华 所 吩 咐 的 ， 从 自 己 的 地 业 中 ， 将 以 下 所 记 的 城 邑 和 城 邑 的 郊 野 给 了 利 未 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the children of Israel gave unto the Levites out of their inheritance, at the commandment of the LORD, these cities and their suburbs. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the children of Israel out of their heritage gave to the Levites these towns with their grass-lands, by the order of the Lord. \n\u003cbr\u003e21:4 [hgb]\u0026nbsp; 为 哥 辖 族 拈 阄 ， 利 未 人 的 祭 司 ， 亚 伦 的 子 孙 ， 从 犹 大 支 派 ， 西 缅 支 派 ， 便 雅 悯 支 派 的 地 业 中 ， 按 阄 得 了 十 三 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the lot came out for the families of the Kohathites: and the children of Aaron the priest, which were of the Levites, had by lot out of the tribe of Judah, and out of the tribe of Simeon, and out of the tribe of Benjamin, thirteen cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the heritage came out for the families of the Kohathites: the children of Aaron the priest, who were of the Levites, were given thirteen towns from the tribes of Judah, Simeon, and Benjamin. \n\u003cbr\u003e21:5 [hgb]\u0026nbsp; 哥 辖 其 余 的 子 孙 ， 从 以 法 莲 支 派 ， 但 支 派 ， 玛 拿 西 半 支 派 的 地 业 中 ， 按 阄 得 了 十 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the rest of the children of Kohath had by lot out of the families of the tribe of Ephraim, and out of the tribe of Dan, and out of the half tribe of Manasseh, ten cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The rest of the children of Kohath by their families were given ten towns from the tribes of Ephraim and Dan and the half-tribe of Manasseh. \n\u003cbr\u003e21:6 [hgb]\u0026nbsp; 革 顺 的 子 孙 ， 从 以 萨 迦 支 派 ， 亚 设 支 派 ， 拿 弗 他 利 支 派 ， 住 巴 珊 的 玛 拿 西 半 支 派 的 地 业 中 ， 按 阄 得 了 十 三 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the children of Gershon had by lot out of the families of the tribe of Issachar, and out of the tribe of Asher, and out of the tribe of Naphtali, and out of the half tribe of Manasseh in Bashan, thirteen cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The children of Gershon by their families were given thirteen towns from the tribes of Issachar and Asher and Naphtali and the half-tribe of Manasseh which was in Bashan. \n\u003cbr\u003e21:7 [hgb]\u0026nbsp; 米 拉 利 的 子 孙 ， 按 着 宗 族 ， 从 流 便 支 派 ， 迦 得 支 派 ， 西 布 伦 支 派 的 地 业 中 ， 按 阄 得 了 十 二 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The children of Merari by their families had out of the tribe of Reuben, and out of the tribe of Gad, and out of the tribe of Zebulun, twelve cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The children of Merari by their families were given twelve towns from the tribes of Reuben and Gad and Zebulun. \n\u003cbr\u003e21:8 [hgb]\u0026nbsp; 以 色 列 人 照 着 耶 和 华 借 摩 西 所 吩 咐 的 ， 将 这 些 城 邑 和 城 邑 的 郊 野 ， 按 阄 分 给 利 未 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the children of Israel gave by lot unto the Levites these cities with their suburbs, as the LORD commanded by the hand of Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All these towns with their grass-lands the children of Israel gave by the decision of the Lord to the Levites, as the Lord had given orders by Moses. \n\u003cbr\u003e21:9 [hgb]\u0026nbsp; 从 犹 大 支 派 ， 西 缅 支 派 的 地 业 中 ， 将 以 下 所 记 的 城 给 了 利 未 支 派 哥 辖 宗 族 亚 伦 的 子 孙 。 因 为 给 他 们 拈 出 头 一 阄 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they gave out of the tribe of the children of Judah, and out of the tribe of the children of Simeon, these cities which are here mentioned by name, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; From the tribes of the children of Judah and the children of Simeon they gave these towns, listed here by name: \n\u003cbr\u003e21:10 [hgb]\u0026nbsp;\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Which the children of Aaron, being of the families of the Kohathites, who were of the children of Levi, had: for theirs was the first lot. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; These were for the children of Aaron among the families of the Kohathites, of the children of Levi: for they came first in the distribution. \n\u003cbr\u003e21:11 [hgb]\u0026nbsp; 将 犹 大 山 地 的 基 列 亚 巴 和 四 围 的 郊 野 给 了 他 们 。 亚 巴 是 亚 衲 族 的 始 祖 。 （ 基 列 亚 巴 就 是 希 伯 仑 ） 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they gave them the city of Arba the father of Anak, which city is Hebron, in the hill country of Judah, with the suburbs thereof round about it. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; They gave them Kiriath-arba, the town of Arba, the father of Anak, (which is Hebron) in the hill-country of Judah, with its grass-lands. \n\u003cbr\u003e21:12 [hgb]\u0026nbsp; 惟 将 属 城 的 田 地 和 村 庄 给 了 耶 孚 尼 的 儿 子 迦 勒 为 业 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But the fields of the city, and the villages thereof, gave they to Caleb the son of Jephunneh for his possession. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But the open country round the town, and its unwalled places, they gave to Caleb, the son of Jephunneh, as his property. \n\u003cbr\u003e21:13 [hgb]\u0026nbsp; 以 色 列 人 将 希 伯 仑 ， 就 是 误 杀 人 的 逃 城 和 属 城 的 郊 野 ， 给 了 祭 司 亚 伦 的 子 孙 。 又 给 他 们 立 拿 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thus they gave to the children of Aaron the priest Hebron with her suburbs, to be a city of refuge for the slayer; and Libnah with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And to the children of Aaron the priest they gave Hebron with its grass-lands, the town where the taker of life might be safe, and Libnah with its grass-lands; \n\u003cbr\u003e21:14 [hgb]\u0026nbsp; 雅 提 珥 和 属 城 的 郊 野 ， 以 实 提 莫 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Jattir with her suburbs, and Eshtemoa with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Jattir with its grass-lands, and Eshtemoa with its grass-lands; \n\u003cbr\u003e21:15 [hgb]\u0026nbsp; 何 仑 和 属 城 的 郊 野 ， 底 璧 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Holon with her suburbs, and Debir with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Holon with its grass-lands, and Debir with its grass-lands; \n\u003cbr\u003e21:16 [hgb]\u0026nbsp; 亚 因 和 属 城 的 郊 野 ， 淤 他 和 属 城 的 郊 野 ， 伯 示 麦 和 属 城 的 郊 野 ， 共 九 座 城 ， 都 是 从 这 二 支 派 中 分 出 来 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Ain with her suburbs, and Juttah with her suburbs, and Bethshemesh with her suburbs; nine cities out of those two tribes. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Ain, and Juttah, and Beth-shemesh, with their grass-lands; nine towns from those two tribes. \n\u003cbr\u003e21:17 [hgb]\u0026nbsp; 又 从 便 雅 悯 支 派 的 地 业 中 给 了 他 们 基 遍 和 属 城 的 郊 野 ， 迦 巴 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the tribe of Benjamin, Gibeon with her suburbs, Geba with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the tribe of Benjamin they gave Gibeon and Geba with their grass-lands; \n\u003cbr\u003e21:18 [hgb]\u0026nbsp; 亚 拿 突 和 属 城 的 郊 野 ， 亚 勒 们 和 属 城 的 郊 野 ， 共 四 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Anathoth with her suburbs, and Almon with her suburbs; four cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Anathoth and Almon with their grass-lands, four towns. \n\u003cbr\u003e21:19 [hgb]\u0026nbsp; 亚 伦 子 孙 作 祭 司 的 共 有 十 三 座 城 ， 还 有 属 城 的 郊 野 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; All the cities of the children of Aaron, the priests, were thirteen cities with their suburbs. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Thirteen towns with their grass-lands were given to the children of Aaron, the priests. \n\u003cbr\u003e21:20 [hgb]\u0026nbsp; 利 未 支 派 中 哥 辖 的 宗 族 ， 就 是 哥 辖 其 余 的 子 孙 ， 拈 阄 所 得 的 城 有 从 以 法 莲 支 派 中 分 出 来 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the families of the children of Kohath, the Levites which remained of the children of Kohath, even they had the cities of their lot out of the tribe of Ephraim. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The rest of the families of the children of Kohath, the Levites, were given towns from the tribe of Ephraim. \n\u003cbr\u003e21:21 [hgb]\u0026nbsp; 以 色 列 人 将 以 法 莲 山 地 的 示 剑 ， 就 是 误 杀 人 的 逃 城 和 属 城 的 郊 野 ， 给 了 他 们 。 又 给 他 们 基 色 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For they gave them Shechem with her suburbs in mount Ephraim, to be a city of refuge for the slayer; and Gezer with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they gave them Shechem with its grass-lands in the hill-country of Ephraim, the town where the taker of life might be safe, and Gezer with its grass-lands; \n\u003cbr\u003e21:22 [hgb]\u0026nbsp; 基 伯 先 和 属 城 的 郊 野 ， 伯 和 仑 和 属 城 的 郊 野 ， 共 四 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Kibzaim with her suburbs, and Bethhoron with her suburbs; four cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Kibzaim and Beth-horon with their grass-lands, four towns. \n\u003cbr\u003e21:23 [hgb]\u0026nbsp; 又 从 但 支 派 的 地 业 中 给 了 他 们 伊 利 提 基 和 属 城 的 郊 野 ， 基 比 顿 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the tribe of Dan, Eltekeh with her suburbs, Gibbethon with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the tribe of Dan, Elteke and Gibbethon with their grass-lands; \n\u003cbr\u003e21:24 [hgb]\u0026nbsp; 亚 雅 仑 和 属 城 的 郊 野 ， 迦 特 临 门 和 属 城 的 郊 野 ， 共 四 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Aijalon with her suburbs, Gathrimmon with her suburbs; four cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Aijalon and Gath-rimmon with their grass-lands, four towns. \n\u003cbr\u003e21:25 [hgb]\u0026nbsp; 又 从 玛 拿 西 半 支 派 的 地 业 中 给 了 他 们 他 纳 和 属 城 的 郊 野 ， 迦 特 临 门 和 属 城 的 郊 野 ， 共 两 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the half tribe of Manasseh, Tanach with her suburbs, and Gathrimmon with her suburbs; two cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the half-tribe of Manasseh, Taanach and Gath-rimmon with their grass-lands, two towns. \n\u003cbr\u003e21:26 [hgb]\u0026nbsp; 哥 辖 其 余 的 子 孙 共 有 十 座 城 ， 还 有 属 城 的 郊 野 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; All the cities were ten with their suburbs for the families of the children of Kohath that remained. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All the towns of the rest of the families of the children of Kohath were ten with their grass-lands. \n\u003cbr\u003e21:27 [hgb]\u0026nbsp; 以 色 列 人 又 从 玛 拿 西 半 支 派 的 地 业 中 将 巴 珊 的 哥 兰 ， 就 是 误 杀 人 的 逃 城 和 属 城 的 郊 野 ， 给 了 利 未 支 派 革 顺 的 子 孙 。 又 给 他 们 比 施 提 拉 和 属 城 的 郊 野 ， 共 两 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And unto the children of Gershon, of the families of the Levites, out of the other half tribe of Manasseh they gave Golan in Bashan with her suburbs, to be a city of refuge for the slayer; and Beeshterah with her suburbs; two cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And to the children of Gershon, of the families of the Levites, they gave from the half-tribe of Manasseh, Golan in Bashan with its grass-lands, the town where the taker of life might be safe, and Ashtaroth with its grass-lands, two towns. \n\u003cbr\u003e21:28 [hgb]\u0026nbsp; 又 从 以 萨 迦 支 派 的 地 业 中 给 了 他 们 基 善 和 属 城 的 郊 野 ， 大 比 拉 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the tribe of Issachar, Kishon with her suburbs, Dabareh with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the tribe of Issachar, Kishion and Daberath with their grass-lands; \n\u003cbr\u003e21:29 [hgb]\u0026nbsp; 耶 末 和 属 城 的 郊 野 ， 隐 干 宁 和 属 城 的 郊 野 ， 共 四 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Jarmuth with her suburbs, Engannim with her suburbs; four cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Jarmuth and En-gannim with their grass-lands, four towns. \n\u003cbr\u003e21:30 [hgb]\u0026nbsp; 又 从 亚 设 支 派 的 地 业 中 给 了 他 们 米 沙 勒 和 属 城 的 郊 野 ， 押 顿 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the tribe of Asher, Mishal with her suburbs, Abdon with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the tribe of Asher, Mishal and Abdon, with their grass-lands: \n\u003cbr\u003e21:31 [hgb]\u0026nbsp; 黑 甲 和 属 城 的 郊 野 ， 利 合 和 属 城 的 郊 野 ， 共 四 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Helkath with her suburbs, and Rehob with her suburbs; four cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Helkath and Rehob with their grass-lands, four towns. \n\u003cbr\u003e21:32 [hgb]\u0026nbsp; 又 从 拿 弗 他 利 支 派 的 地 业 中 将 加 利 利 的 基 低 斯 ， 就 是 误 杀 人 的 逃 城 和 属 城 的 郊 野 ， 给 了 他 们 。 又 给 他 们 哈 末 多 珥 和 属 城 的 郊 野 ， 加 珥 坦 和 属 城 的 郊 野 ， 共 三 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the tribe of Naphtali, Kedesh in Galilee with her suburbs, to be a city of refuge for the slayer; and Hammothdor with her suburbs, and Kartan with her suburbs; three cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the tribe of Naphtali, Kedesh in Galilee with its grass-lands, the town where the taker of life might be safe, and Hammoth-dor and Kartan with their grass-lands, three towns. \n\u003cbr\u003e21:33 [hgb]\u0026nbsp; 革 顺 人 按 着 宗 族 所 得 的 城 ， 共 十 三 座 ， 还 有 属 城 的 郊 野 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; All the cities of the Gershonites according to their families were thirteen cities with their suburbs. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All the towns of the Gershonites with their families were thirteen with their grass-lands. \n\u003cbr\u003e21:34 [hgb]\u0026nbsp; 其 余 利 未 支 派 米 拉 利 子 孙 ， 从 西 布 伦 支 派 的 地 业 中 所 得 的 ， 就 是 约 念 和 属 城 的 郊 野 ， 加 珥 他 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And unto the families of the children of Merari, the rest of the Levites, out of the tribe of Zebulun, Jokneam with her suburbs, and Kartah with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And to the rest of the Levites, that is, the families of the children of Merari, they gave from the tribe of Zebulun, Jokneam and Kartah with their grass-lands; \n\u003cbr\u003e21:35 [hgb]\u0026nbsp; 丁 拿 和 属 城 的 郊 野 ， 拿 哈 拉 和 属 城 的 郊 野 ， 共 四 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Dimnah with her suburbs, Nahalal with her suburbs; four cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Dimnah and Nahalal with their grass-lands, four towns. \n\u003cbr\u003e21:36 [hgb]\u0026nbsp; 又 从 流 便 支 派 的 地 业 中 给 了 他 们 比 悉 和 属 城 的 郊 野 ， 雅 杂 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the tribe of Reuben, Bezer with her suburbs, and Jahazah with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the tribe of Reuben, Bezer and Jahaz with their grass-lands; \n\u003cbr\u003e21:37 [hgb]\u0026nbsp; 基 底 莫 和 属 城 的 郊 野 ， 米 法 押 和 属 城 的 郊 野 ， 共 四 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Kedemoth with her suburbs, and Mephaath with her suburbs; four cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Kedemoth and Mephaath with their grass-lands, four towns. \n\u003cbr\u003e21:38 [hgb]\u0026nbsp; 又 从 迦 得 支 派 的 地 业 中 ， 将 基 列 的 拉 末 ， 就 是 误 杀 人 的 逃 城 和 属 城 的 郊 野 ， 给 了 他 们 。 又 给 他 们 玛 哈 念 和 属 城 的 郊 野 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the tribe of Gad, Ramoth in Gilead with her suburbs, to be a city of refuge for the slayer; and Mahanaim with her suburbs, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the tribe of Gad, Ramoth in Gilead, the town where the taker of life might be safe, and Mahanaim with their grass-lands; \n\u003cbr\u003e21:39 [hgb]\u0026nbsp; 希 实 本 和 属 城 的 郊 野 ， 雅 谢 和 属 城 的 郊 野 ， 共 四 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Heshbon with her suburbs, Jazer with her suburbs; four cities in all. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Heshbon and Jazer with their grass-lands, four towns. \n\u003cbr\u003e21:40 [hgb]\u0026nbsp; 其 余 利 未 支 派 的 人 ， 就 是 米 拉 利 的 子 孙 ， 按 着 宗 族 拈 阄 所 得 的 ， 共 十 二 座 城 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; So all the cities for the children of Merari by their families, which were remaining of the families of the Levites, were by their lot twelve cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All these towns were given to the children of Merari by their families, that is, the rest of the families of the Levites; and their heritage was twelve towns. \n\u003cbr\u003e21:41 [hgb]\u0026nbsp; 利 未 人 在 以 色 列 人 的 地 业 中 所 得 的 城 ， 共 四 十 八 座 ， 并 有 属 城 的 郊 野 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; All the cities of the Levites within the possession of the children of Israel were forty and eight cities with their suburbs. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All the towns of the Levites, among the heritage of the children of Israel, were forty-eight towns with their grass-lands. \n\u003cbr\u003e21:42 [hgb]\u0026nbsp; 这 些 城 四 围 都 有 属 城 的 郊 野 ， 城 城 都 是 如 此 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; These cities were every one with their suburbs round about them: thus were all these cities. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Every one of these towns had grass-lands round it. \n\u003cbr\u003e21:43 [hgb]\u0026nbsp; 这 样 ， 耶 和 华 将 从 前 向 他 们 列 祖 起 誓 所 应 许 的 全 地 赐 给 以 色 列 人 ， 他 们 就 得 了 为 业 ， 住 在 其 中 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the LORD gave unto Israel all the land which he sware to give unto their fathers; and they possessed it, and dwelt therein. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So the Lord gave to Israel all the land which he gave by oath to their fathers; so it became their heritage and their living-place. \n\u003cbr\u003e21:44 [hgb]\u0026nbsp; 耶 和 华 照 着 向 他 们 列 祖 起 誓 所 应 许 的 一 切 话 ， 使 他 们 四 境 平 安 。 他 们 一 切 仇 敌 中 ， 没 有 一 人 在 他 们 面 前 站 立 得 住 。 耶 和 华 把 一 切 仇 敌 都 交 在 他 们 手 中 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the LORD gave them rest round about, according to all that he sware unto their fathers: and there stood not a man of all their enemies before them; the LORD delivered all their enemies into their hand. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the Lord gave them peace on every side, as he had said to their fathers: all those who were against them gave way before them, for the Lord gave them all up into their hands. \n\u003cbr\u003e21:45 [hgb]\u0026nbsp; 耶 和 华 应 许 赐 福 给 以 色 列 家 的 话 一 句 也 没 有 落 空 ， 都 应 验 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; There failed not ought of any good thing which the LORD had spoken unto the house of Israel; all came to pass. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord kept faith with the house of Israel about all the good which he said he would do for them, and all his words came true.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/21/507.html","bookId":239,"creation":"Aug 1, 2019 7:37:10 AM","modification":"Aug 1, 2019 7:37:10 AM"}
