{"id":88844,"no":5,"title":"Page 5","content":"\u003cp\u003eWe\u0027re both excited as hell, and I make her come even before I shoot my load all over my stomach, a few minutes later. It doesn\u0027t happen often that she gives me a hand job, and I really don\u0027t care; just wipe myself clean with my t-shirt. Bella looks exceptionally pleased with herself as we make our way upstairs, where we shower together before we fall into our bed.\u003c/p\u003e\n\u003cp\u003eShe\u0027s asleep in minutes, lying half on my shoulder and chest, and I spend nearly an hour just staring at her beautiful face, tired but unable to fall sleep myself. My thoughts return to my conversation with Beth, and I want to deny that she was right, that I have to do something to make sure that I don\u0027t keep dragging on Bella\u0027s happiness like I used to, inadvertently.\u003c/p\u003e\n\u003cp\u003eBecause for her, I\u0027d simply do anything.\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eYesterday it all sounded so perfect. Why then am I shitting my pants today?\u003c/p\u003e\n\u003cp\u003eIt\u0027s not like I haven\u0027t done any joint scene planning before. Beth and Peter both helped me when I had my first sub, and I\u0027ve always talked everything through in detail with Charlotte when she let me tie her up. Over the years I\u0027ve been doing it over and over again with subs I\u0027ve only played with for a scene or two. Why the anxiety now?\u003c/p\u003e\n\u003cp\u003eIt\u0027s not even a rational fear, just a feeling in my gut. As if Bella would laugh at me if I say something stupid. It\u0027s ridiculous, really, but it won\u0027t go away, as much as I try to get a grip on myself.\u003c/p\u003e\n\u003cp\u003eI spent the whole day fretting over what to tell her, but by the time I\u0027m home again, I still haven\u0027t come up with an idea that I think is worthy of the occasion. It suddenly seems as if we\u0027ve done everything at least five times already, and try as I might, nothing really new comes to my mind. Bella is of course ecstatic to have me home again, jumping into my arms and kissing my whole face before I\u0027m even through the door. I don\u0027t want to disappoint her with being the least inventive guy in the world, but I don\u0027t see how she won\u0027t frown at how little I have come up with.\u003c/p\u003e\n\u003cp\u003eWe\u0027ve both already eaten dinner, so it\u0027s just a matter of getting some coffee, and we sit down on the couch. More precisely, I sit down on the couch and Bella settles on my thighs, facing me. Of course having her straddle me makes me overtly aware that I didn\u0027t find the time today to jerk off in the toilet after spending my lunch break fantasizing about the many ways I could tie her up, always a bad idea, that.\u003c/p\u003e\n\u003cp\u003e“So, you ready for our talk?”\u003c/p\u003e\n\u003cp\u003eI\u0027m always ready for you, Bella, and when you look at me like that, something else than \u0027talking\u0027 comes to mind.\u003c/p\u003e\n\u003cp\u003eI have no idea where I find the self-restraint to keep my hands on the couch, as I really want to touch her, but she looks all cute in her eagerness, and I tell myself I can always fuck her later. Probably have to or else I will explode, and not just in my pants.\u003c/p\u003e\n\u003cp\u003e“I guess I am. So what do you wanna know?”\u003c/p\u003e\n\u003cp\u003eBella nibbles on her bottom lip, and I so want to drag it from between her teeth with my own, but instead take a sip of my coffee. I know this will get a lot worse before it gets better, and I try to keep a tight grip on myself.\u003c/p\u003e\n\u003cp\u003e\u0027Tight grip\u0027 just reminds me of what she did to me yesterday, and my problem grows at least an inch. Great conversation starter, really. Yeah, Bella, so I have been trying to think, but really I just have a boner, and don\u0027t you want to take care of that before we start talking of the many ways I want to have you in my playroom, so that I can ask you for a repeat performance in five minutes again?\u003c/p\u003e\n\u003cp\u003eFor some reason my thoughts are not plain on my face, or else Bella is distracted, because she doesn\u0027t do any of the things she usually resorts to when she realizes that the monster in my jeans is awake and drooling for her, but instead plucks on some imaginary lint on her sleeve.\u003c/p\u003e\n\u003cp\u003e“How do you come up with ideas? I know you don\u0027t use any cheat sheets or anything like that. Although the notion cracks me up.” I try hard to concentrate on the question, but the answer doesn\u0027t exactly help my problem.\u003c/p\u003e\n\u003cp\u003e“The internet, mostly.”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t tell me you watch porn online!”\u003c/p\u003e\n\u003cp\u003eI laugh, mostly at the way she scrunches up her nose.\u003c/p\u003e\n\u003cp\u003e“You know what\u0027s on my hard drive, no need to turn on the modem for that.”\u003c/p\u003e\n\u003cp\u003eBella considers that for a moment, but once again doesn\u0027t acknowledge my\u003c/p\u003e\n\u003cp\u003e\u0027collection\u0027.\u003c/p\u003e\n\u003cp\u003e“If it\u0027s not porn that you\u0027re watching, what are you doing instead?”\u003c/p\u003e\n\u003cp\u003e“Research.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“The shoot previews of some of the kinky sites.”\u003c/p\u003e\n\u003cp\u003eHer nose does that adorable twitching again.\u003c/p\u003e\n\u003cp\u003e“And how is that not porn?”\u003c/p\u003e\n\u003cp\u003e“It\u0027s just pictures. And some text.”\u003c/p\u003e\n\u003cp\u003e“How is something like \u0027and then she gets fucked hard, tied in various positions\u0027 with demonstrative pictures not porn?”\u003c/p\u003e\n\u003cp\u003eI grin up at her when I see her cheeks turn slightly red. “Why, is that a direct quote, love?”\u003c/p\u003e\n\u003cp\u003eMore lip biting, and her shrug doesn\u0027t seem too convincing.\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003e“Maybe?”\u003c/p\u003e\n\u003cp\u003eShe glares at me for a moment, but then shrugs once more. “So I went through your visited links this afternoon after Beth told me about your\u003c/p\u003e\n\u003cp\u003e\u0027accident\u0027 the other day, and maybe got a little caught up there. So what?!” Her indignation, together with the deepening blush, just makes me laugh.\u003c/p\u003e\n\u003cp\u003eAwesome, my girl is getting turned on by snooping around the same sites as I do. I don\u0027t even mind that she did it, might have been more fun doing it together, though.\u003c/p\u003e\n\u003cp\u003e“Whether it\u0027s porn or not doesn\u0027t really matter. It\u0027s great inspirational material.”\u003c/p\u003e\n\u003cp\u003eBella is still pursing her lips, but then she lets it slide.\u003c/p\u003e\n\u003cp\u003e“Okay. Inspiration has struck, what\u0027s next?”\u003c/p\u003e\n\u003cp\u003e“Then I try to decide on a general theme. Like, what do I want to base the whole scene on? Bondage, toys, role playing, that kind of thing.” She nods. “And what have you come up with for our planning?” I try to decide what I should tell her, but I know it\u0027s best to keep it simple.\u003c/p\u003e\n\u003cp\u003eAs our conversation goes on, the remaining anxiety falls away and all that\u0027s left is excitement that I can share this with her.\u003c/p\u003e\n\u003cp\u003e“Two scenes. One more action driven, the other all about sensations.” Bella visibly perks up. “Oh? Tell me more. Action driven one first. That sounds way dirtier.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes at her, but really want to kiss her for being so receptive.\u003c/p\u003e\n\u003cp\u003e“I guess it is, although probably not the way you think. If I have my say, which I guess I do have, seeing as I\u0027m your Dom, you won\u0027t have too much freedom of movement in either scenario.”\u003c/p\u003e\n\u003cp\u003eShe makes a face in response, but the glint in her eyes doesn\u0027t go away.\u003c/p\u003e\n\u003cp\u003e“So what are you going to do with me? Tie me up?”\u003c/p\u003e\n\u003cp\u003e“I thought about trying something new that we haven\u0027t really done before to that extent. You remember that screw-on board for the padded bench that you asked me about when we were packing up the playroom for the move?”\u003c/p\u003e\n\u003cp\u003e“The one with the weird holes? You never told me what it is, exactly.”\u003c/p\u003e\n\u003cp\u003e“Stocks.”\u003c/p\u003e\n\u003cp\u003eI can see her thoughts running wild behind her eyes, and she cocks her head to the side, considering.\u003c/p\u003e\n\u003cp\u003e“As in medieval stocks, that thing they put people in on the town square so everyone could throw foul vegetables at them?”\u003c/p\u003e\n\u003cp\u003eThe visual makes me laugh.\u003c/p\u003e\n\u003cp\u003e“Exactly, only that I won\u0027t throw anything at you.” I give her a few moments to think about that, meanwhile running my hands up and down her thighs in what I hope is a soothing gesture. A light frown mars her forehead while she contemplates my suggestion, but finally she nods, making my heart skip a beat or two in anticipation.\u003c/p\u003e\n\u003cp\u003e“Just my hands, or my neck, too? I remember there were three holes in that wood frame.”\u003c/p\u003e\n\u003cp\u003e“You decide how far you want to go, whatever you want is fine with me. We can do just your hands, so you\u0027ll be secured, but you can still move your body somewhat freely as long as you don\u0027t get off the bench. I won\u0027t lie, I\u0027d like to secure your neck, too. Don\u0027t worry, the whole thing is padded, and the holes are large enough that you won\u0027t even feel it around your neck if you keep your head straight. But that way you\u0027re fully restrained and can\u0027t even look over your shoulder, so that whatever I do behind your back you won\u0027t know until I touch you.”\u003c/p\u003e\n\u003cp\u003eMy cock definitely likes the picture of Bella\u0027s ass sticking into the air that way. She still looks a little hesitant, so I bring my hands up to cup her face, and stroke her cheeks gently.\u003c/p\u003e\n\u003cp\u003e“Just think about it for a moment. You\u0027re kneeling on the bench, your wrists and neck all secured so you can\u0027t move, can\u0027t get away. You\u0027re vulnerable, helpless, more so than ever before because the rope you can pull off, and the cuffs are not that hard to unbuckle, either, but there\u0027s no way you can open the stocks yourself, you\u0027re completely at my mercy.” I let my hands drift lower so that I\u0027m running my fingers down to her shoulders, idly stroking over her soft skin.\u003c/p\u003e\n\u003cp\u003e“That also means that your ass is in the air, and I can run my fingers up and down your thighs, or in between. Maybe I\u0027ll even tie your ankles to the bench, spread wide to leave you completely open to me. There\u0027s really not much you can do now, I can touch you, spank you, fuck you, make you come over and over again – whatever I want to do to you.” Her lips are slightly parted by the end of my little explanation, and I can tell that I\u0027m not the only one who\u0027s excited about the idea.\u003c/p\u003e\n\u003cp\u003e“How does that sound to you, my little minx?”\u003c/p\u003e\n\u003cp\u003eShe shrugs, trying to play cool but utterly failing.\u003c/p\u003e\n\u003cp\u003e“I just don\u0027t know if I want you to fuck me while my neck is inside a rigid wooden structure, padded or not.”\u003c/p\u003e\n\u003cp\u003eOh, she\u0027s good, still thinking straight even though she must be more than just a little aroused by now, judging from the way she is grinding herself against my legs.\u003c/p\u003e\n\u003cp\u003e“It would probably be a good idea to get your neck out of the stocks before I do that. But for fucking your mouth or having you jerk me off with your hand I think I can keep you all locked up.”\u003c/p\u003e\n\u003cp\u003eShe bites her lip, and her fingers close around my forearms, making my hands still.\u003c/p\u003e\n\u003cp\u003e“And would you just fuck my mouth and pussy?”\u003c/p\u003e\n\u003cp\u003e“Probably not. I think I\u0027d even order you to properly clean yourself beforehand, so I can do whatever I want with your ass.” Now she\u0027s squirming for real, but she doesn\u0027t veto that idea. Bella doesn\u0027t really seem opposed to that at all, as I find out when she answers me.\u003c/p\u003e\n\u003cp\u003e“I think I really like that idea. So what was the other, sensation based scene?”\u003c/p\u003e\n\u003cp\u003eAs she\u0027s already so hot and bothered, I figure I can be more daring than I thought at first.\u003c/p\u003e\n\u003cp\u003e“Remember when I blindfolded you the last time? How that heightened what you felt?”\u003c/p\u003e\n\u003cp\u003eHer nod is eager, and I hear her breath pick up. “Yes.”\u003c/p\u003e\n\u003cp\u003e“I want to do something like that again, only go a little further. You just have to trust me.”\u003c/p\u003e\n\u003cp\u003e“I always trust you.”\u003c/p\u003e\n\u003cp\u003eI\u0027m not sure she really does, but she trusts me enough, and scenes like the one on my mind will hopefully further that trust.\u003c/p\u003e\n\u003cp\u003e“Good. Because I want to blindfold you, and then I want to gag you, and then I want to tie you up in a way that you can\u0027t really move anymore. I promise you, I won\u0027t leave your side, but you\u0027ll have no way of knowing what I\u0027m up to. And even though I\u0027ll just touch you, kiss you and caress you gently, you won\u0027t see it coming, you won\u0027t anticipate anything.” I can see her unease, and I\u0027m not really surprised by that.\u003c/p\u003e\n\u003cp\u003e“Do you really have to gag me?”\u003c/p\u003e\n\u003cp\u003e“That\u0027s the plan.”\u003c/p\u003e\n\u003cp\u003eShe nods, but not too happily.\u003c/p\u003e\n\u003cp\u003e“What if I have to use my safe word? How will you know if I panic?” The answer should be obvious, but again I\u0027m relieved that she thinks about her own safety, too.\u003c/p\u003e\n\u003cp\u003e“First off, if you panic, you squirm differently than when you\u0027re aroused, and I will definitely pay close attention to you. Second, we\u0027ll use a safe signal that doesn\u0027t involve formulating words, something like three quick grunts.\u003c/p\u003e\n\u003cp\u003eAnd third, I\u0027ll give you one of those toy balls that make these awful noises when you squeeze them. Don\u0027t worry, I\u0027ll be there to calm you down and release you, should you want that.”\u003c/p\u003e\n\u003cp\u003eMy assurance pacifies her, but she\u0027s still uneasy.\u003c/p\u003e\n\u003cp\u003e“That\u0027s all you\u0027ll be doing, kissing and touching me? Sounds a little tame for your standards.”\u003c/p\u003e\n\u003cp\u003eAnd just like that, her playful nature is peeking through.\u003c/p\u003e\n\u003cp\u003e“All I would do for a first attempt. Why, want me to do more?” Bella shrugs, clearly contemplating what to say.\u003c/p\u003e\n\u003cp\u003e“I think it would be nice if you make me come, too. I mean I love it when you make me come when I\u0027m tied up, now with the focus even more on your touch, it might feel really good if you, you know, eat me out.” I grin up at her. “Sounds good to me.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eI should probably leave it at that, and be happy that I don\u0027t have to convince her of anything, but that would be too easy. I don\u0027t know why, but whenever she\u0027s this quick to comply, I feel I\u0027m not trying hard enough.\u003c/p\u003e\n\u003cp\u003e“Do you think you might be up for a little more if we get to that, and you\u0027re feeling okay with the restriction and being blindfolded and gagged?”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003eShe\u0027s already biting her lip in anticipation again, and that drives me a wild.\u003c/p\u003e\n\u003cp\u003e“Clothes pins.”\u003c/p\u003e\n\u003cp\u003eA shudder runs through her at my words, but she doesn\u0027t immediately shake her head.\u003c/p\u003e\n\u003cp\u003e“Go on.”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t worry, I won\u0027t snap them off you, or anything like that. Just put a few on your nipples and pussy lips, before I lick you. They shouldn\u0027t really hurt, but as your nipples grow hard and your labia go all puffy, the sensation will change and heighten. I\u0027ll take them off before I make you come, if you want, but either way, you won\u0027t regret it.”\u003c/p\u003e\n\u003cp\u003eBella keeps looking deep into my eyes, and whatever she sees in there makes her nod after a few moments.\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eNot the most emphatic answer, but the best I\u0027m going to get, until I make her come over and over again while she screams into the gag, of course.\u003c/p\u003e\n\u003cp\u003eMy cock is twitching in anticipation, and I\u0027m starting to think that this conversation is a really bad idea if it means we have to finish it before I can drag her up into the bedroom.\u003c/p\u003e\n\u003cp\u003e“Trust me, remember?” I try to chase away the frown that\u0027s still on her face.\u003c/p\u003e\n\u003cp\u003eBella cocks her head again, and then she\u0027s suddenly sporting a nasty smile.\u003c/p\u003e\n\u003cp\u003e“You know that I\u0027ll pay you back next week, right?” Yes, please, do your worst, we both know I\u0027ll love it. Although right now I\u0027d rather add to the toll by having my wicked ways with her.\u003c/p\u003e\n\u003cp\u003eOut loud I leave it at a nearly derisive “Whatever,” but I can see that she isn\u0027t that easily deterred.\u003c/p\u003e\n\u003cp\u003e“It\u0027s just sad that I can\u0027t really tie you up. I think I\u0027d really like you all stretched up and at my mercy.”\u003c/p\u003e\n\u003cp\u003e“You can use cuffs, and some leather straps.”\u003c/p\u003e\n\u003cp\u003eMy answer confuses her for a moment. “How?”\u003c/p\u003e\n\u003cp\u003eI have to fight the urge to tease her, but I don\u0027t think she\u0027d appreciate that just now.\u003c/p\u003e\n\u003cp\u003e“You said you want me all stretched up, so I guess you want me standing up? If you really want to keep me restrained, you can cuff my wrists to the pole we have in the corner of the playroom, and use some leather straps to secure the rest of my body, maybe one over my hips, another two over my thighs?”\u003c/p\u003e\n\u003cp\u003eThe idea clearly appeals to her, and not for the first time I wonder if I\u0027ve created a monster. One I love dearly, but still. The way things started out I\u0027d never have thought her to find the confidence to turn the tables on me so quickly. Shit, that day under the pier I\u0027d been so afraid of losing her for good, and now she\u0027s plotting how to go all nasty on me.\u003c/p\u003e\n\u003cp\u003e“Just how good is that for keeping you restrained? Because I really want you unable to move.” Her eyes gaze deeply into mine as she leans closer to me. “How did you put it? I want you completely helpless and vulnerable.” While she\u0027s talking, her fingers skim over my chest down to my waistband, and I\u0027m yearning for her touch. She stops there and toys with the button of my jeans, all playful now. I try to ease my ass off the couch, but she\u0027s still sitting on my legs, so I can\u0027t really push myself against her.\u003c/p\u003e\n\u003cp\u003e“Show me how to use a flogger again next weekend? I\u0027m not sure I remember everything from Beth\u0027s lesson.”\u003c/p\u003e\n\u003cp\u003eI nod, my mouth going dry. I really didn\u0027t expect her to ask me that, but apparently she\u0027s starting to ease up on her claim that she doesn\u0027t want to hurt me. Not that she\u0027ll do much damage either way, but I realize that she\u0027s leaving her comfort zone there.\u003c/p\u003e\n\u003cp\u003e“How long do you want to continue this conversation? Because if you keep on like this, I\u0027m going to come in my pants.”\u003c/p\u003e\n\u003cp\u003eBella laughs, a wonderful, throaty sound. I decide that the time for talking is over, and cuddling is so overrated sometimes.\u003c/p\u003e\n\u003cp\u003e“Why, have you something better on your mind?”\u003c/p\u003e\n\u003cp\u003e“You, bent over the back of this couch, while I fuck you hard from behind.” Her breath hitches at my suggestion, but she\u0027s apparently reluctant to give it up that easily, teasing minx that she is.\u003c/p\u003e\n\u003cp\u003e“I want to look at you. I want to feel you deep inside of me while I draw you closer with my legs. But the \u0027fuck me hard\u0027 part we can keep, no objection against that.”\u003c/p\u003e\n\u003cp\u003eI consider that, but really, who am I to protest? So I reach for her and draw her close to me, rubbing my nose along her neck before I trail kisses up to her mouth. Bella moans, her fingers already in my hair, and a moment later she\u0027s tearing at my shirt. I quickly rid her of her top and bra, pausing in my effort to undress her quickly to lightly chew on her nipples. Her breathless laughter goes straight to my cock, and a second later I have her on her back on the couch, yanking her pants off before I drop my jeans and boxers.\u003c/p\u003e\n\u003cp\u003eI lean over her and she immediately wraps her arms around my neck, drawing me closer. I step between her spread legs, my cock already unbearably hard, but Bella doesn\u0027t look like she\u0027ll appreciate me teasing her for long.\u003c/p\u003e\n\u003cp\u003eWhile I pull her hips closer to the edge of the couch she grabs my dick, but this time I won\u0027t have any of that. Her teeth scrape along my throat and over to my shoulder while her fingers yank hard enough on my hair to hurt, fanning the stubborn resentment on that\u0027s suddenly overwhelming me.\u003c/p\u003e\n\u003cp\u003eOf course I love her, and of course I want to satisfy her needs, and the overtly dominant behavior she\u0027s displaying this week is a huge turn on, but I\u0027ve simply spent too much time in Dom mode today to let her get away with that.\u003c/p\u003e\n\u003cp\u003eSo I grab her around the waist and drag her off the couch and towards the kitchen table. Bella squawks indignantly, confusion plain on her face.\u003c/p\u003e\n\u003cp\u003e“What the fu-”\u003c/p\u003e\n\u003cp\u003eI clamp my hand roughly over her mouth to shut her up while I press her torso onto the table, keeping her pinned while I kick her legs apart. She\u0027s slow to comply but doesn\u0027t struggle. I lean over her and sneer, pitching my voice to a husky growl.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t even think of resisting me, or I\u0027ll make you regret it. I\u0027m going to fuck you, use you for my pleasure, and you better keep your hands flat on the table, unless you want a sound spanking beforehand?” Bella mumbles something into my hand, but I don\u0027t let go of her, instead take her meek compliance for the affirmation that it is. I know that my \u003c/p\u003e","sourceLink":"https://allnovel.net/beautiful-disaster-beautiful-1/page-5.html","bookId":2786,"creation":"Oct 5, 2019 5:32:01 PM","modification":"Oct 5, 2019 5:32:01 PM"}
