{"id":34801,"no":13,"title":"CHAPTER XIII TONY GETS A PLACE","content":"Toward the close of the next day the tin peddler halted in front of a country tavern.\n\u003cbr\u003e \n\u003cbr\u003e I’m going to stay here overnight,” he said.\n\u003cbr\u003e \n\u003cbr\u003e Maybe they’ll let me sleep in the barn,” said Tony.\n\u003cbr\u003e \n\u003cbr\u003e In the barn! Why not in the house?”\n\u003cbr\u003e \n\u003cbr\u003e “I haven’t got any money, you know Mr. Bickford.”\n\u003cbr\u003e \n\u003cbr\u003e “What’s the odds? They won’t charge anything extra for you to sleep with me.”\n\u003cbr\u003e \n\u003cbr\u003e “You’re very kind, Mr. Bickford, but they won’t keep me for nothing, and I don’t want you to pay for me.”\n\u003cbr\u003e \n\u003cbr\u003e At this moment the landlord came out on the piazza, and asked the hostler:\n\u003cbr\u003e \n\u003cbr\u003e “Where’s Tom?”\n\u003cbr\u003e \n\u003cbr\u003e “Gone home—says he’s sick,” answered James.\n\u003cbr\u003e \n\u003cbr\u003e Drat that boy! It’s my opinion he was born lazy. That’s what’s the matter with him.”\n\u003cbr\u003e \n\u003cbr\u003e “I guess you’re right, Mr. Porter,” said James.\n\u003cbr\u003e \n\u003cbr\u003e I wouldn’t take him back if I had anybody to take his place.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you hear that, Tony?” said the peddler.\n\u003cbr\u003e \n\u003cbr\u003e Tony walked to the landlord and said:\n\u003cbr\u003e \n\u003cbr\u003e “I’ll take his place.”\n\u003cbr\u003e \n\u003cbr\u003e “Who are you?” asked the landlord, in surprise.\n\u003cbr\u003e \n\u003cbr\u003e I have just come,” said Tony.\n\u003cbr\u003e \n\u003cbr\u003e What can you do?”\n\u003cbr\u003e \n\u003cbr\u003e “Anything you want me to do.”\n\u003cbr\u003e \n\u003cbr\u003e “Have you any references?”\n\u003cbr\u003e \n\u003cbr\u003e “I can refer to him,” said Tony, pointing to the tin peddler.\n\u003cbr\u003e \n\u003cbr\u003e Oh, Mr. Bickford,” said the landlord, with a glance of recognition. “Well, that’s enough. I’ll take you. James, take this boy to the kitchen, and give him some supper. What’s your name, boy?”\n\u003cbr\u003e \n\u003cbr\u003e “Tony Rugg.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well, Tony, I’ll give you three dollars a week and your board as long as we suit each other.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ve got work sooner than I expected,” thought Tony.\n\u003cbr\u003e \n\u003cbr\u003e The hostler set him to work in the barn, and, though he was new to the work, he quickly understood what was wanted, and did it.\n\u003cbr\u003e \n\u003cbr\u003e You work twice as fast as Sam,” said the hostler.\n\u003cbr\u003e \n\u003cbr\u003e Won’t Sam be mad when he finds I have taken his place?” asked Tony.\n\u003cbr\u003e \n\u003cbr\u003e Probably he will, but it’s his own fault.”\n\u003cbr\u003e \n\u003cbr\u003e “Not if he’s sick.”\n\u003cbr\u003e \n\u003cbr\u003e “He’s no more sick than I am.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, I am glad he left a vacancy for me,” said Tony.\n\u003cbr\u003e \n\u003cbr\u003e Where did you work last?” asked the hostler.\n\u003cbr\u003e \n\u003cbr\u003e Nowhere.”\n\u003cbr\u003e \n\u003cbr\u003e “Never worked? Then how did you live?”\n\u003cbr\u003e \n\u003cbr\u003e “I traveled with my guardian.”\n\u003cbr\u003e \n\u003cbr\u003e “Were you rich?” asked James.\n\u003cbr\u003e \n\u003cbr\u003e No; I just went round and lived as I could. I didn’t like it, but I couldn’t help it. I had to go where Rudolph chose to lead me.”\n\u003cbr\u003e \n\u003cbr\u003e “Where is he now?”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know. I got tired of being a tramp, and ran away from him.”\n\u003cbr\u003e \n\u003cbr\u003e “You did right,” said James, who was a steady man, and looked forward to a snug home of his own ere long. “All the same, Mr. Porter wouldn’t have taken you if he had known you were a tramp.”\n\u003cbr\u003e \n\u003cbr\u003e “I hope you won’t tell him, then.”\n\u003cbr\u003e \n\u003cbr\u003e “No; I won’t tell him. I want you to stay here.”\n\u003cbr\u003e \n\u003cbr\u003e Tony was assigned to a room in the attic. There were two beds in this chamber, one being occupied by James. He slept soundly, and was up betimes in the morning. After breakfast Mr. Bickford, the tin peddler, made ready to start.\n\u003cbr\u003e \n\u003cbr\u003e Good-by, Tony,” he said, in a friendly manner, “I’m glad you’ve got a place.”\n\u003cbr\u003e \n\u003cbr\u003e “I wouldn’t have got it if I hadn’t you to refer to.”\n\u003cbr\u003e \n\u003cbr\u003e “The landlord didn’t ask how long I’d known you,” said Bickford, smiling. “Good luck to you.”\n\u003cbr\u003e \n\u003cbr\u003e As the peddler drove away, Tony noticed a big, overgrown boy, who was just entering the hotel yard.\n\u003cbr\u003e \n\u003cbr\u003e That’s Sam,” said the hostler. “He don’t know he’s lost his place.”\n\u003cbr\u003e \n\u003cbr\u003e Sam was about two inches taller than Tony, red-haired, and freckled, with a big frame, loosely put together. He was a born bully, and many were the tricks he had played on smaller boys in the village.\n\u003cbr\u003e \n\u003cbr\u003e Sam strutted into the yard with the air of a proprietor. He took no particular notice of Tony, but accosted James. The latter made a signal to Tony to be silent.\n\u003cbr\u003e \n\u003cbr\u003e Well, have you just got along?” asked the hostler.\n\u003cbr\u003e \n\u003cbr\u003e Ye-es,” drawled Sam.\n\u003cbr\u003e \n\u003cbr\u003e What made you go home yesterday afternoon?”\n\u003cbr\u003e \n\u003cbr\u003e “I didn’t feel well,” said Sam nonchalantly.\n\u003cbr\u003e \n\u003cbr\u003e Do you think Mr. Porter can afford to pay you wages, and let you go home three times a week in the middle of the afternoon?”\n\u003cbr\u003e \n\u003cbr\u003e “I couldn’t work when I was sick of course.”\n\u003cbr\u003e \n\u003cbr\u003e “I suppose you have come to work this morning?”\n\u003cbr\u003e \n\u003cbr\u003e “Ye-es, but I can’t work very hard—I ain’t quite got over my headache.”\n\u003cbr\u003e \n\u003cbr\u003e “Then you’ll be glad to hear that you won’t have to work at all.”\n\u003cbr\u003e \n\u003cbr\u003e “Ain’t there anything to do?” asked Sam.\n\u003cbr\u003e \n\u003cbr\u003e Yes, there’s plenty to do, but your services ain’t required. You’re bounced!”\n\u003cbr\u003e \n\u003cbr\u003e “What!” exclaimed Sam.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Porter’s got tired of your delicate health. It interferes too much with business. He’s got a tougher boy to take your place.”\n\u003cbr\u003e \n\u003cbr\u003e “Where is he?” demanded Sam.\n\u003cbr\u003e \n\u003cbr\u003e There,” answered the hostler, pointing out our hero, who stood quietly listening to the conversation.\n\u003cbr\u003e \n\u003cbr\u003e Sam regarded Tony with a contemptuous scowl.\n\u003cbr\u003e \n\u003cbr\u003e Who are you?” he demanded roughly.\n\u003cbr\u003e \n\u003cbr\u003e Your successor,” answered Tony coolly.\n\u003cbr\u003e \n\u003cbr\u003e What business had you to take my place?”\n\u003cbr\u003e \n\u003cbr\u003e “The landlord hired me.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t care if he did. He hired me first.”\n\u003cbr\u003e \n\u003cbr\u003e “Then you’d better go to him and complain about it. It’s none of my business—?—” “It’s my business,” said Sam, with emphasis.\n\u003cbr\u003e \n\u003cbr\u003e Just as you like.”\n\u003cbr\u003e \n\u003cbr\u003e “Will you give up the place?”\n\u003cbr\u003e \n\u003cbr\u003e “No,” said Tony. “You must think I’m a fool. What should I give it up for?”\n\u003cbr\u003e \n\u003cbr\u003e “Because it belongs to me.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t see that. I suppose Mr. Porter has a right to hire anybody he likes.”\n\u003cbr\u003e \n\u003cbr\u003e “He had no right to give you my place.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s his business. What shall I do next, James?”\n\u003cbr\u003e \n\u003cbr\u003e “Go and shake down some hay for the horses.”\n\u003cbr\u003e \n\u003cbr\u003e Sam walked off deeply incensed, muttering threats of vengeance against Tony.\n\u003cbr\u003e \n\u003cbr\u003e Three days later a boy entered the stable, and, calling for Tony, presented the following missive:\n\u003cbr\u003e \n\u003cbr\u003e “If you ain’t a coward, meet me to-morrow night at seven o’clock, back of the schoolhouse, and we’ll settle, by fighting, which shall have the place, you or I? If you get licked you must clear out and leave it to me.”\n\u003cbr\u003e \n\u003cbr\u003e “Sam Payson.”\n\u003cbr\u003e \n\u003cbr\u003e Tony showed the note to the hostler.\n\u003cbr\u003e \n\u003cbr\u003e Well, Tony, what are you going to do about it?”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll be on hand,” said Tony, promptly.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2019/57598.html","bookId":622,"creation":"Aug 5, 2019 5:56:05 AM","modification":"Aug 5, 2019 5:56:05 AM"}
