{"id":34804,"no":16,"title":"CHAPTER XVI AT THE ST. REGIS","content":"When Rudolph reached the sidewalk he stopped to reflect on the meaning of the advertisement.\n\u003cbr\u003e \n\u003cbr\u003e Perhaps it’s a trap,” he thought. “Perhaps after so many years they want to punish me. Shall I go?”\n\u003cbr\u003e \n\u003cbr\u003e His hesitation was only temporary.\n\u003cbr\u003e \n\u003cbr\u003e Ten minutes’ walk brought him to Nassau street. He ascended to the proper floor, opened the door of No. 1,503, and found himself in a lawyer’s office. A tall man of forty was seated at a desk.\n\u003cbr\u003e \n\u003cbr\u003e Well,” he said, “what can I do for you, sir?”\n\u003cbr\u003e \n\u003cbr\u003e The address was not very cordial, for Rudolph did not have the look of one likely to be a profitable client.\n\u003cbr\u003e \n\u003cbr\u003e Are you Mr. Jacob Morris, attorney-at-law?”\n\u003cbr\u003e \n\u003cbr\u003e “That is my name.”\n\u003cbr\u003e \n\u003cbr\u003e “I am Rudolph Rugg.”\n\u003cbr\u003e \n\u003cbr\u003e “Rudolph Rugg!” exclaimed the lawyer briskly, jumping from his chair. “You don’t say so. I am very glad to see you. Take a chair, please.”\n\u003cbr\u003e \n\u003cbr\u003e Reassured by this reception, Rudolph took the seat indicated.\n\u003cbr\u003e \n\u003cbr\u003e So you saw my advertisement?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir. I only saw it this morning.”\n\u003cbr\u003e \n\u003cbr\u003e “It has been inserted for the last two weeks, daily. How happens it that you did not see it sooner?”\n\u003cbr\u003e \n\u003cbr\u003e “I have been away from the city. It was only an accident that I happened to see it to-day.”\n\u003cbr\u003e \n\u003cbr\u003e “A lucky accident, Mr. Rugg.”\n\u003cbr\u003e \n\u003cbr\u003e “I hope it is, sir, for I’ve been out of luck. What is the business, sir?”\n\u003cbr\u003e \n\u003cbr\u003e “My business has been to find you.”\n\u003cbr\u003e \n\u003cbr\u003e “What for?”\n\u003cbr\u003e \n\u003cbr\u003e “For a client of mine—an English lady.”\n\u003cbr\u003e \n\u003cbr\u003e “A lady?” ejaculated the tramp.\n\u003cbr\u003e \n\u003cbr\u003e Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “Who is it?”\n\u003cbr\u003e \n\u003cbr\u003e “I suppose I am at liberty to tell. The lady is Mrs. Harvey Middleton, of Middleton Hall, England.”\n\u003cbr\u003e \n\u003cbr\u003e A peculiar expression swept over Rudolph’s face, but he only said:\n\u003cbr\u003e \n\u003cbr\u003e “I have heard the name of Harvey Middleton. Is—is the lady in New York?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; she is staying at the St. Regis Hotel.”\n\u003cbr\u003e \n\u003cbr\u003e “And she wants to find me?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. She authorized me to seek you out.”\n\u003cbr\u003e \n\u003cbr\u003e “Well,” said Rudolph, “what next?”\n\u003cbr\u003e \n\u003cbr\u003e “I shall at once send a messenger to Mrs. Middleton, and await her orders. You will stay here.”\n\u003cbr\u003e \n\u003cbr\u003e He went to the door, and called “John” in a loud voice.\n\u003cbr\u003e \n\u003cbr\u003e Look here,” said Rudolph, suspiciously. “Just tell me one thing. There ain’t any trap, is there?”\n\u003cbr\u003e \n\u003cbr\u003e “Trap, my good friend? What can you mean?”\n\u003cbr\u003e \n\u003cbr\u003e “You ain’t sending for the police?”\n\u003cbr\u003e \n\u003cbr\u003e “To be sure not. Besides, why should a gentleman like you fear the police?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, that’s all gammon. I do fear the police uncommon. But if you tell me it’s all on the square, I’ll believe you.”\n\u003cbr\u003e \n\u003cbr\u003e “On my honor, then, it’s all on the square, as you call it. No harm whatever is designed you. Indeed, I have reason to think that you will make considerable money out of it. Now, hark ye, my friend, a word in confidence. We can do each other good.”\n\u003cbr\u003e \n\u003cbr\u003e “Can we?” asked the tramp.\n\u003cbr\u003e \n\u003cbr\u003e Yes, and I’ll tell you how. This lady, Mrs. Middleton, appears to be rich.”\n\u003cbr\u003e \n\u003cbr\u003e “She is rich.”\n\u003cbr\u003e \n\u003cbr\u003e “So much the better for us. I mean to give her the idea that I have been at great trouble and expense in finding you.”\n\u003cbr\u003e \n\u003cbr\u003e “I see,” said Rudolph, smiling. “You mean to charge it in the bill?”\n\u003cbr\u003e \n\u003cbr\u003e “Of course, I shall represent that I sent out messengers in search of you, and you were found by one of them.”\n\u003cbr\u003e \n\u003cbr\u003e In a private parlor at the St. Regis sat a lady of middle age. She had a haughty face, and stern, compressed lips. She was one to repel rather than to attract. She had a note before her, which she threw down with an exclamation of impatience.\n\u003cbr\u003e \n\u003cbr\u003e So he has heard nothing yet. For three weeks I have been wasting my time at this hotel, depending on this lawyer, and he has done absolutely nothing.”\n\u003cbr\u003e \n\u003cbr\u003e At this moment a light knock was heard at the door.\n\u003cbr\u003e \n\u003cbr\u003e Enter,” said the lady.\n\u003cbr\u003e \n\u003cbr\u003e A note for Mrs. Middleton,” announced a servant.\n\u003cbr\u003e \n\u003cbr\u003e She took the missive and hastily opened it. It read thus:\n\u003cbr\u003e \n\u003cbr\u003e “My dear Madam: At last, after unwearied exertions, I have succeeded. The man, Rudolph Rugg, has been found by one of my messengers, and is at this moment in my office, ready to obey your summons. Shall I send him to you?”\n\u003cbr\u003e \n\u003cbr\u003e Yours respectfully,\n\u003cbr\u003e “Jacob Morris.”\n\u003cbr\u003e \n\u003cbr\u003e “P.S.—I assured you at the outset that if he were living I would find him. I am sure you will appreciate my exertions in your behalf.”\n\u003cbr\u003e \n\u003cbr\u003e “That means a larger bill,” thought the lady. “However, I am willing to pay handsomely. The man is found, and he can doubtless produce the boy.”\n\u003cbr\u003e \n\u003cbr\u003e “Wait!” she said, in an imperious tone, to the servant, who was about to withdraw. “There is an answer.”\n\u003cbr\u003e \n\u003cbr\u003e She hastily penciled the following note:\n\u003cbr\u003e \n\u003cbr\u003e “I am very glad you have found Rudolph Rugg. I wish to speak to him at once. Send him here directly.”\n\u003cbr\u003e \n\u003cbr\u003e “Short and not sweet!” commented the lawyer, when it was placed in his hands. “She says nothing about the compensation.”\n\u003cbr\u003e \n\u003cbr\u003e “Is it about me?” asked the tramp.\n\u003cbr\u003e \n\u003cbr\u003e Yes; it is from Mrs. Middleton. She wants you to come to the hotel at once. But, my friend, I would advise you, since you are about to call upon a lady, to put on a better suit of clothes.”\n\u003cbr\u003e \n\u003cbr\u003e “How am I to do it,” he demanded roughly, “when these are all the clothes I have?”\n\u003cbr\u003e \n\u003cbr\u003e The lawyer whistled.\n\u003cbr\u003e \n\u003cbr\u003e A pretty-looking figure to call upon a lady at a fashionable hotel!” he thought.\n\u003cbr\u003e \n\u003cbr\u003e You must go as you are,” he said. “Wait a minute.”\n\u003cbr\u003e \n\u003cbr\u003e He took a blank card and wrote upon it the name:\n\u003cbr\u003e \n\u003cbr\u003e RUDOLPH RUGG\n\u003cbr\u003e \n\u003cbr\u003e “When you reach the hotel,” he said, “inquire for Mrs. Middleton and send that card up to her.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well, sir.”\n\u003cbr\u003e \n\u003cbr\u003e The tramp started, his mind busily occupied.\n\u003cbr\u003e \n\u003cbr\u003e What does she want with me? She wasn’t Mrs. Middleton when I knew her, she was Miss Vincent, the governess. I suppose she’s a great lady now. So she got Mr. Harvey to marry her. That ain’t surprisin’. She looked like a schemer even then, and I was a fool not to see what she was at. Likely she was up to the other thing. Well, I shall soon know.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2019/57601.html","bookId":622,"creation":"Aug 5, 2019 5:56:05 AM","modification":"Aug 5, 2019 5:56:05 AM"}
