{"id":34807,"no":19,"title":"CHAPTER XIX THE FIGHTING QUAKER","content":"The tramp decided that the best way to find Tony would be to return to that part of the country where he had lost him, and make inquiries for a boy of his description. He could do it comfortably now, being provided with funds, thanks to Mrs. Middleton.\n\u003cbr\u003e \n\u003cbr\u003e But there was a difficulty which gave him uneasiness. He was liable to be arrested.\n\u003cbr\u003e \n\u003cbr\u003e I must disguise myself,” thought Rudolph.\n\u003cbr\u003e \n\u003cbr\u003e It was not the first time in his varied experience that he had felt the need of a disguise, and he knew just where to go to find one. In the lower part of the city there was a shop well provided with such articles as he required. He lost no time in seeking it out.\n\u003cbr\u003e \n\u003cbr\u003e What can I do for you, Mr. Rugg?” asked the old man who kept the establishment.\n\u003cbr\u003e \n\u003cbr\u003e I want a disguise.”\n\u003cbr\u003e \n\u003cbr\u003e “Then you’ve come to the right shop. What will you be—a sailor, a Quaker, a—?—” “Hold, there,” said Rudolph. “You’ve named the very thing.”\n\u003cbr\u003e \n\u003cbr\u003e “What?”\n\u003cbr\u003e \n\u003cbr\u003e “A Quaker. Can you make me a good Broadbrim?”\n\u003cbr\u003e \n\u003cbr\u003e “Yea, verily,” answered the old man, laughing. “I can suit thee to a T.”\n\u003cbr\u003e \n\u003cbr\u003e “Do so, then.”\n\u003cbr\u003e \n\u003cbr\u003e From out of a pile of costumes the old man drew a suit of drab and a broad-brimmed hat.\n\u003cbr\u003e \n\u003cbr\u003e How will that do?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e “First tell me the price.”\n\u003cbr\u003e \n\u003cbr\u003e “Thirty dollars.”\n\u003cbr\u003e \n\u003cbr\u003e “Thirty dollars!” exclaimed the tramp, aghast. “Do you think I’m made of money?”\n\u003cbr\u003e \n\u003cbr\u003e “Look at the quality, my good friend.”\n\u003cbr\u003e \n\u003cbr\u003e “Why, I may not want the things for more than a week.”\n\u003cbr\u003e \n\u003cbr\u003e “Then I’ll tell you what I’ll do. If you only use them a week, you shall bring them back, and I will pay you back twenty-five dollars; that is,” the old man added, cautiously, “if you don’t hurt ’em too much.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s better,” said Rudolph. “I’ll try them on.”\n\u003cbr\u003e \n\u003cbr\u003e He went into an inner room provided for the purpose, and soon came out entirely transformed. In addition to the drab suit, a gray wig had been supplied.\n\u003cbr\u003e \n\u003cbr\u003e The old man laughed heartily.\n\u003cbr\u003e \n\u003cbr\u003e How does thee like it?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e Capital,” said Rudolph. “Would you know me?”\n\u003cbr\u003e \n\u003cbr\u003e “I wouldn’t dream it was you. But, Mr. Rugg, there’s one thing you mustn’t forget.”\n\u003cbr\u003e \n\u003cbr\u003e “What’s that?”\n\u003cbr\u003e \n\u003cbr\u003e “To use the Quaker lingo. Just now you said, ‘Would you know me?’ That isn’t right.”\n\u003cbr\u003e \n\u003cbr\u003e “What should I say?”\n\u003cbr\u003e \n\u003cbr\u003e “Would thee know me?”\n\u003cbr\u003e \n\u003cbr\u003e “All right. There’s your money.”\n\u003cbr\u003e \n\u003cbr\u003e “There you are again. You must say thy money.”\n\u003cbr\u003e \n\u003cbr\u003e “I see you know all about it. You’ve been a Quaker yourself, haven’t you?”\n\u003cbr\u003e \n\u003cbr\u003e “Not I; but I was brought up in Philadelphia, and I have seen plenty of the old fellows. Now, don’t forget how to talk. Where are you going?”\n\u003cbr\u003e \n\u003cbr\u003e “Into the country on a little expedition,” said Rudolph.\n\u003cbr\u003e \n\u003cbr\u003e Well, good luck to you.”\n\u003cbr\u003e \n\u003cbr\u003e “I wish thee good luck, too,” said the tramp.\n\u003cbr\u003e \n\u003cbr\u003e Ha! ha! you’ve got it; you’ll do.”\n\u003cbr\u003e \n\u003cbr\u003e The tramp emerged into the street, a very fair representative of a sedate Quaker. He soon attracted the attention of some street boys, who, not suspecting his genuineness, thought him fair game.\n\u003cbr\u003e \n\u003cbr\u003e How are you, old Broadbrim?” said one.\n\u003cbr\u003e \n\u003cbr\u003e Rudolph didn’t resent this.\n\u003cbr\u003e \n\u003cbr\u003e You’d make a good scarecrow,” said another.\n\u003cbr\u003e \n\u003cbr\u003e Still the tramp kept his temper.\n\u003cbr\u003e \n\u003cbr\u003e A third boy fired a half-eaten apple at him.\n\u003cbr\u003e \n\u003cbr\u003e This was too much for the newly converted disciple of William Penn.\n\u003cbr\u003e \n\u003cbr\u003e Just let me catch you, you little rascal, and I’ll give you the worst licking you ever had.”\n\u003cbr\u003e \n\u003cbr\u003e The boys stared open mouthed at such language.\n\u003cbr\u003e \n\u003cbr\u003e He’s a fighting Quaker,” said the first one. “Keep out of his way.”\n\u003cbr\u003e \n\u003cbr\u003e “If thee don’t, thee’ll catch it,” said Rudolph, fortunately remembering how he must talk.\n\u003cbr\u003e \n\u003cbr\u003e He had thought of pursuing the disturbers of his peace, but motives of prudence prevented him.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2019/57604.html","bookId":622,"creation":"Aug 5, 2019 5:56:05 AM","modification":"Aug 5, 2019 5:56:05 AM"}
