{"id":34814,"no":26,"title":"CHAPTER XXVI A STRANGE ADVENTURE","content":"The young man leaned on the arm of his companion. He was affected by the potations in which he had indulged, and was sensible of his condition.\n\u003cbr\u003e \n\u003cbr\u003e I ought not to have drank so much,” he said, in unsteady accents.\n\u003cbr\u003e \n\u003cbr\u003e Pooh! it’s nothing,” said the other, lightly. “Where are you stopping?”\n\u003cbr\u003e \n\u003cbr\u003e “St. Regis.”\n\u003cbr\u003e \n\u003cbr\u003e “We’d better walk. It will do you good to walk.”\n\u003cbr\u003e \n\u003cbr\u003e “Just as you say.”\n\u003cbr\u003e \n\u003cbr\u003e “Of course I would only advise you for your good.”\n\u003cbr\u003e \n\u003cbr\u003e “I know it; but, old fellow, why did you make me drink so much?”\n\u003cbr\u003e \n\u003cbr\u003e “I thought you could stand it better. I’m as cool as a cucumber.”\n\u003cbr\u003e \n\u003cbr\u003e He pressed the young man’s arm, and led him into a side street.\n\u003cbr\u003e \n\u003cbr\u003e What’s that for? This ain’t the way to the St. Regis.”\n\u003cbr\u003e \n\u003cbr\u003e “I know it.”\n\u003cbr\u003e \n\u003cbr\u003e “Why don’t we go up Broadway?”\n\u003cbr\u003e \n\u003cbr\u003e “You are not fit to go in yet. You need a longer walk, so that your condition will not be noticed when you go in.”\n\u003cbr\u003e \n\u003cbr\u003e “Go along, old fellow. You’re right.”\n\u003cbr\u003e \n\u003cbr\u003e Still Tony kept behind. All seemed right enough, but somehow he could not help feeling suspicious of the older man.\n\u003cbr\u003e \n\u003cbr\u003e I’ll watch him,” he thought, “and if he attempts any mischief, I’ll interfere.”\n\u003cbr\u003e \n\u003cbr\u003e The two men walked in a westerly direction, crossing several streets.\n\u003cbr\u003e \n\u003cbr\u003e Look here,” said the young man, “we’d better turn back.”\n\u003cbr\u003e \n\u003cbr\u003e Now was the time.\n\u003cbr\u003e \n\u003cbr\u003e The other looked swiftly around, but did not notice Tony, who was tracking him in the darkness.\n\u003cbr\u003e \n\u003cbr\u003e Give me your pocketbook and watch at once!” he whispered.\n\u003cbr\u003e \n\u003cbr\u003e What!” exclaimed the young man, startled, and trying to release his arm.\n\u003cbr\u003e \n\u003cbr\u003e Give me your watch and money at once, or I’ll blow your brains out!”\n\u003cbr\u003e \n\u003cbr\u003e “Look here, you’re only trying to play a joke on me.”\n\u003cbr\u003e \n\u003cbr\u003e “You’re mistaken. I’m a desperate man. I will do as I say.”\n\u003cbr\u003e \n\u003cbr\u003e “Then you’re a villain,” said the young man, with spirit. “You’ve made me drunk in order to rob me.”\n\u003cbr\u003e \n\u003cbr\u003e “Precisely. Your money or your life. That’s about what I mean.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll call the police.”\n\u003cbr\u003e \n\u003cbr\u003e “If you do it will be your last word. Now, make up your mind!”\n\u003cbr\u003e \n\u003cbr\u003e The young man, instead of complying, endeavored to break away, but in his intoxication he had lost half his strength, and was no match for the other.\n\u003cbr\u003e \n\u003cbr\u003e You fool, your blood be on your own hands!” said his companion, and he drew a pistol from his side pocket.\n\u003cbr\u003e \n\u003cbr\u003e An instant and he would have fired, but Tony was on the alert. He sprang forward, seized the would-be murderer by the arm, and the pistol went off, but the bullet struck a brick wall on the opposite side of the street.\n\u003cbr\u003e \n\u003cbr\u003e “Police!” shouted Tony, at the top of his lungs.\n\u003cbr\u003e \n\u003cbr\u003e Confusion!” exclaimed the villain. “I must be getting out of this!”\n\u003cbr\u003e \n\u003cbr\u003e He turned to fly, but Tony seized him by the coat, and he struggled fiercely, but in vain.\n\u003cbr\u003e \n\u003cbr\u003e Let go, you young scoundrel!” he shouted, “or I’ll shoot you!”\n\u003cbr\u003e \n\u003cbr\u003e “With an unloaded pistol?” asked Tony. “That don’t scare much!”\n\u003cbr\u003e \n\u003cbr\u003e A quick step was heard, and a policeman turned the corner.\n\u003cbr\u003e \n\u003cbr\u003e What’s the matter?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e I charge this man with an attempt at murder,” said Tony.\n\u003cbr\u003e \n\u003cbr\u003e The boy is right,” said the young man.\n\u003cbr\u003e \n\u003cbr\u003e They are both lying!” said the adventurer, furiously. “It’s a plot against me.”\n\u003cbr\u003e \n\u003cbr\u003e “I know you, Bill Jones!” said the policeman, after a careful scrutiny of the man’s features. “You’re a hard ticket. Come along with me. You two must go with me to prefer your charge.”\n\u003cbr\u003e \n\u003cbr\u003e “Let me have your arm, my boy,” said the young man. “I’m ashamed to own that I need your help. It is the last time I will allow liquor to get the better of me.”\n\u003cbr\u003e \n\u003cbr\u003e “I guess you’re about right there,” said Tony. “You’ve had a narrow escape.”\n\u003cbr\u003e \n\u003cbr\u003e “I owe my life to you,” said the young man, warmly. “How did you happen to come up just in the nick of time?”\n\u003cbr\u003e \n\u003cbr\u003e “I suspected the man meant you no good. I followed you from the billiard saloon where I saw you playing.”\n\u003cbr\u003e \n\u003cbr\u003e “You were sharper than I. I never suspected harm. You have done me the greatest possible service.”\n\u003cbr\u003e \n\u003cbr\u003e “Curse the young brat!” muttered the man in custody. “I’d like a good chance to wring your neck!”\n\u003cbr\u003e \n\u003cbr\u003e “I’ve no doubt of it,” said Tony. “I’ll keep out of your way.”\n\u003cbr\u003e \n\u003cbr\u003e The station house was not far off. The party entered. The charge was formally made, and Tony and the young man went out.\n\u003cbr\u003e \n\u003cbr\u003e Won’t your father and mother feel anxious about your being out so late?” asked George Spencer, for this was the young man’s name.\n\u003cbr\u003e \n\u003cbr\u003e I don’t think they will,” answered Tony. “I haven’t got any, for that matter.”\n\u003cbr\u003e \n\u003cbr\u003e “Who do you live with, then?”\n\u003cbr\u003e \n\u003cbr\u003e “I take care of myself.”\n\u003cbr\u003e \n\u003cbr\u003e “Have you no one belonging to you?”\n\u003cbr\u003e \n\u003cbr\u003e “Not one.”\n\u003cbr\u003e \n\u003cbr\u003e “Are you poor?” asked Spencer, for the first time taking notice of Tony’s rather shabby apparel.\n\u003cbr\u003e \n\u003cbr\u003e Oh, no!” said our hero. “I’ve got a little over two dollars in my pocket.”\n\u003cbr\u003e \n\u003cbr\u003e “Is that all?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, and it’s a good deal more than I generally have.”\n\u003cbr\u003e \n\u003cbr\u003e “You don’t say so. How do you make your living?”\n\u003cbr\u003e \n\u003cbr\u003e “Any way I can—any way that’s honest.”\n\u003cbr\u003e \n\u003cbr\u003e “And don’t you ever get discouraged—down in the mouth?”\n\u003cbr\u003e \n\u003cbr\u003e “Not often,” answered Tony. “I’ve always got along, and I guess something will turn up for me. But there’s one thing I am sorry for.”\n\u003cbr\u003e \n\u003cbr\u003e “What’s that?”\n\u003cbr\u003e \n\u003cbr\u003e “I would like to get some sort of an education. I don’t know much.”\n\u003cbr\u003e \n\u003cbr\u003e “Can’t you read?”\n\u003cbr\u003e \n\u003cbr\u003e “A little, and write a little. I mostly picked it up myself.”\n\u003cbr\u003e \n\u003cbr\u003e The young man whistled.\n\u003cbr\u003e \n\u003cbr\u003e Have you any place to sleep to-night?”\n\u003cbr\u003e \n\u003cbr\u003e “I’ve hired an attic room for a week.”\n\u003cbr\u003e \n\u003cbr\u003e “What do you pay?”\n\u003cbr\u003e \n\u003cbr\u003e “A dollar a week.”\n\u003cbr\u003e \n\u003cbr\u003e “Of course it is a poor room?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; but it’s all I can expect, and better than I often have. Why, I’ve slept in barns and under haystacks plenty of times.”\n\u003cbr\u003e \n\u003cbr\u003e “What is your name?”\n\u003cbr\u003e \n\u003cbr\u003e “Tony Rugg.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, Tony, you must come and stop with me to-night.”\n\u003cbr\u003e \n\u003cbr\u003e “With you?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, at the St. Regis Hotel. You can help me get there, and share my room.”\n\u003cbr\u003e \n\u003cbr\u003e Tony hesitated.\n\u003cbr\u003e \n\u003cbr\u003e Do you mean it?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e Why shouldn’t I?”\n\u003cbr\u003e \n\u003cbr\u003e “Because you are a gentleman, and I—do you know what they call me?”\n\u003cbr\u003e \n\u003cbr\u003e “What?”\n\u003cbr\u003e \n\u003cbr\u003e “Tony the Tramp.”\n\u003cbr\u003e \n\u003cbr\u003e “It is your misfortune, and not your fault. I repeat my invitation. Will you come?”\n\u003cbr\u003e \n\u003cbr\u003e “I will,” answered Tony.\n\u003cbr\u003e \n\u003cbr\u003e He saw that the young man was in earnest, and he no longer persisted in his refusal.\n\u003cbr\u003e \n\u003cbr\u003e To-morrow morning I will talk with you further about your affairs. I want to do something for you.”\n\u003cbr\u003e \n\u003cbr\u003e “You are very kind.”\n\u003cbr\u003e \n\u003cbr\u003e “I ought to be. Haven’t you saved my life? But there is the hotel.”\n\u003cbr\u003e \n\u003cbr\u003e Tony and his new friend entered the great hotel. It was brilliantly lighted, though it was now nearly midnight.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Spencer went up to the desk.\n\u003cbr\u003e \n\u003cbr\u003e My key,” he said. “No. 169.”\n\u003cbr\u003e \n\u003cbr\u003e “Here it is, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “This young man will share my room. I will enter his name.”\n\u003cbr\u003e \n\u003cbr\u003e The clerk looked at Tony in surprise. He looked rather shabby for a guest of the great caravansary.\n\u003cbr\u003e \n\u003cbr\u003e Has he luggage?” asked the clerk.\n\u003cbr\u003e \n\u003cbr\u003e None to-night. I will pay his bill.”\n\u003cbr\u003e \n\u003cbr\u003e “All right, sir.”\n\u003cbr\u003e \n\u003cbr\u003e They got into the elevator, and presently came to a stop. Mr. Spencer opened the door of No. 169.\n\u003cbr\u003e \n\u003cbr\u003e It was a good-sized and handsomely furnished chamber, containing two beds.\n\u003cbr\u003e \n\u003cbr\u003e You will sleep in that bed, Tony,” said Spencer. “I feel dead tired. Will you help me off with my coat?”\n\u003cbr\u003e \n\u003cbr\u003e Scarcely was the young man in bed than he fell asleep. Tony lay awake some time, thinking of his strange adventure.\n\u003cbr\u003e \n\u003cbr\u003e It’s the first time in my life,” he said to himself, “when I’ve had two beds—one here and the other at my lodgings. What would Rudolph say if he knew I was stopping at a fashionable hotel, instead of being at the bottom of the well where he threw me?”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2019/57611.html","bookId":622,"creation":"Aug 5, 2019 5:56:05 AM","modification":"Aug 5, 2019 5:56:05 AM"}
