{"id":34824,"no":36,"title":"CHAPTER XXXVI ALL’S WELL THAT ENDS WELL","content":"Mrs. Harvey Middleton sat in her boudoir, trying to read a novel. But it failed to interest her. She felt uneasy, she scarcely knew why. The evening previous she had been at the Haymarket Theater, and had been struck by a boy’s face. Ten feet from her sat Tony, with his friend, George Spencer. He looked wonderfully like his father as she remembered him, and she was startled. She did not know Tony, but Rugg’s angry warning struck her.\n\u003cbr\u003e \n\u003cbr\u003e Was he right? Can this be the boy I have so much reason to dread?” she asked herself.\n\u003cbr\u003e \n\u003cbr\u003e She was thinking of this when the servant entered the room with a card.\n\u003cbr\u003e \n\u003cbr\u003e C. Barry,” she repeated, “wishes to see Mrs. Middleton on business of the greatest importance.”\n\u003cbr\u003e \n\u003cbr\u003e “Ask him to come up,” she said, uneasily.\n\u003cbr\u003e \n\u003cbr\u003e It was the lawyer, as the reader may have suspected.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Middleton,” he said, with a bow. “I must apologize for my intrusion.”\n\u003cbr\u003e \n\u003cbr\u003e “You say your business is important?” said the lady.\n\u003cbr\u003e \n\u003cbr\u003e It is—of the first importance.”\n\u003cbr\u003e \n\u003cbr\u003e “Explain yourself, I beg.”\n\u003cbr\u003e \n\u003cbr\u003e “I appear before you, madam, in behalf of your late husband’s cousin, Anthony Middleton, who is the heir of the estate which you hold in trust.”\n\u003cbr\u003e \n\u003cbr\u003e It was out now, and Mrs. Middleton was at bay.\n\u003cbr\u003e \n\u003cbr\u003e There is no such person,” she said. “The boy you refer to is dead.”\n\u003cbr\u003e \n\u003cbr\u003e “What proof have you of his decease?”\n\u003cbr\u003e \n\u003cbr\u003e “I have the sworn statement of the man who saw him die.”\n\u003cbr\u003e \n\u003cbr\u003e “And this man’s name?”\n\u003cbr\u003e \n\u003cbr\u003e “Is Rudolph Rugg.”\n\u003cbr\u003e \n\u003cbr\u003e “I thought so. Mr. Rugg swore falsely. He is ready to contradict his former statement.”\n\u003cbr\u003e \n\u003cbr\u003e “He has been tampered with!” exclaimed Mrs. Middleton, pale with passion.\n\u003cbr\u003e \n\u003cbr\u003e That may be,” said the lawyer; but he added, significantly: “Not by us.”\n\u003cbr\u003e \n\u003cbr\u003e “The boy is an impostor,” said Mrs. Middleton, hotly. “I will not surrender the estate.”\n\u003cbr\u003e \n\u003cbr\u003e “I feel for your disappointment, madam; but I think you are hasty.”\n\u003cbr\u003e \n\u003cbr\u003e “Who will believe the statement of a common tramp?”\n\u003cbr\u003e \n\u003cbr\u003e “You relied upon it before, madam. But we have other evidence,” continued the lawyer.\n\u003cbr\u003e \n\u003cbr\u003e What other evidence?”\n\u003cbr\u003e \n\u003cbr\u003e “The striking resemblance of my young friend to the family.”\n\u003cbr\u003e \n\u003cbr\u003e “Was—was he at the Haymarket Theater last evening?” asked the lady.\n\u003cbr\u003e \n\u003cbr\u003e He was. Did you see him?”\n\u003cbr\u003e \n\u003cbr\u003e “I saw the boy I suppose you mean. He had a slight resemblance to Mr. Middleton.”\n\u003cbr\u003e \n\u003cbr\u003e “He is his image.”\n\u003cbr\u003e \n\u003cbr\u003e “Suppose—suppose this story to be true, what do you offer me?” asked Mrs. Middleton, sullenly.\n\u003cbr\u003e \n\u003cbr\u003e An income of three hundred pounds from the estate,” said the lawyer. “If the matter comes to court, this Rugg, I am bound to tell you, has an ugly story to tell, in which you are implicated.”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Middleton knew well enough what it meant. If the conspiracy should be disclosed, she would be ostracized socially. She rapidly made up her mind.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Barry,” she said, “I will accept your terms, on a single condition.”\n\u003cbr\u003e \n\u003cbr\u003e “Name it, madam.”\n\u003cbr\u003e \n\u003cbr\u003e “That you will give me six weeks’ undisturbed possession of the estate, keeping this matter secret meanwhile.”\n\u003cbr\u003e \n\u003cbr\u003e “If I knew your motive I might consent.”\n\u003cbr\u003e \n\u003cbr\u003e “I will tell you in confidence. Within that time I am to be married. The abrupt disclosure of this matter might break off the marriage.”\n\u003cbr\u003e \n\u003cbr\u003e “May I ask the name of the bridegroom?”\n\u003cbr\u003e \n\u003cbr\u003e “Capt. Gregory Lovell.”\n\u003cbr\u003e \n\u003cbr\u003e The lawyer smiled. He knew of Capt. Lovell, and owed him a grudge. He suspected that the captain was mercenary in his wooing, and he thought that it would be a fitting revenge to let matters go on.\n\u003cbr\u003e \n\u003cbr\u003e I consent, upon my own responsibility,” he said.\n\u003cbr\u003e \n\u003cbr\u003e Thank you,” said Mrs. Middleton, with real gratitude.\n\u003cbr\u003e \n\u003cbr\u003e She would not lose the man she loved after all.\n\u003cbr\u003e \n\u003cbr\u003e A month later the marriage of Capt. Gregory Lovell, of her majesty’s service, and Mrs. Harvey Middleton, of Middleton Hall, was celebrated. There was a long paragraph in the morning Post, and Mrs. Lovell was happy.\n\u003cbr\u003e \n\u003cbr\u003e When, a week later, at Paris, the gallant captain was informed of the trick that had been played upon him, there was a terrible scene. He cursed his wife, and threatened to leave her.\n\u003cbr\u003e \n\u003cbr\u003e But, Gregory, I have three hundred pounds income,” she pleaded. “We can live abroad.”\n\u003cbr\u003e \n\u003cbr\u003e “And I have sold myself for that paltry sum!” he said, bitterly.\n\u003cbr\u003e \n\u003cbr\u003e But he concluded to make the best of a bad bargain. Between them they had an income of five hundred pounds, and on this they made shift abroad, where living is cheap. But the marriage was not happy. He was brutal at times, and his wife realized sadly that he had never loved her. But she has all the happiness she deserves, and so has he.\n\u003cbr\u003e \n\u003cbr\u003e Rudolph drank himself to death in six months. So the income which he was to receive made but a slight draft upon the Middleton estate.\n\u003cbr\u003e \n\u003cbr\u003e And Tony! No longer Tony the Tramp, but the Hon. Anthony Middleton, of Middleton Hall—he has just completed a course at Oxford, and is now the possessor of an education which will help fit him for the responsibilities he is to assume. His frank, off-hand manner makes him an immense favorite with the circle to which he now belongs. He says little of his early history, and it is seldom thought of now. He has made a promise to his good friend, George Spencer, to visit the United States this year, and will doubtless do so. He means at that time to visit once more the scenes with which he became familiar when he was only Tony the Tramp.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eTHE END\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2019/57621.html","bookId":622,"creation":"Aug 5, 2019 5:56:05 AM","modification":"Aug 5, 2019 5:56:05 AM"}
