{"id":43988,"no":11,"title":"CHAPTER XI. HECTOR RECEIVES A SUMMONS.","content":"\u0026nbsp;It so happened that Hector was well provided with money. During the life of Mr. Roscoe, whom he regarded as his father, he had a liberal allowance—liberal beyond his needs—and out of it had put by somewhat over a hundred dollars. The greater part of this was deposited for safe-keeping in a savings bank, but he had twenty-five dollars in his possession. \n\u003cdiv\u003e\n At the time he was saving his money, he regarded himself as the heir and future possessor of the estate, and had no expectation of ever needing it. It had been in his mind that it would give him an opportunity of helping, out of his private funds, any deserving poor person who might apply to him. When the unexpected revelation had been made to him that he had no claim to the estate, he was glad that he was not quite penniless. He did not care to apply for money to Allan Roscoe. It would have been a confession of dependence, and very humiliating to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n No sooner was school out, than he asked Wilkins to accompany him to the baker’s, that he might make up for the deficiencies of Mr. Smith’s meager table.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose, if I guide you, you’ll stand treat, Roscoe?” said Wilkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then let us go,” said his schoolfellow, with alacrity. “I’d like to get the taste of that beastly dinner out of my mouth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They found the baker’s, but close beside it was a restaurant, where more substantial fare could be obtained.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wilkins,” said Hector, “I think I would rather have a plate of meat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right! I’m with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So the two boys went into the restaurant, and ordered plates of roast beef, which they ate with evident enjoyment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess,” said the waiter, grinning, “you two chaps come from the institute.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Hector. “What makes you think so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The way you eat. They do say old Smith half starves the boys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re not far from right,” said Wilkins; “but it isn’t alone the quantity, but the quality that’s amiss.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They ate their dinner, leaving not a crumb, and then rose refreshed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I feel splendid,” said Wilkins. “I just wish I boarded at the restaurant instead of the doctor’s. Thank you, Roscoe, for inviting me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, Wilkins! We’ll come again some day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Somehow the extra dinner seemed to warm the heart of Wilkins, and inspire in him a feeling of friendly interest for Hector.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, Hector, I’ll tell you something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go ahead.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve got to keep your eyes open.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I generally do,” answered Hector, smiling, “except at night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean when Jim Smith’s round.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why particularly when he is around?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because he means to thrash you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are too independent. You don’t bow down to him, and look up to him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t mean to,” said Hector, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you don’t you’ll see trouble, and that very soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let it come!” said Hector, rather contemptuously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t seem afraid!” said Wilkins, regarding him curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I am not afraid. Isn’t that a good reason?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t think you can stand up against Jim, do you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will see when the time comes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shouldn’t be a bit surprised if he were looking out for you at this very moment, and wondering where you are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed that Wilkins was right. As they approached the school grounds, John Bates came running to meet them.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where have you been, you two?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To the village,” answered Wilkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “For a walk,” answered Wilkins, with a warning glance at Hector. It would have been awkward if the principal had heard that they had been compelled to eke out their meager dinner at a restaurant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Jim wants you. Leastways, he wants Roscoe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bates looked as if he expected Roscoe would immediately hasten to comply with the wishes of the redoubtable Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he wants me, he can come to me,” said Hector, independently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I say, that won’t do. Jim won’t be satisfied.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Won’t he? I don’t know that that particularly concerns me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I tell him that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you choose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bates looked as if Hector had been guilty of some enormity. What, defy the wishes, the mandates, of Jim Smith, the king of the school and the tyrant of all the small boys! He felt that Hector Roscoe was rushing on his fate.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I advise you to come,” he said, “Jim’s mad with you already, and he’ll lick you worse if you send him a message like that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will probably have to take blows, as well as give them,” said Hector.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am to tell him what you said?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course.”\n\u003c/div\u003e \n\u003cdiv\u003e\n With a look that seemed to say, “Your fate be on your own head!” Bates walked away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “John Bates is always toadying to Jim,” said Wilkins. “So he’s prime favorite when Jim is good-natured—when he’s cross, I’ve seen him kick Bates.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And Bates didn’t resent it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He didn’t dare to. He’d come round him the next day the same as ever.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has the boy no self-respect?” asked Hector, in a tone of disgust.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He doesn’t seem to have.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As soon as school was out, Jim Smith had looked round for the new boy, who seemed disposed to defy his authority. On account of eating at different tables, they had not met during the noon intermission. At any rate, there had not been time to settle the question of subserviency. Through the afternoon session Jim had been anticipating the signal punishment which he intended to inflict upon the newcomer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll show him!” he said to himself. “Tomorrow he’ll be singing a different tune, or I am mistaken.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the way Jim had been accustomed to break in refractory new arrivals. The logic of his fist usually proved a convincing argument, and thus far his supremacy had never been successfully resisted. He was confident that he would not be interfered with. Secretly, his Uncle Socrates sympathized with him, and relished the thought that his nephew, who so strongly resembled him in mind and person, should be the undisputed boss—to use a word common in political circles—of the school. He discreetly ignored the conflicts which he knew took place, and if any luckless boy, the victim of Jim’s brutality, ventured to appeal to him, the boy soon found that he himself was arraigned, and not the one who had abused him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where’s that new boy?” asked Jim, as he left the schoolroom.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had not seen our hero’s departure—but his ready tool, Bates, had.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw him sneaking off with Wilkins,” said Bates.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did they go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To the Village, I guess.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They seemed to be in a hurry,” said Jim, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They wanted to get out of your way—that is, the new boy did,” suggested Bates.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jim nodded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Likely he did,” he answered. “So he went to the village, did he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I saw him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, he’s put it off a little. That boy’s cranky. I’m goin’ to give him a lesson he won’t forget very soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you will, so you will, Jim,” chuckled Bates.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s the way I generally take down these boys that put on airs,” said Jim, complacently. “This Roscoe’s the worst case I’ve had yet. So Wilkins went off with him, did he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I saw them go off together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll have to give Wilkins a little reminder, then. It won’t be safe to take up with them that defy me. I’ll just give him a kick to help his memory.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He won’t like that much, oh, my!” chuckled Bates.\n\u003c/div\u003e \n\u003cdiv\u003e\n “When you see them coming, Bates, go and tell Roscoe I want to see him,” said Jim, with the air of an autocrat.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, Jim,” said Bates, obediently.\n\u003c/div\u003e \n\u003cdiv\u003e\n So he went on his errand, and we know what success he met with.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2974/81927.html","bookId":349,"creation":"Aug 11, 2019 7:20:33 AM","modification":"Aug 11, 2019 7:20:33 AM"}
