{"id":43995,"no":18,"title":"CHAPTER XVIII. THE MISSING WALLET IS FOUND.","content":"\u0026nbsp;Socrates Smith was, ordinarily, so careful of his money, that it was a very remarkable inadvertence to leave it on the bureau. Nor was it long before he ascertained his loss. He was sitting at his desk when his wife looked in at the door, and called for a small sum for some domestic expenditure. \n\u003cdiv\u003e\n With an ill grace—for Socrates hated to part with his money—he put his hand into the pocket where he usually kept his wallet.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really, Mrs. Smith,” he was saying, “it seems to me you are always wanting money—why, bless my soul!” and such an expression of consternation and dismay swept over his face, that his wife hurriedly inquired:\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is the matter, Mr. Smith?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Matter enough!” he gasped. “My wallet is gone!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gone!” echoed his wife, in alarm. “Where can you have left it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Smith pressed his hand to his head in painful reflection.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much money was there in it, Socrates?” asked his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Between forty and fifty dollars!” groaned Mr. Smith. “If I don’t find it, Sophronia, I am a ruined man!”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was, of course, an exaggeration, but it showed the poignancy of the loser’s regret.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t you think where you left it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly Mr. Smith’s face lighted up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I remember where I left it, now,” he said; “I was up in the chamber an hour since, and, while changing my coat, took out my wallet, and laid it on the bureau. I’ll go right up and look for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do, Socrates.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Smith bounded up the staircase with the agility of a man of half his years, and hopefully opened the door of his chamber, which Jim had carefully closed after him. His first glance was directed at the bureau, but despair again settled down sadly upon his heart when he saw that it was bare. There was no trace of the missing wallet.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It may have fallen on the carpet,” said Socrates, hope reviving faintly.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was not a square inch of the cheap Kidderminster carpet that he did not scan earnestly, greedily, but, alas! the wallet, if it had ever been there, had mysteriously taken to itself locomotive powers, and wandered away into the realm of the unknown and the inaccessible.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet, searching in the chambers of his memory, Mr. Smith felt sure that he had left the wallet on the bureau. He could recall the exact moment when he laid it down, and he recollected that he had not taken it again.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some one has taken it!” he decided; and wrath arose in his heart, He snapped his teeth together in stern anger, as he determined that he would ferret out the miserable thief, and subject him to condign punishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Smith, tired of waiting for the appearance of her husband, ascended the stairs and entered his presence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well?” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven’t found it,” answered Socrates, tragically. “Mrs. Smith, the wallet has been stolen!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you sure that you left it here?” asked his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure!” he repeated, in a hollow tone. “I am as sure as that the sun rose to-morrow—I mean yesterday.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was the door open?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; but that signifies nothing. It wasn’t locked, and anyone could enter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it possible that we have a thief in the institute?” said Mrs. Smith, nervously. “Socrates, I shan’t sleep nights. Think of the spoons!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They’re only plated.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And my earrings.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You could live without earrings. Think, rather, of the wallet, with nearly fifty dollars in bills.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who do you think took it, Socrates?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have no idea; but I will find out. Yes, I will find out. Come downstairs, Mrs. Smith; we will institute inquiries.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When Mr. Smith had descended to the lower floor, and was about entering the office, it chanced that his nephew was just entering the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s the matter, Uncle Socrates?” he asked; “you look troubled.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And a good reason why, James; I have met with a loss.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t say so!” exclaimed Jim, in innocent wonder; “what is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A wallet, with a large amount of money in it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps there is a hole in your pocket,” suggested Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A hole—large enough for my big wallet to fall through! Don’t be such a fool!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Excuse me, uncle,” said Jim, meekly; “of course that is impossible. When do you remember having it last?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course Socrates told the story, now familiar to us, and already familiar to his nephew, though he did not suspect that.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jim struck his forehead, as if a sudden thought had occurred to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Could it be?” he said, slowly, as if to himself; “no, I can’t believe it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t believe what?” demanded Socrates, impatiently; “if you have any clew, out with it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hardly like to tell, Uncle Socrates, for it implicates one of the boys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Which?” asked Mr. Smith, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will tell you, though I don’t like to. Half an hour since, I was coming upstairs, when I heard a door close, as I thought, and, directly afterward, saw Hector Roscoe hurrying up the stairs to the third floor. I was going up there myself, and followed him. Five minutes later he came out of his room, looking nervous and excited. I didn’t think anything of it at the time, but I now think that he entered your room, took the wallet, and then carried it up to his own chamber and secreted it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hector Roscoe!” repeated Mr. Smith, in amazement. “I wouldn’t have supposed that he was a thief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor I; and perhaps he isn’t. It might be well, however, to search his room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will!” answered Socrates, with eagerness, “Come up, James, and you, Mrs. Smith, come up, too!”\n\u003c/div\u003e \n\u003cdiv\u003e\n The trio went upstairs, and entered poor Hector’s room. It was not unoccupied, for Ben Platt and Wilkins were there. They anticipated a visit, and awaited it with curious interest. They rose to their feet when the distinguished visitors arrived.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Business of importance brings us here,” said Socrates. “Platt and Wilkins, you may leave the room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys exchanged glances, and obeyed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wilkins,” said Ben, when they were in the corridor, “it is just as I thought. Jim has set a trap for Roscoe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He may get caught himself,” said Wilkins. “I ain’t oversqueamish, but that is too confounded mean! Of course you’ll tell all you know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; and I fancy it will rather surprise Mr. Jim. I wish they had let us stay in there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, Jim skillfully directed the search.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He may have put it under the mattress,” suggested Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n Socrates darted to the bed, and lifted up the mattress, but no wallet revealed itself to his searching eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; it is not here!” he said, in a tone of disappointment; “the boy may have it about him. I will send for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait a moment, Uncle Socrates,” said Jim; “there is a pair of pants which I recognize as his.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Smith immediately thrust his hand into one of the pockets and drew out the wallet!\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here it is!” he exclaimed, joyfully. “Here it is!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then Roscoe is a thief! I wouldn’t have thought it!” said Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor I. I thought the boy was of too good family to stoop to such a thing. But now I remember, Mr. Allan Roscoe told me he was only adopted by his brother. He is, perhaps, the son of a criminal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very likely!” answered Jim, who was glad to believe anything derogatory to Hector.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you going to do about it, uncle?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall bring the matter before the school. I will disgrace the boy publicly,” answered Socrates Smith, sternly. “He deserves the exposure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aha, Master Roscoe!” said Jim, gleefully, to himself; “I rather think I shall get even with you, and that very soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2974/81934.html","bookId":349,"creation":"Aug 11, 2019 7:20:33 AM","modification":"Aug 11, 2019 7:20:33 AM"}
