{"id":44000,"no":23,"title":"CHAPTER XXIII. ANOTHER CHANCE FOR THE USHER.","content":"\u0026nbsp;Mr. Smith had been thinking it over. He had discharged Mr. Crabb in the anger of the moment, but after his anger had abated, he considered that it was not for his interest to part with him. Mr. Crabb was a competent teacher, and it would be well-nigh impossible to obtain another so cheap. Twenty dollars a month for a teacher qualified to instruct in Latin and Greek was certainly a beggarly sum, but Mr. Crabb’s dire necessity had compelled him to accept it. Where could he look for another teacher as cheap? Socrates Smith appreciated the difficulty, and decided to take Mr. Crabb back, on condition that he would make an apology to Jim. \n\u003cdiv\u003e\n To do Mr. Crabb justice, it may be said that he would not have done this even if he saw no chance of another situation. But this Mr. Smith did not know. He did observe, however, that the usher entered his presence calm, erect and appearing by no means depressed, as he had expected.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You sent for me, sir?” said the usher interrogatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Mr. Crabb. You will remember that I had occasion to rebuke you, when we last conferred together, for overstepping the limits of your authority?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I remember, Mr. Smith, that you showed anger, and found fault with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Exactly so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why doesn’t he ask to be taken back?” thought Socrates.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have thought the matter over since,” continued the principal, “and have concluded we might be able to arrange matters.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The usher was surprised. He had not expected that Mr. Smith would make overtures of reconciliation. He decided not to mention at present his brighter prospects in New York, but to wait and see what further his employer had to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Crabb bowed, but did not make any reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I take it for granted, Mr. Crabb, that your means are limited,” proceeded Socrates.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right there, sir. If I had not been poor I should not have accepted the position of teacher in Smith Institute for the pitiful salary of twenty dollars a month.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twenty dollars a month and your board, Mr. Crabb,” said Socrates, with dignity, “I consider a very fair remuneration.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not, Mr. Smith,” said the usher, in a decided tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I apprehend you will find it considerably better than to be out of employment,” said Socrates, rather angry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right there, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad you show signs of returning reason. Well, Mr. Crabb, I have thought the matter over, and I have a proposal to make to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, sir!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not wish to distress you by taking away your means of livelihood.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very considerate, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was something in Mr. Crabb’s tone that Socrates did not understand. It really seemed that he did not care whether he was taken back or not. But, of course, this could not be. It was absolutely necessary for him, poor as he was, that he should be reinstated. So Mr. Smith proceeded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To cut the matter short, I am willing to take you back on two conditions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I ask you to name them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The first is, that you shall apologize to my nephew for your unjustifiable attack upon him day before yesterday.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is the other, Mr. Smith?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The other is, that hereafter you will not exceed the limits of your authority.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you wish my answer?” asked the usher, raising his eyes, and looking fixedly at his employer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you please, Mr. Crabb.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, sir, you shall have it. Your proposal that I should apologize to that overgrown bully for restraining him in his savage treatment of a fellow-pupil is both ridiculous and insulting.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You forget yourself, Mr. Crabb,” said Socrates, gazing at the hitherto humble usher in stupefaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “As to promising not to do it again, you will understand that I shall make no such engagement.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, Mr. Crabb,” said Socrates, angrily, “I shall adhere to what I said the other day. At the end of this week you must leave me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course, sir, that is understood!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You haven’t another engagement, I take it,” said Mr. Smith, very much puzzled by the usher’s extraordinary independence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, I have.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed!” said Socrates, amazed. “Where do you go?” Then was Mr. Crabb’s time for triumph.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have received this morning an offer from the city of New York,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “From New York! Is it in a school?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir; I am to be private tutor in a family.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed! Do you receive as good pay as here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As good!” echoed the usher. “I am offered sixty dollars a month and board, with the possibility of a larger sum, in the event of extra service being demanded.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Socrates Smith had never been more surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n This Mr. Crabb, whom he had considered to be under his thumb, as being wholly dependent upon him, was to receive a salary which he considered princely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you get this office?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Through my friend, Hector Roscoe,” answered the usher.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably he is deceiving you. It is ridiculous to offer you such a sum.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am quite aware that you would never think of offering it, but, Mr. Smith, there are other employers more generous.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Crabb left the office with the satisfied feeling that he had the best of the encounter.. He would have felt gratified could he have known the increased respect with which he was regarded by the principal as a teacher who could command so lucrative an engagement in the great city of New York.\n\u003c/div\u003e \n\u003cdiv\u003e\n Before closing this chapter I must take notice of one circumstance which troubled Mr. Smith, and in the end worked him additional loss.\n\u003c/div\u003e \n\u003cdiv\u003e\n I have already said that Jim Smith, in appropriating his uncle’s wallet, abstracted therefrom a five-dollar bill before concealing it in Hector’s pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n This loss Mr. Smith speedily discovered, and he questioned Jim about it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose Roscoe took it,” said Jim, glibly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he says he did not take the wallet,” said Socrates, who was assured in his own mind that his nephew was the one who found it on the bureau. Without stigmatizing him as a thief, he concluded that Jim meant to get Hector into trouble.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wasn’t it found in his pants’ pocket?” queried Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but why should he take five dollars out of the wallet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It doesn’t look likely that he would!” said Socrates, eying Jim keenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it may have been Ben Platt or Wilkins,” said Jim, with a bright idea.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So it might,” said the principal, with a feeling of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They said they were in the room—at any rate, Platt said so—at the time it was concealed, only he made a mistake and took Roscoe for me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is something in that, James. It may be as you suggest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are both sneaks,” said Jim, who designated all his enemies by that name. “They’d just as lieve do it as not. I never liked them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must look into this matter. It’s clear that some one has got this money, and whoever has it has got possession of it dishonestly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To be sure,” answered Jim, with unblushing assurance. “If I were you I would find out who did it, that is, if you don’t think Roscoe did it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t think Roscoe did it, now. You may tell Platt and Wilkins that I wish to see them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jim could not have been assigned a more pleasing duty. He hated the two boys quite as much as he did Hector, and he was glad to feel that they were likely to get into hot water.\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked about for some time before he found the two boys. At length he espied them returning from a walk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here, you two!” he called out, in a voice ef authority. “You’re wanted!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who wants us?” asked Ben Platt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My uncle wants you,” answered Jim, with malicious satisfaction. “You’d better go and see him right off, too. You won’t find it a trifling matter, either.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably Jim has been hatchng some mischief,” said Wilkins. “He owes us a grudge. We’ll go and see what it is.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2974/81939.html","bookId":349,"creation":"Aug 11, 2019 7:20:33 AM","modification":"Aug 11, 2019 7:20:33 AM"}
