{"id":44008,"no":31,"title":"CHAPTER XXXI. AN IMPORTANT LETTER.","content":"\u0026nbsp;The letter alluded to in the last chapter ran thus. It was written from Mr. Newman’s house in Madison Avenue, though inclosed in a business envelope: \n\u003cdiv\u003e\n “MASTER HECTOR ROSCOE: I learn that I am indebted to you for the rescue of my little daughter from imminent peril during my absence from home yesterday. A friend who witnessed her providential escape has given me such an account of your bravery in risking your own life to save that of an unknown child, that I cannot rest till I have had an opportunity of thanking you in person. You will do me a favor, if not otherwise engaged, if you will call at my house this evening, about eight o’clock. Yours gratefully,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Titus NEWMAN.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It is needless to say that Hector read this letter with feelings of gratification. It is true, as we are often told, that “virtue is its own reward,” but it is, nevertheless, pleasant to feel that our efforts to do well and serve others are appreciated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No bad news, I hope, Hector?” said Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered Hector. “You may read the letter, if you like, Mr. Ross.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Ross did so, and aloud, much to the surprise of everyone at table.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You did not tell me of this,” said Walter, in astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered Hector, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because Hector is modest,” Mr. Ross answered for him. “Now, if you had done such a thing, Walter, we should have been sure to hear of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know,” returned Walter, comically. “You don’t know how many lives I have saved within the last few years.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor anyone else, I fancy,” replied his father. “By the way, Hector, there is a paragraph about it in the Herald of this morning. I read it, little suspecting that you were the boy whose name the reporter was unable to learn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hector read the paragraph in question with excusable pride. It was, in the main, correct.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How old was the little girl?” asked Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Four years old, I should think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn’t quite so romantic as if she had been three times as old.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I couldn’t have rescued her quite as easily, in that case.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course, Hector was called upon for an account of the affair, which he gave plainly, without adding any of those embellishments which some boys, possibly some of my young readers, might have been tempted to put in.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are fortunate to have obliged a man like Titus Newman, Hector,” said Mr. Ross. “He is a man of great wealth and influence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know him, papa?” asked Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No—that is, not at all well. I have been introduced to him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Punctually at eight o’clock Hector ascended the steps of a handsome residence on Madison Avenue. The door was opened by a colored servant, of imposing manners.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Mr. Newman at home?” asked Hector, politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be kind enough to hand him this card?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently the servant reappeared, saying:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Newman will see you, sar, in the library. I will induct you thither.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” answered Hector, secretly amused at the airs put on by his sable conductor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Seated at a table, in a handsomely furnished library, sat a stout gentleman of kindly aspect. He rose quickly from his armchair and advanced to meet our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to see you, my young friend,” he said. “Sit there,” pointing to a smaller armchair opposite. “So you are the boy who rescued my dear little girl?”\n\u003c/div\u003e \n\u003cdiv\u003e\n His voice softened as he uttered these last few words, and it was easy to see how strong was the paternal love that swelled his heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was fortunate in having the opportunity, Mr. Newman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have rendered me a service I can never repay. When I think that but for you the dear child—” his voice faltered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t think of it, Mr. Newman,” said Hector, earnestly. “I don’t like to think of it myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you exposed yourself to great danger, my boy!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose I did, sir; but that did not occur to me at the time. It was all over in an instant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see you are modest, and do not care to take too great credit to yourself, but I shall not rest till I have done something to express my sense of your noble courage. Now, I am a man of business, and it is my custom to come to the point directly. Is there any way in which I can serve you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to hear it. Name it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am looking for a situation in some mercantile establishment, Mr. Newman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pardon me, but, judging from your appearance, I should not suppose that it was a matter of importance to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; I am poor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t look so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You judge from my dress, no doubt”—Hector was attired in a suit of fine texture—“I suppose I may say,” he added, with a smile, “that I have seen better days.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Surely, you are young to have met with reverses, if that is what you mean to imply,” the merchant remarked, observing our hero with some curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; if you have time, I will explain to you how it happened.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As the story has already been told, I will not repeat Hector’s words.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Newman listened with unaffected interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is certainly a curious story,” he said. “Did you, then, quietly surrender your claims to the estate simply upon your uncle’s unsupported assertion?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I beg pardon, sir. He showed me my father’s—that is, Mr. Roscoe’s—letter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Call him your father, for I believe he was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you, sir?” asked Hector, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do. Your uncle’s story looks like an invention. Let me think, was your father’s name Edward Roscoe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And in what year were you born?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In the year 1856.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At Sacramento?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I feel quite sure that I made your father’s acquaintance in the succeeding year, and your own as well, though you were an infant—that is, you were less than a year old.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did my father say anything of having adopted me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; on the contrary, he repeatedly referred to you as his child, and your mother also displayed toward you an affection which would have been at least unusual if you had not been her own child.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you think, sir—” Hector began.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think that your uncle’s story is a mere fabrication. He has contrived a snare in which you have allowed yourself to be enmeshed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am only a boy, sir. I supposed there was nothing for me to do but to yield possession of the estate when my uncle showed me the letter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was natural enough; and your uncle doubtless reckoned upon your inexperience and ignorance of the law.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What would you advise me to do, sir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The merchant leaned back in his chair, closed his eyes, and gave himself up to reflection. In the midst of his reverie the pompous servant entered, bringing a letter upon a silver salver.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A letter, sar,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will do. You can go, Augustus.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Newman glanced at the postmark, tore open the letter, read it with a frown, and then, as if he had suddenly formed a resolution, he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “This letter has helped me to a decision.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hector regarded him with surprise. What could the letter have to do with him?\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you any objection to going out to California by the next steamer?” asked Mr. New-man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” answered Hector, with animation “Am I to go alone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, alone.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2974/81947.html","bookId":349,"creation":"Aug 11, 2019 7:20:33 AM","modification":"Aug 11, 2019 7:20:33 AM"}
