{"id":44009,"no":32,"title":"CHAPTER XXXII. A WAYWARD YOUTH.","content":"\u0026nbsp;It is needless to say that Hector was very much surprised, not to say startled, at this sudden proposal. What could Mr. Newman possibly want him to go to California for? If on business, how did it happen that he trusted a mere boy with so responsible a mission? \n\u003cdiv\u003e\n The explanation came soon.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No doubt, you are surprised,” said the merchant, “at the proposal I have made you. I am not prepared myself to say that I am acting with good judgment. In making it, I have obeyed a sudden impulse, which is not always prudent. Yet, in more than one instance, I have found advantage in obeying such an impulse. But to my explanation. By the way, let me first ask you two or three questions. Have you any taste for any kind of liquor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” answered Hector, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Even if you had, do you think you would have self-control enough to avoid entering saloons and gratifying your tastes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is well. Do you play pool?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” answered Hector, wondering whither all these questions tended.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ask because playing pool in public rooms paves the way for intemperance, as bars are generally connected with such establishments.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t even know how to play pool, sir,” said Hector.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you ever bet or gamble?” continued the merchant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will understand why I ask all these questions when I tell you that I have a nephew now nineteen years of age, who does all these things. He is not only my nephew, but my ward. I have a moderate sum of money in my charge which belongs to him—enough, if he were a young man of correct habits, to buy him an interest in a respectable business. That use I had proposed to make of it when he reached twenty-one, or rather, to recommend to him, but for his yielding to temptation in more than one form, and, finally, running away from my protection.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is he now, sir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In California. Three months since he disappeared, and it was some weeks before I learned where he had gone. As I do not intend to conceal anything from you, I must tell you that he carried with him five hundred dollars purloined from my desk. This grieved me most of all. I wrote out to a mercantile friend in San Francisco, who knows the boy by sight, to hunt him up, and see if he could do anything for him. He writes me—this is the letter I hold in my hand—that he has seen Gregory, and expostulated with him, but apparently without effect. The boy has pretty much run through his money, and will soon be in need. I do not intend, however, to send him money, for he would misuse it. I don’t think it will do him any harm to suffer a little privation, as a fitting punishment for his wayward courses. I would not wish him to suffer too much, and I am anxious lest he should go further astray. I now come to the explanation of my proposal to you. I wish you to go to California, to seek out Gregory, obtain his confidence, and then persuade him to give up his bad course, and come home with you, prepared to lead a worthier life. Are you willing to undertake it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered Hector. “I will undertake it, since you are willing to place such a responsibility upon me. I will do my best to accomplish what you desire, but I may fail.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that case I will not blame you,” answered the merchant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What sort of a boy is Gregory? Shall I find it difficult to gain his confidence?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; he is a youth of very amiable disposition—indeed, he was generally popular among his companions and associates, but he is morally weak, and finds it difficult to cope with temptation. I believe that a boy like you will stand a better chance of influencing him than a man of mature age.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will do my best, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “One thing more. You may assure Gregory that I forgive him the theft of my money, though it gave me great pain to find him capable of such an act, and that I am prepared to receive him back into my favor if he will show himself worthy of it. I will give you a letter to that effect. Now, when will you be ready to start?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the next steamer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is well.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2974/81948.html","bookId":349,"creation":"Aug 11, 2019 7:20:33 AM","modification":"Aug 11, 2019 7:20:33 AM"}
