{"id":43985,"no":8,"title":"CHAPTER XIII. IN THE SCHOOLROOM.","content":"\u0026nbsp;“Mr. Crabb,” said Wilkins, “this is the new scholar, Roscoe. Mr. Smith asked me to bring him to you.” \n\u003cdiv\u003e\n “Ah, indeed!” said Crabb, adjusting his glasses, which seemed to sit uneasily on his nose. “I hope you are well, Roscoe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, sir; my health is good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The schoolbell will ring directly. Perhaps you had better come into the schoolroom and select a desk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you a classical scholar, Roscoe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And how far may you have gone now?” queried Crabb.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was reading the fifth book of Virgil when I left off study.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really, you are quite a scholar. I suppose you don’t know any Greek?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was in the second book of the Anabasis.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will go into the first class, then. I hope you will become one of the ornaments of the institute.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you. Is the first class under Mr. Smith?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I teach the first class,” said Crabb, with a modest cough.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought the principal usually took the first class himself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Smith comes into the room occasionally and supervises, but he has too much business on hand to teach regularly himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Mr. Smith a good scholar?” asked Hector.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ahem!” answered Mr. Crabb, evidently embarrassed; “I presume so. You should not ask Ahem! irrelevant questions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In fact, Mr. Crabb had serious doubts as to the fact assumed. He knew that whenever a pupil went to the principal to ask a question in Latin or Greek, he was always referred to Crabb himself, or some other teacher. This, to be sure, proved nothing, but in an unguarded moment, Mr. Smith had ventured to answer a question himself, and his answer was ludicrously incorrect.\n\u003c/div\u003e \n\u003cdiv\u003e\n The schoolroom was a moderate-sized, dreary-looking room, with another smaller room opening out of it, which was used as a separate recitation room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here is a vacant desk,” said Mr. Crabb, pointing out one centrally situated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think that will do. Who sits at the next desk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Smith’s nephew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, that big bully I saw on the playground?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush!” said Crabb, apprehensively. “Mr. Smith would not like to have you speak so of his nephew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So, Mr. Crabb is afraid of the cad,” soliloquized Hector. “I suppose I may think what I please about him,” he added, smiling pleasantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ye-es, of course; but, Master Roscoe, let me advise you to be prudent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he in your class?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he much of a scholar?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think he cares much for Latin and Greek,” answered Mr. Crabb. “But I must ring the bell. I see that it wants but five minutes of nine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About my desk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here is another vacant desk, but it is not as well located.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind. I will take it. I shall probably have a better neighbor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The bell was rung. Another teacher appeared, an elderly man, who looked as if all his vitality had been expended on his thirty years of teaching. He, too, was shabbily dressed—his coat being shiny and napless, and his vest lacking two out of the five original buttons.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess Smith doesn’t pay very high salaries,” thought Hector. “Poor fellows. His teachers look decidedly seedy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys began to pour in, not only those on the playground, but as many more who lived in the village, and were merely day scholars. Jim Smith stalked in with an independent manner and dropped into his seat carelessly. He looked around him patronizingly. He felt that he was master of the situation. Both ushers and all the pupils stood in fear of him, as he well knew. Only to his uncle did he look up as his superior, and he took care to be on good terms with him, as it was essential to the maintenance of his personal authority.\n\u003c/div\u003e \n\u003cdiv\u003e\n Last of all, Mr. Smith, the learned principal, walked into the schoolroom with the air of a commanding general, followed by Allan Roscoe, who he had invited to see the school in operation.\n\u003c/div\u003e \n\u003cdiv\u003e\n Socrates Smith stood upright behind his desk, and waved his hand majestically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My young friends,” he said; “this is a marked day. We have with us a new boy, who is henceforth to be one of us, to be a member of our happy family, to share in the estimable advantages which you all enjoy. Need I say that I refer to Master Roscoe, the ward of our distinguished friend, Mr. Allan Roscoe, who sits beside me, and with interest, I am sure, surveys our institute?”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he turned towards Mr. Roscoe, who nodded an acknowledgment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may say to Mr. Roscoe that I am proud of my pupils, and the progress they have made under my charge. (The principal quietly ignored the two ushers who did all the teaching.) When these boys have reached a high position in the world, it will be my proudest boast that they were prepared for the duties of life at Smith Institute. Compared with this proud satisfaction, the few paltry dollars I exact as my honorarium are nothing—absolutely nothing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Socrates looked virtuous and disinterested as he gave utterance to this sentiment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And now, boys, you will commence your daily exercises, under the direction of my learned associates, Mr. Crabb and Mr. Jones.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Crabb looked feebly complacent at this compliment, though he knew it was only because a visitor was present. In private, Socrates was rather apt to speak slightingly of his attainments.\n\u003c/div\u003e \n\u003cdiv\u003e\n “While I am absent with my distinguished friend, Mr. Roscoe, I expect you to pursue your studies diligently, and preserve the most perfect order.”\n\u003c/div\u003e \n\u003cdiv\u003e\n With these words, the stately figure of Socrates passed through the door, followed by Mr. Roscoe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A pleasant sight, Mr. Roscoe,” said the principal; “this company of ambitious, aspiring students, all pressing forward eagerly in pursuit of learning?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Quite true, sir,” answered Allan Roscoe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish you could stay with us for a whole day, to inspect at your leisure the workings of our educational system.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mr. Smith,” answered Mr. Roscoe, with an inward shudder; “but I have important engagements that call me away immediately.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we must reluctantly take leave of you. I hope you will feel easy about your nephew—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My ward,” corrected Allan Roscoe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I beg your pardon—I should have remembered—your ward.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I leave him, with confidence, in your hands, my dear sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So Allan Roscoe took his leave.\n\u003c/div\u003e \n\u003cdiv\u003e\n Let us look in upon the aspiring and ambitious scholars, after Mr. Smith left them in charge of the ushers.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jim Smith signalized his devotion to study by producing an apple core, and throwing it with such skillful aim that it struck Mr. Crabb in the back of the head.\n\u003c/div\u003e \n\u003cdiv\u003e\n The usher turned quickly, his face flushed with wild indignation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who threw that missile?” he asked, in a vexed tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course no one answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope no personal disrespect was intended,” continued the usher.\n\u003c/div\u003e \n\u003cdiv\u003e\n Again no answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does anyone know who threw it?” asked Mr. Crabb.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think it was the new scholar,” said Jim Smith, with a malicious look at Hector.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Master Roscoe,” said Mr. Crabb, with a pained look, “I hope you have not started so discreditably in your school life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” answered Hector; “I hope I am not so ungentlemanly. I don’t like to be an informer, but I saw Smith himself throw it at you. As he has chosen to lay it to me, I have no hesitation in exposing him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jim Smith’s face flushed with anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll get even with you, you young muff!” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whenever you please!” said Hector, disdainfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really, young gentlemen, these proceedings are very irregular!” said Mr. Crabb, feebly.\n\u003c/div\u003e \n\u003cdiv\u003e\n With Jim Smith he did not remonstrate at all, though he had no doubt that Hector’s charge was rightly made.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2974/81924.html","bookId":349,"creation":"Aug 11, 2019 7:20:33 AM","modification":"Aug 11, 2019 7:20:33 AM"}
