{"id":43986,"no":9,"title":"CHAPTER IX. THE CLASS IN VIRGIL.","content":"\u0026nbsp;Presently the class in Virgil was called up. To this class Hector had been assigned, though it had only advanced about half through the third book of the AEneid, while Hector was in the fifth. \n\u003cdiv\u003e\n “As there is no other class in Virgil, Roscoe, you had better join the one we have. It will do you no harm to review.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, sir,” said Hector.\n\u003c/div\u003e \n\u003cdiv\u003e\n The class consisted of five boys, including Hector. Besides Jim Smith, Wilkins, Bates and Johnson belonged to it. As twenty-five lines had been assigned for a lesson, Hector had no difficulty in preparing himself, and that in a brief time. The other boys were understood to have studied the lesson out of school.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bates read first, and did very fairly. Next came Jim Smith, who did not seem quite so much at home in Latin poetry as on the playground. He pronounced the Latin words in flagrant violation of all the rules of quantity, and when he came to give the English meaning, his translation was a ludicrous farrago of nonsense. Yet, poor Mr. Crabb did not dare, apparently, to characterize it as it deserved.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think you have quite caught the author’s meaning, Mr. Smith,” he said. By the way, Jim was the only pupil to whose name he prefixed the title “Mr.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I couldn’t make anything else out of it,” muttered Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps some other member of the class may have been more successful! Johnson, how do you read it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t understand it very well, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wilkins, were you more successful?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Roscoe, can you translate the passage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think so, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Proceed, then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hector at once gave a clear and luminous rendering of the passage, and his version was not only correct, but was expressed in decent English. This is a point in which young classical scholars are apt to fail.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Crabb was not in the habit of hearing such good translations, and he was surprised and gratified.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well! Very well, indeed, Roscoe,” he said, approvingly. “Mr. Smith, you may go on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’d better go ahead and finish it,” said Smith, sulkily. “He probably got it out of a pony.”\n\u003c/div\u003e \n\u003cdiv\u003e\n My young readers who are in college or classical schools, will understand that a “pony” is an English translation of a classical author.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is mistaken!” said Hector, quietly. “I have never seen a translation of Virgil.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Smith shrugged his shoulders, and drew down the corners of his mouth, intending thereby to express his incredulity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope no boy will use a translation,” said the usher; “it will make his work easier for the time being, but in the end it will embarrass him. Roscoe, as you have commenced, you may continue. Translate the remainder of the passage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hector did so, exhibiting equal readiness.\n\u003c/div\u003e \n\u003cdiv\u003e\n The other boys took their turns, and then words were given out to parse. Here Jim Smith showed himself quite at sea; though the usher, as it was evident, selected the easiest words for him, he made a mistake in every one. Apparently he was by no means certain which of the words were nouns, and which verbs, and as to the relations which they sustained to other words in the sentence he appeared to have very little conception.\n\u003c/div\u003e \n\u003cdiv\u003e\n At length the recitation was over. It had demonstrated one thing, that in Latin scholarship Hector was far more accurate and proficient than any of his classmates, while Jim Smith stood far below all the rest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What in the world can the teacher be thinking of, to keep such an ignoramus in the class?” thought Hector. “He doesn’t know enough to join a class in the Latin Reader.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The fact was, that Jim Smith was unwilling to give up his place as a member of the highest class in Latin, because he knew it would detract from his rank in the school. Mr. Crabb, to whom every recitation was a torture, had one day ventured to suggest that it would be better to drop into the Caesar class; but he never ventured to make the suggestion again, so unfavorably was it received by his backward pupil. He might, in the case of a different pupil, have referred the matter to the principal, but Socrates Smith was sure to decide according to the wishes of his nephew, and did not himself possess knowledge enough of the Latin tongue to detect his gross mistakes.\n\u003c/div\u003e \n\u003cdiv\u003e\n After a time came recess. Hector wished to arrange the books in his desk, and did not go out.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Crabb came up to his desk and said: “Roscoe, I must compliment you on your scholarship. You enter at the head. You are in advance of all the other members of the class.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, sir,” said Hector, gratified.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is one member of the class who is not competent to remain in it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; I observed that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he is unwilling to join a lower class. It is a trial to me to hear his daily failures, but, perhaps, he would do no better anywhere else. He would be as incompetent to interpret Caesar as Virgil, I am afraid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I should suppose, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the way, Roscoe,” said the usher, hurriedly; “let me caution you against irritating Smith. He is the principal’s nephew, and so we give him more scope.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He seems to me a bully,” said Hector.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So he is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t understand why the boys should give in to him as they do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is taller and stronger than the other boys. Besides, he is backed up by the principal. I hope you won’t get into difficulty with him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mr. Crabb. Your caution is kindly meant, but I am not afraid of this Jim—Smith. I am quite able to defend myself if attacked.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope so,” said the usher; but he scanned Hector’s physical proportions doubtfully, and it was very clear that he did not think him a match for the young tyrant of the school.\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, Jim Smith and his schoolfellows were amusing themselves in the playground.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where’s that new fellow?” asked Jim, looking back to see whether he had come out.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He didn’t come out,” said Bates.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jim nodded his head vigorously:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just as I expected,” he said. “He knows where he is well off.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think he was afraid to come?” asked Bates.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To be sure he was. He knew what to expect.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to thrash him?” asked Johnson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should say I might.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s a very good Latin scholar,” remarked Wilkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He thinks he is!” sneered Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So Mr. Crabb appears to think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That for old Crabb!” said Jim, contemptuously, snapping his fingers. “He don’t know much himself. I’ve caught him in plenty of mistakes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was certainly very amusing, considering Smith’s absolute ignorance of even the Latin rudiments, but the boys around him did not venture to contradict him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But it don’t make any difference whether he knows Latin or not,” proceeded Jim. “He has been impudent to me, and he shall suffer for it. I was hoping to get a chance at him this recess, but it’ll keep.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You might spoil his appetite for dinner,” said Bates, who was rather a toady to Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s just exactly what I expect to do; at any rate, for supper. I’ve got to have a reckoning with that young muff.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The recess lasted fifteen minutes. At the end of that time the schoolbell rang, and the boys trooped back into the schoolroom.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hector sat at his desk looking tranquil and at ease. He alone seemed unaware of the fate that was destined for him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2974/81925.html","bookId":349,"creation":"Aug 11, 2019 7:20:33 AM","modification":"Aug 11, 2019 7:20:33 AM"}
