{"id":40355,"no":10,"title":"CHAPTER 10","content":"\u0026nbsp;He lay in bed later, wondering what Jeannette could have meant, what could account for that brief hurt look. \n\u003cdiv\u003e\n She was an attractive girl, he thought idly. He wondered why he felt nothing for her, when the native girl aroused in him such an unreasonable longing. It would be a good deal more convenient to fall for Jeannette.\n\u003c/div\u003e \n\u003cdiv\u003e\n He couldn\u0027t afford to get mixed up with his maid.\n\u003c/div\u003e \n\u003cdiv\u003e\n Remembering her, he suddenly felt his body trembling.\n\u003c/div\u003e \n\u003cdiv\u003e\n All right, he told himself, so she\u0027s an ignorant, backward native on a planet nobody ever heard of. Practically a savage. And even here, she\u0027s just a maid, a cleaning woman. Nobody a Planetary Administrator could think about getting mixed up with. But how do they turn them out like that?\n\u003c/div\u003e \n\u003cdiv\u003e\n How do they turn them out like that, he thought—every movement fluid, every position graceful, every gesture exquisite? How does this nonentity of a planet turn out a girl with the kind of walk the video-stars back home practice and work years to approach? With a voice with that indescribable music and precision? With a flawless skin, radiant hair, a serenity and self-confidence that would make the greatest beauties on Terra envious? With a quiet, careless pride that made him, the new ruler of her planet, awkward and insecure in the presence of his own servant?\n\u003c/div\u003e \n\u003cdiv\u003e\n Jeannette had been jealous, he realized suddenly. She was jealous of these girls, of their grace, of their radiance. Her cynicism covered a bitter envy.\n\u003c/div\u003e \n\u003cdiv\u003e\n For a long time he lay there, trying to sleep, haunted by Nanae\u0027s luminous eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3075/84938.html","bookId":979,"creation":"Aug 5, 2019 12:53:16 PM","modification":"Aug 5, 2019 12:53:16 PM"}
