{"id":40359,"no":14,"title":"CHAPTER 14","content":"\u0026nbsp;The children did not start fearfully or run, as he expected. They turned and stared at him in an unconcerned manner. \"You can\u0027t steal flowers,\" the boy said matter-of-factly. \"They don\u0027t belong to anybody.\" He looked at Kirk questioningly. \"You didn\u0027t plant them, did you?\" \n\u003cdiv\u003e\n Kirk stared at him, speechless.\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy went on, his tone slightly indignant. \"Anyway, it\u0027s very rude of you to speak to us like that!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They are quite right,\" an angry voice cut in. Kirk whirled around to find Nanae standing beside him, a basket in her hand. Her hair, radiant in the sunlight, was caught back from her face with a green ribbon, and the brown, gold-flecked eyes, for once, were not soft, but sparkling with anger. \"These are my sister\u0027s children,\" she said icily. \"They help me gather flowers for your table. Do you think just because they are young you have the right to treat them without respect?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Staring at her angry face, Kirk felt his own anger ebbing. Into his mind a forgotten incident flashed back from his childhood. Through a door left ajar in a neighboring apartment he had seen a ripe purple fruit imported from a newly discovered planet, and had taken it, curious to find out what unsynthetic food might taste like. He had been discovered, and angrily whipped and locked in his room. He remembered wiping away the tears, alone in his room, smarting with humiliation, and vowing he would show them, he would show them all; he would grow up to be so powerful he could have anything he wanted, and everybody would be afraid of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked now at Nanae, who had put an arm around each of the children, cradling them to her. His anger left him completely. Remembering the hurt child he had once been, he found himself longing for the touch of softness and kindness that had never come to him, wishing that even now for a moment he could take the children\u0027s place—lay his head against her breast, and feel her fold him in and brush her hand through his hair. He felt something melting inside of him. He could feel the lines of his face softening as he looked at them.\n\u003c/div\u003e \n\u003cdiv\u003e\n The words stuck, but he forced them out. \"I\u0027m sorry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s all right,\" said the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Leaning down, Kirk put an arm tentatively around each of the children, half-surprised at himself for the gesture. As he felt their small bodies relax against his, it seemed as though some deep inner tension began to flow out of him. He straightened up to find Nanae\u0027s glance on him surprisingly warm, almost tender. The approval in her eyes filled him with an unfamiliar kind of happiness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3075/84942.html","bookId":979,"creation":"Aug 5, 2019 12:53:16 PM","modification":"Aug 5, 2019 12:53:16 PM"}
