{"id":40354,"no":9,"title":"CHAPTER 9","content":"\u0026nbsp;The clear-eyed old Nemarian he\u0027d been talking to had just turned away when she came up. \n\u003cdiv\u003e\n \"Good evening. How do you like bird\u0027s eggs a la Nemar?\" Jeannette pointed to the shells beside him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hello. They\u0027re very good.\" He motioned her to sit down.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The youngsters here gather them out of the trees. They make a sport of it.\" She reached for one from the pile near them and tapped it open. \"Sentimental creatures—they always leave one or two so the mother bird won\u0027t be unhappy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Kirk was trying to draw his eyes away from the young Nemarian mother in the group near him who was complacently nursing her baby in full view of everyone. Jeannette stared in the direction of his look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you\u0027ll get used to that soon enough.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He wondered if he would. They made a rather touching picture, though, he realized through his embarrassment. There was a lot of tenderness in the woman\u0027s gestures.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They spoil their children rotten.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Kirk looked surprised. \"The ones I\u0027ve seen have been very courteous.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She shrugged. \"Oh, they\u0027re polite enough. But just try and make them do something they don\u0027t want to! They\u0027re completely undisciplined—they\u0027re fed when they please, they sleep when they please, they do whatever they like. They have schools for them, but it\u0027s completely up to the children whether they want to go or not. The parents haven\u0027t a thing to say about it. No one ever lays a hand to them, no matter what they do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t noticed any quarreling,\" he said, surprised at his own observation. It was true. He hadn\u0027t seen a sign of it, even between the children themselves, though they made enough noise yelling and romping.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, those tactics fit them perfectly for this society,\" she said indifferently. \"The adults here are just like the children. Nobody ever does any work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But that\u0027s impossible. The food, the houses, the—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I suppose I exaggerated. They do things they don\u0027t like once in awhile, if they want the end product enough. But mostly, if they can\u0027t make a big game of it, they don\u0027t do it. Tomorrow\u0027s nut-gathering day,\" she added irrelevantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nut-gathering day?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Everybody frolics off into the hills to pick nuts. Like a picnic. That\u0027s what I mean—if they didn\u0027t consider it a pleasure outing, the nuts could hit them on the head, and they\u0027d never bother to pick them up.\" She cocked her head at him. \"Want to go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go where? Nut-gathering, you mean?\" He laughed. \"No, thanks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thought you might like to study the natives in their day-to-day activities, get the real local flavor. You might learn something, at that. Though I guess you\u0027d have a rough time climbing the trees.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve had an hour a day at gymnastics for the past three years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, you look in good shape.\" Her glance swept over him approvingly. \"But gymnastics and those trees are two different things. The edible nuts grow on the tall trees, not the short ones, and they sway in the wind. The young men do most of the climbing. They\u0027re pretty wonderful physical specimens, I\u0027ll say that.\" She glanced at one of them near by, who was whispering in the ear of a Nemarian girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kirk felt oddly annoyed. They were magnificent physical specimens, he thought. But then so were the women and children. He realized that he hadn\u0027t seen a sickly or weak-looking native since he arrived. Even the old people kept their magnificent posture, and managed to make age seem a matter of gathering wisdom instead of collecting infirmities. Weren\u0027t they ever sick, he wondered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The girls are lovely, too,\" he reminded her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but try to get near one of them,\" she flashed back. \"They prefer their own.\" Her eyes narrowed. \"They\u0027re pleasant people, but they\u0027re not pleasant to live with. It gets on your nerves after awhile.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why didn\u0027t you leave, Jeannette?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On the spaceship you came on?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. There may not be another for five years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s the big question,\" she said slowly. \"I\u0027m not sure I know the answer. I half intended to leave on the ship when it came. But when it came down to it, I didn\u0027t leave.\" She stared ahead of her. \"Something about the place gets you. Maybe it\u0027s the life. Maybe you get used to lying around in the sun, and you feel kind of frightened at returning to all the hustle and bustle of Terra. And then, you keep waiting, hoping that—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hoping what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n For a moment, she looked defenseless and a little hurt. Then the cynical smile came back. \"You don\u0027t even know what you\u0027re hoping for, really,\" she said lightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n He knew she was evading him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3075/84937.html","bookId":979,"creation":"Aug 5, 2019 12:53:16 PM","modification":"Aug 5, 2019 12:53:16 PM"}
