{"id":101003,"no":27,"title":"Page 27","content":"\u003cp\u003eWrapping his arms around her, he gave her a big bear hug. “That might be overkill. Now, go sit, and I’ll bring out supper for you and Theo.”\u003c/p\u003e\n\u003cp\u003eMichelle didn’t have another quiet minute for the next three hours. After she and Theo had eaten, she put on an apron and got to work cleaning the tables and helping carry out pitchers of cold beer. Theo was stuck sitting at the bar between two men clutching papers in their hands. A line had formed behind him. Daddy was leaning over the counter making the introductions.\u003c/p\u003e\n\u003cp\u003eMore free legal advice, she thought. Myron had disappeared over an hour ago, and since her father was busy trying to manipulate Theo, she took over tending the bar.\u003c/p\u003e\n\u003cp\u003eBy ten-thirty the kitchen was officially closed and cleaned, and the crowd had thinned out. There were only about a dozen people inside the bar when she removed her apron and went to the jukebox. She put in a quarter she’d taken from the cash register, punched B-12, and then sat down at a corner table she’d just cleared. She leaned her elbow on the table and propped her chin in the palm of her hand.\u003c/p\u003e\n\u003cp\u003eHer gaze kept going back to Theo. The big jerk looked so serious and adorable in his gray T-shirt and jeans. Did he have to be so sexy? And why couldn’t she find something wrong with him so she could obsess about that and get over him. All she could think about was ha**ng s*x with him. Oh, God, did that mean she was turning into a slut? The sex would be amazing. Stop thinking about it. Think about something else.\u003c/p\u003e\n\u003cp\u003eAnother thought popped into her head that was even more depressing. Great. When he left — and he would leave — the town was going to blame her. Oh, they wouldn’t say anything, but they’d all think it was her fault. She hadn’t been friendly enough.\u003c/p\u003e\n\u003cp\u003eShe wondered how they would all feel if they knew just how friendly she wanted to be. Admit it, damn it. You’re feeling sorry for yourself because he will go back to Boston and his oh-so-sophisticated life there, and you want him to stay in Bowen. Forever.\u003c/p\u003e\n\u003cp\u003eWell, hell, how had that happened? How could she have been so stupid? Hadn’t counting up all the reasons why she shouldn’t fall for him meant anything? Evidently not. She’d been too naïve to pay attention to her own cautions. She was a strong woman, so why hadn’t she been able to protect herself from him? Did she love him? Oh, Lord, what if she did?\u003c/p\u003e\n\u003cp\u003eNot possible, she decided. Love couldn’t happen this quickly . . . could it?\u003c/p\u003e\n\u003cp\u003eMichelle was so busy worrying she didn’t notice him coming toward her.\u003c/p\u003e\n\u003cp\u003e“You look like you lost your best friend. Come on. Dance with me.”\u003c/p\u003e\n\u003cp\u003eGo away and let me wallow in self-pity. “Okay.”\u003c/p\u003e\n\u003cp\u003eTheo dug a quarter out of his pocket, dropped it in the jukebox, told her to choose, and she promptly punched A-1.\u003c/p\u003e\n\u003cp\u003eThe music started, but it wasn’t until he had taken her into his arms that she realized that she’d made a big mistake. The last thing she needed now, in her vulnerable, feeling-sorry-for-herself state, was to be touched by him.\u003c/p\u003e\n\u003cp\u003e“You’re as stiff as a board. Relax,” he whispered against her ear.\u003c/p\u003e\n\u003cp\u003e“I am relaxed.”\u003c/p\u003e\n\u003cp\u003eHe gently shoved her head down and pulled her closer until their bodies were pressed together. Oh, boy. Big, big mistake. Too late now, she thought as she snuggled against him and curled her fingers around his neck. “I love this song.”\u003c/p\u003e\n\u003cp\u003e“It sounds familiar, but that doesn’t make any sense. I don’t usually listen to country western music.”\u003c/p\u003e\n\u003cp\u003e“It’s Willie Nelson singing ‘Blue Eyes Cryin’ in the Rain.’”\u003c/p\u003e\n\u003cp\u003eHe was nuzzling her cheek, driving her to distraction. “It’s a nice song. I like it,” he said.\u003c/p\u003e\n\u003cp\u003eShe tried to pull back; he wouldn’t let her. “It’s a sad song,” she said, cringing over how antagonistic she sounded.\u003c/p\u003e\n\u003cp\u003eThey swayed slowly to the rhythm of the music.\u003c/p\u003e\n\u003cp\u003e“It’s an old story,” she explained.\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003eHe kissed the sensitive spot just below her ear, giving her goose bumps. She trembled. He had to know what he was doing to her. Oh, God, she really was putty in his hands.\u003c/p\u003e\n\u003cp\u003e“It’s about a woman who falls in love with a man and then he leaves her and she’s . . .”\u003c/p\u003e\n\u003cp\u003e“Let me guess . . . crying in the rain?”\u003c/p\u003e\n\u003cp\u003eShe could hear the laughter in his voice. His hand was gently stroking her back.\u003c/p\u003e\n\u003cp\u003e“How come he leaves her?”\u003c/p\u003e\n\u003cp\u003e“Because he’s a big jerk.” Too late she realized she’d said the thought out loud. She quickly added, “It’s just a song. I’m only guessing. Maybe she actually left him, and she’s so happy to be rid of him she’s crying in the rain.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003eShe moved closer, her fingers softly rubbing the back of his neck in tiny circles.\u003c/p\u003e\n\u003cp\u003e“You should probably stop doing that.”\u003c/p\u003e\n\u003cp\u003e“You don’t like it?” She ran her fingertips through his hair as she asked the question.\u003c/p\u003e\n\u003cp\u003e“Yes, I do like it. That’s why I want you to stop.”\u003c/p\u003e\n\u003cp\u003e“Oh.” So she could make him nuts too. That wonderful realization made her feel a little reckless.\u003c/p\u003e\n\u003cp\u003e“So, you probably don’t want me to do this,” she whispered, and kissed the pulse at the base of his neck.\u003c/p\u003e\n\u003cp\u003e“Michelle, I’m warning you. Two can play this game.”\u003c/p\u003e\n\u003cp\u003e“What game?” she asked innocently, and then she kissed his neck again, tickling him with her tongue. She felt a bit daring. Daddy was in the kitchen, and no one was paying them any attention. Besides, Theo’s big body pretty much concealed hers. That made her even more reckless, and she pressed even closer to him. “If you don’t like what I’m doing . . .”\u003c/p\u003e\n\u003cp\u003eThe challenge didn’t go unanswered. “You’re bad,” he told her.\u003c/p\u003e\n\u003cp\u003eShe sighed. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“You know what I like?”\u003c/p\u003e\n\u003cp\u003e“What’s that?” A breathless whisper.\u003c/p\u003e\n\u003cp\u003e“I like the way you smell. When I get close to you, your scent drives me crazy and makes me think about all sorts of things I’d like to do.” She closed her eyes. Don’t ask. For the love of God, don’t ask. “What kinds of things?”\u003c/p\u003e\n\u003cp\u003eUntil that moment, she had foolishly believed she’d been holding her own against a master. She had been the one to start the erotic conversation, and she knew from the way he was holding her that she’d definitely shaken him.\u003c/p\u003e\n\u003cp\u003eBut then he began whispering in her ear, and she realized she was in way over her head. In a low, husky voice he told her exactly what he’d like to do to her. In his fantasies, she was, of course, the star, and every part of her body, including her toes, were featured players. The man had an active imagination, and he certainly wasn’t shy about sharing. Michelle had no one to blame but herself. She had asked. But that didn’t matter. By the time he finished describing several creative ways he would make love to her, the blood was roaring in her ears, her bones felt as if they’d turned into mush, and she had melted against him.\u003c/p\u003e\n\u003cp\u003eThe song ended. He kissed her cheek, straightened, and let go of her. “Thanks for the dance. You want a beer or something? You look kind of flushed.”\u003c/p\u003e\n\u003cp\u003eKind of flushed? She felt as if it was a hundred fifty degrees inside the bar. When she looked into his eyes, she could tell that he knew exactly what he had just done to her.\u003c/p\u003e\n\u003cp\u003e“It’s kind of stuffy in here. I think I’m gonna go outside and get some fresh air,” he casually announced.\u003c/p\u003e\n\u003cp\u003eShe watched him walk away. He had just pushed the door open and stepped outside when she went running after him.\u003c/p\u003e\n\u003cp\u003e“That’s it.”\u003c/p\u003e\n\u003cp\u003eShe caught up with him outside, standing in the moonlight. She poked him between his shoulder blades and said it again, much louder this time. “That’s it. You win.”\u003c/p\u003e\n\u003cp\u003eHe turned around. “Excuse me?”\u003c/p\u003e\n\u003cp\u003eShe was so angry she poked him in the chest. “I said you win.”\u003c/p\u003e\n\u003cp\u003e“Okay,” he said calmly. “What did I win?”\u003c/p\u003e\n\u003cp\u003e“You know what I’m talking about, but since we’re alone, why don’t I spell it out? This game we’ve been playing. You win. I honestly thought I was holding my own, but obviously I was wrong. I’m just not good at it. Okay? So you win.”\u003c/p\u003e\n\u003cp\u003e“What exactly do I win?”\u003c/p\u003e\n\u003cp\u003e“Sex.”\u003c/p\u003e\n\u003cp\u003eHe raised an eyebrow. “What?”\u003c/p\u003e\n\u003cp\u003e“You heard me. We’re going to have sex, Theo Buchanan. Oops, I mean we’re going to have great sex. Got that?”\u003c/p\u003e\n\u003cp\u003eA devilish smile crossed Theo’s face, and then he seemed to stare off into space. Was he already thinking about making love, or couldn’t he pay attention long enough to listen to her concede?\u003c/p\u003e\n\u003cp\u003e“Michelle, honey —”\u003c/p\u003e\n\u003cp\u003e“You’re not paying attention, are you? I want to have sex with you. The bad kind,” she qualified. “You know what I’m talking about. The hot, steamy, tear-our-clothes-off, mind-blowing, scream-out-loud sex. Like in the old song ‘All Night Long,’ that’s you and me, babe. All night long. You name the time and the place, and I’m there.”\u003c/p\u003e\n\u003cp\u003eShe’d apparently rendered him speechless. That had to be a first. Maybe she wasn’t so bad at this stuff after all. Theo just stared at her with that lopsided grin in place. She suddenly felt as cocky as a rooster getting ready to crow.\u003c/p\u003e\n\u003cp\u003eShe folded her arms across her waist and demanded, “So? What have you got to say to that?”\u003c/p\u003e\n\u003cp\u003eHe took a step toward her. “Michelle, I’d like you to meet an old friend of mine, Noah Clayborne. Noah, this is Michelle Renard.”\u003c/p\u003e\n\u003cp\u003eHe was bluffing. He had to be bluffing. She gave a tiny shake of her head. He nodded. She shook her head again, whispered, “Oh, God,” and closed her eyes. This couldn’t be happening.\u003c/p\u003e\n\u003cp\u003eShe didn’t want to turn around. She wanted to vanish into thin air. How long had he been standing there? Her face began to burn. She swallowed, then forced herself to turn.\u003c/p\u003e\n\u003cp\u003eHe was there, all right. Tall, blond, amazing blue eyes, and a killer smile.\u003c/p\u003e\n\u003cp\u003e“It’s nice to meet you,” she stammered. Her voice sounded like she had laryngitis.\u003c/p\u003e\n\u003cp\u003eUntil she’d turned, she hadn’t thought it could get any worse. She was wrong about that. Her father was standing in the doorway, just a few feet away from Noah, and he was definitely close enough to have overheard what she’d said to Theo. Maybe he hadn’t heard, though. Maybe he’d just gotten there. She gathered her courage and glanced at him. Daddy looked thunderstruck.\u003c/p\u003e\n\u003cp\u003eMichelle came up with a quick game plan. She would simply pretend it hadn’t happened.\u003c/p\u003e\n\u003cp\u003e“Did you just get here?” she asked nonchalantly.\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” Noah drawled. “So, Theo, are all the pretty ladies in Bowen this friendly?”\u003c/p\u003e\n\u003cp\u003eThe door slammed shut behind her father as he rushed forward. Now he appeared mortified. “When I said ‘put out the welcome mat,’ I thought you understood what I meant. There’s friendly and then there’s real friendly, and I raised you to know the difference.”\u003c/p\u003e\n\u003cp\u003e“Daddy, Theo was flirting, and I was simply calling his bluff.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t bluffing.” Theo shrugged.\u003c/p\u003e\n\u003cp\u003eHer foot came down hard on top of his exactly one second later.\u003c/p\u003e\n\u003cp\u003e“Yes, you were,” she said. “Honest, Daddy, I was just . . . teasing.”\u003c/p\u003e\n\u003cp\u003e“We’ll be talking about this later, young lady,” Jake said as he turned and walked back inside.\u003c/p\u003e\n\u003cp\u003eThen Noah piped in. “Theo was flirting? You’re kidding about that, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“He was flirting.”\u003c/p\u003e\n\u003cp\u003e“We’re talking about the guy standing behind you. Theo Buchanan?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“It’s hard to believe. I don’t think he knows how to flirt.”\u003c/p\u003e\n\u003cp\u003e“Oh, he’s really good at it. Honest,” she insisted.\u003c/p\u003e\n\u003cp\u003e“Yeah? It must be you, then. I was telling Jake that this is the first time in over five years that I’ve seen Theo wearing anything but a suit and a tie. He’s always been a workaholic for as long as I’ve known him. Maybe you bring out the bad,” he said, drawing the word out, “in him.”\u003c/p\u003e\n\u003cp\u003eShe took a step back and bumped into Theo. She wasn’t thinking about running, but she didn’t like knowing he blocked her exit. “Could we please change the subject?” she asked.\u003c/p\u003e\n\u003cp\u003eNoah took pity on her. “Sure we can. Theo told me you’re a doctor.”\u003c/p\u003e\n\u003cp\u003e“Yes, that’s right.” Good, she was back on safe ground. Maybe Noah had some kind of medical problem and wanted her advice. God, she hoped so.\u003c/p\u003e\n\u003cp\u003e“What kind of a doctor are you?”\u003c/p\u003e\n\u003cp\u003e“She’s a surgeon,” Theo answered.\u003c/p\u003e\n\u003cp\u003eNoah grinned. “Aren’t you kind of young to be playing with knives?”\u003c/p\u003e\n\u003cp\u003e“She operated on me.”\u003c/p\u003e\n\u003cp\u003eNoah shrugged. Then he moved forward. “Dance with me. We’ll find a nice Willie Nelson song and get to know each other.”\u003c/p\u003e\n\u003cp\u003eHe draped his arm around her shoulder and led her back inside. Theo stood there frowning as he watched the familiarity. Noah was a blatant womanizer. He’d made more conquests than Genghis Khan, and Theo didn’t like seeing him work his charms on Michelle one bit.\u003c/p\u003e\n\u003cp\u003eShe perked up. “You like Willie Nelson?”\u003c/p\u003e\n\u003cp\u003e“Sure I do. Everyone likes Willie.”\u003c/p\u003e\n\u003cp\u003eShe glanced back at Theo. “Your friend has good taste.”\u003c/p\u003e\n\u003cp\u003eThen Noah drew her attention. “Could I ask you a question?”\u003c/p\u003e\n\u003cp\u003eShe was so thankful she’d gotten past her embarrassment, she said, “You may ask me anything.”\u003c/p\u003e\n\u003cp\u003e“I was just wondering . . .”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Is there any other kind of sex besides the bad kind?”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-FOUR\u003c/p\u003e\n\u003cp\u003eCameron knew he had screwed up, but he wasn’t going to admit it. He leaned against the paneled wall of John’s library, his head bowed, as Dallas and Preston and John took turns tearing into him.\u003c/p\u003e\n\u003cp\u003e“How long do you think it will take the doctor to remember she saw you at Catherine’s funeral?” Preston asked as he jumped up from his chair. Slamming his powerful fist into the palm of his other hand, he paced back and forth across the room.\u003c/p\u003e\n\u003cp\u003e“She won’t remember,” Cameron muttered. “I was never anywhere near her at the funeral. Besides, I was sick of waiting, and I think the risk was worth it.”\u003c/p\u003e\n\u003cp\u003eDallas exploded. “How could it be worth the risk, you ass? You didn’t get the package, and now you’ve got people looking for it. You’re a mess, Cameron. It’s the booze. It’s fried your brain.”\u003c/p\u003e\n\u003cp\u003ePreston stopped in front of him. “Now you’ve put us all in jeopardy,” he shouted.\u003c/p\u003e\n\u003cp\u003e“Screw you,” Cameron shouted back.\u003c/p\u003e\n\u003cp\u003e“Calm down,” John ordered. “Dallas, get Monk on the phone. You need to read him that report.” \u003c/p\u003e","sourceLink":"https://allnovel.net/mercy-buchanan-renard-2/page-27.html","bookId":1834,"creation":"Oct 5, 2019 9:53:33 PM","modification":"Oct 5, 2019 9:53:33 PM"}
