{"id":89546,"no":6,"title":"Page 6","content":"\u003cp\u003e“That’s right.” She was staring into Theo’s eyes when she answered. She had a green mask on, but he knew she was smiling.\u003c/p\u003e\n\u003cp\u003eHe was in such a happy daze now and so sleepy he was having trouble keeping his eyes open. Conversation swirled around him, but none of it made any sense.\u003c/p\u003e\n\u003cp\u003eA woman’s voice. “Where did you find him, Dr. Renard?”\u003c/p\u003e\n\u003cp\u003e“At a party.”\u003c/p\u003e\n\u003cp\u003eAnother woman leaned over him. “Hubba, hubba.”\u003c/p\u003e\n\u003cp\u003e“Was it love at first sight?”\u003c/p\u003e\n\u003cp\u003e“You decide. He threw up all over me and ruined my new dress.”\u003c/p\u003e\n\u003cp\u003eSomeone laughed. “Sounds like love to me. I’ll bet he’s married.\u003c/p\u003e\n\u003cp\u003eAll the good-looking men are married. This one’s sure built. Did you check out the goods, Annie?”\u003c/p\u003e\n\u003cp\u003e“I hope our patient is sleeping.”\u003c/p\u003e\n\u003cp\u003e“Not yet,” a male voice said. “But he isn’t going to remember anything.”\u003c/p\u003e\n\u003cp\u003e“Where’s the assist?”\u003c/p\u003e\n\u003cp\u003e“Scrubbing.”\u003c/p\u003e\n\u003cp\u003eThere seemed to be a party going on. Theo thought there were at least twenty or thirty people in the room with him. Why was it so damned cold? And who was making all the clatter? He was thirsty. His mouth felt like it was full of cotton. Maybe he ought to go get a drink. Yeah, that’s what he would do.\u003c/p\u003e\n\u003cp\u003e“Where’s Dr. Cooper?”\u003c/p\u003e\n\u003cp\u003e“Probably passed out in the dessert by now.” Blue Eyes answered the question. Theo loved the sound of her voice. It was so damned sexy.\u003c/p\u003e\n\u003cp\u003e“So you saw Cooper at the party?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” Blue Eyes answered. “He wasn’t on call tonight. He works hard. It was nice to see him having a good time. Mary Ann’s probably having a great time too.”\u003c/p\u003e\n\u003cp\u003e“You.” Theo struggled to get the word out. Still, he’d gotten her attention because when he opened his eyes, she was leaning over him, blocking out the glaring light above him.\u003c/p\u003e\n\u003cp\u003e“It’s time for you to go to sleep, Mr. Buchanan.”\u003c/p\u003e\n\u003cp\u003e“He’s fighting it.”\u003c/p\u003e\n\u003cp\u003e“What . . .” Theo began.\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“What do you want from me?”\u003c/p\u003e\n\u003cp\u003eThe man hiding behind him answered. “Mike wants your appendix, Mr. Buchanan.”\u003c/p\u003e\n\u003cp\u003eIt sounded good to him. He was always happy to accommodate a beautiful woman. “Okay,” he whispered. “It’s in my wallet.”\u003c/p\u003e\n\u003cp\u003e“We’re ready.”\u003c/p\u003e\n\u003cp\u003e“It’s about time,” the man said.\u003c/p\u003e\n\u003cp\u003e“Who do you want to hear tonight, Dr. Renard?”\u003c/p\u003e\n\u003cp\u003e“Need you ask, Annie?”\u003c/p\u003e\n\u003cp\u003eA groan went around the room. Then a click. Theo heard the chair squeak behind him, then the stranger’s voice telling him to take deep breaths. Theo finally figured out who the man behind him was. Damn if it wasn’t Willie Nelson, and he was singing to him, something about Blue Eyes cryin’ in the rain.\u003c/p\u003e\n\u003cp\u003eIt was one hell of a party.\u003c/p\u003e\n\u003cp\u003eCHAPTER FOUR\u003c/p\u003e\n\u003cp\u003eTheo slept through recovery. When he awoke the following morning, he was in a hospital bed. The side rails were up, and he was hooked to an IV. He closed his eyes and tried to clear his mind. What the hell had happened to him? He couldn’t remember.\u003c/p\u003e\n\u003cp\u003eIt was past ten o’clock when he opened his eyes again. She was there, standing beside the bed, pulling the sheets up around his waist. Blue Eyes. He hadn’t imagined her after all.\u003c/p\u003e\n\u003cp\u003eShe looked different today. She was still dressed in surgical scrubs, but her hair wasn’t hidden underneath a cap. It was down around her shoulders, and the color was a deep, rich auburn.\u003c/p\u003e\n\u003cp\u003eShe was much prettier than he remembered.\u003c/p\u003e\n\u003cp\u003eShe noticed he was awake. “Good morning. How are you feeling? Still a little drowsy?”\u003c/p\u003e\n\u003cp\u003eHe struggled to sit up. She reached for the controls and pushed a button. The head of the bed slowly rose. Theo felt a tugging in his side and a mild stinging sensation.\u003c/p\u003e\n\u003cp\u003e“Tell me when.”\u003c/p\u003e\n\u003cp\u003e“That’s good,” he said. “Thanks.”\u003c/p\u003e\n\u003cp\u003eShe picked up his chart and started writing while he blatantly stared at her. He felt vulnerable and awkward sitting in bed in a hospital gown. He couldn’t think of anything clever to say to her. For the first time in his life he wanted to be charming, but he didn’t have the faintest idea how to go about it. He was a die-hard workaholic, and there simply hadn’t been room for social graces in his life. In the last four years — since his wife’s death — he had become blunt, abrasive, and to the point because it saved time, and Theo, these days anyway, was always in a hurry to get things done. This sudden turnabout surprised him. He actually wanted to be charming. Go figure, as his youngest brother, Zack, would say. Still, Theo thought he could manage it. Yeah. Charming was definitely doable.\u003c/p\u003e\n\u003cp\u003e“Do you remember what happened last night?” she asked, glancing up from her notes.\u003c/p\u003e\n\u003cp\u003e“I had surgery.”\u003c/p\u003e\n\u003cp\u003e“Yes. Your appendix was removed. Another fifteen minutes and you definitely would have ruptured.”\u003c/p\u003e\n\u003cp\u003e“I remember bits and pieces. What happened to your eye?”\u003c/p\u003e\n\u003cp\u003eShe smiled as she started writing in his chart again. “I didn’t duck fast enough.”\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003e“Dr. Renard.”\u003c/p\u003e\n\u003cp\u003e“Mike?”\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003e“Someone called you Mike.”\u003c/p\u003e\n\u003cp\u003eMichelle closed the folder, put the lid back on her ink pen, and tucked it into her pocket. She gave him her full attention. The surgical nurses were right. Theo Buchanan was gorgeous . . . and sexy as hell. But none of that should matter. She was his physician, nothing more, nothing less, yet she couldn’t help reacting to him as any woman naturally would react to such a fit specimen. His hair was sticking up and he needed a shave, but he was still sexy. There wasn’t anything wrong with her noticing that . . . unless, of course, he noticed her noticing.\u003c/p\u003e\n\u003cp\u003e“You just asked me a question, didn’t you?” She drew a blank.\u003c/p\u003e\n\u003cp\u003eHe could tell he’d rattled her, but he didn’t know why. “I heard someone call you Mike.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Yes. The staff calls me Mike. It’s short for Michelle.”\u003c/p\u003e\n\u003cp\u003e“Michelle’s a pretty name.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eIt was all coming back to Theo now. He was at a party, and there was this beautiful woman in a slinky black evening gown. She was breathtaking. He remembered that. She had killer blue eyes and Willie Nelson was with her. He was singing. No, that couldn’t be right. Obviously, his head hadn’t quite cleared yet.\u003c/p\u003e\n\u003cp\u003e“You were talking to me . . . after the surgery,” he said.\u003c/p\u003e\n\u003cp\u003e“In recovery. Yes,” she agreed. “But you were doing most of the talking.” She was smiling again.\u003c/p\u003e\n\u003cp\u003e“Yeah? What did I say?”\u003c/p\u003e\n\u003cp\u003e“Mostly gibberish,” she said.\u003c/p\u003e\n\u003cp\u003e“You took my gun. Where is it?”\u003c/p\u003e\n\u003cp\u003e“Locked up in the hospital safe with your other personal possessions. Dr. Cooper will make sure you get them back before you leave. He’s going to be taking over your care. You’ll meet him in a little while when he makes his rounds.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Why what, Mr. Buchanan?”\u003c/p\u003e\n\u003cp\u003e“Theo,” he corrected. “My name’s Theo.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know. Your brother told me you go by that nickname.”\u003c/p\u003e\n\u003cp\u003e“Which brother?”\u003c/p\u003e\n\u003cp\u003e“How many do you have?”\u003c/p\u003e\n\u003cp\u003e“Five,” he answered. “And two sisters. So who’d you talk to?”\u003c/p\u003e\n\u003cp\u003e“Nick,” she answered. “You gave me his phone number and asked me to call him. He was concerned and made me promise to call him again after the surgery. As soon as you were wheeled into recovery, I called and assured him that you were going to be fine. He wanted to come,” she added, “but he sounded relieved when I told him it wasn’t necessary.”\u003c/p\u003e\n\u003cp\u003eTheo nodded. “Nick hates flying,” he explained. “When did I give you his phone number? I don’t remember.”\u003c/p\u003e\n\u003cp\u003e“When you were in pre-op. You were very talkative, once we gave you something to get rid of the pain, and by the way, the answer’s no.\u003c/p\u003e\n\u003cp\u003eI won’t marry you.”\u003c/p\u003e\n\u003cp\u003eHe smiled, sure she was joking. “I don’t remember being in pre-op. I remember the pain, though. It hurt like a son of a . . .”\u003c/p\u003e\n\u003cp\u003e“I’m sure it did.”\u003c/p\u003e\n\u003cp\u003e“You did the surgery, didn’t you? I didn’t imagine that?”\u003c/p\u003e\n\u003cp\u003e“Yes, I did the surgery.”\u003c/p\u003e\n\u003cp\u003eShe was backing out of the room. He didn’t want her to leave just yet. He wanted to find out more about her. Hell, he wished he were more adept at small talk.\u003c/p\u003e\n\u003cp\u003e“Wait.”\u003c/p\u003e\n\u003cp\u003eShe stopped. “Yes?”\u003c/p\u003e\n\u003cp\u003e“Water . . . could I have a glass of water?”\u003c/p\u003e\n\u003cp\u003eShe went to the bedside table, poured a tiny bit of water into a glass, and handed it to him. “Just a sip,” she said. “If you get nauseated and throw up, you’ll mess up my stitches.”\u003c/p\u003e\n\u003cp\u003e“Okay,” he said. He took a drink and handed the glass back to her. “You don’t look old enough to be a surgeon.” Stupid, he thought, but it was the best he could come up with at the moment.\u003c/p\u003e\n\u003cp\u003e“I hear that a lot.”\u003c/p\u003e\n\u003cp\u003e“You look like you should be in college.” That statement, he decided, was worse than stupid.\u003c/p\u003e\n\u003cp\u003eShe couldn’t resist. “High school, actually. They let me operate for extra credit.”\u003c/p\u003e\n\u003cp\u003e“Dr. Renard? May I interrupt?” A male aide was standing in the hallway, shifting a large cardboard box under his arm.\u003c/p\u003e\n\u003cp\u003e“Yes, Bobby?”\u003c/p\u003e\n\u003cp\u003e“Dr. Cooper filled this box with medical supplies from his office for your clinic,” the young man said. “What do you want me to do with it? Dr. Cooper left it at the nurses’ station, but they wanted it moved. It was in the way.”\u003c/p\u003e\n\u003cp\u003e“Would you mind taking it down to my locker?”\u003c/p\u003e\n\u003cp\u003e“It’s too big, Dr. Renard. It won’t fit. It isn’t heavy, though. I could carry it out to your car.”\u003c/p\u003e\n\u003cp\u003e“My father has the car,” she said. She glanced around, then looked at Theo. “Would you mind if Bobby left my box here? My father will carry it down to the car for me just as soon as he arrives.”\u003c/p\u003e\n\u003cp\u003e“I don’t mind,” Theo said.\u003c/p\u003e\n\u003cp\u003e“I won’t be seeing you again. I’m going home today, but don’t worry. You’re in good hands. Dr. Cooper’s chief of surgery here at Brethren, and he’ll take good care of you.”\u003c/p\u003e\n\u003cp\u003e“Where’s home?”\u003c/p\u003e\n\u003cp\u003e“In the swamp.”\u003c/p\u003e\n\u003cp\u003e“Are you kidding?”\u003c/p\u003e\n\u003cp\u003e“No,” she said. She smiled again, and he noticed the little dimple in her left cheek. “Home is a little town that’s pretty much surrounded by swamp, and I can’t wait to get back there.”\u003c/p\u003e\n\u003cp\u003e“Homesick?”\u003c/p\u003e\n\u003cp\u003e“Yes, I am,” she admitted. “I’m a small-town girl at heart. It isn’t a very glamorous life, and that’s what I like about it.”\u003c/p\u003e\n\u003cp\u003e“You like living in the swamp.” It was a statement not a question, but she responded anyway.\u003c/p\u003e\n\u003cp\u003e“You sound shocked.”\u003c/p\u003e\n\u003cp\u003e“No, just surprised.”\u003c/p\u003e\n\u003cp\u003e“You’re from a big, sprawling city, so you’d probably hate it.”\u003c/p\u003e\n\u003cp\u003e“Why do you say that?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “You seem too . . . sophisticated.”\u003c/p\u003e\n\u003cp\u003eHe didn’t know if that was a compliment or a criticism. “Sometimes you can’t go home. I think I read that in a book once. Besides, you look like a New Orleans kind of woman to me.”\u003c/p\u003e\n\u003cp\u003e“I love New Orleans. It’s a wonderful place to come for dinner.”\u003c/p\u003e\n\u003cp\u003e“But it won’t ever be home.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“So, are you the town doctor?”\u003c/p\u003e\n\u003cp\u003e“One of several,” she said. “I’m opening a clinic there. It’s not very fancy, but there’s a real need. So many of the people don’t have the resources to get regular medical care.”\u003c/p\u003e\n\u003cp\u003e“Sounds like they’re very lucky to have you.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Oh, no, I’m the lucky one.” Then she laughed. “That sounded saintly, didn’t it? I am the lucky one, though. The people are wonderful — at least I think they are — and they give me far more than I can give them.” When she spoke, her whole face lit up. “You know what I’m going to like best?”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“No games. For the most part, they’re honest, ordinary people trying to scrape a living together. They don’t waste a lot of time on foolishness.”\u003c/p\u003e\n\u003cp\u003e“So, everyone loves everyone else?” He scoffed at the notion.\u003c/p\u003e\n\u003cp\u003e“No, of course not,” she replied. “But I’ll know my enemies. They won’t sneak up behind me and blindside me. It isn’t their style.” She smiled again. “They’ll get right in my face, and I’m going to like that. Like I said, no games. After the residency I just finished, that’s going to be a refreshing change.”\u003c/p\u003e\n\u003cp\u003e“You won’t miss the big beautiful office and all the trappings?”\u003c/p\u003e\n\u003cp\u003e“Not really. There are rewards other than money. Oh sure, it would be great to have all the supplies and equipment we need, but we’ll make do. I’ve spent a lot of years getting ready for this . . . besides, I made a promise.”\u003c/p\u003e\n\u003cp\u003eHe kept asking her questions to keep her talking. He was interested in hearing about her town but not nearly as much as he was fascinated with her expressions. There was such passion and joy in her voice, and her eyes sparkled as she talked about her family and friends and the good she hoped she could do.\u003c/p\u003e\n\u003cp\u003eShe reminded him of how he had felt about life when he had first started practicing the law, before he’d become so cynical. He, too, had wanted to change the world, to make it a better place. Rebecca had ended all that. Looking back, he realized he had failed miserably.\u003c/p\u003e\n\u003cp\u003e“I’ve worn you out, going on and on about my hometown. I’ll let you rest now,” she said.\u003c/p\u003e\n\u003cp\u003e“When can I get out of here?”\u003c/p\u003e\n\u003cp\u003e“That’s Dr. Cooper’s call, but if it were up to me, I’d keep you another night. You had quite a nasty infection. You need to take it easy for a couple of weeks, and don’t forget to take your antibiotics. Good luck, Theo.”\u003c/p\u003e\n\u003cp\u003eAnd then she was gone, and he’d lost the only chance he had to find out more about her. He didn’t even know where her home was. He fell asleep trying to figure out a way to see her again.\u003c/p\u003e\n\u003cp\u003eCHAPTER FIVE\u003c/p\u003e\n\u003cp\u003eThe room was filled with flowers when Theo woke up from his morning nap. He heard whispering in the hallway, opened his eyes, and saw a nurse talking to an older man. She was pointing to the box the aide had left.\u003c/p\u003e\n\u003cp\u003eThe man looked like a retired linebacker, Theo thought. Or maybe a boxer. If he was Dr. Renard’s father, she’d gotten her good looks from her mother’s side of the family. \u003c/p\u003e","sourceLink":"https://allnovel.net/mercy-buchanan-renard-2/page-6.html","bookId":1834,"creation":"Oct 5, 2019 5:36:46 PM","modification":"Oct 5, 2019 5:36:46 PM"}
