{"id":92705,"no":11,"title":"Page 11","content":"\u003cp\u003eWITH THE GUYS off in Leonard Tallgrass’s pickup to examine the cow-killing ground, we girls had time for less gory expeditions of our own.\u003c/p\u003e\n\u003cp\u003eFirst I stopped at a centrally located, low-profile place I knew, the Thunderbird Inn (Tallgrass would approve) to book a room for Ric and me. When I called Ric with the info, we agreed to meet there when it got too dark for field explorations.\u003c/p\u003e\n\u003cp\u003eSuited me. An unloaded Dolly and I made a beeline straight for my Wichita place of employment … before I’d been effectively driven out of it by a lecherous vampire, a scheming weather witch, and a rogue personal tornado.\u003c/p\u003e\n\u003cp\u003eMost TV stations are modest one-story buildings attached to tall broadcast towers occupying high ground where land is cheap, far from the city center. WTCH-TV had the usual long entry driveway and suburban neighborhood.\u003c/p\u003e\n\u003cp\u003eI reflected that by now the male investigative team of two guys and a dog was sniffing and sifting through a cow-patty-laden field I’d last seen by the gleam of a flashlight illuminating mutilated cattle corpses.\u003c/p\u003e\n\u003cp\u003eAnother lovely Wichita memory, but it wasn’t as scary to me as all the “missing time” in my growing-up history. Right now, my major problem was to park Dolly discreetly. The aim was to avoid contact with anchorman Undead Ted Brinkman and Sheena Coleman, the station weather witch, during this hit-and-run visit.\u003c/p\u003e\n\u003cp\u003eI eased Delilah behind the far side of one of the station’s mobile broadcast vans.\u003c/p\u003e\n\u003cp\u003eWichita was having a quiet news day. Videographer “Slo-mo” Eddie Anderson had been happy to hear from my cell phone and was at the station as of ten minutes ago. One never knew when news would break out, so I slipped around the building to the back loading dock.\u003c/p\u003e\n\u003cp\u003eI’d have to scale it in my mid-heeled suit pumps and black leggings, worn under a mini-length navy shirtdress, the casual opposite of my conservative hose-and-suit-wearing on-camera self. Eddie was an ace camera guy, but the lanky, morose type who was always down on “management,” so he was a born liaison for a disgruntled ex-employee.\u003c/p\u003e\n\u003cp\u003e“Delilah,” he greeted me with a whisper when I’d clambered the four feet up to the loading dock and eased into the slightly open end of the steel security curtain. “Man, it’s been no fun fest with only the supernaturals running the news desk. You look like being gone agrees with you.”\u003c/p\u003e\n\u003cp\u003e“I’d had some bad days before Sheena sent a ‘freak’ tornado to take out my rental house. Sorry I didn’t stick around to say good-bye.”\u003c/p\u003e\n\u003cp\u003eEddie scratched at his scrawny new mustache. “Can’t blame you. They stole your paranormal news beats and then flaked out on covering them. They even rescheduled the interview we had cancelled, with the old lady at Sunset City retirement place. Then the new regime sent me back to Sunset City with Sheena, but her interview was pretty boring.”\u003c/p\u003e\n\u003cp\u003e“Really? That old woman, Caressa Teagarden, moved to the Vegas Sunset City. At least I found her there after I arrived.”\u003c/p\u003e\n\u003cp\u003e“Well, she must have been swept up and out in that targeted tornado of yours, because the old dame Sheena interviewed was named Lili West and she was a total fox of forty-something, like all of those artificially preserved Sunset City senior citizen residents. Your old Caressa lady looked senior. Kinda cool to see these days.”\u003c/p\u003e\n\u003cp\u003eI smiled, knowing what he meant. “She still does. Was Lili West at the same address as our aborted assignment?”\u003c/p\u003e\n\u003cp\u003e“Yeah, come to think of it. No general manager has ever done that to me, called me back from an assignment for no good reason, like a fast-food place mass shooting. Good thing he’s gone too.”\u003c/p\u003e\n\u003cp\u003e“Fred Fogelman is gone? Who’s running the station?”\u003c/p\u003e\n\u003cp\u003e“Guy named Javier. Hah-vee-air. Like I said, the place has gone downhill. It’s all happy ‘news you can use’ now.”\u003c/p\u003e\n\u003cp\u003e“It’d be a wonder if the station hadn’t declined with Undead Ted and Sheena taking over my beats,” I said. “Ted is an empty suit and a lame pair of fangs, and Sheena is a lousy weather witch without one reporter’s gene in her artificially supplemented body.”\u003c/p\u003e\n\u003cp\u003e“A little competitive with our weather gal, Sheena? You had network written all over you, Delilah. Sheena sure had it in for you.”\u003c/p\u003e\n\u003cp\u003e“Was it because I’d agreed to go out with Undead Ted that Friday? Didn’t even happen. He acted up and I kicked him out. He must have gone sniveling back to Sheena.”\u003c/p\u003e\n\u003cp\u003e“Maybe. Whatever bee got in her bonnet, it just sprung up, like a high pressure cell. While you were off for the weekend, she was in the general manager’s office trashing you from that Saturday on through Monday. She tried to get our scoop footage from the cow pasture scene off the air, I know that. Then you and I were called back Monday en route to that dumb old-lady interview assignment at Sunset City the GM put you on. I think that was her doing too.”\u003c/p\u003e\n\u003cp\u003e“Saddling me with that lame feature or getting us called back?”\u003c/p\u003e\n\u003cp\u003e“One, or maybe both,” Eddie said. “It was just unprofessional, that’s what it was. And now, Undead Ted, he just trots along on Sheena’s leash like a vamp tranqued on blood thinners.”\u003c/p\u003e\n\u003cp\u003eThe conversation reminded me I’d spent that Saturday off taking my suddenly ailing dog to the vet, then finding he’d contracted blood poisoning and couldn’t be saved. All from biting Undead Ted’s ankle after the lech had tricked me into cutting a finger he wanted as an appetizer before mainlining on one of my major arteries after our dinner out.\u003c/p\u003e\n\u003cp\u003eI’d never heard of a vampire’s blood being poisonous to house pets before, like some species of plant, but then, they seldom did the bleeding and the Millennium Revelation was still revealing unsuspected supernatural variations and species. A pang of anxiety about Ric hit when I wondered what losing all your blood to vampires could do.\u003c/p\u003e\n\u003cp\u003e“I don’t know what went on that weekend, Eddie,” I told him. “I not only wasn’t scheduled to work, but I … lost my dog that Saturday.”\u003c/p\u003e\n\u003cp\u003e“That feisty white Lhasa? Too bad, Delilah. No wonder you were kinda down that Monday. You brought him in once. Akita or something.”\u003c/p\u003e\n\u003cp\u003eEddie’s mistake saved me from a total emotional rerun. Reporters live to inform and correct. “An Akita is a breed of Japanese dog. My Lhasa’s name was Achilles.”\u003c/p\u003e\n\u003cp\u003e“Oh.” As if he cared. Cameramen have seen it all and are a nonchalant breed. “Like the Greek hero with something wrong with his heel.”\u003c/p\u003e\n\u003cp\u003e“Like the hero with the bum heel,” I agreed, beating back the memories. As a pup, Achilles had always chased my heels, so the name was appropriate. I just didn’t expect that the “hero” part would get him killed.\u003c/p\u003e\n\u003cp\u003eEddie shook his head. “I don’t know what was going on that weekend, or since, but it’s been hell around here after you left. I’m thinking of quitting too.”\u003c/p\u003e\n\u003cp\u003e“You’re a great videographer.”\u003c/p\u003e\n\u003cp\u003e“But who does traditional ‘news’ anymore? We’re a dying breed. Whatcha doing in Vegas for a living?”\u003c/p\u003e\n\u003cp\u003e“Investigative work for a television producer, among other, er, major Vegas Strip clients.”\u003c/p\u003e\n\u003cp\u003e“Cool. You’ve landed on your girl-reporter pumps. I don’t wanta get you charged up about what’s over and done at the station. Besides Sheena being Bitch Witch, it’s a lot of management political correctness that’s been coming on for years. Hire the minorities, like the Latino brass, and the anchor vamps and the weather witches. You know the news has been going to hell since the big flare-up after the Millennium Revelation. It’s like, ‘Hey, the aliens have landed,’ but now they’re coming up out of our caves and cornfields and They R Us. Anyway, you can download your piece on the cow mutilations to your cell off my backup flash drive.”\u003c/p\u003e\n\u003cp\u003e“Great.” I was glad simple computerized functions didn’t need hookups now, just proximity. It was like zipless sex. In a second, his info was my info too.\u003c/p\u003e\n\u003cp\u003e“Hey, Delilah.” Eddie chuckled like a TV cartoon ghoul. “I added some hilarious footage of Undead Ted and Sheena screwing up on camera. I even caught ’em actually screwing in the dead storage vault. I YouTube that stuff now and then. You wanta come into the studio and say hello?”\u003c/p\u003e\n\u003cp\u003e“No, thanks. This is all I need, Eddie. Thanks for the ‘added value content.’”\u003c/p\u003e\n\u003cp\u003e“It’s a howl. Sheena accidentally had it hailing in the studio a couple weeks ago. Funny, we’ve been having a lot of freakish weather lately, but no indoor hail.”\u003c/p\u003e\n\u003cp\u003e“It’s the Midwest,” I said. “Freakish weather is our biggest tourist attraction.”\u003c/p\u003e\n\u003cp\u003e“Must be weird living in sunshine year-round in Vegas.”\u003c/p\u003e\n\u003cp\u003e“Yeah, it’s weird living in Vegas, but it’s not all sunshine,” I said in vague understatement.\u003c/p\u003e\n\u003cp\u003e“Can I help you off the loading dock?”\u003c/p\u003e\n\u003cp\u003eFast Eddie bent to stretch out a lank arm with a helping hand on the end of it.\u003c/p\u003e\n\u003cp\u003e“Eddie, the gentleman? You must really miss me,” I commented as I grabbed his hand, although I appreciated his easing me through the four-foot drop.\u003c/p\u003e\n\u003cp\u003eHe straightened up to tower above me, shaking his head, even his mustache drooping morosely. “You have no idea.”\u003c/p\u003e\n\u003cp\u003eWITH QUICKSILVER ABSENT and unable to play guard, I’d left Dolly locked with her top up.\u003c/p\u003e\n\u003cp\u003eSo when I opened the driver’s door with my old-fashioned key—direct interface, imagine—I sat in the interior shade and played Slo-mo Eddie’s treasure trove of scenes.\u003c/p\u003e\n\u003cp\u003eI watched his recording of my stand-up report on the dark country road by the cattle mutilation scene earlier that spring … as if from years later or a planet away. It was a good story, told without glitches, but I seemed so young and polite and parochial-school girl.\u003c/p\u003e\n\u003cp\u003eI’d reeled off the bit-role lines Hector Nightwine had given me on CSI V in Vegas a week ago with a new edge that came naturally. The portly producer was hoping my performance would either lure my double, Lilith, back to the CSI fold, or establish me as her replacement. I hoped it would lure Lilith too. I wanted to know how long she’d been doing her twin act in my life before I’d spotted her on CSI.\u003c/p\u003e\n\u003cp\u003eThe image of the old, WTCH-TV Delilah made me rerun leaving Wichita two months ago. My first fill-up stop for Dolly at a remote Colorado gas station had forced me to fend off a trio of creepy backwoods guys and burn rubber out of there.\u003c/p\u003e\n\u003cp\u003eHaving to dodge booty bounty hunters going after my “CSI-autopsy-star” twin the moment I left Kansas had made me a lot warier and assertive. And way less polite. Not to mention that certain confidence I derived from finally getting a sex life. Knowing how the other 99 percent lived sure increased one’s daily savoir faire.\u003c/p\u003e\n\u003cp\u003eSighing as my sweet innocent self disappeared from the small screen, I soon was snickering at Undead Ted as he practiced resting his supposedly “supplemented” fang-tips on his lower lip before going “live” on camera.\u003c/p\u003e\n\u003cp\u003eWhen he was caught touching up his tinted lip gloss, I fast-forwarded past, my own recent passion-pit adventures with lip gloss making me blush like a schoolgirl again. Damn! Would my pale skin always make me a patsy for the unwanted flush? Probably.\u003c/p\u003e\n\u003cp\u003eI made a fierce face at the telltale screen, then slowed it to normal.\u003c/p\u003e\n\u003cp\u003eSeeing Undead Ted and Sheena lip-locking against the station blue-screen was like watching the Christmas Chipmunks with their braces in gridlock. There was enough bleach on those teeth to off Sheena. At least, I assumed, witches remained human enough to off. But then, my idea of a happy ending was Red Riding Hood or Hansel and Gretel. Or, more apropos to the current location, The Wizard of Oz.\u003c/p\u003e\n\u003cp\u003eWhile cruising the snips of my old news reports, I realized that I’d definitely grown by leaving my once-safe niche at WTCH. Eddie had ended my trip down bad-memory lane with Sheena’s later interview with the Sunset City resident of the new management’s choice.\u003c/p\u003e\n\u003cp\u003eSheena was an anorexic blonde with inflated bust and lips. Unlike a lot of “weather gals” who’d forged the way for weather witches to take their places, she was more about her looks and attitude than making “dry” weather statistics fascinating and relevant to the viewers.\u003c/p\u003e\n\u003cp\u003eWeather guys and gals had always been the geeks on the highly photogenic TV news teams of my growing-up era. The viewers sensed they had a real passion for their high-and low-pressure areas, that naughty acting-out El Niño, the evil confluence of clashing hot and cold fronts that makes the perfect storm.\u003c/p\u003e\n\u003cp\u003eLightning and thunder were still-living gods that could throw panic into human cardiac systems in the heartland, but we had our über-outlaw, our supernatural sky-dancer, our bane and our bragging point.\u003c/p\u003e\n\u003cp\u003eHere in Kansas, of course, it was that regal couple of phenomena, the Queen and King of murderously bad weather, the spinning, twirling, shimmying, livestock-sucking, clothes-stripping, tree-hurling, house-splintering, Dorothy-napping, witch-smashing … tornado.\u003c/p\u003e\n\u003cp\u003eI actually took a certain perverse pride in having been the worthy victim of one, even if it had been an intensely personal strike from a weather witch on my TV “team.” A minor, secondary-city weather witch didn’t aim a teensyweensy sixty-foot-circumference “twister” at just … anybody. I had to have really pissed her off.\u003c/p\u003e\n\u003cp\u003eWhy? Not just jealousy.\u003c/p\u003e\n\u003cp\u003eSheena was becoming as much a mystery to me as Lilith.\u003c/p\u003e\n\u003cp\u003eThat couldn’t be allowed to continue.\u003c/p\u003e\n\u003cp\u003eI turned on Dolly’s engine and checked the rearview mirror before pulling beyond the safety screen of the station news van. Dolly was idling backward when my foot stabbed the brakes.\u003c/p\u003e\n\u003cp\u003eGood girl! Dolly didn’t let out so much as a squeak.\u003c/p\u003e\n\u003cp\u003eSpeak of the devils you know. I recognized Undead Ted’s and Sheena’s profiles through the tinted side windows of an impeccably washed black Lincoln Town Car also idling in the parking lot.\u003c/p\u003e\n\u003cp\u003eA moment later the swarthy capped driver got out to open the back passenger door.\u003c/p\u003e\n\u003cp\u003eI watched a hose-sheened, long, lean leg thrust out to place a scarlet platform spike shoe on the asphalt. Ugh. Sheena always dressed like the head bitch on a seventies nighttime TV soap opera. The short skirt of a slim red suit followed, along with her red-taloned fingernails, swollen-sphincter crimson lips and “done” blond hair.\u003c/p\u003e\n\u003cp\u003eThe same old Sheena, only much more expensively dressed.\u003c/p\u003e\n\u003cp\u003eUndead Ted crawled out after her, gazing like a love-sick puppy at the lady in bloodred.\u003c/p\u003e\n\u003cp\u003eEverybody at WTCH had known Ted took injections to resist daylight so he could do pre-sunset newscasts. A George Hamilton product pumped melatonin into his skin, giving him that golden glow. Now his vampy complexion looked just plain sallow, freckled with a carefully cultivated thirty-six-hour brown beard smudge. He was a liver-spotted puppy.\u003c/p\u003e\n\u003cp\u003eHis dried-blood-color designer suit—I’d seen Lightdays pads more attractively shaded—was much more posh, but only two-thirds up to Ric level. Standing next to Sheena, Ted looked … drained. Who was the vampire here?\u003c/p\u003e\n\u003cp\u003eThe driver had moved around to the car’s opposite passenger door.\u003c/p\u003e\n\u003cp\u003eI grabbed my cell phone and twisted my head over my shoulder to film the unhandsome couple and wait for a glimpse of their obvious lunch date. At first the Lincoln’s roofline just gleamed in the sun. Then I glimpsed something black rising over the hot metal horizon.\u003c/p\u003e\n\u003cp\u003eA hat. A wide black-leather brim somewhere between a flat-crowned Western hat and the razor-sharp oversize fedora affected by seventies pimps. It was almost a hat a woman might wear … if she were Janet Jackson onstage.\u003c/p\u003e\n\u003cp\u003eUnder the sinister brim surfaced a furrowed, seamed brow the mahogany-deep color of a Greek island suntan and peaked, scowling Satanic black eyebrows. The nose was long and bulged in the middle like a digesting boa constrictor. The tip narrowed and dipped so delicately it made the nostrils into thin upward-slanted slits you might see on a serpent’s face.\u003c/p\u003e\n\u003cp\u003eIn contrast, the mustache had a ragged upper line and drooped down over sloppy lips almost as obscenely full as Sheena’s collagen-pumped beauties.\u003c/p\u003e\n\u003cp\u003eI kept filming, thinking this moment was like watching a strike-ready royal Egyptian cobra rear its fanned head.\u003c/p\u003e\n\u003cp\u003eThe man’s suspicious, slitted dark eyes scanned the building and lot so intently I felt sure he’d seen me. Luckily, Ted and Sheena moving around to the car’s rear stopped his gaze before it passed the parked van that concealed Dolly. Black is beautiful … camouflage.\u003c/p\u003e\n\u003cp\u003eI watched the three passengers wait while the driver came around to open the popped trunk. He handed out two exotic-skinned wooden briefcases, presenting the black one to Sheena, the brown to Ted.\u003c/p\u003e\n\u003cp\u003eThe stranger with the bad-and-the-ugly eyes was shorter than my ex-colleagues, maybe five-eight, like me. Despite his dark mustache and beard stubble, I guessed his age at sixty or so. His suit and shirt may have been expensive, but both seemed wilted by the intemperate intensity of his expression and stance. His business was not being telegenic. I sensed his business was about not being seen at all.\u003c/p\u003e\n\u003cp\u003eMy fingertips felt cold on the cell phone now that he’d been captured inside it. The driver was already ushering him back into the rear seat, sweat beading in a salty dew line under his cap band as he came around to drive the boss away.\u003c/p\u003e\n\u003cp\u003eUndead Ted blinked in the sunlight when the driver’s door slammed shut.\u003c/p\u003e\n\u003cp\u003eThe big black modern luxury car glided away, a shadow of Dolly’s timeless power and grace. Ted and Sheena turned and marched for the main entrance, suddenly swinging their overstated briefcases and grinning at each other.\u003c/p\u003e\n\u003cp\u003eOkay. I took my foot off Dolly’s brake and I backed her out until we were clear of the van, which took several seconds. Then I wrenched her steering wheel left and spurted forward with an engine thrust no one could ignore.\u003c/p\u003e\n\u003cp\u003eI braked in front of the briefcase buddies with a deliberate squeal.\u003c/p\u003e\n\u003cp\u003eThey’d turned to regard my car with dropped jaws as I lowered the passenger side window.\u003c/p\u003e\n\u003cp\u003e“Delilah … ?” Undead Ted began, his face turning pale saffron.\u003c/p\u003e\n\u003cp\u003eSheena strutted toward Dolly.\u003c/p\u003e\n\u003cp\u003e“Delilah Street and her Cadillac clunker, my, my. I thought you’d hitched a ride out of town on a Kansas twister.”\u003c/p\u003e\n\u003cp\u003e“No. That teensy little tornado missed me. Don’t you two look sharp. Must have had a lunch date with the new management. Care to share the contents of those briefcases with a fellow reporter?”\u003c/p\u003e\n\u003cp\u003e“It’s … it’s nothing,” Undead Ted spilled. Of course it was something, something they didn’t want anyone to know about.\u003c/p\u003e\n\u003cp\u003eSheena keyed his shin with her spike heel.\u003c/p\u003e\n\u003cp\u003e“Looks like payday to me,” I said, watching Ted writhe in intimidated silence. What a wimp.\u003c/p\u003e\n\u003cp\u003eSheena was advancing as if she was about to do the same damage to Dolly’s shiny black side.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” I called, waving my hand. “Lucky for you I’m just visiting.”\u003c/p\u003e\n\u003cp\u003eI accelerated before Sheena’s foot could connect with anything but air.\u003c/p\u003e\n\u003cp\u003eUnfortunately, air is all around us and Sheena was a weather witch.\u003c/p\u003e\n\u003cp\u003eI hit the power button to lower the top, but that took mucho seconds. They had more time to waste in the fifties and less nimble technology. Dolly accelerated while I punched the side window button closed.\u003c/p\u003e\n\u003cp\u003eThe shadow creeping over me was not just the descending top, but a nasty black cloud the size of a railroad car. My rearview mirror told me raindrops were falling on Dolly’s trunk. We sped down the endlessly curving drive. Hailstones were moments behind.\u003c/p\u003e\n\u003cp\u003eI needed to hit the main street faster. I could hear the brittle pings on the driveway behind me. At a crosswalk near the parking lot’s other end I roared Dolly onto the broad intersecting sidewalk and then cross-country on WTCH-TVs expansive green lawn, under a landscaped grove of maple trees, over the street curb—ouch on the springs!—down a few blocks, and under a gas station canopy.\u003c/p\u003e\n\u003cp\u003e“Cool wheels, lady,” exclaimed the teenaged male store clerk who’d rushed out to ogle Dolly. He cocked an ear at the hail ping-ponging off the metal canopy above us. “That rainstorm came up quick.”\u003c/p\u003e\n\u003cp\u003e“Easy come, easy go,” I said. Sheena wouldn’t want any inexplicable weather phenomena reported too close to WTCH. “I don’t need fuel, although this is a thirsty big girl.”\u003c/p\u003e\n\u003cp\u003e“What year?” he asked, following me as I circled Dolly looking for damage, as puppy-doggish as Undead Ted was these days. “Maybe fifty-eight, sixty? Biarritz! I heard Cary Grant owned one of these.”\u003c/p\u003e\n\u003cp\u003eI stopped cold. “You know who Cary Grant was?”\u003c/p\u003e\n\u003cp\u003e“Sure. He was a movie star back in the last century. They owned a lot of cool cars. Can I look under the hood?”\u003c/p\u003e\n\u003cp\u003eWouldn’t you know Dolly would get a proposition in Wichita and I wouldn’t?\u003c/p\u003e\n\u003cp\u003e“Sorry. I’ve got to get going. But you can polish her tail fins and trunk before we leave. Don’t want any dust spots on that finish.”\u003c/p\u003e\n\u003cp\u003e“Gollee, no.”\u003c/p\u003e\n\u003cp\u003eI provided a flannel cloth from the glove compartment and he went to work.\u003c/p\u003e\n\u003cp\u003eYou were really thumbing your nose at fate back there, Irma noted as I finally pulled back onto the main drag under a clear sky. You should have had the kid check Dolly’s shocks.\u003c/p\u003e\n\u003cp\u003eI ignored her until she went away.\u003c/p\u003e\n\u003cp\u003eTHE DAY WAS still young and the boys and I hadn’t planned to meet back at Tallgrass’s place until much later. I suspected some beer-accompanied reminiscences of mutual FBI days would occupy them after the pasture inspection.\u003c/p\u003e\n\u003cp\u003eBefore my visit to Wichita delved too far into my uneasy past, I decided to do some less scary snooping on my own behalf. Dolly seemed inclined to cruise the familiar neighborhood past the station, so we veered together to the site of my rented bungalow, which a mighty specific tornado had torn off its foundation.\u003c/p\u003e\n\u003cp\u003eWhat a jolt to see a half-completed house already going up on the site. I’d liked my life and my little house and dog and doing a paranormal reporting TV job I thought was important, informing people about their brave newly supernatural world. …\u003c/p\u003e\n\u003cp\u003eConstruction was idled today, but I spotted the back of a big sign on the lot. I drove past and craned my neck. Habitat for Humanity, it read. I couldn’t help smiling. Somebody did me wrong, and now somebody was doing someone who needed it right. Of course, even nowadays I supposed the houses must be available to all “minorities.” I doubted we’d ever see the name changed to Habitat for Unhumanity, though.\u003c/p\u003e\n\u003cp\u003eStill smiling, I decided to wheel out to Sunset City and look for Lili West’s extended-life address. I’d been a reporter, right? Maybe it was high time to “report” my own backyard. \u003c/p\u003e","sourceLink":"https://allnovel.net/silver-zombie-delilah-street-4/page-11.html","bookId":2116,"creation":"Oct 5, 2019 5:57:48 PM","modification":"Oct 5, 2019 5:57:48 PM"}
