{"id":92724,"no":30,"title":"Page 30","content":"\u003cp\u003eA PERFECTLY SOUND Ben Hassard awaited us in the penthouse suite entry hall, although he wore a roomy Asian robe over his trousers.\u003c/p\u003e\n\u003cp\u003e“I’m so relieved that you and the dog made it past those vicious criminals, Miss Street,” Hassard said. “Who’s this guy?”\u003c/p\u003e\n\u003cp\u003e“No one to worry about at all,” said Professor Marvel, sketching a bow. “I must leave now. I’m expected in a storm cellar. Or was it a storm?”\u003c/p\u003e\n\u003cp\u003eThe doors automatically closed on him. The future Wizard of Oz was running out on me, just as he had on Dorothy, at the end.\u003c/p\u003e\n\u003cp\u003e“Another CinSim,” Ben, er, marveled. “I must say they do put on a show, popping up here and there. Glad you look hale and hearty. Tallgrass and the other FBI man and Mr. Christopher are conferring in the screening room.”\u003c/p\u003e\n\u003cp\u003e“Screening room? What are they doing there?”\u003c/p\u003e\n\u003cp\u003eAfter my impulsive exit, I’d expected a warmer welcome back.\u003c/p\u003e\n\u003cp\u003eI followed Quicksilver into the main room and saw the storm churning like the contents of a giant blender outside the glass doors to the balcony. It sounded as loud up here too.\u003c/p\u003e\n\u003cp\u003eBen Hassard followed, apologizing. “There’s something wrong about the film I sold Mr. Christopher. I’m afraid it’s the source of all my troubles. That demonic mobster wants something on it. Perhaps some hidden material that’s incriminating.”\u003c/p\u003e\n\u003cp\u003eI had no time to disabuse Hassard of his relatively safe and normal worldview as I headed for the home theater, opening the double doors so all three could enter at once, Hassard, Quicksilver, and I.\u003c/p\u003e\n\u003cp\u003eThe movie was unreeling, but standing silhouettes obscured most of the screen.\u003c/p\u003e\n\u003cp\u003e“So I get it’s a priceless piece of film history,” Ric was arguing. “Am I supposed to believe you just wanted it as a collector? A little something the Mexican drug cartels were so hot to have they’d torture and kill for it?”\u003c/p\u003e\n\u003cp\u003eSnow’s powerful stage voice sounded weary, as if Ric had been grilling him for a long time.\u003c/p\u003e\n\u003cp\u003e“I’ve told you, Montoya. I’m planning to model the centerpiece of my billion-dollar Inferno Hotel and Casino expansion on the look of this film. It cost almost three million dollars to produce in 1927, a phenomenal amount for the time, and I plan to reproduce the sets in reality at a phenomenal amount for our time. The film is a guide, but also the crown jewel of my new multientertainment facility. I have no idea why an international thug like Torbellino would want a cultural icon such as Metropolis.”\u003c/p\u003e\n\u003cp\u003eI could hear Ric’s exasperated sigh from the doorway as he turned back to view the silent film. “There must be something in the film that will make El Demonio richer and more powerful. Nothing else motivates him.” I saw his profile turn toward Snow’s. “Or Vegas moguls like you.”\u003c/p\u003e\n\u003cp\u003eSnow’s silhouetted shoulders shrugged. I recognized the lines of his jacket, but wondered if Ric had seen his albino throat bearing the telltale bruise—in his case—of an angrily returned paranormal kiss.\u003c/p\u003e\n\u003cp\u003eOh, gosh. Did lips leave recognizable prints too? I’d left enough Midnight Cherry Shimmer on Ric during this trip for him to recognize the pattern, if so.\u003c/p\u003e\n\u003cp\u003eTallgrass was sitting in one of the aisle seats actually watching the film, so Quicksilver trotted down the shallow stairs to sit beside him.\u003c/p\u003e\n\u003cp\u003eRic turned back in a flash. “Delilah? You’re safe and back.”\u003c/p\u003e\n\u003cp\u003eHe strode to the doors to embrace me. “We saw the lightning fizzle out, so I figured you and Quick were all right even though we couldn’t reach your cell phone. The WTCH tower is down?”\u003c/p\u003e\n\u003cp\u003e“Still standing but shorted out. Dead. The tornado the broken coven summoned is still threatening Emerald City and so is the Wendigo. And Tallgrass, you might want to look into Lili West at the local Sunset City, when this is all done. I think she’s the head weather witch around here.”\u003c/p\u003e\n\u003cp\u003eRic laughed and pulled me closer as Tallgrass looked on, shocked.\u003c/p\u003e\n\u003cp\u003e“You did some A-one detecting on your solo day in town, Del. And El Demonio and his men in the lobby? How’d you get past them?”\u003c/p\u003e\n\u003cp\u003e“By being born Black Irish and passing for a CinSim. They’re not too tuned into the vintage motion-picture world. They mistook Quick and me for Dorothy and Toto, who are still running loose down there.”\u003c/p\u003e\n\u003cp\u003eSnow’s brief bark of laughter startled us.\u003c/p\u003e\n\u003cp\u003e“What’s funny about Delilah being trapped between a supernatural storm and a horde of zombies, Christophe?” Ric demanded.\u003c/p\u003e\n\u003cp\u003e“This ‘Demon’ of yours, like all brutal and greedy humans, is also stupid. What would he do with a piece of rare film like Metropolis? He’d be too ignorant to even exploit its characters as CinSims, and the only truly valuable one, the only commercially sexy one, so to speak, is the woman-made-robot.”\u003c/p\u003e\n\u003cp\u003eI resented Snow making light of the monster who’d controlled Ric’s childhood. I had to say something.\u003c/p\u003e\n\u003cp\u003e“El Demonio lives to torture and kill, with drugs and drug money and with his own hand. I think you can imagine what more than three hundred strokes of his bullwhip would feel like.”\u003c/p\u003e\n\u003cp\u003e“Ah.” Snow left the shadows to come and face me. “You make that experience so very vivid, Miss Street. Thanks for educating me.”\u003c/p\u003e\n\u003cp\u003eSunglasses don’t offer much eye contact, so I stared at his throat. A white silk aviator scarf, like those he gave away at the end of his rock concerts, concealed the place my mouth had bruised.\u003c/p\u003e\n\u003cp\u003eOh, this was awkward.\u003c/p\u003e\n\u003cp\u003eThat’s what you get for confusing sex with revenge, Irma twitted me. You owe him again. That look is so dashing young Howard Hughes on him, don’t you think?\u003c/p\u003e\n\u003cp\u003eShe couldn’t have repulsed me more, which got my brain in gear.\u003c/p\u003e\n\u003cp\u003e“Snow’s right, though,” I said, walking past him and Ric to face the movie screen. “I can see that Torbellino would like the same things the Nazis did about this film. The jerky, robotlike workers slaving away belowground like zombies twelve hours a day. The masters lording it in their gleaming towers like Vegas moguls. It’s El Demonio’s hidden zombie empire, in a way.”\u003c/p\u003e\n\u003cp\u003e“He didn’t covet this film for sentimental reasons, Miss Street,” Snow said. “It isn’t as if he’d need an Oscar award for Best Exploitation of Humankind he could display on a shelf.”\u003c/p\u003e\n\u003cp\u003eOscar. Hollywood’s prized golden statuette.\u003c/p\u003e\n\u003cp\u003eThe movie screen even now was revealing the passionate young girl and worker’s salvation, Maria, being “processed” by the masters into a gleaming, unemotional robot, the triumph of scientific method over humanity, losing her life and her heroic young lover. Speaking of which …\u003c/p\u003e\n\u003cp\u003e“Ric.”\u003c/p\u003e\n\u003cp\u003e“Here, Delilah.” He stepped to my side. “What is it?”\u003c/p\u003e\n\u003cp\u003e“Did … you turn the elevator cables silver so the zombies couldn’t climb them inside the Emerald City towers?”\u003c/p\u003e\n\u003cp\u003e“Silver has much mojo,” Tallgrass said, his voice definitive in the darkness as the unwinding film flickered over all our faces. “Dog has silver on his collar. Delilah Street wears silver. Mi amigo has been reborn with the Silver Eye.”\u003c/p\u003e\n\u003cp\u003e“I think silver controls zombies,” Ric said. “At least it seems to since I’ve acquired the vision.”\u003c/p\u003e\n\u003cp\u003e“Silver killed vampires in the old lore, as well as were-wolves,” Snow mused, as if contributing to the campfire ghost stories.\u003c/p\u003e\n\u003cp\u003eI was feeling as weary as he sounded. “And black-and-white film used enough silver nitrate that many classic movies were destroyed to strip the silver from them. Is there any way El Demonio could—”\u003c/p\u003e\n\u003cp\u003eI noticed, in the meantime, that Ric had begun moving slowly down the shallow stairs toward the movie screen, as if in a trance.\u003c/p\u003e\n\u003cp\u003e“This is one of the most luminous films I’ve ever seen,” he said. “No wonder no complete versions could be found. They would have yielded too much silver to save. And the robot, she’s a moon goddess for a technological age. Look at her. She’s all silver, an armored Joan of Arc. Think of the concentrated aura her image would have on the black film strip. She’d be blinding. An angel of light.”\u003c/p\u003e\n\u003cp\u003eHe walked right up to the screen as if hypnotized, or hypnotizing.\u003c/p\u003e\n\u003cp\u003eAnd the silver robot moved to meet him where pixel or plasma met flesh and blood. Ric reached out a hand and a robotic arm lifted to touch a silver gauntlet to his fingers.\u003c/p\u003e\n\u003cp\u003eThe theme of the film was what Lilah West had said about work and art and passion: “The heart lies between the hand and the head.”\u003c/p\u003e\n\u003cp\u003eRic’s hand guided the silver robot as if leading her in a gavotte as she stepped out of the film and into the room, jerkily glancing around like Frankenstein’s suddenly alive bride. Life-size, like a real girl.\u003c/p\u003e\n\u003cp\u003eWe all watched, stricken to stone by Silver Screen lightning.\u003c/p\u003e\n\u003cp\u003eI knew Ric had found and raised zombies since he was a toddler.\u003c/p\u003e\n\u003cp\u003eNow he’d raised the first CinSim never touched by the Immortality Mob, or bonded to any imported human corpse. One only and wholly itself. Herself. The Eve of zombies. The Silver Zombie supreme. The supernaturally scientific creature El Demonio must have wanted to conjure himself, that he could somehow use to raise and control and master a worldwide zombie empire.\u003c/p\u003e\n\u003cp\u003e“Master?” she said in a flat, dead tone viewers of the silent film had never heard.\u003c/p\u003e\n\u003cp\u003eTo Ric.\u003c/p\u003e\n\u003cp\u003eOooh, Irma bemoaned in my ear. We have got one hot little Roomba robot vacuum cleaner on our hands. Master? I wonder if she does dudes. Kiss your romantic aspirations good-bye. \u003c/p\u003e","sourceLink":"https://allnovel.net/silver-zombie-delilah-street-4/page-30.html","bookId":2116,"creation":"Oct 5, 2019 5:57:48 PM","modification":"Oct 5, 2019 5:57:48 PM"}
