{"id":7073,"no":24,"title":"The Twelfth Tuesday We Talk About Forgiveness","content":"\u003cp\u003e\"Forgive yourself before you die. Then forgive others.\"\u003c/p\u003e \n\u003cp\u003eThis was a few days after the \"Nightline\" interview. The sky was rainy and dark, and Morrie was beneath a blanket. I sat at the far end of his chair, holding his bare feet. They were callused and curled, and his toenails were yellow. I had a small jar of lotion, and I squeezed some into my hands and began to massage his ankles.\u003c/p\u003e \n\u003cp\u003eIt was another of the things I had watched his helpers do for months, and now, in an attempt to hold on to what I could of him, I had volunteered to do it myself. The disease had left Morrie without the ability even to wiggle his toes, yet he could still feel pain, and massages helped relieve it. Also, of course, Morrie liked being held and touched. And at this point, anything I could do to make him happy, I was going to do.\u003c/p\u003e \n\u003cp\u003e\"Mitch,\" he said, returning to the subject of forgiveness. \"There is no point in keeping vengeance or stubbornness. These things\"-he sighed-\"these things I so regret in my life. Pride. Vanity. Why do we do the things we do?\"\u003c/p\u003e \n\u003cp\u003eThe importance of forgiving was my question. I had seen those movies where the patriarch of the family is on his death bed and he calls for his estranged son so that he can make peace before he goes. I wondered if Morrie had any of that inside him, a sudden need to say \"I\u0027m sorry\" before he died?\u003c/p\u003e \n\u003cp\u003eMorrie nodded. \"Do you see that sculpture?\" He tilted his head toward a bust that sat high on a shelf against the far wall of his office. I had never really noticed it before. Cast in bronze, it was the face of a man in his early forties, wearing a necktie, a tuft of hair falling across his forehead.\u003c/p\u003e \n\u003cp\u003e\"That\u0027s me,\" Morrie said. \"A friend of mine sculpted that maybe thirty years ago. His name was Norman. We used to spend so much time together. We went swimming. We took rides to New York. He had me over to his house in Cambridge, and he sculpted that bust of me down in his basement. It took several weeks to do it, but he really wanted to get it right.\"\u003c/p\u003e \n\u003cp\u003eI studied the face. How strange to see a three-dimensional Morrie, so healthy, so young, watching over us as we spoke. Even in bronze, he had a whimsical look, and I thought this friend had sculpted a little spirit as well.\u003c/p\u003e \n\u003cp\u003e\"Well, here\u0027s the sad part of the story,\" Morrie said. \"Norman and his wife moved away to Chicago. A little while later, my wife, Charlotte, had to have a pretty serious operation. Norman and his wife never got in touch with us. I know they knew about it. Charlotte and I were very hurt because they never called to see how she was. So we dropped the relationship.\u003c/p\u003e \n\u003cp\u003e\"Over the years, I met Norman a few times and he always tried to reconcile, but I didn\u0027t accept it. I wasn\u0027t satisfied with his explanation. I was prideful. I shrugged him off. \"\u003c/p\u003e \n\u003cp\u003eHis voice choked.\u003c/p\u003e \n\u003cp\u003e\"Mitch . . . a few years ago . . . he died of cancer. I feel so sad. I never got to see him. I never got to forgive. It pains me now so much . . .\"\u003c/p\u003e \n\u003cp\u003eHe was crying again, a soft and quiet cry, and because his head was back, the tears rolled off the side of his face before they reached his lips.\u003c/p\u003e \n\u003cp\u003eSorry, I said.\u003c/p\u003e \n\u003cp\u003e\"Don\u0027t be,\" he whispered. \"Tears are okay.\"\u003c/p\u003e \n\u003cp\u003eI continued rubbing lotion into his lifeless toes. He wept for a few minutes, alone with his memories.\u003c/p\u003e  \n\u003cp\u003eOurselves?\u003c/p\u003e \n\u003cp\u003e\"Yes. For all the things we didn\u0027t do. All the things we should have done. You can\u0027t get stuck on the regrets of what should have happened. That doesn\u0027t help you when you get to where I am.\u003c/p\u003e \n\u003cp\u003e\"I always wished I had done more with my work; I wished I had written more books. I used to beat myself up over it. Now I see that never did any good. Make peace. You need to make peace with yourself and everyone around you.\"\u003c/p\u003e \n\u003cp\u003eI leaned over and dabbed at the tears with a tissue. Morrie flicked his eyes open and closed. His breathing was audible, like a light snore.\u003c/p\u003e \n\u003cp\u003e\"Forgive yourself. Forgive others. Don\u0027t wait, Mitch. Not everyone gets the time I\u0027m getting. Not everyone is as lucky.\"\u003c/p\u003e \n\u003cp\u003eI tossed the tissue into the wastebasket and returned to his feet. Lucky? I pressed my thumb into his hardened flesh and he didn\u0027t even feel it.\u003c/p\u003e \n\u003cp\u003e\"The tension of opposites, Mitch. Remember that? Things pulling in different directions?\"\u003c/p\u003e \n\u003cp\u003eI remember.\u003c/p\u003e \n\u003cp\u003e\"I mourn my dwindling time, but I cherish the chance it gives me to make things right.\"\u003c/p\u003e \n\u003cp\u003eWe sat there for a while, quietly, as the rain splattered against the windows. The hibiscus plant behind his head was still holding on, small but firm.\u003c/p\u003e \n\u003cp\u003e\"Mitch,\" Morrie whispered.\u003c/p\u003e \n\u003cp\u003eUh-huh?\u003c/p\u003e \n\u003cp\u003eI rolled his toes between my fingers, lost in the task.\u003c/p\u003e \n\u003cp\u003e\"Look at me.\"\u003c/p\u003e \n\u003cp\u003eI glanced up and saw the most intense look in his eyes.\u003c/p\u003e \n\u003cp\u003e\"I don\u0027t know why you came back to me. But I want to say this . . .\u003c/p\u003e \n\u003cp\u003eHe paused, and his voice choked.\u003c/p\u003e \n\u003cp\u003e\"If I could have had another son, I would have liked it to be you.\"\u003c/p\u003e \n\u003cp\u003eI dropped my eyes, kneading the dying flesh of his feet between my fingers. For a moment, I felt afraid, as if accepting his words would somehow betray my own father. But when I looked up, I saw Morrie smiling through tears and I knew there was no betrayal in a moment like this.\u003c/p\u003e \n\u003cp\u003eAll I was afraid of was saying good-bye.\u003c/p\u003e  \n\u003cp\u003eWhere is that?\u003c/p\u003e \n\u003cp\u003e\"Not far from here. On a hill, beneath a tree, overlooking a pond. Very serene. A good place to think.\"\u003c/p\u003e \n\u003cp\u003eAre you planning on thinking there?\u003c/p\u003e \n\u003cp\u003e\"I\u0027m planning on being dead there.\"\u003c/p\u003e \n\u003cp\u003eHe chuckles. I chuckle.\u003c/p\u003e \n\u003cp\u003e\"Will you visit?\" Visit?\u003c/p\u003e \n\u003cp\u003e`Just come and talk. Make it a Tuesday. You always come on Tuesdays. \"\u003c/p\u003e \n\u003cp\u003eWe\u0027re Tuesday people.\u003c/p\u003e \n\u003cp\u003e\"Right. Tuesday people. Come to talk, then?\"\u003c/p\u003e \n\u003cp\u003eHe has grown so weak so fast.\u003c/p\u003e \n\u003cp\u003e\"Look at me,\" he says.\u003c/p\u003e \n\u003cp\u003eI\u0027m looking.\u003c/p\u003e \n\u003cp\u003e\"You\u0027ll come to my grave? To tell me your problems?\"\u003c/p\u003e \n\u003cp\u003eMy problems?\u003c/p\u003e \n\u003cp\u003e\"Yes.\u0027\u003c/p\u003e \n\u003cp\u003eAnd you\u0027ll give me answers?\u003c/p\u003e \n\u003cp\u003e\"I\u0027ll give you what I can. Don\u0027t I always?\"\u003c/p\u003e \n\u003cp\u003eI picture his grave, on the hill, overlooking the pond, some little nine foot piece of earth where they will place him, cover him with dirt, put a stone on top. Maybe in a few weeks? Maybe in a few days? I see mysef sitting there alone, arms across my knees, staring into space.\u003c/p\u003e \n\u003cp\u003eIt won\u0027t be the same, I say, not being able to hear you talk.\u003c/p\u003e \n\u003cp\u003e\"Ah, talk . . . \"\u003c/p\u003e \n\u003cp\u003eHe closes his eyes and smiles.\u003c/p\u003e \n\u003cp\u003e\"Tell you what. After I\u0027m dead, you talk. And I\u0027ll listen.\"\u003c/p\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/260/2475.html","bookId":229,"creation":"Aug 1, 2019 7:24:47 AM","modification":"Aug 1, 2019 7:24:47 AM"}
