{"id":79071,"no":10,"title":"Page 10","content":"\u003cp\u003eAfter I let myself into the house, I went straight up to her room.\u003c/p\u003e\n\u003cp\u003eTaylor was lying on her stomach, flipping through gossip magazines. As soon as she saw me, she sat up and said, “Are you a masochist, or what?”\u003c/p\u003e\n\u003cp\u003eI threw my duffel bag on the floor and sat down next to her. I’d called her on the way over; I’d told her everything. I hadn’t wanted to, but I’d done it.\u003c/p\u003e\n\u003cp\u003e“Why are you going off looking for him?” she demanded. “He’s not your boyfriend anymore.”\u003c/p\u003e\n\u003cp\u003eI sighed. “Like he ever really was.”\u003c/p\u003e\n\u003cp\u003e“My point exactly.” She thumbed through a magazine and handed it to me. “Check it out. I could see you in this bikini. The white bandeau one. It’ll look hot with your tan.”\u003c/p\u003e\n\u003cp\u003e“Jeremiah’s going to be here soon,” I said, looking at the magazine and handing it back to her. I couldn’t picture me in that bikini. But I could picture her in it.\u003c/p\u003e\n\u003cp\u003e“You so should have picked Jeremy,” she said. “Conrad is basically a crazy person.”\u003c/p\u003e\n\u003cp\u003eI’d told her and told her how it wasn’t as easy as picking one or the other. Nothing ever was. It wasn’t as though I’d even had a choice, not really.\u003c/p\u003e\n\u003cp\u003e“Conrad’s not crazy, Taylor.” She’d never forgiven Conrad for not liking her the summer I brought her to Cousins, the summer we were fourteen. Taylor was used to all the boys liking her, she was unaccustomed to being ignored. Which was exactly what Conrad had done. Not Jeremiah, though. As soon as she batted her big brown eyes at him, he was hers. Her Jeremy , that’s what she’d called him—in that teasing kind of way, the kind that boys love. Jeremiah lapped it right up, too, until she ditched him for my brother, Steven.\u003c/p\u003e\n\u003cp\u003ePursing her lips, Taylor said, “Fine, maybe that was a little harsh. Maybe he’s not crazy. But, like, what? Are you always just going to be sitting around waiting for him? Whenever he wants?”\u003c/p\u003e\n\u003cp\u003e“No! But he’s in some kind of trouble. He needs his friends now more than ever,” I said, picking at a loose strand on the carpet. “No matter what happened between us, we’ll always be friends.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “Whatever. The only reason I’m even signing off on this is for you to get closure.”\u003c/p\u003e\n\u003cp\u003e“Closure?”\u003c/p\u003e\n\u003cp\u003e“Yes. I can see now that it’s the only way. You need to see Conrad face-to-face and tell him you’re over him and you’re not gonna play his games anymore. Then and only then can you move on from his lame ass.”\u003c/p\u003e\n\u003cp\u003e“Taylor, I’m not innocent in all this either.” I swallowed. “The last time I saw him, I was awful.”\u003c/p\u003e\n\u003cp\u003e“Whatever. The point is, you need to move on. On to greener pastures.” She eyed me. “Like Cory. Who, by the way, I doubt you even have a chance with anymore after last night.”\u003c/p\u003e\n\u003cp\u003eLast night seemed like a thousand years ago. I did my best to look contrite and said, “Hey, thanks again for letting me leave my car here. If my mom calls—”\u003c/p\u003e\n\u003cp\u003e“Please, Belly. Show a little respect. I’m the queen of lying to parents, unlike you.” She sniffed. “You’re gonna be back in time for tomorrow night, right? We’re all gonna go out on Davis’s parents’ boat, remember? You promised.”\u003c/p\u003e\n\u003cp\u003e“That’s not until eight or nine. I’m sure I’ll be back by then. Besides,” I pointed out, “I never promised you anything.”\u003c/p\u003e\n\u003cp\u003e“Then promise now,” she commanded. “Promise you’ll be here.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “Why do you want me back here so bad? So you can sic Cory Wheeler on me again? You don’t need me. You have Davis.”\u003c/p\u003e\n\u003cp\u003e“I do so need you, even if you are a terrible best friend. Boyfriends aren’t the same as best friends and you know it. Pretty soon we’ll be in college, you know. What if we go to different schools? What then?” Taylor glared at me, her eyes accusing.\u003c/p\u003e\n\u003cp\u003e“Okay, okay. I promise.” Taylor still had her heart set on us going to the same school, the way we’d always said we would.\u003c/p\u003e\n\u003cp\u003eShe held out her hand to me and we hooked pinkies.\u003c/p\u003e\n\u003cp\u003e“Is that what you’re wearing?” Taylor asked me suddenly.\u003c/p\u003e\n\u003cp\u003eLooking down at my gray camisole, I said, “Well, yeah.”\u003c/p\u003e\n\u003cp\u003eShe shook her head so fast her blond hair swished all around. “Is that what you’re wearing to see Conrad for the first time ?”\u003c/p\u003e\n\u003cp\u003e“This isn’t a date I’m going on, Taylor.”\u003c/p\u003e\n\u003cp\u003e“When you see an ex, you have to look better than you’ve ever looked. It’s, like, the first rule of breakups. You have to make him think, ‘Damn, I missed out on that ?’ It’s the only way.”\u003c/p\u003e\n\u003cp\u003eI hadn’t thought of that. “I don’t care what he thinks,” I told her.\u003c/p\u003e\n\u003cp\u003eShe was already rifling through my overnight bag. “All you have in here is underwear and a T-shirt. And this old tank top. Ugh. I hate this tank top. It needs to be officially retired.”\u003c/p\u003e\n\u003cp\u003e“Quit it,” I said. “Don’t go through my stuff.”\u003c/p\u003e\n\u003cp\u003eTaylor leaped up, her face all glowy and excited. “Oh, please let me pack for you, Belly! Please, it would make me so happy.”\u003c/p\u003e\n\u003cp\u003e“No,” I said, as firmly as I could. With Taylor, you had to be firm. “I’ll probably be back tomorrow. I don’t need anything else.”\u003c/p\u003e\n\u003cp\u003eTaylor ignored me and disappeared into her walk-in closet.\u003c/p\u003e\n\u003cp\u003eMy phone rang then, and it was Jeremiah. Before I answered it, I said, “I’m serious, Tay.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry, I’ve got it all covered. Just think of me as your fairy godmother,” she said from inside the closet.\u003c/p\u003e\n\u003cp\u003eI popped open my phone. “Hey,” I said. “Where are you?”\u003c/p\u003e\n\u003cp\u003e“I’m pretty close. About an hour away. Are you at Taylor’s?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I said. “Do you need me to give you the directions again?”\u003c/p\u003e\n\u003cp\u003e“No, I’ve got it.” He paused, and for a second I thought he’d already hung up. Then he said, “Thanks for doing this.”\u003c/p\u003e\n\u003cp\u003e“Come on,” I said.\u003c/p\u003e\n\u003cp\u003eI thought about saying something else, like how he was one of my best friends and how part of me was almost glad to have a reason to see him again. It just wouldn’t be summer without Beck’s boys.\u003c/p\u003e\n\u003cp\u003eBut I couldn’t get the words to sound right in my head, and before I could figure them out, he hung up.\u003c/p\u003e\n\u003cp\u003eWhen Taylor finally emerged from the closet, she was zipping up my bag. “All set,” she said, dimpling.\u003c/p\u003e\n\u003cp\u003e“Taylor—” I tried to grab the bag from her. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-10.html","bookId":2724,"creation":"Oct 5, 2019 4:14:01 PM","modification":"Oct 5, 2019 4:14:01 PM"}
