{"id":79078,"no":17,"title":"Page 17","content":"\u003cp\u003eWhen I got home the afternoon after prom, Conrad’s car was in the driveway, which was weird. I’d thought he was staying at Laurel’s house and then going straight back to school. I stopped by his room, but he was asleep, and pretty soon after, I passed out too.\u003c/p\u003e\n\u003cp\u003eThat night we ordered Chinese food that Mom said she was in the mood for, but when it came, she didn’t eat any.\u003c/p\u003e\n\u003cp\u003eWe ate in the TV room, on the couch, something we never did before she got sick. “So?” she asked, looking at Conrad all eagerly. It was the most energetic I’d seen her all day.\u003c/p\u003e\n\u003cp\u003eHe was shoving a spring roll down his throat, like he was in some big hurry. And he’d brought all this laundry home with him, like he expected Mom to do it. “So what?” he asked.\u003c/p\u003e\n\u003cp\u003e“So you made me wait all day to hear about the prom! I want to know everything!”\u003c/p\u003e\n\u003cp\u003e“‘Oh, that,’” he said. He had this embarrassed look on his face, and I knew he didn’t want to talk about it. I was sure he’d done something to screw it up.\u003c/p\u003e\n\u003cp\u003e“‘Oh, that,’” my mom teased. “Come on, Connie, give me some details. How did she look in her dress? Did you dance? I want to hear everything. I’m still waiting on Laurel to email me the pictures.”\u003c/p\u003e\n\u003cp\u003e“It was okay,” Conrad said.\u003c/p\u003e\n\u003cp\u003e“That’s it?” I said. I was annoyed with him that night, with everything about him. He’d gotten to take Belly to her prom and he acted like it was some big chore. If it had been me, I would have done it right.\u003c/p\u003e\n\u003cp\u003eConrad ignored me. “She looked really pretty. She wore a purple dress.”\u003c/p\u003e\n\u003cp\u003eMy mom nodded, smiling. “I know exactly the one. How’d the corsage look?”\u003c/p\u003e\n\u003cp\u003eHe shifted in his seat. “It looked nice.”\u003c/p\u003e\n\u003cp\u003e“Did you end up getting the kind you pin on or the kind you wear on your wrist?”\u003c/p\u003e\n\u003cp\u003e“The kind you pin on,” he said.\u003c/p\u003e\n\u003cp\u003e“And did you dance?”\u003c/p\u003e\n\u003cp\u003e“Yeah, a lot,” he said. “We danced, like, every song.”\u003c/p\u003e\n\u003cp\u003e“What was the theme?”\u003c/p\u003e\n\u003cp\u003e“I don’t remember,” Conrad said, and when my mother looked disappointed he added, “I think it was A Night on the Continent. It was, like, a tour of Europe. They had a big Eiffel Tower with Christmas tree lights on it, and a London Bridge you could walk across. And a Leaning Tower of Pisa.”\u003c/p\u003e\n\u003cp\u003eI looked over at him. A Night on the Continent was our school’s prom theme last year; I know because I was there.\u003c/p\u003e\n\u003cp\u003eBut I guess my mother didn’t remember, because she said, “Oh, that sounds so nice. I wish I could’ve been at Laurel’s house to help Belly get ready. I’m gonna call Laure tonight and bug her to send me those pictures. When do you think you’ll get the professional pictures back? I want to get them framed.”\u003c/p\u003e\n\u003cp\u003e“I’m not sure,” he said.\u003c/p\u003e\n\u003cp\u003e“Ask Belly, will you?” She set her plate down on the coffee table and leaned back against the couch cushions. She looked exhausted all of a sudden.\u003c/p\u003e\n\u003cp\u003e“I will,” he said.\u003c/p\u003e\n\u003cp\u003e“I think I’m going to bed now,” she said. “Jere, will you get all this cleaned up?”\u003c/p\u003e\n\u003cp\u003e“Sure, Mom,” I said, helping her to her feet.\u003c/p\u003e\n\u003cp\u003eShe kissed us both on the cheek and went to her bedroom. We’d moved the study upstairs and put her bedroom downstairs so she didn’t have to go up and down the stairs.\u003c/p\u003e\n\u003cp\u003eWhen she was gone, I said, sarcastically, “So you guys danced all night, huh?”\u003c/p\u003e\n\u003cp\u003e“Just leave it,” Conrad said, leaning his head back against the couch.\u003c/p\u003e\n\u003cp\u003e“Did you even go to the prom? Or did you lie to Mom about that, too?”\u003c/p\u003e\n\u003cp\u003eHe glared at me. “Yeah, I went.”\u003c/p\u003e\n\u003cp\u003e“Well, somehow I doubt you guys danced all night,” I said. I felt like a jerk but I just couldn’t let it go.\u003c/p\u003e\n\u003cp\u003e“Why do you have to be such a dick? What do you care about the prom?”\u003c/p\u003e\n\u003cp\u003eI shrugged. “I just hope you didn’t ruin it for her. What are you even doing here, anyway?”\u003c/p\u003e\n\u003cp\u003eI expected him to get pissed, in fact I think I hoped he would. But all he said was, “We can’t all be Mr. Prom King.” He started closing the takeout boxes. “Are you done eating?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m done,” I said.\u003c/p\u003e\n\u003cp\u003eChapter fourteen\u003c/p\u003e\n\u003cp\u003eWhen we drove up to campus, there were people milling around outside on the lawn. Girls were laying out in shorts and bikini tops, and a group of boys were playing Ultimate Frisbee. We found parking right in front of Conrad’s dorm and then we slipped inside the building when a girl stepped out with a laundry basket full of clothes. I felt so incredibly young, and also lost—I’d never been there before. It was different than I’d pictured it. Louder. Busier.\u003c/p\u003e\n\u003cp\u003eJeremiah knew the way and I had to hurry to keep up. He took the stairs two at a time and at the third floor, we stopped. I followed him down a brightly lit hallway. On the wall by the elevator there was a bulletin board with a poster that read, Let’s talk about sex, baby . There were STD pamphlets and a breast exam how-to, and neon condoms were stapled around artfully. “Take one,” someone had written in highlighter. “Or three.”\u003c/p\u003e\n\u003cp\u003eConrad’s door had his name on it, and underneath it, the name “Eric Trusky.”\u003c/p\u003e\n\u003cp\u003eHis roommate was a stocky, muscular guy with reddish brown hair, and he opened the door wearing gym shorts and a T-shirt. “What’s up?” he asked us, his eyes falling on me. He reminded me of a wolf.\u003c/p\u003e\n\u003cp\u003eInstead of feeling flattered by a college guy checking me out, I just felt grossed out. I wanted to hide behind Jeremiah the way I used to hide behind my mother’s skirt when I was five and really shy. I had to remind myself I was sixteen, almost seventeen. Too old to be nervous around a guy named Eric Trusky. Even if Conrad did tell me that Eric was always forwarding him freaky\u0026nbsp; p**n o videos and stayed on his computer pretty much all day. Except for when he watched his soaps from two to four.\u003c/p\u003e\n\u003cp\u003eJeremiah cleared his throat. “I’m Conrad’s brother, and this is—our friend,” he said. “Do you know where he is?”\u003c/p\u003e\n\u003cp\u003eEric opened the door and let us in. “Dude, I have no idea. He just took off. Did Ari call you?”\u003c/p\u003e\n\u003cp\u003e“Who’s Ari?” I asked Jeremiah.\u003c/p\u003e\n\u003cp\u003e“The RA,” he said.\u003c/p\u003e\n\u003cp\u003e“Ari the RA,” I repeated, and the corners of Jeremiah’s mouth turned up.\u003c/p\u003e\n\u003cp\u003e“Who are you?” Eric asked me.\u003c/p\u003e\n\u003cp\u003e“Belly.” I watched him, waiting for a glimmer of recognition, something that let me know that Conrad talked about me, had at least mentioned me. But of course there was nothing. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-17.html","bookId":2724,"creation":"Oct 5, 2019 4:14:01 PM","modification":"Oct 5, 2019 4:14:01 PM"}
