{"id":79084,"no":23,"title":"Page 23","content":"\u003cp\u003eMy first stop was the general store. I used to spend hours in there, mulling over the penny candy. Each choice seemed vitally important. The boys would dump candy in haphazardly, a scoop of this, a handful of that. But I was careful, ten big Swedish Fish, five malt balls, a medium-size scoop of pear Jelly Bellys. For old times’ sake, I filled a bag. I put in Goobers for Jeremiah, a Clark Bar for Conrad, and even though he wasn’t here, a Lemonhead for Steven. It was a candy memorial, a tribute to the Cousins of our childhood, when picking penny candy was the biggest and best part of our day.\u003c/p\u003e\n\u003cp\u003eI was standing in line waiting to pay when I heard someone say, “Belly?”\u003c/p\u003e\n\u003cp\u003eI turned around. It was Maureen O’Riley, who owned the fancy hat shop in town—Maureen’s Millinery. She was older than my parents, in her late fifties, and she was friendly with my mother and Susannah. She took her hats very seriously.\u003c/p\u003e\n\u003cp\u003eWe hugged, and she smelled the same, like Murphy Oil Soap.\u003c/p\u003e\n\u003cp\u003e“How’s your mother? How’s Susannah?” she asked me.\u003c/p\u003e\n\u003cp\u003e“My mother’s fine,” I told her. I moved up in line, away from Maureen.\u003c/p\u003e\n\u003cp\u003eShe moved up with me. “And Susannah?”\u003c/p\u003e\n\u003cp\u003eI cleared my throat. “Her cancer came back, and she passed away.”\u003c/p\u003e\n\u003cp\u003eMaureen’s tan face wrinkled up in alarm. “I hadn’t heard. I’m sorry to hear that. I was very fond of her. When?”\u003c/p\u003e\n\u003cp\u003e“Beginning of May,” I said. It was almost my turn to pay, and then I could leave and this conversation would be over.\u003c/p\u003e\n\u003cp\u003eThen Maureen clasped my hand, and my first impulse was to snatch it away, even though I’d always liked Maureen. I just didn’t want to stand in the general store, talking about Susannah being dead like it was town gossip. We were talking about Susannah here.\u003c/p\u003e\n\u003cp\u003eShe must have sensed it, because she let go. She said, “I wish I’d known. Please send my condolences to the boys and your mother. And Belly, come by the store and see me sometime. We’ll get you fitted for a hat. I think it’s time you had one, something with a trim.”\u003c/p\u003e\n\u003cp\u003e“I’ve never worn a hat,” I said, fumbling for my wallet.\u003c/p\u003e\n\u003cp\u003e“It’s time,” Maureen said again. “Something to set you off. Come by, I’ll take care of you. A present.”\u003c/p\u003e\n\u003cp\u003eAfter, I walked through town slowly, stopping at the bookstore and the surf shop. I walked aimlessly, dipping my hand into the candy bag on occasion. I didn’t want to run into anybody else but I was in no hurry to get back to the house. It was obvious Conrad didn’t want me around. Was I making things worse? The way he’d looked at me . . . it was harder than I’d thought it was going to be, seeing him again. Being in that house again. A million times harder.\u003c/p\u003e\n\u003cp\u003eWhen I got back to the house with the rolls in a greasy paper bag, Jeremiah and Conrad were drinking beer out on the back deck. The sun was setting. It was going to be a beautiful sunset.\u003c/p\u003e\n\u003cp\u003eI threw the keys and the bag down on the table and fell onto a lounge chair. “Pass me a beer,” I said. It wasn’t because I particularly liked beer. I didn’t. It was because I wanted to be a part of them, the way having a few beers out back had brought them together in some small way. Just like the old days, all I wanted was to be included.\u003c/p\u003e\n\u003cp\u003eI expected Conrad to glare at me and tell me no, he would not be passing me any beer. When he didn’t, I was surprised to feel disappointed. Jeremiah reached into the cooler and threw me an Icehouse. He winked at me. “Since when does our Belly Button drink?” he said.\u003c/p\u003e\n\u003cp\u003e“I’m almost seventeen,” I reminded him. “Don’t you think I’m too old for you to call me that?”\u003c/p\u003e\n\u003cp\u003e“I know how old you are,” Jeremiah said.\u003c/p\u003e\n\u003cp\u003eConrad reached into the paper bag and pulled out a sandwich. He bit into it hungrily, and I wondered if he had eaten anything all day.\u003c/p\u003e\n\u003cp\u003e“You’re welcome,” I told him. I couldn’t help myself. He hadn’t looked my way once since I got back. I wanted to make him acknowledge me.\u003c/p\u003e\n\u003cp\u003eHe grunted thanks, and Jeremiah shot me a warning look. Like, Don’t piss him off just when things are good.\u003c/p\u003e\n\u003cp\u003eJeremiah’s phone buzzed on the table, and he didn’t move to pick it up. Conrad said, “I’m not leaving this house. Tell him that.”\u003c/p\u003e\n\u003cp\u003eMy head jerked up. What did that mean, he wasn’t leaving? Like, ever? I stared hard at Conrad, but his face was as impassive as ever.\u003c/p\u003e\n\u003cp\u003eJeremiah stood up, picked up the phone, and walked back into the house. He closed the sliding door behind him. For the first time, Conrad and I were left to ourselves. The air between us felt heavy, and I wondered if he was sorry for what he’d said earlier. I wondered if I should say something, try and fix things. But what would I say? I didn’t know if there was anything I could say.\u003c/p\u003e\n\u003cp\u003eSo I didn’t try. Instead I let the moment pass and I just sighed and leaned back onto my chair. The sky was pinky gold. I had the feeling that there was nothing more beautiful than this, that this particular sunset matched the beauty of anything in this world, ten times over. I could feel all the tension of the day drifting away from me and out to sea. I wanted to memorize it all in case I didn’t get to come back again. You never know the last time you’ll see a place. A person.\u003c/p\u003e\n\u003cp\u003eChapter eighteen\u003c/p\u003e\n\u003cp\u003eWe sat around watching TV for a while. Jeremiah didn’t make any more moves to talk to Conrad, and no one mentioned school or Mr. Fisher. I wondered if Jeremiah was waiting to be alone with him again.\u003c/p\u003e\n\u003cp\u003eI forced myself to yawn. To no one in particular, I said, “I’m so tired.”\u003c/p\u003e\n\u003cp\u003eAs soon as I said it, I realized I really was. I was so tired. It felt like it had been the longest day ever. Even though all I really did was ride around in a car, I felt completely drained of energy.\u003c/p\u003e\n\u003cp\u003e“I’m going to sleep,” I announced, yawning again, this time for real.\u003c/p\u003e\n\u003cp\u003e“Good night,” Jeremiah said, and Conrad didn’t say anything.\u003c/p\u003e\n\u003cp\u003eAs soon as I got to my room, I opened my overnight bag, and I was horrified when I saw what was inside. There was Taylor’s brand-new gingham bikini, her prized platform sandals, an eyelet sundress, the cutoffs that her dad referred to as “denim underwear,” a few silky tops, and instead of the big T-shirt I’d been looking forward to wearing to sleep, a pink pajama set with little red hearts. Little shorts and a matching tank top. I wanted to kill her. I’d assumed she was adding to what I’d already packed, not replacing it. The only thing she’d left of mine was the underwear.\u003c/p\u003e\n\u003cp\u003eThe thought of prancing around the house in those pajamas, being seen on the way to brush my teeth in the morning, made me want to hit her. Hard. I knew that Taylor meant well. She thought she was doing me a favor. Giving up her platform sandals for the night was altruistic, for Taylor. But I was still mad. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-23.html","bookId":2724,"creation":"Oct 5, 2019 4:14:01 PM","modification":"Oct 5, 2019 4:14:01 PM"}
