{"id":79087,"no":26,"title":"Page 26","content":"\u003cp\u003eI stayed in the pool for another hour. When I came up for air after my last lap, I saw that Conrad was sitting in the chair where I’d left my towel. He held it out to me silently.\u003c/p\u003e\n\u003cp\u003eI climbed out of the pool. Suddenly I was shivering. I took the towel from him and wrapped it around my body. He did not look at me. “Do you still pretend you’re at the Olympics?” he asked me.\u003c/p\u003e\n\u003cp\u003eI started, and then I shook my head and sat down next to him. “No,” I said, and the word hung in the air. I hugged my knees to my chest. “Not anymore.”\u003c/p\u003e\n\u003cp\u003e“When you swim,” he started to say. I thought he wasn’t going to continue, but then he said, “You wouldn’t notice if the house was on fire. You’re so into what you’re doing, it’s like you’re someplace else.”\u003c/p\u003e\n\u003cp\u003eHe said it with grudging respect. Like he’d been watching me for a long time, like he’d been watching me for years. Which I guess he had.\u003c/p\u003e\n\u003cp\u003eI opened my mouth to respond, but he was already standing up, going back into the house. As he closed the sliding door, I called out, “That’s why I like it.”\u003c/p\u003e\n\u003cp\u003eChapter twenty-two\u003c/p\u003e\n\u003cp\u003eI was back in my room, about to change out of my bikini when my phone rang. It was Steven’s ringtone, a Taylor Swift song he pretended to hate but secretly loved. For a second, I thought about not answering. But if I didn’t pick up, he’d only call back until I did. He was annoying that way.\u003c/p\u003e\n\u003cp\u003e“Hello?” I said it like a question, like I didn’t already know it was Steven.\u003c/p\u003e\n\u003cp\u003e“Hey,” he said. “I don’t know where you are, but I know you’re not with Taylor.”\u003c/p\u003e\n\u003cp\u003e“How do you know that?” I whispered.\u003c/p\u003e\n\u003cp\u003e“I just ran into her at the mall. She’s worse than you at lying. Where the hell are you?”\u003c/p\u003e\n\u003cp\u003eI bit my upper lip and I said, “At the summer house. In Cousins.”\u003c/p\u003e\n\u003cp\u003e“What?” he sort of yelled. “Why?”\u003c/p\u003e\n\u003cp\u003e“It’s kind of a long story. Jeremiah needed my help with Conrad.”\u003c/p\u003e\n\u003cp\u003e“So he called you ?” My brother’s voice was incredulous and also the tiniest bit jealous.\u003c/p\u003e\n\u003cp\u003e“Yeah.” He was dying to ask me more, but I was banking on the fact that his pride wouldn’t let him. Steven hated being left out. He was silent for a moment, and in those seconds, I knew he was wondering about all the summer house stuff we were doing without him.\u003c/p\u003e\n\u003cp\u003eAt last he said, “Mom’s gonna be so pissed.”\u003c/p\u003e\n\u003cp\u003e“What do you care?”\u003c/p\u003e\n\u003cp\u003e“I don’t care, but Mom will.”\u003c/p\u003e\n\u003cp\u003e“Steven, chill out. I’ll be home soon. We just have to do one last thing.”\u003c/p\u003e\n\u003cp\u003e“What last thing?” It killed him that I knew something he didn’t, that for once, he was the odd man out. I thought I’d take more pleasure in it, but I felt oddly sorry for him.\u003c/p\u003e\n\u003cp\u003eSo instead of gloating the way I normally would, I said, “Conrad took off from summer school and we have to get him back in time for midterms on Monday.”\u003c/p\u003e\n\u003cp\u003eThat would be the last thing I would do for him. Get him to school. And then he’d be free, and so would I.\u003c/p\u003e\n\u003cp\u003eAfter Steven and I got off the phone, I heard a car pull up in front of the house. I looked out the window and there was a red Honda, a car I didn’t recognize. We almost never had visitors at the summer house.\u003c/p\u003e\n\u003cp\u003eI dragged a comb through my hair and hurried down the stairs with my towel wrapped around me. I stopped when I saw Conrad open the door, and a woman walked in. She was petite, with bleached blond hair that was in a messy bun, and she wore black pants and a silk coral blouse. Her fingernails were painted to match. She had a big folder in her hand and a set of keys.\u003c/p\u003e\n\u003cp\u003e“Well, hello there,” she said. She was surprised to see him, as if she was the one who was supposed to be there and he wasn’t.\u003c/p\u003e\n\u003cp\u003e“Hello,” Conrad said. “Can I help you?”\u003c/p\u003e\n\u003cp\u003e“You must be Conrad,” she said. “We spoke on the phone. I’m Sandy Donatti, your dad’s real estate agent.”\u003c/p\u003e\n\u003cp\u003eConrad said nothing.\u003c/p\u003e\n\u003cp\u003eShe wagged her finger at him playfully. “You told me your dad changed his mind about the sale.”\u003c/p\u003e\n\u003cp\u003eWhen Conrad still said nothing, she looked around and saw me standing at the bottom of the stairs. She frowned and said, “I’m just here to check on the house, make sure everything’s coming along and getting packed up.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I sent the movers away,” Conrad said casually.\u003c/p\u003e\n\u003cp\u003e“I really wish you hadn’t done that,” she said, her lips tight. When Conrad shrugged, she added, “I was told the house would be empty.”\u003c/p\u003e\n\u003cp\u003e“You were given erroneous information. I’ll be here for the rest of the summer.” He gestured at me. “That’s Belly.”\u003c/p\u003e\n\u003cp\u003e“Belly?” she repeated.\u003c/p\u003e\n\u003cp\u003e“Yup. She’s my girlfriend.”\u003c/p\u003e\n\u003cp\u003eI think I choked out loud.\u003c/p\u003e\n\u003cp\u003eCrossing his arms and leaning against the wall, he continued. “And you and my dad met how?”\u003c/p\u003e\n\u003cp\u003eSandy Donatti flushed. “We met when he decided to put the house up for sale,” she snapped.\u003c/p\u003e\n\u003cp\u003e“Well, the thing is, Sandy, it’s not his house to sell. It’s my mother’s house, actually. Did my dad tell you that?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then I guess he also told you she’s dead.”\u003c/p\u003e\n\u003cp\u003eSandy hesitated. Her anger seemed to evaporate at the mention of dead mothers. She was so uncomfortable, she was shifting toward the door. “Yes, he did tell me that. I’m very sorry for your loss.”\u003c/p\u003e\n\u003cp\u003eConrad said, “Thank you, Sandy. That means a lot, coming from you.”\u003c/p\u003e\n\u003cp\u003eHer eyes darted around the room one last time. “Well, I’m going to talk things over with your dad and then I’ll be back.”\u003c/p\u003e\n\u003cp\u003e“You do that. Make sure you let him know the house is off the market.”\u003c/p\u003e\n\u003cp\u003eShe pursed her lips and then opened her mouth to speak, but thought better of it. Conrad opened the door for her, and then she was gone.\u003c/p\u003e\n\u003cp\u003eI let out a big breath. A million thoughts were running through my head—I’m ashamed to say that girlfriend was pretty near the top of the list. Conrad didn’t look at me when he said, “Don’t tell Jeremiah about the house.”\u003c/p\u003e\n\u003cp\u003e“Why not?” I asked. My mind was still lingering on the word “girlfriend.”\u003c/p\u003e\n\u003cp\u003eHe took so long to answer me that I was already walking back upstairs when he said, “I’ll tell him about it. I just don’t want him to know yet. About our dad.”\u003c/p\u003e\n\u003cp\u003eI stopped walking. Without thinking I said, “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“You know what I mean.” Conrad looked at me, his eyes steady. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-26.html","bookId":2724,"creation":"Oct 5, 2019 4:14:01 PM","modification":"Oct 5, 2019 4:14:01 PM"}
