{"id":79095,"no":35,"title":"Page 35","content":"\u003cp\u003eHe was looking at me like we were the only two people in the room, and suddenly I was terrified. And elated. But then I looked over at Jeremiah, watching the two of us, and just as suddenly, I was neither.\u003c/p\u003e\n\u003cp\u003eSolemnly I said, “Nuh-uh. You can’t ask me, ’cause I just asked you. It’s the law.”\u003c/p\u003e\n\u003cp\u003e“The law?” he repeated.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I said, leaning my head against the couch.\u003c/p\u003e\n\u003cp\u003e“Aren’t you at least curious about what I was going to ask?”\u003c/p\u003e\n\u003cp\u003e“Nope. Not even one iota.” Which was a lie. Of course I was curious. I was dying to know.\u003c/p\u003e\n\u003cp\u003eI reached over and poured some more tequila into my cup and then I stood up, my knees shaking. I felt lightheaded. “To our last night!”\u003c/p\u003e\n\u003cp\u003e“We already toasted to that, remember?” Jeremiah said.\u003c/p\u003e\n\u003cp\u003eI stuck my tongue out at him. “Okay, then.” The tequila made me feel brave again. This time, it let me say what I really wanted to say. What I’d been thinking all night. “Here’s to . . . here’s to everybody that isn’t here tonight. To my mom, and to Steven, and to Susannah most of all. Okay?”\u003c/p\u003e\n\u003cp\u003eConrad looked up at me. For a minute, I was afraid of what he would say. And then he lifted his cup too, and so did Jeremiah. We all swigged from our cups together, and it burned like liquid fire. I coughed a little.\u003c/p\u003e\n\u003cp\u003eWhen I sat back down I asked Jeremiah, “So, who’s coming to this party?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Some kids from the country club pool from last summer. They’re telling people too. Oh, and Mikey and Pete and those guys.”\u003c/p\u003e\n\u003cp\u003eI wondered who “Mikey and Pete and those guys” were. I also wondered if I should clean up before people came.\u003c/p\u003e\n\u003cp\u003e“What time are people coming over?” I asked Jeremiah.\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Ten? Eleven?”\u003c/p\u003e\n\u003cp\u003eI jumped up. “It’s already almost nine! I have to get dressed.”\u003c/p\u003e\n\u003cp\u003eConrad said, “Aren’t you already dressed?”\u003c/p\u003e\n\u003cp\u003eI didn’t even bother to answer him. I just shot upstairs.\u003c/p\u003e\n\u003cp\u003eChapter thirty\u003c/p\u003e\n\u003cp\u003eI had the contents of my duffel bag dumped out on the floor when Taylor called. Which was when I remembered that it was Saturday. It felt like I’d been gone much longer. Then I remembered that it was the Fourth of July. And I was supposed to be on a boat with Taylor and Davis and everyone. Gulp.\u003c/p\u003e\n\u003cp\u003e“Hey, Taylor,” I said.\u003c/p\u003e\n\u003cp\u003e“Hey, where are you?” Taylor didn’t sound mad, which was kind of freaky.\u003c/p\u003e\n\u003cp\u003e“Um, still in Cousins. Sorry I didn’t make it back in time for the boat party.” From the pile of clothes, I picked out a chiffony one-shoulder blouse and tried it on. Whenever Taylor wore it, she wore her hair pulled to the side.\u003c/p\u003e\n\u003cp\u003e“It’s been raining all day, so we cancelled the boat party. Cory’s having a party tonight at his brother’s condo instead. What about you?”\u003c/p\u003e\n\u003cp\u003e“I think we’re having a party too. Jeremiah just bought a ton of beer and tequila and stuff,” I said, adjusting the blouse. I wasn’t sure how much shoulder I was supposed to be showing.\u003c/p\u003e\n\u003cp\u003e“A party?” she squealed. “I wanna come!”\u003c/p\u003e\n\u003cp\u003eI tried to wiggle my foot into one of Taylor’s platform sandals. I wished I hadn’t mentioned the party—or the tequila. Lately, Taylor was crazy for tequila body shots. “What about Cory’s party?” I said. “I heard his brother’s condo has a Jacuzzi. You love Jacuzzis.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah. Darn. But I want to party with you guys too! Beach parties are the funnest,” she said. “Anyway, I heard from Rachel Spiro that a bunch of freshman sluts are coming now. It might not even be worth it to go. OMG, maybe I should just get in my car and drive to Cousins!”\u003c/p\u003e\n\u003cp\u003e“By the time you got here, everybody would be gone. You should probably just go to Cory’s.”\u003c/p\u003e\n\u003cp\u003eI heard a car pull into the driveway. People were already here. So it wasn’t like I was lying to her.\u003c/p\u003e\n\u003cp\u003eI was about to tell Taylor I had to go when she said in a little voice, “Do you, like, not want me to come?”\u003c/p\u003e\n\u003cp\u003e“I didn’t say that,” I said.\u003c/p\u003e\n\u003cp\u003e“You basically did.”\u003c/p\u003e\n\u003cp\u003e“Taylor,” I began. But I didn’t know what to say next. Because she was right. I didn’t want her to come. If she came, it would be all about her, the way it always was. This was my last night in Cousins, in this house. I was never going to be inside this house again, ever. I wanted tonight to be about me and Conrad and Jeremiah.\u003c/p\u003e\n\u003cp\u003eTaylor waited for me to say something, to deny it at least, and when I didn’t, she spat out, “I can’t even believe how selfish you are, Belly.”\u003c/p\u003e\n\u003cp\u003e“Me?”\u003c/p\u003e\n\u003cp\u003e“Yes, you. You keep your summer house and your summer boys all to yourself and you don’t want to share anything with me. We finally get to spend a whole summer together and you don’t even care! All you care about is being in Cousins, with them .” She sounded so spiteful. But instead of feeling guilty the way I normally would, I just felt annoyed.\u003c/p\u003e\n\u003cp\u003e“Taylor,” I said.\u003c/p\u003e\n\u003cp\u003e“Quit saying my name like that.”\u003c/p\u003e\n\u003cp\u003e“Like how?”\u003c/p\u003e\n\u003cp\u003e“Like I’m a child.”\u003c/p\u003e\n\u003cp\u003e“Well, then maybe you shouldn’t act like one just because you aren’t invited somewhere.” As soon as I said it, I regretted it.\u003c/p\u003e\n\u003cp\u003e“Screw you, Belly! I put up with a lot. You are a really crappy best friend, you know that?”\u003c/p\u003e\n\u003cp\u003eI let out a breath. “Taylor . . . shut up.”\u003c/p\u003e\n\u003cp\u003eShe gasped. “Don’t you dare tell me to shut up! I have been nothing but supportive of you, Belly. I listen to all your Conrad BS and I don’t even complain. When you guys broke up, who was the one who spoon-fed you Chunky Monkey and got you out of bed? Me! And you don’t even appreciate that. You’re, like, hardly even fun anymore.”\u003c/p\u003e\n\u003cp\u003eSarcastically, I said, “Gee, Taylor, I’m so sorry I’m not fun anymore. Having someone you love die can do that.”\u003c/p\u003e\n\u003cp\u003e“Don’t do that. Don’t just blame it on that. You’ve been chasing after Conrad for as long as I’ve known you. It’s getting pathetic. Get over it! He doesn’t like you. Maybe he never did.”\u003c/p\u003e\n\u003cp\u003eThat was maybe the meanest thing she’d ever said to me. I think she might have apologized if I hadn’t come back at her with, “At least I didn’t give away my virginity to a guy who shaves his legs!”\u003c/p\u003e\n\u003cp\u003eShe gasped. In confidence, Taylor had once told me that Davis shaved his legs for swim team. She was silent for a moment. And then she said, “You better not wear my platforms tonight.”\u003c/p\u003e\n\u003cp\u003e“Too late. I already am!” And then I hung up. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-35.html","bookId":2724,"creation":"Oct 5, 2019 4:14:01 PM","modification":"Oct 5, 2019 4:14:01 PM"}
