{"id":79106,"no":46,"title":"Page 46","content":"\u003cp\u003eLooking out the window, it was impossible to see where the sky ended and the ocean began. I’d forgotten how foggy the mornings could get here. I stood there and tried to get my fill, tried to make the memory last.\u003c/p\u003e\n\u003cp\u003eThen I ran over to Jeremiah’s and Conrad’s rooms, banging on doors. “Wake up! Let’s get this show on the road!” I yelled, starting down the hall.\u003c/p\u003e\n\u003cp\u003eI headed downstairs to get a glass of juice, and Conrad was sitting at the kitchen table, where he’d been when I went to sleep around four a.m. He was already dressed and making notes in a notebook.\u003c/p\u003e\n\u003cp\u003eI started to back out of the kitchen, but he looked up. “Nice pjs,” he said.\u003c/p\u003e\n\u003cp\u003eI flushed. I was still wearing Taylor’s stupid pajamas. Scowling, I said, “We’re leaving in twenty minutes, so be ready.”\u003c/p\u003e\n\u003cp\u003eAs I headed back upstairs, I heard Conrad say, “I already am.”\u003c/p\u003e\n\u003cp\u003eIf he said he was ready, he was ready. He would pass those exams. He’d probably ace them. Conrad didn’t fail at anything he set his mind to.\u003c/p\u003e\n\u003cp\u003eAn hour later, we were almost on our way. I was locking the glass sliding door on the porch when I heard Conrad say, “Should we?”\u003c/p\u003e\n\u003cp\u003eI turned around, started to say, “Should we what?” when Jeremiah came out of nowhere.\u003c/p\u003e\n\u003cp\u003e“Yeah. For old times’ sake,” Jeremiah said.\u003c/p\u003e\n\u003cp\u003eUh-oh. “No way,” I said. “No freaking way.”\u003c/p\u003e\n\u003cp\u003eThe next thing I knew, Jeremiah was grabbing my legs and Conrad took my arms, and together they swung me back, then forth. Jeremiah yelled, “Belly Flop!” and they flung me through the air, and as I landed in the pool, I thought, Well, there, they’re finally united on something.\u003c/p\u003e\n\u003cp\u003eWhen I surfaced, I yelled, “Jerks!” It only made them laugh harder.\u003c/p\u003e\n\u003cp\u003eI had to go back inside and change out of my soaked clothes, the clothes I wore the first day. I changed into Taylor’s sundress and her platform sandals. As I wrung out my hair with a hand towel, it was hard to be mad. I even smiled to myself. Possibly the last Belly Flop of my life, and Steven wasn’t there to partake.\u003c/p\u003e\n\u003cp\u003eIt was Jeremiah’s idea to take one car, so Conrad could keep studying on the way. Conrad didn’t even try to take the front seat, he just went straight to the back and started flipping through his note cards.\u003c/p\u003e\n\u003cp\u003ePredictably, I cried as we drove away. I was just glad I was up front and wearing sunglasses so the boys couldn’t tease me about it. But I loved that house, and I hated to say good-bye. Because, it was more than just a house. It was every summer, every boat ride, every sunset. It was Susannah.\u003c/p\u003e\n\u003cp\u003eWe drove in near silence for a while, and then Britney Spears came on the radio, and I turned it up, loud. It went without saying that Conrad hated Britney Spears, but I didn’t care. I started to sing along, and Jeremiah did too.\u003c/p\u003e\n\u003cp\u003e“Oh baby baby, I shouldn’t have let you go,” I sang, shimmying toward the dashboard.\u003c/p\u003e\n\u003cp\u003e“Show me how you want it to be,” Jeremiah sang back, bouncing his shoulders.\u003c/p\u003e\n\u003cp\u003eWhen the song changed, it was Justin Timberlake, and Jeremiah did an amazing Justin Timberlake. He was so un-self-conscious and easy with who he was. He made me want to be like that too.\u003c/p\u003e\n\u003cp\u003eHe sang to me, “And tell me how they got that pretty little face on that pretty little frame, girl.” I put my hand on my heart and fake-swooned for him, like a groupie.\u003c/p\u003e\n\u003cp\u003e“Fast fast slow, whichever way you wanna run, girl.”\u003c/p\u003e\n\u003cp\u003eI backed him up at the chorus. “This just can’t be summer love . . .”\u003c/p\u003e\n\u003cp\u003eFrom the backseat, Conrad growled, “Can you guys please turn the music down? I’m trying to study here, remember?”\u003c/p\u003e\n\u003cp\u003eI turned around and said, “Oh, sorry. Is it bothering you?”\u003c/p\u003e\n\u003cp\u003eHe looked at me with narrowed eyes.\u003c/p\u003e\n\u003cp\u003eWithout saying a word, Jeremiah turned the music down. We drove for another hour or so and then he said, “Do you need to pee or anything? I’m gonna stop at the next exit for gas.”\u003c/p\u003e\n\u003cp\u003eI shook my head. “No, but I am thirsty.”\u003c/p\u003e\n\u003cp\u003eWe pulled into the gas station parking lot, and while Jeremiah filled the car up and Conrad napped, I ran into the convenience store. I got Jeremiah and me both Slurpees, half Coke and half cherry, a combination I had perfected over the years.\u003c/p\u003e\n\u003cp\u003eWhen I got back to the car, I climbed in and handed Jeremiah his Slurpee. His whole face lit up. “Aw, thanks, Bells. What flavor did you get me?”\u003c/p\u003e\n\u003cp\u003e“Drink it and see.”\u003c/p\u003e\n\u003cp\u003eHe took a long sip and nodded appreciatively. “Half Coke, half cherry, your specialty. Nice.”\u003c/p\u003e\n\u003cp\u003e“Hey, remember that time—,” I started to say.\u003c/p\u003e\n\u003cp\u003e“Yup,” he said. “My dad still doesn’t want anyone touching his blender.”\u003c/p\u003e\n\u003cp\u003eI put my feet up on the dashboard and leaned back, sipping on my Slurpee. I thought to myself, Happiness is a Slurpee and a hot pink straw.\u003c/p\u003e\n\u003cp\u003eFrom the back, Conrad said, irritably, “Where’s mine?”\u003c/p\u003e\n\u003cp\u003e“I thought you were still asleep,” I said. “And you have to drink a Slurpee right away or it’ll melt, so . . . I didn’t see the point.”\u003c/p\u003e\n\u003cp\u003eConrad glared at me. “Well, at least let me have a sip.”\u003c/p\u003e\n\u003cp\u003e“But you hate Slurpees.” Which was true. Conrad didn’t like sugary drinks, he never had.\u003c/p\u003e\n\u003cp\u003e“I don’t care. I’m thirsty.”\u003c/p\u003e\n\u003cp\u003eI handed him my cup and turned around and watched him drink. I was expecting him to make a face or something, but he just drank and handed it back. And then he said, “I thought your specialty was cocoa.”\u003c/p\u003e\n\u003cp\u003eI stared at him. Did he really just say that? Did he remember? The way he looked back at me, one eyebrow raised, I knew he did. And this time, I was the one to look away.\u003c/p\u003e\n\u003cp\u003eBecause I remembered. I remembered everything.\u003c/p\u003e\n\u003cp\u003eChapter forty-one\u003c/p\u003e\n\u003cp\u003eWhen Conrad left to take his exam, Jeremiah and I bought turkey and avocado sandwiches on whole wheat bread and we ate them out on the lawn. I finished mine first; I was really hungry.\u003c/p\u003e\n\u003cp\u003eWhen he was done, Jeremiah balled up the foil in his hand and threw it into the trashcan. He sat back down next to me in the grass. Out of nowhere, he said to me, “Why didn’t you come see me after my mom died?”\u003c/p\u003e\n\u003cp\u003eI stuttered, “I d-d-did, I came to the funeral.”\u003c/p\u003e\n\u003cp\u003eJeremiah’s gaze on me was steady, unblinking. “That’s not what I mean.”\u003c/p\u003e\n\u003cp\u003e“I—I didn’t think you’d want me there yet.”\u003c/p\u003e\n\u003cp\u003e“No, it was because you didn’t want to be there. I wanted you there.”\u003c/p\u003e\n\u003cp\u003eHe was right. I didn’t want to be there. I didn’t want to be anywhere near her house. Thinking about her made my heart hurt; it was too much. But the thought of Jeremiah waiting for me to call him, needing someone to talk to, that hurt so bad. “You’re right,” I told him. “I should’ve come.” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-46.html","bookId":2724,"creation":"Oct 5, 2019 4:14:01 PM","modification":"Oct 5, 2019 4:14:01 PM"}
