{"id":79107,"no":47,"title":"Page 47","content":"\u003cp\u003eJeremiah had been there for Conrad, for Susannah. For me. And who had been there for him? Nobody. I wanted him to know I was here now.\u003c/p\u003e\n\u003cp\u003eHe looked up at the sky. “It’s hard, you know? Because I want to talk about her. But Conrad doesn’t want to, and I can’t talk to my dad, and you weren’t there either. We all love her, and nobody can talk about her.”\u003c/p\u003e\n\u003cp\u003e“What do you want to say?”\u003c/p\u003e\n\u003cp\u003eHe leaned his head back, thinking. “That I miss her. I really miss her. She’s only been gone for two months, but it feels like longer. And it also feels like it just happened, like yesterday.”\u003c/p\u003e\n\u003cp\u003eI nodded. That was exactly how it felt.\u003c/p\u003e\n\u003cp\u003e“Do you think she’d be glad?”\u003c/p\u003e\n\u003cp\u003eHe meant glad about Conrad, the way we’d helped him. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“Me too.” Jeremiah hesitated. “So what now?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I mean, are you going to come back this summer?”\u003c/p\u003e\n\u003cp\u003e“Well, sure. When my mom comes, I’ll come too.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Good. Because my dad was wrong, you know. It’s your house too. And Laure’s, and Steve’s. It’s all of ours.”\u003c/p\u003e\n\u003cp\u003eSuddenly I was struck with the strangest sensation, of wanting, needing, to reach out and touch his cheek with the back of my hand. So he would know, so he would feel exactly how much those words meant to me. Because sometimes words were so pitifully inadequate, and I knew that, but I had to try anyway. I told him, “Thank you. That means—a lot.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “It’s just the truth.”\u003c/p\u003e\n\u003cp\u003eWe saw him coming from far away, walking fast. We stood up and waited for him.\u003c/p\u003e\n\u003cp\u003eJeremiah said, “Does it look like good news to you? It looks like good news to me.”\u003c/p\u003e\n\u003cp\u003eIt did to me, too.\u003c/p\u003e\n\u003cp\u003eConrad strode up to us, his eyes gleaming. “I killed it,” he said triumphantly. First time I’d seen him smile, really smile—joyful, carefree—since Susannah died. He and Jeremiah high-fived so hard the clap rang out in the air. And then Conrad smiled at me, and whirled me around so fast I almost tripped.\u003c/p\u003e\n\u003cp\u003eI was laughing. “See? See? I told you!”\u003c/p\u003e\n\u003cp\u003eConrad picked me up and threw me over his shoulder like I weighed nothing, just like he had the other night. I laughed as he ran, weaving left and right like he was on a football field. “Put me down!” I shrieked, yanking at the bottom of my dress.\u003c/p\u003e\n\u003cp\u003eHe did. He set me down on the ground gently. “Thanks,” he said, his hand still on my waist. “For coming.”\u003c/p\u003e\n\u003cp\u003eBefore I could tell him you’re welcome, Jeremiah walked over and said, “You still have one left, Con.” His voice was strained, and I straightened my dress.\u003c/p\u003e\n\u003cp\u003eConrad looked at his watch. “You’re right. I’m gonna head over to the psychology department. This will be a quick one. I’ll meet up with you guys in an hour or so.”\u003c/p\u003e\n\u003cp\u003eAs I watched him go, a million questions ran through my head. I felt dizzy, and not just from being spun around in the air.\u003c/p\u003e\n\u003cp\u003eAbruptly, Jeremiah said, “I’m gonna go find a bathroom. I’ll meet you at the car.” He fished his keys out of his pocket and threw them to me.\u003c/p\u003e\n\u003cp\u003e“Do you want me to wait?” I asked, but he was already walking away.\u003c/p\u003e\n\u003cp\u003eHe didn’t turn around. “No, just go ahead.”\u003c/p\u003e\n\u003cp\u003eInstead of going straight to the car, I stopped at the student store. I bought a soda and a hoodie that said brown in block letters. Even though it wasn’t cold, I put it on.\u003c/p\u003e\n\u003cp\u003eJeremiah and I sat in the car, listening to the radio. It was starting to get dark. The windows were down and I could hear a bird calling somewhere out there. Conrad would be done with his last exam soon.\u003c/p\u003e\n\u003cp\u003e“Nice hoodie, by the way,” Jeremiah said.\u003c/p\u003e\n\u003cp\u003e“Thanks. I always wanted one from Brown.”\u003c/p\u003e\n\u003cp\u003eJeremiah nodded. “I remember.”\u003c/p\u003e\n\u003cp\u003eI fingered my necklace, twisting it around my pinky. “I wonder . . .” I let my sentence trail off, waiting for Jeremiah to prod me, to ask me what it was I wondered about. But he didn’t. He didn’t ask me anything.\u003c/p\u003e\n\u003cp\u003eHe was silent.\u003c/p\u003e\n\u003cp\u003eSighing, I looked out the window and asked, “Does he ever talk about me? I mean, has he ever said anything?”\u003c/p\u003e\n\u003cp\u003e“Don’t,” he snapped.\u003c/p\u003e\n\u003cp\u003e“Don’t what?” I turned toward him, confused.\u003c/p\u003e\n\u003cp\u003e“Don’t ask me that. Don’t ask me about him.” Jeremiah spoke in a harsh, low voice, a tone he’d never used with me and one I didn’t recall him using with anybody. A muscle in his jaw twitched furiously.\u003c/p\u003e\n\u003cp\u003eI recoiled and sank back into my seat. I felt as though he had slapped me. “What’s the matter with you?”\u003c/p\u003e\n\u003cp\u003eHe started to say something, maybe an apology and maybe not, and then he stopped, he leaned over and pulled me toward him—like by gravitational force. He kissed me, hard, and his skin was stubbly and rough against my cheek. My first thought was, I guess he didn’t have time to shave this morning , and then—I was kissing him back, my fingers winding through his soft yellow hair and my eyes closed. He kissed like he was drowning and I was air. It was passionate, and desperate, and like nothing I had ever experienced before.\u003c/p\u003e\n\u003cp\u003eThis was what people meant when they said the earth stopped turning. It felt like a world outside of that car, that moment, didn’t exist. It was just us.\u003c/p\u003e\n\u003cp\u003eWhen he backed away, his pupils were huge and unfocused. He blinked, and then he cleared his throat. “Belly,” he said, and his voice was foggy. He didn’t say anything else, just my name.\u003c/p\u003e\n\u003cp\u003e“Do you still—” Care. Think about me. Want me.\u003c/p\u003e\n\u003cp\u003eRoughly, he said, “Yes. Yes, I still.”\u003c/p\u003e\n\u003cp\u003eAnd then we were kissing again.\u003c/p\u003e\n\u003cp\u003eHe must have made some noise, because we both looked up at the same time.\u003c/p\u003e\n\u003cp\u003eWe sprang apart. There was Conrad, looking right at us. He had stopped short of the car. His face was white.\u003c/p\u003e\n\u003cp\u003eHe said, “No, don’t stop. I’m the one who’s interrupting.”\u003c/p\u003e\n\u003cp\u003eHe turned jerkily and started off. Jeremiah and I stared at each other in silent horror. And then my hand was on the door handle and I was on my feet. I didn’t look back.\u003c/p\u003e\n\u003cp\u003eI ran after him and called his name, but Conrad didn’t turn around. I grabbed his arm and he finally looked at me, and there was so much hate in his eyes I winced. Even though, on some level, wasn’t this what I wanted? To make his heart hurt the way he made mine? Or maybe, to make him feel something for me other than pity or indifference. To make him feel something, anything.\u003c/p\u003e\n\u003cp\u003e“So you like Jeremiah now?” He meant to sound sarcastic, cruel, and he did, but he also sounded pained. Like he cared about the answer. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-47.html","bookId":2724,"creation":"Oct 5, 2019 4:14:01 PM","modification":"Oct 5, 2019 4:14:01 PM"}
