{"id":79110,"no":50,"title":"Page 50","content":"\u003cp\u003eI shrugged. “They’re Taylor’s shoes,” I said, as if that made sense. I added, “They’re too small.”\u003c/p\u003e\n\u003cp\u003eHe asked, “Do you want to drive?”\u003c/p\u003e\n\u003cp\u003eI thought it over and then I said, “No, that’s okay. You drive.”\u003c/p\u003e\n\u003cp\u003e“But you love to drive my car,” he said, coming around to the passenger side and opening my door first.\u003c/p\u003e\n\u003cp\u003e“I know. But today I just feel like riding shotgun.”\u003c/p\u003e\n\u003cp\u003e“Do you want to get breakfast first?”\u003c/p\u003e\n\u003cp\u003e“No,” I said. “I just want to go home.”\u003c/p\u003e\n\u003cp\u003eSoon we were on the road. I opened my window all the way down. I stuck my head out and let my hair fly everywhere, just because. Steven once told me that bugs and things get caught up in girls’ hair when they ride with it hanging out the window. But I didn’t care. I liked the way it felt. It felt free.\u003c/p\u003e\n\u003cp\u003eJeremiah looked over at me and said, “You remind me of our old dog, Boogie. He used to love riding around with his head out the window.”\u003c/p\u003e\n\u003cp\u003eHe was still using his polite voice. Distant.\u003c/p\u003e\n\u003cp\u003eI said, “You haven’t said anything. About before.” I glanced over at him. I could hear my heart thudding in my ears.\u003c/p\u003e\n\u003cp\u003e“What’s left to say?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. A lot,” I said.\u003c/p\u003e\n\u003cp\u003e“Belly—,” he started. Then he stopped and let out a breath, shaking his head.\u003c/p\u003e\n\u003cp\u003e“What? What were you going to say?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” he said.\u003c/p\u003e\n\u003cp\u003eThen I reached across, and I took his hand and laced my fingers around his. It felt like the most right thing I’d done in a long time.\u003c/p\u003e\n\u003cp\u003eI worried he’d let go, but he didn’t. We held hands like that the whole rest of the way home.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-50.html","bookId":2724,"creation":"Oct 5, 2019 4:14:01 PM","modification":"Oct 5, 2019 4:14:01 PM"}
