{"id":108767,"no":15,"title":"Page 15","content":"\u003cp\u003eElena watched Damon with mute dread. She knew that disturbing smile too well. But even as her heart sank, her mind threw a mocking question at her. What difference did it make? She and Stefan were going to die anyway. It only made sense for Damon to save himself. And it was wrong to expect him to go against his nature.\u003c/p\u003e\n\u003cp\u003eShe watched that beautiful, capricious smile with a feeling of sorrow for what Damon might have been.\u003c/p\u003e\n\u003cp\u003eKatherine smiled back at him, enchanted. \"We\u0027ll be so happy together. Once they\u0027re dead, I\u0027ll let you go. I didn\u0027t mean to hurt you, not really. I just got angry.\" She put out a slender hand and stroked his cheek. \"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Katherine,\" he said. He was still smiling.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She leaned closer.\u003c/p\u003e\n\u003cp\u003e\"Katherine...\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Damon?\"\u003c/p\u003e\n\u003cp\u003e\"Go to hell.\"\u003c/p\u003e\n\u003cp\u003eElena flinched from what happened next before it happened, feeling the violent upsurge of Power, of malevolent, unbridled Power. She screamed at the change in Katherine. That lovely face was twisting, mutating into something that was neither human nor animal. A red light blazed in Katherine\u0027s eyes as she fell on Damon, her fangs sinking into his throat.\u003c/p\u003e\n\u003cp\u003eTalons sprang from her fingertips, and she raked Damon\u0027s already-bleeding chest with it, tearing into his skin while the blood flowed. Elena kept screaming, realizing dimly that the pain in her arms was from fighting the ropes that held her. She heard Stefan shouting, too, but above everything she heard the deafening shriek of Katherine\u0027s mental voice.\u003c/p\u003e\n\u003cp\u003eNow you\u0027ll be sorry! Now I\u0027m going to make you sorry! I\u0027ll kill you! I\u0027ll kill you! I\u0027ll kill you! I\u0027ll kill you!\u003c/p\u003e\n\u003cp\u003eThe words themselves hurt, like daggers stabbing into Elena\u0027s mind. The sheer Power of it stupefied her, rocking her back against the iron pickets. But there was no way to get away from it. It seemed to echo from all around her, hammering in her skull.\u003c/p\u003e\n\u003cp\u003eKill you! Kill you! Kill you!\u003c/p\u003e\n\u003cp\u003eElena fainted.\u003c/p\u003e\n\u003cp\u003eMeredith, crouched beside Aunt Judith in the utility room, shifted her weight, straining to interpret the sounds outside the door. The dogs had gotten into the cellar; she wasn\u0027t sure how, but from the bloody muzzles of some of them, she\u003c/p\u003e\n\u003cp\u003ethought they had broken through the ground-level windows. Now they were outside the utility room, but Meredith couldn\u0027t tell what they were doing. It was too quiet out there.\u003c/p\u003e\n\u003cp\u003e\"Hush,\" Robert whispered quickly. \"It\u0027s all right, sweetheart. Everything\u0027s going to be all right.\"\u003c/p\u003e\n\u003cp\u003eMeredith met his frightened, determined eyes over Margaret\u0027s tow head. We almost had you pegged for the Other Power, she thought. But there was no time to regret it now.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Elena? Elena said she\u0027d watch over me,\" Margaret said, her eyes large and solemn. \"She said she\u0027d take care of me.\" Aunt Judith put a hand to her mouth.\u003c/p\u003e\n\u003cp\u003e\"She is taking care of you,\" Meredith whispered. \"She just sent me to do it, that\u0027s all. It\u0027s the truth,\" she added fiercely, and saw Robert\u0027s look of reproach melt into perplexity.\u003c/p\u003e\n\u003cp\u003eOutside, the silence had given way to scratching and gnawing sounds. The dogs were at work on the door.\u003c/p\u003e\n\u003cp\u003eRobert cradled Margaret\u0027s head closer to his chest.\u003c/p\u003e\n\u003cp\u003eBonnie didn\u0027t know how long they had been working. Hours, certainly. Forever, it seemed like. The dogs had gotten in through the kitchen and the old wooden side doors. So far, though, only about a dozen had gotten past the fires lit like barricades in front of these openings. And the men with guns had taken care of most of those.\u003c/p\u003e\n\u003cp\u003eBut Mr. Smallwood and his friends were now holding empty rifles. And they were running out of things to burn.\u003c/p\u003e\n\u003cp\u003eVickie had gotten hysterical a little while ago, screaming and holding her head as if something was hurting her. They\u0027d been looking for ways to restrain her when she finally passed out.\u003c/p\u003e\n\u003cp\u003eBonnie went up to Matt, who was looking out over the fire through the demolished side door. He wasn\u0027t looking for dogs, she knew, but for something else much farther away. Something you couldn\u0027t see from here.\u003c/p\u003e\n\u003cp\u003e\"You had to go, Matt,\" she said. \"There was nothing else you could do.\" He didn\u0027t answer or turn around.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s almost dawn,\" she said. \"Maybe when that comes, the dogs will leave.\" But even as she said it, she knew it wasn\u0027t true.\u003c/p\u003e\n\u003cp\u003eMatt didn\u0027t answer. She touched his shoulder. \"Stefan\u0027s with her. Stefan\u0027s there.\"\u003c/p\u003e\n\u003cp\u003eAt last, Matt gave some response. He nodded. \"Stefan\u0027s there,\" he said.\u003c/p\u003e\n\u003cp\u003eBrown and snarling, another shape charged out of the dark.\u003c/p\u003e\n\u003cp\u003eIt was much later when Elena came gradually to consciousness. She knew because she could see, not just by the handful of candles Katherine had lit but also by the cold gray dimness that filtered down from the crypt\u0027s opening.\u003c/p\u003e\n\u003cp\u003eDamon? she thought. It was only after she had done it that she realized the word had not been spoken. Somehow, Katherine\u0027s shrieking had closed a circuit in her mind, or maybe it had awakened something sleeping. And Matt\u0027s blood had undoubtedly helped, giving her the strength to finally find her mental voice.\u003c/p\u003e\n\u003cp\u003eShe turned her head the other way. Stefan?\u003c/p\u003e\n\u003cp\u003eHis face was haggard with pain, but aware. Too aware. Elena almost wished that he were as insensible as Damon to what was happening to them.\u003c/p\u003e\n\u003cp\u003eElena, he returned.\u003c/p\u003e\n\u003cp\u003eWhere is she? Elena said, her eyes moving slowly around the room.\u003c/p\u003e\n\u003cp\u003eStefan looked toward the opening of the crypt. She went up there a while ago.\u003c/p\u003e\n\u003cp\u003eMaybe to check on how the dogs are doing.\u003c/p\u003e\n\u003cp\u003eElena had thought she\u0027d reached the limit of fear and dread, but it wasn\u0027t true. She hadn\u0027t remembered the others then.\u003c/p\u003e\n\u003cp\u003eElena, I\u0027m sorry. Stefan\u0027s face was filled with what no words could express.\u003c/p\u003e\n\u003cp\u003eIt\u0027s not your fault, Stefan. You didn\u0027t do this to her. She did it to herself. Or-it just happened to her, because of what she is. What we are. Running beneath Elena\u0027s thoughts was the memory of how she had attacked Stefan in the woods, and how she had felt when she was racing toward Mr. Smallwood, planning her revenge. It could have been me, she said.\u003c/p\u003e\n\u003cp\u003eNo! You could never become like that.\u003c/p\u003e\n\u003cp\u003eElena didn\u0027t answer. If she had the Power now, what would she do to Katherine?\u003c/p\u003e\n\u003cp\u003eWhat wouldn\u0027t she do to her? But she knew it would only upset Stefan more to talk about it.\u003c/p\u003e\n\u003cp\u003eI thought Damon was going to betray us, she said.\u003c/p\u003e\n\u003cp\u003eI did, too, said Stefan queerly. He was looking at his brother with an odd expression.\u003c/p\u003e\n\u003cp\u003eDo you still hate him?\u003c/p\u003e\n\u003cp\u003eStefan\u0027s gaze darkened. No, he said quietly. No, I don\u0027t hate him anymore. Elena nodded. It was important, somehow. Then she started, her nerves hyper-alert, as something shadowed the entrance to the crypt. Stefan tensed, too. She\u0027s coming. Elena- I love you, Stefan, Elena said hopelessly, as the misty white shape hurtled down. Katherine took form in front of them.\u003c/p\u003e\n\u003cp\u003eOf course, thought Elena. How could I have been so stupid? Damon rode with us\u003c/p\u003e\n\u003cp\u003ein Alaric\u0027s car over the river. He crossed running water then, and probably lots of other times. He couldn\u0027t have been the Other Power.\u003c/p\u003e\n\u003cp\u003eIt was strange how she could think even though she was so frightened. It was as if one part of her mind stood watching from a distance.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to kill you now,\" Katherine said conversationally. \"Then I\u0027m going under the river to kill your friends. I don\u0027t think the dogs have done it yet. But I\u0027ll take care of it myself.\"\u003c/p\u003e\n\u003cp\u003e\"Let Elena go,\" said Stefan. His voice was quenched but compelling all the same.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t decided how to do it,\" said Katherine, ignoring him. \"I might roast you. There\u0027s almost enough light for that now. And I\u0027ve got these.\" She reached down the front of her gown and brought her closed hand out. \"One-two-three!\" she said, dropping two silver rings and a gold one onto the ground. Their stones shone blue as Katherine\u0027s eyes, blue as the stone in the necklace at Katherine\u0027s throat.\u003c/p\u003e\n\u003cp\u003eElena\u0027s hands twisted frantically and she felt the smooth bareness of her ring finger. It was true. She wouldn\u0027t have believed how naked she felt without that circlet of metal. It was necessary to her life, to her survival. Without it-\u003c/p\u003e\n\u003cp\u003e\"Without these you\u0027ll die,\" Katherine said, scuffing the rings carelessly with the toe of one foot. \"But I don\u0027t know if that\u0027s slow enough.\" She paced back almost to the far wall of the crypt, her silver dress shimmering in the dim light.\u003c/p\u003e\n\u003cp\u003eIt was then that the idea came to Elena.\u003c/p\u003e\n\u003cp\u003eShe could move her hands. Enough to feel one with the other, enough to know that they weren\u0027t numb anymore. The ropes were looser.\u003c/p\u003e\n\u003cp\u003eBut Katherine was strong. Unbelievably strong. And faster than Elena, too. Even if Elena got free she would have time for only one quick act.\u003c/p\u003e\n\u003cp\u003eShe rotated one wrist, feeling the ropes give.\u003c/p\u003e\n\u003cp\u003e\"There are other ways,\" Katherine said. \"I could cut you and watch you bleed. I like watching.\"\u003c/p\u003e\n\u003cp\u003eGritting her teeth, Elena exerted pressure against the rope. Her hand was bent at an excruciating angle, but she continued to press. She felt the burn of the rope slipping aside.\u003c/p\u003e\n\u003cp\u003e\"Or rats,\" Katherine was saying pensively. \"Rats could be fun. I could tell them when to start and when to stop.\"\u003c/p\u003e\n\u003cp\u003eWorking the other hand free was much easier. Elena tried to give no sign of what was going on behind her back. She would have liked to call to Stefan with her mind, but she didn\u0027t dare. Not if there was any chance Katherine might hear.\u003c/p\u003e\n\u003cp\u003ebut she didn\u0027t dare. Not if there was any chance Katherine might hear.\u003c/p\u003e\n\u003cp\u003eThere was a rectangle of gray light on the floor. Dawn light. It was coming in through the crypt\u0027s opening. Katherine had already been out in that light. But...\u003c/p\u003e\n\u003cp\u003eKatherine smiled suddenly, her blue eyes sparkling. \"I know! I\u0027ll drink you almost up and make you watch while I kill her! I\u0027ll leave you just enough strength so you see her die before you do. Doesn\u0027t that sound like a good plan?\" Blithely, she clapped her hands and pirouetted again, dancing away.\u003c/p\u003e\n\u003cp\u003eJust one more step, thought Elena. She saw Katherine approach the rectangle of light. Just one more step...\u003c/p\u003e\n\u003cp\u003eKatherine took the step. \"That\u0027s it, then!\" She started to turn around. \"What a good-\"\u003c/p\u003e\n\u003cp\u003eNow!\u003c/p\u003e\n\u003cp\u003eYanking her cramped arms out of the last loops of rope, Elena rushed her. It was like the rush of a hunting cat. One desperate sprint to reach the prey. One chance. One hope.\u003c/p\u003e\n\u003cp\u003eShe struck Katherine with her full weight. The impact knocked them both into the rectangle of light. She felt Katherine\u0027s head crack against the stone floor.\u003c/p\u003e\n\u003cp\u003eAnd felt the searing pain, as if her own body had been plunged into poison. It was a feeling like the burning dryness of hunger, only stronger. A thousand times stronger. It was unbearable.\u003c/p\u003e\n\u003cp\u003e\"Elena!\" Stefan screamed, with mind and voice.\u003c/p\u003e\n\u003cp\u003eStefan, she thought. Beneath her Power surged as Katherine\u0027s stunned eyes focused. Her mouth twisted with rage, fangs bursting forth. They were so long they cut into the lower lip. That distorted mouth opened in a howl.\u003c/p\u003e\n\u003cp\u003eElena\u0027s clumsy hand fumbled at Katherine\u0027s throat. Her fingers closed on the cool metal of Katherine\u0027s blue necklace. With all her strength, she wrenched and felt the chain give way. She tried to clasp it, but her fingers felt thick and uncoordinated and Katherine\u0027s clawing hand scrabbled at it wildly. It spun away into the shadows.\u003c/p\u003e\n\u003cp\u003e\"Elena!\" Stefan called again in that dreadful voice.\u003c/p\u003e\n\u003cp\u003eShe felt as if her body were filled with light. As if she were transparent. Only, light was pain. Beneath her, Katherine\u0027s warped face was looking up directly into the winter sky. Instead of a howl, there was a shrieking that went up and up.\u003c/p\u003e\n\u003cp\u003eElena tried to lift herself off, but she didn\u0027t have the strength. Katherine\u0027s face was rifting, cracking open. Lines of fire opened in it. The screaming reached a crescendo. Katherine\u0027s hair was aflame, her skin was blackening. Elena felt fire from both above and below.\u003c/p\u003e\n\u003cp\u003eShe saw Stefan\u0027s arms, red where they had been exposed to the sun and bleeding where he had torn free of his ropes. She saw his face, saw the stricken horror and grief. Then her eyes blurred and she saw nothing.\u003c/p\u003e\n\u003cp\u003eMeredith and Robert, striking at the blood-soaked muzzles that thrust through the hole in the door, paused in confusion. The teeth had stopped snapping and tearing. One muzzle jerked and slid out of the way. Edging sideways to look at the other, Meredith saw that the dog\u0027s eyes were glazed and milky. They didn\u0027t move. She looked at Robert, who stood panting.\u003c/p\u003e\n\u003cp\u003eThere was no more noise from the cellar. Everything was silent.\u003c/p\u003e\n\u003cp\u003eBut they didn\u0027t dare to hope.\u003c/p\u003e\n\u003cp\u003eVickie\u0027s demented shrieking stopped as if it had been cut with a knife. The dog, which had sunk its teeth into Matt\u0027s thigh, stiffened and gave a convulsive shudder; then, its jaws released him. Gasping for breath, Bonnie swung to look beyond the dying fire. There was just enough light to see bodies of other dogs lying where they had fallen outside.\u003c/p\u003e\n\u003cp\u003eShe and Matt leaned on each other, looking around, bewildered.\u003c/p\u003e\n\u003cp\u003eIt had finally stopped snowing.\u003c/p\u003e\n\u003cp\u003eSlowly, Elena opened her eyes.\u003c/p\u003e\n\u003cp\u003eEverything was very clear and calm.\u003c/p\u003e\n\u003cp\u003eShe was glad the shrieking was over. That had been bad; it had hurt. Now, nothing hurt. She felt as if her body were filled with light again, but this time there was no pain. It was as if she were floating, very high and easy, on wafts of air. She almost felt she didn\u0027t have a body at all.\u003c/p\u003e\n\u003cp\u003eShe smiled.\u003c/p\u003e\n\u003cp\u003eTurning her head didn\u0027t hurt, although it increased the loose, floating feeling. She saw, in the oblong of pale light on the floor, the smoldering remains of a silvery dress. Katherine\u0027s lie of five hundred years ago had become the truth.\u003c/p\u003e\n\u003cp\u003eThat was that, then. Elena looked away. She didn\u0027t wish anyone harm now, and she didn\u0027t want to waste time on Katherine. There were so many more important things.\u003c/p\u003e\n\u003cp\u003e\"Stefan,\" she said and sighed, and smiled. Oh, this was nice. This must be how a bird felt.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t mean for things to turn out this way,\" she said, softly rueful. His green eyes were wet. They filled again, but he returned her smile.\u003c/p\u003e\n\u003cp\u003e\"I know,\" he said. \"I know, Elena.\"\u003c/p\u003e\n\u003cp\u003eIt seemed to her that it had been a long while since she\u0027d really looked at him.\u003c/p\u003e\n\u003cp\u003eSince she\u0027d taken time to appreciate how beautiful he was, with his dark hair and his eyes as green as oak leaves. But she saw it now, and she saw his soul shining through those eyes. It was worth it, she thought. I didn\u0027t want to die; I don\u0027t want to now. But I\u0027d do it all over again if I had to.\u003c/p\u003e\n\u003cp\u003e\"I love you,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"I love you,\" he said, squeezing their joined hands.\u003c/p\u003e\n\u003cp\u003eThe strange, languorous lightness cradled her gently. She could scarcely feel Stefan holding her.\u003c/p\u003e\n\u003cp\u003eShe would have thought she\u0027d be terrified. But she wasn\u0027t, not as long as Stefan was there.\u003c/p\u003e\n\u003cp\u003e\"The people at the dance-they\u0027ll be all right now, won\u0027t they?\" she said.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll be all right now,\" Stefan whispered. \"You saved them.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t get to say good-bye to Bonnie and Meredith. Or Aunt Judith. You have to tell them I love them.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell them,\" Stefan said.\u003c/p\u003e\n\u003cp\u003e\"You can tell them yourself,\" panted another voice, hoarse and unused sounding.\u003c/p\u003e\n\u003cp\u003eDamon had pulled himself across the floor behind Stefan. His face was ravaged, streaked with blood, but his dark eyes burned at her. \"Use your will, Elena. Hold on. You have the strength-\"\u003c/p\u003e\n\u003cp\u003eShe smiled at him, waveringly. She knew the truth. What was happening was only finishing what had been started two weeks ago. She\u0027d had thirteen days to get things straight, to make amends with Matt and say good-bye to Margaret. To tell Stefan she loved him. But now the grace period was up.\u003c/p\u003e\n\u003cp\u003eStill, there was no point in hurting Damon. She loved Damon, too. \"I\u0027ll try,\" she promised.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll take you home,\" he said.\u003c/p\u003e\n\u003cp\u003e\"But not yet,\" she told him gently. \"Let\u0027s wait just a little while.\" Something happened in the fathomless black eyes, and the burning spark went out. Then she saw that Damon knew, too.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not afraid,\" she said. \"Well-only a little.\" A drowsiness had started, and she felt very comfortable, but as if she were falling asleep. Things were drifting away from her.\u003c/p\u003e\n\u003cp\u003eAn ache rose in her chest. She was not much afraid, but she was sorry. There\u003c/p\u003e\n\u003cp\u003ewere so many things she would miss, so many things she wished she had done.\u003c/p\u003e\n\u003cp\u003e\"Oh,\" she said softly. \"How funny.\"\u003c/p\u003e\n\u003cp\u003eunderground room. Only this was a doorway into a different light.\u003c/p\u003e\n\u003cp\u003e\"How beautiful,\" she murmured. \"Stefan? I\u0027m so tired.\"\u003c/p\u003e\n\u003cp\u003e\"You can rest now,\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t let go of me?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Then I won\u0027t be afraid.\"\u003c/p\u003e\n\u003cp\u003eSomething was shining on Damon\u0027s face. She reached toward it, touched it, and lifted her fingers away in wonder.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be sad,\" she told him, feeling the cool wetness on her fingertips. But a pang of worry disturbed her. Who was there to understand Damon now? Who would be there to push him, to try to see what was really inside him? \"You have to take care of each other,\" she said, realizing it. A little strength came back to her, like a candle flaring in the wind. \"Stefan, will you promise? Promise to take care of each other?\"\u003c/p\u003e\n\u003cp\u003e\"I promise,\" he said. \"Oh, Elena...\"\u003c/p\u003e\n\u003cp\u003eWaves of sleepiness were overcoming her. \"That\u0027s good,\" she said. \"That\u0027s good, Stefan.\"\u003c/p\u003e\n\u003cp\u003eThe doorway was closer, so close she could touch it now. She wondered if her parents were somewhere behind it.\u003c/p\u003e\n\u003cp\u003e\"Time to go home,\" she whispered.\u003c/p\u003e\n\u003cp\u003eAnd then the darkness and the shadows faded and there was nothing but light. Stefan held her while her eyes closed. And then he just held her, the tears he\u0027d been keeping back falling without restraint. It was a different pain than when he\u0027d pulled her out of the river. There was no anger in this, and no hatred, but a love that seemed to go on and on forever.\u003c/p\u003e\n\u003cp\u003eIt hurt even more.\u003c/p\u003e\n\u003cp\u003eHe looked at the rectangle of sunlight, just a step or two away from him. Elena had gone into the light. She\u0027d left him here alone.\u003c/p\u003e\n\u003cp\u003eNot for long, he thought.\u003c/p\u003e\n\u003cp\u003eHis ring was on the floor. He didn\u0027t even glance at it as he rose, his eyes on the shaft of sunlight shining down.\u003c/p\u003e\n\u003cp\u003eA hand grabbed his arm and pulled him back.\u003c/p\u003e\n\u003cp\u003eStefan looked into his brother\u0027s face.\u003c/p\u003e\n\u003cp\u003eDamon\u0027s eyes were dark as midnight, and he was holding Stefan\u0027s ring. As Stefan watched, unable to move, he forced the ring onto Stefan\u0027s finger and released him.\u003c/p\u003e\n\u003cp\u003eyours, too. Take it. Take it and go.\" He turned his face away.\u003c/p\u003e\n\u003cp\u003eStefan gazed at the golden circlet in his palm for a long time.\u003c/p\u003e\n\u003cp\u003eThen his fingers closed over it and he looked back at Damon. His brother\u0027s eyes were shut, his breathing labored. He looked exhausted and in pain.\u003c/p\u003e\n\u003cp\u003eAnd Stefan had made a promise to Elena.\u003c/p\u003e\n\u003cp\u003e\"Come on,\" he said quietly, putting the ring in his pocket. \"Let\u0027s get you some place where you can rest.\"\u003c/p\u003e\n\u003cp\u003eHe put an arm around his brother to help him up. And then, for a moment, he just held on. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vampire-diaries-the-fury-the-vampire-diaries-3/page-15.html","bookId":2033,"creation":"Oct 5, 2019 11:25:34 PM","modification":"Oct 5, 2019 11:25:34 PM"}
