{"id":68726,"no":10,"title":"Page 10","content":"\u003cp\u003e“I only canceled the one time.”\u003c/p\u003e\n\u003cp\u003e“You said you’d make the next appointment but you didn’t.”\u003c/p\u003e\n\u003cp\u003eHe glanced down at the table. “I—I’ll go. No more excuses. I’ll do whatever it takes to bring you home.”\u003c/p\u003e\n\u003cp\u003eRachel reached across the table and squeezed his hand. “That’s a start.”\u003c/p\u003e\n\u003cp\u003e“But I can tell you right now that Jolene won’t go,” Bruce continued. “And I don’t know how to get her to agree.”\u003c/p\u003e\n\u003cp\u003e“Still, a trained professional can teach us how to deal with her.”\u003c/p\u003e\n\u003cp\u003eBruce frowned. “You really believe that?”\u003c/p\u003e\n\u003cp\u003e“Of course. Don’t you?”\u003c/p\u003e\n\u003cp\u003eHe held her look for a long moment, then shook his head. “I’ll go because it’s what you want, but I don’t hold out a lot of hope that someone neither of us knows is going to help in this situation.”\u003c/p\u003e\n\u003cp\u003e“In other words, you think counseling is a waste of time?” She spoke slowly, letting him know how much his comment discouraged her.\u003c/p\u003e\n\u003cp\u003e“The thing is, Rachel, if Jolene begs off, which she already said she intends to do, what will we get out of counseling?”\u003c/p\u003e\n\u003cp\u003eSometimes Rachel had to wonder which one of those two was the parent. Bruce had more or less told her everything she needed to hear. Without even sipping her coffee or taking a bite of the pie, Rachel slid out of the booth. What was a waste of time was meeting Bruce. Despite what he’d said, nothing had changed, nor would it. Bruce just wanted their lives to go back to what he thought of as “normal”—the way they’d been this past year. But Rachel would no longer tolerate Jolene’s behavior toward her.\u003c/p\u003e\n\u003cp\u003e“Where are you going?” Bruce asked, standing, too. He grabbed for her hand as if to stop her.\u003c/p\u003e\n\u003cp\u003e“All you care about is talking me into moving back home, and you’ll say whatever it takes. Sweeping our problems under the carpet isn’t going to work.”\u003c/p\u003e\n\u003cp\u003e“I said I’d go to counseling,” Bruce insisted.\u003c/p\u003e\n\u003cp\u003eRachel was sure he’d attend one or two sessions, but then he’d find some excuse to cancel. Jolene would simply refuse to go, and Bruce would be powerless to make her. Rachel wasn’t willing to accept half measures. When and if she moved back home, their circumstances had to be completely different.\u003c/p\u003e\n\u003cp\u003e“Don’t leave, Rachel. Please.”\u003c/p\u003e\n\u003cp\u003e“It was pointless for us to talk,” she said, tugging her hand free.\u003c/p\u003e\n\u003cp\u003e“I don’t understand what you want. I’ve offered to go to counseling and that’s not good enough. So what do you want?” he demanded, irritated now.\u003c/p\u003e\n\u003cp\u003e“I want my husband to be a man who honors my place in his life. A man who doesn’t allow his children to dictate what goes on in his household. A man who’ll cherish his role and mine—and frankly, at this moment, you aren’t that man. And I don’t know if you ever will be.”\u003c/p\u003e\n\u003cp\u003eBruce blanched. “Don’t hold back,” he muttered sarcastically. “See how deep you can cut me. I came here hoping you’d be reasonable, hoping to convince you of my love… .”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “You know what, Bruce? I don’t think it’s a good idea for us to talk again.”\u003c/p\u003e\n\u003cp\u003e“Fine. All I ask is that you let me know when the baby’s born.”\u003c/p\u003e\n\u003cp\u003e“Of course I will, but until then I’d appreciate it if you stayed out of my life.”\u003c/p\u003e\n\u003cp\u003eAnger flashed in his eyes. “You don’t mean that.”\u003c/p\u003e\n\u003cp\u003eWhile it was true that she might have a change of heart, right now she was dead serious. “I do mean it.”\u003c/p\u003e\n\u003cp\u003eAnd with that, Rachel walked out of the restaurant.\u003c/p\u003e\n\u003cp\u003eShe didn’t sleep well that night or the next. Thursday afternoon she was with a client when she saw Bruce standing outside the salon. She turned her back, ignoring him.\u003c/p\u003e\n\u003cp\u003eJane walked over to her and whispered, “Bruce is here.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“He wants to speak to you.”\u003c/p\u003e\n\u003cp\u003eRachel shook her head. Talking to Bruce wouldn’t help either of them. How many times were they supposed to repeat the same argument?\u003c/p\u003e\n\u003cp\u003e“Rachel, he’s only going to show up again and again. This is disruptive to you and to everyone here. I told you I didn’t want him back.”\u003c/p\u003e\n\u003cp\u003e“I know. I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Do you want me to call security?”\u003c/p\u003e\n\u003cp\u003eHaving Bruce escorted from the mall was further than she was willing to go. “No. I’ll talk to him.” Setting the curling iron aside, and excusing herself to her client, Rachel stepped outside, where Bruce stood waiting.\u003c/p\u003e\n\u003cp\u003eHe’d buried his hands in his pockets and shuffled his feet back and forth like a schoolboy called before the principal. “I didn’t feel good about how our conversation ended the other night.”\u003c/p\u003e\n\u003cp\u003eIt had bothered Rachel, too, although she had no idea how to change anything.\u003c/p\u003e\n\u003cp\u003e“Won’t you please just come home?”\u003c/p\u003e\n\u003cp\u003e“No.” She hated to be so inflexible, but she didn’t have any choice. “I told you before and I meant it—I don’t want to talk about this anymore. I don’t want to see you, Bruce. It only upsets me.”\u003c/p\u003e\n\u003cp\u003e“I can’t stay away, Rachel. I’ve tried but I can’t make myself do it.”\u003c/p\u003e\n\u003cp\u003e“In other words, you’re determined to hound me.” Thank goodness she’d had the sense not to tell anyone where she was living, not even Teri.\u003c/p\u003e\n\u003cp\u003e“I want you back.”\u003c/p\u003e\n\u003cp\u003eApparently he intended to wear down her defenses until he got what he wanted. It sounded as if he planned to wait outside the salon every day until she moved back to Yakima Street. For her, the problem with that was twofold. First, Jane didn’t want him hanging around, and second, Rachel feared that in time he would wear her down to the point that she’d agree.\u003c/p\u003e\n\u003cp\u003e“Leave me alone, Bruce.”\u003c/p\u003e\n\u003cp\u003e“I can’t,” he whispered. “I love you.”\u003c/p\u003e\n\u003cp\u003eShe longed to believe they could make their marriage work. For her sake and for the baby’s. But every time she felt herself weakening, all she had to do was picture Jolene’s face, mocking her with that triumphant smile. The girl had won, and for Rachel there was no going back.\u003c/p\u003e\n\u003cp\u003e“Don’t come here again, Bruce. I’m warning you, if you do Jane will ask security to step in.”\u003c/p\u003e\n\u003cp\u003e“Fine, if that’s what it takes to talk to you, then I’ll gladly let them arrest me.”\u003c/p\u003e\n\u003cp\u003eRachel didn’t respond to his comment and returned to the salon. She wasn’t sure how long Bruce stood there; she did her best not to look in his direction.\u003c/p\u003e\n\u003cp\u003eAt quitting time, Jane asked the security guard to walk Rachel to her car. While she felt a bit ridiculous, she was grateful to be spared the risk of yet another confrontation with Bruce.\u003c/p\u003e\n\u003cp\u003eOnce she got home, to the house she shared with Nate Olsen, she opened a can of tomato soup and had that and a few cheese slices for dinner. She wasn’t hungry but she ate because of the baby.\u003c/p\u003e\n\u003cp\u003eNate arrived around seven. Rachel was sitting in the recliner with her feet elevated. She had the television on and was reading a magazine at the same time. She needed as many distractions as she could get.\u003c/p\u003e\n\u003cp\u003eHer housemate took one look at her and frowned. “Bad day?”\u003c/p\u003e\n\u003cp\u003e“You could say that.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eUnsure how much to tell him, she considered what she should say.\u003c/p\u003e\n\u003cp\u003e“Wait.” Nate held up one hand. He sat on the edge of the sofa. “Bruce showed up at work again.”\u003c/p\u003e\n\u003cp\u003eShe nodded, but didn’t divulge the details of their conversation. “Jane isn’t happy about it, either.”\u003c/p\u003e\n\u003cp\u003e“Did he make another scene?”\u003c/p\u003e\n\u003cp\u003e“Not really, but he threatened to show up every day until I change my mind.”\u003c/p\u003e\n\u003cp\u003e“That’s awkward. It’s going to cause problems for you, isn’t it?”\u003c/p\u003e\n\u003cp\u003eShe hadn’t mentioned this part of the conversation to her boss. Jane was already upset with her over what had happened a week earlier.\u003c/p\u003e\n\u003cp\u003e“I might have a solution,” Nate said slowly.\u003c/p\u003e\n\u003cp\u003e“What?” At the moment everything felt hopeless.\u003c/p\u003e\n\u003cp\u003e“A temporary position has been posted at the shipyard,” Nate told her. “One of the clerks just had a baby and she’ll be out for five months. The job requires basic computer and administrative skills. Do you think you might want to apply?”\u003c/p\u003e\n\u003cp\u003eRachel bit her lip. “Would I have any chance of getting the job?”\u003c/p\u003e\n\u003cp\u003e“As good a chance as anyone else.”\u003c/p\u003e\n\u003cp\u003e“Then why not.” Getting on with the shipyard would certainly help her situation. The timing couldn’t have been better. And after the baby was born, she’d have to reassess her options, anyway.\u003c/p\u003e\n\u003cp\u003e“I know someone in HR and I’ll drop off a résumé for you.”\u003c/p\u003e\n\u003cp\u003e“Wow, that would be great! Thank you.”\u003c/p\u003e\n\u003cp\u003eNot surprisingly, the next day after work, Bruce showed up at the salon. Rachel ignored him and after several minutes he left.\u003c/p\u003e\n\u003cp\u003e“Rachel,” Jane whispered in warning. “I don’t want Bruce hanging around here. Can’t you do something?”\u003c/p\u003e\n\u003cp\u003e“I already have.” Booking an extended lunch hour, she’d gone to the shipyard employment office, had an interview and taken a test. She didn’t know how well she’d done but it didn’t seem that difficult.\u003c/p\u003e\n\u003cp\u003eNate was home early that evening, smiling when he walked in the door. “I talked to Becky, my friend in HR,” he said. He put his briefcase down, opened the refrigerator and removed a cold soda. “You got the highest possible score.”\u003c/p\u003e\n\u003cp\u003e“I did? Does that mean they might call me in for another interview? Did you tell her that if she hired me I’d give her a free haircut?”\u003c/p\u003e\n\u003cp\u003eNate laughed. “No, because that might be construed as bribery.”\u003c/p\u003e\n\u003cp\u003eRachel smiled, optimistic for the first time in weeks. Months.\u003c/p\u003e\n\u003cp\u003e“The position will be posted for another couple of days and then Becky will notify the applicant who’s been chosen. You’ll know one way or the other by the end of the week.”\u003c/p\u003e\n\u003cp\u003e“Thanks again, Nate.”\u003c/p\u003e\n\u003cp\u003eHe shrugged off her appreciation. “Anything for a friend.”\u003c/p\u003e\n\u003cp\u003eRachel had a good feeling about this short-term position. It was perfect for her. The shipyard obviously agreed because a few days later Rachel received word that she had the job.\u003c/p\u003e\n\u003cp\u003eEight\u003c/p\u003e\n\u003cp\u003e“Jack, what’s that in your pocket?” Olivia asked, pulling her husband into the hallway that led to their bedroom. He had the grace to look guilty.\u003c/p\u003e\n\u003cp\u003e“Cookies,” he admitted.\u003c/p\u003e\n\u003cp\u003e“Jack,” she moaned. He had to watch his diet carefully, and the cookies and cake Charlotte insisted on baking weren’t part of his low-fat eating program. After seeing Jack through one heart attack and bypass surgery, Olivia had been keeping a close eye on his eating habits. He’d been backsliding recently, since temptation, provided by Charlotte, was ever-present these days.\u003c/p\u003e\n\u003cp\u003e“Your mother baked them especially for me,” Jack said. “I couldn’t hurt her feelings, could I?”\u003c/p\u003e\n\u003cp\u003e“Oh, Jack.” She sighed, and held out her hand. “At least give one of them to me.”\u003c/p\u003e\n\u003cp\u003eHe snorted. “At this rate we’ll both weigh three hundred pounds by the time your mother and Ben are back in their own house.”\u003c/p\u003e\n\u003cp\u003eOlivia had already gained a pound and this cookie wasn’t helping; still, like Jack, she couldn’t resist. \u003c/p\u003e","sourceLink":"https://allnovel.net/1105-yakima-street-cedar-cove-11/page-10.html","bookId":1953,"creation":"Oct 5, 2019 10:10:47 AM","modification":"Oct 5, 2019 10:10:47 AM"}
