{"id":68734,"no":18,"title":"Page 18","content":"\u003cp\u003e“All this trouble with his son over Mary Jo and Noelle has taken its toll. Ben tires so easily these days. He takes a nap every afternoon. A long nap.”\u003c/p\u003e\n\u003cp\u003e“Well, that explains missing the appointment.” He paused. “Every afternoon?”\u003c/p\u003e\n\u003cp\u003e“Yes, and Harry, too. It’s the only time I see the cat. He crawls into Ben’s lap and the two of them snooze away pretty much the whole afternoon, seven days a week. Ben’s mind isn’t as sharp as it once was, either. Mom shows more signs of memory loss, but Ben isn’t far behind.”\u003c/p\u003e\n\u003cp\u003eWill exhaled slowly. “Are you saying you don’t think they should return to the house at all? Not even for the short term?”\u003c/p\u003e\n\u003cp\u003eOlivia nodded regretfully. “I’m afraid Mom might forget to turn off the stove again and next time we might not be so fortunate.”\u003c/p\u003e\n\u003cp\u003e“Who’s going to talk to them about this?” The way he asked implied that he wanted to nominate her.\u003c/p\u003e\n\u003cp\u003e“I thought we should tell them together.”\u003c/p\u003e\n\u003cp\u003e“Okaaay,” he drawled. “Do you have any idea about how to approach them?”\u003c/p\u003e\n\u003cp\u003e“Not yet. I think it might be wise to know exactly where they should move first, don’t you? Or at least have some options to present. We have a list but I haven’t got around to doing anything about it yet.”\u003c/p\u003e\n\u003cp\u003eWill sighed, then nodded. “If you want to make us some appointments, we—”\u003c/p\u003e\n\u003cp\u003eSomeone knocked politely at the office door. Will looked mildly surprised. “Yes?” he called out.\u003c/p\u003e\n\u003cp\u003eMiranda opened the door a few inches. “Excuse me, but Shirley Bliss is here—”\u003c/p\u003e\n\u003cp\u003eWill was instantly on his feet, his face eager. “Shirley’s here?”\u003c/p\u003e\n\u003cp\u003e“With Larry Knight.”\u003c/p\u003e\n\u003cp\u003eWill’s smile faded as quickly as it had come. “She’s with Larry,” he muttered, as if he found the other man’s name distasteful.\u003c/p\u003e\n\u003cp\u003e“They’d like to speak to you for a moment.”\u003c/p\u003e\n\u003cp\u003e“Sure, send them in,” Will said. He remained standing as Miranda ushered Shirley and Larry into the office.\u003c/p\u003e\n\u003cp\u003eWill made introductions; Shirley smiled and Larry shook hands with Olivia.\u003c/p\u003e\n\u003cp\u003e“I hope we’re not interrupting anything important,” Shirley apologized.\u003c/p\u003e\n\u003cp\u003e“It’s fine,” Will said. “Olivia and I were discussing a family matter. What can I do for you?”\u003c/p\u003e\n\u003cp\u003eLarry placed his arm around Shirley’s waist. “We wanted to tell you in person that I’ve asked Shirley to be my wife.”\u003c/p\u003e\n\u003cp\u003eOlivia noticed that Will’s smile looked decidedly forced.\u003c/p\u003e\n\u003cp\u003e“If it wasn’t for you, I never would’ve met Larry.” Shirley held out her left hand and displayed a beautiful solitaire diamond ring.\u003c/p\u003e\n\u003cp\u003e“Have you set the date?” Will asked.\u003c/p\u003e\n\u003cp\u003e“Not yet,” Shirley said.\u003c/p\u003e\n\u003cp\u003e“But it’ll be soon,” Larry added. “I’ve been alone long enough. I want Shirley with me.”\u003c/p\u003e\n\u003cp\u003e“I’m so grateful you asked me to attend that show at the Seattle Art Museum,” Shirley said, her expression radiant. “I almost decided not to go and I’m so glad I did.”\u003c/p\u003e\n\u003cp\u003e“Congratulations,” Olivia told the happy couple. If Will wasn’t going to say it, she would.\u003c/p\u003e\n\u003cp\u003e“Yes, by all means. Congratulations,” Will said.\u003c/p\u003e\n\u003cp\u003e“We’ll be in touch.” Shirley started out the door. “Bye, Will, Olivia.”\u003c/p\u003e\n\u003cp\u003e“Thanks again,” Larry said, turning to follow her out.\u003c/p\u003e\n\u003cp\u003eWill closed the door firmly behind them. “Shirley was my date that afternoon and then Larry swooped in on her and—”\u003c/p\u003e\n\u003cp\u003e“Will,” Olivia said. “What’s your problem? Anyone with eyes can see how much in love they are.”\u003c/p\u003e\n\u003cp\u003e“I know, I know. But I’d hoped Shirley would fall in love with me!”\u003c/p\u003e\n\u003cp\u003e“And why would she do that?” Olivia asked bluntly.\u003c/p\u003e\n\u003cp\u003e“Why? Well, because…”\u003c/p\u003e\n\u003cp\u003e“What do you have in common, other than the fact that you own an art gallery and she’s an artist?”\u003c/p\u003e\n\u003cp\u003e“Isn’t that enough?”\u003c/p\u003e\n\u003cp\u003e“Will, not every woman is going to fall at your feet in adoration.”\u003c/p\u003e\n\u003cp\u003e“Jeez, you sound like Miranda! I happen to like Shirley Bliss.”\u003c/p\u003e\n\u003cp\u003e“And you tried to charm her the way you did with practically every woman you’ve met, whether you were married or not.” That last remark was meant to remind him that he hadn’t been a good husband. He’d cheated on his wife repeatedly, and Olivia didn’t care what his excuses were.\u003c/p\u003e\n\u003cp\u003e“You could’ve gone all day without saying that,” Will snapped. “Okay, so I wasn’t the world’s best husband. I admit it. But my ego just took a major hit, and if I want to whine a bit I should be able to.”\u003c/p\u003e\n\u003cp\u003e“Okay, fine. Be a little boy for a couple of minutes and then get over it.”\u003c/p\u003e\n\u003cp\u003eHe stood and walked over to the cabinet. “How about a glass of wine? I could use a drink.”\u003c/p\u003e\n\u003cp\u003e“Sure. Shall we invite Miranda to join us?” The gallery was closed by now and she was probably waiting.\u003c/p\u003e\n\u003cp\u003eWill shrugged. “I suppose.”\u003c/p\u003e\n\u003cp\u003e“Don’t sound so enthusiastic.”\u003c/p\u003e\n\u003cp\u003e“We don’t get along all that well,” he muttered as he took down a bottle of red wine and three glasses. “She’s a know-it-all, not to mention contradictory.”\u003c/p\u003e\n\u003cp\u003e“Then why do you keep her on?” Olivia asked, finding his attitude amusing. Her brother’s relationship with his assistant fascinated her. They bickered and argued and she couldn’t remember a time that Will had anything good to say about Miranda. And yet he continued to employ her.\u003c/p\u003e\n\u003cp\u003e“I tried to fire her.”\u003c/p\u003e\n\u003cp\u003e“Tried?” Olivia raised one eyebrow.\u003c/p\u003e\n\u003cp\u003e“Yeah. I was completely overwhelmed without her. Two or three days later, I asked her to reconsider and return to work. I could’ve hired someone else, but that would mean training that person, which is a lot of time and trouble.”\u003c/p\u003e\n\u003cp\u003e“Miranda came back, though.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “She seemed almost glad of it, too. The truth is, I don’t really like her. Miranda’s far too bossy. God save me from bossy women.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Well, not all bossy women,” he returned, and broke into a lazy smile. “Not you, my darling sister.”\u003c/p\u003e\n\u003cp\u003eOlivia shook her head and started toward the door. “Before I ask Miranda to join us, are we in agreement that Mom and Ben can’t go back to the house?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“We’ll talk to them together about moving into an assisted-living complex as soon as possible,” she said, summing up their discussion.\u003c/p\u003e\n\u003cp\u003eWill exhaled loudly. “Together? Can’t you tell them and I’ll back you up?” He grinned. “I was hoping we could do this good-cop/bad-cop style and I’d be the good cop.”\u003c/p\u003e\n\u003cp\u003e“No, we’ll present a united front and go from there. Okay?”\u003c/p\u003e\n\u003cp\u003e“Okay, Madame Judge.”\u003c/p\u003e\n\u003cp\u003eOlivia ignored that and opened the door. “Miranda, would you like to have a glass of wine with us? We’re celebrating Shirley and Larry’s engagement.”\u003c/p\u003e\n\u003cp\u003eWill, who was pouring the wine, nearly toppled a glass. He caught it just in time to prevent it from tumbling onto the beige carpet.\u003c/p\u003e\n\u003cp\u003eMiranda came into the room. “You’re happy about Shirley’s news?” she pressed, looking at Will.\u003c/p\u003e\n\u003cp\u003eOlivia could see that the other woman wasn’t easily fooled.\u003c/p\u003e\n\u003cp\u003e“I can boast that I was the one who introduced them,” Will muttered as he passed around the glasses.\u003c/p\u003e\n\u003cp\u003e“It wasn’t going to work out for you, you know.”\u003c/p\u003e\n\u003cp\u003e“Why is it,” Will asked sharply, “that everyone enjoys telling me that? You think I haven’t figured it out by now? But if Larry hadn’t come into the picture, I believe she would’ve ended up with me.”\u003c/p\u003e\n\u003cp\u003eMiranda exchanged a glance with Olivia that said Will was delusional. Olivia recognized, even if her brother didn’t, that he’d never had a chance with Shirley, whether he chose to accept that or not.\u003c/p\u003e\n\u003cp\u003e“You don’t believe me?”\u003c/p\u003e\n\u003cp\u003e“Will, it isn’t that. Let’s enjoy our wine and drop the whole Shirley issue, shall we?” Olivia suggested.\u003c/p\u003e\n\u003cp\u003eIt looked for a moment as if he wasn’t willing to let it go. “Fine. Whatever.”\u003c/p\u003e\n\u003cp\u003eMiranda raised the wineglass to her lips but not before Olivia noticed that she was humming a song from the 1960s. If memory served her right, the first line was “Goin’ to the chapel and we’re gonna get married.” She burst out laughing.\u003c/p\u003e\n\u003cp\u003e“What?” Will demanded.\u003c/p\u003e\n\u003cp\u003e“Nothing,” Olivia said, making an effort to keep her composure. She liked Miranda. In fact, Olivia could see that Will’s assistant was exactly the woman to rein in her brother’s ego and keep him in line.\u003c/p\u003e\n\u003cp\u003ePoor Will. He didn’t have a clue.\u003c/p\u003e\n\u003cp\u003eFourteen\u003c/p\u003e\n\u003cp\u003eMary Jo McAfee set the large pumpkin on the kitchen counter and found a felt pen in the junk drawer. Since this was Noelle’s first Halloween, she was determined to make it special. She already had her daughter’s costume picked out. Noelle would be dressed as a ballerina, complete with pink tutu and tights.\u003c/p\u003e\n\u003cp\u003eNever mind that her baby hadn’t yet taken her first step. Noelle was close, so close, but still clung to the coffee table, bending her chubby legs, longing to explore her world and at the same time hesitant to leave the security of something to hold on to.\u003c/p\u003e\n\u003cp\u003eMary Jo knew everything would change once Noelle decided she could walk. As it was, her daughter was a champion crawler. The nine-month-old loved to travel on all fours, putting anything and everything in her mouth as she progressed from one side of the room to the other. Mary Jo had to be constantly vigilant.\u003c/p\u003e\n\u003cp\u003eThe front door opened and Mack walked in. Mary Jo smiled and held her arms open to him for a hug and kiss. They’d only been married for two months and still felt the sheer wonder of the intimacy they shared.\u003c/p\u003e\n\u003cp\u003eAs soon as she saw him, Noelle raised her arms, seeking his attention.\u003c/p\u003e\n\u003cp\u003e“Come to Daddy,” Mack urged, getting down on his knees a couple of feet from the coffee table.\u003c/p\u003e\n\u003cp\u003eMary Jo held her breath and waited. Noelle glanced at her mother and then at Mack.\u003c/p\u003e\n\u003cp\u003e“Come on, sweetheart,” Mack urged, stretching out his arms.\u003c/p\u003e\n\u003cp\u003eNoelle took one fledgling step and then another before plopping down on the floor. She let out a wail, more in surprise than pain. Mack scooped her up and swung her around, holding her high above his head.\u003c/p\u003e\n\u003cp\u003e“That’s my girl!”\u003c/p\u003e\n\u003cp\u003e“She did it! She did it!” Excited, Mary Jo started waving her arms. Noelle was a week and a half from being ten months old and had taken her first step. “That’s early for her to be walking.”\u003c/p\u003e\n\u003cp\u003e“Way to go,” Mack said as he spread kisses over Noelle’s face. Then balancing her on his hip, he turned back to Mary Jo. “Hey—you got a pumpkin!”\u003c/p\u003e\n\u003cp\u003e“I picked it up on my way home. I thought we’d carve it—actually, I’ll leave the carving to you. I’ll draw what I want and the rest will be in your capable hands.”\u003c/p\u003e\n\u003cp\u003e“And what do I get out of this?” Mack teased.\u003c/p\u003e\n\u003cp\u003e“Oh, I’m sure I’ll come up with some way of rewarding you.”\u003c/p\u003e\n\u003cp\u003eMack wore a silly grin. “I’m sure you will, too.” Sitting, he bounced Noelle on his knee while Mary Jo continued to draw eyes, a nose and a gap-toothed mouth on the pumpkin. After a few minutes, Noelle squirmed, wanting to be put down. Mack set her on the floor and she immediately took off crawling toward her favorite spot in the house, next to the coffee table. She pulled herself up to a standing position, then twisted around to check on her audience. \u003c/p\u003e","sourceLink":"https://allnovel.net/1105-yakima-street-cedar-cove-11/page-18.html","bookId":1953,"creation":"Oct 5, 2019 10:10:47 AM","modification":"Oct 5, 2019 10:10:47 AM"}
