{"id":68752,"no":36,"title":"Page 36","content":"\u003cp\u003e“It looks like you’ve created this intimate little scene before,” he commented as she stirred the pasta.\u003c/p\u003e\n\u003cp\u003e“With the hours I work?” While she was on patrol duty, she’d rotated between swing shift and graveyard. Her nights and days were often reversed. Chad knew that.\u003c/p\u003e\n\u003cp\u003eHer answer seemed to please him. When the timer went off, he took the kettle from the stove and emptied the pasta into the strainer. Then he transferred the hot noodles to a ceramic dish she’d set on the counter. She poured the seafood sauce in its olive oil and fresh herb base over top.\u003c/p\u003e\n\u003cp\u003eChad carried the serving bowl to the table. “This smells fabulous.”\u003c/p\u003e\n\u003cp\u003e“It’s a family favorite,” she said. “Corrie served it several months ago and everyone raved about it.”\u003c/p\u003e\n\u003cp\u003eChad pulled out her chair. “You know, that’s the first time I’ve heard you refer to Corrie and Roy as family.”\u003c/p\u003e\n\u003cp\u003e“It is?” That was how she thought of them now, especially since she’d discovered she was pregnant. While Gloria hadn’t been happy when she learned that her father had told Chad about the baby, in retrospect she was glad of it.\u003c/p\u003e\n\u003cp\u003eChad took the chair across from her. “You seem more comfortable with who you are,” he said thoughtfully.\u003c/p\u003e\n\u003cp\u003eGloria wrapped the noodles around her fork, savoring the scent of basil and oregano. “Yes, I suppose I am.”\u003c/p\u003e\n\u003cp\u003e“Any particular reason?”\u003c/p\u003e\n\u003cp\u003eShe didn’t need to think about her answer. “The baby. Roy and Corrie have been wonderful and Mack, too.” Then, feeling mildly guilty, she added, “That was him on the phone earlier.”\u003c/p\u003e\n\u003cp\u003e“Your brother?”\u003c/p\u003e\n\u003cp\u003eShe took her first taste of the pasta and nodded.\u003c/p\u003e\n\u003cp\u003eChad tried it, too. “Hey, this is good.”\u003c/p\u003e\n\u003cp\u003e“Don’t act so surprised. I can cook.”\u003c/p\u003e\n\u003cp\u003e“Clearly.” He beamed her another of his irresistible smiles.\u003c/p\u003e\n\u003cp\u003eGloria needed every ounce of self-control she possessed to pull her gaze away from him.\u003c/p\u003e\n\u003cp\u003e“More wine?” she asked when she noticed his empty glass.\u003c/p\u003e\n\u003cp\u003e“No, thanks. I’m driving.”\u003c/p\u003e\n\u003cp\u003eThey finished their dinner and carried their plates to the sink.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Chad said as he set down his plate. “That was great.”\u003c/p\u003e\n\u003cp\u003e“Well, you’ve heard the old saying,” she joked. “The way to a man’s heart is through his stomach.”\u003c/p\u003e\n\u003cp\u003eHe shocked her by taking her hand and raising it to his lips. “You already know the way to my heart, Gloria. You always have.”\u003c/p\u003e\n\u003cp\u003eShe could hardly breathe as his eyes held hers. Gloria felt as if her legs were about to collapse. She swayed toward him and his arms went around her, drawing her into his embrace.\u003c/p\u003e\n\u003cp\u003eTheir kiss was magical. Exquisite. Powerful.\u003c/p\u003e\n\u003cp\u003eWhen the baby kicked, Gloria broke off the kiss and hid her face in his shoulder. “Did you feel that?”\u003c/p\u003e\n\u003cp\u003e“I did.” He sounded amused.\u003c/p\u003e\n\u003cp\u003e“I think he likes it when we’re together.”\u003c/p\u003e\n\u003cp\u003e“I know I like it.” Chad’s arms tightened briefly. “But…I need to go.”\u003c/p\u003e\n\u003cp\u003eLooking up, she did her utmost to send him off with a smile. “That’s okay.” She dropped her arms, then retreated a step. “Thank you. For everything.”\u003c/p\u003e\n\u003cp\u003eHe pressed his hand against her face. “I’ll be back to finish the crib next week.”\u003c/p\u003e\n\u003cp\u003e“Sure, anytime.”\u003c/p\u003e\n\u003cp\u003e“Wednesday night?”\u003c/p\u003e\n\u003cp\u003e“That’s perfect. I’ll cook, okay?” He backed away a couple of steps, then rushed forward and kissed her again. By the time he left she was breathless and shaking.\u003c/p\u003e\n\u003cp\u003eAnd happier than she’d been in months.\u003c/p\u003e\n\u003cp\u003eTwenty-Eight\u003c/p\u003e\n\u003cp\u003e“Oh, this is so much fun,” Charlotte said as she linked her arm through Olivia’s. It was a rainy Saturday afternoon and they were visiting local craft fairs.\u003c/p\u003e\n\u003cp\u003eOlivia carefully set her pace to match her mother’s.\u003c/p\u003e\n\u003cp\u003eThe biggest fair was at Cedar Cove High School. “Don’t you just admire how clever people are?” Charlotte asked.\u003c/p\u003e\n\u003cp\u003e“I certainly do,” Olivia said. She pulled up the hood of her raincoat to protect her hair from the drizzle. Still, no weather could have kept her away from the Christmas bazaars. They’d seen a range of crafts and artwork, from quilts and sewing to original paintings, blown glass and jewelry.\u003c/p\u003e\n\u003cp\u003e“I’ve been looking forward to this afternoon.”\u003c/p\u003e\n\u003cp\u003e“Me, too, Mom.” With equal parts anticipation and dread. Will would be joining them later, and together brother and sister would once again bring up the subject of their mother and Ben moving into an assisted-living complex.\u003c/p\u003e\n\u003cp\u003e“I used to enjoy knitting for the charity bazaars,” Charlotte was saying as they moved across the crowded high school parking lot. “I haven’t donated anything in the past few years. I’m not sure why. Time just seems to get away from me.”\u003c/p\u003e\n\u003cp\u003e“It does with all of us,” Olivia said as they walked. They’d both made several purchases, which she carried in a plastic bag draped over her free arm.\u003c/p\u003e\n\u003cp\u003e“Where to next?” Charlotte asked.\u003c/p\u003e\n\u003cp\u003e“Stanford Suites,” Olivia said, trying to sound casual.\u003c/p\u003e\n\u003cp\u003e“Oh? That’s where Bess lives now. She moved there…a little while ago.”\u003c/p\u003e\n\u003cp\u003eOlivia hadn’t heard that, but found the news encouraging. Charlotte had obviously forgotten exactly when Bess Ferryman went to Stanford Suites; however, it must have been recent. “They’re having an early Christmas bazaar, too,” she said. “Some of the seniors have craft items for sale.”\u003c/p\u003e\n\u003cp\u003e“How nice.”\u003c/p\u003e\n\u003cp\u003e“When’s the last time you saw Bess?”\u003c/p\u003e\n\u003cp\u003e“Monday. Bess is still part of the regular knitting group at the Senior Center.”\u003c/p\u003e\n\u003cp\u003eOlivia stopped just short of pointing out that Bess could visit the others whenever she wished, even if she did reside at the retirement complex. She was afraid that if she said too much about it, Charlotte would become suspicious. Olivia had worried about this ever since they’d made the arrangements. All she could hope was that her mother and Ben would be more receptive than they’d been earlier.\u003c/p\u003e\n\u003cp\u003eThe parking lot at Stanford Suites was nearly full.\u003c/p\u003e\n\u003cp\u003e“Look how busy they are,” Charlotte said as they pulled in.\u003c/p\u003e\n\u003cp\u003e“Would you rather skip this and go directly to lunch?” They’d decided to eat at a Mexican place. Her mother was obviously tiring, and so was Olivia. It was only months since she’d finished her chemotherapy and radiation treatments, and fatigue hit her sooner than it used to. And, she had to admit, she was quailing at the prospect of the conversation ahead.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t mind going in,” Charlotte said, “if that’s all right with you.”\u003c/p\u003e\n\u003cp\u003e“I’ll do whatever you want, Mom.”\u003c/p\u003e\n\u003cp\u003e“Then let’s go inside. It’ll be fun to see what kinds of crafts they have for sale. I’ve been looking for a special gift for Ben. He’s so hard to buy for, you know.”\u003c/p\u003e\n\u003cp\u003eThat wasn’t the case with Jack. Books, music, DVDs—he loved them all; she just needed to keep track of what he already had. She’d also taken over purchasing his clothes and even he agreed that was a good thing. Except for his raincoat. She hadn’t been able to convince him to give up that shabby old coat of his. She’d bought a new one, which hung unused in their closet. He said it felt too stiff and insisted there was nothing wrong with his old coat. She knew that eventually he’d start wearing it, but all the hints and suggestions she made were pointless until Jack was ready to switch, and he’d decide that for himself.\u003c/p\u003e\n\u003cp\u003eFunny how thinking about his raincoat made her realize that same approach might work with her mother and Ben, too. In other words, all she should do was mention Stanford Suites, ensure that Ben and Charlotte were aware of the place and its advantages. Pressuring them would only cause resentment and, if anything, make them more resistant.\u003c/p\u003e\n\u003cp\u003eShe drove slowly around the lot. Luck was with her; a car parked close to the front left just as she drew near. Right away Olivia grabbed the empty space. She hurried around to help her mother out of the passenger side, afraid Charlotte might slip on the sidewalk. Ben’s fall had emphasized how vulnerable both of them were.\u003c/p\u003e\n\u003cp\u003e“My, the grounds are nice here,” Charlotte said, glancing at the flower beds. “You know, I feel so bad about neglecting my garden. Ben and I were in the backyard earlier this week. There’s so much we need to do… .”\u003c/p\u003e\n\u003cp\u003e“Jack and I can come over and—”\u003c/p\u003e\n\u003cp\u003e“No, no,” Charlotte said, immediately dismissing the offer even before Olivia could make it. “Ben and I are thinking about hiring a yard service. But I have to tell you, Olivia, the price for goods and services is so high these days.”\u003c/p\u003e\n\u003cp\u003e“Jack and I have a yard service.” In Olivia’s opinion, it was worth every cent. She enjoyed working outdoors, but her spare time was limited. While on medical leave she’d spent hours in her garden, especially after she’d started feeling better and regained some of her strength. Until then, Olivia had forgotten how much pleasure she got from her garden. Jack had helped, too, but it wasn’t something he did for the joy of it. Not like her. He had an ulterior motive. Pulling weeds and preparing the earth, he’d watched her constantly. He’d been terrified that she’d become dizzy or faint or, worse, that she’d collapse.\u003c/p\u003e\n\u003cp\u003eWhen Olivia was diagnosed with breast cancer, Jack had hardly let her out of his sight. If Olivia had ever doubted her husband’s love—and she hadn’t—he’d proved himself a thousand times over while she underwent cancer treatments. And, as a bonus, their garden had benefitted, too.\u003c/p\u003e\n\u003cp\u003eA youngster held the door open as Olivia and Charlotte entered the complex.\u003c/p\u003e\n\u003cp\u003e“Merry Christmas,” he said with a toothless grin.\u003c/p\u003e\n\u003cp\u003e“It’s not even Thanksgiving until next week,” Charlotte said.\u003c/p\u003e\n\u003cp\u003e“But it’s Christmas here,” the young man told them earnestly. “My great-grandma said so.”\u003c/p\u003e\n\u003cp\u003e“Then who are we to argue?” Olivia said as they walked in. The large open room was filled with tables placed in a U-shape for easy access. Bess sat at the second table, her baked goods and knitted items on display.\u003c/p\u003e\n\u003cp\u003e“Charlotte!” she cried. She put down her knitting needles to lean over the table and give her friend a hug. “I’m so glad you came. When I mentioned the bazaar last Monday, you didn’t think you’d be able to stop by.”\u003c/p\u003e\n\u003cp\u003eHer mother hadn’t said anything about the craft show and Olivia assumed Charlotte had simply forgotten, or—another possibility—she hadn’t wanted to give Will and Olivia an opportunity to promote the idea of assisted living.\u003c/p\u003e\n\u003cp\u003e“I’d like to introduce you to my friends,” Bess said, and animatedly waved her arm in the direction of several other women. “This is Eileen, and over here is Rosemary and that’s Eve.” She pointed to the other ladies, who had their own booths. They raised their hands and waved. “I see you met my great-grandson.”\u003c/p\u003e\n\u003cp\u003e“That’s Billy?” Charlotte asked.\u003c/p\u003e\n\u003cp\u003e“He’s eight now. Unbelievable, isn’t it?’\u003c/p\u003e\n\u003cp\u003e“I helped Bess with a sweater pattern when he was two. It had a dinosaur on the front,” Charlotte explained to Olivia. \u003c/p\u003e","sourceLink":"https://allnovel.net/1105-yakima-street-cedar-cove-11/page-36.html","bookId":1953,"creation":"Oct 5, 2019 10:10:47 AM","modification":"Oct 5, 2019 10:10:47 AM"}
