{"id":68757,"no":41,"title":"Page 41","content":"\u003cp\u003e“You’re wrong, I don’t find that hard to believe. I find it impossible to believe.”\u003c/p\u003e\n\u003cp\u003eRather than argue, Linc said, “My point is this. Like you, I’m willing to work hard. I’m ambitious—”\u003c/p\u003e\n\u003cp\u003e“Of course you’re ambitious. That’s the reason you married Lori.”\u003c/p\u003e\n\u003cp\u003e“I married your daughter because I’m in love with her. Lori is the best thing that’s ever happened to me.”\u003c/p\u003e\n\u003cp\u003eBellamy snickered loudly.\u003c/p\u003e\n\u003cp\u003e“All you have against me is that we didn’t wait to get your approval before we married. By your own admission, it’s unlikely you would’ve given it, anyway, so it’s a moot point, right?”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact, it isn’t,” he countered. “And my situation was completely unlike yours. I fell in love with Kate the minute I set eyes on her. When I learned she was from one of the richest families in the state, my heart sank. I was afraid she’d never go out with me.”\u003c/p\u003e\n\u003cp\u003e“But she did.” Now it was Linc’s turn to interrupt and show his father-in-law that he wasn’t completely in the dark. Thanks to Kate, he knew the family history now and had a better grasp of Bellamy’s feelings toward him.\u003c/p\u003e\n\u003cp\u003e“Yes, Kate did accept when I asked her to a school dance.”\u003c/p\u003e\n\u003cp\u003e“You were college juniors.”\u003c/p\u003e\n\u003cp\u003eBellamy stopped and glared at him. Linc might have squirmed under such scrutiny, but instead he smiled pleasantly and waited for Bellamy to continue.\u003c/p\u003e\n\u003cp\u003e“I know darn well when we met,” he said irritably.\u003c/p\u003e\n\u003cp\u003e“How long did you date?”\u003c/p\u003e\n\u003cp\u003e“Five years,” Leonard said, and grew wistful. “I worked three jobs and saved every penny I could.”\u003c/p\u003e\n\u003cp\u003e“And Kate’s father? How did he take to his daughter dating the son of a welder?”\u003c/p\u003e\n\u003cp\u003e“Ambrose and I were…friendly.” He didn’t elaborate beyond that.\u003c/p\u003e\n\u003cp\u003e“In the end, perhaps, but that’s not the way I heard it. Kate said that when you first started seeing each other, her father objected.”\u003c/p\u003e\n\u003cp\u003e“I proved myself to Ambrose and to Kate’s mother, as well.”\u003c/p\u003e\n\u003cp\u003e“So she told me.”\u003c/p\u003e\n\u003cp\u003eHe ignored the reference to Kate.\u003c/p\u003e\n\u003cp\u003e“Five years I waited,” he said, growing morose. “Five torturous years. By the time I married Kate, I’d purchased my first business complex and was saving for a second.”\u003c/p\u003e\n\u003cp\u003e“I’m hoping for the opportunity to prove myself to you,” Linc said. “The way you proved yourself to Kate’s family.” He paused for a moment. “Unfortunately, we started off on the wrong foot, but I’m willing to let bygones be bygones if you are.”\u003c/p\u003e\n\u003cp\u003eBellamy laughed but there was little amusement. “I’ll wait five years to make my decision about you, the same way Ambrose did with me. Five years before he gave me permission to marry Kate.”\u003c/p\u003e\n\u003cp\u003e“Fair enough, although I should tell you that Lori and I plan to have a family by then.”\u003c/p\u003e\n\u003cp\u003eHe ignored the comment.\u003c/p\u003e\n\u003cp\u003e“Kate wanted us to elope,” Leonard murmured. “But I wouldn’t hear of it. I had something to prove to her father first.”\u003c/p\u003e\n\u003cp\u003e“Which you did in spades.”\u003c/p\u003e\n\u003cp\u003e“Don’t try to flatter me, young man.”\u003c/p\u003e\n\u003cp\u003eLinc raised both hands. “No flattery intended.”\u003c/p\u003e\n\u003cp\u003eBellamy relaxed in his chair, hands folded across his middle. “Before he died, Ambrose claimed he couldn’t have chosen a better husband for his daughter.”\u003c/p\u003e\n\u003cp\u003eLinc carefully considered his response. “My hope is that one day you’ll say the same thing about me.”\u003c/p\u003e\n\u003cp\u003eLeonard scowled. “I doubt that will happen.”\u003c/p\u003e\n\u003cp\u003eAgain, Linc didn’t feel it was necessary to argue.\u003c/p\u003e\n\u003cp\u003eShifting in his chair, Bellamy avoided eye contact. “I take it you’ve been talking with Kate.”\u003c/p\u003e\n\u003cp\u003e“Not me so much as Lori.”\u003c/p\u003e\n\u003cp\u003eHe cleared his throat. “How is she?”\u003c/p\u003e\n\u003cp\u003e“Lori or Kate?”\u003c/p\u003e\n\u003cp\u003e“Kate, of course!” he snapped.\u003c/p\u003e\n\u003cp\u003eLinc enjoyed seeing the other man uncomfortable. “Fine, as far as I can tell.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“Have you spoken to her lately?” Linc asked, knowing Bellamy hadn’t.\u003c/p\u003e\n\u003cp\u003e“That’s none of your damned business.”\u003c/p\u003e\n\u003cp\u003e“Right.” Feeling that the conversation had reached a natural end, Linc stood. “I appreciate your taking the time to meet with me, Mr. Bellamy. I trust we understand each other now.”\u003c/p\u003e\n\u003cp\u003eBellamy stood, too. “You still have to prove yourself to me, young man.”\u003c/p\u003e\n\u003cp\u003e“I consider that a personal challenge.”\u003c/p\u003e\n\u003cp\u003e“Good, and if you happen to see…Kate in the next while, would you give her my best?”\u003c/p\u003e\n\u003cp\u003eLinc hesitated on his way out the door. “Doubt me if you will, Mr. Bellamy, but one fact you’ll never be able to dispute is that I love your daughter.”\u003c/p\u003e\n\u003cp\u003e“That remains to be seen, doesn’t it?” He accompanied Linc to the door and opened it for him.\u003c/p\u003e\n\u003cp\u003e“I can tell you right now that if Lori and I had a disagreement that caused her to leave me, I would move heaven and earth to get her back.”\u003c/p\u003e\n\u003cp\u003e“Lori isn’t nearly as stubborn as her mother,” Bellamy barked.\u003c/p\u003e\n\u003cp\u003e“No, I’d say she’s far more like her father in that regard.” With those words, Linc walked out of the office.\u003c/p\u003e\n\u003cp\u003eThirty-Two\u003c/p\u003e\n\u003cp\u003eDad and I painted the baby’s bedroom. The text came on Rachel’s cell phone.\u003c/p\u003e\n\u003cp\u003eRachel texted back. What color?\u003c/p\u003e\n\u003cp\u003eYellow.\u003c/p\u003e\n\u003cp\u003eNice. Her connection with Jolene was still tenuous, although it had vastly improved in the past month. The process of rethinking their relationship was a slow one, but Rachel remained hopeful. So hopeful that she wanted to go home by the new year. January 1 was a symbolic time to start fresh. She hadn’t believed it would happen but now…it seemed possible.\u003c/p\u003e\n\u003cp\u003eJolene continued to see the counselor and seemed to be opening up more to Dr. Jenner. When they’d last spoken, Bruce had said it wouldn’t be long before the three of them could meet as a family. The fact that Jolene was texting her was a good sign.\u003c/p\u003e\n\u003cp\u003eNo sooner had she pushed the send button than her phone rang. Caller ID identified Jolene.\u003c/p\u003e\n\u003cp\u003eRachel answered right away. “Hello, Jolene.”\u003c/p\u003e\n\u003cp\u003e“It’s Bruce.”\u003c/p\u003e\n\u003cp\u003e“Hello, Bruce,” she amended.\u003c/p\u003e\n\u003cp\u003e“Can I see you tonight? Are you busy?”\u003c/p\u003e\n\u003cp\u003eRachel had just gotten home from work and done little more than hang up her coat. “I don’t have anything planned.”\u003c/p\u003e\n\u003cp\u003e“How about dinner?”\u003c/p\u003e\n\u003cp\u003e“That would be fine.” She couldn’t think of any reason to refuse; even if she had, she would’ve accepted his invitation. “Will Jolene be there?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eRachel hesitated. “How does she feel about that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know and I don’t care. This is about us, you and me.”\u003c/p\u003e\n\u003cp\u003eNo, it was about Jolene, too. “Let me talk to her, okay?”\u003c/p\u003e\n\u003cp\u003e“She’s in her room.”\u003c/p\u003e\n\u003cp\u003eWhy would he try to keep her from speaking to his daughter? “Please put her on the phone.”\u003c/p\u003e\n\u003cp\u003eA few anxious minutes passed before Jolene spoke. “You wanted to talk to me?” Her voice was low.\u003c/p\u003e\n\u003cp\u003e“Yeah. Your dad asked me to meet him for dinner.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003e“Lindsey and I are going to a movie later. That’s what we usually do on Friday nights.”\u003c/p\u003e\n\u003cp\u003eRachel could hear Bruce in the background. “What if you and I went out instead?” Rachel suggested. The two of them needed to work on their relationship, rebuild the trust that had vanished.\u003c/p\u003e\n\u003cp\u003e“Dad wouldn’t like that.”\u003c/p\u003e\n\u003cp\u003e“Probably not,” she agreed. “But I think it’s more important for you and me to spend time together than for your father and me to have a night out.”\u003c/p\u003e\n\u003cp\u003eRachel heard Jolene’s sigh. “Dad wants to talk to you, though.”\u003c/p\u003e\n\u003cp\u003e“I’ll see him after I drop you off at the theater.” If he was disappointed about losing out on dinner, she’d bring him something to eat.\u003c/p\u003e\n\u003cp\u003e“Where do you want to go?” Jolene asked, displaying more enthusiasm now.\u003c/p\u003e\n\u003cp\u003e“How about Mexican?” Rachel suggested, knowing that was Jolene’s favorite, too. She couldn’t tolerate spicy food herself at the moment, but she’d order something fairly mild.\u003c/p\u003e\n\u003cp\u003e“Great!”\u003c/p\u003e\n\u003cp\u003eFor a couple of minutes they chatted about what they’d have. “Could you give the phone back to your father?” Rachel asked when they’d finished.\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eA moment later Bruce was on the line. “You’re having dinner with Jolene and not me?” he demanded.\u003c/p\u003e\n\u003cp\u003e“I’ll drop her off at the movies after dinner and then drive over to the house.”\u003c/p\u003e\n\u003cp\u003e“If that’s what you want,” he said, but he didn’t sound pleased by this unexpected turn of events.\u003c/p\u003e\n\u003cp\u003e“If it’ll put you in a better mood, I’ll bring you take-out.”\u003c/p\u003e\n\u003cp\u003e“I doubt anything’s going to put me in a good mood,” he muttered.\u003c/p\u003e\n\u003cp\u003eThis didn’t bode well. “What’s the problem?”\u003c/p\u003e\n\u003cp\u003eHe sighed. “More of the same. We’ll talk when you’re here.”\u003c/p\u003e\n\u003cp\u003eDinner with Jolene had been an inspiration, Rachel decided a little while later. There was a new level of honesty on the girl’s part and traces of the easy affection that used to exist between them. Her stepdaughter talked about seeing the counselor and admitted she’d been jealous of Rachel’s relationship with Bruce. Jolene’s willingness to acknowledge her role in the separation was a huge step forward.\u003c/p\u003e\n\u003cp\u003eJolene looked down at her plate. “Dad wants you to move back home,” she said.\u003c/p\u003e\n\u003cp\u003e“I know.” Rachel pushed aside her own half-eaten bowl of tortilla soup.\u003c/p\u003e\n\u003cp\u003e“Are you going to do it?”\u003c/p\u003e\n\u003cp\u003e“Probably. I hope so. But not yet.”\u003c/p\u003e\n\u003cp\u003e“Dad wants you home before Christmas, so we can be like a real family.”\u003c/p\u003e\n\u003cp\u003eRachel didn’t comment one way or the other.\u003c/p\u003e\n\u003cp\u003e“I’m glad you’re not moving to Portland, Rachel,” Jolene told her.\u003c/p\u003e\n\u003cp\u003eRachel, who’d been fishing inside her purse for her wallet, paused and looked up.\u003c/p\u003e\n\u003cp\u003e“If you left, that would be really hard on Dad…and I would’ve missed you, too.”\u003c/p\u003e\n\u003cp\u003eThis was welcome news. “Do you miss me now?”\u003c/p\u003e\n\u003cp\u003eJolene hung her head. “I didn’t think I would, but I do. Before you and Dad got married, it was just him and me. But you were always there whenever I wanted to talk or do stuff. Everything changed after the wedding. I didn’t like having to share you with him, or share my dad with you. And…well, I felt like the two of you were pushing me aside because all you needed was each other.” She gulped noisily. “I…I hated seeing the two of you all lovey-dovey.”\u003c/p\u003e\n\u003cp\u003eRachel understood why Jolene had reacted the way she had. They’d all contributed to this situation. “Your father wants us to be a family, and I want that, too.”\u003c/p\u003e\n\u003cp\u003e“I know, and now the baby changes everything all over again. The counselor and I talked about that. It helps that he listens and doesn’t tell me I’m bad for feeling like I do.”\u003c/p\u003e\n\u003cp\u003eRachel nodded. “You have to understand your feelings before you can modify them.” \u003c/p\u003e","sourceLink":"https://allnovel.net/1105-yakima-street-cedar-cove-11/page-41.html","bookId":1953,"creation":"Oct 5, 2019 10:10:47 AM","modification":"Oct 5, 2019 10:10:47 AM"}
