{"id":68760,"no":44,"title":"Page 44","content":"\u003cp\u003e“About Joni…”\u003c/p\u003e\n\u003cp\u003eHe kissed her again. “She’ll be fine. Another doctor is crazy about her.”\u003c/p\u003e\n\u003cp\u003eHe said more things, but everything else was lost on Gloria. All she knew was how happy she felt.\u003c/p\u003e\n\u003cp\u003eThirty-Four\u003c/p\u003e\n\u003cp\u003eSunday afternoon, Grace and Cliff Harding were stringing Christmas lights around the roofline of the house. Cliff stood on the ladder while Grace held the lights and kept a careful eye on her husband. Beau was on his leash, which was tied to the porch railing.\u003c/p\u003e\n\u003cp\u003eA car appeared at the head of the long driveway between the two fenced pastures. Cliff’s horses, lazily chewing grass, looked up at the vehicle.\u003c/p\u003e\n\u003cp\u003e“You expecting anyone?” Cliff called down to Grace.\u003c/p\u003e\n\u003cp\u003e“No.” It wasn’t unusual for one of her daughters to stop by without phoning first, but neither of them drove an SUV. “It’s Beth Morehouse’s car,” she told him a moment later.\u003c/p\u003e\n\u003cp\u003e“Has she come for Beau?”\u003c/p\u003e\n\u003cp\u003eGrace had been adamant from day one that she wouldn’t keep the puppy. He gnawed on her shoes and hid Cliff’s socks and he was constantly underfoot. Besides, he insisted on following her everywhere she went.\u003c/p\u003e\n\u003cp\u003e“Grace?” Cliff called again.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” she said. They hadn’t actually set a date for Beth to pick up the puppy. If she’d found a good home for Beau then…great.\u003c/p\u003e\n\u003cp\u003eBeth parked in front of the barn, got out and walked over to them.\u003c/p\u003e\n\u003cp\u003eCliff climbed down the ladder and placed his arm around Grace’s shoulders, as Beau whimpered and barked excitedly.\u003c/p\u003e\n\u003cp\u003e“Hi, Beth,” Grace said. She bent down and scooped up Beau, who’d been busily digging in her flower beds. His paws and face were smeared with dirt.\u003c/p\u003e\n\u003cp\u003e“How about a glass of eggnog?” Cliff suggested. “Grace and I are ready for a break.”\u003c/p\u003e\n\u003cp\u003e“Thank you. I’d enjoy that, but I can’t stay long. I need to get back to the farm. I’ve got a full crew working. I had a couple of errands not far from here, so I thought I’d see if you were home.”\u003c/p\u003e\n\u003cp\u003e“We’re here,” Grace said unnecessarily as she led the way into the house. She stopped in the mudroom off the kitchen, washing Beau’s face and paws and then her own hands, while Cliff took Beth into the kitchen and pulled out a chair.\u003c/p\u003e\n\u003cp\u003e“I’ll get the eggnog,” Cliff said, taking three glasses from the cupboard. “This is Grace’s family recipe.”\u003c/p\u003e\n\u003cp\u003e“You make your own?” Beth asked, turning to look at Grace, who came into the room drying her hands.\u003c/p\u003e\n\u003cp\u003e“It’s pretty simple. I’ll be happy to pass along the recipe if you’d like.”\u003c/p\u003e\n\u003cp\u003e“Yes, I’d love to have it.”\u003c/p\u003e\n\u003cp\u003eAs Cliff carried the filled glasses to the table, Grace brought a plate of sugar cookies she’d baked with her grandchildren the day before.\u003c/p\u003e\n\u003cp\u003e“I take it you’ve come for Beau?” Cliff asked.\u003c/p\u003e\n\u003cp\u003eOn hearing his name the puppy raced over to Grace, stretched up on his hind legs and set his front paws on her knees. He stared at her with such love and warmth that she was forced to look away. Almost against her will she petted his head, and when he whined she couldn’t resist lifting him onto her lap. He licked her hand, then curled up tightly and went immediately to sleep.\u003c/p\u003e\n\u003cp\u003e“Well…actually—”\u003c/p\u003e\n\u003cp\u003e“Do you have a good home for him?” Cliff broke in.\u003c/p\u003e\n\u003cp\u003e“Not exactly.”\u003c/p\u003e\n\u003cp\u003e“Do you have a home for him, period?” Grace pressed. This was her big fear—that Beth had come to depend on her keeping the puppy. Well, that wasn’t going to happen.\u003c/p\u003e\n\u003cp\u003e“The truth is, no. I don’t have a home for Beau.”\u003c/p\u003e\n\u003cp\u003e“No?” Grace cried.\u003c/p\u003e\n\u003cp\u003e“No,” Beth repeated, “and now I have another problem.”\u003c/p\u003e\n\u003cp\u003eGrace and Cliff exchanged a glance. “Concerning Beau?”\u003c/p\u003e\n\u003cp\u003e“No… Well, yes. Indirectly. As you know, I’ve rescued a few dogs and done some training, which I enjoy and seem to have a knack for.”\u003c/p\u003e\n\u003cp\u003eThat was a real understatement. Not only had Beth been her partner in the library reading program, she’d started training dogs to visit with the sick and elderly.\u003c/p\u003e\n\u003cp\u003e“Apparently word’s gotten around that I take in strays. Several people have brought me animals they’ve found or can’t keep and I do what I can to get them good homes but it’s…it’s become overwhelming.” Her voice cracked.\u003c/p\u003e\n\u003cp\u003e“What do you mean? Has something happened?” Grace asked, feeling anxious about Beth’s obvious distress.\u003c/p\u003e\n\u003cp\u003e“Yes. Two totally unrelated and unexpected things. I’m trying to figure out how to handle them. I’m sorry to inflict this on you. It’s just that…it’s all too much.”\u003c/p\u003e\n\u003cp\u003e“Tell us what’s going on,” Grace said gently. She’d never seen her friend so disconcerted.\u003c/p\u003e\n\u003cp\u003e“Well, first, it seems my ex-husband is coming here for Christmas. The girls will be home from college and he asked them if it’s okay to visit and they really want him to.” She sighed. “I could turn him down but not them. Anyway, I talked to the Beldons, and they told me Kent has a reservation at their bed-and-breakfast.”\u003c/p\u003e\n\u003cp\u003eGrace was aware that Beth was divorced but knew nothing of the circumstances.\u003c/p\u003e\n\u003cp\u003eCliff sipped his eggnog, leaving the questions to her.\u003c/p\u003e\n\u003cp\u003e“Is that a problem?” Grace asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” Beth said bluntly. “Kent and I haven’t spoken in three years—well, except when it has to do with the girls. Bailey and Sophie are both away at school, so there hasn’t been much need for us to communicate.”\u003c/p\u003e\n\u003cp\u003eThis was the most personal Beth had ever been, the most she’d revealed about her divorce. Although Grace regarded her as a friend, Beth had never divulged many details about her life prior to Cedar Cove. Grace knew she spent her time with the dogs and running her farm. Her place was one of several in the area that sold live trees. In fact, the address—1225 Christmas Tree Lane—couldn’t have been more appropriate.\u003c/p\u003e\n\u003cp\u003eCliff finally spoke up. “Why did your daughters arrange this?” he asked her.\u003c/p\u003e\n\u003cp\u003e“I’m not sure…. Kent and I have always been civil. It wasn’t a bitter divorce or anything. We just…grew apart. And like I said, we’ve had very little to do with each other since.”\u003c/p\u003e\n\u003cp\u003e“I wonder if the girls have some hope of a reconciliation,” Grace mused, and didn’t realize she’d spoken out loud until she noticed both Cliff and Beth looking at her.\u003c/p\u003e\n\u003cp\u003e“I think it’s a good idea for Kent to stay at the Thyme and Tide,” Beth said, not responding to Grace’s comment. “Really, I couldn’t have him at the house. It…it would be too uncomfortable.”\u003c/p\u003e\n\u003cp\u003e“Yes, I imagine it would.”\u003c/p\u003e\n\u003cp\u003e“When does he arrive?” Grace asked.\u003c/p\u003e\n\u003cp\u003e“The twenty-third… This is all so unexpected—and then there’s Ted.”\u003c/p\u003e\n\u003cp\u003eThe only Ted she knew was the local vet. Considering how often Beth visited him, it made sense that they might have struck up a friendship. She gathered that Ted donated some of his services, since Beth was essentially running a charity.\u003c/p\u003e\n\u003cp\u003e“The vet,” she said, confirming Grace’s assumption. Beth nervously rubbed her hands together. “We’ve sort of been…seeing each other. Nothing serious, though.”\u003c/p\u003e\n\u003cp\u003eGrace couldn’t keep from smiling. She’d hoped for something like this. Ted Reynolds was about Beth’s age, attractive and unfailingly good-humored. Grace and Olivia had half-jokingly commented that Ted’s single status was a waste. There weren’t that many eligible, good-looking men around.\u003c/p\u003e\n\u003cp\u003e“Then this morning…” Beth stared down at the floor. “Remember how I said people have been bringing me dogs?” She drew in a deep breath. “Well, this morning I got a big surprise on my front porch.” She let out her breath. “A basket full of puppies. A large basket.”\u003c/p\u003e\n\u003cp\u003eGrace could feel her pulse accelerate. If Beth had to find homes for a whole litter of puppies, then she wouldn’t be keen to take Beau.\u003c/p\u003e\n\u003cp\u003e“How many puppies?” Cliff asked. “And what breed?”\u003c/p\u003e\n\u003cp\u003e“Ten. And they seem to be black Labs. Or part Lab, anyway.”\u003c/p\u003e\n\u003cp\u003e“Ten puppies?”\u003c/p\u003e\n\u003cp\u003eBeth nodded. “They’re adorable, but ten? How am I ever going to find homes for ten puppies?”\u003c/p\u003e\n\u003cp\u003e“Actually, make that eleven,” Grace murmured.\u003c/p\u003e\n\u003cp\u003e“Eleven?”\u003c/p\u003e\n\u003cp\u003e“Don’t forget, Beau needs a home, too.”\u003c/p\u003e\n\u003cp\u003e“Beau?” Beth’s eyes flew to Cliff.\u003c/p\u003e\n\u003cp\u003eCliff responded with a shrug.\u003c/p\u003e\n\u003cp\u003e“Beau,” Grace repeated. For some time she’d suspected that Beth and Cliff had joined forces against her, and this proved it. Well, they could scheme all they wanted, but they wouldn’t change her mind. The puppy had to go.\u003c/p\u003e\n\u003cp\u003e“But…but didn’t you say something about asking Maryellen and Jon to take Beau?” Beth looked at her with desperate eyes.\u003c/p\u003e\n\u003cp\u003e“I decided against it,” Grace said stiffly.\u003c/p\u003e\n\u003cp\u003e“The thing is,” Cliff explained, “Grace wants Beau to be adopted into a good family. But she doesn’t want him going to one of our children for fear she’ll see him on a regular basis. Because, unwilling though she is to admit it, she loves that dog.”\u003c/p\u003e\n\u003cp\u003e“That is not true,” Grace insisted, but her argument fell on deaf ears. It was all too obvious that neither one believed her.\u003c/p\u003e\n\u003cp\u003eEven Beau’s soft snore sounded more like a snort of disbelief. Seeing him curled up so contentedly on her lap made her realize how far she’d lowered her guard when it came to this puppy.\u003c/p\u003e\n\u003cp\u003e“Fine. I’ll call Maryellen and ask if she’ll take Beau for the kids,” she said, hoping to dispel their skepticism. “Maybe she’ll want him as a Christmas gift.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” Beth said gratefully. She finished her eggnog and brought the empty glass to the sink. “And thanks for the drink. I’ll wait to hear from you about Beau. I apologize if I vented. It’s just that everything seems to be coming down on me at once.”\u003c/p\u003e\n\u003cp\u003e“We completely understand,” Cliff assured her.\u003c/p\u003e\n\u003cp\u003eBeth left a few minutes later and, the second the door closed, Cliff presented Grace with the phone.\u003c/p\u003e\n\u003cp\u003e“What’s that for?”\u003c/p\u003e\n\u003cp\u003e“Aren’t you going to call Maryellen and Jon?” he asked, arching his brows. “The kids are old enough for a puppy. And Jon’s certainly expressed an interest in getting a dog.”\u003c/p\u003e\n\u003cp\u003e“I’ll do it later,” she told him, not ready to make the call. She couldn’t understand why it had to be done right away. “In fact, I think it might be better if we waited until just before Christmas.”\u003c/p\u003e\n\u003cp\u003e“I thought you wanted him to go to his new home as soon as possible.”\u003c/p\u003e\n\u003cp\u003e“Maryellen’s busy,” she said, knowing her daughter’s hectic schedule. “I’ll call her next week.”\u003c/p\u003e\n\u003cp\u003e“Why wait?” Cliff continued to hold out the phone, which only irritated her.\u003c/p\u003e\n\u003cp\u003e“Okay, fine, since it’s so important to you.” She grabbed the receiver and hit speed dial for her oldest daughter.\u003c/p\u003e\n\u003cp\u003eMaryellen answered on the first ring. “Hi, Mom.”\u003c/p\u003e\n\u003cp\u003e“Hi.” She swallowed hard.\u003c/p\u003e\n\u003cp\u003e“What’s up?” \u003c/p\u003e","sourceLink":"https://allnovel.net/1105-yakima-street-cedar-cove-11/page-44.html","bookId":1953,"creation":"Oct 5, 2019 10:10:47 AM","modification":"Oct 5, 2019 10:10:47 AM"}
