{"id":68763,"no":47,"title":"Page 47","content":"\u003cp\u003e“I knew it would.” His in-laws would be fine, and so would he and Lori. Next year and thirty years down the road, he would love Lori as much as Leonard loved Kate.\u003c/p\u003e\n\u003cp\u003eThirty-Six\u003c/p\u003e\n\u003cp\u003eLate on Wednesday afternoon, Will Jefferson and his sister met in the foyer at Stanford Suites. Luckily a unit had become available, and over the weekend they’d moved Charlotte and Ben into their new apartment. The most difficult aspect of the move was deciding which furniture to take. So many pieces were part of their family history.\u003c/p\u003e\n\u003cp\u003e“Mom,” Will had said, “you’ve go to do something with all this dead relatives’ furniture. I have my own stuff—I don’t need it.”\u003c/p\u003e\n\u003cp\u003e“I can’t just get rid of it,” Charlotte had moaned.\u003c/p\u003e\n\u003cp\u003eIn the end, they fit what they could into the small apartment and what didn’t fit was doled out to him, Olivia and Justine, with a few pieces held back for James. That appeared to satisfy Charlotte. All she wanted was to know that those antique sofas and chairs and cabinets would be loved and treasured the way they’d once been. They wouldn’t have the same sentimental value for him or Olivia, but he wouldn’t sell them on eBay, either.\u003c/p\u003e\n\u003cp\u003eA good portion of what hadn’t been allocated was stored in his basement. It could stay there indefinitely as far as Will was concerned. Being single and without children, he hadn’t accumulated a lot of possessions, other than basic furniture, a TV and so on.\u003c/p\u003e\n\u003cp\u003e“You talked to Mom?” Will asked his sister.\u003c/p\u003e\n\u003cp\u003e“I did. She’s doing all right so far.”\u003c/p\u003e\n\u003cp\u003e“And Ben?”\u003c/p\u003e\n\u003cp\u003e“Him, too.”\u003c/p\u003e\n\u003cp\u003eThe transfer of the house on Eagle Crest was a simple matter of a few signatures and a check. The house was in good shape, especially with the new kitchen. Will was happy to return to his childhood home, and even happier to be helping his mother and Ben. He’d come full circle, he mused. He’d lived in this old house during his childhood, and now he was back. With this move came a sense of rightness, of completion. He’d been away from Cedar Cove for most of his adult life, had faltered and failed. He’d disappointed himself. Moving home had given him a fresh start, a new perspective, a chance to become the man he’d always wanted to be.\u003c/p\u003e\n\u003cp\u003eMiranda’s decision to rent his small apartment might not be the best plan, he thought. Will frowned slightly. He had a real love-hate relationship with his assistant. She was an asset to the gallery and he’d come to rely on her knowledge of art and of the community. Half the time he was convinced she couldn’t stand the sight of him. Then she’d do something to throw him off balance—like kissing him. If that wasn’t shocking enough, he’d kissed her, too. And enjoyed it.\u003c/p\u003e\n\u003cp\u003eMiranda Sullivan wasn’t like any of the women he’d been attracted to in the past. Including Shirley… In fact, she was their opposite. That confused him, although he tried not to think about it. Sometimes he and Miranda laughed at the same things; sometimes they had lively discussions. Since they were together practically every day, it was understandable that they’d grown comfortable with each other. They’d developed a mutual respect—and maybe even a fondness.\u003c/p\u003e\n\u003cp\u003e“You’re frowning,” Olivia commented. “Are you worried about Mom?”\u003c/p\u003e\n\u003cp\u003e“No…I was thinking about Miranda.”\u003c/p\u003e\n\u003cp\u003e“She’s still taking the apartment, isn’t she?”\u003c/p\u003e\n\u003cp\u003e“So she said.”\u003c/p\u003e\n\u003cp\u003eHer sister eyed him warily. “Then why the frown?”\u003c/p\u003e\n\u003cp\u003e“No real reason,” he said, dismissing the question. Actually, he’d prefer not to discuss Miranda. It was hard enough to analyze his own feelings about her, let alone explain them to anyone else.\u003c/p\u003e\n\u003cp\u003eAs soon as Charlotte and Ben walked out of the elevator, their mother broke into a huge grin. “I’m so glad you’re both here.”\u003c/p\u003e\n\u003cp\u003e“We arranged this earlier, Mom,” Olivia reminded her as she kissed their mother’s cheek. She caught Will’s eye. Charlotte would continue to suffer memory lapses. The appointment with the gerontologist was in January. Then they’d know the extent of her memory loss and what, if anything, could be done.\u003c/p\u003e\n\u003cp\u003e“But I was talking about the singing. There’ll be home-baked cookies and old-fashioned wassail.”\u003c/p\u003e\n\u003cp\u003e“We have the papers for you to sign, too,” Olivia said. “For the sale of the house.”\u003c/p\u003e\n\u003cp\u003e“Yes, yes, I know, but does that need to be done right away?”\u003c/p\u003e\n\u003cp\u003e“I’d like to get everything in order. It won’t take long, I promise.” Olivia had her briefcase; fortunately, as a lawyer, she was qualified to handle the paperwork.\u003c/p\u003e\n\u003cp\u003eCharlotte looked at Ben. “I don’t want to be late for the singing.”\u003c/p\u003e\n\u003cp\u003e“Your mother has a lovely voice,” Ben told them, as if they weren’t aware of their mother’s talent.\u003c/p\u003e\n\u003cp\u003eHis mother had often sung him to sleep, and it was a memory Will would always hold dear.\u003c/p\u003e\n\u003cp\u003e“The choral group’s asked me to join them,” Charlotte said, obviously pleased by the invitation. “We sing at special events, like this Christmas gathering. We also sing at church services every week right here in the complex.”\u003c/p\u003e\n\u003cp\u003eAs promised, it took only a few minutes to sign the necessary papers, which they did in Charlotte and Ben’s apartment. When they’d finished, Olivia handed him the house keys.\u003c/p\u003e\n\u003cp\u003e“So when’s moving day for you?” she asked on their way out the door an hour later. They’d stayed for cookies and part of the singing but left during the break. Olivia needed to get home, because she and Jack had a social engagement that evening. And Will was eager to start shifting some of his things over to the house. He wasn’t especially happy to be moving in December, but there was no avoiding that. He’d be out of the apartment in time for Miranda to move in January 2.\u003c/p\u003e\n\u003cp\u003eThe gallery was officially closed when Will returned, although Miranda was in the office, going through some invoices.\u003c/p\u003e\n\u003cp\u003e“How did everything go with Charlotte and Ben?” she asked, looking up from the desk.\u003c/p\u003e\n\u003cp\u003e“Great. I even got a few cookies out of the deal and listened to some Christmas songs.”\u003c/p\u003e\n\u003cp\u003eShe grinned. “Lucky you.”\u003c/p\u003e\n\u003cp\u003e“How was the afternoon?”\u003c/p\u003e\n\u003cp\u003e“Pretty good. Better than we expected.”\u003c/p\u003e\n\u003cp\u003e“Excellent.” Then, before he could change his mind, he asked, “Would you like to go to dinner?”\u003c/p\u003e\n\u003cp\u003eShe scowled at the question. “You…and me?”\u003c/p\u003e\n\u003cp\u003e“Why not? I just bought a house. I’m in the mood to celebrate.”\u003c/p\u003e\n\u003cp\u003e“And Shirley’s married.”\u003c/p\u003e\n\u003cp\u003eAt her comment and its implication, Will shook his head. “What does Shirley have to do with anything?”\u003c/p\u003e\n\u003cp\u003e“Nothing, I suppose, except she’s the one you were hot to trot with, not me.”\u003c/p\u003e\n\u003cp\u003eWill couldn’t remember the last time he’d heard that expression and it made him laugh.\u003c/p\u003e\n\u003cp\u003e“You find that amusing?”\u003c/p\u003e\n\u003cp\u003e“Frankly, yes. Hot to trot? Give me a break.” As her eyes narrowed, he quickly added, “Don’t worry, I’m not looking at you as her replacement.”\u003c/p\u003e\n\u003cp\u003e“I should hope not.”\u003c/p\u003e\n\u003cp\u003e“The dinner invitation wasn’t meant as an insult, Miranda. However, considering your reaction, I withdraw the offer.”\u003c/p\u003e\n\u003cp\u003e“That’s just fine.”\u003c/p\u003e\n\u003cp\u003e“Good.” The woman continually sent him mixed messages. He feared he was guilty of sending a few of those himself.\u003c/p\u003e\n\u003cp\u003e“I’ll be leaving, then.”\u003c/p\u003e\n\u003cp\u003e“Yes. Thanks for staying.” He turned his back on her and hung his coat on a peg by the office door. “See you in the morning.”\u003c/p\u003e\n\u003cp\u003e“Right.” She reached for her coat and purse and was gone.\u003c/p\u003e\n\u003cp\u003e“Well, so much for that,” Will muttered. It was probably better not to waste time dining out, but he wasn’t looking forward to dragging boxes from one residence to another.\u003c/p\u003e\n\u003cp\u003eOnce he’d loaded up his car and driven it over to the house, he spent the next half hour unloading. The house had been professionally cleaned and smelled of pine-scented cleanser. His sister had arranged this on his behalf and Will was grateful.\u003c/p\u003e\n\u003cp\u003eStanding in the middle of the living room, hands on his hips, he surveyed the home that was so familiar to him. He’d make it his own, he decided, turn it into a place that suited his adult personality.\u003c/p\u003e\n\u003cp\u003eWalking into the master bedroom that had once belonged to his parents, he had to smile. As a kid a trip into this room usually meant he was due for a walloping by his father. He’d gotten his share of those growing up. Olivia, too, although his father was always much gentler with her than with Will.\u003c/p\u003e\n\u003cp\u003eHe relived other memories as he walked from room to room, feeling a mix of nostalgia and melancholy. This house had been a place of happiness much of the time. His parents had high expectations of him and his sister, but nothing was more important than family. He—\u003c/p\u003e\n\u003cp\u003eThe doorbell chimed, surprising him. He suspected it might be one of the neighbors, coming to check in. No doubt his mother had told everyone in the vicinity that he’d be taking up residence.\u003c/p\u003e\n\u003cp\u003eHe discovered Miranda Sullivan on the porch. She held a bucket of fried chicken in her hand and looked more than a little uncomfortable. “I brought you dinner,” she said, shoving the bucket at him.\u003c/p\u003e\n\u003cp\u003e“You didn’t need to do that.” Her thoughtfulness caught him unawares.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eShe was about to leave when Will stopped her. “Would you care to join me?”\u003c/p\u003e\n\u003cp\u003eShe hesitated and then nodded. “Sure.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid I don’t have much furniture in the house yet.”\u003c/p\u003e\n\u003cp\u003eShe didn’t appear to mind. “I’ve eaten sitting on the ground more than once in my life.”\u003c/p\u003e\n\u003cp\u003e“Me, too.” Although Will couldn’t remember the last time. A picnic, probably, and that would’ve been years ago. He didn’t have much interest in that sort of thing.\u003c/p\u003e\n\u003cp\u003eThey sat in front of the gas fireplace. Will turned it on with the flick of a switch. That was a good thing because he doubted he was capable of building a fire. A lot of years had passed since he was a Boy Scout.\u003c/p\u003e\n\u003cp\u003eThe chicken was delicious. Will didn’t make a habit of eating fried foods so this was a rare treat. The biscuits were good, too, especially drizzled with honey.\u003c/p\u003e\n\u003cp\u003e“What prompted this?” he asked, setting a leg bone aside and reaching for a second piece.\u003c/p\u003e\n\u003cp\u003e“I don’t know… . I was halfway home and trying to figure out what I should do for dinner when—”\u003c/p\u003e\n\u003cp\u003e“When you realized how foolish you’d been to turn down an invitation for a meal with me,” Will finished for her.\u003c/p\u003e\n\u003cp\u003e“No. I thought about you hauling those boxes to the house by yourself and…” She paused and shook her head. “I probably shouldn’t have come.”\u003c/p\u003e\n\u003cp\u003e“I’m glad you did.” And to his astonishment he meant it. Until the doorbell rang, Will had been wrapped up in memories of his childhood and starkly aware that he was alone. His mother had Ben, plus him and his sister. Olivia had Jack, her two children and a handful of grandkids. The reminder that he was by himself, in his sixties and without a family of his own, had left a hollow ache in the pit of his stomach.\u003c/p\u003e\n\u003cp\u003eMiranda polished off a piece of chicken and wiped the grease from her hands with a paper napkin. \u003c/p\u003e","sourceLink":"https://allnovel.net/1105-yakima-street-cedar-cove-11/page-47.html","bookId":1953,"creation":"Oct 5, 2019 10:10:47 AM","modification":"Oct 5, 2019 10:10:47 AM"}
