{"id":68725,"no":9,"title":"Page 9","content":"\u003cp\u003e“That’s low, even for him.” Either she hadn’t heard a word he’d said or she recognized his statement for the lie it was. “This is going to change and it’s going to change right now.” She reached for her purse and yanked out her cell phone, punching a single button.\u003c/p\u003e\n\u003cp\u003e“Lori,” he asked, “who are you phoning?”\u003c/p\u003e\n\u003cp\u003e“Who do you think?” she muttered.\u003c/p\u003e\n\u003cp\u003eLinc stood and circled her waist with his arms. “Lori,” he said again, drawing her close. “Tell me what you’re doing.”\u003c/p\u003e\n\u003cp\u003eShe moved the cell away from her ear. “I’m calling Daddy. And I’m having it out with him.”\u003c/p\u003e\n\u003cp\u003eLinc had seen that look in her eyes only once before and that, too, had been an instance involving her father.\u003c/p\u003e\n\u003cp\u003e“Hello, Helen, this is Lori Wyse. Is my father still in?”\u003c/p\u003e\n\u003cp\u003eHe started to tell Lori that maybe they should discuss this first, but one sharp glance from his wife told him to forget it. She was furious—and determined.\u003c/p\u003e\n\u003cp\u003eA minute later Bellamy got on the phone. “Hi, Daddy,” she said, all sweetness.\u003c/p\u003e\n\u003cp\u003e“Hi, baby girl. If you’re calling, I figure that means you’ve come to your senses and dumped that useless husband of yours.”\u003c/p\u003e\n\u003cp\u003eLinc stood close enough to hear Bellamy’s half of the conversation. At his father-in-law’s comment, his back stiffened. He released Lori, automatically clenching his fists.\u003c/p\u003e\n\u003cp\u003e“No, Daddy, it’s the Bellamys I’m—as you so delicately put it—dumping. For most of my life I’ve cowered in front of you, caving in to your wishes. No more. You’ve gone too far this time. You want to hurt the man I love, the man I married. I won’t stand for that. I won’t! In fact…I never want to hear your name or see you again. You have tried to manipulate me my entire life. Well, I chose to marry Linc. He is my husband and you will stop meddling in our lives. Is that clear?”\u003c/p\u003e\n\u003cp\u003eLeonard Bellamy seemed amused. “You’re talking mighty big for a girl living in an apartment her father owns.”\u003c/p\u003e\n\u003cp\u003e“That’s another thing. Linc and I will be out of here just as soon as we can find another place.”\u003c/p\u003e\n\u003cp\u003eFor once Bellamy didn’t seem quite so sure. “Don’t be hasty….”\u003c/p\u003e\n\u003cp\u003e“No, just the opposite. It’s taken me too long. You’ve done everything you can to ruin my husband, but you don’t know what kind of man he is. He’s going to make it, regardless of what you say or what you do. And as of this minute I am finished with this family.”\u003c/p\u003e\n\u003cp\u003e“What about your mother?”\u003c/p\u003e\n\u003cp\u003e“She’ll have to make her own decision. I’ve made mine, and while I hate to exclude her from my life, I won’t give you access to any part of me or my marriage. If that means never seeing Mom again, then so be it.”\u003c/p\u003e\n\u003cp\u003eBellamy didn’t appear to believe her. “Like I said, you’re talking big now. But you’ll change your mind at the first sign of trouble.”\u003c/p\u003e\n\u003cp\u003e“Will I, Dad? When’s the last time I changed my mind about anything? When’s the last time you convinced me to back down?”\u003c/p\u003e\n\u003cp\u003eHis hesitation was answer enough.\u003c/p\u003e\n\u003cp\u003e“Listen, Lori…”\u003c/p\u003e\n\u003cp\u003e“Goodbye, Daddy,” she said softly, and disconnected. With a hiccuping sigh, Lori dropped her cell phone back inside her purse. Then, as if she’d suddenly realized he was right behind her, she walked into Linc’s embrace and hugged him hard.\u003c/p\u003e\n\u003cp\u003eLinc hugged her back. “I wish you’d talked to me before you did that.” Linc knew what it was like to be without parents. He didn’t fully grasp how important a father and mother could be until he’d lost his own.\u003c/p\u003e\n\u003cp\u003e“You’re the only family I need now.”\u003c/p\u003e\n\u003cp\u003e“Oh, Lori…”\u003c/p\u003e\n\u003cp\u003e“We have to move,” she said. She straightened and rubbed her moist eyes.\u003c/p\u003e\n\u003cp\u003e“Yes, well, that could be a problem,” Linc felt compelled to tell her. He’d known a move was imminent after his last dreadful confrontation with his father-in-law. The problem was, they didn’t have enough funds to make a security deposit, plus the first and last month’s rent. Even with Lori’s salary from a high-end women’s clothing store in Silverdale, they didn’t have the amount they required. Or anything close to it. Her income covered groceries and daily necessities. And the apartment had been rent-free.\u003c/p\u003e\n\u003cp\u003e“Where do you suggest we find a new place when our bank account is hovering around zero?”\u003c/p\u003e\n\u003cp\u003e“What about moving back to Seattle?”\u003c/p\u003e\n\u003cp\u003eLinc had thought of that earlier but he hated the idea of bringing his wife into the same house as his two younger brothers. He enjoyed his privacy and feared Mel and Ned would see Lori as another Mary Jo, expecting her to take care of the cooking and cleaning the way their sister had. Not that he’d allow it to happen.\u003c/p\u003e\n\u003cp\u003e“The commute would be difficult for you.”\u003c/p\u003e\n\u003cp\u003e“I’ll change jobs,” Lori said.\u003c/p\u003e\n\u003cp\u003e“You love your job,” he reminded her.\u003c/p\u003e\n\u003cp\u003eShe nodded. “I’d miss it, but I’ll do whatever I have to.”\u003c/p\u003e\n\u003cp\u003eThey were both silent for a moment. “No matter what it costs, Linc, we have to leave this apartment.”\u003c/p\u003e\n\u003cp\u003eLori was right, and he couldn’t dispute that. The sooner they found a new place, the better.\u003c/p\u003e\n\u003cp\u003eSeven\u003c/p\u003e\n\u003cp\u003eRachel wasn’t sure that seeing Bruce was a good idea. He’d been persistent, however, and after several conversations about it, she’d finally given in. They’d agreed to meet at the Pancake Palace after work. When she arrived, a few minutes late, Bruce’s car was already parked out front; he’d probably shown up right at five. She wondered if he’d told Jolene where he was going, and doubted he had. Bruce liked to keep the peace. After all, he’d let his daughter take charge of his life and their marriage. Rachel was astonished that she’d stuck around as long as she had. The situation was emotionally unhealthy for all three of them.\u003c/p\u003e\n\u003cp\u003eRachel parked several spots down from his car, hesitated for a moment, half tempted to flee, and then locked up. When she entered the restaurant she saw Bruce immediately. He’d chosen a booth facing the door. He smiled as he stood to greet her. Funny how a simple smile could affect her so strongly. She smiled back, accepted his kiss on the cheek and slid into the booth across from him.\u003c/p\u003e\n\u003cp\u003e“Hi,” he said eagerly, his eyes filled with longing. He stretched his arms across the table and clasped her hands as if he needed to touch her. “You look fantastic.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” She’d taken extra care with her hair and makeup, although she tried not to have high expectations about this meeting.\u003c/p\u003e\n\u003cp\u003e“You’re feeling better?” he asked. “No problems with the pregnancy?”\u003c/p\u003e\n\u003cp\u003e“None,” she assured him.\u003c/p\u003e\n\u003cp\u003e“Everything okay at work?”\u003c/p\u003e\n\u003cp\u003eShe nodded. The past five days, following the fiasco at the salon, had been relatively calm. Jane hadn’t been happy with her afterward, and Rachel couldn’t blame her, but fortunately there’d been no further reference to it.\u003c/p\u003e\n\u003cp\u003eOne night recently when she hadn’t been able to sleep, Rachel had gotten up for a glass of milk and found Nate in the kitchen. They’d talked for almost an hour. He’d been sympathetic, although never intrusive. During this conversation with Nate, she’d realized with greater clarity than ever why Bruce acted the way he did. He hated confrontation and would do anything to avoid it. He coped by ignoring conflicts and tension, by wishing them away. He didn’t want to be caught between his wife and his daughter. She couldn’t fault him for preferring to keep the peace, but his approach didn’t work.\u003c/p\u003e\n\u003cp\u003e“You need to look after yourself and the baby,” Bruce was saying.\u003c/p\u003e\n\u003cp\u003eAlicia, the waitress, appeared in her pink uniform with the starched white apron. She automatically poured Bruce a coffee.\u003c/p\u003e\n\u003cp\u003e“Decaf for me,” Rachel told her.\u003c/p\u003e\n\u003cp\u003e“Coming right up. How about a piece of pie to go with that?”\u003c/p\u003e\n\u003cp\u003e“None for me,” Bruce said.\u003c/p\u003e\n\u003cp\u003eAlicia scowled at him. “I wasn’t asking you. She’s the one who could use a little meat on her bones.”\u003c/p\u003e\n\u003cp\u003e“No, thanks,” Rachel said, squelching a smile.\u003c/p\u003e\n\u003cp\u003eAlicia set the coffeepot on the table and started to enumerate the day’s selection of pies. “We got apple, blueberry, coconut cream and peach. The apple’s my favorite but you choose.”\u003c/p\u003e\n\u003cp\u003e“I…” Rachel looked at Bruce, who was grinning from ear to ear, apparently approving of Alicia’s tactics.\u003c/p\u003e\n\u003cp\u003e“Apple, it is,” the waitress announced, picked up the coffeepot and hurried into the kitchen.\u003c/p\u003e\n\u003cp\u003e“She’s almost as bossy as Goldie,” Bruce said, chuckling.\u003c/p\u003e\n\u003cp\u003eGoldie had been at the Pancake Palace forever, while Alicia, who’d started there maybe twenty years ago, was a relative newcomer.\u003c/p\u003e\n\u003cp\u003eActually, a piece of apple pie did sound good. With all this stress—the pregnancy, the separation, the emotional upheaval—Rachel had lost weight she could ill afford to lose.\u003c/p\u003e\n\u003cp\u003eAlicia reappeared with the decaf and a thick slice of apple pie. “Enjoy,” she said.\u003c/p\u003e\n\u003cp\u003e“I will.” Rachel reached for her fork but didn’t try even a bite. She needed to hear what Bruce had to say, why he’d wanted to meet. Clutching the fork, she waited until Alicia was out of earshot. “You asked to see me.”\u003c/p\u003e\n\u003cp\u003e“Yes. It’s time you came home,” Bruce said starkly. “You’re my wife and I love you. You living somewhere else—it’s just plain wrong.” His voice fell. “I worry about you and the baby.”\u003c/p\u003e\n\u003cp\u003eShe knew he meant every word, but nothing about their situation had improved. Judging by the incident at the mall, Jolene was as angry and caustic as ever. Rachel wasn’t wanted nor was she appreciated by her stepdaughter, and her husband wouldn’t deal with the girl’s hostility. Rachel refused to return to an environment that was unhealthy for her and her unborn child.\u003c/p\u003e\n\u003cp\u003e“What’s changed?” she asked. With great precision, she set the fork aside and studied Bruce.\u003c/p\u003e\n\u003cp\u003eHe cupped his mug with both hands and stared down at it. “I have.” He took in a deep breath. “I failed you as a husband by choosing to ignore the obvious. I hoped the two of you would work it out on your own instead of doing what I could to help. If you come back, I promise I won’t let Jolene say or do anything disrespectful.”\u003c/p\u003e\n\u003cp\u003e“Bruce, that isn’t enough. I’m sorry but this isn’t going to be resolved just because you tell Jolene to respect me.” Besides, he might be able to control his daughter while he was in the house, although she doubted it, but there were plenty of times when she and Jolene were alone.\u003c/p\u003e\n\u003cp\u003eHis sigh revealed his impatience. “Okay, tell me exactly what you want.”\u003c/p\u003e\n\u003cp\u003e“I want,” she said emphatically, “to get to the root of the problem and that means seeing a counselor. A family counselor,” she specified. “A professional trained to deal with situations like this.”\u003c/p\u003e\n\u003cp\u003e“Okay.” He drew out the word.\u003c/p\u003e\n\u003cp\u003eHis reluctance was evident. He’d said yes to counseling a little while ago but it was obviously the last thing he wanted. Bruce had never been keen on the idea of pouring out their personal troubles to a stranger. For her part, Jolene had been violently opposed from the first. It was one of the factors that had led to Rachel’s leaving. “I’ve heard that before and nothing happened. I’d make an appointment and you’d find a reason to cancel or forget or—” \u003c/p\u003e","sourceLink":"https://allnovel.net/1105-yakima-street-cedar-cove-11/page-9.html","bookId":1953,"creation":"Oct 5, 2019 10:10:47 AM","modification":"Oct 5, 2019 10:10:47 AM"}
