{"id":66351,"no":26,"title":"Page 26","content":"\u003cp\u003eRuth shrugged and got her book from her economy-size purse. “What you decide is up to you. You’re over twenty-one.”\u003c/p\u003e\n\u003cp\u003e“Way over.” Annie threw herself down on the bed.\u003c/p\u003e\n\u003cp\u003e“Thank you.” Bethanne felt better for having spoken her mind, although she could have done without Annie’s comment.\u003c/p\u003e\n\u003cp\u003eHer daughter plugged in the earbuds to her iPod and lay back, eyes closed.\u003c/p\u003e\n\u003cp\u003eBethanne took a long, hot shower, crawled into bed beside Annie and opened her book. She read late. Both Annie and Ruth were asleep by the time she turned off her light.\u003c/p\u003e\n\u003cp\u003eAlthough it was past midnight and they had every intention of getting an early start in the morning, Bethanne couldn’t sleep. Whenever she closed her eyes, all she could see was Max. Not Grant. Max.\u003c/p\u003e\n\u003cp\u003eHe planned to meet her in Branson. She didn’t know where he was when he got her message. Apparently, close enough to Missouri to get to Branson by the following afternoon. She wondered if Rooster was traveling with him. She didn’t like the thought of him on the road alone, although she understood that was often the case.\u003c/p\u003e\n\u003cp\u003eThe next day when they arrived in Branson, the traffic was worse than Manhattan at rush hour. It took them forty-five minutes just to reach the hotel. Once they were in their room and unpacked, they went downstairs and ate a quick lunch in the hotel’s coffee shop.\u003c/p\u003e\n\u003cp\u003eRuth paid the tab and went to collect the show tickets Annie had ordered for her. While she was away from the table, Bethanne’s cell phone rang. In her eagerness to answer, she dropped her purse and scrambled to retrieve it.\u003c/p\u003e\n\u003cp\u003e“Is that Max?” Annie asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know yet,” she said as she bent down to get her cell from her bag. Caller ID revealed Grant’s name. She pushed the button that would send him directly to voice mail. “It’s your father.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you talk to him?”\u003c/p\u003e\n\u003cp\u003e“I will when I’m ready.”\u003c/p\u003e\n\u003cp\u003e“You’d rather speak to Max?” Annie sounded like a hurt little girl.\u003c/p\u003e\n\u003cp\u003eBethanne put the cell beside her on the table. “Annie, please try to understand. I don’t know what I find so attractive about Max. I wish I did. I’m sorry I’m such a disappointment to you and your grandmother, but I need to do this.”\u003c/p\u003e\n\u003cp\u003e“All right, Mom, have your fun. Dad and I will be waiting for you.”\u003c/p\u003e\n\u003cp\u003eThe call from Max came fifteen minutes later. She and Annie were just finishing their coffee.\u003c/p\u003e\n\u003cp\u003e“Hi,” she said, keenly aware that Annie was listening.\u003c/p\u003e\n\u003cp\u003e“Hi. Where are you?”\u003c/p\u003e\n\u003cp\u003eShe gave him the name of the hotel. “I’m not the most popular person at the moment.”\u003c/p\u003e\n\u003cp\u003e“So you told Grandma and Annie I was meeting you?”\u003c/p\u003e\n\u003cp\u003e“I did,” she admitted.\u003c/p\u003e\n\u003cp\u003e“I thought you didn’t want to see me again,” he commented, obviously amused.\u003c/p\u003e\n\u003cp\u003e“A sensitive man wouldn’t remind me of that.”\u003c/p\u003e\n\u003cp\u003e“I guess that tells you all you need to know about me.”\u003c/p\u003e\n\u003cp\u003eBethanne grinned but her smile faded when she saw Annie scowling at her.\u003c/p\u003e\n\u003cp\u003e“I’ll meet you in the lobby in an hour,” Max said.\u003c/p\u003e\n\u003cp\u003e“I’ll be there.” She closed her phone and then looked at her daughter. “Are you coming?”\u003c/p\u003e\n\u003cp\u003e“Where are you going?” Annie asked, following Bethanne out of the hotel.\u003c/p\u003e\n\u003cp\u003e“Shopping.”\u003c/p\u003e\n\u003cp\u003e“For what?” Annie asked, hurrying to keep up with her. “And shouldn’t we invite Grandma?”\u003c/p\u003e\n\u003cp\u003e“Sure. Give her a call.”\u003c/p\u003e\n\u003cp\u003eBethanne was on a mission. She had an hour to deck herself out in jeans, boots and a Western shirt. If she was going to be in Branson, she intended to look like she belonged here.\u003c/p\u003e\n\u003cp\u003eWith Bethanne and Annie shopping, Ruth stayed in their hotel room alone. She’d made her excuses and was grateful for this time by herself. She sat on the bed and fingered the paper Annie had given her. The paper on which her granddaughter had written down Royce’s phone number. She hadn’t decided what to do.\u003c/p\u003e\n\u003cp\u003eThankfully, neither Bethanne nor Annie had pressured her about contacting him, although both seemed to think she should. Bethanne had said something that made a lot of sense. If she called Royce now, she wouldn’t have that confrontation awaiting her when she arrived and she’d be able to enjoy the rest of the trip.\u003c/p\u003e\n\u003cp\u003eEvery mile that brought her closer to Florida, closer to Royce, increased her anxiety.\u003c/p\u003e\n\u003cp\u003eShe needed to do this—and she didn’t want Bethanne and Annie hearing her conversation. Although she sort of wished someone was with her now to hold her hand, to encourage her and to offer comfort if it went badly. This was really difficult, so much more difficult than she’d ever expected.\u003c/p\u003e\n\u003cp\u003eShe took the hotel phone from the nightstand next to the bed, stretching the cord so she could set it beside her. She smoothed out the slip of paper, running her hand over it two or three times. Finally, she reached for the receiver, following the instructions in order to place a long-distance call.\u003c/p\u003e\n\u003cp\u003eA minute after that, the phone rang at the other end.\u003c/p\u003e\n\u003cp\u003eIt rang again as she held her breath. Again.\u003c/p\u003e\n\u003cp\u003eThen Royce answered. “Hello.”\u003c/p\u003e\n\u003cp\u003eDespite all the years since they’d spoken, she recognized his voice.\u003c/p\u003e\n\u003cp\u003eShe couldn’t speak.\u003c/p\u003e\n\u003cp\u003e“Hello?” he repeated.\u003c/p\u003e\n\u003cp\u003e“Royce?” Somehow she managed to whisper his name.\u003c/p\u003e\n\u003cp\u003e“Yes? Who is this?”\u003c/p\u003e\n\u003cp\u003eHis own voice fell, and Ruth was fairly certain he already knew the answer.\u003c/p\u003e\n\u003cp\u003e“It’s Ruth.” The silence was terrible. “I heard you planned to attend the class reunion,” she said.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I…I thought it was only fair that you know I’ll be there, too. Actually, my daughter-in-law and granddaughter felt I should warn you.” At first, she couldn’t utter a word, and now she couldn’t seem to shut up. “We’re driving across the country…. We’re in Branson and we— Oh, none of that’s important.”\u003c/p\u003e\n\u003cp\u003eThe silence on his end of the line returned and Ruth was convinced she’d made a mistake.\u003c/p\u003e\n\u003cp\u003e“Would you rather I didn’t attend the reunion?” he asked after another long moment.\u003c/p\u003e\n\u003cp\u003e“Oh, no…I mean, yes. I want you there. I’d really hoped we’d have a chance to talk first, though…if you agree.”\u003c/p\u003e\n\u003cp\u003eMore silence. Ruth couldn’t stand the tension.\u003c/p\u003e\n\u003cp\u003eEventually, he spoke. “I think that would be a good idea. Call me when you get into town, okay?”\u003c/p\u003e\n\u003cp\u003e“Yes…I’ll do that.” Her hand squeezed the phone so hard, she thought her fingers might leave indentations.\u003c/p\u003e\n\u003cp\u003e“Ruth?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I’m glad you called.”\u003c/p\u003e\n\u003cp\u003eThe tension between her shoulders eased. “I am, too.”\u003c/p\u003e\n\u003cp\u003eShe replaced the receiver, but her hand lingered on it for several minutes as she considered their short conversation. Already she felt better. Setting the phone back on the nightstand, she nearly collapsed against the pillows.\u003c/p\u003e\n\u003cp\u003eAnnie’s sour mood improved fast, which was due, no doubt, to some old-fashioned retail therapy. Bethanne made her purchases in record time. The two of them returned to the hotel room, their arms loaded with packages.\u003c/p\u003e\n\u003cp\u003eRuth talked to Annie about their shopping excursion as Bethanne hurriedly changed into her new outfit, complete with red cowboy boots. If her friend Anne Marie Roche, the local bookstore owner, could own a pair, then she could, too.\u003c/p\u003e\n\u003cp\u003e“How do I look?” she asked her mother-in-law, twirling around and modeling her new clothes.\u003c/p\u003e\n\u003cp\u003eRuth frowned. “Like Dale Evans.”\u003c/p\u003e\n\u003cp\u003e“Dale who?” Annie asked.\u003c/p\u003e\n\u003cp\u003e“Never mind.” Ruth got her purse. “Come on, Annie, or we’ll be late.”\u003c/p\u003e\n\u003cp\u003e“Late? For what?”\u003c/p\u003e\n\u003cp\u003e“The show. I told you I wanted both of you to see it, and your mother obviously isn’t coming with me. I’ve got three tickets, for heaven’s sake. I have no intention of going alone.” She frowned. “Maybe I can scalp one of them.”\u003c/p\u003e\n\u003cp\u003e“Grandma!” Annie rolled her eyes. “Until yesterday I didn’t even know who this Andy person was.”\u003c/p\u003e\n\u003cp\u003eBethanne didn’t stick around to hear the rest of the conversation. She was out the door before either of them had time to protest. Entering the lobby, she looked around, disappointed to see that Max hadn’t arrived yet. She found a vacant wingback chair by the fireplace, where she sat and waited—but not for long. A few minutes later, the elevator doors slid open and Max and Rooster stepped out.\u003c/p\u003e\n\u003cp\u003eMax looked even better than she remembered. For a moment all Bethanne could do was stare. He didn’t immediately see her, but when he did, a slow smile crossed his face.\u003c/p\u003e\n\u003cp\u003e“Hi,” she said, standing and walking toward him.\u003c/p\u003e\n\u003cp\u003e“Hi.” He met her halfway.\u003c/p\u003e\n\u003cp\u003eBethanne held out her hands to him, and Max took her fingers in his.\u003c/p\u003e\n\u003cp\u003e“I didn’t ride all this way to hold hands,” he said. “I’m desperate for one of those hugs of yours.”\u003c/p\u003e\n\u003cp\u003eShe was equally desperate to give him one, knowing the kisses would come later. As they embraced, she closed her eyes. His arms felt so good around her, so right.\u003c/p\u003e\n\u003cp\u003e“Twenty hours on the bike and all he wants is a hug?” Rooster laughed. “There’s definitely something wrong.”\u003c/p\u003e\n\u003cp\u003e“Twenty hours?” Bethanne asked, breaking away to study him.\u003c/p\u003e\n\u003cp\u003e“We took off the minute he got your message,” Rooster elaborated.\u003c/p\u003e\n\u003cp\u003e“Where were you?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t matter. I’m here now,” Max said, glaring at his friend.\u003c/p\u003e\n\u003cp\u003e“Vegas,” Rooster supplied.\u003c/p\u003e\n\u003cp\u003e“Oh, Max.” She held her palms against his face, wanting more than anything to kiss him. She couldn’t. Not here in the hotel lobby, but soon. Very soon.\u003c/p\u003e\n\u003cp\u003eSeventeen\u003c/p\u003e\n\u003cp\u003e“Daddy,” Annie said the minute she was in her assigned seat at the Moon River Theater. She didn’t appreciate having to attend this show with her grandmother, especially since her mom got out of it. Fortunately, that meant the seat beside her wasn’t occupied. “It’s Annie,” she said, leaning into the empty seat and doing her best to keep her voice down.\u003c/p\u003e\n\u003cp\u003e“Hi, sweetheart. Did you get to Branson okay?”\u003c/p\u003e\n\u003cp\u003e“We made it fine.”\u003c/p\u003e\n\u003cp\u003e“What’s that noise?”\u003c/p\u003e\n\u003cp\u003eAnnie wouldn’t have believed old people could make such a racket. The noise level was as high as a rock concert. Well, maybe not quite as high, but it was up there. She pressed one finger to her other ear.\u003c/p\u003e\n\u003cp\u003e“I’m sitting with Grandma, waiting for Andy Williams to come onstage, but I thought I should call you right away.”\u003c/p\u003e\n\u003cp\u003e“Grandma dragged you with her to see Andy Williams?” He sounded far too amused, in her opinion.\u003c/p\u003e\n\u003cp\u003e“Don’t go there, Dad. Grandma also got tickets for the Twelve Irish Tenors, and she expects me to go to that one, too.” She leaned even farther into the empty seat so Grandma Hamlin wouldn’t hear. This was ridiculous. If she wanted to listen to tenors, she’d attend church services more often.\u003c/p\u003e\n\u003cp\u003eHer father laughed outright.\u003c/p\u003e\n\u003cp\u003e“Dad, this isn’t funny!”\u003c/p\u003e\n\u003cp\u003e“Sorry, sorry.”\u003c/p\u003e\n\u003cp\u003eHe wasn’t nearly as apologetic as he should be.\u003c/p\u003e\n\u003cp\u003e“I’m glad you made it safely to Branson,” he said. “Thanks for the updates on your travels. Otherwise, I’d be worried about the three of you on the road.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-26.html","bookId":1940,"creation":"Oct 5, 2019 10:01:04 AM","modification":"Oct 5, 2019 10:01:04 AM"}
