{"id":66365,"no":40,"title":"Page 40","content":"\u003cp\u003eThey shared an order of fish and fries, for old times’ sake. When their meal was delivered, Grant said, “That wasn’t the only time I was short on cash. Remember the night Andrew was born?”\u003c/p\u003e\n\u003cp\u003eAs if she could ever forget. “What I remember is your panic when I told you I might be in labor. You immediately started doing the breathing exercises I was supposed to do until I thought you were about to hyperventilate.” Bethanne had been afraid they’d have to call an Aid Car for her husband.\u003c/p\u003e\n\u003cp\u003e“What you didn’t know was that I hadn’t paid the doctor everything we owed him and I was worried he wouldn’t deliver the baby without being paid.”\u003c/p\u003e\n\u003cp\u003e“Dr. McMahon never said a word.”\u003c/p\u003e\n\u003cp\u003e“Thank goodness.” Grant slathered a french fry with ketchup and popped it in his mouth.\u003c/p\u003e\n\u003cp\u003e“You so badly wanted a son,” she reminded him.\u003c/p\u003e\n\u003cp\u003e“I did not,” he insisted. “I would’ve been happy with either.”\u003c/p\u003e\n\u003cp\u003e“So you said,” she muttered, and picked up a fry, dipping it in a pool of ketchup. “But when the doctor announced we had a son, you gave the loudest whoop I’d ever heard and high-fived the nurse.”\u003c/p\u003e\n\u003cp\u003e“I most certainly did not.”\u003c/p\u003e\n\u003cp\u003e“I was there. I remember it clearly, Grant Hamlin.”\u003c/p\u003e\n\u003cp\u003e“I expected another boy when you had Annie.” He smiled, his gaze turned inward. “I fell head over heels for that baby girl.”\u003c/p\u003e\n\u003cp\u003eBethanne had to agree. Annie held her daddy’s heart in the palm of her hand the first moment he laid eyes on her. The only time their relationship had been strained was shortly before and then after the divorce. Everything seemed back to normal between them now, and for that Bethanne was grateful. Annie needed her father’s love and approval perhaps even more than she did Bethanne’s.\u003c/p\u003e\n\u003cp\u003e“Do you remember when Andrew got pneumonia?”\u003c/p\u003e\n\u003cp\u003eBethanne set down her fork and reached for a napkin to wipe the grease from her fingers. Their son had been just eighteen months old and she’d already taken him to the pediatrician twice that week. The nurse had made her feel she was being overprotective and a bother. That night Andrew wasn’t any better and she’d held her son in her arms for hours as he struggled to breathe. First thing the next morning, she drove him to the doctor again, ready to face down that dragon of a nurse, only to have the doctor explode in anger at her for not getting Andrew to the hospital. Bethanne had burst into tears. She’d phoned Grant, who met her at Emergency and gently took her in his arms. He’d been her strength when their son was put in an oxygen tent.\u003c/p\u003e\n\u003cp\u003e“There were some hard times when the kids were growing up, weren’t there?” Bethanne said. She swore Annie had the worst case of chicken pox of any child she knew. They went down her throat and into her stomach. The poor child had been miserable for days. No one else had slept, either.\u003c/p\u003e\n\u003cp\u003e“We had plenty of good memories, too.”\u003c/p\u003e\n\u003cp\u003eBethanne had to agree they did. “Like our tenth wedding anniversary.”\u003c/p\u003e\n\u003cp\u003e“Rome.”\u003c/p\u003e\n\u003cp\u003e“And you were so confident your high school Italian would be enough for us to get around by ourselves,” Bethanne said, wondering if he recalled some of their adventures.\u003c/p\u003e\n\u003cp\u003e“We could afford the plane fare and that cheap hotel and food, of course, but not much else,” Grant was quick to add.\u003c/p\u003e\n\u003cp\u003eNot that Bethanne needed any reminders. Their budget had been squeaky tight and they were unable to afford any tours. All at once she began to laugh. When Grant gave her an odd look, she covered her mouth and muttered, “The cheese. Don’t you remember the cheese?”\u003c/p\u003e\n\u003cp\u003eGrant stared at her blankly.\u003c/p\u003e\n\u003cp\u003e“You can’t have forgotten the cheese.”\u003c/p\u003e\n\u003cp\u003e“We bought cheese?” he asked, his eyes widening.\u003c/p\u003e\n\u003cp\u003eStill laughing, Bethanne nudged him. “You’re kidding—you really don’t remember? You were so sure you could make yourself understood. The Englishman at the hotel suggested a cheese shop, but somehow we got the directions wrong.”\u003c/p\u003e\n\u003cp\u003eGrant shrugged; the story appeared to have been erased from his memory.\u003c/p\u003e\n\u003cp\u003e“We stopped in another store to ask about the cheese shop, and the owner kept shaking her head as you chatted away, looking for directions.”\u003c/p\u003e\n\u003cp\u003e“No doubt in brilliant Italian.”\u003c/p\u003e\n\u003cp\u003e“No doubt,” she echoed. “Then the owner smiled, went into the back room and returned with two candlesticks.”\u003c/p\u003e\n\u003cp\u003e“Leave it to you to remember that,” Grant said with a grin. “We did eventually find the cheese shop, didn’t we?”\u003c/p\u003e\n\u003cp\u003e“Eventually, after we stopped laughing.”\u003c/p\u003e\n\u003cp\u003eGrant’s eyes darkened then, and he grew serious as he reached for a paper napkin and dabbed the edges of his mouth. “We were happy, Bethanne.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said, as her amusement faded. “We were.” He’d told her that more than once, and these reminiscences had confirmed the truth of it.\u003c/p\u003e\n\u003cp\u003e“We can be again.”\u003c/p\u003e\n\u003cp\u003eTheir eyes held. She longed to believe him, longed for some reassurance that the possibility was as real as it felt in that moment. Life during the past six years had taught her that the future didn’t come with any guarantees.\u003c/p\u003e\n\u003cp\u003e“I want to believe that, Grant.”\u003c/p\u003e\n\u003cp\u003e“I hope you’ll give me the opportunity to make you happy.” He took her hand. “All I’m asking is that we put the past behind us and try again.”\u003c/p\u003e\n\u003cp\u003eShe nodded, unsure how to respond. Being with Max had felt so right but he remained a mystery. When it came down to it, she knew shockingly little about him. He kept everything close to his chest, almost as if he was afraid to share too much of himself with her…with anyone.\u003c/p\u003e\n\u003cp\u003eGrant was safe, a known quantity. Yes, his betrayal had come between them, damaged them; despite that they knew each other as well as any two people who’d spent twenty years as husband and wife possibly could.\u003c/p\u003e\n\u003cp\u003eOr did they? She couldn’t help wondering if Grant recognized the changes in her.\u003c/p\u003e\n\u003cp\u003e“Why the frown?” he asked.\u003c/p\u003e\n\u003cp\u003e“I was frowning?” Bethanne hadn’t been aware that her uncertainty showed so easily on her face. “Do you really know me, Grant?” she asked. “The woman I am today isn’t the woman I was when we divorced.”\u003c/p\u003e\n\u003cp\u003e“I realize that. I’ll admit you surprised me, Bethanne. You have an uncanny mind for business.”\u003c/p\u003e\n\u003cp\u003e“I had a good teacher.” She doubted that Grant knew how much she’d learned from him.\u003c/p\u003e\n\u003cp\u003e“You did?” he asked, astonishment reflected in his eyes.\u003c/p\u003e\n\u003cp\u003e“Yes,” she told him. “You. When I hosted those dinner parties,” she elaborated, “I socialized with your business associates, listened to their stories—and yours. You’re good with people, Grant. They like and trust you right away. That’s a gift.”\u003c/p\u003e\n\u003cp\u003e“I never understood how much of a team we were until…until I was on my own,” Grant said. “You did far more than arrange those social events. You were my emotional support, my encourager. I owed a great deal of my success to you and I was too self-absorbed to see it.”\u003c/p\u003e\n\u003cp\u003eHearing him admit her importance to his career felt good. More than good. His acknowledgment validated her in ways she hadn’t expected.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she whispered, hardly able to speak.\u003c/p\u003e\n\u003cp\u003e“I realize now that I didn’t appreciate you nearly enough. Fool that I am, I walked away from the one person in this world who complemented me better than anyone else ever could.”\u003c/p\u003e\n\u003cp\u003eHe leaned toward her and she toward him, and their lips met in a sweet, gentle kiss.\u003c/p\u003e\n\u003cp\u003eBethanne drew back. If she thought this time in Florida, away from Max, would clear her head, she was wrong. She stood abruptly and grabbed her purse, ready to go. Their kiss had been…comfortable. And that had unsettled her.\u003c/p\u003e\n\u003cp\u003eWatching her closely, Grant stood, too. He’d paid for their lunch when he’d placed the order, so they were free to leave. They walked back to the hotel, side by side. He didn’t reach for her hand and Bethanne was grateful. She wasn’t sure what she felt. No, that wasn’t it. She felt too much. Too many different emotions. Contradictory emotions. She longed to call Max and tell him what had happened, discuss it with him. But they’d made no promises to each other, no commitments. In fact, everything had been left unresolved.\u003c/p\u003e\n\u003cp\u003eAs they walked, Grant peered down the beach. “Is that Annie and Craig?” he asked.\u003c/p\u003e\n\u003cp\u003eBethanne looked up and nodded.\u003c/p\u003e\n\u003cp\u003eAnnie saw them and waved, and then, with Craig at her side, she raced toward Bethanne and Grant.\u003c/p\u003e\n\u003cp\u003e“Mom, Dad,” Annie said, sounding breathless and excited. “Craig and I have the most fantastic idea.”\u003c/p\u003e\n\u003cp\u003e“Which is?” Bethanne asked.\u003c/p\u003e\n\u003cp\u003eStill gasping, Annie pressed her hand over her heart. “We want to redo prom night for Grandma and Royce.”\u003c/p\u003e\n\u003cp\u003e“The whole thing,” Craig said, equally excited. “From beginning to end.”\u003c/p\u003e\n\u003cp\u003e“What do you mean? How exactly?”\u003c/p\u003e\n\u003cp\u003e“The dinner and photos, a limo and a dance and everything,” Annie explained.\u003c/p\u003e\n\u003cp\u003e“I’ve already talked to the manager of the restaurant at your hotel and there’s a private room we can use,” Craig said.\u003c/p\u003e\n\u003cp\u003eAnnie exchanged a smile with Royce’s grandson. “Craig has a friend who drives part-time for a limo company, and he checked and they have a car available Saturday night….”\u003c/p\u003e\n\u003cp\u003e“I know Gramps would love to redo that night.”\u003c/p\u003e\n\u003cp\u003e“Can we?” Annie’s eyes seemed twice their normal size as she implored them to consider the idea.\u003c/p\u003e\n\u003cp\u003eGrant looked at Bethanne and she looked at him. She’d had enough experience throwing parties that this one wouldn’t be a problem.\u003c/p\u003e\n\u003cp\u003e“We’ll make it happen,” she said.\u003c/p\u003e\n\u003cp\u003eGrant nodded. “Just tell me what you need me to do.”\u003c/p\u003e\n\u003cp\u003eTwenty-Seven\u003c/p\u003e\n\u003cp\u003e“What are we doing?” Ruth asked in a bewildered voice. Her eyes shot to Bethanne, who merely shrugged. They wouldn’t be able to keep the secret much longer, but she knew Annie wanted to play this out to the last possible second.\u003c/p\u003e\n\u003cp\u003e“We’re going shopping, Grandma,” Annie said, steering her grandmother out of the hotel room and down the hallway toward the lobby.\u003c/p\u003e\n\u003cp\u003e“But why? I brought everything I need. Will you two kindly tell me what you’ve got up your sleeves? And don’t you say it’s nothing, because I know better.”\u003c/p\u003e\n\u003cp\u003e“You don’t have everything you need,” Annie insisted.\u003c/p\u003e\n\u003cp\u003e“Surely you’ve learned not to argue with Annie,” Bethanne said, closing the door to their room and hurrying after them.\u003c/p\u003e\n\u003cp\u003e“Just where are you taking me?” Ruth demanded.\u003c/p\u003e\n\u003cp\u003e“Shopping.”\u003c/p\u003e\n\u003cp\u003e“I found a perfect store right here on the beach that I want to show you,” Annie said. “We can walk there. Come on, Grandma.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what you two are up to,” Ruth muttered, clearly confused but curious nonetheless.\u003c/p\u003e\n\u003cp\u003e“What makes you think we’re up to anything?” Bethanne asked innocently. She’d done her best to arrange everything without raising Ruth’s suspicions, but it’d been difficult. For the past twenty-four hours she’d met with florists, musicians and photographers. She’d run herself ragged and worked a miracle. Or what she hoped would be a miracle. Grant had talked to Royce and he’d agreed to do whatever he could to pull this off. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-40.html","bookId":1940,"creation":"Oct 5, 2019 10:01:04 AM","modification":"Oct 5, 2019 10:01:04 AM"}
