{"id":66371,"no":46,"title":"Page 46","content":"\u003cp\u003e“Are you sorry we met?” he asked.\u003c/p\u003e\n\u003cp\u003e“No.” Away from him, she’d wavered. But now that she heard his voice, she knew she didn’t have a single regret.\u003c/p\u003e\n\u003cp\u003e“I’m not, either.”\u003c/p\u003e\n\u003cp\u003e“I need to go now.” She couldn’t talk to him because she was afraid she’d reverse her decision.\u003c/p\u003e\n\u003cp\u003e“All right, but I have to tell you something first.”\u003c/p\u003e\n\u003cp\u003e“Okay.” It probably wasn’t a good idea to listen, but she couldn’t help herself.\u003c/p\u003e\n\u003cp\u003e“When we last spoke, you said you couldn’t think about any of this, about Grant or me, until after your son’s wedding. I agreed. I’m holding you to that, Bethanne. Whatever decision you make needs to wait until after July 16—that’s when the ceremony is, right?”\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“I won’t call you. But you should understand that I’m not giving up easily. I’m here for the long haul.”\u003c/p\u003e\n\u003cp\u003e“But… Grant’s trying so hard,” she said again.\u003c/p\u003e\n\u003cp\u003e“So would I if I were in his shoes. The fact is, I’m trying, too. I care about you, Bethanne. I didn’t think I could fall in love again. You proved me wrong.”\u003c/p\u003e\n\u003cp\u003eWith every word he spoke, her resolve seemed to melt.\u003c/p\u003e\n\u003cp\u003e“Like I said, you won’t hear from me, but I want to see you after the sixteenth. If, at that time, you feel a relationship between us won’t work I’ll accept that. But you’re going to have to tell me to my face and not over the phone.”\u003c/p\u003e\n\u003cp\u003e“Don’t, Max, please don’t.”\u003c/p\u003e\n\u003cp\u003e“Don’t what?”\u003c/p\u003e\n\u003cp\u003e“Don’t love me. This is hard enough.”\u003c/p\u003e\n\u003cp\u003eHer plea was met with silence.\u003c/p\u003e\n\u003cp\u003e“I wish I could be more accommodating,” he finally said. “But I’m not a man who loves easily or often. I can’t turn my feelings on and off like a faucet. This is what I feel, and it’s not going to change no matter what you decide.”\u003c/p\u003e\n\u003cp\u003e“I’ve got to give Grant a chance.”\u003c/p\u003e\n\u003cp\u003e“Then you should.”\u003c/p\u003e\n\u003cp\u003eHe didn’t offer a single argument. “Why are you being so amenable about this?”\u003c/p\u003e\n\u003cp\u003e“Am I? I was kicking myself for being too hard on you.”\u003c/p\u003e\n\u003cp\u003e“You want me to let Grant try to persuade me?”\u003c/p\u003e\n\u003cp\u003e“Yes, because that’s the only way you can decide. We’ll meet after Andrew’s wedding,” he continued. “The two of us are going to sit down and you’re going to tell me then what your decision is. Not now. Not when you just got off a flight and you’re feeling tired and pressured.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she whispered. She knew now that she’d been unfair to him. “You’re right…I should never have called.”\u003c/p\u003e\n\u003cp\u003e“I’m glad you did. Just hearing from you gives me hope.”\u003c/p\u003e\n\u003cp\u003eShe had to talk about something else before she started crying again. “Did everything go well with you and your brother?”\u003c/p\u003e\n\u003cp\u003e“Extremely well. I’m resuming my position in the business. What’s your email address? I’ll send you a link so you can check it out.”\u003c/p\u003e\n\u003cp\u003eShe rattled it off before she could change her mind.\u003c/p\u003e\n\u003cp\u003e“I’ll talk to you in a few weeks.”\u003c/p\u003e\n\u003cp\u003e“Goodbye, Max.”\u003c/p\u003e\n\u003cp\u003e“Goodbye, my love.”\u003c/p\u003e\n\u003cp\u003eShe hung up the phone and fell onto the thick down comforter. Reaching for a pillow, she bunched it up under her head and closed her eyes, thinking she’d rest for a few minutes. The next time she stirred, it was dark outside and she felt chilled.\u003c/p\u003e\n\u003cp\u003eWhen she realized she’d been asleep, Bethanne sat up and waited for her vision to adjust to the dark. She’d had no idea she was this tired. True, she hadn’t slept well in several nights…\u003c/p\u003e\n\u003cp\u003eOh, no. Had she really phoned Max or was that part of some weird dream? Her stomach tensed. It felt far too real to have been a dream.\u003c/p\u003e\n\u003cp\u003eBethanne dragged herself off the bed and took a hot bath, got into her pajamas and returned to her bedroom, peeling back the covers. She climbed into bed and didn’t wake until early Monday morning.\u003c/p\u003e\n\u003cp\u003eOnce she was up and dressed, she brewed coffee and put a load of clothes in the washer. Then she sat at her home office computer to check her email.\u003c/p\u003e\n\u003cp\u003eAs the messages appeared, the most current at the top, she saw Max’s name and inhaled sharply. He’d said he would forward a link to his company website, but she hadn’t expected him to do it this soon.\u003c/p\u003e\n\u003cp\u003eShe read the release and, smiling, picked up the phone.\u003c/p\u003e\n\u003cp\u003e“I called you last night, didn’t I?” she said when he answered.\u003c/p\u003e\n\u003cp\u003e“Yes. Are you feeling better now?”\u003c/p\u003e\n\u003cp\u003e“Yes. I…I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“I mean what I said, Bethanne.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eShe heard Rooster’s voice in the background.\u003c/p\u003e\n\u003cp\u003e“I’m interrupting you,” she said.\u003c/p\u003e\n\u003cp\u003e“Not really. Rooster’s helping me clean out the house. I’ve got an appointment with a real estate agent this afternoon.”\u003c/p\u003e\n\u003cp\u003eThis was the house he’d lived in with Kate and their daughter. He must be dealing with a lot of difficult emotional issues. “Where will you move?” she asked.\u003c/p\u003e\n\u003cp\u003e“That depends.”\u003c/p\u003e\n\u003cp\u003e“On what?”\u003c/p\u003e\n\u003cp\u003eHe didn’t hesitate. “You.”\u003c/p\u003e\n\u003cp\u003e“Oh, Max.” Her shoulders slumped. Guilt, never very far away, came to hover near her.\u003c/p\u003e\n\u003cp\u003e“Are you still upset?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I’m glad.” He chuckled. “I thought you weren’t going to call me again,” he teased.\u003c/p\u003e\n\u003cp\u003e“I shouldn’t.”\u003c/p\u003e\n\u003cp\u003e“Yes, you should,” he said. “Call me anytime you want, day or night, understand?”\u003c/p\u003e\n\u003cp\u003e“I won’t,” she told him adamantly. “Not until after Andrew and Courtney’s wedding. That’s what we agreed.”\u003c/p\u003e\n\u003cp\u003eThe doorbell chimed. She was in no mood for company. The bell chimed again and she groaned. Whoever was there didn’t seem inclined to leave. “Hold on, someone’s at the door,” she said, putting down the phone.\u003c/p\u003e\n\u003cp\u003eBefore she could get to the foyer, she heard the front door open. It was Grant.\u003c/p\u003e\n\u003cp\u003e“Grant?” she said, shocked that he’d just walk into the house. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I thought I’d stop by to see that you were doing okay after the flight and—”\u003c/p\u003e\n\u003cp\u003e“This is my home now! You don’t have the right to let yourself in without an invitation.”\u003c/p\u003e\n\u003cp\u003eHe blinked as though her words offended him. “I apologize,” he said stiffly. “The front door was unlocked and I wasn’t sure you heard the doorbell.”\u003c/p\u003e\n\u003cp\u003eAs tired as she was the night before, Bethanne must have forgotten to lock it.\u003c/p\u003e\n\u003cp\u003e“Would you rather I left?” he asked, looking sufficiently chastened. “I certainly didn’t mean to upset you and I can see that I have.”\u003c/p\u003e\n\u003cp\u003eBethanne exhaled, torn between irritation and apprehension. She didn’t want Grant to know Max was on the phone and, at the same time, she didn’t want Max to know Grant was in the house.\u003c/p\u003e\n\u003cp\u003e“I’ve made a pot of coffee. Help yourself. I’m just finishing a phone call. I’ll be there in a minute.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eShe waited until Grant was on his way to the kitchen before she returned to her home office and closed the door.\u003c/p\u003e\n\u003cp\u003eSitting at her desk, she propped her elbow on it and rested her forehead in her hand. “I have to go,” she told Max.\u003c/p\u003e\n\u003cp\u003e“Remember, if there’s anything else you want to know about me, all you have to do is ask.”\u003c/p\u003e\n\u003cp\u003eDespite her discomfort, Bethanne smiled. “I’ll remember.”\u003c/p\u003e\n\u003cp\u003e“Call me anytime.”\u003c/p\u003e\n\u003cp\u003e“I won’t be calling,” she said. This was becoming a litany, repeated time after time.\u003c/p\u003e\n\u003cp\u003e“That’s a pity.”\u003c/p\u003e\n\u003cp\u003eGrumbling under her breath, she replaced the receiver, then joined her ex-husband in the kitchen. Grant had poured himself a cup of coffee; he looked relaxed and at home.\u003c/p\u003e\n\u003cp\u003e“I apologize again, Bethanne. Walking into the house was presumptuous of me.”\u003c/p\u003e\n\u003cp\u003eShe wasn’t going to argue. She crossed her arms and leaned against the counter. “As you can see, I’m safe and sound.”\u003c/p\u003e\n\u003cp\u003e“Did you sleep well?”\u003c/p\u003e\n\u003cp\u003e“Very well.” She didn’t fill in the details.\u003c/p\u003e\n\u003cp\u003eHe stirred sugar into his coffee. “Do you have plans for tonight?”\u003c/p\u003e\n\u003cp\u003eSeeing that she’d already agreed to have dinner with him on Tuesday, she couldn’t imagine what he had in mind for tonight. “Not really. What are you thinking?”\u003c/p\u003e\n\u003cp\u003e“There’s something I want to show you.” He gave her a rather self-satisfied smile, which made her wonder. Still, she’d hoped for a quiet Monday evening.\u003c/p\u003e\n\u003cp\u003e“Today?” she asked. “Can’t we do it later in the week?”\u003c/p\u003e\n\u003cp\u003e“Ah, sure.” He was clearly disappointed.\u003c/p\u003e\n\u003cp\u003e“Could you tell me what it is?”\u003c/p\u003e\n\u003cp\u003eGrant cradled his mug of coffee. “It’s a house, a lovely one that’s been on the market for a while. The owners are ready to bargain—and so am I.”\u003c/p\u003e\n\u003cp\u003eThirty-Two\u003c/p\u003e\n\u003cp\u003eBethanne didn’t really want to see this house Grant was so excited about. She knew from the years they were married that he’d dreamed of one day buying a home on Lake Washington. Waterfront property was highly sought after and, in a word, expensive.\u003c/p\u003e\n\u003cp\u003eBy Wednesday afternoon, Bethanne regretted ever having consented to this. She hadn’t been back in the office long and had barely had time to do more than answer emails and catch up with a few pressing items that required her immediate attention. Julia Hayden had done a masterful job but there were a number of decisions only Bethanne could make. Her day was harried enough without this appointment.\u003c/p\u003e\n\u003cp\u003eHe phoned at noon to confirm their meeting time. She almost told him that he should arrange the viewing for another evening. What changed her mind was how excited he seemed. She hadn’t heard that kind of enthusiasm from him in a very long while.\u003c/p\u003e\n\u003cp\u003eA half hour before she planned to leave, Annie wandered into her office. “Has your day been as hectic as mine?” her daughter asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” Bethanne said, glancing up from her computer screen.\u003c/p\u003e\n\u003cp\u003eAnnie sat down in the chair across from her desk. “Did you and Dad get together last night?”\u003c/p\u003e\n\u003cp\u003e“We did.” Grant had taken Bethanne to an old favorite of theirs. Zorba’s was a family-owned Greek restaurant where they used to dine every year on their birthdays. Bethanne enjoyed Mediterranean-style cuisine, and so did Grant. Back then, it had been a real treat to splurge on a couple of special nights.\u003c/p\u003e\n\u003cp\u003eAs Grant’s career advanced they were able to dine out more often and they’d expanded their repertoire of restaurants. Bethanne hadn’t gone to Zorba’s since the divorce. Their meal on Tuesday evening had been pleasant and, not surprisingly, led to reminiscences of previous dinners there. The original owners, whom they remembered fondly, had retired and their children now ran Zorba’s. While the recipes were the same, or so they were told, the food didn’t taste quite as good.\u003c/p\u003e\n\u003cp\u003e“Dad said he was taking you to your favorite place.”\u003c/p\u003e\n\u003cp\u003e“We had several favorite restaurants.”\u003c/p\u003e\n\u003cp\u003e“You can’t throw away all those years, Mom! You just can’t.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-46.html","bookId":1940,"creation":"Oct 5, 2019 10:01:04 AM","modification":"Oct 5, 2019 10:01:04 AM"}
