{"id":66373,"no":48,"title":"Page 48","content":"\u003cp\u003e“It isn’t that…” Maybe it was, but only to a degree. “I don’t want to give up my home.”\u003c/p\u003e\n\u003cp\u003e“Then we won’t,” he said softly. He leaned over and kissed her cheek.\u003c/p\u003e\n\u003cp\u003eThirty-Three\u003c/p\u003e\n\u003cp\u003eAndrew got to the house early on Thursday evening, the day after Bethanne had seen the Lake Washington house with Grant. Courtney would be joining them later. She had a dinner meeting with her bridesmaids, including Annie, who’d most likely come to the house with her afterward.\u003c/p\u003e\n\u003cp\u003eBethanne had Andrew’s favorite made-from-scratch black bean soup simmering in the Crock-Pot and corn bread baking in the oven. She’d purposely put on the apron Andrew had sewed in his high school Family and Consumer Science Education class. When she was in school, the class had been called Home Ec and it was for girls only. Times had definitely changed. Andrew had done a good job on the apron and she wore it with pride.\u003c/p\u003e\n\u003cp\u003eHer son breezed into the house, hugged her and then immediately lifted the lid on the Crock-Pot. “I was hoping you’d make the black bean soup.”\u003c/p\u003e\n\u003cp\u003e“I’ve already passed the recipe on to Courtney.”\u003c/p\u003e\n\u003cp\u003e“What about the one for rhubarb crunch?”\u003c/p\u003e\n\u003cp\u003e“That, too,” Bethanne said, unable to hold back a smile. In fact, she’d put together a small family cookbook of recipes for every season. The black bean was Andrew’s all-time favorite, and she used to have a huge batch going every college break. That soup alone was practically enough to bring him home.\u003c/p\u003e\n\u003cp\u003eHe slid onto a stool at the kitchen counter and watched her for several seconds. “I got a surprise phone call on Monday.”\u003c/p\u003e\n\u003cp\u003e“Oh? Who from?” she asked absently as she stirred the soup.\u003c/p\u003e\n\u003cp\u003e“Your friend Max.”\u003c/p\u003e\n\u003cp\u003eBethanne dropped the spoon, which clanged against the side of the ceramic pot. “Max called you?” She wondered how he’d gotten Andrew’s number, then realized it wouldn’t have been difficult.\u003c/p\u003e\n\u003cp\u003e“He wanted to send a case of champagne for the wedding.”\u003c/p\u003e\n\u003cp\u003eBethanne’s mouth went dry. She tried to speak but couldn’t get her tongue to cooperate.\u003c/p\u003e\n\u003cp\u003e“First, I told him I’d talk it over with you, but then I went ahead and made a decision. I hope you don’t mind.”\u003c/p\u003e\n\u003cp\u003e“Of course I don’t mind. Whatever you decide is up to you and Courtney.” Bethanne managed to speak, although her voice echoed oddly in her ears.\u003c/p\u003e\n\u003cp\u003e“It’s really generous of him to offer. We haven’t met, but I like him, Mom. He sounds like a cool guy.”\u003c/p\u003e\n\u003cp\u003eBethanne just nodded.\u003c/p\u003e\n\u003cp\u003e“When I mentioned that you and I were getting together tonight to discuss the rehearsal dinner, he offered to send a couple cases of wine for that, too.”\u003c/p\u003e\n\u003cp\u003eBethanne paid an inordinate amount of attention to the soup. “Your father might not appreciate your accepting either offer.”\u003c/p\u003e\n\u003cp\u003eAndrew considered that for a minute, then shrugged. “I say if Max wants to send us wine as a wedding gift, we should let him. Courtney agrees. I wouldn’t turn down anyone else’s gift—why should I reject his?”\u003c/p\u003e\n\u003cp\u003eHe had a point.\u003c/p\u003e\n\u003cp\u003e“Does it bother you, Mom?”\u003c/p\u003e\n\u003cp\u003e“No…I think it’s a wonderful gesture.”\u003c/p\u003e\n\u003cp\u003e“Me, too.” Andrew slid off the stool and got two bowls, which he carried to the kitchen table, setting them on the quilted place mats.\u003c/p\u003e\n\u003cp\u003e“Did…did Max ask about me?”\u003c/p\u003e\n\u003cp\u003eAndrew appeared to find her question highly amusing. “He did.”\u003c/p\u003e\n\u003cp\u003eApparently, her son was going to force her to beg for every scrap of information. Andrew pretended interest in collecting silverware from the drawer.\u003c/p\u003e\n\u003cp\u003e“Are you going to make me ask?” she demanded.\u003c/p\u003e\n\u003cp\u003eHe grinned. “I shouldn’t be so cruel, should I?”\u003c/p\u003e\n\u003cp\u003e“No, you shouldn’t,” she said, placing her hands on her hips. She waited impatiently for him to fill her in on their conversation.\u003c/p\u003e\n\u003cp\u003e“He told me some more about how the two of you met.”\u003c/p\u003e\n\u003cp\u003eShe smiled at the memory.\u003c/p\u003e\n\u003cp\u003e“You didn’t tell me you rode on the back of his bike.”\u003c/p\u003e\n\u003cp\u003e“More than once,” she admitted proudly.\u003c/p\u003e\n\u003cp\u003e“Now that’s something I’d like to see.”\u003c/p\u003e\n\u003cp\u003eIn the beginning she’d been terrified by every bump and curve in the road, but gradually she’d learned to relax and enjoy the sensation of freedom. If the relationship between Max and her developed, and that remained a huge question, she might eventually learn to ride herself.\u003c/p\u003e\n\u003cp\u003e“He didn’t ask how it’s going with you and Dad, if that’s what you’re wondering,” Andrew said. “I think it’s been difficult for him not knowing, but he said he promised you this time with Dad and that he’s a man of his word.”\u003c/p\u003e\n\u003cp\u003e“Your father gave him the same opportunity,” she reminded Andrew.\u003c/p\u003e\n\u003cp\u003e“Well, sure, but he had Annie reporting to him every ten minutes. Max doesn’t have anyone feeding him information.”\u003c/p\u003e\n\u003cp\u003eThat was true—and probably just as well.\u003c/p\u003e\n\u003cp\u003e“We only spoke for a few minutes. I told him I’d discuss the wine and champagne with Courtney and get back to him in the morning. But basically we’ve decided to accept.”\u003c/p\u003e\n\u003cp\u003eShe felt her son’s scrutiny as if he expected her to weigh in with an opinion. Like she’d already said, the decision was up to him and Courtney.\u003c/p\u003e\n\u003cp\u003e“You’re sure you don’t have anything to say about this?” he pressed.\u003c/p\u003e\n\u003cp\u003eThe doorbell chimed just then, and to her surprise it was Grant. Andrew tensed as his father followed Bethanne into the kitchen. She returned to the other side of the counter while Grant leaned against it.\u003c/p\u003e\n\u003cp\u003eFather and son eyed each other, and Bethanne sensed the sadness in Grant. He missed his son and wanted the situation to be different.\u003c/p\u003e\n\u003cp\u003e“I hope you don’t mind my dropping in like this,” Grant said casually. “Annie told me you were discussing the rehearsal dinner tonight and I thought I should be here, too. I’d like to be part of this wedding.” He risked a glance in Andrew’s direction. “If that’s all right.”\u003c/p\u003e\n\u003cp\u003eAndrew didn’t comment. “Mom and I were just talking about the wine.”\u003c/p\u003e\n\u003cp\u003eBethanne sent him a warning look, which he ignored.\u003c/p\u003e\n\u003cp\u003e“I have a couple of friends who are familiar with wine varieties. Should I check with them?” Grant asked.\u003c/p\u003e\n\u003cp\u003e“I believe we’ve already got the drinks covered, Grant,” Bethanne said pointedly. “Thanks for offering, though.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Grant looked somewhat taken aback. “I thought you two were about to discuss the menu. How do you know if you want white wine or red? Actually, it might be a good idea to order a case of each.”\u003c/p\u003e\n\u003cp\u003e“Like Mom said,” Andrew told him. “We’ve got that covered.”\u003c/p\u003e\n\u003cp\u003e“It isn’t that we don’t value your input,” Bethanne was quick to add, wanting to avoid a disagreement.\u003c/p\u003e\n\u003cp\u003e“What kind is it? Sauvignon blanc? Merlot for the red? That’s what I’d recommend.”\u003c/p\u003e\n\u003cp\u003eBethanne looked to her son for help.\u003c/p\u003e\n\u003cp\u003e“I’m not sure yet, but I know it’s going to be the best wine available,” Andrew said. “Along with the wine, the same person’s giving us three cases of champagne for the reception.”\u003c/p\u003e\n\u003cp\u003e“Someone’s giving you wine and champagne?”\u003c/p\u003e\n\u003cp\u003eBethanne nodded.\u003c/p\u003e\n\u003cp\u003e“Really?” Grant’s eyebrows rose slightly. “That’s no small expense. Who’s being so generous?” He rested his hands on the counter behind him. “Is it one of my clients?”\u003c/p\u003e\n\u003cp\u003eSince he obviously wasn’t letting this go, Bethanne left it to her son to explain.\u003c/p\u003e\n\u003cp\u003e“It’s Max Scranton,” Andrew said after a brief hesitation.\u003c/p\u003e\n\u003cp\u003e“Who?” Grant asked, and then comprehension came into his eyes. “Max? That biker? You’ve got to be kidding!”\u003c/p\u003e\n\u003cp\u003e“Max owns a wine distribution company,” Andrew informed his father.\u003c/p\u003e\n\u003cp\u003e“His brother’s a partner,” Bethanne corrected.\u003c/p\u003e\n\u003cp\u003e“True,” Andrew said with a shrug, “but Max owns the larger part of the business.”\u003c/p\u003e\n\u003cp\u003eThis was news to Bethanne. Max and Andrew’s conversation had obviously been longer than her son had implied.\u003c/p\u003e\n\u003cp\u003e“You aren’t going to accept it, are you?” Grant frowned at Andrew, then Bethanne. “How do you think that would look?” he asked. “The two of us are working on a reconciliation and another man gives our son all the wine for the wedding. This has the potential to be embarrassing. What are you going to tell people?” He seemed to expect Bethanne to second his objection.\u003c/p\u003e\n\u003cp\u003e“I wasn’t going to tell anyone anything,” Bethanne said. “It’s no one’s business.”\u003c/p\u003e\n\u003cp\u003e“Son,” Grant said, looking at Andrew, “are you really going to accept this?”\u003c/p\u003e\n\u003cp\u003eBethanne couldn’t remember the last time Grant had addressed Andrew as “son.”\u003c/p\u003e\n\u003cp\u003e“Well, Dad, I did talk to Mom and she said the decision was mine and Courtney’s.”\u003c/p\u003e\n\u003cp\u003eGrant glanced at Bethanne.\u003c/p\u003e\n\u003cp\u003e“The wine and champagne were given to them, not me,” she said.\u003c/p\u003e\n\u003cp\u003eGrant blinked. “So…you’re taking the wine.”\u003c/p\u003e\n\u003cp\u003e“And the champagne.” Andrew shrugged again. “It’s a gift. Courtney and I were offered a nice gift by a friend of Mom, Grandma and Annie, so we’re saying yes. This has nothing to do with you.”\u003c/p\u003e\n\u003cp\u003e“All right,” Grant said, attempting to disguise his wounded pride. Seeing the two soup bowls set on the kitchen table, he shoved his hands in his pockets. “It looks like you two have everything under control here. If you need me for anything, give me a call.”\u003c/p\u003e\n\u003cp\u003e“Sure,” Andrew muttered.\u003c/p\u003e\n\u003cp\u003eWearing an expression of both hurt and disappointment, Grant walked out of the house.\u003c/p\u003e\n\u003cp\u003eBethanne waited until the front door closed before she confronted her son. “Andrew, was it really necessary to say that the wine’s from Max?”\u003c/p\u003e\n\u003cp\u003e“Yes, as a matter of fact, it was. Dad would find out about it sooner or later, and frankly I’d rather tell him now than have him discover it the day of the wedding.”\u003c/p\u003e\n\u003cp\u003eShe sighed, regretting the hostility between father and son, as she removed the corn bread from the oven and set it on the stove top to cool.\u003c/p\u003e\n\u003cp\u003e“Annie said earlier that you and Dad looked at a house on Lake Washington yesterday,” Andrew commented.\u003c/p\u003e\n\u003cp\u003e“He wanted me to see it.”\u003c/p\u003e\n\u003cp\u003e“So things between you and Dad are going okay?”\u003c/p\u003e\n\u003cp\u003eBethanne didn’t answer. Instead, she picked up the bowls, filled them and brought them back to the table. Andrew took the sour cream from the refrigerator and spooned it into a small serving dish.\u003c/p\u003e\n\u003cp\u003e“Your father is making every effort.” She sliced the corn bread, not meeting his eyes.\u003c/p\u003e\n\u003cp\u003e“Sure he is. Dad wants you back because you flattered his ego. He needs that. He needs you. It took him long enough to realize he was never going to find anyone who’d do anything close to what you did for him.”\u003c/p\u003e\n\u003cp\u003e“Andrew…I know you and your father have problems that need to be resolved, but Grant isn’t that mercenary.”\u003c/p\u003e\n\u003cp\u003eHer son laughed outright. “Mom, don’t you believe it. Dad’s always been about Dad. I’m not championing Max. I’ve only spoken to him the one time, so I don’t know him. What I do know is the way you react whenever I mention his name. You get flustered—” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-48.html","bookId":1940,"creation":"Oct 5, 2019 10:01:04 AM","modification":"Oct 5, 2019 10:01:04 AM"}
