{"id":84179,"no":10,"title":"Page 10","content":"\u003cp\u003eAs we step outside, I regretfully remove my hand, then lift her jacket to my nose. The jacket has a sweet scent that reminds me of the ocean. It’s a bittersweet smell for me. I shove the memories away and focus. I can’t detect the scent of beer, but then again, we’re covered in it. “I know it’s cold, but if you can keep your jacket off, it would be better. It’ll keep the smell of beer off of it.”\u003c/p\u003e\n\u003cp\u003eFrom behind us, a garbage can clanks against the asphalt. I quicken my pace and Rachel has to double her steps in order to match my stride. I should slow, but I don’t like the idea of being in dark alleys with her. Too many things there go bump and jackass crazy in the night.\u003c/p\u003e\n\u003cp\u003e“What about the police?” she asks. “Won’t they still be looking for us?”\u003c/p\u003e\n\u003cp\u003e“I live a few blocks over. They’ve probably caught everyone they think they can catch, but I still want to stay off the main streets.”\u003c/p\u003e\n\u003cp\u003e“We’re going to your house?” I hear the hint of relief.\u003c/p\u003e\n\u003cp\u003e“Apartment.” She probably lives in a huge house full of nice shit. I lower my head. Damn. Suddenly, this no longer seems like a good idea. She’ll be shocked when she sees my place. “We don’t have much.”\u003c/p\u003e\n\u003cp\u003e“That’s okay. Are you sure you want to take me there? It’s late.”\u003c/p\u003e\n\u003cp\u003eNoah won’t care. “What time is your curfew?” Because girls like her have those.\u003c/p\u003e\n\u003cp\u003eThe only sound besides the honking coming from the main street behind us is of our shoes hitting the pavement. She’s silent, which, from the short time I’ve known her, strikes me as odd.\u003c/p\u003e\n\u003cp\u003eWe turn into another alley and I breathe easier when I spot the fire escape to my unit. Home sweet fucking home. Hopefully before Noah left, he emptied the rat traps.\u003c/p\u003e\n\u003cp\u003eRachel’s arm brushes against mine, and I flinch from how cold it is. “We’re almost there. You can take a shower if you want to wash off the beer.”\u003c/p\u003e\n\u003cp\u003e“Ten,” she says in a small voice. “My curfew is ten.”\u003c/p\u003e\n\u003cp\u003eI hike one eyebrow, and when I glance at her she quickly looks away.\u003c/p\u003e\n\u003cp\u003e“Little late, aren’t you?” By two and a half hours.\u003c/p\u003e\n\u003cp\u003eShe twists a strand of her hair around her finger. “My twin brother and I have an agreement. We cover for each other when—well, when we want to be out past curfew.”\u003c/p\u003e\n\u003cp\u003eI don’t get her. Not at all. “So you don’t drink?”\u003c/p\u003e\n\u003cp\u003e“No.” She releases her hair and raises her chin. Guess I should keep my mouth shut about how I do drink and how I’ve been known to get high.\u003c/p\u003e\n\u003cp\u003e“And you don’t have a boyfriend.”\u003c/p\u003e\n\u003cp\u003eThe chin drops. “No.”\u003c/p\u003e\n\u003cp\u003eThe answer may bother her, but it’s the best news I’ve heard in days. Though it shouldn’t matter, I don’t like the idea of another guy kissing her. My stomach twists with the thought of the hundreds of guys that must be following her around, waiting for her to take notice.\u003c/p\u003e\n\u003cp\u003eI rub at my neck. What the hell is wrong with my thought process tonight? She’s not my problem. What’s between us is just for tonight. “And you like to drag race.”\u003c/p\u003e\n\u003cp\u003eBecoming more thoughtful, her forehead relaxes. “Not really. That sort of sucked. Drag racing is a lot different than when I push my car to see how fast it can go. I do like to let her loose. She can hit sixty in five seconds.”\u003c/p\u003e\n\u003cp\u003eHer excited eyes seek validation. She hesitates, and I nod for her to continue. As if my approval rocks her world, an extra spring appears in her step.\u003c/p\u003e\n\u003cp\u003e“It was cool, though. I had this huge adrenaline rush when I heard your car take off. But I got sort of frazzled. Like my arms and my legs started working separately. And by the time I got my act together, you were done.”\u003c/p\u003e\n\u003cp\u003eWe reach the old Victorian house my landlord left to rot once he converted it into four separate apartments. I hold the front door open for her, then lead the way up the stairs.\u003c/p\u003e\n\u003cp\u003e“Watch the third and sixth steps.”\u003c/p\u003e\n\u003cp\u003e“This is where you live?” Rachel wraps her hands around her stomach and peers over the railing to the floor below. The light over the stairwell flickers.\u003c/p\u003e\n\u003cp\u003e“Yep.” I unlock the dead bolt then switch keys to unlock the actual knob. “It’s not much, but it’s home.” The hint of pride in my voice surprises me.\u003c/p\u003e\n\u003cp\u003eI open the door, switch on the light and motion for Rachel to enter. With her arms still clinging to her sides, she slowly shuffles into the apartment. As soon as she’s in, I shut the door, rebolt and head to the bathroom. She’ll want to clean up and the water takes at least five minutes before it’ll be lukewarm.\u003c/p\u003e\n\u003cp\u003eThe water pipes groan as I spin the knobs. “I’ll put a towel out for you. You’ll need to crouch to use the shower—or maybe not. You’re shorter than me,” I say over the water pouring into the old claw-foot tub. “I’ll give you one of my shirts to change into. Your jeans should be fine.”\u003c/p\u003e\n\u003cp\u003eI walk out and go for the bedroom to find her a T-shirt, but stop short. Rachel stares at the dead bolt on the door with one hand still clutching her stomach, the other pressed to her throat.\u003c/p\u003e\n\u003cp\u003e“Rachel? Are you okay?”\u003c/p\u003e\n\u003cp\u003e“Where are...where are your parents?”\u003c/p\u003e\n\u003cp\u003eThe air rushes out of my lungs, and I scratch the stubble on my chin to hide the horror. I’m so used to people knowing...or assuming...or flat out accepting that people where I come from don’t have them...or if they did have them, that they weren’t any good. “I’m a foster kid.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she says slowly, obviously not okay. “So what about them? Your foster parents. Where are they?”\u003c/p\u003e\n\u003cp\u003eI shift my footing and clear my throat as I come to terms with the situation I’ve put her in without knowing. All right, I knew. Fifteen minutes ago I contemplated bringing her home for the night. But that was before I realized how pure she was. Still, I brought her here, even if my intentions changed.\u003c/p\u003e\n\u003cp\u003eI force out the words. “I moved out of my foster parents’ home a couple of months ago with my best friend, Noah.”\u003c/p\u003e\n\u003cp\u003eShe glances quickly around the room, searching for the threat. “And he is—”\u003c/p\u003e\n\u003cp\u003eI cut her off. “A good guy who’s probably staying the night with his girl. He goes to college and so does Echo. She came from a real good neighborhood, like you. Middleheights, I think.”\u003c/p\u003e\n\u003cp\u003e“I live in Summitview,” she says softly while staring at the empty rat trap in the middle of the kitchen floor.\u003c/p\u003e\n\u003cp\u003eOf course she does. That’s the damn Beverly Hills of Louisville. It’s gated. With guards. And she’s probably wondering if I’ve got body parts in the freezer.\u003c/p\u003e\n\u003cp\u003eThe shower continues to pound against the porcelain tub and the damn insomniac old lady downstairs begins to play Elvis. Except this time, it’s one of his depressing songs.\u003c/p\u003e\n\u003cp\u003e“Rachel, I swear, my intentions are good. I won’t touch you. I’ll stay on the other side of the room from you at all times.” And why the fuck should she believe me? “You looked so damned scared at the thought of going home smelling like beer. I don’t know what shit you’ve got going down in your house, but I’ve been around enough to understand. Look, honestly, I’m just trying to help.”\u003c/p\u003e\n\u003cp\u003eShe nibbles on a fingernail. “So you still go to high school?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Eastwick.”\u003c/p\u003e\n\u003cp\u003eSilence. Her leather boots squeak as she adjusts her weight. The water still crashes against the tub. Elvis sings about rain.\u003c/p\u003e\n\u003cp\u003e“Eastwick’s a good school.” She drops her hand and peeks at me from below her eyelashes.\u003c/p\u003e\n\u003cp\u003eFinally, I’m getting someplace. “Yeah, it is.” No need to mention that my foster parents live right on the line between Eastwick, a good high school, and the one school in the county that is a step above a detention center. “I’m in the Automotive Accelerated Program. I’ve been the highest-ranking student in the program for the past two years.”\u003c/p\u003e\n\u003cp\u003ePast four actually, but I never tell people that I received that honor, let alone how many years I’ve earned it.\u003c/p\u003e\n\u003cp\u003e“I’ve heard about that program. I read the brochures when I was in eighth grade, but...” Rachel puts a hand over her mouth as if to prevent herself from saying anymore. “Anyhow, do you like it?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I do.” I did it, I talked her down. The relief running through me is like a chaser after a shot. I push away the instincts that I’m playing with an unpinned grenade. People like her, nights like this, they don’t come around, and I just want to hold on to this flame for a little longer. Guys like me, we don’t make girls like her smile. “It’s where I learned to rebuild the engine in my Mustang.”\u003c/p\u003e\n\u003cp\u003eA spark ignites in her violet eyes. “You rebuilt your own engine? That’s sweet. I’ve played with the idea of adding some modifications to mine to increase the horsepower.”\u003c/p\u003e\n\u003cp\u003eI flinch at the thought. “Why? Your car is a perfect virgin. Never touched and in great shape.”\u003c/p\u003e\n\u003cp\u003e“Which is why I haven’t, but between you and me—” Rachel leans her body in my direction as if she’s revealing a highly guarded secret “—I really wanted an ’04 Cobra.”\u003c/p\u003e\n\u003cp\u003eThat damn smile she’s already brought out in me once tonight crosses my face again. “An ’04 Cobra. That would be...” And I steal one of her words. “Sweet.”\u003c/p\u003e\n\u003cp\u003e“Yeah. It would, wouldn’t it?” Rachel rocks onto her toes and slides her long, beer-drenched hair behind her ear. “So, do you have a hair dryer?”\u003c/p\u003e\n\u003cp\u003eChapter 12\u003c/p\u003e\n\u003cp\u003eRachel\u003c/p\u003e\n\u003cp\u003eI PLACE THE DRYER ON the sink and run my fingers through my hair again. There—dry and officially beer-free. The edge of Isaiah’s dark blue T-shirt ends an inch short of my knees and I catch my silly smile in the blurry mirror. I’m wearing a guy’s shirt. Too freaking awesome.\u003c/p\u003e\n\u003cp\u003eI lower my chin to smell the shirt again. I want to wear this forever, without washing it. His dark, spicy aroma consumes the material. I peek at him from the corner of my eye, wondering if he spots me catching a whiff or if he knows how addicting his scent is to girls.\u003c/p\u003e\n\u003cp\u003eA knot forms in my throat. Does he have many girls?\u003c/p\u003e\n\u003cp\u003eAs promised, Isaiah sits on the kitchen counter on the other side of the room from me. He leans forward, his legs lazily stretched apart with his joined hands resting between them as he watches me.\u003c/p\u003e\n\u003cp\u003eHe’s observant. Overly so. I think he could tell me more about my actions than I could. A huge part of me doesn’t like it. In order for me to fit in at home, people can’t notice me. It’s harder to pull off being someone else when you’re the center of attention. But I’m not home. I’m miles from there. And here, in this room, I like how Isaiah looks at me as if I’m the only girl in the world.\u003c/p\u003e\n\u003cp\u003eOr like an antelope he’s going to pounce on.\u003c/p\u003e\n\u003cp\u003eMy heart patters faster at the thought of him pouncing on me.\u003c/p\u003e\n\u003cp\u003eI fiddle with my hair for a few more seconds to buy time. What do you say to a totally hot guy when you’re alone with him in his apartment?\u003c/p\u003e\n\u003cp\u003eAlone.\u003c/p\u003e\n\u003cp\u003eA thrill of tickles moves in the center of my chest, and I think of the way his strong hand caressed my face at the bar. The tickles explode into my bloodstream as an adrenaline rush and I release a long steady breath to keep myself calm.\u003c/p\u003e\n\u003cp\u003eI really, really want him to touch me again. \u003c/p\u003e","sourceLink":"https://allnovel.net/crash-into-you-pushing-the-limits-3/page-10.html","bookId":2754,"creation":"Oct 5, 2019 4:57:53 PM","modification":"Oct 5, 2019 4:57:53 PM"}
