{"id":84183,"no":14,"title":"Page 14","content":"\u003cp\u003eSeated at the table farthest from the couples slow-dancing in front of the stage, I cross one leg over the other. It’s a continual fidget meant to keep my limbs from falling asleep, and each time I move, I smooth out the material of my golden gown as if wrinkles will be the death of me. I think I look kinda pretty tonight, which is why every time I glimpse my reflection in the mirror my eyes water. I wanted Isaiah to see me this way.\u003c/p\u003e\n\u003cp\u003e“Would you like to dance?”\u003c/p\u003e\n\u003cp\u003eMy heart beats twice and I glance up, hoping and praying that somehow Isaiah has found me, even though I’m at an exclusive New Year’s Eve party at the Lieutenant Mayor’s house. I mean, it’s possible. At least it’s possible in the daydreams I’ve had since I sat at this corner table over an hour ago. I force a wannabe smile when I find Brian Toddsworth staring down at me. A month ago, I would have loved for him to ask me to dance. Today... Why didn’t Isaiah call?\u003c/p\u003e\n\u003cp\u003eI shrug my bare shoulders while shaking my head. Heat flushes my face when I realize I have yet to answer and that I’m conveying so many different body language signs that it probably appears I’m having a seizure. “No, thank you,” I barely whisper.\u003c/p\u003e\n\u003cp\u003eBrian belongs in a different realm of popular than me, and the thought of saying the wrong thing and becoming a laughingstock makes my insides squirm. As if he’s shocked by the response, Brian’s head rears back. “Are you sure?”\u003c/p\u003e\n\u003cp\u003e“Nice party, Brian.” My twin, Ethan, moseys over from his seat with my brothers. All of whom are watching Brian and me closely. Sort of like how vultures watch the last twitch of roadkill.\u003c/p\u003e\n\u003cp\u003eBrian extends his fist to Ethan and they knuckle bump. They’ve been friends since kindergarten. Brian and I’ve been friends since never.\u003c/p\u003e\n\u003cp\u003e“The party’s awful,” says Brian. “Everyone from school is at Sarah’s. Spending New Year’s schmoozing for my parents blows. Part of me hopes Dad loses the primary next spring.”\u003c/p\u003e\n\u003cp\u003eEthan jerks his head in my direction as if I’m a five-year-old who can’t follow a conversation. “Whatcha doing with Rachel?”\u003c/p\u003e\n\u003cp\u003eBrian’s cheeks redden. “Your mom mentioned to my mom that no one was talking to Rachel, and you know what happened last weekend, so I’m not in a position to disagree.”\u003c/p\u003e\n\u003cp\u003eWow, Brian didn’t even try to pretend I wasn’t a pity dance. When my heels click on the temporary wooden floor of the tent, the pair evidently remembers my existence.\u003c/p\u003e\n\u003cp\u003eEthan gestures at Brian then to me with his beer. “Can you try to have some tact when it comes to Rach? She is my sister.”\u003c/p\u003e\n\u003cp\u003eTwin. I prefer the word twin. Gavin, Jack and West are my brothers. I feel a special connection with Ethan. Brian acknowledges me with a glance. “I meant no disrespect. My parents grounded me when they found my pot, and if I do what Mom wants she’ll back off.”\u003c/p\u003e\n\u003cp\u003eI stare at my hands laced in my lap. I’ve always wanted to be told that dancing with me is a punishment reserved for the severest of offenders. Brian, I guess, rethinks his words and backtracks. “It’s not that you aren’t pretty or anything. You are.”\u003c/p\u003e\n\u003cp\u003e“What did you say?” asks Ethan. I bite my lower lip. Shut up, Ethan. Because my twin and I can’t speak telepathically, Ethan continues, “Are you into Rachel?”\u003c/p\u003e\n\u003cp\u003e“Hell no.”\u003c/p\u003e\n\u003cp\u003eAwesome. What girl doesn’t want to hear that?\u003c/p\u003e\n\u003cp\u003e“You said she’s pretty,” Ethan spits out as if that comment is an insult.\u003c/p\u003e\n\u003cp\u003e“She is,” says Brian. “But I’m not into her.”\u003c/p\u003e\n\u003cp\u003eEthan’s shoulders sag with relief. “Good.”\u003c/p\u003e\n\u003cp\u003eGreat. I think I’m going to drive a fork into my brother’s abdomen.\u003c/p\u003e\n\u003cp\u003e“Look.” Brian turns to face me. “You’re nice, but you’re Rachel, you know?”\u003c/p\u003e\n\u003cp\u003eYes, I’m well aware of who I am: the obsessively shy and anxious girl who stumbles over her own name. The one with the ridiculously protective brothers. “It’s all right.”\u003c/p\u003e\n\u003cp\u003eIt’s not. But what am I going to do? The only guy who has ever shown the least bit of interest in me never called, so why should anything else in my life be different?\u003c/p\u003e\n\u003cp\u003e“Apologize to my sister,” says Ethan.\u003c/p\u003e\n\u003cp\u003eBrian’s forehead furrows. “For what?”\u003c/p\u003e\n\u003cp\u003e“For existing.”\u003c/p\u003e\n\u003cp\u003eBrian laughs and bumps Ethan’s fist again. “Sorry I exist, Rachel. And Ethan, I’ll catch you at Sarah’s party later.”\u003c/p\u003e\n\u003cp\u003eLater? With the self-proclaimed pot smoker? I tilt my head while Ethan briefly closes his eyes. I straighten my back, tap the seat next to me, then fold my hands daintily over my knees. “Sooo? How are you doing?”\u003c/p\u003e\n\u003cp\u003eEthan collapses in the seat and rests his beer on the table. “It’s nothing. Let it go.”\u003c/p\u003e\n\u003cp\u003eI bat my eyelashes and smile like a stupid Southern belle because he must think I’m a moron if he believes I’m buying that. “It didn’t sound like nothing.”\u003c/p\u003e\n\u003cp\u003e“Brian experimented with pot. It’s no big deal.”\u003c/p\u003e\n\u003cp\u003e“Does that mean you experimented with pot?”\u003c/p\u003e\n\u003cp\u003eHe stretches out his legs and remains silent. I drop the Southern belle act and lean into him. “If that conversation took place between West and any of his friends, I’d let it go. West does stupid things. It’s what West was born to do. But you—you don’t do stupid things.”\u003c/p\u003e\n\u003cp\u003eEthan turns his head toward me, and all I see is dark eyes and dark hair—a reminder that he’s my opposite. “I was with him, but I didn’t do it, okay?” He holds out his pinkie. “I swear.”\u003c/p\u003e\n\u003cp\u003eI press his pinkie down and pat his knee. The offer of a pinkie has always been enough for the two of us. If he swears it, I believe it.\u003c/p\u003e\n\u003cp\u003eEthan regards my cell on the table. “Are you expecting a call?”\u003c/p\u003e\n\u003cp\u003eThe disbelief in his voice stings. “No.” Unfortunately. “I’m not.”\u003c/p\u003e\n\u003cp\u003eYet it doesn’t stop me from looking at the wretched device. Because staring at it for ten hours straight will magically remind Isaiah that I gave him my number.\u003c/p\u003e\n\u003cp\u003e“I’ve been thinking,” says Ethan.\u003c/p\u003e\n\u003cp\u003e“Which is never a good thing,” I cut him off. “It will only strain the brain cells that actually function and those two deserve a break.”\u003c/p\u003e\n\u003cp\u003eHe smirks. “You know, if you’d crawl out of your shell and be yourself around everyone else, then that phone would be ringing nonstop, you might attend an occasional nonadult party and you wouldn’t have to rely on Brian for a pity dance.”\u003c/p\u003e\n\u003cp\u003eOnce more, I focus on my lap and again smooth out my dress. I was myself with Isaiah, and look where that got me. “This is me.”\u003c/p\u003e\n\u003cp\u003e“You hate attention...I get it. But I hate how everyone sees you. If it bothers me then I know it’s got to bother you.”\u003c/p\u003e\n\u003cp\u003eThe back of my neck bristles and my spine straightens. Ethan’s never been so blunt and I don’t care for it. “Sorry I can’t be perfect like you.” Lead scorer on the lacrosse team, voted onto the student council, popular...not me. Just like the rest of my fabulous brothers.\u003c/p\u003e\n\u003cp\u003e“Come on,” he says. “Don’t be like that. I’m only pointing out what you already know. Everyone thinks you’re quiet, shy, a little off because of your anxiety attacks in middle school and...” He trails off and picks at the label on his beer. “And they think you’re sick.”\u003c/p\u003e\n\u003cp\u003eMy gaze jumps to his. “I am not sick.” I am not Colleen.\u003c/p\u003e\n\u003cp\u003eThere’s an anger building in his eyes that I’m unfamiliar with. “I thought you weren’t either, but then I was the one holding your hair back a few days ago when you vomited in a toilet. So if you weren’t sick, what were you?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t sick.”\u003c/p\u003e\n\u003cp\u003e“And yet you claim you’re over the panic attacks. So which rumor is true? Are you the girl who spent time in the hospital our freshman year because you’re sickly, or are you the girl who spent time in the hospital because you had panic attacks?”\u003c/p\u003e\n\u003cp\u003eI hate that word: sick. I also hate the words panic, fear and coward. A lump forms in my throat, and I can’t decide if I’m angry or hurt or both. “That is low.”\u003c/p\u003e\n\u003cp\u003e“Lying to me is low.”\u003c/p\u003e\n\u003cp\u003eMy mouth pops open and no words come out. Part of me is dying to tell him. To let someone into my personal nightmare, but I’ve gone this long hiding my secret and if he knows, will he tell Mom? “One panic attack. That’s it.”\u003c/p\u003e\n\u003cp\u003e“You’re lying, Rachel.”\u003c/p\u003e\n\u003cp\u003e“I’m not.”\u003c/p\u003e\n\u003cp\u003eHe leans forward. “You are.”\u003c/p\u003e\n\u003cp\u003eBecause of our relationship, he can read my poker face like no one else. What’s surprising is that, after two years, he’s just catching on to the lie.\u003c/p\u003e\n\u003cp\u003e“You can convince Mom that you aren’t the girl who obsesses over Cobras, reads Motor Trend, sneaks out after dinner to bathe in axle grease and skips curfew so she can drive her car. If you can do that, I think you’re capable of lying to me about being over the panic attacks.”\u003c/p\u003e\n\u003cp\u003eI slam my hand on the table and people at a nearby table gawk. Ethan waves at them while I lower my head, embarrassed.\u003c/p\u003e\n\u003cp\u003e“You really want the truth?” I whisper.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Rachel. I never knew the two of us stopped telling each other the truth.”\u003c/p\u003e\n\u003cp\u003eHypocrite. “What do you do on twin amnesty night?”\u003c/p\u003e\n\u003cp\u003eA muscle near his eye flinches. “Lying and withholding information are different.”\u003c/p\u003e\n\u003cp\u003e“Fine. Truth? You and I both know that I can’t be me. She isn’t who Mom wants.”\u003c/p\u003e\n\u003cp\u003e“This isn’t about Mom,” he harshly whispers back. “This is about you and me.”\u003c/p\u003e\n\u003cp\u003eMy lower lip trembles. I made my brother, my best friend, my only friend, mad at me. Ethan squeezes my hand, then lets me and the subject go. “Don’t cry. I hate it when you cry.”\u003c/p\u003e\n\u003cp\u003eHe finishes his beer in two gulps. “Do you ever wonder what it would have been like if we’d been born to anyone else?”\u003c/p\u003e\n\u003cp\u003eMy stomach aches from the raw truth of his question. “All the time.”\u003c/p\u003e\n\u003cp\u003e“Rachel!” my mother calls. When she’s sure she’s caught my attention, she motions for me to join her.\u003c/p\u003e\n\u003cp\u003eI force my practiced smile on my lips. “This is why I can’t be me. Can you imagine how her friends would react if I discussed air shifters and turbochargers? These events...this is why she had another daughter. This is why I’m alive.”\u003c/p\u003e\n\u003cp\u003eGathering my gown, I stand. Ethan pulls on my hand and I know he wants me to look at him, but I refuse. “You make her happy, Rach. And we thank you for that. No one likes it when Mom’s sad.”\u003c/p\u003e\n\u003cp\u003eI release a breath, searching for my nonexistent happy place. “I get tired of playing the role.”\u003c/p\u003e\n\u003cp\u003e“I know.” He tugs on my hand again, and this time I give in. He flashes his playful smile. “Even I don’t know what an air shifter is.”\u003c/p\u003e\n\u003cp\u003eI smack his arm, and my smile becomes relaxed as I hear his laughter.\u003c/p\u003e\n\u003cp\u003eMy mother is gorgeous in her slim-fitting red sequined dress and slicked-back blond hair. Like always, Mom is the center of a group. People are naturally drawn to her, and she naturally loves the attention.\u003c/p\u003e\n\u003cp\u003eThe band has progressed onto jazz, and my mother’s movements seem to flow with the beat. I need to go to the bathroom, and I’ve waited too long in the hopes Mom would maneuver her social networking away from the front of the tent. It never happened, so here I am—standing with a full bladder, in a golden gown, being gawked at by a group of aging women. The smile becomes harder to hold. \u003c/p\u003e","sourceLink":"https://allnovel.net/crash-into-you-pushing-the-limits-3/page-14.html","bookId":2754,"creation":"Oct 5, 2019 4:57:53 PM","modification":"Oct 5, 2019 4:57:53 PM"}
