{"id":84205,"no":36,"title":"Page 36","content":"\u003cp\u003eZach nervously laughs, but before he can try to deny it, I hook a foot around the chair next to me and shove it into his legs. “Sit.”\u003c/p\u003e\n\u003cp\u003eHe looks around, trying to save face, but sits anyway. Once upon a time, he and I could have been considered friends and because of that, I give him this break. “You and I both know that Eric’s bad shit. If you’ve fallen in, maybe I can help you out.”\u003c/p\u003e\n\u003cp\u003eZach bows his head as he pulls his legs under the chair. “He just wants Rachel to race me. That’s it.”\u003c/p\u003e\n\u003cp\u003eFuck me. My fingers tighten into fists. “He wants Rachel and me to fail.”\u003c/p\u003e\n\u003cp\u003eHis head snaps up. “You’re seeing this all wrong. Eric wants to help us. He said if the two of us work for him then he can pay us cash. Real cash. Not the minimum wage we’re going to end up with after we graduate. We’ll be kings, Isaiah. Not the trash we are now.”\u003c/p\u003e\n\u003cp\u003eI kick the wall between us and the keyboard falls to the floor. “Eric owns you now.”\u003c/p\u003e\n\u003cp\u003e“Not own. He’s helping me, just like he wants to help you.”\u003c/p\u003e\n\u003cp\u003eBefore I can ask how the hell he’s become so delusional he believes any of that shit, Mr. Holden enters the room. “Test results are in. I’ll call you out one at a time to go over the results. Isaiah, let’s go.”\u003c/p\u003e\n\u003cp\u003eMy heart thrashes and I stand, trying to control the anger. I lean down and whisper the threat. “Stay the fuck away from Rachel.”\u003c/p\u003e\n\u003cp\u003e“You can’t touch me,” Zach replies.\u003c/p\u003e\n\u003cp\u003eSince he’s under Eric, maybe not, but Eric’s underestimating what I would do to keep Rachel safe.\u003c/p\u003e\n\u003cp\u003eChapter 44\u003c/p\u003e\n\u003cp\u003eRachel\u003c/p\u003e\n\u003cp\u003eWITH MY HAND LINGERING OVER the equation, my pencil rocks back and forth. Third-period Physics is torture. Both of my brothers are in here, along with over half of their friends, and the remaining people in the class love to gossip about me. We were supposed to separate into groups of four, but let’s be honest, I don’t like groups.\u003c/p\u003e\n\u003cp\u003eThe sun filters through the windows and bathes me in warmth. I could probably focus better if I could stop daydreaming about Isaiah. Each time I think of how he rolled us in bed and how his body covered mine, I smile.\u003c/p\u003e\n\u003cp\u003e“Have you figured it out yet, Rach?” West whispers.\u003c/p\u003e\n\u003cp\u003eThat snaps me out of the daydream. Ethan and West, of course, are in a group together, with two of their buddies. Because the room is uneven, I avoided a group, but I can’t ditch my brothers. They hover next to me.\u003c/p\u003e\n\u003cp\u003e“There are four of you and one of me. I’d say your odds are better than mine,” I answer. The pencil moves faster in my hand.\u003c/p\u003e\n\u003cp\u003e“But you’re good at this shit,” says West.\u003c/p\u003e\n\u003cp\u003eWith a screech of metal against the linoleum floor, Ethan slides his desk closer to mine. “She’s got an answer. Give it here.”\u003c/p\u003e\n\u003cp\u003eBefore I can protest, West grabs my sheet and places it in the middle of his friends. “Thank you, baby sister.”\u003c/p\u003e\n\u003cp\u003e“I’m not done yet,” I whisper severely. “That’s only half the equation.”\u003c/p\u003e\n\u003cp\u003e“Better than a blank sheet,” mutters Ethan.\u003c/p\u003e\n\u003cp\u003e“Besides.” West winks as he flicks my paper back at me. “It’s all about family.”\u003c/p\u003e\n\u003cp\u003e“Mr. Young.” Our Physics teacher looms over the group.\u003c/p\u003e\n\u003cp\u003e“Which one?” asks West. “There are two of us and a Miss.”\u003c/p\u003e\n\u003cp\u003eOur physics teacher doesn’t like West. He’s a smart-ass. Which means she’s not a big fan of me and Ethan by default. “I don’t remember Rachel being included in your original group.”\u003c/p\u003e\n\u003cp\u003eI press my face into my hand and tilt it so that I’m looking out the window and not at the class watching the power trip.\u003c/p\u003e\n\u003cp\u003e“She’s our sister. Of course she’s included in our group.”\u003c/p\u003e\n\u003cp\u003ePaper crinkles, and I peek to see her examining everyone’s sheets. “It’s the same answer, but half done.”\u003c/p\u003e\n\u003cp\u003eWest relaxes in his seat, totally unaffected by her accusation of copying. “We’re a group. I think that’s expected.”\u003c/p\u003e\n\u003cp\u003e“Then explain it,” she says. “Explain how you solved half the answer.”\u003c/p\u003e\n\u003cp\u003eWest’s mouth pops open, then he shuts it. “Rachel was in the process of explaining it to us. See, we were a little lost, and we didn’t want to hold her back so she went ahead with the work and stopped halfway so she could teach us.”\u003c/p\u003e\n\u003cp\u003eOur physics teacher’s eyes settle on me. So do West’s and Ethan’s. So do the eyes of their friends and of everyone else who has made fun of me since middle school.\u003c/p\u003e\n\u003cp\u003e“Well then, Rachel.” In an overdramatic swooping motion, our teacher gestures me toward the front of the room. “Since you’re so generous, why don’t you go to the board and teach the rest of the class how to complete the first half of the equation?”\u003c/p\u003e\n\u003cp\u003eBlood and heat rush to my face. Besides the fact this is one of my worst nightmares, I’m not even sure if I have the equation right. What if I’m wrong? What if I fall apart? At least with the speeches I can prepare for the impending meltdown.\u003c/p\u003e\n\u003cp\u003eThis...this is out of nowhere. Begging for a way out, I frantically glance at West and Ethan. West locks his eyes on the floor while his fingers drum against his desk in an angry rhythm. “That is not necessary.”\u003c/p\u003e\n\u003cp\u003e“I think it is,” says Mrs. Patterson. “Unless you want to explain the work, but keep in mind, what goes on that board is your group’s grade.”\u003c/p\u003e\n\u003cp\u003eWest jerks in his seat. Ethan leans over and whispers, “He’s going to blow.”\u003c/p\u003e\n\u003cp\u003eWest is one detention away from suspension, a fact Ethan and I have helped hide from Mom, and Ethan’s grades have dropped this semester. He can’t risk a bad score. “I’ll do it.”\u003c/p\u003e\n\u003cp\u003eWest’s head shakes back and forth, heat from his anger creating small red circles on his cheeks. Ethan kicks at our brother from underneath the desks. The two share a look, and both immediately focus on the floor.\u003c/p\u003e\n\u003cp\u003eWhen I reach the board, my body trembles as I grab the dry erase marker. I clear my throat twice and perspiration forms along my hairline. A couple of girls in the corner giggle.\u003c/p\u003e\n\u003cp\u003eMy voice breaks as I incoherently explain how I solved half the equation. Due to my quaking hand, the numbers barely resemble squiggles. I clear my throat again, this time tasting bile. I inhale, only for the air to stop before reaching my lungs. My palms sweat, and the marker slips from my grasp. It taps the floor twice before rolling under the teacher’s desk. The world becomes a tunnel. Around me, laughter erupts.\u003c/p\u003e\n\u003cp\u003e“Rachel.” Mrs. Patterson sounds distant, almost like an echo. “I was wrong. As the teacher, I should be showing the class.”\u003c/p\u003e\n\u003cp\u003eMy breathing is short, shallow, and my head has that floating feeling like when I’m sick with a fever. A buzzing noise fills my ears. Everyone stands and gathers their things. I try to suck in air, but my lungs won’t expand. If I can’t breathe, I’ll die.\u003c/p\u003e\n\u003cp\u003eEthan appears in my line of vision. “She’s fine, Mrs. Patterson. Aren’t you, Rachel?”\u003c/p\u003e\n\u003cp\u003eI nod. No, I’m not fine. Ethan wraps an arm around me and ushers me into the hall. Cold metal supports my back. A hanging lock digs into my kidney.\u003c/p\u003e\n\u003cp\u003eWest appears in the tunnel. “What the hell, Ethan? I thought she was over this shit.”\u003c/p\u003e\n\u003cp\u003e“Break into her locker and get her stuff,” he says. “We need to get her to a bathroom.”\u003c/p\u003e\n\u003cp\u003eLunch is me, West, Ethan and a bottle of Sprite. Because West plays every sport imaginable, he was able to sneak us into the guy’s changing room. Sitting on an old jersey that had been stuffed into the abyss of West’s locker, I glance at the toilet bowl containing the remnants of breakfast.\u003c/p\u003e\n\u003cp\u003eConfident I’m going to survive, I flush the toilet and peek at my two brothers, who have hovered over me since the end of third period. “See,” I say with a raspy voice. “No blood.”\u003c/p\u003e\n\u003cp\u003eBut my throat is raw and sore. If I continue to vomit with the attacks, it won’t be long until the blood vessels in my throat crack.\u003c/p\u003e\n\u003cp\u003eHolding on to the stall door, West’s knuckles turn white. “How long?”\u003c/p\u003e\n\u003cp\u003eI drink slowly, buying myself not nearly enough time. West’s fingers tap a death march. He isn’t going to let this go. “It never stopped,” I answer.\u003c/p\u003e\n\u003cp\u003eHis head whips to Ethan. “And you’ve been in on this?”\u003c/p\u003e\n\u003cp\u003eEthan won’t stop staring at the toilet. “For a few weeks.”\u003c/p\u003e\n\u003cp\u003eI wince when West slams the door against the neighboring stall. “She was in the hospital over this shit. Do you want to watch her body waste away again?”\u003c/p\u003e\n\u003cp\u003eTears threaten my eyes, and I rub at my nose. “Just stop.”\u003c/p\u003e\n\u003cp\u003e“Stop!” West shouts. “Why should I stop? You’ve been lying!”\u003c/p\u003e\n\u003cp\u003e“Whatever,” Ethan spits at West. “You pretended not to see it. So did I. Look me in the eye...no, look Rachel in the eye and tell her that you haven’t suspected the truth the entire time. She lied to make Mom happy, to make us happy and you’re pissed the dream is over.”\u003c/p\u003e\n\u003cp\u003eWest takes two steps and stands nose to nose with Ethan. The anger in the air between them is so thick I could gag. They’re the same height, both over six feet. Ethan with dark hair and dark eyes. West with blond hair and blue eyes. Brothers less than a year apart.\u003c/p\u003e\n\u003cp\u003eWest shoves his finger in Ethan’s chest. “You should have told me.”\u003c/p\u003e\n\u003cp\u003e“Now you know.”\u003c/p\u003e\n\u003cp\u003eAfter a few more tense seconds, West eases away. “What now?”\u003c/p\u003e\n\u003cp\u003e“We keep the secret,” says Ethan. “Mom’s happy. Jack’s working on Gavin.”\u003c/p\u003e\n\u003cp\u003eWest becomes a statue. “She knows about Gavin?”\u003c/p\u003e\n\u003cp\u003e“Yes. She knows he’s out of work.” Something in the way Ethan overpronounces the words makes me question their meaning, but West is finally calming down and I don’t want to risk another eruption.\u003c/p\u003e\n\u003cp\u003eWest’s shoulders visibly relax. “And the speeches?”\u003c/p\u003e\n\u003cp\u003e“We help her. One of us should go with her to the speeches and deflect Mom if she has an attack. And Rachel will tell us if her panic attacks escalate to blood.”\u003c/p\u003e\n\u003cp\u003eWest picks up the bag I keep in my gym locker with extra clothes. “I got this for you. You’ve got ten minutes to take a shower and make it to fourth period.”\u003c/p\u003e\n\u003cp\u003eBoth of my brothers stare at me, and I draw my knees to my chest. I hated this feeling back in middle school, and I hate this feeling now. No matter what I do in my life, the two of them will always view me as someone to be controlled.\u003c/p\u003e\n\u003cp\u003eBy the time sixth period rolls around, the school salivates with the news: recluse Rachel Young is weird again. When I enter the library for my internship, I’m greeted by the sound of giggles. The words whispered between ponytail tosses are not lost on me. “I told you she was strange...” Chuckles and lower whispers. “...completely freaked out in physics.”\u003c/p\u003e\n\u003cp\u003eUnable to face anyone, I duck into one of the stacks. I suck in a breath, not for an attack, but to stop the tears. Why? Why am I like this?\u003c/p\u003e\n\u003cp\u003eAt the back wall, I sink to the ground and my phone vibrates. I pull it out and see the one person who doesn’t treat me as weird or as incompetent. Isaiah: Look out the window.\u003c/p\u003e\n\u003cp\u003eMy forehead furrows. I grab my pack and walk to the windows overlooking the student parking lot. In the back, Isaiah leans against his black Mustang. My smile automatically appears. \u003c/p\u003e","sourceLink":"https://allnovel.net/crash-into-you-pushing-the-limits-3/page-36.html","bookId":2754,"creation":"Oct 5, 2019 4:57:53 PM","modification":"Oct 5, 2019 4:57:53 PM"}
