{"id":84217,"no":48,"title":"Page 48","content":"\u003cp\u003eMy stomach cramps, and I roll away from him with the blast of heat rushing through my body.\u003c/p\u003e\n\u003cp\u003e“Jesus!” Isaiah scrambles beside me. “There’s blood.”\u003c/p\u003e\n\u003cp\u003eChapter 65\u003c/p\u003e\n\u003cp\u003eIsaiah\u003c/p\u003e\n\u003cp\u003ePROMISE THEY WON’T KNOW...\u003c/p\u003e\n\u003cp\u003eCraving a physical connection, I slide my finger along the back of Rachel’s hand. She’s asleep. Has been for a while. Curled in the fetal position in the middle of my bed, Rachel wears the mask of a ravaged person. Somehow, I missed the signs: dark circles under her eyes, the clothes that once fit perfectly now hang, her skin so pale it’s translucent.\u003c/p\u003e\n\u003cp\u003eRachel told me she had attacks, that she ended up in the hospital once, and that she hides them from her family. I never thought to ask if she was concealing them from me.\u003c/p\u003e\n\u003cp\u003eHer eyes press tightly in her sleep, and she flinches as she swallows. I wish she’d sleep deeply, but she doesn’t. Staying restless, Rachel turns her head. I tuck the blanket back around her, whispering for her to rest.\u003c/p\u003e\n\u003cp\u003e“Isaiah,” Abby says softly from the doorway. “Everyone’s here.”\u003c/p\u003e\n\u003cp\u003eI nod and Abby slips behind the door. Everyone being here would be Noah’s doing, not mine. He found us—me cradling a broken Rachel in my arms—and drove us home. Took everything I had not to rush Rachel into the E.R., but she made me promise not to. I’ve never considered going back on my word as much as I do right now.\u003c/p\u003e\n\u003cp\u003eThe world is stacked against Rachel and me. The money is due this weekend. We’re down a car and we aren’t even close to the amount. Rachel’s body is worn, her spirit drowning. If we don’t pay off this debt, a nightmare will visit us both. Eric will come after me and he’ll hurt her. My fingers ball into a fist. I’ll die before I let that happen.\u003c/p\u003e\n\u003cp\u003eA rustle of sheets, then soft fingers glide against mine. I glance at Rachel and meet glazed-over blue eyes. The spark is gone, taking the violet hue along with it.\u003c/p\u003e\n\u003cp\u003e“How are you?” I ask, and focus on not demanding why the hell she’s kept all this from me. We’ll have the conversation, but not in this moment.\u003c/p\u003e\n\u003cp\u003e“Okay,” she says in a hoarse, cracked voice. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eI shake my head, not wanting her apology. “Me, too.” I lace my fingers with hers. “Why did you run from me?”\u003c/p\u003e\n\u003cp\u003e“I saw you hug Beth,” she croaks.\u003c/p\u003e\n\u003cp\u003e“I love you. Not anyone else.”\u003c/p\u003e\n\u003cp\u003e“I know. I’m sorry. My head got messed up. I was worried about you and we had a fight and I didn’t know if you were alive and when I saw you two together...” Rachel lets the words trail off. “Beth’s strong.”\u003c/p\u003e\n\u003cp\u003e“So are you,” I say.\u003c/p\u003e\n\u003cp\u003e“You don’t think that.”\u003c/p\u003e\n\u003cp\u003e“Fuck that,” I snap, then close my eyes to rein in my temper. I suck in a breath before reopening them. “I do think that. Most girls I know would be lying under a bed in the fetal position after living a day with Eric on their backs. You’ve stood strong the entire time.”\u003c/p\u003e\n\u003cp\u003e“Except now.”\u003c/p\u003e\n\u003cp\u003eI’m shaking my head again. “Everyone has a breaking point, and I’d lay odds this isn’t Eric.” But I won’t go near a conversation about her family. “Your body may need a break, but your spirit is still strong.”\u003c/p\u003e\n\u003cp\u003e“I bet this wouldn’t happen to Beth.”\u003c/p\u003e\n\u003cp\u003e“No, it wouldn’t, because Beth always ran.”\u003c/p\u003e\n\u003cp\u003eRachel blinks.\u003c/p\u003e\n\u003cp\u003e“Beth was always a runner. She may have stood in place, but she always hid behind the wall she built, and if that didn’t work, she ran to a guy, to drugs, to anywhere other than where she should have been, to forget. You and Beth—you’re night and day.”\u003c/p\u003e\n\u003cp\u003e“If you really think that then let me race Zach.” Her voice breaks, leaving her only able to whisper. “Let me bet the seven hundred and race him. I’d do it without you, but he already said that he won’t race me without your permission because he doesn’t want to mess with you.”\u003c/p\u003e\n\u003cp\u003eThe muscles in my jaw contract. “Is that all he said?”\u003c/p\u003e\n\u003cp\u003eShe winces. “He’d also race me if I broke up with you. But ignore that. Isaiah, we’re already in trouble. If I win, then we try to double the fourteen hundred, and then we try to double again. Let me help dig us out of this hole.”\u003c/p\u003e\n\u003cp\u003eRachel’s so pale I can see the veins beneath her skin. She could win. Rachel’s been practicing. Stolen moments between us in abandoned parking lots. All she lacked was experience and confidence. My angel has both now. Even with her body defying her, she’s a force of nature.\u003c/p\u003e\n\u003cp\u003eBut what if the race Zach’s offering isn’t innocent? What if his association with Eric drags her in deeper? Not able to see the angle he’s playing, I can’t take the risk.\u003c/p\u003e\n\u003cp\u003e“Everyone’s waiting on me,” I say as a cop-out. “Let me talk to them.”\u003c/p\u003e\n\u003cp\u003eShe casts her eyes down. “We won’t work if you never trust me to be strong enough.”\u003c/p\u003e\n\u003cp\u003eI kiss her forehead. “It has nothing to do with trust or strength.” But with keeping her safe. “Rest. You can’t do anything if you don’t sleep.”\u003c/p\u003e\n\u003cp\u003eI close the door to the bedroom behind me and freeze when I assess the room. All eyes fall on me. Echo and Abby lean against the kitchen counter. Noah stands near the couch. Ryan and Beth sit next to Logan, who has his bum leg propped on the old coffee table.\u003c/p\u003e\n\u003cp\u003e“I thought you were out,” I say to Logan. “And you were with your dad.”\u003c/p\u003e\n\u003cp\u003e“Dad works third shift,” he replies. “He asked Ryan to take me home. I’m out of driving. Doesn’t mean my mind stopped working.”\u003c/p\u003e\n\u003cp\u003eRyan snorts. “That’s up for debate.” I throw him a questioning glare, and he earns a little respect when he doesn’t look away.\u003c/p\u003e\n\u003cp\u003e“Beth and Logan see something in you,” he says. “But know if you hurt either one of them again, I’ll kick your ass.”\u003c/p\u003e\n\u003cp\u003eFair enough. “Noted. But good luck with that.”\u003c/p\u003e\n\u003cp\u003e“Now that the pissing contest is over,” says Abby, “how’s Rachel?”\u003c/p\u003e\n\u003cp\u003eI shrug. Rachel wouldn’t want her business discussed.\u003c/p\u003e\n\u003cp\u003e“Abby and I told them everything,” Logan says, unrepentant. “In detail.”\u003c/p\u003e\n\u003cp\u003e“Wasn’t your place.” Embarrassment thinly disguised as anger seeps into my tone.\u003c/p\u003e\n\u003cp\u003e“Wasn’t, but I did it anyhow.”\u003c/p\u003e\n\u003cp\u003e“I borrowed two thousand dollars from my brothers’ parents.” Noah jumps in, possibly to stop my anger at Logan from accelerating. Noah’s a proud guy, and that type of gesture had to kill his soul. “To cover rent for the semester. I hoped to buy us enough time until you got a job where you could support yourself. The money is yours.”\u003c/p\u003e\n\u003cp\u003eAn understanding passes between us. If I accept the money, Noah moves into the dorms and I return to foster care. “It’s not enough.”\u003c/p\u003e\n\u003cp\u003e“More than half,” says Logan. “We still have that seven hundred.”\u003c/p\u003e\n\u003cp\u003e“Fine, twenty-seven hundred, but we’re still short.”\u003c/p\u003e\n\u003cp\u003e“I’ve got five hundred saved to buy a car,” says Beth. She winks at Ryan. “You’ll have to drive me around longer.”\u003c/p\u003e\n\u003cp\u003eBefore I can tell her no Logan says, “Thirty-two hundred.”\u003c/p\u003e\n\u003cp\u003eNoah stretches his arms out to his sides. “And we race for the rest.”\u003c/p\u003e\n\u003cp\u003eWe’ve entered the land of fantasy. “With what? Your piece of shit couldn’t beat a Yugo.”\u003c/p\u003e\n\u003cp\u003eEcho crosses the room and curls around Noah. “No, but I bet a ’65 ’Vette could.”\u003c/p\u003e\n\u003cp\u003e“No, Echo.” The Corvette belonged to her brother. It’s the only memory she has left of him. “The car is vintage and worth more than my sorry ass. Racing it could burn out the engine.”\u003c/p\u003e\n\u003cp\u003e“Could,” she says. “But Noah would win first. We can always fix the car. You’ve done it before.”\u003c/p\u003e\n\u003cp\u003eNo. I shift my gaze to Noah. “Eric will find out that you helped. He’ll mark both you and Echo.”\u003c/p\u003e\n\u003cp\u003eA dangerous shadow crosses Noah’s face as he holds Echo tighter. “I can take care of what’s mine. Besides, Eric will back off once he’s paid.”\u003c/p\u003e\n\u003cp\u003eHe may not be wary of Eric, but I am. I’m not sure I can allow the target on his back. I glance at the clock on the microwave. “I’ve got to get Rachel home in time for curfew. I’ll drive her car, but I need someone to follow to bring me home.”\u003c/p\u003e\n\u003cp\u003e“I’ll do it,” says Abby.\u003c/p\u003e\n\u003cp\u003e“You don’t have a car,” I say.\u003c/p\u003e\n\u003cp\u003e“I told Tom about the accident. He’s going to let you use one of his cars until you get your Mustang working again. I’ll get it, then meet you at Rachel’s.”\u003c/p\u003e\n\u003cp\u003e“Fine.”\u003c/p\u003e\n\u003cp\u003eAbby leaves and a second later I follow. She stalls near the front entrance, waiting for me to join her. “I know what you’re thinking, Isaiah, and I think you’re wrong.”\u003c/p\u003e\n\u003cp\u003eI place my hand over the door handle, keeping her there. “What exactly am I thinking?”\u003c/p\u003e\n\u003cp\u003e“The same thing I think when I look in the mirror every morning—that’s the face of someone living in pissed-off desperation.”\u003c/p\u003e\n\u003cp\u003e“A few weeks ago you wanted me to steal. A thousand dollars a car. I could make the money in one night and have Rachel on my arm by morning, remember?”\u003c/p\u003e\n\u003cp\u003eAbby rubs her hands over her face. “That was before.”\u003c/p\u003e\n\u003cp\u003e“Before what?”\u003c/p\u003e\n\u003cp\u003e“Before I met Rachel. Before she became my friend. Before I saw how happy she made you. Before I saw that you could be like Noah and get out of this part of town. You got your certification, a job waiting after graduation and a girl who loves you. If you steal those cars...” She stares at her feet. “It’ll change you. Once you go down that road, there’s no going back.”\u003c/p\u003e\n\u003cp\u003eAbby hates selling drugs, but she’s stuck. Her family has seen to that. So has her employer. “I’ll be in and then right back out,” I say.\u003c/p\u003e\n\u003cp\u003e“Yeah, keep telling yourself that. You’ll be owned. Not as bad as if Eric owns you, but they’ll always hold what you’ve done over your head. You’ll never be free.”\u003c/p\u003e\n\u003cp\u003eI’m not free. The future I once dreamed of has crumbled into dust. “I don’t care about my freedom anymore. This is about Rachel.”\u003c/p\u003e\n\u003cp\u003eThe door upstairs opens and closes. Rachel appears at the top of the stairs. I’ve got thirty-two hundred in seed money and only one night to race. If I take everyone up on their offer, I’ll go back to foster care and Noah and Echo will have targets painted on their backs. I would be wreaking all this damage in the hope I can win at the dragway.\u003c/p\u003e\n\u003cp\u003eRachel holds tightly to the banister. Yeah, Abby’s employer will own me, but Rachel will be safe. “Make the deal, Abby.”\u003c/p\u003e\n\u003cp\u003eChapter 66\u003c/p\u003e\n\u003cp\u003eRachel\u003c/p\u003e\n\u003cp\u003eISAIAH PARKS MY CAR A block from the security gate of my neighborhood. Headlights flash behind us as Abby follows his lead. Her lights turn off, indicating that she’s granting us time.\u003c/p\u003e\n\u003cp\u003eWe’ve been silent—Isaiah and I. Not that silence is unusual between us, but it’s never been so heavy. We’re both angry, hurt. I’ll admit to being scared. “We’re not going to make the money, are we?”\u003c/p\u003e\n\u003cp\u003e“Eric will be paid off this weekend,” he says. “What happened tonight, the panic attack, that’s been going on for a while, hasn’t it?” \u003c/p\u003e","sourceLink":"https://allnovel.net/crash-into-you-pushing-the-limits-3/page-48.html","bookId":2754,"creation":"Oct 5, 2019 4:57:53 PM","modification":"Oct 5, 2019 4:57:53 PM"}
