{"id":84177,"no":8,"title":"Page 8","content":"\u003cp\u003eI swallow and grab a paper napkin out of the dispenser on the table. My heart beats faster as I let the events of the past hour register. “Are the police here?”\u003c/p\u003e\n\u003cp\u003eHe says nothing and my hands start to sweat. I smooth the napkin flat, then begin to fold. “Should we leave? Or stay?” Panic stabs my chest. My car. Oh, crap, my baby. “What about my car? Is it safe? Will they find it? Will someone else take it? And your car? What do we do?”\u003c/p\u003e\n\u003cp\u003e“Rachel,” Isaiah says in a low, calm tone that makes me meet his eyes. “We’re good. We lost the police. Your car’s in the garage where I work. And someone has to be damn desperate to jack my piece of shit.”\u003c/p\u003e\n\u003cp\u003eMy muscles still, including my heart. Did he just say... “Your car is not a piece of shit.” I flinch at using the word shit and the right side of his mouth turns up in response. I stare at the napkin my hands continually fold and refold. I don’t like that he reads me so clearly.\u003c/p\u003e\n\u003cp\u003e“She’s...she’s gorgeous,” I stammer. “Your car, I mean. My favorite is the ’04 Cobra.”\u003c/p\u003e\n\u003cp\u003eMy parents bought me and my siblings the car of our choice for our sixteenth birthday. I asked for a 2004 Mustang Cobra, the last year that model was made, but Dad didn’t think I’d notice the difference and got me my baby. I love my baby, but I knew the difference, even though I pretended I didn’t.\u003c/p\u003e\n\u003cp\u003e“I’ve never seen a ’94 GT up close before,” I continue, hoping for a spark of conversation.\u003c/p\u003e\n\u003cp\u003eNo response. His eyes become restless again even as his body stays completely motionless. Fold. Refold. Fold until the napkin’s so thick I can’t fold anymore. My fingers release the napkin and the folds tumble out. I smooth out the paper and begin again.\u003c/p\u003e\n\u003cp\u003eI don’t know this guy and he doesn’t know me. He hates me. He has to. I’m weighing him down, and I’ve noticed how he’s looked at my clothes, my diamond earrings, the gold bracelets on my wrist, my car. He can tell I’m not from this part of town—that I don’t belong. Not that I belong at home, either. But he told me before the race to leave. I didn’t. And now I’m a burden he’s dragging around.\u003c/p\u003e\n\u003cp\u003eMy lower lip trembles and I suck it in. First that horrid speech. Now this. I’m scared, I’m seconds from a panic attack and I want to go home.\u003c/p\u003e\n\u003cp\u003eI try to breathe deeply. It’s what my middle school therapist told me to do. That and to think of other things. “You shouldn’t talk about your car that way.” And I don’t know why I can’t stop talking, but his car is a gem, he should know it, and cars are the only things that don’t make me cry. “It won Motor Trend’s car of the year in ’94.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he responds in a bored voice.\u003c/p\u003e\n\u003cp\u003e“That was the year they put the pony emblem back on the car’s grill.”\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm.”\u003c/p\u003e\n\u003cp\u003e“It has a V-8.” And I’ve run out of good things to say about the car. “But what I don’t get is how Ford was okay with producing the thirtieth anniversary car using the same engine as the ’93 and losing 10 horses off the power.” And I’m rambling. I press my mouth shut and sigh heavily. Not that he’s listening anyhow. As I said before, guys don’t like girls who talk cars.\u003c/p\u003e\n\u003cp\u003eHe surprises me by answering. “I don’t have the original motor in my car.”\u003c/p\u003e\n\u003cp\u003eMy eyes snap to his. “For real? I know it probably sounds like I’m talking bad about your car, but really, the engine rocked. I mean, add a different air filter, or pulleys, or, I don’t know, some other mods and bam, your pony’s flying.”\u003c/p\u003e\n\u003cp\u003eLines bunch between his eyebrows as they move closer together. He opens his mouth. Closes it. Tugs on the bottom loop of his right ear and relaxes back into his seat. “How do you know so much about cars?”\u003c/p\u003e\n\u003cp\u003eI shrug. “I read.”\u003c/p\u003e\n\u003cp\u003eHis eyes mock me with amusement. “You read.”\u003c/p\u003e\n\u003cp\u003e“I read,” I repeat. A moment of silence stretches between us, and the band begins to play Jason Aldean. “Thank you for coming back for me.”\u003c/p\u003e\n\u003cp\u003eIt’s his turn to shrug. “It’s nothing. Thanks for not leaving me back at the warehouses. I owe you.”\u003c/p\u003e\n\u003cp\u003eI owe you.\u003c/p\u003e\n\u003cp\u003eA tiny whisper of wings tickles the inside of my chest as he says those last three words. Or maybe it’s the way his gray eyes become charcoal as if he’s swearing a pact. Either way, the moment is heavy, and I can’t help but look away in response. “Anyone would have done it.”\u003c/p\u003e\n\u003cp\u003e“No, they wouldn’t have,” he says. “You could have gotten away clean without me. I can’t be arrested, Rachel, and I owe you big.”\u003c/p\u003e\n\u003cp\u003eThe cuticles on my fingernails have never been so interesting. “So I’m assuming I also owe you, since you came back for me.”\u003c/p\u003e\n\u003cp\u003e“No,” he says automatically. “You sacrificed a hell of a lot more for me.”\u003c/p\u003e\n\u003cp\u003eI bite the inside of my lip to conceal the smile forming. All right, so this is cool. Very cool. I’m well aware that I’m barely seventeen and in a bar because I’m hiding from the police, and the guy across from me is my opposite in more ways than I can calculate, but I can’t help but feel like a princess who has a knight pledging his loyalty.\u003c/p\u003e\n\u003cp\u003eAnd because this moment is so intense, and there’s no way it’s as powerful for him as it is for me, I clear my throat and force a change of subject. “So, does that make us friends?”\u003c/p\u003e\n\u003cp\u003eOkay, last-minute game changer. I know, I know, any self-respecting girl would have let the subject drop, but I need to know. I don’t have that many friends, and I like the idea of having a friend who isn’t one of my brothers.\u003c/p\u003e\n\u003cp\u003e“Yeah.” He taps his finger against the table. “I guess it does.”\u003c/p\u003e\n\u003cp\u003eCool. I release the napkin and turn my head toward the stage. The drummer wraps up “My Kinda Party” and the guitar player rips right into “Sweet Home Alabama.” “I like this song.”\u003c/p\u003e\n\u003cp\u003eThe people crowded near the stage throw their arms in the air and sway with the beat that vibrates not only the floor beneath me, but also the table and my seat. So much so that my entire body trembles with the sound. There’s an energy surrounding the stage that illuminates the once-dark bar. What was moments ago brooding and overwhelming now appears light and hypnotic.\u003c/p\u003e\n\u003cp\u003e“Do you dance?” I ask, with a smile on my face that even surprises me.\u003c/p\u003e\n\u003cp\u003eIsaiah stares at me for a second, appearing as still as a statue. “No.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Not a fan of crowds.”\u003c/p\u003e\n\u003cp\u003eNo one would call me a crowd enthusiast, yet I glance over my shoulder again at the swarm of bodies rocking their fists in time with the lead singer as everyone belts out the chorus. “It looks like fun. As long as you’re not onstage no one would be watching you.”\u003c/p\u003e\n\u003cp\u003e“Too many variables in a crowd that size.”\u003c/p\u003e\n\u003cp\u003eI’m lost. “What do you mean by variables?”\u003c/p\u003e\n\u003cp\u003eAs if searching for patience, he releases a small frustrated breath. “Drunk assholes looking for a fight. Sober assholes looking for a fight. Pickpockets. I can’t control what goes on out there.”\u003c/p\u003e\n\u003cp\u003e“I don’t think anyone would mess with you.” And my stomach automatically sinks. That was a crappy thing to say. “Not that you’re scary or anything.”\u003c/p\u003e\n\u003cp\u003eHe raises an eyebrow. “I’m not?”\u003c/p\u003e\n\u003cp\u003e“No,” I say quickly, and grow hesitant as I spy a playful spark in his eyes. Even though every sane part of me screams to drop the conversation, I decide to follow the small amount of amusement in his face. “Now if you drove a Camaro, I’d have to reevaluate the situation.”\u003c/p\u003e\n\u003cp\u003eAnd he laughs. Not the heavy laughter from before. It’s a great laugh. A deep laugh. One that makes my lips lift. Isaiah, the guy who an hour ago carried himself like a jungle predator, now has the content aura of a lazy cat bathing in the sun.\u003c/p\u003e\n\u003cp\u003e“How old are you?” he asks.\u003c/p\u003e\n\u003cp\u003e“Just turned seventeen.”\u003c/p\u003e\n\u003cp\u003e“Senior?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “I’m a junior at Worthington Private.”\u003c/p\u003e\n\u003cp\u003eReminding me he’s still lethal, a hint of the panther reappears when he pops his neck to the right. Guess he’s heard of my school.\u003c/p\u003e\n\u003cp\u003e“How old are you?” I ask.\u003c/p\u003e\n\u003cp\u003e“Seventeen.”\u003c/p\u003e\n\u003cp\u003eAir catches in my throat and I choke, coughing into my hand like I’m dying of the plague. Not that I thought he was ancient, but how he acts, talks and moves...I thought he had to be older than... “You’re seventeen?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eFor a brief, startling few seconds, his forever-roaming gray eyes meet mine and I see it—seventeen. Within them is a small shred of the same vulnerability that consumes and strangles me. Just as fast as it appears, it’s gone, and he’s searching once again for some unseen threat.\u003c/p\u003e\n\u003cp\u003eI like that we’re the same age, at least physically. Something tells me his soul is much older.\u003c/p\u003e\n\u003cp\u003eThe lack of conversation creates awkwardness so I force us forward. “And?”\u003c/p\u003e\n\u003cp\u003e“And what?”\u003c/p\u003e\n\u003cp\u003e“You are a...” Is he going to make me draw every answer out of him? I motion with my hand in the air for him to continue. “This is where you fill in the blank with your year in high school.”\u003c/p\u003e\n\u003cp\u003e“Senior,” he finishes. “And I don’t go to Worthington Private.”\u003c/p\u003e\n\u003cp\u003e“You don’t say.” I let the sarcasm flow. “I thought for sure you had run for student body president last year.”\u003c/p\u003e\n\u003cp\u003eHe scratches the stubble on his jaw and I swear he’s covering a grin. “You’re too brave for your own good.”\u003c/p\u003e\n\u003cp\u003eMy eyes widen. Did he call me brave?\u003c/p\u003e\n\u003cp\u003eIsaiah leans in my direction, laces his hands together on the table and does that thing again where he stares straight into my eyes. I want to break the hypnotic trance, but it’s honestly as if his gaze imprisons me. “Was one of those college boys with you your boyfriend?”\u003c/p\u003e\n\u003cp\u003eA slight bit of heat creeps onto my cheeks. Not from panic this time, but from...from... “No, I don’t have a boyfriend.”\u003c/p\u003e\n\u003cp\u003eAnd the answer makes me shy, and the shyness gives me the power to look away. To think he called me brave. I wish I was brave. I wish that every person I’d meet would think of me that way. Not as the coward I really am.\u003c/p\u003e\n\u003cp\u003e“Good. Those guys were losers. Stay clear of them.”\u003c/p\u003e\n\u003cp\u003e“You’re sort of bossy.” I’m teasing. Isaiah’s way too serious to find time to be bossy. But the main point is that he’s totally unlike my brothers, who demand everything from me by plain bullying.\u003c/p\u003e\n\u003cp\u003e“I’m not bossy,” he says and I get a little thrill that he’s playing along.\u003c/p\u003e\n\u003cp\u003eThis isn’t me. In my day-to-day life, I could never find the courage to talk to guys, much less tease them, yet here I am. “No, I have four older brothers. Technically three older brothers and a twin, but Ethan claims he’s older by a minute. The point is I know what bossy is—and you’re it.”\u003c/p\u003e\n\u003cp\u003e“Think of it as strongly encouraged tips for survival.”\u003c/p\u003e\n\u003cp\u003eI laugh, and the dark shadow on his face moves as he cracks a grin. Even though this isn’t his first smile tonight, it’s the first one to touch his eyes, and from the wary way the smile flickers on and off his face, it appears to surprise him. Maybe he’s out of practice, which is a shame. He has a drop-dead stunning smile. \u003c/p\u003e","sourceLink":"https://allnovel.net/crash-into-you-pushing-the-limits-3/page-8.html","bookId":2754,"creation":"Oct 5, 2019 4:57:53 PM","modification":"Oct 5, 2019 4:57:53 PM"}
