{"id":88502,"no":26,"title":"Page 26","content":"\u003cp\u003e“You need to go see Jeff as soon as possible, before any deals are made.”\u003c/p\u003e\n\u003cp\u003e“I’ll go tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Take a check over to Mitchell on your way. I’ll give you his card.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow’s Saturday,” she reminded. “Will he be in his office?”\u003c/p\u003e\n\u003cp\u003e“Yes, he will, and he’s expecting you at ten o’clock. You could messenger the check over, but I’d like you to meet him, and he certainly wants to meet you.”\u003c/p\u003e\n\u003cp\u003eShe didn’t ask why. “What about Jeff? Does he know what you’re doing?”\u003c/p\u003e\n\u003cp\u003e“What you’re doing,” she corrected. “And the answer is no. You’re going to have to explain it all to him.”\u003c/p\u003e\n\u003cp\u003e“I’m a MacKenzie. How am I going to get him to trust me?”\u003c/p\u003e\n\u003cp\u003eEmma smiled. “You’ll find a way.”\u003c/p\u003e\n\u003cp\u003eTWENTY\u003c/p\u003e\n\u003cp\u003eFor Olivia, Saturday started at four thirty in the morning with a call from a police station across town.\u003c/p\u003e\n\u003cp\u003eThe officer on duty apologized for the early hour. “Judge Bowen told me to call you. We have a little girl here who needs protection . . . your kind of protection. The judge doesn’t want her in the system. It has something to do with a trial that’s coming up,” he told her. “He said you’d help the child disappear for a while.”\u003c/p\u003e\n\u003cp\u003e“I’ll be right there.”\u003c/p\u003e\n\u003cp\u003eThank goodness for GPS, or she never would have found the police station. The paperwork didn’t take as long as usual because the judge had already signed the order. By eight o’clock she had nine-year-old Lily Jackson settled in her new, though temporary, home.\u003c/p\u003e\n\u003cp\u003eWhen she got in her car and checked her phone, there was a message from Mitchell Kaplan moving their meeting to eleven. Olivia was thankful for the extra time. She drove back to her apartment, showered, and changed into a dark blue dress. She left her hair down but used a barrette to keep it out of her face, then put on her earrings and watch. Since there was still a little time to spare, she went through her briefcase again to make absolutely certain she had all the necessary papers for Jeff. She’d already written her check to Mitchell Kaplan and tucked it in her purse, along with another one for Jeff Wilcox’s wife.\u003c/p\u003e\n\u003cp\u003eCoat and scarf on, she headed out. The elevator doors opened, and there stood Grayson. She was so surprised to see him, she froze, but only for a second or two. She stepped into the elevator and pressed the button to the garage.\u003c/p\u003e\n\u003cp\u003e“Hi.” Not very original, but it was the best she could do.\u003c/p\u003e\n\u003cp\u003eGrayson didn’t look happy to see her. “What are you doing?”\u003c/p\u003e\n\u003cp\u003eWhen she didn’t immediately answer, he pushed the button to stop the elevator. “I said, what are you doing?”\u003c/p\u003e\n\u003cp\u003e“Errands.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“No?” She didn’t shout the word, but she wanted to. Instead, she pushed his hand away from the buttons. “Ronan told me you’ve been paying for my bodyguards, and I want you to know I’m going to reimburse you for every dollar you spent, but, Grayson, you really should have told me what you were doing.”\u003c/p\u003e\n\u003cp\u003e“I’m going to keep you safe, no matter how much you fight me,” he countered. He nudged her chin up so she would look him in the eye and said, “Damn it, Olivia. I don’t want anything to happen to you.”\u003c/p\u003e\n\u003cp\u003eShe thought he was going to kiss her, but he suddenly stepped back.\u003c/p\u003e\n\u003cp\u003e“I am safe,” she insisted. “And, of course, I’m being cautious.”\u003c/p\u003e\n\u003cp\u003e“Were you cautious when the elevator doors opened?”\u003c/p\u003e\n\u003cp\u003e“I usually have my pepper spray at the ready,” she countered.\u003c/p\u003e\n\u003cp\u003e“Usually?”\u003c/p\u003e\n\u003cp\u003eHis voice was deceptively soft, a bad sign she recognized from past experience. Grayson was about to lecture the hell out of her.\u003c/p\u003e\n\u003cp\u003e“Push the button to the garage. I have an appointment I can’t miss.”\u003c/p\u003e\n\u003cp\u003eHe started to argue, then changed his mind and pushed the button to the lobby.\u003c/p\u003e\n\u003cp\u003e“I’ll take you.”\u003c/p\u003e\n\u003cp\u003e“I’m perfectly capable—”\u003c/p\u003e\n\u003cp\u003e“I’ll take you. Where are you going?”\u003c/p\u003e\n\u003cp\u003e“First to an attorney’s office, then to jail.”\u003c/p\u003e\n\u003cp\u003eMitchell Kaplan was going to be a godsend for Jeff Wilcox. Olivia had taken time the night before to look up some of his cases and was impressed. Kaplan’s adversaries called him a barracuda, and that was exactly what Jeff needed.\u003c/p\u003e\n\u003cp\u003eHis nickname certainly didn’t fit his appearance. Kaplan reminded her of a teddy bear. He was short, a bit round in the middle, and wore thick wire-rimmed glasses. He was also soft-spoken and reserved. Although Olivia and Grayson spent only a short time with the attorney, they both liked him.\u003c/p\u003e\n\u003cp\u003e“Where are they holding Wilcox?” Grayson asked.\u003c/p\u003e\n\u003cp\u003e“Mr. Wilcox has been held close to his home in Fairhaven. It’s a decent facility, but I had my assistant check this morning before I sent you there to talk to him, and I learned that last night he was moved to Beaumont.”\u003c/p\u003e\n\u003cp\u003e“That’s ninety miles from here. Wilcox won’t last long there.”\u003c/p\u003e\n\u003cp\u003eKaplan nodded.\u003c/p\u003e\n\u003cp\u003e“Why did they move him?” Olivia asked, and then before Grayson or Kaplan could explain, she asked, “Why won’t he last long?”\u003c/p\u003e\n\u003cp\u003e“Fairhaven is to a country club what Beaumont is to Attica,” Grayson explained.\u003c/p\u003e\n\u003cp\u003e“My assistant was told he was moved because of overcrowding. It’s a game they’re playing, trying to force Mr. Wilcox to take the deal he’s been offered. There are serious charges, and I’m sure the federal prosecutor would like to save the taxpayer the expense of a trial.”\u003c/p\u003e\n\u003cp\u003eKaplan went over the documents he was sending with Olivia and then said, “Please tell Mr. Wilcox I’ll get the ball rolling right away to get him released, but I can’t do anything until he signs the paper retaining my services. I’ll plan on being at the jail to see him later today. By now I imagine Mr. Wilcox is feeling beat down.”\u003c/p\u003e\n\u003cp\u003e“Then you’ll be able to get him out of there today?” she asked.\u003c/p\u003e\n\u003cp\u003eKaplan nodded. “He’ll be under house arrest, but he’ll be home.”\u003c/p\u003e\n\u003cp\u003eOlivia handed him an envelope containing the retainer check and pulled the other envelope from her purse. “Would you see that he gets this, as well?” she asked. When Kaplan gave her a questioning look, she continued, “It will help his family get through the next couple of months,” she explained.\u003c/p\u003e\n\u003cp\u003eSmiling, Kaplan took the envelope. “Of course.”\u003c/p\u003e\n\u003cp\u003eOlivia thanked him and was walking out the door with Grayson at her side when Kaplan said, “Mr. Wilcox’s useless attorney is meeting with him late this afternoon. I’d try to get there before he does.”\u003c/p\u003e\n\u003cp\u003eOnce they were out in the hallway, Olivia whispered to Grayson, “This is going to sound really paranoid. The deal that’s being pushed on Wilcox—I’ve got a feeling my father has something to do with it.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “It does sound paranoid, but I’m not dismissing the possibility.”\u003c/p\u003e\n\u003cp\u003e“What if Wilcox’s inept attorney has made a deal of his own to pressure Wilcox to cooperate.”\u003c/p\u003e\n\u003cp\u003e“Who would make the deal? Your father?”\u003c/p\u003e\n\u003cp\u003e“Simmons,” she suggested. “He’s one of my father’s attorneys. I wouldn’t put anything past him, and he and my father would have good reasons not to want this to go to trial. Kaplan would bring them into it, and there goes my father’s low profile.”\u003c/p\u003e\n\u003cp\u003eAs soon as she clipped her seat belt in place, she said, “I’m nervous about meeting him.”\u003c/p\u003e\n\u003cp\u003e“Wilcox?”\u003c/p\u003e\n\u003cp\u003e“Yes, Wilcox,” she said. “I don’t know if he’ll remember me, but as soon as he hears my last name, he’ll probably spit in my face.”\u003c/p\u003e\n\u003cp\u003e“I won’t let that happen. Start with ‘I’m going to get you out of here,’ and I guarantee he’ll listen.”\u003c/p\u003e\n\u003cp\u003e“You can’t stop him from—”\u003c/p\u003e\n\u003cp\u003e“If he does anything to you, I’ll coldcock him.”\u003c/p\u003e\n\u003cp\u003eAs much as she hated to admit it to herself, she was glad he was so protective. “Can you take the time to go with me?”\u003c/p\u003e\n\u003cp\u003e“You’re not going without me.”\u003c/p\u003e\n\u003cp\u003e“What about Henry?”\u003c/p\u003e\n\u003cp\u003e“Basketball camp all day with Patrick. As long as I’m back by eight tonight, I’m good.”\u003c/p\u003e\n\u003cp\u003e“Why eight?”\u003c/p\u003e\n\u003cp\u003e“I’ve got a date.”\u003c/p\u003e\n\u003cp\u003eHer reaction was instantaneous. She felt as though he’d just coldcocked her and immediately recognized that she was being illogical. She wanted him to move on, so shouldn’t she be happy that he had a date?\u003c/p\u003e\n\u003cp\u003e“That’s nice.” She tried to sound pleased, but her voice betrayed her, coming out raspy, as though she’d just gargled vinegar.\u003c/p\u003e\n\u003cp\u003eGrayson pulled onto the highway. “Traffic isn’t bad. It shouldn’t take us all that long to get there.”\u003c/p\u003e\n\u003cp\u003e“Did you just meet this woman, or is she someone you’ve known for a while?” she asked. “I’m just curious,” she rushed on. “Making conversation.”\u003c/p\u003e\n\u003cp\u003e“What woman?”\u003c/p\u003e\n\u003cp\u003e“You said you had a date tonight.”\u003c/p\u003e\n\u003cp\u003e“Yes, I do.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“Aren’t you going to say ‘That’s nice’ again?”\u003c/p\u003e\n\u003cp\u003e“I was just . . .”\u003c/p\u003e\n\u003cp\u003eHe glanced at her. “Making conversation.”\u003c/p\u003e\n\u003cp\u003e“Exactly. Where are you going?” She hurriedly added, “You don’t have to tell me, unless you want to tell me.”\u003c/p\u003e\n\u003cp\u003e“A birthday party.”\u003c/p\u003e\n\u003cp\u003e“A birthday . . .” The light dawned. “Oh no, you aren’t.”\u003c/p\u003e\n\u003cp\u003eHe started to laugh. “Yes, I am.”\u003c/p\u003e\n\u003cp\u003e“Grayson, we talked about this. You’re going to my father’s birthday party? Is that what you’re saying?”\u003c/p\u003e\n\u003cp\u003e“That’s what I’m saying.”\u003c/p\u003e\n\u003cp\u003e“I don’t want you to go.” She knew she sounded like a petulant child.\u003c/p\u003e\n\u003cp\u003e“Really? Why didn’t you say something sooner?”\u003c/p\u003e\n\u003cp\u003e“I did say . . .” She realized he was teasing her. “I mean it.”\u003c/p\u003e\n\u003cp\u003e“What are you so worried about?”\u003c/p\u003e\n\u003cp\u003eShe looked out the side window while she tried to put into words what she was feeling. “I’m related to him.”\u003c/p\u003e\n\u003cp\u003e“Olivia, we all have at least one family member we’d rather not be related to,” he said. His brother immediately came to mind.\u003c/p\u003e\n\u003cp\u003e“Just one? I’ve got a plethora.”\u003c/p\u003e\n\u003cp\u003eHad she not sounded sincere, he would have laughed again. “I want to see him at work.”\u003c/p\u003e\n\u003cp\u003eAt work? She thought about it for a minute and understood. “Yes, he will be working, dazzling people. He’ll make sure everyone loves him.”\u003c/p\u003e\n\u003cp\u003e“But I won’t.”\u003c/p\u003e\n\u003cp\u003e“I know.” Because of what your father did to you. She remembered Grayson saying those very words to her. He knew what Robert MacKenzie was all about. He couldn’t be swayed.\u003c/p\u003e\n\u003cp\u003e“Who’s going with you?”\u003c/p\u003e\n\u003cp\u003e“No one,” he said. “I’ll be working. Did it bother you when I said I had a date?”\u003c/p\u003e\n\u003cp\u003e“Of course not.” It was an outrageous lie, and she was pretty sure he knew it.\u003c/p\u003e\n\u003cp\u003e“When we go out on a real date—and we will be going out on a real date—”\u003c/p\u003e\n\u003cp\u003e“I don’t think we should—”\u003c/p\u003e\n\u003cp\u003eHe cut her off. “Once I’m convinced we have the right man behind bars and it’s safe out there for you, we should celebrate.”\u003c/p\u003e\n\u003cp\u003eShe started to object but changed her mind. What could one date hurt? A celebration date, nothing more. “Yes, okay. One date.”\u003c/p\u003e\n\u003cp\u003e“I’d like you to wear the white dress you’ve told me about. You’ve made me very curious to see it.”\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know about that. My coveted, one-of-a-kind white dress? If I were to wear the dress, there would be rules you’d have to follow.”\u003c/p\u003e\n\u003cp\u003e“Rules? Like what?”\u003c/p\u003e\n\u003cp\u003e“Like no red wine. And you couldn’t eat any pasta with red sauce. Now that I think about it, I should probably give you a list of what you could and couldn’t eat. Maybe it would be better if you didn’t eat at all.”\u003c/p\u003e\n\u003cp\u003e“I don’t usually fling my food around when I eat.”\u003c/p\u003e\n\u003cp\u003e“One tiny little splat, and the dress is ruined,” she warned. “It’s vintage, 1960. It can’t be replaced.”\u003c/p\u003e\n\u003cp\u003e“I’m not taking you out to dinner and not eat.”\u003c/p\u003e\n\u003cp\u003e“I guess I could wear a raincoat.”\u003c/p\u003e\n\u003cp\u003eHe whistled and shook his head. “That dress must be something else.”\u003c/p\u003e\n\u003cp\u003eThe banter was fun, and Olivia was beginning to relax, but her lighthearted mood changed with a phone call. Her sister wanted to harass her one last time to make Emma attend the birthday party. Natalie had blocked her phone number on the display so that Olivia would answer the call.\u003c/p\u003e\n\u003cp\u003eOlivia denied Natalie’s request yet again, but her sister was not ready to end the conversation.\u003c/p\u003e\n\u003cp\u003e“I wanted you to know that all of us have suites at the Morgan Hotel. Mom and Dad are in the presidential suite, and George and I are in a smaller suite on the same floor. The top floor, of course,” Natalie bragged.\u003c/p\u003e\n\u003cp\u003e“What’s happened to you?” Olivia asked. “You and George made a lot of money with your Internet company, honest money,” she qualified, “and you never acted like this.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003eLike a greedy fool, she silently answered, but since she didn’t want a fight, she didn’t say it aloud. “Is there something else you want, Natalie?”\u003c/p\u003e\n\u003cp\u003e“Mother would like you to stop by before the party.”\u003c/p\u003e\n\u003cp\u003e“So she can drag me along? No, thank you.”\u003c/p\u003e\n\u003cp\u003eNatalie exploded. “Aren’t you ashamed of yourself? You should be,” she shouted. “You’re so damned selfish.”\u003c/p\u003e\n\u003cp\u003eAnd on she went. Olivia held the phone away from her ear and waited for the rant to end. She knew Grayson could hear every word. The people in the Ford Explorer in the next lane could probably hear.\u003c/p\u003e\n\u003cp\u003eTurning to him, Olivia quietly said, “I just realized I haven’t had anything to eat since last night. I had to get up at four thirty, and by the time I got back to the apartment, I was in too much of a hurry. Think we could stop for a bagel or something?”\u003c/p\u003e\n\u003cp\u003eNatalie had gone into warp speed, screeching. The more she ranted, the louder she got.\u003c/p\u003e\n\u003cp\u003e“You left your apartment at four thirty? What the hell for?” Grayson asked.\u003c/p\u003e\n\u003cp\u003eGreat. Now she was going to have shouting in both ears. “It was closer to four forty-five.”\u003c/p\u003e\n\u003cp\u003e“That makes a big difference. Where did you go?”\u003c/p\u003e\n\u003cp\u003eOlivia started to answer, but Natalie’s voice had just gone up another decibel. She was demanding to know if Olivia knew she was such a bitch. \u003c/p\u003e","sourceLink":"https://allnovel.net/sweet-talk-buchanan-renard-10/page-26.html","bookId":1827,"creation":"Oct 5, 2019 5:29:39 PM","modification":"Oct 5, 2019 5:29:39 PM"}
