{"id":88506,"no":30,"title":"Page 30","content":"\u003cp\u003eOlivia could hear him, of course. She came out of the kitchen and shouted, “All right. I’m opening the door. Hold on.” She’d tried to sound sleepy and thought she’d done a good job. She stood there smiling over her performance until Grayson tilted his head toward the kitchen. Nodding, she went back to hide.\u003c/p\u003e\n\u003cp\u003eRonan waited just inside the entrance to Olivia’s study. Grayson opened the door and moved out of the line of sight.\u003c/p\u003e\n\u003cp\u003eThere were two men with George. They knocked him to his knees as they pushed their way inside. They were in such a hurry they got halfway into the living room before they realized their target wasn’t there.\u003c/p\u003e\n\u003cp\u003eGeorge didn’t wait around. He staggered to his feet and ran down the hall to the elevator, frantically hitting the button.\u003c/p\u003e\n\u003cp\u003eThe men Simmons had sent were big and looked like bodybuilders. Dressed alike in black pants and white shirts with identification cards clipped to their pockets, they were obviously trying to look like hospital orderlies. Damned scary orderlies who would give patients nightmares. One was bald and had an eagle tattoo on the back of his head; the other had a scar that cut into his chin. Tattoo held a gun, and Scar carried a small black bag.\u003c/p\u003e\n\u003cp\u003eDisarming the man with the gun came first. Grayson didn’t waste time. He came up behind him and clipped him hard on the back of his neck. The hit didn’t seem to faze him, but the barrel of Grayson’s gun pressed against the face of the eagle got his attention.\u003c/p\u003e\n\u003cp\u003e“Drop the gun,” Grayson ordered.\u003c/p\u003e\n\u003cp\u003e“Hey, we’re just here to—”\u003c/p\u003e\n\u003cp\u003e“Drop the gun.”\u003c/p\u003e\n\u003cp\u003eRonan had his weapon pointed at Scar. “Shoot him,” he told Grayson. “We only need to interrogate one.”\u003c/p\u003e\n\u003cp\u003e“Yeah, okay.”\u003c/p\u003e\n\u003cp\u003eTattoo heard the click of the weapon and quickly dropped his gun. “Don’t shoot,” he cried out.\u003c/p\u003e\n\u003cp\u003eThirty seconds later, both men were handcuffed and sitting side by side at the kitchen table. They’d been read their rights but thus far hadn’t asked for a lawyer.\u003c/p\u003e\n\u003cp\u003e“You’ve got this all wrong,” Tattoo said.\u003c/p\u003e\n\u003cp\u003eThey had been searched and their wallets were now on the table. Grayson found their drivers’ licenses, read their names, and said to the tattooed man, “Where did we go wrong, Kline?”\u003c/p\u003e\n\u003cp\u003e“We were sent here to get Miss MacKenzie and take her to Marydale Hospital, where she can get the treatment she needs.”\u003c/p\u003e\n\u003cp\u003e“Marydale is at least a hundred and fifty miles from here,” Ronan pointed out.\u003c/p\u003e\n\u003cp\u003eKline shrugged. “It’s where we were told to take her.”\u003c/p\u003e\n\u003cp\u003e“Who told you to take her?”\u003c/p\u003e\n\u003cp\u003eThe two men looked at each other. Then Kline said, “I guess her doctor.”\u003c/p\u003e\n\u003cp\u003e“You guess?” Ronan asked.\u003c/p\u003e\n\u003cp\u003eGrayson opened the black bag and held up two vials of a milky substance. “What were you planning to do with these?”\u003c/p\u003e\n\u003cp\u003eThe other man, whose name was Vogel, answered. “We were going to sedate her because we were told she was violent.”\u003c/p\u003e\n\u003cp\u003eGrayson found a third vial in the bag. “There’s enough here to put down a horse.”\u003c/p\u003e\n\u003cp\u003e“Did you know how much to give, or were you just going to guess?” Ronan asked.\u003c/p\u003e\n\u003cp\u003e“I knew about how much.” Vogel was becoming defensive. “And it was going to be a long drive. I didn’t want her to wake up.”\u003c/p\u003e\n\u003cp\u003e“About how much? You could have killed her.” Grayson was trying to keep his temper under control. He was so furious, he wanted to throw both of them out the window.\u003c/p\u003e\n\u003cp\u003e“I would have been careful,” Vogel insisted.\u003c/p\u003e\n\u003cp\u003e“Oh, then that’s all right.”\u003c/p\u003e\n\u003cp\u003eVogel perked up. He obviously didn’t understand sarcasm. “I didn’t want to hurt her, but . . . you know . . . she’s . . .” The way Grayson was looking at him broke his concentration. He looked at Kline for help.\u003c/p\u003e\n\u003cp\u003e“Violent,” Kline whispered.\u003c/p\u003e\n\u003cp\u003e“Right. Violent.”\u003c/p\u003e\n\u003cp\u003eThey were following a script, and any deviation rattled them.\u003c/p\u003e\n\u003cp\u003e“Were you just going to drop her off at the door?” Grayson asked.\u003c/p\u003e\n\u003cp\u003e“No, we were going to take her in and then . . . you know . . . leave her because . . .” Vogel answered.\u003c/p\u003e\n\u003cp\u003e“She’s violent?” Grayson supplied. He glanced over at Olivia. Had he not known better, he might have given some credence to their claim. She was standing behind Vogel with her lips clinched tightly, looking as though she could strangle the man with her bare hands.\u003c/p\u003e\n\u003cp\u003e“How come you’re dressed like orderlies?” Ronan asked.\u003c/p\u003e\n\u003cp\u003e“We wanted to look professional,” Vogel explained.\u003c/p\u003e\n\u003cp\u003e“Yes, professional,” Kline agreed.\u003c/p\u003e\n\u003cp\u003e“Cut the BS.” Ronan shouted the order. Olivia flinched in reaction.\u003c/p\u003e\n\u003cp\u003e“I’m going to go get George. I’ll be right back,” Grayson said.\u003c/p\u003e\n\u003cp\u003eOlivia couldn’t believe he was leaving now. They hadn’t gotten Kline and Vogel to tell them anything yet. She followed him into the living room. “You’re leaving now? George is long gone. Don’t leave.” He gave her the look again. “Oh . . .” she said, suddenly understanding. “George isn’t gone. Where is he?”\u003c/p\u003e\n\u003cp\u003e“I imagine he’s beating the hell out of the elevator button about now. The elevator is locked on the ground floor.”\u003c/p\u003e\n\u003cp\u003e“He could have taken the steps.”\u003c/p\u003e\n\u003cp\u003e“One of the bodyguards blocked it. George can’t open the door.”\u003c/p\u003e\n\u003cp\u003e“Oh. Okay, then. Go get him.”\u003c/p\u003e\n\u003cp\u003eThere was a warm glint in his eyes. “You’re gonna have to let go of me first.”\u003c/p\u003e\n\u003cp\u003eShe had a death grip on his hand. She let go, and turning on her heels, she hurried back into the kitchen.\u003c/p\u003e\n\u003cp\u003eGrayson was marching down the hallway toward George when the medallion above the elevator doors lit up. George spotted Grayson coming and, in a panic, pounded on the doors, chanting, “Come on, come on . . .”\u003c/p\u003e\n\u003cp\u003eThe doors opened, and for a second George thought he was going to get away. He tried to run inside, but Agent Huntsman stopped him. Without breaking stride, Huntsman grasped George by the back of his neck and dragged him down the hall.\u003c/p\u003e\n\u003cp\u003eGrayson led the way to Olivia’s apartment as Huntsman shoved the blubbering George inside.\u003c/p\u003e\n\u003cp\u003e“Shut the hell up,” Huntsman ordered.\u003c/p\u003e\n\u003cp\u003eGrayson grabbed George and dropped him into a chair adjacent to Kline and Vogel. With his head in his hands, George began to cry. “I’m sorry, Olivia. I didn’t want to be a part of this, but I didn’t have a choice.”\u003c/p\u003e\n\u003cp\u003e“The hell you didn’t,” Grayson snapped.\u003c/p\u003e\n\u003cp\u003eRonan caught Huntsman up on what they had learned.\u003c/p\u003e\n\u003cp\u003e“We’ll take these two in,” Huntsman said, pointing to Vogel and Kline.\u003c/p\u003e\n\u003cp\u003e“Where’s Larson?”\u003c/p\u003e\n\u003cp\u003e“He’s babysitting the driver. He was sitting in his van in front of the building with a loaded .45 in his lap.”\u003c/p\u003e\n\u003cp\u003e“You can take them just as soon as they tell me who hired them,” Grayson said.\u003c/p\u003e\n\u003cp\u003eKline responded with a defiant smirk on his face. “You can’t make us tell you anything. You can talk to our lawyer. Right, Vogel?”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003eGrayson conceded. “You don’t want to talk to us, then don’t. We’ve got you for attempted kidnapping, and I’m going to add attempted murder. I’ll make it stick, too.”\u003c/p\u003e\n\u003cp\u003e“Attempted murder? We weren’t going to murder her,” Vogel protested.\u003c/p\u003e\n\u003cp\u003eGrayson pointed to the vials. “Sure you were.”\u003c/p\u003e\n\u003cp\u003e“You’re part of this, too, George,” Ronan interjected. “Attempted kidnapping and—”\u003c/p\u003e\n\u003cp\u003eIn a panic, George began to stammer. “No, no, that’s not right. I . . . I was told she was mentally ill, and I was only trying to help.”\u003c/p\u003e\n\u003cp\u003eRonan grinned. “That’s pretty good, George. You got that lie out without blinking.”\u003c/p\u003e\n\u003cp\u003e“I’m telling the truth. I didn’t mean any harm.”\u003c/p\u003e\n\u003cp\u003eHuntsman stood behind George while he recited his rights. “We need another pair of handcuffs.”\u003c/p\u003e\n\u003cp\u003e“Hey, George, did you ever pay that loan off? It must have tripled by now. If you didn’t pay it back, you’ll probably be safe in prison,” Grayson said.\u003c/p\u003e\n\u003cp\u003e“And you will be going to prison,” Ronan assured him.\u003c/p\u003e\n\u003cp\u003e“Did you pay the loan off?” Grayson asked again.\u003c/p\u003e\n\u003cp\u003eGeorge’s face was turning white. “Not yet. No.”\u003c/p\u003e\n\u003cp\u003e“Who hired you?” Grayson asked Kline.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t answer. Neither would Vogel. George was the weakest link, so Grayson concentrated on him again.\u003c/p\u003e\n\u003cp\u003e“How did you end up with these two? I know you don’t run in the same circles. So how do you know them?”\u003c/p\u003e\n\u003cp\u003e“They work for Carl Simmons.”\u003c/p\u003e\n\u003cp\u003e“Shut your mouth,” Kline demanded.\u003c/p\u003e\n\u003cp\u003e“You do work for him. Everyone knows it.”\u003c/p\u003e\n\u003cp\u003e“We said shut up,” Vogel yelled this time.\u003c/p\u003e\n\u003cp\u003e“Olivia, do you have any duct tape?” Grayson asked.\u003c/p\u003e\n\u003cp\u003e“Yes. In the cabinet by the pantry.”\u003c/p\u003e\n\u003cp\u003eGrayson found it. He ripped off a long strip.\u003c/p\u003e\n\u003cp\u003e“I know my rights. You can’t—” The first strip covered Vogel’s mouth.\u003c/p\u003e\n\u003cp\u003e“That might not stick,” Grayson said. “I’d better reinforce it.” And with that, he taped over Vogel’s nostrils, making breathing impossible. “That should do it.”\u003c/p\u003e\n\u003cp\u003eHe crossed to the other side of the table, winked at Olivia as he passed her, then pulled out a chair and straddled it. Stacking his arms across the back, he stared at George, completely ignoring the wide-eyed Vogel.\u003c/p\u003e\n\u003cp\u003e“You were telling us that these two work for Simmons. What do they do for him?”\u003c/p\u003e\n\u003cp\u003eVogel’s face was turning beet red.\u003c/p\u003e\n\u003cp\u003eGeorge was gaping at him. “He can’t breathe.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know,” Grayson said. “What do Kline and Vogel do for Simmons?”\u003c/p\u003e\n\u003cp\u003e“You’re killing him.”\u003c/p\u003e\n\u003cp\u003e“What do Kline and Vogel—”\u003c/p\u003e\n\u003cp\u003e“I’ll tell you. Just get that tape off him and let him breathe.”\u003c/p\u003e\n\u003cp\u003eGrayson reached across the table and ripped the tape off. Vogel gasped for air.\u003c/p\u003e\n\u003cp\u003e“You keep your mouth shut, George,” Kline blurted.\u003c/p\u003e\n\u003cp\u003e“Hand me the tape,” Huntsman said.\u003c/p\u003e\n\u003cp\u003e“Okay, I’ll be quiet. No tape. This isn’t right,” Kline said. “You can’t treat us this way.”\u003c/p\u003e\n\u003cp\u003e“No, it isn’t right.” Grayson nodded to Huntsman who immediately covered Kline’s mouth with the tape. “Know what else isn’t right?” he continued. “Kidnapping and attempted murder.”\u003c/p\u003e\n\u003cp\u003eGeorge looked as though, at any moment, he could burst into tears. “Oh God, how did this all get so messed up?”\u003c/p\u003e\n\u003cp\u003e“This is the last time I’m going to ask . . .”\u003c/p\u003e\n\u003cp\u003e“All I know is that Kline and Vogel have been working for Carl Simmons for at least a year. He tells people they’re his bodyguards. I heard him offer them a big bonus if they could get it done fast.”\u003c/p\u003e\n\u003cp\u003eKline grunted and shook his head. Grayson raised his hand, and Kline immediately stopped making noise. It was almost a Pavlovian response.\u003c/p\u003e\n\u003cp\u003e“It?” he asked George.\u003c/p\u003e\n\u003cp\u003e“Olivia. If they could take care of Olivia fast.”\u003c/p\u003e\n\u003cp\u003e“How did you end up with them tonight?” Ronan asked.\u003c/p\u003e\n\u003cp\u003eGeorge’s shoulders slumped. He looked completely defeated now.\u003c/p\u003e\n\u003cp\u003eRonan got down in his face and shouted, “Answer the question.”\u003c/p\u003e\n\u003cp\u003eGeorge flinched. “Something happened during the party. I don’t know what set Carl off, but I swear he was shaking. I’ve never seen him so angry. He dragged me out to the lobby, and when he couldn’t see Kline right away, he called him on his cell phone. I heard him tell him what to do.”\u003c/p\u003e\n\u003cp\u003e“And?” Ronan prodded.\u003c/p\u003e\n\u003cp\u003e“He told me I had to go with them because Olivia wouldn’t open her door to two strangers, but she would if she saw me through the peephole. I told him about the doorman, that he could call Olivia and tell her there were three of us and she’d never let us come up.”\u003c/p\u003e\n\u003cp\u003e“What did he say?” Ronan asked.\u003c/p\u003e\n\u003cp\u003e“He told me not to worry about it, that Kline would take care of the doorman.”\u003c/p\u003e\n\u003cp\u003e“Did he tell you how Kline would take care of him?”\u003c/p\u003e\n\u003cp\u003eGeorge shook his head. “No, and I didn’t ask. I didn’t want to know.”\u003c/p\u003e\n\u003cp\u003e“What a weasel,” Grayson said under his breath.\u003c/p\u003e\n\u003cp\u003e“As it turned out,” George continued, “the lobby was empty and the door was unlocked. He must have been on a break. . . . No, he wasn’t,” he said, finally figuring it out. “You wanted us to come inside. You were waiting for us. How did you know we were coming?”\u003c/p\u003e\n\u003cp\u003e“What else did Simmons say?” Grayson asked, ignoring the question.\u003c/p\u003e\n\u003cp\u003eGeorge couldn’t look Olivia in the eye. Staring at the table, he said, “The place they were taking her would keep her locked away where she couldn’t make any more trouble. She’d be let out in three days. Carl said that was all the time Robert needed.”\u003c/p\u003e\n\u003cp\u003e“Three days?” Ronan asked.\u003c/p\u003e\n\u003cp\u003e“What’s MacKenzie going to get done in three days?” Grayson asked.\u003c/p\u003e\n\u003cp\u003e“He told Carl he’d have it all cleared out by then.”\u003c/p\u003e\n\u003cp\u003e“You heard him say that?” Ronan asked.\u003c/p\u003e\n\u003cp\u003e“Yes, I did. Robert came out in the lobby and pulled Simmons over behind some potted plants. Both of them were hopping mad. I don’t think my father-in-law cared at that point if I heard him. He was in a rage about some attorney—Mitchell Kaplan—and Olivia hiring him.”\u003c/p\u003e\n\u003cp\u003eOlivia smiled. “He’s afraid of Jeff Wilcox’s attorney because he knows he’ll have to open up his files.” She looked at her brother-in-law. “George, tell me what you think ‘clearing it out’ means.” She wanted him to acknowledge what her father was going to do.\u003c/p\u003e\n\u003cp\u003e“You know . . .”\u003c/p\u003e\n\u003cp\u003e“Tell me, George.”\u003c/p\u003e\n\u003cp\u003e“The money, the stocks . . . he’s going to close it all down.”\u003c/p\u003e\n\u003cp\u003e“He’ll hide money,” Ronan predicted.\u003c/p\u003e\n\u003cp\u003e“What were you promised?” Grayson asked. “No, let me guess. Simmons found out about your gambling debts and was going to see that you got enough money to pay them off without Natalie finding out. I’m right, aren’t I?”\u003c/p\u003e\n\u003cp\u003e“Yes. Simmons told me nobody else knew about the loans, and he’d help me out. He said there was no way I could get money out of the fund without the family suspecting.”\u003c/p\u003e\n\u003cp\u003eOlivia couldn’t understand George’s stupidity. When was he going to pull his head out of the sand? “Aren’t you beginning to figure it out?” she said to him. “Simmons wasn’t going to give you any money. You have to know.” \u003c/p\u003e","sourceLink":"https://allnovel.net/sweet-talk-buchanan-renard-10/page-30.html","bookId":1827,"creation":"Oct 5, 2019 5:29:39 PM","modification":"Oct 5, 2019 5:29:39 PM"}
