{"id":68134,"no":29,"title":"Page 29","content":"\u003cp\u003e“But you were,” Megan said. “Really, you were.”\u003c/p\u003e\n\u003cp\u003eWith a minimum of farewells, Faith was out the door. Because of the cold, she’d driven to the restaurant and parked on a side street. Slipping into her car, she started the engine and the heater, then sat there as the anger subsided and became sadness instead.\u003c/p\u003e\n\u003cp\u003eTwenty-One\u003c/p\u003e\n\u003cp\u003eThis was Emily Flemming’s first day at her new job—which was also the first job she’d had since the early days of her marriage. The quilt shop was ideal for her. And it felt good to be part of the solution to their money woes. In fact, Emily felt good about a lot of things today, but mostly about Dave; her faith in him had been restored. Of course, there were still those diamond earrings to be explained, and she’d ask him, in time. Emily was confident that he’d have a logical explanation. She’d actually forgotten about the earrings when they’d spoken on Sunday. But she suspected Martha had given them to Dave, along with the watch, and he was waiting for Christmas to present them to her.\u003c/p\u003e\n\u003cp\u003eIn retrospect, Emily knew she’d been foolish not to confront Dave with her suspicions earlier. If she had, she could’ve saved herself, and her husband, a lot of grief.\u003c/p\u003e\n\u003cp\u003eOf course, Dave had been at fault, too. He should’ve told her about their financial problems sooner. Until he’d shown her the stack of unpaid bills, she’d had no idea how precarious their situation was. The fact that her husband had taken a second job in order to make ends meet had come as a total shock.\u003c/p\u003e\n\u003cp\u003eOn Tuesday morning, after Emily got the boys off to school, she drove to The Quilted Giraffe, in the same mall as several other local businesses, among them Get Nailed. Roxanne York’s store sold a large range of fabrics, yarn and quilting supplies. Not only that, she offered classes of various kinds, including one by well-known fabric artist Shirley Bliss, who’d taught a class there last year, before her husband’s accident. Unfortunately Emily hadn’t been able to attend because those sessions conflicted with a series of women’s group meetings at the church. Emily would’ve preferred the quilt classes but she’d already committed herself and couldn’t, in good conscience, back out.\u003c/p\u003e\n\u003cp\u003eOver the years Emily had frequented the store and become friends with the owner. On several occasions, Roxanne had asked Emily to work for her. She and Dave could hardly believe how easily everything had fallen into place. In minutes she had a job, with the hours she wanted.\u003c/p\u003e\n\u003cp\u003eWhen she announced that she’d taken the job, her boys had immediately objected. They hadn’t like the idea of Emily working and barraged her with questions and complaints.\u003c/p\u003e\n\u003cp\u003e“What happens if I get sick and somebody has to pick me up at school?” Matthew had asked.\u003c/p\u003e\n\u003cp\u003e“Who’ll bake cookies for after school?” was Mark’s main concern.\u003c/p\u003e\n\u003cp\u003e“If you need me,” she assured her oldest son, “all you have to do is phone and I’ll be right there. It won’t be any different than if I was at home.”\u003c/p\u003e\n\u003cp\u003eMatthew wasn’t mollified and sulked the rest of the morning.\u003c/p\u003e\n\u003cp\u003e“As for cookies, I’ll still bake them,” she told Mark.\u003c/p\u003e\n\u003cp\u003e“You promise?” he’d asked skeptically.\u003c/p\u003e\n\u003cp\u003e“I promise.” She’d bought everything she needed for his favorite date bars. She usually baked them only during the Christmas season.\u003c/p\u003e\n\u003cp\u003e“Good morning, Roxanne,” Emily said happily, entering the familiar store. Business was especially good at this time of year, and Roxanne was delighted with the extra help.\u003c/p\u003e\n\u003cp\u003eHer employer had a name badge for Emily, plus a special apron with half a dozen pockets. After putting her coat and purse in the back room, where she’d been given shelf space with her name on it, Emily proudly donned the apron and tag. She was ready for business. Roxanne had an errand to run at the bank, and within ten minutes of her arrival, Emily was alone in the store.\u003c/p\u003e\n\u003cp\u003eThat didn’t last long. All too soon, before she’d even finished reviewing the new inventory, she had her first customers.\u003c/p\u003e\n\u003cp\u003e“Emily, you’re working here now?” Peggy Beldon asked, coming in with her friend Corrie McAfee. “Oh, I like your hair!” Whether or not that was true, it was nice of her to say so.\u003c/p\u003e\n\u003cp\u003ePeggy was an excellent quilter. Her eye for color had long been the envy of everyone in the quilters’ guild. She and her husband, Bob, owned Thyme and Tide, a local bed-and-breakfast that had received a glowing review in a national travel magazine.\u003c/p\u003e\n\u003cp\u003e“It’s my very first day,” Emily said, smiling. She’d worked briefly at a large department store after she’d married Dave and before the boys were born, and she found herself grateful for that experience.\u003c/p\u003e\n\u003cp\u003e“Can I help you with anything?” she asked.\u003c/p\u003e\n\u003cp\u003e“Not yet,” Corrie responded. Corrie was new to quilting but had taken to it with enthusiasm. She’d joined the quilters’ guild, too. In Emily’s opinion, Corrie couldn’t possibly have a better mentor than Peggy Beldon.\u003c/p\u003e\n\u003cp\u003eThe two women wandered along the rows of fabric.\u003c/p\u003e\n\u003cp\u003eEmily never liked it when a sales clerk hovered over her, so she remained at the cash register, waiting in case they required assistance. Roxanne would be back soon, if Peggy and Corrie had any questions Emily couldn’t answer.\u003c/p\u003e\n\u003cp\u003e“Roy’s in one of his moods,” Corrie was saying as she smoothed her hand over a bolt of fabric.\u003c/p\u003e\n\u003cp\u003eEmily knew all about men and their moods. Dave hadn’t been himself for months; thankfully she now understood why. Money problems were the worst.\u003c/p\u003e\n\u003cp\u003e“Something on his mind?” Peggy questioned.\u003c/p\u003e\n\u003cp\u003e“It has to do with Martha Evans’s missing jewelry. Roy and the sheriff have been discussing it.”\u003c/p\u003e\n\u003cp\u003eEmily came out from behind the register and moved closer to the two women. She occupied herself with a display of pattern books because she didn’t want to look as if she was intentionally listening in on their conversation. In truth, however, she was curious to hear what they had to say.\u003c/p\u003e\n\u003cp\u003e“According to Troy, Martha’s daughters are terribly upset,” Corrie said. “They’ve come to him several times. Their mother hadn’t insured the jewelry properly and her policy has a low loss limit.”\u003c/p\u003e\n\u003cp\u003e“I imagine those pieces have a sentimental value, too.”\u003c/p\u003e\n\u003cp\u003eEmily swallowed, feeling guilty about eavesdropping on their private conversation…and yet, she felt she had no choice. She needed all the information she could get.\u003c/p\u003e\n\u003cp\u003e“Sorry to interrupt, but I couldn’t help overhearing you. I’ve been praying the jewelry will turn up,” Emily said. It was all rather embarrassing because Troy was well aware that Dave was the one who’d found Martha’s body.\u003c/p\u003e\n\u003cp\u003e“I think everyone must be,” Corrie commented. “The latest has to do with her husband’s gold watch.”\u003c/p\u003e\n\u003cp\u003eEmily’s skin prickled.\u003c/p\u003e\n\u003cp\u003e“Martha’s oldest daughter…I’ve forgotten her name. Roy said she was in to see the sheriff just yesterday. She says she’d forgotten all about it. She wanted to add it to the list of what’s missing.”\u003c/p\u003e\n\u003cp\u003eEmily returned to the front of the store. Her legs were shaky, like they might go out from under her. Dave claimed Martha had given him the gold watch. He’d actually been wearing it! No thief in his right mind would flaunt such a thing. There had to be some mistake.\u003c/p\u003e\n\u003cp\u003eThinking over their conversation, Emily remembered Dave telling her that he’d been reluctant to accept such a valuable gift. He’d told Emily that Martha had the watch entered into her will so there’d be no question about it later.\u003c/p\u003e\n\u003cp\u003e“Mack’s completely moved into his apartment,” Corrie said, changing the subject.\u003c/p\u003e\n\u003cp\u003e“That’s good news,” Peggy murmured as she lifted a bolt of fabric from the rack. “I understand Will Jefferson’s living above the gallery now.”\u003c/p\u003e\n\u003cp\u003e“That’s what Mack said, too.”\u003c/p\u003e\n\u003cp\u003e“I’m so glad we still have an art gallery.”\u003c/p\u003e\n\u003cp\u003eThe rest of the conversation flew past Emily.\u003c/p\u003e\n\u003cp\u003eThe two women each purchased several yards of fabric and then drifted out of the store, discussing where to have lunch.\u003c/p\u003e\n\u003cp\u003eEmily found herself reeling. The gold watch was said to be missing and now listed as one of the items that had been stolen? That had to be a misunderstanding. Well, it was one that could easily be resolved. Emily would see to it herself.\u003c/p\u003e\n\u003cp\u003eOn her lunch break she drove to Allan Harris’s office, which was empty except for a well-dressed young man at the front desk. He looked up when Emily walked in.\u003c/p\u003e\n\u003cp\u003e“What can I do for you?” he asked.\u003c/p\u003e\n\u003cp\u003e“I’m Emily Flemming,” she said.\u003c/p\u003e\n\u003cp\u003e“Hello.” It was clear he hadn’t made the connection between her and Dave.\u003c/p\u003e\n\u003cp\u003e“Pastor Flemming’s my husband.”\u003c/p\u003e\n\u003cp\u003e“Oh, yes, of course.” Instantly Geoff was on his feet, extending his hand. “I’m Geoff Duncan.”\u003c/p\u003e\n\u003cp\u003e“Hello, Geoff.”\u003c/p\u003e\n\u003cp\u003e“When I spoke with Pastor Dave a little while ago, he agreed to give my fiancée and me premarital counseling.”\u003c/p\u003e\n\u003cp\u003eEmily nodded, unsure how to bring up the subject of the missing gold watch. She was convinced this was all a mix-up and once she showed Sheriff Davis a copy of the will, everything would be sorted out.\u003c/p\u003e\n\u003cp\u003e“Dave enjoys working with couples,” Emily said.\u003c/p\u003e\n\u003cp\u003e“Do you need an appointment?” Geoff asked. “Unfortunately, Mr. Harris is currently in court and isn’t expected back until late this afternoon. I can schedule you in then, if you’d like.”\u003c/p\u003e\n\u003cp\u003e“Not a real appointment.” They were already in a financial bind, so Emily didn’t want to complicate their problems by adding attorney’s fees, especially for a matter as simple as this. “I just need some information.”\u003c/p\u003e\n\u003cp\u003e“Then perhaps I can help,” he offered.\u003c/p\u003e\n\u003cp\u003e“I…I need to see something.” It seemed terribly bold and perhaps unethical to ask for a copy of someone else’s last will and testament.\u003c/p\u003e\n\u003cp\u003eGeoff stared at her blankly.\u003c/p\u003e\n\u003cp\u003e“Something my husband mentioned,” she added.\u003c/p\u003e\n\u003cp\u003e“And what would that be?” Geoff’s questioning eyes searched hers.\u003c/p\u003e\n\u003cp\u003eEmily hadn’t come this far to leave without answers. Taking a deep breath, she plunged ahead. “I need to see a copy of Martha Evans’s will.”\u003c/p\u003e\n\u003cp\u003eGeoff’s eyes narrowed and he slowly shook his head.\u003c/p\u003e\n\u003cp\u003e“Is it wrong of me to ask for something like that?”\u003c/p\u003e\n\u003cp\u003eHe clasped his hands in front of him. “I’m afraid I can’t do that.”\u003c/p\u003e\n\u003cp\u003e“Oh, drat,” Emily said, feeling like a fool.\u003c/p\u003e\n\u003cp\u003e“Is it important?” Geoff asked.\u003c/p\u003e\n\u003cp\u003e“Yes!” she cried. He must know she’d never make a request like this if it wasn’t. Emily considered it her responsibility to uphold her husband’s good name in the community. Olivia Griffin had seen the watch; she wouldn’t be shy about pointing the finger at Dave. And the earrings…Would they turn up on the list of stolen jewelry, too?\u003c/p\u003e\n\u003cp\u003eGeoff studied her for several seconds. “Can you tell me why it’s so important?”\u003c/p\u003e\n\u003cp\u003eEmily wasn’t sure how much she could explain without implicating her husband. “As you’re probably aware, Dave found Martha’s body.”\u003c/p\u003e\n\u003cp\u003e“Yes, of course.”\u003c/p\u003e\n\u003cp\u003e“I suppose…I suppose it’s only natural that, since things are missing, suspicion might fall on him.” \u003c/p\u003e","sourceLink":"https://allnovel.net/8-sandpiper-way-cedar-cove-8/page-29.html","bookId":1949,"creation":"Oct 5, 2019 10:08:08 AM","modification":"Oct 5, 2019 10:08:08 AM"}
