{"id":68135,"no":30,"title":"Page 30","content":"\u003cp\u003eGeoff frowned. “Pastor Flemming wouldn’t take anything that wasn’t his.”\u003c/p\u003e\n\u003cp\u003eEmily loved the way Geoff was so quick to defend her husband. “There’s a problem, however.”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Martha gave Dave a gold watch that had belonged to her husband.”\u003c/p\u003e\n\u003cp\u003e“Okay,” he said tentatively.\u003c/p\u003e\n\u003cp\u003e“I asked him about it when I found out he’d lost it. The clasp was broken and—”\u003c/p\u003e\n\u003cp\u003e“He lost the watch?” An alarmed look appeared on his face.\u003c/p\u003e\n\u003cp\u003e“Oh, don’t worry, it was recovered.”\u003c/p\u003e\n\u003cp\u003e“Thank goodness. A gold watch is expensive to replace.”\u003c/p\u003e\n\u003cp\u003eThere would be no replacing it on their budget, but Emily didn’t feel it was necessary to explain that. “Thankfully, Judge Griffin found it following a visit Dave made after her surgery.”\u003c/p\u003e\n\u003cp\u003e“That’s a relief,” Geoff commented.\u003c/p\u003e\n\u003cp\u003e“Yes, it is.”\u003c/p\u003e\n\u003cp\u003e“So Dave’s been wearing the watch?”\u003c/p\u003e\n\u003cp\u003e“Yes, of course. There wasn’t any reason not to, seeing that it was a gift.”\u003c/p\u003e\n\u003cp\u003eGeoff sat back in his chair. “It gets a bit sticky because of the missing jewelry, though, doesn’t it?”\u003c/p\u003e\n\u003cp\u003eGeoff understood the situation perfectly. Emily didn’t dare mention the earrings. She’d check into those, too, but so far, she was the only one who knew Dave had them.\u003c/p\u003e\n\u003cp\u003e“What does Mrs. Evans’s will have to do with all this?” he asked.\u003c/p\u003e\n\u003cp\u003e“Everything,” she said, leaning toward his desk. “Mrs. Evans told him she’d have the watch included in the will as a gift to my husband. I need to see if it’s there as she intended.”\u003c/p\u003e\n\u003cp\u003e“Ah.”\u003c/p\u003e\n\u003cp\u003e“Now you know why I need a copy of the will.”\u003c/p\u003e\n\u003cp\u003eGeoff tapped his ballpoint pen. “Oh, boy,” he muttered under his breath. “I mentioned that Pastor Dave offered to counsel my fiancé and me, didn’t I?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Emily nodded.\u003c/p\u003e\n\u003cp\u003e“As you might’ve guessed, I don’t make a lot of money as a legal assistant.”\u003c/p\u003e\n\u003cp\u003eEmily wouldn’t know.\u003c/p\u003e\n\u003cp\u003e“Your husband is such a kind man, he’s giving us the counseling sessions gratis.”\u003c/p\u003e\n\u003cp\u003eThat sounded just like Dave, always willing to help others.\u003c/p\u003e\n\u003cp\u003eGeoff sighed and glanced around the room, although no one else was present. Lowering his voice, he told her, “If anyone finds out I gave you a copy of that will I could lose my job.”\u003c/p\u003e\n\u003cp\u003e“I would never ask that of you,” Emily said immediately. “I’d never want you to take that risk.”\u003c/p\u003e\n\u003cp\u003eGeoff raised his hand, stopping her. “If this clears your husband’s name, then it’ll be worth the risk.”\u003c/p\u003e\n\u003cp\u003e“You said Mr. Harris is in court right now?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then it might make more sense for me just to read the will. I’ll make a copy of the pertinent page and if anyone—like Troy Davis—asks him about it, then Dave will have the proof.”\u003c/p\u003e\n\u003cp\u003eGeoff stood. “That’s an excellent suggestion,” he said, walking toward a tall filing cabinet behind him.\u003c/p\u003e\n\u003cp\u003eEmily remained standing. “I can’t thank you enough.”\u003c/p\u003e\n\u003cp\u003e“Like I said, the pastor’s doing me a favor, and if I can help him, I’m happy to do it.”\u003c/p\u003e\n\u003cp\u003e“This will be our little secret,” Emily promised him. “No one ever needs to know. The only other person who’d see it is the sheriff.”\u003c/p\u003e\n\u003cp\u003e“I have to be able to trust you.” She could hear caution and concern in his voice.\u003c/p\u003e\n\u003cp\u003e“You have my word I won’t tell anyone.” Emily’s fingers itched to grab the will and start flipping pages.\u003c/p\u003e\n\u003cp\u003eGeoff located the file and removed it from the cabinet. He took out the stapled will, which he handed to Emily. She sank onto the leather sofa in the waiting area and began to rapidly turn pages. While she might not have a law degree, she realized that anything aside from the standard clauses would be on a separate schedule. Sure enough, she came across those pages toward the end.\u003c/p\u003e\n\u003cp\u003eShe scanned the items listed. Martha had an extensive jewelry collection. Dave had once mentioned that she liked to reminisce about the traveling she and her husband, an executive in a paper products company, had done through the years. He’d delighted in buying her beautiful jewelry, much of it antique, and each ring or pair of earrings had reminded her of a particular place. The schedule included two entire pages of itemized pieces, each with a designation of her chosen recipient.\u003c/p\u003e\n\u003cp\u003eEmily didn’t see any notation having to do with the gold watch. She read the list a second time, more carefully now.\u003c/p\u003e\n\u003cp\u003e“Did you find it?” Geoff asked a bit anxiously.\u003c/p\u003e\n\u003cp\u003eEmily swallowed. “Is there another section of the will not included here?”\u003c/p\u003e\n\u003cp\u003e“Not that I know of.”\u003c/p\u003e\n\u003cp\u003e“Would you mind checking the file?” she asked, making an effort to sound positive.\u003c/p\u003e\n\u003cp\u003eGeoff returned to the filing cabinet. “Oh, wait, there is something else here.”\u003c/p\u003e\n\u003cp\u003eInstantly Emily relaxed. For a moment there, she’d started to panic.\u003c/p\u003e\n\u003cp\u003e“Oh.” Geoff’s voice lost some of its enthusiasm. “It’s photographs.”\u003c/p\u003e\n\u003cp\u003e“Of what?” Emily asked.\u003c/p\u003e\n\u003cp\u003e“The jewelry. Mrs. Evans had several pairs of diamond earrings and some emerald brooches. The pictures are to distinguish which piece of jewelry she meant.” He hesitated. “I believe Mr. Harris had been urging her to do this for some time because she wasn’t adequately insured.”\u003c/p\u003e\n\u003cp\u003e“Can I see that?” Emily asked. She knew it was risky to delve into this any further and yet she couldn’t stop herself. She reached for the document.\u003c/p\u003e\n\u003cp\u003e“Perhaps the gold watch is in here,” Geoff suggested.\u003c/p\u003e\n\u003cp\u003e“I’m sure it is,” Emily said with a confidence she didn’t feel. Flipping through the pages, she glanced at each photograph until she saw the one she’d hoped not to find.\u003c/p\u003e\n\u003cp\u003eThe diamond earrings.\u003c/p\u003e\n\u003cp\u003eThe pair she’d accidentally discovered in Dave’s suit pockets the afternoon of their wedding anniversary.\u003c/p\u003e\n\u003cp\u003e“Do you have what you need?” Geoff asked, his anxiety growing. If anyone were to step into the office and discover what he’d done, he could be in serious trouble.\u003c/p\u003e\n\u003cp\u003e“Here,” Emily said and handed him back the will and the papers.\u003c/p\u003e\n\u003cp\u003eGeoff immediately filed them and closed the drawer. He studied Emily. “Is everything all right, Mrs. Flemming? You look pale.”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she lied.\u003c/p\u003e\n\u003cp\u003e“Well…I hope that answered all your questions.”\u003c/p\u003e\n\u003cp\u003e“I appreciate your help,” she said, evading the question.\u003c/p\u003e\n\u003cp\u003e“You can’t tell anyone I let you see what was in Mrs. Evans’s file,” he told her.\u003c/p\u003e\n\u003cp\u003e“No one will ever know,” she promised.\u003c/p\u003e\n\u003cp\u003eOnly a few hours earlier, Emily had felt that her marriage was rejuvenated. Dave loved her. He was doing two jobs because of the increase in their house payments. Now, in an effort to do her share, Emily had started work, too.\u003c/p\u003e\n\u003cp\u003eThey needed money if they were going to hold on to the house she loved.\u003c/p\u003e\n\u003cp\u003eAll Emily could do was hope Dave hadn’t found another way of paying their bills…a way that could land him in prison.\u003c/p\u003e\n\u003cp\u003eTwenty-Two\u003c/p\u003e\n\u003cp\u003eTeri Polgar was still reeling. The gynecologist’s news had been a shock. An incredible, wonderful, joyous shock, but a shock nonetheless, and she wasn’t sure Bobby was ready to hear it. She hadn’t completely taken it in herself.\u003c/p\u003e\n\u003cp\u003e“James,” she murmured from the backseat of the car. “Please drive me over to Get Nailed.” She needed to talk to someone, and she couldn’t think of anyone better than her best friend, Rachel.\u003c/p\u003e\n\u003cp\u003e“As you wish, Miss Teri,” James responded. He rarely had a comment or a question.\u003c/p\u003e\n\u003cp\u003e“Thank you.” Teri started chewing on her thumbnail, then jerked her hand out of her mouth as soon as she realized what she was doing. Nail-biting was a bad habit of hers, one she’d managed—for the most part—to break.\u003c/p\u003e\n\u003cp\u003eJames pulled up in front of the Cedar Cove mall. Without giving him a chance to come around and open her door, she leaped out.\u003c/p\u003e\n\u003cp\u003eHe stood uncertainly by the driver’s door. “Would you like me to wait?” he asked.\u003c/p\u003e\n\u003cp\u003e“Please,” Teri said over her shoulder. The mall was busier than she could ever remember seeing it. A woman standing beside a huge red kettle rang a bell, reminding others of those less fortunate than themselves. Teri automatically stuck a twenty-dollar bill inside. As kids growing up with an alcoholic mother, she and Christie had a very limited experience of Christmas, which might explain why she went overboard now. The only gifts they received came from charities like this one. Any extra cash her mother had was spent on booze.\u003c/p\u003e\n\u003cp\u003eThe warmth inside the mall chased away the chill that had come over her. She moved quickly, eager to get to the salon. When she arrived, she walked directly through the waiting area and into the main body of the shop.\u003c/p\u003e\n\u003cp\u003e“Hey, look who’s here!” Jane called out. She wore a sprig of plastic holly in her hair as she worked on a customer’s nails.\u003c/p\u003e\n\u003cp\u003eTeri was instantly surrounded by her friends.\u003c/p\u003e\n\u003cp\u003e“Merry Christmas!”\u003c/p\u003e\n\u003cp\u003e“Teri, it’s so great to see you.”\u003c/p\u003e\n\u003cp\u003eHer gaze flew instinctively to Rachel. Rachel would reassure her. Rachel would help her put everything in perspective. Rachel would calm her nerves.\u003c/p\u003e\n\u003cp\u003eIntuitive as always, Rachel recognized immediately that something was wrong.\u003c/p\u003e\n\u003cp\u003e“Can you talk?” Teri asked, grabbing her friend’s hands.\u003c/p\u003e\n\u003cp\u003eRachel nodded. “I just finished my perm. Mrs. Holman’s coming in for a cut and style, but I can put her off for a few minutes. What’s up?”\u003c/p\u003e\n\u003cp\u003eTeri released Rachel’s hands and gestured weakly toward the break room. Her knees felt unsteady. “Let’s talk privately.”\u003c/p\u003e\n\u003cp\u003e“That bad?” Rachel’s eyes turned soft with concern.\u003c/p\u003e\n\u003cp\u003e“No, not really. Just…overwhelming.”\u003c/p\u003e\n\u003cp\u003eRachel led her to the back of the shop and pulled out two chairs. Teri nearly collapsed into hers. “I had the ultrasound this morning,” she said. “Bobby’s so anxious about the baby. He had an important radio interview so he couldn’t go with me. I didn’t think it was a good idea for him to be there, anyway. He worries too much.” She exhaled slowly.\u003c/p\u003e\n\u003cp\u003eRachel frowned. “Your appointment was at nine, right?” She glanced at her watch. “It’s nearly noon. Why’d it take so long?”\u003c/p\u003e\n\u003cp\u003e“Because about a dozen people had to take a gander. Let me tell you there’s nothing like having your stomach exposed to the whole world.”\u003c/p\u003e\n\u003cp\u003e“It could’ve been worse. It could’ve been your butt.”\u003c/p\u003e\n\u003cp\u003eLeave it to Rachel to look at the bright side.\u003c/p\u003e\n\u003cp\u003e“Everything is all right, isn’t it?” her friend asked, studying her closely.\u003c/p\u003e\n\u003cp\u003e“You tell me.” With trembling hands, Teri opened her large purse and took out the photograph the technician had given her. She laid it gingerly on the table, watching Rachel’s face as she did.\u003c/p\u003e\n\u003cp\u003eHer friend studied the photo. “Teri!” she cried a moment later. “You’re having twins!”\u003c/p\u003e\n\u003cp\u003e“Look again,” she said, her voice catching.\u003c/p\u003e\n\u003cp\u003eRachel stared at the hazy picture and then gasped. Her hand went to her heart. Her eyes widened. She swallowed hard. “Triplets?” \u003c/p\u003e","sourceLink":"https://allnovel.net/8-sandpiper-way-cedar-cove-8/page-30.html","bookId":1949,"creation":"Oct 5, 2019 10:08:08 AM","modification":"Oct 5, 2019 10:08:08 AM"}
