{"id":68142,"no":37,"title":"Page 37","content":"\u003cp\u003eAnd all week long, he’d thought about Faith. He missed her. He wished now that he’d approached her with more finesse. He’d been unfair to her because he’d overreacted to Megan’s fears.\u003c/p\u003e\n\u003cp\u003eHaving lived with Sandy all those years, watching her decline little by little, had taken a toll on his psyche. He couldn’t tolerate the prospect of Megan going through the same ordeal. In retrospect, he realized he’d discounted the difference thirty years had made in the treatment of MS. While he wouldn’t wish the disease on Megan or anyone, it wasn’t the death sentence it had once been.\u003c/p\u003e\n\u003cp\u003eBut Megan had been his reason, his excuse, for breaking off the relationship with Faith. His daughter needed him, he’d told himself, and she did, without a doubt. Deep down, however, Troy had begun to wonder if he was afraid of finding new happiness. If he believed, maybe not even consciously, that he had no right to experience joy while his daughter was struggling.\u003c/p\u003e\n\u003cp\u003e“You’re old enough that your father doesn’t need to come with you,” Troy complained, trying one last time to back out of this family trip.\u003c/p\u003e\n\u003cp\u003eMegan smiled that sweet innocent smile of hers. “That’s true. But this is the first Christmas without Mom. Please, Dad?”\u003c/p\u003e\n\u003cp\u003eTroy couldn’t refuse her. “All right,” he muttered again, no more graciously than before.\u003c/p\u003e\n\u003cp\u003e“Next year there’ll be the baby,” Megan reminded him. “We’ll start a new tradition with your grandchild.”\u003c/p\u003e\n\u003cp\u003e“Will it involve freezing my tail off stomping through acres of trees that all look alike?”\u003c/p\u003e\n\u003cp\u003e“Oh, Dad,” she chided him. “What’s with you this year?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I’m just not in the mood to celebrate Christmas, I guess.”\u003c/p\u003e\n\u003cp\u003e“This evening will help,” she promised gently.\u003c/p\u003e\n\u003cp\u003eCraig drove, and Troy sat with his son-in-law in the front seat while Megan sat in the back. Christmas songs, one after the other, blasted from the radio and they sang along. Well, Megan and Craig joined in; Troy bobbed his head now and then. He didn’t much care about either Frosty or Rudolph at the moment.\u003c/p\u003e\n\u003cp\u003eWhen they arrived at the tree farm, it was packed. It seemed as if every family in Cedar Cove was there, which surprised Troy because this was a Friday night. Colored lights were strung around the area, brightening the trees. There was a big kettle of hot chocolate and one of warm apple cider, both of them, in his opinion, grossly overpriced.\u003c/p\u003e\n\u003cp\u003e“Why is it so busy tonight?” Troy wondered aloud as he ventured away from the car. They were fortunate to have secured a parking space.\u003c/p\u003e\n\u003cp\u003e“Rain’s predicted for tomorrow,” Craig told him.\u003c/p\u003e\n\u003cp\u003eThat explained it. Darkness had fallen, but the sky was clear and stars were starting to show. Any families planning to put up their Christmas trees this weekend would have to purchase them tonight.\u003c/p\u003e\n\u003cp\u003eWhile Craig took the saw out of his trunk, Troy glanced around. He recognized several families.\u003c/p\u003e\n\u003cp\u003eHe heard Megan behind him. “Dad! Oh, Dad, there’s someone here I want you to say hello to.”\u003c/p\u003e\n\u003cp\u003eHe looked back at his daughter and abruptly went still. Standing next to Megan was Faith Beckwith.\u003c/p\u003e\n\u003cp\u003e“Do you remember the wonderful nurse I mentioned?” Megan was asking.\u003c/p\u003e\n\u003cp\u003eHe didn’t. All he could do was stare at Faith.\u003c/p\u003e\n\u003cp\u003eHis mood instantly lifted. “Hello, Faith,” he said. He couldn’t have arranged this any better had he tried.\u003c/p\u003e\n\u003cp\u003e“You do remember her,” Megan chirped. “She talked about you when we had lunch this week.”\u003c/p\u003e\n\u003cp\u003eNow that got his attention. “You and Faith had lunch? Together?” He glanced from one to the other, wondering how this had come about.\u003c/p\u003e\n\u003cp\u003eMegan nodded. “I had some questions about the baby blanket I’m making and I asked Faith to help me.”\u003c/p\u003e\n\u003cp\u003eVaguely Troy recalled that his daughter had taken up knitting.\u003c/p\u003e\n\u003cp\u003e“While we were at lunch, Faith said the two of you knew each other in high school.”\u003c/p\u003e\n\u003cp\u003e“That was a long time ago,” Faith murmured, studying the ground, which was littered with evergreen twigs and clumps of needles. When she did happen to meet his gaze, she gave him a look that could charitably be described as unfriendly. Given how they’d left things, he had no idea what that was all about.\u003c/p\u003e\n\u003cp\u003eMegan appeared oblivious to the tension between them. “I meant to tell you about seeing Faith earlier,” she went on to say. “I think it’s so cool that the two of you were friends in high school.”\u003c/p\u003e\n\u003cp\u003e“We were hardly friends,” she said, slipping her hands in her coat pockets.\u003c/p\u003e\n\u003cp\u003e“Are you getting your Christmas tree here, too?” Megan asked her.\u003c/p\u003e\n\u003cp\u003e“I’m with my son and his family,” she said.\u003c/p\u003e\n\u003cp\u003e“I dragged my dad along, too. He could use some holiday cheer.”\u003c/p\u003e\n\u003cp\u003eFaith glanced behind her. “Good to see you again, Megan,” she said, nodding curtly in Troy’s direction, “but I should get back to my family. Have a wonderful Christmas,” she added as she turned away.\u003c/p\u003e\n\u003cp\u003eSomething was definitely wrong. Faith had just given him the cold shoulder and he didn’t know why.\u003c/p\u003e\n\u003cp\u003e“She is so nice,” Megan said.\u003c/p\u003e\n\u003cp\u003e“Yes,” Troy agreed, watching Faith hurry away.\u003c/p\u003e\n\u003cp\u003e“I think it’s so cool that the two of you know each other,” Megan said again.\u003c/p\u003e\n\u003cp\u003eTroy didn’t respond.\u003c/p\u003e\n\u003cp\u003e“You should ask her out.”\u003c/p\u003e\n\u003cp\u003eWhat? Frowning, Troy looked at his daughter. Only a few months ago, she’d been adamantly opposed to his seeing other women. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“A date, Dad,” she said and laughed at his blank expression. “Faith is a warm, lovely woman. She’s helped me in so many ways, and I don’t just mean with my knitting. It was Faith who gave me those statistics about MS. She’s been a real encouragement with the pregnancy, too.” Megan slid her arm through his. “You know, Dad, she’s a widow.”\u003c/p\u003e\n\u003cp\u003eHe made a noncommittal response.\u003c/p\u003e\n\u003cp\u003e“If you were going to date again, I think Faith would be perfect.” His daughter hesitated. “Craig told me not to say anything, but…”\u003c/p\u003e\n\u003cp\u003eTroy regarded his daughter. “About Faith?”\u003c/p\u003e\n\u003cp\u003e“Not that.” She raised one shoulder in a shrug. “It’s about that other woman I saw you with…I think her name’s Sally.” Megan pressed her lips tightly together. “I was pretty upset when Craig and I ran into the two of you, but Craig told me it was none of my business. You have your own life and if you want to start dating again, it’s strictly up to you.”\u003c/p\u003e\n\u003cp\u003e“I…I appreciate that.”\u003c/p\u003e\n\u003cp\u003e“The thing is,” Megan continued, “I thought Sally was kind of bossy.”\u003c/p\u003e\n\u003cp\u003e“Frankly, so did I,” Troy said with a grin.\u003c/p\u003e\n\u003cp\u003e“Are you going to see her again?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Not on your life.”\u003c/p\u003e\n\u003cp\u003eMegan laughed, too. “Gee, Dad, I see Faith over there. Why don’t you go and discuss old times?”\u003c/p\u003e\n\u003cp\u003eHe turned and saw that Megan was right. Faith was standing with her two grandchildren among the Christmas trees. She looked wonderful. Beautiful.\u003c/p\u003e\n\u003cp\u003e“Bring her a cup of cocoa,” his daughter suggested.\u003c/p\u003e\n\u003cp\u003eIn the interest of making some progress with Faith, he was prepared to overlook the fact that the tree-farm people were gouging him. “I think I will.”\u003c/p\u003e\n\u003cp\u003eMegan squeezed his arm. “Good luck, Dad.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eTroy purchased two cups of hot chocolate and carried them to where Faith stood, with her son and his family close by.\u003c/p\u003e\n\u003cp\u003eScott Beckwith nodded at him. “How’re you doing, Sheriff?”\u003c/p\u003e\n\u003cp\u003e“Fine, fine.”\u003c/p\u003e\n\u003cp\u003eFaith was standing stiffly beside her grandchildren and seemed to make a point of ignoring him.\u003c/p\u003e\n\u003cp\u003e“I brought you some cocoa,” he said and held it out to her.\u003c/p\u003e\n\u003cp\u003eFaith’s hands remained buried deep inside her coat pockets. “No, thank you.”\u003c/p\u003e\n\u003cp\u003e“I’ll take it,” her youngest grandchild said eagerly.\u003c/p\u003e\n\u003cp\u003eTroy handed it to the girl, who was about six or seven. “What’s your name?” he asked.\u003c/p\u003e\n\u003cp\u003e“Angela.”\u003c/p\u003e\n\u003cp\u003e“I’m Bradley,” the older boy announced, staring pointedly at the second cup.\u003c/p\u003e\n\u003cp\u003eTroy willingly relinquished it.\u003c/p\u003e\n\u003cp\u003eAngela smiled up at him. “I have a loose tooth. Wanna see?”\u003c/p\u003e\n\u003cp\u003e“Angela. Bradley.” Scott called his children as he strode ahead. “Come help me cut down this tree.”\u003c/p\u003e\n\u003cp\u003eThe two kids scurried after their father, sloshing hot chocolate as they went.\u003c/p\u003e\n\u003cp\u003eTroy was grateful for these few minutes alone with Faith. “Megan says you’ve been a good friend to her.”\u003c/p\u003e\n\u003cp\u003eShe nodded and started to join her son.\u003c/p\u003e\n\u003cp\u003eTroy placed a hand on her arm, stopping her. “Are you angry about something?”\u003c/p\u003e\n\u003cp\u003eHer head reared back as if he’d shocked her. “Angry?” she asked. “What could I possibly have to be angry about?”\u003c/p\u003e\n\u003cp\u003eThat was exactly his question. He gestured weakly and tried again. “You tell me.”\u003c/p\u003e\n\u003cp\u003eShe turned to face him then, her eyes flashing with fury. “You broke off our relationship.”\u003c/p\u003e\n\u003cp\u003e“Can we forget about that, Faith? I’d like to go out again.”\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed. “Then I suggest you contact Sally.”\u003c/p\u003e\n\u003cp\u003eTroy was stunned. One blind date—which had been a disaster—and it seemed the entire county had heard. Bad enough that he’d bumped into Megan and Craig that night, but now apparently Faith knew about it, too.\u003c/p\u003e\n\u003cp\u003e“She sounds like your type,” Faith said in a withering voice.\u003c/p\u003e\n\u003cp\u003e“She isn’t,” Troy told her. “You are.”\u003c/p\u003e\n\u003cp\u003eHer stance relaxed just a little, and for a moment Troy saw the pain in her eyes. “I used to think you were my type, too, but I was wrong.”\u003c/p\u003e\n\u003cp\u003e“Come on, be fair.” Troy was losing his patience. “So I went out with someone else—once. You’re taking this too personally.”\u003c/p\u003e\n\u003cp\u003eShe considered his observation, then shrugged as if it was of no concern. “Perhaps I am. Let me assure you, you’re welcome to date whomever you wish.”\u003c/p\u003e\n\u003cp\u003e“I want to date you,” he insisted. He didn’t understand why she was making this so difficult.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I’m flattered but it won’t work. I enjoyed our time together, but it’s over.”\u003c/p\u003e\n\u003cp\u003e“It’s not over for me,” he said.\u003c/p\u003e\n\u003cp\u003eShe laughed softly. “I beg to differ. You’re the one out there dating again. I wish you well, Troy, I really do, but I have a real problem with a man who says one thing and does another.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“You told me Megan couldn’t accept the thought of you dating so soon after you lost your wife.”\u003c/p\u003e\n\u003cp\u003e“Yes, but—”\u003c/p\u003e\n\u003cp\u003e“I guess that only applied to me. She didn’t appear to have a problem when you went out with Sally. Not that I care, mind you. As far as I’m concerned, this is an integrity issue.”\u003c/p\u003e\n\u003cp\u003eTroy had heard enough. “You are way out of line here, Faith. I came to you and I tried to make amends—which you rejected because you were stuck in the past. What happened back then wasn’t my fault, I might remind you.”\u003c/p\u003e\n\u003cp\u003eFaith had the grace to blush.\u003c/p\u003e\n\u003cp\u003e“If you want to discuss integrity, then let’s talk about you befriending my daughter behind my back.” He had a few questions of his own. Faith wasn’t blameless in all of this. \u003c/p\u003e","sourceLink":"https://allnovel.net/8-sandpiper-way-cedar-cove-8/page-37.html","bookId":1949,"creation":"Oct 5, 2019 10:08:08 AM","modification":"Oct 5, 2019 10:08:08 AM"}
