{"id":68147,"no":42,"title":"Page 42","content":"\u003cp\u003e“She insisted I take it,” Dave said, struggling not to sound defensive. He wanted to kick himself ten times over for accepting that watch. From the moment he’d slipped it on his wrist, it had felt like a mistake.\u003c/p\u003e\n\u003cp\u003eIt seemed that every protestation of innocence fell on deaf ears. Even his wife doubted him. Dave went on to explain that Martha had written a letter saying he was to have the watch.\u003c/p\u003e\n\u003cp\u003e“You actually saw the letter?” Roy asked.\u003c/p\u003e\n\u003cp\u003e“Yes. Martha showed it to me. Her attorney was coming by later that afternoon and she said she’d give it to him.”\u003c/p\u003e\n\u003cp\u003e“Did he?”\u003c/p\u003e\n\u003cp\u003eDave hadn’t followed up on that. “I…I don’t know. I assume he didn’t, because when Emily went to the attorney’s office to check the file, the letter wasn’t there.”\u003c/p\u003e\n\u003cp\u003eThat instigated another series of questions, which Dave did his best to answer. He told Roy that Emily had visited Allan Harris’s office and been able to look at the file, thanks to Geoff Duncan, Allan’s legal assistant. Dave stressed that Geoff’s action had to remain confidential and that he’d done it as a favor.\u003c/p\u003e\n\u003cp\u003e“Emily was upset,” Dave said. But not nearly as upset as he was when he’d learned that Martha’s letter had never been received.\u003c/p\u003e\n\u003cp\u003eRoy tapped his pencil against the pad. “I can well imagine.”\u003c/p\u003e\n\u003cp\u003e“I thought,” Dave said, gazing down at the gold watch on Roy’s desk, “that I was free to wear it.”\u003c/p\u003e\n\u003cp\u003eRoy made another notation on his pad; Dave wished he could read upside down.\u003c/p\u003e\n\u003cp\u003eRoy looked up. “You want me to return the watch to Martha’s family?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Dave met his eyes. “With my sincere apologies for the misunderstanding. I feel sick about this.”\u003c/p\u003e\n\u003cp\u003eRoy didn’t say anything for what seemed like hours but was probably only a few seconds. “I’m afraid this looks…incriminating.”\u003c/p\u003e\n\u003cp\u003eDave was all too aware of that.\u003c/p\u003e\n\u003cp\u003e“You were probably the last person to see Martha Evans alive,” Roy reminded him.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You’re one of a handful of people who knew where she hid her valuables.”\u003c/p\u003e\n\u003cp\u003eHe swallowed uncomfortably. “That seems to be the case.”\u003c/p\u003e\n\u003cp\u003e“You were seen wearing a valuable gold watch that belonged to Martha’s husband.”\u003c/p\u003e\n\u003cp\u003eDave nodded slowly.\u003c/p\u003e\n\u003cp\u003e“Is there anything else? Anything you haven’t told me?”\u003c/p\u003e\n\u003cp\u003eHe might as well be speaking to the sheriff. Roy’s questions and his own answers made him look—and feel—guilty. Only he wasn’t.\u003c/p\u003e\n\u003cp\u003e“Dave?”\u003c/p\u003e\n\u003cp\u003eUnable to remain seated, Dave stood up and walked to the far side of the office. “Yes.” His heart was hammering so wildly, it hurt to breathe. Turning around again, he reached into his pocket and removed the plastic bag that held the diamond earrings. He put it on the desk next to the watch.\u003c/p\u003e\n\u003cp\u003eRoy gestured at the earrings. “These were Martha’s, too?”\u003c/p\u003e\n\u003cp\u003e“I believe so…Emily s-saw a picture of them in…in Martha’s file.” He couldn’t keep the stammer out of his voice.\u003c/p\u003e\n\u003cp\u003e“You’d better explain.”\u003c/p\u003e\n\u003cp\u003eDave went on to tell him about Emily’s discovery of the earrings. As hard as he tried to work out how they’d gotten into his pockets, he couldn’t. Roy was very quiet when Dave finished describing what he knew.\u003c/p\u003e\n\u003cp\u003e“Do you want me to return these to the family, as well?” he asked.\u003c/p\u003e\n\u003cp\u003eDave shrugged helplessly. “I…don’t know what to do. The thing is, I don’t want them in my possession. Anyone who saw them might assume…They’d believe I was guilty, and nothing I said would make a bit of difference.”\u003c/p\u003e\n\u003cp\u003eDave collapsed into the chair and covered his face with both hands. “That’s not all.”\u003c/p\u003e\n\u003cp\u003e“You mean there’s more?” Roy asked, lowering his voice.\u003c/p\u003e\n\u003cp\u003eDave lowered his hands. “It happened a long time ago.”\u003c/p\u003e\n\u003cp\u003eRoy waited, and when Dave didn’t immediately speak, he said, “Okay. Tell me what it is.”\u003c/p\u003e\n\u003cp\u003eDave felt his chest tighten with dread.\u003c/p\u003e\n\u003cp\u003e“Come on,” Roy said, not unkindly. “Might as well spill it.”\u003c/p\u003e\n\u003cp\u003eDave would rather leave the past buried. But he no longer had a choice. He got to his feet and moved over to the window, turning his back on the detective. He closed his eyes.\u003c/p\u003e\n\u003cp\u003e“Dave,” Roy said, “it’ll come out sooner or later. You can tell me or not. Up to you. But I suspect that whatever it is, you can bet Sheriff Davis will find out.”\u003c/p\u003e\n\u003cp\u003eDave agreed. It would be pointless to even try to keep this a secret. “A month after my eighteenth birthday I was arrested.”\u003c/p\u003e\n\u003cp\u003e“So you have a police record?”\u003c/p\u003e\n\u003cp\u003eThis nightmare never seemed to end; it only got worse. “I’m…not sure. It was my first offense and I was given a light sentence—three months of community service.” He turned around. “The judge said if I kept out of trouble, my record would be wiped clean.”\u003c/p\u003e\n\u003cp\u003e“And was it?”\u003c/p\u003e\n\u003cp\u003e“I think so, but I can’t say for sure.” He obviously had a habit of making assumptions. He did his part and it seemed reasonable to take for granted that others had done theirs. All too often, it seemed, that turned out not to be true.\u003c/p\u003e\n\u003cp\u003e“You never checked?”\u003c/p\u003e\n\u003cp\u003e“No.” He’d been too humiliated, too embarrassed. As much as possible, he’d wanted to put that part of his life behind him. “But I assume so because I work part-time at the bank, and they must’ve done a security check when they hired me.”\u003c/p\u003e\n\u003cp\u003eRoy wrote down something else. Apparently this latest revelation wasn’t welcome news.\u003c/p\u003e\n\u003cp\u003e“Other than my parents, no one knows about this,” Dave said in a low voice.\u003c/p\u003e\n\u003cp\u003e“Not Emily?”\u003c/p\u003e\n\u003cp\u003eDave shook his head. “I tried not to think about it.” Most people had at least one thing in their lives that they wished they could do over. Some mistake or error in judgment. Some act of selfishness or stupidity.\u003c/p\u003e\n\u003cp\u003e“You didn’t mention what the crime was,” Roy reminded him.\u003c/p\u003e\n\u003cp\u003e“You’re right, I didn’t.”\u003c/p\u003e\n\u003cp\u003e“Any particular reason?”\u003c/p\u003e\n\u003cp\u003eDave swallowed. “Theft.”\u003c/p\u003e\n\u003cp\u003eLeaning back in his chair, Roy stared up at him. “What did you take?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t me.” A protest rose automatically to his lips. Dredging up these memories was painful, and he was a different person than he’d been all those years ago.\u003c/p\u003e\n\u003cp\u003eRoy didn’t press him to continue. Dave started to pace, and after a few minutes, felt ready to explain. “I grew up a preacher’s kid.”\u003c/p\u003e\n\u003cp\u003e“So your father was a pastor, too?”\u003c/p\u003e\n\u003cp\u003eDave ignored the question because the answer was obvious. “As is often the case, there’s a lot of pressure on a minister’s family. We kids were expected to set an example, to behave perfectly so not to embarrass our parents.”\u003c/p\u003e\n\u003cp\u003e“That’s a pretty high standard to live up to.”\u003c/p\u003e\n\u003cp\u003e“It was for me. I tried to be the son my father wanted. Still, no matter what I did, my parents found fault.”\u003c/p\u003e\n\u003cp\u003e“It’s not all that different for a cop’s kids,” Roy told him.\u003c/p\u003e\n\u003cp\u003eDave had never considered that the situation in other families might be the same, which was naive of him.\u003c/p\u003e\n\u003cp\u003e“When I reached my teens, I gave up trying to please my father,” he said.\u003c/p\u003e\n\u003cp\u003e“In other words, you rebelled.”\u003c/p\u003e\n\u003cp\u003eThat was an understatement, to say the least. Dave had rejected all his father’s values and principles. He’d skipped classes, hung around with a rough crowd, started drinking underage. Because he’d graduated from high school at seventeen he began his first year of college before his eighteenth birthday. That was when he connected with Tom Cummings and his friends.\u003c/p\u003e\n\u003cp\u003eDave had never met anyone like Tom. He was a natural leader, and being part of his group had made Dave feel important, included. While it was true that Tom was a practical joker, a guy who always tested the limits, it was all in good fun. Or so Dave had thought. Until, one day, it ceased being fun.\u003c/p\u003e\n\u003cp\u003eTom needed money. Dave couldn’t remember why it was so critical that Tom have four hundred dollars. Of course none of them had that kind of money to spare. Although if he’d had the funds—or access to them—Dave would’ve blindly handed over whatever Tom demanded.\u003c/p\u003e\n\u003cp\u003eSomeone came up with the idea. In the beginning Dave had been sure it was a joke. All too soon he discovered how real it was, and by then…\u003c/p\u003e\n\u003cp\u003e“What were the charges against you?”\u003c/p\u003e\n\u003cp\u003e“Theft and aggravated assault.” The words sounded foreign to him, as if they were from a different language. One he didn’t speak, didn’t understand.\u003c/p\u003e\n\u003cp\u003eHis admission hung in the air between them, like the dust that follows an explosion.\u003c/p\u003e\n\u003cp\u003e“What was the age of the victim?” Roy finally asked.\u003c/p\u003e\n\u003cp\u003eThe tightness in his throat made it almost impossible to answer. “Seventy-three.”\u003c/p\u003e\n\u003cp\u003eRoy set his pen aside and exhaled slowly.\u003c/p\u003e\n\u003cp\u003e“You don’t need to tell me how bad this looks,” Dave muttered.\u003c/p\u003e\n\u003cp\u003eIf news of his youthful arrest went public, no one would ever believe that he hadn’t stolen from Martha Evans. No one would ever believe him again, period. He’d lose all credibility.\u003c/p\u003e\n\u003cp\u003eHe might as well give up now. The fact that the incident had happened almost twenty years ago didn’t matter. Nor did all the years he’d served God and this community. People would remember only one thing about him—what he’d done at eighteen.\u003c/p\u003e\n\u003cp\u003eRoy was suspiciously quiet.\u003c/p\u003e\n\u003cp\u003e“I suppose you’re going to advise me to turn myself in,” Dave said stiffly, his back straight and his voice hard.\u003c/p\u003e\n\u003cp\u003e“Did you steal Martha Evans’s jewelry?”\u003c/p\u003e\n\u003cp\u003e“I already told you I didn’t have anything to do with that!” he cried. “You don’t believe me, do you?”\u003c/p\u003e\n\u003cp\u003e“On the contrary, I do.”\u003c/p\u003e\n\u003cp\u003e“But everyone will think—”\u003c/p\u003e\n\u003cp\u003e“You know the truth,” Roy said without emotion, “and since it is the truth, I don’t feel you have anything to worry about.”\u003c/p\u003e\n\u003cp\u003eDave’s relief was so great that for a moment he thought he might break down.\u003c/p\u003e\n\u003cp\u003e“You believe I’m telling the truth even though all the evidence seems to point directly at me?”\u003c/p\u003e\n\u003cp\u003eRoy shrugged. “Sheriff Davis would be the first to tell you that while circumstantial evidence can solve a crime, it can be misleading, too. The person responsible for the crime isn’t always the most obvious. Everything you’ve told me amounts to circumstantial evidence. You claim you didn’t have anything to do with those missing jewels. I’ve known you for a number of years and I’ve never seen you do anything underhanded or dishonest. So…I believe you.”\u003c/p\u003e\n\u003cp\u003eIt felt good to have at least one person on his side. “Why should you trust me? I mean, maybe I haven’t really changed. Maybe I’m still a thief.” He couldn’t resist pushing Roy. He needed all the reassurance he could get.\u003c/p\u003e\n\u003cp\u003e“Why should I trust you?” Again Roy shrugged. “Because I do. First, you wouldn’t wander around town flaunting that watch if you’d stolen it. For another thing, I feel I’m a good judge of character.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/8-sandpiper-way-cedar-cove-8/page-42.html","bookId":1949,"creation":"Oct 5, 2019 10:08:08 AM","modification":"Oct 5, 2019 10:08:08 AM"}
