{"id":68148,"no":43,"title":"Page 43","content":"\u003cp\u003e“Last, and probably most important,” Roy said, leaning forward and scribbling a note on his pad, “Sheriff Davis has a fairly good idea who might be responsible.”\u003c/p\u003e\n\u003cp\u003e“He does?”\u003c/p\u003e\n\u003cp\u003eRoy met his gaze and nodded.\u003c/p\u003e\n\u003cp\u003eDave continued to stare at him. “You aren’t going to tell me who you think it might be?”\u003c/p\u003e\n\u003cp\u003eRoy grinned. Then he said, “That’s not up to me. You’ve asked for my advice and I’ll give it to you. Go see Sheriff Davis and tell him everything you’ve just told me.”\u003c/p\u003e\n\u003cp\u003eThirty\u003c/p\u003e\n\u003cp\u003eTroy Davis decided this was destined to be the worst Christmas of his life. He could see it happening already. Everywhere he turned people were in good spirits. Even the crime rate was down. Folks around town had taken a kinder, gentler approach to life. Instead of lifting his own mood, however, that only irritated him. In a word, he was depressed.\u003c/p\u003e\n\u003cp\u003eThe reason, and he was obliged to admit the fault was of his own making, could be attributed to a number of unpleasant factors. First and foremost, the woman he loved wanted nothing to do with him.\u003c/p\u003e\n\u003cp\u003eThey’d parted on relatively friendly terms. But he wondered if it would’ve been better if they’d simply blown up at each other, if they’d stopped hiding the pain and the anger. But oh, no, that wasn’t Faith’s way. She’d wanted to end their relationship on a civilized note. For all the well-wishing between them, he told himself peevishly, you’d think they’d gotten engaged.\u003c/p\u003e\n\u003cp\u003eIt didn’t help his mood that Dave Flemming seemed to have involved the entire town in this ridiculous Nativity reenactment. The whole cast of characters, from Mary and Joseph right down to the drummer boy, was made up of volunteers. They were displaying the tableau nightly for two weeks, until December twenty-third. People who came to see it were asked to bring a nonperishable item to feed the hungry or throw a dollar or two into a donation box. Word had spread to the surrounding communities and there were whole caravans of cars and trucks making their way to Cedar Cove. So that meant traffic snarls and chaos on the road, which required him to add a rotation of deputies to deal with it.\u003c/p\u003e\n\u003cp\u003eTroy had no idea how Dave had managed to borrow a camel for the program. From some petting zoo, maybe? But camels weren’t the friendliest or most tolerant of beasts, or so he’d heard. In addition, Dave had located a few head of sheep, a donkey and some cattle; all of them were required to stand in adoration for at least four hours every night. Nothing like this had ever taken place in Cedar Cove before and the event was an unqualified success. It was even more popular than the seagull calling contest, which was really saying something.\u003c/p\u003e\n\u003cp\u003eSuccessful as it was, though, the Nativity scene put a lot of pressure on Pastor Flemming. And things would only get worse because Troy was obliged to call him in for questioning. Martha Evans’s relatives were on him like white on rice. Those two women wanted their mother’s jewelry, and they weren’t going to let up until Troy made an arrest. Circumstantially, everything pointed to Dave Flemming. But after all these years in police work, Troy knew he could rely on his instincts and he didn’t believe for a minute that Dave was involved. Still, there were a few unanswered questions he needed to ask—not that Dave was the only “person of interest” here. Unfortunately the likely culprit had been cagey and Troy didn’t have a legitimate reason to order a visit to the station—not yet, anyway.\u003c/p\u003e\n\u003cp\u003eThe phone rang and he grabbed it, grateful for the interruption. “Sheriff Davis.”\u003c/p\u003e\n\u003cp\u003e“Hi, Daddy.” His daughter’s sweet voice instantly made him feel better. “Merry Christmas.”\u003c/p\u003e\n\u003cp\u003e“Same to you, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“I saw Faith this morning.”\u003c/p\u003e\n\u003cp\u003eTroy gritted his teeth. Megan didn’t realize she was rubbing salt in an open wound. “That’s nice,” was the best he could manage.\u003c/p\u003e\n\u003cp\u003e“She said to tell you hello.”\u003c/p\u003e\n\u003cp\u003eTroy straightened. This might be a sign. Perhaps Faith was signaling that she’d be receptive to hearing from him. His mood lightened a little more. “Did she now?” Perhaps Faith had experienced a change of heart and was using his daughter as a messenger.\u003c/p\u003e\n\u003cp\u003e“I told you she’s helping me with my knitting, didn’t I?”\u003c/p\u003e\n\u003cp\u003e“I think you said something about it.” He was afraid to reveal how desperate he was for every detail his daughter could give him.\u003c/p\u003e\n\u003cp\u003e“We’re going to meet for lunch every week.”\u003c/p\u003e\n\u003cp\u003e“That’s nice.” Again, he kept his voice even so as not to indicate any undue interest.\u003c/p\u003e\n\u003cp\u003e“It is. We talk about my pregnancy and she’s been really helpful. She’s a lot like Mom, you know. She listens and reassures me. I like her so much.”\u003c/p\u003e\n\u003cp\u003eTroy let the comment slide, eager to hear anything Faith might have said, but not so eager that he’d ask his daughter outright.\u003c/p\u003e\n\u003cp\u003e“I asked her why the two of you didn’t get together. You used to like each other, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes, but that was eons ago.”\u003c/p\u003e\n\u003cp\u003eMegan sighed. “That’s what Faith said, too.”\u003c/p\u003e\n\u003cp\u003eTroy knew she’d never say anything openly critical of him, especially to Megan. He was astonished that the two of them had become friends without his knowing it. Who would’ve guessed? Now Megan was practically begging him to date the very woman she’d once feared would come between them.\u003c/p\u003e\n\u003cp\u003e“She had lots of nice things to say about you.”\u003c/p\u003e\n\u003cp\u003eHe resisted asking his daughter to list those things one by one.\u003c/p\u003e\n\u003cp\u003e“Something happened, didn’t it?”\u003c/p\u003e\n\u003cp\u003eBefore he could form a reply, Megan said, “Something you don’t want to tell me because Faith doesn’t want to talk about it, either.”\u003c/p\u003e\n\u003cp\u003eTroy exhaled. “Sometimes it’s best to leave the past in the past.”\u003c/p\u003e\n\u003cp\u003e“Is there anything I can do, Daddy?”\u003c/p\u003e\n\u003cp\u003e“Do?”\u003c/p\u003e\n\u003cp\u003e“To make things right between you and Faith.”\u003c/p\u003e\n\u003cp\u003eHe considered the offer and could think of nothing. “No, but thanks for asking.”\u003c/p\u003e\n\u003cp\u003eTroy glanced up and saw Roy McAfee in the doorway. “Let me call you back,” he told his daughter.\u003c/p\u003e\n\u003cp\u003e“Do you have a visitor?”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003eMegan sounded disappointed. “I wish it was Faith.”\u003c/p\u003e\n\u003cp\u003eSo did Troy. If Santa was up to granting requests this year, Troy would ask for another chance with her. Unfortunately, all the evidence said there was no Santa.\u003c/p\u003e\n\u003cp\u003e“Bye, Daddy.”\u003c/p\u003e\n\u003cp\u003e“Bye for now.”\u003c/p\u003e\n\u003cp\u003eAs soon as he’d replaced the receiver, Roy stepped into his office. Troy motioned for him to take a seat. “What can I do for you?” he asked. It went without saying that his friend wasn’t making a social call. If Roy came to the office, it was on official business.\u003c/p\u003e\n\u003cp\u003e“Do you have any new leads on the Martha Evans case?” Roy began. He claimed the chair across from Troy, leaned back and ostentatiously made himself comfortable. It was an unspoken way of conveying that he had information to share.\u003c/p\u003e\n\u003cp\u003e“What makes you ask?” This was a routine they sometimes played out, dodging and feinting until the information was exchanged. Troy liked the private detective and trusted his judgment, but he was the lawman and he made sure Roy understood that.\u003c/p\u003e\n\u003cp\u003e“I had a visitor yesterday,” Roy said.\u003c/p\u003e\n\u003cp\u003e“Was this in regard to the missing jewelry?”\u003c/p\u003e\n\u003cp\u003eA regal nod from Roy.\u003c/p\u003e\n\u003cp\u003e“Anyone I know?”\u003c/p\u003e\n\u003cp\u003eRoy hesitated, then inclined his head again.\u003c/p\u003e\n\u003cp\u003e“As it happens, I had a visitor myself regarding this matter. On Monday as well.”\u003c/p\u003e\n\u003cp\u003eMcAfee lifted his eyebrows. “Anyone I know?” he said, echoing Troy’s own question.\u003c/p\u003e\n\u003cp\u003eBut Troy could be as evasive as his friend. He inclined his head, too.\u003c/p\u003e\n\u003cp\u003e“My visitor was Dave Flemming,” Roy told him.\u003c/p\u003e\n\u003cp\u003e“Geoff Duncan came to see me.”\u003c/p\u003e\n\u003cp\u003e“Did he now?” McAfee went on to tell him everything Dave had said, which was quite a bit.\u003c/p\u003e\n\u003cp\u003eTroy then revealed that Dave had phoned and asked to speak to him but wanted to wait until after Christmas. After that, Troy was more convinced than ever that his theory was correct.\u003c/p\u003e\n\u003cp\u003e“Geoff came to tell me he was in a quandary,” he said casually. “Apparently he’s been wrestling with what to do and decided that even if he did lose his job, he couldn’t keep quiet any longer.”\u003c/p\u003e\n\u003cp\u003e“He told you about Emily Flemming’s visit to the law office.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I thought he might do that.” Roy stood, reached inside his pants pocket and produced the gold watch and a pair of diamond earrings.\u003c/p\u003e\n\u003cp\u003eTroy immediately recognized both as part of the Evans estate. “You got those from Dave?”\u003c/p\u003e\n\u003cp\u003eRoy nodded. “He claims the watch was a gift from Martha.”\u003c/p\u003e\n\u003cp\u003e“And the paperwork was supposed to be in the file, only it wasn’t. Right?”\u003c/p\u003e\n\u003cp\u003e“Exactly,” Roy said. Then he added, “Dave says he doesn’t know where the diamond earrings came from. He told me he’d never laid eyes on them until his wife showed them to him. She found them in his suit jacket.”\u003c/p\u003e\n\u003cp\u003eTroy said nothing.\u003c/p\u003e\n\u003cp\u003eMcAfee studied him closely. “I believe him.”\u003c/p\u003e\n\u003cp\u003e“I do, too.” The sheriff relaxed in his chair and leaned back. “Want to tell me what you’re thinking?”\u003c/p\u003e\n\u003cp\u003e“Sure thing, Sheriff—if you’re willing to share your thoughts, too.”\u003c/p\u003e\n\u003cp\u003eTroy chuckled. “I have a feeling we’ve reached the same conclusion.”\u003c/p\u003e\n\u003cp\u003e“If I were a betting man, I’d lay odds on it.”\u003c/p\u003e\n\u003cp\u003e“Cards on the table, then?”\u003c/p\u003e\n\u003cp\u003e“Cards on the table,” Roy said.\u003c/p\u003e\n\u003cp\u003eThirty-One\u003c/p\u003e\n\u003cp\u003eRachel carried a box of clothes into the living room and stacked it on top of the others. She couldn’t believe she’d allowed Bruce to talk her into an early wedding at this time of year. Christmas!\u003c/p\u003e\n\u003cp\u003eIt was insane.\u003c/p\u003e\n\u003cp\u003eIt was wonderful.\u003c/p\u003e\n\u003cp\u003eShe was eager to wake up in the morning with the man she loved by her side. She’d given notice on her small rental house but had until New Year’s Eve to move everything out.\u003c/p\u003e\n\u003cp\u003eJolene burst back into the house. “Anything else?” she asked.\u003c/p\u003e\n\u003cp\u003e“Take the box on top. It isn’t heavy.” Rachel bent to rearrange the dishes in one carton.\u003c/p\u003e\n\u003cp\u003e“Okay, got it.” She grabbed it and headed outside to Bruce’s truck.\u003c/p\u003e\n\u003cp\u003eBruce, who was entering the house as Jolene went out, held the door for his daughter.\u003c/p\u003e\n\u003cp\u003eRachel straightened and rubbed the small of her back. She was astonished by the amount of stuff she’d managed to accumulate during her seven years in this rental. Most of the furniture was second-hand and she intended to donate it to charity, but that still left a lot to pack.\u003c/p\u003e\n\u003cp\u003e“You’re exhausted,” Bruce said. “Maybe we should all take a break.”\u003c/p\u003e\n\u003cp\u003eRachel shook her head, despite the fact that she’d started work at eight that morning and been on her feet nine hours before rushing home to pack.\u003c/p\u003e\n\u003cp\u003eWalking over to her, Bruce drew her into the circle of his arms. “Thank you,” he said.\u003c/p\u003e\n\u003cp\u003e“For what?”\u003c/p\u003e\n\u003cp\u003e“For loving me and Jolene. For agreeing to marry me now and not making me wait until February.”\u003c/p\u003e\n\u003cp\u003e“Trust me, Bruce, I’m not complaining.”\u003c/p\u003e\n\u003cp\u003e“Didn’t I tell you we should have our wedding over the holidays?” \u003c/p\u003e","sourceLink":"https://allnovel.net/8-sandpiper-way-cedar-cove-8/page-43.html","bookId":1949,"creation":"Oct 5, 2019 10:08:08 AM","modification":"Oct 5, 2019 10:08:08 AM"}
