{"id":26290,"no":15,"title":"CHAPTER XV MR. BATHURST TAKES HIS SECOND LOOK—WITH MR. CUNNINGHAM’S ASSISTANCE","content":"Anthony drew me to one side. “I don’t think we gain a lot by staying here, Bill,” he whispered. “We’ll get back to my original proposition—let’s have another look at Prescott’s bedroom.”\n\u003cbr\u003e \n\u003cbr\u003e We entered the house and went upstairs. It will be remembered that the bedroom occupied by Prescott was the fourth along the corridor, and lay between the rooms that had sheltered Major Hornby and Tennant. It had been straightened and put in order.\n\u003cbr\u003e \n\u003cbr\u003e Anthony went to the wardrobe and opened it. “Clothes all gone,” he remarked.\n\u003cbr\u003e \n\u003cbr\u003e “Wouldn’t the Inspector have them?” I suggested.\n\u003cbr\u003e \n\u003cbr\u003e “I don’t mean the clothes he was wearing—I wanted his other clothes.”\n\u003cbr\u003e \n\u003cbr\u003e “Mrs. Prescott, I expect—that’s the explanation. She’s taken them.”\n\u003cbr\u003e \n\u003cbr\u003e “Very probably, Bill! Never mind—can’t be helped. I daresay she’ll let me have a glance at them if I consider it necessary. Let’s have a look at the dressing-table drawers. Are they empty too?”\n\u003cbr\u003e 191\n\u003cbr\u003e \n\u003cbr\u003e I tried the first—empty. The others were in similar condition—everything had been removed—either by Baddeley or for Mrs. Prescott.\n\u003cbr\u003e \n\u003cbr\u003e “We’re late, old man,” I said. “There’s nothing here.”\n\u003cbr\u003e \n\u003cbr\u003e Anthony came and looked. “Pity! Still—it’s my own fault—I ought to have anticipated this. Delays are dangerous.”\n\u003cbr\u003e \n\u003cbr\u003e He crossed to the window, and looked out, leaving the bathroom door open behind him.\n\u003cbr\u003e \n\u003cbr\u003e “Precious little chance of any exit or entrance this way,” he said. “A cat would find a foothold difficult.”\n\u003cbr\u003e \n\u003cbr\u003e “Why?” I asked. “You didn’t really consider that as a possibility, did you?”\n\u003cbr\u003e \n\u003cbr\u003e “I consider everything as a possibility, Bill—till I know it’s not. Hallo—that’s rather interesting.” He pointed to the wash-hand basin.\n\u003cbr\u003e \n\u003cbr\u003e “What is it?” I said.\n\u003cbr\u003e \n\u003cbr\u003e “The stub of a cigar! Not finished either. Funny place for a cigar.”\n\u003cbr\u003e \n\u003cbr\u003e “Not altogether,” I ventured. “Suppose Prescott was smoking a cigar when he came to bed that night and came in here to wash his hands. It would be a very natural thing for him to put it there while he washed them.”\n\u003cbr\u003e \n\u003cbr\u003e Anthony nodded approvingly. “Yes! And when he’d finished washing them?”\n\u003cbr\u003e \n\u003cbr\u003e “Well?”\n\u003cbr\u003e 192\n\u003cbr\u003e \n\u003cbr\u003e “What then? Don’t you think he would pick it up again and finish his smoke rather than leave it lying there?”\n\u003cbr\u003e \n\u003cbr\u003e “Possibly,” I responded.\n\u003cbr\u003e \n\u003cbr\u003e “Rather strange it hasn’t been removed,” he reflected. “Haven’t any servants been here since the murder?”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps they did the bedroom and didn’t trouble to come in here.”\n\u003cbr\u003e \n\u003cbr\u003e He picked up the portion of cigar. As he had remarked it had certainly not been smoked to the point of necessary relinquishment.\n\u003cbr\u003e \n\u003cbr\u003e “Remember what Mary Considine told us, Bill? Not long ago?”\n\u003cbr\u003e \n\u003cbr\u003e “How do you mean?” I said.\n\u003cbr\u003e \n\u003cbr\u003e “On the third occasion that she fancied Prescott was being watched or followed she went into the garden where she imagined the watcher to be, and detected the smell of cigar smoke. Nothing like conclusive, I know—but certainly pointing in the same direction.”\n\u003cbr\u003e \n\u003cbr\u003e “What brand is it?” I asked.\n\u003cbr\u003e \n\u003cbr\u003e Anthony demurred. “I am well aware that the immortal Holmes had published a brochure on the various kinds of tobacco ash—I really forget the number he mentioned—but alas! I am unable to keep pace with him there. It looks an ordinary type—I can tell you one thing—it isn’t one of Sir Charles Considine’s assortment—I’ve had too many not to know that. Still I’ll hang onto it.” He put it carefully away in his pocket.\n\u003cbr\u003e 193\n\u003cbr\u003e \n\u003cbr\u003e “You’ll find that’s Prescott’s all right,” I exclaimed. “How can you imagine it could belong to anybody else? How could anybody else get in here—for a start? In the bathroom of Prescott’s bedroom!”\n\u003cbr\u003e \n\u003cbr\u003e “There’s a door, Bill,” rejoined Anthony drily. “Quite a natural method of entering a room. You may be quite right, and it may have been Prescott’s—all the same I’m going to have a look round in here—there may be more in Mary’s story than either of us anticipated.” Out came the magnifying-glass again and he got to work with it on the floor of the bathroom.\n\u003cbr\u003e \n\u003cbr\u003e I strolled back into the bedroom, and couldn’t altogether resist a smile as I heard him talking to himself from the farther apartment.\n\u003cbr\u003e \n\u003cbr\u003e “These criminologists take things extraordinarily seriously,” I thought to myself. “Good job if they don’t run across too many cases in a lifetime.”\n\u003cbr\u003e \n\u003cbr\u003e I looked round the bedroom. Why shouldn’t I try my hand at the sleuth game? Perhaps I could find something! To the best part of my memory Prescott’s bedroom had not received too meticulous an examination. After all he had slept and dressed in here for nearly a week, and a bedroom might very easily contain something of his secret, assuming that he possessed one. It was an intimate room—it touched a man—closely. If he had anything to conceal, it might well be that it was hidden in here, somewhere. I wandered round, my eyes searching for likely hiding-places. Inspiration came from nowhere. My eyes caught the bed. Had anybody looked underneath? At any rate I decided that I would! I went down full length and wriggled my body underneath. And I had not been under there many seconds when I formed the opinion that while the floor had nothing to tell me, the wainscoting directly below the head of the bed had three tiny pieces of paper on it! They had fluttered down as very small fragments of paper will, and come to rest on the skirting-board, before reaching the floor itself. Very probably of no consequence whatever, but I’d have old Anthony in, come what may!\n\u003cbr\u003e 194\n\u003cbr\u003e \n\u003cbr\u003e I went to the connecting door. “Come in here a minute, will you?”\n\u003cbr\u003e \n\u003cbr\u003e To all appearances he was engaged in a close scrutiny of the bath-mat. “What’s up?” he queried.\n\u003cbr\u003e \n\u003cbr\u003e I was as near excitement as I had been since this bewildering affair had started.\n\u003cbr\u003e \n\u003cbr\u003e I beckoned him. “Come in here!” I said. He came with alacrity. I lay at full length as I had done just previously. “Flop down here.” He joined me. I pointed to the skirting-board. “See anything there?”\n\u003cbr\u003e \n\u003cbr\u003e “Only too true,” he muttered. “Wonder what it can be! Wriggle up and get it, Bill, the honors are yours, it’s your discovery.”\n\u003cbr\u003e \n\u003cbr\u003e I wasted no time to do his bidding.\n\u003cbr\u003e \n\u003cbr\u003e There were three tiny pieces of paper, just as I had thought. I took them carefully from the little ledge on which they were resting, and crawled out triumphantly from under the bed.\n\u003cbr\u003e 195\n\u003cbr\u003e \n\u003cbr\u003e “Good man!” he grinned. “What are they—exactly—now you’ve fished ’em out? Pieces of a last week’s hotel-bill or an announcement of the local flower-show?”\n\u003cbr\u003e \n\u003cbr\u003e I shook my head. “Remains of a letter,” I grunted—“there’s handwriting here.”\n\u003cbr\u003e \n\u003cbr\u003e I handed the fragments to him. He took them eagerly. They were obviously small parts of a letter that had been carelessly torn up by somebody in the room, and in the throwing-away process had by some freak of wind or whimsicality, fluttered to the skirting-board. So I reasoned. Anthony spread them out.\n\u003cbr\u003e \n\u003cbr\u003e I reproduce the three pieces here as nearly as I can remember them after so long an interval.\n\u003cbr\u003e \n\u003cbr\u003e I will meet\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; you in the B\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; so\n\u003cbr\u003e when you\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Mary.\n\u003cbr\u003e at 1.\n\u003cbr\u003e \n\u003cbr\u003e I gasped! “Good Lord!” I exclaimed. Anthony raised his eyebrows.\n\u003cbr\u003e \n\u003cbr\u003e “What’s this?” he interrogated. “An assignation? Mary?”\n\u003cbr\u003e \n\u003cbr\u003e “It’s Mary Considine,” I answered. “It’s her handwriting—I’ve seen it too frequently not to know it. Has she written that to Prescott?”\n\u003cbr\u003e \n\u003cbr\u003e “No evidence as to whom it’s addressed, Bill. We can only conjecture as to that. Also we can only surmise what the capital ‘B’ stands for.”\n\u003cbr\u003e 196\n\u003cbr\u003e \n\u003cbr\u003e “What do you think yourself?” I whispered almost fearfully.\n\u003cbr\u003e \n\u003cbr\u003e “Billiard room, possibly! On the other hand——”\n\u003cbr\u003e \n\u003cbr\u003e “If it was her way of answering his proposal—why wasn’t she frank with us about it? Did she meet him or merely intend to?”\n\u003cbr\u003e \n\u003cbr\u003e “Look at the handwriting again, Bill! Look at it closely.”\n\u003cbr\u003e \n\u003cbr\u003e I did as he told me. “You’re absolutely certain it’s Mary Considine’s writing?” he urged with intensity in his tone. “You haven’t the shred of a doubt?”\n\u003cbr\u003e \n\u003cbr\u003e “Not a shred,” I replied. “Not the vestige of a doubt.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well! I’ll see her! I’m pretty accurate at summing people up psychologically, and I’m fully prepared for an adequate explanation.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m relieved to hear you say that,” I said. “Somehow it goes against the grain to have Mary implicated in this business, even though remotely.”\n\u003cbr\u003e \n\u003cbr\u003e “How came you to look under there, Bill?” he asked suddenly.\n\u003cbr\u003e \n\u003cbr\u003e “I think I was fired by your example,” I replied after a slight pause. “Yes, it was,” I went on. “Seeing you poking about in the bathroom started a train of thought in my mind and I decided to have a nose round in here. I glanced at several things in the room, and then suddenly thought of looking under the bed.”\n\u003cbr\u003e 197\n\u003cbr\u003e \n\u003cbr\u003e He showed signs of approval. “It only shows you that second thoughts often prove to be very valuable. Our decision to take another glance at the billiard room and at this bedroom has brought us a great deal of really important information. We’ve progressed.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you think so?” I queried rather gloomily, I’m afraid. “It seems to me we’re getting deeper and deeper into a kind of morass of doubt and suspicion. Each clue we pick up seems to complicate matters, and contradict the previous one.” I sat on the bed. I really meant all that I said. As far as these discoveries went we seemed to be traveling away from a solution and not towards one.\n\u003cbr\u003e \n\u003cbr\u003e “Be of good cheer, William,” cried Anthony jocularly. “All will yet be well.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know that I share your optimism,” I responded—“what’s the next move?”\n\u003cbr\u003e \n\u003cbr\u003e “I’m going to take a rather bold step,” he replied. He came and sat himself on the bed beside me. “I’m going to have another word or two with Mary.” Then he stretched his long legs out and thrust his hands deep in his trousers-pockets. “Maybe I’m running a certain risk, but in life you have to take risks—I’ll take one now.” He jumped to his feet—“Coming, Bill?” I found myself wondering what was coming next as we descended the stairs. Where were we going? I loathed the proximity of Mary to the affair at the first onset and this latest development might mean anything.\n\u003cbr\u003e 198\n\u003cbr\u003e \n\u003cbr\u003e “Would you be good enough to give me a moment in the library?” asked Anthony when we found her. “Just as a ‘quid pro quo’? I gave you a few moments in the billiard room, and now I’m asking you to return the compliment.” He smiled and Mary smiled back.\n\u003cbr\u003e \n\u003cbr\u003e “Of course, Mr. Bathurst! I’ll come now! Is it anything important?” she asked when we were settled.\n\u003cbr\u003e \n\u003cbr\u003e “That’s a difficult question to answer, Miss Considine,” said Anthony seriously, and with an obviously deliberate choice of words. “You were pleased a short while ago to tell me certain intimate details affecting Prescott and yourself—I appreciated intensely the confidence you imposed in me—you see you’ve known me for a considerably less time than you have Bill, here.” He paused.\n\u003cbr\u003e \n\u003cbr\u003e Mary intervened. “I don’t quite know to where all this is leading—but possibly I share, to a very humble extent, your own gift of character-reading.”\n\u003cbr\u003e \n\u003cbr\u003e Anthony bowed to her. “Thank you—again! I am yielding to the promptings of that gift when I approach you now! And the information that you gave me earlier makes that approach a matter of necessity.” He held the three scraps of paper out to her.\n\u003cbr\u003e \n\u003cbr\u003e “Miss Considine—will you look at these very closely? Is the handwriting yours?”\n\u003cbr\u003e \n\u003cbr\u003e Mary glanced at the fragments with growing astonishment.\n\u003cbr\u003e \n\u003cbr\u003e “What is this—please?” she queried.\n\u003cbr\u003e \n\u003cbr\u003e “Can you help by answering my question first?”\n\u003cbr\u003e \n\u003cbr\u003e I watched her and saw the amazement in her eyes.\n\u003cbr\u003e 199\n\u003cbr\u003e \n\u003cbr\u003e “Very well then—Mr. Bathurst—yes. But I can’t——”\n\u003cbr\u003e \n\u003cbr\u003e “You are certain? I want to be unmistakably certain—certain for instance that it isn’t an imitation—a wonderfully accurate imitation?”\n\u003cbr\u003e \n\u003cbr\u003e She wrinkled her brows and pored over the pieces. When she raised her eyes she betrayed greater wonderment than ever.\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Bathurst—Bill—I’m absolutely bewildered. I’m certain—positive—as positive as I ever could be about anything—that this is my handwriting—yet I can’t recognize the letter from where they’ve come—I can’t even think whom it’s to—and if I didn’t know that it was my handwriting—I should swear that I hadn’t written it!!”\n\u003cbr\u003e \n\u003cbr\u003e “You mean,” suggested Anthony, “that you don’t——”\n\u003cbr\u003e \n\u003cbr\u003e “I mean this—absurd though it may seem and sound—that I recognize the handwriting, but I don’t recognize the letter. It is entirely unfamiliar. It appears to me at the moment that I’ve never previously seen it.” The color flamed in her cheeks and her eyes were bright with excitement. Anthony waited for her to proceed. He seemed to divine what her next question was going to be.\n\u003cbr\u003e \n\u003cbr\u003e “Tell me,” her lips were working tremulously, “what is this? How did it come into your possession?”\n\u003cbr\u003e \n\u003cbr\u003e “Those three fragments in your handwriting, Miss Considine, were found under the bed in the room recently occupied by Gerald Prescott.”\n\u003cbr\u003e 200\n\u003cbr\u003e \n\u003cbr\u003e “What?” she exclaimed—indignation challenging surprise in her tone—“Mr. Bathurst—it can’t possibly be—I’ve never written a line to Mr. Prescott in my life.”\n\u003cbr\u003e \n\u003cbr\u003e “Yet they were discovered as I have just said.” He spoke very quietly.\n\u003cbr\u003e \n\u003cbr\u003e “There is some mistake—some mystery,” she reiterated.\n\u003cbr\u003e \n\u003cbr\u003e “Some enemy hath done this—eh?” remarked Anthony.\n\u003cbr\u003e \n\u003cbr\u003e “I’m dumbfounded—I don’t know what to say or suggest. I can’t think!”\n\u003cbr\u003e \n\u003cbr\u003e “Tell me,” he said, “I realize the fragments are small, and therefore, not too easy to identify—but there’s this point. Do you recognize the notepaper as notepaper that you yourself would have been likely to use?”\n\u003cbr\u003e \n\u003cbr\u003e She looked at it closely and ran her fingers over its surface.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” she answered. “It is Considine Manor notepaper—I am sure of that. We have used it for years. I can show it to you.”\n\u003cbr\u003e \n\u003cbr\u003e She went across to Sir Charles Considine’s desk that stood in the corner. “Here is some,” she said. “Compare it for yourself.”\n\u003cbr\u003e \n\u003cbr\u003e Anthony took it and inspected its texture and quality. Then passed it over to me. There was no doubt about it.\n\u003cbr\u003e \n\u003cbr\u003e The fragments that I had picked up were pieces of the Manor notepaper.\n\u003cbr\u003e 201\n\u003cbr\u003e \n\u003cbr\u003e Then I took a hand. “If you don’t recognize the letter, Mary, that these fragments are part of—well, it seems to me that you can’t have written it. Don’t you see what I mean?”\n\u003cbr\u003e \n\u003cbr\u003e She gazed at me blankly. Then her reason appeared to reassert itself. “That’s just how it appears to me, Bill! That’s what I’ve been trying to tell both of you.” She crossed and seated herself again.\n\u003cbr\u003e \n\u003cbr\u003e “Yet it is your handwriting—you are certain,” interposed Anthony.\n\u003cbr\u003e \n\u003cbr\u003e “Yet it is my handwriting——” she echoed his words in acquiescence.\n\u003cbr\u003e \n\u003cbr\u003e “It’s a staggerer,” I exclaimed. “It all seems so completely contradictory.”\n\u003cbr\u003e \n\u003cbr\u003e “The most paradoxical and seemingly contradictory things have sometimes the simplest solutions,” remarked Anthony—“when you can find them.”\n\u003cbr\u003e \n\u003cbr\u003e Mary pressed her hands to her brow. “If I could only think clearly about it,” she cried wearily, “I’m sure the explanation would come to me—but I can’t! I can only repeat what I’ve previously said—I’m certain it’s my handwriting—yet I have no knowledge of the writing beyond that fact.” She turned to Anthony. “You say you found the pieces under the bed? Am I to understand you suspected their existence and were looking for them?”\n\u003cbr\u003e \n\u003cbr\u003e “Bill was the discoverer, Miss Considine—not I,” replied Anthony. “I haven’t really heard the source of his inspiration.”\n\u003cbr\u003e 202\n\u003cbr\u003e \n\u003cbr\u003e “It seemed to me there was just a possibility of picking something up in the bedroom”—I tried to bear my blushing honors with modesty—“so I just had a crawl round. Of course it was a piece of terrific luck. A positive thousand to one shot.” I looked at Anthony. He had relapsed into a chair—thinking hard. His silence seemed to infect the whole room, and Mary and I sat and regarded each other solemnly. Then Anthony astounded us both. I always knew that his mind had the habit of flying off at surprising tangents, and I was a little prepared for the sudden turn it took now.\n\u003cbr\u003e \n\u003cbr\u003e “How many cars have you in the garage, Miss Considine?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e She wrinkled up her forehead in surprise.\n\u003cbr\u003e \n\u003cbr\u003e “Of our own, do you mean, or including everybody’s? I don’t quite follow——”\n\u003cbr\u003e \n\u003cbr\u003e He regarded her steadily.\n\u003cbr\u003e \n\u003cbr\u003e “Of your own—belonging to Considine Manor, if you prefer it put that way.”\n\u003cbr\u003e \n\u003cbr\u003e “Two.”\n\u003cbr\u003e \n\u003cbr\u003e “What are they?”\n\u003cbr\u003e \n\u003cbr\u003e “What make—do you mean?”\n\u003cbr\u003e \n\u003cbr\u003e “Exactly,” he answered.\n\u003cbr\u003e \n\u003cbr\u003e “A ‘Daimler’ and a ‘Morris-Oxford.’”\n\u003cbr\u003e \n\u003cbr\u003e Anthony made a gesture of annoyance. “Had them long?”\n\u003cbr\u003e \n\u003cbr\u003e “The Daimler about four years—the Morris-Oxford only a few months—February, I think we bought it. Why?”\n\u003cbr\u003e \n\u003cbr\u003e He waved her question on one side, swinging a question back to her—“What made you buy it?”\n\u003cbr\u003e 203\n\u003cbr\u003e \n\u003cbr\u003e She thought hard for a moment. Then her face cleared. “The other car we had at that time kept giving trouble. The engine was continually giving us trouble.”\n\u003cbr\u003e \n\u003cbr\u003e Anthony leaned across—nervously eager with excitement—“What was the other car—Miss Considine?”\n\u003cbr\u003e \n\u003cbr\u003e “The old one?—a ‘Bean,’ Mr. Bathurst.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2723/74855.html","bookId":1418,"creation":"Aug 4, 2019 1:04:37 AM","modification":"Aug 4, 2019 1:04:37 AM"}
