{"id":26284,"no":9,"title":"CHAPTER IX MR. BATHURST CALLS UPON THE POSTMISTRESS","content":"“Good Lord!” I exclaimed. “That settles it. A topping shot of yours, Anthony!”\n\u003cbr\u003e \n\u003cbr\u003e “Not so bad,” he admitted. “But not exactly a shot—I remembered the face and the associations. Spare my blushes.”\n\u003cbr\u003e \n\u003cbr\u003e “Ole Baddeley will listen with both ears when you show him this,” I continued. “In a way I’m glad it’s turned out like this ... it was a pretty ghastly thought to imagine that anybody in the house could have been the guilty party. But this settles it.”\n\u003cbr\u003e \n\u003cbr\u003e “Settles what, Bill?”\n\u003cbr\u003e \n\u003cbr\u003e “Why—the affair—Prescott of course! Why do you ask?”\n\u003cbr\u003e \n\u003cbr\u003e Anthony shook his head. “On the contrary, Bill, this settles two little matters but not, distinctly not, the affair of Prescott as you call it. I don’t like to think about that too much. There, Bill, as the immortal Sherlock would say, ‘we are in very deep waters.’”\n\u003cbr\u003e \n\u003cbr\u003e Dr. Mackenzie joined us. Had we had any success ... yes? ... he was gratified....\n\u003cbr\u003e 111\n\u003cbr\u003e \n\u003cbr\u003e “May I take this copy of The Prattler with me, Doctor?” said Anthony. “I shall be happy to recompense you for its loss.”\n\u003cbr\u003e \n\u003cbr\u003e “Certainly not! I couldn’t hear of it,” said the doctor. He would have liked us to have stayed for dinner, but he was very much afraid that his cuisine might not be adequate!\n\u003cbr\u003e \n\u003cbr\u003e “Many thanks, Doctor,”—Anthony with one of his rare smiles—“we understand perfectly. Besides, we are anxious to get back. Good-afternoon.”\n\u003cbr\u003e \n\u003cbr\u003e I harked back directly we were outside the house.\n\u003cbr\u003e \n\u003cbr\u003e “I should be eternally obliged if you would explain things a bit, old man,” I declared, a trifle resentfully. “Surely this clears things up considerably.”\n\u003cbr\u003e \n\u003cbr\u003e “This clears the robbery problem—Lady Considine’s robbery—and it effectively explains that very vexed question that bothered a number of us—why Marshall opened the window. Beyond that——”\n\u003cbr\u003e \n\u003cbr\u003e “Tell me,” I begged.\n\u003cbr\u003e \n\u003cbr\u003e “Well, it’s pretty evident that Marshall took the case containing the pearl necklace from Lady Considine’s bedroom, and it’s also fairly conclusive that she conveyed that same case to her husband—‘Spider’ Webb—via the window of the billiard room. The second set of footprints we shall very soon discover to be that august gentleman’s. And I think they were the footsteps that Dick and Helen Arkwright heard. But I don’t think ...” he paused and reflected.\n\u003cbr\u003e \n\u003cbr\u003e “You don’t think what?”\n\u003cbr\u003e 112\n\u003cbr\u003e \n\u003cbr\u003e “I don’t think it was the billiard room door that Jack Considine fancies he heard shutting.” He slashed with his stick at the grass as we walked.\n\u003cbr\u003e \n\u003cbr\u003e “Was it Prescott’s door?” I broke in eagerly. “Did Prescott hear anything and come down to meet his death?”\n\u003cbr\u003e \n\u003cbr\u003e My theory excited me.\n\u003cbr\u003e \n\u003cbr\u003e “No, Bill, I don’t think so. All my intuition and instinct, if you care to call it that, lead me away from that idea.”\n\u003cbr\u003e \n\u003cbr\u003e “What about Marshall—or Mrs. Spider as she is—and the window? You haven’t explained that yet,” I insisted, “properly!”\n\u003cbr\u003e \n\u003cbr\u003e “Prescott’s body on the billiard-table was an overwhelming surprise to Marshall when she opened the door this morning. She had dropped the ‘sparklers,’ as Comrade Spider probably calls them, out of the window and closed it again. Then gone quietly back to bed in the servants’ part of the house. Now for her surprise! When she enters the room a few hours later she comes face to face with a greater and more sinister crime. She at once, in her mind, connects the two things! Had ‘Spider’ come back for anything, encountered Prescott and killed him? Had they fought? Was ‘Spider’ hurt? She had last seen him just outside the window. Was he there still, wounded perhaps? She rushes to the window and flings it open. Voilà, Bill!”\n\u003cbr\u003e \n\u003cbr\u003e I nodded in approval. Yet——\n\u003cbr\u003e \n\u003cbr\u003e “Where does Prescott come in then?” I queried. “Did he meet Webb outside?”\n\u003cbr\u003e 113\n\u003cbr\u003e \n\u003cbr\u003e Anthony stopped and looked at me.\n\u003cbr\u003e \n\u003cbr\u003e “That’s an idea. I never considered that. Outside! That’s certainly a possibility.”\n\u003cbr\u003e \n\u003cbr\u003e “One more point,” I said, secretly pleased to have set him thinking, “and that may be two ... apparently nothing else has been stolen besides Lady Considine’s necklace ... that is to say nothing in the jewel line.... How comes the Venetian dagger to be in the billiard room?” Anthony looked grave.\n\u003cbr\u003e \n\u003cbr\u003e “That’s a poser,” he commented. “But it must not be forgotten that we are dealing with two adventures ... ‘The Adventure of Lady Considine’s Necklace’ and ‘The Adventure of the Death in the Billiard Room’ ... there may be no connection whatever between the two ... and yet, as you have suggested, Bill, there may.”\n\u003cbr\u003e \n\u003cbr\u003e “The Venetian dagger was always kept in the drawing-room,” I maintained. “Therefore, the person that took it, went to the drawing-room to get it.”\n\u003cbr\u003e \n\u003cbr\u003e “True ... but when? That’s the point. Also, Bill, why was the dagger used when Prescott was already dead—strangled?”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps the murderer didn’t know he was dead. Now I’m coming to that second point at which I hinted just now ... something I fail to understand at all. How do you account for the absence of blood stains? As far as I could see, Prescott lay on the billiard-table on his shoulder, there was no blood on the table, though, and his clothing seemed to show very little trace.... I should have imagined, though I don’t pretend to know, that a blow struck with the force that that had been would have caused a rush of blood from the wound.”\n\u003cbr\u003e 114\n\u003cbr\u003e \n\u003cbr\u003e Anthony nodded. “Good for you—the same feature struck me—but Dr. Elliot had an explanation. He says that a blow struck at the top of the spinal cord as this blow was, produced, in a living body, almost an instantaneous paralysis, and that he would expect, as a medical man, a very small quantity of blood to be shed. This was a dead body when the blow was struck, remember! But why the dagger was ever used ... well, I’m in considerable doubt.”\n\u003cbr\u003e \n\u003cbr\u003e “And I,” I rejoined. “And I can’t see much hope of our doubts being dispelled.”\n\u003cbr\u003e \n\u003cbr\u003e Anthony looked at his wrist watch.\n\u003cbr\u003e \n\u003cbr\u003e “We’ve got time to go home through the village,” he said. “I want to make a call.”\n\u003cbr\u003e \n\u003cbr\u003e “Are you going to tell Baddeley of this Marshall business at once?” I asked. “He can’t very well arrest her because she’s the wife of a man who was sentenced for jewel robbery five years ago.”\n\u003cbr\u003e \n\u003cbr\u003e “It would be taking a chance, wouldn’t it?” he grinned.\n\u003cbr\u003e \n\u003cbr\u003e “It wouldn’t surprise me if she hasn’t cleared by now,” I said, reflectively. “You shook her up a bit this morning.”\n\u003cbr\u003e \n\u003cbr\u003e “All the better if she has ... but she hasn’t, you’ll find.”\n\u003cbr\u003e \n\u003cbr\u003e “Why?”\n\u003cbr\u003e 115\n\u003cbr\u003e \n\u003cbr\u003e “If she’s cleared, Baddeley’s men will have shadowed her ... and she’ll lead them straight to the ‘Spider’” ... he thought for a moment. “Still, I’ve an idea that she’ll let me know where he is when we’ve talked to her for a little while.”\n\u003cbr\u003e \n\u003cbr\u003e By this time we had reached the village and coming down the hill from the track that leads from the Downs, we entered the main street.\n\u003cbr\u003e \n\u003cbr\u003e “I am of the opinion, Bill,” said Anthony, “that a few discreet inquiries here may prove of interest and advantage. I suggest that we call and see Mrs. Hogarth at the Post Office. Does she know you, Bill?”\n\u003cbr\u003e \n\u003cbr\u003e “She remembers me as a guest at the Manor for some years, at any rate,” I responded.\n\u003cbr\u003e \n\u003cbr\u003e “That’s the stuff to give ’em,”—Anthony waxed merry—“I want her to talk and tell us things—if she knows you it will help tremendously.”\n\u003cbr\u003e \n\u003cbr\u003e The Post Office was a “general” shop that sold everything from pins to Postal Orders.\n\u003cbr\u003e \n\u003cbr\u003e “See that?” murmured Anthony, as we entered, heralded by the loud clanging of the shop bell on the door. He pointed to the telephone call-box. “I hoped that the ’phone would be in here.”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Hogarth bustled out.\n\u003cbr\u003e \n\u003cbr\u003e He nudged me in the ribs. “Introduce yourself—tell her who you are.”\n\u003cbr\u003e \n\u003cbr\u003e “Good-afternoon, Mrs. Hogarth,” I cried with an air. “How’s the rheumatism?”\n\u003cbr\u003e 116\n\u003cbr\u003e \n\u003cbr\u003e “Why, it’s Mr. Cunningham from the Manor. Good-afternoon, sir. The rheumatics? ... oh, not so bad, sir, considering my age and all that ... this is a terrible thing I hear, sir, what’s happened up at the Manor!”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, Mrs. Hogarth,” I replied. “It is! This is Mr. Bathurst, a very intimate friend of Sir Charles and her Ladyship——”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Hogarth curtsied to the best of her ability—“Pleased to meet you, sir——”\n\u003cbr\u003e \n\u003cbr\u003e “And they would be glad,” I continued, “if you would give him any information for which he may ask you.”\n\u003cbr\u003e \n\u003cbr\u003e “Only too pleased, Mr. Cunningham.”\n\u003cbr\u003e \n\u003cbr\u003e “Thank you,” said Anthony, “I shan’t worry you unduly. This ’phone call-box” ... he motioned towards it ... “is this the nearest one to Considine Manor?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh yes, sir. By far. The next one is almost to Allingham ... a matter of close on six miles.”\n\u003cbr\u003e \n\u003cbr\u003e “Now quite in confidence, Mrs. Hogarth, in the very strictest confidence, Sir Charles Considine has asked me to conduct a little inquiry on his behalf. And he suggests that first of all I should come and see you.”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Hogarth’s excitement increased. “You may rely on me, sir....”\n\u003cbr\u003e \n\u003cbr\u003e “I’m sure I can,” exclaimed Anthony. “Now my real question is this ... do you know one of the maids at present employed at Considine Manor, of the name of Marshall?”\n\u003cbr\u003e 117\n\u003cbr\u003e \n\u003cbr\u003e “Why, yes, sir, and it’s a funny thing her name should have left your lips so soon after you asking me about that there telephone it is.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh? Why is that, Mrs. Hogarth?” smiled Anthony. “Has she been using it lately?”\n\u003cbr\u003e \n\u003cbr\u003e “As sure as I stand here, sir, she was the very last person to do so.”\n\u003cbr\u003e \n\u003cbr\u003e “This is very interesting, Mrs. Hogarth ... very interesting, and I must congratulate you on your excellent memory. You are quite certain of your statement?”\n\u003cbr\u003e \n\u003cbr\u003e “Positive, sir! You see, it’s like this. We’re a small village here, as you might say, comparatively speaking that is, and most of the telephone custom we get is from the betting people—there are the Lewes and Brighton bookies you see—so I get to know the regular customers and just about when to expect them—which is from about half-past twelve till about four o’clock—and not so very many after dinner at that—see? Well, yesterday morning, about a quarter past eleven, the bell rings and I bustles out ... only to find it’s a ’phone call. I could see a female in the box which was a bit unusual at that time o’ day, as I’ve said ... so I waited for her to come out ... as you might say ... when she did, who should I set my eyes on but Marshall, the maid from the Manor?”\n\u003cbr\u003e \n\u003cbr\u003e “Of course you couldn’t hear anything of the message?” inquired Anthony.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Hogarth shook her head. “No, sir, I couldn’t ... and I ain’t the sort to listen hard!”\n\u003cbr\u003e 118\n\u003cbr\u003e \n\u003cbr\u003e Anthony accepted her denial with a disarming smile.\n\u003cbr\u003e \n\u003cbr\u003e “Of course not, Mrs. Hogarth, Mr. Cunningham and I are fully alive to that. Did she appear agitated at all?”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Hogarth pursed her lips and pondered for a moment.\n\u003cbr\u003e \n\u003cbr\u003e “No, sir, I wouldn’t say that. Yet she had a look on her that’s hard to describe.” She pondered still more.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” said Anthony, encouragingly, “perhaps I can help you ... eh? She looked pleased with herself, didn’t she?”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Hogarth knocked the counter with the palm of her hand.\n\u003cbr\u003e \n\u003cbr\u003e “That’s it, sir, that’s it ... her face was hot, as you might say, flushed you might call it, with pleasure. That was a extryordinary good guess, sir.” Mrs. Hogarth was in the seventh heaven of delight—she had assisted this friend of Sir Charles Considine, she felt sure. She would now fire her last shot, her crowning triumph.\n\u003cbr\u003e \n\u003cbr\u003e “There’s one other little thing, sir, now I come to think of it,” she murmured with more than a suggestion of an apology in her tone, “I wasn’t listening to the conversation in any way, sir, I know my place here better than to do that, but I’ve just an idea that I did just manage to hear the last sentence the hussy spoke.” She breathed heavily as she looked at us.\n\u003cbr\u003e 119\n\u003cbr\u003e \n\u003cbr\u003e “Better and better, Mrs. Hogarth,” said Anthony. “You’re a veritable ‘Treasure-Trove’ of information. Let’s hear it.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, sir, as she was a-finishing the conversation she was having, I’m almost sure I overheard her say ‘Good-bye, Emma!’”\n\u003cbr\u003e \n\u003cbr\u003e “Thank you, Mrs. Hogarth. Nothing more?”\n\u003cbr\u003e \n\u003cbr\u003e “No sir, I couldn’t remember anything else.”\n\u003cbr\u003e \n\u003cbr\u003e “I needn’t trouble you any more, then. You have helped me considerably. Come along, Bill.” We bowed ourselves out, personally conducted by the postmistress—a beaming postmistress now—and started homeward.\n\u003cbr\u003e \n\u003cbr\u003e “Well, Bill, things are plainer now with a vengeance,” said Anthony decisively.... “I think if I put these facts before Baddeley he will take action ... if necessary the call should be easy to trace ... then Webb can be taken comfortably.”\n\u003cbr\u003e \n\u003cbr\u003e “The Spider?” I queried.\n\u003cbr\u003e \n\u003cbr\u003e He assented. “They call him ‘Spider’ as much for his physical as for the name association,” he continued. “I remember seeing his photo when he was tried and sentenced—he has long thin arms and long thin legs—with smallish feet.”\n\u003cbr\u003e \n\u003cbr\u003e “What was the ’phone message?” I asked.\n\u003cbr\u003e \n\u003cbr\u003e “That she had the pearls, laddie! She has been planted there to get them ... the ‘Spider’ flies high ... or shall we say he spins high ... forged references doubtless ... she waited three years for her chance. Yesterday it came. Her ’phone message to the ‘Spider’ was ‘Success’ with a capital ‘S,’ William! Best part of the three years he’s been in prison.”\n\u003cbr\u003e 120\n\u003cbr\u003e \n\u003cbr\u003e “You don’t know she did ’phone her husband,” I ventured, with criticism in my voice. “Why call him Emma? It may have been the most harmless of conversations.”\n\u003cbr\u003e \n\u003cbr\u003e “No, Bill—all your wonted eloquence will not convince me of that. She ’phoned the ‘Spider,’ informing him of her luck. ‘I’ve got the necklace,’ she said, ‘when are you coming for it?’ Shall I go on with the conversation, Bill?”\n\u003cbr\u003e \n\u003cbr\u003e “Please do,” I said mockingly and a little incredulously.\n\u003cbr\u003e \n\u003cbr\u003e “Well ‘Spider’ probably said, ‘Where shall I come?’ The reply was ‘outside the billiard room’ ... directions how to find it followed ... then arose the question of time. Listening, Bill?”\n\u003cbr\u003e \n\u003cbr\u003e I grinned. “Carry on ... I don’t say I believe it all though.”\n\u003cbr\u003e \n\u003cbr\u003e “I repeat it, Bill ... then came the question of timing the assignation. It had to be after dark ... she couldn’t get away during dinner, for instance, her absence would have been detected instantly, and she couldn’t risk the garden after dinner, there was always the chance of guests going there ... Jack Considine and I were there, for example, so she had to wait till all was quiet. Now when would that be, William?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh,” I replied, “somewhere about one o’clock in the morning, I suppose, at the earliest.”\n\u003cbr\u003e 121\n\u003cbr\u003e \n\u003cbr\u003e “Exactly,” responded Anthony nonchalantly. “Sometime, we will say about one, or possibly two—‘ack Emma!’[1] S’that—Umpire? Is it a hit?”\n\u003cbr\u003e \n\u003cbr\u003e I gasped! And I had completely missed that meaning—plain as a pike staff now I had secured the explanation.\n\u003cbr\u003e \n\u003cbr\u003e “Not so bad, Bill, eh?” muttered Anthony quizzically. “Don’t overwhelm me with your admiration.”\n\u003cbr\u003e \n\u003cbr\u003e “You’re a perishin’ marvel,” I said—“I never thought of that—I shouldn’t have expected Marshall to use the term, for one thing.”\n\u003cbr\u003e \n\u003cbr\u003e “‘Spider’ probably saw Service,” he replied—“she has picked it up from him. That’s the solution of that. Here we are—now for friend Baddeley.”\n\u003cbr\u003e \n\u003cbr\u003e “You don’t think then,” I said, “that we are nearing the finish of the Prescott affair?”\n\u003cbr\u003e \n\u003cbr\u003e “As I told you before, Bill, no! I shall see Baddeley now, put these discoveries in front of him, let him act on them ... he’ll be delighted to ... it will save his face, temporarily at least ... then I shall turn my attention to the more complex problem ... which I think will prove to be very dark and very sinister. Certainly, the latter.”\n\u003cbr\u003e 122\n\u003cbr\u003e \n\u003cbr\u003e I searched his face with my eyes, but gathered nothing from the inspection. It was heavy and troubled, but the clouds soon passed. Anthony Bathurst was like that, mood succeeded mood very rapidly. In the Hall we encountered Roper. He had a message for us from Baddeley.\n\u003cbr\u003e \n\u003cbr\u003e “The Inspector has had the body removed to the mortuary, gentlemen,” he said, “and would like you to....”\n\u003cbr\u003e \n\u003cbr\u003e Anthony cut into his speech—“Where is the Inspector?... I should like a word with him immediately ... if possible. Will you find him and tell him?” Roper departed on his errand.\n\u003cbr\u003e \n\u003cbr\u003e “Take a pew, Bill,” said Anthony, “and watch for his face to light up.”\n\u003cbr\u003e \n\u003cbr\u003e Baddeley was quickly with us.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, Mr. Bathurst, Roper here tells me you want me.” He looked at us with an air of inquiry.\n\u003cbr\u003e \n\u003cbr\u003e “I have some information for you, Inspector,” commenced Anthony as coolly as possible, “that may help you considerably towards the recovery of Lady Considine’s necklace, and the arrest of the thief.”\n\u003cbr\u003e \n\u003cbr\u003e Baddeley favored him with a steady and sustained stare.\n\u003cbr\u003e \n\u003cbr\u003e “The deuce you have,” he exclaimed.\n\u003cbr\u003e \n\u003cbr\u003e “I had an advantage over you, you see,” proceeded Anthony—“in the fact that Marshall’s face seemed familiar to me and awakened a memory in me that I have been able to follow up.” He paused and then continued with deliberation ... “to follow up successfully.” He opened The Prattler.\n\u003cbr\u003e \n\u003cbr\u003e “Look at that, will you, Inspector? And gain enlightenment.”\n\u003cbr\u003e 123\n\u003cbr\u003e \n\u003cbr\u003e Baddeley bent down in amazement. “By Moses!” he yelled ... “that’s she ... a guinea to a gooseberry on it. Smart work, Mr. Bathurst. I’m grateful, sir, for the hint.” He wrung Anthony’s hand. Anthony laughed.\n\u003cbr\u003e \n\u003cbr\u003e “We can get this Webb, I think, Baddeley; ... listen.” He recounted the evidence of Mrs. Hogarth.\n\u003cbr\u003e \n\u003cbr\u003e Baddeley was respectfully attentive. “You haven’t let the grass grow under your feet, that’s a sure thing,” he declared.\n\u003cbr\u003e \n\u003cbr\u003e Anthony smiled again. “And I don’t suppose you have either, Inspector, if the truth’s known.”\n\u003cbr\u003e \n\u003cbr\u003e Baddeley grimaced.\n\u003cbr\u003e \n\u003cbr\u003e “What do you mean, sir, exactly by that remark?” he queried.\n\u003cbr\u003e \n\u003cbr\u003e “I can’t forget,” pronounced Anthony, “that there are two most important things still missing: the Barker I.O.U. and the shoe-lace that killed Prescott.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2723/74849.html","bookId":1418,"creation":"Aug 4, 2019 1:04:37 AM","modification":"Aug 4, 2019 1:04:37 AM"}
