{"id":83479,"no":11,"title":"Page 11","content":"\u003cp\u003e“So it would seem,” Falk said.\u003c/p\u003e\n\u003cp\u003e“So it would seem,” Elise echoed.\u003c/p\u003e\n\u003cp\u003eElise watched a number of Arcainian subjects throw handfuls of uncooked rice and seeds at King Henrik and Lady—now Queen—Clotilde’s open top carriage. They waved banners and flags of Arcainian colors—black and gold—that were embroidered with the country’s symbol, a white swan.\u003c/p\u003e\n\u003cp\u003eHaving witnessed the marriage, Elise and her siblings were following on horseback and in carriages as part of the marriage procession that wove through the city before returning to Castle Brandis for the wedding feast.\u003c/p\u003e\n\u003cp\u003e“You don’t know what to make of the new queen, do you?”\u003c/p\u003e\n\u003cp\u003eElise glanced Erick, the last of her foster brothers to arrive to the wedding. He was seated in the carriage with her and Gerhart. Steffen and Gabrielle were in their own open-top carriage just behind King Henrik and Queen Clotilde’s, and the rest of the Arcainian princes were riding.\u003c/p\u003e\n\u003cp\u003eElise hesitated, trying to find polite words to describe the feeling Clotilde gave her.\u003c/p\u003e\n\u003cp\u003e“You find her unsettling,” Erick said.\u003c/p\u003e\n\u003cp\u003eElise winced. She glanced at the crowds, but no one noticed the serious discussion held between Elise and Erick. (Who would, after all, with all the handsome princes of Arcainia being aired out at the same time?) “Yes,” she admitted.\u003c/p\u003e\n\u003cp\u003eErick smiled. “So do I.”\u003c/p\u003e\n\u003cp\u003e“There’s something about her. It’s not the way she looks, or that she has said anything unpleasant. She looks at everything as if looking forward to the day that it is hers,” Elise said.\u003c/p\u003e\n\u003cp\u003e“Indeed, why else would she marry a man nearly twice her age?” Erick said.\u003c/p\u003e\n\u003cp\u003e“Erick!” Elise said.\u003c/p\u003e\n\u003cp\u003eIt was a good thing Gerhart was in the carriage with them. He smiled and waved so beautifully at the crowds no one was likely to notice Elise’s shock.\u003c/p\u003e\n\u003cp\u003eErick smiled again. “Tis true,” he said before his eyes lost the sparkle of his smile. “She feels likes magic.”\u003c/p\u003e\n\u003cp\u003e“In Arcainia? That cannot be,” Elise said.\u003c/p\u003e\n\u003cp\u003e“I have met quite a few enchanters and enchantresses at the Arcainian Royal College. I know what magic feels like, and Clotilde has it,” Erick said.\u003c/p\u003e\n\u003cp\u003e“But magic is outlawed here. It has been since Father married Mother,” Elise said.\u003c/p\u003e\n\u003cp\u003e“No, performing magic is against the law. Any magic user can enter Arcainia’s borders,” Erick countered.\u003c/p\u003e\n\u003cp\u003eElise looked to the carriage King Henrik and Queen Clotilde rode in. The new queen was smiling. It was a thin, brittle gesture, and although she looked beautiful, she did not look particularly happy.\u003c/p\u003e\n\u003cp\u003e“What do we do?” Elise asked.\u003c/p\u003e\n\u003cp\u003e“What we’ve been doing. I’m reaching out to some of my contacts. If we can get a high-level magic user here, they could at least tell us if Clotilde is something to worry about or not,” Erick says.\u003c/p\u003e\n\u003cp\u003e“You are going back to the college?”\u003c/p\u003e\n\u003cp\u003e“For now. I am the chancellor; I cannot abandon it. However, I will return home more often. Rune will remain here at least through the spring and summer. By then, a magic user should arrive,” Erick said.\u003c/p\u003e\n\u003cp\u003eElise nodded.\u003c/p\u003e\n\u003cp\u003e“You will have to keep being the Perfect Princess,” Erick said.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Father isn’t happy with our reaction to his marriage. From what Steffen tells me, only you and Gabrielle reacted with any decorum. You are still in his good graces. You must stay there,” Erick said.\u003c/p\u003e\n\u003cp\u003eElise offered Erick a weary smile. “Isn’t that my job already?”\u003c/p\u003e\n\u003cp\u003eErick chuckled as the carriage rolled to a stop in front of Brandis. “And that is why the country treasures you.”\u003c/p\u003e\n\u003cp\u003eElise squared her shoulders before she stepped down from the carriage with Erick’s assistance.\u003c/p\u003e\n\u003cp\u003eServants and attendants swarmed the carriages as everyone stepped into their places for Clotilde’s first entrance into Brandis as its queen.\u003c/p\u003e\n\u003cp\u003eMertein was there. Elise managed to grasp his hand and linger by him for a moment.\u003c/p\u003e\n\u003cp\u003e“You look stunning,” Mertein said, squeezing her hand.\u003c/p\u003e\n\u003cp\u003e“Thank you. I will be glad when the feast begins, though,” Elise said. “My cheeks hurt from all the smiling.”\u003c/p\u003e\n\u003cp\u003e“But it is such a happy occasion,” Mertein said.\u003c/p\u003e\n\u003cp\u003e“Yes,” Elise said, slow to agree.\u003c/p\u003e\n\u003cp\u003e“Fürstin, Fürstin! Here, your flute,” an attendant called, presenting Elise with the gold-leafed instrument.\u003c/p\u003e\n\u003cp\u003eElise took the instrument with a smile. “Thank you,” she said, before turning to Mertein. “If you’ll excuse me, I had best get into position.”\u003c/p\u003e\n\u003cp\u003e“Of course. Will you save me a dance?” Mertein asked.\u003c/p\u003e\n\u003cp\u003e“With pleasure,” Elise said, extracting her hand and curtseying. She clenched the flute in her hands as she hurried up the stairs. She waited on the top stair with the rest of the royal family, stretching her fingers into the right position.\u003c/p\u003e\n\u003cp\u003eShe was the only member of the royal family who played an instrument to a degree of expertise. As such, she was usually required to play on important days, like today. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-11.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
