{"id":83483,"no":15,"title":"Page 15","content":"\u003cp\u003eClotilde twisted her neck to stare at King Henrik. “What?”\u003c/p\u003e\n\u003cp\u003e“No, Elise will not yet marry. Nor will I see her cut from this family,” King Henrik said. His voice held a hint of the rough iron and rock that he used to possess…before he met Clotilde.\u003c/p\u003e\n\u003cp\u003e“Henrik, dear, you must trust me. As a man you do not understand, but as a woman and her foster mother I—,”\u003c/p\u003e\n\u003cp\u003e“Elise’s foster mother is Queen Ingrid. You have unfortunately inherited my rowdy sons, but Elise is Ingrid’s legacy. She is Fürstin, the head of her own household. She may marry if she wishes, but no one in this family will ever force her to,” King Henrik said.\u003c/p\u003e\n\u003cp\u003eEveryone at the table was silent.\u003c/p\u003e\n\u003cp\u003eElise’s foster brothers stared at their father with something like hope, and Elise bit the inside of her cheek to keep from crying as she raised her eyes to meet King Henrik’s eyes.\u003c/p\u003e\n\u003cp\u003eThey were clear and heavy with…expectation.\u003c/p\u003e\n\u003cp\u003eElise looked to Clotilde, who was gawking at King Henrik as if she had never seen him before. When she turned to look at the rest of the royal children, her eyes zeroed in on Elise. Her lip curled back in a sneer, and she clenched her crystal wine glass so tightly, she made it crack.\u003c/p\u003e\n\u003cp\u003e“Dove, your glass has cracked—careful now. I wouldn’t want to see your beautiful skin marred. Serving maid, would you procure a new glass for the queen? Thank you,” King Henrik said, his moment of steel and steadiness gone. His voice and mannerisms were back to their doddering ways.\u003c/p\u003e\n\u003cp\u003eClotilde did not respond to Henrik, and she kept her eyes on Elise.\u003c/p\u003e\n\u003cp\u003eThe matter wasn’t over yet. Clotilde would not take a loss.\u003c/p\u003e\n\u003cp\u003eA few weeks before summer, the royal princes and princesses of Arcainia assembled outside the throne room.\u003c/p\u003e\n\u003cp\u003e“Does anyone know what they wish to speak to us about?” Erick asked, adjusting his rectangular glasses.\u003c/p\u003e\n\u003cp\u003e“Not a clue,” Nick said.\u003c/p\u003e\n\u003cp\u003e“My agents haven’t uncovered anything unusual,” Mikk said.\u003c/p\u003e\n\u003cp\u003e“It’s not going to be pretty, that’s for certain. We’re being summoned for a formal audience with all the bells and whistles,” Rune said, adjusting his circlet. In spite of the “tiaras,” everyone still wore their everyday uniforms in the Arcainian colors of black and gold.\u003c/p\u003e\n\u003cp\u003e“Erick, any word on a magic user coming to scent that creature out?” Steffen said, nodding his head in the direction of the throne room.\u003c/p\u003e\n\u003cp\u003e“Funny you should say that. Directly before I was summoned here, I received a note from an enchantress of some renown. She said she would be traveling through Arcainia and would be happy to help so long as we did not require the use of magic,” Erick said. “I left her a message directing her to Brandis. With luck, she should arrive within the week.”\u003c/p\u003e\n\u003cp\u003e“A week may be too late,” Gerhart groaned, flinging an arm over his eyes. “If I have to listen to her complain another day about our lack of decorum and formality I’m going to die.”\u003c/p\u003e\n\u003cp\u003e“That’s not something to joke about, Gerhart,” Falk said, his voice soft like velvet but seeped with warning.\u003c/p\u003e\n\u003cp\u003e“All we need to do is concentrate on getting through today,” Gabrielle said, holding her black and white, male cat in her arms. (Elise didn’t know why she brought the cat, but in the past month it was increasingly rare to see Gabrielle without it.) “How are you holding up?” Rune asked, slinging an arm across Elise’s shoulders.\u003c/p\u003e\n\u003cp\u003e“I’m managing,” Elise smiled. Ever since King Henrik beheaded Clotilde’s plan to marry her off, the young queen took great pains to snub, mock, and rebuke Elise. “I don’t see how this will end well, even with the help of an enchantress,” Elise said.\u003c/p\u003e\n\u003cp\u003e“If we can prove she is using magic, the Veneno Conclave will be forced to step in, Darling,” Falk said, intruding on the conversation without hesitation.\u003c/p\u003e\n\u003cp\u003e“Next time I leave to fight a monster, you should come with me. You could use the break,” Rune said.\u003c/p\u003e\n\u003cp\u003e“I can’t. I cannot afford to leave the treasury alone for long. Nick increased security around the vault, but Clotilde still tries to bully her way in,” Elise said.\u003c/p\u003e\n\u003cp\u003e“It’s a wonder she hasn’t convinced Father to force you to give her permission to enter it,” Rune said.\u003c/p\u003e\n\u003cp\u003e“Maybe it isn’t,” Falk said. “As manipulative as she may be, Clotilde does not strike me as being especially bright.”\u003c/p\u003e\n\u003cp\u003e“She’s smart enough to try and squeeze us out of the government system,” Rune said.\u003c/p\u003e\n\u003cp\u003e“But she goes about it in the most brutish ways. Subtlety is not her gift,” Falk said.\u003c/p\u003e\n\u003cp\u003e“Sometimes one doesn’t need to be subtle if they can get their way through force,” Elise grimly said.\u003c/p\u003e\n\u003cp\u003e“Is everyone ready to enter?” Steffen asked. He held Gabrielle’s elbow as she needed both hands to support her unusually large cat. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-15.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
