{"id":83485,"no":17,"title":"Page 17","content":"\u003cp\u003eElise and Gerhart were last. Elise saw the black magic surround Gerhart before her vision was blocked off.\u003c/p\u003e\n\u003cp\u003eThe curse slide across her skin like a snake coiling around her. It pried her mouth open, dripped down her ears and oozed down her throat like tar. Elise choked as she felt the curse tighten around her and fight its way to her bones.\u003c/p\u003e\n\u003cp\u003eClotilde was going to win.\u003c/p\u003e\n\u003cp\u003eAll would be lost. Not just her family, but Arcainia as well.\u003c/p\u003e\n\u003cp\u003eClotilde, the witch, would ruin it. The servants, her Treasury Department staff, the kind stable hands and the brave soldiers. All would be ruled by a tyrant who was bent on their destruction.\u003c/p\u003e\n\u003cp\u003e“NO!” Elise shouted. Her rebuke was drowned out by the tarry magic, but after she choked it out, the curse froze.\u003c/p\u003e\n\u003cp\u003e“NO!” Elise repeated. The curse retreated from her mouth and inner body with enough suddenness to make Elise wretch, but she held it in. “No! I will not accept this!” Elise shouted.\u003c/p\u003e\n\u003cp\u003eThe black magic fled from her. It zoomed back to Clotilde and hit her square in the chest. The woman shrieked and fell backwards, cracking her head on her wooden throne.\u003c/p\u003e\n\u003cp\u003eElise stared wide eyed at the flock of white swans who beat their wings and trumpeted before she raised her gaze to the fallen queen, who was tussling with the curse that had fled from Elise.\u003c/p\u003e\n\u003cp\u003e“Elise, RUN! Now, while she’s distracted,” Gabrielle shouted, wrenching Elise along by the arm. They reached the door and threw themselves against it. Gabrielle narrowly avoided squashing her cat against its surface, but the door flew open.\u003c/p\u003e\n\u003cp\u003e“Puss, help us get the princes out,” Gabrielle said, dropping her cat.\u003c/p\u003e\n\u003cp\u003e“Hurry! I don’t think that curse will fight her much longer,” the cat said—the cat said—as he ran behind several swans/princes, hissing and swiping at them with his claws.\u003c/p\u003e\n\u003cp\u003e“What the—,” Arthur started as Elise shooed the last of the swans out of the throne room.\u003c/p\u003e\n\u003cp\u003e“Don’t ask. Close the door and keep it shut as long as you can manage, even if Clotilde orders you to open it,” Gabrielle instructed.\u003c/p\u003e\n\u003cp\u003e“Where do we take them?” Elise asked as they herded the swans down the hallway.\u003c/p\u003e\n\u003cp\u003e“You’ll have to leave the country. Clotilde won’t rest until you’re all killed,” Gabrielle said when they reached a staircase. “GET A HORSE. NOW!” she shouted to servants at the bottom of the stairs.\u003c/p\u003e\n\u003cp\u003e“Aren’t you coming with? You won’t be safe either,” Elise said as the swans bumbled their way down the staircase.\u003c/p\u003e\n\u003cp\u003eGabrielle stopped at the base of the stairs, and for a moment Elise could see how frightened Gabrielle was.\u003c/p\u003e\n\u003cp\u003e“I can’t. I promised him,” Gabrielle said, placing a hand over her heart and clenching the fabric of her dress. “I’ll be fine. I’ll have Puss with me.”\u003c/p\u003e\n\u003cp\u003e“You’re right. You’ll have me with you. I’m going to tan your hide if you ever move out of clawing range again,” Gabrielle’s cat said. (The cat said. Elise suspected she would have to take a serious amount of time to processes this once she and her brothers reached safety.) “What’s going on?” a servant asked.\u003c/p\u003e\n\u003cp\u003e“I will explain later. For now we must get these swans out of the castle, before the Queen finds us,” Gabrielle said.\u003c/p\u003e\n\u003cp\u003e“Right,” several servants said, moving in to help herd the swans to a servant’s exit.\u003c/p\u003e\n\u003cp\u003e“Elise,” Gabrielle said. “Follow your brothers, and do not let them rest until you have left the country. Go south, if you can, but concern yourself foremost with tracking your brothers.”\u003c/p\u003e\n\u003cp\u003e“I cannot do this alone. I can hardly keep seven swans safe—,” Elise started.\u003c/p\u003e\n\u003cp\u003e“Elise,” Gabrielle said, grabbing Elise by the shoulders. “I don’t know how you avoided the curse, but it is abundantly clear that you are the only chance your brothers have. You cannot second guess yourself. You must guard them.”\u003c/p\u003e\n\u003cp\u003eElise glanced at her swan brothers. She couldn’t tell them apart. All of them were graceful white birds that were shockingly quiet. Elise didn’t know if Gabrielle was right, but she couldn’t leave her brothers now. Arcainia wouldn’t survive without them, and Elise owed it to the royal family. “Alright,” she said.\u003c/p\u003e\n\u003cp\u003eGabrielle spared Elise a weak smile before they hustled out of the servant’s entrance/exit to Brandis. “Steffen,” Gabrielle called, wading through the birds.\u003c/p\u003e\n\u003cp\u003eElise didn’t know how she did it, but Gabrielle sought out a very specific bird and held its head.\u003c/p\u003e\n\u003cp\u003e“Steffen, I don’t know if you understand me, but please remember this. I love you. I love you so much. I’m going to stay here. If I loved you any less, I would come, but I cannot. I will keep our people safe, and I will do my best to make Clotilde’s life miserable. Please be safe. Do not forget me,” Gabrielle begged. Tears fell from her eyes before she awkwardly embraced the large swan.\u003c/p\u003e\n\u003cp\u003eThe swan was still—it was the only swan that was motionless, the others kept flapping their wings and pecking each other. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-17.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
