{"id":83492,"no":24,"title":"Page 24","content":"\u003cp\u003e“How?” Elise asked, slipping out of Rune’s grasp to get closer to the enchantress.\u003c/p\u003e\n\u003cp\u003eAngelique held her finger tips of her right hand together and drew them through the air. The air condensed into a silvery mist before forming a long-stalked, leafy plant. “This is the stinging nettle,” Angelique said, rotating the illusion in the air so Elise and the princes could see the sharp looking hairs that poked out of the stalk. “By sewing a great many of these plants into a covering of some sort, the curse can be broken.”\u003c/p\u003e\n\u003cp\u003e“…You must be joking,” Falk said after several heartbeats of silence.\u003c/p\u003e\n\u003cp\u003e“A cover—a shirt would be best—must be made individually. If you mean to free all your brothers, you must make seven shirts,” Angelique continued.\u003c/p\u003e\n\u003cp\u003e“We’re not her brothers,” Rune said automatically.\u003c/p\u003e\n\u003cp\u003e“Additionally, once you undertake this ambition, you cannot speak a word. If you make the shirts, all of those you have made up until the moment you spoke will be useless and will do nothing to break the curse,” Angelique said.\u003c/p\u003e\n\u003cp\u003e“Does it have to be Elise?” Gerhart asked. “Why can’t any number of girls do it?”\u003c/p\u003e\n\u003cp\u003e“It must be one female who takes the burden upon herself, and it takes great strength of character to make the sacrifices that are called for breaking the curse. Do you know any women besides Elise who have the personal fortitude to stay silent for months, perhaps even a year?” Angelique asked.\u003c/p\u003e\n\u003cp\u003e“What about Gabi?” Nick asked.\u003c/p\u003e\n\u003cp\u003eSteffen laughed outright. “Don’t be ridiculous. Gabrielle couldn’t keep her mouth shut for a minute, much less a month.”\u003c/p\u003e\n\u003cp\u003e“Gabrielle is needed at Brandis,” Angelique said.\u003c/p\u003e\n\u003cp\u003eSteffen grew stiff. “What?”\u003c/p\u003e\n\u003cp\u003e“She has a unique tool that will allow her to live side-by-side with Clotilde without any ill effects. She said she plans to remain behind at Brandis and see what she can do to protect Arcainia,” Angelique said.\u003c/p\u003e\n\u003cp\u003e“A tool?” Nick said, interested.\u003c/p\u003e\n\u003cp\u003e“What tool?” Mikk asked.\u003c/p\u003e\n\u003cp\u003e“Her cat,” Angelique said.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“It is no matter,” Steffen said, shrugging. “If Gabrielle stays behind at Brandis, it is just as well. She wouldn’t be much use out here.”\u003c/p\u003e\n\u003cp\u003e“Steffen, stop being a fool,” Gerhart said, taking a step towards his eldest brother.\u003c/p\u003e\n\u003cp\u003e“Don’t,” Rune said, placing his hand in front of him.\u003c/p\u003e\n\u003cp\u003e“Why not? He’s being cruel and abusive to his wife, even if she is not here,” Gerhart said. “Out of all of us, I would have thought it would be you to correct him, Mr. Hero.”\u003c/p\u003e\n\u003cp\u003eRune leaned towards Gerhart and quietly said, “He is using his words to cover up his pain. Ignore it this one time,” he advised.\u003c/p\u003e\n\u003cp\u003e“Must I sew the shirts, or can I knit and weave the stalks of the stinging nettle to make them?” Elise asked.\u003c/p\u003e\n\u003cp\u003e“Knitting or weaving would work just as well, but it will put your hands in much pain,” Angelique said.\u003c/p\u003e\n\u003cp\u003e“But knitting would be faster,” Elise persisted.\u003c/p\u003e\n\u003cp\u003e“Yes,” Angelique admitted. “You could use the stalk of the plant, or if you stomp on the stalks, you will find them to be fibrous.”\u003c/p\u003e\n\u003cp\u003e“How could this break our curse? The idea that shirts made of prickly plants could undo such a strong curse seems laughable,” Erick said.\u003c/p\u003e\n\u003cp\u003e“If that is how you view it, yes, it is,” Angelique said. “However, you are using logic. Magic deals more with the matters of the heart. The curse Clotilde laid on you was constructed with a basis of hate. Because of her hatred for you, she twisted your lives and ruined you. Only a great sacrifice of love could counterbalance such evil. If Elise attempts to break your curse, she is lavishing more love upon the seven of you than the black hatred Clotilde set against you.”\u003c/p\u003e\n\u003cp\u003e“Knitting isn’t a sacrifice of love,” Gerhart said. “Ow!” he muttered when Nick smacked him upside the head again.\u003c/p\u003e\n\u003cp\u003e“The fact that you say that reveals a great deal about your character, young prince,” Angelique said. Her soft chiding made Gerhart blush and look away, but Angelique answered his question anyway. “By knitting shirts and remaining silent, Elise will essentially devote her life to you. Knitting with stinging nettles will be a painful process. If you will allow me to be frank, it is likely, Elise, that your hands will grow stiff and gnarled as a result of this process. They may never return to their normal levels of function. Additionally, remaining silent is no small feat. It will take a colossal amount of self-control. You may think the task sounds like child’s play, but even I will admit I am hard pressed to think of more than a few situations where the task to break a curse required less dedication or love.”\u003c/p\u003e\n\u003cp\u003e“Elise, will you do it?” Steffen asked.\u003c/p\u003e\n\u003cp\u003e“Are you out of your mind?” Rune asked. “We cannot ask her to do this. Not only will it be painful, but the dangers are numerous. We will be swans, and she will be voiceless in a country that is known for its assassin’s guild.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-24.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
