{"id":83501,"no":33,"title":"Page 33","content":"\u003cp\u003eChapter 6\u003c/p\u003e\n\u003cp\u003eThree days after Brida’s arrival, Elise sat on the sandy pond bank, watching her foster brothers in their swan bodies. It was only a hunch, but Elise thought she could occasionally discern which swan was which prince.\u003c/p\u003e\n\u003cp\u003eGerhart, or the swan Elise thought was Gerhart, spent an exorbitant amount of time swimming back and forth in front of the females from the flock of ducks. He tucked his head and looked inviting and elegant as he swam across the pond surface.\u003c/p\u003e\n\u003cp\u003eNick, and as a result Mikk, was easy to pick out. Nick spent his afternoons swimming after the pair of geese, badly imitating their honks and doing his best to be a general pest. Mikk usually swam several feet behind him, plucking out one of Nick’s feathers when he felt his twin grew too annoying.\u003c/p\u003e\n\u003cp\u003eElise watched Nick perform a poor goose honk imitation as she stiffly tied another stem of stinging nettle into her knitting project. She was grateful for Nick’s antics. They made the knitting just a little more bearable.\u003c/p\u003e\n\u003cp\u003eEvery stitch, every move was agony for Elise. It felt like her hands were on fire. Each plant embedded so many tiny hairs in her fingers, Elise gave up trying to remove them at night.\u003c/p\u003e\n\u003cp\u003eElise looked up when Brida sat near her with a thump. The captain brushed sweat from her forehead and dropped her axe on the ground.\u003c/p\u003e\n\u003cp\u003eElise turned around like an owl to look at Brida’s project—the horse pen Nick had started on. It was finished, the corner posts pounded in and makeshift logs crisscrossed to form walls.\u003c/p\u003e\n\u003cp\u003eBrida mopped her face with a handkerchief. “I forgot. I was supposed to give this to you,” Brida said, passing a rolled up letter to Elise.\u003c/p\u003e\n\u003cp\u003eElise set her knitting aside and eagerly took the letter. She glanced at Brida as she unrolled it.\u003c/p\u003e\n\u003cp\u003e“I apologize, Princess. As I said, I forgot,” Brida repeated, her words lacking in conviction.\u003c/p\u003e\n\u003cp\u003eElise shook her head before she glanced at the bottom of her letter. A smile leaped to her lips. It was from Mertein!\u003c/p\u003e\n\u003cp\u003eFürstin Elise, Prinzessin Gabrielle said I may write you a letter as it is likely I will not see you for some time. I am not certain this letter will find you, but I hope it does.\u003c/p\u003e\n\u003cp\u003eI am engaged to marry another.\u003c/p\u003e\n\u003cp\u003eElise stared at the words. She had to read them three times before their meaning sunk in and she was able to read on.\u003c/p\u003e\n\u003cp\u003eMy family heavily invested in ships and cargo to use when the Carabas harbor opens. The more delayed the harbor opening is, the worse it looks for my family.\u003c/p\u003e\n\u003cp\u003eSince you have left, the harbor has been delayed indefinitely as the country hasn’t the funds to continue. I had no choice. To save my family, I have become engaged to an heiress.\u003c/p\u003e\n\u003cp\u003eI cannot sacrifice my family to wait for you, Elise, and even before family’s monetary problems fell on me, I knew I would not be able to marry you, in spite of your affection for me.\u003c/p\u003e\n\u003cp\u003eI am a coward for writing this to you now, when you have lost everything, but I do not want to mislead you. I should have told you in person when I had the chance.\u003c/p\u003e\n\u003cp\u003ePlease forgive me, Fürstin. I think in time you will understand why I…\u003c/p\u003e\n\u003cp\u003eElise could read no farther. She didn’t want to read empty excuses. They would bring her no comfort.\u003c/p\u003e\n\u003cp\u003eThe letter dropped from Elise’s hands as she stared at the pond where the swan princes swam.\u003c/p\u003e\n\u003cp\u003e“Princess?” Brida said, rocking to her knees when the first of Elise’s tears fell.\u003c/p\u003e\n\u003cp\u003eElise clasped a hand to her mouth, biting her knuckle to keep her sobs and screams bottled in. Even now she had to sacrifice for her brothers. She couldn’t let one noise escape for their sake, even when all Elise wanted to do was cry until she was empty.\u003c/p\u003e\n\u003cp\u003e“Princess Elise, what is wrong?” Brida asked, crouching next to Elise.\u003c/p\u003e\n\u003cp\u003eElise genuinely liked Mertein.\u003c/p\u003e\n\u003cp\u003eShe had chosen him because of his family and their standing, yes, but she had chosen him because of his easy smile and sweet temperament. Mertein never expected more from her. He didn’t require perfection. He was affectionate, easy to talk to, and sweet. She was never absolutely certain they would marry, but she thought that would be because her father would be forced to send her to another country, not because Mertein would marry another!\u003c/p\u003e\n\u003cp\u003e“Princess,” Brida said, her voice taking on a note of panic as she placed her hands on Elise’s shoulders and shook her.\u003c/p\u003e\n\u003cp\u003eElise’s heart ached—throbbing worse than her burning fingers.\u003c/p\u003e\n\u003cp\u003eMertein was the one personal choice she made. Just like everything else in her life, she knew he had to be suitable, yes, but there were at least a dozen other men who were just as suitable. It was Mertein Elise had hoped for.\u003c/p\u003e\n\u003cp\u003eAnd now he had abandoned her.\u003c/p\u003e\n\u003cp\u003eElise picked up the letter and tore it right beneath the words “I am engaged to marry another.”\u003c/p\u003e\n\u003cp\u003eShe gave the top half of the letter to Brida and stood, crumpling the rest of the letter in her fist. She grabbed the shirt she was working on before she retreated to the woods, tears still falling from her eyes.\u003c/p\u003e\n\u003cp\u003eEven in great sorrow Elise had to be perfect. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-33.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
