{"id":83502,"no":34,"title":"Page 34","content":"\u003cp\u003eThe following day, Elise sat with her brothers around the fire, knitting in the orange light. Telling them about Mertein when they turned human the night before had been pure torture—Gerhart and Mikk didn’t seem to care, Falk and Erick acted as if they expected it all along. Nick made a badly received joke about it. Only Rune and Steffen were sympathetic.\u003c/p\u003e\n\u003cp\u003eThankfully, though, they seemed to pick up on Elise’s sorrow and did their best to spare Elise’s feelings. Or so she thought.\u003c/p\u003e\n\u003cp\u003e“Based on the rate at which Elise is knitting, we can expect to be human again by midsummer,” Erick pronounced.\u003c/p\u003e\n\u003cp\u003e“Do you think you’ll be able to speed up as you get better at this, Elise?” Nick asked.\u003c/p\u003e\n\u003cp\u003e“It’s hard to say,” Elise said. “It did take most of my first day to remember how to knit and cast on and purl. After I complete this first shirt—and I use that description loosely, it’s more like a shrug of some sort—it should be easier.”\u003c/p\u003e\n\u003cp\u003e“Imagine that. Elise isn’t perfect at something,” Gerhart sneered.\u003c/p\u003e\n\u003cp\u003e“Gerhart,” Rune warned as he emerged from the woods with an armload of firewood.\u003c/p\u003e\n\u003cp\u003e“I’m not certain I will be able to knit faster, though,” Elise continued, clenching her teeth to keep herself from snarling at Gerhart.\u003c/p\u003e\n\u003cp\u003e“Why not?” Nick asked.\u003c/p\u003e\n\u003cp\u003e“Because it hurts a great deal to do this, and my fingers are growing stiff and inflexible,” Elise said.\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“If Brida is willing, she should scout out the area during daylight. There may be a village nearby where we could purchase a salve or dressing for Elise’s hands,” Falk said.\u003c/p\u003e\n\u003cp\u003e“Excellent idea. Would you mind terribly, Captain Meier?” Rune asked, flashing her a dazzling smile.\u003c/p\u003e\n\u003cp\u003e“Not at all Prince Rune,” Brida easily agreed.\u003c/p\u003e\n\u003cp\u003e“We appreciate your willingness, Brida,” Nick said.\u003c/p\u003e\n\u003cp\u003eMikk nodded in agreement.\u003c/p\u003e\n\u003cp\u003e“Elise is just being a girl,” Gerhart said, rolling his eyes. “Falk already found her those plants to help with the pain.”\u003c/p\u003e\n\u003cp\u003e“I hate you,” Elise said, the words were out of her mouth before she thought them through, but even after she spoke Elise wasn’t sorry. She was sick of subjecting herself to Gerhart’s bad temper.\u003c/p\u003e\n\u003cp\u003e“So the Perfect Princess hates someone. Maybe she’s not so perfect after all,” Gerhart said.\u003c/p\u003e\n\u003cp\u003e“I have done nothing wrong to you. I have spent months, if not years, putting up with your temper tantrums, and I refuse to deal with them anymore as I spend my days making sacrifices for you,” Elise said.\u003c/p\u003e\n\u003cp\u003e“You have done nothing to me?” Gerhart sputtered. “Do you have any idea what I’ve gone through because of you?”\u003c/p\u003e\n\u003cp\u003e“Gerhart,” Falk warned.\u003c/p\u003e\n\u003cp\u003e“All day long all I hear is how wonderful you are, how great you are, how you’re going to be the family savior. Why can’t you be more like your sister, Gerhart? She’s so young, and she’s already in charge of a department, Gerhart!”\u003c/p\u003e\n\u003cp\u003e“Your jealousy is not my problem,” Elise said.\u003c/p\u003e\n\u003cp\u003e“Funny, I said the same thing to my dear brothers, and they didn’t seem to think so.”\u003c/p\u003e\n\u003cp\u003e“You aren’t making any sense.”\u003c/p\u003e\n\u003cp\u003e“Then maybe you should try talking to Falk and your precious Rune. You didn’t know they’ve been going behind your back, intimidating anyone who looks twice at you, huh? I’m surprised your dearest Mertein held out as long as he did.”\u003c/p\u003e\n\u003cp\u003eElise turned to look at Falk and Rune, who were standing next to each other. Her voice was quiet but as sharp as a sword when she asked, “What is he talking about?”\u003c/p\u003e\n\u003cp\u003e“You never noticed?” Gerhart continued, unable to shut up. “Falk is over the moon for you, and Rune has spent years keeping him away from you. You think you know your golden-boy-hero? You should see him when he’s threatening someone to make them stay away from you. He’s real heroic then.”\u003c/p\u003e\n\u003cp\u003e“GERHART,” Rune snapped.\u003c/p\u003e\n\u003cp\u003eElise stared unseeingly at her foster brothers. “What?”\u003c/p\u003e\n\u003cp\u003eThere was an uncomfortable silence for several moments before Mikk spoke. “So, it will take Elise to midsummer to free us,” he said.\u003c/p\u003e\n\u003cp\u003e“Oh, no,” Elise said, scrambling to her feet. “You owe me an explanation. What is Hart talking about?”\u003c/p\u003e\n\u003cp\u003e“It’s nothing, Elise,” Rune said, his voice once again warm and light. “Ignore him. Gerhart has always been jealous of you,” he said.\u003c/p\u003e\n\u003cp\u003e“No, he hasn’t,” Elise said. When Queen Ingrid had first plucked her from palace service—where she had discovered Elise—Gerhart was the friendliest out of all the brothers. He was Elise’s companion as a child. It was only about three years ago that he started getting prickly. At first Elise thought it was because he was growing up, but when it continued, she realized there was no reasonable explanation.\u003c/p\u003e\n\u003cp\u003e“Focusing on the task at hand would be wisest,” Erick said. “We must break our curse and free Father from Clotilde. It is our duty.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-34.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
