{"id":83520,"no":52,"title":"Page 52","content":"\u003cp\u003eElise found herself nodding. Although Ostfold and the palace weren’t as beautiful to her as Castle Brandis, it did have an exotic sort of beauty, and Elise admired all the triangles and straight lines.\u003c/p\u003e\n\u003cp\u003e“I thought you could take refuge at Lake Sno,” Prince Toril said as he led the way to the back of the royal palace. Behind the oddly beautiful castle was a huge lake. It was a gorgeous aqua color Elise had never seen in water before.\u003c/p\u003e\n\u003cp\u003e“It’s pretty cold since it’s snowfed from the mountains, but your swans should be able to brave it,” Prince Toril said, glancing overhead where the flock flew.\u003c/p\u003e\n\u003cp\u003e“There’s a small cottage where a hermit used to live, before my father threw him out,” Prince Toril said, speaking the second part quickly. “It should house you two quite comfortably. There it is.”\u003c/p\u003e\n\u003cp\u003eElise was relieved to see that the cottage Price Toril pointed to was out of the way of the palace. Between the palace and the cottage were the royal gardens, the stables, servants’ quarters, and a good-sized hill. The cottage was nestled into a group of pine trees that backed up into a large forest. It stretched up one of the mountainsides Ostfold leaned against. It was a stone’s throw from a small inlet the lake stretched into, formed complements of the hill and the forest.\u003c/p\u003e\n\u003cp\u003eIt would be close enough to civilization that they would be safe, but far enough away that no one would take note of seven transforming swans at sundown.\u003c/p\u003e\n\u003cp\u003e“Do you like it?” Prince Toril asked.\u003c/p\u003e\n\u003cp\u003eElise nodded.\u003c/p\u003e\n\u003cp\u003e“It will do. You have our thanks, Prince Toril,” Brida said, regaining some of her manners due to the proximity of a palace.\u003c/p\u003e\n\u003cp\u003e“No thanks are necessary. It is my duty as a royal prince to see to the happiness of peasants,” Prince Toril said, an idiotic grin on his face.\u003c/p\u003e\n\u003cp\u003eBehind his back Brida rolled her eyes.\u003c/p\u003e\n\u003cp\u003e“I will take the ladies to their new residence. I’ll see you tonight at the Rabbit and the Reindeer?” Prince Toril asked his companions.\u003c/p\u003e\n\u003cp\u003e“Aye,” they chorused out.\u003c/p\u003e\n\u003cp\u003e“Take care, ladies,” one of the more talkative soldiers said to Brida and Elise.\u003c/p\u003e\n\u003cp\u003eElise waved in farewell as Toril directed his horse down the dirt path that led to the cottage. Brida hurried after them, clicking to her mare and Falk’s mount to keep them going when they longingly eyed the beautiful stables.\u003c/p\u003e\n\u003cp\u003e“Almost there,” Brida murmured.\u003c/p\u003e\n\u003cp\u003eThe cottage was unsurprisingly made of wood. It had just one carving in the exterior—an extravagant snowflake posted just above the doorframe. What was most astonishing about the cottage, though, was its roof. It was covered with green grass.\u003c/p\u003e\n\u003cp\u003eBoth Elise and Brida stared at the green roof.\u003c/p\u003e\n\u003cp\u003e“What? What’s wrong?” Prince Toril asked after he dismounted his horse, being careful not to kick Elise in her open mouth.\u003c/p\u003e\n\u003cp\u003eBrida pointed to the cottage. “The roof. It is growing grass,” she said respectfully, just in case the somewhat clueless prince hadn’t noticed.\u003c/p\u003e\n\u003cp\u003e“So?” he asked.\u003c/p\u003e\n\u003cp\u003e“It’s grass,” Brida repeated.\u003c/p\u003e\n\u003cp\u003e“Sod roofs are common practice in Verglas,” Prince Toril said, helping Elise down.\u003c/p\u003e\n\u003cp\u003e“Why?” Brida asked as she too dismounted.\u003c/p\u003e\n\u003cp\u003e“They provide wonderful insulation in the winter, and they’re heavy, so it supports the structure,” Prince Toril said. “They’re actually covered in birch bark underneath the greenery. The birch bark is what makes the roof waterproof. The grass just keeps it in place.”\u003c/p\u003e\n\u003cp\u003eBrida accepted this explanation and set about unpacking the horses.\u003c/p\u003e\n\u003cp\u003eElise, however, stared at the roof in morbid fascination.\u003c/p\u003e\n\u003cp\u003ePrince Toril caught her extreme interest and chuckled. “Some folk occasionally toss their goats on their roof.”\u003c/p\u003e\n\u003cp\u003eElise swung to face him with disbelieving eyes.\u003c/p\u003e\n\u003cp\u003e“It’s true. It keeps the goat from wandering off, and their roof gets trimmed so it does not become a bushy eyesore,” Prince Toril said.\u003c/p\u003e\n\u003cp\u003eElise was not entirely convinced Toril was telling the truth, but the loud flapping of wings told her she had no time to further enquire. She left Prince Toril and Brida and walked to the lake shore, plunging in until she was up to her knees.\u003c/p\u003e\n\u003cp\u003ePrince Toril was right—the water was cold!\u003c/p\u003e\n\u003cp\u003eElise waved to her flock of swans, who circled the inlet before they landed in the water—managing to do so with a small amount of grace so they did not crash into each other or spatter the lake surface as they were prone to doing.\u003c/p\u003e\n\u003cp\u003e“Once you are settled in, I shall return. Otherwise, you can expect a kitchen girl to deliver food for you every morning and evening. If you have a need for anything, just ask her—or if it is urgent, you may ask any guard around the palace,” Prince Toril said.\u003c/p\u003e\n\u003cp\u003eElise hurried out of the water when the swans began splashing each other in their exuberance to be back in water.\u003c/p\u003e\n\u003cp\u003e“Again, you have our thanks, Prince Toril,” Brida said before she bowed.\u003c/p\u003e\n\u003cp\u003eElise hastily curtsied, purposely using the plainest curtsy she could. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-52.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
