{"id":83521,"no":53,"title":"Page 53","content":"\u003cp\u003ePrince Toril beamed, happy with Brida, Elise, and in all likeliness, himself. “It is no trouble at all. Good day to both of you, and welcome to Ostfold,” he said before hefting himself back in the saddle and disappearing over the crest of the hill.\u003c/p\u003e\n\u003cp\u003e“That is one odd prince,” Brida said before she pulled the horses over to a makeshift shelter. Judging by the short fence, it had been constructed for goats, but the lean-to and water trough would be good enough for horses as well-trained as Brida’s and Falk’s.\u003c/p\u003e\n\u003cp\u003eElise nodded, even though Brida couldn’t see her, and gathered up the saddle bag that held her three finished shirts.\u003c/p\u003e\n\u003cp\u003e“This will suit us fine, don’t you think Fürst—Elsa?” Brida asked as she emerged from the lean-to and headed for the cottage. The captain had to lean heavily against the door to open it, and almost fell inside when the door finally gave.\u003c/p\u003e\n\u003cp\u003eThe inside of the cottage was cramped and dusty, but there was a fireplace, a crude counter, and two rickety chairs. A ladder led to a loft filled with sweet-smelling straw that would serve as a bed.\u003c/p\u003e\n\u003cp\u003eElise heaved her knitting projects inside before she offered Brida a smile.\u003c/p\u003e\n\u003cp\u003e“I agree. I like it, too,” Brida said, even though Elise hadn’t spoken. “We will be quite comfortable here. Your brothers made the right decision.”\u003c/p\u003e\n\u003cp\u003eElise hoped she was right, but she couldn’t help but feel a nagging shard of doubt wiggling in the back of her mind. She left the cottage to watch her foster brothers splash in the lake, but her gaze was drawn to the bits of the royal palace she could see over the hill.\u003c/p\u003e\n\u003cp\u003eAlthough everyone appeared happy, and all of Ostfold was beautiful, Elise felt somehow the tidy exterior was used to cover a dark secret.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003e“Everything seems well enough,” Steffen said.\u003c/p\u003e\n\u003cp\u003e“It will be harder for us to find food. Snow fed bodies of water typically don’t have fish in them—the waters are too cold,” Erick said.\u003c/p\u003e\n\u003cp\u003e“Perhaps Prince Toril will realize that and give Elise food for us?” Nick said.\u003c/p\u003e\n\u003cp\u003e“So we will have to choose between bugs and bird food. Funny, I never thought I would have to make that decision in my life,” Gerhart said from the cottage loft.\u003c/p\u003e\n\u003cp\u003eBrida, Elise, and the seven princes were crowded inside the cottage—more to keep anyone from seeing them than for shelter purposes.\u003c/p\u003e\n\u003cp\u003e“The thing to concentrate on is that we are all here, and we all made it safely. Elise only has three and a half shirts left. We’re halfway to freedom,” Erick said.\u003c/p\u003e\n\u003cp\u003e“Yes, so everyone take this moment to give thanks to Elise,” Steffen said.\u003c/p\u003e\n\u003cp\u003e“Thank you, sister,” Nick grinned, affectionately ruffling Elise’s hair.\u003c/p\u003e\n\u003cp\u003e“Thank you, Elise,” Rune said, reaching out to touch her before Falk smacked him. “Ouch.”\u003c/p\u003e\n\u003cp\u003e“If we stay on our guard, we should be able to pass the remainder of our cursed days idly,” Steffen said. “No questionable behavior. Everyone, act like swans.”\u003c/p\u003e\n\u003cp\u003e“Yes, brother.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“Bossy brute.”\u003c/p\u003e\n\u003cp\u003eElise couldn’t help the laugh that bubbled up from her stomach, which drew grins from her brothers. They spent the remainder of the hour in high spirits and lighthearted chatter.\u003c/p\u003e\n\u003cp\u003eElise’s time at Ostfold fell into a predictable pattern. She rose with the sun and sat outside on a smooth rock and knitted until the kitchen girl arrived with oatmeal for Elise and Brida and cracked corn for the swan princes.\u003c/p\u003e\n\u003cp\u003eAfter breakfast, Elise went back to knitting, and Brida stole away into the woods to practice her stances and weaponry out of sight of the palace. At noon, they usually snacked on berries Brida found and bread left behind by the kitchen girl. After more hours of knitting, the kitchen girl returned with dinner—usually mutton or creamed fish soup.\u003c/p\u003e\n\u003cp\u003eSoldiers on horseback rode past twice a day, patrolling a circuit around the lake.\u003c/p\u003e\n\u003cp\u003ePrince Toril visited several times a week to plead with Elise to speak to him.\u003c/p\u003e\n\u003cp\u003e“I know you must be able talk. Your bear-maid speaks for both of you, and she doesn’t seem the type to be extraordinarily good at reading body language,” he said during the second week since their arrival at Ostfold.\u003c/p\u003e\n\u003cp\u003eElise only smiled and shook her head as she kept knitting.\u003c/p\u003e\n\u003cp\u003e“Why do you do this? Why do you put yourself through this? It must be for a purpose,” Prince Toril persisted.\u003c/p\u003e\n\u003cp\u003eElise paused her work long enough to lay a hand on the back of her companion swan. Would it be harmful to give Prince Toril the main reason, the heart of why she worked so laboriously in spite of the pain? She didn’t think so.\u003c/p\u003e\n\u003cp\u003eElise winced when she realized she left behind a set of bloody fingerprints on the snow white feathers of her companion swan, but she turned to Prince Toril and attempted to make several different signs and motions.\u003c/p\u003e\n\u003cp\u003e“For love?” Prince Toril said, surprisingly able to interpret her gestures. “You do all of this for love?”\u003c/p\u003e\n\u003cp\u003eElise nodded and went back to knitting.\u003c/p\u003e\n\u003cp\u003ePrince Toril thoughtfully stared at the swans that floated on the surface of the lake. “You must really love them,” he finally said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-53.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
