{"id":83527,"no":59,"title":"Page 59","content":"\u003cp\u003e“I am always right. Now we had better make our exit.”\u003c/p\u003e\n\u003cp\u003e“Not yet,” Gabrielle said, popping the stopper off the inkwell she carried before dipping her brush in it.\u003c/p\u003e\n\u003cp\u003e“Again? And you were surprised that I was being petty?”\u003c/p\u003e\n\u003cp\u003e“I can’t help it. It’s the only spot of fun I get. Besides, don’t you see how thick the paint is caked on? It obviously irritates her,” Gabrielle smiled as she stood before a huge portrait of Queen Clotilde.\u003c/p\u003e\n\u003cp\u003e“Carry on, then. I am all for irritating the hag. But if you spill a drop of ink on my fur, I shall be forced to claw your hide.”\u003c/p\u003e\n\u003cp\u003eGabrielle laughed and reached up to make the first brushstroke. “Have faith in my skills, Puss.”\u003c/p\u003e\n\u003cp\u003eAn hour later, Queen Clotilde returned to her room. She glanced at her portrait and shrieked. “NOOOOOO!”\u003c/p\u003e\n\u003cp\u003eTwo guards reluctantly entered her chambers. “What is wrong, Queen?”\u003c/p\u003e\n\u003cp\u003eQueen Clotilde raised a hand and pointed to her ruined portrait. “That brat!” she shouted. “Everyone tells me Princess Gabrielle is gone, but she’s struck again, and she’s ruined my portrait!”\u003c/p\u003e\n\u003cp\u003eThe painting of Queen Clotilde was defaced. The queen’s painted face was once serene and beautiful. Now it sported a mustache, ear hair, and several warts, all drawn on with black writing ink.\u003c/p\u003e\n\u003cp\u003eThe soldiers maintained blank expressions. “How unfortunate,” they parroted.\u003c/p\u003e\n\u003cp\u003e“It’s not unfortunate—it’s a crime! I want her head on a platter. Muster the guards and call for the royal painter this instant!”\u003c/p\u003e\n\u003cp\u003e“Of course, Queen.”\u003c/p\u003e\n\u003cp\u003eChapter 11\u003c/p\u003e\n\u003cp\u003eSummer passed, and Elise worked steadily. Her hands hurt worse than ever, but she knitted with renewed determination. By the last month of summer, she had four finished shirts, and worked on the fifth with great vigor.\u003c/p\u003e\n\u003cp\u003eLife remained the same. Prince Toril visited often. Elise’s brothers did their best to spend their hour as humans to entertain her and relieve her pain. The days were, to be honest, boring and painful but not without little bits of joy.\u003c/p\u003e\n\u003cp\u003eElise’s swan companion was a constant. And when Elise was about halfway through with her fifth shirt, her curiosity grew to unbearable limits.\u003c/p\u003e\n\u003cp\u003ePreviously, Elise avoided wondering which prince her swan companion was. “They’re not my foster-brothers when they get their feathers and beak. They’re swans. They can’t possibly remember, much less realize, what they’re doing,” Elise explained one summer night during her hour of reprieve to Brida when the girls were washing together for a shared supper. “I know you think it is Falk, but I disagree. It could be any of my foster-brothers. Whatever prince it is probably doesn’t realize what he’s doing.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Brida said, unconvinced.\u003c/p\u003e\n\u003cp\u003eElise stood by her words…until her conviction lessened.\u003c/p\u003e\n\u003cp\u003eHer swan companion acted too human.\u003c/p\u003e\n\u003cp\u003eIf Elise happened to drop a small item, like her whistle or one of her knitting needles, the swan clamped his beak around it and carried it for her. The swan ate whenever Elise ate rather than grazing all day long like his brothers, and he was watchful. Whenever a patrolling soldier passed, or even if Brida emerged from the woods for lunch, Elise’s companion swan watched.\u003c/p\u003e\n\u003cp\u003eWhat tickled Elise’s curiosity was that whenever Prince Toril visited, the swan pinched, smacked, and burrowed his way into sitting between Elise and the prince.\u003c/p\u003e\n\u003cp\u003eElise tried to nonchalantly watch her companion swan when he hurried back to the lake to transform, but the wily bird always made sure to dart in between a few of his brothers, and Elise lost sight of him every time. Once Elise wove a crown of flowers and linked it around the base of the swan’s neck, but he ripped it off by the time sunset came.\u003c/p\u003e\n\u003cp\u003eHer curiosity aroused, Elise was not going to give in easily.\u003c/p\u003e\n\u003cp\u003eThis called for drastic measures.\u003c/p\u003e\n\u003cp\u003e“Sunset is almost upon us. I’m going to stoke the fire,” Brida said.\u003c/p\u003e\n\u003cp\u003eElise nodded but kept her eyes glued to her swan companion, who was snacking on grass.\u003c/p\u003e\n\u003cp\u003e“…Princess?”\u003c/p\u003e\n\u003cp\u003eElise gave Brida a thumbs up and pulled her legs to her chest so she could rest her chin on her knees.\u003c/p\u003e\n\u003cp\u003eBrida hesitated before she leaned over and whispered, “Are you finally determined enough to confirm his identity?”\u003c/p\u003e\n\u003cp\u003eElise nodded.\u003c/p\u003e\n\u003cp\u003eBrida smiled. “Good luck, Fürstin,” she said before she climbed the slope to the cottage and disappeared inside.\u003c/p\u003e\n\u003cp\u003eAs the last rays of the sun disappeared over the horizon, Elise’s swan companion stood.\u003c/p\u003e\n\u003cp\u003eElise threw herself to her feet and scrambled after him.\u003c/p\u003e\n\u003cp\u003eWhen the swan reached the water, he tried to paddle away, but Elise braved the cool waters and plunged in after him, grabbing his tail feathers before he could scoot away.\u003c/p\u003e\n\u003cp\u003eShe chased the swan until she was up to her chest in the water. The swan slipped from her grip then and started to paddle away. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-59.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
