{"id":83528,"no":60,"title":"Page 60","content":"\u003cp\u003eElise sighed, her shoulders drooping. The swan paused and paddled back to her side. It tipped its head back and forth, studying her face. Whatever he was looking for, he must have seen, for he settled in next to Elise as the sun disappeared on the horizon.\u003c/p\u003e\n\u003cp\u003eSeeing the transformation up close was a new experience for Elise.\u003c/p\u003e\n\u003cp\u003eAs usual, the water grew choppy, and the swan princes extended their wings into the air before they were surrounded by a white light.\u003c/p\u003e\n\u003cp\u003eThe white light had a musical quality to it. It sounded like magic, Elise supposed. It was laughter and raindrops on a lake. It had the chime of an ice crystal clinked on a frosty day and the deep toll of a cathedral bell. It was the wind singing on a mountainside, smiles, sunshine, and stardust.\u003c/p\u003e\n\u003cp\u003eElise held her hand out to see if she could catch a bit of the light—it fell from the transforming princes like fire shedding sparks and embers—but when the light touched her skin, it bounced off and disappeared, fading like a dying flame.\u003c/p\u003e\n\u003cp\u003eDisappointed, but still curious, Elise looked up just as the white feathers were shed and the Arcainian princes dropped in the water, fully transformed.\u003c/p\u003e\n\u003cp\u003eBrida was right.\u003c/p\u003e\n\u003cp\u003e“Falk,” Elise said, her voice revealing her disbelief. In the weeks before Brida had all but said it was him, but Elise doubted a man who could spit out nicknames like “Dewdrop” as if they were poison could be sensitive enough to follow Elise like a faithful companion. It showed just how little she understood him.\u003c/p\u003e\n\u003cp\u003eFalk, looking chagrined, brought his hand out of the cold lake water to push his goldenrod hair out of his face. “So sorry to disappoint.”\u003c/p\u003e\n\u003cp\u003e“Hah-hah, told you she would be,” Nick said as he climbed out of the lake, his twin right behind him.\u003c/p\u003e\n\u003cp\u003e“But I’m not, I’m not,” Elise said, first to Nick and then to Falk. “I’m just…surprised.”\u003c/p\u003e\n\u003cp\u003e“And why would you be surprised?” Falk asked, his eyebrows furrowed as he stared Elise down.\u003c/p\u003e\n\u003cp\u003eHe was waiting for Elise to say because she didn’t believe he loved her. Elise could read his frustration and hurt in his dark eyes.\u003c/p\u003e\n\u003cp\u003eElise had underestimated him, and in a way she belittled his feelings, just as Brida predicted. She had yet to acknowledge either he or Rune, and she still acted as if she suspected he secretly hated her.\u003c/p\u003e\n\u003cp\u003eIt was unfair of her. Since Falk became a swan, he was nothing but helpful. Falk acted in her best interest through the entire trial. He was the one who organized the brothers the first night at the new pond. He found food for Elise and Brida, and he went out of his way to find plants and make salves to lessen Elise’s pain.\u003c/p\u003e\n\u003cp\u003eAnd all Elise did in return was eye him and thoughtlessly declare she didn’t believe in his feelings.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Elise said, surprising them both.\u003c/p\u003e\n\u003cp\u003eFalk shifted in the water. “For?”\u003c/p\u003e\n\u003cp\u003e“For being unworthy of your feelings for me.”\u003c/p\u003e\n\u003cp\u003e“But you are,” Falk said, his expression earnest.\u003c/p\u003e\n\u003cp\u003eElise chuckled, which turned into a shiver from the cold water they were still standing in. “Why, Falk?” she asked.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Why me?”\u003c/p\u003e\n\u003cp\u003e“I know I am not Rune,” Falk started.\u003c/p\u003e\n\u003cp\u003e“That’s not what I’m asking,” Elise cut him off. “Why do you love me? What is it about me that would make you tolerate your older brothers’ teasing and intimidate your little brother?” Elise asked, drawing closer until she was less than an arm’s length from him.\u003c/p\u003e\n\u003cp\u003eFalk was very still, as if he feared he would startle Elise and make her run away. “Because you are fearless.”\u003c/p\u003e\n\u003cp\u003e“I’m what?”\u003c/p\u003e\n\u003cp\u003e“I mean…you arm yourself with whatever is necessary to overcome your enemy, whether it be knitting needles or a horse bridle. And I love the way claw at others for money,” Falk said.\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003eFalk continued, “When you were first posted to the Treasury Department, you listened to me give an hour-long lecture about grain production in a department meeting. You were the only person who never yawned and who never looked away. You listened with absolute attention and when I was finished, you asked questions.”\u003c/p\u003e\n\u003cp\u003eElise was not terribly impressed or moved. Falk must have picked up on her mood because he pulled at his goldenrod colored hair.\u003c/p\u003e\n\u003cp\u003e“You don’t understand what I’m trying to say. You have a big heart, and you would never stop loving us. You are more elegant and lovely than every lady in Arcainia. I love your intelligence, and I love you. And… I love that you are warm and affectionate,” he finished, a note of longing in his voice.\u003c/p\u003e\n\u003cp\u003e“The nicknames?” Elise said, her voice cracking.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“The ridiculous names you call me: Fawn, Snowflake, Honey Cake,” Elise said.\u003c/p\u003e\n\u003cp\u003e“Yes, what of them?” Falk said.\u003c/p\u003e\n\u003cp\u003e“What do you mean what of them?”\u003c/p\u003e\n\u003cp\u003e“I was under the impression those are terms of endearment,” Falk said. “Father said they were.”\u003c/p\u003e\n\u003cp\u003e“They are,” Elise said.\u003c/p\u003e\n\u003cp\u003e“Then I don’t understand your confusion.”\u003c/p\u003e\n\u003cp\u003e“The way you said them…”\u003c/p\u003e\n\u003cp\u003e“Yes?” Falk said.\u003c/p\u003e\n\u003cp\u003eElise hesitated, “…You really meant them?”\u003c/p\u003e\n\u003cp\u003e“Of course,” Falk said, his sincerity shining in his eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-60.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
