{"id":83529,"no":61,"title":"Page 61","content":"\u003cp\u003eElise bit her lower lip.\u003c/p\u003e\n\u003cp\u003eShe had been wrong about Falk. She thought he couldn’t possibly love her, not the real her. It had to be the “perfect princess” she pretended to be that he loved. But now, even Elise couldn’t pretend Falk didn’t see the real her.\u003c/p\u003e\n\u003cp\u003ePerhaps what was more thought provoking, was the way Elise had treated Falk in the previous months and years. Yes, he tended to sneer words, but even Rune said Falk accidentally insulted Elise whenever he meant to compliment her. How much had Falk said, and how much had Elise ignored?\u003c/p\u003e\n\u003cp\u003e“Elise?” Falk reached out to touch a loose coil of hair that had fallen from the ponytail Elise pulled her hair back in. “All I’m asking for is the chance for you to love me.”\u003c/p\u003e\n\u003cp\u003eElise licked her lips and almost bit her tongue when her teeth started chattering. “Okay.”\u003c/p\u003e\n\u003cp\u003eFalk froze. “Okay?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Elise said, making the water gush when she lunged forward to hug him.\u003c/p\u003e\n\u003cp\u003eFalk took a shuddering breath and eased his arms around her. Elise could feel his heart pounding a mile a minute under her cheek as she linked her arms around his neck.\u003c/p\u003e\n\u003cp\u003eFalk leaned his head against hers. “Thank you,” he whispered.\u003c/p\u003e\n\u003cp\u003eOn shore, rocks cracked as Nick and Mikk held Rune back. “You’ve gotten your moment with her, Rune-y,” Nick said.\u003c/p\u003e\n\u003cp\u003e“Several moments,” Mikk said.\u003c/p\u003e\n\u003cp\u003e“Now be a fair sportsmen, and let Falk have his,” Nick said.\u003c/p\u003e\n\u003cp\u003eElise shivered in Falk’s arms and squealed in surprise when Falk hunched over and slipped an arm under her knees. “This water is freezing. We should get to shore,” he said, carrying her out of lake.\u003c/p\u003e\n\u003cp\u003eElise clung to Falk’s neck as water cascaded from them. “You could put me down,” she said when the water was up to Falk’s shins.\u003c/p\u003e\n\u003cp\u003e“Not a chance,” Falk said, leaving the water and starting up the path to the cottage. He passed Nick, Mikk, and a glowering Rune.\u003c/p\u003e\n\u003cp\u003eErick waited at the cottage door. “Oh,” he said, pushing his eyebrows up. “Is the dark horse taking the lead now?” he asked, speaking more to Nick and Mikk than to Falk or Elise.\u003c/p\u003e\n\u003cp\u003e“Hard to tell,” Nick said.\u003c/p\u003e\n\u003cp\u003eMikk held his thumb and pointer figure an inch apart. “Just a bit.”\u003c/p\u003e\n\u003cp\u003eErick laughed heartily, and Falk edged past them to carry Elise into the cottage.\u003c/p\u003e\n\u003cp\u003eBrida was waiting with towels, which she wrapped around Elise the instant Falk set her down.\u003c/p\u003e\n\u003cp\u003e“What were you thinking, keeping her in the icy water?” Steffen scolded Falk before he threw a towel at him, hitting the younger prince in the face.\u003c/p\u003e\n\u003cp\u003e“I thought you didn’t particularly want her to marry Rune?” Falk asked after removing the towel from his face.\u003c/p\u003e\n\u003cp\u003e“I don’t, but I don’t particularly want her to marry you either,” Steffen said “Who, then, is she supposed to marry?”\u003c/p\u003e\n\u003cp\u003e“No one. Elise is too cute to marry a brute. She can stay unmarried for life,” Steffen said, patting the top of Elise’s head.\u003c/p\u003e\n\u003cp\u003e“Steffen, I’m not a dog,” Elise said.\u003c/p\u003e\n\u003cp\u003e“Fine, but you cannot court anyone until you are at least 40, or married,” Steffen said.\u003c/p\u003e\n\u003cp\u003e“How is that supposed to work?” Falk asked.\u003c/p\u003e\n\u003cp\u003e“It’s not. That’s the beauty of it,” Steffen said.\u003c/p\u003e\n\u003cp\u003eRune broke his way inside, sending Mikk and Nick toppling over like wooden dolls. “Are you warm enough, Elise? Should I go find some more firewood?”\u003c/p\u003e\n\u003cp\u003eFalk glanced outside. “I have enough light to search for some dandelions. I should make a paste for your hands again,” he said once he finished drying off.\u003c/p\u003e\n\u003cp\u003e“I’ll come with you. We can talk while I gather firewood,” Rune said, eyeing his brother.\u003c/p\u003e\n\u003cp\u003e“Your suitors are very useful, Fürstin,” Brida said as the princes elbowed their way out of the doors.\u003c/p\u003e\n\u003cp\u003e“Thank you, I think,” Elise said.\u003c/p\u003e\n\u003cp\u003e“Right, they’re gone. I can finally update the gambling pool. Mikk, you were the one who thought Falk would get through to Elise, yes? Steffen, you owe Mikk a gold coin,” Erick said, sliding a scroll of paper out of its hiding spot under a stool.\u003c/p\u003e\n\u003cp\u003e“Bother,” Steffen tisked.\u003c/p\u003e\n\u003cp\u003eMikk smiled.\u003c/p\u003e\n\u003cp\u003e“Gerhart, I’m sorry but you’re completely out of the running,” Erick said, using a quill to cross something off on the scroll.\u003c/p\u003e\n\u003cp\u003e“Enjoy your life of wretched singlehood,” Nick said.\u003c/p\u003e\n\u003cp\u003e“I never wanted to be in the running anyway,” Gerhart shuddered.\u003c/p\u003e\n\u003cp\u003e“Of course,” Mikk said. “Onella.”\u003c/p\u003e\n\u003cp\u003e“Would you stop talking about her?” Gerhart shrieked.\u003c/p\u003e\n\u003cp\u003e“I forgot about her,” Nick said.\u003c/p\u003e\n\u003cp\u003e“We have a separate gambling pool that Onella will or will not answer Gerhart’s feelings. Would you care to make a wager?” Erick asked.\u003c/p\u003e\n\u003cp\u003e“Sure. I’ll put down three gold coins that she laughs and guts him to make a belt for herself when he confesses. Only strong, half-mad people work directly under Falk,” Nick said.\u003c/p\u003e\n\u003cp\u003e“She would not do such a savage thing,” Gerhart said.\u003c/p\u003e\n\u003cp\u003e“Why don’t you put your money where your mouth is and bet on yourself in that case?” Steffen asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-61.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
