{"id":100951,"no":65,"title":"Page 65","content":"\u003cp\u003eKing Torgen was an evil, twisted man.\u003c/p\u003e\n\u003cp\u003eElise was led down stairs, into the bowels of the wooden castle. Elise never thought such a pleasant-looking place could have such a foul corner in it, but it did.\u003c/p\u003e\n\u003cp\u003eThe dungeons were made of black stone. Even light from the torches was swallowed up and muted by the oppressive atmosphere.\u003c/p\u003e\n\u003cp\u003eIt was silent, like the stillness of a body after the skeleton fingers of death strangled the last gasps of life from it.\u003c/p\u003e\n\u003cp\u003eThe guards led Elise to wooden door set in the black stone and opened it. It was an empty cell. There was nothing in it—not even a pile of dirty straw or a bucket. Once inside the cell, Elise could see that the wooden door had deep gouges, as if someone clawed at it, and was spattered with blood.\u003c/p\u003e\n\u003cp\u003eThere was one window in the room, but it was at least a foot above Elise’s head, so she could not see out it.\u003c/p\u003e\n\u003cp\u003eElise shivered as the guards removed the shackles and set her nettles and shirts down on the ground.\u003c/p\u003e\n\u003cp\u003e“May whatever has guarded you thus long be with you, my lady,” the last guard said before he closed the door.\u003c/p\u003e\n\u003cp\u003eElise shivered in the cool air and looked at her knitting. There was still a chance she could complete the last shirt. She would have to take the biggest gamble of her life and hope she could finish it before King Torgen finished her.\u003c/p\u003e\n\u003cp\u003eElise squared her shoulders and settled down to work, unearthing her knitting needles and the last of her nettles. She wouldn’t fail Arcainia, and she wouldn’t let her brothers suffer anymore.\u003c/p\u003e\n\u003cp\u003eChapter 12\u003c/p\u003e\n\u003cp\u003eElise worked as long she had light, and even after the last bit of sun left the open window, Elise knitted, blindly feeling the rows of loops and knots. For once she was grateful she was knitting nettles. They rewarded her with a sharp, stabbing sensation that bit into Elise’s fingers when she looped them correctly.\u003c/p\u003e\n\u003cp\u003eElise was so intent on her work that she almost missed the footsteps outside her window. She jumped when something slammed against the bars of the window.\u003c/p\u003e\n\u003cp\u003e“Elise?”\u003c/p\u003e\n\u003cp\u003eElise stood and ran to the window. “Rune?” the cell wasn’t wide enough for Elise to back up and see outside the window, but she would recognize that voice anywhere.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” Rune asked.\u003c/p\u003e\n\u003cp\u003e“Never mind me—what are you doing here? If the guards catch you, they’ll drag you before King Torgen,” Elise hissed.\u003c/p\u003e\n\u003cp\u003e“I’ve been climbing around the castle since I turned human. Security is tighter than I thought. I tried breaking into the dungeons, but there are too many guards,” Rune grunted as a scraping noise echoed in the cell.\u003c/p\u003e\n\u003cp\u003e“You can’t rip the bars out, Rune. They’re set in stone.”\u003c/p\u003e\n\u003cp\u003e“I’ve got to try. I can’t leave you here.” Rune said before he toppled from the window. His shadow covered the window again shortly after as he boosted himself back up into the window.\u003c/p\u003e\n\u003cp\u003e“Rune, it’s fine.”\u003c/p\u003e\n\u003cp\u003e“No, it’s not,” Rune said, sawing at the bars with a knife. “Brida spent the whole afternoon trying to pinpoint your location, but she couldn’t slip past security.”\u003c/p\u003e\n\u003cp\u003e“And you could?”\u003c/p\u003e\n\u003cp\u003eRune chuckled. “I’m not the heroic brother just because of my good looks,” he said. “Hold on. I’ll be back; I just need to find a pick-axe of some sort.”\u003c/p\u003e\n\u003cp\u003e“Wait. How many minutes until you turn back into a swan?” Elise asked.\u003c/p\u003e\n\u003cp\u003e“…”\u003c/p\u003e\n\u003cp\u003e“Not many, right?”\u003c/p\u003e\n\u003cp\u003e“I wasted too much time trying to get into the dungeon entrance. Don’t worry, I will get you out.”\u003c/p\u003e\n\u003cp\u003e“No, you won’t.”\u003c/p\u003e\n\u003cp\u003e“You can’t know that,” Rune argued.\u003c/p\u003e\n\u003cp\u003e“Rune,” Elise said, cutting him off. She swallowed in the silence and shut her eyes as she leaned against the wall. She heard a scraping noise, and looked up to see Rune stretch his arm down through the bars.\u003c/p\u003e\n\u003cp\u003eElise reached up and clasped his hand, squeezing it tightly. “I’m afraid,” she admitted.\u003c/p\u003e\n\u003cp\u003e“Swan or not, I won’t let you die, Elise,” Rune promised.\u003c/p\u003e\n\u003cp\u003eElise nodded. “Thank you,” she whispered.\u003c/p\u003e\n\u003cp\u003eElise held Rune’s hand even after all the blood drained from her arm. She clung to him like he was her lifeline.\u003c/p\u003e\n\u003cp\u003eAll too soon, Rune said, “I have to go.”\u003c/p\u003e\n\u003cp\u003eElise loosened her grasp on his hand.\u003c/p\u003e\n\u003cp\u003eRune, however, didn’t let go. “We won’t leave you, Elise. I won’t leave you.”\u003c/p\u003e\n\u003cp\u003e“I know,” Elise said.\u003c/p\u003e\n\u003cp\u003eRune squeezed her hand again before he slipped from the window, disappearing into the night.\u003c/p\u003e\n\u003cp\u003eElise brushed tears from her eyes, and she turned back to the last shirt. While Rune spoke to her, the moon had risen high in the sky, shedding just enough light for Elise to knit by.\u003c/p\u003e\n\u003cp\u003e“There’s no way I could sleep, so I may as well work,” Elise said, sitting down on the floor. “King Torgen is wrong. Goodness wins, and love always triumphs.”\u003c/p\u003e\n\u003cp\u003eDawn came. The red rays of rising sun leaked into the cell, giving Elise light to see by. Her knitting was no longer neat rows, but downright sloppy. The loops weren’t even, and some holes were too big, but Elise didn’t have time to worry.\u003c/p\u003e\n\u003cp\u003eNot long after the sun rose, the door to her cell swung open. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-65.html","bookId":1807,"creation":"Oct 5, 2019 9:51:56 PM","modification":"Oct 5, 2019 9:51:56 PM"}
