{"id":83558,"no":91,"title":"Page 91","content":"\u003cp\u003e“There’s more: Gabrielle’s belly has exploded,” Elise said.\u003c/p\u003e\n\u003cp\u003e“I thought she wasn’t due for three months?”\u003c/p\u003e\n\u003cp\u003e“She is, but according to her, their baby has the same fat head as his father and is going to be quite large. She fears she will have to be wheeled down the aisle,” Elise said as they entered the castle together.\u003c/p\u003e\n\u003cp\u003e“What does Steffen have to say of that?”\u003c/p\u003e\n\u003cp\u003e“Not much. Gabrielle has banned him from speaking of their baby in her presence. Apparently he has been hovering, and she grows tired of it. Last time she hefted herself into a saddle for a horse ride, Steffen suggested it wouldn’t be good for the baby.”\u003c/p\u003e\n\u003cp\u003e“What did she do?”\u003c/p\u003e\n\u003cp\u003e“She threw Puss at him.”\u003c/p\u003e\n\u003cp\u003eRune winced. “Ouch.”\u003c/p\u003e\n\u003cp\u003e“Indeed. But I don’t think he will question her activities again,” Elise said, a mischievous grin twitching across her lips.\u003c/p\u003e\n\u003cp\u003e“That’s probably—my word, what is that?” Rune asked, almost dropping his saddlebags again when they entered the portrait gallery. He stared at several giant monstrosities of art and embroidery. Hung on the walls were tapestries and life-sized paintings of Elise and Rune. Instead of being the typical portraits, each piece had Rune battling some kind of monster, usually wearing a gaudy set of armor or brandishing a shining sword, and Elise at his side, glowing and wielding magic like a top-notch enchantress.\u003c/p\u003e\n\u003cp\u003e“Oh, yes,” Elise frowned. “Steffen has decided since we are marrying, together we can be the perfect public relations image for our subjects to rally under. He means to portray us as some kind of heroic duo with you as the monster killer and me as a magic user. Since I killed Clotilde, our ‘image’ has reached new heights of admiration from the commoners. Steffen wants to make the most of our marriage.”\u003c/p\u003e\n\u003cp\u003e“It’s fitting,” Rune said, looking at the various pieces of art. “He’s gone all out, hasn’t he?”\u003c/p\u003e\n\u003cp\u003e“It just about killed him that we had to downplay my magic before the Shimmer Conflict,” Elise wryly said.\u003c/p\u003e\n\u003cp\u003eThis time Rune did drop his saddlebags again and pulled Elise into a close embrace. “It was to keep you safe.”\u003c/p\u003e\n\u003cp\u003e“It’s no longer something to worry about,” Elise said, listening to the steady thud of Rune’s heart.\u003c/p\u003e\n\u003cp\u003e“I cannot wait for our future together,” Rune said, entwining his hands with Elise’s before kissing her. “I love you. I missed you,” Rune said, resting his forehead against hers.\u003c/p\u003e\n\u003cp\u003e“I love you, too.”\u003c/p\u003e\n\u003cp\u003e“We’re going to live happily ever after,” Rune said.\u003c/p\u003e\n\u003cp\u003e“As the Monster Killer and Magic Tamer.”\u003c/p\u003e\n\u003cp\u003e“Sometimes I think our epic combination is the only reason Steffen agreed to our marriage,” Rune said.\u003c/p\u003e\n\u003cp\u003eElise chuckled and picked up one of Rune’s saddlebags. “It doesn’t matter what Steffen thinks. It’s what we feel that makes the difference.”\u003c/p\u003e\n\u003cp\u003eRune gathered the rest of his saddle bags. “Two months. I cannot wait,” he said, entangling his free hand in Elise’s wild curls before leaning in to kiss her.\u003c/p\u003e\n\u003cp\u003eThe kiss went on for several moments until a door to the portrait gallery opened.\u003c/p\u003e\n\u003cp\u003e“Rune, you’re home—hey! You get your paws off my sister,” Nick shouted from the far end of the room.\u003c/p\u003e\n\u003cp\u003eRune ended the kiss, but leaned his forehead against Elise’s and sighed. “Two months,” he repeated in a long-suffering tone.\u003c/p\u003e\n\u003cp\u003eElise giggled.\u003c/p\u003e\n\u003cp\u003e“What are you doing? Stop giggling. I said, what are you doing? Mikk! The love-birds are at it again; we’ve got to stop Rune!” Nick said before he ran at Elise and Rune like a mad bull.\u003c/p\u003e\n\u003cp\u003e“I would like to see you try,” Rune said, bracing for impact.\u003c/p\u003e\n\u003cp\u003e“No, let’s run,” Elise said, grabbing Rune by the arm and pulling him along.\u003c/p\u003e\n\u003cp\u003e“Stop! I’ll tell Father you’re eloping,” Nick said as he tore after Rune and Elise.\u003c/p\u003e\n\u003cp\u003eRune stopped running. “That’s a great idea,” he said, his face serious.\u003c/p\u003e\n\u003cp\u003e“What? No! Mikk!” Nick roared.\u003c/p\u003e\n\u003cp\u003eElise almost tripped, she was laughing so hard as she and Rune fled the portrait gallery and ran.\u003c/p\u003e\n\u003cp\u003eMarrying her personal hero was a happily ever after Elise had never dared to hope for. Being fully embraced by the royal family—for now she really would be her foster brothers’ sister—was a dream come true.\u003c/p\u003e\n\u003cp\u003eThere was a chance a creature like Clotilde would surface again, but with her fierce husband and her wonderful family, Elise thought there was nothing they couldn’t handle. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-91.html","bookId":1807,"creation":"Oct 5, 2019 4:52:55 PM","modification":"Oct 5, 2019 4:52:55 PM"}
