{"id":100073,"no":27,"title":"Page 27","content":"\u003cp\u003eGary Leger groaned as he rolled over on the scratchy ground, prickly bushes picking at him from every angle. He managed to roll to a sitting position, smelling blueberries all around him, but it took him some time to figure out where he was. Images of sprites and elfs, dragons and bandy-legged dwarfs, danced all about his consciousness, just out of his reach.\u003c/p\u003e\n\u003cp\u003e\"So it was just a dream,\" he remarked, trying to hold on to at least a part of the grand adventure. But like any dream, the images were fleeting at best, and entire sections were missing or out of place. He remembered the general details, though, something about a spear and a horrendous dragon. And wearing armor - Gary distinctly remembered the sensation of wearing the armor.\u003c/p\u003e\n\u003cp\u003eGary looked down to his side, sawThe Hobbit lying on the ground next to him, and knew what had inspired his evening adventure.\u003c/p\u003e\n\u003cp\u003eHe realized then that he had missed supper; he worried then how many hours (days?) had passed. Gary blinked at that thought and looked around him, studying the landscape beneath the light of the rising moon. Yes, he was in the woods out back, not in Tir na n\u0027Og.\u003c/p\u003e\n\u003cp\u003e\"Tir na n\u0027Og?\" he mumbled curiously. How did he know that name?\u003c/p\u003e\n\u003cp\u003eConfused beyond any hopes of sorting it all out, Gary scooped up his book and struggled to his feet. He started down the path to the fire road, but changed direction and went across the blueberry patch instead, to the ridge overlooking...\u003c/p\u003e\n\u003cp\u003eOverlooking what?\u003c/p\u003e\n\u003cp\u003eGary crept up, alternating his gaze from the widening landscape beneath him to the distant hills.\u003c/p\u003e\n\u003cp\u003eHills, he thought, not mountains, and dotted with the lights of many houses.\u003c/p\u003e\n\u003cp\u003eStill, Gary held his breath as he came to the lip of the small hill, and was then sincerely relieved - and also, somehow sincerely disappointed.\u003c/p\u003e\n\u003cp\u003eSoutheast Elementary School.\u003c/p\u003e\n\u003cp\u003e\"Some dream,\" he mumbled to himself, sprinting back as fast as he dared to go in the dim light towards the fire road. More sights, familiar sights, greeted him as he rushed along: the cemetery fence; the houses at the end of his parents\u0027 street; and then his own Jeep, sitting under the streetlight in front of the hedgerow.\u003c/p\u003e\n\u003cp\u003e\"Where the hell have you been?\" his father asked him when he burst through the kitchen door. The remnants of supper sat on the stove and counter. \"You\u0027ll have to reheat it.\"\u003c/p\u003e\n\u003cp\u003e\"Reheat it?\" Gary muttered curiously, an image of a spear flashing through his mind, and white flames licking at him around the edges of a fine shield.\u003c/p\u003e\n\u003cp\u003e\"Yeah, it got cold. You\u0027ll have to heat it up again,\" his father said sarcastically.\u003c/p\u003e\n\u003cp\u003e\"Hey, I cooked it once,\" his mother, playing solitaire at the dining room table, added sternly. \"If you can\u0027t be in on time for...\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t believe this,\" Gary interrupted. \"I fell asleep down in the woods.\"\u003c/p\u003e\n\u003cp\u003e\"Fell asleep?\" his father asked with a snicker.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re working too hard,\" his mother piped in, suddenly the concerned hen once more. She shook her head and gritted her teeth. \"I hate that place.\"\u003c/p\u003e\n\u003cp\u003eIt all seemed so very commonplace to Gary, so very predictable - say the seventeen words, Mom. He hadn\u0027t been gone a very long time; he was amazed that he had encapsulated so wild an adventure in so short a nap.\u003c/p\u003e\n\u003cp\u003eHe grabbed a quick bite and went up to bed, announcing that he needed the sleep, and also privately hoping to recapture some of that strange dream. Honestly Gary didn\u0027t know how he was going to drag himself out of bed the next morning, how he was going to go back to the mundane realities of life around him, back to the grind.\u003c/p\u003e\n\u003cp\u003e\"Well,\" he told himself, slipping out of his clothes and falling onto his bed, \"at least I\u0027ll have something new to think about while I\u0027m loading those chunks into the grinder.\"\u003c/p\u003e\n\u003cp\u003eAlmost as an afterthought, Gary took upThe Hobbit, opening it to mark the spot where he had left off.\u003c/p\u003e\n\u003cp\u003eHis eyes nearly popped from their sockets.\u003c/p\u003e\n\u003cp\u003eFor Gary Leger looked upon not the expected typeset of a paperback, but upon the strange and flowing script of Mickey McMickey. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-woods-out-back-spearwielder-s-tale-1/page-27.html","bookId":2184,"creation":"Oct 5, 2019 6:49:57 PM","modification":"Oct 5, 2019 6:49:57 PM"}
