{"id":73639,"no":1,"title":"Page 1","content":"\u003cp\u003eONE\u003c/p\u003e\n\u003cp\u003eThe P-38 WWII Nazi handgun looks comical lying on the breakfast table next to a bowl of oatmeal. It’s like some weird steampunk utensil anachronism. But if you look very closely just above the handle you can see the tiny stamped swastika and the eagle perched on top, which is real as hell.\u003c/p\u003e\n\u003cp\u003eI take a photo of my place setting with my iPhone, thinking it could be both evidence and modern art.\u003c/p\u003e\n\u003cp\u003eThen I laugh my ass off looking at it on the mini screen, because modern art is such bullshit.\u003c/p\u003e\n\u003cp\u003eI mean, a bowl of oatmeal and a P-38 set next to it like a spoon—that arrangement photographed can be modern art, right?\u003c/p\u003e\n\u003cp\u003eBullshit.\u003c/p\u003e\n\u003cp\u003eBut funny too.\u003c/p\u003e\n\u003cp\u003eI’ve seen worse on display at real art museums, like an all-white canvas with a single red pinstripe through it.\u003c/p\u003e\n\u003cp\u003eI once told Herr1 Silverman about that red-line painting, saying I could easily do it myself, and he said in this super-confident voice, “But you didn’t.”\u003c/p\u003e\n\u003cp\u003eI have to admit it was a cool, artsy retort because it was true.\u003c/p\u003e\n\u003cp\u003eShut me the hell up.\u003c/p\u003e\n\u003cp\u003eSo here I am making modern art before I die.\u003c/p\u003e\n\u003cp\u003eMaybe they’ll hang my iPhone in the Philadelphia Museum of Art with the oatmeal Nazi gun pic displayed.\u003c/p\u003e\n\u003cp\u003eThey can call it Breakfast of a Teenage Killer or something ridiculous and shocking like that.\u003c/p\u003e\n\u003cp\u003eThe art and news worlds will love it, I bet.\u003c/p\u003e\n\u003cp\u003eThey’ll make my modern artwork instantly famous.\u003c/p\u003e\n\u003cp\u003eEspecially after I actually kill Asher Beal and off myself.2\u003c/p\u003e\n\u003cp\u003eArt value always goes up once the artist’s associated with fucked-up things such as cutting off his own ear like van Gogh, or marrying his teenage cousin like Poe, or having his minions murder a celebrity like Manson, or shooting his postsuicide ashes out of a huge cannon like Hunter S. Thompson, or being dressed up as a little girl by his mother like Hemingway, or wearing a dress made of raw meat like Lady Gaga, or having unspeakable things done to him so he kills a classmate and puts a bullet in his own head like I will do later today.\u003c/p\u003e\n\u003cp\u003eMy murder-suicide will make Breakfast of a Teenage Killer3 a priceless masterpiece because people want artists to be unlike them in every way. If you are boring, nice, and normal—like I used to be—you will definitely fail your high school art class and be a subpar artist for life.\u003c/p\u003e\n\u003cp\u003eWorthless to the masses.\u003c/p\u003e\n\u003cp\u003eForgotten.\u003c/p\u003e\n\u003cp\u003eEveryone knows that.\u003c/p\u003e\n\u003cp\u003eEveryone.\u003c/p\u003e\n\u003cp\u003eSo the key is doing something that sets you apart forever in the minds of regular people.\u003c/p\u003e\n\u003cp\u003eSomething that matters.\u003c/p\u003e\n\u003cp\u003eTWO\u003c/p\u003e\n\u003cp\u003eI wrap up the birthday presents in this pink wrapping paper I find in the hall closet.\u003c/p\u003e\n\u003cp\u003eI wasn’t planning on wrapping the presents, but I feel like maybe I should attempt to make the day feel more official, more festive.\u003c/p\u003e\n\u003cp\u003eI’m not afraid of people thinking I’m gay, because I really don’t care what anyone thinks at this point, and so I don’t mind the pink paper, although I would have preferred a different color. Maybe black would have been more appropriate given what’s about to transpire.\u003c/p\u003e\n\u003cp\u003eIt makes me feel really little-kid-on-Christmas-morning good to wrap up the gifts.\u003c/p\u003e\n\u003cp\u003eFeels right somehow.\u003c/p\u003e\n\u003cp\u003eI make sure the safety is on and then put the loaded P-38 in an old cedar cigar box I kept to remember my dad, because he used to enjoy smoking illegal Cuban cigars. I stuff a bunch of old socks in to keep my “heater” from clanking around inside and maybe blasting a bullet into my ass. Then I wrap the box in pink paper too, so that no one will suspect I have a gun in school.\u003c/p\u003e\n\u003cp\u003eEven if—for whatever reason—my principal starts randomly searching backpacks today, I can say it’s a present for a friend.\u003c/p\u003e\n\u003cp\u003eThe pink wrapping paper will throw them off, camouflage the danger, and only a real asshole would make me open up someone else’s perfectly wrapped gift.\u003c/p\u003e\n\u003cp\u003eNo one has ever searched my backpack at school, but I don’t want to take any chances.\u003c/p\u003e\n\u003cp\u003eMaybe the P-38 will be a present for me when I unwrap it and shoot Asher Beal.\u003c/p\u003e\n\u003cp\u003eThat’ll probably be the only present I receive today.\u003c/p\u003e\n\u003cp\u003eIn addition to the P-38, there are four gifts, one for each of my friends.\u003c/p\u003e\n\u003cp\u003eI want to say good-bye to them properly.\u003c/p\u003e\n\u003cp\u003eI want to give them each something to remember me by. To let them know I really cared about them and I’m sorry I couldn’t be more than I was—that I couldn’t stick around—and that what’s going to happen today isn’t their fault.\u003c/p\u003e\n\u003cp\u003eI don’t want them to stress over what I’m about to do or feel depressed afterward.\u003c/p\u003e\n\u003cp\u003eTHREE\u003c/p\u003e\n\u003cp\u003eMy Holocaust class teacher, Herr Silverman, never rolls up his sleeves like the other male teachers at my high school, who all arrive each morning with their freshly ironed shirts rolled to the elbow. Nor does Herr Silverman ever wear the faculty polo shirt on Fridays. Even in the warmer months he keeps his arms covered, and I’ve been wondering why for a long time now.\u003c/p\u003e\n\u003cp\u003eI think about it constantly.\u003c/p\u003e\n\u003cp\u003eIt’s maybe the greatest mystery of my life.\u003c/p\u003e\n\u003cp\u003ePerhaps he has really hairy arms, I’ve often thought. Or prison tattoos. Or a birthmark. Or he was obscenely burned in a fire. Or maybe someone spilled acid on him during a high school science experiment. Or he was once a heroin addict and his wrists are therefore scarred with a gazillion needle-track marks. Maybe he has a blood circulation disorder that keeps him perpetually cold.\u003c/p\u003e\n\u003cp\u003eBut I suspect the truth is more serious than that—like maybe he tried to kill himself once and there are razor blade scars.\u003c/p\u003e\n\u003cp\u003eMaybe.\u003c/p\u003e\n\u003cp\u003eIt’s hard for me to believe that Herr Silverman once attempted suicide, because he’s so together now; he’s really the most admirable adult I know.\u003c/p\u003e\n\u003cp\u003eSometimes I actually hope that he did once feel empty and hopeless and helpless enough to slash his wrists to the bone, because if he felt that horrible and survived to be such a fantastic grown-up, then maybe there’s hope for me.4\u003c/p\u003e\n\u003cp\u003eWhenever I have some free time I wonder about what Herr Silverman might be hiding, and I try to unlock his mystery in my mind, creating all sorts of suicide-inducing scenarios, inventing his past.\u003c/p\u003e\n\u003cp\u003eSome days I have his parents beat him with clothes hangers and starve him.\u003c/p\u003e\n\u003cp\u003eOther days his classmates throw him to the ground and kick him until he’s wet with blood, at which point they take turns pissing on his head.\u003c/p\u003e\n\u003cp\u003eSometimes he suffers from unrequited love and cries every single night alone in his closet clutching a pillow to his chest.\u003c/p\u003e\n\u003cp\u003eOther times he’s abducted by a sadistic psychopath who waterboards him nightly—Guantanamo Bay–style—and deprives him of drinking water during the day while he is forced to sit in a Clockwork Orange–type room full of strobe lights, Beethoven symphonies, and horrific images projected on a huge screen.\u003c/p\u003e\n\u003cp\u003eI don’t think anyone else has noticed Herr Silverman’s constantly clothed forearms, or if they have, no one has said anything about it in class. I haven’t overheard anything in the hallways.\u003c/p\u003e\n\u003cp\u003eI wonder if I’m really the only one who’s noticed, and if so, what does that say about me?\u003c/p\u003e\n\u003cp\u003eDoes that make me weird?\u003c/p\u003e\n\u003cp\u003e(Or weirder than I already am?)\u003c/p\u003e\n\u003cp\u003eOr just observant?\u003c/p\u003e\n\u003cp\u003eSo many times I’ve thought about asking Herr Silverman why he never rolls up his sleeves, but I don’t for some reason.5\u003c/p\u003e\n\u003cp\u003eSome days he encourages me to write—other days he says I’m “gifted” and then smiles like he’s being truthful, and I’ll come close to asking him the question about his never-exposed forearms, but I never do, and that seems odd—utterly ridiculous, considering how badly I want to ask and how much the answer could save me.\u003c/p\u003e\n\u003cp\u003eAs if his response will be sacred or life-altering or something and I’m saving it for later—like an emotional antibiotic, or a depression lifeboat.\u003c/p\u003e\n\u003cp\u003eSometimes I really believe that.\u003c/p\u003e\n\u003cp\u003eBut why?\u003c/p\u003e\n\u003cp\u003eMaybe my brain’s just fucked.\u003c/p\u003e\n\u003cp\u003eOr maybe I’m terrified that I might be wrong about him and I’m just making things up in my head—that there’s nothing under those shirtsleeves at all, and he just likes the look of covered forearms.\u003c/p\u003e\n\u003cp\u003eIt’s a fashion statement.\u003c/p\u003e\n\u003cp\u003eHe’s more like Linda6 than I am.\u003c/p\u003e\n\u003cp\u003eEnd of story.\u003c/p\u003e\n\u003cp\u003eI worry Herr Silverman will laugh at me when I ask about his covered forearms.\u003c/p\u003e\n\u003cp\u003eHe’ll make me feel stupid for wondering—hoping—all this time.\u003c/p\u003e\n\u003cp\u003eThat he’ll call me a freak.\u003c/p\u003e\n\u003cp\u003eThat he’ll think I’m a pervert for thinking about it so much.\u003c/p\u003e\n\u003cp\u003eThat he’ll pull an ugly, disgusted face that’ll make me feel like he and I could never ever be similar at all, and I’m therefore delusional.\u003c/p\u003e\n\u003cp\u003eThat would kill me, I think.\u003c/p\u003e\n\u003cp\u003eDo my spirit in for good.\u003c/p\u003e\n\u003cp\u003eIt really would.\u003c/p\u003e\n\u003cp\u003eAnd so I’ve come to worry that my not asking is simply the product of my boundless cowardice.\u003c/p\u003e\n\u003cp\u003eAs I sit there alone at the breakfast table wondering if Linda will remember today’s significance, knowing deep down that she’s simply not going to call—I decide to instead wonder if the Nazi officer who carried my P-38 in WWII ever dreamed his sidearm would end up as modern art, across the Atlantic Ocean, in New Jersey, seventy-some years later, loaded and ready to kill the closest modern-day equivalent of a Nazi that we have at my high school?\u003c/p\u003e\n\u003cp\u003eThe German who originally owned the P-38—what was his name?\u003c/p\u003e\n\u003cp\u003eWas he one of the nice Germans Herr Silverman tells us about? The ones who didn’t hate Jews or gays or blacks or anyone really but just had the misfortune of being born in Germany during a really fucked time.\u003c/p\u003e\n\u003cp\u003eWas he anything like me?\u003c/p\u003e\n\u003cp\u003eFOUR\u003c/p\u003e\n\u003cp\u003eI have this signature really long dirty-blond hair that hangs over my eyes and past my shoulders. I’ve been growing it for years, ever since the government came after my dad and he fled the country.7\u003c/p\u003e\n\u003cp\u003eAnd my long locks piss Linda off something awful, especially since she’s into contemporary fashion. She says I look like a “grunge-rock stoner”8 and back when she was still around caring about me, Linda actually made me submit to a drug test—pissing into a cup—which I passed.9\u003c/p\u003e\n\u003cp\u003eI didn’t get Linda a good-bye present, and I start to feel guilty about that, so I cut off all my hair with the scissors in the kitchen—the ones we usually use to cut food.\u003c/p\u003e\n\u003cp\u003eI cut it all down to the scalp in a wild orgy of arms and hands and silver blades.\u003c/p\u003e\n\u003cp\u003eThen I mash all of my hair into a big ball and wrap it in pink paper.\u003c/p\u003e\n\u003cp\u003eI’m laughing the whole time.\u003c/p\u003e\n\u003cp\u003eI cut out a little square of pink paper and write on the back.\u003c/p\u003e\n\u003cp\u003eDear Delilah,\u003c/p\u003e\n\u003cp\u003eHere you go.\u003c/p\u003e\n\u003cp\u003eYou got your wish.\u003c/p\u003e\n\u003cp\u003eCongratulations!\u003c/p\u003e\n\u003cp\u003eLove, Samson\u003c/p\u003e\n\u003cp\u003eI fold the square in half and tape it to the gift, which looks quite odd—almost like I tried to wrap a pocket of air.\u003c/p\u003e\n\u003cp\u003eThen I stick the present in the refrigerator, which seems hilarious.\u003c/p\u003e\n\u003cp\u003eLinda will be looking for a chilled bottle of Riesling to calm her jangled nerves after getting the news about her son ridding the world of Asher Beal and Leonard Peacock too.\u003c/p\u003e\n\u003cp\u003eShe’ll find the pink wrap job.\u003c/p\u003e\n\u003cp\u003eLinda will wonder about my allusion to Samson and Delilah when she reads the card, because that was the title of my father’s failed sophomore record, but will get the joke just as soon as she opens her present.\u003c/p\u003e\n\u003cp\u003eI imagine her clutching her chest, faking the tears, playing the victim, and being all dramatic.\u003c/p\u003e\n\u003cp\u003eJean-Luc will really have his professionally manicured French hands full.\u003c/p\u003e\n\u003cp\u003eNo sex for him maybe, or maybe not.\u003c/p\u003e\n\u003cp\u003eMaybe their affair will blossom without me around to psychologically anchor poor Linda to reality and maternal duties. \u003c/p\u003e","sourceLink":"https://allnovel.net/forgive-me-leonard-peacock/page-1.html","bookId":2705,"creation":"Oct 5, 2019 10:28:33 AM","modification":"Oct 5, 2019 10:28:33 AM"}
