{"id":73640,"no":2,"title":"Page 2","content":"\u003cp\u003eMaybe once I’m gone, she’ll float away to France like a shiny new silver little-kid birthday balloon.\u003c/p\u003e\n\u003cp\u003eShe’ll probably even lose a dress size without me around to trigger her “stress eating.”\u003c/p\u003e\n\u003cp\u003eMaybe Linda won’t return to our house ever again.\u003c/p\u003e\n\u003cp\u003eMaybe she and Jean-Luc will go to the fashion capital of the world, the City of Light, auw-hauh-hauw!, and screw like bunnies happily ever after.\u003c/p\u003e\n\u003cp\u003eShe’ll sell everything, and the new homeowners will find my hair in the refrigerator and be like What the…?\u003c/p\u003e\n\u003cp\u003eMy hair’ll just end up in the trash and that will be that.\u003c/p\u003e\n\u003cp\u003eGone.\u003c/p\u003e\n\u003cp\u003eForgotten.\u003c/p\u003e\n\u003cp\u003eRIP, hair.\u003c/p\u003e\n\u003cp\u003eOr maybe they’ll donate my locks to one of those wig-making places that help out kids with cancer. Like my hair would get a second shot at life with a little innocent-hearted bald chemo girl maybe.\u003c/p\u003e\n\u003cp\u003eI’d like that.\u003c/p\u003e\n\u003cp\u003eI really would.\u003c/p\u003e\n\u003cp\u003eMy hair deserves it.\u003c/p\u003e\n\u003cp\u003eSo I’m really hoping for that cancer-kid-helping outcome if Linda goes to France without coming home first, or maybe even Linda will donate my hair.\u003c/p\u003e\n\u003cp\u003eAnything’s possible, I guess.\u003c/p\u003e\n\u003cp\u003eI stare at the mirror over the kitchen sink.10\u003c/p\u003e\n\u003cp\u003eThe no-hair guy staring back at me looks so strange now.\u003c/p\u003e\n\u003cp\u003eHe’s like a different person with all uneven patches of hair on his scalp.\u003c/p\u003e\n\u003cp\u003eHe looks thinner.\u003c/p\u003e\n\u003cp\u003eI can see his cheekbones sticking out where his blond curtains used to hang.\u003c/p\u003e\n\u003cp\u003eHow long has this guy been hiding under my hair?\u003c/p\u003e\n\u003cp\u003eI don’t like him.\u003c/p\u003e\n\u003cp\u003e“I’m going to kill you later today,” I say to that guy in the mirror, and he just smiles back at me like he can’t wait.\u003c/p\u003e\n\u003cp\u003e“Promise?” I hear someone say, which freaks me out, because my lips didn’t move.\u003c/p\u003e\n\u003cp\u003eI mean—it wasn’t me who said, “Promise?”\u003c/p\u003e\n\u003cp\u003eIt’s like there’s a voice trapped inside the glass.\u003c/p\u003e\n\u003cp\u003eSo I stop looking in the mirror.\u003c/p\u003e\n\u003cp\u003eJust for good measure, I smash that mirror with a coffee mug, because I don’t want the mirror me to speak ever again.\u003c/p\u003e\n\u003cp\u003eShards rain down into the sink and then a million little mes look up like so many tiny minnows.\u003c/p\u003e\n\u003cp\u003eFIVE\u003c/p\u003e\n\u003cp\u003eI’m already late for school, but I need to stop at my next-door-neighbor Walt’s11 so that I can give him his present.\u003c/p\u003e\n\u003cp\u003eToday, I knock once and let myself into Walt’s house because he has to walk slowly with one of those gray-piped four-footed walkers that has dirty tennis balls attached to protect his hardwood floors. It’s difficult for him to get around, especially with bad lungs, so he just gave me a key and said, “Come in whenever you feel like it. And come often!”\u003c/p\u003e\n\u003cp\u003eHe’s been smoking since he was twelve and I’ve been helping him buy his Pall Mall Reds on the Internet to save money. The first time, I found this phenomenal deal: two hundred cigarettes for nineteen dollars, and he proclaimed me a hero right then and there. He doesn’t even have the Internet in his home, let alone a computer. So it was like I performed a miracle, getting cigarettes that cheap delivered to his doorstep, because he was paying a hell of a lot more at the local convenience store. I’ve been bringing over my laptop—our Internet signal reaches his living room—and we’ve been searching for the best deals every week. He’s always trying to give me half of what he saves, but I never take his money.12\u003c/p\u003e\n\u003cp\u003eIt’s funny because he’s rich,13 but always keen on finding a bargain. Maybe that’s why he’s rich. I don’t know.\u003c/p\u003e\n\u003cp\u003eA “helper” comes and takes care of him most days, but not until 9:30 AM, so it’s always just Walt and me before school.\u003c/p\u003e\n\u003cp\u003e“Walt?” I say, as I walk through the smoky hallway, under the crystal chandelier, toward the smoky living room where he usually sleeps surrounded by overflowing ashtrays and empty bottles. “Walt?”\u003c/p\u003e\n\u003cp\u003eI find him in his La-Z-Boy, smoking a Pall Mall Red, eyes bloodshot from drinking scotch last night.\u003c/p\u003e\n\u003cp\u003eHis robe isn’t shut, so I can see his naked, hairless chest. It’s the pinkish-red sunset color of conch-shell innards.\u003c/p\u003e\n\u003cp\u003eHe looks at me with his best black-and-white movie-star face14 and says, “You despise me, don’t you?”\u003c/p\u003e\n\u003cp\u003eIt’s a line from Casablanca, which we’ve watched together a million times.\u003c/p\u003e\n\u003cp\u003eStanding next to his chair with my backpack between my feet, I answer with Rick’s follow-up line in the film, saying, “If I gave you any thought I probably would.”\u003c/p\u003e\n\u003cp\u003eThen I follow it with a line from The Big Sleep, saying, “My, my, my. Such a lot of guns around town and so few brains,” which feels pretty cool and authentic considering I have the Nazi P-38 in my backpack.\u003c/p\u003e\n\u003cp\u003eWalt counters with a line from Key Largo, saying, “You were right. When your head says one thing and your whole life says another, your head always loses.”\u003c/p\u003e\n\u003cp\u003eI smile even bigger because whenever we trade Bogart-related quotes, our conversations seem to make a weird sort of sense that is unpredictable and almost poetic.\u003c/p\u003e\n\u003cp\u003eI go with a Bogart quote I looked up on the Internet, “There never seems to be any trouble brewing around a bar until a woman puts that high heel over the brass rail. Don’t ask me why, but somehow women at bars seem to create trouble among men.”\u003c/p\u003e\n\u003cp\u003eHe goes back to the Casablanca well and says, “Where were you last night?”\u003c/p\u003e\n\u003cp\u003eSo I finish the quote, playing Rick and say, “That’s so long ago, I don’t remember.”\u003c/p\u003e\n\u003cp\u003eHe says, “Will I see you tonight?”\u003c/p\u003e\n\u003cp\u003eIt sort of freaks me out, because no one will ever see me again after today, so the question seems weighty. I remind myself that he couldn’t possibly know my plan; he’s just playing the dumb Bogart game we always play. He’s clueless.\u003c/p\u003e\n\u003cp\u003eI become Rick again and finish the quote: “I never make plans that far ahead.”\u003c/p\u003e\n\u003cp\u003eWalt smiles, blows smoke at the ceiling, and says, “Louis, I think this is the beginning of a beautiful friendship.”\u003c/p\u003e\n\u003cp\u003eI sit down on his couch and end the game the way we always do by saying, “Here’s looking at you, kid.”\u003c/p\u003e\n\u003cp\u003e“Why aren’t you in school learning?” Walt says as the flame from his Zippo lights up his face and another cigarette sparks to life. But he doesn’t really care. I skip school all the time just to watch old Bogart films with him. He loves it when I skip school.\u003c/p\u003e\n\u003cp\u003eHe starts coughing and you can hear the terrible tobacco phlegm rattling.\u003c/p\u003e\n\u003cp\u003eA two-pack-a-day sixty-year-habit smoker’s cough.\u003c/p\u003e\n\u003cp\u003eFoul.\u003c/p\u003e\n\u003cp\u003eI just stare at Walt for a long time, waiting for him to wipe his hand on his robe and catch his breath.\u003c/p\u003e\n\u003cp\u003eI wish he were healthier, but it’s hard to imagine him without a cigarette in his hand. Like I bet even in his high school yearbook pictures he was smoking. That’s just who he is. Like Bogart too.\u003c/p\u003e\n\u003cp\u003eMan, I’m going to miss Walt so much. Watching old smoky Bogart movies with him is one of the few things I’ll truly miss. It was always the highlight of my week.\u003c/p\u003e\n\u003cp\u003eWalt says, “You okay, Leonard? You don’t look well.”\u003c/p\u003e\n\u003cp\u003eI shake off the weirdness, wipe my eyes with my sleeve, and say, “Yeah, I’m fine.”\u003c/p\u003e\n\u003cp\u003eHe says, “You got all your hair tucked up into that fedora along with the tops of your ears?”15\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003eI don’t want to tell him I cut off all my hair for some reason, maybe because Walt’s one of my best friends—he really cares about me, I swear to god—and he’d know something was wrong if he saw my fucked-up haircut. He’d get upset, and I want to exit on a good note—I want this to be a happy good-bye, something he can remember and actually feel good about after I’m gone.\u003c/p\u003e\n\u003cp\u003e“Bought you a present,” I say, and then pull the turtle-looking wrap job from the top of my backpack.\u003c/p\u003e\n\u003cp\u003eHe says, “It’s not my birthday, you know.”\u003c/p\u003e\n\u003cp\u003eI hope he guesses that it’s mine—or that he might figure it out, deduce it, so I wait a second as he fingers the present and tries to mentally guess what the hell it might be.\u003c/p\u003e\n\u003cp\u003eHe looks so happy to get a present.\u003c/p\u003e\n\u003cp\u003eI kind of promise myself that I won’t kill Asher Beal, nor will I off myself, if only Walt just says “happy birthday” to me one time, as silly and trivial as that seems.\u003c/p\u003e\n\u003cp\u003eHe doesn’t, and that makes me sad, even though I probably never even told him when my birthday was and I know he would definitely say “happy birthday” if I had.\u003c/p\u003e\n\u003cp\u003eBut I really want him to say “happy birthday” to me without any prompting, and when he doesn’t, I get to feeling hollow as a dry-docked boat or something.\u003c/p\u003e\n\u003cp\u003e“Why do I get pink paper? Do you think I’m a faggot?” he says, and then starts laughing really hard and coughing again.\u003c/p\u003e\n\u003cp\u003eI say, “It’s the twenty-first century. Don’t be such a homophobe,” but I’m not really mad at him.\u003c/p\u003e\n\u003cp\u003eWalt’s so old that you can’t hold his bigotry against him, because for almost all his life it was okay for him to say “faggot” among friends, and then suddenly it wasn’t.\u003c/p\u003e\n\u003cp\u003eHe also says things like nigger and kike and Polack and chink and light in the loafers and sand nigger and slant and spade and spook and camel jockey and smokes and porch monkey and just about a trillion other awful slurs.\u003c/p\u003e\n\u003cp\u003eI hate bigotry, but I also love Walt.\u003c/p\u003e\n\u003cp\u003eIt’s like Herr Silverman teaches us about the Nazis. Maybe Walt was just unlucky being born at a time when everyone was prejudiced against homosexuals and minorities, and that’s just the way it was for his generation. I don’t know.\u003c/p\u003e\n\u003cp\u003eI’m starting to get sad about all that, so I change the subject by pointing at his present and saying, “Well, aren’t you going to open it?”\u003c/p\u003e\n\u003cp\u003eHe nods once like a little kid and then tears into the pink paper with his yellow shaky fingers. Halfway in he says, “I think I know what this is!”\u003c/p\u003e\n\u003cp\u003eWhen he has the Bogart hat unwrapped, he says, “Hot digitty dog!” all corny and nestles the hat down on his white hair.\u003c/p\u003e\n\u003cp\u003eIt’s a perfect fit just like I knew it would be, because I measured his head once when he was passed out, drunk.\u003c/p\u003e\n\u003cp\u003eHe composes his face, gets all black-and-white-movie-star-looking, and says, “I got a job to do too. Where I’m going you can’t follow. What I’ve got to do, you can’t be any part of. Leonard, I’m no good at being noble but it doesn’t take much to see that the problems of three little people don’t amount to a hill of beans in this crazy world. Someday you’ll understand that.”\u003c/p\u003e\n\u003cp\u003eI smile because he switched my name in for Ilsa’s. He does that sometimes when doing lines from Casablanca.16\u003c/p\u003e\n\u003cp\u003eHe smiles back real nice and says, “Wow. My very own Bogart hat. I love it!”\u003c/p\u003e\n\u003cp\u003eAnd then I just start lying and can’t stop myself no matter how hard I try.\u003c/p\u003e\n\u003cp\u003eI don’t know why I do it.\u003c/p\u003e\n\u003cp\u003eMaybe to keep myself from crying, because I can feel the tears coming on strong—like there’s a thunderstorm in my skull that’s about to break.\u003c/p\u003e\n\u003cp\u003eSo I tell him I got the hat off the Internet on a site that auctions old movie props. All proceeds go toward curing smoker’s cough and throat cancer, which killed good old unkillable Humphrey Bogart. I say the hat Walt’s wearing right at this very moment was the same hat Humphrey Bogart wore while playing Sam Spade in The Maltese Falcon.\u003c/p\u003e\n\u003cp\u003eHis eyes open really wide, and then Walt gets this sad look on his face, like he knows I’m lying when I don’t have to—like he loves the hat even if it’s not a movie prop, even if I found it on the street or something, and I know that too, that I don’t have to make shit up because what we have as friends is real and true already—but I just keep telling mistruths and he doesn’t want to call me on it; he doesn’t want to make me feel shameful and fuck up the good moment that is happening. \u003c/p\u003e","sourceLink":"https://allnovel.net/forgive-me-leonard-peacock/page-2.html","bookId":2705,"creation":"Oct 5, 2019 10:28:33 AM","modification":"Oct 5, 2019 10:28:33 AM"}
