{"id":39476,"no":29,"title":"CHAPTER XXIX SANDY’S TRAIL","content":"Wearisome though his vigil was, Sandy made the best he could of it by going over all the events that had happened.\n\u003cbr\u003e \n\u003cbr\u003e With his chums he had become friendly with Jeff at the newly opened municipal airport. Jeff had flown them to the old estate, pretended that his motor died, simulated a forced landing, then explained it all in a way that looked sincere enough at the time—but now!——\n\u003cbr\u003e \n\u003cbr\u003e Jeff had been the one to accompany Larry to the wreck of the seaplane, and to bring the life preserver back, when he took Tommy Larsen to the emergency hospital.\n\u003cbr\u003e \n\u003cbr\u003e One little thing bothered Sandy at that point in his musing: why had Jeff not made away with the life preserver at once?\n\u003cbr\u003e 240\n\u003cbr\u003e \n\u003cbr\u003e “Oh, but he hadn’t seen his wife then,” he thought. “Mimi told him her news, about seeing the captain of the yacht hide the real jewels—and being an airman, he hadn’t known that all yacht equipment has its name painted on it in case of a wreck at sea.”\n\u003cbr\u003e \n\u003cbr\u003e Skipping many other things that seemed to point out Jeff as the ringleader, deceiving his employer and war buddy, Mr. Everdail, Sandy came down to the present suspicious circumstance.\n\u003cbr\u003e \n\u003cbr\u003e “Jeff left the amphibian here on purpose. Of course he knows that Mr. Whiteside won’t leave the real jewel ‘preserver’ unguarded here, but he must know the plan to have it in the hangar. He thinks he is clever enough to outwit us all—but Jeff,” he addressed the imaginary image of the pilot, “you walked under a ladder, today. Don’t forget how superstitious you are. And—this time—it is an omen, and no mistake.”\n\u003cbr\u003e \n\u003cbr\u003e He cut short his meditation and listened to the sound of oars in the inlet.\n\u003cbr\u003e \n\u003cbr\u003e Was Mr. Whiteside coming—or Jeff?\n\u003cbr\u003e \n\u003cbr\u003e His uncertainty was not maintained for long.\n\u003cbr\u003e \n\u003cbr\u003e Making no effort to be quiet, the oarsman sculled to one of the steps arranged for embarking on the amphibian in water, looped a line around a strut to hold his boat against the drift of slack tide and a slight wind, and came onto the amphibian.\n\u003cbr\u003e 241\n\u003cbr\u003e \n\u003cbr\u003e Sandy, crouched low in the passenger’s cockpit, hoping Jeff would not notice him, was dazzled by the beam of a searchlight pocket lamp which Jeff flashed around.\n\u003cbr\u003e \n\u003cbr\u003e “Hello!” he exclaimed, surprised. “What are you doing here?”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t you know the plan?” Sandy wanted to take advantage of Jeff’s momentary indecision: perhaps he would “give away” something.\n\u003cbr\u003e \n\u003cbr\u003e “Yeah! I know what Whiteside planned. But he didn’t plan for anybody to be here. What’s the need?”\n\u003cbr\u003e \n\u003cbr\u003e “In case the—ghost—got away from the others and knew this airplane was here.”\n\u003cbr\u003e \n\u003cbr\u003e Sandy got a shock of surprise.\n\u003cbr\u003e \n\u003cbr\u003e “Why, that-there is so! And if the gas-boat come and filled up the tank—I sent it, this afternoon and that was what Whiteside stayed here for, to see that the ‘phib’ got gassed and oiled up—the—ghost—could use it, if that-there ghost was a pilot.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s what we thought.”\n\u003cbr\u003e \n\u003cbr\u003e Jeff chuckled rather sourly.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” he said. “And you suspect me. I know you have, ever since the start of this business——”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yes—I did.” Sandy thought fast: he decided to clear Jeff’s mind. “But don’t you remember that I turned over a new leaf?”\n\u003cbr\u003e 242\n\u003cbr\u003e \n\u003cbr\u003e “I wish your buddies and that-there Whiteside would do as much, then.”\n\u003cbr\u003e \n\u003cbr\u003e Sandy could not find anything to say.\n\u003cbr\u003e \n\u003cbr\u003e “It’s funny,” Jeff remarked. “This-here psychology I’ve read about ain’t so far wrong when it says that folks who gets the wrong slant on a thing comes to believe it so strong that even the truth looks like a fib to them.”\n\u003cbr\u003e \n\u003cbr\u003e Sandy said nothing.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, well,” Jeff turned and found his way back to the rowboat. “Time will tell. I seen a flock of birds circle over my head this afternoon and that-there is a sure sign of good fortune. I’ll come out cleared!”\n\u003cbr\u003e \n\u003cbr\u003e With no further word he sculled away.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t forget,” he called over his shoulder, “if you can suspect me, I can suspect you—and Whiteside—and Dick—and Larry!”\n\u003cbr\u003e \n\u003cbr\u003e Sandy, without reply, was already quietly undressing.\n\u003cbr\u003e \n\u003cbr\u003e When the boat touched the wharf Sandy was a tiny figure moving with careful strokes through the water, screened by the amphibian as he swam for a sandy outcrop of the shore not far beyond the flying craft.\n\u003cbr\u003e 243\n\u003cbr\u003e \n\u003cbr\u003e The dark figure of the pilot, moving across the estate shore paths had, at a good distance behind it, a shadow. Sandy had managed to hold his bundled clothes enough out of water to be fairly dry.\n\u003cbr\u003e \n\u003cbr\u003e Over to the disused estate the quarry and its watchful shadow moved.\n\u003cbr\u003e \n\u003cbr\u003e The pilot turned up a slope and climbed the smooth turf.\n\u003cbr\u003e \n\u003cbr\u003e Sandy, waiting until he got to a shrubbery, moved so it was between him and his quarry. He, too, crossed the ascending turf.\n\u003cbr\u003e \n\u003cbr\u003e It startled Sandy to see Jeff turn in at the old house, climb the veranda steps, cross the porch to the door—and go in.\n\u003cbr\u003e \n\u003cbr\u003e Sandy stayed behind some shrubbery.\n\u003cbr\u003e \n\u003cbr\u003e Jeff could watch from the doorway. He might see a figure in the open space of the lawn around the house.\n\u003cbr\u003e \n\u003cbr\u003e He thought he guessed Jeff’s ruse.\n\u003cbr\u003e \n\u003cbr\u003e The pilot, he reasoned, would go through the house after seeing that no one seemed to be following; but to be doubly sure he would go on to the front, coming out there, or to the side opposite where he had entered. Sandy matched his plans to the chance. He went, Indian-still and crouched, to a point where an ornamental tree would be in line with his movement from the side door, then in that shelter moved back to the hedged path, bent low and ran down to a cross path that took him to another point of the grounds.\n\u003cbr\u003e 244\n\u003cbr\u003e \n\u003cbr\u003e From that he could observe the whole lawn around the house.\n\u003cbr\u003e \n\u003cbr\u003e But, when a half hour had elapsed and no one had come out, he was puzzled. Had his maneuver been executed too late? No, Jeff could not have gotten out of sight because the lawn was too wide to cross in the brief time Sandy used up.\n\u003cbr\u003e \n\u003cbr\u003e “He’s in the house—doing what?” he wondered.\n\u003cbr\u003e \n\u003cbr\u003e He did not dare to find out. That “what” might be answered by “watching!”\n\u003cbr\u003e \n\u003cbr\u003e Once he thought he caught a glint of light in the library window; but it could have come from a high beam of some automobile headlight, on the distant highway that passed the estate.\n\u003cbr\u003e \n\u003cbr\u003e So Sandy watched and waited.\n\u003cbr\u003e \n\u003cbr\u003e Therefore he did not see the dark figure that emerged cautiously from the grove and, with intent, careful gaze, studied the hangar.\n\u003cbr\u003e \n\u003cbr\u003e The ghost was getting ready to walk!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2096/59550.html","bookId":523,"creation":"Aug 5, 2019 11:24:10 AM","modification":"Aug 5, 2019 11:24:10 AM"}
