{"id":90130,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Marty, David Yates is afraid of Malachi. Don’t you think that he might make up a story—or that maybe he even thought that he saw Malachi?”\u003c/p\u003e\n\u003cp\u003eMarty’s eyes darted from Sam to Jenna. “He—he’s afraid of him for a good reason!”\u003c/p\u003e\n\u003cp\u003e“Oh, come on, Marty! You’re a smart kid. You don’t believe in the ‘evil eye,’ do you?” Sam asked him.\u003c/p\u003e\n\u003cp\u003eMarty was confused and still very scared. “I—I…I don’t know….”\u003c/p\u003e\n\u003cp\u003e“Let him go for now,” Jenna said softly. “Marty needs to learn that everything he hears isn’t true. Come on, Sam. Let’s let him go.”\u003c/p\u003e\n\u003cp\u003e“How am I going to explain going home in my underwear?” Marty asked.\u003c/p\u003e\n\u003cp\u003e“How were you going to explain going home in a stolen costume?” Sam asked him in return.\u003c/p\u003e\n\u003cp\u003eMarty looked at them both. Jenna was no longer holding him.\u003c/p\u003e\n\u003cp\u003eHe turned and ran.\u003c/p\u003e\n\u003cp\u003eThey watched him for a moment, and then Sam turned to Jenna. She thought for a minute that he was going to put his hands on her and shake her. He looked as if he wanted to do that, but with supreme effort refrained.\u003c/p\u003e\n\u003cp\u003e“Why the hell didn’t you answer your phone?” he demanded. “I thought that something serious had happened to you. Your uncle is in a panic. Your uncle!”\u003c/p\u003e\n\u003cp\u003eWithout another word, he pulled out his own phone. He dialed Jamie, staring at Jenna.\u003c/p\u003e\n\u003cp\u003e“Found her.”\u003c/p\u003e\n\u003cp\u003eShe could hear Jamie’s reply. “Where?”\u003c/p\u003e\n\u003cp\u003e“In the cemetery.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“She’s fine, Jamie. We’ll see you soon.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t she answer her phone?”\u003c/p\u003e\n\u003cp\u003e“Because I lost it!” Jenna said loudly. “And I think probably in here—probably against the back wall.”\u003c/p\u003e\n\u003cp\u003e“Did you hear that, Jamie?” Sam asked.\u003c/p\u003e\n\u003cp\u003e“Aye. I’ll meet you at the new barbecue. It’s two blocks from the graveyard. Lost her phone! Eh, my heart’s not old enough for all this fibrillatin’!”\u003c/p\u003e\n\u003cp\u003eSam pocketed his phone, staring at her. “You did just cost us about ten years of life, you know.”\u003c/p\u003e\n\u003cp\u003e“Sam, I dropped my phone. It’s in here somewhere. I have to find it.”\u003c/p\u003e\n\u003cp\u003e“Jenna, it’s almost dark.”\u003c/p\u003e\n\u003cp\u003e“I’ll find it.”\u003c/p\u003e\n\u003cp\u003e“Retrace your steps.”\u003c/p\u003e\n\u003cp\u003eShe nodded, and explained where she’d been, not explaining exactly why. They split up by about twenty feet, trying to cover more ground.\u003c/p\u003e\n\u003cp\u003e“You should never be alone,” he called to her.\u003c/p\u003e\n\u003cp\u003e“Oh, please, Sam! It was a kid trying to scare me, and I handled it.”\u003c/p\u003e\n\u003cp\u003eNight was on them; the only light came from the street, and she wondered herself if she had a prayer in hell of finding her phone.\u003c/p\u003e\n\u003cp\u003e“You could ask the ghosts for help!” he called.\u003c/p\u003e\n\u003cp\u003e“Maybe I will!”\u003c/p\u003e\n\u003cp\u003eShe was surprised when she felt a soft touch on her arm.\u003c/p\u003e\n\u003cp\u003eIt was a young woman. She had large eyes and soft flyaway hair, and she couldn’t have been more than twenty years old when she had passed away. She managed a gentle smile and led the way.\u003c/p\u003e\n\u003cp\u003eJenna found her phone against the back wall.\u003c/p\u003e\n\u003cp\u003e“Found it!” she called to Sam.\u003c/p\u003e\n\u003cp\u003e“That’s a miracle!” he told her.\u003c/p\u003e\n\u003cp\u003e“Oh, well, you know, a ghost helped me!” she called cheerfully. “Of course, if we were smarter, we could have just had you call it….”\u003c/p\u003e\n\u003cp\u003eHe came to her and took her arm. She wished she didn’t get such a feeling of heat every time he touched her. She hoped her cheeks didn’t redden, or if they did, that the shadows of the night hid her reaction.\u003c/p\u003e\n\u003cp\u003e“Let’s get out of here,” he said huskily.\u003c/p\u003e\n\u003cp\u003e“Sam, I want to get this costume to a lab right away. If we can find a twenty-four-hour FedEx or post office—”\u003c/p\u003e\n\u003cp\u003e“Want to head to Boston?” he asked drily. “You know, the Massachusetts police aren’t the Feds, but they are pretty damned good.”\u003c/p\u003e\n\u003cp\u003e“Sam, I’d have to explain that in my mind’s eye, I see someone dressed like this killing people. And I’d have to explain how I got it.”\u003c/p\u003e\n\u003cp\u003e“Legalese, Miss Duffy. I can work it out with John Alden. He’s a good guy.”\u003c/p\u003e\n\u003cp\u003e“Sam, we may be letting loose of a piece of evidence—”\u003c/p\u003e\n\u003cp\u003eHe sighed. “And you have no jurisdiction here at the moment. You weren’t invited in. If the costume goes to an FBI lab and something is found, I might wind up with a chain of evidence issue in court, or a judge could find some other reason to have it thrown out. We’ll just head to the station and call John.”\u003c/p\u003e\n\u003cp\u003eAs he spoke, they heard the single wong of a siren. They had reached the low wall to the street; suddenly, a flashlight blazed into their faces.\u003c/p\u003e\n\u003cp\u003e“Graveyard is closed! Gate locked. What are you two doing in there?” An officer, his face shielded in the shadows cast by the glare of the light, demanded.\u003c/p\u003e\n\u003cp\u003e“Sorry! We were just leaving,” Sam said.\u003c/p\u003e\n\u003cp\u003e“What’s that you’ve got?” the officer demanded.\u003c/p\u003e\n\u003cp\u003e“It’s just a costume,” Jenna offered.\u003c/p\u003e\n\u003cp\u003e“It’s a serious offense here to tamper with the graves! To vandalize!” the officer said angrily.\u003c/p\u003e\n\u003cp\u003e“We weren’t vandalizing!” Jenna protested indignantly.\u003c/p\u003e\n\u003cp\u003e“Look, hey, the gates were locked when we were in here!” Sam said.\u003c/p\u003e\n\u003cp\u003e“Bad enough dealing with kids and whackos during the season, but it’s worse when wiseass adults are playing around in the cemetery!” he said.\u003c/p\u003e\n\u003cp\u003eSam looked at Jenna. “Okay,” he told the officer. “Take us in.”\u003c/p\u003e\n\u003cp\u003e“Take you in?” the officer was surprised. “I wasn’t arresting you—I was giving you a serious warning. You’re to come here to learn and have a good time and not destroy what is historic and can never be replaced.”\u003c/p\u003e\n\u003cp\u003e“I know,” Sam said. “And you’re doing a great job. Go ahead and bring us in, though. I’ll call Detective Alden while we’re on the way. He might just be sitting down to his supper.”\u003c/p\u003e\n\u003cp\u003eJohn arrived right after Sam and Jenna had been seated in his office, in the middle of her call to Jamie. He was perplexed as to why it was so important to have the costume brought to the lab.\u003c/p\u003e\n\u003cp\u003eJenna leaned forward to speak to John Alden, but Sam thought they were going to be in much better shape if he did the speaking.\u003c/p\u003e\n\u003cp\u003e“John, bear with me on this. You’re a good guy. You’re really one of the good guys. And I know that you find it hard to believe that the evidence before your eyes is telling you the wrong story. I have a theory, and it may be crazy, but hear me out. No matter that you’re only charging the boy for some of the murders, you think the same person killed everyone, and I agree with you. You believe it was Malachi Smith. I don’t. And it’s not just because I’m defending him in court. I don’t believe the kid did it. You’re a cop, and yes, you work with the prosecutor. But prosecutors don’t want to prosecute the wrong person. No officer of the court wants to be responsible for a miscarriage of justice. That’s what we’re looking for here, John, justice.”\u003c/p\u003e\n\u003cp\u003e“Why this costume?” John asked, willing to listen to them but undeniably confused.\u003c/p\u003e\n\u003cp\u003e“The kid wearing it—?” He paused, looking at Jenna.\u003c/p\u003e\n\u003cp\u003e“Martin Keller,” she said. Her voice was tight, her jaw set. She wasn’t happy with him. But they were playing on the same side in a precarious game, and she had to see that.\u003c/p\u003e\n\u003cp\u003e“Martin Keller ‘borrowed’ the costume from the drama room. He was using it to scare Jenna. I believe that our killer is dressing up when he or she sets out to commit murder. It may be slim, but there is a possibility that the person is dressing up not just in a similar costume, but one borrowed from the drama department.”\u003c/p\u003e\n\u003cp\u003e“He or she? You think it might be a woman?” John said. “This much violence perpetuated by a woman is pretty rare.”\u003c/p\u003e\n\u003cp\u003e“I didn’t say it was a woman,” Sam said. “I don’t know. But, yes, look back. In the Tate/LaBianca murders, Manson’s stable of idol-worshipping followers were mainly women, and they were capable of extreme brutality. Karla Homolka seduced the victims when she and her husband went on a killing rage—she was responsible for the rape and murder of her own sister.”\u003c/p\u003e\n\u003cp\u003e“So, you do think it’s a woman?” John asked.\u003c/p\u003e\n\u003cp\u003e“No, John, honestly, I don’t know yet. I’m just pointing out the fact that even if statistically men have committed more murders with this kind of violence, it’s more than possible that a woman could be responsible,” Sam said. He waved a hand in the air. “At this point, John, what I’m trying to explain is this: wear a costume, and you’re someone else. Wear a costume, and you can walk around unnoticed. Or even, wear a costume, and it might mean something specifically to you.”\u003c/p\u003e\n\u003cp\u003e“You think they were ritual killings?” John asked.\u003c/p\u003e\n\u003cp\u003eSam lowered his head, fighting the frustration. “I know that a kid in this costume tried to scare Jenna tonight. I know it comes from the school’s drama department. I believe someone is wearing a costume like this—an encompassing costume, one to hide identity—to commit the killings. Please—hey, Jenna wanted to take this to the FBI.”\u003c/p\u003e\n\u003cp\u003eJohn stared at Jenna. “The FBI has not been invited in.”\u003c/p\u003e\n\u003cp\u003eJenna stood, irritated. “Would it be such a bad thing? No one wants to take over. Obviously, we respect the Massachusetts police. No one wants to take charge of the investigation. But if you have help, please use it! Use us! The world is working on lower budgets. Why not charge a Federal lab? But Sam said that you were a good and honest cop and we could keep a chain of evidence. If you think we’re just being silly, then please, give the damned thing back to me!”\u003c/p\u003e\n\u003cp\u003eSam noted that John just stared at Jenna for a moment, his jaw fallen. Then he smiled and looked at Sam.\u003c/p\u003e\n\u003cp\u003e“I’ll get the costume to the lab. I don’t want a miscarriage of justice, Sam. I just can’t believe that someone else has done all this. The kid was covered in blood. Covered. In. Blood. But I won’t have it be said you were denied anything in the right to defend your client.” He pointed at Sam. “You two chose not to call the police, and the costume is in your hands. So as long as we’re being ‘unofficial’ about everything, you see to it that school is afforded a new costume. And I’ll see to that Martin Keller is—” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-evil-inside-krewe-of-hunters-4/page-26.html","bookId":2278,"creation":"Oct 5, 2019 5:40:33 PM","modification":"Oct 5, 2019 5:40:33 PM"}
