{"id":90135,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“And that’s what you feel is happening again?”\u003c/p\u003e\n\u003cp\u003e“In a way—think about it! Your neighbors have been brutally murdered. That’s damned scary.”\u003c/p\u003e\n\u003cp\u003e“Driving through Salem, even in the early hours, it didn’t appear that people were terribly concerned—they were out in droves already, and half of them dressed up for Halloween!”\u003c/p\u003e\n\u003cp\u003e“Because they feel safe—Malachi is being held without bond. The devil is locked away.”\u003c/p\u003e\n\u003cp\u003e“But we’re looking at modern America. It’s not like people stay indoors at every fright, even without all that,” Angela pointed out.\u003c/p\u003e\n\u003cp\u003e“Yes, and it’s a city and area like any other—except that it has a tremendous history that we do take with us into modern America. We learned from the Salem Witch Trials. What I’m saying is that there’s no way yet to prove that Malachi isn’t guilty—the evidence, the solid evidence, points to him,” Jenna said. “I’m just saying that because his family was so different, it was very easy for people to accept the fact that he could be an ax murderer. And I also think that we’re looking at what is human and what has been human since the people first began walking around. Why do the sane commit murder? Passion, greed, anger, love—avarice and envy.”\u003c/p\u003e\n\u003cp\u003e“And you’re sure you don’t believe this just because you can’t accept that Malachi Smith might be guilty?” Angela asked.\u003c/p\u003e\n\u003cp\u003e“You need to meet him. Once you meet him, you’ll understand. I know that you will.”\u003c/p\u003e\n\u003cp\u003eShe hesitated. “Being emotionally sensitive is a gift we share all share, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Let’s hope,” Angela said.\u003c/p\u003e\n\u003cp\u003eThey reached the homestead and it was barren and empty, field stretching out in either direction, the house sitting forlorn in the colors of autumn.\u003c/p\u003e\n\u003cp\u003e“Damn! I forgot, it’s only open by appointment except for Saturday and Sunday once it reaches this time of year,” Jenna said.\u003c/p\u003e\n\u003cp\u003e“Let’s call for an appointment,” Angela suggested.\u003c/p\u003e\n\u003cp\u003e“They’ll probably say no.”\u003c/p\u003e\n\u003cp\u003e“We won’t know until we try.”\u003c/p\u003e\n\u003cp\u003eJenna pulled out her phone and dialed the number on the sign. To her surprise, the friendly woman at the other end of the line agreed to meet them. While they waited, they stood outside the car and looked on at the structure.\u003c/p\u003e\n\u003cp\u003e“She must have been a truly sympathetic character,” Angela commented.\u003c/p\u003e\n\u003cp\u003e“They deemed her innocent at first, but the girls put on another show, and she was questioned again. She was mostly deaf, and didn’t answer the questions quickly enough, or misinterpreted or something, and she was then condemned. I’m still in awe that their faith was so strong that they wouldn’t tell a lie to save their lives—those who confessed were saved through prayer, I guess. They paid the bill for being held—for their room and board, and for their shackles—and those who didn’t die in prison were eventually freed. I’d always imagined jail cells or a prison such as we see today, when I was a kid. But they were kept together, and their beds were mats on the floor. A number of the victims died while they were being held.”\u003c/p\u003e\n\u003cp\u003eLooking across the expanse of property that surrounded the homestead, Jenna suddenly frowned. She pointed. “There’s someone there.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“By the house!”\u003c/p\u003e\n\u003cp\u003e“I don’t see…” Angela said.\u003c/p\u003e\n\u003cp\u003e“The person is gone—she walked around the side.”\u003c/p\u003e\n\u003cp\u003e“Why would someone be sneaking around the Rebecca Nurse Homestead?” Angela asked.\u003c/p\u003e\n\u003cp\u003e“Good question,” Jenna murmured.\u003c/p\u003e\n\u003cp\u003eA car drove up behind them. A woman exited the car and waved to them. “Hi! You’re lucky, I happen to be available. I’m Sandy Halloran, nice to meet you.”\u003c/p\u003e\n\u003cp\u003eJenna and Angela both thanked her profusely for coming out and, before they went farther, made a large donation to the upkeep.\u003c/p\u003e\n\u003cp\u003eJenna had been here several times before, but it had been long ago. It never failed to tug at her heartstrings to think of a woman who had lived and worked in the heat and bitter cold of New England, who had endured childbirth many times, only to die at the end of a rope.\u003c/p\u003e\n\u003cp\u003eAngela was fascinated by the homestead, by the sparse furniture, by the hard life lived by seventeenth-century farmers. She listened gravely while their eager guide described Salem Village at the time, the families that constituted it and how family matters and money played into everything. “A lot of people suggested that mold in the wheat might have caused the girls to have hallucinations,” Sandy told them. “I never bought into that theory. Why would only the girls be affected? I think that they started a lie, and perhaps they played it out so well that they believed it themselves. None of us will really know now, will we?”\u003c/p\u003e\n\u003cp\u003eAngela and Sandy seemed to be having a good conversation so Jenna slipped outside, walked around the house and looked toward the western side of the property, and the graveyard. She remembered that the old section of the graveyard was closest to the old cart road; it was most probable that Rebecca Nurse’s family had taken her body and brought it home, secretly, of course. Witches were not to lie among consecrated graves, and any of the victims who received a proper burial received it because the love of a family member was stronger than the fear of repercussion.\u003c/p\u003e\n\u003cp\u003eRebecca Nurse, however, most probably would not tarry in the graveyard. She had been a wife and mother.\u003c/p\u003e\n\u003cp\u003eJenna turned back to the house and paused. Made of mist now, and yet clearly there before her, stood the spirit of an old woman. Her dress was severe, fastened to her throat, with only a white collar against the dark blue of her bodice. A cap covered her graying hair; she was wrinkled and withered, but she had beautiful blue-gray eyes that carried centuries of wisdom. She made a hand motion and started toward the graveyard, so Jenna followed.\u003c/p\u003e\n\u003cp\u003eCertainly, there was no telling where Rebecca Nurse was really buried. In later times, the family had erected a stone to her memory. The remains of George Jacobs, Sr., another victim of the trials, had been unearthed on the Jacobs property in the 1950s and laid to rest here with great ceremony during the tercentennial. Jenna wondered if the spirit of Rebecca wanted her to honor him here as well, but she didn’t head toward the memorial. She walked instead toward a patch of ground that was devoid of memorial markers, even the fieldstones that denoted the resting places of so many family members.\u003c/p\u003e\n\u003cp\u003eFog swelled through the pines that surrounded the graveyard, and for a moment, Jenna felt as if she’d been whisked back in time and that she and the old woman who had met such a cruel demise stood in a place entirely removed from all others.\u003c/p\u003e\n\u003cp\u003e“What are you trying to tell me?” Jenna whispered.\u003c/p\u003e\n\u003cp\u003e“Look to the young, and those who would be innocent, for they only learn from the voices around them,” the woman said, her voice like the rattling of tree limbs stripped bare of their leaves. “Babes so quickly learn that lies often serve to please, and so they learn to lie. They know not the tragedy of their words. John Proctor whipped his girl, and she had no fits. She found the others, and those who would watch and applaud, and she began again, and yet, I think, I believe, not with malice, yet with fear that what she began to believe was what she must.”\u003c/p\u003e\n\u003cp\u003e“Even now, you forgive,” Jenna said. She felt like crying for all those wronged. She didn’t believe that she could have ever known such courage. She reached out toward the specter.\u003c/p\u003e\n\u003cp\u003eBut the old woman seemed impatient. “Children! They know not what they say. They know not what they say.”\u003c/p\u003e\n\u003cp\u003eThe trees seemed to shake with the sudden burst of an autumn wind. The fog stirred and rolled and seemed to lift, and when it did, the image of the old woman was gone.\u003c/p\u003e\n\u003cp\u003eJenna stood alone in the graveyard, wondering if she was indeed sane and gifted, or if she created what she saw in her mind. It was always so real, and then so completely vanished.\u003c/p\u003e\n\u003cp\u003eShe realized then that either the spirit of the long-deceased woman—or the spirit she created in her mind—hadn’t been talking about the past.\u003c/p\u003e\n\u003cp\u003eThey had yet to interview the boys.\u003c/p\u003e\n\u003cp\u003eAnd, she believed, especially after the words of the ghost, the boys were the key.\u003c/p\u003e\n\u003cp\u003eAngela and Sandy emerged from the house, talking animatedly. Jenna realized that Angela would want to see the graveyard, and she was suddenly eager to leave it herself. She wanted to get to the cliff-side spit of land where kids—old and young—hung out. She told herself that they might not come at all—not David and Joshua, anyway—but she was anxious to try there.\u003c/p\u003e\n\u003cp\u003e“Sandy is an amazing tour guide,” Angela said. “I’ve so enjoyed discussing the history with her. We’re going to tour the graveyard—”\u003c/p\u003e\n\u003cp\u003eJenna quickly stepped forward to take Sandy’s hand and pump it. “Perhaps another day! Sandy, you were so kind, so wonderful! I know we’ll be back. Soon. Angela, I just realized that we might miss that appointment. We’ve got to go…quickly. Now.”\u003c/p\u003e\n\u003cp\u003e“Appointment?” Angela said. “Oh, yes, of course, how could I forget? Sandy, thank you very much.”\u003c/p\u003e\n\u003cp\u003e“There’s really so much more to see here. They built what must be an almost perfect reproduction of the Old Meeting House in Salem Village. This is really where it all began. There are other houses—”\u003c/p\u003e\n\u003cp\u003e“Thank you! We will see them!” Jenna assured her. Grabbing Angela’s hand, she dragged her back across the property to her car.\u003c/p\u003e\n\u003cp\u003e“All right,” Angela said, once they were seated. “What’s going on?”\u003c/p\u003e\n\u003cp\u003e“We have to get to the cliff side by the Lexington House.”\u003c/p\u003e\n\u003cp\u003e“Yes, we were planning that, but school’s not even out yet.”\u003c/p\u003e\n\u003cp\u003e“It will be.”\u003c/p\u003e\n\u003cp\u003e“So…”\u003c/p\u003e\n\u003cp\u003e“I saw Rebecca Nurse.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“She was a victim of injustice, Angela. I thought I was just listening to her talk about the past—about the girls. But she was trying to help me now. I think an old man from the era was trying to help me at the graveyard in Salem the other night…someone who saw the injustice, and saw that lies created more lies, and people began to believe them, even those who weren’t really involved. Angela, good people were involved all those years ago. This is totally different, we’re living in a different world, and yet, it can all play out the same. People believe what seems to be obvious. And kids are all too easily caught up in playacting. And if you do it long enough, in your mind, it becomes the truth!” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-evil-inside-krewe-of-hunters-4/page-31.html","bookId":2278,"creation":"Oct 5, 2019 5:40:33 PM","modification":"Oct 5, 2019 5:40:33 PM"}
