{"id":90153,"no":49,"title":"Page 49","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Yes,” Joshua said. Then he looked up. “I mean—I didn’t actually see him, but David did. And David wouldn’t say that he saw him if he didn’t. He said that people might not believe him if someone else didn’t say the same thing. And then…then I had to stick to it because…because I’d said it, and I couldn’t turn on David and…Dad! Dad, I’m sorry. But David wouldn’t lie to me—we’re friends.”\u003c/p\u003e\n\u003cp\u003eWith that, John, Sam and Jackson thanked Joshua for his honesty and stepped out of the room. “John, listen to me, please, and I know that this is hard. I honestly believe that Councilman Yates and Samantha Yeager conspired to commit these murders,” Sam said once the door had closed.\u003c/p\u003e\n\u003cp\u003eJohn stared at him as if he’d lost his mind. Sam spoke quickly, with Jackson’s help, explaining that it was his belief that Samantha Yeager had engaged in an affair with Andy Yates. On her part, it was sheer greed. She wanted Lexington House. Andy Yates had watched what he thought was his son’s terrible suffering; he had to right a wrong.\u003c/p\u003e\n\u003cp\u003e“You’re crazy!” John said, looking at him.\u003c/p\u003e\n\u003cp\u003e“John, help us out here, please. Half the parents are here. Can you get Andy Yates to come down? If we can all talk to him with his son present…?”\u003c/p\u003e\n\u003cp\u003eJohn sighed. “All right. I’ll get him down here.”\u003c/p\u003e\n\u003cp\u003e“You want to what?” Angela demanded.\u003c/p\u003e\n\u003cp\u003e“I want to get back into Lexington House,” Jenna repeated.\u003c/p\u003e\n\u003cp\u003e“Oh, Jenna, I don’t know if that’s necessary. Why don’t we wait and see what happens at the school today? When they actually get to the kids…”\u003c/p\u003e\n\u003cp\u003e“No. Angela, I’ve been twice. The first time, I saw Eli Lexington kill his family. The second time, I saw the day that the Braden son killed his parents. My cognitive self might be working in a time pattern. If I can get back in there one more time…”\u003c/p\u003e\n\u003cp\u003e“Maybe you’re right. But, still—”\u003c/p\u003e\n\u003cp\u003e“If we wait, Sam will have to call John again, and what I’ll probably get won’t actually be proof, just an idea of the direction we should take to find proof. They’re about to go in with cleaning crews. We’ve got to go now—before they do that,” Jenna said.\u003c/p\u003e\n\u003cp\u003e“I’m still uneasy about it. The killers are out there. They hired people to look for you, for God’s sake.”\u003c/p\u003e\n\u003cp\u003e“And they wouldn’t dare do it again, not so quickly,” Jenna said.\u003c/p\u003e\n\u003cp\u003eWhile Angela drummed her fingers on the table, Jenna’s phone rang. It was Sam.\u003c/p\u003e\n\u003cp\u003e“Joshua Abbott’s dad came in and gave it to him, and he admitted he’d been lying,” he told her.\u003c/p\u003e\n\u003cp\u003e“That’s a start.”\u003c/p\u003e\n\u003cp\u003e“It gets better. John is bringing Councilman Yates in, saying that he wants him present when David is questioned. You never know what happens when you get that kind of dichotomy going. We could get somewhere today.”\u003c/p\u003e\n\u003cp\u003e“That’s great!” Jenna told him. “Keep us posted.”\u003c/p\u003e\n\u003cp\u003e“Will do,” he said, and hung up.\u003c/p\u003e\n\u003cp\u003e“No one is going to be out to get me,” Jenna assured Angela. “They’re bringing Councilman Yates to the school.”\u003c/p\u003e\n\u003cp\u003eAngela nodded. “Maybe the ghosts will talk to me, too, today….” She groaned and rolled her eyes. “We’re going to go under the police tape, huh?”\u003c/p\u003e\n\u003cp\u003e“We’ll put it back, just the way it was. No one will ever know.”\u003c/p\u003e\n\u003cp\u003e“Where’s Jamie?” Angela whispered.\u003c/p\u003e\n\u003cp\u003e“He went back in to spend some time with Malachi. Angela, I feel that I have to do this.”\u003c/p\u003e\n\u003cp\u003e“All right,” Angela agreed. “Then…let’s go.”\u003c/p\u003e\n\u003cp\u003eJenna drove. As they pulled out of Jamie’s driveway and headed down the street, Angela frowned and looked into the rearview mirror.\u003c/p\u003e\n\u003cp\u003e“There’s a car following us,” she said.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“Nope, never mind. It was just a woman, I think, on her cell phone and following too close. The car turned off. We’re good.”\u003c/p\u003e\n\u003cp\u003eJenna was careful to park a few blocks down on the street. As they exited the car, Angela said, “If I head to the cliff area—the park-not-really-a-park—I can easily see Lexington House. I’m thinking that I should keep an eye out and warn you if someone does come. And then, after you’ve taken a try at reading the place, I can go in, because I want to see if there are ghosts in there who will talk to me.” She smiled apologetically. “We both know that ghosts are as strange and moody as—well, as they were when they were living. And sometimes, they’ll feel an affinity with one person and not another. You can keep watch and I’ll go in if you don’t get anything.”\u003c/p\u003e\n\u003cp\u003e“Ah! Now there’s a plan,” Jenna said.\u003c/p\u003e\n\u003cp\u003eIn front of Lexington House, they split, moving quickly. Jenna looked around; the neighboring houses were few, and she was pretty sure that the workday had already begun for most people in the area.\u003c/p\u003e\n\u003cp\u003eShe didn’t try to slink into the house, but went straight up the walkway, slipped under the tape and jimmied the lock open.\u003c/p\u003e\n\u003cp\u003eFBI training was helpful in many ways, she thought.\u003c/p\u003e\n\u003cp\u003eShe entered the foyer. She started to head into the parlor but changed her mind. In the parlor, too many events had occurred. She walked up the stairs. If she stood in one of the rooms where Malachi’s great-uncle and grandmother had been killed, she might get more.\u003c/p\u003e\n\u003cp\u003eShe chose the left bedroom, and as she stood there, she felt the opaque mist start to form before her eyes, the thing that told her she was about to see.\u003c/p\u003e\n\u003cp\u003eShe gripped the bedpost and waited for the scene to start to unfold.\u003c/p\u003e\n\u003cp\u003eAnd it did.\u003c/p\u003e\n\u003cp\u003eShe saw an old woman. She might have been out of the past; she wore a nightcap and a long white nightgown, one that buttoned to her throat. But she wasn’t from the distant past. There was a digital alarm clock by her bed, and she checked it to make sure that it was set for six the following morning.\u003c/p\u003e\n\u003cp\u003eThen she lay down, and reached into her bedside table for her Bible.\u003c/p\u003e\n\u003cp\u003eSmiling, deep into the comfort of her mattress and her covers, she began to read.\u003c/p\u003e\n\u003cp\u003eJenna felt something by her side. She turned, and there it was, the specter of the horned god, bearing an ax.\u003c/p\u003e\n\u003cp\u003eAn ax that already dripped blood.\u003c/p\u003e\n\u003cp\u003eThe old woman looked up. Confusion tinged her rheumy eyes at first.\u003c/p\u003e\n\u003cp\u003eAnd then she started to scream. A silent scream, because she couldn’t quite draw breath.\u003c/p\u003e\n\u003cp\u003eAnd then the horned god was upon her, the first swing catching her in the center of her breast….\u003c/p\u003e\n\u003cp\u003eSomething seemed to happen then. The opaque image faded; she could see it, but more as a backdrop to something else.\u003c/p\u003e\n\u003cp\u003eAnd there was something else there.\u003c/p\u003e\n\u003cp\u003eAnother image, standing at the side of the bed.\u003c/p\u003e\n\u003cp\u003e“Rebecca?” Jenna breathed. She was facing a ghost, or a spirit, a gentle, benign spirit. And the woman was speaking to her.\u003c/p\u003e\n\u003cp\u003e“The children, the children hear the words of their elders. Leave! Leave now!”\u003c/p\u003e\n\u003cp\u003eJenna hadn’t come unarmed this time. She started to reach beneath her jacket from her weapon.\u003c/p\u003e\n\u003cp\u003eAnd that’s when the entire world seemed to come down on her head, and she whirled only quickly enough to see who had come upon her.\u003c/p\u003e\n\u003cp\u003eThe horned god, once again….\u003c/p\u003e\n\u003cp\u003eAndy Yates and his son were seated in uncomfortable chairs; Jackson had purposely found those that had uneven legs for reasons of interrogation strategy. The light was made as bright as possible, and John Alden faced the table while Jackson and Sam took chairs at each end.\u003c/p\u003e\n\u003cp\u003e“I don’t understand,” Andy Yates said, bewildered. “A costume was taken from this school and used when Peter Andres was killed? And so you’re questioning all the students—not just David, right?”\u003c/p\u003e\n\u003cp\u003e“That’s right, Mr. Yates,” John Alden said.\u003c/p\u003e\n\u003cp\u003e“We were at a football game when Andres was killed,” he said. “I know you can check that out—you’ve probably checked that out. So—”\u003c/p\u003e\n\u003cp\u003e“So, we also know that David has lied to us,” Sam interrupted.\u003c/p\u003e\n\u003cp\u003eAndy frowned, looking at his son.\u003c/p\u003e\n\u003cp\u003e“I didn’t lie!” David said.\u003c/p\u003e\n\u003cp\u003e“Your friend, Joshua, admitted that he didn’t see Malachi Smith on the day that Earnest Covington was killed,” Jackson said.\u003c/p\u003e\n\u003cp\u003e“What?” David protested. “Joshua wouldn’t say that.”\u003c/p\u003e\n\u003cp\u003e“He did,” John Alden said. They’d agreed to keep the questions coming from around the table. Like uncomfortable chairs, question being shot from all directions helped confuse a person who was lying.\u003c/p\u003e\n\u003cp\u003e“Wait! What does the costume used when Andres was killed have to do with the day Covington was killed?” Yates demanded.\u003c/p\u003e\n\u003cp\u003e“You see, we’re not looking for one killer. We believe there were two, working in unison to make sure they could provide alibis for the murders,” Sam said.\u003c/p\u003e\n\u003cp\u003e“Wait, wait,” Andy Yates protested. “You think that—”\u003c/p\u003e\n\u003cp\u003e“Yes, Mr. Yates. We think your boy might be guilty,” Jackson said.\u003c/p\u003e\n\u003cp\u003e“We think he’s in a conspiracy with someone else,” John Alden said.\u003c/p\u003e\n\u003cp\u003eDavid gasped. “Me! I didn’t murder anyone!”\u003c/p\u003e\n\u003cp\u003e“But you lied!” Sam told him.\u003c/p\u003e\n\u003cp\u003e“I didn’t kill anyone!”\u003c/p\u003e\n\u003cp\u003e“But you did lie!” his father said, looking at his son with a sick expression.\u003c/p\u003e\n\u003cp\u003e“I lied to protect you!” David Yates said.\u003c/p\u003e\n\u003cp\u003e“Me!” Yates sounded astounded.\u003c/p\u003e\n\u003cp\u003e“I saw—I saw—” David said. “You saw what?”\u003c/p\u003e\n\u003cp\u003e“I saw… I thought it was you…heading into the costume shop after the play last spring. You and mom were there, and then you weren’t, and I thought you just went to speak to the drama teacher, ask her why I didn’t have a better role.”\u003c/p\u003e\n\u003cp\u003e“I never!” Andy protested, staring at his son.\u003c/p\u003e\n\u003cp\u003e“Mr. Yates, are you having an affair with your business partner, Samantha Yeager?” John demanded. “You hated Malachi Smith. You blamed him for every problem your son ever had.”\u003c/p\u003e\n\u003cp\u003e“You blamed him for the stigma of having to see a shrink,” Jackson said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-evil-inside-krewe-of-hunters-4/page-49.html","bookId":2278,"creation":"Oct 5, 2019 5:40:33 PM","modification":"Oct 5, 2019 5:40:33 PM"}
