{"id":89649,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe stared me down, “You’re making me crazy. I was a fun guy before I met you. I rarely lost my tempter or worried what girls thought or did. I had sex, I drank, I sang, and I liked my life. You are killing me and making me insane. I’m doing things my anger management coach would have a heart attack about.”\u003c/p\u003e\n\u003cp\u003eI shrugged, “Then I guess we’ll be nuts together. No one is getting out of this fucking apartment sane.” I didn’t care. Not anymore. He’d fucked other chicks, I knew it. I could practically smell them on him.\u003c/p\u003e\n\u003cp\u003eHe crossed the line. I jumped off the couch, holding my mace at him, “I told you, I won’t leave. I’ll stay here like your fucking prisoner, but you stay on your God-damned side. Your stuff is on that side of the room and mine is on this one.”\u003c/p\u003e\n\u003cp\u003eHe stepped into me, calling my bluff, “Mace me. I don’t give a shit. The only fucking thing I care about in this God-damned room is on your side.”\u003c/p\u003e\n\u003cp\u003eHe sat on the couch and pulled me down with him and sat me on his lap. I struggled, but he just held me and whispered, “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eI shook my head, “I don’t care. I don’t fucking care.”\u003c/p\u003e\n\u003cp\u003e“I apologized to him. Dean seems really cool. I’m sorry. I saw him looking all professional and clean cut, like you. And you were laughing so hard and I assumed the worst. He deserves someone like you, he’s professional and smart, and I’m not.”\u003c/p\u003e\n\u003cp\u003eI looked at him, “I know you have your MBA, so don’t play dumb Little Drummer Boy with me. Besides, you’ve been fucking other people, so you can’t care if I have coffee with my teacher. I’ll do what I want and who I want.”\u003c/p\u003e\n\u003cp\u003eHis eyes flickered again, “Firstly, I will give you points for being witty, but I’m the singer not the drummer. Secondly, I haven’t had sex since you and I.”\u003c/p\u003e\n\u003cp\u003eI saw myself in his eyes and my heart believed him. I freed one of my arms and scoffed, “I see the guilt.”\u003c/p\u003e\n\u003cp\u003eHe sighed, “I was drunk and a girl kissed me. I stopped it. I’m sorry. Someone posted it to a blog and I assumed you saw it. I felt like shit.” He looked down.\u003c/p\u003e\n\u003cp\u003eI lifted his face, staring into his eyes with burning hate, “You said you wanted me. If you wanted me, you wouldn’t kiss other people.”\u003c/p\u003e\n\u003cp\u003eHis eyes stayed true and strong, “I want you. I’ll always want you.” I looked at my face in the darkness of his pupils and swallowed the venomous things I wanted to say. His eyebrows pulled together, “I am fucking trying, princess. I am, I swear. I’ve been trying so hard to show you… to deserve you. I swear it.” He closed his eyes and leaned his forehead against mine, “Do you really feel like a prisoner?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “No. Sometimes it’s a little bit like Beauty and the Beast with you though. You get so crazy and I don’t know what to do.”\u003c/p\u003e\n\u003cp\u003eHe looked up and gave me his smug smile. I pointed a finger in his face, “You call me the beast and you’re dead.”\u003c/p\u003e\n\u003cp\u003eHe laughed hard, pulling me into him. He smelled my hair. I did the same on his neck. We snuggled for a minute but I couldn’t take it. I pressed play for my show. I needed there to be someone else in the room.\u003c/p\u003e\n\u003cp\u003eHe took the carton from my hand and we snuggled on the couch, watching Downton Abbey, while he ate the rest of my ice cream. “This show is insane,” he muttered, taking a huge bite.\u003c/p\u003e\n\u003cp\u003eI pointed at the screen, “You missed some hot stuff, it was about ten minutes before you got home. Little bit of back-door romance.”\u003c/p\u003e\n\u003cp\u003eHe gave me a look, “Anal sex? They show that on the BBC?”\u003c/p\u003e\n\u003cp\u003eI laughed, “No, like clandestine love affairs. Like sneaking around.”\u003c/p\u003e\n\u003cp\u003eI laughed harder when he took a bite and shrugged, “Whatever. In the South, backdoor means taking it in ass.”\u003c/p\u003e\n\u003cp\u003eI plugged my ears, “Ewwwww.”\u003c/p\u003e\n\u003cp\u003eHe grinned and sparkled, and became the guy I couldn’t resist, even if he was saying dirty shit.\u003c/p\u003e\n\u003cp\u003eWe fell back into the comfortable relationship we liked. I wouldn’t let him remove the paint or the tape, even if he refused to stay on his side. Against all the odds, we became the people we were before. The ones who lived together without sex and drama. He was texting me more. It made me happy, too happy. We were headed down the same flirty road as before. I knew the sex was inevitable. He was being sweet and staying in the apartment with me.\u003c/p\u003e\n\u003cp\u003eThe only saving grace was that he was traveling a lot with the band. They had left for Detroit the day before for a concert. It was his first televised concert, since the show he had gotten kicked off of. I looked at my phone to see if he’d messaged me or not. The girl in the chair next to me nudged me, “You and Lochlan Barlow still dating?”\u003c/p\u003e\n\u003cp\u003eI gave her a confused look, “No.”\u003c/p\u003e\n\u003cp\u003eShe leaned over to another girl and whispered my answer. I looked at the girl and smiled. It was Lise from the bar. She gave me a wave. I smiled at her. How had I not noticed her in my class?\u003c/p\u003e\n\u003cp\u003eMy head was up my ass for sure.\u003c/p\u003e\n\u003cp\u003eAfter class we walked out together, “So no more bad-boy singers, huh?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “No. We shouldn’t have ever crossed the roommate boundaries. It was stupid.” I didn’t mention, we were currently about to take the same crash course as before.\u003c/p\u003e\n\u003cp\u003eShe winced, “Yikes.”\u003c/p\u003e\n\u003cp\u003e“Whatever, so have you been in this class the entire time?” How had I not seen her?\u003c/p\u003e\n\u003cp\u003eShe laughed, “No. I switched out of the one on Fridays. It’s the same class and I begged and pleaded so they let me. I had to get a job and I work Fridays, Saturdays, and Sundays now.”\u003c/p\u003e\n\u003cp\u003e“Awesome, where?”\u003c/p\u003e\n\u003cp\u003eShe gleamed, “The bar where Thin Ice plays on Fridays. I can make five hundred in tips those three days.”\u003c/p\u003e\n\u003cp\u003eMy jaw dropped, “No way.”\u003c/p\u003e\n\u003cp\u003eShe nodded, “You want a job? I know Brian is looking.”\u003c/p\u003e\n\u003cp\u003eI nodded, “Hell, yeah. I don’t have anything after eleven on Fridays, I’m free from lunch on.”\u003c/p\u003e\n\u003cp\u003eShe pulled her cell out, “Call this number and ask for Brian and tell him you’re my friend.”\u003c/p\u003e\n\u003cp\u003eI looked at the number and punched it into my phone, “Thanks, Lise.”\u003c/p\u003e\n\u003cp\u003eShe shrugged, “Us hot law majors gotta stick together. The rest of them look like trolls.”\u003c/p\u003e\n\u003cp\u003eI laughed with her, but hated that she included me in her mean-girl mentality.\u003c/p\u003e\n\u003cp\u003eBrian was stoked, he actually used that word, that I was able to start Friday.\u003c/p\u003e\n\u003cp\u003eI sat on the couch, doing homework and watching another episode of Downton Abbey when Danny came in. He gave me a look, “You’re not watching the performance?”\u003c/p\u003e\n\u003cp\u003eI looked at the clock and shrugged, “It’s recording.” I had been avoiding it. He did bad things to my self-control without the singing. Adding it, was like putting gas on a fire.\u003c/p\u003e\n\u003cp\u003eHe grabbed the remote and changed it to the show. It was obviously cool in the streets where the stage was. I could see Gerry’s breath when the cameras went to him.\u003c/p\u003e\n\u003cp\u003eMy skin shivered hearing Lochlan’s voice. When the camera landed on him, my heart skipped a few beats. I couldn’t breathe. He was rocking it, as always. He held the microphone in his left hand and hopped with his right hand in the air. He kicked with the drums and bent down towards the crowd. He pointed at someone up front, winking and grinning.\u003c/p\u003e\n\u003cp\u003eI felt sick but I couldn’t look away. He was my own personal train wreck.\u003c/p\u003e\n\u003cp\u003eHe finished the song and shouted into the microphone, “We want to thank y’all for having us. Big shout out to Boston and the amazing folks there for helping us get to where we are. And I personally want to shout out to North Dakota, the state that holds my heart! Goodnight Detroit!”\u003c/p\u003e\n\u003cp\u003eThe crowd erupted.\u003c/p\u003e\n\u003cp\u003e“He says that North Dakota thing ever night now,” Danny muttered.\u003c/p\u003e\n\u003cp\u003eI nodded, “Great.”\u003c/p\u003e\n\u003cp\u003eLochlan waved and walked off the stage. The camera zoomed in on him. The broadcasters were talking, but I just watched as he pulled his phone out.\u003c/p\u003e\n\u003cp\u003e‘You having a good night?’ I instantly, got the text I watched him send.\u003c/p\u003e\n\u003cp\u003eI smiled when I saw it.\u003c/p\u003e\n\u003cp\u003e‘Yup!’\u003c/p\u003e\n\u003cp\u003eA different band walked onto the stage and the crowd started back up again.\u003c/p\u003e\n\u003cp\u003e‘I have some good news!’\u003c/p\u003e\n\u003cp\u003eI smiled, ‘What?’\u003c/p\u003e\n\u003cp\u003e‘Gonna call, that cool?’\u003c/p\u003e\n\u003cp\u003e‘Yup.’\u003c/p\u003e\n\u003cp\u003eI answered on the first ring, “Hey.”\u003c/p\u003e\n\u003cp\u003eHe laughed, “I can hear the show in the phone—you’re watching it?”\u003c/p\u003e\n\u003cp\u003eI took a deep breath, like hearing his voice made that possible.\u003c/p\u003e\n\u003cp\u003e“Erin?”\u003c/p\u003e\n\u003cp\u003eI opened my eyes, smiling, “Yep. You guys were amazing, as always.”\u003c/p\u003e\n\u003cp\u003eIt got quiet where he was suddenly, “We got invited to do a couple of the night shows in New York City in November, just before Thanksgiving.”\u003c/p\u003e\n\u003cp\u003eMy jaw dropped, “Oh my God. Congratulations.”\u003c/p\u003e\n\u003cp\u003e“Thank you. Can I see you Friday night? Like we hang out, like before? Maybe go to dinner?”\u003c/p\u003e\n\u003cp\u003eI ran my hands through my hair, “I can’t. I have to work.”\u003c/p\u003e\n\u003cp\u003eHis voice sounded panicked, “You got a job?”\u003c/p\u003e\n\u003cp\u003e“Yeah. My friend Lise got me one at that bar you guys always play on Fridays. I start there this Friday.”\u003c/p\u003e\n\u003cp\u003eHe didn’t talk. I pulled the phone from my face, checking for signal. “Hello?”\u003c/p\u003e\n\u003cp\u003eHe sounded pissed, “You can’t work there. Brian is a pig and tries to sleep with every chick that works there. He’s famous for his job interview.”\u003c/p\u003e\n\u003cp\u003eI scowled, “I already have the job. I don’t need an interview. And you work there, what do you care?”\u003c/p\u003e\n\u003cp\u003eHis tone didn’t improve, “You can’t work there.”\u003c/p\u003e\n\u003cp\u003eI sighed, “Okay well, we can talk about it when you get home on Friday.” I hated that I was the on thin ice with him for the sake of Thin Ice. If I rocked the boat, he’d trash a hotel room or beat someone up. God only knew.\u003c/p\u003e\n\u003cp\u003e“I’ll be home tonight.”\u003c/p\u003e\n\u003cp\u003eI sighed, “You have shit to do. Stop being a pain in the ass. How’s this, I won’t work a shift until you speak to Brian and assure him, I am to be left to work and not hit on.”\u003c/p\u003e\n\u003cp\u003eHe paused again. “Deal.” \u003c/p\u003e","sourceLink":"https://allnovel.net/my-side/page-20.html","bookId":2792,"creation":"Oct 5, 2019 5:37:38 PM","modification":"Oct 5, 2019 5:37:38 PM"}
