{"id":89658,"no":29,"title":"Page 29","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI shook my head, “No.”\u003c/p\u003e\n\u003cp\u003eHe didn’t return my kiss when I pressed my lips into his. I stroked his cheek, “Easy, beast, you can’t push me around anymore.”\u003c/p\u003e\n\u003cp\u003eHe struggled to look angry, but his lips curled into his sexy grin, “You sure about that?”\u003c/p\u003e\n\u003cp\u003eI bit my lip and nodded, “Yup.” He shoved me lightly. I fell back onto the bed. He stood over me and pulled his shirt off, “I think I just did though.”\u003c/p\u003e\n\u003cp\u003eI laughed as he dropped to his knees. I wrapped my legs around his waist and tried to sit up. He shoved me back down and lifted my shirt. He placed soft kisses on my belly button, as he undid my jeans. The door opened, “Hey, Er…” Danny stopped mid-sentence, “Oh fuck. I’ll never un-see that.” He turned and walked out.\u003c/p\u003e\n\u003cp\u003eI laughed. Lochlan shook his head and kicked the door shut, “Knock, Danny.”\u003c/p\u003e\n\u003cp\u003eDanny shouted from the hallway, “No, I’m good out here. Just wanted to mention, we gotta go.”\u003c/p\u003e\n\u003cp\u003eLochlan made a face. I sat up but he pushed me back down, “I need five minutes.”\u003c/p\u003e\n\u003cp\u003eDanny groaned, “Gross dude, that’s my sister.”\u003c/p\u003e\n\u003cp\u003eLochlan grinned and ripped my pants off. He sucked his middle finger and slid it inside of me. I sat up on my elbows, the way he liked, and gasped, watching his finger move in and out of me. He flipped my shirt and bra up, releasing my breasts. He ran his hands over my body and rolled one of my nipples lightly. It made me tighten everywhere with the sensation. The base of his finger glistened. I was panting when he pulled it out, but I never expected him to flip me over. He licked up my back, kissing and biting lightly while grinding his erection in my ass cheeks. He stood behind me, lifting me up and arching my hips back. He inserted himself slowly. I’d never had him this way. He spread my legs more and pulled my ass back. Luckily, my face was in the covers when the weird sound he always made me make, left my lips like tiny mewls. He bucked hard, making a loud moan replace the soft noises. He stopped and reached for his phone. He fiddled with it for a second, and then Sail by AWOLNATION started to play loudly, to cover our noises. He moved slowly with the song at first, sliding in and out of me, massaging my ass cheeks. He reached his hand around, stroking my clit, but still thrusting leisurely. I buried my face into my bed but he jerked me back up.\u003c/p\u003e\n\u003cp\u003eThe song ended and started again. He stopped rubbing my clit and increased his pace. He pumped hard, his balls replaced his finger, slapping against my clit. His body spanked against mine, the vibration brought my climax fast.\u003c/p\u003e\n\u003cp\u003eI struggled for breath as I came, standing and bent over. I gripped his cock, forcing his orgasm. He fucked hard as he filled me up. I couldn’t stand any longer. I fell forward, bringing him with me. He lay beside me and kissed my nose, “I’ll see you in three days.”\u003c/p\u003e\n\u003cp\u003eI smiled, “I’ll miss you.”\u003c/p\u003e\n\u003cp\u003eHe laughed, “Just stay off the Internet and trust me, okay?”\u003c/p\u003e\n\u003cp\u003eI nodded. He kissed me and climbed off the bed. I lay there, waiting for him to leave, so I could let pathetic, whiny Erin have her minute.\u003c/p\u003e\n\u003cp\u003eI didn’t go on the Internet but I did watch the live show. He was sexier on TV. It was frightening. It was his place. He deserved it, needed it, and earned every glorious second of it. Seeing him there, he wasn’t mine. He was a sexy guy who was rocking a stage and making everyone dance and shout, and wave their hands in the air.\u003c/p\u003e\n\u003cp\u003eI saw it then, there were really two Lochlans. The one on the stage was there for everyone. He was fun, crazy, and inspiring to watch. It was amazing to see someone take their dream and make it fly, with such skill and charm. He made you want to find your dream, be a success, live for the moment, and he made it look easy. His swagger and grace were beyond controllable.\u003c/p\u003e\n\u003cp\u003eThey were singing their bar song; it was the one that got the drinks flowing and the crowd feeling brotherly. It made me feel that way. Very indie and free. It was the song that had the most Tennessee in it. It was a Lochlan original.\u003c/p\u003e\n\u003cp\u003eHe kicked his foot to the drum and held the microphone out for the crowd to sing. The entire show burst into song. They knew ever word. The smile on his face could have fed me the rest of my life. Gerry and Mike were beaming. Even Lenny, the homebody was grinning from ear to ear over the keyboard. They had borrowed a guitar player from another local band. They tried to poach him but he had stayed loyal to his band. Bostonians were the most loyal people.\u003c/p\u003e\n\u003cp\u003eThe camera fell on Lochlan, as he finished the song with his head back, and a peaceful look on his face. The crowd erupted as the host walked over, clapping. “Man, you guys are hot!”\u003c/p\u003e\n\u003cp\u003eLochlan smiled. I saw him wink into the crowd. It made my stomach hurt, but I pushed it away.\u003c/p\u003e\n\u003cp\u003e“I heard you guys in Boston, not too long ago, amazing show. Ladies and gentlemen, thank Thin Ice for coming and playing for us. Their album will be available…” he looked at Lochlan, who laughed, “Soon.”\u003c/p\u003e\n\u003cp\u003e“There you have it… soon. Stay tuned, we have the entire cast of The Dreamers up after this.” He waved and the screen went to commercial.\u003c/p\u003e\n\u003cp\u003eMy phone didn’t ring. No texts came through. I stared at it for a while, and then decided it wasn’t too lame to message him.\u003c/p\u003e\n\u003cp\u003e‘Awesome show, baby. I loved it.’\u003c/p\u003e\n\u003cp\u003eHe never messaged me back. I could see it had delivered, but there was no message back.\u003c/p\u003e\n\u003cp\u003eI forced myself to study and not look on the net, or think about why he hadn’t texted me.\u003c/p\u003e\n\u003cp\u003eI woke to messages, weird ones like ‘hey, sorry there is just so much to do, I’ll call later’ and ‘hey, princess, we’re exhausted from the sets and rehearsal. Talk later.’\u003c/p\u003e\n\u003cp\u003eI shrugged it off, until my late-morning class with Dean.\u003c/p\u003e\n\u003cp\u003eHe waved me over after class, “Did Gerry or Lochlan send you the pics from the people they’ve met?”\u003c/p\u003e\n\u003cp\u003eI shook my head, clutching my books and forbidding myself to think the worst.\u003c/p\u003e\n\u003cp\u003eHe pulled out his phone and held them up. There were pictures of everyone, it was crazy chaos. The band was in front of restaurants, at bars, and I couldn’t believe the famous faces gracing Dean’s phone. Lochlan letting famous female singers lick his face and kiss him. The group of them were smiling brightly and hanging themselves off dozens of different people for pictures.\u003c/p\u003e\n\u003cp\u003eDean noticed my face and pulled the phone back, “He’s such a joker.”\u003c/p\u003e\n\u003cp\u003eI nodded blankly. I was secretly hyperventilating. I smiled weakly, “I better go. I’m leaving in two hours for Nashville.” I could feel the glossy tears starting to form.\u003c/p\u003e\n\u003cp\u003eHe swallowed, “I’m sorry. I assumed you didn’t care about the fun drunk he was, or you wouldn’t date someone like him.” Oh my God… he was drunk for the pictures. God only knows, what he did.\u003c/p\u003e\n\u003cp\u003eI laughed awkwardly, “Oh, I am. He’s crazy. I’m just tired.”\u003c/p\u003e\n\u003cp\u003eHe hadn’t done anything wrong. I needed to remind myself, he was acting the part. He was hugging famous people and doing things mere mortals would never.\u003c/p\u003e\n\u003cp\u003eThe walk home gave me the chance to ponder, if I was doing what abused women did? Was I justifying him? I needed to see inside of his eyes. I needed to know if I was still there.\u003c/p\u003e\n\u003cp\u003eI packed my things and got my flight to Nashville. It wasn’t nearly as bad, probably because I had been flying so much. His family lived in a small town just on the outskirts of Nashville called Mt. Juliet. I knew nothing about them, beyond that.\u003c/p\u003e\n\u003cp\u003eWhen I got to the Nashville airport, I pulled my carry-on to the waiting area. I smiled when I saw a handsome dark-haired guy in a lime-green tee shirt and tight jeans, holding a black jean jacket. I walked right up to him, “You have to be Alex.”\u003c/p\u003e\n\u003cp\u003eHe smiled and it was insane. They were identical but Alex was better looking. He had spiky, dark hair, styled perfectly, and the brightest smile. He flashed it at me and I almost fainted. He was a thinner and cleaner Lochlan. And way better dressed.\u003c/p\u003e\n\u003cp\u003e“Erin!” he squealed and attacked; his emotions were everywhere, like they had exploded from a box.\u003c/p\u003e\n\u003cp\u003eI hugged back, “It’s nice to meet you.”\u003c/p\u003e\n\u003cp\u003eHe pulled back, “Oh my God, you are delicious. Look at you, no wonder he loves you.”\u003c/p\u003e\n\u003cp\u003eMy stomach burned. I’d hardly spoken to him, since he’d left for New York. It was weird.\u003c/p\u003e\n\u003cp\u003eI cleared my throat, “Thanks for coming to get me.”\u003c/p\u003e\n\u003cp\u003eHe rolled his eyes, “It’s a twenty minute drive. It’s not a liver.”\u003c/p\u003e\n\u003cp\u003eI laughed. He looped his arm in mine, “Mom and Dad and Lissie are going to go nuts. They have been dying to meet the unstoppable Lochlan Barlow’s beautiful girlfriend, that he never shuts up about.”\u003c/p\u003e\n\u003cp\u003eI glanced at him, “I can’t wait to meet them too.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “It’s crazy you guys just met. It feels like he’s known you forever.”\u003c/p\u003e\n\u003cp\u003eI nodded, fighting the frown on my face, “I know. It was August 12th at 4 in the afternoon. I maced him and some fake-breasted female. Got them both handcuffed by the police and we’ve been inseparable ever since.”\u003c/p\u003e\n\u003cp\u003eHe winced, “Longest three and half months of your life?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “It’s felt like I’ve crammed everything humanly possible into the time.” I almost stopped myself from talking, but he was easier to be around than any one person I’d ever met. I gave him a soft smile, “But I wouldn’t trade the time. It’s been fun. Bizarre and fun.”\u003c/p\u003e\n\u003cp\u003eHe laughed and led me to a car in the short-term parking. It was beautiful, a red BMW M6. I knew the car because it was on the 2013 calendar hanging in our kitchen. My hands trembled when I touched it, dragging my fingers along it.\u003c/p\u003e\n\u003cp\u003e“It’s so beautiful.” It was my dream car. The one I would have bought for myself, if I were rich.\u003c/p\u003e\n\u003cp\u003eHe flashed me the smile and tossed me the keys. I instantly went in two directions at once, “I can’t.” One side of me wanted to but the other really didn’t.\u003c/p\u003e\n\u003cp\u003eHe nodded, “Yeah, you can. It’s paid for and insured. I just watched you cargasm. You can drive.” He climbed into the passenger side, after sticking my bag in the trunk. I sat in the driver’s seat, taking mental pictures of every angle. It was stunning. Not too showy but sleek and sexy. It had the European flare and class, but the red paint gave it the American bad-ass feeling I loved about the car. I stroked the steering wheel and put the key in. The engine gave a slight roar and then purred. I looked at him, “Oh my.” \u003c/p\u003e","sourceLink":"https://allnovel.net/my-side/page-29.html","bookId":2792,"creation":"Oct 5, 2019 5:37:38 PM","modification":"Oct 5, 2019 5:37:38 PM"}
