{"id":89663,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDean caught up with me in the hallway, “Hey.” He grabbed my arm.\u003c/p\u003e\n\u003cp\u003eI smiled, “Hey, how’s it going?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “I marked your tests and I’m confused. Are you blowing this on purpose?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “No, I’ve just been caught up in it all, ya know.”\u003c/p\u003e\n\u003cp\u003eHe linked his arm in mine, “Let’s go get a coffee. You need a peppy speech and I happen to rock those like I a boss.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes, “You’re starting to sound like Gerry and them.”\u003c/p\u003e\n\u003cp\u003eHe snorted, “At least I’m not giving up my dreams to be with them.”\u003c/p\u003e\n\u003cp\u003e“Dean, he’s not a normal guy. My dreams barely register with his life.”\u003c/p\u003e\n\u003cp\u003eHe gave me a bizarre look, “You mean because he has ADHD and his mom is dying? You think there aren’t a thousand like him in this state alone?”\u003c/p\u003e\n\u003cp\u003eI met his challenging look, “Are they performing live and having every second of their bad behavior scrutinized like he his? I’d say he’s one in a billion.”\u003c/p\u003e\n\u003cp\u003eHe ran his hands through his hair, “Erin, you have to have something that’s yours. Every relationship needs that.”\u003c/p\u003e\n\u003cp\u003eI shook my head, “My parents both have something that’s theirs and they don’t have each other anymore. They wanted their own things too much. If you watch celebrity couples, one always hangs back a bit, lets the other one have the lime light.”\u003c/p\u003e\n\u003cp\u003eHe rolled his eyes, “You aren’t exactly a celebrity couple.”\u003c/p\u003e\n\u003cp\u003eI laughed, “Harsh, I mean… I’m cool with pulling back and supporting him.”\u003c/p\u003e\n\u003cp\u003e“So you’re okay with blowing all that money and the semester, because he’s a dramatic rock star?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “I’m not okay with it. I just want to be there for him. They start tours next year; they’re already booked into seventeen. That’s a lot of shows. Three are sold out. He is going to need me.”\u003c/p\u003e\n\u003cp\u003eHe crossed his arms, releasing me, “Why? Are you a magical pill or are you just trying to convince him he needs you, so you feel justified in your suspicions of him?”\u003c/p\u003e\n\u003cp\u003eGuilt tore into me, “No offense sir, but screw you.”\u003c/p\u003e\n\u003cp\u003eHe laughed bitterly, “We aren’t doing the teacher-student thing right now and you know it.”\u003c/p\u003e\n\u003cp\u003e“I made a mess of our relationship. I made him feel like he had to choose me or the music.”\u003c/p\u003e\n\u003cp\u003eHe grabbed my shoulders, “Honey, the solution isn’t him or your career. It’s trusting him and letting him rock. I’m not stressed about Gerry. If he doesn’t want to be with me anymore or finds someone new, I’ll be devastated; but I’m worthy of someone who wants to be with me, as I am. Gerry isn’t the only man in the world and he’s not the reason I’m happy. I’m happy on my terms. He makes all the good things better.” His words resonated. “Don’t drop it. You’ll have to pull your grades up next semester but don’t drop out. I’ll help you.”\u003c/p\u003e\n\u003cp\u003eI nodded. It was the choice I wanted. If I was honest with myself and standing at the crosswalk like the teacher, I would choose my dreams—not let guilt and a lack of trust get me down. “Thank you.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “It’s my job.”\u003c/p\u003e\n\u003cp\u003eI went home after coffee and took a hot bath. My phone rang, just as I was getting settled. I sat up and dried my hand.\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003eIt was Alex, “Hey, Erin.”\u003c/p\u003e\n\u003cp\u003eI smiled, “Hi. How are you?”\u003c/p\u003e\n\u003cp\u003e“Not good.”\u003c/p\u003e\n\u003cp\u003eMy stomach dropped.\u003c/p\u003e\n\u003cp\u003e“What’s happened? Is it Judith?”\u003c/p\u003e\n\u003cp\u003eHe sighed, “No. Mom is good. She’s doing great. It’s Dad, if you can believe it.”\u003c/p\u003e\n\u003cp\u003e“Fuck off.”\u003c/p\u003e\n\u003cp\u003e“Not even kidding. He’s had a massive heart attack. The doctor sad it was just a matter of time, and this whole year has been so stressful for them. He’s getting stabilized and then they’re doing surgery.”\u003c/p\u003e\n\u003cp\u003e“His cholesterol?”\u003c/p\u003e\n\u003cp\u003e“Yes and blood pressure, and diabetes, and whatever else he has going on that he hasn’t warned us about.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes, “Have you called Lochlan?”\u003c/p\u003e\n\u003cp\u003e“Mom doesn’t want him called. She wants him to focus on himself and the band. She wants him to stay in Europe and do the shows.”\u003c/p\u003e\n\u003cp\u003eI gasped, “His fucking dad is about to have surgery. He needs to come home.”\u003c/p\u003e\n\u003cp\u003e“I know. They feel like a burden and like they’re holding him back. And you know him, he’s going to say that him leaving Dad to care for her himself, and the stress of his career, is what caused this.”\u003c/p\u003e\n\u003cp\u003eI felt something I’d never felt before, ”You know that’s not true.” I would protect him from anything, including them.\u003c/p\u003e\n\u003cp\u003e“I know. But you know what he’s like. He’s going to say this was his fault, and quit music. Erin, he’ll quit the band, just like he did the job he had lined up.”\u003c/p\u003e\n\u003cp\u003eI pulled the plug on the tub, “I’ll be there as fast as I can be.” I called my Dad and begged for him to book my flight. I was nearly broke. I turned on the water works; it was easy.\u003c/p\u003e\n\u003cp\u003eMy back was aching, and I was flooded with memories of the article I’d read about radiation on planes. I ate my salted peanuts and drank my ginger ale, trying not to rock and think about plane crashes. At least the flight was only just over two hours.\u003c/p\u003e\n\u003cp\u003eLissie picked me up. She looked rough. I hugged her, letting her cry on my shoulder.\u003c/p\u003e\n\u003cp\u003e“He’s not strong enough for surgery. They can’t do anything.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes and just breathed. I didn’t know what to say. My phone started ringing. I pulled it out and answered, still holding her, “Hey.”\u003c/p\u003e\n\u003cp\u003eI smiled, “Hey.” He sounded good. I hated that I was about to ruin that.\u003c/p\u003e\n\u003cp\u003e“We just got home and you’re not here. I saw your carry-on was gone. You okay?”\u003c/p\u003e\n\u003cp\u003eI nodded, “No.” I couldn’t lie to him. Lissie pulled back and nodded, “Tell him.”\u003c/p\u003e\n\u003cp\u003eI handed her the phone, “Do you want to?”\u003c/p\u003e\n\u003cp\u003e“Is that my sister? What the fuck is going on?”\u003c/p\u003e\n\u003cp\u003eShe shook her head, “It’s better if you do it.”\u003c/p\u003e\n\u003cp\u003eI placed the phone over my ear, “I need you to calm down and listen to me. Do not overreact and do not stop listening, until I get it all out okay?”\u003c/p\u003e\n\u003cp\u003e“FUCKING TELL ME WHATS WRONG!”\u003c/p\u003e\n\u003cp\u003eI stayed calm, “Put Danny on if you can’t stay calm.”\u003c/p\u003e\n\u003cp\u003eHe sounded savage, “I’m calm.”\u003c/p\u003e\n\u003cp\u003eI would have laughed, if it had been any other circumstances. “Your dad took a heart attack. He’s in the hospital and they’re trying to stabilize him. Your mom is fine. Alex has her in the hospital so she can see him. She’s in her wheelchair and completely fine. He is being stabilized.”\u003c/p\u003e\n\u003cp\u003e“Are you done now?”\u003c/p\u003e\n\u003cp\u003eI frowned, “Yeah.”\u003c/p\u003e\n\u003cp\u003e“Be there in three hours. We’ll meet you at the hospital.”\u003c/p\u003e\n\u003cp\u003eHe hung up the phone, and I couldn’t help but wonder what he was smashing.\u003c/p\u003e\n\u003cp\u003eI sighed and gave his sister my weakest smile, “They’ll be here in a few hours.”\u003c/p\u003e\n\u003cp\u003eShe hugged herself and showed me the way to the car.”\u003c/p\u003e\n\u003cp\u003eThe hospital was silent until they arrived. I was giving Judith a sip of water when we heard his voice. Her eyes opened wide. She looked at me with daggers. I gave them back, “He was done the show. He doesn’t have another performance now till after Christmas.”\u003c/p\u003e\n\u003cp\u003eShe blinked twice. I nodded, “Okay, then.”\u003c/p\u003e\n\u003cp\u003eHe bent, kissing her face and then mine. His eyes were black when he stood back and looked down on me. “How is he?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “Nothing has changed.”\u003c/p\u003e\n\u003cp\u003eHe pointed down the hall and clenched his jaw, “I just talked to his doctor and he’s under the impression, we understand they can’t do anything for him.”\u003c/p\u003e\n\u003cp\u003eI felt my gaze weaken. His weakened with it. He didn’t fill with fury, the way I thought he would. He looked destroyed. He walked into the room and laid his face on his dad’s stomach. My heart broke.\u003c/p\u003e\n\u003cp\u003eI took Judith for a walk. We sat in the window of a breezeway, enjoying the flash rainstorm outside. I didn’t look at her. I just spoke softly, “I think that I have learned more from your family in the weeks I’ve known them, than I have in the decades with mine.”\u003c/p\u003e\n\u003cp\u003eShe blinked fast. I pulled my cell phone out and nodded, “Okay. I can do this.”\u003c/p\u003e\n\u003cp\u003eShe blinked, 9 times, 12 times, 15 times, 22 times, 5 times, 21 times, took a break, 4 times, 1 time, 21 times, 7 times, 8 times, 20 times, 5 times, 18 times. I counted them out in my head and smiled. ILOVEUDAUGHTER, was what it said on my cell phone screen. I leaned into her, “Thank you. I love you too.” And I did. No amount of time was needed to make me love them.\u003c/p\u003e\n\u003cp\u003eWe sat in the silence and watched the rain and held hands. Danny came running down the hallway, I knew by his face what had happened. He stopped when he saw me looking. His eyes shone. He turned around and walked back.\u003c/p\u003e\n\u003cp\u003eI looked down on her. Her face was covered in tears. They were silent. I didn’t belittle the fact, I knew she had felt him leave. There was no way she saw Danny. She was watching the rain. She gripped my hand a little bit tighter. We sat there until she squeezed, “Ready to go back?”\u003c/p\u003e\n\u003cp\u003eShe blinked twice. I wheeled her back to the room. Lochlan was gone, Danny, Gerry, and Mike were sitting on the seats outside of the room. I wheeled her to the door. Lissie took her from there. I whispered, “I’m so sorry.”\u003c/p\u003e\n\u003cp\u003eShe shook and wheeled her mother into the room to say her goodbyes. I turned and ran. I didn’t know where he would go. I never memorized him, the way he did me. I ran hard until I reached the window showing one side of the courtyard. It dawned on me, I knew he would be in the rain. I pushed the door open and walked out. He was there, sitting on a stone bench amongst large trees and bushes. He was hunched over. I stood in front of him for a moment, getting completely soaked. He grabbed my hips and pulled me into his lap. He buried his face in my neck, as I wrapped my legs around him. He folded around me completely. I closed my eyes and let the rain wash all over us. \u003c/p\u003e","sourceLink":"https://allnovel.net/my-side/page-34.html","bookId":2792,"creation":"Oct 5, 2019 5:37:38 PM","modification":"Oct 5, 2019 5:37:38 PM"}
