{"id":89671,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI shook my head, “I’m twenty-five, not forty. I hate it. Take it back.”\u003c/p\u003e\n\u003cp\u003eHe pulled me back, “Princess, you have to check it out before you hate it. There’s a damned movie theatre in there.”\u003c/p\u003e\n\u003cp\u003eI tilted my head, “You are a liar.”\u003c/p\u003e\n\u003cp\u003eHis voice rose, “I swear to God, it’s a fucking movie theatre.”\u003c/p\u003e\n\u003cp\u003eMy hand shot out, pointing at him, “What did I say about swearing?”\u003c/p\u003e\n\u003cp\u003eHe put his hands out, “Deep breaths. Just take deep breaths.” He dragged me to the van and opened the large, sliding door. He shoved me inside gently, since I was liable to burst. I climbed into the seat. He started the van and turned on the air conditioning. It blew down on me from the roof. He pressed buttons and instantly Fear and Loathing in Las Vegas started to play.\u003c/p\u003e\n\u003cp\u003eI gave him a look. He shrugged, “We don’t have kids movies yet.”\u003c/p\u003e\n\u003cp\u003eI watched the movie and nestled into the chair. I sighed and gave him a look, “This is pretty cool.”\u003c/p\u003e\n\u003cp\u003eHe leaned in for a kiss, “So when I leave tomorrow for London, you’ll take it for a drive. Get used to being in a mommy mobile?”\u003c/p\u003e\n\u003cp\u003eI sneered, “Don’t call it that.”\u003c/p\u003e\n\u003cp\u003eHe laughed, “Baby steps.”\u003c/p\u003e\n\u003cp\u003eI pointed at the screen, “That I like.”\u003c/p\u003e\n\u003cp\u003eHe nodded, “I told you. I’m having a rockin’ week. Double platinum for our first non indie album and now this sweet ride.” I rolled my eyes but he leaned in, brushing his lips against mine, “Did I also tell you how pretty you are and how lucky I am?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “Not today.”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed but I could see myself in them still. I had a feeling, I always would. He got that sexy grin and I shook my head again, “Not in the minivan. The kids are going to sit back here. Ewww.”\u003c/p\u003e\n\u003cp\u003eHe laughed, “Kids? You already planning the next one?”\u003c/p\u003e\n\u003cp\u003eI nodded, “Yeah. We can’t have one, they’re always, well look at Leon. He’s so… no. I need at least two, but then I was thinking since you, Alex, and Lissie are so sweet together, we should have three.”\u003c/p\u003e\n\u003cp\u003eHe kissed my nose, “One day at a time. You and your plans. Now come in the house, so I can show you how pretty I think you are before we take this minivan for a spin.”\u003c/p\u003e\n\u003cp\u003eI followed him inside, I would have followed him anywhere.\u003c/p\u003e\n\u003cp\u003eThat’s my side\u003c/p\u003e\n\u003cp\u003eThe end \u003c/p\u003e","sourceLink":"https://allnovel.net/my-side/page-42.html","bookId":2792,"creation":"Oct 5, 2019 5:37:38 PM","modification":"Oct 5, 2019 5:37:38 PM"}
