{"id":78077,"no":52,"title":"Page 52","content":"\u003cp\u003eBy that night, however, his fury had been reduced to a dangerous calm. When Graverley had attempted to retie his wrists after Royce finished eating, Graverley had found himself jerked to the ground with the leather thong wrapped taut around his throat, Royce\u0027s face, dark with rage, only inches from his own. \"Attempt to bind me again,\" Royce had bit out between his teeth, \"and I\u0027ll slit your throat within five minutes after my interview with Henry.\"\u003c/p\u003e\n\u003cp\u003eWrithing in surprise and fear, Graverley had nevertheless managed to gasp, \"Five minutes after your interview with the king… you\u0027ll be on your way… to the gallows!\"\u003c/p\u003e\n\u003cp\u003eWithout thinking, Royce had tightened his hand, the subtle twist of his wrist effectively cutting off his adversary\u0027s air. Not until his victim\u0027s face had begun to change color did Royce realize what he was doing, and then he released him with a contemptuous shove. Graverley staggered unsteadily to his feet, his eyes blazing with hatred, but he gave no order to Henry\u0027s men to seize Royce and bind him. At the time, Royce had attributed that to the likelihood that Graverley had realized he could be treading on dangerous ground by deliberately abusing the rights of Henry\u0027s favorite noble.\u003c/p\u003e\n\u003cp\u003eNow, however, after waiting weeks for a summons from the king, Royce was beginning to wonder if Henry was actually in complete accord with the privy councillor. From his position at the window, Royce stared out at the dark night that was scented with the usual malodorous smells of London—sewage, garbage, and excrement—trying to find a reason for Henry\u0027s obvious reluctance to see him and discuss the reason Royce was being incarcerated.\u003c/p\u003e\n\u003cp\u003eHe had known Henry for twelve years; he had fought beside him at the Battle of Bosworth Field, had watched as Henry was proclaimed king and crowned on that same battlefield. In recognition of Royce\u0027s deeds during that battle, Henry had knighted him that same day, despite the fact that Royce was only seventeen. It was, in fact, his first official act as king. In the years that followed, Henry\u0027s trust and reliance on Royce had grown apace with his mistrust of his other nobles.\u003c/p\u003e\n\u003cp\u003eRoyce fought his battles for him and each flamboyant victory made it easier for Henry to exact—without bloodshed—concessions from England\u0027s enemies and Henry\u0027s personal ones. As a result, Royce had been rewarded with fourteen estates and riches enough to make him one of the wealthiest men in England. Equally important, Henry trusted him—trusted him enough to permit Royce to fortify his castle at Claymore and to keep a private, liveried army of his own men. Although, in this instance, there was strategy behind Henry\u0027s leniency: the Black Wolf was a threat to all Henry\u0027s enemies; the sight of pennants with a snarling wolf pictured on them often crushed hostility before it had a chance to bloom into opposition.\u003c/p\u003e\n\u003cp\u003eIn addition to trust and gratitude, Henry had also given Royce the privilege of speaking his mind freely and without the interference of Graverley and the other members of the powerful Star Chamber. And that was what was niggling at Royce now—this long period of refusal to give Royce an audience in order to defend himself was not indicative of the sort of relationship he\u0027d enjoyed with Henry in the past. Nor did it bode well for the outcome of the audience itself.\u003c/p\u003e\n\u003cp\u003eThe sound of a key being inserted in his door made Royce glance up, but hope shriveled when he saw it was only a guard bearing a tray with his meal. \"Mutton, my lord,\" the guard provided helpfully in answer to Royce\u0027s unspoken inquiry.\u003c/p\u003e\n\u003cp\u003e\"God\u0027s teeth!\" he exploded, his impatience with everything coming to a rolling boil.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t like mutton much myself, my lord,\" the guard agreed, but he knew the food had nothing to do with the Black Wolf\u0027s outburst. After putting the tray down, the man straightened respectfully. Confined or not, the Black Wolf was a dangerous man and, more importantly, a great hero to every male who fancied himself a true man. \"Do you wish for anything else, my lord?\"\u003c/p\u003e\n\u003cp\u003e\"News!\" Royce bit out, his expression so harsh, so threatening, that the guard backed away a step, before he nodded obediently. The Wolf always inquired about news—usually in a friendly man-to-man way—and tonight the guard was happy to be privy to some gossip. Still, \u0027twas not exactly gossip the Wolf would likely be happy to hear.\u003c/p\u003e\n\u003cp\u003e\"There is some news, my lord. Gossip it be, but reliable-like, heert from those what are in a position to know.\"\u003c/p\u003e\n\u003cp\u003eRoyce was instantly alert. \"What \u0027gossip\u0027?\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Tis said yer brother was called afore the king last night.\"\u003c/p\u003e\n\u003cp\u003e\"My brother is here in London?\"\u003c/p\u003e\n\u003cp\u003eThe guard nodded. \"Came here yesterday, demandin\u0027 to see yer and practically threatnin\u0027 to lay siege to the place if\u0027n he didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eAn awful feeling of foreboding crept over Royce. \"Where is he now?\"\u003c/p\u003e\n\u003cp\u003eThe guard tipped his head to the left. \"One floor above ye and a few rooms to the west, I heert. Under guard.\"\u003c/p\u003e\n\u003cp\u003eRoyce expelled his breath in a rush of frustrated alarm. Stefan\u0027s coming here was reckless in the extreme. When Henry was angered, the best tack was to stay out of his way until he got control of his royal temper. \"Thank you,\" Royce said, trying to recall the guard\u0027s name, \"er… ?\"\u003c/p\u003e\n\u003cp\u003e\"Larraby, my—\" They both broke off and glanced toward the door as it swung open. Graverley stood in the doorway, grinning evilly.\u003c/p\u003e\n\u003cp\u003e\"Our sovereign has bade me bring you to him.\"\u003c/p\u003e\n\u003cp\u003eRelief mixed with concern for Stefan ran through Royce, as he stalked past Graverley, shouldering him aside. \"Where is the king?\" Royce demanded.\u003c/p\u003e\n\u003cp\u003e\"In the throne room.\"\u003c/p\u003e\n\u003cp\u003eRoyce, who\u0027d been a guest here at the Tower several times in the past, knew it well. Leaving Graverley to follow and try to keep pace, he strode swiftly down the long hall to the steps which wound down two stories and then led through a maze of chambers.\u003c/p\u003e\n\u003cp\u003eAs he passed through the gallery with his escort/ guard following behind, Royce noted that everyone was turning to stare. Judging from the derision on many of their faces, the fact that he\u0027d been confined here and was out of favor with Henry was a fact known to all.\u003c/p\u003e\n\u003cp\u003eLord and Lady Ellington, attired in full court dress, bowed to Royce as he passed, and again Royce witnessed their strange expressions. He was accustomed to some fear and mistrust when he was at court; but tonight he could have sworn they were hiding amused smiles, and he discovered that he vastly preferred being mistrusted to being laughed at.\u003c/p\u003e\n\u003cp\u003eGraverley gleefully provided the answer for the odd looks: \"The story of Lady Jennifer\u0027s escape from the notorious Black Wolf has been cause for much hilarity here.\"\u003c/p\u003e\n\u003cp\u003eRoyce clamped his jaws together and increased his pace, but Graverley quickened his to match. In a confiding voice ringing with mockery, he added, \"So has the story of our famous hero\u0027s infatuation with a plain Scottish girl who ran away, wearing a fortune in pearls he\u0027d given her, rather than wed him.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/a-kingdom-of-dreams-westmoreland-saga-1/page-52.html","bookId":1848,"creation":"Oct 5, 2019 4:03:10 PM","modification":"Oct 5, 2019 4:03:10 PM"}
