{"id":96796,"no":58,"title":"Page 58","content":"\u003cp\u003eA F T E R H E R U N F O R T U N A T E (not to say costly) conversation with Harwood Zeller, after she’d called three different people to arrange a lunch date and found them all otherwise engaged, she skipped lunch and took a class at Integral Yoga, thinking it would calm her down. As far as she could tell, it had no effect whatsoever.\u003c/p\u003e\n\u003cp\u003eSo she returned to the gallery and seduced Chloe.\u003c/p\u003e\n\u003cp\u003eAt least that was what she thought she was doing. But it played out a little differently than she’d planned.\u003c/p\u003e\n\u003cp\u003eShe’d waited until the gallery was empty, then surreptitiously locked the door. She went over and sat on the edge of Chloe’s desk, swinging her leg, and asked the girl if she’d had any more piercings since she’d gone to Medea.\u003c/p\u003e\n\u003cp\u003e“Well, I got the other nipple done,” Chloe said. “Want to see?” They went into the back office, and Chloe cheerfully bared her breasts, and there was a stud in each, and how large and well formed they were.\u003c/p\u003e\n\u003cp\u003e“I went to Medea myself,” she said, and Chloe said No, really?\u003c/p\u003e\n\u003cp\u003eYou’re kidding me, right? In response she’d unbuttoned her own blouse, unclasped her bra, and held her breasts in the palms of her hands, offering them for inspection.\u003c/p\u003e\n\u003cp\u003e“Oh, they’re beautiful, Susan!”\u003c/p\u003e\n\u003cp\u003e“Tiny, compared to yours.”\u003c/p\u003e\n\u003cp\u003e“Oh, I’m a cow. Yours are so pretty.”\u003c/p\u003e\n\u003cp\u003eCould anything really be this easy? “I have something else to show you,” she said, and quickly got out of her slacks, removing her panties in the same motion.\u003c/p\u003e\n\u003cp\u003eChloe gaped, reached out a hand, touched. With her other hand she grabbed Susan behind the head and kissed her full on the mouth. Below, the girl’s fingers were busy.\u003c/p\u003e\n\u003cp\u003e“We can go to my apartment,” she managed to say.\u003c/p\u003e\n\u003cp\u003e“First we’re each gonna get off,” Chloe said, “and then we’ll go to your apartment.”\u003c/p\u003e\n\u003cp\u003eSo it was by no means clear who had seduced whom. Chloe, it turned out, had had plenty of experience with women, and had originally shown Susan her breasts not out of sheer exhibitionism but in the hope it might lead somewhere. “But you were so cool,” Chloe said, “I just figured you were straight as a gate. So I let it alone.” At one point, lying on top of Chloe, tasting her own sex on Chloe’s mouth, her own breasts cushioned by Chloe’s breasts, she fitted her hands lightly around the girl’s neck, lacing her fingers, putting her thumbs together.\u003c/p\u003e\n\u003cp\u003eShe thought, What are you doing? Stop it!\u003c/p\u003e\n\u003cp\u003eN O T T H E N E X T D A Y or the day after, she left the gallery and walked down to the Village. Like some demented stalker, she went first to Charles Street, where she stood gaping at the brownstone where Marilyn Fairchild had lived and died, and then to Bank Street, where John Blair Creighton was presumably hard at work on the book that would make him rich.\u003c/p\u003e\n\u003cp\u003eShe got lost looking for the Kettle of Fish, but found it, and went in and had a glass of white wine, hoping he’d walk in. He didn’t, and it was hard to see why anybody would. A collection of drunks and losers, she thought, with most of them able to claim membership in both groups. She finished her wine, fended off the halfhearted overtures of a man with the emptiest eyes she’d ever seen, and went home.\u003c/p\u003e\n\u003cp\u003eHis number was in the book. That was how she’d found his address. She dialed his number and it rang and his machine picked up. She heard the message all the way through before ringing off.\u003c/p\u003e\n\u003cp\u003eShe’d done this before. It was a way to hear his voice. But she wasn’t about to leave a message. What could she say?\u003c/p\u003e\n\u003cp\u003eThere had to be some way to get him to call her, some way to get past the velvet rope and into his life. That was all she needed.\u003c/p\u003e\n\u003cp\u003eIf she was right in what she sensed, he’d be drawn to her as fiercely as she was to him. If not, that would be almost as good; she’d get over her obsession and be free to live her life.\u003c/p\u003e\n\u003cp\u003eAll she had to do was get one small foot in the door. But how?\u003c/p\u003e\n\u003cp\u003eIn the morning, when the answer came to her, she couldn’t believe it had taken her so long to think of it.\u003c/p\u003e\n\u003cp\u003eS H E G A V E H E R N A M E to the receptionist, and seconds later Maury Winters was on the line. “Your jury duty’s not until October,” he said, “and yes, you can get out of it. All you have to do is move to Australia.”\u003c/p\u003e\n\u003cp\u003e“They’ve got all these poisonous spiders there.”\u003c/p\u003e\n\u003cp\u003e“Spiders? I thought kangaroos.”\u003c/p\u003e\n\u003cp\u003e“Kangaroos I wouldn’t mind. Spiders I can live without.”\u003c/p\u003e\n\u003cp\u003e“What’s your source for these spiders that I never until this minute heard about?”\u003c/p\u003e\n\u003cp\u003e“The Discovery Channel.”\u003c/p\u003e\n\u003cp\u003e“If they say spiders,” he said, “there’s spiders. Don’t move to Australia. Go do your civic duty. Three days and you’re done.”\u003c/p\u003e\n\u003cp\u003e“That’s not what I called about, Maury.”\u003c/p\u003e\n\u003cp\u003e“It figures.”\u003c/p\u003e\n\u003cp\u003e“I’m interested in one of your clients.”\u003c/p\u003e\n\u003cp\u003e“I’ve got dozens of clients,” he said, “and believe me, you’re not interested in any of them. And if they were interested in you, you know what I’d tell you? Go to Australia. Spiders, schmiders, go to Australia.”\u003c/p\u003e\n\u003cp\u003e“John Creighton,” she said.\u003c/p\u003e\n\u003cp\u003e“Oh, him,” he said. “The gambler.”\u003c/p\u003e\n\u003cp\u003e“Does he have a gambling jones? I didn’t know that. Because there’s no hint of it in his books.”\u003c/p\u003e\n\u003cp\u003e“As far as I personally know,” he said, “he couldn’t tell you if a straight beats a flush. No, this is a different kind of gambling. The DA’s office offered him an easy out. Plead to involuntary manslaughter, do no time, case closed. He turned them down.”\u003c/p\u003e\n\u003cp\u003e“He wouldn’t have to go to prison? Is he crazy? Why did he turn it down?”\u003c/p\u003e\n\u003cp\u003eIt made sense when he explained it. By taking the plea, he’d be stating for the record that he’d killed Marilyn Fairchild. He couldn’t take the deal and go on maintaining his innocence.\u003c/p\u003e\n\u003cp\u003e“My opinion,” he said, “it’s a good gamble. Odds are they’ll drop the charges if he doesn’t take a plea and give them an out. Everybody’d be just as happy to put this one on the Carpenter’s tab, and there’s a lot of circumstantial chazerai to support it. The connection with Pankow, the kid who cleaned all three bars and the whorehouse, and also cleaned for Fairchild and discovered her body. Cleaned the whole apartment first, incidentally, which is why they didn’t find any of the bastard’s fingerprints there. One print in that apartment and they’d drop all charges and shake his hand in public.”\u003c/p\u003e\n\u003cp\u003e“That’s what it would take?”\u003c/p\u003e\n\u003cp\u003e“To make this go away? That, or a couple good sightings of the son of a bitch in the right place at the right time. I let my detective go, he couldn’t come up with anything, but he tried. Went to the bar, the Fish Kettle, showed the picture, like they haven’t all seen the schmuck’s picture a thousand times already. There are plenty of people who think they saw him in the Village, but nobody can put him in the bar.”\u003c/p\u003e\n\u003cp\u003e“But you think they’ll drop the charges anyway.”\u003c/p\u003e\n\u003cp\u003e“I think so, and if we have to go to trial I think we’ll get a Not Guilty, but it’s still a gamble. Now I’ve got a question. Why the hell do you care?”\u003c/p\u003e\n\u003cp\u003e“I want to meet him.”\u003c/p\u003e\n\u003cp\u003e“You want to meet him. Creighton? Or the Carpenter?”\u003c/p\u003e\n\u003cp\u003e“God forbid. Creighton, of course.”\u003c/p\u003e\n\u003cp\u003e“You said you read his books.”\u003c/p\u003e\n\u003cp\u003e“All of them.”\u003c/p\u003e\n\u003cp\u003e“They any good?”\u003c/p\u003e\n\u003cp\u003e“You haven’t read them yourself?”\u003c/p\u003e\n\u003cp\u003e“I’m his attorney, not his editor. What does he need me to read his books? Are they any good?”\u003c/p\u003e\n\u003cp\u003e“They’re excellent.”\u003c/p\u003e\n\u003cp\u003e“I’m relieved to hear that. Maybe he’ll be able to pay my fee.”\u003c/p\u003e\n\u003cp\u003e“You must know about—”\u003c/p\u003e\n\u003cp\u003e“About the contract he signed, yes, of course I know about it.\u003c/p\u003e\n\u003cp\u003eHe’ll be a rich man, which makes it that much more of a gamble.\u003c/p\u003e\n\u003cp\u003eMost prisons, they don’t let you take your computer with you.\u003c/p\u003e\n\u003cp\u003eSome of ’em they don’t even give you a pencil. Why do you want to meet him?”\u003c/p\u003e\n\u003cp\u003e“Actually,” she said, “I did meet him. He was at a table at Stelli’s last month and I went over and introduced myself. I gave him my card, said I’d like for him to call me.”\u003c/p\u003e\n\u003cp\u003e“And he didn’t.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“And you could call him, but how would that look?”\u003c/p\u003e\n\u003cp\u003e“Exactly.”\u003c/p\u003e\n\u003cp\u003e“Susan, what? You read his books and you fell in love with him?”\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003e“Are you serious?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“So I call him and tell him what? Here’s this girl, take her to a restaurant and you’ll get a nice surprise.”\u003c/p\u003e\n\u003cp\u003e“You can tell him that if you want.”\u003c/p\u003e\n\u003cp\u003e“I can tell him anything, just so he calls you.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eHe was silent for a moment. Then he said, “Susan, he swears he never killed nobody, and he’s my client, so of course he’s telling God’s own truth. But just between you and me, and the fact notwithstanding that nobody’s gonna prove this in court, it’s entirely possible he killed that woman.”\u003c/p\u003e\n\u003cp\u003e“He didn’t kill her, Maury.”\u003c/p\u003e\n\u003cp\u003e“You know this because you read his books.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“If it goes to trial,” he said, “I’ll subpoena you, and you can read these wonderful books to the jury. I’d ask you if you know what you’re doing, but the answer is you don’t, and that’s beside the point, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I’ll make the call, and I won’t ask him to call you, I’ll tell him to call you. And you’ll owe me, which would mean I’d take you out for a nice dinner, but how can I do that if you’re in love?”\u003c/p\u003e\n\u003cp\u003e“I could never be too much in love for that,” she said. “And Maury? You don’t have to take me to dinner, either.”\u003c/p\u003e\n\u003cp\u003e“All I have to do is whistle, huh? But you’re not old enough to remember that movie. I’ll call him right now. You’re at the gallery?”\u003c/p\u003e\n\u003cp\u003e“I’m home, I didn’t go in yet.”\u003c/p\u003e\n\u003cp\u003e“Stay by the phone. I’ll make sure he calls.” twenty-six\u003c/p\u003e\n\u003cp\u003eSHE WAS BEAUTIFUL, and he’d almost let her get away.\u003c/p\u003e\n\u003cp\u003eHe’d called her the minute he got off the phone with Maury. The conversation had been stilted, it could hardly have been otherwise, but it got them here, in the rear garden of Caffè Sha Sha, an Italian coffeehouse on Hudson. He’d suggested the place, then couldn’t remember exactly which block it was on, between Christopher and Tenth or Tenth and Charles. It didn’t matter; she knew the Sha Sha and said she’d meet him there.\u003c/p\u003e\n\u003cp\u003e“The thing is,” he said, “I was going to call you. Then it got a little crazy for a couple of days, and then it slipped my mind, and then it was too late to call. Do you know what I mean?”\u003c/p\u003e\n\u003cp\u003e“I thought that was what happened. But I didn’t want to phone you, that would have been awfully pushy—”\u003c/p\u003e\n\u003cp\u003e“It would have been all right.”\u003c/p\u003e\n\u003cp\u003e“Well, I wouldn’t have felt okay with it. Then I remembered Maury was representing you, and I thought, well, that’ll work. You can’t call the man himself, but how can it be a breach of etiquette to call his attorney?” \u003c/p\u003e","sourceLink":"https://allnovel.net/small-town/page-58.html","bookId":2317,"creation":"Oct 5, 2019 6:23:11 PM","modification":"Oct 5, 2019 6:23:11 PM"}
