{"id":84636,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You can’t do that. It’s our property.” Stephen’s voice rose in pitch and a few people walking by hurried on. “We paid for all of that. Our money.\u003c/p\u003e\n\u003cp\u003eOur property. Give it back.”\u003c/p\u003e\n\u003cp\u003e“Stephen, no. We took food and anything else the fort needed when we salvaged your place. It’s part of the stores now. How are we supposed to know what we took at this point? That was months ago. We probably ate the food by now.” Travis set his hands on his hips and gazed steadily at Stephen. “And why do you want the Hummer?”\u003c/p\u003e\n\u003cp\u003e“Because it’s ours!”\u003c/p\u003e\n\u003cp\u003e“Are you going to use it to drive you and Blanche out to areas to salvage?\u003c/p\u003e\n\u003cp\u003eWhere are you going to get your food? Your supplies? Chances are, we give you the Hummer, you take off, and we’ll find you two moaning outside our walls in a few days.”\u003c/p\u003e\n\u003cp\u003e“Don’t underestimate us, Travis.”\u003c/p\u003e\n\u003cp\u003e“Blanche won’t even clean her own damn room right now. Who is going to cook?”\u003c/p\u003e\n\u003cp\u003e“Actually, Blanche thought maybe we could get a few people to go with us if we promised them some jewelry and other valuables,” Stephen answered in a cold, angry voice. He was growing impatient. He was used to being able to push around local officials. He did not like being rebuffed.\u003c/p\u003e\n\u003cp\u003e“You mean stuff that is worthless now that the zombies have risen.” Travis shook his head. “Unbelievable. Really.”\u003c/p\u003e\n\u003cp\u003e“Why do you want us here? You hate us! Everyone does. You hate our wealth and our prestige.”\u003c/p\u003e\n\u003cp\u003eTravis gripped Stephen’s arm tightly with one hand. “Stephen, you’re not wealthy or prestigious anymore. Now, you’re just another living human being. You’re a part of this town. This fort. I wish to God you two would settle down and just adapt. Look, I get that you used to be spoiled rotten, but those days are gone. All of us need to carry our own damn weight and help everyone out here in this fort. Do you get that? Do you understand that? We can’t afford to be selfish anymore.”\u003c/p\u003e\n\u003cp\u003eWrenching his arm away, Stephen looked unsure of what to say next. He rubbed his arm, his eyes cast downward.\u003c/p\u003e\n\u003cp\u003e“The old world is gone. This is the new world. You gotta adapt. Be a part of us. Settle down. Learn some useful skills. Chip in. Make some friends, Stephen.”\u003c/p\u003e\n\u003cp\u003e“You know, everyone keeps talking about the old world being gone. But it’s really not. It’s just waiting for us to push back the dead then everything will go back to the way it was. I will rise to the top again. I will take care of my wife. You’ll go back to being a foreman of a construction site, working for me, not strutting around acting like you’re the mayor.”\u003c/p\u003e\n\u003cp\u003eStephen’s voice was angry, but defensive. “All these people you want us to be friends with will go back to their pathetic lives. You think everyone is equal, but people with power, like me, have that power because we worked hard to gain it and we deserve it.”\u003c/p\u003e\n\u003cp\u003e“Stephen, you got your money cause your great-grandpa was smart enough to take advantage of the railroad when it came through these parts way back in the day. He worked his ass off to be a success and bring commerce to this area. He put this town on the map. He built this hotel.\u003c/p\u003e\n\u003cp\u003eHe brought jobs into this town and he made it happen. Hell, this town is named after your great-grandma. I’ve been in that little museum down the hall that shows him working side by side with the townspeople. So maybe you should follow his example and join us in making this fort a success. Let that be your legacy.”\u003c/p\u003e\n\u003cp\u003e“You don’t get it, Travis. You think I’m just a spoiled, rich man who never did anything to earn my keep. Well, I have. I have worked damn hard.\u003c/p\u003e\n\u003cp\u003eAnd I love my wife. I want her to be happy and she is not happy. She wants our supplies back and our Hummer. She wants an armed escort and some people to come along to work the estate. I think she deserves those things. Being here is hard on her. And being a good, decent husband, I plan to do what she needs to make her safe and happy.”\u003c/p\u003e\n\u003cp\u003eStephen was close to being enraged.\u003c/p\u003e\n\u003cp\u003eTravis shook his head, frustrated at not being able to get through to the man. “You go out there and it will be just you and her unless someone is dumb enough to fall for your ruse.”\u003c/p\u003e\n\u003cp\u003e“I am not a man to be trifled with, Travis.” Stephen stared at Travis for a long, piercing second, then turned and stomped off without another word.\u003c/p\u003e\n\u003cp\u003eTravis raised his hand to rub his very tired eyes. When he lowered his hand, Bill was staring at him. “What’s up?”\u003c/p\u003e\n\u003cp\u003e“He isn’t an easy man, Travis. You can’t make him be what he doesn’t want to be.”\u003c/p\u003e\n\u003cp\u003e“You heard that, huh?”\u003c/p\u003e\n\u003cp\u003eBill nodded, his hands resting on his belt. It was cinched tighter than in the past and his once round face was now more oval, with a hint of jowls.\u003c/p\u003e\n\u003cp\u003e“They ain’t never been easy people. Stephen is the younger brother who wasn’t supposed to inherit his Daddy’s mantle, but his older brother managed to get his ass killed doing some fool stunt in a race car. He’s always trying to prove himself, and his wife ain’t much better. She’s from the trailer park and got lucky becoming a beauty queen. Stephen has been smitten with her since the day he saw her. He has poured tons of money into making her sister’s political career work. They don’t wanna be here, Travis, because this is what they wanted to avoid all their lives. Being common folk.”\u003c/p\u003e\n\u003cp\u003eTravis inclined his head, acknowledging this was probably true. “Do you want to give them a bunch of supplies, the Hummer, an armed escort, and maids?”\u003c/p\u003e\n\u003cp\u003e“Nope. I say we give them a decent car, though. A week’s worth of supplies. Weapons. Ammo. And let them go defend their home. They won’t last long. We both know it. Either they’ll get their asses eaten or show back up in a week or two begging to come back in.” Bill’s expression was somewhere between amusement and anger.\u003c/p\u003e\n\u003cp\u003e“We’re agreed on that point then. I told him as much, but...”\u003c/p\u003e\n\u003cp\u003e“Let him simmer down then tell him again.” Bill shrugged slightly. “It’s the humane thing to do, I guess.”\u003c/p\u003e\n\u003cp\u003e“Never gets easier, does it?”\u003c/p\u003e\n\u003cp\u003e“It will. One day.”\u003c/p\u003e\n\u003cp\u003e“As long as it’s not when we’re all dead,” Travis said with a weary grin.\u003c/p\u003e\n\u003cp\u003e“I was trying to catch ya and let ya know ol’ Calhoun got his specs down for those flamethrower weapons for the walls. I can’t make heads or tails of his scribbling, but I figured you, Eric and Juan could let him know if it’s doable.”\u003c/p\u003e\n\u003cp\u003e“Mind rounding up the others?”\u003c/p\u003e\n\u003cp\u003e“Can do.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” Travis walked on toward the old hotel manager’s office that he used as the mayor of the fort. He felt tired and wanted a bit of a nap, but he could tell already that wasn’t going to happen. It had been hard to climb out of the warm bed he shared with Katie this morning. His wife’s body had felt so comfortable tucked next to his, and the sound of the ice rain tapping against the window had almost lured him back under the covers. Now, he was wishing he had stayed there.\u003c/p\u003e\n\u003cp\u003eTravis passed the front desk where Peggy hung out during a lot of the day trying to contact the outside world on what was left of the internet. He noted that she had a cute new hairdo.\u003c/p\u003e\n\u003cp\u003e“Looking good, Peg.”\u003c/p\u003e\n\u003cp\u003eWithout looking away from her game of Solitaire, she handed him a bottle of Febreze. “Calhoun is looking for you. I think he was rolling in dog shit.”\u003c/p\u003e\n\u003cp\u003e“This day just keeps getting better.”\u003c/p\u003e\n\u003cp\u003e3. Tangled Webs\u003c/p\u003e\n\u003cp\u003eCalhoun skirted around the lobby and ducked down one of the lesser used hallways. The voices in the lobby were echoing and mingling with the ones in his head, causing his brain to hurt. Falling against the wall, he was dimly aware of the two people standing behind a plant nearby, whispering to each other.\u003c/p\u003e\n\u003cp\u003eClutching his head, he tried to get his thoughts together. He envisioned all the thoughts moving through his mind like long, colorful threads, twisting and looping, sometimes weaving together. Sometimes they made perfect sense, other times they became a jumbled mess. When that happened, his head throbbed and those threads all sang in wild voices, demanding his attention. Gripping the wall with his dirty, gnarled hand, he tried to find the strongest thread, the strongest thought, and hold onto it.\u003c/p\u003e\n\u003cp\u003eThen it came to him.\u003c/p\u003e\n\u003cp\u003eHis eyes snapped open and he became vividly aware of the two people staring at him with disgust. It was that blond bitch and Ray, one of the salvage crew guys.\u003c/p\u003e\n\u003cp\u003e“Blanche Mann, you’re the whore of Babylon!” He could see it so clearly.\u003c/p\u003e\n\u003cp\u003eHer twisted soul was a black miasma of goo around her neck and evil was vivid in her red eyes. With a cry of despair, he twirled around and ran from the hallway.\u003c/p\u003e\n\u003cp\u003eHe barely heard Blanche order Ray to, “Get the old fucker.”\u003c/p\u003e\n\u003cp\u003eIt was painfully clear to him what was going on now and what he needed to do. There was evil in the halls of the fort, and he had to rectify the situation.\u003c/p\u003e\n\u003cp\u003eRunning across the lobby, his battered boots beating on the marble floor, he wailed an agonized cry.\u003c/p\u003e\n\u003cp\u003eOut of the fuzzy world around him, a face came sharply into focus and he skittered to a stand still.\u003c/p\u003e\n\u003cp\u003e“What’s up, Calhoun?” Travis looked at him quizzically.\u003c/p\u003e\n\u003cp\u003eCalhoun felt his mind slip off the thread he was clutching and swirl downward into the maze of brightly colored thoughts. It took a few seconds for his mind to snap onto a new one. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-11.html","bookId":2483,"creation":"Oct 5, 2019 5:01:33 PM","modification":"Oct 5, 2019 5:01:33 PM"}
