{"id":84640,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Thank you!”\u003c/p\u003e\n\u003cp\u003e“You’re welcome. Make sure to drink plenty of water.” He motioned to the cooler packed with water bottles.\u003c/p\u003e\n\u003cp\u003eSitting on the curb next to Katie, she eagerly tore into the her lunch bag.\u003c/p\u003e\n\u003cp\u003eJenni bit into her peanut butter and jelly sandwich hungrily while Katie gulped down a bottle of water.\u003c/p\u003e\n\u003cp\u003e“Oh God, when did water start tasting so good!” Katie grinned and wiped her mouth on the back of her hand.\u003c/p\u003e\n\u003cp\u003e“When peanut butter and jelly started tasting like manna from heaven,”\u003c/p\u003e\n\u003cp\u003eJenni answered. “Everything just tastes better now days.”\u003c/p\u003e\n\u003cp\u003eThree of the new people joined the group. The older woman looked like one of the artist-types that used to inhabit South Austin with her long flowing hair and funky way of putting clothes together. Rune was with her and a tall, massive guy with chops on his cheeks and long dark hair.\u003c/p\u003e\n\u003cp\u003e“Hey, Rune!” she waved, smiling and munching on her sandwich.\u003c/p\u003e\n\u003cp\u003e“Hey, Jenni. Good to see ya,” Rune answered, sitting on the curb.\u003c/p\u003e\n\u003cp\u003e“They got you working?”\u003c/p\u003e\n\u003cp\u003e“Volunteered. Figured I might as well stay a short spell.”\u003c/p\u003e\n\u003cp\u003eMaddie gratefully accepted a lunch and bottle of water from the Reverend and found a place to sit with her big friend.\u003c/p\u003e\n\u003cp\u003e“Rune gave me a ride into town the other day. His bike is very cool,”\u003c/p\u003e\n\u003cp\u003eJenni said to Katie.\u003c/p\u003e\n\u003cp\u003e“I heard that. Nice to meet you, Rune. I’m Katie.”\u003c/p\u003e\n\u003cp\u003e“Good to meet you, Katie.”\u003c/p\u003e\n\u003cp\u003eJenni liked his smile and thought he seemed pretty nice. As he tore into his sandwich, she happily chewed on her own. She was hoping she could get another ride on his bike if the good weather kept up.\u003c/p\u003e\n\u003cp\u003eCharlotte came over, sat down next to them, and started to eat slowly. She looked very thoughtful, her hand straying to the pocket where she kept her notes. She was a rather plain woman with mousy hair and a bland face. But her brown eyes were keen and her gaze intense.\u003c/p\u003e\n\u003cp\u003e“How are you today, Charlotte?” the Reverend asked as he handed out water bottles.\u003c/p\u003e\n\u003cp\u003e“Figuring it out still, Padre,” Charlotte answered.\u003c/p\u003e\n\u003cp\u003e“Figuring what out?” Jenni asked.\u003c/p\u003e\n\u003cp\u003e“The zombies. I’ve been studying them,” Charlotte answered around a mouthful of food.\u003c/p\u003e\n\u003cp\u003e“Yeah, we noticed that,” Katie said as she pulled the crusts off her sandwich. “Jenni said you were up on the roof watching some.”\u003c/p\u003e\n\u003cp\u003eJenni snagged the crusts and shoved them in her mouth.\u003c/p\u003e\n\u003cp\u003eCharlotte swallowed a bit of sandwich and drank a little water. “I’m trying to figure out how they tick. We have to know our enemy after all.”\u003c/p\u003e\n\u003cp\u003e“True words for a sad time,” the Reverend agreed. He continued to hand out water and bagged lunches as more workers arrived for lunch.\u003c/p\u003e\n\u003cp\u003e“Notice anything?” Rune asked.\u003c/p\u003e\n\u003cp\u003e“Well,” Charlotte hesitated, then bobbed her head. “I noticed a few things.\u003c/p\u003e\n\u003cp\u003eI’m planning to put it all into a report for the council, but basically there are a few fundamentals. The first one is that they are decaying very slowly.\u003c/p\u003e\n\u003cp\u003eThe regular process of decay is just not happening: the bloat of the body as the gases inside build up, rigor mortis, et cetra. I really expected there to be some exploding zombies. But not one.”\u003c/p\u003e\n\u003cp\u003e“Exploding?” Jenni blinked.\u003c/p\u003e\n\u003cp\u003e“Gases build up in the body as it decays normally. You see it in road kill.\u003c/p\u003e\n\u003cp\u003eSometimes those gases burst the body. But no, nothing like that.\u003c/p\u003e\n\u003cp\u003eJust...slow...slow...rot.”\u003c/p\u003e\n\u003cp\u003e“And they’re fast in the beginning. That is so breaking the rules,” Jenni said with disappointment, then let out a huge hiccup.\u003c/p\u003e\n\u003cp\u003eRune handed her another bottle of water as he said to Charlotte, “I noticed that they kinda beat themselves ragged real damn fast in the first days. They don’t stay fast long.”\u003c/p\u003e\n\u003cp\u003e“Well, they do slow down fairly quickly. The truly dangerous ones are the new ones that are just turned, especially if they’ve only suffered minor damage to their limbs. They can have their whole throat torn out and nothing left in their body cavity, but if their arms and legs are fine, you better be able to run fast. The fast ones are why so many people died in the first days.” Charlotte shook her head. “But, you’re right, Rune. They don’t feel pain so they just go and go, breaking apart their ligaments, tearing apart muscle, literally ripping off limbs as they try to get to prey.\u003c/p\u003e\n\u003cp\u003eThe older they get, the slower they are.”\u003c/p\u003e\n\u003cp\u003e“Ha! I knew Romero had it right!” Jenni grinned with satisfaction and hiccuped again. She knew she shouldn’t have eaten so fast.\u003c/p\u003e\n\u003cp\u003eKatie rolled her eyes.\u003c/p\u003e\n\u003cp\u003e“He did. C’mon. They are so much slower now. Everyone knows it. And it’s so much easier to kill them now. They are stupid and slow.”\u003c/p\u003e\n\u003cp\u003e“They are very fascinated by our Christmas lights. I seriously don’t think we should take them down.” Charlotte pulled out a bag of chips and opened it. “They will stare all night at the lights and only move when they are turned off.”\u003c/p\u003e\n\u003cp\u003e“Really?” Katie lifted an eyebrow.\u003c/p\u003e\n\u003cp\u003e“Really.”\u003c/p\u003e\n\u003cp\u003eThe Reverend whistled. “Then we could string up a lot of lights.”\u003c/p\u003e\n\u003cp\u003e“Well, give them enough humans in visual contact, they’ll shake out of it, but seriously, they’ll just stare. The fireworks on New Year’s Eve, that had them completely stone cold still.”\u003c/p\u003e\n\u003cp\u003e“Why haven’t you said anything to anyone?” Katie demanded, an edge in her voice.\u003c/p\u003e\n\u003cp\u003e“I wanted to make sure.” Charlotte popped a chip in her mouth. “They aren’t smart. They don’t really think. Most likely their brains are the least decayed part of them and I have a feeling it’s all instinct. They do things but don’t know why. Their need to feed is basic. It’s the reptilian brain speaking. Why cannibalism? That I don’t know. I watched one zombie try to mow the lawn at the school the first day of the rising. I don’t think it was doing anything more than something it had done in life. It wasn’t a reasoning action. It was just an action. But it may have been some sort of residual memory that was sparking in his brain. But a few days later, he was just banging on the windows.”\u003c/p\u003e\n\u003cp\u003e“So, you think in the first few days after they change, they might have a memory? Of how to do things?” Jenni frowned at this thought, not really wanting to know what it meant.\u003c/p\u003e\n\u003cp\u003e“Not a conscious thought, Jenni. I don’t think they are actually processing information like we do. It’s their dying brain firing off in weird ways.\u003c/p\u003e\n\u003cp\u003eMaybe neural pathways looping as the brain transforms into...a zombie brain.” Charlotte shrugged and stuffed more chips in her mouth, crumbs flecking her lips and chin.\u003c/p\u003e\n\u003cp\u003e“So, if a zombie tried to open a door on the day it was turned, it doesn’t mean it will the next day?” Katie looked at Jenni. “Like that girl who tried to open the truck door.”\u003c/p\u003e\n\u003cp\u003e“Oh, right!” Jenni remembered that moment well. The fort had been terrified that the zombies were actually thinking and plotting.\u003c/p\u003e\n\u003cp\u003eCharlotte nodded her head. “In the first days, I theorize that as their brains are dying or transforming or whatever they are doing to make zombie, residual memory pathways may have zombies doing very mundane human actions. In the end, those neural pathways die and we’re left with a creature that has only the instinct to feed left.”\u003c/p\u003e\n\u003cp\u003e“So they’re stupid,” Jenni said with satisfaction.\u003c/p\u003e\n\u003cp\u003e“Yes. So that works for us. We’re much smarter.” Charlotte continued to eat her chips, looking thoughtful.\u003c/p\u003e\n\u003cp\u003eJenni gulped down more water, washing away the salty taste of the chips from her palette. “Oh, that I’m sure of, but they are damn persistent.”\u003c/p\u003e\n\u003cp\u003eThe people around them had been silent for most of the conversation as they ate, but the tension in the air was palpable. Jenni felt it, but didn’t really want to know what the others were thinking. She liked things being nice and simple. And Charlotte’s theories made things nice and simple for her.\u003c/p\u003e\n\u003cp\u003e“Do you think there is anything left that is human inside of them? A spark of who they were? Have you seen that?”\u003c/p\u003e\n\u003cp\u003eIt was Maddie who had spoken up and from the expressions on the faces around her, Jenni understood that it was the question others had been afraid to ask.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Charlotte wiped her lap off and took a long drink of her water. She was fairly oblivious of how disconcerting the conversation had become to the others.\u003c/p\u003e\n\u003cp\u003eKatie set down her sandwich and swallowed hard. Slowly, she raised her eyes. “She means, do you think there is something left of the person they were still inside. Are they aware at all of what they were?”\u003c/p\u003e\n\u003cp\u003eHearing the fear and pain in Katie’s voice, Jenni reached out and grabbed her hand. “Of course not! Right, Charlotte? They’re just dead things!”\u003c/p\u003e\n\u003cp\u003e“I haven’t seen any of them acting remotely like they have a memory of who they were. Like recognizing family members or anything like that?\u003c/p\u003e\n\u003cp\u003eNo. Have any of you? I mean, most of you saw friends and family turn.\u003c/p\u003e\n\u003cp\u003eAll they want to do is eat you.”\u003c/p\u003e\n\u003cp\u003e“No. No. I haven’t seen any of my old friends or my family members even so much as look at me as anything other than food,” the Reverend cut in. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-15.html","bookId":2483,"creation":"Oct 5, 2019 5:01:33 PM","modification":"Oct 5, 2019 5:01:33 PM"}
