{"id":84648,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“She’ll be okay. She’s more of a badass than I’ll ever be.”\u003c/p\u003e\n\u003cp\u003e“True, but I can’t help but worry.” Katie turned away, moving toward the hall. “I hate today. I hate everything about it.”\u003c/p\u003e\n\u003cp\u003eTravis hurried after her, his hand gripping her elbow lightly. “Honey, go lie down for a bit. Okay?”\u003c/p\u003e\n\u003cp\u003e“How can I? With Jenni going out and Juan in there...” Her voice caught and she covered her mouth.\u003c/p\u003e\n\u003cp\u003e“Have you eaten yet?”\u003c/p\u003e\n\u003cp\u003eShaking her head, she looked quite guilty.\u003c/p\u003e\n\u003cp\u003e“Okay, I want you to eat something, then go lay down. You have to think about the baby.”\u003c/p\u003e\n\u003cp\u003e“I can’t until they leave, okay?”\u003c/p\u003e\n\u003cp\u003eTravis nodded, frowning slightly. “Okay, but after they go-”\u003c/p\u003e\n\u003cp\u003e“I promise.” Katie blinked the tears from her lashes and let out a soft moan of despair. “God, Travis...”\u003c/p\u003e\n\u003cp\u003eTaking her in his arms, he held her tight, kissing her face and hair. “We’ll make it through. I promise. We’ll make it.”\u003c/p\u003e\n\u003cp\u003eChapter 8\u003c/p\u003e\n\u003cp\u003e1. Bless Me Father\u003c/p\u003e\n\u003cp\u003eJenni leaned over and gently kissed Juan’s dry lips. Her fingers played over his curls and she took in a deep shuddering breath. Resting her hand lightly on his chest, she could feel the faint thudding of his heart.\u003c/p\u003e\n\u003cp\u003e“Keep strong, baby. I love you.”\u003c/p\u003e\n\u003cp\u003eWith one last kiss, she straightened and stepped back from the bed.\u003c/p\u003e\n\u003cp\u003eRosie reached out to touch her hand. Jenni clasped the older woman’s and squeezed it. They shared a quiet moment, then Jenni kissed her cheek and left the room.\u003c/p\u003e\n\u003cp\u003eHer long black hair fell freely around her shoulders as she walked toward the chapel. People looked toward her, but no one spoke. She was wearing the red sweater that Juan liked to see her in and her lucky jeans. Her stomach was rolling with nerves, but she didn’t care anymore. She was going to save Juan.\u003c/p\u003e\n\u003cp\u003eKen stood near the open door to the chapel and smiled slightly as she approached. “Bill says we got ten minutes.”\u003c/p\u003e\n\u003cp\u003e“Okay. That should be enough time. I just don’t want to go out there without having God at my back.”\u003c/p\u003e\n\u003cp\u003eWalking inside, she found the Reverend waiting for her with a Communion of saltines and red Kool-Aid. She had specifically asked for Communion and he had quickly agreed. She was surprised to see some of the other members of the teams gathered as well. Taking a seat, she pulled out her rosary and threaded it between her fingers.\u003c/p\u003e\n\u003cp\u003eThe Reverend did his best to improvise a Catholic Communion, and she adored him for it. She knew he struggled to be all things to all the different denominations in the fort and she thought he did an amazing job. He was even wearing a white robe made from a tablecloth. It touched her.\u003c/p\u003e\n\u003cp\u003eWhen it came time to partake of the Communion, she felt her hands shaking. Despite her need to go out into the deadlands and bring back the things that would save her love, she was terrified. Juan’s injury made her feel vulnerable. She hated that feeling.\u003c/p\u003e\n\u003cp\u003eTaking the piece of stale saltine on her tongue, she closed her eyes and tried to concentrate on the Risen Christ and the Blessed Virgin. The Kool- Aid was a bit tart, but she downed it. Crossing herself, she whispered fervent prayers to the Holy Trinity and the Queen of Heaven.\u003c/p\u003e\n\u003cp\u003e“Just let him live,”she whispered.\u003c/p\u003e\n\u003cp\u003eRising to her feet, she turned to see Roger, Linda and Bill taking Communion as well.\u003c/p\u003e\n\u003cp\u003eWalking on leaden legs, Jenni strode out of the chapel.\u003c/p\u003e\n\u003cp\u003e* * * * * Katie’s expression when she saw Jenni enter the staging area broke Jenni’s heart. Jenni walked straight up to her and hugged Katie hard. She could feel Katie trembling and she buried her face in Katie’s soft curls.\u003c/p\u003e\n\u003cp\u003e“If you don’t come back, I’ll be really pissed,” Katie said finally, a catch in her voice.\u003c/p\u003e\n\u003cp\u003e“I know. But I gotta go.”\u003c/p\u003e\n\u003cp\u003e“I know.” Katie pressed a string of fierce kisses to Jenni’s cheek. “You love him. I would do the same for Travis. And for you.”\u003c/p\u003e\n\u003cp\u003eWith tears in her eyes, Jenni drew back. “I would do the same for you, too.”\u003c/p\u003e\n\u003cp\u003eKatie wiped her tears away and shook her head. “I just can’t believe all of this.”\u003c/p\u003e\n\u003cp\u003e“It’ll be okay,” Jenni said, her voice firm. “Juan will live.”\u003c/p\u003e\n\u003cp\u003eWith a small smile, Katie said, “Of course he will. He’s tough.”\u003c/p\u003e\n\u003cp\u003eJenni pushed her hair back out of her face and lifted her chin. “I’ll be back. One way or the other.”\u003c/p\u003e\n\u003cp\u003e“I know. I can’t help but worry. You’re my best friend.”\u003c/p\u003e\n\u003cp\u003eJenni flung her arms around Katie again and snuggled her. She kissed Katie’s forehead firmly. “And you’re mine.”\u003c/p\u003e\n\u003cp\u003eTravis walked up, looking a bit awkward, trying not to interrupt.\u003c/p\u003e\n\u003cp\u003eJenni slung her arm around his neck and kissed his cheek, too. “I’ll be back.”\u003c/p\u003e\n\u003cp\u003e“You better be. Juan needs you,” Travis said.\u003c/p\u003e\n\u003cp\u003e“Yes, he does. He’s lost without me,” Jenni declared with false joviality.\u003c/p\u003e\n\u003cp\u003eHer son staggered up to her and flung his arms around her, holding her tightly. “Mom,” he whispered in her ear. “Mom, don’t go.” She squeezed him so tight it hurt both of them.\u003c/p\u003e\n\u003cp\u003e“I have to go,” Jenni whispered. “I have to do something to save him. I couldn’t save your...brothers. I have to try to save him.”\u003c/p\u003e\n\u003cp\u003eJason backed away, ducking his head, trying to hide his tears beneath his bangs. From the agonized look on his face, she knew he understood. “Be careful, Mom.”\u003c/p\u003e\n\u003cp\u003e“I will be,” she promised. She grabbed him close again and kissed him firmly on the forehead. “I love you.”\u003c/p\u003e\n\u003cp\u003eJack pawed at her knee. She leaned down and kissed his furry head. “I love you, too.”\u003c/p\u003e\n\u003cp\u003eWith a fake grin and trying not to look scared shitless, she walked toward Roger and Bill as they waited for her by the truck. Pivoting on her heel, she turned and waved to her small family: her best friend, her stepson, and a dog named Jack.\u003c/p\u003e\n\u003cp\u003eShe tried not to think of Juan lying in that bed looking so vulnerable.\u003c/p\u003e\n\u003cp\u003eClimbing into Ralph and Nerit’s red truck, she nodded at Bill. “Let’s do this.”\u003c/p\u003e\n\u003cp\u003e“Just like old times,” he answered her, gunning the engine.\u003c/p\u003e\n\u003cp\u003eJenni sighed. It felt nothing like old times and it scared her to death.\u003c/p\u003e\n\u003cp\u003eBut she would come back.\u003c/p\u003e\n\u003cp\u003eShe had to.\u003c/p\u003e\n\u003cp\u003e2. Beer and Strawberries\u003c/p\u003e\n\u003cp\u003eBill drove in silence. Jenni sat in the back of the truck’s cab, staring out the window at nothing. He doubted she was seeing anything other than Juan’s face in her mind’s eye. Felix was passed out asleep beside her, slightly snoring, while Roger was deep into a Star Trek novel.\u003c/p\u003e\n\u003cp\u003eThe drive was over an hour, so maybe it was good to be silent. They were heading into a highly dangerous situation. They all knew that hospitals were death traps and had been from day one. Bill was eternally grateful his wife had passed on by the time the dead rose. If she hadn’t, he knew she would have been one of the first to rise. That would have destroyed his will to live. It was hard watching her die of cancer, but seeing her as a member of the revived living dead….\u003c/p\u003e\n\u003cp\u003eNo, he couldn’t think about that now.\u003c/p\u003e\n\u003cp\u003eDespite the fact this hospital was very small, it didn’t take away from the fact it was probably a deathtrap. They had two, four-member crews going in. The odds weren’t with them, that was for damn sure.\u003c/p\u003e\n\u003cp\u003eBill gripped the steering wheel harder and concentrated on the road.\u003c/p\u003e\n\u003cp\u003eIn the first hours of the infestation, he hadn’t even been sure he wanted to survive it. The first zombie he had seen had freaked him out so thoroughly, he could barely move. Luckily, he had been in his patrol car.\u003c/p\u003e\n\u003cp\u003eIt had banged on the window for a good ten minutes before he got the nerve to do something about it.\u003c/p\u003e\n\u003cp\u003eA six-year old zombie just wasn’t right.\u003c/p\u003e\n\u003cp\u003eHe could still remember how it thrashed under his foot after he had knocked it flat on its back and pinned it so he could get a good shot at its head. It was one of the worst moments of his life.\u003c/p\u003e\n\u003cp\u003eWith a weary sigh, Bill concentrated on the road. He could see a few zombies moving through the dried brush. They seemed disoriented and sluggish. Charlotte was right. They were slowing down as the elements got to them. That didn’t keep them from being fiercely terrifying if they got close to you.\u003c/p\u003e\n\u003cp\u003eGlancing in the rear view mirror, he could see Jenni leaning her head against the window, staring blankly.\u003c/p\u003e\n\u003cp\u003eHe felt for her. All too clearly, he understood her distress and why she had to be part of the rescue group. It was just something she had to do. He would have done the same for his wife.\u003c/p\u003e\n\u003cp\u003eOnce more, he had to admit to himself that just living had been hard when his wife had passed. He was just back to work and on patrol when that dead little boy banged on his patrol car window. He had almost given in and let the zombie take him, but then he had started to worry about Ralph and Nerit and that had been the end of that. Those two had been friends through thick and thin with his wife’s illness, and he had to make sure they were okay.\u003c/p\u003e\n\u003cp\u003eNow he was glad he had made his way to them. He had found some incredible friends in the fort. They made this life worth living.\u003c/p\u003e\n\u003cp\u003eBehind him Felix let out a snort in his sleep and Bill smiled to himself.\u003c/p\u003e\n\u003cp\u003e“Check that out,” Roger said.\u003c/p\u003e\n\u003cp\u003eBill glanced over to see a commercial plane rammed into the side of a barn. There was no sign of life or unlife. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-23.html","bookId":2483,"creation":"Oct 5, 2019 5:01:33 PM","modification":"Oct 5, 2019 5:01:33 PM"}
