{"id":84652,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTrembling violently, he felt his body being pinched as the space behind the door grew smaller.\u003c/p\u003e\n\u003cp\u003eHe was going to die.\u003c/p\u003e\n\u003cp\u003eThe first gunshot made him jump. The volley made him hopeful. The distorted gruesome zombie faces turned away toward the shooters. With loud moans, they began to shamble down the hall. Finally, Ken managed to get a breath as the undead staggered away from the door.\u003c/p\u003e\n\u003cp\u003eAt the last moment, he realized the door would swing closed now that the zombies were not holding it. He would be exposed. Grabbing the door firmly with his fingers, he held it in place the best he could. More zombies staggered past him, moving toward those shooting. His sweat slicked fingers slipped on the handle.\u003c/p\u003e\n\u003cp\u003eOne zombie noticed him through the smeared glass and reached out. It was an old man, his face eaten away on one side and his throat shredded into dried strips of flesh. Instead of pushing the door toward Ken, he began to try to pull it away.\u003c/p\u003e\n\u003cp\u003e“No, no, no,” Ken whispered, struggling to hold on. His adrenaline rush had left him now and he felt weak as a babe.\u003c/p\u003e\n\u003cp\u003eThe zombie persisted, its slow movements agonizingly terrifying. Ken could hear its bones cracking and its muscles tearing with the exertion, but it didn’t feel pain. It gripped the side of the door firmly and began to pull it outward. Ken tried to hold onto the door, but his fingers were so wet, they slipped free. Falling back into the corner, Ken screamed as the zombie reached down for him.\u003c/p\u003e\n\u003cp\u003e“Die, fucker,” Lenore said in her low voice from behind the zombie.\u003c/p\u003e\n\u003cp\u003eThe zombie lurched forward and fell onto Ken.\u003c/p\u003e\n\u003cp\u003eKen began to scream in terror, then realized it was dead. A bolt had shattered the back of its head. The rotting brains slid out in a slimy pile as he shoved the creature off him and struggled to get up.\u003c/p\u003e\n\u003cp\u003eGrabbing Ken’s arm, Lenore pulled him to his feet. “Run!”\u003c/p\u003e\n\u003cp\u003eHe ran with her, stumbling and sliding over the dead bodies littering the floor. He heard growls behind him and glanced over his shoulder to see zombies staggering along behind them. The undead were reaching out with desperate hands as their mouths groaned in hunger.\u003c/p\u003e\n\u003cp\u003eRunning down the hallway, Lenore guided him to the open window. She pushed him forward and it was Dale who lifted him up and through it.\u003c/p\u003e\n\u003cp\u003eKen clung to him relishing the moment, then Dale set him down and shoved him toward the moving van. Lenore was heavier and harder to lift through the window and the zombies were almost to her, when she finally fell out onto the dry grass. Grabbing her hand, Dale tugged her after him as the zombies filled the window and began to tumble out.\u003c/p\u003e\n\u003cp\u003eStanding next to the truck, Linda fired at zombies, her shotgun barking loudly.\u003c/p\u003e\n\u003cp\u003eKen scrambled into the back of the truck and looked back to see Dale dragging Lenore behind him. The zombies were falling out of the window and struggling to get up.\u003c/p\u003e\n\u003cp\u003e“Hurry! Hurry!” His voice sounded shrill, but he didn’t care.\u003c/p\u003e\n\u003cp\u003eDale shoved Lenore up into the truck as Ken pulled on her arms. Lenore cussed at them with impressive insults, but they got her in. Dale slammed the doors shut, securing them.\u003c/p\u003e\n\u003cp\u003eWithin seconds, the moving truck lurched and headed off at top speed.\u003c/p\u003e\n\u003cp\u003eSilently, Lenore sat down beside Ken on the bench and took his hand.\u003c/p\u003e\n\u003cp\u003eHe sobbed silently beside her. He was surprised to see she was crying too, her big body shivering.\u003c/p\u003e\n\u003cp\u003e“You are one stupid faggot,” she finally said.\u003c/p\u003e\n\u003cp\u003eKen threw his arms around her and wept into her large bosom. “I know!”\u003c/p\u003e\n\u003cp\u003eClutching him tightly, Lenore rocked him. “I love you, anyway.”\u003c/p\u003e\n\u003cp\u003e“You saved me,” Ken sobbed. “You saved me. I thought I was gone, but you saved me.”\u003c/p\u003e\n\u003cp\u003e“No zombie is eatin’ my best friend,” Lenore declared through her tears.\u003c/p\u003e\n\u003cp\u003eKen lifted his head. “But...what...oh..God..what about Jenni and the others? They’re still back there!”\u003c/p\u003e\n\u003cp\u003eLenore just shook her head. “I don’t know, Ken. I don’t know.”\u003c/p\u003e\n\u003cp\u003eAs the truck headed back to the fort, the two friends clung to each other and hoped for the best for the other team.\u003c/p\u003e\n\u003cp\u003e3. Death’s Doorway Opens\u003c/p\u003e\n\u003cp\u003eIt was evident from the chaos in the operating rooms that things had gone to hell fairly quickly. Dead bodies lay everywhere. Every single one had a gunshot to the head. Someone had meticulously gone through and killed every single person in ICU. Some, Jenni suspected, had not even been zombies.\u003c/p\u003e\n\u003cp\u003e“Why kill all of these, but not the ones in the ER?”\u003c/p\u003e\n\u003cp\u003e“Ran out of time, I suspect,” Bill answered Jenni.\u003c/p\u003e\n\u003cp\u003e“Can we hurry it up? This place is making my skin crawl,” Felix said from across the room.\u003c/p\u003e\n\u003cp\u003e“Yeah, this place is damn creepy,” Roger agreed.\u003c/p\u003e\n\u003cp\u003eJenni unfolded her map and held it up against the wall to study it. The eerie lighting made her look very pale and almost dead. Roger felt uneasy by her appearance and took a step back.\u003c/p\u003e\n\u003cp\u003e“Bill, you and me can take care of the stuff in the O.R. Roger, Felix, you get those drugs from the pharmacy,” she said firmly.\u003c/p\u003e\n\u003cp\u003eFelix studied his map, then nodded. “Let’s roll.”\u003c/p\u003e\n\u003cp\u003eThings were very messy in the operating rooms. They entered very cautiously, but only found dead bodies. The corpses were terribly decomposed and they tried hard not to look at them too closely. Together, Bill and Jenni loaded up operating tools in a bin, careful to get the ones Charlotte had requested.\u003c/p\u003e\n\u003cp\u003eBill’s walkie-talkie hissed to life.\u003c/p\u003e\n\u003cp\u003e“Sorry, Bill. Ken’s my best friend,” Lenore’s voice said.\u003c/p\u003e\n\u003cp\u003e“What?” Bill fumbled to grab the walkie-talkie off his belt.\u003c/p\u003e\n\u003cp\u003e“What did she mean?”\u003c/p\u003e\n\u003cp\u003e“Hell if I know, Jenni.”\u003c/p\u003e\n\u003cp\u003eBill was just about to call Lenore back when they heard gunshots down below and what followed turned their blood cold. The bellow of a hundred zombie voices rising.\u003c/p\u003e\n\u003cp\u003e“We’re out of here,” Bill said firmly.\u003c/p\u003e\n\u003cp\u003eJenni slipped the safety off her rifle and grabbed the bin. She followed Bill out into the hallway just as Roger and Felix came running from the direction of the stairs.\u003c/p\u003e\n\u003cp\u003e“Just run,” Felix hissed.\u003c/p\u003e\n\u003cp\u003eIt was then they heard the footfalls on the stairs.\u003c/p\u003e\n\u003cp\u003e“Shit!” Jenni ran, clutching the gun in one hand and the bin in the other.\u003c/p\u003e\n\u003cp\u003eShe could hear the scalpels and other tools rattling around in it, but she didn’t dare drop it. Juan needed these things.\u003c/p\u003e\n\u003cp\u003eFelix hit a door and shoved it open. They all piled into it and Roger quickly turned and locked it.\u003c/p\u003e\n\u003cp\u003e“Way out!” Felix ran toward the windows on the far side of the room.\u003c/p\u003e\n\u003cp\u003eLooking around, Jenni realized they were in some sort of dorm room.\u003c/p\u003e\n\u003cp\u003eProbably for doctors on long shifts.\u003c/p\u003e\n\u003cp\u003e“Felix!” Bill shouted.\u003c/p\u003e\n\u003cp\u003eThe slender man didn’t turn around, but ran across the long room.\u003c/p\u003e\n\u003cp\u003eSections were curtained off and Jenni realized a form was moving behind one at the far end. She could just make out its silhouette highlighted by the fading sunlight coming through the windows.\u003c/p\u003e\n\u003cp\u003e“Felix, no!”\u003c/p\u003e\n\u003cp\u003eHe looked back just long enough to run straight into the last curtain. And beyond that curtain was something that reached out for him. He went down in a tumble of grunts and moans, the curtain falling over him and a dark figure.\u003c/p\u003e\n\u003cp\u003eRoger ran to help, his heavy body sweating profusely. “Felix, no, no!”\u003c/p\u003e\n\u003cp\u003eBehind Jenni, the door was struck by something large. Then the pounding began. Bill immediately pushed her aside and shoved a large metal wardrobe over in front of the door.\u003c/p\u003e\n\u003cp\u003eFelix shouted as Roger grabbed the curtain and yanked it back.\u003c/p\u003e\n\u003cp\u003eTumbling out, Felix gasped in large breaths of air as he struggled to his feet. Behind him, a terribly mutilated and decaying soldier was chewing on a bit of Felix’s ear.\u003c/p\u003e\n\u003cp\u003e“Shit,” Roger screamed.\u003c/p\u003e\n\u003cp\u003e“What? What?” Felix exclaimed, leaping away from the zombie. “Kill it!”\u003c/p\u003e\n\u003cp\u003eJenni shot the soldier as it lunged forward. It jerked backwards as the bullet tore through its chest. The second bullet sheared off the side of his head and it tumbled to the ground. Its brain slid out through the shattered skull, falling wetly to the floor. A bit of ear, with a gold earring still attached, fell out of its mouth.\u003c/p\u003e\n\u003cp\u003e“Oh, shit, no,” Felix said as his hand came up to his ear. “No, no. He ripped it off with his hand. He didn’t bite me!”\u003c/p\u003e\n\u003cp\u003eRoger raised his gun. “Sorry, Felix.”\u003c/p\u003e\n\u003cp\u003e“No, the fucker ripped it off! It didn’t bite me!”\u003c/p\u003e\n\u003cp\u003ePushing a desk in front of the door to brace the metal wardrobe, Bill swore under his breath. It continued to buckle and push into the room.\u003c/p\u003e\n\u003cp\u003e“We don’t have much time!”\u003c/p\u003e\n\u003cp\u003eJenni threw the contents of the bin onto a bed and rolled it up in a sheet, then tied the ends to make a backpack. With a sigh of regret, she yanked her ax from her back and tossed it onto a bed. Pulling on the makeshift backpack with the surgical tools in it, she hurried toward the men fiercely arguing back and forth.\u003c/p\u003e\n\u003cp\u003eFelix screamed at Roger, holding his torn ear, as Roger obviously tried to get up his nerve to fire.\u003c/p\u003e\n\u003cp\u003e“You can’t do this to me. It tore it off. I swear it did. It didn’t bite me! I promise. Dear God, I promise!” Felix shouted. Tears streaming down his face, he raised his gun, pointing at Roger. “Put the gun down, Roger. I mean it! It didn’t bi-”\u003c/p\u003e\n\u003cp\u003eJenni raised her gun and fired. Felix fell, silent and dead, over the soldier who had already effectively ended his life. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-27.html","bookId":2483,"creation":"Oct 5, 2019 5:01:33 PM","modification":"Oct 5, 2019 5:01:33 PM"}
