{"id":84654,"no":29,"title":"Page 29","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e* * * * * “How did it go?”\u003c/p\u003e\n\u003cp\u003e“She hurt two of my people,” the First Lieutenant responded. “I think she thought they were zombies.”\u003c/p\u003e\n\u003cp\u003e“She caught them by surprise. She’s the weaker one. Try again.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e* * * * * The smell of ammonia brought Jenni to wakefulness sharply and painfully. Her temple was throbbing and she felt like throwing up. She was sitting on a cot and a soldier was leaning over her. The woman in the army fatigues with short cropped blond hair looked at her kindly.\u003c/p\u003e\n\u003cp\u003e“How you feeling?” she asked Jenni.\u003c/p\u003e\n\u003cp\u003eJenni promptly slugged the woman in the face. Diving off the cot, she rushed toward the nearest door.\u003c/p\u003e\n\u003cp\u003e“Grab her!” the army nurse shouted.\u003c/p\u003e\n\u003cp\u003eOne of the guards managed to grab Jenni around the waist and hoist her off the ground.\u003c/p\u003e\n\u003cp\u003e“Let me go!” Jenni kicked her legs and twisted frantically.\u003c/p\u003e\n\u003cp\u003eThere was a sharp prick in her arm, then the world swam and went dark.\u003c/p\u003e\n\u003cp\u003e* * * * * “Tell me you had success this time.”\u003c/p\u003e\n\u003cp\u003e“I would like to, sir, but she fought back the second she was awake. Sir, I seriously believe we should question the man first.”\u003c/p\u003e\n\u003cp\u003e“The woman is the weaker link. Try again. Restrain her this time.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e* * * * * Jenni jerked away as the smell of ammonia assaulted her senses again.\u003c/p\u003e\n\u003cp\u003eShe found herself sitting in a chair before a table, her hands restrained behind her with plastic cuffs. Trying to move, she found her ankles were also cuffed.\u003c/p\u003e\n\u003cp\u003e“Shit!”\u003c/p\u003e\n\u003cp\u003eAcross from her sat a very handsome black man with the kindest green eyes she had ever seen. He was staring at her curiously, his expression quite intense.\u003c/p\u003e\n\u003cp\u003e“Fuck you.”\u003c/p\u003e\n\u003cp\u003e“We hardly know each other,” the man answered, flashing a brilliant smile.\u003c/p\u003e\n\u003cp\u003eJenni set her jaw, her gaze steely.\u003c/p\u003e\n\u003cp\u003e“You know, we’re just trying to get to know you.”\u003c/p\u003e\n\u003cp\u003e“You fucking kidnapped me!” Jenni nearly growled the words. She was so pissed she wasn’t even sure why she was so angry. Thoughts of Juan were jumbled with the disaster at the hospital and then the bright light blinding her and Bill. “Where the hell is Bill?”\u003c/p\u003e\n\u003cp\u003e“Is that his name?”\u003c/p\u003e\n\u003cp\u003eJenni clamped her mouth shut.\u003c/p\u003e\n\u003cp\u003e“We’ve met before. You and I,” the man said. “On a road, long ago. You were in a pink bathrobe and you had this dog that looked exactly like my dog when I was a kid. And there was a blond woman with you. I have a photographic memory. I remember people. I remember you.”\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, Jenni glared at him and said nothing.\u003c/p\u003e\n\u003cp\u003e“I told you to come here. To Madison. But you didn’t. You went somewhere else.”\u003c/p\u003e\n\u003cp\u003eThe man opened up a folder and began to show her photos of the fort.\u003c/p\u003e\n\u003cp\u003eThen the photos became more personal, showing people. Obviously the photos had been taken with a telescopic lens. She saw herself and Juan in one. The sight of the man she loved brought tears to her eyes.\u003c/p\u003e\n\u003cp\u003e“Tell me about your home, Genevieve,” the man said in a soft, warm voice.\u003c/p\u003e\n\u003cp\u003e“Fuck you, puto.”\u003c/p\u003e\n\u003cp\u003eThe man just smiled a little, then said, “Like I said, we hardly know each other. Besides, my superiors have me in here visiting with you to find out more about this enclave you live in than trying to get lucky with you.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to tell you a gawddamn thing,” Jenni snapped at him. “You fucking kidnapped me! You had no right!”\u003c/p\u003e\n\u003cp\u003e“We’re under orders to bring any civilians we find outside of the designated rescue center back here. For your protection.”\u003c/p\u003e\n\u003cp\u003eJenni began to try to twist her hands. She knew it was fruitless, but she needed to remain angry or she was going to cry. Juan needed her and these assholes had kidnapped her.\u003c/p\u003e\n\u003cp\u003e“Genevieve, please, you need to talk to me. Tell me about your friends,”\u003c/p\u003e\n\u003cp\u003ethe man continued in his soft voice.\u003c/p\u003e\n\u003cp\u003e“How do you know my name?”\u003c/p\u003e\n\u003cp\u003eThe soldier silently drew a folded sheet of paper from the folder. “My Darling Genevieve, you’re still a loca bitch, but I love you. Juan.”\u003c/p\u003e\n\u003cp\u003eJenni screamed at him with raw hate and struggled to get free. “That’s mine!”\u003c/p\u003e\n\u003cp\u003eWith a sigh, the soldier stood up. “Well, I see you don’t want to cooperate.\u003c/p\u003e\n\u003cp\u003eI’ll give you a little time to cool off.”\u003c/p\u003e\n\u003cp\u003eJenni never heard his complete sentence. She somehow managed to flip herself backwards and hit her head with a resounding thud.\u003c/p\u003e\n\u003cp\u003eThe nurse sighed. “She’s going to have a concussion from that.”\u003c/p\u003e\n\u003cp\u003eThe First Lieutenant nodded. “Thank goodness she has a hard head.”\u003c/p\u003e\n\u003cp\u003e* * * * * “She’s a feisty Latina, what can I say,” the First Lieutenant said with a bemused smile. “And she has a reason to be mad. As far as she is concerned, we kidnapped her.”\u003c/p\u003e\n\u003cp\u003eThe Major General scowled at him. “She’s clearly unhinged. Question the man.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e* * * * * Bill stared at the photos, then up at the soldier with the kind eyes. He sat in a chair, his hands folded on his lap. So far the treatment here had been good though he had heard Jenni screaming more than once since he woke up. But, in a way, that was to be expected.\u003c/p\u003e\n\u003cp\u003e“We’re just civilians,” Bill said at last. “Survivors making our way.”\u003c/p\u003e\n\u003cp\u003e“Are you a militia of some kind?”\u003c/p\u003e\n\u003cp\u003e“No. No. Just trying to survive, really.”\u003c/p\u003e\n\u003cp\u003e“Religious affiliations?”\u003c/p\u003e\n\u003cp\u003e“You mean a cult? No. No. We have some Christians, Catholics, a Jewess, a few Hindus, an agnostic or two…maybe even an atheist. And some guy who believes in aliens,” Bill answered honestly.\u003c/p\u003e\n\u003cp\u003eThe black man looked thoughtful. “And you did all this yourself? No preplanning?\u003c/p\u003e\n\u003cp\u003eJust spur of the moment?”\u003c/p\u003e\n\u003cp\u003e“Out of necessity, sir. Really. I mean, you gotta survive somehow when the dead come back.” Bill shrugged a little.\u003c/p\u003e\n\u003cp\u003e“Did you hear the order go out in the first days to report to Madison?”\u003c/p\u003e\n\u003cp\u003e“Honestly, no. I was just trying to live,” Bill answered.\u003c/p\u003e\n\u003cp\u003eThe soldier nodded again, looking thoughtful. “Well, martial law was enacted and all civilians were ordered to report to rescue centers.\u003c/p\u003e\n\u003cp\u003eMadison was the one the people in your ‘fort’ should have reported to.”\u003c/p\u003e\n\u003cp\u003eBill just stared at the soldier, not understanding.\u003c/p\u003e\n\u003cp\u003e“It is our responsibility to ensure the safety of the civilian population and keep our nation alive in any way possible,” the soldier continued. His expression was grim now.\u003c/p\u003e\n\u003cp\u003e“Yeah, so?”\u003c/p\u003e\n\u003cp\u003eThe soldier sighed. “My superiors plan to take over the fort. They want to know if there will be an armed response.”\u003c/p\u003e\n\u003cp\u003eBill blinked slowly, then lowered his head. He thought long and hard, swallowed a few times, then looked up. “It’s our home.”\u003c/p\u003e\n\u003cp\u003eThe soldier nodded sadly. “Yes, I know. What are the chances of an armed response?”\u003c/p\u003e\n\u003cp\u003eBill sighed. “I don’t know.”\u003c/p\u003e\n\u003cp\u003eThe soldier looked surprised, then nodded. “All right. Thank you.”\u003c/p\u003e\n\u003cp\u003e2. The Pendulum Sword\u003c/p\u003e\n\u003cp\u003eKatarina studied the fancy bottle that read “hair gloss” and with a shrug, began to pour the clear liquid onto her palm. She had taken it from Blanche’s bathroom and figured it had to be good stuff. Hell, most of the writing on the bottle was in French so it had to be good.\u003c/p\u003e\n\u003cp\u003eThe thought of Blanche made her frown. Nothing had been as satisfying as leaving that bitch stranded in her big swanky mansion with one bullet and a can of chili. Curtis and Katarina had considered taking bets if Blanche would actually use the bullet on herself, but then they both started laughing when they both realized she wouldn’t be smart enough to do that. It was a cruel thing to do, but after Blanche had done so much harm, she didn’t feel any guilt.\u003c/p\u003e\n\u003cp\u003eKatarina spread the clear glob over her hair, rubbing it in per the instructions. She was dressed in jeans and a pretty green sweater. Bill had asked her to join him for a drink when he got back and she wanted to look her best. Nervously, she ran her fingers through her red hair, trying to tame the frizziness that made it look like a lion mane.\u003c/p\u003e\n\u003cp\u003eShe was disappointed she and Curtis hadn’t run into Ray. They had spotted a car crumpled against some trees at the base of the hill where Blanche’s mansion sat and suspected he had rolled it on purpose. Steam was still billowing out from under the hood. Most likely he had taken off in Stephen’s car. They had found a stash of empty boxes inside the house.\u003c/p\u003e\n\u003cp\u003eAfter what had happened to Juan, she had an itchy finger. She had originally lobbied to put Blanche down like a rabid dog, but Travis’ idea to dump her at home with just one bullet had been all too delightful.\u003c/p\u003e\n\u003cp\u003eHer hair wasn’t looking much better yet.\u003c/p\u003e\n\u003cp\u003eJust as she had gotten back from dumping Blanche, Bill caught her by surprise with his talk of a drink. He was such a nice man she hadn’t expected him to really pay much attention to her beyond her job at the fort. She wasn’t used to nice men even noticing her that much.\u003c/p\u003e\n\u003cp\u003eFrowning into the mirror, she again put more glop on her hair. It was still frizzy.\u003c/p\u003e\n\u003cp\u003eAll her life she had been teased because of her unruly red hair. All sorts of names had been tagged onto her throughout her life. All of them were annoying. “Bozo” was probably the worst. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-29.html","bookId":2483,"creation":"Oct 5, 2019 5:01:33 PM","modification":"Oct 5, 2019 5:01:33 PM"}
