{"id":84686,"no":61,"title":"Page 61","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBette sat with some of the survivors and a few fort residents. She ate the biscuit on her plate slowly, picking off pieces, relishing the flavor. Across from her, a pretty Hispanic girl kept giving her furtive glances.\u003c/p\u003e\n\u003cp\u003eFinally, Bette put out her hand and said, “Bette.”\u003c/p\u003e\n\u003cp\u003eThe younger woman looked up at her, smiling shyly. “My name is Linda.”\u003c/p\u003e\n\u003cp\u003eThere was something startling and intense in the other woman’s gaze.\u003c/p\u003e\n\u003cp\u003eNervously, Bette continued to eat, but the heaviness inside felt a little lighter every time she caught the other woman looking at her.\u003c/p\u003e\n\u003cp\u003eThree little kids sat in silence, eating their food hungrily, at a table of strangers none of them knew. Occasionally, one of them would point at something in the room and they would all whisper together. No one really noticed the little ones; they were so quiet. But if they had listened, they would have realized the children were looking at the leftover Christmas decorations that no one had felt like climbing a ladder to get down.\u003c/p\u003e\n\u003cp\u003eBill and Katarina ate together, holding hands under the table, giving each other furtive looks. Despite the pain they felt around them, they were in their own little bubble of happiness. Bill was home and they were together. What exactly that meant, they weren’t sure yet. But it felt good and it felt right.\u003c/p\u003e\n\u003cp\u003eKevin and Nerit sat down together and ate in silence. As the dinner continued and people began to relax and laughter could be heard breaking out. Tears came to Kevin’s eyes. Overwhelmed, he put down his fork and began to cry. His wide shoulders shuddered as he openly wept. All he had worked so hard to accomplish had failed in the end. So many had died.\u003c/p\u003e\n\u003cp\u003eAnd yet, some still lived. They were safe, so perhaps he had not entirely failed. He wept because his soul was tired and he felt crushed by the remains of the burden that was no longer his.\u003c/p\u003e\n\u003cp\u003eNerit reached out and touched his shoulder. Then another man reached out and touched him. Slowly, people began to move around his table, reaching out to him, touching him, whispers of “Thank you”“You did well”“Good job” filled his ears. He looked up to see people smiling at him and he stood up on shaky legs.\u003c/p\u003e\n\u003cp\u003e“I wish I had done more. I wish everyone had made it. I’m so sorry,” he whispered.\u003c/p\u003e\n\u003cp\u003eSomeone took his hand and hugged him, then another person and another. Soon, he was being pulled and guided gently through the room, people embracing him, kissing his cheek, thanking him, crying with him.\u003c/p\u003e\n\u003cp\u003eIn the end, Nerit was there, her hand held out to him. He took it and she helped him from the room. She took him to her room and he lay down on her bed that smelled of lavender and sage.\u003c/p\u003e\n\u003cp\u003e“Sleep,” she told him.\u003c/p\u003e\n\u003cp\u003eHe covered his face, feeling like a child.\u003c/p\u003e\n\u003cp\u003e“Your job is done. Now you can sleep,” she repeated.\u003c/p\u003e\n\u003cp\u003eNodding, he closed his eyes and he felt her cool fingers rest on his forehead. He was certain he would never be able to sleep. But he did.\u003c/p\u003e\n\u003cp\u003eHe did not wake up for two days.\u003c/p\u003e\n\u003cp\u003e* * * * * Katie slipped into Juan’s room and found his mother and Guadalupe in the room with him. A strangely familiar teenager sat in a chair looking bored.\u003c/p\u003e\n\u003cp\u003e“Katie,” Juan said emotionally. He reached out to her and she took his hand quickly. She let herself be drawn down into a tight hug. Juan’s scraggly beard scratched her cheek when he kissed it.\u003c/p\u003e\n\u003cp\u003e“Juan, I came as soon as I could,” she said as she sat next to him.\u003c/p\u003e\n\u003cp\u003e“I know. I know. Have you met my grandma yet?”\u003c/p\u003e\n\u003cp\u003eKatie smiled at Guadalupe and reached out to the older woman. “We met.”\u003c/p\u003e\n\u003cp\u003eGuadalupe returned her smile. “We hung out at the mall together, right chica?”\u003c/p\u003e\n\u003cp\u003e“We certainly did,” Katie answered, and looked back at Juan. She could feel tears threatening her already. “Juan, about Jenni…”\u003c/p\u003e\n\u003cp\u003e“I already know,” Juan said quickly.\u003c/p\u003e\n\u003cp\u003e“Who…”\u003c/p\u003e\n\u003cp\u003e“Jenni. She came to me,” Juan answered.\u003c/p\u003e\n\u003cp\u003eRosie dabbed at her eyes. “He told me about his dream, but I thought maybe it was just a nightmare, but now…”\u003c/p\u003e\n\u003cp\u003e“She came to you in a dream?” Katie blinked.\u003c/p\u003e\n\u003cp\u003e“I don’t think it was a dream. I saw her. I felt her. She was wet and her hand was hurt. At first I thought she was just home, but then I realized…”\u003c/p\u003e\n\u003cp\u003eJuan faltered and his voice grew hoarse as he continued. “I realized she was telling me goodbye.”\u003c/p\u003e\n\u003cp\u003eFresh tears filled Katie’s eyes as she clung to Juan’s hand. “She fell into water. But away from where they could get to her. They didn’t touch her.\u003c/p\u003e\n\u003cp\u003eAnd she’s not one of them.”\u003c/p\u003e\n\u003cp\u003eJuan sighed with relief and covered his eyes, trying to compose himself.\u003c/p\u003e\n\u003cp\u003e“Did you, Katie? You..you…did..it?”\u003c/p\u003e\n\u003cp\u003eKatie nodded. “I did.”\u003c/p\u003e\n\u003cp\u003eJuan drew her down into a tight hug again. “Thank you, Katie…thank you…”\u003c/p\u003e\n\u003cp\u003e* * * * * “I dreamed of my Mom,” Jason whispered to Travis in a slurred voice.\u003c/p\u003e\n\u003cp\u003eStartled, Travis looked up to see the boy had opened his eyes. Considering how strong the sedative was that Charlotte gave him, Travis was surprised to see Jason was awake. Next to him, on the bed, Jack continued to sleep, his tail wagging slightly.\u003c/p\u003e\n\u003cp\u003e“I saw my Mom. She’s okay,” Jason whispered in a hoarse voice. “She’s okay.” The boys eyes slowly closed and he was asleep.\u003c/p\u003e\n\u003cp\u003eNext to him, Jack let out a contented sigh.\u003c/p\u003e\n\u003cp\u003eTravis looked cautiously around the room. He felt foolish, but whispered softly, “Hey, Jenni. Don’t go too far. We still need you.”\u003c/p\u003e\n\u003cp\u003eIf the ghost was truly in the room, he wasn’t sure, but Travis felt better saying the words. He sat back in his chair, took a deep breath, and closed his eyes.\u003c/p\u003e\n\u003cp\u003e“Stay close, Jenni. Stay close.”\u003c/p\u003e\n\u003cp\u003e* * * * * Peggy finished checking in another survivor from the mall and rubbed her eyes. The line was getting shorter and people were getting settled. Soon she would be able to relax and eat the dinner that was cooling on the table behind her.\u003c/p\u003e\n\u003cp\u003eLooking up, she didn’t see anyone in front of the check-in counter, but the people that appeared next in line were staring with blank looks on their faces.\u003c/p\u003e\n\u003cp\u003e“Next,” she said again.\u003c/p\u003e\n\u003cp\u003eNo one moved forward.\u003c/p\u003e\n\u003cp\u003eThen a small hand reached up over the counter and waved.\u003c/p\u003e\n\u003cp\u003ePeering over the counter, Peggy saw three kids looking up at her. “Oh, there you are. But where are your Mommy and Daddy.”\u003c/p\u003e\n\u003cp\u003e“They got eated up,” the oldest girl said.\u003c/p\u003e\n\u003cp\u003eThe two younger kids nodded solemnly in agreement.\u003c/p\u003e\n\u003cp\u003ePeggy didn’t know what to say.\u003c/p\u003e\n\u003cp\u003e“We need a room,” the oldest girl continued.\u003c/p\u003e\n\u003cp\u003e“Well, we can’t just put you in a room by yourself,” Peggy answered.\u003c/p\u003e\n\u003cp\u003e“Do we have to go outside with the zombies?” The little girl looked terrified.\u003c/p\u003e\n\u003cp\u003e“Oh, no no. I meant…well, come around the desk. You need to have a room with an adult taking care of you.”\u003c/p\u003e\n\u003cp\u003eObediently, the children came around the desk and stared at her. Feeling flustered, Peggy gazed at the little darlings pondering what to do with them. It was too late in the day to try to find someone else. They’d have to stay with her.\u003c/p\u003e\n\u003cp\u003e“Okay, well, you can stay with me and my little boy. I’m sure he will enjoy the company.”\u003c/p\u003e\n\u003cp\u003eThe three kids kept staring at her with their shell-shocked expressions.\u003c/p\u003e\n\u003cp\u003eFinally, the oldest girl said. “Is Christmas in your house?”\u003c/p\u003e\n\u003cp\u003e* * * * * Katie stood up and slowly stretched. Juan was finally asleep and Rosie was snoring in her chair. Looking over at Guadalupe, she saw that the old woman was still praying the rosary. The teenage boy was looking at a magazine. Katie blinked, then leaned toward him slowly, studying his face.\u003c/p\u003e\n\u003cp\u003eThe boy slowly looked up at her. “What do you want?”\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003eThe boy blinked. “Uh….why?”\u003c/p\u003e\n\u003cp\u003eKatie suddenly recognized him and gasped. “Oh, my God. You are that kid from the convenience store that we kept telling about the zombies and you wouldn’t believe us!”\u003c/p\u003e\n\u003cp\u003eThe boy hunched his shoulders, then said, “Yeah, so what?’ “What are you doing with Guadalupe?”\u003c/p\u003e\n\u003cp\u003e“He’s a good boy,” Guadalupe assured Katie. “He came with the soldiers to the rescue center and he always pushes my chair around.”\u003c/p\u003e\n\u003cp\u003eKatie shook her head in amazement. “Oh, my God! The last time I saw him he was running from the zombies.”\u003c/p\u003e\n\u003cp\u003e“I run fast. I got away. The soldiers picked me up and Guadalupe is like my grandma now. She’s pretty cool.” The boy shrugged his shoulders again.\u003c/p\u003e\n\u003cp\u003eKatie was in shock, but it was a pleasant one. “Well, I’m glad that you’ve been helping her.”\u003c/p\u003e\n\u003cp\u003eWith a slight laugh, she walked to the door and looked back at the boy again. Somehow, seeing him alive made her feel better. The world wasn’t completely filled with death and it was a small comfort she would embrace.\u003c/p\u003e\n\u003cp\u003e* * * * * Curtis stretched his legs and moved out of the communication center to see Linda walking down the hall.\u003c/p\u003e\n\u003cp\u003e“Hey, Linda,” he said with a sheepish grin.\u003c/p\u003e\n\u003cp\u003e“Hey, Curtis,” she answered with a smile.\u003c/p\u003e\n\u003cp\u003e“I hear that disco night is still on for Friday. We still going together?”\u003c/p\u003e\n\u003cp\u003eCurtis asked.\u003c/p\u003e\n\u003cp\u003eLinda chewed her bottom lip. “Yeah, I think so.” \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-61.html","bookId":2483,"creation":"Oct 5, 2019 5:01:34 PM","modification":"Oct 5, 2019 5:01:34 PM"}
