{"id":84692,"no":67,"title":"Page 67","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Okay,” Charlie answered, slowly sliding off the windowsill. He stood on still shaky legs and took a deep breath. “Is it right? To leave her?” His voice was soft, but the emotion was thick.\u003c/p\u003e\n\u003cp\u003e“I listened in on her last conversation with Central,” Ruben said oh so quietly. “Everything she’s been saying is bullshit. They aren’t telling her to find a safe location for pickup. They’re telling her they ain’t gonna get us.”\u003c/p\u003e\n\u003cp\u003eCharlie pressed his lips firmly together and in the moonlight his eyes glistened with tears. He was an East Texas bayou boy. All he wanted to do was get home to the swamps. Ruben was from south San Antonio. He wanted to go home, too, but he knew that there was nothing left. Central had given Charlie hope and Ruben had just killed it. He felt like a shit doing it, but they had made enough mistakes.\u003c/p\u003e\n\u003cp\u003e“We left those people in the mall…” Charlie whispered, his voice catching.\u003c/p\u003e\n\u003cp\u003e“We saw the smoke. But we kept going…”\u003c/p\u003e\n\u003cp\u003e“I know. We fucked up,” Ruben said softly.\u003c/p\u003e\n\u003cp\u003eCharlie lowered his eyes, then nodded. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“Look, kid, we stay with her, we die. You saw what she did to Raleigh.\u003c/p\u003e\n\u003cp\u003eShe’ll do it to us. We’re her fucking bodyguards. She doesn’t give a shit about us,” Ruben said firmly.\u003c/p\u003e\n\u003cp\u003eCharlie sighed, then picked up his backpack very quietly. “I know. I just wanted to go home.”\u003c/p\u003e\n\u003cp\u003eRuben nodded and grabbed the boy firmly by the back of the neck and pressed his forehead to the boy’s. Behind them the Senator snored loudly.\u003c/p\u003e\n\u003cp\u003e“I’m gonna get you to a safe place. I promise.”\u003c/p\u003e\n\u003cp\u003e“The fort?”\u003c/p\u003e\n\u003cp\u003eRuben sighed. “No. We fucked up like the devil and we’re cast out of paradise. We gotta find another place.”\u003c/p\u003e\n\u003cp\u003eThe younger man looked fragile in the light. Like a ten year old. He reminded Ruben of his younger brother and it hurt like hell.\u003c/p\u003e\n\u003cp\u003eWithout another word, they crept across the floor, careful not to make noise, then stealthily down the stairs. The zombie infestation was minimal in this town, but they carefully looked out the windows before unbolting the door. Stepping out into the cool spring air, they moved toward the truck.\u003c/p\u003e\n\u003cp\u003eA zombie lurched out from the shadows, uttering a low moan startling both of them. Its rotting hands reached for them as its yellowed teeth champed together. Ruben stepped forward it and firmly cold-cocked it with his rifle. It fell to the ground, still moaning. Ruben brought the rifle butt down again and silenced the fiend.\u003c/p\u003e\n\u003cp\u003eCharlie slipped into the driver’s seat of the truck and flung his bag in the back. It held a few possessions, but mostly ammo for the hunting rifle he had picked up a few towns back.\u003c/p\u003e\n\u003cp\u003eRuben also slid into the truck and shut the passenger door.\u003c/p\u003e\n\u003cp\u003e“Where are we going?”\u003c/p\u003e\n\u003cp\u003eRuben stared down the silent street. A few zombies staggered through the gloom, washed gray by the moonlight.\u003c/p\u003e\n\u003cp\u003e“West.”\u003c/p\u003e\n\u003cp\u003eCharlie nodded. “Okay.”\u003c/p\u003e\n\u003cp\u003eThe truck roared to life and moved down the road a block before the headlights flipped on. It moved faster, zombies bouncing off its grill, then it turned a corner and was gone.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the Senator snored on.\u003c/p\u003e\n\u003cp\u003eChapter 25\u003c/p\u003e\n\u003cp\u003e1. A Beautiful Day Gone Wrong\u003c/p\u003e\n\u003cp\u003eTravis glanced out of the helicopter window down into the lush hill country and slightly smiled. It was beautiful now that spring was fully spread over the land. Trees were radiant in their coats of leaves and the wild grass flowed like rich green water over the hills. Cows ambled down country roads while deer frolicked among the overgrown orchards. A few horses were racing across a field with wild glee, free of human restraints.\u003c/p\u003e\n\u003cp\u003e“Beautiful, huh?” Kevin grinned over at him. “A gorgeous April day.”\u003c/p\u003e\n\u003cp\u003eTravis nodded and adjusted his headset slightly. It was uncomfortable but it was the only way to hear anyone above the roar of the helicopter. “I wish Katie could see it. That the world is still alive.”\u003c/p\u003e\n\u003cp\u003e“She will. Things are getting better for all of us,” Kevin answered.\u003c/p\u003e\n\u003cp\u003eIt had been weeks since the last zombie had been seen around the fort. Of course this didn’t stop the constant reinforcement of the walls or the defensive traps being put in place. Catapults were up on the walls now, giving the fort a medieval feel. Large bins were full of all sorts of heavy trash to lob at any invading zombie horde. The walls were higher now and topped with razor wire. The new areas were being reinforced.\u003c/p\u003e\n\u003cp\u003eEveryone, including children, were being given regular training to defend themselves. Someone nicknamed the fort “Sparta.” After seeing a five year old spearing a zombie dummy over and over again, it somehow seemed appropriate.\u003c/p\u003e\n\u003cp\u003eWhat a bizarre world to bring a child into, yet, they had to move on. Live on.\u003c/p\u003e\n\u003cp\u003e“I know that,” Travis said after a long moment. “I know things are better.\u003c/p\u003e\n\u003cp\u003eBut it’s hard not to look back and mourn all that we have lost.”\u003c/p\u003e\n\u003cp\u003e“How is Katie doing about Jenni?”\u003c/p\u003e\n\u003cp\u003e“She won’t talk about her anymore. She’s doing great with the pregnancy and we’re fine. Jenni is a topic we can’t address at all.” Travis rubbed his chin and sighed. “I miss Jenni, too, but they were out there on their own for awhile and that really bonded them. Katie is taking her loss very, very hard.”\u003c/p\u003e\n\u003cp\u003eKevin’s expression was sad and understanding. “Yeah. After awhile you feel you can’t lose anymore or you’ll lose yourself.”\u003c/p\u003e\n\u003cp\u003eThinking of Katie and her radiant smile, Travis silently agreed. He couldn’t imagine a world without her. The feel of her soft hair, the kiss of her lips. In every way he completely adored her. If he lost her… It killed him to see Juan working so slowly, but so diligently on his small memorial garden for Jenni. Juan was not only in physical pain, but he was emotionally hurting in a way Travis could only imagine. Yet, what Travis imagined was so painful, he couldn’t fathom what the reality must be like.\u003c/p\u003e\n\u003cp\u003eJuan had to live that reality.\u003c/p\u003e\n\u003cp\u003eJuan joined them for the Thursday night poker games, but he seemed a muted version of himself. He still laughed and joked, but his expression was haunted. Rosie told Travis that Juan just needed to find something to live for. Maybe that little garden was it. At least, for now.\u003c/p\u003e\n\u003cp\u003eSlowly, the helicopter banked over the ranch the fort had reclaimed and Travis caught sight of the cowboys riding their horses alongside the herd of cows. They were moving them to a reinforced pasture surrounded by a new high fence.\u003c/p\u003e\n\u003cp\u003e“This is really amazing. We’re really doing it. Building the new world,”\u003c/p\u003e\n\u003cp\u003eTravis said in awe.\u003c/p\u003e\n\u003cp\u003e“Yep,” Kevin grinned. “We are.”\u003c/p\u003e\n\u003cp\u003e“As long as-”\u003c/p\u003e\n\u003cp\u003e“Don’t jinx it, man!” Kevin gripped his arm and gave him a stern glare.\u003c/p\u003e\n\u003cp\u003e“Don’t say anything to jinx it. Just enjoy it.”\u003c/p\u003e\n\u003cp\u003eTravis laughed, then inclined his head. “You’re right. You’re right.”\u003c/p\u003e\n\u003cp\u003eThe helicopter finished its pass and headed back toward the fort on the hill.\u003c/p\u003e\n\u003cp\u003e2. Daddy One\u003c/p\u003e\n\u003cp\u003eIt started slowly as all love stories do.\u003c/p\u003e\n\u003cp\u003eIt started with one lone man working long hours on a small garden in a corner of what had been a construction site. Day by day, he toiled slowly and painfully. His long curly ponytail fell over one shoulder as he worked and he rarely looked up as people strolled by.\u003c/p\u003e\n\u003cp\u003eSilence is what he craved and silence is what he received. Everyone seemed afraid to talk to him and he was relieved. He didn’t want to talk about her.\u003c/p\u003e\n\u003cp\u003eHis Jenni.\u003c/p\u003e\n\u003cp\u003eHis loca.\u003c/p\u003e\n\u003cp\u003eHis heart and his love.\u003c/p\u003e\n\u003cp\u003eSo he toiled on the memorial garden, the last thing he could give her.\u003c/p\u003e\n\u003cp\u003eTrue love comes slowly, they say.\u003c/p\u003e\n\u003cp\u003eIn Jenni’s case it had hit him so hard he had never seen it coming. Just one day it was there and it was good. He had relished every moment with her. In his mind’s eye he could see her laughing until she fell over in a heap or dancing with wild abandon to some horrible song. Then there were the quiet times when she lay in his arms and her smile made this life beautiful and good.\u003c/p\u003e\n\u003cp\u003eNow she was gone and he could find no beauty around him. Everything was gray and dark.\u003c/p\u003e\n\u003cp\u003eSo he was planting flowers for her. Something beautiful to remind him of her beauty.\u003c/p\u003e\n\u003cp\u003eWhen he had started his little endeavor, Charlotte’s strict rules ringing in his ears, he had felt he would never love again.\u003c/p\u003e\n\u003cp\u003eHe was wrong.\u003c/p\u003e\n\u003cp\u003eWorking hard one morning, a shadow fell over him. He did not look up.\u003c/p\u003e\n\u003cp\u003eMost of the time he was working with tears in his eyes and he did not want to reveal them to anyone. This time was no different. He did not look up.\u003c/p\u003e\n\u003cp\u003e“Whatcha doing?”\u003c/p\u003e\n\u003cp\u003e“Planting a memorial garden.”\u003c/p\u003e\n\u003cp\u003eStandard reply. Standard neutral voice.\u003c/p\u003e\n\u003cp\u003e“What does that mean?”\u003c/p\u003e\n\u003cp\u003eThe voice was tiny. Female.\u003c/p\u003e\n\u003cp\u003e“It’s for those who died. To remember them.”\u003c/p\u003e\n\u003cp\u003e“Oh.” A long pause. Then, “My Mommy and Daddy died.”\u003c/p\u003e\n\u003cp\u003eHesitating, he looked up slowly.\u003c/p\u003e\n\u003cp\u003eA blond girl around eight or nine years old stood above him. Her long blond hair trailed around her face and her eyes were so dark and vivid, they reminded him of Jenni. Holding tight to the girl’s t-shirt was a little boy around four or five and another girl maybe around six. The little boy had masses of dark hair and big chestnut brown eyes. The second girl was blond with clear blue eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-67.html","bookId":2483,"creation":"Oct 5, 2019 5:01:34 PM","modification":"Oct 5, 2019 5:01:34 PM"}
