{"id":84693,"no":68,"title":"Page 68","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt was the three children Jenni had given her life for.\u003c/p\u003e\n\u003cp\u003eJuan had been avoiding them for weeks now. He had seen them wandering through the fort, always looking a bit lost, three little waifs.\u003c/p\u003e\n\u003cp\u003ePeggy tried hard to take care of them, but the three children did not speak to her or anyone else. The oldest occasionally would ask a question, but mostly they drifted through the fort like tiny ghosts.\u003c/p\u003e\n\u003cp\u003eJuan didn’t know what to say. At times, he could barely stand to look at the three children. He almost hated them. They were alive because Jenni had died.\u003c/p\u003e\n\u003cp\u003eThe little boy leaned down and began to gently run his fingers through the earth at the base of the freshly planted violets.\u003c/p\u003e\n\u003cp\u003e“I have a lot of work to do,” Juan finally said.\u003c/p\u003e\n\u003cp\u003e“Can we help?” the oldest one asked.\u003c/p\u003e\n\u003cp\u003e“No, no. I don’t think so.”\u003c/p\u003e\n\u003cp\u003eThe middle child, her lips pursed, gently ran her fingers over the features of the face of the Virgin Mary statue. “She’s pretty.”\u003c/p\u003e\n\u003cp\u003eJuan felt a sense of panic coming over him.\u003c/p\u003e\n\u003cp\u003eThe oldest girl squatted down and began to dig another hole. A whole tray of flowers were waiting to be planted. They had been salvaged from yards around town by Linda and Bette for him.\u003c/p\u003e\n\u003cp\u003e“We used to do this with our Mommy,” she said finally.\u003c/p\u003e\n\u003cp\u003eJuan felt a lump in his throat and fought not to cry.\u003c/p\u003e\n\u003cp\u003eThe children clustered around him, already finding things to do. The middle child began lay bits of pink granite in a little row along the walkway Juan had already laid down. People had been writing the names of their deceased family members on each stone. The oldest girl began to work at planting the next batch of flowers while the little boy diligently helped.\u003c/p\u003e\n\u003cp\u003eUnable to speak for fear of crying, Juan let them be and kept to his work.\u003c/p\u003e\n\u003cp\u003eTheir tiny presences made him angry. Jenni had died to save them. They were here because she was gone.\u003c/p\u003e\n\u003cp\u003e“What is your name?” the little boy asked in a hushed, raspy voice.\u003c/p\u003e\n\u003cp\u003eAs far as Juan knew, this was the first time the boy had said anything to anyone.\u003c/p\u003e\n\u003cp\u003e“Juan,” he managed.\u003c/p\u003e\n\u003cp\u003e“One,” the little boy said with satisfaction.\u003c/p\u003e\n\u003cp\u003e“No. Juan.”\u003c/p\u003e\n\u003cp\u003e“One,” the boy said with a small smile.\u003c/p\u003e\n\u003cp\u003eJuan started to correct him and then thought differently. The boy was talking and that had to be important.\u003c/p\u003e\n\u003cp\u003eDespite his agony, despite his pain, he let them be. To his surprise they were good little workers. When he came out the next day to work, they were waiting for him. He hesitated, not sure if he could deal with their presence another day, but finally he relented to their tiny smiles.\u003c/p\u003e\n\u003cp\u003eThey worked hard around him, sweating, getting dirty, talking in hushed voices, but they were determined to help. A few people came by and tried to get the children to talk, but they refrained, drawing close to Juan as if seeking his protection.\u003c/p\u003e\n\u003cp\u003eOnce more, he felt angry and wanted to scream at them and make them flee, but he couldn’t.\u003c/p\u003e\n\u003cp\u003eSo they worked on together.\u003c/p\u003e\n\u003cp\u003eEvery morning he found them waiting for him. Peggy would make sure they had breakfast and had work clothes on, but otherwise left them to Juan’s supervision. They called him One and would ask him countless questions about the garden, but when others would speak to them, they fell silent.\u003c/p\u003e\n\u003cp\u003eSlowly, his anger faded and he began to enjoy their company. The garden began to look lush and beautiful with its red brick walkways edged with pink granite and the plethora of blooming flowers.\u003c/p\u003e\n\u003cp\u003e“I like bluebonnets,” the oldest girl, Margie, told Juan and tickled his nose with one.\u003c/p\u003e\n\u003cp\u003e“And why is that?”\u003c/p\u003e\n\u003cp\u003e“Cause they’re pretty,” she answered with a laugh and rolled her eyes.\u003c/p\u003e\n\u003cp\u003eJuan just smiled.\u003c/p\u003e\n\u003cp\u003eHe began to have lunch with them and then breakfast. They began to laugh and tell him stories. Every night when they went inside to be with Peggy and her son, they would hug him and give him kisses on his cheeks.\u003c/p\u003e\n\u003cp\u003eThe pain slowly lessened inside and he found himself smiling.\u003c/p\u003e\n\u003cp\u003eOne morning, as a helicopter ascended into the sky, he found himself seated in the completed garden. The bench beneath him was cool and the breeze was fresh. The three little ones came and sat on the bench across from him, all three smiling.\u003c/p\u003e\n\u003cp\u003e“We decided that you are now our new daddy,” the oldest informed him.\u003c/p\u003e\n\u003cp\u003eThe other two nodded, smiling wide happy smiles.\u003c/p\u003e\n\u003cp\u003eFlustered, Juan said, “You did? Why?”\u003c/p\u003e\n\u003cp\u003e“The lady with the black hair told us,” the eldest answered.\u003c/p\u003e\n\u003cp\u003eThe other two nodded.\u003c/p\u003e\n\u003cp\u003e“Which lady?” He already knew the answer in his heart.\u003c/p\u003e\n\u003cp\u003e“The lady from the mall. The nice lady who took care of us after Mommy got…” the girl hesitated. “You know.”\u003c/p\u003e\n\u003cp\u003e“When did she tell you this?”\u003c/p\u003e\n\u003cp\u003e“Last night. In our dreams,” the little boy answered. “She’s pretty.”\u003c/p\u003e\n\u003cp\u003eThis was so like Jenni. She was making sure the kids were fine and that he was, too. He laughed, tears in his eyes, and whispered, “Oh, Loca…”\u003c/p\u003e\n\u003cp\u003eThen the kids were leaping on him, hugging him, kissing him and he held them tight.\u003c/p\u003e\n\u003cp\u003e“Daddy One! Daddy One,” they chanted.\u003c/p\u003e\n\u003cp\u003eJuan felt the shadow of pain lift from him and he threw back his head and laughed. He was so full of love he felt as if it must be bursting out of him.\u003c/p\u003e\n\u003cp\u003eHe leaped to his feet and danced around with glee, the kids dangling off of him.\u003c/p\u003e\n\u003cp\u003eSomewhere, he knew Jenni was smiling down on them.\u003c/p\u003e\n\u003cp\u003e3. The Wickedest Woman in Texas Returns\u003c/p\u003e\n\u003cp\u003ePatting her hair once more, the Senator regarded her image in the mirror.\u003c/p\u003e\n\u003cp\u003eArmed with a teasing comb and the best hairspray on the market, she had manipulated her blond hair into a bubble of perfectly coiffed golden locks.\u003c/p\u003e\n\u003cp\u003eSpritzing more hairspray onto her bouffant, she closed her heavily made up eyes, complete with false eyelashes, and enjoyed the fragrance of the spray as it fell in tiny drops over her hair and face.\u003c/p\u003e\n\u003cp\u003eOpening her eyes again, she studied her reflection in the soft, white glow of the chandelier over her head and smiled. It was her best smile. Her trademark. The pearly white freshly scrubbed teeth glistened between her bright pink lips. Perfect.\u003c/p\u003e\n\u003cp\u003eTilting her head, she fastened diamond and pearl earrings to her ears as the tranquil sounds of Frank Sinatra wafted in from the intercom.\u003c/p\u003e\n\u003cp\u003eAt least Blanche had the decency to keep some good music in her old mansion.\u003c/p\u003e\n\u003cp\u003eWalking away from the vanity, she studied herself in the full length gilded mirror in Blanche’s enormous closet and turned one way then the other.\u003c/p\u003e\n\u003cp\u003eThe dark pink suit looked perfect and the gold sling back heels were very nice. Her nails on her fingertips and toes were freshly polished.\u003c/p\u003e\n\u003cp\u003eNearly three weeks ago she had awakened to utter silence in that dank old museum and realized the chickenshits had run off without her. Sitting up she had studied the room while listening for sounds of any undead in the building. At least the assholes had been decent enough to shut the door behind them.\u003c/p\u003e\n\u003cp\u003e“Fuckers,” she had hissed, then reached down and picked up her hunting rifle.\u003c/p\u003e\n\u003cp\u003eNow it was propped on a chair behind her. She had used it a few times since that day. After making sure that the idiots had really run off without her, she had slipped off the safety, slung her bag with the portable radio inside it over one shoulder, and walked into the morning air. Comfortable with the hunting rifle, she was a Texas girl after all, she had taken a deep breath as she walked to steady her nerves. If she remembered correctly, she had downed about five zombies before commandeering a truck standing empty in the middle of the road with the keys still in the ignition.\u003c/p\u003e\n\u003cp\u003eIt had taken a few tries to get the engine to turn over. She knew she had been lucky on that point. The zombies banging on the windows had been damned determined.\u003c/p\u003e\n\u003cp\u003e“Oh, shit,” she now muttered and fussed with the collar of the jacket.\u003c/p\u003e\n\u003cp\u003eThe last few weeks had been hard. She had even cried once or twice. She hated not being able to fix her hair and makeup. Worse yet, forced to eat convenience store junk food, she had often been sick to her stomach.\u003c/p\u003e\n\u003cp\u003eSticking to back roads, she had slowly found her way back here to Blanche’s mansion.\u003c/p\u003e\n\u003cp\u003eWhen she had driven up, she had found the front door open and dried bits of bone and flesh on the doorstep. No zombies had been around and she had stepped inside and shut the door behind her. Quickly searching the house, she found nothing dead and smelly to greet her.\u003c/p\u003e\n\u003cp\u003eThe water had been on, but there had been no electricity. Checking the breaker box, she had seen that the main one had flipped. In a few seconds, the mansion was lit up and the air conditioning switched on.\u003c/p\u003e\n\u003cp\u003eWhat had been even nicer, was that on her way to the mansion she had found a car stalled off the side of the road, full of supplies. It looked like someone had been fully stocked and making a run for safety then their car had broken down. Since there was something disgusting and dead on the doorstep, she wondered if that was the driver. Or maybe, Blanche.\u003c/p\u003e\n\u003cp\u003eOh, well.\u003c/p\u003e\n\u003cp\u003eGoing over to Blanche’s dresser, she pulled on a nice string of pearls and studied her reflection in another mirror.\u003c/p\u003e\n\u003cp\u003eYes, much better.\u003c/p\u003e\n\u003cp\u003eFrowning as the sound of zombies moaning seemed to grow louder, she walked over and turned up the music. She really had no time to deal with them and they were definitely not getting in past the heavy doors and reinforced glass.\u003c/p\u003e\n\u003cp\u003eFeeling pleased with herself, she went downstairs and into the kitchen. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-68.html","bookId":2483,"creation":"Oct 5, 2019 5:01:34 PM","modification":"Oct 5, 2019 5:01:34 PM"}
