{"id":84632,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eRealizing she may have upset Katie, Peggy looked back at the tall blond standing behind her. “I mean, we ain’t gonna get eaten. I mean, look at this place. We got it made compared to the poor bastards out there. I’m sure we’re all gonna be safe and sound. And your sweet baby will be fine.”\u003c/p\u003e\n\u003cp\u003eSmiling slightly, Katie reached out to pat Peggy on the shoulder. “I know.”\u003c/p\u003e\n\u003cp\u003e“And that team will come back packed to the gills with ammunition and more supplies, and I won’t be such a worried old hag.”\u003c/p\u003e\n\u003cp\u003e“Peggy, you’re not old and you’re not a hag.”\u003c/p\u003e\n\u003cp\u003e“I feel like it. Worn out and tired. Cody has got that damn cold something fierce, and I was up all night with him. I just hate seeing him suffer. It makes me feel so helpless.” Peggy sighed and shook her head. “I miss his daddy at times like these. He was so good at calming him down.”\u003c/p\u003e\n\u003cp\u003ePeggy rarely spoke about her husband who had died in the first days.\u003c/p\u003e\n\u003cp\u003eKatie knew from things Peggy’s little boy said that they had seen him transformed into a zombie. Cody was a sensitive soul to begin with and the death of the world had crushed him. For months he had not left his mother’s side, always clinging to her and terrified whenever she was out of his view. But lately, with other children joining the fort, he had been braver. He was now able to be away from his mother a few hours at a time without panicking.\u003c/p\u003e\n\u003cp\u003eThe door to the storeroom opened, and Nerit stood in the doorway. The older woman had her yellowed, silver hair drawn back from her face and her sniper rifle was slung over one shoulder. By her reddened cheeks, it looked like she had just come off duty.\u003c/p\u003e\n\u003cp\u003e“The team just got back, Peggy. I think Yolanda is struggling with the communication center and lost track of them for a few minutes. Could you go check on her? Make sure she has it down?” Nerit asked.\u003c/p\u003e\n\u003cp\u003e“Sure thing,” Peggy answered, handing off her clipboard to Katie. “I told Curtis that one CB was shorting out. But did he listen? Oh, no.”\u003c/p\u003e\n\u003cp\u003eKatie listened to Peggy complain all the way down the hall, her voice fading away.\u003c/p\u003e\n\u003cp\u003e“How are you feeling?” Nerit asked. She slowly stepped into the room, and Katie noticed that the she was favoring one leg again. She wasn’t sure if anyone else realized that the woman in her early sixties was moving more slowly than usual.\u003c/p\u003e\n\u003cp\u003e“I’m good. I just have a few more boxes to go through then I’ll have an updated list for you.” Katie motioned to the last shelf of ammunition she had to count.\u003c/p\u003e\n\u003cp\u003eNerit tilted her head slightly, looking at the battered boxes nearby. “Well, I’ll finish for you. Jenni just got back and she’s asking for you. I think it got bad out there. She’s down in the paddock getting scrubbed down and checked for bites by Charlotte.”\u003c/p\u003e\n\u003cp\u003e“Ugh! She hates that.” Katie handed over the clipboard.\u003c/p\u003e\n\u003cp\u003e“It can’t be helped. Jenni has closer contact with the zombies than most.\u003c/p\u003e\n\u003cp\u003eShe punched one last week.” Nerit shook her head. “She’s taking too many risks again.”\u003c/p\u003e\n\u003cp\u003e“I’ll talk to her,” Katie assured the older woman.\u003c/p\u003e\n\u003cp\u003e“Thank you. I would, but she really doesn’t listen to anyone but you.”\u003c/p\u003e\n\u003cp\u003e“That’s the curse of being her best friend.” Katie winked and trudged out the door.\u003c/p\u003e\n\u003cp\u003eThe hotel’s ground floor was packed with people as shifts finished. Weary groups were making their way toward the elevators while a few lounged on the plush couches chatting. A new group of people, looking shellshocked and tired, were being checked into the hotel by Ken.\u003c/p\u003e\n\u003cp\u003e“Got Muslims now,” Curtis said, startling her. She hadn’t realized he was next to her.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eCurtis nodded toward the older man and woman dressed in traditional Indian garb. “Muslims.”\u003c/p\u003e\n\u003cp\u003e“I think they may be Hindu,” Katie answered.\u003c/p\u003e\n\u003cp\u003e“Still heathens,” Curtis said, shaking his head. “Don’t know if we should be taking in heathens.”\u003c/p\u003e\n\u003cp\u003eKatie turned to gaze at Curtis, her disapproval clearly reflected in her expression. “Really?”\u003c/p\u003e\n\u003cp\u003e“Well, we’re a God-fearing group, Katie. Bringing in other kinds is gonna cause trouble,” Curtis answered, his boyish face flush with emotion. “It’s rough enough keeping things going as it is.”\u003c/p\u003e\n\u003cp\u003e“Curtis, people are people. We can’t start picking and choosing or we’ll end up just like the Vigilante. Offing people because we don’t approve of them.”\u003c/p\u003e\n\u003cp\u003eA look of horror washed over the younger person’s face and he stepped back from her. “I-I-I didn’t mean...”\u003c/p\u003e\n\u003cp\u003eFeeling bad for the harshness in her tone, Katie hugged him. “It’s okay, Curtis. We’re all freaking out just a bit.”\u003c/p\u003e\n\u003cp\u003eHe clung to her for a second, then sheepishly stepped back. His face was so red, Katie felt embarrassed for him.\u003c/p\u003e\n\u003cp\u003eJenni stomped in, hair damp, face flushed, dressed in a big bathrobe with a bag slung over one shoulder. She was holding her boots in one hand and wrinkled her nose at Katie.\u003c/p\u003e\n\u003cp\u003e“Charlotte declared my clothes totaled. I really liked those jeans!”\u003c/p\u003e\n\u003cp\u003eKatie grinned, snagging Jenni’s free hand. “Oh, c’mon. It’s just an excuse to go dig a new pair out of the inventory.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but still! They looked good! I looked five pounds smaller!”\u003c/p\u003e\n\u003cp\u003e“You are five pounds smaller,” Katie pointed out. The people in the fort were slimmer now. Food was carefully distributed at each meal. Though people ate their fill, they were not overeating. Also, the hard work that always had to be done was whittling the fat off of beer bellies and strengthening muscles.\u003c/p\u003e\n\u003cp\u003eKatie noted Curtis making his escape, but she let him go. The poor guy was so easily flustered. She felt bad for the young man. He was the youngest of the Ashley Oaks police force and its only survivor.\u003c/p\u003e\n\u003cp\u003e“I got stuff to show you!” Jenni patted the bag at her side. “I had fun out there until...” She waved her hand, wiping away the pain that lingered in her eyes. “Enough of that. I’m back. Safe. Sound. Move on.”\u003c/p\u003e\n\u003cp\u003eKatie knew better than to push Jenni. “When do I get to see?”\u003c/p\u003e\n\u003cp\u003e“In your room. It’s top secret stuff.”\u003c/p\u003e\n\u003cp\u003e“I will not be treated in this manner!” The sharp female voice rang out in the lobby, slicing through the drone of conversation. A big candle hurtled through the air and slammed into a painting, sending it to the ground with a loud crash.\u003c/p\u003e\n\u003cp\u003eBlanche Mann, the town’s richest woman before the zombie rising and the meanest bitch most of them had encountered, stomped into the lobby, her high heels clicking loudly against the tiles.\u003c/p\u003e\n\u003cp\u003eLinda, Juan’s younger cousin, ducked as another candle hurtled over her head. “You said you would give me the Imotrex if I cleaned your hotel room!”\u003c/p\u003e\n\u003cp\u003e“You call that cleaning? That is the most piss poor job I have ever seen!\u003c/p\u003e\n\u003cp\u003eYou didn’t even polish my shoes or iron Stephen’s clothes!” Blanche was in a fury.\u003c/p\u003e\n\u003cp\u003e“Look, bitch, give me the Imotrex! We need it for the clinic!” Linda was a lithe little thing and easily ducked another candle. She wasn’t about to be intimidated. She put her hands on her hips and glowered at the other woman. “I did what you asked. Pay up!”\u003c/p\u003e\n\u003cp\u003e“I caught you going through my things trying to find something to steal!”\u003c/p\u003e\n\u003cp\u003e“I was looking for the pills that you promised me!”\u003c/p\u003e\n\u003cp\u003e“You’re a thief and I’m going to report you to Bill!” Blanche tossed back her heavily sprayed hair and began shouting for Bill.\u003c/p\u003e\n\u003cp\u003e“Call him, you stupid bitch, and I’ll tell him how you scammed me!”\u003c/p\u003e\n\u003cp\u003eLinda kicked a chair with agitation.\u003c/p\u003e\n\u003cp\u003e“You stupid, thieving spic!”\u003c/p\u003e\n\u003cp\u003eThat was enough for Katie. She stepped between Blanche and Linda.\u003c/p\u003e\n\u003cp\u003e“Calm down, Blanche, and give it a few minutes. We’ll get this sorted out.\u003c/p\u003e\n\u003cp\u003eYou don’t need to resort to insults.” Katie said in a soft, calm voice.\u003c/p\u003e\n\u003cp\u003e“Get out of my face!”\u003c/p\u003e\n\u003cp\u003eBlanche shoved Katie back with both hands. Linda caught Katie as she stumbled back.\u003c/p\u003e\n\u003cp\u003eThe next few minutes were sheer chaos. Jenni swooped in like an avenging angel, shouting in Spanish. Curtis tried to intercept her, only to be pushed out of the way. Blanche commenced screaming about her sister, the Texas state senator, and why she deserved to be treated better.\u003c/p\u003e\n\u003cp\u003eKatie wasn’t hurt by Blanche’s push, but everyone seemed to think she should sit down, much to her chagrin.\u003c/p\u003e\n\u003cp\u003eIt wasn’t until Bill showed up that any semblance of order returned to the hotel lobby. He got everyone separated and ordered everyone not involved to move on.\u003c/p\u003e\n\u003cp\u003e“She said if I cleaned her pigpen of a room she would give me Imotrex.\u003c/p\u003e\n\u003cp\u003eManny is suffering really bad migraines, and I wanted to get him some pills. We ran out a few weeks ago, and none of the supply runs have brought in any more.” Linda explained with her voice edged with her anger.\u003c/p\u003e\n\u003cp\u003e“She did a shitty job, tried to steal stuff, and has no right to lip off at me!”\u003c/p\u003e\n\u003cp\u003eBlanche tossed back her hair and glowered at Bill. “Besides, I don’t have the Imotrex here. She’ll have to go to my house and get it.”\u003c/p\u003e\n\u003cp\u003e“What? You didn’t say that!”\u003c/p\u003e\n\u003cp\u003eKatie caught Linda’s arm before she could launch herself at Blanche. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-7.html","bookId":2483,"creation":"Oct 5, 2019 5:01:33 PM","modification":"Oct 5, 2019 5:01:33 PM"}
