{"id":84699,"no":74,"title":"Page 74","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe felt relieved to some degree and smiled over at Eric, who nodded with approval.\u003c/p\u003e\n\u003cp\u003eJuan held up the first poster board and Kevin stepped forward. “Now, this is what we have to do…”\u003c/p\u003e\n\u003cp\u003e3. The Unexpected Guest\u003c/p\u003e\n\u003cp\u003eNerit felt bone weary as she entered her small hotel room that she now considered her home. Her old dog was asleep next to the bed, snoring loudly. He was sleeping more and more in his old age and she didn’t blame him.\u003c/p\u003e\n\u003cp\u003eKevin lingered in the doorway, watching her with some concern. She favored her leg as she walked now that she was out of view of the fort populace. She always made sure that no one could see how much her arthritic hip hurt her. It was important to her that people see her as indestructible, to trust her and her abilities.\u003c/p\u003e\n\u003cp\u003e“We should get you some medicine for that,” Kevin said after a beat.\u003c/p\u003e\n\u003cp\u003e“Hospitals aren’t safe,” Nerit answered as she sat down in the large recliner tucked into the corner of the room and slowly exhaled.\u003c/p\u003e\n\u003cp\u003eLeaning against the open door, Kevin shook his head at her. “You’re a bull-headed woman.”\u003c/p\u003e\n\u003cp\u003e“Yes, I am.” Nerit smiled.\u003c/p\u003e\n\u003cp\u003eHer old dog woke up and tottered over to her and laid his head on her knee. Scratching him behind the ears, Nerit slowly relaxed into the chair.\u003c/p\u003e\n\u003cp\u003e“Makes it hard to take care of you.”\u003c/p\u003e\n\u003cp\u003e“You know you don’t have to watch over me.”\u003c/p\u003e\n\u003cp\u003e“I know, but it makes me feel better,” Kevin answered. His eyes were concerned and she appreciated it despite herself. “Think the fort took the news well?”\u003c/p\u003e\n\u003cp\u003e“As well as could be expected,” Nerit answered.\u003c/p\u003e\n\u003cp\u003eKevin took a step into her room and the door shut behind him. With a solemn look on his face, he walked over and sat on the ottoman near her feet. “We need to talk about something important.”\u003c/p\u003e\n\u003cp\u003e“All right,” Nerit answered, waiting.\u003c/p\u003e\n\u003cp\u003e“If they get in, if there is no hope, if we can’t get out,” Kevin started.\u003c/p\u003e\n\u003cp\u003e“You have a plan.”\u003c/p\u003e\n\u003cp\u003e“Yes, explosives set in the ballroom.”\u003c/p\u003e\n\u003cp\u003e“All right. If you want, I can detonate them. I will take care of it,” Nerit answered. She gazed at him solemnly and sincerely. She would kill their friends and family to keep them from the brutal death the undead gave so ferociously.\u003c/p\u003e\n\u003cp\u003eKevin sighed. “No one can know about the explosives.”\u003c/p\u003e\n\u003cp\u003e“Agreed. Just make sure that you wire it up with enough explosive to destroy the ballroom and everyone in it. Make it a fast death.”\u003c/p\u003e\n\u003cp\u003eKevin rubbed his brow. “I hope it doesn’t come to that. All of us retreating to the ballroom just to face death by explosion.”\u003c/p\u003e\n\u003cp\u003e“Of course not. Neither do I,” Nerit answered softly.\u003c/p\u003e\n\u003cp\u003e“I would hate to think that I brought all those people here just to die.”\u003c/p\u003e\n\u003cp\u003eKevin sighed wearily. “I really thought we were safe here.”\u003c/p\u003e\n\u003cp\u003e“We are. For now. We just need to make sure things stay safe,” Nerit answered. “At least we don’t have to worry about the Vigilante on top of all of this.”\u003c/p\u003e\n\u003cp\u003e“The Vigilante was the Senator’s sister, right?”\u003c/p\u003e\n\u003cp\u003e“Yes. And good riddance to her.” Nerit ran her hand slowly over her hair.\u003c/p\u003e\n\u003cp\u003e“We just need to keep focused on the course we have determined.”\u003c/p\u003e\n\u003cp\u003eKevin nodded silently, then stood up, leaned over and kissed her cheek.\u003c/p\u003e\n\u003cp\u003e“Good night, Nerit.”\u003c/p\u003e\n\u003cp\u003e“Good night, Kevin,” Nerit answered, patting his cheek softly.\u003c/p\u003e\n\u003cp\u003eShe watched him walk out, his shoulders slumped with heavy emotions, and door shut behind him. Running a hand over her shortened hair, she exhaled slowly as she reached for her pack of cigarettes. With a small grunt, she stood up, moved to the window, and pulled the curtains back.\u003c/p\u003e\n\u003cp\u003eThe window slid open and she sat down on the wood chair she had placed next to the window so she could relax, look at the stars, and smoke. She had one of the rooms without a fancy balcony.\u003c/p\u003e\n\u003cp\u003eLighting up, she felt her sore muscles protesting as she tried to relax.\u003c/p\u003e\n\u003cp\u003eExhaling slowly, she rested her forehead against her hand and looked down into the silent courtyard below.\u003c/p\u003e\n\u003cp\u003e“Strange things happening since the dead all stood up,” Ralph’s voice said.\u003c/p\u003e\n\u003cp\u003eLooking up, Nerit saw her deceased husband sitting in her recliner, his hand stroking the Tucker’s floppy ears.\u003c/p\u003e\n\u003cp\u003e“Ralph,” she gasped.\u003c/p\u003e\n\u003cp\u003e“Things are all messed up now. Nothing like it was. Nothing quite right no more.”\u003c/p\u003e\n\u003cp\u003e“Ralph!”\u003c/p\u003e\n\u003cp\u003e“The dividing line is all blurred. Crossing over ain’t hard. Getting easier.\u003c/p\u003e\n\u003cp\u003eFor now.” Ralph smiled slightly at her. “You look real pretty, Nerit. I like yer hair.”\u003c/p\u003e\n\u003cp\u003e“Ralph, why are you here?” she whispered.\u003c/p\u003e\n\u003cp\u003eWith his crooked little smile, he said, “Came to take you home with me.”\u003c/p\u003e\n\u003cp\u003e“Ralph, no!” She stood up sharply, the cigarette falling from her hand.\u003c/p\u003e\n\u003cp\u003eShe immediately reached down and grabbed it, her back screaming in pain. “Ralph, I have too much to do here! Please, no! Ralph, no!”\u003c/p\u003e\n\u003cp\u003eSlowly standing up, Ralph held out one hand. “Honey, I know. You’re a good woman. Good soldier. You have done a good job avoiding death. You were supposed to go when I did, but you’re too damn stubborn.”\u003c/p\u003e\n\u003cp\u003eFor the first time in her life, Nerit felt afraid of her husband. “Ralph, please, I have so much to do here. Ralph, please.”\u003c/p\u003e\n\u003cp\u003eHe reached out and took her arms in his hands and he held her gently. He felt like real flesh and blood, but she knew he could not be. “I know, I know. But you’re sicker than you think, Nerit. You got the bone cancer.\u003c/p\u003e\n\u003cp\u003eThat’s why you’re hurting so bad.”\u003c/p\u003e\n\u003cp\u003eNerit held onto her husband, feeling the roughness of his shirt in her hands and his bony arms under it. “Ralph, if you can ask, for me, please….”\u003c/p\u003e\n\u003cp\u003eKissing her cheek, Ralph held her tight. Nerit felt tears sliding down her cheeks as her dog whined at her feet.\u003c/p\u003e\n\u003cp\u003e“I miss you, Nerit. Is it so bad to have peace?”\u003c/p\u003e\n\u003cp\u003e“But I won’t, Ralph. I won’t! Knowing that these people need me. For who I am, for what I am, I won’t have peace unless I help them. Tell Him that for me.” She drew back to gaze into her dead husband’s warm, loving eyes.\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003e“I love you, Nerit,” Ralph whispered, kissing her brow softly.\u003c/p\u003e\n\u003cp\u003eNerit felt something in her head pop. It was a soft, delicate feeling, as if someone had switched something off. Then she was falling, slipping from Ralph’s hands.\u003c/p\u003e\n\u003cp\u003eShe thought one more time, “No, not now” then the world faded into comforting black.\u003c/p\u003e\n\u003cp\u003e* * * * * Kevin had just started to open his hotel room door when he had the strong urge to return to Nerit’s room. He couldn’t explain the feeling in that moment nor would he in the future when he looked back on that horrible night. But it was so strong, he ran to her room. When he reached her door, he heard the sound of something being overturned and the mournful wail of her dog.\u003c/p\u003e\n\u003cp\u003eWithout a second thought, Kevin kicked in the door and rushed in. His worst fear was made real at the sight of Nerit lying on the floor, the floor lamp overturned beside her. The old dog was licking her face and whining loudly. A cigarette lay smoldering on the carpet.\u003c/p\u003e\n\u003cp\u003eKevin immediately grabbed the cigarette and tossed it into the nearby ashtray then knelt beside Nerit. She looked very frail as she lay on the floor, but also very young. The lines were smoothed from her countenance and her hair looked gold, not silver, in the light. Touching her wrist, he felt for her pulse and couldn’t find one. Tears brimming, he touched her neck. Maybe it was wishful thinking, but he thought he felt a faint pulse.\u003c/p\u003e\n\u003cp\u003ePicking up her surprisingly heavy form, he rushed toward the door whispering fervent prayers all the way.\u003c/p\u003e\n\u003cp\u003e4. Faith\u003c/p\u003e\n\u003cp\u003eTravis walked briskly through the lobby of the hotel. The meeting had gone well enough. People were signing up as volunteers for a variety of tasks, some life threatening, some not and there seemed to be a strong sense of determination to defeat the oncoming undead army.\u003c/p\u003e\n\u003cp\u003eOf course, in the midst of all the planning, the Baptist Coalition was getting ready to leave.\u003c/p\u003e\n\u003cp\u003eBill walked toward him and motioned for him to hold up. Travis stopped in his tracks, his hands tucked into the pockets of his jeans. Bill drew near, looking a tad breathless.\u003c/p\u003e\n\u003cp\u003e“Okay, got them set up in the extra short bus. Got extra fuel in the back and just about anything I could think of that they might need short term.\u003c/p\u003e\n\u003cp\u003eLong term, they are on their own.”\u003c/p\u003e\n\u003cp\u003e“Did you give them something to siphon gas out of cars?” Travis asked.\u003c/p\u003e\n\u003cp\u003e“Sure did and loaded them up with mostly MREs. Gave them hunting rifles for protection and some spears.”\u003c/p\u003e\n\u003cp\u003e“Sounds good,” Travis decided, crossing his arms over his chest. “Is that young family still going with them?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Bill answered sadly. “Yeah, they are. Can’t change their mind.\u003c/p\u003e\n\u003cp\u003eFather keeps saying that if they stay their kids will surely die. If they go, God will show them the way.”\u003c/p\u003e\n\u003cp\u003e“Let’s hope He does,” Travis answered grimly.\u003c/p\u003e\n\u003cp\u003e“They’re leaving tonight,” Bill added. “I tried to get them to stay until morning, but they just want to go. It’s like they think God’s about to hurl lightning bolts down on us.” \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-74.html","bookId":2483,"creation":"Oct 5, 2019 5:01:34 PM","modification":"Oct 5, 2019 5:01:34 PM"}
