{"id":84703,"no":78,"title":"Page 78","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eFrom above, Curtis watched in fascinated horror as one zombie tried to climb into the Durango as others tore at it, trying to get in instead. The Durango abruptly swerved and for a long moment was airbourne before it slammed down into a field at an angle. It slid across the unplowed, hard ground, shedding zombies as it went, then hit a piece of equipment hidden in the wild grass and flipped completely over. It tumbled maybe two times before coming to a stop, zombie-free, but a mangled wreck.\u003c/p\u003e\n\u003cp\u003e“Dammit,” Greta hissed. She swung the helicopter around, aiming for the runners pursuing the fallen vehicle.\u003c/p\u003e\n\u003cp\u003e“Look for survivors! Look for survivors!” Kevin’s voice was harsh with emotion.\u003c/p\u003e\n\u003cp\u003eCurtis gave him a dark look over his shoulder.\u003c/p\u003e\n\u003cp\u003eThe zombies were closing in on the Durango. The helicopter buzzed low over them as both Kevin and Ed fired at them.\u003c/p\u003e\n\u003cp\u003eCurtis saw the two women scramble out of a broken window and struggle across the field toward the tree line. He could see Linda’s face was smeared with blood and Bette’s arm was at an odd angle. He started to speak, but his voice caught in his throat.\u003c/p\u003e\n\u003cp\u003e“There they are,” Kevin shouted.\u003c/p\u003e\n\u003cp\u003eGreta glanced down, nodded and tried to move in for a rescue. Four runners darted through the wake of the helicopter and toward the woman.\u003c/p\u003e\n\u003cp\u003eWith looks of terror on their faces, Linda and Bette darted into the tree line.\u003c/p\u003e\n\u003cp\u003e“Look for them! Look for them!” Kevin grabbed Curtis and hauled him out of his chair, taking his place.\u003c/p\u003e\n\u003cp\u003eCurtis stumbled into the back of the helicopter and looked toward Ed. The old hunter was determinedly taking down as many of the zombies as possible. After a quick check of his safety line, Curtis moved to the open door and looked down. The wind buffeted him as he looked down into the trees below, looking for the two women. He realized that their army greens and hunting clothes had them camouflaged and he rubbed the side of his nose anxiously. Now that the helicopter was over the trees, it was harder to see the zombies. Beside him, Ed was swearing up a storm.\u003c/p\u003e\n\u003cp\u003e“I don’t see them,” Greta said, her voice stricken.\u003c/p\u003e\n\u003cp\u003e“Keep looking,” Kevin answered.\u003c/p\u003e\n\u003cp\u003eThe helicopter moved slowly over the forest as the zombies continued into the trees. Suddenly, Curtis caught sight of the women. In a small clearing was a broken down tin and wood structure. It had probably been a makeshift barn at one time. The women had climbed up onto its rusted metal roof and were huddled under the overhang of the second roof that covered the barn loft. They had probably climbed up on something then kicked it away, he figured, but it was apparent that the women were trapped. The fastest of the runners were now in the clearing, looking around with hawk-like movements for their prey. He could see both women curled against each other, trying to keep out of view of the zombies below. But by doing so, they were also keeping out of view of those above. Curtis was barely catching glimpses of them from between the tree branches.\u003c/p\u003e\n\u003cp\u003e“Do you see them?” Kevin’s voice was strained. “Does anyone see them?”\u003c/p\u003e\n\u003cp\u003eThe helicopter began to drift away from the clearing and the barn. Curtis stared down through the trees to where he knew the two women were hiding. The zombies were clustered in the clearing, looking around, sensing the fresh meat. It would probably not take too much for them to bring down that barn and rip apart the two women.\u003c/p\u003e\n\u003cp\u003e“Anyone see them?” Kevin’s voice was persistent, eating away at Curtis’ resolve.\u003c/p\u003e\n\u003cp\u003e“I see nothing,” Greta answered dismally.\u003c/p\u003e\n\u003cp\u003e“I ain’t got em,” Ed answered. “No sign.”\u003c/p\u003e\n\u003cp\u003eCurtis wanted Bette gone, but not Linda. Then again, Bette had corrupted Linda, hadn’t she? They were lesbian whores. Sinners. Just like Mary had said.\u003c/p\u003e\n\u003cp\u003e“Curtis, do you see them?”\u003c/p\u003e\n\u003cp\u003eCurtis opened his mouth, hesitated, then said, “No, no I don’t.”\u003c/p\u003e\n\u003cp\u003eThe sounds of the helicopter roared around them as the humans fell into silence.\u003c/p\u003e\n\u003cp\u003e“Zombies see something,” Greta said suddenly. She pulled the stick to the left and banked around. “They see something!”\u003c/p\u003e\n\u003cp\u003eKevin appeared beside Curtis, looking down. The zombies in the clearing now were banging on the barn and it was shaking under the assault. A pale hand darted out from beneath the overhang and waved at the helicopter, then a frightened bloodied face looked up at them.\u003c/p\u003e\n\u003cp\u003e“We got them!”\u003c/p\u003e\n\u003cp\u003eThere was a mad scramble for the rescue line and safety harness as Kevin began barking orders for Greta to get her closer to the women. Slowly, the safety harness drifted down toward the barn.\u003c/p\u003e\n\u003cp\u003eThe zombies were in a frenzy now, the old structure shaking apart. Curtis hunched down by the open doorway and watched, feeling cold and disconnected from those around him.\u003c/p\u003e\n\u003cp\u003eLinda reached out and hooked the safety harness and Curtis watched the two women struggle to get it on her. He could imagine Bette telling Linda, “You first.” He saw their heads draw together in what he knew was a kiss, then Bette signaled for them to hoist Linda up.\u003c/p\u003e\n\u003cp\u003eAs Linda swung over the heads of the zombies, they leaped at her, forgetting the barn temporarily. Curtis watched Linda’s bloodied upturned face as she was pulled up to safety. He loved how her brown hair swam in the wind around her face. He imagined touching it.\u003c/p\u003e\n\u003cp\u003eThen Linda was being pulled into the helicopter and struggling out of the harness.\u003c/p\u003e\n\u003cp\u003e“Hurry! Hurry!” Linda didn’t even acknowledge him, but clung to safety straps just inside the doorway to watch the harness descend to Bette. “Her arm is broken! She made me come first.”\u003c/p\u003e\n\u003cp\u003e4. The Restless Dead\u003c/p\u003e\n\u003cp\u003eThe zombies returned to shaking the barn, pieces of it breaking off. It was beginning to list to one side and Bette was holding on for dear life with her one good arm.\u003c/p\u003e\n\u003cp\u003e“Bring it back up,” Kevin ordered, and the harness was drawn back up.\u003c/p\u003e\n\u003cp\u003e“No! No! Don’t leave her,” Linda screamed at him. “No!”\u003c/p\u003e\n\u003cp\u003e“I’m not,” Kevin answered, shrugging into the harness and securing it.\u003c/p\u003e\n\u003cp\u003eThen he pushed out of the helicopter as Ed lowered him down.\u003c/p\u003e\n\u003cp\u003eAgain, the zombies paid attention to the food dangling over their heads and not at the woman clinging to the roof of the barn. Curtis looked toward Linda and saw her gaze was firmly fastened on Bette.\u003c/p\u003e\n\u003cp\u003eKevin reached Bette, his feet just barely out of reach of the zombies leaping up at him. Stretching out his hand, he motioned to her. Struggling to stand, Bette reached out with her good hand. Several zombies hit the barn again, with such force, it knocked Bette off balance and she lurched forward.\u003c/p\u003e\n\u003cp\u003eKevin barely grabbed her arm as the zombies below grabbed her booted feet. Twisting and kicking, Bette struggled to break free. Kevin’s hands tightened their grip and he hooked his legs around her waist and pulled her up as hard as he could. But still the zombies held on.\u003c/p\u003e\n\u003cp\u003eCurtis could see that both of them were screaming. Beside him Linda’s cries of fear were ear shattering. Yet he couldn’t bring himself to care. He hoped the bitch died.\u003c/p\u003e\n\u003cp\u003e“Fuck this,” Greta said, pulling the big bird upwards.\u003c/p\u003e\n\u003cp\u003e* * * * * Bette screamed as the zombies held onto her legs. She felt like she was being pulled in two. Kevin had such a tight grip on her, she could barely breathe. She kicked and twisted hard and finally managed to get free of most of the gripping hands.\u003c/p\u003e\n\u003cp\u003eSwinging upward, Kevin and Bette dangled over the barn as one lone zombie held firmly to Bette’s foot. It was a woman in a house dress and to Bette’s horror, it began to pull itself upwards. Its drawn back black lips and toothy grimace made Bette scream with sheer terror. The tiny blond tried to push the creature off with her other foot. The abnormally fast creature grabbed it and began to draw itself toward her exposed shin. The accident had torn Bette’s pant leg and her skin was a tasty lure for the gaping maw of the zombie.\u003c/p\u003e\n\u003cp\u003eBoth her legs trapped by the creature, Bette struggled, but not so much as to have Kevin lose his grip. The zombie’s teeth gnashed together as it drew closer to her flesh. The young woman could not tear her eyes from the zombie as it strained to reach her tender skin.\u003c/p\u003e\n\u003cp\u003eBette felt Kevin let go of her with one arm and she screamed in terror as she felt as if she was about to drop. The zombies head exploded as Kevin shot it. The creature’s fingers went slack and it tumbled to the ground.\u003c/p\u003e\n\u003cp\u003ePulling her up, Kevin held her as Bette sobbed with pain and relief.\u003c/p\u003e\n\u003cp\u003e* * * * * Curtis watched the scene with cold detachment, but he put a smile on his face when Kevin and Bette fell into a heap inside the helicopter. Linda shoved everyone aside and gathered Bette up into her arms..\u003c/p\u003e\n\u003cp\u003e“I promised you a happy ending, babe,” Bette shouted to Linda and pressed a fervent kiss to her lips.\u003c/p\u003e\n\u003cp\u003e“Are you bit?” Curtis asked, hoping she was.\u003c/p\u003e\n\u003cp\u003e“No, no! The car accident banged us up,” Linda answered.\u003c/p\u003e\n\u003cp\u003e“Gotta check,” Ed said, then did just that.\u003c/p\u003e\n\u003cp\u003eCurtis almost hoped Bette or Linda or both were bitten. Instead, Ed nodded that they were okay and the women cried with relief.\u003c/p\u003e\n\u003cp\u003e“Now what?” Greta asked as she swung the copter around.\u003c/p\u003e\n\u003cp\u003eBelow a long steady stream of zombies were stumbling past the field and the destroyed Durango toward the west.\u003c/p\u003e\n\u003cp\u003eKevin fell into the seat next to her and donned his headset.\u003c/p\u003e\n\u003cp\u003e“Now, what?” she repeated.\u003c/p\u003e\n\u003cp\u003eKevin hesitated, then said, “Signal the next Durango for phase two.” \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-78.html","bookId":2483,"creation":"Oct 5, 2019 5:01:34 PM","modification":"Oct 5, 2019 5:01:34 PM"}
