{"id":84711,"no":86,"title":"Page 86","content":"\u003cp\u003eHer fingers found the tiny knob and she began to turn it just as something grabbed her wrist. With a scream of fright, she twisted the knob and light flooded the room.\u003c/p\u003e\n\u003cp\u003eJenni stood over her, gripping her arm tightly, her dead eyes staring at her intently. Her sickly pale skin and dark hair were wet with water.\u003c/p\u003e\n\u003cp\u003eKatie screamed in terror...\u003c/p\u003e\n\u003cp\u003e...and woke up.\u003c/p\u003e\n\u003cp\u003eJenni still leaned over her, holding her arm, staring down at her. Katie screamed again, this time with the terror of knowing she was awake.\u003c/p\u003e\n\u003cp\u003eThe apparition of her friend screamed, too, letting go of her arm, jumping back and whirling around. Jenni’s long black hair fanned out around her as she twisted this way and that as Katie continued to scream.\u003c/p\u003e\n\u003cp\u003e“What? What?” Jenni looked around the room with her large dark eyes.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You! You...you...you...you’re dead!”\u003c/p\u003e\n\u003cp\u003e“Oh, that! Oh, I know that.”\u003c/p\u003e\n\u003cp\u003e“I dreamed you were a zombie!” Katie rambled from where she was curled up against the headboard staring at Jenni in shock and fear.\u003c/p\u003e\n\u003cp\u003e“Oh, God. I’m not!” She she did look very alive. Her skin was pale, but pink, her eyes dark and brilliant. Her long dark hair fell over her red sweater in silky long tresses. Laughing, she slid onto the bed. “You’re such a stupid dork.”\u003c/p\u003e\n\u003cp\u003eKatie blinked then swallowed hard. “You’re dead,” Katie repeated.\u003c/p\u003e\n\u003cp\u003e“Yeah. I know that.” Jenni laughed. “It was so dramatic, wasn’t it?”\u003c/p\u003e\n\u003cp\u003e“But you’re here,” Katie said, not blinking, just staring. “And this isn’t a dream?”\u003c/p\u003e\n\u003cp\u003e“Not a dream. I’m here. Only for a short time. I’ve been saving up all my energy just to push through tonight. Not too easy to do.” Jenni looked around the room, then back at Katie. “I’ve always been nearby, but I was waiting.” Leaning over, she checked the clock, looked satisfied, and sat back.\u003c/p\u003e\n\u003cp\u003e“Jenni, oh, God, Jenni!” Katie suddenly realized she truly wasn’t dreaming, She flung her arms around Jenni and felt flesh and blood in her grasp. Clutching her best friend tight, she burst into tears.\u003c/p\u003e\n\u003cp\u003eLaughing with joy, Jenni clutched her close, and kissed her cheek.\u003c/p\u003e\n\u003cp\u003e“You’re here! You’re here! I can feel you!” Katie was laughing and crying at the same time. She gripped Jenni’s face between her hands and kissed her long and hard on the forehead. “Oh, my gawd, Jenni, you’re here.”\u003c/p\u003e\n\u003cp\u003e“I know! I am! Isn’t it cool? Only for a little bit, but good to be here. And look at your tummy!”Jenni snuggled up to Katie, holding her tighter. “You look so good, Mama.”\u003c/p\u003e\n\u003cp\u003eKatie sobbed with joy and clung to her best friend. “Oh, Jenni. I’ve missed you so much.”\u003c/p\u003e\n\u003cp\u003e“It’s okay, sweetie. I’m here now. I’m here to save you and Travis just like I promised.” Jenni drew back and touched Katie’s check very gently.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Katie demanded, hearing the seriousness in Jenni’s tone.\u003c/p\u003e\n\u003cp\u003eJenni glanced at the clock again, her fingers gripping Katie’s hand. It was beginning to not feel as real as it first had. “It’s almost time. Crap. I forgot what time was like. It’s different on the other side where all time is the same: past, present, future.” She sighed softly. “I thought I had more time.”\u003c/p\u003e\n\u003cp\u003e“Jenni, what do you mean?”\u003c/p\u003e\n\u003cp\u003e“I’m here to save you and Travis,” Jenni replied. “Cause if I don’t, tonight you’re both going to die.”\u003c/p\u003e\n\u003cp\u003e* * * * * “Everyone deals with stress differently,” Travis said uneasily.\u003c/p\u003e\n\u003cp\u003e“Yeah, I know. I just, you know, being a cop and all, I just see how things are going seriously wrong and I want to set it right.”\u003c/p\u003e\n\u003cp\u003e“I know what you mean.” Travis watched Curtis thoughtfully.\u003c/p\u003e\n\u003cp\u003e“I see people doing shitty things to other people and I just want to tell them that they need to shape up and get with the program. This is the law.\u003c/p\u003e\n\u003cp\u003eYou gotta obey it. You know, I believe in order. But lately...” Curtis shook his head. “I can’t even find order in my own damned life.”\u003c/p\u003e\n\u003cp\u003eTucking his hands into his jean pockets, Travis bobbed his head slowly.\u003c/p\u003e\n\u003cp\u003e“Yeah, I know what you mean. We’re all just doing our best.”\u003c/p\u003e\n\u003cp\u003e“But people keep on dying, Travis, don’t they?”\u003c/p\u003e\n\u003cp\u003eMeasuring his words carefully, Travis answered, “This world is dominated by death, Curtis. The living got a rough time of it.”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah,” Curtis agreed. “But sometimes, you know, the living make it harder on the rest of the living.”\u003c/p\u003e\n\u003cp\u003eTravis tried to keep his face neutral, but he felt his body beginning to tense.\u003c/p\u003e\n\u003cp\u003e“How many people are gonna die, Travis? I don’t mean when those fucking zombies get here. But tonight? Tomorrow? The suicides haven’t even started yet, you know? But they will. Bill warned me about them.\u003c/p\u003e\n\u003cp\u003eGawddamn lucky it ain’t like those old zombie movies where you just die and you’re a zombie else we’d be shit out of luck fast.”\u003c/p\u003e\n\u003cp\u003eStanding in silence, Travis looked at the younger man, studying the policeman’s tense posture and flushed face with growing anxiety. “We’re doing what we can, Curtis.”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, we are. Right. Saving people. Bringing them here. Taking a fucking stand against religious people who just don’t agree with us. But maybe they were right, Travis. Did you think of that? Your girl got all right and straight,” Curtis laughed sarcastically. “But my girl went all queer when you got the mall folks here. They are corrupters and sinners!\u003c/p\u003e\n\u003cp\u003eDo you even give a shit about that?”\u003c/p\u003e\n\u003cp\u003e“Linda and Bette-”\u003c/p\u003e\n\u003cp\u003e“And you say their names together like they fucking belong together. They don’t! Linda, my Linda, was okay before those shitbags from the mall got here. And that nigger-”\u003c/p\u003e\n\u003cp\u003e“Hey!” Travis voice was harsh. “Don’t go there.”\u003c/p\u003e\n\u003cp\u003eCurtis glared evenly at Travis. “This is the country, city boy. We talk different out here though you may not like it. And why the hell is an outsider our leader anyway?”\u003c/p\u003e\n\u003cp\u003e“Curtis, I’m one of many who make decisions around-”\u003c/p\u003e\n\u003cp\u003e“You blew into town all fancy and handsome. All the girls got all crazy about you right away. Making a big deal out of you and your fancy ways.\u003c/p\u003e\n\u003cp\u003eThen all this shit hits and you’re the fucking king? If the Mayor wasn’t such a pussy and rolled over for you, we may have had a little more fucking luck with keeping our fucking senses and taking care of our own before dragging every fucking faggot, raghead, nigger-”\u003c/p\u003e\n\u003cp\u003eThe punch was hard, fierce, and caught Curtis in mid-sentence. It knocked him back a few feet and stunned him. Shrouded in shadows, the younger man slowly brought his hand up to his face, feeling the quickly swelling flesh beneath his fingers.\u003c/p\u003e\n\u003cp\u003eTrying to keep calm, Travis said softly, “You’re freaking out, Curtis. You need to calm the hell down right now. I’ll drag your ass down to the clinic and sedate you if I have to.”\u003c/p\u003e\n\u003cp\u003eIn the darkness, the younger man stood in silence then slowly, methodically stepped into the light. “Try it,”he said in a low whisper and a knife glittered in the starlight.\u003c/p\u003e\n\u003cp\u003e* * * * * “What do you mean?” Katie demanded, her eyes widening. “Explain, Jenni!”\u003c/p\u003e\n\u003cp\u003eJenni tilted her head, looking at the alarm clock. Grabbing it up, she studied the numbers then cocked her head again, as if remembering something. “Oh, fuck, I was always late when I was alive.”\u003c/p\u003e\n\u003cp\u003e“Jenni, you’re scaring me,” Katie whispered.\u003c/p\u003e\n\u003cp\u003e“Get your jeans on!” Jenni flung them at Katie and whirled around, her long hair fanning out around her. “Shit, shit, shit! I got the time fucked up in my head. I was thinking of Nerit’s time, not Travis’!”\u003c/p\u003e\n\u003cp\u003eFumbling with her jeans, Katie struggled into them, nearly tripping as she tried to also shove her feet into her jogging shoes. “Jenni, you’re scaring the hell out of me! What is going on?”\u003c/p\u003e\n\u003cp\u003e“Curtis is about to kill Travis! We have to hurry or he’ll do it!” Jenni grabbed at Katie’s hand. Their fingers did not touch, but passed through each other. “Oh, damn! I’m already fading!”\u003c/p\u003e\n\u003cp\u003e“Jenni, what do you mean Curtis will kill Travis?” Katie felt as if she couldn’t breathe as she tied her shoes.\u003c/p\u003e\n\u003cp\u003e“Come with me! Hurry! I’m sorry, Katie. I got the times wrong!” Jenni waved at her best friend again, her body seeming not as solid as before.\u003c/p\u003e\n\u003cp\u003e“C’mon! We have to save Travis!”\u003c/p\u003e\n\u003cp\u003e“What do you mean Nerit’s time? Jenni, what is happening?” Katie raced after her friend throwing open the bedroom door that Jenni simply ran through. She followed Jenni into the hallway. “Jenni, what do you mean?”\u003c/p\u003e\n\u003cp\u003e* * * * * “Nerit,” a voice whispered softly.\u003c/p\u003e\n\u003cp\u003eStanding on the shores of the Red Sea, Nerit turned slowly. Raising her hand to shield her eyes, she looked for the source of the soft voice.\u003c/p\u003e\n\u003cp\u003e“Nerit, come to my voice,” it came again softly.\u003c/p\u003e\n\u003cp\u003eTurning completely around, she looked into the horizon as the sun blazed down on her. Her long blond hair whipped around her face and she could feel the sand and salt tucked into the creases of her uniform and rubbing against her skin. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-86.html","bookId":2483,"creation":"Oct 5, 2019 5:01:34 PM","modification":"Oct 5, 2019 5:01:34 PM"}
