{"id":84714,"no":89,"title":"Page 89","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Travis,” she called out.\u003c/p\u003e\n\u003cp\u003eHe looked up at her just as Curtis grabbed her from behind.\u003c/p\u003e\n\u003cp\u003e“Katie, just run! Get help!”\u003c/p\u003e\n\u003cp\u003eCurtis lifted her up off her feet, his grip hard and suffocating around her chest. She kicked her feet and wiggled, trying to get away. Attempting to scream, she found she could not. Her breath was being cut off.\u003c/p\u003e\n\u003cp\u003e“You stupid little lesbo whore,” Curtis hissed in her face. His features were so distorted he looked as unreal and corrupted as the thing trying to attack her husband below.\u003c/p\u003e\n\u003cp\u003e“Let me go,” she managed, gasping for breath.\u003c/p\u003e\n\u003cp\u003eHe tightened his grip and dragged her to the rail. “Don’t worry. I will.”\u003c/p\u003e\n\u003cp\u003eKatie’s eyes widened as he lifted her up over the rail and let go of her. She managed to grab onto the bottom rail and hold on tight with both hands.\u003c/p\u003e\n\u003cp\u003ePulling herself up, she managed to hook her arm over the rail as her feet scrabbled against the wall.\u003c/p\u003e\n\u003cp\u003eCalmly, Curtis leaned over and began to try to dislodge her grip.\u003c/p\u003e\n\u003cp\u003e“Let go of me, you fucking bastard,” she shouted at him.\u003c/p\u003e\n\u003cp\u003e“Katie, drop!” Travis’ voice rose from below her.\u003c/p\u003e\n\u003cp\u003eShe craned her neck and looked down toward him. Her husband was looking back toward the mouth of the alley and he took a step back toward the wall.\u003c/p\u003e\n\u003cp\u003e“Don’t drop, Katie,” he said in a stricken tone.\u003c/p\u003e\n\u003cp\u003eAnd then she saw the zombies in the alley making their way toward the man she loved.\u003c/p\u003e\n\u003cp\u003e“No! No!” She held on tighter, her feet fighting for purchase on the wall, as she looked up and saw Curtis smile. Leaning over her, he looked even more hellish as he tried to pry her hands loose. She managed to get her boot up onto the wall and began to push upwards, but he put his hands on her shoulders and shoved downwards.\u003c/p\u003e\n\u003cp\u003e“Fuck you!” she screamed.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” Curtis whispered. “Really. It will be okay. Y’all will be together in the afterlife. You, Travis, the baby, your dead wife...”\u003c/p\u003e\n\u003cp\u003e“Go to hell,” Katie spat at him.\u003c/p\u003e\n\u003cp\u003e“Looks like Travis is going first,” Curtis answered, winking.\u003c/p\u003e\n\u003cp\u003eThe moans were louder below and Katie screamed.\u003c/p\u003e\n\u003cp\u003e* * * * * The elevator doors opened and Peggy blinked.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eNerit walked briskly past her, sniper rifle slung over one arm, barrel pointed downwards, as she moved down the hall.\u003c/p\u003e\n\u003cp\u003e“Nerit?”\u003c/p\u003e\n\u003cp\u003eThe old woman stopped and turned. Her gaze was steely and her face seemed younger somehow.\u003c/p\u003e\n\u003cp\u003e“You’re...you...”\u003c/p\u003e\n\u003cp\u003e“I have a job to do,” Nerit answered, walking on.\u003c/p\u003e\n\u003cp\u003ePeggy backed into the elevator slowly and then hit the button for the ground floor. She had to let the others know Nerit was up and around.\u003c/p\u003e\n\u003cp\u003eTo her shock, she suddenly realized she was trembling and very afraid.\u003c/p\u003e\n\u003cp\u003eShe wondered if Nerit being up was a good omen or bad.\u003c/p\u003e\n\u003cp\u003e* * * * * Nerit reached the room she was looking for and knocked. When there was no answer, she pulled her revolver and took a step back. She fired and a hole was punched very neatly through the door. Reaching through, she unlocked the door, pushed it open and entered.\u003c/p\u003e\n\u003cp\u003eThe air in the room was stale and she rubbed the tip of her nose. This room had no balcony and she frowned. With a shrug, she shattered the window with the butt of her sniper rifle, the glass cascading around her like silvery rain. Grabbing the comforter off the bed, she shoved the musty thing over the window ledge, then dragged a chair over.\u003c/p\u003e\n\u003cp\u003eCarefully, she climbed onto the chair, then sat down on the ledge, the comforter keeping her safe from the broken glass. Tucking a strand of hair back from her face, she brought the rifle around and smiled slightly. It felt good and solid in her hands.\u003c/p\u003e\n\u003cp\u003eThe wind howled around her as she perched in the window high above the fort below. Her eye became one with the scope and she looked down into her narrow world knowing exactly what she would see.\u003c/p\u003e\n\u003cp\u003eTravis came into view standing at the base of the wall. She quickly checked on the zombies and saw she still had time. Then her “eye” swept upwards and she saw Katie struggling with Curtis as she tried to hold onto the rail. Unfortunately, he was leaning over her in such a way Nerit could not get a clear shot without endangering Katie.\u003c/p\u003e\n\u003cp\u003e“One clear shot,” she whispered softly, then realized it was a prayer. “I need one clear shot.”\u003c/p\u003e\n\u003cp\u003e* * * * * Juan wiped his brow with a kerchief and tucked it into his back pocket before reaching down to lift a concrete block up onto a cart. There were worries that one of the perimeter buildings needed reinforcement. A crew had been working on its back wall for most of the night.\u003c/p\u003e\n\u003cp\u003e“Juan! Juan! Where’s Travis and Katie?” Peggy ran toward him, her eyes wide.\u003c/p\u003e\n\u003cp\u003eLooking around the large old construction site, he shrugged. “I haven’t seen them for awhile. Why?”\u003c/p\u003e\n\u003cp\u003e“Nerit is up!”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I saw her come out of the elevator on the sixth floor. She looked great!”\u003c/p\u003e\n\u003cp\u003ePeggy looked more lively than he had seen her in the days since Bill and Dale had died.\u003c/p\u003e\n\u003cp\u003e“Holy shit! I should have known that old woman was too tough to die,”\u003c/p\u003e\n\u003cp\u003eJuan declared.\u003c/p\u003e\n\u003cp\u003e“But the weird thing is she had her sniper rifle,” Peggy continued. “And she looked deadly.”\u003c/p\u003e\n\u003cp\u003eJuan’s brow furrowed. “What the hell does that mean?”\u003c/p\u003e\n\u003cp\u003e“No clue.”\u003c/p\u003e\n\u003cp\u003eThe wind was loud, blowing hard off the hills and whistling through the fort. Juan turned to feel the air rush over his sweaty face. It felt soothing.\u003c/p\u003e\n\u003cp\u003eYet, he did not feel soothed.\u003c/p\u003e\n\u003cp\u003e“Shit, something is wrong, isn’t it?”\u003c/p\u003e\n\u003cp\u003eHe began to walk back toward the hotel feeling grim and afraid. Just then a bulldozer pulled across his way, hauling a load of stuff for a catapult.\u003c/p\u003e\n\u003cp\u003eForced to go around, he and Peggy ended up going along the old perimeter wall.\u003c/p\u003e\n\u003cp\u003e“Nothing feels right,” Peggy said shortly. “You know, zombies coming!”\u003c/p\u003e\n\u003cp\u003e“Yeah, but Nerit being up and armed...” He shook his head as he walked.\u003c/p\u003e\n\u003cp\u003e“Something is up.”\u003c/p\u003e\n\u003cp\u003eIt was then he heard Jenni’s voice shout “Hey, fuckface” and the whole world changed.\u003c/p\u003e\n\u003cp\u003e* * * * * Katie felt her grip slipping and Curtis was smiling madly down at her.\u003c/p\u003e\n\u003cp\u003e“It’s okay, really. It’s fine, let go.” He kept saying to her.\u003c/p\u003e\n\u003cp\u003eShe screamed again, but felt as if the wind tore it from her lips and dissipated it.\u003c/p\u003e\n\u003cp\u003e“You’re going to die, Katie,” Curtis whispered to her as he pried her fingers loose at last. He leaned far over her, shoving her back from the rail, her fingers of her other hand beginning to slip. “You’re going to fall and die.”\u003c/p\u003e\n\u003cp\u003eThe moans of the zombies were closer now and Travis was swearing at Curtis, his voice full of despair.\u003c/p\u003e\n\u003cp\u003e“You’re going to die, Katie, just like Jenni did. This is the end of your little Thelma and Louise story. No one can save you,” he said softly.\u003c/p\u003e\n\u003cp\u003e“Hey, fuckface,” Jenni’s voice said sharply.\u003c/p\u003e\n\u003cp\u003eKatie caught sight of Jenni standing behind Curtis. She looked real. Solid.\u003c/p\u003e\n\u003cp\u003eWhen Katie had reached the wall, Jenni had vanished. To see her again, Katie sobbed with relief.\u003c/p\u003e\n\u003cp\u003eJerking around, Curtis saw Jenni and his expression was one of utter surprise.\u003c/p\u003e\n\u003cp\u003e“Why don’t you try fucking with me, asshole?” Jenni taunted.\u003c/p\u003e\n\u003cp\u003eAbruptly letting go of Katie’s hand, Curtis turned as he straightened.\u003c/p\u003e\n\u003cp\u003e“You’re dead,” Curtis exclaimed.\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003eKatie managed to hold onto the rail for a second with her other hand, but the sudden release of her weight by Curtis let gravity grab her and she half-slid, half-fell down the side of the wall.\u003c/p\u003e\n\u003cp\u003eJenni’s eyes flicked toward her friend’s falling form, then she stared Curtis straight in the eye as he turned fully to face her.\u003c/p\u003e\n\u003cp\u003e“Bang,” she said, and grinned.\u003c/p\u003e\n\u003cp\u003e“Wha-” he managed, then a hole was punched neatly through his brow above his left eye.\u003c/p\u003e\n\u003cp\u003eHe fell slowly to her feet, crumpling like a puppet. Jenni looked up to the sixth floor window and waved to the woman perched there.\u003c/p\u003e\n\u003cp\u003e* * * * * Juan reached the catwalk just in time to see Katie fall, Curtis turn toward Jenni, and then die at her feet. Startled, he could barely breathe as he stumbled toward the woman he loved.\u003c/p\u003e\n\u003cp\u003eJenni waved to someone in the hotel, then turned to see him.\u003c/p\u003e\n\u003cp\u003e“Loca,” he whispered.\u003c/p\u003e\n\u003cp\u003e“Hey, baby,” she answered with a wide smile, then said, “Shit!”\u003c/p\u003e\n\u003cp\u003eAnd just like that, she swung her legs over the rail and dropped down below.\u003c/p\u003e\n\u003cp\u003e* * * * * Travis lunged to catch her and Katie fell into his arms and sent them both sprawling. Immediately, they both scrambled to their feet to see the zombies moving ever closer to them. There were now maybe twenty moving slowly, but resolutely toward them. Behind those zombies, more staggered into the light in the street beyond. Their twisted, gnarled bodies were grotesque in their decay.\u003c/p\u003e\n\u003cp\u003e“They’re early,” Katie said.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Travis answered, holding her close. “Curtis?”\u003c/p\u003e\n\u003cp\u003e“I think Jenni has him covered.”\u003c/p\u003e\n\u003cp\u003eTravis looked at her sharply. “Jenni? Huh?”\u003c/p\u003e\n\u003cp\u003e* * * * * Nerit saw Jenni wave to her and she smiled briefly, then was on the move again. To get a clear shot of the zombies she had to be in a different location. The fire escape to her left would be perfect. Leaping off the chair, she ran across the room and out into the hallway. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-89.html","bookId":2483,"creation":"Oct 5, 2019 5:01:34 PM","modification":"Oct 5, 2019 5:01:34 PM"}
