{"id":84723,"no":98,"title":"Page 98","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIn the next instant, Jack was on the zombie, his jaws clamping down on the back of its neck and pulling it away from his master. The undead howling remains of the man tried to hold onto Jason, but Jack yanked hard and it slid off Jason.\u003c/p\u003e\n\u003cp\u003eCalhoun was nearby using the detonation device to bash the other runner’s brains in.\u003c/p\u003e\n\u003cp\u003e“Calhoun, no!” Jason managed to utter, then heard a terrible sound. A steady beeping. “Jack! Let go of it! Come here!”\u003c/p\u003e\n\u003cp\u003eJack whirled around and rushed toward the boy. The nearly decapitated runner pushed itself to its knees but then the sniper finally got the right shot and it fell over.\u003c/p\u003e\n\u003cp\u003eCalhoun looked at Jason startled, then up at the box. The light that had so determinedly not come on before was blinking red. Calhoun looked toward the fuel tanks then the boy. “This is not good.”\u003c/p\u003e\n\u003cp\u003e“You triggered it,” Jason shouted back. “We need to run. Now!”\u003c/p\u003e\n\u003cp\u003eJason glanced toward the opening and saw zombies were now trudging toward them. They had finally been noticed and around fifty zombies were already past the fire line. He didn’t say another word, but turned and ran.\u003c/p\u003e\n\u003cp\u003eJack growled at the shambling zombies, then ran after his boy. The stinky old man threw down the metal box and began to run after them. He was bit slower because of his creaky old bones. Jack barked at him to hurry it up, darted back to urge the stinky man on, then ran back after the boy.\u003c/p\u003e\n\u003cp\u003eThe teenager and the old man ran as hard as they could as the red light blinked faster and faster. They were halfway to the fort when the fuel tanks exploded. The blast blew them of their feet and hurled them to the ground as a gush of hot air, then flames filled the air.\u003c/p\u003e\n\u003cp\u003eOn the fort wall, everyone hit the ground as the blast filled the morning sky. Fiery debris rained down as the roar of the explosion rang in the fort occupants’ ears.\u003c/p\u003e\n\u003cp\u003eWhen the flames began to die down, zombies were burning, debris littered the wide expanse before the fort, and a boy, a dog, and an old man laid unmoving on the ground.\u003c/p\u003e\n\u003cp\u003e* * * * * Katie lifted herself up off the floor and looked over the rail at the devastation the fire line had wrought. Zombies were burning, as was the makeshift outer wall. Many of the zombies had been blown into bits and others tossed back down the hill into the mob. Clutching the railing, she tried to see through the acrid smoke.\u003c/p\u003e\n\u003cp\u003eIt took a moment for her to see that at least twenty zombies were still alive inside the fire line. Most of the zombies outside the fire line seemed to be in a panic and struggling to get away from the fire. The enormous crowd was peeling apart with zombies moving off in two different directions.\u003c/p\u003e\n\u003cp\u003eAs the black smoke slithered over the ground below, Katie struggled to see Calhoun and Jason. She saw Jack first as he slowly stirred, then began to bark anxiously as zombies moved determinedly toward two fallen figures.\u003c/p\u003e\n\u003cp\u003e“Oh, shit!” Katie grabbed her walkie-talkie and pushed down the button.\u003c/p\u003e\n\u003cp\u003e“Jason and Calhoun are in danger near my point. Someone kill those bastards!”\u003c/p\u003e\n\u003cp\u003e* * * * * Katarina heard the call from her perch but she was nowhere near Katie’s assigned position. At least she could take out the zombies that were in her range. As the staggering figures materialized out of the smoke, she took her shots.\u003c/p\u003e\n\u003cp\u003e* * * * * “My boy!” Juan exclaimed, turning to rush to Jason’s rescue.\u003c/p\u003e\n\u003cp\u003eOne of the men assigned to his team grabbed him. “We got a job to do, man.”\u003c/p\u003e\n\u003cp\u003eJuan tried to push past him but realized the truth of that statement.\u003c/p\u003e\n\u003cp\u003e“They’ll save them, man.”\u003c/p\u003e\n\u003cp\u003eWith a breaking heart, Juan turned back to his duties. His shoulders ached from the tension and he felt tears in his eyes. He prayed to God someone would save his boy.\u003c/p\u003e\n\u003cp\u003e* * * * * “Let the two lines that are flanking the fort go. I have a feeling they will keep going,” Nerit ordered over her walkie-talkie. “Concentrate on anything that breaches the outer perimeter. Anything that moves into your hot zone, nail them.”\u003c/p\u003e\n\u003cp\u003e“The outer ridge line is on fire. It’s splitting the horde in half. That worked out better than we hoped.” Kevin rapidly drew on the map, updating the battle.\u003c/p\u003e\n\u003cp\u003e“But the fire will die down and whatever is out there will come into the kill zone.”\u003c/p\u003e\n\u003cp\u003e“We’re ready.”\u003c/p\u003e\n\u003cp\u003e* * * * * Travis reached the wall just in time to see his wife about to slide onto the makeshift elevator. “Katie!”\u003c/p\u003e\n\u003cp\u003e“I need to get Jason!” She answered defensively. Her gun was already in her hand. “He’s Jenni’s boy. I have to.”\u003c/p\u003e\n\u003cp\u003eNearby, there were soft hisses as the sniper attempted to keep the zombies away from the two humans down on the ground. Jack’s barking and growls sounded as he defended his fallen boy.\u003c/p\u003e\n\u003cp\u003e“You’re pregnant. You are not going down there,” Travis said firmly, swinging himself onto the elevator. He could see her jaw setting and he pointed a finger in her face. “Jenni wouldn’t want you risking the baby.”\u003c/p\u003e\n\u003cp\u003e“Dammit,” she said, sighing as she conceded his point.\u003c/p\u003e\n\u003cp\u003eTravis grabbed her and kissed her firmly, then motioned for them to lower him. Drawing his gun, in one hand, he took a deep breath and almost choked on the acrid smoke. This day was already off to a great freaking start.\u003c/p\u003e\n\u003cp\u003e* * * * * Jason came to slowly. Coughing on the thick smoke, he struggled to roll over. As he fell onto his back, a man lurched out of the smoke and fell to his knees. The dead gnarled face instantly moved to bury itself into his soft flesh. Jason raised the gun in his hand to the man’s temple and fired.\u003c/p\u003e\n\u003cp\u003eThe zombie fell over.\u003c/p\u003e\n\u003cp\u003eBlinking his eyes, Jason sat up. Jack hurtled out of the thick black wisps and nearly landed on him as he barked angrily into the smoke. Jason almost called out for Calhoun, then thought better of it. The zombies would find him faster if he called out. Holding onto Jack’s collar, he pulled himself up to his feet and stood, feeling quite wobbly. Slowly, he realized he would look a lot like the zombies in his present battered condition. Jack would be his best defense against being wrongly identified. Leaning over he whispered to the dog, “Find Calhoun” and held on.\u003c/p\u003e\n\u003cp\u003eJack looked up at him with his clear brown eyes and Jason could see the concern in their depths. Jack seemed to think this foolhardy, but obediently began to lead him slowly through the hot, acrid air and dark smoke.\u003c/p\u003e\n\u003cp\u003eA low moan near him made Jason jump and he twisted around. Jack growled low in his throat and Jason raised his gun in the direction of the moan. The stench of decaying burning flesh filled his nostrils and he stared into the smoke in terror.\u003c/p\u003e\n\u003cp\u003eA woman suddenly lurched out of the mist and Jason instinctively pulled the trigger. She fell back a few feet, snarled, then started forward again.\u003c/p\u003e\n\u003cp\u003eHe fired again, this time the bullet punching through her forehead. The zombie fell back without a sound.\u003c/p\u003e\n\u003cp\u003eHe took a deep breath to try to steady his nerves and began to cough. A groan behind him startled him and he spun around in time to see a burned zombie right on him. It growled low as it seized his shoulders.\u003c/p\u003e\n\u003cp\u003eJack was instantly tearing at the creature as Jason brought the gun up and fired through the creature’s head. Another one staggered toward him and he aimed at it.\u003c/p\u003e\n\u003cp\u003eJack shoved hard into his legs, knocking him sideways just as the new zombie revealed himself to actually be a living Calhoun.\u003c/p\u003e\n\u003cp\u003e“Damn clones,” Calhoun muttered as grabbed Jason’s arm to help him up.\u003c/p\u003e\n\u003cp\u003e“They’re all around. We gotta back up toward the wall.”\u003c/p\u003e\n\u003cp\u003eTogether, the dog at their side, they moved toward the wall.\u003c/p\u003e\n\u003cp\u003e“Where is your gun?” Jason whispered.\u003c/p\u003e\n\u003cp\u003e“No clue. Got the living bejeezus knocked out of me by that explosion,”\u003c/p\u003e\n\u003cp\u003eCalhoun answered.\u003c/p\u003e\n\u003cp\u003eThe dark smoke began to dissipate as the fires began to burn down. They moved a little faster as more and more figures materialized out of the haze.\u003c/p\u003e\n\u003cp\u003e“This ain’t good, boy,” Calhoun decided.\u003c/p\u003e\n\u003cp\u003eAnother explosion near the opening made the zombies howl and more body parts rained down on them. The roar of a motorcycle filled their ears as Rune returned to the fort.\u003c/p\u003e\n\u003cp\u003e“That crazy hippie,” Calhoun muttered as he grabbed Jason tight as the motorcycle drew close to them.\u003c/p\u003e\n\u003cp\u003eRune looked a bit bedraggled and was covered in soot. His shotgun was across his lap and he motioned to them. “Get on.”\u003c/p\u003e\n\u003cp\u003eCalhoun shoved Jason onto the bike, then managed to squeeze his skinny butt on. Jason grabbed hold of Rune as Calhoun grabbed hold of both of them. Jason wasn’t sure what smelled worse: the zombies or Calhoun.\u003c/p\u003e\n\u003cp\u003e“Sorry, boy, you gotta run back,” Rune said to Jack, then hauled ass toward the elevator at top speed. They dodged around zombies at a breathtaking speed.\u003c/p\u003e\n\u003cp\u003eJason looked behind him to see Jack running as fast as he could with a big doggy grin on his face. He supposed a motorcycle was almost as good as a car when it came to chasing.\u003c/p\u003e\n\u003cp\u003eThe smoky haze was continuing to clear. More zombies were pushing through the opening. The motorcycle reached the elevator just as Travis reached the ground.\u003c/p\u003e\n\u003cp\u003e“Rune!”\u003c/p\u003e\n\u003cp\u003e“Hey, dude. Wazzup?”\u003c/p\u003e\n\u003cp\u003eTravis helped Calhoun off the bike and onto the elevator. “Didn’t know where you got off to.”\u003c/p\u003e\n\u003cp\u003e“Got a lot of them moving out of town, then double-backed and got past the traps right when the tanks blew.” Rune climbed off his motorcycle and lifted his shotgun calmly to blow the head off an approaching zombie. \u003c/p\u003e","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-98.html","bookId":2483,"creation":"Oct 5, 2019 5:01:34 PM","modification":"Oct 5, 2019 5:01:34 PM"}
