{"id":16651,"no":23,"title":"THE CITY","content":"You tell yourself: I’ll be gone\n\u003cbr\u003e To some other land, some other sea,\n\u003cbr\u003e To a city lovelier far than this\n\u003cbr\u003e Could ever have been or hoped to be —\n\u003cbr\u003e Where every step now tightens the noose:\n\u003cbr\u003e A heart in a body buried and out of use:\n\u003cbr\u003e How long, how long must I be here\n\u003cbr\u003e Confined among these dreary purlieus\n\u003cbr\u003e Of the common mind? Wherever now I look\n\u003cbr\u003e Black ruins of my life rise into view.\n\u003cbr\u003e So many years have I been here\n\u003cbr\u003e Spending and squandering, and nothing gained.\n\u003cbr\u003e There’s no new land, my friend, no\n\u003cbr\u003e New sea; for the city will follow you,\n\u003cbr\u003e In the same streets you’ll wander endlessly,\n\u003cbr\u003e The same mental suburbs slip from youth to age,\n\u003cbr\u003e In the same house go white at last —\n\u003cbr\u003e The city is a cage.\n\u003cbr\u003e No other places, always this\n\u003cbr\u003e Your earthly landfall, and no ship exists\n\u003cbr\u003e To take you from yourself. Ah! don’t you see\n\u003cbr\u003e Just as you’ve ruined your life in this\n\u003cbr\u003e One plot of ground you’ve ruined its worth\n\u003cbr\u003e Everywhere now — over the whole earth?\n\u003cbr\u003e THE GOD ABANDONS ANTONY\n\u003cbr\u003e When suddenly at darkest midnight heard,\n\u003cbr\u003e The invisible company passing, the clear voices,\n\u003cbr\u003e Ravishing music of invisible choirs —\n\u003cbr\u003e Your fortunes having failed you now,\n\u003cbr\u003e Hopes gone aground, a lifetime of desires\n\u003cbr\u003e Turned into smoke. Ah! do not agonize\n\u003cbr\u003e At what is past deceiving\n\u003cbr\u003e But like a man long since prepared\n\u003cbr\u003e With courage say your last good-byes\n\u003cbr\u003e To Alexandria as she is leaving.\n\u003cbr\u003e Do not be tricked and never say\n\u003cbr\u003e It was a dream or that your ears misled,\n\u003cbr\u003e Leave cowards their entreaties and complaints,\n\u003cbr\u003e Let all such useless hopes as these be shed,\n\u003cbr\u003e And like a man long since prepared,\n\u003cbr\u003e Deliberately, with pride, with resignation\n\u003cbr\u003e Befitting you and worthy of such a city\n\u003cbr\u003e Turn to the open window and look down\n\u003cbr\u003e To drink past all deceiving\n\u003cbr\u003e Your last dark rapture from the mystical throng\n\u003cbr\u003e And say farewell, farewell to Alexandria leaving\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2015/57467.html","bookId":638,"creation":"Aug 2, 2019 7:55:22 AM","modification":"Aug 2, 2019 7:55:22 AM"}
