{"id":107415,"no":13,"title":"Page 13","content":"\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eGambol Deen Namarti was not, at even the best of times, noted for his politeness and suavity-and the approaching climax of a decade of planning had left his disposition sour.\u003c/p\u003e\n\u003cp\u003eHe rose from his chair with some agitation and said, \"You\u0027ve taken your time getting here, Andorin.\"\u003c/p\u003e\n\u003cp\u003eAndorin shrugged. \"But I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"And this young man of yours-this remarkable tool that you\u0027re touting. Where is he?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll be here eventually.\"\u003c/p\u003e\n\u003cp\u003e\"Why not now?\"\u003c/p\u003e\n\u003cp\u003eAndorin\u0027s rather handsome head seemed to sink a bit, as though he were lost in thought or coming to a decision, and then he said abruptly, \"I don\u0027t want to bring him until I know where I stand.\"\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"Simple words in Galactic Standard. How long has it been your aim to get rid of Hari Seldon?\"\u003c/p\u003e\n\u003cp\u003e\"Always! Always! Is that so hard to understand? We deserve revenge for what he did to Jo-Jo. Even if he hadn\u0027t done that, since he\u0027s the First Minister, we\u0027d have to put him out of the way.\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s Cleon-Cleon-who must be brought down. If not only he, then at least he, in addition to Seldon.\"\u003c/p\u003e\n\u003cp\u003e\"Why does a figurehead concern you?\"\u003c/p\u003e\n\u003cp\u003e\"You weren\u0027t born yesterday. I\u0027ve never had to explain my part in this because you\u0027re not so ignorant a fool as not to know. What can I possibly care about your plans if they don\u0027t include a replacement on the throne?\"\u003c/p\u003e\n\u003cp\u003eNamarti laughed. \"Of course. I\u0027ve known for a long time that you look upon me as your footstool, your way of climbing up to the Imperial throne.\"\u003c/p\u003e\n\u003cp\u003e\"Would you expect anything else?\"\u003c/p\u003e\n\u003cp\u003e\"Not at all. I will do the planning, take the chances, and then, when all is quite done, you gather in the reward. It makes sense, doesn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it does make sense, for the reward will be yours, too. Won\u0027t you become the First Minister? Won\u0027t you be able to count on the full support of a new Emperor, one who is filled with gratitude? Won\u0027t I be\"-and his face twisted with irony as he spat out the words-\"the new figurehead?\"\u003c/p\u003e\n\u003cp\u003e\"Is that what you plan to be? A figurehead?\"\u003c/p\u003e\n\u003cp\u003e\"I plan to be the Emperor. I supplied advances of credit when you had none. I supplied the cadre when you had none. I supplied the respectability you needed to build a large organization here in Wye. I can still withdraw everything I\u0027ve brought in.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want to risk it? Don\u0027t think you can treat me the way you treated Kaspalov, either. If anything happens to me, Wye will become uninhabitable for you and yours-and you will find that no other sector will supply you with what you need.\"\u003c/p\u003e\n\u003cp\u003eNamarti sighed. \"Then you insist on having the Emperor killed.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t say \u0027killed.\u0027 I said `brought down.\u0027 The details I leave to you.\" This last statement was accompanied with an almost dismissive wave of the hand, a flick of the wrist, as if Andorin were already sitting on the Imperial throne.\u003c/p\u003e\n\u003cp\u003e\"And then you\u0027ll be Emperor?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"No, you won\u0027t. You\u0027ll be dead-and not at my hands, either. Andorin, let me teach you some of the facts of life. If Cleon is killed, then the matter of the succession comes up and, to avoid civil war, the Imperial Guard will at once kill every member of the Wyan Mayoral family they can find-you first of all. On the other hand, if only the First Minister is killed, you will be safe.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"A First Minister is only a First Minister. They come and go. It is possible that Cleon himself may have grown tired of him and arranged the murder. Certainly we would see to it that rumors of this sort are spread. The Imperial Guard would hesitate and would give us a chance to put the new government into place. Indeed, it is quite possible that they themselves would be grateful for the end of Seldon.\"\u003c/p\u003e\n\u003cp\u003e\"And with the new government in place, what am I to do? Keep on waiting? Forever?\"\u003c/p\u003e\n\u003cp\u003e\"No. Once I\u0027m First Minister, there will be ways of dealing with Cleon. I may even be able to do something with the Imperial Guard-and even with the security establishment-and use them all as my instruments. I will then manage to find some safe way of getting rid of Cleon and replacing him with you.\"\u003c/p\u003e\n\u003cp\u003eAndorin burst out, \"Why should you?\"\u003c/p\u003e\n\u003cp\u003eNamarti said, \"What do you mean, why should I?\"\u003c/p\u003e\n\u003cp\u003e\"You have a personal grudge against Seldon. Once he is gone, why should you run unnecessary risks at the highest level? You will make your peace with Cleon and I will have to retire to my crumbling estate and my impossible dreams. And perhaps, to play it safe, you will have me killed.\"\u003c/p\u003e\n\u003cp\u003eNamarti said, \"No! Cleon was born to the throne. He comes from several generations of Emperors-the proud Entun Dynasty. He would he very difficult to handle, a plague. You, on the other hand, would come to the throne as a member of a new dynasty, without any strong ties to tradition, for the previous Wyan Emperors were, you will admit, totally undistinguished. You will be seated on a shaky throne and will need someone to support you-me. And I will need someone who is dependent upon me and whom I can therefore handle you. Come, Andorin, ours is not a marriage of love, which fades in a year; it is a marriage of convenience, which can last as long as we both live. Let us trust each other.\"\u003c/p\u003e\n\u003cp\u003e\"You swear I will be Emperor.\"\u003c/p\u003e\n\u003cp\u003e\"What good would swearing do if you couldn\u0027t trust my word? Let us say I would find you an extraordinarily useful Emperor and I would want you to replace Cleon as soon as that can safely be managed. Now introduce me to this man you think will be the perfect tool for your purposes.\"\u003c/p\u003e\n\u003cp\u003e\"Very well. And remember what makes him different. I have studied him. He\u0027s a not-very-bright idealist. He will do what he\u0027s told, unconcerned by danger, unconcerned by second thoughts. And he exudes a kind of trustworthiness so that his victim will trust him, even if he has a blaster in his hand.\"\u003c/p\u003e\n\u003cp\u003e\"I find that impossible to believe.\"\u003c/p\u003e\n\u003cp\u003e\"Wait till you meet him,\" said Andorin.\u003c/p\u003e\n\u003cp\u003e17\u003c/p\u003e\n\u003cp\u003eRaych kept his eyes down. He had taken a quick look at Namarti and it was all he needed. He had met the man ten years before, when Raych had been sent to lure Jo-Jo Joranum to his destruction, and one look was more than enough.\u003c/p\u003e\n\u003cp\u003eNamarti had changed little in ten years. Anger and hatred were still the dominant characteristics one could see in him-or that Raych could see in him, at any rate, for he realized he was not an impartial witness-and those seemed to have marinated him into leathery permanence. His face was a trifle more gaunt, his hair was flecked with gray, but his thin-lipped mouth was set in the same harsh line and his dark eyes were as brilliantly dangerous as ever.\u003c/p\u003e\n\u003cp\u003eThat was enough and Raych kept his eyes averted. Namarti, he felt, was not the type of person who would take to someone who could stare lm straight in the face.\u003c/p\u003e\n\u003cp\u003eNamarti seemed to devour Raych with his own eyes, but the slight sneer his face always seemed to wear remained.\u003c/p\u003e\n\u003cp\u003eHe turned to Andorin, who stood uneasily to one side, and said, quite;is though the subject of conversation were not present, \"This is the man, then.\"\u003c/p\u003e\n\u003cp\u003eAndorin nodded and his lips moved in a soundless \"Yes, Chief.\"\u003c/p\u003e\n\u003cp\u003eNamarti said to Raych abruptly, \"Your name.\"\u003c/p\u003e\n\u003cp\u003e\"Planchet, sir.\"\u003c/p\u003e\n\u003cp\u003e\"You believe in our cause?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\" He spoke carefully, in accordance with Andorin\u0027s instructions. \"I am a democrat and want greater participation of the people in the governmental process.\"\u003c/p\u003e\n\u003cp\u003eNamarti\u0027s eyes flicked in Andorin\u0027s direction. \"A speechmaker.\"\u003c/p\u003e\n\u003cp\u003eHe looked back at Raych. \"Are you willing to undertake risks for the cause?\"\u003c/p\u003e\n\u003cp\u003e\"Any risk, sir.\"\u003c/p\u003e\n\u003cp\u003e\"You will do as you are told? No questions? No hanging back?\"\u003c/p\u003e\n\u003cp\u003e\"I will follow orders.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know anything about gardening?\"\u003c/p\u003e\n\u003cp\u003eRaych hesitated. \"No, sir.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a Trantorian, then? Born under the dome?\"\u003c/p\u003e\n\u003cp\u003e\"I was born in Millimaru, sir, and I was brought up in Dahl.\"\u003c/p\u003e\n\u003cp\u003e\"Very well,\" said Namarti. Then to Andorin, \"Take him out and deliver him temporarily to the men waiting there. They will take good care of him. Then come back, Andorin. I want to speak to you.\"\u003c/p\u003e\n\u003cp\u003eWhen Andorin returned, a profound change had come over Namarti. His eyes were glittering and his mouth was twisted into a feral grin.\u003c/p\u003e\n\u003cp\u003e\"Andorin,\" he said, \"the gods we spoke of the other day are with us to an extent I couldn\u0027t have imagined.\"\u003c/p\u003e\n\u003cp\u003e\"I told you the man was suitable for our purposes.\"\u003c/p\u003e\n\u003cp\u003e\"Far more suitable than you think. You know, of course, the tale of how Hari Seldon our revered First Minister, sent his son-or foster son, rather-to see Joranum and to set the trap into which Joranum, against my advice, fell.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" said Andorin, nodding wearily, \"I know the story.\" He said it with the air of one who knew the story entirely too well.\u003c/p\u003e\n\u003cp\u003e\"I saw that boy only that once, but his image burned into my brain. Do you suppose that ten years\u0027 passage and false heels and a shaved mustache could fool me? That Planchet of yours is Raych, the foster son of Hari Seldon.\"\u003c/p\u003e\n\u003cp\u003eAndorin paled and held his breath for a moment. He said, \"Are you sure of that, Chief?\"\u003c/p\u003e\n\u003cp\u003e\"As sure as I am that you\u0027re standing here in front of me and that you have introduced an enemy into our midst.\"\u003c/p\u003e\n\u003cp\u003e\"I had no idea-\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get nervous,\" said Namarti. \"I consider it the best thing you have ever done in your idle aristocratic life. You have played the role that the gods have marked out for you. If I had not known who he was, he might have fulfilled the function for which he was undoubtedly intended: to be a spy in our midst and an informant of our most secret plans. But since I know who he is, it won\u0027t work that way. Instead, we now have everything.\" Namarti rubbed his hands together in delight and, haltingly, as if he realized how far out of character it was for him, he smiled-and laughed.\u003c/p\u003e\n\u003cp\u003e18\u003c/p\u003e\n\u003cp\u003eManella said thoughtfully, \"I guess I won\u0027t be seeing you anymore, Planchet.\"\u003c/p\u003e\n\u003cp\u003eRaych was drying himself after his shower. \"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Gleb Andorin doesn\u0027t want me to.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003eManella shrugged her smooth shoulders. \"He says you have important work to do and no more time to fool around. Maybe he means you\u0027ll get a better job.\"\u003c/p\u003e\n\u003cp\u003eRaych stiffened. \"What kind of work? Did he mention anything in particular?\"\u003c/p\u003e\n\u003cp\u003e\"No, but he said he would be going to the Imperial Sector.\"\u003c/p\u003e\n\u003cp\u003e\"Did he? Does he often tell you things like that?\"\u003c/p\u003e\n\u003cp\u003e\"You know how it is, Planchet. When a fellow\u0027s in bed with you, he talks a lot.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" said Raych, who was always careful not to. \"What else does he say?\"\u003c/p\u003e\n\u003cp\u003e\"Why do you ask?\" She frowned a bit. \"He always asks about you, too. I noticed that about men. They\u0027re curious about each other. Why is that, do you suppose?\"\u003c/p\u003e\n\u003cp\u003e\"What do you tell him about me?\"\u003c/p\u003e\n\u003cp\u003e\"Not much. Just that you\u0027re a very decent sort of guy. Naturally I don\u0027t tell him that I like you better than I like him. That would hurt his feelings-and it might hurt me, too.\"\u003c/p\u003e\n\u003cp\u003eRaych was getting dressed. \"So it\u0027s good-bye, then.\"\u003c/p\u003e\n\u003cp\u003e\"For a while, I suppose. Gleb may change his mind. Of course, I\u0027d like to go to the Imperial Sector-if he\u0027d take me. I\u0027ve never been there.\"\u003c/p\u003e\n\u003cp\u003eRaych almost slipped, but he managed to cough, then said, \"I\u0027ve never been there, either.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s got the biggest buildings and the nicest places and the fanciest restaurants-and that\u0027s where the rich people live. I\u0027d like to meet some rich people-besides Gleb, I mean.\"\u003c/p\u003e\n\u003cp\u003eRaych said, \"I suppose there\u0027s not much you can get out of a person like me.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re all right. You can\u0027t think of credits all the time, but you\u0027ve got to think of them some of the time. Especially since I think Gleb is getting tired of me.\"\u003c/p\u003e\n\u003cp\u003eRaych felt compelled to say, \"No one could get tired of you,\" and then found, a little to his own confusion, that he meant it.\u003c/p\u003e\n\u003cp\u003eManella said, \"That\u0027s what men always say, but you\u0027d be surprised. Anyway, it\u0027s been good, you and I, Planchet. Take care of yourself and, who knows, we may see each other again.\"\u003c/p\u003e\n\u003cp\u003eRaych nodded and found himself at a loss for words. There was no way in which he could say or do anything to express his feelings.\u003c/p\u003e\n\u003cp\u003eHe turned his mind in other directions. He had to find out what the Namarti people were planning. If they were separating him from Manella, the crisis must be rapidly approaching. All he had to go on was that odd question about gardening.\u003c/p\u003e\n\u003cp\u003eNor could he get any further information back to Seldon. He had been kept under close scrutiny since his meeting with Namarti and all avenues of communication were cut off-surely another indication of an approaching crisis.\u003c/p\u003e\n\u003cp\u003eBut if he were to find out what was going on only after it was done-and if he could communicate the news only after it was no longer news-he would have failed.\u003c/p\u003e\n\u003cp\u003e19\u003c/p\u003e\n\u003cp\u003eHari Seldon was not having a good day. He had not heard from Raych since his first communique; he had no idea what was happening.\u003c/p\u003e\n\u003cp\u003eAside from his natural concern for Raych\u0027s safety (surely he would hear if something really bad had happened), there was his uneasiness over what might be planned.\u003c/p\u003e\n\u003cp\u003eIt would have to be subtle. A direct attack on the Palace itself was totally out of the question. Security there was far too tight. But if so, what else could be planned that would be sufficiently effective?\u003c/p\u003e\n\u003cp\u003eThe whole thing was keeping him awake at night and distracted by day.\u003c/p\u003e\n\u003cp\u003eThe signal light flashed.\u003c/p\u003e\n\u003cp\u003e\"First Minister. Your two o\u0027clock appointment, sir-\"\u003c/p\u003e\n\u003cp\u003e\"What two o\u0027clock appointment is this?\"\u003c/p\u003e\n\u003cp\u003e\"Mandell Gruber, the gardener. He has the necessary certification.\"\u003c/p\u003e\n\u003cp\u003eSeldon remembered. \"Yes. Send him in.\"\u003c/p\u003e\n\u003cp\u003eThis was no time to see Gruber, but he had agreed to it in a moment of weakness-the man had seemed distraught. A First Minister should not have such moments of weakness, but Seldon had been Seldon long before he had become First:Minister.\u003c/p\u003e\n\u003cp\u003e\"Come in, Gruber,\" he said kindly.\u003c/p\u003e\n\u003cp\u003eGruber stood before him, head ducking mechanically, eyes darting this way and that. Seldon was quite certain the gardener had never been in any room as magnificent as this one and he had the bitter urge to say: \"Do you like it? Please take it. I don\u0027t want it.\"\u003c/p\u003e\n\u003cp\u003eBut he only said, \"What is it, Gruber? Why are you so unhappy\"\u003c/p\u003e\n\u003cp\u003eThere was no immediate answer; Gruber merely smiled vacantly.\u003c/p\u003e\n\u003cp\u003eSeldon said, \"Sit down, man. Right there in that chair.\"\u003c/p\u003e\n\u003cp\u003e\"Oh no, First Minister. It would not be fitting. I\u0027ll get it dirty.\"\u003c/p\u003e\n\u003cp\u003e\"If you do, it will be easy to clean. Do as I say. Good! Now just sit there a minute or two and gather your thoughts. Then, when you are ready, tell me what\u0027s the matter.\"\u003c/p\u003e\n\u003cp\u003eGruber sat silent for a moment, then the words came out in a panting rush. \"First Minister. It is Chief Gardener I am to be. The blessed Emperor himself told me so.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I have heard of that, but that surely isn\u0027t what is troubling you. Your new post is a matter of congratulations and I do congratulate you. I may even have contributed to it, Gruber. I have never forgotten your bravery at the time I was nearly killed and you can be sure I mentioned it to His Imperial Majesty. It is a suitable reward, Gruber, and you would deserve the promotion in any case, for it is quite clear from your record that you are fully qualified for the post. So, now that that\u0027s out of the way, tell me what is troubling you.\"\u003c/p\u003e\n\u003cp\u003e\"First Minister, it is the very post and promotion that\u0027s troubling me. It is something I cannot manage, for I am not qualified.\"\u003c/p\u003e\n\u003cp\u003e\"We are convinced you are.\"\u003c/p\u003e\n\u003cp\u003eGruber grew agitated. \"And is it in an office I will have to sit? I can\u0027t sit in an office. I could not go out in the open air and work with the plants and animals. I would be in prison, First Minister.\"\u003c/p\u003e\n\u003cp\u003eSeldon\u0027s eyes opened wide. \"No such thing, Gruber. You needn\u0027t stay in the office longer than you have to. You could wander around the grounds freely, supervising everything. You will have all the outdoors you want and you will merely spare yourself the hard work.\"\u003c/p\u003e\n\u003cp\u003e\"I want the hard work, First Minister, and it\u0027s no chance at all they will let me come out of the office. I have watched the present Chief Gardener. He couldn\u0027t leave his office, though he wanted to, ever so. There is too much administration, too much bookkeeping. Sure, if he wants to know what is going on, we must go to his office to tell him. He watches things on holovision \"-he said with infinite contempt \"as though you can tell anything about growing, living things from pictures. It is not for me, First Minister.\"\u003c/p\u003e\n\u003cp\u003e\"Come, Gruber, be a man. It\u0027s not all that bad. You\u0027ll get used to it. You\u0027ll work your way in slowly.\"\u003c/p\u003e\n\u003cp\u003eGruber shook his head. \"First off-at the very first-I will have to deal with all the new gardeners. I\u0027ll be buried.\" Then, with sudden energy, \"It is a job I do not want and must not have, First Minister.\"\u003c/p\u003e\n\u003cp\u003e\"Right now, Gruber, perhaps you don\u0027t want the job, but you are not alone. I\u0027ll tell you that right now I wish I were not First Minister. This job is too much for me. I even have a notion that there are times when the Emperor himself is tired of his Imperial robes. We\u0027re all in this Galaxy to do our work and the work isn\u0027t always pleasant.\"\u003c/p\u003e\n\u003cp\u003e\"I understand that, First Minister, but the Emperor must be Emperor, for he was born to that. And you must be First Minister, for there is no one else who can do the job. But in my case, it is just Chief Gardener we are ruminating upon. There are fifty gardeners in the place who could do it as well as I could and who wouldn\u0027t mind the office. You say that you spoke to the Emperor about how I tried to help you. Can\u0027t you speak to him again and explain that if he wants to reward me for what I did, he can leave me as I am?\"\u003c/p\u003e\n\u003cp\u003eSeldon leaned back in his chair and said solemnly, \"Gruber, I would do that for you if I could, but I must explain something to you and I can only hope that you will understand it. The Emperor, in theory, is absolute ruler of the Empire. In actual fact, there is very little he can do. I run the Empire right now much more than he does and there is very little I can do, too. There are millions and billions of people at all levels of government, all making decisions, all making mistakes, some acting wisely and heroically, some acting foolishly and thievishly. There\u0027s no controlling them. Do you understand me, Gruber?\"\u003c/p\u003e\n\u003cp\u003e\"I do, but what has this to do with my case?\"\u003c/p\u003e\n\u003cp\u003e\"Because there is only one place where the Emperor is really absolute ruler-and that is over the Imperial grounds. Here, his word is law and the layers of officials beneath him are few enough for him to handle. For him to be asked to rescind a decision he has made in connection with the Imperial Palace grounds would be to invade the only area that he would consider inviolate. If I were to say, \u0027Take back your decision on Gruber, Your Imperial Majesty,\u0027 he would be much more likely to relieve me of my duties than to take back his decision. That might be a good thing for me, but it wouldn\u0027t help you any.\"\u003c/p\u003e\n\u003cp\u003eGruber said, \"Does that mean there\u0027s no way things can be changed?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s exactly what it means. But don\u0027t worry, Gruber, I\u0027ll help you all I can. I\u0027m sorry. But now I have really spent all the time with you that I am able to spare.\"\u003c/p\u003e\n\u003cp\u003eGruber rose to his feet. In his hands he twisted his green gardening cap. There was more than a suspicion of tears in his eyes. \"Thank you, First Minister. I know you would like to help. You\u0027re-you\u0027re a good man, First Minister.\"\u003c/p\u003e\n\u003cp\u003eHe turned and left, sorrowing.\u003c/p\u003e\n\u003cp\u003eSeldon looked after him thoughtfully and shook his head. Multiply Gruber\u0027s woes by a quadrillion and you would have the woes of all the people of the twenty-five million worlds of the Empire and how was he, Seldon, to work out salvation for all of them, when he was helpless to solve the problem of one single man who had come to him for help?\u003c/p\u003e\n\u003cp\u003ePsychohistory could not save one man. Could it save a quadrillion?\u003c/p\u003e\n\u003cp\u003eHe shook his head again, checked the nature and time of his next appointment, and then suddenly stiffened. He shouted into his communications wire in sudden wild abandon, quite unlike his usually strict control. \"Get that gardener back! Get him back here right now!\"\u003c/p\u003e\n\u003cp\u003e20\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this about new gardeners?\" exclaimed Seldon. This time he did not ask Gruber to sit down.\u003c/p\u003e\n\u003cp\u003eGruber\u0027s eyes blinked rapidly. He was in a panic at having been recalled so unexpectedly. \"N-new g-gardeners?\" he stammered.\u003c/p\u003e\n\u003cp\u003e\"You said \u0027all the new gardeners.\u0027 Those were your words. What new gardeners?\"\u003c/p\u003e\n\u003cp\u003eGruber was astonished. \"Sure, if there is a new Chief Gardener, there will be new gardeners. It is the custom.\"\u003c/p\u003e\n\u003cp\u003e\"I have never heard of this.\"\u003c/p\u003e\n\u003cp\u003e\"The last time we had a change of Chief Gardeners, you were not First Minister. It is likely you were not even on Trantor.\"\u003c/p\u003e\n\u003cp\u003e\"But what\u0027s it all about?\"\u003c/p\u003e\n\u003cp\u003e\"Well, gardeners are never discharged. Some die. Some grow too old and are pensioned off and replaced. Still, by the time a new Chief Gardener is ready for his duties, at least half the staff is aged and beyond their best years. They are all pensioned off generously and new gardeners are brought in.\"\u003c/p\u003e\n\u003cp\u003e\"For youth.\"\u003c/p\u003e\n\u003cp\u003e\"Partly and partly because by that time there are usually new plans for the gardens and it is new ideas and new schemes we must have. There are almost five hundred square kilometers in the gardens and parklands and it usually takes some years to reorganize it and it is myself who will have to supervise it all. Please, First Minister.\" Gruber was gasping. \"Surely a clever man like your own self can find a way to change the blessed Emperor\u0027s mind.\"\u003c/p\u003e\n\u003cp\u003eSeldon paid no attention. His forehead was creased in concentration. \"Where do the new gardeners come from?\"\u003c/p\u003e\n\u003cp\u003e\"There are examinations on all the worlds-there are always people waiting to serve as replacements. They\u0027ll be coming in by the hundreds in a dozen batches. It will take me a year, at the least-\"\u003c/p\u003e\n\u003cp\u003e\"From where do they come? From where?\"\u003c/p\u003e\n\u003cp\u003e\"From any of a million worlds. We want a variety of horticultural knowledge. Any citizen of the Empire can qualify.\"\u003c/p\u003e\n\u003cp\u003e\"From Trantor, too?\"\u003c/p\u003e\n\u003cp\u003e\"No, not from Trantor. There is no one from Trantor in the gardens.\" His voice grew contemptuous. \"You can\u0027t get a gardener out of Trantor. The parks they have here under the dome aren\u0027t gardens. They are potted plants and the animals are in cages. Trantorians, poor specimens that they are, know nothing about open air, free water, and the true balance of nature.\"\u003c/p\u003e\n\u003cp\u003e\"All right, Gruber. I will now give you a job. It will be up to you to get me the names of every new gardener scheduled to arrive over the coming weeks. Everything about them. Name. World. Reference number. Education. Experience. Everything. I want it all here on my desk just as quickly as possible. I\u0027m going to send people to help you. People with machines. What kind of a computer do you use?\"\u003c/p\u003e\n\u003cp\u003e\"Only a simple one for keeping track of plantings and species and things like that.\"\u003c/p\u003e\n\u003cp\u003e\"All right. The people I send will be able to do anything you can\u0027t do. I can\u0027t tell you how important this is.\"\u003c/p\u003e\n\u003cp\u003e\"If I should do this-\"\u003c/p\u003e\n\u003cp\u003e\"Gruber, this is not the time to make bargains. Fail me and you will not be Chief Gardener. Instead, you will be discharged without a pension.\"\u003c/p\u003e\n\u003cp\u003eAlone again, Seldon barked into his communication wire, \"Cancel all appointments for the rest of the afternoon.\"\u003c/p\u003e\n\u003cp\u003eHe then let his body flop in his chair, feeling every bit of his fifty years and feeling his headache worsen. For years, for decades, security had been built up around the Imperial Palace grounds, thicker, more solid, more impenetrable, as each new layer and each new device was added.\u003c/p\u003e\n\u003cp\u003eAnd every once in a while, hordes of strangers were let into the grounds. No questions asked, probably, but one: \"Can you garden?\"\u003c/p\u003e\n\u003cp\u003eThe stupidity involved was too colossal to grasp.\u003c/p\u003e\n\u003cp\u003eAnd he had barely caught it in time. Or had he? Was he, even now, too late? \u003c/p\u003e","sourceLink":"https://allnovel.net/forward-the-foundation-foundation-7/page-13.html","bookId":2019,"creation":"Oct 5, 2019 11:07:50 PM","modification":"Oct 5, 2019 11:07:50 PM"}
