{"id":68184,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eWILL TOOK THE CORNER FAST. Fear tickled the back of his neck, making him run harder. There easily could have been fifteen of them still after him. He covered the next hallway in seconds and hooked a right at an intersection. His pursuers were the best athletes in the school; he was never going to outrun them.\u003c/p\u003e\n\u003cp\u003eHe saw a locker grave. RIP was scratched into the paint in tall letters. Someone had broken the duct tape seal, and the stench of death permeated the air. He whipped the locker open. A rotting body stared down at Will’s shoes. Its arms were snaked through the straps of an old blue backpack that hung on a coat hook. The reek fouled his stomach. The growling pack of Varsity goons neared the corner. He plugged his nose, covered his mouth, and stuffed himself into the locker, closing the door behind him.\u003c/p\u003e\n\u003cp\u003eHe heard Varsity run past the locker. His hand brushed against a knob of dry, shrunken flesh. He didn’t breathe. The Varsity guys were talking to each other, but he couldn’t hear the words through the door. Something was poking him in his back. It could have been an elbow. Or a broken rib. He heard the sound of multiple lockers being opened down the hall. He wanted to take a breath. They opened more lockers, right by Will. He let a little air out and took a quick breath in.\u003c/p\u003e\n\u003cp\u003eHe stifled vomit, and the acid burned his throat. He was sure that he’d just inhaled particles of death. He heard the locker next to his being opened and slammed shut. He braced for an attack. But his locker didn’t open.\u003c/p\u003e\n\u003cp\u003eHe didn’t hear any more noises.\u003c/p\u003e\n\u003cp\u003eWere they gone?\u003c/p\u003e\n\u003cp\u003eHe couldn’t hold his breath.\u003c/p\u003e\n\u003cp\u003eTen seconds, maybe he could last ten more seconds .\u003c/p\u003e\n\u003cp\u003eBy five, he was ready to die. After seven seconds, Will pushed open the door and fell to the hallway floor on his knees. He looked down the hall, expecting Varsity eyes to be staring back at him. There was no one there.\u003c/p\u003e\n\u003cp\u003eWill laughed. He’d single-handedly ruined Sam’s big show, and his brother was saved. As soon as he’d heard the announcement over the PA.system about David’s execution, Will couldn’t hide under those gym bleachers any longer.\u003c/p\u003e\n\u003cp\u003eWho were those kids that carried David off? Scraps, clearly, but he’d never seen Scraps band together bravely like that before. And where did they take David?\u003c/p\u003e\n\u003cp\u003eAs long as David wasn’t in Varsity’s hands, Will was pretty sure David could take care of himself. He had to get back to Lucy in the elevator. He was dying to tell her everything that had happened. He was tingling as he relived the glory, his lips moving slightly as he rehearsed his delivery.\u003c/p\u003e\n\u003cp\u003eBuoyant conversation and laughter echoed down the hall.\u003c/p\u003e\n\u003cp\u003eWill ducked into the nearest stairwell and pressed himself against the wall. He had a clear view of some Freak girls. They had smudged ash mascara and matching blue bobs that hid their eyes. They were returning home from the market.\u003c/p\u003e\n\u003cp\u003e“That was literally the sickest thing I’ve ever seen.”\u003c/p\u003e\n\u003cp\u003e“In a good way?\u003c/p\u003e\n\u003cp\u003e“Totally. I’m in love.”\u003c/p\u003e\n\u003cp\u003eWill grinned, psyched to hear about his handiwork.\u003c/p\u003e\n\u003cp\u003e“David’s cute, huh?”\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003e“Is it wrong that the cord around his neck got me hot? I just wanted crawl on top of him—”\u003c/p\u003e\n\u003cp\u003e“Omigod, you are mentally ill!”\u003c/p\u003e\n\u003cp\u003eThe girls laughed.\u003c/p\u003e\n\u003cp\u003e“People are saying he planned the whole thing. Like, he let them capture him so he could make Varsity look stupid.” Will curled his lip.\u003c/p\u003e\n\u003cp\u003e“Whoa. Really? Wow. It totally worked.”\u003c/p\u003e\n\u003cp\u003e“That sounds so like him. I used to know him. He’s kind of a genius.”\u003c/p\u003e\n\u003cp\u003eHow could they call David a genius? He didn’t plan dick.\u003c/p\u003e\n\u003cp\u003eThe Freak girls walked toward the stairwell. Will had enough time to run up the stairs and disappear, but he didn’t.\u003c/p\u003e\n\u003cp\u003eHe stuck his hands in his pocket and leaned against the wall inside the stairwell with his coolest pose. These girls were going to get all flustered when they saw the guy who saved David’s life. The girls stepped through the doorway.\u003c/p\u003e\n\u003cp\u003eHe smirked at them, “’S up?”\u003c/p\u003e\n\u003cp\u003e“Ew . . . Scrap,” the first said.\u003c/p\u003e\n\u003cp\u003eThe second girl pulled her friends along, up the stairs.\u003c/p\u003e\n\u003cp\u003eThey had to be joking. Did they just not see what he did?\u003c/p\u003e\n\u003cp\u003e“David stands for something. Like, he’s a really good person,” the third said as the girls continued up the stairs.\u003c/p\u003e\n\u003cp\u003e“I know,” her friend said. “He’s, like, a saint for taking care of his little brother with all those problems. Its so sad.”\u003c/p\u003e\n\u003cp\u003e“You’re sad!” Will shouted.\u003c/p\u003e\n\u003cp\u003eThe girls flipped him off and disappeared up the next flight.\u003c/p\u003e\n\u003cp\u003eUnbelievable, Will thought. Freaks suck. He rolled back into the hall to go home.\u003c/p\u003e\n\u003cp\u003eTen minutes later, he was at the elevator. He slipped into the control closet and then up through the vent. After a few rungs of the ladder he hopped into the darkness, knowing just where his feet would land. They made a brassy boom against the metal of the elevator. The sound hung in the air. There was no light on inside the car. He dipped his head down inside, gripping the sides of the hatch hard. No one was inside.\u003c/p\u003e\n\u003cp\u003e“Lucy?” He said for good measure.\u003c/p\u003e\n\u003cp\u003eNo answer.\u003c/p\u003e\n\u003cp\u003eWill pulled himself back up and sat on the roof of the elevator shaft. He tried to make sense of her absence. He was starting to panic about David too. Things might not have gone as smoothly as he thought after David escaped the market.\u003c/p\u003e\n\u003cp\u003eNo. Everything’s fine, he thought. Lucy just left out of curiosity, but she’s smart. She wouldn’t go far. She’ll be back.\u003c/p\u003e\n\u003cp\u003eHe decided to stay cool and wait. He dropped back into the elevator, lit a candle, and picked up a book of short stories David had been reading. The creaking of the elevator’s steel cables reverberated up and down the shaft, sounding like a fingernail slowly scratching down the string of an electric bass. Will tried to concentrate on the story but couldn’t. He tossed the book aside and just sat, staring at the candle. He tapped his fingers. He didn’t know for how long.\u003c/p\u003e\n\u003cp\u003eI gotta get out of here.\u003c/p\u003e\n\u003cp\u003eWill pulled himself out of the elevator and climbed the ladder to the vent. There was no way he could sit still, and he figured that if he kept moving he’d eventually run into either Lucy or David. He crawled through the vent to the closet and pushed open the door to the hallway.\u003c/p\u003e\n\u003cp\u003eTwo identical pale faces stared back at him.\u003c/p\u003e\n\u003cp\u003e“Gah!”\u003c/p\u003e\n\u003cp\u003eWill stumbled back into the closet and pulled the door shut.\u003c/p\u003e\n\u003cp\u003eHe held firm on the knob. He waited for the invaders to tug on the door. Or knock. Anything. But nothing happened. Will leaned close to where the door met the frame.\u003c/p\u003e\n\u003cp\u003e“Hello?” he said.\u003c/p\u003e\n\u003cp\u003e“Is—is—” a boy’s voice began.\u003c/p\u003e\n\u003cp\u003e“You Will?” a girl’s voice finished.\u003c/p\u003e\n\u003cp\u003eWill crinkled his nose, confused. “Yeah,” he said.\u003c/p\u003e\n\u003cp\u003e“Got a letter for you.”\u003c/p\u003e\n\u003cp\u003e“Slide it under the door.”\u003c/p\u003e\n\u003cp\u003eA scrap of paper appeared at his feet. Will picked it up and opened it, straining to read it in the darkness. He pulled a lighter from his pocket and sparked it. The lighter was almost empty and produced only a blue nub of flame. On the scrap was written: “Lucy’s with me. These kids will take you to us. D.” Will relaxed when he recognized David’s handwriting. He pushed open the door and came face-to-face with the ghoulish twins. They shared the same cringing smile; it revealed more nostril than teeth.\u003c/p\u003e\n\u003cp\u003e“We don’t bite,” the boy said.\u003c/p\u003e\n\u003cp\u003eThe girl covered her mouth and giggled. Will turned up his nose, crumpled up the paper, and pocketed it.\u003c/p\u003e\n\u003cp\u003e“You two are weird looking,” Will said, “and that’s saying something in this dump.”\u003c/p\u003e\n\u003cp\u003eThe boy kept a straight face, but the girl sneered at Will and spit to acknowledge the insult. The saliva dribbled down her shorts. The twins turned in unison and walked away from Will. He figured that was his cue to follow.\u003c/p\u003e\n\u003cp\u003e“I mean, seriously, are you two okay? How long have you been dead? I think I bunked up with a friend of yours in a locker a little while ago.”\u003c/p\u003e\n\u003cp\u003eThey giggled. Will craned his head, surprised at their response. But they weren’t listening to him. They were communicating with each other through barely audible whispers and slight hand gestures. Another flourish of giggles and a glance back at Will. They were talking about him. Will sped up to see if he could hear what they were saying.\u003c/p\u003e\n\u003cp\u003e“. . . ehse ogto suey-sus . . .”\u003c/p\u003e\n\u003cp\u003eThe girl giggled hard this time. A mucous bubble expanded from her nose and then popped. Part of the bottom of her oversize T-shirt was crusted into a point. She lifted it and wiped her nose. Will stifled a gag.\u003c/p\u003e\n\u003cp\u003e“Let me guess? Single?” Will said.\u003c/p\u003e\n\u003cp\u003e“The dump,” Will said to himself. “Shoulda seen that coming.” Will stood at the top of the stairs to the basement. At the bottom of the stairs were two open doors that led to the basement. Trash bags were scattered around the doors. The twins trudged their way through the doors. It smelled rank, not rotting-corpse rank but enough to piss Will off.\u003c/p\u003e\n\u003cp\u003eWill groaned, took a deep breath, and waded into the trash and debris. He passed through the doors into the basement.\u003c/p\u003e\n\u003cp\u003eThe room was as big as a basketball court. Before the explosion it had been the school’s storage area, but everything worthwhile had been raided. Piles of black plastic trash bags, ruined furniture, and debris filled the room. There were hundreds of piles, some knee-high, some almost to the ceiling. To Will’s surprise, every light in the room except one was still working. Not that it helped anything. The lights cast a bluish tone across the wall-to-wall junk.\u003c/p\u003e\n\u003cp\u003eThere was a small crowd of white-hairs gathered at the wall to Will’s left. They stood around the only other door in the room, which was shut. On it was a sign that read BOILER\u003c/p\u003e\n\u003cp\u003eROOM. Will recognized most of the group—they were the ones who pulled David out of the quad. There was Leonard and the runty kid with the funnel, but there was no sign of David or Lucy. Without acknowledging Will again, the twins settled at a small three-legged table, pulled out a dirty pink string, and started playing cat’s cradle with each other.\u003c/p\u003e\n\u003cp\u003e“Yeah, okay, later . . . nice hanging with you . . . and your snotshirt,” he called after them, but they ignored him.\u003c/p\u003e\n\u003cp\u003eWill walked to the boiler room door. Leonard Jong stood guard. He still couldn’t get over the fact that Leonard was one of the ones who helped get David out of the market. In middle school, Will once saw Leonard scream and run away crying when a squirrel got too close to him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-loners-quarantine-1/page-17.html","bookId":1722,"creation":"Oct 5, 2019 10:08:28 AM","modification":"Oct 5, 2019 10:08:28 AM"}
