{"id":68190,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBoss. The word dripped with sarcasm. He’d given Will plenty of space since the gang formed; he wanted things to cool down between them. He thought a little time apart and the camaraderie of a gang would dull Will’s anger. No such luck.\u003c/p\u003e\n\u003cp\u003e“Four chargers. Kinda seems like overkill, doesn’t it?” David said.\u003c/p\u003e\n\u003cp\u003e“Yeah, now. But if we wanna be legit, we’re gonna need a phone for every Loner.”\u003c/p\u003e\n\u003cp\u003eDavid saw the faces of all the kids in the huddle bloom with hope.\u003c/p\u003e\n\u003cp\u003e“C’mere,” David said to Will with a hook of his finger. Will followed him to the barricaded entrance to the second floor.\u003c/p\u003e\n\u003cp\u003eDavid cleared his throat and dug in with a hard whisper.\u003c/p\u003e\n\u003cp\u003e“We’re barely getting by as it is, don’t put pipe dreams into people’s heads about personal phones.”\u003c/p\u003e\n\u003cp\u003e“We’re all cooped up in this staircase with nothing to do. We need somethin’. Just food and a place to sleep isn’t enough.”\u003c/p\u003e\n\u003cp\u003e“So, hang out. Tell stories. Sing your camping songs, I don’t know. But don’t say ‘phones for everybody.’ You say it, and then I gotta deliver. You get that? You’re not the one who has to answer for it. They’re all looking at me.”\u003c/p\u003e\n\u003cp\u003e“Yeah, and you just hate that, don’t you?” Will was always going to act like a little shit to him, no matter what David provided for him.\u003c/p\u003e\n\u003cp\u003e“Did you steal them?” David asked.\u003c/p\u003e\n\u003cp\u003e“What, like that’s a sin? Don’t pull the whole golden boy thing with me, man. I know you.”\u003c/p\u003e\n\u003cp\u003eWill was baiting him. He wanted David to flip out in front of everybody.\u003c/p\u003e\n\u003cp\u003e“No phones,” David barked, loud enough that the whole landing heard him. They groaned. He wasn’t going to deal with this now. He left Will by the door and charged up the next flight. Only one more set of stairs after that, and he’d be home.\u003c/p\u003e\n\u003cp\u003eHe high-stepped it across made and unmade beds on the next landing. This was where most of the gang slept. It was first come, first served for floor space, the rest had to take a stair. The stairs were only a foot and a quarter wide and weren’t comfortable to sleep on, but you could fit.\u003c/p\u003e\n\u003cp\u003eOn the last flight up, a lot of Loners were working hard.\u003c/p\u003e\n\u003cp\u003eThey stacked wooden planks, salvaged from food-drop pallets, onto each stair until it was flush with the stair above. It effectively doubled the width of each stair. Eventually, with enough planks, the whole gang could have a double-wide stair to sleep on. Lucy was on her hands and knees, helping place planks. He climbed the steps up to her.\u003c/p\u003e\n\u003cp\u003e“Hi, David,” she said. Her voice gave him a surprising little rush.\u003c/p\u003e\n\u003cp\u003e“Hey.”\u003c/p\u003e\n\u003cp\u003eShe stood and dusted off her hands, her brown eyes as big and hypnotizing as ever. The blonde was long gone from her hair now; it was a shining white. The tips of it stroked her soft freckled shoulders. She wore a new dress he’d never seen before. It was white, and somehow she’d kept it impossibly clean while doing this manual labor project.\u003c/p\u003e\n\u003cp\u003e“Did, um . . . did Dorothy find you? She was looking for you,” Lucy said, stepping after him and letting her hand slide along the banister behind her.\u003c/p\u003e\n\u003cp\u003eDavid pulled the hand-drawn portrait from his pocket.\u003c/p\u003e\n\u003cp\u003eHe’d given Lucy a glimpse of Dorothy’s other gifts in the past.\u003c/p\u003e\n\u003cp\u003eLucy covered her mouth with a little gasp, and her eyebrows parted sympathetically. “She loves you,” Lucy said.\u003c/p\u003e\n\u003cp\u003e“Oh, God, don’t say that,” he said.\u003c/p\u003e\n\u003cp\u003e“But it’s so sweet. I hope you’re keeping them safe.” David nodded, but he didn’t know what he’d done with the last couple pieces—the paper-clip medal and the index-card diorama.\u003c/p\u003e\n\u003cp\u003e“I wish I could make things like that. I’m just not creative,” Lucy said.\u003c/p\u003e\n\u003cp\u003e“That’s not true,” David said, pointing to the wooden bunks,.\u003c/p\u003e\n\u003cp\u003e“You’re doing a great job here.”\u003c/p\u003e\n\u003cp\u003eLucy flitted her big eyes in that pretty-girl way that reminded David of Hilary.\u003c/p\u003e\n\u003cp\u003e“David,” she said, “industrious is not the same as creative.” And then, when she said something like that, David remembered how little Lucy was like Hilary. That seemed like the kind of worldly wisdom a grandmother might’ve wielded.\u003c/p\u003e\n\u003cp\u003eDavid had been learning a lot about Lucy over the past few weeks. She wasn’t just the delicate flower he’d thought she was when he saw her by the graduation booth.\u003c/p\u003e\n\u003cp\u003e“Oh! So I figured it out!” Lucy said as she stretched her arm up the railing and behind David’s thigh.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“What we were saying this morning . . . best slope in the Rockies? It’s Point Peak. Hands down.”\u003c/p\u003e\n\u003cp\u003eIn a gang of snowboarders, Lucy had discovered that she and David were the only skiers. David agreed, but he squinted his eyes and faked uncertainty. Her jaw dropped.\u003c/p\u003e\n\u003cp\u003e“Oh, my God!” Lucy said. “I can’t believe you even have to think about it! I’m right. You know I’m right.”\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003eLucy punched David in the chest, her mouth still agape. He nearly fell backward.\u003c/p\u003e\n\u003cp\u003e“Maybe?”\u003c/p\u003e\n\u003cp\u003eDavid laughed, “Easy! I gotta weigh all the factors. Besides, a guy’s entitled to his opinion, isn’t he?”\u003c/p\u003e\n\u003cp\u003e“Not when you’re wrong! David, even if there’s a double black diamond like it, nothing beats that view of the mountains. Nothing.” Then her eyes went wide, suddenly inspired.\u003c/p\u003e\n\u003cp\u003e“That’s where I’m going to visit tonight.”\u003c/p\u003e\n\u003cp\u003e“Visit?”\u003c/p\u003e\n\u003cp\u003e“Yeah, right when I close my eyes to go to sleep, I pick a place or a memory, and I try to hold on to it as long as I can.” Lucy closed her eyes and moved up another step, getting close to David. “I walk through every part of it. I look at every little detail. Until I fall asleep.”\u003c/p\u003e\n\u003cp\u003eShe opened her eyes and breathed in. “It helps keep away the nightmares.”\u003c/p\u003e\n\u003cp\u003eThe air between them felt hot. David’s room was only few stairs away. He had the third-floor landing all to himself, closed off from everyone by a pair of heavy blanket curtains.\u003c/p\u003e\n\u003cp\u003eOnce he was behind those curtains, no one could see him. He could bring Lucy in there, and they would have total privacy to do whatever they wanted.\u003c/p\u003e\n\u003cp\u003eWill’s laugh echoed up from the stairs below. It was sharp and had a malicious edge to it.\u003c/p\u003e\n\u003cp\u003e“I should . . . ,” David said, pointing back toward his room.\u003c/p\u003e\n\u003cp\u003e“Oh,” Lucy said, looking down. “Right.”\u003c/p\u003e\n\u003cp\u003eDavid didn’t look away though. He knew Will had a thing for her. But she was the hottest girl in the gang, and she wanted to flirt with him. How much could it hurt? He’d saved her life.\u003c/p\u003e\n\u003cp\u003e“I’ll see you on the slopes,” he said.\u003c/p\u003e\n\u003cp\u003e“I’ll wear something hot,” Lucy said.\u003c/p\u003e\n\u003cp\u003eShe blushed right afterward, then laughed and skipped down the stairs.\u003c/p\u003e\n\u003cp\u003eDavid climbed the last few stairs and ducked into his room, to sit down at last and eat his meat and oranges.\u003c/p\u003e\n\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eLUCY COULDN’T SLEEP. TRYING TO VISIT Point Peak in her mind had been a bust. She pictured every bit of it, every inch of her descent down the slope, but she couldn’t stop smelling the kids sleeping around her. She couldn’t ignore the hard stair against her back. No matter what she pictured, no matter how vivid, she couldn’t get there. She was stuck in the Stairs.\u003c/p\u003e\n\u003cp\u003eShe wanted to crawl up those fifteen stairs to David’s curtain door, past Belinda’s snoring, past the twins’ midnight murmurings, past the wet squelches coming from Gonzalo’s two-zipped-together sleeping bags, where his four foot ten girlfriend, Sasha, was somewhere inside, doing something that should’ve been done anywhere else but there. Lucy wanted disappear into David’s room, to be wrapped in his sturdy arms, feeling him.\u003c/p\u003e\n\u003cp\u003e“Wanna get out of here?” a voice whispered.\u003c/p\u003e\n\u003cp\u003eLucy looked to the landing below. Will stood amid the sleeping bodies that packed the floor. He stared up at her with a tilted smile. She sat up. He was up to something.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Lucy said.\u003c/p\u003e\n\u003cp\u003e“Out of the Stairs. Let’s go for a walk.”\u003c/p\u003e\n\u003cp\u003e“We can’t. David said no one leaves the Stairs in—”\u003c/p\u003e\n\u003cp\u003e“In groups of less than fifteen. I know what he said. But I’m losing my mind in here. I feel like I’m sleeping in a beehive.”\u003c/p\u003e\n\u003cp\u003e“I know the feeling,” she said.\u003c/p\u003e\n\u003cp\u003e“So come on.”\u003c/p\u003e\n\u003cp\u003eLucy stared at him. She shouldn’t. She should stay, keep on smelling her gang mates and twiddling her thumbs.\u003c/p\u003e\n\u003cp\u003e“It’ll be a thrill,” Will said, his smile getting wider.\u003c/p\u003e\n\u003cp\u003e“Just a short walk.”\u003c/p\u003e\n\u003cp\u003eWill held out his hand to her.\u003c/p\u003e\n\u003cp\u003eShe took it. He was right, it was a thrill. They moved together, totally in sync, tiptoeing between the slumber-ing bodies, down the next flight, past the lounge, past the kitchen, and down to the bottom landing, all without saying a word. Will quietly plucked a club from the armory, a broken flagpole with a big brass eagle on the end.\u003c/p\u003e\n\u003cp\u003eLeonard had fallen asleep on guard duty. For such a quiet person, he snored like an old lady. Will very carefully lifted the chain from the door. Every movement of his hand was controlled but quick. The door popped open with a soft click.\u003c/p\u003e\n\u003cp\u003eWill looked back to Lucy with a wiggle of his eyebrow. She knew this was stupid, so stupid. But it was fun. The air in the hall was warm and gross, but it felt so good to be out of the Stairs that she didn’t care.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” Will said, “I know my way around at night.” Lucy had never been walking at night. It felt sort of naughty.\u003c/p\u003e\n\u003cp\u003eShe strolled down the hall next to Will. It was odd, the halls were so quiet. Every tiny noise was amplified. Someone must have been hearing them.\u003c/p\u003e\n\u003cp\u003e“Are you just saying that to sound cool?” Lucy said.\u003c/p\u003e\n\u003cp\u003e“Nope, I’m out at night all the time.”\u003c/p\u003e\n\u003cp\u003e“What for?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Why shouldn’t I go out, if I feel like it?” Will said.\u003c/p\u003e\n\u003cp\u003e“You’re not scared?”\u003c/p\u003e\n\u003cp\u003e“Of what?” He said it so matter-of-factly, like being afraid was a waste of time and energy.\u003c/p\u003e\n\u003cp\u003eIt reminded her of they day they hiked up to Devil’s Spine. It was a narrow rock bridge. On either side was a seven-hundred-foot drop to a churning river below. Lucy was scared to death, everybody was. Chazz warned them that the extreme wind conditions meant that they would have to cross it on their hands and knees, but before he could finish his instructions, Will charged out onto the bridge. Lucy’s heart stopped—she was sure he was a goner. Chazz screamed after him to stop, but he didn’t. Will ran all the way to the other side and threw his hands up in victory. She’d never witnessed anything so daring in her life, and it turned her on. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-loners-quarantine-1/page-23.html","bookId":1722,"creation":"Oct 5, 2019 10:08:28 AM","modification":"Oct 5, 2019 10:08:28 AM"}
