{"id":68204,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe fat man’s eyes flicked over his control panel, then looked up, frightened.\u003c/p\u003e\n\u003cp\u003e“You are not eligible for release,” the fat man said.\u003c/p\u003e\n\u003cp\u003e“Sir, I hate to be argumentative, but you have to be mistaken,” Dickie said.\u003c/p\u003e\n\u003cp\u003eDickie gestured emphatically, causing the black glove to snap back and forth inside the cube. The fat man yelped, petrified, and pressed as much of his body he could manage against the back wall of the cube, as though he was trapped in a car with a cobra.\u003c/p\u003e\n\u003cp\u003e“Pardon me, would you mind fucking running the test again?” Dickie said. His voice slid up and down in pitch as he spoke.\u003c/p\u003e\n\u003cp\u003e“No! Get out of here!”\u003c/p\u003e\n\u003cp\u003eThe hallway of soldiers turned their guns on Dickie, while the others kept their aim on the crowd. Dickie didn’t seem to notice any of it. He was focused on the fat man.\u003c/p\u003e\n\u003cp\u003eDavid wished Dickie would just walk away.\u003c/p\u003e\n\u003cp\u003e“I’m just trying to talk to you like a human being, sir, I don’t need to be yelled at. If you simply called the Pentagon, they would tell you I’ve already negotiated this—”\u003c/p\u003e\n\u003cp\u003e“I said, go!” the fat man yelled.\u003c/p\u003e\n\u003cp\u003e“Get back, kid!” the commanding soldier barked. It seemed to snap Dickie into a larger awareness. He turned to see the whole school staring at him. Dickie looked back at them all with disgust. He focused on the fat man again.\u003c/p\u003e\n\u003cp\u003e“I’ll have you fired,” he said, and pulled his hand from the glove.\u003c/p\u003e\n\u003cp\u003eDickie turned and walked away from the cube. The glove mechanism whirred and spit Dickie’s glove lining out after him. The splat of the lining on the floor made Dickie’s face flinch.\u003c/p\u003e\n\u003cp\u003e“Next,” the fat man announced.\u003c/p\u003e\n\u003cp\u003eA Freak who was next in line strutted up to the cube and stuck his hand inside. The hole sealed around his wrist.\u003c/p\u003e\n\u003cp\u003eDickie spun around and dashed back toward the man in the box. A soldier fired a single shot. He missed Dickie and shot the Freak in the hip.\u003c/p\u003e\n\u003cp\u003eThe Freak howled. Dickie had no intention of stopping. He sprinted past the fat man and into the hallway of shields. The soldiers opened fire. Blood shot up over the shield line like a blender with the top off. What used to be Dickie fell to the ground, a mangled lump.\u003c/p\u003e\n\u003cp\u003eThe Freak still wailed, yanking and yanking at the glove that held him, fastened to the cube.\u003c/p\u003e\n\u003cp\u003e“Let go’a me! Let me loose!” the Freak yelled.\u003c/p\u003e\n\u003cp\u003eWith every yank, the cube shook, and the fat man screamed.\u003c/p\u003e\n\u003cp\u003eThe front line of soldiers fired on the Freak, executing him.\u003c/p\u003e\n\u003cp\u003eAll the Freaks went wild. Bobby led them in a mad rush on the cube. The Freaks barreled into it. The cube tipped over and crashed to the ground. Simultaneously, a surge of kids ran for the door.\u003c/p\u003e\n\u003cp\u003eThe soldiers’ roaring guns spit bullets into the heads, chests, and legs of the charging students. Blood sprayed in the air. Bodies flopped to the ground. Screams filled the room. The kids were screaming in pain and rage, the soldiers were screaming orders at each other, and the man in the cube screamed louder than anyone, his wheels spinning uselessly in the air.\u003c/p\u003e\n\u003cp\u003e“GET ME OUT OF HERE! PLEEEASE! GET ME OUT!” A few soldiers desperately tried to lift the cube back onto its wheels. They abandoned their effort and resorted to dragging the whole thing toward the metal door while the other soldiers’ guns coughed fire into the riot. Three kids took one soldier down to the ground. They clawed furiously at the back of his suit like dogs trying to dig under a fence. They tore rips into his suit, and within seconds his clear face mask flooded with blood and lung. Another Freak ran straight past the discombobulated crowd of soldiers and out the front doors.\u003c/p\u003e\n\u003cp\u003eDavid heard adults scream beyond the exit.\u003c/p\u003e\n\u003cp\u003eThe Loners were scattered by the chaos. David pushed Lucy toward the hall.\u003c/p\u003e\n\u003cp\u003e“Go! I’ll be right there!” David said.\u003c/p\u003e\n\u003cp\u003eLucy nodded, and David did one last scan of the foyer for any Loners who could have fallen behind. He didn’t see any.\u003c/p\u003e\n\u003cp\u003eHe turned right to run for the hall and smacked hard into someone on his blind side. He spiraled off the anonymous body and landed on the floor.\u003c/p\u003e\n\u003cp\u003eDavid scrambled to get up, machine guns blaring in his ears.\u003c/p\u003e\n\u003cp\u003eHe kept getting knocked back down; he couldn’t see anything on his right. When he finally got his bearings, he caught sight of a face staring at him through the mob. It belonged to Sam, who watched in fascination as David was helplessly smacked around.\u003c/p\u003e\n\u003cp\u003eThe twins dragged him away from crowd by his ankles.\u003c/p\u003e\n\u003cp\u003eIf David wanted to make an impression, the job was done.\u003c/p\u003e\n\u003cp\u003e28\u003c/p\u003e\n\u003cp\u003eWILL CLIMBED OUT OF A TRASH CAN.\u003c/p\u003e\n\u003cp\u003eSo far, he’d slept mostly in air ducts, some closets, and once in the second-floor girls’ bathroom in the East Wing. It had been stripped of its sinks, its mirrors, its stalls, and its toilets.\u003c/p\u003e\n\u003cp\u003eEven the tiles had been chipped out of the walls and floors.\u003c/p\u003e\n\u003cp\u003eHe lost sleep trying to think of what the thieves intended to do with those toilets.\u003c/p\u003e\n\u003cp\u003eLast night had been his first night in a trash can. It was a big one that must have been for the janitorial staff. He’d knocked on its side, emptied all the contents, and lined the inside with a clean trash bag from his sack. Inside, it was a little plastic cocoon. His legs stuck out, but he camouflaged them with trash.\u003c/p\u003e\n\u003cp\u003eIt sure left him stiff. He stood and cracked his back. He fished his backpack out of the trash can and looked through it. He had only one can of tuna left.\u003c/p\u003e\n\u003cp\u003eWill had taken a whole pack full of food with him from the Stairs, but not enough. He figured if he ran out of supplies, he could thieve in the market. But gangs hadn’t gathered in the market for a week, because the food drop never came.\u003c/p\u003e\n\u003cp\u003eHe knew the gunfire had something to do with it. He ran to the foyer that day to see what was happening and was almost spotted by Lucy and David when the Loners ran out. He hid. It still felt too soon to face them.\u003c/p\u003e\n\u003cp\u003eThe next day he watched from the third-floor balcony as the three kids who were supposed to graduate the day of the massacre tried the graduation booth over and over, but the doors never opened. They ended up coughing their lungs out on the foyer floor.\u003c/p\u003e\n\u003cp\u003eWill decided to save the tuna for later. He rummaged through his bag some more and pulled out a bottle of water, reinforced with layers of masking tape, and a pencil case. He opened the pencil case and pulled out a clean white toothbrush. Will set off down the hallway, dry-brushing his teeth and rinsing his mouth with slugs of water.\u003c/p\u003e\n\u003cp\u003eAbove him, the ceiling lights went out. Will looked up at the fluorescent light panels that ran the length of the hall.\u003c/p\u003e\n\u003cp\u003eThat’s weird, he said to himself.\u003c/p\u003e\n\u003cp\u003eThe lights were out all down the hall. He clicked on his phone to use it as a flashlight, and continued on.\u003c/p\u003e\n\u003cp\u003eThe hallway was wide and emptied into a small area that used to be a student lounge. Two vending machines, pillaged and bashed, were knocked over on the floor. The whole room was burned black, probably by a controlled burn that got out of hand, some moron burning furniture to make ash for black hair dye. No one came here anymore, and that was exactly why Will was here. It was the same reason he’d gone to the suicide room, the old student counselor’s office where four people had decided to kill themselves since the quarantine began. Will was searching through all of the places no one else went.\u003c/p\u003e\n\u003cp\u003eWill kept replaying in his head over and over the night it all went wrong, as if he thought he could change it. He’d whipped open the curtains. David was pinned to the floor, Hilary on top of him, a shiv raised. And then it all went black. When he came to, there was a lot of shouting. He was on the floor. His brother‘s face was painted with blood. Will thought he’d been slashed. Then David’s head rolled heavily toward him. His eye was destroyed.\u003c/p\u003e\n\u003cp\u003eWill couldn’t go back to the Stairs until he avenged his brother. There were only so many places Smudge could hide.\u003c/p\u003e\n\u003cp\u003eTraitor. It killed Will that he had been played so easily. He was sick and tired of losing. It was no wonder Lucy never took him seriously. He was an idiot. Smudge may have opened the door, but it was still Will’s fault. He’d put David in that situation because he couldn’t control himself. He’d never had any self-control.\u003c/p\u003e\n\u003cp\u003eHe knew he couldn’t make it right. David’s eye was gone for good. But he could make Smudge pay. Outside of his time with the Loners, Will only ever saw Smudge at night. Smudge lived on the fringe. The only people he associated with, other than Will, were thieves.\u003c/p\u003e\n\u003cp\u003eSo far, Will had struck out, but there was one last place to look.\u003c/p\u003e\n\u003cp\u003eA wicked smell stung his nose. Putrid flesh. A whole lot of it. He’d been here before, a long time ago, with David. It was the teachers’ graveyard, lockers upon lockers stuffed with corpses. Will quickly pulled a bandanna from his bag and wrapped it around his nose and mouth. He stomach was doing backflips. He took a small breath, only through his mouth. Will was entering the ruins, the decrepit East Wing of the school. There was talk that it was haunted by the ghosts of teachers and dead students. The stench only added to the atmosphere. No sane person belonged here. This had to be where Smudge was hiding.\u003c/p\u003e\n\u003cp\u003eWill climbed a staircase that had an enormous crack separating it in two all the way up to the next floor. By the light of his phone, Will saw the words KILL ME scrawled in what looked like dried blood across a wall of the next hallway. He hesitated before taking the final step up. He hated to admit it, but the ruins were freaking him out.\u003c/p\u003e\n\u003cp\u003eWill needed to calm down. He pulled a smut phone from his pocket. It barely had one bar left on its battery life. He’d found it in a desk drawer in a classroom overrun with flies. Some kid must have stashed it there to hide it from his girlfriend. The Nerds sold beat-up phones that were loaded with porn. They collected all the dirty pictures and videos they could find from laptops and phones that they charged or serviced. The photo was a girl he recognized, a Freak, and she was nude. She must have struck a deal with some enterprising Nerds, because there were tons more galleries of her on there.\u003c/p\u003e\n\u003cp\u003eThat’s one way to make some money, Will thought.\u003c/p\u003e\n\u003cp\u003eAll the hall lights flickered on ahead. They weren’t putting out their maximum wattage for some reason, and the quality of the light fluctuated.\u003c/p\u003e\n\u003cp\u003eA horrible noise came from far away. It was a gut-wrenching scream that slid into a deep belly laugh.\u003c/p\u003e\n\u003cp\u003eIt must have been one of the burnout kids who lived in the ruins. There was a small group that never could hack it in McKinley. They hid in the ruins, getting high off whatever chemicals were left from the science labs. The only time they ventured out of the ruins was at night, to rob people. Kids said their minds were gone, and they were just animals now. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-loners-quarantine-1/page-37.html","bookId":1722,"creation":"Oct 5, 2019 10:08:28 AM","modification":"Oct 5, 2019 10:08:28 AM"}
