{"id":68171,"no":4,"title":"Page 4","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“1807, right?”\u003c/p\u003e\n\u003cp\u003e“1807-E or 1807-W? I think you want E. That’s the East Wing.”\u003c/p\u003e\n\u003cp\u003e“What the hell, this place is ridiculous.” Mr. Meyer laughed, “Totally, but I guess we’re stuck with it.\u003c/p\u003e\n\u003cp\u003eThey gave us maps to hand out, lemme get you one.” Mr. Meyer got up and walked to his desk at the far end of the room.\u003c/p\u003e\n\u003cp\u003e“So, how was your summer, man?” he asked, and rummaged around his desk.\u003c/p\u003e\n\u003cp\u003eThe whole school shook.\u003c/p\u003e\n\u003cp\u003eA wretched noise erupted from the east end of the school. Books toppled off a shelf above Mr. Meyer and pummeled down onto him. David lost his balance and fell back against the door frame. There was screaming in the hallway.\u003c/p\u003e\n\u003cp\u003eA fog of black smoke plumed up the hall and enveloped him.\u003c/p\u003e\n\u003cp\u003eShrieking kids fled past David, running through the soot and airborne debris.\u003c/p\u003e\n\u003cp\u003eDavid hacked and coughed as he scrambled to his feet and away from the doorway. He scanned the room for Mr. Meyer.\u003c/p\u003e\n\u003cp\u003eThe teacher was lying on the floor with books scattered all over him. David ran over to help him up and grabbed his wrist. Mr. Meyer’s body spasmed. He vomited up a bloody mass. David jerked his hand away in shock. He met his teacher’s terrified eyes for an instant. Mr. Meyer tried to scream but made no noise.\u003c/p\u003e\n\u003cp\u003e“Stay back,” he mouthed silently.\u003c/p\u003e\n\u003cp\u003eMr. Meyer’s body clenched again, and a second bloody mess came hurling out of him. It sprayed David with a muddled stew of blood and clumps of organ and strings of sinew. Within seconds, Mr. Meyer was dead. There was so much blood. David’s legs buckled. He expected blood to come spewing out of his mouth too, but no vomit came. David’s mind raced. He started shouting, not even full words, just shouting at the top of his lungs.\u003c/p\u003e\n\u003cp\u003eKids were spilling into the classroom from the hallway.\u003c/p\u003e\n\u003cp\u003eThey were climbing over each other to get away from the east end of the school.\u003c/p\u003e\n\u003cp\u003eEvery student he saw -- their hair was falling off in clumps.\u003c/p\u003e\n\u003cp\u003eDavid reached up and painlessly pulled a handful of hair right off his head. He rubbed the hair between his fingers, trying to process what was happening.\u003c/p\u003e\n\u003cp\u003eWhere was Will? David shot up to his feet.. He barreled into the hallway and lunged through a crowd of students, fighting the current toward the hallway intersection where he’d parted ways with Will. Kids were running so fast at David that it was all he could do to just hold on to the door frame and not get swept away in the flow of bodies.\u003c/p\u003e\n\u003cp\u003eA hand planted firmly on his shoulder. David turned sharply to see Will looking back at him, his eyes frenzied.\u003c/p\u003e\n\u003cp\u003e“We gotta get out of here,” Will shouted.\u003c/p\u003e\n\u003cp\u003eWill was completely bald, and it was a jarring sight. If his brother hadn’t found him, David didn’t know if he would have even recognized him.\u003c/p\u003e\n\u003cp\u003eDavid pulled Will close. “Are you okay?”\u003c/p\u003e\n\u003cp\u003e“I think so. What the hell’s going on?”\u003c/p\u003e\n\u003cp\u003eDavid didn’t have an answer. All he knew was that he had to get the two of them to safety. He tried to keep a tight grip on Will, but the surging river of bodies kept separating them.\u003c/p\u003e\n\u003cp\u003eEach time he lost hold of Will, David had to fight the current to make it back to him. It took them ten minutes to make it to the three-story front foyer that led to the parking lot. Bald kids rushed out of the front entrance of the school. Everyone screamed, pushing and pulling to be the next ones out, but the crowd was bottlenecked again at the front doors. David and Will tried to force their way forward, but the crowd was too thick.\u003c/p\u003e\n\u003cp\u003eDavid was straining to see an escape route over the kids in front of him when the glass of the entryway shattered with an odd series of pops. Then there were more. Pop-pop-pop!\u003c/p\u003e\n\u003cp\u003eA piece of white brick exploded from the wall behind David.\u003c/p\u003e\n\u003cp\u003eHe yanked Will behind one of the six wide pillars that ran the full height of the foyer.\u003c/p\u003e\n\u003cp\u003e“What was that?” Will shouted at him.\u003c/p\u003e\n\u003cp\u003e“Somebody’s shooting at us!” David said.\u003c/p\u003e\n\u003cp\u003eDavid peered around the pillar and saw the front lawn outside. A line of soldiers was advancing up the hill with assault rifles drawn. They fired on the fleeing kids. David recognized one of them, a kid who’d been in Mr. Meyer’s English class last year. He was dashing right at the line of soldiers. When the kid got three feet from the line, the two soldiers nearest to him coughed out geysers of blood and dropped dead, just like Mr. Meyer.\u003c/p\u003e\n\u003cp\u003e“Oh, my God,” David muttered. Will was looking out at the scene now too. David pushed him back behind the pillar again.\u003c/p\u003e\n\u003cp\u003eOut on the lawn, some lucky students made it to the tree line and disappeared into the woods. The unlucky ones got mowed down by a fresh wave of soldiers, who kept a much larger distance between themselves and the school.\u003c/p\u003e\n\u003cp\u003e“They’re going to kill us,” Will said.\u003c/p\u003e\n\u003cp\u003eDavid grasped his brother’s shoulders and said with as much authority as he could muster, “Everything’s gonna be okay. Okay?”\u003c/p\u003e\n\u003cp\u003eWill nodded, but he didn’t look convinced.\u003c/p\u003e\n\u003cp\u003eThe gunshots stopped. Kids were taking cover now and screaming at the soldiers, pleading to be let out. The soldiers held their ground and kept their guns trained on the students. An amplified voice echoed from a PA somewhere outside.\u003c/p\u003e\n\u003cp\u003e“All students: remain inside the school! It is not safe for you to leave at this time. Stay back!”\u003c/p\u003e\n\u003cp\u003eStay back. Those were the same terrified words Mr. Meyer mouthed at David before he died. And they were the last words any of them heard from the outside for months.\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eIT WAS TWO WEEKS LATER. DAVID HELD MR. Meyer’s ankles; Will walked in silence by his side. They both wore wet rags tied over their mouths and noses. The smell of rotting meat was overpowering. David looked down the ruined hall. He still had to drag Mr. Meyer’s corpse another thirty yards.\u003c/p\u003e\n\u003cp\u003eThe lights above were mostly broken; half of the lockers were bent and warped from the impact of the explosion. The hallway ended where the collapsed ceiling formed a dead end of rubble. There was no more school beyond that. The mysterious explosion had amputated the rest of the East Wing, and this hallway was one of the stumps that remained.\u003c/p\u003e\n\u003cp\u003eDavid was sweating. Mr. Meyer was heavier than he’d expected. Will had offered to help, but David wouldn’t let him.\u003c/p\u003e\n\u003cp\u003eHe felt responsible for Mr. Meyer. David was with the man in his last moments, and that felt like it meant something. His corpse made a dull hiss as it scraped against the fractured tiles of the floor. David refused to look down; he couldn’t bear the sight of his old teacher’s rotten, bloated face.\u003c/p\u003e\n\u003cp\u003eThe teachers had started to smell. Every adult in the school had died the same way Mr. Meyer did. Now there were hundreds of stewing, bloated corpses scattered across the building. The students decided as a whole that they needed to do something about it. They couldn’t wait any longer for outside help. There had been no contact with the outside since the day of the explosion, since the military had held them at bay, then welded every exit shut and covered the quad with a translucent, gray plasticlike canopy. No one had been able to get a signal on their cell phones, the landlines were dead, and the Internet was down. The thousand or so students locked inside were going to have to deal with their problems themselves.\u003c/p\u003e\n\u003cp\u003eDragging a corpse across the school was nasty business.\u003c/p\u003e\n\u003cp\u003eBut at least it kept the nagging questions at bay. What the hell happened to them that day? Why did it happen? And what was going to happen to them next? Those were the things that David wouldn’t let himself think about. The kids who did dwell on those mysteries drove themselves crazy.\u003c/p\u003e\n\u003cp\u003eThey ended up wailing in the halls like lunatics, pleading for answers.\u003c/p\u003e\n\u003cp\u003e“Fuckin’ stinks,” Will said.\u003c/p\u003e\n\u003cp\u003eDavid looked over to Will. He had white stubble growing all over his head. He looked like an elderly marine. Every student’s hair had begun to grow back, all of it white. Something bad had happened to their bodies. They were altered. Sick.\u003c/p\u003e\n\u003cp\u003e“I know this sounds crazy,” Will said, “but this isn’t that different from Wild-Trek.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah?” David said. He’d heard this already but was happy to go through the routine again. Anything to keep Will’s mood from spiraling down.\u003c/p\u003e\n\u003cp\u003e“It’s just a challenge we have to face. If we dig deep and push past our limits, we’ll make it,” Will said.\u003c/p\u003e\n\u003cp\u003e“I think you’re right.”\u003c/p\u003e\n\u003cp\u003eWill’s voice sounded more hollow than usual. It upset David that, each day, Will’s speech lost a little more volume, a little more conviction. At this point, it was less like a conversation and more like Will was reciting a prayer.\u003c/p\u003e\n\u003cp\u003e“To keep a lamp burning, you have to keep putting oil in it.\u003c/p\u003e\n\u003cp\u003eYou know who said that?”\u003c/p\u003e\n\u003cp\u003e“Mother Teresa,” David said.\u003c/p\u003e\n\u003cp\u003e“Yeah, Mother Teresa,” Will said. A loud metallic klang made Will flinch.\u003c/p\u003e\n\u003cp\u003eBehind them in the hall, a tiny white-haired kid with raw, red knuckles sat against a dented locker with his head in his hands. Will’s eyes lingered on him. David was afraid he was losing Will.\u003c/p\u003e\n\u003cp\u003e“But you’re right, it’s the same situation,” David said. “It’s just a challenge.”\u003c/p\u003e\n\u003cp\u003eDavid readjusted his grip on the cold flesh of Mr. Meyer’s ankles and shuddered.\u003c/p\u003e\n\u003cp\u003e“It is the same, except . . . ,” Will said.\u003c/p\u003e\n\u003cp\u003e“Except what?”\u003c/p\u003e\n\u003cp\u003e“Except I don’t know when this situation is going to end.” David dragged Mr. Meyer over to two seniors who stood by an open locker. They wore rags over their mouths, and they had duct-taped their shirtsleeves closed so their hands wouldn’t have to touch the dead bodies.\u003c/p\u003e\n\u003cp\u003eThe seniors lifted Mr. Meyer without a word. They tried not to look at the body while they pushed it into the open locker and shut the door. They sealed up the vents and the seams of the locker with duct tape, to keep the stink in. A lock went on as a last step. David led Will back down the hallway and tried to ignore that the walls were stuffed with dead teachers.\u003c/p\u003e\n\u003cp\u003eDavid and Will lay in the quad. They’d been locked up for almost a month. Electricity and running water still flowed.\u003c/p\u003e\n\u003cp\u003eThey had heat. It meant that they weren’t entirely forgotten, but it was a small consolation when there was no food left.\u003c/p\u003e\n\u003cp\u003eThe cafeteria had been picked clean. They were all starving.\u003c/p\u003e\n\u003cp\u003eDavid thought he knew what it meant to be hungry. He was wrong. This wasn’t peckish, this wasn’t stomach-growling, this was a transformative, gnawing hunger. He felt as though his brain was shriveling. His eyes would lose focus, his mouth was perpetually dry. He felt mean, like a rabid dog. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-loners-quarantine-1/page-4.html","bookId":1722,"creation":"Oct 5, 2019 10:08:28 AM","modification":"Oct 5, 2019 10:08:28 AM"}
