{"id":68208,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe tried to find the door. He couldn’t. The sounds of battle thrashed all around him. He could feel the cage move.\u003c/p\u003e\n\u003cp\u003e“It’s David! They’ve got me in the cage!” But the battle noises and the glow of the torches faded as the cage was pulled out of the commons. The cage jostled him around. He dug his fingers through the irregular gaps in the cage walls and yanked, but nothing gave.\u003c/p\u003e\n\u003cp\u003eThere was the sound of doors being kicked open behind David. He spun around just as the cage was dragged into a lit room. He charged the other end of the cage to face his cap-tors and instead saw Nelson.\u003c/p\u003e\n\u003cp\u003eNelson dropped the steering handle of the cage and looked up at David with a goofy smile. He strained to catch his breath. David stared at him, totally confused.\u003c/p\u003e\n\u003cp\u003e“Did you see that? I took the cage right out of their hands! I gotta go back and help,” he said.\u003c/p\u003e\n\u003cp\u003eNelson ran back toward the commons. David shook the cage.\u003c/p\u003e\n\u003cp\u003e“Nelson! No! Don’t leave me here! Nelson!” Nelson didn’t hear him. He disappeared back through the double doors to the commons.\u003c/p\u003e\n\u003cp\u003e“Are you kidding me?” David yelled to no one.\u003c/p\u003e\n\u003cp\u003eHe was in another foyer, another open space that used to be a second entrance to the school. The Skaters must have pulled a fuse in the commons because the lights were still on in this foyer, and David was in plain sight. Anyone could happen across him. There was a price on his head, and he was alone, locked in a cage on wheels. This wasn’t good.\u003c/p\u003e\n\u003cp\u003eDavid slumped to the cloth floor of the cage.\u003c/p\u003e\n\u003cp\u003eHe pulled his hair in frustration. He stared out into the foyer. Three quarters of the far wall was plastered over with sheets of painted butcher paper that together formed an enormous mural.\u003c/p\u003e\n\u003cp\u003e“What the hell?” he said.\u003c/p\u003e\n\u003cp\u003eIt was a heroic portrait of David with a sea of white-haired Loners behind him, and a wide-open cobalt-blue sky overhead. The mural wasn’t finished. Butcher paper sheets that had yet to be glued to the wall were scattered on the floor below. Dorothy lay dead upon them.\u003c/p\u003e\n\u003cp\u003e32\u003c/p\u003e\n\u003cp\u003eLUCY HID UNDER THE STAIRCASE AS the battle with the Skaters neared its end. She clutched a length of pipe in her hand, but there was no point. She was too afraid to use it. She’d never seen a battle like this. It wasn’t like the drops. It was more cutthroat.\u003c/p\u003e\n\u003cp\u003eShe dared to peer out at the madness. There was a large fire in the center of room where the Loners once were. Someone had set a broken-down couch ablaze. Silhouettes tangled in the fire’s light. The first face she recognized was Will’s.\u003c/p\u003e\n\u003cp\u003eHe slashed at a Skater with a knife, and the Skater dropped the board he was wielding. With a clean kick, Will shot the skateboard across to Ritchie, who stomped it in two. Ritchie snatched up the two pieces and chucked them in the fire.\u003c/p\u003e\n\u003cp\u003eAll around the circle, Loners were stripping Skaters of their boards whenever they had the chance and sending them to Ritchie for destruction. The Skaters clutched their remaining boards to their chests and began to retreat into the shadows. Soon they were gone altogether. When the battle was over, Will led the Loners out of the commons in the direction of the ruins.\u003c/p\u003e\n\u003cp\u003eLucy waited until they had all passed before sliding out from under the staircase. The fire crackled in the center of the room. It was the only sound that remained. She felt like such a coward, but she didn’t know what else to do. She followed their path but paused in front of the doors to the foyer.\u003c/p\u003e\n\u003cp\u003eLucy looked down at herself. Her dress was clean, she had no cuts or bruises on her arms, she clearly had not participated in the battle. She couldn’t bring herself to open the doors.\u003c/p\u003e\n\u003cp\u003eLucy bent down and rubbed her hands across the dirty floor.\u003c/p\u003e\n\u003cp\u003eShe wiped the filth on her face and dress, then reached down and ripped her dress to her thigh.\u003c/p\u003e\n\u003cp\u003eShe took a breath and stumbled into the foyer. She expected everyone to be looking at her, watching her. They weren’t, not even David. They were standing in a circle around something.\u003c/p\u003e\n\u003cp\u003eShe saw it all so fast. David was crying. A giant portrait of him was on the wall. Dorothy’s body. It was too much.\u003c/p\u003e\n\u003cp\u003eShe went to David’s side. He stared up at the mural.\u003c/p\u003e\n\u003cp\u003e“She fell off the ladder,” David said.\u003c/p\u003e\n\u003cp\u003eA twenty-foot construction ladder lay by Dorothy’s body.\u003c/p\u003e\n\u003cp\u003eDavid wiped the tears off his cheek.\u003c/p\u003e\n\u003cp\u003e“We’re going to give her a proper funeral,” David said.\u003c/p\u003e\n\u003cp\u003e“We don’t have time,” Will objected.\u003c/p\u003e\n\u003cp\u003e“We’ll make time. Help me lift her into the cage.” David, Will, and Ritchie picked Dorothy up and placed her gently into the Skaters’ rolling cage. Lucy took David’s hand; she wanted to be close to him. She wanted him to smother the insecurity flaring up inside her. David pulled hard on her hand and whipped her behind him. Over his shoulder she saw that Zachary and the Geeks had entered the foyer. The Loners picked up their weapons.\u003c/p\u003e\n\u003cp\u003eThere were about twenty of them, lightly armed, and they stumbled into a clumsy formation behind Zachary when they saw the Loners. They looked liked they’d happened upon a stickup and it was too late to walk back out of the bank. The Geeks quickly drew what weapons they had.\u003c/p\u003e\n\u003cp\u003eDavid walked forward, putting his hands up to show he meant no harm. Will motioned for the Loners to keep close to David.\u003c/p\u003e\n\u003cp\u003e“Zachary, what’s up?”\u003c/p\u003e\n\u003cp\u003eZachary relaxed and smiled at David.\u003c/p\u003e\n\u003cp\u003e“We heard there was a mural. I wanted to see it for myself.\u003c/p\u003e\n\u003cp\u003eIt’s . . . kind of unbelievable.”\u003c/p\u003e\n\u003cp\u003eLucy watched David closely. He wasn’t looking at Zachary anymore. He was studying the Geeks. Most of them were from the art clique. They had paint on their clothes and X-Acto knife cuts on their fingers. Zachary stared at Dorothy’s body.\u003c/p\u003e\n\u003cp\u003eHis head was bowed, and his expression was grave.\u003c/p\u003e\n\u003cp\u003e“Do you mind if I. . .?” Zachary gestured toward the mural, and David shrugged.\u003c/p\u003e\n\u003cp\u003eZachary walked away from the Geeks to a central spot in front of the mural. He was quiet for a while.\u003c/p\u003e\n\u003cp\u003e“It’s really something, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“It is,” David said.\u003c/p\u003e\n\u003cp\u003e“I don’t suppose you’d be all right with it if my people changed it to my face, would you? I’d probably keep the eye patch,” Zachary said with a wink.\u003c/p\u003e\n\u003cp\u003eDavid smiled and shook his head. “I like it the way it is.”\u003c/p\u003e\n\u003cp\u003e“I want you to know I don’t condone this bounty on your head business. Sam is a pig.”\u003c/p\u003e\n\u003cp\u003e“I agree.”\u003c/p\u003e\n\u003cp\u003e“Somebody’s got to take a stand against that guy. I think we should join forces.”\u003c/p\u003e\n\u003cp\u003eZachary pointed toward a far corner, signaling that they should talk privately. David nodded in response.\u003c/p\u003e\n\u003cp\u003e“How badly do you want out of this school?” David asked.\u003c/p\u003e\n\u003cp\u003eZachary shoved David. David stumbled on his blind side, his foot tangled with the rungs of the construction ladder, and he fell to the ground. Zachary pounced on him.\u003c/p\u003e\n\u003cp\u003eWill and five others broke into a run to intercede, but Zachary was already behind David, his fingers in his hair. Zachary pulled David up by the head, produced a knife, and held it to David’s throat.\u003c/p\u003e\n\u003cp\u003eLucy choked with dread. She could almost feel the knife at her own throat, its sharp edge denting her skin.\u003c/p\u003e\n\u003cp\u003e“Stay back!” Zachary yelled at her. He sidestepped toward the Geeks, pulling David with him.\u003c/p\u003e\n\u003cp\u003e“I’m gonna kill you,” Will snapped at Zachary.\u003c/p\u003e\n\u003cp\u003e“Will, back off!” David shouted. He lowered his voice to talk to Zachary. “Hey, man, this is the wrong move. You aren’t a fighter.”\u003c/p\u003e\n\u003cp\u003e“Shudup, David. You don’t know what I am.” David stomped Zachary’s foot. Zachary cried out in pain.\u003c/p\u003e\n\u003cp\u003eDavid pushed the knife away and elbowed Zachary in the face.\u003c/p\u003e\n\u003cp\u003eDavid twisted Zachary’s hand behind his back and pried the knife out. It was hardly a fair fight. Zachary was instantly overwhelmed by David’s strength. David pressed the knife to Zachary’s neck.\u003c/p\u003e\n\u003cp\u003eThe Geeks charged David but stopped a dozen feet short.\u003c/p\u003e\n\u003cp\u003eThe Loners piled in around him, weapons out.\u003c/p\u003e\n\u003cp\u003e“Come on,” Belinda said, pulling Lucy in with the Loners.\u003c/p\u003e\n\u003cp\u003e“We’re getting out of here.” Belinda stopped cold. She narrowed her eyes at one of the Geek girls with curly locks dyed a rich auburn.\u003c/p\u003e\n\u003cp\u003e“That’s my hair!” Belinda said.\u003c/p\u003e\n\u003cp\u003eThe Geeks were shouting at the Loners, and the Loners were shouting back. David raised his voice above all the noise.\u003c/p\u003e\n\u003cp\u003e“Move out of the way. We’re walking out of here!” He waved for the Geeks to clear a path. They didn’t budge.\u003c/p\u003e\n\u003cp\u003e“MOVE!” David shouted again. “You want me to kill him?\u003c/p\u003e\n\u003cp\u003eHuh? I’ll run this piece of metal right through his brain! You want him to be another Brad?”\u003c/p\u003e\n\u003cp\u003eSome of the Geeks moved, but others stared David down.\u003c/p\u003e\n\u003cp\u003e“Tell ’em, Zachary,” David said. “You really want to die today?”\u003c/p\u003e\n\u003cp\u003e“Do what he says,” Zachary finally said, and the Geeks parted.\u003c/p\u003e\n\u003cp\u003eDavid pushed Zachary toward the hall the Geeks had come from. Nelson dragged the rolling Skater cage. The Loners flanked the cage, and the Geeks kept a five-foot distance on all sides. Will and the twins brought up the rear. Belinda had one arm looped through Lucy’s. She felt Belinda’s arm slip out. Belinda lunged forward and snatched the Geek girl’s auburn hair right off her head. It was a wig. The girl’s hair was white underneath, and she covered her head and ran off, embarrassed.\u003c/p\u003e\n\u003cp\u003e“Get your own hair!” Belinda said.\u003c/p\u003e\n\u003cp\u003eBelinda pulled the wig over her head and rejoined the Loners. They all backed up through the double doors to the hallway. The twins shut the doors, and Will stuck a pipe through the door handles. It would hold for a little bit. He turned away from the door and locked eyes with Lucy. His gaze fell to her neck where the diamond pendant still hung.\u003c/p\u003e\n\u003cp\u003eHe hurried past her.\u003c/p\u003e\n\u003cp\u003e“Will, wait a minute,” she said, but he ignored her.\u003c/p\u003e\n\u003cp\u003e“Get in,” David said from behind her.\u003c/p\u003e\n\u003cp\u003eLucy turned to see David holding open the door to the cage, the same cage that housed Dorothy’s corpse. Zachary shook his head in disbelief at David.\u003c/p\u003e\n\u003cp\u003e“David, get real. I can’t get in there. She’s dead.” David gripped his forehead suddenly and closed his eyes.\u003c/p\u003e\n\u003cp\u003eHe cringed. He looked like he was in serious pain. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-loners-quarantine-1/page-41.html","bookId":1722,"creation":"Oct 5, 2019 10:08:28 AM","modification":"Oct 5, 2019 10:08:28 AM"}
