{"id":68209,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You should’ve thought about that before you pulled a knife on me,” David said. “Now, get in!”\u003c/p\u003e\n\u003cp\u003e“You’re an actor,” Ritchie said. “Act like she’s Paul’s new girlfriend and snuggle up.”\u003c/p\u003e\n\u003cp\u003eZachary climbed in, grumbling.\u003c/p\u003e\n\u003cp\u003e“I’ll let you out when we get to Freak territory,” David said.\u003c/p\u003e\n\u003cp\u003e“You’ve got my word. Now I want yours. If any of your Geeks try to get in our way, you call ’em off.” Zachary nodded but kept his eyes down.\u003c/p\u003e\n\u003cp\u003e“I want to hear you say it,” David said.\u003c/p\u003e\n\u003cp\u003e“You have my word.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” David said as he closed the door.\u003c/p\u003e\n\u003cp\u003eZachary kept his word. At every hallway intersection, in every classroom door, there were Geeks waiting for them, now heavily armed. Every time, Zachary motioned for them to stand down. Lucy could see that Zachary was in misery, utterly shamed in front of his own gang. What would happen to him once he was returned to the Geeks? It seemed too easy for people to turn on one another these days.\u003c/p\u003e\n\u003cp\u003eShe looked ahead to Will, again at David’s side. She wanted to clear the air.\u003c/p\u003e\n\u003cp\u003e“Will,” Lucy said, hurrying to his side, “I shouldn’t have kept this.”\u003c/p\u003e\n\u003cp\u003eShe began to unfasten the necklace. He gave it a glance, then looked ahead.\u003c/p\u003e\n\u003cp\u003e“Keep it. What am I going to do with it?” Lucy lowered her hands, leaving the necklace in place.\u003c/p\u003e\n\u003cp\u003eDavid turned and shouted back down the line, “Ritchie, come up here and swap with Will!”\u003c/p\u003e\n\u003cp\u003eWill looked at David, upset, “What are you doing? I’ve got this.”\u003c/p\u003e\n\u003cp\u003e“I need you watching for Geeks coming up the rear. Lucy, will you help him?”\u003c/p\u003e\n\u003cp\u003eWill sighed and walked back. Lucy gave David a thankful little nod. She caught up with Will.\u003c/p\u003e\n\u003cp\u003e“You can’t avoid me forever,” she said.\u003c/p\u003e\n\u003cp\u003e“I think I can.”\u003c/p\u003e\n\u003cp\u003e“I can be pretty annoying.”\u003c/p\u003e\n\u003cp\u003eWill stopped. “What do you want from me?”\u003c/p\u003e\n\u003cp\u003e“I want to make it up to you. I don’t want to lose our friendship.”\u003c/p\u003e\n\u003cp\u003e“I can’t be friends with you.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because”—he hushed his voice as Ritchie hustled past—“because I loved you. Real sorry, but I can’t go back from that. You can be as annoying or cute or whatever as you want, but it’s not going to change anything. When we get to the outside, I don’t really want to see you again.” Will walked away.\u003c/p\u003e\n\u003cp\u003e“Looks like somebody saddled the wrong horse.” Lucy looked over to Zachary rolling along beside her, in the cage. He was sitting cross-legged, his hands draped over the bars. He watched Will walk to the back of the line and relieve Ritchie.\u003c/p\u003e\n\u003cp\u003e“What?” Lucy said.\u003c/p\u003e\n\u003cp\u003e“You know, one of my best friends was supposed to graduate last week. She got migraines just before she started losing her marbles. She was holding her head just like David’s been doing up there. He’s dying, isn’t he?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Clearly a lie. You’re a very bad actor. Do you want a tip? The key to a good lie is—”\u003c/p\u003e\n\u003cp\u003e“I don’t want anything from you. David’s always been a friend to you. How could you do what you did?”\u003c/p\u003e\n\u003cp\u003e“Hold on, honey. David and I are friendly. Not the same. My friends are going to starve if I don’t find a way to feed them.\u003c/p\u003e\n\u003cp\u003eWould you do any different?”\u003c/p\u003e\n\u003cp\u003eLong wrinkles cracked his cheeks. She hadn’t realized how emaciated he looked before, but now she was closer. Stage makeup was caked on his face, but it couldn’t hide the droop in the skin under his eyes or the hollows under his cheek-bones.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t do what you did,” Lucy said.\u003c/p\u003e\n\u003cp\u003e“Oh, I’m just a bad person, is that it? Nobody knows what they’ll do till it happens. What are you gonna do when David’s dead on the floor? Are you going to fight?” He looked her up and down. “’Cause, honey, I think you’ll run,” Zachary said. He pulled his arms back through the cage and turned away.\u003c/p\u003e\n\u003cp\u003eDavid wasn’t going to die. They were going to get out. She and David would be able to go to the lake house and live the dream she . . . Lucy stopped herself. No, she realized. It couldn’t happen that way. By tomorrow, David wouldn’t be immune to the virus anymore. He’d have to stay as far from her and any other teenager as he could. Once they were on the outside, Lucy would have to make her way with Will . . . no, not Will, he’d sworn her off. She’d have to make her way with Belinda, living where? Not with her parents. She was toxic to them as well. She and Belinda and whoever else was with them would have to live on the run until they phased out of infection. That would mean years before she could be in the same room with David again. Years without being touched by him. Could she wait for David? Could he wait for her? She didn’t know the answer. The brutal truth crept into her head: She might not ever see David again after today. She felt alone, as though she’d been kicked out of the Pretty Ones all over again, and thrown to the animals.\u003c/p\u003e\n\u003cp\u003eWhen the gang reached Freak territory, David opened the cage and made good on his word. He let Zachary go.\u003c/p\u003e\n\u003cp\u003e“We didn’t know Dorothy was a brave girl, but she showed us different. Sure, she made mistakes. We all have in here. But what’s important is that she kept trying,” David said.\u003c/p\u003e\n\u003cp\u003eDavid looked at all the Loners surrounding the cage where Dorothy lay. He strained to squeeze out his thoughts, and his head pounded.\u003c/p\u003e\n\u003cp\u003e“This place has forced us to make a lot of decisions that we shouldn’t have to make. And sometimes, doing the right thing just brings you more misery. You start to wonder if there’s any point to trying at all. Dorothy’s mural reminded me of when I stood in the quad with eight people behind me, facing all of Varsity. I was sure I was dead. But you all saved me. You came to my defense, and together we overcame. We can do it again. We’re gonna get out of here. We’ve still got trouble ahead, and when we make it outside these walls, who knows what’ll be going on. It could be worse out there than we ever saw in here.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but we’ll be free,” Will said.\u003c/p\u003e\n\u003cp\u003e“And there’ll be food courts,” Belinda said.\u003c/p\u003e\n\u003cp\u003e“And fresh underwear,” Mort said.\u003c/p\u003e\n\u003cp\u003e“And cars. I just want to drive. Like a road trip, across the country,” Sasha said.\u003c/p\u003e\n\u003cp\u003e“And new movies,” Josh said.\u003c/p\u003e\n\u003cp\u003e“And parades,” Leonard said.\u003c/p\u003e\n\u003cp\u003e“Parades? What the hell are you talking about?” Ritchie said.\u003c/p\u003e\n\u003cp\u003e“If I want to see a parade, what do you care?” Leonard said.\u003c/p\u003e\n\u003cp\u003e“David’s trying to say something nice, you guys,” Lucy said.\u003c/p\u003e\n\u003cp\u003e“And hamsters,” the girl twin said.\u003c/p\u003e\n\u003cp\u003e“And sledgehammers,” the boy twin said.\u003c/p\u003e\n\u003cp\u003eEveryone stared at the twins. They twirled each other’s hair.\u003c/p\u003e\n\u003cp\u003eLucy took David’s hand. “What you said, David. It was beautiful.”\u003c/p\u003e\n\u003cp\u003e“We’re going to get out of here,” David told all of them.\u003c/p\u003e\n\u003cp\u003eThey lifted Dorothy’s body and walked it to an open locker.\u003c/p\u003e\n\u003cp\u003eThey gently hoisted her into her metal coffin. David put his hand on the door.\u003c/p\u003e\n\u003cp\u003e“Dorothy, we won’t forget you.”\u003c/p\u003e\n\u003cp\u003e33\u003c/p\u003e\n\u003cp\u003eTHE LONERS CROSSED THE LINE INTO WHAT once was the humanities department. Now it was Freak territory. He needed to be spry and alert, but David was seeing things.\u003c/p\u003e\n\u003cp\u003eFirst, it was the mural. He saw clouds drift across the painted sky. Then it was Dorothy. As he closed the locker door, he saw tears drop from her eyes. Neither of these things was possible. He didn’t realize it would start this fast.\u003c/p\u003e\n\u003cp\u003eDavid knew what happened to kids who missed their graduation. They stopped making sense. They would lose track of a conversation, then they stopped talking to anybody altogether. And finally, they started talking to people who weren’t there. They all cracked in the end.\u003c/p\u003e\n\u003cp\u003eIt was happening to him now, but he couldn’t let anyone know. They were depending on him. Will sidled up to David.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” Will asked.\u003c/p\u003e\n\u003cp\u003e“Nothing. I’m just worried about the Freaks.” It didn’t look like Will bought it, but it wasn’t untrue. David didn’t want any trouble with the Freaks. They already hated the Loners. Sam’s ransom was just the cherry on top. When they happened upon two Freak guards, Will and the twins snuck ahead, pounced on them with knives, and threatened to kill them if they made a sound. They dragged the guards off to be bound and gagged and locked away in the nearest classroom closet. The rest of the Loners watched from a distance.\u003c/p\u003e\n\u003cp\u003eDavid kept seeing thin, dark fingers flickering at the edge of his vision. He kept thinking someone was standing behind him and reaching over his shoulder. He looked back and saw Lucy.\u003c/p\u003e\n\u003cp\u003e“What?” she said softly.\u003c/p\u003e\n\u003cp\u003eI’m losing my mind.\u003c/p\u003e\n\u003cp\u003e“Nothing,” he said. Lucy was depending on him too. He waved the Loners forward.\u003c/p\u003e\n\u003cp\u003eDavid looked through the open door of a classroom beside him. He didn’t see a classroom. He saw a clean, white hospital room. He could faintly hear the monotonous beep of a heart monitor. He could see someone’s arm, an IV taped to it. A curtain was drawn halfway so he couldn’t see the person’s face.\u003c/p\u003e\n\u003cp\u003eThe harder he strained to see a face, the dimmer the room got until what he saw before him was a dilapidated classroom, but with the hospital room still hanging there, transparent, a suggestion of a room.\u003c/p\u003e\n\u003cp\u003e“David, we should go,” he heard Lucy whisper.\u003c/p\u003e\n\u003cp\u003eAll he had to do was get everyone through Freak territory. Once they were on the other side, it was a short trip to the ruins. As long as they could navigate to room 1206, they could find their way to the outside. The longer he took, the less immunity he’d have against the fatal pheromones that everyone around him emitted. The less immunity he had, the more fevered his mind would become until the hallucinations drove him insane, and the meat of his lungs would unspool inside his chest.\u003c/p\u003e\n\u003cp\u003eDavid was dying, and it was his friends who were killing him.\u003c/p\u003e\n\u003cp\u003eDavid walked away from the hazy hospital room. They hooked a right into a wide hallway. The ceiling lights were burned out for the first few yards. After that, the hallway was barely lit for a hundred feet, where it ended in a T-junction. The last bit of power from the generator barely coursed through the building’s wiring. David led the Loners through the darkened section and into the pulsing light. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-loners-quarantine-1/page-42.html","bookId":1722,"creation":"Oct 5, 2019 10:08:28 AM","modification":"Oct 5, 2019 10:08:28 AM"}
