{"id":68175,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHis body was lean and wiry, and apparently it was working on the ladies.\u003c/p\u003e\n\u003cp\u003e“Will,” David said with a grin.\u003c/p\u003e\n\u003cp\u003eThe mouth-mashers separated, their lips still wet. David had to stifle a laugh; he knew the girl, she was Weird Peggy.\u003c/p\u003e\n\u003cp\u003eScratch that big brother pride he’d just felt. Peggy was David’s year, and she used to come to school every day in an old top hat, the same one that lay at her feet at the moment.\u003c/p\u003e\n\u003cp\u003eShe prided herself on being as unique as possible, but David never really thought she had a choice. Grooming, normal conversation, and pauses that weren’t painfully awkward were all things beyond her capabilities. He would have been more impressed if he found Will making out with his own shoe.\u003c/p\u003e\n\u003cp\u003e“Oh. Wow, I didn’t know you two were together,” David said.\u003c/p\u003e\n\u003cp\u003eWeird Peggy brightened at the notion.\u003c/p\u003e\n\u003cp\u003e“We’re not, we’re nothing,” Will said.\u003c/p\u003e\n\u003cp\u003eWeird Peggy held a frown for a moment then shrugged, put her top hat back on, and ambled away.\u003c/p\u003e\n\u003cp\u003e“After everything that’s been destroyed, why did that hat have to survive?” David said.\u003c/p\u003e\n\u003cp\u003eWill said nothing. He wiped his white mop of hair from his brow, shoveled his loot from the drop onto his threadbare sheet, and bundled it together into a sack. Will stood and avoided David’s eyes.\u003c/p\u003e\n\u003cp\u003e“So . . . Peggy?” David said.\u003c/p\u003e\n\u003cp\u003e“Lay off it.”\u003c/p\u003e\n\u003cp\u003e“Hey, I think it’s great you have girlfriend—”\u003c/p\u003e\n\u003cp\u003e“She’s not my—you listen, you’re not allowed to give me shit about this,” Will said.\u003c/p\u003e\n\u003cp\u003e“I don’t know . . . see, I kind of feel another comment coming on.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah? Sure about that? Then I guess you don’t want any of this then.”\u003c/p\u003e\n\u003cp\u003eWill produced a plastic jar from his sack with an inch and a half of creamy peanut butter at the bottom of it. David could almost smell the nuttiness through the jar. Thick, oily, and dense but still dripping, oozing. Pure fat packed together with so much body it might as well have been meat. He imagined it coating his mouth, working its way between his teeth, a gorgeous, glistening glue spreading its sweet butter over the back of his tongue and leaving a film that would linger on his taste buds for days.\u003c/p\u003e\n\u003cp\u003e“You traded for this?” David asked.\u003c/p\u003e\n\u003cp\u003e“Guilty,” Will said with a smile.\u003c/p\u003e\n\u003cp\u003eWill popped the jar back in his sack and strutted away.\u003c/p\u003e\n\u003cp\u003eDavid remained under the peanut butter’s enchantment for a moment, before he caught up with Will.\u003c/p\u003e\n\u003cp\u003e“What did you trade, a testicle?”\u003c/p\u003e\n\u003cp\u003eFifteen minutes later, David pulled his tools from a rolling backpack and laid them out on a towel on the crusted bathroom floor: the new detergent, two buckets of soapy water, one ripped yellow dishwashing glove, three toothbrushes for heavy stains, a penknife for gunk, a plunger handle, an eyedropper, chalk dust for grease, salt for blood, and a soda bottle of ammonia. David took a bundle of white clothes out of the backpack and plunged it into one of the buckets. He agitated the garments with the plunger handle.\u003c/p\u003e\n\u003cp\u003eLaundry was David’s daily routine. It wasn’t what he wanted to do; nothing about it was fun, and there was no end to it. It was what he had to do to keep them alive; this was his job.\u003c/p\u003e\n\u003cp\u003eNaturally, Will did nothing to help. He did push-ups in the corner. Again.\u003c/p\u003e\n\u003cp\u003e“If you’re not watching the door, help me wash,” David said.\u003c/p\u003e\n\u003cp\u003e“I’m watchin’ it.”\u003c/p\u003e\n\u003cp\u003e“You’re staring at the floor.”\u003c/p\u003e\n\u003cp\u003eWill groaned.\u003c/p\u003e\n\u003cp\u003e“What good does it do anyway? Not like there’s a back exit,” Will said. He sprang to his feet. “If a gang finds us, they’ll jump us. If they don’t, they won’t.”\u003c/p\u003e\n\u003cp\u003e“Right, right. If we starve, then we starve, why worry?” Will stayed silent. He interlocked his fingers behind his back and stretched his chest.\u003c/p\u003e\n\u003cp\u003e“Do something for once. Humor me,” David said.\u003c/p\u003e\n\u003cp\u003e“On it,” Will said. He flexed his triceps at himself in the mirror.\u003c/p\u003e\n\u003cp\u003eDavid sighed, Will was never going to learn. He bore down on a brown stain, scrubbing the blouse’s fabric into itself and grinding in the gritty salt.\u003c/p\u003e\n\u003cp\u003e“When I graduate,” David said, “you’re not gonna have anybody to mooch off of.”\u003c/p\u003e\n\u003cp\u003eWill rolled his eyes.\u003c/p\u003e\n\u003cp\u003e“You’re gonna need a trade. Lemme teach you my system.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to learn your system.”\u003c/p\u003e\n\u003cp\u003eBut he sure loved eating the system this bought.\u003c/p\u003e\n\u003cp\u003e“You gonna flex for food?” David said.\u003c/p\u003e\n\u003cp\u003e“I’ll come up with something. Something good.”\u003c/p\u003e\n\u003cp\u003e“One person can’t survive off only what they get at the drops. You’re not Gonzalo.”\u003c/p\u003e\n\u003cp\u003e“Whatever I do,” Will said, “it won’t be washing blood out of other people’s clothes.”\u003c/p\u003e\n\u003cp\u003eDavid stood, squared his shoulders to Will. Tossed the garment aside.\u003c/p\u003e\n\u003cp\u003e“Hey,” David said, “Straight up. I want you to answer me.” Will tensed up, ready to defend himself.\u003c/p\u003e\n\u003cp\u003e“Was it the top hat that turned you on?” David said.\u003c/p\u003e\n\u003cp\u003eWill managed a laugh, but he was still keyed up.\u003c/p\u003e\n\u003cp\u003e“Yeah, fine. Fine. I hooked up with Weird Peggy,” Will said.\u003c/p\u003e\n\u003cp\u003e“You happy? It’s your fault.”\u003c/p\u003e\n\u003cp\u003e“Interesting. Explain that to me.”\u003c/p\u003e\n\u003cp\u003e“Tell me who I’m supposed to date. Can’t date girls in gangs.\u003c/p\u003e\n\u003cp\u003eAnd that’s pretty much every girl. Off limits. Whose fault is that?”\u003c/p\u003e\n\u003cp\u003eHe didn’t say it like a joke; his words had teeth. He wondered if Will would ever forgive him for the life they had to lead.\u003c/p\u003e\n\u003cp\u003e“So,” Will continued, “there’s Scraps. Weird little losers scattered through the school, hiding in their holes, probably eating their shoes, and hoping no one hits them that day.\u003c/p\u003e\n\u003cp\u003eThat’s who I get to pick from. Thanks.”\u003c/p\u003e\n\u003cp\u003eWill returned to the corner and dropped to the floor to knock out reps. David’s desire to win the argument died somewhere during Will’s speech. David faced himself in the mirror. He examined his white hair, the stained clothes in his hands, the filthy bathroom behind him; it was just nasty enough that no one else would want to use it, a place where David could feel safe that no mob of kids would wander in and rob him. He could handle these indignities for the handful of months he had left. But he knew Will couldn’t, he knew Will wouldn’t try. And he was scared of what Will would try when David was no longer around.\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eTHE WET CLOTHES WERE HUNG UP TO DRY where no one would find them, and David’s dry deliveries were folded and packed into his bag, ready to be exchanged for food and essentials. Will and David stood at the mouth of the bustling market.\u003c/p\u003e\n\u003cp\u003eIt was a wide hallway, with classrooms on either side. Each gang transformed their own room into a trading post, in which they offered their particular goods and services. The floor was marred with dirt, tracked in from the quad. All the ceiling lights worked, a rarity in McKinley. Other than in the trading rooms, the gangs did not mix. Each stayed with their own and traveled in large groups from room to room until their shopping was done.\u003c/p\u003e\n\u003cp\u003eDavid had deliveries to make to the Geeks and the Sluts. He strode into the market, with Will a step behind. A surly group of Skaters stepped out of a classroom and crossed the hall in front of him. A pack of Freaks crossed too, from the other direction, making it tough for David and Will to pass. David got a good whiff of the toilet bowl cleaner they used to dye their hair blue. He’d never understand how they could live with the chemical smell.\u003c/p\u003e\n\u003cp\u003eThe two groups slowed as they passed each other. They bared their teeth, cracked their necks, and walked far too close to be friendly. One Freak’s face was badly busted up. He shoved a Skater. Both gangs tensed for a fight. David watched the Skater. If he attacked, David knew both gangs would go at it. He recognized the kid, Jason he thought his name was.\u003c/p\u003e\n\u003cp\u003eDavid remembered that Jason and the busted-up Freak were really tight before the quarantine; they always ate lunch together, just the two of them. Jason spit at the Freak and walked away. His gang followed him. David relaxed.\u003c/p\u003e\n\u003cp\u003eHe and Will approached the guard outside of the Geeks’\u003c/p\u003e\n\u003cp\u003etrading post. The guard had his hair died in multicolored stripes.\u003c/p\u003e\n\u003cp\u003e“Laundry for Zachary,” David said.\u003c/p\u003e\n\u003cp\u003eThe guard nodded them in. There were tables of drawings from art Geeks on offer, all too expensive unless you were a Varsity or a Pretty One. A girl with caramel skin sat on a stool and sang her own take on a ballad that was on top of the charts right before the quarantine. A bucket drummer and a kid with a three-string guitar accompanied her. David watched her rock her hips back and forth slower than pouring honey as she pushed out the high notes. All the Geeks dyed their hair black with charcoal as a foundation, then added touches of loud color by dying sections of their hair or weaving colored things through it. They dressed in bright colors as well, with carefully chosen items of individual flair.\u003c/p\u003e\n\u003cp\u003eAs a group, they were boisterous, bawdy, and generally hard to miss, which was probably the point. They wanted all eyes on them.\u003c/p\u003e\n\u003cp\u003eBut no one commanded as much attention as their leader, Zachary. He wore a cape. It was made out of two school flags sewn together and slathered with gold poster paint. That would have won the battle for attention right there, but he was the only boy in school to buy the wigs the Pretty Ones sold. Today his hair was long white braids, with ribbons of brightly colored paper woven through them.\u003c/p\u003e\n\u003cp\u003e“David!” Zachary said and clutched David’s hand melodra-matically. “I knew you’d come.”\u003c/p\u003e\n\u003cp\u003e“Got your laundry here.”\u003c/p\u003e\n\u003cp\u003e“Why are you really here? Let’s talk about that.”\u003c/p\u003e\n\u003cp\u003e“Laundry.”\u003c/p\u003e\n\u003cp\u003e“You tease and you tease.” Zachary squinted at David and smiled. “That’s probably why our first kiss will be so electric.”\u003c/p\u003e\n\u003cp\u003e“More likely, that would be a taser I’m hitting you with,” David said with a smile, and pulled a stack of Zachary’s clean clothes out of his rolling bag.\u003c/p\u003e\n\u003cp\u003eZachary chuckled, loving it. “You could be an actor, David.\u003c/p\u003e\n\u003cp\u003eThink about it. I’ll write a scene for us. It could be in the next Geek show.”\u003c/p\u003e\n\u003cp\u003e“I’m shy,” David said with a grin. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-loners-quarantine-1/page-8.html","bookId":1722,"creation":"Oct 5, 2019 10:08:28 AM","modification":"Oct 5, 2019 10:08:28 AM"}
