{"id":62956,"no":12,"title":"Page 12","content":"\u003cp\u003eMy ex-wife Anita. Chance, the pimp who\u0027d killed Kim Dakkinen. And somebody named Faber. I didn\u0027t know anybody named Faber, unless he was some drunk who\u0027d become a long-lost buddy during my drunken wanderings.\u003c/p\u003e\n\u003cp\u003eI discarded the slip with his number and weighed a trip downstairs against the hassle of placing a call through the hotel operator. If I hadn\u0027t poured out the bourbon I might have had a drink just about then. Instead I went downstairs and called Anita from the lobby booth.\u003c/p\u003e\n\u003cp\u003eIt was a curious conversation. We were carefully polite, as we often are, and after we\u0027d circled one another like first-round prizefighters she asked me why I\u0027d called. \"I\u0027m just returning your call,\" I said. \"I\u0027m sorry it took me awhile.\"\u003c/p\u003e\n\u003cp\u003e\"Returning my call?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a message that you called Monday.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. Then she said, \"Matt, we spoke Monday night. You called me back. Don\u0027t you remember?\"\u003c/p\u003e\n\u003cp\u003eI felt a chill, as if someone had just scraped a piece of chalk on a blackboard. \"Of course I remember,\" I said. \"But how did this slip get back in my box? I thought you\u0027d called a second time.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"I must have dropped the message slip and then some helpful idiot returned it to my box, and it got handed to me just now and I thought it was another call.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what must have happened.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I said. \"Anita, I\u0027d had a couple drinks when I spoke to you the other night. My memory\u0027s a little vague. You want to remind me what we talked about in case there\u0027s anything I forgot?\"\u003c/p\u003e\n\u003cp\u003eWe had talked about orthodontia for Mickey. I\u0027d told her to get another opinion. I remembered that part of the conversation, I assured her. Was there anything else? I had said I was hoping to send more money soon, a more substantial contribution than I\u0027d made lately, and paying for the kid\u0027s braces shouldn\u0027t be any problem. I told her I remembered that part, too, and she said that was about all, except that of course I\u0027d talked to the children. Oh, sure, I told her. I remembered my conversation with the boys. And that was all? Well, then, my memory wasn\u0027t so bad after all, was it?\u003c/p\u003e\n\u003cp\u003eI was shaking when I hung up the phone. I sat there and tried to summon up a memory of the conversation she had just described and it was hopeless. Everything was a blank from the moment just before the third drink Sunday night to the time I\u0027d come out of it in the hospital. Everything, all of it, gone.\u003c/p\u003e\n\u003cp\u003eI tore up the message slip, tore it in half again, put the scraps in my pocket. I looked at the other message. The number Chance had left was his service number. I called Midtown North instead. Durkin wasn\u0027t in but they gave me his home number.\u003c/p\u003e\n\u003cp\u003eHe sounded groggy when he answered. \"Gimme a second, lemme light a cigarette,\" he said. When he came back on the line he sounded all right. \"I was watching teevee,\" he said, \"and I went and fell asleep in front of the set. What\u0027s on your mind, Scudder?\"\u003c/p\u003e\n\u003cp\u003e\"That pimp\u0027s been trying to reach me. Chance.\"\u003c/p\u003e\n\u003cp\u003e\"Trying to reach you how?\"\u003c/p\u003e\n\u003cp\u003e\"By phone. He left a number for me to call. His answering service. So he\u0027s probably in town, and if you want me to set him up-\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not looking for him.\"\u003c/p\u003e\n\u003cp\u003eFor an awful moment I thought I must have spoken to Durkin during my blackout, that one of us had called the other and I didn\u0027t remember it. But he went on talking and I realized that hadn\u0027t happened.\u003c/p\u003e\n\u003cp\u003e\"We had him over at the station house and we sweated him,\" he explained. \"We put out a pickup order but he wound up coming in on his own accord. He had a slick lawyer with him and he was pretty slick himself.\"\u003c/p\u003e\n\u003cp\u003e\"You let him go?\"\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t have one damn thing to hold him on. He had an alibi for the whole stretch from several hours before the estimated time of death to six or eight hours after. The alibi looks solid and we haven\u0027t got anything to stack up against it. The clerk who checked Charles Jones into the Galaxy can\u0027t come up with a description. I mean he can\u0027t say for sure if the man he signed in was black or white. He sort of thinks he was white. How\u0027d you like to hand that to the D.A.?\"\u003c/p\u003e\n\u003cp\u003e\"He could have had someone else rent the room. Those big hotels, they don\u0027t keep any track of who goes in and out.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right. He could have had someone rent the room. He also could have had someone kill her.\"\u003c/p\u003e\n\u003cp\u003e\"Is that what you figure he did?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t get paid to figure. I know we haven\u0027t got a case against the son of a bitch.\"\u003c/p\u003e\n\u003cp\u003eI thought for a moment. \"Why would he call me?\"\u003c/p\u003e\n\u003cp\u003e\"How would I know?\"\u003c/p\u003e\n\u003cp\u003e\"Does he know I steered you to him?\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t hear it from me.\"\u003c/p\u003e\n\u003cp\u003e\"Then what does he want with me?\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you ask him yourself?\"\u003c/p\u003e\n\u003cp\u003eIt was warm in the booth. I cracked the door, let a little air in. \"Maybe I\u0027ll do that.\"\u003c/p\u003e\n\u003cp\u003e\"Sure. Scudder? Don\u0027t meet him in a dark alley, huh? Because if he\u0027s got some kind of a hard-on for you, you want to watch your back.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"And if he does nail you, leave a dying message, will you? That\u0027s what they always do on television.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see what I can do.\"\u003c/p\u003e\n\u003cp\u003e\"Make it clever,\" he said. \"but not too clever, you know? Keep it simple enough so I can figure it out.\"\u003c/p\u003e\n\u003cp\u003eI dropped a dime and called his service. The woman with the smoker\u0027s rasp to her voice said, \"Eight-oh-nine-two. May I help you?\"\u003c/p\u003e\n\u003cp\u003eI said, \"My name\u0027s Scudder. Chance called me and I\u0027m returning his call.\"\u003c/p\u003e\n\u003cp\u003eShe said she expected to be speaking to him soon and asked for my number. I gave it to her and went upstairs and stretched out on the bed.\u003c/p\u003e\n\u003cp\u003eA little less than an hour later the phone rang. \"It\u0027s Chance,\" he said. \"I want to thank you for returning my call.\"\u003c/p\u003e\n\u003cp\u003e\"I just got the message an hour or so ago. Both of the messages.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to speak with you,\" he said. \"Face to face, that is.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m downstairs, I\u0027m in your lobby. I thought we could get a drink or a cup of coffee in the neighborhood. Could you come down?\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eHe said, \"You still think I killed her, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"What does it matter what I think?\"\u003c/p\u003e\n\u003cp\u003e\"It matters to me.\"\u003c/p\u003e\n\u003cp\u003eI borrowed Durkin\u0027s line. \"Nobody pays me to think.\"\u003c/p\u003e\n\u003cp\u003eWe were in the back booth of a coffee shop a few doors from Eighth Avenue. My coffee was black. His was just a shade lighter than his skin tone. I\u0027d ordered a toasted English muffin, figuring that I probably ought to eat something, but I hadn\u0027t been able to bring myself to touch it.\u003c/p\u003e\n\u003cp\u003eHe said, \"I didn\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"I have what you might call an alibi in depth. A whole roomful of people can account for my time that night. I wasn\u0027t anywhere near that hotel.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s handy.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that supposed to mean?\"\u003c/p\u003e\n\u003cp\u003e\"Whatever you want it to mean.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re saying I could have hired it done.\"\u003c/p\u003e\n\u003cp\u003eI shrugged. I felt edgy, sitting across the table from him, but more than that I felt tired. I wasn\u0027t afraid of him.\u003c/p\u003e\n\u003cp\u003e\"Maybe I could have. But I didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"If you say so.\"\u003c/p\u003e\n\u003cp\u003e\"God damn,\" he said, and drank some of his coffee. \"She anything more to you than you let on that night?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Just a friend of a friend?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me, and his gaze was like a too-bright light shining in my eyes. \"You went to bed with her,\" he said. Before I could respond he said, \"Sure, that\u0027s what you did. How else would she say thank you? The woman only spoke one language. I hope that wasn\u0027t the only compensation you got, Scudder. I hope she didn\u0027t pay the whole fee in whore\u0027s coin.\"\u003c/p\u003e\n\u003cp\u003e\"My fees are my business,\" I said. \"Anything that happened between us is my business.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I\u0027m just getting a fix on where you\u0027re coming from, that\u0027s all.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not coming from anyplace and I\u0027m not going anywhere. I did a piece of work and I was paid in full. The client\u0027s dead and I didn\u0027t have anything to do with that and it doesn\u0027t have anything to do with me. You say you had nothing to do with her death. Maybe that\u0027s true and maybe it isn\u0027t. I don\u0027t know and I don\u0027t have to know and I don\u0027t honestly give a damn. That\u0027s between you and the police. I\u0027m not the police.\"\u003c/p\u003e\n\u003cp\u003e\"You used to be.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027m not anymore. I\u0027m not the police and I\u0027m not the dead girl\u0027s brother and I\u0027m not some avenging angel with a flaming sword. You think it matters to me who killed Kim Dakkinen? You think I give a damn?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eI looked at him.\u003c/p\u003e\n\u003cp\u003eHe said, \"Yes, I think it matters to you. I think you care who killed her. That\u0027s why I\u0027m here.\" He smiled gently. \"See,\" he said, \"what I want is to hire you, Mr. Matthew Scudder. I want you to find out who killed her.\"\u003c/p\u003e\n\u003cp\u003eI took a while before I believed he was serious. Then I did what I could to talk him out of it. If there was any kind of trail leading to Kim\u0027s killer, I told him, the police had the best chance of finding and following it. They had the authority and the manpower and the talent and the connections and the skills. I had none of the above.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re forgetting something,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t be looking. Far as they\u0027re concerned, they already know who killed her. They got no evidence so they can\u0027t do anything with it, but that\u0027s their excuse not to kill themselves trying. They\u0027ll say, \u0027Well, we know Chance killed her but we can\u0027t prove it so let\u0027s work on something else.\u0027 God knows they got plenty other things to work on. And if they did work on it, all they\u0027d be looking for is some way to hang it onto me. They wouldn\u0027t even look to see if there\u0027s somebody else on earth with a reason for wanting her dead.\"\u003c/p\u003e\n\u003cp\u003e\"Like who?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what you would be looking to find out.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"For money,\" he said, and smiled again. \"I wasn\u0027t asking you to work for free. I have a lot of money coming in, all of it cash. I can pay a good fee.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not what I meant. Why would you want me on the case? Why would you want the killer found, assuming I had any chance of finding him? It\u0027s not to get you off the hook because you\u0027re not on the hook. The cops haven\u0027t got a case against you and they\u0027re not likely to come up with one. What\u0027s it to you if the case stays on the books as unsolved?\"\u003c/p\u003e\n\u003cp\u003eHis gaze was calm, steady. \"Maybe I\u0027m concerned about my reputation,\" he suggested.\u003c/p\u003e\n\u003cp\u003e\"How? It looks to me as though your reputation gets a boost. If the word on the street is that you killed her and got away with it, the next girl who wants to quit your string is going to have something else to think about. Even if you didn\u0027t have anything to do with her murder, I can see where you\u0027d be just as happy to take the credit for it.\"\u003c/p\u003e\n\u003cp\u003eHe flicked his index finger a couple times against his empty coffee cup. He said, \"Somebody killed a woman of mine. Nobody should be able to do that and get away with it.\"\u003c/p\u003e\n\u003cp\u003e\"She wasn\u0027t yours when she got killed.\"\u003c/p\u003e\n\u003cp\u003e\"Who knew that? You knew it and she knew it and I knew it. My other girls, did they know? Did the people in the bars and on the street know? Do they know now? Far as the world knows, one of my girls got killed and the killer\u0027s getting away with it.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/eight-million-ways-to-die-matthew-scudder-5/page-12.html","bookId":2323,"creation":"Oct 5, 2019 9:49:25 AM","modification":"Oct 5, 2019 9:49:25 AM"}
