{"id":62949,"no":5,"title":"Page 5","content":"\u003cp\u003eHe said, \"You remember Lou Rudenko? Louie the Hat, they call him,\" I said I did. \"You hear about his mother?\"\u003c/p\u003e\n\u003cp\u003e\"What about her?\"\u003c/p\u003e\n\u003cp\u003e\"Nice old Ukrainian lady, still lived in the old neighborhood on East Ninth or Tenth, wherever it was. Been a widow for years. Must have been seventy, maybe closer to eighty. Lou\u0027s got to be what, fifty?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t matter. Point is this nice little old lady has a gentleman friend, a widower the same age as she is. He\u0027s over there a couple nights a week and she cooks Ukrainian food for him and maybe they go to a movie if they can find one that doesn\u0027t have people fucking all over the screen. Anyway, he comes over one afternoon, he\u0027s all excited, he found a television set on the street. Somebody put it out for the garbage. He says people are crazy, they throw perfectly good things away, and he\u0027s handy at fixing things and her own set\u0027s on the fritz and this one\u0027s a color set and twice the size of hers and maybe he can fix it for her.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"And he plugs it in and turns it on to see what happens, and what happens is it blows up. He loses an arm and an eye and Mrs. Rudenko, she\u0027s right in front of it when it goes, she\u0027s killed instantly.\"\u003c/p\u003e\n\u003cp\u003e\"What was it, a bomb?\"\u003c/p\u003e\n\u003cp\u003e\"You got it. You saw the story in the paper?\"\u003c/p\u003e\n\u003cp\u003e\"I must have missed it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it was five, six months ago. What they worked out was somebody rigged the set with a bomb and had it delivered to somebody else. Maybe it was a mob thing and maybe it wasn\u0027t, because all the old man knew was what block he picked the set up on, and what does that tell you? Thing is, whoever received the set was suspicious enough to put it right out with the garbage, and it wound up killing Mrs. Rudenko. I saw Lou and it was a funny thing because he didn\u0027t know who to get mad at. \u0027It\u0027s this fucking city,\u0027 he told me. \u0027It\u0027s this goddamn fucking city.\u0027 But what sense does that make? You live in the middle of Kansas and a tornado comes and picks your house up and spreads it over Nebraska. That\u0027s an act of God, right?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what they say.\"\u003c/p\u003e\n\u003cp\u003e\"In Kansas God uses tornadoes. In New York he uses gaffed television sets. Whoever you are, God or anybody else, you work with the materials at hand. You want another Coke?\"\u003c/p\u003e\n\u003cp\u003e\"Not right now.\"\u003c/p\u003e\n\u003cp\u003e\"What can I do for you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m looking for a pimp.\"\u003c/p\u003e\n\u003cp\u003e\"Diogenes was looking for an honest man. You have more of a field to choose from.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m looking for a particular pimp.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re all particular. Some of them are downright finicky. Has he got a name?\"\u003c/p\u003e\n\u003cp\u003e\"Chance.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, sure,\" Danny Boy said. \"I know Chance.\"\u003c/p\u003e\n\u003cp\u003e\"You know how I can get in touch with him?\"\u003c/p\u003e\n\u003cp\u003eHe frowned, picked up his empty glass, put it down. \"He doesn\u0027t hang out anywhere,\" he said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I keep hearing.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the truth. I think a man should have a home base. I\u0027m always here or at Poogan\u0027s. You\u0027re at Jimmy Armstrong\u0027s, or at least you were the last I heard.\"\u003c/p\u003e\n\u003cp\u003e\"I still am.\"\u003c/p\u003e\n\u003cp\u003e\"See? I keep tabs on you even when I don\u0027t see you. Chance. Let me think. What\u0027s today, Thursday?\"\u003c/p\u003e\n\u003cp\u003e\"Right. Well, Friday morning.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get technical. What do you want with him, if you don\u0027t mind the question?\"\u003c/p\u003e\n\u003cp\u003e\"I want to talk to him.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know where he is now but I might know where he\u0027ll be eighteen or twenty hours from now. Let me make a call. If that girl shows up, order me another drink, will you? And whatever you\u0027re having.\"\u003c/p\u003e\n\u003cp\u003eI managed to catch the waitress\u0027s eye and told her to bring Danny Boy another glass of vodka. She said, \"Right. And another Coke for you?\"\u003c/p\u003e\n\u003cp\u003eI\u0027d been getting little drink urges off and on ever since I sat down and now I got a strong one. My gorge rose at the thought of another Coke. I told her to make it ginger ale this time. Danny Boy was still on the phone when she brought the drinks. She put the ginger ale in front of me and the vodka on his side of the table. I sat there and tried not to look at it and my eyes couldn\u0027t find anywhere else to go. I wished he would get back to the table and drink the damn thing.\u003c/p\u003e\n\u003cp\u003eI breathed in and breathed out and sipped my ginger ale and kept my hands off his vodka and eventually he came back to the table. \"I was right,\" he said. \"He\u0027ll be at the Garden tomorrow night.\"\u003c/p\u003e\n\u003cp\u003e\"Are the Knicks back? I thought they were still on the road.\"\u003c/p\u003e\n\u003cp\u003e\"Not the main arena. Matter of fact I think there\u0027s some rock concert. Chance\u0027ll be at the Felt Forum for the Friday night fights.\"\u003c/p\u003e\n\u003cp\u003e\"He always goes?\"\u003c/p\u003e\n\u003cp\u003e\"Not always, but there\u0027s a welterweight named Kid Bascomb at the top of the prelim card and Chance has an interest in the young man.\"\u003c/p\u003e\n\u003cp\u003e\"He owns a piece of him?\"\u003c/p\u003e\n\u003cp\u003e\"Could be, or maybe it\u0027s just an intellectual interest. What are you smiling at?\"\u003c/p\u003e\n\u003cp\u003e\"The idea of a pimp with an intellectual interest in a welter-weight.\"\u003c/p\u003e\n\u003cp\u003e\"You never met Chance.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not the usual run.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the impression I\u0027m getting.\"\u003c/p\u003e\n\u003cp\u003e\"Point is, Kid Bascomb\u0027s definitely fighting, which doesn\u0027t mean Chance\u0027ll definitely be there, but I\u0027d call it odds on. You want to talk to him, you can do it for the price of a ticket.\"\u003c/p\u003e\n\u003cp\u003e\"How will I know him?\"\u003c/p\u003e\n\u003cp\u003e\"You never met him? No, you just said you didn\u0027t. You wouldn\u0027t recognize him if you saw him?\"\u003c/p\u003e\n\u003cp\u003e\"Not in a fight crowd. Not when half the house is pimps and players.\"\u003c/p\u003e\n\u003cp\u003eHe thought about it. \"This conversation you\u0027re going to have with Chance,\" he said. \"Is it going to upset him a lot?\"\u003c/p\u003e\n\u003cp\u003e\"I hope not.\"\u003c/p\u003e\n\u003cp\u003e\"What I\u0027m getting at, is he likely to have a powerful resentment against whoever points him out?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see why he should.\"\u003c/p\u003e\n\u003cp\u003e\"Then what it\u0027s going to cost you, Matt, is the price of not one but two tickets. Be grateful it\u0027s an off-night at the Forum and not a title bout at the Main Garden. Ringside shouldn\u0027t be more than ten or twelve dollars, say fifteen at the outside. Thirty dollars at the most for our tickets.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re coming with me?\"\u003c/p\u003e\n\u003cp\u003e\"Why not? Thirty dollars for tickets and fifty for my time. I trust your budget can carry the weight?\"\u003c/p\u003e\n\u003cp\u003e\"It can if it has to.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry I have to ask you for money. If it were a track meet I wouldn\u0027t charge you a cent. But I\u0027ve never cared for boxing. If it\u0027s any consolation, I\u0027d want at least a hundred dollars to attend a hockey game.\"\u003c/p\u003e\n\u003cp\u003e\"I guess that\u0027s something. You want to meet me there?\"\u003c/p\u003e\n\u003cp\u003e\"Out in front. At nine- that should give us plenty of leeway. How does that sound?\"\u003c/p\u003e\n\u003cp\u003e\"Fine.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see if I can\u0027t wear something distinctive,\" he said, \"so that you\u0027ll have no trouble recognizing me.\"\u003c/p\u003e\n\u003cp\u003eChapter 4\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t hard to recognize. His suit was a dove gray flannel and with it he wore a bright red vest over a black knit tie and another white dress shirt. He had sunglasses on, dark lenses in metal frames. Danny Boy contrived to sleep when the sun was out- neither his eyes nor his skin could take it- and wore dark glasses even at night unless he was in a dimly lit place like Poogan\u0027s or the Top Knot. Years ago he\u0027d told me that he wished the world had a dimmer switch and you could just turn the whole thing down a notch or two. I remember thinking at the time that that was what whiskey did. It dimmed the lights and lowered the volume and rounded the corners.\u003c/p\u003e\n\u003cp\u003eI admired his outfit. He said, \"You like the vest? I haven\u0027t worn it in ages. I wanted to be visible.\"\u003c/p\u003e\n\u003cp\u003eI already had our tickets. The ringside price was $15. I\u0027d bought a pair of $4.50 seats that would have put us closer to God than to the ring. They got us through the gate, and I showed them to an usher down front and slipped a folded bill into his hand. He put us in a pair of seats in the third row.\u003c/p\u003e\n\u003cp\u003e\"Now I might have to move you gentlemen,\" he said, \"but probably not, and I guarantee you ringside.\"\u003c/p\u003e\n\u003cp\u003eAfter he\u0027d moved off Danny Boy said, \"There\u0027s always a way, isn\u0027t there? What did you give him?\"\u003c/p\u003e\n\u003cp\u003e\"Five dollars.\"\u003c/p\u003e\n\u003cp\u003e\"So the seats set you back fourteen dollars instead of thirty. What do you figure he makes in a night?\"\u003c/p\u003e\n\u003cp\u003e\"Not much on a night like this. When the Knicks or Rangers play he might make five times his salary in tips. Of course he might have to pay somebody off.\"\u003c/p\u003e\n\u003cp\u003e\"Everybody\u0027s got an angle,\" he said.\u003c/p\u003e\n\u003cp\u003e\"It looks that way.\"\u003c/p\u003e\n\u003cp\u003e\"I mean everybody. Even me.\"\u003c/p\u003e\n\u003cp\u003eThat was my cue. I gave him two twenties and a ten. He put the money away, then took his first real look around the auditorium. \"Well, I don\u0027t see him,\" he said, \"but he\u0027ll probably just show for the Bascomb fight. Let me take a little walk.\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\"\u003c/p\u003e\n\u003cp\u003eHe left his seat and moved around the room. I did some looking around myself, not trying to spot Chance but getting a sense of the crowd. There were a lot of men who might have been in the Harlem bars the previous night, pimps and dealers and gamblers and other uptown racket types, most of them accompanied by women. There were some white mob types; they were wearing leisure suits and gold jewelry and they hadn\u0027t brought dates. In the less expensive seats the crowd was the sort of mixed bag that turns up for any sporting event, black and white and Hispanic, singles and couples and groups, eating hot dogs and drinking beer from paper cups and talking and joking and, occasionally, having a look at the action in the ring. Here and there I saw a face straight out of any OTB horse room, one of those knobby on-the-come Broadway faces that only gamblers get. But there weren\u0027t too many of those. Who bets prizefights anymore?\u003c/p\u003e\n\u003cp\u003eI turned around and looked at the ring. Two Hispanic kids, one light and one dark, were being very careful not to risk serious injury. They looked like lightweights to me, and the fair-skinned kid was rangy with a lot of reach. I started getting interested, and in the final round the darker of the two figured out how to get in under the other kid\u0027s jab. He was working the body pretty good when they rang the bell. He got the decision, and most of the booing came from one spot in the audience. The other boy\u0027s friends and family, I suppose.\u003c/p\u003e\n\u003cp\u003eDanny Boy had returned to his seat during the final round. A couple minutes after the decision, Kid Bascomb climbed over the ropes and did a little shadowboxing. Moments later his opponent entered the ring. Bascomb was very dark, very muscular, with sloping shoulders and a powerful chest. His body might have been oiled the way the light glinted on it. The boy he was fighting was an Italian kid from South Brooklyn named Vito Canelli. He was carrying some fat around the waist and he looked soft as bread dough, but I had seen him before and knew him for a smart fighter.\u003c/p\u003e\n\u003cp\u003eDanny Boy said, \"Here he comes. Center aisle.\"\u003c/p\u003e\n\u003cp\u003eI turned and looked. The same usher who\u0027d taken my five bucks was leading a man and woman to their seats. She was about five five, with shoulder-length auburn hair and skin like fine porcelain. He was six one or two, maybe 190 pounds. Broad shoulders, narrow waist, trim hips. His hair was natural, short rather than long, and his skin was a rich brown. He was wearing a camel\u0027s-hair blazer and brown flannel slacks. He looked like a professional athlete or a hot lawyer or an up-and-coming black businessman.\u003c/p\u003e\n\u003cp\u003eI said, \"You\u0027re sure?\"\u003c/p\u003e\n\u003cp\u003eDanny Boy laughed. \"Not your usual pimp, is he? I\u0027m sure. That\u0027s Chance. I hope your friend didn\u0027t put us in his seats.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/eight-million-ways-to-die-matthew-scudder-5/page-5.html","bookId":2323,"creation":"Oct 5, 2019 9:49:25 AM","modification":"Oct 5, 2019 9:49:25 AM"}
