{"id":88040,"no":101,"title":"Page 101","content":"\u003cp\u003e\"I\u0027m not going anywhere.\"\u003c/p\u003e\n\u003cp\u003eHe would turn stubborn on her. \"A few minutes ago you couldn\u0027t wait to get out of here. . . .\"\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s not true,\" he argued.\u003c/p\u003e\n\u003cp\u003e\"Okay. Why do you want to stay?\"\u003c/p\u003e\n\u003cp\u003eHe looked sheepish. \"I\u0027m curious.\"\u003c/p\u003e\n\u003cp\u003eShe slipped into her jeans and was buttoning her blouse when she returned to the living room. Liam put his hands on hers. \"I\u0027ll do that.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got it.\u003c/p\u003e\n\u003cp\u003eHe smiled. \"No, you don\u0027t.\"\u003c/p\u003e\n\u003cp\u003eShe looked down and only then realized the buttons weren\u0027t lined up. Feeling foolish, she stood there and let Liam fix them. When he was finished, she tried to step back.\u003c/p\u003e\n\u003cp\u003eHe followed, tilted her chin up, and kissed her. \"Take a deep breath,\" he suggested.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re hyperventilating.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m angry.\"\u003c/p\u003e\n\u003cp\u003eThe relatives from hell were banging on her door. She did as Liam suggested, but a deep breath didn\u0027t help at all. She was still tense and livid.\u003c/p\u003e\n\u003cp\u003eLiam beat her to the door and opened it. Russell Trent came barreling in first. The smell of alcohol swirled around him like a rancid cloud. His wife, Jane, followed. Her shoulders were hunched and her deep-set eyes studied Liam suspiciously before turning to Allison.\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t know you had company,\" Jane said.\u003c/p\u003e\n\u003cp\u003e\"This is my friend,\" Allison said. Not wasting any time, she added, \"You shouldn\u0027t have come here.\"\u003c/p\u003e\n\u003cp\u003eJane tried to soften her expression, but the smile that curled her lips didn\u0027t reach her eyes. \"We just wanted to see how you\u0027re doing. You know we worry about you.\"\u003c/p\u003e\n\u003cp\u003eAllison thought she was trying to act timid, which was laughable.\u003c/p\u003e\n\u003cp\u003e\"May we sit down?\" Jane asked.\u003c/p\u003e\n\u003cp\u003eRussell was already sprawled on her sofa, so the question didn\u0027t merit an answer.\u003c/p\u003e\n\u003cp\u003e\"Why are you here?\" Allison demanded. \"I\u0027ve already told you you\u0027re getting nothing more from me.\"\u003c/p\u003e\n\u003cp\u003eJane glanced at Liam, who was standing by the door and watching her like a hawk. She hesitated before answering Allison, as though she was carefully measuring her words before speaking. \"We received a summons of a sort just a few days ago, and we were shocked. Really shocked. It all happened so long ago.\"\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"What happened so long ago?\"\u003c/p\u003e\n\u003cp\u003e\"Your dear parents died.\" Jane shook her head and pulled a tissue from her purse, trying her best to act sincere. \"We still mourn them.\"\u003c/p\u003e\n\u003cp\u003eAllison thought her performance was nauseating. \"No, you don\u0027t mourn them. My father didn\u0027t like either one of you, and for good reason.\"\u003c/p\u003e\n\u003cp\u003eUncle Russell pushed himself upright. \"No, no, that\u0027s not true. They loved us.\"\u003c/p\u003e\n\u003cp\u003eAllison wasn\u0027t going to argue. \"You still haven\u0027t explained why you\u0027re here.\"\u003c/p\u003e\n\u003cp\u003e\"We received a summons that says they want an account of every dollar we spent on you and Charlotte. That\u0027s simply impossible,\" Jane huffed. \"Who saves every little receipt for all those years?\"\u003c/p\u003e\n\u003cp\u003e\"And you spent a lot of money on us, did you?\" Allison asked, doing her best to hold her temper under control.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" Jane insisted. \"It cost a lot of money to feed and clothe and educate you two girls.\"\u003c/p\u003e\n\u003cp\u003e\"Five hundred thousand?\" Allison asked.\u003c/p\u003e\n\u003cp\u003eJane was taken aback. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Did you and Uncle Russell spend all of the insurance money on Charlotte and me?\"\u003c/p\u003e\n\u003cp\u003e\"Of course we did,\" Jane countered.\u003c/p\u003e\n\u003cp\u003e\"Stop,\" Allison demanded in a near shout. \"Just stop. You didn\u0027t spend any of that money on us. We know where it all went. You purchased your house and the land around it. You paid off your bills. You-\"\u003c/p\u003e\n\u003cp\u003e\"All right,\" Jane cried out. \"We were wrong, and we\u0027re very sorry.\"\u003c/p\u003e\n\u003cp\u003e\"You were horrible to us. You know that, don\u0027t you? You kept threatening that you would put me in foster care without my sister if I acted up. And we had to work to pay for anything we wanted, even school. Remember? And God help me if I was ungrateful. Those terror tactics started when I was four years old.\"\u003c/p\u003e\n\u003cp\u003eSeeing her approach wasn\u0027t succeeding, Jane decided to double down. There was a sigh and a contrite lowering of her eyes when she said, \"We realize now how insensitive we were. We really are ashamed of our behavior, and we\u0027re so very sorry.\"\u003c/p\u003e\n\u003cp\u003eIt was the most insincere apology Allison had ever heard. \"What is it you want?\" she asked, her voice flat and emotionless. \"Or did you come here just to apologize?\"\u003c/p\u003e\n\u003cp\u003e\"Actually . . . ,\" Jane began. She looked at her husband.\u003c/p\u003e\n\u003cp\u003eRussell teetered when he stood. \"We want you to go to court with us and testify on our behalf,\" he said. \u003c/p\u003e","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-101.html","bookId":1824,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
