{"id":87957,"no":17,"title":"Page 17","content":"\u003cp\u003e\"I\u0027m not sure I can. None of it made sense to me. You really don\u0027t know Liam . . . ?\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"What about your husband? Maybe Noah invited him. They\u0027re both FBI. Maybe they\u0027re old friends, and he just never mentioned him to you.\"\u003c/p\u003e\n\u003cp\u003eJordan dug her phone out of her purse and went through her messages. There weren\u0027t any from her husband, but there was one from her brother Alec, who was in town from Chicago. He hoped she wouldn\u0027t mind the late notice, but he had a friend who wanted to meet her. They were coming over for dinner. Jordan read the message to Allison.\u003c/p\u003e\n\u003cp\u003e\"Alec\u0027s FBI, too, isn\u0027t he?\" Allison asked.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Jordan replied. \"You still haven\u0027t told me what happened.\"\u003c/p\u003e\n\u003cp\u003e\"Phillips had a file on me. He knew about my family, my years working on my degree-\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Jordan asked.\u003c/p\u003e\n\u003cp\u003e\"He was offering me a job. I think there\u0027s more to it. If this was only a recruitment opportunity, why wouldn\u0027t they have called me for a meeting? Why did they get you involved? And why would they have been so manipulative about us coming out here?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Allison. I didn\u0027t know anything about this.\" Jordan thought for a second. \"It\u0027s a given they want something from you,\" she said. \"Maybe tonight your date will tell you what it is.\"\u003c/p\u003e\n\u003cp\u003eAllison looked appalled, which made Jordan laugh. \"Liam Scott is not my date. In fact, I don\u0027t think I\u0027ll come tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, you will,\" Jordan said. \"You\u0027re curious to know what he wants, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"You could find out and tell me.\"\u003c/p\u003e\n\u003cp\u003e\"Oh no. You have to be there. Besides, from what you\u0027ve told me, I don\u0027t think Agent Scott will let you decline. FBI agents like to get their way. What\u0027s he like?\"\u003c/p\u003e\n\u003cp\u003eSexy. That was the first word that came to mind, but Allison wasn\u0027t about to admit such a foolish thought to Jordan. Instead, she said, \"Oh, you know.\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t know. Tell me.\"\u003c/p\u003e\n\u003cp\u003eAllison shrugged. \"He\u0027s an FBI agent. He smiles, though. Unlike Phillips.\"\u003c/p\u003e\n\u003cp\u003eJordan put the car in drive and took off. \"I guess I\u0027ll learn more about Liam Scott tonight. I wish Noah could be there, but he won\u0027t be back from Miami until next week.\"\u003c/p\u003e\n\u003cp\u003eSeveral minutes passed in silence as Allison replayed the bizarre encounter in her head. \"Phillips sounded so sure of himself,\" she said.\u003c/p\u003e\n\u003cp\u003e\"How so?\u003c/p\u003e\n\u003cp\u003e\"He told me he\u0027d find a way to get me to work for him, and I don\u0027t think he\u0027s one to bluff.\"\u003c/p\u003e\n\u003cp\u003e\"No, he isn\u0027t,\" Jordan agreed.\u003c/p\u003e\n\u003cp\u003e\"He also said I would have to take a lie detector test, and I can\u0027t do that.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003eAllison trusted Jordan but hadn\u0027t told her about all of her forays on the Internet. \"Why do you think?\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think you would pass.\"\u003c/p\u003e\n\u003cp\u003e\"I know I wouldn\u0027t pass, and I could end up in prison.\" Allison knew she had never caused any damage to the sites she\u0027d broken into, so she wasn\u0027t worried about being prosecuted for vandalizing them, yet the sheer volume of her hacks had to mean something. They could add up to a serious charge.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re exaggerating.\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003eJordan didn\u0027t miss a beat. \"Okay, so don\u0027t take the test. Stand firm. No one can force you.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you going to ask me what I did that could send me to prison?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll tell me when you\u0027re ready.\"\u003c/p\u003e\n\u003cp\u003eAllison smiled. \"You\u0027re a very unusual woman. I\u0027d be dying of curiosity, and I would probably nag you until you told me.\"\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Is that your phone beeping or mine?\"\u003c/p\u003e\n\u003cp\u003e\"Mine,\" Allison said. She saw that there were three voice messages, all from her aunt. The first message was quick and calm. Her aunt asked her to call as soon as possible. There was a problem, she said, but she didn\u0027t give any further explanation. The second message was more aggressive. Her aunt\u0027s voice had a bite to it. She said she had waited two hours for Allison to call back. Why hadn\u0027t she done so? Did she realize how selfish and ungrateful she was? The third message was almost comical. In the middle of a blistering rant, her uncle began to shout at her aunt, and within seconds the two of them were in an all-out fight, screaming at each other. Unfortunately, Allison was used to their loud quarrels. The tirades in Who\u0027s Afraid of Virginia Woolf? were polite disagreements in comparison to this couple\u0027s arguments.\u003c/p\u003e\n\u003cp\u003e\"Are you going to call her back?\" Jordan asked.\u003c/p\u003e\n\u003cp\u003e\"You heard?\"\u003c/p\u003e\n\u003cp\u003e\"It was impossible not to hear. Your aunt and uncle were shouting.\"\u003c/p\u003e\n\u003cp\u003eAllison didn\u0027t make any excuses for their behavior. \"I\u0027ll call when I get back to the house.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-17.html","bookId":1824,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
