{"id":87965,"no":25,"title":"Page 25","content":"\u003cp\u003e\"You\u0027ll have immunity,\" he reiterated.\u003c/p\u003e\n\u003cp\u003eShe was so astonished, she didn\u0027t know what to say. Should she confess all her sins? Could she trust Liam to keep his word?\u003c/p\u003e\n\u003cp\u003e\"Could you excuse me for one minute?\" She didn\u0027t wait for permission but got up and hurried to the kitchen. Jordan was stacking the cartons of leftovers in the refrigerator.\u003c/p\u003e\n\u003cp\u003e\"Just one quick question,\" Allison said.\u003c/p\u003e\n\u003cp\u003eJordan stopped what she was doing and looked at her friend. \"Okay. What\u0027s the question?\"\u003c/p\u003e\n\u003cp\u003e\"Can I trust Liam to keep his word? He offered me immunity.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t really vouch for Liam, because I\u0027ve only just met him, but I can definitely vouch for my brother. If Alec trusts him, you can trust him.\"\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"All right, then.\" She turned on her heel and returned to the two men in the living room. \"Okay, I\u0027ll help you.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think you can do it? Can you get in without being detected?\" Alec asked.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she answered. There was no conceit in her answer, just confidence.\u003c/p\u003e\n\u003cp\u003e\"I still want to know why you won\u0027t take a lie detector test,\" Alec reminded her.\u003c/p\u003e\n\u003cp\u003eShe knew she was going to have to tell them. After she explained, they would undoubtedly think of her as a criminal-which was, in fact, the truth-and for some reason that bothered her. She shouldn\u0027t care what they thought, should she? \"I did break a few laws, but only in the interest of helping. And also there was the educational aspect. . . .\"\u003c/p\u003e\n\u003cp\u003e\"Be specific,\" Liam urged.\u003c/p\u003e\n\u003cp\u003eShe decided to start with an instance that wouldn\u0027t sound so incriminating. \"There was the time I decided to look in on my bank just to make sure there weren\u0027t any surprises,\" she said. \"My savings account was there, and I didn\u0027t want anything to happen to it. I had expenses coming up-\" She stopped abruptly when she realized she was already making excuses for her conduct.\u003c/p\u003e\n\u003cp\u003e\"By looking in on your bank, you mean you hacked,\" Alec began. \"And by surprises you mean viruses, bugs?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she admitted. \"And as luck would have it, I found a surprise. It was programmed to wreak havoc on a certain day and time, which turned out to be a couple of weeks away from when I found it. It would have corrupted all the bank files.\"\u003c/p\u003e\n\u003cp\u003e\"What did you do when you found it?\" Liam asked.\u003c/p\u003e\n\u003cp\u003e\"I removed it. It wasn\u0027t very interesting, just your run-of-the-mill virus, so I destroyed it.\"\u003c/p\u003e\n\u003cp\u003e\"Did you notify the bank?\" Alec asked her.\u003c/p\u003e\n\u003cp\u003eShe looked appalled by the question. \"Of course not.\"\u003c/p\u003e\n\u003cp\u003e\"Did you get in and out without being detected?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I did.\" She stood then and headed to the kitchen again.\u003c/p\u003e\n\u003cp\u003e\"We aren\u0027t finished here,\" Alec said.\u003c/p\u003e\n\u003cp\u003e\"I know. I was wondering if there\u0027s any lo mein left.\" She straightened her shoulders as she turned. \"I\u0027ll be right back.\"\u003c/p\u003e\n\u003cp\u003eWhen she entered the kitchen, her phone was ringing. She pulled it out of her purse, saw who was calling, and quickly pressed DECLINE. It was her aunt\u0027s phone number. She wasn\u0027t in the mood to deal with her tonight.\u003c/p\u003e\n\u003cp\u003eA minute later she walked back into the living room, carrying a white carton, chopsticks, and a Diet Coke. \"All of a sudden, I\u0027m starving.\"\u003c/p\u003e\n\u003cp\u003e\"Immunity gave you an appetite?\" Alec asked.\u003c/p\u003e\n\u003cp\u003e\"Must have,\" she said.\u003c/p\u003e\n\u003cp\u003eThe lo mein was still warm. While Liam and Alec discussed some details of the investigation, Allison ate the entire contents of the carton. She loved every bite. She finished the Diet Coke, dropped the chopsticks into the carton, and sat back. For the first time since he\u0027d met her, Liam thought she looked relaxed.\u003c/p\u003e\n\u003cp\u003eBreak was over. It was time for him to find out more of her secrets. \"Did you look in on any other banks?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"How many?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. At least twenty or thirty,\" she said. \"I\u0027d look in on them every six months or so. I\u0027d always find more bugs. It\u0027s shocking really, how easy it is to use them to plant a virus.\"\u003c/p\u003e\n\u003cp\u003e\"Have you ever planted a virus?\" Alec asked.\u003c/p\u003e\n\u003cp\u003eThe question offended her. \"No, never.\"\u003c/p\u003e\n\u003cp\u003eAlec nodded, appeased.\u003c/p\u003e\n\u003cp\u003eThen Liam asked, \"You didn\u0027t just look into banks, did you?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she admitted. \"I checked a lot of businesses. Most of the viruses I found couldn\u0027t do all that much harm, but I removed a lot of them anyway. There were others that could do real damage. They were interesting, so I kept them.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Alec asked. \"Why would you keep them?\"\u003c/p\u003e\n\u003cp\u003e\"I wanted to study them. I\u0027m designing what I hope is an impenetrable firewall,\" she explained. \"That\u0027s my goal, anyway.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-25.html","bookId":1824,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
