{"id":87981,"no":41,"title":"Page 41","content":"\u003cp\u003e\"Protecting my asset.\"\u003c/p\u003e\n\u003cp\u003eThe two men who had shouted at her were whistling, but she ignored them and stared straight ahead.\u003c/p\u003e\n\u003cp\u003eOnce they were in the car, Liam asked, \"Do you want me to take you home or drop you at Jordan\u0027s?\"\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Home,\" she answered. \"I\u0027ve decided I need a little time alone to think about the documents my cousin, Will, gave me today, and speaking of Will . . .\"\u003c/p\u003e\n\u003cp\u003eHe glanced over at her. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I have a favor to ask.\" She paused, wondering how she should bring up the subject of her irresponsible cousin. After weighing her choices for a few seconds, she decided the direct approach was best. \"I\u0027m hoping you can help him stay out of prison. I want him to have one last chance.\" When he turned to her, she saw the incredulous look on his face.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re kidding, right?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m serious. If you can, I\u0027d like you to help him. Why do you look so surprised?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve read his file,\" he said, his tone hard. \"There\u0027s no way I\u0027m going to help him. He\u0027s had too many chances to change his life.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t say another word. She wanted to let him think it through, and hopefully he would change his mind. She knew he would eventually ask her why she wanted to help Will, and it was going to be difficult to explain. Did admitting that she felt sorry for him make her a complete fool? His growing-up years had surely been as traumatic as hers, just in a different way. Having such controlling and smothering parents who had watched his every move was much worse than being ignored.\u003c/p\u003e\n\u003cp\u003eThe set of Liam\u0027s jaw told her he was going to need more time to consider her request. They pulled up in front of her house, and Liam retrieved her overnight bag from the trunk and then followed her up the sidewalk.\u003c/p\u003e\n\u003cp\u003e\"Looks like the house is empty,\" he remarked.\u003c/p\u003e\n\u003cp\u003e\"They must have gone out to get something to eat. No worries,\" she added. \"They\u0027ll be back.\"\u003c/p\u003e\n\u003cp\u003eThe porch light was off, and the porch was cast in shadows from the light coming through the living room window. The sheer drapes softened the glare and turned the light a golden hue.\u003c/p\u003e\n\u003cp\u003eAt the door, Allison turned back and took a step closer to him. \"May I please e-mail you a video? It shows Will and the bar fight he was involved in.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t need to e-mail it. I can get it, but tell me, does it prove Will\u0027s innocent?\"\u003c/p\u003e\n\u003cp\u003eOnce again she didn\u0027t give him a direct answer. \"It shows three men pressing in on him. Just watch it, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Allison, why do you want to help him?\"\u003c/p\u003e\n\u003cp\u003eShe sighed. \"I want to believe he can change. Is that so wrong? I don\u0027t want to give up on him. He\u0027s not all bad,\" she insisted. \"Yes, he has a bad temper, but he\u0027s never turned his anger on me, and he always warned me when his friends were coming to the house.\"\u003c/p\u003e\n\u003cp\u003e\"Why did he warn you?\"\u003c/p\u003e\n\u003cp\u003e\"He knew I didn\u0027t like them.\"\u003c/p\u003e\n\u003cp\u003e\"And what did you do when he warned you?\"\u003c/p\u003e\n\u003cp\u003e\"I stayed in my room with the door locked. None of them ever bothered me.\"\u003c/p\u003e\n\u003cp\u003e\"You were afraid of them.\"\u003c/p\u003e\n\u003cp\u003eDuh. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"I guess that makes him a saint, warning you and all. . . .\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just pointing out that he isn\u0027t all bad.\"\u003c/p\u003e\n\u003cp\u003e\"How about you read his file?\" he suggested.\u003c/p\u003e\n\u003cp\u003e\"Everyone deserves a second chance.\" She looked up into Liam\u0027s beautiful eyes and felt her heartbeat quicken.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s had a lot more than two chances.\"\u003c/p\u003e\n\u003cp\u003e\"Then one more won\u0027t hurt, will it? I\u0027m doing a favor for you. Couldn\u0027t you do this favor for me?\"\u003c/p\u003e\n\u003cp\u003e\"And in return I\u0027m giving you immunity. That was the deal.\"\u003c/p\u003e\n\u003cp\u003eShe could see she wasn\u0027t getting anywhere, and she needed to change her terms. She thought for a second and then said, \"Okay, how about this? If you help him, I\u0027ll work for Agent Phillips and you for a month. A full month,\" she stressed.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re negotiating-\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s thirty-one days.\" She took a step closer until she was all but touching him and said, \"That\u0027s a real deal.\"\u003c/p\u003e\n\u003cp\u003e\"What happens if he gets probation and does something else? Are you going to ask for help again?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she answered. \"It\u0027s on him then. He\u0027ll have to suffer the consequences.\"\u003c/p\u003e\n\u003cp\u003e\"He should have suffered the consequences a long time ago.\" He shook his head. \"No.\"\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t giving up. \"How about two months? I\u0027ll work for you and Phillips for two full months.\"\u003c/p\u003e\n\u003cp\u003e\"If I were to do this, it wouldn\u0027t be for Will. I\u0027d do it for you, and two months won\u0027t cut it.\"\u003c/p\u003e\n\u003cp\u003eSensing victory, she smiled and said, \"How long, then?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-41.html","bookId":1824,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
