{"id":87982,"no":42,"title":"Page 42","content":"\u003cp\u003e\"A year.\"\u003c/p\u003e\n\u003cp\u003e\"A year? That\u0027s crazy. No.\"\u003c/p\u003e\n\u003cp\u003e\"No deal, then.\"\u003c/p\u003e\n\u003cp\u003eThe argument continued. She didn\u0027t back away from him.\u003c/p\u003e\n\u003cp\u003eAfter several minutes of bargaining, they came to an agreement. Liam would do what he could for Will if she worked at the cyber unit for six months. In that time, the FBI would allow her to get the few hours she needed for graduation. Allison thought it was a nice compromise. Liam was more suspicious. Based on what he already knew, he figured Will would break probation within a month and be hauled off to prison. He didn\u0027t share his opinion with Allison, though, knowing she would start arguing again.\u003c/p\u003e\n\u003cp\u003e\"One more thing . . .\"\u003c/p\u003e\n\u003cp\u003e\"Now what?\" he grumbled.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want Will to know I had anything to do with this.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, okay.\"\u003c/p\u003e\n\u003cp\u003eShe was so pleased she kissed him on the cheek. Then she quickly lowered her head and whispered, \"I probably shouldn\u0027t have done that. It\u0027s inappropriate.\"\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe woman was a temptress, and it took all the self-control Liam could muster not to touch her. An internal argument ensued. One kiss wouldn\u0027t matter. Yes, it would. And yet if he kissed her, his curiosity would be appeased, and he could move on to more important things. But that would be wrong.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mess around with assets,\" he said as he slowly closed the gap between them, his mouth just inches from hers. She was looking deeply into his eyes and he could feel his willpower slipping away. One quick kiss. What was the harm?\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t until that very moment that Allison realized he wanted her. She was stunned. Pleased, too, because she\u0027d wanted to kiss him since she met him.\u003c/p\u003e\n\u003cp\u003e\"I understand,\" she whispered, pressing her body against his. \"Rules are rules. So I certainly shouldn\u0027t do this.\" She put her arms around his neck.\u003c/p\u003e\n\u003cp\u003e\"No, you shouldn\u0027t,\" he protested, yet didn\u0027t move.\u003c/p\u003e\n\u003cp\u003e\"Or this,\" she said, softly brushing her lips over his.\u003c/p\u003e\n\u003cp\u003e\"No . . .\" He tried to deepen the kiss, but she pulled back.\u003c/p\u003e\n\u003cp\u003eThis was all new to Allison. She wasn\u0027t a flirt, by any means, and she rarely messed around, but she liked teasing Liam. He brought out a side of her she usually kept hidden, and she didn\u0027t exactly know why. There was just something about him.\u003c/p\u003e\n\u003cp\u003e\"And it would be against the rules for an asset to do this, don\u0027t you suppose?\" She leaned up, and her mouth settled on his then in a kiss that was anything but casual or quick. As soon as she opened her mouth for him, he took over. His tongue swept inside to rub against hers, sending shivers down her spine. When he wrapped his strong arms around her, she tightened her hold, her fingers sliding up into his hair as his mouth devoured hers. Passion burned between them, and Allison\u0027s last coherent thought was that she never wanted it to stop.\u003c/p\u003e\n\u003cp\u003eLiam nearly lost all control, the taste of her was so addictive. He felt her tremble and abruptly ended the kiss, then made the mistake of looking at her sexy mouth. He wanted her in his bed. He was burning with his need, but he forced himself to come to his senses and gently pulled her arms from his neck. When he was finally able to let go of her, he had to take several deep breaths to regain control. \"Yes, it\u0027s against my rules,\" he said, clearing his throat so he could get the words out.\u003c/p\u003e\n\u003cp\u003eIt took a couple of seconds for her to understand. \"Okay,\" she said softly, frowning.\u003c/p\u003e\n\u003cp\u003eHe could tell the kiss had rattled her. Desire lingered in her eyes, and damn, he wanted to kiss her again. Instead, he took her key and reached around to open the door. Then he gently nudged her inside and slowly closed the door behind her.\u003c/p\u003e\n\u003cp\u003eELEVEN\u003c/p\u003e\n\u003cp\u003ePromptly at eight o\u0027clock Monday morning, Liam was at Allison\u0027s door. He looked gorgeous-and all business-in his suit and tie. She had made up her mind not to mention the kiss. She was going to act like an adult, not a silly girl in the throes of her first crush.\u003c/p\u003e\n\u003cp\u003eTo appear professional, she had looked beyond her typical casual school attire and had chosen a simple periwinkle blue dress. After changing her shoes several times, she finally opted for her nude heels. She figured the extra height would give her an air of authority. No heels could make her taller than Liam, though.\u003c/p\u003e\n\u003cp\u003eHe waited at the door while she gathered her phone, her identification, and a twenty-dollar bill and put them in a small shoulder bag. When she picked up the black leather case holding her laptop, he stopped her.\u003c/p\u003e\n\u003cp\u003e\"Leave your laptop here,\" he said.\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I don\u0027t like to leave it at home if I can help it. If the house is empty, someone could come in and tamper with it or steal it. My old housemate, Brett, already tried. Whenever it\u0027s possible, I carry it with me. The guard can lock it up with my bag.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-42.html","bookId":1824,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
