{"id":87987,"no":47,"title":"Page 47","content":"\u003cp\u003eShe especially liked the fact that he didn\u0027t have any trouble making fun of himself. Eventually their conversation turned to other topics, and they discovered a number of mutual interests, everything from baseball to ocean life.\u003c/p\u003e\n\u003cp\u003eWhen Liam told her about a near miss with a shark, she rubbed the goose bumps on her arms and asked, \"How could you ever get into the water knowing that some of the most dangerous predators are right there, waiting for a snack?\"\u003c/p\u003e\n\u003cp\u003eLiam laughed. \"And I\u0027m the snack?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Haven\u0027t you ever seen Shark Week on television? Guess where some of the most dangerous sharks are.\"\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Australia.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"I grew up swimming in the ocean.\"\u003c/p\u003e\n\u003cp\u003e\"Is that how you learned to swim? In the ocean?\" She sounded appalled. \"I can\u0027t imagine . . . with all those waves and undercurrents. It can be very dangerous.\"\u003c/p\u003e\n\u003cp\u003e\"We had a pool in our backyard, and that\u0027s where I learned. My father taught me. I was three or four. How old were you when you learned to swim?\"\u003c/p\u003e\n\u003cp\u003e\"Around seventeen, I guess. Giovanni taught me.\"\u003c/p\u003e\n\u003cp\u003e\"The guy you model for? How did that happen?\"\u003c/p\u003e\n\u003cp\u003e\"We were on a photo shoot. It was a beautiful location with this infinity pool that seemed to drop off the side of the world. I was modeling a bathing suit, and Giovanni wanted to get some shots of me coming out of the water.\" She laughed as she added, \"I didn\u0027t want to disappoint him.\"\u003c/p\u003e\n\u003cp\u003e\"So you jumped into the water?\"\u003c/p\u003e\n\u003cp\u003e\"And almost drowned. Giovanni had to come in after me. He pushed the photo shoot to the next day, and right then and there he gave me my first lesson.\"\u003c/p\u003e\n\u003cp\u003e\"You must have shocked the hell out of him.\"\u003c/p\u003e\n\u003cp\u003eShe laughed again. \"Oh yes, I did.\"\u003c/p\u003e\n\u003cp\u003eLiam could tell she was having a good time. So was he, he realized.\u003c/p\u003e\n\u003cp\u003e\"Here\u0027s a question,\" he said nonchalantly as he reached for her empty can and wrapper. \"Swim in the ocean where you know there\u0027s a great white, or walk across a lawn where you know there\u0027s a poisonous snake-which do you choose?\"\u003c/p\u003e\n\u003cp\u003eShe drummed her fingertips on the park bench while she thought about it. \"Swim,\" she finally said.\u003c/p\u003e\n\u003cp\u003e\"My brother and I played that game all the time. Drove our parents nuts.\"\u003c/p\u003e\n\u003cp\u003e\"What was it like, growing up in Australia?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe described his family and their home on the Australian coast with its aquamarine waters and white sand beaches. It sounded like an idyllic childhood. He clearly was very close to his family, especially his younger brother. The two boys had been daredevils, and from some of the escapades he told her about, she suspected they had given their parents some sleepless nights. Allison was captivated by his stories and the way his eyes crinkled at the corners just before he was about to tell of some mischievous prank. She still couldn\u0027t figure him out, but she was definitely intrigued. His sense of adventure and the need to do something that mattered had obviously led him to the work he was doing now. By comparison, she was a boring nerd. While she hid in her room writing code, he was out in the world experiencing life.\u003c/p\u003e\n\u003cp\u003eWhen there was a lull in the conversation, she looked around. It was night and the river was dark, the only light coming from the moon\u0027s reflection off the water and a distant streetlight on the path. She glanced down at her watch. It was almost eleven. They had been talking for three hours. She had been so caught up in their conversation she had completely lost track of time. She had forgotten about her worries for a while, but unfortunately they came rushing back when, as they were walking back to his car, Liam asked her if she had gotten bad news in the messages she had checked earlier.\u003c/p\u003e\n\u003cp\u003e\"Why would you think . . .\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re easy to read,\" he said. \"You checked your messages and you were upset.\"\u003c/p\u003e\n\u003cp\u003e\"Not upset,\" she corrected. \"Irritated.\"\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t started the engine yet and turned toward her. \"Tell me.\"\u003c/p\u003e\n\u003cp\u003eShe knew he wouldn\u0027t let up until she explained, so she quickly told him about both messages.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t hide his disgust. \"Your aunt thought she could sign your name to your check and deposit it in her account?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s done it before.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027re not going to let her do it again.\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you think your uncle was sitting in front of your house? The money?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Maybe to try to get me back under his thumb. He\u0027s got a bad temper,\" she added. \"And when he drinks, he can be . . . unreasonable.\"\u003c/p\u003e\n\u003cp\u003eFrowning, he asked, \"Has he ever hit you?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-47.html","bookId":1824,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
