{"id":87994,"no":54,"title":"Page 54","content":"\u003cp\u003eEvery argument running through Liam\u0027s head flew out the window. Since the moment he\u0027d met her, he\u0027d wanted her in his arms. Who was he kidding? He wanted more than that. He wanted her in his bed, under him, writhing and begging for release. Keeping their relationship professional had been one of the hardest things he had ever done, but he knew, as long as he was in charge of her assignment, he couldn\u0027t act on his feelings. Now, he rationalized, she no longer worked for him. He was neither her boss nor her colleague. She worked for Phillips.\u003c/p\u003e\n\u003cp\u003eHe wrapped his arms around her, cupped her backside, and lifted her up until her pelvis was pressed against his. Her mouth was soft and warm, and he was ravenous for more. He knew things were getting out of hand, yet the passion was escalating so quickly he couldn\u0027t make himself let go of her. When he finally lifted his head, he saw her face was flushed and she was breathless. His touch had done that to her, he knew, and he wondered if she was as rattled as he was. God, she was beautiful. She tried to move back into his arms, but he put his hands on her waist and wouldn\u0027t let her move.\u003c/p\u003e\n\u003cp\u003eHe stared at her a long minute and then in a raspy voice asked, \"Do you want to do this?\"\u003c/p\u003e\n\u003cp\u003eThe question jarred her. \"Do this? What did you have in mind?\"\u003c/p\u003e\n\u003cp\u003eAllison took a step back. Of course she wanted him, but did attacking him make her a sex-starved maniac? That would be wrong. Then again, what was wrong with having one amazing night with him before he left? Nothing, she decided, and her curiosity would be appeased. Yes, the sisters of St. Dominic\u0027s would be horrified by what they would call her lack of morals, and they would no doubt tell her she was going to end up in purgatory for a millennium if she didn\u0027t get her mind out of the gutter. If so, she really didn\u0027t care. Besides, there wasn\u0027t going to be any guilt because he wouldn\u0027t be around to remind her. Although she wasn\u0027t all that experienced, she had had sex before and didn\u0027t think it lived up to all the hype. She hadn\u0027t been in any hurry to do it again. Until Liam. Everything was different with him.\u003c/p\u003e\n\u003cp\u003e\"Allison, answer me.\" Liam knew he would let go of her and leave if that was what she wanted, but he hoped to God she wanted him to stay.\u003c/p\u003e\n\u003cp\u003e\"Yes, I want to do this,\" she finally answered. \"But I prefer to call it making love.\" When he reacted to her declaration, she poked him in the chest. \"Don\u0027t you dare laugh at me.\"\u003c/p\u003e\n\u003cp\u003eHis smile was filled with tenderness. \"I prefer to call it what it is. Sex.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have to be so clinical about it?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"I don\u0027t want there to be any misunderstanding. I lead a chaotic life, and a long-term commitment with any woman isn\u0027t possible.\"\u003c/p\u003e\n\u003cp\u003eWhen it came to romance, the man was definitely lacking finesse. But then what did she know? The only romance she\u0027d observed was on television. \"Okay, no misunderstandings, no complications, no commitments. Agreed?\"\u003c/p\u003e\n\u003cp\u003e\"Agreed.\" He sounded relieved, which she found a bit galling. Did he think she would demand marriage?\u003c/p\u003e\n\u003cp\u003eShe put her arms around his neck again and rested her cheek against his chest. \"Maybe we should put it in writing. Then you won\u0027t have to worry.\"\u003c/p\u003e\n\u003cp\u003eHe hid his smile and said, \"Yeah, we should put it in writing.\"\u003c/p\u003e\n\u003cp\u003e\"And get it notarized.\"\u003c/p\u003e\n\u003cp\u003eHe laughed. \"Are you making fun of me?\" He squeezed her backside. \"I just want to be clear on expectations.\"\u003c/p\u003e\n\u003cp\u003e\"Did you go through these expectations of yours with the other women you\u0027ve taken to bed? I\u0027m assuming there have been one or two.\" It was odd that she didn\u0027t like the idea of Liam with any other woman. She shouldn\u0027t care, should she? Yet she did.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"No, what?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027ve never gone through them with any other woman.\"\u003c/p\u003e\n\u003cp\u003eShe leaned back so she could look into his eyes. \"Why not?\" she asked, clearly disgruntled.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re different.\"\u003c/p\u003e\n\u003cp\u003e\"Is that good or bad?\"\u003c/p\u003e\n\u003cp\u003e\"Neither,\" he answered. \"Just different.\"\u003c/p\u003e\n\u003cp\u003eShe sighed. \"You sure know how to kill a mood. I think . . .\"\u003c/p\u003e\n\u003cp\u003eShe was going to tell him he might as well leave, but that thought got all tangled up in her mind the second his open mouth covered hers. The kiss was hard and blatantly possessive. Oh God, how she loved the way his tongue took possession, and she began the mating ritual, pressing her pelvis against his each time his tongue sank inside.\u003c/p\u003e\n\u003cp\u003eShe was trembling when he lifted his head. They walked into the bedroom and stood at the foot of the bed facing each other as they undressed. While he removed his jacket and tie, she kicked off her heels, then turned around so that he could unzip her dress. She didn\u0027t have to tell him what she wanted. She simply lifted her hair and waited. \u003c/p\u003e","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-54.html","bookId":1824,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
