{"id":87995,"no":55,"title":"Page 55","content":"\u003cp\u003eLiam leaned down and kissed the side of her neck, smiling when he saw the goose bumps he caused. Then he lowered her zipper all the way down to the base of her spine. A night-light from the adjoining bathroom cast shadows on the bed and on her golden body. He marveled at how smooth and perfect her skin was.\u003c/p\u003e\n\u003cp\u003eHeart pounding, Allison slowly removed her dress, carefully folded it, and placed it on a nearby chair. She was deliberately taking her time, hoping she could get her nerves under control, but she quickly gave up and turned back to him.\u003c/p\u003e\n\u003cp\u003eLiam had to remind himself to breathe when he saw she was wearing lacy black lingerie. She was the sexiest woman he had ever known, and he had wanted her from the moment he had met her. Within seconds, he removed his gun and badge and put them on the bedside table. She tried to unbutton his shirt for him, but her hands were shaking so much, she couldn\u0027t get it done. He took over the task, all the while his gaze locked on her.\u003c/p\u003e\n\u003cp\u003eThe look on his face made Allison feel warm everywhere. She curled her toes into the rug and stared up at him. He really was beautiful, she thought, knowing he wouldn\u0027t like it if she told him so. She put her hand on his chest and trailed her fingertips down to the waistband of his pants.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m nervous,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"I know,\" he replied, smiling. She threaded her fingers though her hair and brushed it back in an action he found utterly feminine.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand why. I\u0027m used to taking my clothes off in front of men.\"\u003c/p\u003e\n\u003cp\u003eThat statement got a reaction. He was in the process of unzipping his pants but stopped and said, \"There\u0027s no way in hell I\u0027m going to believe you\u0027re promiscuous.\"\u003c/p\u003e\n\u003cp\u003e\"What? No, of course not. But if I were?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged, indicating that it didn\u0027t matter to him. \"I\u0027d still want you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not,\" she stated again.\u003c/p\u003e\n\u003cp\u003e\"Okay. You like to take your clothes off . . .\"\u003c/p\u003e\n\u003cp\u003e\"In front of men,\" she finished for him. \"It\u0027s what I do.\" Now she was smiling, wondering how long it would take him to figure it out.\u003c/p\u003e\n\u003cp\u003eHad he not been so distracted by her killer body, he would have been more clearheaded and known right away what she was saying. When her meaning finally sank in, he laughed. \"You\u0027re a model.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eHe pulled her into his arms before she could get nervous again. \"We won\u0027t do anything you don\u0027t want to do,\" he promised.\u003c/p\u003e\n\u003cp\u003eHe was nuzzling the side of her neck, sending shivers through her. She tugged on his hair to get him to kiss her on the mouth. She was the aggressive one now. Her tongue swept inside and rubbed against his, and when she felt his arms tighten their grip, she knew he liked it, so she did it again. She wanted to make him lose control and suddenly realized she was losing hers.\u003c/p\u003e\n\u003cp\u003eLiam removed the rest of her clothes and then his own. His mouth never left hers, and she didn\u0027t even realize what he\u0027d done until her breasts were pressed against his chest. The feeling was exquisite. She felt the heat and the power radiating from his muscles. Her senses were reeling. Everything about him aroused her. The way he caressed her, the sexy growls he made when she pleased him, and his scent. Oh God, his scent was wonderful. It wasn\u0027t aftershave, but maybe body wash and male. Clean and masculine. It was a sexy-as-sin combination and she loved it. When he tried to pull away from her, she retaliated by tugging on his lip with her teeth. She wanted to keep kissing him, and he gave her what she demanded.\u003c/p\u003e\n\u003cp\u003eLiam was already hard and aching to be inside her. He knew she wasn\u0027t ready, and when she moved her hips to cuddle him between her thighs, he groaned and took a deep breath. He wasn\u0027t sure how he accomplished it, but he got the covers pulled back before the two of them fell into bed together. She was wrapped in his arms and on top of him.\u003c/p\u003e\n\u003cp\u003e\"Damn, you\u0027re so soft.\"\u003c/p\u003e\n\u003cp\u003eShe lifted her head and looked at him with a mischievous glint in her eyes. \"I\u0027ve got you right where I want you.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" He made a quick spin, and she found herself on her back with Liam looming over her. \"Now I\u0027ve got you.\"\u003c/p\u003e\n\u003cp\u003eWhen he moved, his chest hair tickled her breasts. It felt so good she wanted him to move again.\u003c/p\u003e\n\u003cp\u003eLiam kissed her passionately, determined to overwhelm her, to make her as crazed as he was. Holding on to his discipline and not going too fast was excruciating.\u003c/p\u003e\n\u003cp\u003eRestless now, she began to move. Her toes rubbed his legs, and she instinctively arched up against him. He kissed her just below her earlobe and then whispered all the dark, erotic things he was going to do to her. She was so aroused now she thought his voice alone could push her over the edge.\u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-55.html","bookId":1824,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
