{"id":17875,"no":14,"title":"CHAPTER XIV — WILLIS FORD\u0027S NEW FRIENDS","content":"\u0026nbsp; \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Harry Decker left the office at the end of two weeks, Grant was fully able to take his place, having, with Harry\u0027s friendly assistance, completely mastered the usual routine of a broker\u0027s office. He had also learned the names and offices of prominent operators, and was, in all respects, qualified to be of service to his employer.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Reynolds always treated him with friendly consideration, and appeared to have perfect confidence in him. For some reason which he could not understand, however, Willis Ford was far from cordial, often addressing him in a fault-finding tone, which at first disturbed Grant. When he found that it arose from Ford\u0027s dislike, he ceased to trouble himself about it, though it annoyed him. He had discovered Ford\u0027s relationship to Mrs. Estabrook, who treated him in the same cool manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “As it appears I can\u0027t please them,” Grant said to himself, “I won\u0027t make any special effort to do so.” He contented himself with doing his work faithfully, and so satisfying his own conscience.\n\u003c/div\u003e \n\u003cdiv\u003e\n One evening some weeks later, Grant was returning from a concert, to which the broker had given him a ticket, when, to his great surprise, he met Willis Ford walking with Tom Calder and Jim Morrison. The three were apparently on intimate terms.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-evenin\u0027, Grant,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-evening, Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Grant looked at Willis Ford, but the latter\u0027s lip curled and he did not speak. Grant, however, bowed and passed on. He was surprised at the intimacy which had grown up between Ford and those two, knowing Ford\u0027s spirit of exclusiveness. He would have been less surprised had he known that Morrison had first ingratiated himself with Ford by offering to lend him money, and afterward had lured him into a gambling house, where Ford, not knowing that he was a dupe, had been induced to play, and was now a loser to the extent of several hundred dollars, for which Morrison held his notes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know when I can pay you,” said Ford, gloomily, when he came to realize his situation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, something will turn up.” said Jim Morrison, lightly. “I shan\u0027t trouble you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Two weeks later, however, he lay in wait for Ford when he left Wall Street.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want to speak to you a moment, Mr. Ford,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, what is it?” asked Ford, uncomfortably.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am hard up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So am I,” responded Willis Ford.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you owe me a matter of six hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know it, but you said you wouldn\u0027t trouble me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t expect I should be obliged to,” said Morrison, smoothly. “But \u0027Circumstances alter cases,\u0027 you know. I shall have to ask you for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s all the good it will do,” said Willis, irritably. “I haven\u0027t a cent to my name.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When do you expect to have?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Heaven knows; I don\u0027t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ford was about to leave his companion and walk away, but Morrison had no intention of allowing the matter to end so. He laid his hand on Ford\u0027s shoulder and said, firmly: “Mr. Ford, this won\u0027t do. Yours is a debt of honor, and must be paid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you be kind enough to let me know how it is to be paid?” demanded Ford, with an ugly sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is your business, not mine, Mr. Ford.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, if it is my business, I\u0027ll give you notice when I can pay you. And now, good-afternoon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He made another attempt to walk away, but again there was a hand placed upon his shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Understand, Mr. Ford, that I am in earnest,” said Morrison. “I can\u0027t undertake to tell you how you are to find the money, but it must be found.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose it isn\u0027t?” said Ford, with a look of defiance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I shall seek an interview with your respected employer, tell him of the debt, and how it was incurred, and I think he would look for another clerk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You wouldn\u0027t do that!” said Ford, his face betraying consternation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would, and I will, unless you pay what you owe me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, man, how am I to do it? You will drive me to desperation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take three days to think of it. If you can\u0027t raise it, I may suggest a way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two parted, and Willis Ford was left to many uncomfortable reflections. He knew of no way to raise the money; yet, if he did not do it, he was menaced with exposure and ruin. Would his stepmother come to his assistance? He knew that Mrs. Estabrook had a thousand dollars in government bonds. If he could only induce her to give him the custody of them on any pretext, he could meet the demand upon him, and he would never again incur a debt of honor. He cursed his folly for ever yielding to the temptation. Once let him get out of this scrape, and he would never get into another like it.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next evening he made a call upon Mrs. Estabrook, and made himself unusually agreeable. The cold-hearted woman, whose heart warmed to him alone, smiled upon him with affection.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to see you in such good spirits, Willis,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If she only knew how I really felt,” thought her stepson. But it was for his interest to wear a mask.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The fact is, mother,” he said, “I feel very cheerful. I\u0027ve made a little turn in stocks, and realized three hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you, indeed, Willis? I congratulate you, my son. No doubt you will find the money useful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No doubt of that. If I had the capital, I could make a good deal more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But there would be the danger of losing,” suggested Mrs. Estabrook.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That danger is very small, mother. I am in a situation to know all about the course of stocks. I wouldn\u0027t advise another to speculate, unless he has some friend in the Stock Exchange; but for me it is perfectly safe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pray be careful, Willis.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes. I am sure to be. By the way, mother, haven\u0027t you got some money in government bonds?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A little,” answered Mrs. Estabrook, cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much, now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About a thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me manage it for you, and I will make it two thousand inside of a month.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Estabrook had a large share of acquisitiveness, but she had also a large measure of caution, which she had inherited from her Scotch ancestry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Willis,” she said, shaking her head, “I can\u0027t take any risk. This money it has taken me years to save. It is the sole dependence I have for my old age, and I can\u0027t run the risk of losing it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But two thousand dollars will be better than one, mother. Just let me tell you what happened to a customer of ours: He had above five hundred dollars in the savings bank, drawing four per cent interest—only twenty dollars a year. He had a friend in the Stock Exchange who took charge of it, bought stocks judiciously on a margin, then reinvested, and now, after three months, how much do you think it amounts to?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much?” asked the housekeeper, with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Six thousand five hundred dollars—just thirteen times as much!” answered Willis, glibly.\n\u003c/div\u003e \n\u003cdiv\u003e\n This story, by the way, was all a fabrication, intended to influence his stepmother. Mrs. Estabrook never doubted Ford\u0027s statement, but her instinctive caution saved her from falling into the trap.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It looks tempting, Willis,” she said, “but I don\u0027t dare to take the risk.” Ford was deeply disappointed, but did not betray it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is for you to decide,” said he, carelessly, then drifted to other subjects.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ten minutes later he pressed his hand upon his breast, while his features worked convulsively. “I believe I am sick,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What can I do for you, my dear son?” asked the housekeeper, in alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you have a glass of brandy!” gasped Willis.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will go downstairs and get some,” she said, hurriedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n No sooner had she left the room than Willis sprang to his feet, locked the door, then went to the bureau, unlocked the upper drawer—he had a key in his pocket which fitted the lock and, thrusting in his hand, drew out a long envelope containing one five-hundred-dollar government bond and five bonds of one hundred dollars each, which he thrust into his side pocket. Then, closing the drawer, he unlocked the door of the room, and when his step-mother returned he threw himself back in his chair, groaning. He took the glass of brandy the housekeeper brought him, and, after a few minutes, professing himself much better, left the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Saved!” he exclaimed, triumphantly. “Now I shall be all right again.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2976/82013.html","bookId":347,"creation":"Aug 2, 2019 9:13:55 AM","modification":"Aug 2, 2019 9:13:55 AM"}
