{"id":17876,"no":15,"title":"CHAPTER XV — AN ARTFUL TRAP","content":"\u0026nbsp;Willis Ford was anxious to get away. He feared that Mrs. Estabrook might go to the bureau and discover the loss before he got out of the house, which would make it awkward for him. Once out in the street, he breathed more freely. He had enough with him to pay his only debt, and give him four hundred dollars extra. It might be supposed he would feel some compunction at robbing his stepmother of her all. Whatever her faults, she was devoted to him. But Willis Ford had a hard, selfish nature, and the only thought that troubled him was the fear that he might be found out. Indeed, the housekeeper\u0027s suspicions would be likely to fall upon him unless they could be turned in some other direction. Who should it be? There came to him an evil suggestion which made his face brighten with relief and malicious joy. The new boy, Grant Thornton, was a member of the household. He probably had the run of the house. What more probable than that he should enter Mrs. Estabrook\u0027s chamber and search her bureau? This was the way Willis reasoned. He knew that his stepmother hated Grant, and would be very willing to believe anything against him. He would take care that suspicion should fall in that direction. He thought of a way to heighten that suspicion. What it was my readers will learn in due time. \n\u003cdiv\u003e\n The next day, at half-past eight o\u0027clock in the morning, on his way down Broadway, Willis Ford dropped into the Grand Central Hotel, and walked through the reading room in the rear. Here sat Jim Morrison and Tom Calder, waiting for him by appointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ford took a chair beside them.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-morning,” he said, cheerfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you brought the money?” asked Morrison, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush! don\u0027t speak so loud,” said Ford, cautiously. “We don\u0027t want everybody to know our business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said Morrison, in a lower voice; “but have you brought it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re a trump!” said Morrison, his face expressing his joy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is to say, I\u0027ve brought what amounts to the same thing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it\u0027s your note,” said Morrison, with sharp disappointment, “I don\u0027t want it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn\u0027t a note. It\u0027s what will bring the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s government bonds for six hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know anything about bonds,” said Morrison. “Besides, the amount is more than six hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “These bonds are worth a hundred and twelve, amounting in all to six hundred and seventy-two dollars. That\u0027s forty more than I owe you. I won\u0027t make any account of that, however, as you will have to dispose of them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may get into trouble,” said Morrison, suspiciously. “Where did they come from?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That does not concern you,” said Ford, haughtily. “Don\u0027t I give them to you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But where did you get them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my business. If you don\u0027t want them, say the word, and I\u0027ll take them back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when will you pay the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know,” answered Ford, curtly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe he\u0027ll sell \u0027em for us himself,” suggested Tom Calder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good, Tom! Why can\u0027t you sell \u0027em and give me the money? Then you can pay the exact sum and save the forty dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t choose to do so,” said Ford. “It seems to me you are treating me in a very strange manner. I offer you more than I owe you, and you make no end of objections to receiving it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid I\u0027ll get into trouble if I offer the bonds for sale,” said Morrison, doggedly. “I don\u0027t know anybody in the business except you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, you do,” said Ford, a bright idea occurring to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know the boy in our office.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Grant Thornton?” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Grant Thornton. Manage to see him, and ask him to dispose of the bonds for you. He will bring them to our office, and I will dispose of them without asking any questions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “First rate!” said Tom. “That\u0027ll do, won\u0027t it, Jim?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t see why it won\u0027t,” answered Morrison, appearing satisfied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would suggest that you see him some time today.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good! Hand over the bonds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Willis Ford had already separated the bonds into two parcels, six hundred in one and four hundred in the other. The first of these he passed over to Jim Morrison.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Put it into your pocket at once,” he said. “We don\u0027t want anyone to see them. There is a telegraph boy looking at us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m going to see if it is all there,” muttered Morrison; and he drew from the envelope the two bonds, and ascertained, by a personal inspection, that they were as represented.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s all right,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You might have taken my word for it,” said Willis Ford, offended.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In matters of business I take no one\u0027s word,” chuckled the confidence man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what they\u0027re up to,” said the little telegraph boy to himself. “I know one of them fellers is a gambler. Wonder who that feller with him is? Them must be gov\u0027ment bonds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Johnny Cavanagh was an observing boy, and mentally photographed upon his memory the faces of the entire group, though he never expected to see any of them again.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Grant was hurrying through Wall Street about noon he came upon Tom Calder and Morrison.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hello, there, Grant,” said Tom, placing his hand upon his shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s the matter, Tom? I\u0027m in a hurry,” said Grant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jim Morrison\u0027s got a little business for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He wants you to sell gov\u0027ment bonds for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027d better take them round to our office.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven\u0027t got time,” said Morrison. “Just attend to them, like a good fellow, and I\u0027ll give you a dollar for your trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much have you got?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Six hundred—a five hundred and a one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are they yours?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I\u0027ve had \u0027em two years, but now I\u0027ve got to raise money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want for them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Regular price, whatever it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When will you call for the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Meet me at Fifth Avenue Hotel with it tomorrow morning at nine o\u0027clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall have to meet you earlier—say half-past eight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right. Here\u0027s the bonds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Grant put the envelope into his pocket, and hurried to the Exchange.\n\u003c/div\u003e \n\u003cdiv\u003e\n When he returned to the office he carried the bonds to Willis Ford.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Ford,” he said, “an acquaintance of mine handed them to me to be sold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some one you know?” queried Ford.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know him slightly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I suppose it\u0027s all right. I\u0027ll make out a check to your order, and you can collect the money at the bank.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Grant interposed no objection, and put the check in his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The boy\u0027s fallen into the trap,” said Willis to himself, exultantly, as he proceeded to enter the transaction on the books.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2976/82014.html","bookId":347,"creation":"Aug 2, 2019 9:13:58 AM","modification":"Aug 2, 2019 9:13:58 AM"}
