{"id":17880,"no":19,"title":"CHAPTER XIX — IMPORTANT EVIDENCE","content":"\u0026nbsp;Mr. Reynolds looked rather surprised when Grant appeared, drawing the telegraph boy after him. \n\u003cdiv\u003e\n “This boy has got something to tell you about Mr. Ford,” said Grant, breathless with excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “About Mr. Ford?” repeated the broker. “What do you know about Willis Ford?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know his name,” replied Johnny. “It\u0027s the chap that just went out of the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was Mr. Ford,” explained Grant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me what you know about him,” said the broker, encouragingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I seed him in the Grand Central Hotel, givin\u0027 some bond to a flashy-lookin\u0027 man. There was a boy wid him, a big boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “With whom—Mr. Ford?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, wid the other chap.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know who he means, sir,” said Grant. “It was Tom Calder.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And the man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was Jim Morrison, the same man that gave me the bonds to sell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That seems important,” said Mr. Reynolds. “I did not believe Ford capable of such rascality.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He had as good a chance to take the bonds as I, sir. He was here last evening.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was he?” asked the broker, quickly. “I did not know that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was here for an hour at least. I saw him come in and go out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Reynolds asked several more questions of the telegraph boy, and enjoined him to silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My boy,” he said, “come here to-morrow evening at half-past seven. I may want you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will, sir, if I can get away. I shall be on duty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say to the telegraph company that I have an errand for you. Your time will be paid for.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will make it all right, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And, meanwhile, here is a dollar for your own use.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Johnny\u0027s eyes sparkled, for with his limited earnings this sum would come in very handy. He turned away, nearly forgetting the original errand that brought him to the house, but luckily it occurred in time. The nature of it has nothing to do with this story.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Johnny had gone, Mr. Reynolds said: “Grant, I need not caution you not to breathe a word of this. I begin to think that there is a conspiracy against you; but whether Willis Ford is alone in it, or has a confederate I cannot decide. My housekeeper does not appear to like you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir, I am sorry to say she does not; but I don\u0027t think she is in this plot. I think she honestly believes that I stole her bonds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have too great confidence in you to believe it. I own I was a little shaken when the key was found. You have no idea how it came in your pocket, I suppose?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir, I can\u0027t guess. I might suspect Mr. Ford of putting it there, but I can\u0027t see how he managed it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, we will let matters take their course. You will go to work as usual, and not speak a word of what has happened this evening.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, we must follow Willis Ford. When he left the house, he was by no means in a comfortable frame of mind. He felt that it was absolutely necessary to see Jim Morrison, and have an understanding with him. What arrangements he could make with him, or how he could reconcile him to the loss of the money which he had expected to receive from the sale of the bonds, he could not yet imagine. Perhaps he would be willing to receive the other four bonds in part payment. In that case Willis himself would not profit as much as he had hoped from the theft; but there seemed no alternative. He had got himself into a scrape, and he must get out of it the best way possible.\n\u003c/div\u003e \n\u003cdiv\u003e\n Though he did not know where to find Morrison, he thought it likely that he might be seen at the White Elephant, a large and showy billiard room on Broadway, near Thirtieth Street. There were several gambling houses near by, and there or in that neighborhood he thought that Morrison might be met.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was right. On entering the billiard room he found the man he sought playing a game of billiards with Tom Calder, at the first table.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want to see you, Morrison,” he said, in a low voice. “Is the game \u0027most finished?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have only six points more to make. I shall probably run out this time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He was right in his estimate. Two minutes later the two went out of the saloon together, accompanied by Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, what is it?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us turn into a side street.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They turned into Thirtieth Street, which was much less brilliantly lighted than Broadway, and sauntered leisurely along.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you buy the bonds of that boy?” asked Morrison, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it\u0027s all right. Have you brought me the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How should I?” returned Ford, impatiently. “I couldn\u0027t pay him, and keep the money myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, it doesn\u0027t matter. He is to meet me to-morrow morning and hand over the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid you will be disappointed.” “Disappointed,” repeated Morrison, quickly. “What do you mean? The boy hasn\u0027t made off with the money, has he? If he has—-” and the sentence ended with an oath.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, it isn\u0027t as you suppose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then why won\u0027t he pay me the money, I\u0027d like to know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is some trouble about the bonds. It is charged that they are stolen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How is that? You gave them to me,” said Morrison, suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now came the awkward moment. However, Ford had decided on the story he would tell.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They were given me by a person who owed me money,” he said, plausibly. “How was I to know they were stolen?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They were stolen, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose so. In fact, I know so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well—in fact, they were stolen from my stepmother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Morrison whistled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course you mustn\u0027t say that I gave them to you. You would get me into trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you want to save yourself at my expense? I am to be suspected of stealing the bonds, am I? That\u0027s a decidedly cool proposal, but it won\u0027t do. I shall clear myself, by telling just where I got the bonds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s what I want you to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You do!” ejaculated the gambler, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. You are to say that the boy gave them to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why should I say that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because he is already suspected of stealing the bonds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I gave them to him to sell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mustn\u0027t admit it. There is no proof of it except his word.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s your game? Whatever it is, it is too deep for me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve got it all arranged. You are to say that the boy owed you a gambling debt, and agreed to meet you to-morrow morning to pay it. Of the bonds, you are to know nothing, unless you say that he told you he had some which he was going to sell, in order to get money to pay you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What advantage am I to get out of all this?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What advantage? Why, you will save yourself from suspicion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn\u0027t enough. I didn\u0027t take the bonds, and you know it. I believe you did it yourself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush!” said Willis Ford, looking around him nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, Ford, I gave up your I O U, and now I find I\u0027ve got to whistle for my money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go with me to my room, and you shall have four hundred dollars to-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In cash?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; in bonds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some more of the same kind? No, thank you, I want ready money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then give me a little more time, and I will dispose of them—when this excitement blows over.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally Morrison gave a sulky assent, and the conspirators parted.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2976/82018.html","bookId":347,"creation":"Aug 2, 2019 9:14:13 AM","modification":"Aug 2, 2019 9:14:13 AM"}
