{"id":17881,"no":20,"title":"CHAPTER XX — AT THE FIFTH AVENUE HOTEL","content":"\u0026nbsp;“If I thought he was playing me false,” said Jim Morrison, after Ford and himself had parted company, “I\u0027d make him smart for it.” \n\u003cdiv\u003e\n “I guess it\u0027s all right,” said Tom, who was less experienced and less suspicious than his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It may be so, but I have my suspicions. I don\u0027t trust Willis Ford.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall you go round to the Fifth Avenue Hotel to meet Grant to-morrow morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course I shall. I want to see what the boy says. It may be a put-up job between him and Ford.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The very same question was put by Grant to Mr. Reynolds.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I go round to the hotel to-morrow morning to see Morrison and Tom Calder?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The broker paused a moment and looked thoughtful.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he answered, after a pause. “You may.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what shall I say when he demands the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Upon this Mr. Reynolds gave Grant full instructions as to what he desired him to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n About quarter after eight o\u0027clock the next morning a quiet-looking man, who looked like a respectable bookkeeper entered the Fifth Avenue Hotel and walked through the corridor, glancing, as it seemed, indifferently, to the right and left. Finally he reached the door of the reading room and entered. His face brightened as at the further end he saw two persons occupying adjoining seats. They were, in fact, Morrison and Tom Calder.\n\u003c/div\u003e \n\u003cdiv\u003e\n The newcomer selected a Boston daily paper, and, as it seemed, by chance, settled himself in a seat not six feet away from our two acquaintances, so that he could, without much effort, listen to their conversation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s almost time for Grant to come,” said Tom, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” grumbled Morrison, “but as he won\u0027t have any money for me, I don\u0027t feel as anxious as I should otherwise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027ll you say to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know yet. I want to find out whether Ford has told the truth about the bonds. I believe he stole \u0027em himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes later Grant entered the reading-room. A quick glance showed him, not only the two he had come to meet, but the quiet, little man who was apparently absorbed in a copy of the Boston Journal. He went up at once to meet them.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe I am in time,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Jim Morrison. “Have you brought the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?” demanded Morrison, with a frown.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There was something wrong about the bonds you gave me to sell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Weren\u0027t they all right? They weren\u0027t counterfeit, were they?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They were genuine, but—-”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But what?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A lady claims that they belong to her—that they were stolen from her. Of course you can explain how they came into your hands?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They were given me by a party that owed me money. If he\u0027s played a trick on me, it will be the worse for him. Did you sell them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then give me the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Reynolds won\u0027t let me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does he think I took the bonds?” asked Morrison, hastily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, he doesn\u0027t,” answered Grant, proudly, “but he would like to have an interview with you, and make some inquiries, so that he may form some idea as to the person who did take them. They belonged to his housekeeper, Mrs. Estabrook, who is the stepmother of Mr. Ford, a young man employed in our office.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom Calder and Jim Morrison exchanged glances. Grant\u0027s story agreed with Ford\u0027s, and tended to confirm their confidence in his good faith.\n\u003c/div\u003e \n\u003cdiv\u003e\n “When does he want to see me?” asked Morrison.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you call at his house this evening at eight o\u0027clock?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where does he live?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Grant mentioned the street and number.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will be there,” he said, briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can I come, too?” asked Tom Calder, addressing the question to Grant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There will be no objection, I think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell him we\u0027ll be on hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The three left the hotel together, Grant taking a Broadway stage at the door. The quiet man seemed no longer interested in the Boston Journal, for he hung it up in its place, and sauntered out of the hotel. He had not attracted the attention of Jim Morrison or Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Grant entered the office, and with his usual manner asked Ford if he should go to the post-office, the young man eyed him curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you to remain in the office?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I suppose so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “After what you have done?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have I done, Mr. Ford?” asked Grant, eyeing the young man, steadily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t think you need to have me tell you,” he said, with a sneer. “I don\u0027t think Mr. Reynolds is very prudent to employ a boy convicted of dishonesty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you believe me guilty, Mr. Ford?” asked our hero, calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The evidence against you is overwhelming. My mother ought to have you arrested.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The person who stole the bonds may be arrested.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” asked Willis Ford, flushing, and looking disconcerted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean that I have no concern in the matter. Shall I go to the post-office?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” snapped Ford, “and take care you don\u0027t steal any of the letters.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Grant did not reply. He knew that his vindication was certain, and he was willing to wait.\n\u003c/div\u003e \n\u003cdiv\u003e\n If Willis Ford had been prudent he would have dropped the matter there, but his hatred of Grant was too great to be easily concealed. When a few minutes later the broker entered the office and inquired, “Where is Grant?” Ford, after answering, “he has gone to the post-office,” could not help saying, “Are you going to keep that boy, Mr. Reynolds?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why should I not?” the broker replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought a boy in his position ought to be honest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I agree with you, Mr. Ford,” said the broker, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “After taking my mother\u0027s bonds, that can hardly be said of Grant Thornton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You seem to be sure he did take them, Mr. Ford.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The discovery of the key settled that to my mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Grant says he has no knowledge of the key.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ford laughed scornfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course he would say so,” he replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I propose to investigate the matter further,” said the broker. “Can you make it convenient to call at my house this evening? Possibly something may be discovered by that time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; I will come, with pleasure. I have no feeling in regard to the boy, except that I don\u0027t think it safe to employ him in a business like yours.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I agree with you, Mr. Ford. One who is capable of stealing bonds from a private house is unfit to be employed in an office like mine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yet you retain the boy, sir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “For the present. It is not fair to assume that he is guilty till we have demonstrated it beyond a doubt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think there will be no difficulty about that, Mr. Reynolds,” said Willis Ford, well pleased at these words.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I sincerely hope that his innocence may be proved.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon afterward Mr. Reynolds went to the Stock Exchange, and Willis Ford returned to his routine duties.\n\u003c/div\u003e \n\u003cdiv\u003e\n “With the testimony of Jim Morrison I shall be able to fix you, my young friend,” he said to himself, as Grant returned from the post-office.\n\u003c/div\u003e \n\u003cdiv\u003e\n No further allusion was made to the matter during the day. Grant and Willis Ford were both looking forward to the evening, but for different reasons. Grant expected to be vindicated, while Ford hoped he could convince the broker of the boy\u0027s guilt.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2976/82019.html","bookId":347,"creation":"Aug 2, 2019 9:14:17 AM","modification":"Aug 2, 2019 9:14:17 AM"}
