{"id":17895,"no":34,"title":"CHAPTER XXIV — MRS. BARTON\u0027S SURPRISE","content":"\u0026nbsp;A hearty breakfast, consisting of beefsteak, potatoes, corn bread, fresh butter and apple sauce, made Abner\u0027s eyes glisten, for he had never in his remembrance sat down at home to a meal equally attractive. He wielded his knife and fork with an activity and energy which indicated thorough enjoyment. Even Herbert, though in the city his appetite had been delicate, and he had already eaten part of a loaf of bread, did excellent justice to the good things set before him. He was himself surprised at his extraordinary appetite, forgetting the stimulating effect of a seven-mile walk. \n\u003cdiv\u003e\n After breakfast they set out again on their tramp. At sunset, having rested several hours in the middle of the day, they had accomplished twenty miles. Abner could have gone further, but Herbert was well tired out. They obtained permission from a friendly farmer to spend the night in his barn, and retired at half-past seven. Mr. Reynolds would have been shocked had he known that his little son was compelled to sleep on a pile of hay, but it may truthfully be said that Herbert had seldom slept as soundly or felt more refreshed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you sleep, Abner?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Like a top. How was it with you, bub?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t wake up all night,” answered the little boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what dad and marm thought when they found us gone?” said Abner, with a grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Won\u0027t they feel bad?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not much,” said Abner. “They ain\u0027t that kind. I reckon it won\u0027t spoil their appetite.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When they descended from the haymow, the farmer was milking his cows.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, youngsters,” he said, “so you\u0027re up and dressed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And ready for breakfast, I\u0027ll be bound.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon I should feel better for eatin\u0027,” said Abner, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jest you wait till I get through milkin\u0027, and we\u0027ll see what Mrs. Wiggins has got for us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Abner heard these words with joy, for he was always possessed of a good appetite.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, bub, I\u0027m glad I run away,” he remarked, aside, to Herbert. “We live enough sight better than we did at home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Leaving the boys to pursue their journey, we will return to the bereaved parents, and inquire how they bore their loss.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Mrs. Barton rose to commence the labors of the day, she found that no wood was on hand for the kitchen fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Abner\u0027s gittin\u0027 lazier and lazier,” she soliloquized. “I\u0027ll soon have him up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She went to the foot of the stairs, and called “Abner!” in a voice by no means low or gentle.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That boy would sleep if there was an earthquake,” she muttered. “Come down here and split some wood, you lazy boy!” she cried, still louder.\n\u003c/div\u003e \n\u003cdiv\u003e\n Again no answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He hears, fast enough, but he don\u0027t want to work. I\u0027ll soon have him down.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She ascended the stairs, two steps at a time, and opened the door of her son\u0027s room.\n\u003c/div\u003e \n\u003cdiv\u003e\n If Abner had been in bed his mother would have pulled him out, for her arm was vigorous, but the bed was empty.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I vum!” she ejaculated, in surprise. “Ef that boy isn\u0027t up already. That\u0027s a new wrinkle. And the little boy gone, too. What can it mean?”\n\u003c/div\u003e \n\u003cdiv\u003e\n It occurred to Mrs. Barton that Abner and Herbert might have got up early to go fishing, though she had never known him to make so early a start before.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon breakfast\u0027ll bring \u0027em round,” she said to herself. “I reckon I shall have to split the wood myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In half an hour breakfast was ready. It was of a very simple character, for the family resources were limited. Mr. Barton came downstairs, and looked discontentedly at the repast provided.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is a pretty mean breakfast, Mrs. B.,” he remarked. “Where\u0027s your meat and taters?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s plenty of \u0027em in the market,” answered Mrs. Barton.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, why didn\u0027t you buy some?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ought to know, Joel Barton. You give me the money, and I\u0027ll see that you have a good breakfast.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where\u0027s all the money that man Ford gave you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is it? It\u0027s eaten up, Mr. Barton, and you did your share. Ef you\u0027d had your way, you\u0027d have spent some of the money for drink.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why don\u0027t he send you some more, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ef you see him anywheres, you\u0027d better ask him. It\u0027s your business to provide me with money; you can\u0027t expect one boy\u0027s board to support the whole family.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s strange where them boys are gone,” said Joel, desirous of changing the subject. “Like as not, they hid under the bed, and fooled you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ef they did, I\u0027ll rout \u0027em out,” said Mrs. Barton, who thought the supposition not improbable.\n\u003c/div\u003e \n\u003cdiv\u003e\n Once more she ascended the stairs and made an irruption into the boy\u0027s chamber. She lifted the quilt, and peered under the bed. But there were no boys there. Looking about the room, however, she discovered something else. On the mantelpiece was a scrap of paper, which appeared to be so placed as to invite attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s that?” said Mrs. Barton to herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n A moment later she was descending the staircase more rapidly than she had gone up just before.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look at that,” she exclaimed, holding out a scrap of paper to Joel Barton.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t see nothin\u0027 but a bit of paper,” said her husband.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t be a fool! Read what it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Read it aloud. I ain\u0027t got my specks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The boys have run away. Abner writ it. Listen to this.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Rudely written on the paper, for Abner was by no means a skillful penman, were these words:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bub and I have runned away. You needn\u0027t worry. I reckon we can get along. We\u0027re going to make our fortunes. When we\u0027re rich, we\u0027ll come back. ABNER.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you think of that, Joel Barton?” demanded his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n Joel shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shan\u0027t worry much,” he said. “They\u0027ll be back by to-morrer, likely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you\u0027ll have to split some wood to-day, Joel. You can\u0027t expect a delicate woman like me to do such rough work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re stronger\u0027n I be, Mrs. B.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you\u0027ll find I am if you don\u0027t go to work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll do it this afternoon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right. Then we\u0027ll have dinner in the even-in\u0027. No wood, no dinner.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seems to me you\u0027re rather hard on me, Mrs. B. I don\u0027t feel well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor you won\u0027t till you give up drinkin\u0027.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Much against his will, Mr. Barton felt compelled by the stress of circumstances to do the work expected of him. It made him feel angry with Abner, whom he did not miss for any other reason.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll break that boy\u0027s neck when he comes back,” he muttered. “It\u0027s a shame to leave all this work for his poor, old dad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n To-morrow came, but the boys did not. A week slipped away, and still they were missing. Mrs. Barton was not an affectionate mother, but it did seem lonesome without Abner. As for Herbert, she did not care for his absence. If Willis Ford did not continue to pay his board, she felt that she would rather have him away.\n\u003c/div\u003e \n\u003cdiv\u003e\n On the sixth day after the departure of the boys there came a surprise for Mrs. Barton.\n\u003c/div\u003e \n\u003cdiv\u003e\n As she was at work in the kitchen, she heard a loud knock at the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can it be Abner?” she thought. “He wouldn\u0027t knock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She went to the door, however, feeling rather curious as to who could be her visitor, and on opening it started in surprise to see Willis Ford.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Ford!” she ejaculated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought I would make you a call,” answered Ford. “How\u0027s the boy getting along?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you mean the boy you left here,” she answered, composedly, “he\u0027s run away, and took my boy with him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Run away!” ejaculated Ford, in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he made tracks about a week ago. He and my Abner have gone off to make their fortunes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn\u0027t you take better care of him, woman?” exclaimed Ford, angrily. “It\u0027s your fault, his running away!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, Ford,” retorted Mrs. Barton; “don\u0027t you sass me, for I won\u0027t stand it. Ef it hadn\u0027t been for you, Abner would be at home now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t mean to offend you, my dear Mrs. Barton,” said Ford, seeing that he had made a false step. “Tell me all you can, and I\u0027ll see if I can\u0027t get the boys back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now you\u0027re talkin\u0027,” said Mrs. Barton, smoothing her ruffled plumage. “Come into the house, and I\u0027ll tell you all I know.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2976/82033.html","bookId":347,"creation":"Aug 2, 2019 9:14:46 AM","modification":"Aug 2, 2019 9:14:46 AM"}
