{"id":17897,"no":36,"title":"CHAPTER XXXVI — GRANT RECEIVES A LETTER","content":"\u0026nbsp;Mr. Reynolds had spared no expense in his efforts to obtain tidings of his lost boy. None of his agents, however, had succeeded in gaining the smallest clew to Herbert\u0027s whereabouts. Through the public press the story had been widely disseminated, and in consequence the broker began to receive letters from various points, from persons professing to have seen such a boy as the one described. One of these letters came from Augusta, Ga., and impressed Mr. Reynolds to such an extent that he decided to go there in person, and see for himself the boy of whom his correspondent wrote. \n\u003cdiv\u003e\n The day after he started Grant, on approaching the house at the close of business, fell in with the postman, just ascending the steps.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got a letter for me?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have a letter for Grant Thornton,” was the reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my name,” said Grant.\n\u003c/div\u003e \n\u003cdiv\u003e\n He took the letter, supposing it to be from home. He was surprised to find that it had a Western postmark. He was more puzzled by the feminine handwriting.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you heard anything from the little boy?” asked the postman, for Mr. Reynolds\u0027 loss was well known.\n\u003c/div\u003e \n\u003cdiv\u003e\n Grant shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing definite,” he said. “Mr. Reynolds has gone to Georgia to follow up a clew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two weeks since,” said the postman, “I left a letter here dated at Scipio, Ill. It was in a boy\u0027s handwriting. I thought it might be from the lost boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A letter from Scipio, in a boy\u0027s handwriting!” repeated Grant, surprised. “Mr. Reynolds has shown me all his letters. He has received none from there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t understand it. I left it here, I am positive of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At what time in the day?” asked Grant, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “About eleven o\u0027clock in the forenoon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you tell to whom you gave it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To the servant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is very strange,” said Grant, thoughtfully. “And it was in a boy\u0027s handwriting?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; the address was in a round, schoolboy hand. The servant couldn\u0027t have lost it, could she?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; Sarah is very careful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I must be going.”\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time Grant had opened the letter. He had glanced rapidly at the signature, and his face betrayed excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is from Herbert,” he said. “You may listen, if you like.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He rapidly read the letter, which in part was as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n “DEAR GRANT: I write to you, or rather I have asked Miss Stone, who is taking care of me, to do so, because I wrote to papa two weeks since, and I am afraid he did not get the letter, for I have had no answer. I wrote from the town of Scipio, in Illinois—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just what I said,” interrupted the postman.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wrote that Mr. Ford had carried me away and brought me out West, where he put me to board in a poor family, where I had scarcely enough to eat. Mr. Barton had one son, Abner, who treated me well, and agreed to run away with me to New York, if we could get money from papa. But we waited and waited, and no letter came. So at last we decided to run away at any rate, for I was afraid Mr. Ford would come back and take me somewhere else. I can\u0027t tell you much about the journey, except that we walked most of the way, and we got very tired—or, at least, I did, for I am not so strong as Abner—till I broke down. I am stopping now at the house of Dr. Stone, who is very kind, and so is his sister, who is writing this letter for me. Will you show papa this letter, and ask him to send for me, if he cannot come himself? I do so long to be at home once more. I hope he will come before Willis Ford finds me out. I think he has a spite against papa, and that is why he stole me away. Your affectionate friend,\n\u003c/div\u003e \n\u003cdiv\u003e\n “HERBERT REYNOLDS.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Please say nothing about this,” said Grant to the postman. “I don\u0027t want it known that this letter has come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will you do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall start for the West myself to-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mrs. Estabrook intercepted that letter,” said Grant to himself. “I am sure of it.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2976/82035.html","bookId":347,"creation":"Aug 2, 2019 9:14:52 AM","modification":"Aug 2, 2019 9:14:52 AM"}
