{"id":17898,"no":37,"title":"CHAPTER XXXVII — WILLIS FORD FINDS THE RUNAWAYS","content":"\u0026nbsp;“I shall be absent for a few days, Mrs. Estabrook,” said Grant to the housekeeper, as he entered the house. \n\u003cdiv\u003e\n “Where are you going?” she inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t tell you definitely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hadn\u0027t you better wait till Mr. Reynolds gets back?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; business is not very pressing in the office, and I can be spared.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The housekeeper concluded that Grant was going to Colebrook, and did not connect his journey with the lost boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, I suppose you understand your own business best. Herbert will miss you if he finds you away when his father brings him back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think he will?” asked Grant, eyeing the housekeeper sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m sure I don\u0027t know. I suppose he expects to, or he would not have traveled so far in search of him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall you be glad to see him back, Mrs. Estabrook?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course! What makes you doubt it?” demanded the housekeeper, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you didn\u0027t like Herbert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wasn\u0027t always petting him. It isn\u0027t in my way to pet boys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you often hear from Willis Ford?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my business,” answered Mrs. Estabrook, sharply. “Why do you ask?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was wondering whether he knew that Herbert had been abducted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is more than we know. Very likely the boy ran away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Grant called on the cashier at his private residence, confided to him his plan, and obtained a sum of money for traveling expenses. He left the Grand Central Depot by the evening train, and by morning was well on his way to Chicago.\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, Willis Ford had left no stone unturned to obtain news of the runaways. This he did not find difficult, though attended with delay. He struck the right trail, and then had only to inquire, as he went along, whether two boys had been seen, one small and delicate, the other large and well-grown, wandering through the country. Plenty had seen the two boys, and told him so.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are they your sons, mister?” asked a laborer of whom he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not both of them—only the smaller,” answered Ford, with unblushing falsehood.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what made them run away now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My son probably did not like the boarding place I selected for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn\u0027t he write to you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He didn\u0027t know where to direct.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is the other lad?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The son of the man I placed him with. I think he may have induced Sam to run away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally Ford reached Claremont, the town where the boys had actually found refuge. Here he learned that two boys had been taken in by Dr. Stone, answering to the description he gave. One, the younger one, had been sick, but now was better. This information he obtained at the hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ford\u0027s eyes sparkled with exultation. He had succeeded in his quest, and once more Herbert was in his hands, or would be very soon.\n\u003c/div\u003e \n\u003cdiv\u003e\n He inquired the way to Dr. Stone\u0027s. Everybody knew where the doctor lived, and he had no trouble in securing the information he sought. Indeed, before he reached the house, he caught sight of Abner, walking in the same direction with himself, but a few rods ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n He quickened his pace, and laid his hand on the boy\u0027s shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n Abner turned, and an expression of dismay overspread his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ha, my young friend! I see that you remember me,” said Ford, ironically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, what do you want?” asked Abner, sullenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know well enough. I want the boy you have persuaded to run away with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t persuade him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind about quibbling. I know where the boy is, and I mean to have him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you want me, too?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I don\u0027t care where you go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon Herbert won\u0027t go with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I reckon he will. That is Dr. Stone\u0027s, isn\u0027t it? Never mind answering. I know well enough it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027ll have bub sure,” said Abner, disconsolately. “But I\u0027ll follow \u0027em, and I\u0027ll get him away, as sure as my name\u0027s Abner Barton.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2976/82036.html","bookId":347,"creation":"Aug 2, 2019 9:14:55 AM","modification":"Aug 2, 2019 9:14:55 AM"}
