{"id":94019,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThere were quite a few. Many infected refugees had tried to swim for the ships and then reanimated after they drowned. It was low tide, just deep enough for a man to drown, but shallow enough for a standing ghoul to reach up for prey. You saw many swimmers suddenly vanish below the surface, or boats capsize with their passengers dragged under. And still rescuers continued to return to shore, or even jumped from ships to save people in the water.\u003c/p\u003e\n\u003cp\u003eThat was how I was saved. I was one of those who tried to swim. The ships looked much closer than they actually were. I was a strong swimmer, but after walking from Bhavnagar, after fighting for my life for most of that day, I barely had enough strength to float on my back. By the time I reached my intended salvation, there wasn’t enough air in my lungs to call for help. There was no gangway. The smooth side towered over me. I banged on the steel, shouting up with the last bit of breath I had.\u003c/p\u003e\n\u003cp\u003eJust as I slipped below the surface, I felt a powerful arm wrap around my chest. This is it, I thought; any second, I thought I would feel teeth dig into my flesh. Instead of pulling me down, the arm hauled me back up to the surface. I ended up aboard the Sir Wilfred Grenfell, an ex-Canadian Coast Guard cutter. I tried to talk, to apologize for not having any money, to explain that I could work for my passage, do anything they needed. The crewman just smiled. “Hold on,” he said to me, “we’re about to get under way.” I could feel the deck vibrate then lurch as we moved.\u003c/p\u003e\n\u003cp\u003eThat was the worst part, watching the other ships we passed. Some of the onboard infected refugees had begun to reanimate. Some vessels were floating slaughterhouses, others just burned at anchor. People were leaping into the sea. Many who sank beneath the surface never reappeared.\u003c/p\u003e\n\u003cp\u003eTOPEKA, KANSAS, USA\u003c/p\u003e\n\u003cp\u003e[Sharon could be considered beautiful by almost any standard—with long red hair, sparkling green eyes, and the body of a dancer or a prewar supermodel. She also has the mind of a four-year-old girl.\u003c/p\u003e\n\u003cp\u003eWe are at the Rothman Rehabilitation Home for Feral Children. Doctor Roberta Kelner, Sharon’s caseworker, describes her condition as “lucky.” “At least she has language skills, a cohesive thought process,” she explains. “It’s rudimentary, but at least it’s fully functional.” Doctor Kelner is eager for the interview, but Doctor Sommers, Rothman’s program director, is not. Funding has always been spotty for this program, and the present administration is threatening to close it down altogether.\u003c/p\u003e\n\u003cp\u003eSharon is shy at first. She will not shake my hand and seldom makes eye contact. Although Sharon was found in the ruins of Wichita, there is no way of knowing where her story originally occurred.]\u003c/p\u003e\n\u003cp\u003eWe were in church, Mommy and me. Daddy told us that he would come find us. Daddy had to go do something. We had to wait for him in church.\u003c/p\u003e\n\u003cp\u003eEverybody was there. They all had stuff. They had cereal, and water, and juice, and sleeping bags and flashlights and…[she mimes a rifle]. Mrs. Randolph had one. She wasn’t supposed to. They were dangerous. She told me they were dangerous. She was Ashley’s mommy. Ashley was my friend. I asked her where was Ashley. She started to cry. Mommy told me not to ask her about Ashley and told Mrs. Randolph that she was sorry. Mrs. Randolph was dirty, she had red and brown on her dress. She was fat. She had big, soft arms.\u003c/p\u003e\n\u003cp\u003eThere were other kids, Jill and Abbie, and other kids. Mrs. McGraw was watching them. They had crayons. They were coloring on the wall. Mommy told me to go play with them. She told me it was okay. She said Pastor Dan said it was okay.\u003c/p\u003e\n\u003cp\u003ePastor Dan was there, he was trying to make people listen to him. “Please everyone…” [she mimics a deep, low voice] “please stay calm, the ‘thorties’ are coming, just stay calm and wait for the ‘thorties.’” No one was listening to him. Everyone was talking, nobody was sitting. People were trying to talk on their things [mimes holding a cell phone], they were angry at their things, throwing them, and saying bad words. I felt bad for Pastor Dan. [She mimics the sound of a siren.] Outside. [She does it again, starting soft, then growing, then fading out again multiple times.]\u003c/p\u003e\n\u003cp\u003eMommy was talking to Mrs. Cormode and other mommies. They were fighting. Mommy was getting mad. Mrs. Cormode kept saying [in an angry drawl], “Well what if? What else can you do?” Mommy was shaking her head. Mrs. Cormode was talking with her hands. I didn’t like Mrs. Cormode. She was Pastor Dan’s wife. She was bossy and mean.\u003c/p\u003e\n\u003cp\u003eSomebody yelled…“Here they come!” Mommy came and picked me up. They took our bench and put it next to the door. They put all the benches next to the door. “Quick!” “Jam the door!” [She mimics several different voices.] “I need a hammer!” “Nails!” “They’re in the parking lot!” “They’re coming this way!” [She turns to Doctor Kelner.] Can I?\u003c/p\u003e\n\u003cp\u003e[Doctor Sommers looks unsure. Doctor Kelner smiles and nods. I later learn that the room is soundproofed for this reason.]\u003c/p\u003e\n\u003cp\u003e[Sharon mimics the moan of a zombie. It is undoubtedly the most realistic I have ever heard. Clearly, by their discomfort, Sommers and Kelner agree.]\u003c/p\u003e\n\u003cp\u003eThey were coming. They came bigger. [Again she moans. Then follows up by pounding her right fist on the table.] They wanted to come in. [Her blows are powerful, mechanical.] People screamed. Mommy hugged me tight. “It’s okay.” [Her voice softens as she begins to stroke her own hair.] “I won’t let them get you. Shhhh….”\u003c/p\u003e\n\u003cp\u003e[Now she bangs both fists on the table, her strikes becoming more chaotic as if to simulate multiple ghouls.] “Brace the door!” “Hold it! Hold it!” [She simulates the sound of shattering glass.] The windows broke, the windows in the front next to the door. The lights got black. Grown-ups got scared. They screamed.\u003c/p\u003e\n\u003cp\u003e[Her voice returns to her mother’s.] “Shhhh…baby. I won’t let them get you.” [Her hands go from her hair to her face, gently stroking her forehead and cheeks. Sharon gives Kelner a questioning look. Kelner nods. Sharon’s voice suddenly simulates the sound of something large breaking, a deep phlegm-filled rumble from the bottom of her throat.] “They’re coming in! Shoot ’em, shoot ’em!” [She makes the sound of gunfire then…] “I won’t let them get you, I won’t let them get you.” [Sharon suddenly looks away, over my shoulder to something that isn’t there.] “The children! Don’t let them get the children!” That was Mrs. Cormode. “Save the children! Save the children!” [Sharon makes more gunshots. She balls her hands into a large double fist, bringing it down hard on an invisible form.] Now the kids started crying. [She simulates stabbing, punching, striking with objects.] Abbie cried hard. Mrs. Cormode picked her up. [She mimes lifting something, or someone, up and swinging them against the wall.] And then Abbie stopped. [She goes back to stroking her own face, her mother’s voice has become harder.] “Shhh…it’s okay, baby, it’s okay…” [Her hands move down from her face to her throat, tightening into a strangling grip.] “I won’t let them get you. I WON’T LET THEM GET YOU!”\u003c/p\u003e\n\u003cp\u003e[Sharon begins to gasp for air.]\u003c/p\u003e\n\u003cp\u003e[Doctor Sommers makes a move to stop her. Doctor Kelner puts up a hand. Sharon suddenly ceases, throwing her arms out to the sound of a gunshot.]\u003c/p\u003e\n\u003cp\u003eWarm and wet, salty in my mouth, stinging my eyes. Arms picked me up and carried me. [She gets up from the table, mimicking a motion close to a football.] Carried me into the parking lot. “Run, Sharon, don’t stop!” [This is a different voice now, not her mother’s.] “Just run, run-run-run!” They pulled her away from me. Her arms let me go. They were big, soft arms.\u003c/p\u003e\n\u003cp\u003eKHUZHIR, OLKHON ISLAND, LAKE BAIKAL, THE HOLY RUSSIAN EMPIRE\u003c/p\u003e\n\u003cp\u003e[The room is bare except for a table, two chairs, and a large wall mirror, which is almost sure to be one-way glass. I sit across from my subject, writing on the pad provided for me (my transcriber has been forbidden for “security reasons”). Maria Zhuganova’s face is worn, her hair is graying, her body strains the seams of the fraying uniform she insists on wearing for this interview. Technically we are alone, although I sense watching eyes behind the room’s one-way glass.]\u003c/p\u003e\n\u003cp\u003eWe didn’t know that there was a Great Panic. We were completely isolated. About a month before it began, about the same time as that American newswoman broke the story, our camp was placed on indefinite communication blackout. All the televisions were removed from the barracks, all the personal radios and cell phones, too. I had one of those cheap disposable types with five prepaid minutes. It was all my parents could afford. I was supposed to use it to call them on my birthday, my first birthday away from home.\u003c/p\u003e\n\u003cp\u003eWe were stationed in North Ossetia, Alania, one of our wild southern republics. Our official duty was “peacekeeping,” preventing ethnic strife between the Ossetia and Ingush minorities. Our rotation was up about the same time they cut us off from the world. A matter of “state security” they called it.\u003c/p\u003e\n\u003cp\u003eWho were “they”?\u003c/p\u003e\n\u003cp\u003eEveryone: our officers, the Military Police, even a plain-clothed civilian who just seemed to appear one day out of nowhere. He was a mean little bastard, with a thin, rat face. That’s what we called him: “Rat Face.”\u003c/p\u003e\n\u003cp\u003eDid you ever try to find out who he was?\u003c/p\u003e\n\u003cp\u003eWhat, me personally? Never. Neither did anyone else. Oh, we griped; soldiers always gripe. But there also wasn’t time for any serious complaints. Right after the blackout was put into effect, we were placed on full combat alert. Up until then it had been easy duty—lazy, monotonous, and broken only by the occasional mountain stroll. Now we were in those mountains for days at a time with full battle dress and ammo. We were in every village, every house. We questioned every peasant and traveler and…I don’t know…goat that crossed our path.\u003c/p\u003e\n\u003cp\u003eQuestioned them? For what?\u003c/p\u003e\n\u003cp\u003eI didn’t know. “Is everyone in your family present?” “Has anyone gone missing?” “Has anyone been attacked by a rabid animal or man?” That was the part that confused me the most. Rabid? I understood the animal part, but man? There were a lot of physical inspections, too, stripping these people to their bare skin while the medics searched every inch of their bodies for…something…we weren’t told what.\u003c/p\u003e\n\u003cp\u003eIt didn’t make sense, nothing did. We once found a whole cache of weapons, 74s, a few older 47s, plenty of ammo, probably bought from some corrupt opportunist right in our battalion. We didn’t know who the weapons belonged to; drug runners, or the local gangsters, maybe even those supposed “Reprisal Squads” that were the reason for our deployment in the first place. And what did we do? We left it all. That little civilian, “Rat Face,” he had a private meeting with some of the village elders. I don’t know what was discussed, but I can tell you that they looked scared half to death: crossing themselves, praying silently.\u003c/p\u003e\n\u003cp\u003eWe didn’t understand. We were confused, angry. We didn’t understand what the hell we were doing out there. We had this one old veteran in our platoon, Baburin. He’d fought in Afghanistan and twice in Chechnya. It was rumored that during Yeltsin’s crackdown, his BMP 1 was the first to fire on the Duma. We used to like to listen to his stories. He was always good-natured, always drunk…when he thought he could get away with it. He changed after the incident with the weapons. He stopped smiling, there were no more stories. I don’t think he ever touched a drop after that, and when he spoke to you, which was rare, the only thing he ever said was, “This isn’t good. Something’s going to happen.” Whenever I tried to ask him about it, he would just shrug and walk away. Morale was pretty low after that. People were tense, suspicious. Rat Face was always there, in the shadows, listening, watching, whispering into the ears of our officers.\u003c/p\u003e\n\u003cp\u003eHe was with us the day we swept a little no-name town, this primitive hamlet at what looked like the edge of the world. We’d executed our standard searches and interrogations. We were just about to pack it in. Suddenly this child, this little girl came running down the only road in town. She was crying, obviously terrified. She was chattering to her parents…I wish I could have taken the time to learn their language…and pointing across the field. There was a tiny figure, another little girl, staggering across the mud toward us. Lieutenant Tikhonov raised his binoculars and I watched his face lose its color. Rat Face came up next to him, gave a look through his own glasses, then whispered something in the lieutenant’s ear. Petrenko, platoon sharpshooter, was ordered to raise his weapon and center the girl in his sights. He did. “Do you have her?” “I have her.” “Shoot.” That’s how it went, I think. I remember there was a pause. Petrenko looked up at the lieutenant and asked him to repeat the order. “You heard me,” he said angrily. I was farther away than Petrenko and even I’d heard him. “I said eliminate the target, now!” I could see the tip of his rifle was shaking. He was a skinny little runt, not the bravest or the strongest, but suddenly he lowered his weapon and said he wouldn’t do it. Just like that. “No, sir.” It felt like the sun froze in the sky. No one knew what to do, especially Lieutenant Tikhonov. Everyone was looking at one another, then we were all looking out at the field.\u003c/p\u003e\n\u003cp\u003eRat Face was walking out there, slowly, almost casually. The little girl was now close enough so we could see her face. Her eyes were wide, locked on Rat Face. Her arms were raised, and I could just make out this high-pitched, rasping moan. He met her halfway across the field. It was over before most of us realized what had happened. In one smooth motion, Rat Face pulled a pistol from underneath his coat, shot her right between the eyes, then turned around and sauntered back toward us. A woman, probably the little girl’s mother, exploded into sobs. She fell to her knees, spitting and cursing at us. Rat Face didn’t seem to care or even notice. He just whispered something to Lieutenant Tikhonov, then remounted the BMP as if he was hailing a Moscow taxicab. \u003c/p\u003e","sourceLink":"https://allnovel.net/world-war-z-an-oral-history-of-the-zombie-war/page-10.html","bookId":2579,"creation":"Oct 5, 2019 6:05:56 PM","modification":"Oct 5, 2019 6:05:56 PM"}
