{"id":86073,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe met his smoldering gaze without flinching. Maybe she’d been an idiot to return to Vegas, but she’d be damned if she let Luc intimidate her.\u003c/p\u003e\n\u003cp\u003e“Fine.” She folded her arms over her stomach, wishing to hell he’d put some clothes on. “Let’s hear your brilliant psychoanalysis.”\u003c/p\u003e\n\u003cp\u003eA portion of his anger seemed to ease at her taunting tone, his hand reaching to cup her chin. Did he sense her defensive vulnerability?\u003c/p\u003e\n\u003cp\u003e“It’s possible that you used the memory of me as a subconscious method of keeping other men at a distance,” he said, holding her derisive gaze. “Making me the bad guy was easier than admitting that you couldn’t open yourself up enough to reach your climax.”\u003c/p\u003e\n\u003cp\u003e“So why would I be able to—”\u003c/p\u003e\n\u003cp\u003e“Orgasm with me?” He finished her sentence, his lips twitching with a wry amusement at the heat that stained her cheeks.\u003c/p\u003e\n\u003cp\u003eShe scowled. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Because you trusted me.”\u003c/p\u003e\n\u003cp\u003eShe snorted at his ridiculous explanation. “Then more the fool me.”\u003c/p\u003e\n\u003cp\u003eHe grimaced at yet another reminder of his jackass behavior. “You trusted that I wasn’t going to press for more than you were willing to offer,” he clarified. “In your mind I was the guy who loved ‘em and left ‘em. No danger to your closely guarded heart.”\u003c/p\u003e\n\u003cp\u003eMadison barely resisted the urge to roll her eyes. She wasn’t about to admit that far from believing he was going to love and leave her, she’d devoted endless hours to fantasizing over the moment that Luc Angeli, the Dark Angel, would realize she was his one and only soul mate.\u003c/p\u003e\n\u003cp\u003eShe’d truly thought she was the woman to tame the bad boy.\u003c/p\u003e\n\u003cp\u003eWhat an idiot.\u003c/p\u003e\n\u003cp\u003e“So I want to be alone?” she instead played along.\u003c/p\u003e\n\u003cp\u003e“You want a life where you’re in complete control.” He stepped closer, watching her tense as the heat of his naked body wrapped around her. “Not surprising. You were abandoned by your mother. It had to leave you with a fear of opening yourself up to anyone.”\u003c/p\u003e\n\u003cp\u003eHer lips thinned. Logically she knew her past had been a driving force in leaving Vegas, as well as in her success in her career. She’d been obsessed with the need to build a sense of security.\u003c/p\u003e\n\u003cp\u003eBut she’d never been bitter.\u003c/p\u003e\n\u003cp\u003eHer mother was who she was: a weak, pathetic woman who’d spent her whole life searching for happiness that forever remained out of reach.\u003c/p\u003e\n\u003cp\u003eMadison felt nothing but pity for the woman who’d chosen a life of addicted misery. It certainly hadn’t twisted her ability to connect with other people.\u003c/p\u003e\n\u003cp\u003e“A fine theory, except for one glaringly obvious flaw,” she said in dry tones.\u003c/p\u003e\n\u003cp\u003e“And what’s that?”\u003c/p\u003e\n\u003cp\u003e“I’ve met hundreds of guys that I knew were without a doubt love ‘em and leave ‘em assholes.” Her smug expression dared him to deny her logic. “Why didn’t I crawl into bed with them?”\u003c/p\u003e\n\u003cp\u003eHe smiled. A slow, wicked curling of his lips.\u003c/p\u003e\n\u003cp\u003eShe shivered, feeling the power of his male charm tingle all the way to the tips of her toes.\u003c/p\u003e\n\u003cp\u003e“There’s another explanation,” he assured her.\u003c/p\u003e\n\u003cp\u003e“I’m afraid to ask,” she muttered, taking a discreet step backward.\u003c/p\u003e\n\u003cp\u003eOne touch and she would be melting at his feet.\u003c/p\u003e\n\u003cp\u003e“You’re still in love with me.”\u003c/p\u003e\n\u003cp\u003eThe breath was slammed from her lungs at his teasing words.\u003c/p\u003e\n\u003cp\u003eStill in love with him…\u003c/p\u003e\n\u003cp\u003eThe accusation had been tossed at her only hours earlier by Kristen and she’d readily denied the claim. Now she realized that it wasn’t nearly so easy.\u003c/p\u003e\n\u003cp\u003eNo. God, no.\u003c/p\u003e\n\u003cp\u003eShe wasn’t so pathetic that she could have harbored an unrequited love for this man for eight years.\u003c/p\u003e\n\u003cp\u003eWas she?\u003c/p\u003e\n\u003cp\u003eA sick ball of dread lodged in the pit of her stomach as she recalled how often she’d compared her male companions to Luc’s dark, sinful beauty. Or how she’d returned from a night out feeling oddly restless, as if she’d been searching for some special quality in her date that was missing.\u003c/p\u003e\n\u003cp\u003eThe sickness intensified. Christ. Could she have more of her mother in her than she originally suspected? Was she constantly seeking the one man she couldn’t have?\u003c/p\u003e\n\u003cp\u003eMadison gave an automatic shake of her head.\u003c/p\u003e\n\u003cp\u003eIt’d been a stressful night that had become a damned mess.\u003c/p\u003e\n\u003cp\u003eAfter a good night’s sleep she’d be laughing at the mere suggestion she could still be in love with Luc Angeli.\u003c/p\u003e\n\u003cp\u003e“Screw this—I’m out of here,” she growled, pointing a finger in Luc’s face as he held up a hand to halt her retreat. “Touch me and I’ll kick you in the nuts.”\u003c/p\u003e\n\u003cp\u003eHis brows snapped together at her threat, but his hand fell to his side. “Fine. You can run all you want, Maddy. Eventually the past will catch up with you.”\u003c/p\u003e\n\u003cp\u003eCHAPTER FIVE\u003c/p\u003e\n\u003cp\u003eIf Madison possessed a gun she would have shot the alarm when it jolted her out of her restless sleep.\u003c/p\u003e\n\u003cp\u003eWith a groan, she lifted her head, blearily reaching to grab her phone and end the chirping.\u003c/p\u003e\n\u003cp\u003eEight thirty.\u003c/p\u003e\n\u003cp\u003eCrap. She’d been asleep less than two hours.\u003c/p\u003e\n\u003cp\u003eShe hadn’t actually expected a good night’s sleep after she’d returned to Kristen’s apartment. Not after the way she’d parted from Luc. But it was still aggravating that she’d tossed and turned until after six a.m.\u003c/p\u003e\n\u003cp\u003eEven worse, she had an appointment at nine thirty that she couldn’t miss.\u003c/p\u003e\n\u003cp\u003eCursing at the headache that felt as if it was drilling a hole in her brain, Madison stumbled from bed and into the shower.\u003c/p\u003e\n\u003cp\u003eThirty minutes later she was clean and dressed in faded jeans and a casual stretchy top. She pulled her hair into a braid, but she left her face bare of makeup.\u003c/p\u003e\n\u003cp\u003eHer appointment was at a shop known for its discretion, but there was no point in trying to attract unwanted attention. She was famous enough to occasionally capture the interest of the paparazzi.\u003c/p\u003e\n\u003cp\u003eBesides, there wasn’t enough makeup in the world to disguise the pallor of her skin or the purple shadows beneath her eyes.\u003c/p\u003e\n\u003cp\u003eGrabbing her purse, Madison stumbled out of her bedroom, lured toward the kitchen by the scent of freshly brewed coffee.\u003c/p\u003e\n\u003cp\u003eShe ignored Kristen’s curious gaze as she moved to take a seat at the breakfast bar, deeply relieved when a cup of steaming black coffee was placed on the counter in front of her.\u003c/p\u003e\n\u003cp\u003e“Thank god,” she muttered.\u003c/p\u003e\n\u003cp\u003e“And good morning to you too, sunshine,” Kristen mocked, appearing nauseatingly perfect in her black pencil skirt and crisp white shirt. There wasn’t so much as a strand of honey hair out of place.\u003c/p\u003e\n\u003cp\u003e“Ugh.” Kristen sipped the coffee, sending her friend a jaundiced scowl. “Why are you shouting?”\u003c/p\u003e\n\u003cp\u003eThe indigo eyes widened with surprise. “Do you need my famous cure for a hangover?”\u003c/p\u003e\n\u003cp\u003eMadison shuddered in horror. She’d only tasted the infamous cure one time, but it was enough to have left the hideous taste scorched into her memory.\u003c/p\u003e\n\u003cp\u003e“Not even if I was on my deathbed,” she muttered.\u003c/p\u003e\n\u003cp\u003e“Hey,” Kristen protested. “It’s guaranteed to work.”\u003c/p\u003e\n\u003cp\u003eMadison grimaced. “It also tastes like snail sludge.”\u003c/p\u003e\n\u003cp\u003e“How would you know?” Kristen narrowed her gaze. “Have you actually tasted snail sludge?”\u003c/p\u003e\n\u003cp\u003eMadison held up a hand, her brain still throbbing. “It doesn’t matter. I don’t have a hangover.”\u003c/p\u003e\n\u003cp\u003e“Uh-oh.” Kristen turned to cross the tiled floor, swiftly returning to place a small bakery bag in front of Madison. “Here.”\u003c/p\u003e\n\u003cp\u003eMadison frowned as she reached into the bag. “What’s this?”\u003c/p\u003e\n\u003cp\u003e“An emergency red velvet cupcake,” Kristen said. “I swung by the bakery last night just in case you failed in your mission.”\u003c/p\u003e\n\u003cp\u003eMadison pulled out the cupcake, her mouth watering at the sight of the cream cheese frosting topped with sprinkles.\u003c/p\u003e\n\u003cp\u003e“I didn’t fail,” she said, concentrating on pulling the wrapping from the cupcake in an effort to avoid her friend’s searching gaze.\u003c/p\u003e\n\u003cp\u003eKristen made a sound of disbelief. “This is what you look like when you succeed?”\u003c/p\u003e\n\u003cp\u003e“It’s…complicated.”\u003c/p\u003e\n\u003cp\u003e“Somehow I’m not at all surprised,” Kristen said on a sigh. “Eat.”\u003c/p\u003e\n\u003cp\u003eIgnoring the massive calories that would have to be worked off at the gym, Madison demolished the cupcake in record time, pleased when her headache became almost bearable.\u003c/p\u003e\n\u003cp\u003eNothing like sweet, gooey goodness to ease the pain.\u003c/p\u003e\n\u003cp\u003e“Mmm.” Madison licked her fingers. “Much better than your nasty hangover remedy.”\u003c/p\u003e\n\u003cp\u003eKristen rolled her eyes, cleaning away the mess Madison had made. The woman was a true neat freak.\u003c/p\u003e\n\u003cp\u003e“Now tell me what happened,” Kristen commanded.\u003c/p\u003e\n\u003cp\u003eMadison wrinkled her nose, taking another sip of the coffee. “Luc Angeli happened.”\u003c/p\u003e\n\u003cp\u003e“Ah.” Kristen leaned against the edge of the counter, her expression warning she wasn’t going to allow Madison to leave until she had the full story. “So he was at the hotel.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“And as handsome as ever, the annoying devil,” the blonde-haired woman said, obviously having seen Luc around town.\u003c/p\u003e\n\u003cp\u003e“And as arrogant,” Madison muttered. \u003c/p\u003e","sourceLink":"https://allnovel.net/first-rapture-the-rapture-1/page-11.html","bookId":1899,"creation":"Oct 5, 2019 5:12:04 PM","modification":"Oct 5, 2019 5:12:04 PM"}
