{"id":86065,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe paused, turning to regard her with an expression that was impossible to read. “Do yourself a favor, Maddy. Save your love for some man who actually deserves it.”\u003c/p\u003e\n\u003cp\u003eThe sound of her alarm thankfully jerked Madison out of the nightmare.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eThrowing back the covers, she climbed out of bed and headed into the attached bathroom.\u003c/p\u003e\n\u003cp\u003eThere was no mystery why she’d been plagued by that particular dream.\u003c/p\u003e\n\u003cp\u003eThe day after her disastrous eighteenth birthday she’d left Vegas and traveled to New York to follow her dream of becoming a model. For once in her life, good luck had smiled on her, landing her a spot as the spokeswoman for a new brand of tequila. Her career had taken off with record speed, and thanks to the grinding poverty of her childhood, she’d had enough sense to demand a part of her salary be paid in company stocks. By the time she’d reached the age of twenty-four she’d made a small fortune, which she’d used to open her own modeling agency.\u003c/p\u003e\n\u003cp\u003eNow she was not only rich, but she owned a thriving business that gave her a power she’d never imagined possible when she was a young girl just trying to survive.\u003c/p\u003e\n\u003cp\u003eAnd for the first time in eight years she’d returned to Vegas.\u003c/p\u003e\n\u003cp\u003eYeah, everything was great. Except that her dreams of love had been ruined by the Dark Angel.\u003c/p\u003e\n\u003cp\u003eTaking a swift shower, Madison pulled on a casual pair of white shorts and a yellow, stretchy top. She gathered her dark, shoulder-length hair into a high ponytail, pausing long enough to grimace at her reflection.\u003c/p\u003e\n\u003cp\u003eWithout makeup she looked younger than her twenty-six years, but it was the shadows beneath her wide hazel eyes and the paleness of her creamy skin that made her wrinkle her nose in disgust.\u003c/p\u003e\n\u003cp\u003eSoon, she silently promised herself.\u003c/p\u003e\n\u003cp\u003eSoon she would be done with the nightmares of her past.\u003c/p\u003e\n\u003cp\u003eAnd Luc Angeli would be nothing but a distant memory.\u003c/p\u003e\n\u003cp\u003eLeaving the guest bedroom, Madison headed into the kitchen of the luxury condo just off the Strip.\u003c/p\u003e\n\u003cp\u003eThe home belonged to her best friend during high school, Kristen Roth. The two had been inseparable despite the fact that Kristen had a very different background than Madison. And even after she’d left Vegas they’d remained in contact, meeting for a “girls’ weekend” at least twice a year in various exotic locations.\u003c/p\u003e\n\u003cp\u003eWhen she’d decided it was time to return to Vegas, Madison had known she couldn’t stay anywhere but the condo without hurting Kristen’s feelings.\u003c/p\u003e\n\u003cp\u003eAn unfortunate necessity, she belatedly realized as she strolled into the kitchen to discover her friend already dressed in a gray power suit with her honey-blonde hair pulled into a smooth knot at her nape. Instantly, Kristen’s indigo blue gaze latched onto Madison’s pale face and the obvious signs of sleepless nights.\u003c/p\u003e\n\u003cp\u003eKristen possessed a laser-sharp mind that had landed her a position at the top law firm in Nevada. Nothing could get past her perceptive gaze.\u003c/p\u003e\n\u003cp\u003e“What are you doing up at this hour?” she demanded, instantly moving to pour Madison a large mug of coffee.\u003c/p\u003e\n\u003cp\u003eTaking a seat at the breakfast bar, Madison readily reached for the coffee, smiling at the rich aroma. Kristen, of course, remembered that she took it strong and black. Her ruthless competence was sometimes frightening.\u003c/p\u003e\n\u003cp\u003e“After years of traveling I’ve discovered the only way to deal with jet lag is to force myself to adjust to the local time as soon as I arrive,” she said, the words not entirely a lie.\u003c/p\u003e\n\u003cp\u003eShe’d arrived in Vegas late last night from a trip to Paris to recruit new models, and while she’d set her alarm, she’d intended to laze in bed for at least a few hours as she adjusted to the abrupt change in time.\u003c/p\u003e\n\u003cp\u003e“Hmm.” Kristen studied her pale face. “Jet lag didn’t put dark circles under those eyes.”\u003c/p\u003e\n\u003cp\u003eMadison blew out a sigh. “I’ve looked in the mirror, thank you very much. I don’t need you to point out I look like a zombie.”\u003c/p\u003e\n\u003cp\u003eKristen shook her head, her classic beauty shown to advantage surrounded by the white and silver condo, with its glass walls that revealed a stunning view of the city.\u003c/p\u003e\n\u003cp\u003eIt was like her. Sleek. Modern. Efficient.\u003c/p\u003e\n\u003cp\u003e“Don’t be an idiot,” Kristen chided. “You always look spectacular. If you weren’t my best friend, I’d be morally obligated to hate you. But you’ve obviously had more than one sleepless night. Tell me what’s going on.”\u003c/p\u003e\n\u003cp\u003eMadison shrugged. She hadn’t revealed the truth of her return to Vegas to anyone. Not even her best friend.\u003c/p\u003e\n\u003cp\u003e“Bad dreams.”\u003c/p\u003e\n\u003cp\u003eKristen arched a honey brow. “Does this bad dream happen to go by the name Luc Angeli?”\u003c/p\u003e\n\u003cp\u003e“Luc?” Madison blinked in genuine shock. How the hell had she guessed? “I don’t know who you’re talking about.”\u003c/p\u003e\n\u003cp\u003eKristen waved aside her ridiculous pretense of ignorance. “Don’t be coy. No woman forgets her first.”\u003c/p\u003e\n\u003cp\u003e“Really?” Madison took a sip of her coffee, hoping the caffeine would snap her sluggish mind into gear. “So you spend your nights dreaming about Jack Roberts?”\u003c/p\u003e\n\u003cp\u003e“Oh hell no.” Kristen shuddered in horror. “But my first was a quickie in the boys’ locker room…with an emphasis on the quickie,” she said in wry tones. “Yours, on the other hand, was an epic event.”\u003c/p\u003e\n\u003cp\u003eMadison stiffened, wishing to god she’d never called Kristen after Luc had walked out on her. At the time she’d needed someone to sympathize with her brutal humiliation. Now she hated the knowledge that she’d shared her pathetic heartbreak over a man who wasn’t worth a single tear.\u003c/p\u003e\n\u003cp\u003e“Hardly epic.”\u003c/p\u003e\n\u003cp\u003e“Oh, come on, Maddy—”\u003c/p\u003e\n\u003cp\u003e“It’s Madison,” she firmly corrected.\u003c/p\u003e\n\u003cp\u003eMaddy was a needy child searching for love in all the wrong places. Madison was a successful woman who molded the world to suit her needs.\u003c/p\u003e\n\u003cp\u003eOr at least she did in all facets of her life…except one.\u003c/p\u003e\n\u003cp\u003eAnd that one she intended to sort out in the next couple of days.\u003c/p\u003e\n\u003cp\u003e“Fine. Madison,” Kristen obediently said. “You lusted after Luc for years. You had your walls plastered with pictures of him, you walked past his house a dozen times a day, and never missed a football game when he was playing. Hell, you had his name tattooed on your ass with a heart around it.”\u003c/p\u003e\n\u003cp\u003eMadison thinned her lips. The tattoo was going, along with the memories.\u003c/p\u003e\n\u003cp\u003e“And you had a poster of the Backstreet Boys pinned over your bed,” Madison countered, taking another gulp of her coffee, wincing as it scalded her tongue. “Big deal.”\u003c/p\u003e\n\u003cp\u003eKristen refused to be diverted. “But the Backstreet Boys didn’t take my virginity on my eighteenth birthday and then walk away with the comment that I should find someone else to obsess over,” she pointed out. “And I didn’t leave Vegas swearing to return one day and make them pay for humiliating me.”\u003c/p\u003e\n\u003cp\u003eWith a weary groan, Madison planted her elbow on the bar, her chin resting on her palm. “You always did have an overactive imagination.”\u003c/p\u003e\n\u003cp\u003e“I also have enough intelligence to know that this trip to Vegas isn’t just a whim.”\u003c/p\u003e\n\u003cp\u003e“Why not? It’s been years since I’ve been home.”\u003c/p\u003e\n\u003cp\u003e“Because there’s no reason to be here. Your mother died shortly after you left and you don’t have any other family,” Kristen said, as usual not bothering to tiptoe around the fact that Madison’s mother had taken off with one of her lovers who’d then crashed their car just outside Denver. “And if you wanted to see me, you know you only have to call and I’ll fly to join you wherever you are.”\u003c/p\u003e\n\u003cp\u003e“It’s still where I was born,” Madison stubbornly tried to hold her ground against the merciless interrogation. “Maybe I was feeling nostalgic.”\u003c/p\u003e\n\u003cp\u003e“Bullshit. You have a fabulous life in New York.”\u003c/p\u003e\n\u003cp\u003e“True.”\u003c/p\u003e\n\u003cp\u003eKristen moved to place her hands flat on the bar, her expression warning she was ready to continue her cross-examination until Madison cracked.\u003c/p\u003e\n\u003cp\u003e“Tell me the truth,” she commanded. “Why are you in Vegas?”\u003c/p\u003e\n\u003cp\u003eMadison gave a resigned shake of her head. Hell, Kristen no doubt terrified poor juries into submission.\u003c/p\u003e\n\u003cp\u003e“To put the past behind me,” she grudgingly admitted.\u003c/p\u003e\n\u003cp\u003e“Luc?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Madison made a sound of frustration. “I know it’s stupid, but I can’t get him out of my head.”\u003c/p\u003e\n\u003cp\u003e“Not really surprising. He’s always been drop-dead gorgeous,” Kristen admitted. “Of course, I’ve heard that he’s now supposedly reformed.”\u003c/p\u003e\n\u003cp\u003e“Reformed?”\u003c/p\u003e\n\u003cp\u003e“He stopped hopping from bed to bed.”\u003c/p\u003e\n\u003cp\u003eMadison made a sound of disbelief. “Yeah, right. And I’m about to sprout wings and fly to the moon.”\u003c/p\u003e\n\u003cp\u003e“Oh my god.” Kristen widened her eyes in shock at Madison’s bitter tone. “You’re still in love with him.”\u003c/p\u003e\n\u003cp\u003e“No,” Madison snapped. “I was never in love with the bastard. But he’s like a virus that’s infected my life. I’m here to purge him once and for all.”\u003c/p\u003e\n\u003cp\u003eThe charity event being held at the upscale hotel was like any other charity event.\u003c/p\u003e\n\u003cp\u003eA mediocre dinner that cost the social elite five hundred dollars a plate. An auction where they were expected to overbid on ridiculous items that no one wanted. Followed by a dance where bored husbands flirted with the scantily-dressed barmaids, and equally bored wives exchanged vicious gossip. \u003c/p\u003e","sourceLink":"https://allnovel.net/first-rapture-the-rapture-1/page-3.html","bookId":1899,"creation":"Oct 5, 2019 5:12:04 PM","modification":"Oct 5, 2019 5:12:04 PM"}
