{"id":86067,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“But you’re so good at walking away.”\u003c/p\u003e\n\u003cp\u003eThe insult was delivered with a saccharin-sweet smile, making Luc grimace. She obviously wanted her pound of flesh.\u003c/p\u003e\n\u003cp\u003e“What can I do to convince you I’ve changed?”\u003c/p\u003e\n\u003cp\u003e“Why would you want to go to the effort?” She waved a slender hand toward the French doors. Inside, a glittering array of beautiful women were gliding through the ballroom. “There are plenty of fish in the sea.”\u003c/p\u003e\n\u003cp\u003eLuc never allowed his gaze to stray from her exquisite face. “Because you’re the catch that I was stupid enough to let get away.”\u003c/p\u003e\n\u003cp\u003eHe thought he heard her breath catch at his low words, but her aloof expression was impossible to read.\u003c/p\u003e\n\u003cp\u003e“Get away?” she demanded. “As I remember it, you were the one running, not me.”\u003c/p\u003e\n\u003cp\u003eOkay. He had let her vent her grievances. Now it was time to assure her that he wasn’t a total jerk.\u003c/p\u003e\n\u003cp\u003eWell…at least not anymore.\u003c/p\u003e\n\u003cp\u003e“Believe it or not, I was trying to protect you.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “Really?”\u003c/p\u003e\n\u003cp\u003e“I was in a bad place,” he said with simple honesty. “You deserved better.”\u003c/p\u003e\n\u003cp\u003e“How could the son of a millionaire, the star football player and darling of every female in the state of Nevada possibly be in a bad place?”\u003c/p\u003e\n\u003cp\u003eThe muscles of his jaw clenched, a familiar anger twisting his gut. He was sick to fucking death of people assuming that his father’s money somehow made his life a fairytale. Okay, he’d had it better than a lot of people, but living with Vigo Angeli was no picnic.\u003c/p\u003e\n\u003cp\u003eHe narrowed his gaze, studying her pale, perfect face. “Are you really interested?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eShe didn’t sound particularly sincere, but he answered her anyway.\u003c/p\u003e\n\u003cp\u003e“I’d just come to the conclusion that after years of trying to emulate my father, I’d become a man who I didn’t particularly like, and respected even less.” He reached up to smooth her hair behind her ear, unable to resist the temptation to touch her. “I was determined to change, which meant I wasn’t going to take advantage of an innocent teenager who’d convinced herself she was in love with me.”\u003c/p\u003e\n\u003cp\u003eMadison stiffened as his fingers traced the shell of her ear, but she made no move to pull away.\u003c/p\u003e\n\u003cp\u003e“Then why did you come to the trailer?”\u003c/p\u003e\n\u003cp\u003e“Because I couldn’t get you out of my mind.” His fingers drifted to trace the perfect arch of her dark brows. “Those big hazel eyes pleading for my touch.” He caressed the cool silk of her cheek. “That slender body with its lethal curves. Your shy smile. And those lips…” He used the tip of his index finger to outline the mouth that had given him so many sleepless nights. “Hell, there’s not a man who could have resisted.”\u003c/p\u003e\n\u003cp\u003e“Ah. So it was my fault,” she said in dangerous tones, although she couldn’t disguise the flare of response that darkened her hazel eyes.\u003c/p\u003e\n\u003cp\u003eShe was rapidly becoming as aroused as he was.\u003c/p\u003e\n\u003cp\u003e“The temptation was yours. The weakness was mine,” he murmured, his seeking fingers moving to follow the delicate curve of her neck. His cock twitched in appreciation. Her skin felt like molten silk. He needed her spread across his bed so he could explore every inch of that creamy perfection. “A weakness it seems I haven’t outgrown.”\u003c/p\u003e\n\u003cp\u003eCupping the back of her head, Luc leashed his greedy urge to crush her lips in a demanding kiss. Instead he lightly brushed his mouth over hers in a gentle caress.\u003c/p\u003e\n\u003cp\u003eLast time he took.\u003c/p\u003e\n\u003cp\u003eThis time he fully intended to give.\u003c/p\u003e\n\u003cp\u003eHer hands slowly lifted to land against his chest, her breath quickening as she pulled back to study him with a guarded gaze.\u003c/p\u003e\n\u003cp\u003e“Wait,” she breathed.\u003c/p\u003e\n\u003cp\u003eWait? He might not have realized it until she’d stepped on the balcony, but he’d been waiting for this reunion since he’d discovered she’d fled Vegas.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“You were explaining why you were such an ass,” she reminded him.\u003c/p\u003e\n\u003cp\u003eHe swallowed a rueful sigh. Why was she dwelling on the past when the future promised to be filled with sensual pleasure?\u003c/p\u003e\n\u003cp\u003e“You looked at me as if you were picturing your Prince Charming,” he reluctantly conceded. “I panicked.”\u003c/p\u003e\n\u003cp\u003eHer body remained pliant, but he sensed a tangle of emotion behind her smooth expression.\u003c/p\u003e\n\u003cp\u003e“You didn’t want to be Prince Charming?”\u003c/p\u003e\n\u003cp\u003eHis lips twisted, remembering his fierce pleasure as he’d taken her virginity. Hardly the behavior of a Prince Charming.\u003c/p\u003e\n\u003cp\u003e“I was more the big bad wolf type.”\u003c/p\u003e\n\u003cp\u003e“And now?”\u003c/p\u003e\n\u003cp\u003eHe tugged her against his chest, his head dipping down to trace the line of her throat with his lips.\u003c/p\u003e\n\u003cp\u003e“Now I can be whatever you need me to be.”\u003c/p\u003e\n\u003cp\u003eHer hands clutched at his shoulders as he found the sensitive spot at the base of her neck, but she refused to melt against him as he wanted. Dammit. He needed to feel her pressed tight against his aching erection.\u003c/p\u003e\n\u003cp\u003e“Actually I’ve discovered I’m no longer a Cinderella wannabe,” she informed him. “I don’t need a man.”\u003c/p\u003e\n\u003cp\u003eHe nuzzled downward, discovering the prominent thrust of her collarbone. Too prominent, he abruptly decided. Her slender body was beautiful, but she felt too fragile. Clearly she wasn’t taking adequate care of herself.\u003c/p\u003e\n\u003cp\u003eSomething he intended to change.\u003c/p\u003e\n\u003cp\u003e“That would be a shame,” he murmured.\u003c/p\u003e\n\u003cp\u003eShe made a choked sound, shivering as he reached the top curve of her breasts. “A typical male response.”\u003c/p\u003e\n\u003cp\u003eHis hand tangled in her hair, desire blasting through him as he felt her nipples harden through the silk of her gown. A part of him desperately wanted to strip off her dress and take her against the French doors.\u003c/p\u003e\n\u003cp\u003eAnother part wanted to take her back to his home and spend the next month making slow, delicious love to the woman who’d done what no other woman had done.\u003c/p\u003e\n\u003cp\u003eRemained in his thoughts long after he’d left her bed.\u003c/p\u003e\n\u003cp\u003e“Doesn’t your glamorous lifestyle ever get lonely?” he asked, his arms sliding around her waist to press her tight against his aching body.\u003c/p\u003e\n\u003cp\u003e“Does yours?” she easily deflected his question.\u003c/p\u003e\n\u003cp\u003e“Yes,” he readily admitted. “Sometimes it’s unbearable.”\u003c/p\u003e\n\u003cp\u003eHe felt her tiny jerk, as if she was startled by his answer.\u003c/p\u003e\n\u003cp\u003e“So find a Sherri to share your bed.”\u003c/p\u003e\n\u003cp\u003e“I don’t want Sherri.” He lifted his head to meet her wary gaze. “I want you.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWO\u003c/p\u003e\n\u003cp\u003eI want you…\u003c/p\u003e\n\u003cp\u003eThey were precisely the words that Madison had been waiting to hear. Weren’t they?\u003c/p\u003e\n\u003cp\u003eIt was why she’d returned to Vegas. Why she was at this ridiculous party.\u003c/p\u003e\n\u003cp\u003eWhy she was on this balcony with Luc’s arms wrapped around her.\u003c/p\u003e\n\u003cp\u003eBut now, for the first time since tracking down Luc Angeli, she found herself wavering.\u003c/p\u003e\n\u003cp\u003eIt didn’t make sense.\u003c/p\u003e\n\u003cp\u003eWas it because Luc was forcing her to consider the possibility he might not be the complete asshole she’d always believed? Or because she was reacting to him with the same giddy, heart-racing excitement as when she was an overly-hormonal teenager?\u003c/p\u003e\n\u003cp\u003eWhatever the explanation, she found herself debating the very sensible option of turning on her heel and walking away.\u003c/p\u003e\n\u003cp\u003eBriefly she hesitated, balanced between flight and fight. Then the memory of how this man had plagued her over the past eight years at last hardened her resolve.\u003c/p\u003e\n\u003cp\u003eThis ended tonight.\u003c/p\u003e\n\u003cp\u003eA teasing smile curved her lips as she slowly untangled herself from his arms.\u003c/p\u003e\n\u003cp\u003eHe’d claimed he was lonely, but what did he know about it?\u003c/p\u003e\n\u003cp\u003eHe’d probably had hundreds of lovers since she’d left Vegas, while she…\u003c/p\u003e\n\u003cp\u003eHer spine stiffened, her expression deliberately provocative. She couldn’t make it too easy. Even a man with Luc’s massive ego would be suspicious if she didn’t make him work to earn her forgiveness.\u003c/p\u003e\n\u003cp\u003e“You think I’m going to fall back into bed with you?”\u003c/p\u003e\n\u003cp\u003eHis dark eyes smoldered with a growing frustration. Unlike her, he felt no need to disguise his consuming desire.\u003c/p\u003e\n\u003cp\u003e“I think the fire that burned between us eight years ago is still there, just waiting for an opportunity to reignite,” he growled, his gaze lowering to where her nipples pressed against the silky fabric of her dress. “Don’t deny that you feel it, too.”\u003c/p\u003e\n\u003cp\u003eShe did, of course.\u003c/p\u003e\n\u003cp\u003eShe might have spent the past years fiercely regretting giving her virginity to this man, but the second she’d stepped onto the balcony she’d been blasted with an unwelcomed awareness.\u003c/p\u003e\n\u003cp\u003eA knowledge that was rubbing against her already raw nerves.\u003c/p\u003e\n\u003cp\u003eShe’d expected to find Luc attractive.\u003c/p\u003e\n\u003cp\u003eHe’d always been indecently handsome, with the charm of the devil. And the years had only emphasized his potent attractions.\u003c/p\u003e\n\u003cp\u003eHis narrow, bronzed face was leaner and his features even more finely sculpted. The dark eyes were filled with a newfound confidence. And his body more sleekly muscled beneath his Armani tux.\u003c/p\u003e\n\u003cp\u003eHe was all male temptation. The sort of man who would make any woman melt.\u003c/p\u003e\n\u003cp\u003eBut the unexpected realization that he had the power to arouse her with a mere glance was annoying as hell.\u003c/p\u003e\n\u003cp\u003eDammit. This time she was the one in charge of the seduction, not Luc Angeli. \u003c/p\u003e","sourceLink":"https://allnovel.net/first-rapture-the-rapture-1/page-5.html","bookId":1899,"creation":"Oct 5, 2019 5:12:04 PM","modification":"Oct 5, 2019 5:12:04 PM"}
