{"id":97973,"no":1,"title":"Page 1","content":"\u003cp\u003eThe figure slipped silently into the room. The deep gray cloak it wore covered most of its body; the hood shielded its features as it moved with inhuman silence. But it was not inhuman; Gideon was reminded of that fact by the solid beat of its heart, and the alluring scent that pricked his appetite. But this human, especially this one, was completely off limits if he was to keep his life. Although he couldn\u0027t see the features, he knew that it was female, knew who it was by the sweet aroma she emitted.\u003c/p\u003e\n\u003cp\u003eNo, no matter how hungry he may be at the moment, he would not touch this one. He valued his life far too much to do such a thing. He\u0027d eat rats first.\u003c/p\u003e\n\u003cp\u003eShe stopped before his desk, her head bowed as she inhaled a small breath. Slowly, ever so slowly, she lifted her head and drew back the hood. Her dark auburn hair was the color of blood in the candlelight that flickered over it. Her features, though pretty, were not stunning, especially not under the pallor that now marked her normally healthy hue. Her hand trembled, but there was a steely resolve about her that Gideon couldn\u0027t help but admire.\u003c/p\u003e\n\u003cp\u003e\"I spoke with Jack and Ashby.\"\u003c/p\u003e\n\u003cp\u003eGideon froze for a moment, his hand tightened around the pen he was holding. \"I see.\"\u003c/p\u003e\n\u003cp\u003eHer mouth was pinched, her eyes steady despite the tumultuous fear and anguish he sensed rolling just beneath her seemingly calm exterior. \"I understand what needs to be done.\"\u003c/p\u003e\n\u003cp\u003eGideon let go of the pen before he snapped it in half. He didn\u0027t care about the instrument, but he was far too meticulous to have ink coating him. \"You do?\"\u003c/p\u003e\n\u003cp\u003eFor a brief moment tears shimmered in her eyes before she blinked them back, thrust out her chin and nodded firmly. \"I do.\"\u003c/p\u003e\n\u003cp\u003e\"He cannot know about this.\"\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t.\"\u003c/p\u003e\n\u003cp\u003eGideon was silent for a long moment. \"The bond cannot be completed.\"\u003c/p\u003e\n\u003cp\u003eShe winced as a flash of grief struck her like lightening. For just a moment her composure seemed to crumple. \"It won\u0027t,\" she whispered.\u003c/p\u003e\n\u003cp\u003eGideon didn\u0027t know what to say, he hadn\u0027t known what to expect from her or how she would react to what Jack and Ashby had to say to her. He realized now that he should have known this was the path she would take, that she would not shy away from this. She turned away from him, but her step wasn\u0027t so sure, or as silent, as she made her way to the door.\u003c/p\u003e\n\u003cp\u003e\"You know what this may mean for you?\" he inquired before she could escape.\u003c/p\u003e\n\u003cp\u003eShe stopped in the doorway, her head turned back to him as she studied him over her shoulder. She swallowed heavily as she managed another stiff nod. \"If we are unable to dilute his blood in me my death may be the only solution to separating us for good.\"\u003c/p\u003e\n\u003cp\u003eHe was immobile, struck by the fact that this young girl was able to see what the others refused to. \"And you accept this?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s what I came to you for,\" she breathed.\u003c/p\u003e\n\u003cp\u003eThat answer didn\u0027t surprise him either, he was the only one she could turn to in order to ensure such a thing was carried out. \"No one else can know about this.\"\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t,\" she vowed. He realized he\u0027d just made a deal with the devil as she slid the hood back over her head and slipped from the room. \u003c/p\u003e","sourceLink":"https://allnovel.net/refugee-the-captive-3/page-1.html","bookId":2166,"creation":"Oct 5, 2019 6:30:58 PM","modification":"Oct 5, 2019 6:30:58 PM"}
