{"id":520,"no":15,"title":"Chapter 8 Gift for the Darkness","content":"\u0026nbsp;　　Piggy looked up miserably from the dawn-pale beach to the dark mountain. \n\u003cdiv\u003e\n 　　\"Are you sure? Really sure, I mean?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　I told you a dozen times now,\" said Ralph, \"we saw it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"D\u0027you think we\u0027re safe down here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"How the hell should I know?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph jerked away from him and walked a few paces along the beach. Jack was kneeling and drawing a circular pattern in the sand with his forefinger. Piggy\u0027s voice came to them, hushed.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Are you sure? Really?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Go up and see,\" said Jack contemptuously, \"and good riddance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"No fear.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"The beast had teeth,\" said Ralph, \"and big black eyes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He shuddered violently. Piggy took off his one round of glass and polished the surface.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What we going to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph turned toward the platform. The conch glimmered among the trees, a white blob against the place where the sun would rise. He pushed back his mop.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I don\u0027t know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He remembered the panic flight down the mountainside. \"I don\u0027t think we\u0027d ever fight a thing that size, honestly, you know. We\u0027d talk but we wouldn\u0027t fight a tiger. We\u0027d hide. Even Jack \u0027ud hide.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack still looked at the sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What about my hunters?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon came stealing out of the shadows by the shelters. Ralph ignored Jack\u0027s question. He pointed to the touch of yellow above the sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"As long as there\u0027s light we\u0027re brave enough. But then? And now that thing squats by the fire as though it didn\u0027t want us to be rescued--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He was twisting his hands now, unconsciously. His voice rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"So we can\u0027t have a signal fire. . . . We\u0027re beaten.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　A point of gold appeared above the sea and at once all the sky lightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What about my hunters?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Boys armed with sticks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack got to his feet. His face was red as he marched away. Piggy put on his one glass and looked at Ralph.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Now you done it. You been rude about his hunters.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Oh shut up!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The sound of the inexpertly blown conch interrupted them. As though he were serenading the rising sun, Jack went on blowing till the shelters were astir and the hunters crept to the platform and the littluns whimpered as now they so frequently did. Ralph rose obediently, and Piggy, and they went to the platform.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Talk,\" said Ralph bitterly, \"talk, talk, talk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He took the conch from Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"This meeting--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack interrupted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I called it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"If you hadn\u0027t called it I should have. You just blew the conch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Well, isn\u0027t that calling it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Oh, take it! Go on--talk!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph thrust the conch into Jack\u0027s arms and sat down on the trunk.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027ve called an assembly,\" said Jack, \"because of a lot of things. First, you know now, we\u0027ve seen the beast. We crawled up. We were only a few feet away. The beast sat up and looked at us. I don\u0027t know what it does. We don\u0027t even know what it is--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"The beast comes out of the sea--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Out of the dark--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Trees--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Quiet!\" shouted Jack. \"You, listen. The beast is sitting up there, whatever it is--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Perhaps it\u0027s waiting--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Hunting--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Yes, hunting.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Hunting,\" said Jack. He remembered his age-old tremors in the forest. \"Yes. The beast is a hunter. Only-- shut up! The next thing is that we couldn\u0027t kill it. And the next is that Ralph said my hunters are no good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I never said that!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027ve got the conch. Ralph thinks you\u0027re cowards, running away from the boar and the beast. And that\u0027s not all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　There was a kind of sigh on the platform as if everyone knew what was coming. Jack\u0027s voice went up, tremulous yet determined, pushing against the uncooperative silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He\u0027s like Piggy. He says things like Piggy. He isn\u0027t a proper chief.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack clutched the conch to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He\u0027s a coward himself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　For a moment he paused and then went on.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"On top, when Roger and me went on--he stayed back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I went too!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"After.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The two boys glared at each other through screens of hair.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I went on too,\" said Ralph, \"then I ran away. So did you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Call me a coward then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack turned to the hunters.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He\u0027s not a hunter. He\u0027d never have got us meat. He isn\u0027t a prefect and we don\u0027t know anything about him. He just gives orders and expects people to obey for nothing. All this talk--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"All this talk!\" shouted Ralph. \"Talk, talk! Who wanted it? Who called the meeting?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack turned, red in the face, his chin sunk back. He glowered up under his eyebrows.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"All right then,\" he said in tones of deep meaning, and menace, \"all right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He held the conch against his chest with one hand and stabbed the air with his index finger.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Who thinks Ralph oughtn\u0027t to be chief?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He looked expectantly at the boys ranged round, who had frozen. Under the palms there was deadly silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Hands up,\" said Jack strongly, \"whoever wants Ralph not to be chief?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The silence continued, breathless and heavy and full of shame. Slowly the red drained from Jack\u0027s cheeks, then came back with a painful rush. He licked his lips and turned his head at an angle, so that his gaze avoided the embarrassment of linking with another\u0027s eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"How many think--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　His voice tailed off. The hands that held the conch shook. He cleared his throat, and spoke loudly.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"All right then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He laid the conch with great care in the grass at his feet. The humiliating tears were running from the corner of each eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027m not going to play any longer. Not with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Most of the boys were looking down now, at the grass or their feet. Jack cleared his throat again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027m not going to be a part of Ralph\u0027s lot--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He looked along the right-hand logs, numbering the hunters that had been a choir.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027m going off by myself. He can catch his own pigs. Anyone who wants to hunt when I do can come too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He blundered out of the triangle toward the drop to the white sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Jack!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack turned and looked back at Ralph. For a moment he paused and then cried out, high-pitched, enraged.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--No!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He leapt down from the platform and ran along the beach, paying no heed to the steady fall of his tears; and until he dived into the forest Ralph watched him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy was indignant.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I been talking, Ralph, and you just stood there like--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Softly, looking at Piggy and not seeing him, Ralph spoke to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He\u0027ll come back. When the sun goes down he\u0027ll come.\" He looked at the conch in Piggy\u0027s hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Well there!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy gave up the attempt to rebuke Ralph. He polished his glass again and went back to his subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We can do without Jack Merridew. There\u0027s others besides him on this island. But now we really got a beast, though I can\u0027t hardly believe it, we\u0027ll need to stay close to the platform; there\u0027ll be less need of him and his hunting. So now we can really decide on what\u0027s what.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"There\u0027s no help, Piggy. Nothing to be done.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　For a while they sat in depressed silence. Then Simon stood up and took the conch from Piggy, who was so astonished that he remained on his feet. Ralph looked up at Simon.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Simon? What is it this time?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　A half-sound of jeering ran round the circle and Simon shrank from it.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I thought there might be something to do. Something we-\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Again the pressure of the assembly took his voice away. He sought for help and sympathy and chose Piggy. He turned half toward him, clutching the conch to his brown chest.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I think we ought to climb the mountain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The circle shivered with dread. Simon broke off and turned to Piggy who was looking at him with an expression of derisive incomprehension.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What\u0027s the good of climbing up to this here beast when Ralph and the other two couldn\u0027t do nothing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon whispered his answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What else is there to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　His speech made, he allowed Piggy to lift the conch out of his hands. Then he retired and sat as far away from the others as possible.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy was speaking now with more assurance and with what, if the circumstances had not been so serious, the others would have recognized as pleasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I said we could all do without a certain person. Now I say we got to decide on what can be done. And I think I could tell you what Ralph\u0027s going to say next. The most important thing on the island is the smoke and you can\u0027t have no smoke without a fire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph made a restless movement.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"No go, Piggy. We\u0027ve got no fire. That thing sits up there--we\u0027ll have to stay here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy lifted the conch as though to add power to his next words.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We got no fire on the mountain. But what\u0027s wrong with a fire down here? A fire could be built on them rocks. On the sand, even. We\u0027d make smoke just the same.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That\u0027s right!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Smoke!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"By the bathing pool!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The boys began to babble. Only Piggy could have the intellectual daring to suggest moving the fire from the mountain.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"So we\u0027ll have the fire down here,\" said Ralph. He looked about him. \"We can build it just here between the bathing pool and the platform. Of course--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He broke off, frowning, thinking the thing out, unconsciously tugging at the stub of a nail with his teeth.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Of course the smoke won\u0027t show so much, not be seen so far away. But we needn\u0027t go near, near the--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The others nodded in perfect comprehension. There would be no need to go near.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll build the fire now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The greatest ideas are the simplest. Now there was something to be done they worked with passion. Piggy was so full of delight and expanding liberty in Jack\u0027s departure, so full of pride in his contribution to the good of society, that he helped to fetch wood. The wood he fetched was close at hand, a fallen tree on the platform that they did not need for the assembly, yet to the others the sanctity of the platform had protected even what was useless there. Then the twins realized they would have a fire near them as a comfort in the night and this set a few littluns dancing and clapping hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The wood was not so dry as the fuel they had used on the mountain. Much of it was damply rotten and full of insects that scurried; logs had to be lifted from the soil with care or they crumbled into sodden powder. More than this, in order to avoid going deep into the forest the boys worked near at hand on any fallen wood no matter how tangled with new growth. The skirts of the forest and the scar were familiar, near the conch and the shelters and sufficiently friendly in daylight. What they might become in darkness nobody cared to think. They worked therefore with great energy and cheerfulness, though as time crept by there was a suggestion of panic in the energy and hysteria in the cheerfulness. They built a pyramid of leaves and twigs, branches and logs, on the bare sand by the platform. For the first time on the island, Piggy himself removed his one glass, knelt down and focused the sun on tinder. Soon there was a ceiling of smoke and a bush of yellow flame.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The littluns who had seen few fires since the first catastrophe became wildly excited. They danced and sang and there was a partyish air about the gathering.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　At last Ralph stopped work and stood up, smudging the sweat from his face with a dirty forearm.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll have to have a small fire. This one\u0027s too big to keep up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy sat down carefully on the sand and began to polish his glass.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We could experiment. We could find out how to make a small hot fire and then put green branches on to make smoke. Some of them leaves must be better for that than the others.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　As the fire died down so did the excitement. The littluns stopped singing and dancing and drifted away toward the sea or the fruit trees or the shelters.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph dropped down in the sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll have to make a new list of who\u0027s to look after the fire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"If you can find \u0027em.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He looked round. Then for the first time he saw how few biguns there were and understood why the work had been so hard.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Where\u0027s Maurice?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy wiped his glass again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I expect . . . no, he wouldn\u0027t go into the forest by himself, would he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph jumped up, ran swiftly round the fire and stood by Piggy, holding up his hair.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But we\u0027ve got to have a list! There\u0027s you and me and Samneric and--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He would not look at Piggy but spoke casually.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Where\u0027s Bill and Roger?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy leaned forward and put a fragment of wood on the fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I expect they\u0027ve gone. I expect they won\u0027t play either.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph sat down and began to poke little holes in the sand. He was surprised to see that one had a drop of blood by it. He examined his bitten nail closely and watched the little globe of blood that gathered where the quick was gnawed away.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy went on speaking.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I seen them stealing off when we was gathering wood. They went that way. The same way as he went himself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph finished his inspection and looked up into the air. The sky, as if in sympathy with the great changes among them, was different today and so misty that in some places the hot air seemed white. The disc of the sun was dull silver as though it were nearer and not so hot, yet the air stifled.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"They always been making trouble, haven\u0027t they?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The voice came near his shoulder and sounded anxious. \"We can do without \u0027em. We\u0027ll be happier now, won\u0027t we?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph sat. The twins came, dragging a great log and grinning in their triumph. They dumped the log among the embers so that sparks flew.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We can do all right on our own, can\u0027t we?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　For a long time while the log dried, caught fire and turned red hot, Ralph sat in the sand and said nothing. He did not see Piggy go to the twins and whisper to them, nor how the three boys went together into the forest.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Here you are.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He came to himself with a jolt. Piggy and the other two were by him. They were laden with fruit.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I thought perhaps,\" said Piggy, \"we ought to have a feast, kind of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The three boys sat down. They had a great mass of the fruit with them and all of it properly ripe. They grinned at Ralph as he took some and began to eat.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Thanks,\" he said. Then with an accent of pleased surprise--\"Thanks!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Do all right on our own,\" said Piggy. \"It\u0027s them that haven\u0027t no common sense that make trouble on this island. We\u0027ll make a little hot fire--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph remembered what had been worrying him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Where\u0027s Simon?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I don\u0027t know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You don\u0027t think he\u0027s climbing the mountain?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy broke into noisy laughter and took more fruit. \"He might be.\" He gulped his mouthful. \"He\u0027s cracked.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon had passed through the area of fruit trees but today the littluns had been too busy with the fire on the beach and they had not pursued him there. He went on among the creepers until he reached the great mat that was woven by the open space and crawled inside. Beyond the screen of leaves the sunlight pelted down and the butterflies danced in the middle their unending dance. He knelt down and the arrow of the sun fell on him. That other time the air had seemed to vibrate with heat; but now it threatened. Soon the sweat was running from his long coarse hair. He shifted restlessly but there was no avoiding the sun. Presently he was thirsty, and then very thirsty. He continued to sit.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Far off along the beach, Jack was standing before a small group of boys. He was looking brilliantly happy.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Hunting,\" he said. He sized them up. Each of them wore the remains of a black cap and ages ago they had stood in two demure rows and their voices had been the song of angels.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll hunt. I\u0027m going to be chief.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　They nodded, and the crisis passed easily.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"And then--about the beast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　They moved, looked at the forest.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I say this. We aren\u0027t going to bother about the beast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He nodded at them.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027re going to forget the beast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That\u0027s right!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Yes!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Forget the beast!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　If Jack was astonished by their fervor he did not show it.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"And another thing. We shan\u0027t dream so much down here. This is near the end of the island.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　They agreed passionately out of the depths of their tormented private lives.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Now listen. We might go later to the castle rock. But now I\u0027m going to get more of the biguns away from the conch and all that. We\u0027ll kill a pig and give a feast.\" He paused and went on more slowly. \"And about the beast. When we kill we\u0027ll leave some of the kill for it. Then it won\u0027t bother us, maybe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He stood up abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll go into the forest now and hunt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He turned and trotted away and after a moment they followed him obediently.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　They spread out, nervously, in the forest. Almost at once Jack found the dung and scattered roots that told of pig and soon the track was fresh. Jack signaled the rest of the hunt to be quiet and went forward by himself. He was happy and wore the damp darkness of the forest like his old clothes. He crept down a slope to rocks and scattered trees by the sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The pigs lay, bloated bags of fat, sensuously enjoying the shadows under the trees. There was no wind and they were unsuspicious; and practice had made Jack silent as the shadows. He stole away again and instructed his hidden hunters. Presently they all began to inch forward sweating in the silence and heat. Under the trees an ear flapped idly. A little apart from the rest, sunk in deep maternal bliss, lay the largest sow of the lot. She was black and pink; and the great bladder of her belly was fringed with a row of piglets that slept or burrowed and squeaked.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Fifteen yards from the drove Jack stopped, and his arm, straightening, pointed at the sow. He looked round in inquiry to make sure that everyone understood and the other boys nodded at him. The row of right arms slid back.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Now!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The drove of pigs started up; and at a range of only ten yards the wooden spears with fire-hardened points flew toward the chosen pig. One piglet, with a demented shriek, rushed into the sea trailing Roger\u0027s spear behind it. The sow gave a gasping squeal and staggered up, with two spears sticking in her fat flank. The boys shouted and rushed forward, the piglets scattered and the sow burst the advancing line and went crashing away through the forest.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"After her!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　They raced along the pig-track, but the forest was too dark and tangled so that Jack, cursing, stopped them and cast among the trees. Then he said nothing for a time but breathed fiercely so that they were awed by him and looked at each other in uneasy admiration. Presently he stabbed down at the ground with his finger.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"There--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Before the others could examine the drop of blood, Jack had swerved off, judging a trace, touching a bough that gave. So he followed, mysteriously right and assured, and the hunters trod behind him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He stopped before a covert.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"In there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　They surrounded the covert but the sow got away with the sting of another spear in her flank. The trailing butts hindered her and the sharp, cross-cut points were a torment. She blundered into a tree, forcing a spear still deeper; and after that any of the hunters could follow her easily by the drops of vivid blood. The afternoon wore on, hazy and dreadful with damp heat; the sow staggered her way ahead of them, bleeding and mad, and the hunters followed, wedded to her in lust, excited by the long chase and the dropped blood. They could see her now, nearly got up with her, but she spurted with her last strength and held ahead of them again. They were just behind her when she staggered into an open space where bright flowers grew and butterflies danced round each other and the air was hot and still.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Here, struck down by the heat, the sow fell and the hunters hurled themselves at her. This dreadful eruption from an unknown world made her frantic; she squealed and bucked and the air was full of sweat and noise and blood and terror. Roger ran round the heap, prodding with his spear whenever pigflesh appeared. Jack was on top of the sow, stabbing downward with his knife. Roger found a lodgment for his point and began to push till he was leaning with his whole weight. The spear moved forward inch by inch and the terrified squealing became a highpitched scream. Then Jack found the throat and the hot blood spouted over his hands. The sow collapsed under them and they were heavy and fulfilled upon her. The butterflies still danced, preoccupied in the center of the clearing.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　At last the immediacy of the kill subsided. The boys drew back, and Jack stood up, holding out his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Look.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He giggled and flicked them while the boys laughed at his reeking palms. Then Jack grabbed Maurice and rubbed the stuff over his cheeks. Roger began to withdraw his spear and boys noticed it for the first time. Robert stabilized the thing in a phrase which was received uproariously.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Right up her ass!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Did you hear?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Did you hear what he said?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Right up her ass!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　This time Robert and Maurice acted the two parts; and Maurice\u0027s acting of the pig\u0027s efforts to avoid the advancing spear was so funny that the boys cried with laughter.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　At length even this palled. Jack began to clean his bloody hands on the rock. Then he started work on the sow and paunched her, lugging out the hot bags of colored guts, pushing them into a pile on the rock while the others watched him. He talked as he worked.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll take the meat along the beach. I\u0027ll go back to the platform and invite them to a feast. That should give\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　us time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Roger spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Chief--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Uh--?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"How can we make a fire?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack squatted back and frowned at the pig.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll raid them and take fire. There must be four of you; Henry and you, Robert and Maurice. We\u0027ll put on paint and sneak up; Roger can snatch a branch while I say what I want. The rest of you can get this back to where we were. We\u0027ll build the fire there. And after that--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He paused and stood up, looking at the shadows under the trees. His voice was lower when he spoke again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But we\u0027ll leave part of the kill for . . .\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He knelt down again and was busy with his knife. The boys crowded round him. He spoke over his shoulder to Roger.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Sharpen a stick at both ends.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Presently he stood up, holding the dripping sow\u0027s head in his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Where\u0027s that stick?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Ram one end in the earth. Oh--it\u0027s rock. Jam it in that crack. There.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack held up the head and jammed the soft throat down on the pointed end of the stick which pierced through into the mouth. He stood back and the head hung there, a little blood dribbling down the stick.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Instinctively the boys drew back too; and the forest was very still. They listened, and the loudest noise was the buzzing of flies over the spilled guts.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack spoke in a whisper.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Pick up the pig.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Maurice and Robert skewered the carcass, lifted the dead weight, and stood ready. In the silence, and standing over the dry blood, they looked suddenly furtive.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack spoke loudly.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"This head is for the beast. It\u0027s a gift.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The silence accepted the gift and awed them. The head remained there, dim-eyed, grinning faintly, blood blackening between the teeth. All at once they were running away, as fast as they could, through the forest toward the open beach.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon stayed where he was, a small brown image, concealed by the leaves. Even if he shut his eyes the sow\u0027s head still remained like an after-image. The half-shut eyes were dim with the infinite cynicism of adult life. They assured Simon that everything was a bad business.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I know that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon discovered that he had spoken aloud. He opened his eyes quickly and there was the head grinning amusedly in the strange daylight, ignoring the flies, the spilled guts, even ignoring the indignity of being spiked on a stick.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He looked away, licking his dry lips.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　A gift for the beast. Might not the beast come for it? The head, he thought, appeared to agree with him. Run away, said the head silently, go back to the others. It was a joke really--why should you bother? You were just wrong, that\u0027s all. A little headache, something you ate, perhaps. Go back, child, said the head silently.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon looked up, feeling the weight of his wet hair, and gazed at the sky. Up there, for once, were clouds, great bulging towers that sprouted away over the island, grey and cream and copper-colored. The clouds were sitting on the land; they squeezed, produced moment by moment this close, tormenting heat. Even the butterflies deserted the open space where the obscene thing grinned and dripped. Simon lowered his head, carefully keeping his eyes shut, then sheltered them with his hand. There were no shadows under the trees but everywhere a pearly stillness, so that what was real seemed illusive and without definition. The pile of guts was a black blob of flies that buzzed like a saw. After a while these flies found Simon. Gorged, they alighted by his runnels of sweat and drank. They tickled under his nostrils and played leapfrog on his thighs. They were black and iridescent green and without number; and in front of Simon, the Lord of the Flies hung on his stick and grinned. At last Simon gave up and looked back; saw the white teeth and dim eyes, the blood--and his gaze was held by that ancient, inescapable recognition. In Simon\u0027s right temple, a pulse began to beat on the brain.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph and Piggy lay in the sand, gazing at the fire and idly flicking pebbles into its smokeless heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That branch is gone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Where\u0027s Samneric?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We ought to get some more wood. We\u0027re out of green branches.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph sighed and stood up. There were no shadows under the palms on the platform; only this strange light that seemed to come from everywhere at once. High up among the bulging clouds thunder went off like a gun.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027re going to get buckets of rain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What about the fire?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph trotted into the forest and returned with a wide spray of green which he dumped on the fire. The branch crackled, the leaves curled and the yellow smoke expanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy made an aimless little pattern in the sand with his fingers.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Trouble is, we haven\u0027t got enough people for a fire. You got to treat Samnenc as one turn. They do everything together--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Of course.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Well, that isn\u0027t fair. Don\u0027t you see? They ought to do two turns.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph considered this and understood. He was vexed to find how little he thought like a grownup and sighed again. The island was getting worse and worse.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy looked at the fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You\u0027ll want another green branch soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph rolled over.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Piggy. What are we going to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Just have to get on without \u0027em.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But--the fire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He frowned at the black and white mess in which lay the unburnt ends of branches. He tried to formulate.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027m scared.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He saw Piggy look up; and blundered on.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Not of the beast. I mean I\u0027m scared of that too. But nobody else understands about the fire. If someone threw you a rope when you were drowning. If a doctor said take this because if you don\u0027t take it you\u0027ll die--you would, wouldn\u0027t you? I mean?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"\u0027Course I would.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Can\u0027t they see? Can\u0027t they understand? Without the smoke signal we\u0027ll die here? Look at that!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　A wave of heated air trembled above the ashes but without a trace of smoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We can\u0027t keep one fire going. And they don\u0027t care. And what\u0027s more--\" He looked intensely into Piggy\u0027s streaming face.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What\u0027s more, _I_ don\u0027t sometimes. Supposing I got like the others--not caring. What \u0027ud become of us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy took off his glasses, deeply troubled.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I dunno, Ralph. We just got to go on, that\u0027s all. That\u0027s what grownups would do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph, having begun the business of unburdening himself, continued.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Piggy, what\u0027s wrong?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy looked at him in astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Do you mean the--?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"No, not it . . . I mean . . . what makes things break up like they do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy rubbed his glasses slowly and thought. When he understood how far Ralph had gone toward accepting him he flushed pinkly with pride.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I dunno, Ralph. I expect it\u0027s him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Jack?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Jack.\" A taboo was evolving round that word too.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph nodded solemnly.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Yes,\" he said, \"I suppose it must be.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The forest near them burst into uproar. Demoniac figures with faces of white and red and green rushed out howling, so that the littluns fled screaming. Out of the corner of his eye, Ralph saw Piggy running. Two figures rushed at the fire and he prepared to defend himself but they grabbed half-burnt branches and raced away along the beach. The three others stood still, watching Ralph; and he saw that the tallest of them, stark naked save for paint and a belt, was Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph had his breath back and spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Well?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Jack ignored him, lifted his spear and began to shout.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Listen all of you. Me and my hunters, we\u0027re living along the beach by a flat rock. We hunt and feast and have fun. If you want to join my tribe come and see us. Perhaps I\u0027ll let you join. Perhaps not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He paused and looked round. He was safe from shame or self-consciousness behind the mask of his paint and could look at each of them in turn. Ralph was kneeling by the remains of the fire like a sprinter at his mark and his face was half-hidden by hair and smut. Samneric peered together round a palm tree at the edge of the forest. A littlun howled, creased and crimson, by the bathing pool and Piggy stood on the platform, the white conch gripped in his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Tonight we\u0027re having a feast. We\u0027ve killed a pig and we\u0027ve got meat. You can come and eat with us if you like.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Up in the cloud canyons the thunder boomed again. Jack and the two anonymous savages with him swayed, looking up, and then recovered. The littlun went on howling. Jack was waiting for something. He whispered urgently to the others.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Go on--now!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The two savages murmured. Jack spoke sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Go on!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The two savages looked at each other, raised their spears together and spoke in time.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"The Chief has spoken.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Then the three of them turned and trotted away. Presently Ralph rose to his feet, looking at the place where the savages had vanished. Samneric came, talking in an awed whisper.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I thought it was--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--and I was--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--scared.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy stood above them on the platform, still holding the conch.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That was Jack and Maurice and Robert,\" said Ralph. \"Aren\u0027t they having fun?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I thought I was going to have asthma.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Sucks to your ass-mar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"When I saw Jack I was sure he\u0027d go for the conch. Can\u0027t think why.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The group of boys looked at the white shell with affectionate respect. Piggy placed it in Ralph\u0027s hand and the littluns, seeing the familiar symbol, started to come back.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Not here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He turned toward the platform, feeling the need for ritual. First went Ralph, the white conch cradled, then Piggy very grave, then the twins, then the littluns and the others.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Sit down all of you. They raided us for fire. They\u0027re having fun. But the--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph was puzzled by the shutter that flickered in his brain. There was something he wanted to say; then the shutter had come down.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But the--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　They were regarding him gravely, not yet troubled by any doubts about his sufficiency. Ralph pushed the idiot hair out of his eyes and looked at Piggy.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But the . . . oh . . . the fire! Of course, the fire!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He started to laugh, then stopped and became fluent instead.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"The fire\u0027s the most important thing. Without the fire we can\u0027t be rescued. I\u0027d like to put on war-paint and be a savage. But we must keep the fire burning. The fire\u0027s the most important thing on the island, because, because--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He paused again and the silence became full of doubt and wonder.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy whispered urgently. \"Rescue.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Oh yes. Without the fire we can\u0027t be rescued. So we must stay by the fire and make smoke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　When he stopped no one said anything. After the many brilliant speeches that had been made on this very spot Ralph\u0027s remarks seemed lame, even to the littluns.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　At last Bill held out his hands for the conch.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Now we can\u0027t have the fire up there--because we can\u0027t have the fire up there--we need more people to keep it going. Let\u0027s go to this feast and tell them the fire\u0027s hard on the rest of us. And the hunting and all that, being savages I mean--it must be jolly good fun.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Samneric took the conch.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That must be fun like Bill says--and as he\u0027s invited us--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--to a feast--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--meat--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--crackling--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--I could do with some meat--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph held up his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Why shouldn\u0027t we get our own meat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The twins looked at each other. Bill answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We don\u0027t want to go in the jungle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph grimaced.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He--you know--goes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He\u0027s a hunter. They\u0027re all hunters. That\u0027s different.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　No one spoke for a moment, then Piggy muttered to the sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Meat--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The littluns sat, solemnly thinking of meat, and dribbling. Overhead the cannon boomed again and the dry palm fronds clattered in a sudden gust of hot wind.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You are a silly little boy,\" said the Lord of the Flies, \"just an ignorant, silly little boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon moved his swollen tongue but said nothing.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Don\u0027t you agree?\" said the Lord of the Flies. \"Aren\u0027t you just a silly little boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon answered him in the same silent voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Well then,\" said the Lord of the Flies, \"you\u0027d better run off and play with the others. They think you\u0027re batty. You don\u0027t want Ralph to think you\u0027re batty, do you? You like Ralph a lot, don\u0027t you? And Piggy, and Jack?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon\u0027s head was tilted slightly up. His eyes could not break away and the Lord of the Flies hung in space before him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What are you doing out here all alone? Aren\u0027t you afraid of me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon shook.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"There isn\u0027t anyone to help you. Only me. And I\u0027m the Beast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon\u0027s mouth labored, brought forth audible words.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Pig\u0027s head on a stick.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Fancy thinking the Beast was something you could hunt and kill!\" said the head. For a moment or two the forest and all the other dimly appreciated places echoed with the parody of laughter. \"You knew, didn\u0027t you? I\u0027m part of you? Close, close, close! I\u0027m the reason why it\u0027s no go? Why things are what they are?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The laughter shivered again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Come now,\" said the Lord of the Flies. \"Get back to the others and we\u0027ll forget the whole thing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon\u0027s head wobbled. His eyes were half closed as though he were imitating the obscene thing on the stick. He knew that one of his times was coming on. The Lord of the Flies was expanding like a balloon.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"This is ridiculous. You know perfectly well you\u0027ll only meet me down there--so don\u0027t try to escape!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon\u0027s body was arched and stiff. The Lord of the Flies spoke in the voice of a schoolmaster.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"This has gone quite far enough. My poor, misguided child, do you think you know better than I do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　There was a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027m warning you. I\u0027m going to get angry. D\u0027you see? You\u0027re not wanted. Understand? We are going to have fun on this island. Understand? We are going to have fun on this island! So don\u0027t try it on, my poor misguided boy, or else--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon found he was looking into a vast mouth. There was blackness within, a blackness that spread.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--Or else,\" said the Lord of the Flies, \"we shall do you? See? Jack and Roger and Maurice and Robert and Bill and Piggy and Ralph. Do you. See?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Simon was inside the mouth. He fell down and lost consciousness.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/1413/42420.html","bookId":15,"creation":"Aug 1, 2019 2:23:12 AM","modification":"Aug 1, 2019 2:23:12 AM"}
