{"id":524,"no":19,"title":"Chapter 10 The Shell and the Glasses","content":"\u0026nbsp;　　Piggy eyed the advancing figure carefully. Nowadays he sometimes found that he saw more clearly if he removed his glasses and shifted the one lens to the other eye; but even through the good eye, after what had happened, Ralph remained unmistakably Ralph. He came now out of the coconut trees, limping, dirty, with dead leaves hanging from his shock of yellow hair. One eye was a slit in his puffy cheek and a great scab had formed on his right knee. He paused for a moment and peered at the figure on the platform. \n\u003cdiv\u003e\n 　　\"Piggy? Are you the only one left?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"There\u0027s some littluns.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"They don\u0027t count. No biguns?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Oh--Samneric. They\u0027re collecting wood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Nobody else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Not that I know of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph climbed on to the platform carefully. The coarse grass was still worn away where the assembly used to sit; the fragile white conch still gleamed by the polished seat. Ralph sat down in the grass facing the chief\u0027s seat and the conch. Piggy knelt at his left, and for a long minute there was silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　At last Ralph cleared his throat and whispered something.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy whispered back.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What you say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph spoke up.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Simon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy said nothing but nodded, solemnly. They continued to sit, gazing with impaired sight at the chief\u0027s seat and the glittering lagoon. The green light and the glossy patches of sunshine played over their befouled bodies.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　At length Ralph got up and went to the conch. He took the shell caressingly with both hands and knelt, leaning against the trunk.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Piggy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Uh?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What we going to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy nodded at the conch.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You could--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Call an assembly?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph laughed sharply as he said the word and Piggy frowned.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You\u0027re still chief.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph laughed again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You are. Over us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I got the conch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Ralph! Stop laughing like that. Look, there ain\u0027t no need, Ralph! What\u0027s the others going to think?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　At last Ralph stopped. He was shivering.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Piggy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Uh?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That was Simon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You said that before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Piggy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Uh?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That was murder.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You stop it!\" said Piggy, shrilly. \"What good\u0027re you doing talking like that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He jumped to his feet and stood over Ralph.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"It was dark. There was that--that bloody dance. There was lightning and thunder and rain. We was scared!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I wasn\u0027t scared,\" said Ralph slowly, \"I was--I don\u0027t know what I was.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We was scared!\" said Piggy excitedly. \"Anything might have happened. It wasn\u0027t--what you said.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He was gesticulating, searching for a formula.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Oh, Piggy!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph\u0027s voice, low and stricken, stopped Piggy\u0027s gestures. He bent down and waited. Ralph, cradling the conch, rocked himself to and fro.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Don\u0027t you understand, Piggy? The things we did--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He may still be--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"P\u0027raps he was only pretending--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy\u0027s voice trailed off at the sight of Ralph\u0027s face.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You were outside. Outside the circle. You never really came in. Didn\u0027t you see what we--what they did?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　There was loathing, and at the same time a kind of feverish excitement, in his voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Didn\u0027t you see, Piggy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Not all that well. I only got one eye now. You ought to know that, Ralph.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph continued to rock to and fro.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"It was an accident,\" said Piggy suddenly, \"that\u0027s what it was. An accident.\" His voice shrilled again. \"Coming in the dark--he hadn\u0027t no business crawling like that out of the dark. He was batty. He asked for it.\" He gesticulated widely again. \"It was an accident.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You didn\u0027t see what they did--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Look, Ralph. We got to forget this. We can\u0027t do no good thinking about it, see?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027m frightened. Of us. I want to go home. Oh God, I want to go home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"It was an accident,\" said Piggy stubbornly, \"and that\u0027s that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He touched Ralph\u0027s bare shoulder and Ralph shuddered at the human contact.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"And look, Ralph\"--Piggy glanced round quickly, then leaned close--\"don\u0027t let on we was in that dance. Not to Samneric.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But we were! All of us!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Not us till last. They never noticed in the dark. Anyway you said I was only on the outside.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"So was I,\" muttered Ralph, \"I was on the outside too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy nodded eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That\u0027s right. We was on the outside. We never done nothing, we never seen nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy paused, then went on.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll live on our own, the four of us--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Four of us. We aren\u0027t enough to keep the fire burning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll try. See? I lit it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Samneric came dragging a great log out of the forest. They dumped it by the fire and turned to the pool. Ralph jumped to his feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Hi! You two!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The twins checked a moment, then walked on.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"They\u0027re going to bathe, Ralph.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Better get it over.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The twins were very surprised to see Ralph. They flushed and looked past him into the air.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Hullo. Fancy meeting you, Ralph.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We just been in the forest--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--to get wood for the fire--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--we got lost last night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph examined his toes.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You got lost after the . . .\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy cleaned his lens.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"After the feast,\" said Sam in a stifled voice. Eric nodded. \"Yes, after the feast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We left early,\" said Piggy quickly, \"because we were tired.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"So did we--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--very early--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--we were very tired.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Sam touched a scratch on his forehead and then hurriedly took his hand away. Eric fingered his split lip.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Yes. We were very tired,\" repeated Sam, \"so we left early. Was it a good--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The air was heavy with unspoken knowledge. Sam twisted and the obscene word shot out of him. \"-- dance?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Memory of the dance that none of them had attended shook all four boys convulsively.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We left early.\"　　\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　When Roger came to the neck of land that joined the Castle Rock to the mainland he was not surprised to be challenged. He had reckoned, during the terrible night, on finding at least some of the tribe holding out against the horrors of the island in the safest place.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The voice rang out sharply from on high, where the diminishing crags were balanced one on another.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Halt! Who goes there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Roger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Advance, friend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Roger advanced.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You could see who I was.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"The chief said we got to challenge everyone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Roger peered up.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You couldn\u0027t stop me coming if I wanted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Couldn\u0027t I? Climb up and see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Roger clambered up the ladder-like cliff.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Look at this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　A log had been jammed under the topmost rock and another lever under that. Robert leaned lightly on the lever and the rock groaned. A full effort would send the rock thundering down to the neck of land. Roger admired.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He\u0027s a proper chief, isn\u0027t he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Robert nodded.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He\u0027s going to take us hunting.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He jerked his head in the direction of the distant shelters where a thread of white smoke climbed up the sky. Roger, sitting on the very edge of the cliff, looked somberly back at the island as he worked with his fingers at a loose tooth. His gaze settled on the top of the distant mountain and Robert changed the unspoken subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He\u0027s going to beat Wilfred.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Robert shook his head doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I don\u0027t know. He didn\u0027t say. He got angry and made us tie Wilfred up. He\u0027s been\"--he giggled excitedly--\"he\u0027s been tied for hours, waiting--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But didn\u0027t the chief say why?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I never heard him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Sitting on the tremendous rock in the torrid sun, Roger received this news as an illumination. He ceased to work at his tooth and sat still, assimilating the possibilities of irresponsible authority. Then, without another word, he climbed down the back of the rocks toward the cave and the rest of the tribe.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The chief was sitting there, naked to the waist, his face blocked out in white and red. The tribe lay in a semicircle before him. The newly beaten and untied Wilfred was sniffing noisily in the background. Roger squatted with the rest.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Tomorrow,\" went on the chief, \"we shall hunt again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He pointed at this savage and that with his spear.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Some of you will stay here to improve the cave and defend the gate. I shall take a few hunters with me and bring back meat. The defenders of the gate will see that the others don\u0027t sneak in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　A savage raised his hand and the chief turned a bleak, painted face toward him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Why should they try to sneak in, Chief?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The chief was vague but earnest.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"They will. They\u0027ll try to spoil things we do. So the watchers at the gate must be careful. And then--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The chief paused. They saw a triangle of startling pink dart out, pass along his lips and vanish again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--and then, the beast might try to come in. You remember how he crawled--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The semicircle shuddered and muttered in agreement.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He came--disguised. He may come again even though we gave him the head of our kill to eat. So watch; and be careful.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Stanley lifted his forearm off the rock and held up an interrogative finger.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Well?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But didn\u0027t we, didn\u0027t we--?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He squirmed and looked down.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"No!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　In the silence that followed, each savage flinched away from his individual memory.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"No! How could we--kill--it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Half-relieved, half-daunted by the implication of further terrors, the savages murmured again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"So leave the mountain alone,\" said the chief, solemnly, \"and give it the head if you go hunting.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Stanley flicked his finger again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I expect the beast disguised itself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Perhaps,\" said the chief. A theological speculation presented itself. \"We\u0027d better keep on the right side of him, anyhow. You can\u0027t tell what he might do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The tribe considered this; and then were shaken, as if by a flow of wind. The chief saw the effect of his words and stood abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But tomorrow we\u0027ll hunt and when we\u0027ve got meat we\u0027ll have a feast--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Bill put up his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Chief.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Yes?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What\u0027ll we use for lighting the fire?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The chief\u0027s blush was hidden by the white and red clay. Into his uncertain silence the tribe spilled their murmur once more. Then the chief held up his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We shall take fire from the others. Listen. Tomorrow we\u0027ll hunt and get meat. Tonight I\u0027ll go along with two hunters--who\u0027ll come?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Maurice and Roger put up their hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Maurice--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Yes, Chief?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Where was their fire?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Back at the old place by the fire rock.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The chief nodded.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"The rest of you can go to sleep as soon as the sun sets. But us three, Maurice, Roger and me, we\u0027ve got work to do. We\u0027ll leave just before sunset--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Maurice put up his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But what happens if we meet--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The chief waved his objection aside.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ll keep along by the sands. Then if he comes we\u0027ll do our, our dance again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Only the three of us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Again the murmur swelled and died away.　　\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy handed Ralph his glasses and waited to receive back his sight. The wood was damp; and this was the third time they had lighted it. Ralph stood back, speaking to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We don\u0027t want another night without fire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He looked round guiltily at the three boys standing by. This was the first time he had admitted the double function of the fire. Certainly one was to send up a beckoning column of smoke; but the other was to be a hearth now and a comfort until they slept. Eric breathed on the wood till it glowed and sent out a little flame. A billow of white and yellow smoke reeked up. Piggy took back his glasses and looked at the smoke with pleasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"If only we could make a radio!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Or a plane--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--or a boat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph dredged in his fading knowledge of the world.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We might get taken prisoner by the Reds.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Eric pushed back his hair.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"They\u0027d be better than--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He would not name people and Sam finished the sentence for him by nodding along the beach.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph remembered the ungainly figure on a parachute.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"He said something about a dead man.\" He flushed painfully at this admission that he had been present at the dance. He made urging motions at the smoke and with his body. \"Don\u0027t stop--go on up!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Smoke\u0027s getting thinner.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We need more wood already, even when it\u0027s wet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"My asthma--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The response was mechanical.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Sucks to your ass-mar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"If I pull logs, I get my asthma bad. I wish I didn\u0027t, Ralph, but there it is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The three boys went into the forest and fetched armfuls of rotten wood. Once more the smoke rose, yellow and thick.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Let\u0027s get something to eat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Together they went to the fruit trees, carrying their spears, saying little, cramming in haste. When they came out of the forest again the sun was setting and only embers glowed in the fire, and there was no smoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I can\u0027t carry any more wood,\" said Eric. \"I\u0027m tired.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph cleared his throat.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We kept the fire going up there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Up there it was small. But this has got to be a big one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph carried a fragment to the fire and watched the smoke that drifted into the dusk.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We\u0027ve got to keep it going.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Eric flung himself down.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I\u0027m too tired. And what\u0027s the good?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Eric!\" cried Ralph in a shocked voice. \"Don\u0027t talk like that!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Sam knelt by Eric.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Well--what is the good?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph tried indignantly to remember. There was something good about a fire. Something overwhelmingly good.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Ralph\u0027s told you often enough,\" said Piggy moodily. \"How else are we going to be rescued?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Of course! If we don\u0027t make smoke--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He squatted before them in the crowding dusk.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Don\u0027t you understand? What\u0027s the good of wishing for radios and boats?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He held out his hand and twisted the fingers into a fist. \"There\u0027s only one thing we can do to get out of this mess. Anyone can play at hunting, anyone can get us meat--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He looked from face to face. Then, at the moment of greatest passion and conviction, that curtain flapped in his head and he forgot what he had been driving at. He knelt there, his fist clenched, gazing solemnly from one to the other. Then the curtain whisked back.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Oh, yes. So we\u0027ve got to make smoke; and more smoke--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"But we can\u0027t keep it going! Look at that!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The fire was dying on them.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Two to mind the fire,\" said Ralph, half to himself, \"that\u0027s twelve hours a day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We can\u0027t get any more wood, Ralph--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--not in the dark--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--not at night--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We can light it every morning,\" said Piggy. \"Nobody ain\u0027t going to see smoke in the dark.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Sam nodded vigorously.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"It was different when the fire was--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--up there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph stood up, feeling curiously defenseless with the darkness pressing in.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Let the fire go then, for tonight.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He led the way to the first shelter, which still stood, though battered. The bed leaves lay within, dry and noisy to the touch. In the next shelter a littlun was talking in his sleep. The four biguns crept into the shelter and burrowed under the leaves. The twins lay together and Ralph and Piggy at the other end. For a while there was the continual creak and rustle of leaves as they tried for comfort. \"Piggy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Yeah?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"All right?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"S\u0027pose so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　At length, save for an occasional rustle, the shelter was silent. An oblong of blackness relieved with brilliant spangles hung before them and there was the hollow sound of surf on the reef. Ralph settled himself for his nightly game of supposing. . . .\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Supposing they could be transported home by jet, then before morning they would land at that big airfield in Wiltshire. They would go by car; no, for things to be perfect they would go by train; all the way down to Devon and take that cottage again. Then at the foot of the garden the wild ponies would come and look over the wall. . . .\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph turned restlessly in the leaves. Dartmoor was wild and so were the ponies. But the attraction of wildness had gone.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　His mind skated to a consideration of a tamed town where savagery could not set foot. What could be safer than the bus center with its lamps and wheels?\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　All at once, Ralph was dancing round a lamp standard. There was a bus crawling out of the bus station, a strange bus. . . .\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Ralph! Ralph!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Don\u0027t make a noise like that--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Sorry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　From the darkness of the further end of the shelter came a dreadful moaning and they shattered the leaves in their fear. Sam and Eric, locked in an embrace, were fighting each other.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Sam! Sam!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Hey--Eric!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Presently all was quiet again.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy spoke softly to Ralph.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We got to get out of this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What d\u0027you mean?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Get rescued.\"\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　For the first time that day, and despite the crowding blackness, Ralph sniggered.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I mean it,\" whispered Piggy. \"If we don\u0027t get home soon we\u0027ll be barmy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Round the bend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Bomb happy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Crackers;\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph pushed the damp tendrils of hair out of his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You write a letter to your auntie.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy considered this solemnly.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I don\u0027t know where she is now. And I haven\u0027t got an envelope and a stamp. An\u0027 there isn\u0027t a mailbox. Or a postman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　The success of his tiny joke overcame Ralph. His sniggers became uncontrollable, his body jumped and twitched.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy rebuked him with dignity.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I haven\u0027t said anything all that funny.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph continued to snigger though his chest hurt. His twitchings exhausted him till he lay, breathless and\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　woebegone, waiting for the next spasm. During one of these pauses he was ambushed by sleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Ralph! You been making a noise again. Do be quiet, Ralph--because.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph heaved over among the leaves. He had reason to be thankful that his dream was broken, for the bus had been nearer and more distinct.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Why--because?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Be quiet--and listen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph lay down carefully, to the accompaniment of a long sigh from the leaves. Eric moaned something and then lay still. The darkness, save for the useless oblong of stars, was blanket-thick.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I can\u0027t hear anything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"There\u0027s something moving outside.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph\u0027s head prickled. The sound of his blood drowned all else and then subsided.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I still can\u0027t hear anything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Listen. Listen for a long time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Quite clearly and emphatically, and only a yard or so away from the back of the shelter, a stick cracked. The blood roared again in Ralph\u0027s ears, confused images chased each other through his mind. A composite of these things was prowling round the shelters. He could feel Piggy\u0027s head against his shoulder and the convulsive grip of a hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Ralph! Ralph!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Shut up and listen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Desperately, Ralph prayed that the beast would prefer littluns.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　A voice whispered horribly outside.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Piggy--Piggy--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"It\u0027s come!\" gasped Piggy. \"It\u0027s real!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　He clung to Ralph and reached to get his breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Piggy, come outside. I want you, Piggy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph\u0027s mouth was against Piggy\u0027s ear.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Don\u0027t say anything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Piggy--where are you, Piggy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Something brushed against the back of the shelter. Piggy kept still for a moment, then he had his asthma. He arched his back and crashed among the leaves with his legs. Ralph rolled away from him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Then there was a vicious snarling in the mouth of the shelter and the plunge and thump of living things. Someone tripped over Ralph and Piggy\u0027s corner became a complication of snarls and crashes and flying limbs. Ralph hit out; then he and what seemed like a dozen others were rolling over and over, hitting, biting, scratching. He was torn and jolted, found fingers in his mouth and bit them. A fist withdrew and came back like a piston, so that the whole shelter exploded into light. Ralph twisted sideways on top of a writhing body and felt hot breath on his cheek. He began to pound the mouth below him, using his clenched fist as a hammer; he hit with more and more passionate hysteria as the face became slippery. A knee jerked up between his legs and he fell sideways, busying himself with his pain, and the fight rolled over him. Then the shelter collapsed with smothering finality; and the anonymous shapes fought their way out and through. Dark figures drew themselves out of the wreckage and flitted away, till the screams of the littluns and Piggy\u0027s gasps were once more audible.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph called out in a quavering voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"All you littluns, go to sleep. We\u0027ve had a fight with the others. Now go to sleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Samneric came close and peered at Ralph.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Are you two all right?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I think so--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"--I got busted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"So did I. How\u0027s Piggy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　They hauled Piggy clear of the wreckage and leaned him against a tree. The night was cool and purged of immediate terror. Piggy\u0027s breathing was a little easier.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Did you get hurt, Piggy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Not much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"That was Jack and his hunters,\" said Ralph bitterly. \"Why can\u0027t they leave us alone?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"We gave them something to think about,\" said Sam. Honesty compelled him to go on. \"At least you did. I got mixed up with myself in a corner.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I gave one of \u0027em what for,\" said Ralph, \"I smashed him up all right. He won\u0027t want to come and fight us again in a hurry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"So did I,\" said Eric. \"When I woke up one was kicking me in the face. I got an awful bloody face, I think, Ralph. But I did him in the end.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What did you do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I got my knee up,\" said Eric with simple pride, \"and I hit him with it in the pills. You should have heard him holler! He won\u0027t come back in a hurry either. So we didn\u0027t do too badly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph moved suddenly in the dark; but then he heard Eric working his mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"What\u0027s the matter?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"Jus\u0027 a tooth loose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Piggy drew up his legs.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"You all right, Piggy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I thought they wanted the conch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　Ralph trotted down the pale beach and jumped on to the platform. The conch still glimmered by the chief\u0027s seat. He gazed for a moment or two, then went back to Piggy.\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"They didn\u0027t take the conch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 　　\"I know. They didn\u0027t come for the conch. They came for something else. Ralph--what am I going to do?\" Far off along the bowstave of beach, three figures trotted toward the Castle Rock. They kept away from the forest and down by the water. Occasionally they sang softly; occasionally they turned cartwheels down by the moving streak of phosphorescence. The chief led then, trotting steadily, exulting in his achievement. He was a chief now in truth; and he made stabbing motions with his spear. From his left hand dangled Piggy\u0027s broken glasses.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/1413/42424.html","bookId":15,"creation":"Aug 1, 2019 2:23:24 AM","modification":"Aug 1, 2019 2:23:24 AM"}
