{"id":66811,"no":16,"title":"Page 16","content":"\u003cp\u003e44.\u003c/p\u003e\n\u003cp\u003eI was sitting next to a window drinking a large iced vanilla coffee when he appeared in the parking lot from behind a large truck. The day was hot, but he didn\u0027t seem to mind or notice his copious layers of clothing. In fact, he wasn\u0027t even sweating. Maybe he was God.\u003c/p\u003e\n\u003cp\u003eOnce inside, he ordered a cup of coffee and sat opposite me, carefully prying the plastic lid off and blowing on his coffee. Finally, when appropriately cooled, he took a sip.\u003c/p\u003e\n\u003cp\u003e\"So where do you go when you\u0027re not here speaking with me?\"\u003c/p\u003e\n\u003cp\u003e\"Wherever I want.\"\u003c/p\u003e\n\u003cp\u003e\"And where might that be?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not where you are, Jim, it\u0027s how you get there.\"\u003c/p\u003e\n\u003cp\u003e\"Wow, that\u0027s nice. You should put that on a bumper sticker.\"\u003c/p\u003e\n\u003cp\u003e\"Where do you think I got it?\"\u003c/p\u003e\n\u003cp\u003e\"Great, now God\u0027s quoting bumper stickers.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an old truth, Jim.\"\u003c/p\u003e\n\u003cp\u003e\"The journey and all that,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yes, it\u0027s about the journey,\" he said, sipping quietly and watching me with his brownish eyes.\u003c/p\u003e\n\u003cp\u003e\"And what happens once you get there?\" I asked. \"What happens once the journey is over?\"\u003c/p\u003e\n\u003cp\u003e\"That is for you to decide, my son. You can stay there, or you can start a new journey.\"\u003c/p\u003e\n\u003cp\u003e\"A new journey?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"Are we talking reincarnation here?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" said Jack. \"Are we?\"\u003c/p\u003e\n\u003cp\u003e\"Does reincarnation exist?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"The soul lives forever,\" said the bum in front of me as if he knew what the hell he was talking about. \"But the soul can choose many forms.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, it\u0027s too early in the morning for this shit, Sorry I asked.\"\u003c/p\u003e\n\u003cp\u003e\"Apology accepted. But there\u0027s a reason you asked, isn\u0027t there?\"\u003c/p\u003e\n\u003cp\u003eThere was, but I wasn\u0027t sure I wanted the answer. I put down my iced coffee and set it aside.\u003c/p\u003e\n\u003cp\u003e\"So where\u0027s my mother now?\" I asked. \"You know, her spirit, or whatever?\"\u003c/p\u003e\n\u003cp\u003eAs I spoke, Jack inhaled the coffee deeply, pausing, taking the scent deep within, making it a part of him.\u003c/p\u003e\n\u003cp\u003e\"She is wherever she wants to be,\" he said, exhaling.\u003c/p\u003e\n\u003cp\u003e\"And where would that be?\"\u003c/p\u003e\n\u003cp\u003e\"For instance, she is with us now since we are talking about her.\"\u003c/p\u003e\n\u003cp\u003e\"Oh really?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And is she sitting next to me?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t answer at first, although he gave me a gentle smile.\u003c/p\u003e\n\u003cp\u003e\"She is in your heart, Jim. Be still, and feel her there.\"\u003c/p\u003e\n\u003cp\u003eI looked at the old man across from me. On second thought, he wasn\u0027t really that old. On third thought, I was hard pressed to gauge just how old he was, although he was certainly older than me. And then another thought occurred to me: My mother. I suddenly remembered a time when she and I had gone to the beach together in the city bus. She let me ditch school and had treated me like a prince that day.\u003c/p\u003e\n\u003cp\u003eMy breath caught in my throat. Fuck, I missed her.\u003c/p\u003e\n\u003cp\u003e\"She misses you, too,\" said Jack. \"But she wants you to know that she is always with you.\" He paused, and that gentle smiled found his weathered face. \"And that you will always be her little prince, even though you are a big son-of-bitch.\"\u003c/p\u003e\n\u003cp\u003eAnd all I could do was wipe my eyes and laugh.\u003c/p\u003e\n\u003cp\u003eHi, mom.\u003c/p\u003e\n\u003cp\u003e45.\u003c/p\u003e\n\u003cp\u003e\"Last time you were here, Knighthorse, my school was turned upside down. Please, no more bodies.\"\u003c/p\u003e\n\u003cp\u003eVice Principal Williams\u0027s levity over the tragic suicide of her football coach was a tad alarming, but I let it slide without comment. She had come to the door to shake my hand. Today she was dressed in a white pant suit and a white blouse that was see-through enough to ignite the imagination of any hormone-enraged teenaged boy. And to ignite the imagination of at least one hormone-enraged detective.\u003c/p\u003e\n\u003cp\u003e\"Um, nice blouse,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" she said. She looked down at it. \"Or are you just saying that because you can see the outline of my bra?\"\u003c/p\u003e\n\u003cp\u003e\"Which qualifies it as a nice blouse.\"\u003c/p\u003e\n\u003cp\u003eShe settled into her chair behind her desk. I sat before her. Her gaze did not waver from mine. \"I am a married woman.\"\u003c/p\u003e\n\u003cp\u003eI pointed to the rock on her hand. \"Not a hard fact to overlook, even for one as highly trained as I.\"\u003c/p\u003e\n\u003cp\u003e\"What makes you so highly trained?\"\u003c/p\u003e\n\u003cp\u003e\"I apprenticed for two years with my father. And he is the best.\"\u003c/p\u003e\n\u003cp\u003e\"You say that almost grudgingly.\"\u003c/p\u003e\n\u003cp\u003e\"My father and I have never been close. You could say he was unsupportive in my earlier sporting endeavors.\"\u003c/p\u003e\n\u003cp\u003e\"You hold that against him?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eShe studied me some more, and we held each other\u0027s gaze for a heartbeat or two. She inhaled and her chest inflated and the lacy bra pushed out. It was a calculated move.\u003c/p\u003e\n\u003cp\u003e\"Currently my husband and I are separated.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\"\u003c/p\u003e\n\u003cp\u003e\"What is your situation, Mr. Knighthorse?\"\u003c/p\u003e\n\u003cp\u003eI hesitated. I did not know my situation. Cindy had not called me for two days. As far as I knew she was gone.\u003c/p\u003e\n\u003cp\u003e\"I am in a similar situation,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Perhaps we can entertain each other in the meantime.\"\u003c/p\u003e\n\u003cp\u003e\"Entertaining is good.\"\u003c/p\u003e\n\u003cp\u003e\"How about dinner this weekend?\" she asked.\u003c/p\u003e\n\u003cp\u003eI thought about it. It was getting old drinking alone.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Williams - \"\u003c/p\u003e\n\u003cp\u003e\"Please, Dana.\"\u003c/p\u003e\n\u003cp\u003e\"Dana, this weekend would be...fine.\"\u003c/p\u003e\n\u003cp\u003eShe smiled, relaxed and sat back. She had the attitude of a closed deal. \"Now what can I do for you?\"\u003c/p\u003e\n\u003cp\u003e\"Where can I find the school band director?\"\u003c/p\u003e\n\u003cp\u003e\"Bryan Dawson?\"\u003c/p\u003e\n\u003cp\u003e\"If that\u0027s the band director.\"\u003c/p\u003e\n\u003cp\u003eHer fingers drummed the arm of her chair.\u003c/p\u003e\n\u003cp\u003e\"Is there a problem, Dana?\" I asked.\u003c/p\u003e\n\u003cp\u003eShe turned in her swivel chair and gazed out her considerable window into the empty quad. I continued to watch her, intrigued by her response.\u003c/p\u003e\n\u003cp\u003e\"Why do you wish to speak to him?\"\u003c/p\u003e\n\u003cp\u003e\"Amanda quit the school band unexpectedly. I want to find out why.\"\u003c/p\u003e\n\u003cp\u003e\"Seems a reach for your investigation.\"\u003c/p\u003e\n\u003cp\u003e\"My job is to reach. Luckily I have a long arm.\"\u003c/p\u003e\n\u003cp\u003e\"You can find him here in the mornings. Room one oh seven, around six a.m. Band practice starts at zero period, six forty-five a.m.\"\u003c/p\u003e\n\u003cp\u003e\"Is there something I should know about him?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Look, I\u0027m a good detective. Perhaps not as good as my pop, but the next best thing. If there\u0027s something going on with your band director, I\u0027m going to find out about it. But you and I can cut a deal now, and if you make things easy on me, perhaps I will agree to keep things quiet.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps?\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps is the best I can offer.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps is not good enough.\"\u003c/p\u003e\n\u003cp\u003e\"Then I will find the truth on my own, and there is no deal.\"\u003c/p\u003e\n\u003cp\u003eShe sat back and gazed at me from over steepled fingers. \"You are a hard sonofabitch.\"\u003c/p\u003e\n\u003cp\u003e\"You have no idea.\"\u003c/p\u003e\n\u003cp\u003e\"I just want myself and the school left out of it.\"\u003c/p\u003e\n\u003cp\u003e\"I can probably swing that,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Probably?\"\u003c/p\u003e\n\u003cp\u003e\"Best I can offer right now.\"\u003c/p\u003e\n\u003cp\u003eShe got up and shut her door, then sat back down and faced me. She didn\u0027t look me in the eye. Instead she busied herself by adjusting her desk calendar this way and that. She only risked glancing up at me occasionally. Even then she seemed to only focus on my unnaturally broad shoulders. Who could blame her, really?\u003c/p\u003e\n\u003cp\u003e\"Now, there have been some, ah, alleged indiscretions between Mr. Dawson and a couple of his students in the past.\"\u003c/p\u003e\n\u003cp\u003e\"Have the allegations been confirmed?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Was Amanda Peterson one of those who allegedly had an indiscretion?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"What did these indiscretions involve?\"\u003c/p\u003e\n\u003cp\u003e\"Sexual advances.\"\u003c/p\u003e\n\u003cp\u003e\"Has anyone looked into the allegations?\"\u003c/p\u003e\n\u003cp\u003e\"I did.\"\u003c/p\u003e\n\u003cp\u003e\"And what did you discover?\"\u003c/p\u003e\n\u003cp\u003e\"He denied everything and there was no proof, and now one of the girls is dead.\"\u003c/p\u003e\n\u003cp\u003e\"And the other?\"\u003c/p\u003e\n\u003cp\u003e\"Lives in Washington state.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have her address?\"\u003c/p\u003e\n\u003cp\u003eShe looked at me blankly. Then turned to her filing cabinet behind her, opened it, and busied herself for the next minute or two thumbing through files. She removed one and brought it to her desk. There she copied some information down on a sticky pad, then passed it over to me. There was a name on it, Donna Trigger, along with a phone number.\u003c/p\u003e\n\u003cp\u003eDana sat back. \"You are very thorough.\"\u003c/p\u003e\n\u003cp\u003e\"No stone unturned.\"\u003c/p\u003e\n\u003cp\u003e\"Are you just as thorough in the bedroom?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll just have to use your imagination.\"\u003c/p\u003e\n\u003cp\u003eShe smiled, and her cheeks turned a little red.\u003c/p\u003e\n\u003cp\u003e\"Oh, I have.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/dark-horse-jim-knighthorse-1/page-16.html","bookId":2351,"creation":"Oct 5, 2019 10:02:30 AM","modification":"Oct 5, 2019 10:02:30 AM"}
