{"id":66813,"no":18,"title":"Page 18","content":"\u003cp\u003e49.\u003c/p\u003e\n\u003cp\u003eNestled between a Rite Aide and a laundromat was a little Italian place that I liked, called Frazzi\u0027s. Cindy and I were heading there now for lunch, holding hands. The mid-day sun shone straight down on us, but lacked any real heat, just a bright ornament hanging in the sky.\u003c/p\u003e\n\u003cp\u003e\"So why is Italian your favorite food?\" asked Cindy. I sensed she was feeling happy. The weather was nice, and we had just made love, and she wanted to keep things light and fun, at least for the moment. We still hadn\u0027t talked about the heavy stuff, which was fine by me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve discovered in the course of my considerable dining experience and extensive travels that a food joint has to work pretty damn hard to screw up Italian food. It\u0027s usually a sure bet.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve screwed it up before,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Actually, we screwed it up together,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Which is why we no longer cook.\"\u003c/p\u003e\n\u003cp\u003e\"And why we eat out.\"\u003c/p\u003e\n\u003cp\u003e\"Except for you and your damn cereal and PB\u0026amp;Js.\"\u003c/p\u003e\n\u003cp\u003e\"Cereal and PB\u0026amp;J\u0027s are my staple. They keep me alive.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I think it\u0027s cute.\"\u003c/p\u003e\n\u003cp\u003eFrazzi\u0027s was a narrow restaurant with checkered table cloths and red vinyl seats. We found a booth in the back and sat ourselves. By now Cindy knows to allow me to have the best view of the restaurant, where I keep my eyes on the front door, the butt of my gun loose and free. There wasn\u0027t much for Cindy to look at other than me. Lucky girl.\u003c/p\u003e\n\u003cp\u003eThe waitress came by and we ordered two Cokes.\u003c/p\u003e\n\u003cp\u003e\"So can I say a few things?\" asked Cindy.\u003c/p\u003e\n\u003cp\u003e\"Of course.\" Here it comes.\u003c/p\u003e\n\u003cp\u003e\"Your drinking worries me. Actually, it\u0027s not the fact that you occasionally get drunk, it\u0027s that you feel you need to drink secretly.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s not a pretty sight.\"\u003c/p\u003e\n\u003cp\u003e\"How long have you been getting drunk?\"\u003c/p\u003e\n\u003cp\u003eI shrugged. \"Off and on since I broke my leg.\"\u003c/p\u003e\n\u003cp\u003e\"The broken leg was the catalyst?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And nothing else?\"\u003c/p\u003e\n\u003cp\u003eI reached out and took her hand from across the table. She needed to be reassured. I looked at her steadily in the eye. \"It\u0027s the only reason.\"\u003c/p\u003e\n\u003cp\u003e\"Nothing about me?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Can I ask you a favor?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Will you try to stop for me? I\u0027m not asking you to give up drinking altogether, but I\u0027m asking you to stop getting drunk whenever we are away from each other, to stop destroying your liver, to stop feeling so goddamn sorry for yourself.\"\u003c/p\u003e\n\u003cp\u003e\"I might need help.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll help you.\"\u003c/p\u003e\n\u003cp\u003eOur drinks came, along with some fresh bread and oil.\u003c/p\u003e\n\u003cp\u003e\"The usual, Jim?\" asked Mama Lucco. She was Italian and in her mid-forties. I\u0027d been coming here for four years, ever since I set up my agency down the street.\u003c/p\u003e\n\u003cp\u003e\"Make that two,\" I said.\u003c/p\u003e\n\u003cp\u003eWhen Mama Lucco had moved off, Cindy asked, \"What\u0027s the usual?\"\u003c/p\u003e\n\u003cp\u003e\"Lasagna, of course.\"\u003c/p\u003e\n\u003cp\u003e\"I should have known.\"\u003c/p\u003e\n\u003cp\u003e\"So what else is on your mind?\"\u003c/p\u003e\n\u003cp\u003eShe took a sip from her Coke, and then tore a piece of bread off, dipped it in oil and gave it to me. I took it, and she repeated the process for herself.\u003c/p\u003e\n\u003cp\u003eWhen she was ready, she said, \"I\u0027ve been feeling sorry for myself, too, admittedly. I asked myself why couldn\u0027t I have a boyfriend who has a normal job, a job in which his life isn\u0027t threatened by a hired killer, a job that didn\u0027t require you to deal with the dregs of society.\"\u003c/p\u003e\n\u003cp\u003eShe paused. I waited.\u003c/p\u003e\n\u003cp\u003e\"But then I realized that you are so goddamn good at what you do, and someone has to set things right in this fucked up world. And if you are willing to do it, then the least I can do is stand by your side, and give you my support.\"\u003c/p\u003e\n\u003cp\u003eI digested this, then asked, \"What about football?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what to make of this football business. We\u0027ll cross that bridge when we get there.\"\u003c/p\u003e\n\u003cp\u003e\"Fair enough.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027ve come to the conclusion that if I go back to you now, I will forever accept you, just the way you are, and deal with whatever comes our way, together. I had a taste of life without you this week, and it was horrible. Just horrible.\" She paused and took my hand, and looked me in the eye. \"Will you take me back?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said.\u003c/p\u003e\n\u003cp\u003eShe kissed my knuckles. \"You\u0027ve got me forever, Jim Knighthorse. Or for as long as you can stand me.\"\u003c/p\u003e\n\u003cp\u003e50.\u003c/p\u003e\n\u003cp\u003eLater, with Cindy teaching an afternoon class, and me wondering how I was going to stay off the booze, Sanchez called.\u003c/p\u003e\n\u003cp\u003e\"I got an address on that plate.\"\u003c/p\u003e\n\u003cp\u003e\"Swell.\"\u003c/p\u003e\n\u003cp\u003e\"You say it was an older model blue Taurus?\"\u003c/p\u003e\n\u003cp\u003e\"Uh huh.\"\u003c/p\u003e\n\u003cp\u003e\"How about a green \u002789 Taurus?\"\u003c/p\u003e\n\u003cp\u003e\"Green, blue, same difference.\"\u003c/p\u003e\n\u003cp\u003e\"Christ, Knighthorse. Can\u0027t you tell the difference?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"Greens and blues are tough.\"\u003c/p\u003e\n\u003cp\u003e\"That could be the difference in apprehending a felon.\"\u003c/p\u003e\n\u003cp\u003e\"We all have our handicaps,\" I said. \"Mine is coloration. Yours is unattractiveness.\"\u003c/p\u003e\n\u003cp\u003e\"Fuck you,\" he said, chuckling.\u003c/p\u003e\n\u003cp\u003e\"Perhaps if you were better looking.\"\u003c/p\u003e\n\u003cp\u003e\"So what are you going to do?\"\u003c/p\u003e\n\u003cp\u003e\"Convince the killer to stay away.\"\u003c/p\u003e\n\u003cp\u003eSanchez was silent. \"You\u0027re going to kill him,\" he finally said. It wasn\u0027t a question.\u003c/p\u003e\n\u003cp\u003e\"No other way to convince a hitman to stay away.\"\u003c/p\u003e\n\u003cp\u003e\"You need help?\"\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t that be against the law?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"No, thank you. He made it personal. Be better if you stayed out of it, in case something goes wrong.\" I paused. \"I owe you.\"\u003c/p\u003e\n\u003cp\u003e\"Fucking eh, you do. You can start with dinner tonight.\"\u003c/p\u003e\n\u003cp\u003eHe gave me the name and address, and hung up. Johnny Bright. I stared at the name for some time.\u003c/p\u003e\n\u003cp\u003eHe should have left Cindy out of it. Would have been healthier for him.\u003c/p\u003e\n\u003cp\u003eNext I called Washington state, and this time got hold of Donna Trigger.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s this?\" she asked. Her voice was soft.\u003c/p\u003e\n\u003cp\u003e\"My name is Jim Knighthorse, I\u0027m a private detective down in Huntington Beach. I\u0027m following up on the murder of Amanda Peterson.\"\u003c/p\u003e\n\u003cp\u003eThere was silence. Not even a hiss of a connection. \"What can I do for you, Mr. Knighthorse?\"\u003c/p\u003e\n\u003cp\u003e\"Can I ask you about Bryan Dawson?\"\u003c/p\u003e\n\u003cp\u003eAnother pause. \"What would you like to know?\"\u003c/p\u003e\n\u003cp\u003e\"What was your relationship with Mr. Dawson?\"\u003c/p\u003e\n\u003cp\u003e\"He was my band director,\" she said evenly. \"And my lover.\" She caught me admittedly by surprise. But I am a professional, and just as I opened my mouth for the next question, she continued: \"And, in the end, my stalker.\"\u003c/p\u003e\n\u003cp\u003e\"Could you elaborate?\"\u003c/p\u003e\n\u003cp\u003e\"On what?\"\u003c/p\u003e\n\u003cp\u003e\"On everything,\" I said.\u003c/p\u003e\n\u003cp\u003eShe did, and when we hung up I had a much clearer picture of Bryan Dawson. And I had no reason to doubt her. Dawson had approached her during her junior year, and she had been flattered because she had always considered him cute. All of the girls did. It began after band camp when he offered to give her a ride home. One thing led to another and they didn\u0027t make it home and she had been honored that he had chosen her out of all the girls. She was seventeen and had been a virgin. She saw him secretly during the next year, but he became possessive and physical and she ended the relationship. He was relentless in his pursuit to win her back. Soon he was following her home, standing outside her windows, calling her repeatedly. And when she began dating someone else, a senior at their school, that someone was brutally attacked one night, leaving the kid with a fractured skull and permanent semi-blindness.\u003c/p\u003e\n\u003cp\u003eBut the stalking had abruptly ended when he found a new girl.\u003c/p\u003e\n\u003cp\u003eA replacement.\u003c/p\u003e\n\u003cp\u003eAmanda Peterson. \u003c/p\u003e","sourceLink":"https://allnovel.net/dark-horse-jim-knighthorse-1/page-18.html","bookId":2351,"creation":"Oct 5, 2019 10:02:30 AM","modification":"Oct 5, 2019 10:02:30 AM"}
