{"id":66798,"no":3,"title":"Page 3","content":"\u003cp\u003e5.\u003c/p\u003e\n\u003cp\u003eOn Beach Blvd., not too far from my crime-fighting headquarters, there is a McDonald\u0027s fast food restaurant. McDonald\u0027s is a fairly well-known establishment here in Huntington Beach, California, although I can\u0027t vouch for the rest of the country since I don\u0027t get out much. This McDonald\u0027s features an epic two- or three-story plastic playground, an ATM and DVD rentals.\u003c/p\u003e\n\u003cp\u003eOh, and it also features God.\u003c/p\u003e\n\u003cp\u003eYes, God. The Creator. The Lord Of All That Which Is And Is Not. The God of the Earth below and the sky above. The God of the Moon and the stars and Cher.\u003c/p\u003e\n\u003cp\u003eNo, I\u0027m not high. At least, not at the moment.\u003c/p\u003e\n\u003cp\u003eOh, and he doesn\u0027t like me calling him God. He prefers Jack. Yes, Jack.\u003c/p\u003e\n\u003cp\u003eAgain, I\u0027m not high.\u003c/p\u003e\n\u003cp\u003eLet me explain: Not too long ago, while enjoying a Big Mac or three at this very McDonald\u0027s, a homeless man dressed in rags and smelling of an overripe dumpster sat across from me. He introduced himself as God, and later, by my third Big Mac, I almost believed him.\u003c/p\u003e\n\u003cp\u003eGod or not, he offered some pretty damn good advice that day, and I have been coming back ever since.\u003c/p\u003e\n\u003cp\u003eToday, by my second Big Mac and third re-fill of Coke, he showed up, ambling up to the restaurant from somewhere on Beach Blvd. Where he came from, I don\u0027t know. Where he goes, I still didn\u0027t know. Maybe Heaven. Maybe a dumpster. Maybe both.\u003c/p\u003e\n\u003cp\u003eAs he cut across the parking lot, heading to the side entrance, I noted that his dirty jeans appeared particularly torn on this day. Perhaps he had had a fight with the Devil earlier.\u003c/p\u003e\n\u003cp\u003eJack went through the door, walked up to the cashier, ordered a coffee.\u003c/p\u003e\n\u003cp\u003e\"Hi, Jim,\" he said, after he had gotten his coffee. He carefully lifted the lid with very dirty fingers and blew on the steaming coffee.\u003c/p\u003e\n\u003cp\u003e\"God doesn\u0027t like his coffee too hot?\" I asked. I had been curious about this, as he always blew on his coffee.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said simply. God, or Jack, was an average-sized man, with average features: His hair was of average color and length (neutral brown, hanging just above his ears), his eyes of average color (brownish, although they could have been green), and his skin was of average tone (perhaps Caucasian, although he could have passed for Hispanic). In short, the man was completely nondescript and nearly invisible to the world at large. He would make a hell of a P.I., actually.\u003c/p\u003e\n\u003cp\u003eJack finally looked up from his coffee and studied me with his neutrally-colored eyes, squinting a little. I felt again that he was looking deep within me, into my heart and soul. While he was reading my aura, or whatever the hell it was he was doing, I looked down at his coffee: It was no longer steaming.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s your day going, Jim?\" he finally asked me, sipping from the cup, using both hands, cradling the thing carefully, as if it were the Cup of Life.\u003c/p\u003e\n\u003cp\u003eHe always asked me that, and I always said, which I did now: \"Fine, Jack. How\u0027s it hanging?\"\u003c/p\u003e\n\u003cp\u003e\"Some would be offended to hear you speak to God in such an irreverent, disrespectful manner.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I said. \"Hell, I\u0027m even offended. Can\u0027t you tell?\"\u003c/p\u003e\n\u003cp\u003eHe laughed softly.\u003c/p\u003e\n\u003cp\u003e\"As they say, I broke the mold with you, Jim. And they\u0027re hanging to the left. They\u0027re always hanging to the left. Isn\u0027t there anything else you want to ask God?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I said. \"For starters, how do I know you\u0027re God?\"\u003c/p\u003e\n\u003cp\u003eWe were mostly alone at the back of the seating area. Behind me, kids played in the massive two-story jungle gym. Such jungle gyms didn\u0027t exist when I was kid. Lucky bastards.\u003c/p\u003e\n\u003cp\u003e\"You have faith, Jim. That\u0027s how,\" he said. He always said that to me.\u003c/p\u003e\n\u003cp\u003e\"How about for a lark you perform a miracle.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re alive and breathing,\" he said, sipping his coffee. \"Isn\u0027t that miracle enough?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"It\u0027s not, dammit.\" I was used to these kinds of double-talk answers. Jack seemed particularly efficient at this. \"Make a million dollars appear. I don\u0027t even have to keep it. Just make it appear.\"\u003c/p\u003e\n\u003cp\u003e\"And that would prove to you that I\u0027m God?\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\"\u003c/p\u003e\n\u003cp\u003e\"Is it God you seek, or a genie?\"\u003c/p\u003e\n\u003cp\u003e\"Genie would be nice, too.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll look into it.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003eWe were quiet. Jack silently sipped his coffee. Not even a slurp.\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t been around for a while,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Have you missed me?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You have been waiting for me?\" I asked, mildly shocked. It had been, perhaps, four months since I\u0027d last visited with him.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said.\u003c/p\u003e\n\u003cp\u003e\"How did you know I was here today?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe grinned.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s something to be said for being omniscient, Jim.\"\u003c/p\u003e\n\u003cp\u003e\"I bet,\" I said. \"Anyway, I haven\u0027t worked on a case in a while. That is, a real case.\"\u003c/p\u003e\n\u003cp\u003e\"You only come when you\u0027re working on a case?\"\u003c/p\u003e\n\u003cp\u003e\"Something like that,\" I said. \"You would prefer I came more often?\"\u003c/p\u003e\n\u003cp\u003eHe looked at me from over his non-steaming cup of coffee.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said simply, and I found his answer oddly touching. \"So am I to assume you are working on a case now?\"\u003c/p\u003e\n\u003cp\u003e\"You are God,\" I said. \"You can assume anything you want.\"\u003c/p\u003e\n\u003cp\u003e\"So is that a yes?\"\u003c/p\u003e\n\u003cp\u003eI sighed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m working on a case, yes.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me about it.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you already know?\" I asked. \"Hell, don\u0027t you already know who killed the girl?\"\u003c/p\u003e\n\u003cp\u003eHe looked at me long and hard, unblinking, his face impassive. There was dirt in the corner of his eyes, and along the border of his scalp, where his roots met his forehead. He stank of something unknown and rotten and definitely foul.\u003c/p\u003e\n\u003cp\u003eYou\u0027re insane, I told myself for the hundredth time. Utterly insane to even remotely entertain the idea that this might be -\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said. \"I do know who killed the girl.\"\u003c/p\u003e\n\u003cp\u003eMy breath caught in my throat.\u003c/p\u003e\n\u003cp\u003e\"Then tell me.\"\u003c/p\u003e\n\u003cp\u003e\"You already know, my son.\"\u003c/p\u003e\n\u003cp\u003eWe had discussed such matters before. Jack seemed to think I knew things that I didn\u0027t really know. He also seemed to think that time meant nothing to me and that I could sort of shift back and forth through it as I wished. I kindly let Jack know that I thought it all sounded like bullshit.\u003c/p\u003e\n\u003cp\u003eFor now, I said, \"I can assure you, Jack, that I most certainly do not know who killed her - and I most certainly do not want to get into that time-is-an-illusion horseshit, either. It makes my fucking head hurt, and you know it. Do you want to make my fucking head hurt, Jack?\"\u003c/p\u003e\n\u003cp\u003e\"Are you quite done?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said, sitting back, taking a swig from my fourth or maybe fifth Coke.\u003c/p\u003e\n\u003cp\u003eHe watched me quietly while I drank, then said, \"Although you do know who killed the girl, but choose to deny the basic laws that govern your existence - in particular, time - I will give you the answer now if you so desire.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Really.\"\u003c/p\u003e\n\u003cp\u003e\"You know who killed Amanda Peterson?\" I wasn\u0027t sure what my tone was: disbelief, curious, awe, maybe even a little fear. There are no secrets with God.\u003c/p\u003e\n\u003cp\u003e\"Indeed,\" said Jack.\u003c/p\u003e\n\u003cp\u003e\"But I haven\u0027t even discussed the case with you.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"So why did you ask me to discuss the case with you?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s called small talk, Jim. Try it sometime.\" And Jack winked at me.\u003c/p\u003e\n\u003cp\u003eI took in some air. These conversations were always like this. Circular. Infuriating. Often illuminating. Sometimes silly. But more often than not, just plain insane.\u003c/p\u003e\n\u003cp\u003e\"Fine,\" I said, \"write it down and I\u0027ll keep it in my wallet.\"\u003c/p\u003e\n\u003cp\u003e\"Until?\"\u003c/p\u003e\n\u003cp\u003e\"Until the case is over. We\u0027ll see if we came to the same conclusions.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, we will.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sure?\"\u003c/p\u003e\n\u003cp\u003e\"Always.\"\u003c/p\u003e\n\u003cp\u003eI often keep a pen above my ear, and as luck would have it, there was one there now. Jack tore off a piece of my tray liner, wrote something down on it, folded it up neatly and handed pen and paper to me. I deftly slipped the pen back over my ear, was briefly tempted to unfold the paper, but promptly shoved it in my wallet, behind an old condom.\u003c/p\u003e\n\u003cp\u003e\"So how is Amanda?\" I asked. Amanda being the murdered girl on my case, of course.\u003c/p\u003e\n\u003cp\u003e\"She is happy.\"\u003c/p\u003e\n\u003cp\u003e\"But she was slaughtered just a few weeks ago.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but she is with me now.\"\u003c/p\u003e\n\u003cp\u003e\"This is fucking weird,\" I said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s as weird as you want it to be,\" said the bum in front of me. I saw that his coffee was nearly gone.\u003c/p\u003e\n\u003cp\u003e\"Want another coffee?\"\u003c/p\u003e\n\u003cp\u003e\"Heavens, no. It\u0027ll keep me up all night.\"\u003c/p\u003e\n\u003cp\u003e\"I thought God never sleeps.\"\u003c/p\u003e\n\u003cp\u003eHe looked up at me and grinned, showing a row of coffee stained teeth.\u003c/p\u003e\n\u003cp\u003e\"Why, whoever told you that?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be back,\" I said. \"And it won\u0027t be four months this time.\"\u003c/p\u003e\n\u003cp\u003eAnd as I left, sipping from my large plastic cup, I noticed for the first time the Monopoly guy on the side of the cup, holding in his fist a single million dollar bill.\u003c/p\u003e\n\u003cp\u003eI looked over at Jack, but he had gotten up and was currently talking with someone else, oblivious to me.\u003c/p\u003e\n\u003cp\u003e6.\u003c/p\u003e\n\u003cp\u003eFresh from my conversation with God, I parked in front of a single story home with a copper roof, copper garage door and copper front door. I was sensing a pattern here. The front yard was immaculate and obviously professionally maintained. Roses were perfectly pruned under the front bay windows. Thick bushes separated the house from its distant neighbor. The bushes were pruned into massive green balls.\u003c/p\u003e\n\u003cp\u003eIn the center of the lawn was a pile of roses. Mixed with the roses were teddy bears and cards and a massive poster with many signatures on it. The poster had photographs stapled to it. It was a sort of shrine to Amanda Peterson, marking the spot where she had been found murdered just forty-three days ago. The flowers themselves were in different stages of dying, and the grass around the shrine was trampled to death.\u003c/p\u003e\n\u003cp\u003eA lot of dying going on around here.\u003c/p\u003e\n\u003cp\u003eI let my car idle and studied the crime scene. The large round bushes could conceal anyone, an easy ambush point. There was only one street light in this cul-de-sac, and it was four houses down. Although upscale, the neighborhood had no apparent security. Anyone could have been waiting for her.\u003c/p\u003e\n\u003cp\u003eAnyone.\u003c/p\u003e\n\u003cp\u003eBut probably not Derrick.\u003c/p\u003e\n\u003cp\u003eThen again, I\u0027ve been wrong before.\u003c/p\u003e\n\u003cp\u003eAccording to the police report, a neighbor had been the first to discover the body. The first to call the cops. The first questioned. The neighbor claimed to have heard nothing, even while Amanda was being mutilated directly across the street. I wanted to talk to that neighbor.\u003c/p\u003e\n\u003cp\u003eI yanked a u-turn and parked across the street in front of a powder blue house. The house was huge and sprawling. And silent.\u003c/p\u003e\n\u003cp\u003eI rang the doorbell and waited. While doing so, I examined the distance from where Amanda was murdered to here. My internal judge of distance told me this: it wasn\u0027t that far.\u003c/p\u003e\n\u003cp\u003eNo one answered. I utilized my backup plan and tried the doorbell again.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003ePlan C.\u003c/p\u003e\n\u003cp\u003eI strolled around the side of the house, reached over the side gate, unlatched the lock and walked into the backyard. As if I owned the place. Done with enough chutzpah and self-assurance that even the nosiest neighbor will hesitate to call the police. I was also fairly certain there was no dog, unless it was trained not to bark at the doorbell. Which few were.\u003c/p\u003e\n\u003cp\u003eIn the backyard, pruning roses, was an older lady. She was dressed much younger and hipper than she probably was. She wore white Capri pants, a tank top, shades and tennis shoes. Her arms were tanned, the skin hanging loose. In Huntington Beach no one ages; or, rather, no one concedes to aging. Because she was armed with shearing knives, I kept my distance.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Dartmouth?\" I asked pleasantly.\u003c/p\u003e\n\u003cp\u003eNo response. More pruning.\u003c/p\u003e\n\u003cp\u003eI said her name louder and took a step closer. I was beginning to see how a murder could indeed happen across the street without her knowledge.\u003c/p\u003e\n\u003cp\u003eBut then she finally turned and caught me out of the corner of her eye. She gasped and whipped the shearing knives around, ready to shear the hell out of me. Although thirty feet away, I stepped back, holding up my wallet and showing my private investigator license. A hell of a picture, I might add.\u003c/p\u003e\n\u003cp\u003e\"Jim Knighthorse,\" I said. \"Private investigator.\"\u003c/p\u003e\n\u003cp\u003e\"Good Christ, you shouldn\u0027t sneak up on people around here, especially after what\u0027s happened.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am. I represent Carson and Deploma. I\u0027d like to ask you a few questions.\"\u003c/p\u003e\n\u003cp\u003eShe stood. \"You\u0027re representing the boy?\" she asked, her voice rising an octave. Not representing the young man. But the boy. She also sounded surprised, as if I were an idiot to do so.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eShe thought about that. She seemed to be struggling with something internally. Finally she shrugged.\u003c/p\u003e\n\u003cp\u003e\"Would you like some iced tea?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Oh, would I.\"\u003c/p\u003e\n\u003cp\u003eAt her patio table, she served it up with a mint sprig and a lemon wedge, and I suspected a dash or two of sugar. We were shaded by a green umbrella, and as Mrs. Dartmouth sat opposite me, I noticed the shears didn\u0027t stray far from her hand. Didn\u0027t blame her.\u003c/p\u003e\n\u003cp\u003e\"Great tea.\"\u003c/p\u003e\n\u003cp\u003e\"Should be. I put enough sugar in it.\"\u003c/p\u003e\n\u003cp\u003eShe wore a lot of lipstick and smelled of good perfume. Her hair was in a tight bun, and she watched me coolly and maybe a little warily. Again, I didn\u0027t blame her. I was a big man. A big handsome, athletic and sensitive man.\u003c/p\u003e\n\u003cp\u003e\"Have you talked to many people about Amanda\u0027s murder?\" I asked.\u003c/p\u003e\n\u003cp\u003eShe brightened. \"Lordy, yes. Reporters, police, attorneys, everyone. I\u0027ve been over it a hundred times.\"\u003c/p\u003e\n\u003cp\u003eShe sounded as if she\u0027d enjoy going over it a hundred more times, to anyone who would listen. Probably served a lot of this iced tea in the process. And the sugar kept them coming back for more.\u003c/p\u003e\n\u003cp\u003e\"Well, I won\u0027t ask you anything that\u0027s not already on the police report.\"\u003c/p\u003e\n\u003cp\u003e\"Fine.\"\u003c/p\u003e\n\u003cp\u003e\"You knew Amanda personally?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"That poor dear. Such a sweet child.\"\u003c/p\u003e\n\u003cp\u003e\"Did you know Derrick Booker?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she said. \"He never dared show his face here. I understand that Mr. Peterson didn\u0027t take a liking to him.\"\u003c/p\u003e\n\u003cp\u003e\"Were you aware of Amanda having any other boyfriends?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t know. I\u0027m not a nosy person.\"\u003c/p\u003e\n\u003cp\u003eI smiled at the lie. \"Of course not. How well do you know the family?\"\u003c/p\u003e\n\u003cp\u003e\"I babysat Amanda when she was younger. But as she got older I saw less and less of her. They always forget about us old fogies.\"\u003c/p\u003e\n\u003cp\u003e\"When was your last conversation with Amanda?\"\u003c/p\u003e\n\u003cp\u003eShe took a sip from her tea and watched me carefully. \"Two years ago, when she was a freshman in high school, after she had quit the school marching band. She played an instrument. The flute, I think. She loved music.\"\u003c/p\u003e\n\u003cp\u003e\"Why did she quit?\"\u003c/p\u003e\n\u003cp\u003e\"I hardly think this is relevant to her murder of a month and a half ago.\"\u003c/p\u003e\n\u003cp\u003e\"Just fishing, ma\u0027am. After all, like my dad says: you never know what you\u0027ll catch.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I do. They caught that boy. And that\u0027s good enough for me.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s good enough for a lot of people,\" I said. \"Mrs. Dartmouth, what would you do if your daughter dated a black man?\"\u003c/p\u003e\n\u003cp\u003e\"What a silly question to ask.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because I don\u0027t have a daughter.\"\u003c/p\u003e\n\u003cp\u003e\"I see,\" I said. \"You were the first to come across the body.\"\u003c/p\u003e\n\u003cp\u003eShe swallowed. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eI waited a moment. \"At one a.m.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I was walking. I do that sometimes when I can\u0027t sleep.\"\u003c/p\u003e\n\u003cp\u003e\"And at the time of the murder, you saw and heard no one?\"\u003c/p\u003e\n\u003cp\u003eShe raised her finger and waggled it in my face. \"Nuh uh uh, Mr. Knighthorse. That\u0027s all on the police report.\"\u003c/p\u003e\n\u003cp\u003eI produced one of my business cards and placed it on the glass table. In the background on the card was a photo of the sun sinking below the blue horizon of the Pacific Ocean. The word keen always comes to mind. In one corner, was my smiling mug.\u003c/p\u003e\n\u003cp\u003e\"Should you remember anything, please don\u0027t hesitate to call.\"\u003c/p\u003e\n\u003cp\u003eI set my card on the glass table; she somehow managed to not lunge for it. I finished the tea in one swallow and, leaving the way I had come, picked the mint sprig from my teeth.\u003c/p\u003e\n\u003cp\u003eAh, dignity. \u003c/p\u003e","sourceLink":"https://allnovel.net/dark-horse-jim-knighthorse-1/page-3.html","bookId":2351,"creation":"Oct 5, 2019 10:02:29 AM","modification":"Oct 5, 2019 10:02:29 AM"}
