{"id":17519,"no":112,"title":"CHAPTER XIII","content":"\u0026nbsp;1661-1673. MARRIAGE AND POPULATION. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Shipment of Emigrants.—Soldier Settlers.—Importation of Wives.—Wedlock.—Summary Methods.—The Mothers of Canada.—Bounties on Marriage.—Celibacy Punished.—Bounties on Children.—Results.\n\u003c/div\u003e \n\u003cdiv\u003e\n The peopling of Canada was due in the main to the king. Before the accession of Louis XIV. the entire population, priests, nuns, traders, and settlers, did not exceed twenty-five hundred; * but scarcely had he reached his majority when the shipment of men to the colony was systematically begun. Even in Argenson’s time, loads of emigrants sent out by the Crown were landed every year at Quebec. The Sulpitians of Montreal also brought over colonists to people their seigniorial estate; the same was true on a small scale of one or two other proprietors, and once at least the company sent a considerable number: yet the government was the chief agent of emigration. Colbert did the work, and the king paid for it.\n\u003c/div\u003e \n\u003cdiv\u003e\n In 1661, Laval wrote to the cardinals of the Propaganda, that during the past two years the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; * \u0026nbsp;Le Clerc, Etablissement de la Foy, II 4\n\u003c/div\u003e \n\u003cdiv\u003e\n king had spent two hundred thousand livres on the colony; that, since 1659, he had sent out three hundred men a year; and that he had promised to send an equal number every summer during ten years. * These men were sent by squads in merchant-ships, each one of which was required to carry a certain number. In many instances, emigrants were bound on their arrival to enter into the service of colonists already established. In this case the employer paid them wages, and after a term of three years they became settlers themselves. **\n\u003c/div\u003e \n\u003cdiv\u003e\n The destined emigrants were collected by agents in the provinces, conducted to Dieppe or Rochelle, and thence embarked. At first men were sent from Rochelle itself, and its neighborhood; but Laval remonstrated, declaring that he wanted none from that ancient stronghold of heresy. *** The people of Rochelle, indeed, found no favor in Canada. Another writer describes them as “persons of little conscience, and almost no religion,” adding that the Normans, Percherons, Picards, and peasants of the neighborhood of Paris, are docile, industrious, and far more pious. “It is important,” he concludes, “in beginning a new colony, to sow good seed.” **** It was, accordingly, from the north-western provinces that most of the emigrants\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Lettre de Laval envoyée à Rome. 21 Oct., 1661 (extract in\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Faillon from Archives of the Propaganda).\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;Marie de l’Incarnation, 18 Ao?t, 1664. These engagés\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;were some times also brought over by private persons.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;*** \u0026nbsp;Colbert a Laval, 18 Mars, 1664.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;**** \u0026nbsp;Mémoire de 1664 (anonymous)\n\u003c/div\u003e \n\u003cdiv\u003e\n were drawn. * They seem in the main to have been a decent peasantry, though writers who, from their position, should have been well informed, have denounced them in unmeasured terms. ** Some of them could read and write, and some brought with them a little money.\n\u003c/div\u003e \n\u003cdiv\u003e\n Talon was constantly begging for more men, till Louis XIV. at length took alarm. Colbert replied to the over-zealous intendant, that the king did not think it expedient to depopulate France, in order to people Canada; that he wanted men for his armies; and that the colony must rely chiefly on increase from within. Still the shipments did not cease; and, even while tempering the ardor of his agent, the king gave another\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;See a paper by Garneau in Le National of Quebec, 28\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;October, 1856, embodying the results of research among the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;papers of the early notaries of Quebec. The chief emigration\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;was from Paris, Normandy, Poitou, Pays d’Aunis, Brittany,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;and Picardy. Nearly all those from Paris were sent by the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;king from houses of charity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;“Une foule d\u0027aventuriers, ramasses au hazard en France,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;presque tous de la lie du peuple, la plupart obérés de\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;dettes ou chargés de crimes.” etc. La Tour, Vie de Laval,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Liv. IV. “Le vice a obligé la plupart de chercher ce pays\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;comme un asile pour se mettre à couvert de leurs crimes,”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Meules, Dépêché de 1682. Meules was intendant in that year.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Marie de l’Incarnation, after speaking of the emigrants as\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;of a very mixed character, says that it would have been far\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;better to send a few who were good Christians, rather than\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;so many who give so much trouble. Lettre du—Oct., 1669.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Le Clerc, on the other hand, is emphatic in praise, calling\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the early colonists, “très honnêtes gens, avant de la\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;probité, de la droiture, et de la religion.... L’on a\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;examiné et choisi les habitants, et renvoyé en France les\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;personnes vicieuses.” If, he adds, any such were left “ils\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;effacaient glorieusement par leur pénitence les taches de\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;leur première condition.” Charlevoix is almost as strong in\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;praise as La Tour in censure. Both of them wrote in the next\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;century. We shall have means hereafter of judging between\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;these conflicting statements.\n\u003c/div\u003e \n\u003cdiv\u003e\n proof how much he had the growth of Canada at heart. *\n\u003c/div\u003e \n\u003cdiv\u003e\n The regiment of Carignan-Salières had been ordered home, with the exception of four companies kept in garrison, ** and a considerable number discharged in order to become settlers. Of those who returned, six companies were, a year or two later, sent back, discharged in their turn, and converted into colonists. Neither men nor officers were positively constrained to remain in Canada; but the officers were told that if they wished to please his Majesty this was the way to do so; and both they and the men were stimulated by promises and rewards. Fifteen hundred livres were given to La Motte, because he had married in the country and meant to remain there. Six thousand livres were assigned to other officers, because they had followed, or were about to follow, La Motte’s example; and twelve thousand were set apart to be distributed to the soldiers under similar conditions. *** Each soldier who consented to remain and settle was promised a grant of land and a hundred livres in money; or, if he preferred it, fifty livres with provisions for a year. This military colonization had a strong and lasting influence on the character of the Canadian people.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;The king had sent out more emigrants than he had\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;promised, to judge from the census reports during the years\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;1666, 1667, and 1668. The total population for those years\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;is 3418, 4312, and 5870, respectively. A small part of this\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;growth may be set down to emigration not under government\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;auspices, and a large part to natural increase, which was\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;enormous at this time, from causes which will soon appear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;Colbert a Talon, 20 Fev., 1668.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;*** \u0026nbsp;Ibid.\n\u003c/div\u003e \n\u003cdiv\u003e\n But if the colony was to grow from within, the new settlers must have wives. For some years past, the Sulpitians had sent out young women for the supply of Montreal; and the king, on a larger scale, continued the benevolent work. Girls for the colony were taken from the hospitals of Paris and of Lyons, which were not so much hospitals for the sick as houses of refuge for the poor. Mother Mary writes in 1665 that a hundred had come that summer, and were nearly all provided with husbands, and that two hundred more were to come next year. The case was urgent, for the demand was great. Complaints, however, were soon heard that women from cities made indifferent partners; and peasant girls, healthy, strong, and accustomed to field work, were demanded in their place. Peasant girls were therefore sent, but this was not all. Officers as well as men wanted wives; and Talon asked for a consignment of young ladies. His request was promptly answered. In 1667, he writes: “They send us eighty-four girls from Dieppe and twenty-five from Rochelle; among them are fifteen or twenty of pretty good birth; several of them are really demoiselles, and tolerably well brought up.” They complained of neglect and hardship during the voyage. “I shall do what I can to soothe their discontent,” adds the intendant; “for if they write to their correspondents at home how ill they have been treated it would be an obstacle to your plan of sending us next year a number of select young ladies.” *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;“Des demoiselles bien choisies.” Talon a Colbert, 27 Oct.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;1667.\n\u003c/div\u003e \n\u003cdiv\u003e\n Three years later we find him asking for three or four more in behalf of certain bachelor officers. The response surpassed his utmost wishes; and he wrote again: “It is not expedient to send more demoiselles. I have had this year fifteen of them, instead of the four I asked for.” *\n\u003c/div\u003e \n\u003cdiv\u003e\n As regards peasant girls, the supply rarely equalled the demand. Count Frontenac, Courcelle’s successor, complained of the scarcity: “If a hundred and fifty girls and as many servants,” he says, “had been sent out this year, they would all have found husbands and masters within a month.” **\n\u003c/div\u003e \n\u003cdiv\u003e\n The character of these candidates for matrimony has not escaped the pen of slander. The caustic La Hontan, writing fifteen or twenty years after, draws the following sketch of the mothers of Canada: “After the regiment of Carignan was disbanded, ships were sent out freighted with girls of indifferent virtue, under the direction of a few pious old duennas, who divided them into three classes. These vestals were, so to speak, piled one on the other in three different halls, where the bridegrooms chose their brides as a butcher chooses his sheep out of the midst of the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Talon \u0027a Colbert, 2 Nov., 1671.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;Frontenac a Colbert, 2 Nov., 1672. This year only eleven\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;girls had been sent. The scarcity was due to the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;indiscretion of Talon, who had written to the minister that,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;as many of the old settlers had daughters just becoming\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;marriageable, it would be well, in order that they might\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;find husbands, to send no more girls from France at present.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;The next year, 1673, the king writes that, though he is\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;involved in a great war, which needs all his resources, he\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;has nevertheless sent sixty more girls.\n\u003c/div\u003e \n\u003cdiv\u003e\n flock. There was wherewith to content the most fantastical in these three harems; for here were to be seen the tall and the short, the blond and the brown, the plump and the lean; everybody, in short, found a shoe to fit him. At the end of a fortnight not one was left. I am told that the plumpest were taken first, because it was thought that, being less active, they were more likely to keep at home, and that they could resist the winter cold better. Those who wanted a wife applied to the directresses, to whom they were obliged to make known their possessions and means of livelihood before taking from one of the three classes the girl whom they found most to their liking. The marriage was concluded forthwith, with the help of a priest and a notary, and the next day the governor-general caused the couple to be presented with an ox, a cow, a pair of swine, a pair of fowls, two barrels of salted meat, and eleven crowns in money.” *\n\u003c/div\u003e \n\u003cdiv\u003e\n As regards the character of the girls, there can be no doubt that this amusing sketch is, in the main, maliciously untrue. Since the colony began, it had been the practice to send back to France women of the class alluded to by La Hontan, as soon as they became notorious. ** Those who were\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;La Hontan, Nouveaux Voyages, I. 11 (1709). In some of the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;other editions, the same account is given in different\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;words, equally lively and scandalous.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;This is the statement of Boucher, a good authority. A\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;case of the sort in 1658 is mentioned in the correspondence\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;of Argenson. Boucher says further, that an assurance of good\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;character was required from the relations or friends of the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;girl who wished to embark. This refers to a period anterior\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;to 1663, when Boucher wrote his book. Colbert evidently\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;cared for no qualification except the capacity of maternity.\n\u003c/div\u003e \n\u003cdiv\u003e\n not taken from institutions of charity usually belonged to the families of peasants overburdened with children, and glad to find the chance of establishing them. * How some of them were obtained appears from a letter of Colbert to Harlay, Archbishop of Rouen. “As, in the parishes about Rouen,” he writes, “fifty or sixty girls might be found who would be very glad to go to Canada to be married, I beg you to employ your credit and authority with the curés of thirty or forty of these parishes, to try to find in each of them one or two girls disposed to go voluntarily for the sake of a settlement in life.” **\n\u003c/div\u003e \n\u003cdiv\u003e\n Mistakes nevertheless occurred. “Along with the honest people,” complains Mother Mary, “comes a great deal of canaille of both sexes, who cause a great deal of scandal.” *** After some of the young women had been married at Quebec, it was found that they had husbands at home. The priests\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Témoignage de la Mère du Plessis de Sainte-Helène\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;(extract in Faillon).\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;Colbert a l’Archevêque de Rouen, 27 Fev., 1670.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;That they were not always destitute may be gathered from a\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;passage in one of Talon’s letters. “Entre les filles qu’on\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;fait passer ici il y en a qui ont de légitimes et\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;considérables prétentions aux successions de leurs parents,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;même entre celles qui sont tirées de l’H?pital Général.” The\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;General Hospital of Paris had recently been established\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;(1656) as a house of refuge for the “Bohemians,” or vagrants\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;of Paris. The royal edict creating it says that “les pauvres\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;mendiants et invalides des deux sexes y seraient enfermés\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;pour estre employés aux manufactures et aultres travaux\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;selon leur pouvoir.” They were gathered by force in the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;streets by a body of special police, called “Archers de\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;l’H?pital.” They resisted at first, and serious riots\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;ensued. In 1662, the General Hospital of Paris contained\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;6262 paupers. See Clement, Histoire de Colbert, 113. Mother\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;de Sainte-Helène says that the girls sent from this asylum\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;had been there from childhood in charge of nuns.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;*** \u0026nbsp;“Beaucoup de canaille de l’un et l’autre sexe qui\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;causent beaucoup de scandale.” Lettre du—Oct., 1669.\n\u003c/div\u003e \n\u003cdiv\u003e\n became cautious in tying the matrimonial knot, and Colbert thereupon ordered that each girl should provide herself with a certificate from the cure or magistrate of her parish to the effect that she was free to marry. Nor was the practical intendant unmindful of other precautions to smooth the path to the desired goal. “The girls destined for this country,” he writes, “besides being strong and healthy, ought to be entirely free from any natural blemish or any thing personally repulsive.” *\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus qualified canonically and physically, the annual consignment of young women was shipped to Quebec, in charge of a matron employed and paid by the king. Her task was not an easy one, for the troop under her care was apt to consist of what Mother Mary in a moment of unwonted levity calls “mixed goods.” ** On one occasion the office was undertaken by the pious widow of Jean Bourdon. Her flock of a hundred and fifty girls, says Mother Mary, “gave her no little trouble on the voyage; for they are of all sorts, and some of them are very rude and hard to manage.” Madame Bourdon was not daunted. She not only saw her charge distributed and married, but she continued to receive and care for the subsequent ship-loads as they arrived summer after summer. She was\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Talon a Colbert, 10 Nov., 1670.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;“Une marchandise mêlée.” Lettre du—1668. In that year,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;1668, the king spent 40,000 livres in the shipment of men\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;and girls. In 1669, a hundred and fifty girls were sent; in\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;1670, a hundred and sixty-five; and Talon asks for a hundred\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;and fifty or two hundred more to supply the soldiers who had\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;got ready their houses and clearings, and were now prepared\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;to marry. The total number of girls sent from 1665 to 1673,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;inclusive, was about a thousand.\n\u003c/div\u003e \n\u003cdiv\u003e\n indeed chief among the pious duennas of whom La Hontan irreverently speaks. Marguerite Bourgeoys did the same good offices for the young women sent to Montreal. Here the “king’s girls,\" as they were called, were all lodged together in a house to which the suitors repaired to make their selection. “I was obliged to live there myself,” writes the excellent nun, “because families were to be formed;” * that is to say, because it was she who superintended these extemporized unions. Meanwhile she taught the girls their catechism, and, more fortunate than Madame Bourdon, inspired them with a confidence and affection which they retained long after.\n\u003c/div\u003e \n\u003cdiv\u003e\n 0135\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Marguerite Bourgeoys\n\u003c/div\u003e \n\u003cdiv\u003e\n From an engraving by L Massard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At Quebec, where the matrimonial market was on a larger scale, a more ample bazaar was needed. That the girls were assorted into three classes, each penned up for selection in a separate hall, is a statement probable enough in itself, but resting on no better authority than that of La Hontan. Be this as it may, they were submitted together to the inspection of the suitor; and the awkward young peasant or the rugged soldier of Carignan was required to choose a bride without delay from among the anxious candidates. They, on their part, were permitted to reject any applicant who displeased them, and the first question, we are told, which most of them asked was whether the suitor had a house and a farm.\n\u003c/div\u003e \n\u003cdiv\u003e\n Great as was the call for wives, it was thought prudent to stimulate it. The new settler was at once\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Extract in Faillon, Colonie Fran?aise, III. 214.\n\u003c/div\u003e \n\u003cdiv\u003e\n enticed and driven into wedlock. Bounties were offered on early marriages. Twenty livres were given to each youth who married before the age of twenty, and to each girl who married before the age of sixteen. * This, which was called the “king’s gift,” was exclusive of the dowry given by him to every girl brought over by his orders. The dowry varied greatly in form and value; but, according to Mother Mary, it was sometimes a house with provisions for eight months. More often it was fifty livres in household supplies, besides a barrel or two of salted meat. The royal solicitude extended also to the children of colonists already established. “I pray you,” writes Colbert to Talon, “to commend it to the consideration of the whole people, that their prosperity, their subsistence, and all that is dear to them, depend on a general resolution, never to be departed from, to marry youths at eighteen or nineteen years and girls at fourteen or fifteen; since abundance can never come to them except through the abundance of men.” ** This counsel was followed by appropriate action. Any father of a family who, without showing good cause, neglected to marry his children when they had reached the ages of twenty and sixteen was fined; *** and each father thus delinquent was required to present himself every six months to the local authorities to declare what\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Arrêt du Conseil d’Etat du Roy (see Edits et Ordonnances,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;I. 67).\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;Colbert a Talon, 20 Fev., 1668.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;*** \u0026nbsp;Arrêts du Conseil d’Etat, 1669 (cited by Faillon);\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Arrêt du Conseil d Etat, 1670 (see Edits et Ordonnances, I.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;67); Ordonnance du Roy, 5 Avril, 1669. See Clément,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Instructions, etc., de Colbert, III. 2me Partie, 657.\n\u003c/div\u003e \n\u003cdiv\u003e\n reason, if any, he had for such delay. * Orders were issued, a little before the arrival of the yearly ships from France, that all single men should marry within a fortnight after the landing of the prospective brides. No mercy was shown to the obdurate bachelor. Talon issued an order forbidding unmarried men to hunt, fish, trade with the Indians, or go into the woods under any pretence whatsoever. ** In short, they were made as miserable as possible. Colbert goes further. He writes to the intendant, “those who may seem to have absolutely renounced marriage should be made to bear additional burdens, and be excluded from all honors: it would be well even to add some marks of infamy.” *** The success of these measures was complete. “No sooner,” says Mother Mary, “have the vessels arrived than the young men go to get wives; and, by reason of the great number they are married by thirties at a time.” Throughout the length and breadth of Canada, Hymen,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Registre du Conseil Souverain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;Talon au Ministre, 10 Oct., 1670. Colbert highly\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;approves this order. Faillon found a case of its enforcement\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;among the ancient records of Montreal. In December, 1670,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Fran?ois Le Noir, an inhabitant of La Chine, was summoned\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;before the judge, because, though a single man, he had\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;traded with Indians at his own house. He confessed the fact,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;but protested that he would marry within three weeks after\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the arrival of the vessels from France, or, failing to do\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;so, that he would give a hundred and fifty livres to the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;church of Montreal, and an equal sum to the hospital.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;On this condition he was allowed to trade, but was still\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;forbidden to go into the woods. The next year he kept his\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;word, and married Marie Magdeleine Charbonnier, late of\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Paris.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;The prohibition to go into the woods was probably intended\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;to prevent the bachelor from finding a temporary Indian\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;substitute for a French wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;*** \u0026nbsp;“Il serait à propos de leur augmenter les charges, de\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;les priver de tous honneurs, même d’y ajouter quelque marque\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;d’infamie.” Lettre du 20 Fev., 1668.\n\u003c/div\u003e \n\u003cdiv\u003e\n if not Cupid, was whipped into a frenzy of activity. Dollier de Casson tells us of a widow who was married afresh before her late husband was buried. *\n\u003c/div\u003e \n\u003cdiv\u003e\n Nor was the fatherly care of the king confined to the humbler classes of his colonists. He wished to form a Canadian noblesse, to which end early marriages were thought needful among officers and others of the better sort. The progress of such marriages was carefully watched and reported by the intendant. We have seen the reward bestowed upon La Motte for taking to himself a wife, and the money set apart for the brother officers who imitated him. In his despatch of October, 1667, the intendant announces that two captains are already married to two damsels of the country; that a lieutenant has espoused a daughter of the governor of Three Rivers; and that “four ensigns are in treaty with their mistresses, and are already half engaged.” ** The paternal care of government, one would think, could scarcely go further.\n\u003c/div\u003e \n\u003cdiv\u003e\n It did, however, go further. Bounties were offered on children. The king, in council, passed a decree “that in future all inhabitants of the said country of Canada who shall have living children to the number of ten, born in lawful wedlock, not\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Histoire du Montréal, A.B. 1671, 1672.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;** \u0026nbsp;“Quatre enseignes sont en pourparler avec leurs\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;ma?tresses et sent déjà à demi engagés.” Dépêche du 27 Oct.,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;1667. The lieutenant was René Gaultier de Varennes, who on\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the 26th September, 1667, married Marie Boucher, daughter of\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the governor of Three Rivers, aged twelve years. One of the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;children of this marriage was Varennes de la Vérendrye,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;discoverer of the Rocky Mountains.\n\u003c/div\u003e \n\u003cdiv\u003e\n being priests, monks, or nuns, shall each be paid out of the moneys sent by his Majesty to the said country a pension of three hundred livres a year, and those who shall have twelve children, a pension of four hundred livres; and that, to this effect, they shall be required to declare the number of their children every year in the months of June or July to the intendant of justice, police, and finance, established in the said country, who, having verified the same, shall order the payment of said pensions, one-half in cash, and the other half at the end of each year.” * This was applicable to all. Colbert had before offered a reward, intended specially for the better class, of twelve hundred livres to those who had fifteen children, and eight hundred to those who had ten.\n\u003c/div\u003e \n\u003cdiv\u003e\n These wise encouragements, as the worthy Faillon calls them, were crowned with the desired result. A despatch of Talon in 1670 informs the minister that most of the young women sent out last summer are pregnant already, and in 1671 he announces that from six hundred to seven hundred children have been born in the colony during the year; a prodigious number in view of the small population. The climate was supposed to be particularly favorable to the health of women, which\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;Edits et Ordonnances, I. 67. It was thought at this time\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;that the Indians, mingled with the French, might become a\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;valuable part of the population. The reproductive qualities\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;of Indian women, therefore, became an object of Talon’s\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;attention, and he reports that they impair their fertility\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;by nursing their children longer than is necessary; “but,”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;he adds, “this obstacle to the speedy building up of the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;colony can be overcome by a police regulation.” Mémoire sur\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;l’Etat Présent du Canada, 1667,\n\u003c/div\u003e \n\u003cdiv\u003e\n is somewhat surprising in view of recent American experience. “The first reflection I have to make,” says Dollier de Casson, “is on the advantage that women have in this place (Montreal) over men, for though the cold is very wholesome to both sexes, it is incomparably more so to the female, who is almost immortal here.” Her fecundity matched her longevity, and was the admiration of Talon and his successors, accustomed as they were to the scanty families of France.\n\u003c/div\u003e \n\u003cdiv\u003e\n Why with this great natural increase joined to an immigration which, though greatly diminishing, did not entirely cease, was there not a corresponding increase in the population of the colony? Why, more than half a century after the king took Canada in charge, did the census show a total of less than twenty-five thousand souls? The reasons will appear hereafter.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is a peculiarity of Canadian immigration, at this its most flourishing epoch, that it was mainly an immigration of single men and single women. The cases in which entire families came over were comparatively few. * The new settler was found\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* \u0026nbsp;The principal emigration of families seems to have been\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;in 1669 when, at the urgency of Talon, then in France, a\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;considerable number were sent out. In the earlier period the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;emigration of families was, relatively, much greater. Thus,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;in 1634, the physician Giffard brought over seven to people\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;his seigniory of Beauport. Before 1663, when the king took\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the colony in hand, the emigrants were for the most part\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;apprenticed laborers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;The zeal with which the king entered into the work of\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;stocking his colony is shown by numberless passages in his\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;letters, and those of his minister. “The end and the rule of\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;all your conduct,” says Colbert to the intendant Bouteroue,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;“should be the increase of the colony; and on this point you\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;should never be satisfied, but labor without ceasing to find\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;every imaginable expedient for preserving the inhabitants,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;attracting new ones, and multiplying them by marriage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Instruction pour M. Bouteroue, 1668.\n\u003c/div\u003e \n\u003cdiv\u003e\n by the king; sent over by the king; and supplied by the king with a wife, a farm, and sometimes with a house. Well did Louis XIV. earn the title of Father of New France. But the royal zeal was spasmodic. The king was diverted to other cares, and soon after the outbreak of the Dutch war in 1672 the regular despatch of emigrants to Canada wellnigh ceased; though the practice of disbanding soldiers in the colony, giving them lands, and turning them into settlers, was continued in some degree, even to the last.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2857/78914.html","bookId":409,"creation":"Aug 2, 2019 8:46:57 AM","modification":"Aug 2, 2019 8:46:57 AM"}
