{"id":110215,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHey, guess what, guys. I’m dead. Apparently forever. But, you know, still hanging around. Cool, huh?\u003c/p\u003e\n\u003cp\u003eThat would be one to drop into conversation over the barbecue grill and beer.\u003c/p\u003e\n\u003cp\u003eOddly, hearing Annalie’s utterly normal crisis had made her feel better, steadier, more herself. Life goes on. Bryn’s undead, but Annalie’s still overdrawn.\u003c/p\u003e\n\u003cp\u003eShe found herself smiling as she pulled into the drive leading to Pharmadene, following the green line on her nav system. She hadn’t noticed, leaving in the dark the night before, but this place was huge. The driveway was probably a half a mile, with two guard posts, both of which she had to pass with video conversations between the armed security presence and McCallister before being allowed to proceed. Her car was searched. She was searched, in a pat-down worthy of airport security. And finally she was allowed into a parking garage, which was the size of an office building on its own.\u003c/p\u003e\n\u003cp\u003eShe was directed to the basement, which seemed weirdly appropriate, and, of course, armed security met her at the elevator. She wasn’t given a choice where to go, but she was issued a badge with her picture on it—creepy, because she was sure she’d never posed for it. God, had they taken it when she was dead? No, this looked more like a hidden camera had snapped her from a distance. The badge had a red stripe at the top, and some kind of holographic image superimposed on it. Pharmadene’s logo, she guessed.\u003c/p\u003e\n\u003cp\u003e“Miss Davis,” the security man said who was escorting her. He had on a blue sports coat with the Pharmadene logo on the breast, and a badge with a green stripe. “Let me familiarize you with the rules. You’re not supposed to be here from this point forward, but I’ll go over the rules in any case. You will go only to your designated floor, and proceed straight to the person with whom you are meeting. You’re authorized for that person’s office, the common break-room areas, and the restrooms. Nowhere else. Understood?”\u003c/p\u003e\n\u003cp\u003e“What happens if I go to the wrong place?”\u003c/p\u003e\n\u003cp\u003e“Alarms go off, and we go Code Red. Not a good thing. Please mind the rules.”\u003c/p\u003e\n\u003cp\u003eWell, that was good to know. Code Red didn’t sound like much fun, at least for her. “I’ll be careful,” she promised. The elevator doors opened on the seventh floor, and the guard walked her down a plushly carpeted hall that seemed to stretch on forever, to a door with no number, just a sliding nameplate that said MCCALLISTER, P., DIR. SECURITY.\u003c/p\u003e\n\u003cp\u003eThe guard knocked, waited for the okay, and ushered her in. He didn’t follow, and when Bryn looked back she saw that the door had closed behind her.\u003c/p\u003e\n\u003cp\u003ePatrick McCallister, wearing a fresh (but still beautifully tailored) suit and tie, came around the big modern desk and offered his hand. She took it, not sure why they were so formal all of a sudden, and took the square padded guest chair he indicated. “You’re looking better today,” he said, which was a backhanded compliment, at best. “Slept well?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said. She wasn’t sure if he knew she’d been at Joe Fideli’s house, and didn’t say, in case there were rules against it. “Surprisingly, I did. Maybe the nanites come with a Valium setting.”\u003c/p\u003e\n\u003cp\u003eThat surprised him into a smile, a genuine one. He was entirely different in that moment, and it caught her off guard. She looked away. When she checked, he was back to his old, unsmiling, very corporate self. “Let’s get the obvious out of the way,” he said, and reached in his desk drawer.\u003c/p\u003e\n\u003cp\u003eShe was expecting to see the gun he’d promised, but instead, out came the pneumatic syringe. I’m really going to get tired of this, she thought, but rolled up the sleeve of her sweater and took the shot without complaint.\u003c/p\u003e\n\u003cp\u003e“Now. More forms for you to sign.”\u003c/p\u003e\n\u003cp\u003e“Lovely.” Bryn picked up the pen and clipboard and began flipping through, trying to glean from the legalese what exactly was being promised. It looked like the standard sort of safety disclaimers. Shoot anybody with the weapon we provide you and we’re not liable. Whatever. She signed. “I would have thought being undead came with less paperwork.“\u003c/p\u003e\n\u003cp\u003e“Not in the corporate sector.”\u003c/p\u003e\n\u003cp\u003e“So am I a real Pharmadene employee now?”\u003c/p\u003e\n\u003cp\u003e“Unfortunately, you’re not only official; you’re my responsibility.” He opened his desk drawer again, took out a box, and passed it across to her. She swung open the hinged top. Nice. A Beretta 92F S, basically the same as the weapon she’d been issued in the military. He’d included two boxes of ammunition as well. “It’s registered to you personally,” he said. “No direct connection to Pharmadene, as a security measure.”\u003c/p\u003e\n\u003cp\u003e“Plausible deniability.”\u003c/p\u003e\n\u003cp\u003e“Exactly. Should you go shooting up the town on Saturday night, the company won’t be implicated.”\u003c/p\u003e\n\u003cp\u003e“Am I likely to do something like that?” Bryn asked, checking the slide on the pistol. It was smooth as silk.\u003c/p\u003e\n\u003cp\u003e“Are you asking me if the drug makes you go insane? No. Not in any of our clinical trials.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s reassuring.”\u003c/p\u003e\n\u003cp\u003e“And I think we already established that it doesn’t make you crave raw meat or brains.”\u003c/p\u003e\n\u003cp\u003e“Even better.” Bryn put the gun back in the box. “Still, this is quite a statement of trust, all things considered.”\u003c/p\u003e\n\u003cp\u003eMcCallister cocked his head slightly, watching her with those secretive, slightly sad dark eyes. “Not really,” he said. “Pharmadene owns you now, Bryn. They control your access to the drug, and that absolutely guarantees your loyalty and service. Doesn’t it?”\u003c/p\u003e\n\u003cp\u003eThat was a harsh way to put it, and she felt a bright surge of anger inside. “Or it guarantees that I want to punish them for it,” she said.\u003c/p\u003e\n\u003cp\u003e“Not advisable to take it there.”\u003c/p\u003e\n\u003cp\u003e“Because you’ll stop me?”\u003c/p\u003e\n\u003cp\u003e“Yes,” McCallister said, and she was suddenly aware of his stillness. It wasn’t quite human, the way he could shut down like that. And the look in his eyes … She’d been in the military, and she knew a stone killer when she saw one. “That’s what they pay me to do.”\u003c/p\u003e\n\u003cp\u003eShe understood that; it hadn’t been any different being a PFC in Baghdad. Whatever your personal feelings were about what you were ordered to do, you did it, unless it was illegal or immoral. And sometimes, she had to admit, you did it even then, because the gray areas were pretty broad.\u003c/p\u003e\n\u003cp\u003e“Good to know,” she said softly.\u003c/p\u003e\n\u003cp\u003eMcCallister relaxed in his chair, as much as he ever relaxed. “Good to have it clear between us,” he said. “I understand you spoke to your sister on the way here.” That was another unpleasant little jolt, and Bryn let him know she didn’t like it without a word being said. McCallister gave her one of those little half smiles again, the kind that meant he didn’t really mean it. “You’re the property of Pharmadene now, Bryn. You won’t have a personal life we won’t know about. Sorry if that upsets you, but you’re now carrying top-secret information, and we can’t afford to let you just roam around without checking up on what you’re saying.”\u003c/p\u003e\n\u003cp\u003e“And what did I say?”\u003c/p\u003e\n\u003cp\u003e“Nothing specific, which is exactly what we’d like you to say. Nothing to anyone. Your family’s not close geographically, which is good; we’d like you to limit your interaction with them to phone calls for a while, and discourage any kind of visits. Having your sister get curious about this unknown out-of-the-blue uncle you’ve just acquired would be … awkward.”\u003c/p\u003e\n\u003cp\u003e“My family wasn’t planning any get-togethers until the holidays,” Bryn said coldly. “Is Big Brother going to spy on me on dates, too?”\u003c/p\u003e\n\u003cp\u003e“Probably,” McCallister said. “At the very least, your gentlemen friends will be checked out thoroughly. Or lady friends, if your tastes run that way.” He lifted an eyebrow, as if mildly curious.\u003c/p\u003e\n\u003cp\u003e“I thought you’d probably already know that, since you know so much about me.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I try not to pry except where strictly necessary.”\u003c/p\u003e\n\u003cp\u003eWhich was so ridiculous that she wanted to hit him with a blunt object, preferably a bullet. “Didn’t you have something to show me? Or was this just an opportunity to humiliate and frighten me again?”\u003c/p\u003e\n\u003cp\u003e“And give you a loaded weapon.”\u003c/p\u003e\n\u003cp\u003e“That, too.”\u003c/p\u003e\n\u003cp\u003eMcCallister stood up and came around the desk, passed Bryn, and opened the office door. “This way,” he said, and left. She scrambled up and after him, because he wasn’t waiting on her. “Well, that’s rude,” she muttered, and hurried down the hall to catch up. “You know, if I go somewhere I’m not supposed to, this badge thing goes off.”\u003c/p\u003e\n\u003cp\u003e“I know. I designed the system. If you’re in close proximity to me or someone else with a green badge, you’ll register as being escorted. Of course, until you try to open a door. Then you’ll set off a Code Red.”\u003c/p\u003e\n\u003cp\u003e“And what exactly happens during a Code Red?”\u003c/p\u003e\n\u003cp\u003e“You get thrown to the ground, handcuffed, and Tasered. If you’re lucky.” He sent her a half-amused glance. “Oh, and don’t think that you can randomly shadow someone with a green badge, either. We’re all well trained to challenge intruders and hold them for security. You wouldn’t get far.”\u003c/p\u003e\n\u003cp\u003eThey rounded a corner—and this hall looked pretty much exactly like the last one, Bryn thought. Pharmadene wasn’t big on decorating. Now that she thought about it, McCallister’s office had been one big pile of modern nothing, too. No photos, plants, desk toys, the usual stuff people gathered around them. Not even a nonstandard paper clip tray. Of course, that could have just been him; he didn’t seem like a cube-toy-and-kitty-poster type of person.\u003c/p\u003e\n\u003cp\u003eBut as she glanced into a couple of nearby open offices, Bryn thought it might have also been corporate policy, because she’d never seen such personality-free workspaces. Everything matched, everything alike, everything company owned.\u003c/p\u003e\n\u003cp\u003eLike her.\u003c/p\u003e\n\u003cp\u003e“In here,” McCallister said, and swiped his card to open up a closed door. No nameplate, she noticed, but didn’t have time to ask what they were doing here. He ushered her in with a light touch at the small of her back, not quite a push. The fluorescent lights overhead flickered and came on automatically, revealing … an unoccupied office. Completely bare, except for the same stripped-down glass-and-chrome desk McCallister had, only this one was without accessories, a computer, or anything else except a desk chair in a plastic dust jacket. \u003c/p\u003e","sourceLink":"https://allnovel.net/working-stiff-revivalist-1/page-16.html","bookId":2538,"creation":"Oct 5, 2019 11:55:32 PM","modification":"Oct 5, 2019 11:55:32 PM"}
