{"id":101785,"no":19,"title":"Page 19","content":"\u003cp\u003e\"Where is she?\"\u003c/p\u003e\n\u003cp\u003ePaen pulled up in front of a small, comfortable-looking bed-and-breakfast. Finn dashed from the protective shadowed doorway to the car, climbing into the backseat as I asked my question.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Finn answered, his face bloodied and black with anger. \"The bastard grabbed her as we were talking with Reuben. I don\u0027t know what the hell he is, but he has some serious power at his control. He slammed me up against the side of the building before I even knew what was happening. I think I was knocked out for a few minutes, because when I came to he was shoving Clare back into her car. I tried to go after them, but didn\u0027t make it far on foot. I can promise you this, though - when I find the slimy wanker, I\u0027m going to beat the living shit out of him.\"\u003c/p\u003e\n\u003cp\u003e\"Sam?\" Paen asked, waiting for me to tell him which direction to go.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll try, but no promises.\" I closed my eyes and cleared my mind of everything until it was as blank as a clean sheet of paper. My thoughts went to Clare, visualizing her, drawing from within all the emotions that represented her. I saw Clare as a child at a birthday party, happy and laughing; Clare as a teenager on a double date, gorgeous and poised next to my gawky, awkward self; Clare as she was last week, helping me move furniture around the dusty, dank office, happy and excited and talking non-stop. I held all of those memories and emotions tight inside me, and used them to find where she was.\u003c/p\u003e\n\u003cp\u003e\"To the east,\" I said, looking in that direction. \"She\u0027s to the east of the city.\"\u003c/p\u003e\n\u003cp\u003ePaen pulled out a map from a pocket on the door, spreading it out on the steering wheel. \"Can you pinpoint where?\"\u003c/p\u003e\n\u003cp\u003eOne possibility jumped out at me. I didn\u0027t hesitate as I tapped my finger on a large beige shape. \"Dunstan Moor. I just bet you he\u0027s taken her there.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Paen asked. \"Why would he want to kidnap her in order to take her to a movie set?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not the movie set that\u0027s the attraction,\" I said, making shooing motions until Paen pulled out onto one of the major arterials leading to the east. \"It\u0027s the lodestone.\"\u003c/p\u003e\n\u003cp\u003e\"The what?\" Finn had used a couple of tissues from my purse and wiped up most of the blood that had streaked down from a cut above his eyebrow, but he still looked pretty grisly, especially in the gloomy afternoon light. Like Paen, he had shadows under his eyes, making me wonder how much sleep the two had during the past few nights.\u003c/p\u003e\n\u003cp\u003e\"Lodestone.\" I fell silent, wondering if it really was just four days ago when Paen had walked into my office. We\u0027re running out of time.\u003c/p\u003e\n\u003cp\u003eI know. The pain and regret was in his voice, seeping through despite his attempts not to worry me.\u003c/p\u003e\n\u003cp\u003eI don\u0027t want your mother to have to experience this, I said, rubbing a hand on my chest, as if that would ease the constant agony of howling wind that seemed to tear me apart from the inside out.\u003c/p\u003e\n\u003cp\u003eI know you don\u0027t, love. I don\u0027t want you to have to live this way, either. We\u0027ll find the statue and the manuscript. Don\u0027t worry.\u003c/p\u003e\n\u003cp\u003e\"Lodestone like the magnetic stone?\" Finn asked.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s one meaning of the word, but in the Fae world, it also refers to a location that is strong with the magic of the beyond, a place that draws elves and faeries. It\u0027s like a doorway between realities.\"\u003c/p\u003e\n\u003cp\u003e\"Something like the place your office is located?\" Paen asked.\u003c/p\u003e\n\u003cp\u003e\"Like founded land, only multiplied by about a thousand times. Lodestones are treated as holy places, as sanctuaries where only the most ancient of rituals are held. There are only three in the UK.\"\u003c/p\u003e\n\u003cp\u003e\"And Dunstan Moor is one of these lodestones?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I felt it when we were there the other day, but didn\u0027t think much about it. That\u0027s why Uilleam and the other ghosts had such a strong presence - the land itself was founded, making it possible for them to be more than just an apparition in our reality.\"\u003c/p\u003e\n\u003cp\u003e\"You think Pilar has taken Clare there?\" Finn asked.\u003c/p\u003e\n\u003cp\u003eI shrugged. \"It\u0027s the only logical place I can see he might want to go to in this area. Although he\u0027s a demon, and as such can\u0027t use the lodestone as a doorway, it\u0027s conceivable he could tap its power by means of some being who could, like Reuben...\"\u003c/p\u003e\n\u003cp\u003e\"... or Clare,\" Paen finished the sentence.\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e\"What did you find out from Reuben?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" Finn answered, disgust evident in his brown eyes. \"It was a complete waste of time. He was clearly afraid of Pilar, and had been in hiding since Paen ripped off his arm.\" Finn paused for a moment. \"Did you know that a poltergeist can\u0027t function without his arms?\"\u003c/p\u003e\n\u003cp\u003e\"Er... no,\" I said, sidetracked for a moment into wondering if they could do the starfish thing and grow back their limbs.\u003c/p\u003e\n\u003cp\u003e\"Well, according to Noelle, they can\u0027t. That\u0027s why Reuben was hiding from Pilar. He couldn\u0027t go into the beyond with one arm missing.\"\u003c/p\u003e\n\u003cp\u003e\"Odd,\" Paen said.\u003c/p\u003e\n\u003cp\u003eI nodded. That pretty well sums up the entire last five days.\u003c/p\u003e\n\u003cp\u003eThe rest of the trip was accomplished in near silence, our speculations of what Pilar might be trying with Clare too troublesome to put into words. We broke some serious traffic laws as we raced into the Lammermuir Hills, passing through gently rolling hills, small farms, and endless stretches of land dotted with sheep. The sky was black as huge, ominous clouds gathered to block the sun until it was almost as dark as night. Paen followed the signs pointing the way to Dunstan Moor, pulling in at the same viewpoint where we\u0027d parked a few days before. Although night was almost upon us, the sun sinking behind the hills surrounding the area, huge arc lights lit up the ground beyond the cluster of trailers and collections of small tents used to house wardrobe and makeup personnel.\u003c/p\u003e\n\u003cp\u003e\"Looks like they\u0027re filming again,\" Paen said as he helped me over the guardrail.\u003c/p\u003e\n\u003cp\u003eSounds of men yelling, assorted deathly screams, and the inevitable clash of metal confirmed Paen\u0027s guess. I glanced at the field where the mock battle was taking place, then scanned the people outside of the range of the camera. No familiar shape caught my eye.\u003c/p\u003e\n\u003cp\u003e\"To hell with them, I want to know where Clare is,\" Finn grumbled, following after us as we made our way down the low hill, angling slightly away from the bright lights.\u003c/p\u003e\n\u003cp\u003eI stopped for a minute and tried to locate Clare using my elf senses. I couldn\u0027t feel her presence specifically, but I had a hunch we would find her where the lodestone\u0027s strength was the strongest.\u003c/p\u003e\n\u003cp\u003e\"I think she\u0027s over there,\" I told the two men, pointing to a small rocky cliff that rose behind the trailers. I started forward through the wild moor grass, heather, clumps of bracken, and occasional bluebell that made up the terrain.\u003c/p\u003e\n\u003cp\u003e\"Sam,\" Paen said, taking my arm so I couldn\u0027t go any farther. \"Stop. We need to have a plan of action.\"\u003c/p\u003e\n\u003cp\u003e\"Plan of action? We\u0027re going to rescue Clare, find out from Pilar where the statue is, and then we\u0027ll get Clare to get it for us,\" I said, a little bit annoyed at the delay.\u003c/p\u003e\n\u003cp\u003e\"Pilar has Clare,\" he pointed out, his eyes almost as dark as the falling night. \"We can\u0027t just charge up and demand he hand her over.\"\u003c/p\u003e\n\u003cp\u003e\"Sure we can. Once he sees the two of you, he\u0027ll realize he\u0027s outnumbered.\"\u003c/p\u003e\n\u003cp\u003ePaen shook his head. \"He\u0027s murdered you, shot Clare, and thrown Finn aside as if he was a feather.\"\u003c/p\u003e\n\u003cp\u003e\"Well then, I\u0027ll... I\u0027ll... I don\u0027t know. I can scry something. That might help.\"\u003c/p\u003e\n\u003cp\u003ePaen just looked at me.\u003c/p\u003e\n\u003cp\u003e\"OK, so maybe it won\u0027t help,\" I said, throwing up my hands in exasperation. \"You two are just going to have to be all manly with him. You\u0027re big, bad, immortal vampires. Do the creatures-of-the-night thing on him.\"\u003c/p\u003e\n\u003cp\u003e\"Sweetheart.\" Paen sighed, releasing my arm. \"I might have an exaggerated idea of my own strength, but even I don\u0027t believe we can overpower him by ourselves. He is a demon of immense power. It\u0027s going to take more than just the three of us and brute force.\"\u003c/p\u003e\n\u003cp\u003e\"Well, this is just great!\" I said, my hands on my hips as I turned to glare at Paen. \"Why the hell didn\u0027t you mention this before we drove all the way out here?\"\u003c/p\u003e\n\u003cp\u003e\"You told me to drive. I assumed you would have a rescue plan. Since you don\u0027t, let us create one now.\"\u003c/p\u003e\n\u003cp\u003eI looked at Finn. \"Is your brother always this annoying?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said, grinning. \"But since he\u0027s usually right, we tolerate him.\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" I said, crossing my arms over my chest while giving Paen a glare that would have scorched a mortal man. \"What do you suggest?\"\u003c/p\u003e\n\u003cp\u003ePaen looked thoughtful. \"It would help if we knew exactly what sort of weaknesses water demons have. Do either of you know?\"\u003c/p\u003e\n\u003cp\u003eFinn and I shook our heads.\u003c/p\u003e\n\u003cp\u003e\"Sorry, they didn\u0027t teach demonology at Diviners\u0027 school.\"\u003c/p\u003e\n\u003cp\u003eA burst of noise from the battlefield momentarily distracted Paen. \"Hmm. Then we\u0027ll have to use what we have here. Sam, tell us more about this lodestone. Is there anything related to it that we can use to gain the upper hand on Pilar?\"\u003c/p\u003e\n\u003cp\u003eI thought. \"Well, it\u0027s like I told you - it\u0027s a sacred place to Fae folk. Not religious sacred, but one revered because it provides a natural bridge between the beyond and this reality.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re more powerful here than you are anywhere else?\" Paen asked.\u003c/p\u003e\n\u003cp\u003eI shook my head. \"The power contained in the lodestone is not one we can tap into and use - it permeates the area, rather than people. That\u0027s why the ghosts were able...\"\u003c/p\u003e\n\u003cp\u003eI stopped, my eyes meeting Paen\u0027s.\u003c/p\u003e\n\u003cp\u003e\"The ghosts,\" he said, his eyes narrowing as he looked beyond me.\u003c/p\u003e\n\u003cp\u003e\"You think?\" I asked, not surprised that we\u0027d had the same thought at the same time.\u003c/p\u003e\n\u003cp\u003e\"Think what?\" Finn asked.\u003c/p\u003e\n\u003cp\u003e\"Are they here?\" Paen asked, ignoring his brother.\u003c/p\u003e\n\u003cp\u003eI scanned the area. \"Not sure. I need to open myself up to the location to find them.\"\u003c/p\u003e\n\u003cp\u003e\"What are you thinking?\" Finn asked again. \"What do ghosts have to do with anything? What are you looking for?\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure they\u0027ll have a physical presence?\" Paen asked. Finn punched him in the arm. \"Ow. We\u0027re thinking the ghosts might be able to help us with Pilar. Now, stop beating me before I knock your lights out.\"\u003c/p\u003e\n\u003cp\u003eFinn grinned at him as I closed my eyes and cleared my mind, preparing myself to listen to the site.\u003c/p\u003e\n\u003cp\u003e\"Well?\" Paen asked, clearly as impatient as I was to get on with things.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see... oh, wait. I think maybe over there.\" I opened my eyes and headed around the side of the trailer cluster to a flat area that stretched upward to a rocky cliff. \"Hello, Uilleam.\"\u003c/p\u003e\n\u003cp\u003eThe big Scottish ghost turned from where he and a few of his fellow countrymen were perched on an outcropping of rocks, evidently watching the battle scene being filmed. All the men wore the same disgusted looks on their faces.\u003c/p\u003e\n\u003cp\u003eI held out my arms for him as if I was welcoming an embrace. Uilleam\u0027s face lit up. His body did the shimmering thing as he allowed himself to be grounded, striding forward to me with a calculating look in his eye. I ran for Paen and held up a hand for him to stop before he could pull me into another ghostly kiss. \"Up to you, master linguist. Let\u0027s see if they\u0027re interested in helping us fight for Clare.\"\u003c/p\u003e\n\u003cp\u003eFour minutes later we streamed over the rocks that marked the edge of the cliff, behind us an army of ghostly Scottish warriors, all of whom were aching for a good brawl.\u003c/p\u003e\n\u003cp\u003e\"You know what this reminds me of?\" Finn asked. \"Something out of Tolkien. Paen could be Aragorn with his army of the dead, and you could be Legolas, while I am - \"\u003c/p\u003e\n\u003cp\u003e\"You are going to be one sorry Moravian if you continue with that analogy,\" I said, giving him a look that let him know I meant what I said. \"I have no compunction about decking you if I have to.\"\u003c/p\u003e\n\u003cp\u003eFinn laughed, but the merriment dried up a few moments later when we reached the base of the cliff.\u003c/p\u003e\n\u003cp\u003e\"Sam?\" Paen asked, obviously hoping for some insight on my part.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re here,\" I said, holding my hands out, palms down toward the ground. \"We\u0027re at the heart of the lodestone. I can feel they\u0027re here. There\u0027s something disturbing the grounding.\"\u003c/p\u003e\n\u003cp\u003e\"Disturbing it how?\"\u003c/p\u003e\n\u003cp\u003eI tried to locate the source of the disturbance, but the waves of power coming from the location itself were muddying the feeling. \"Disturbing it. Making it not happy. I can only assume it\u0027s Pilar. Demons normally avoid places strong in power from the beyond, so it makes sense that such places wouldn\u0027t like them any more than the reverse.\"\u003c/p\u003e\n\u003cp\u003e\"Then why did he bring Clare here?\" Finn asked.\u003c/p\u003e\n\u003cp\u003e\"Because it provides access to the statue, naturally,\" a voice called down from above us.\u003c/p\u003e\n\u003cp\u003eUilleam shouted and pointed his sword at the cliff face. Standing on a ledge about halfway up, Pilar held a knife to Clare\u0027s throat. Beppo sat chirping on a rock next to them. The ghosts roared something that made the hairs on my neck stand on end, and started swarming up the cliff.\u003c/p\u003e\n\u003cp\u003e\"No!\" Pilar yelled down at them, dragging Clare backward into what looked like a shallow cave. \"Call them off, or I will kill the faery.\"\u003c/p\u003e\n\u003cp\u003e\"I am not a faery,\" Clare snapped, trying to glare at the demon who held her by the throat. \"I am a lingerie model. There is a huge difference between the two things! Why does no one else see that?\"\u003c/p\u003e\n\u003cp\u003ePaen shouted something to Uilleam. The ghosts stopped their ascent, but they weren\u0027t happy about it, snarling and waving their swords around in a menacing fashion.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a faery, she\u0027s immortal,\" I called up to Pilar. \"There\u0027s no sense in threatening to kill her - you can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"I am so not a faery!\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027ll be dead enough if I decapitate her,\" Pilar called back.\u003c/p\u003e\n\u003cp\u003e\"Oh!\" Clare yelled, looking even more indignant.\u003c/p\u003e\n\u003cp\u003e\"All right, we\u0027ve stopped the ghosts,\" I answered, moving a little to the side so I could have an unobstructed view of Pilar. Paen wrapped an arm around me and pulled me up tight against him. \"Now, let\u0027s talk. Why do you want Clare? She doesn\u0027t have any powers except the ability to talk to flowers - \"\u003c/p\u003e\n\u003cp\u003e\"You are such a liar,\" my cousin gasped.\u003c/p\u003e\n\u003cp\u003eWe all ignored her. \" - and the ability to wear sackcloth and make it look good. So why do you want her, of all people?\"\u003c/p\u003e\n\u003cp\u003ePilar laughed. \"I wanted her because I thought you were dead. But as you survived, you will do. I will exchange your cousin for you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got a deal,\" I said without hesitation, pulling away from Paen.\u003c/p\u003e\n\u003cp\u003e\"Like hell he does,\" Paen snarled, pulling me back and stuffing me behind him. \"You\u0027ll take me instead.\"\u003c/p\u003e\n\u003cp\u003e\"Hey!\" I said, slapping my hand on his back. \"Less arrogance, if you please. He wants me.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not getting you.\" You don\u0027t honestly believe I\u0027m going to allow a demon to take you, do you?\u003c/p\u003e\n\u003cp\u003eHe can\u0027t hurt me, Paen. I\u0027m immortal now, remember?\u003c/p\u003e\n\u003cp\u003eHe can decapitate you just as easily as he can Clare.\u003c/p\u003e\n\u003cp\u003eBut he won\u0027t. He needs me.\u003c/p\u003e\n\u003cp\u003eIt\u0027s a moot point. I\u0027m not letting you sacrifice yourself.\u003c/p\u003e\n\u003cp\u003e\"You may have your soul, Dark One, but you cannot enter the beyond on your own,\" Pilar said, jerking Clare closer. \"Nor can your brother.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have a soul now, so neither can I,\" I yelled around Paen, up to Pilar.\u003c/p\u003e\n\u003cp\u003e\"No, but you have a cousin who can,\" he said. \"You will be a hostage for her.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter who can enter what - Sam is here, and I\u0027m not letting her go,\" Paen said, stubbornness positively rolling off him.\u003c/p\u003e\n\u003cp\u003eI thumped him on the back again. Paen, truly I appreciate the anguish you feel at the thought of losing me, but I swear to you I\u0027m not going to let him kill me. Again.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eWe don\u0027t have a choice!\u003c/p\u003e\n\u003cp\u003e\"Then we appear to be at an impasse,\" Pilar said, glancing up at the sky. The clouds that had darkened the sky all day were starting to dissipate, little peeps of a quarter moon shining through the breaks. \"It is almost deep night. Do you really wish to continue this stalemate until you run out of time?\"\u003c/p\u003e\n\u003cp\u003eI pulled Paen until he was facing me. \"We\u0027re out of options, sweetie.\"\u003c/p\u003e\n\u003cp\u003eHis brow darkened, and I could feel the protests he was about to make. I laid a finger across his lips, gently brushing them away. \"I know. I feel the same way. But I will not let Caspar have your mother\u0027s soul, not while it\u0027s within my ability to stop him.\"\u003c/p\u003e\n\u003cp\u003eHis Adam\u0027s apple bobbed as he fought to keep his emotions under control. I won\u0027t lose you again, Sam. I can\u0027t. You made me love you, dammit! You made me give up brooding, and sex without love, and happily going about my way without interference from anyone. You owe me!\u003c/p\u003e\n\u003cp\u003eI laughed, leaning into him to replace my fingers with my lips, offering him everything I had, pouring into him all the love I felt, accepting in return from him the radiant warmth of his soul, crested by a love so powerful it seemed to rock the world back on its axis. I love you, Paen. I love you more than I ever imagined was possible for one person to love another. You are the sun to me, you warm me and give me life, and I could not exist any longer without you. But I have to do this. We have to save Clare and your mother, and if you can think of another way to do it, I\u0027m all ears.\u003c/p\u003e\n\u003cp\u003ePain cut sharply through him, pain and regret, and anger at himself for not being able to save me.\u003c/p\u003e\n\u003cp\u003eBut you did save me, I told him, drinking in his warmth as he pulled me up tight to his body. You didn\u0027t let me die before, and I know you won\u0027t let me go now. No matter what happens, I know you won\u0027t let go.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see to it nothing happens,\" he said grimly, pulling his mouth from mine. He half turned, calling over his shoulder to Pilar, \"Release Clare, and you can have Sam and me as hostages.\"\u003c/p\u003e\n\u003cp\u003eBeppo jumped onto Pilar\u0027s shoulder. The demon seemed to consider Paen\u0027s offer for a moment before shrugging. \"If you wish to offer yourself as well, I will not object. You may approach us, but only you two. No one else.\"\u003c/p\u003e\n\u003cp\u003ePaen had to have a short talk with Finn, Uilleam, and the ghosts before they would let us climb up to where Pilar and Clare waited. I got the feeling that unlike Finn, the ghosts weren\u0027t so much upset with Paen and me putting ourselves in potential danger as they were pissed at being done out of a good fight.\u003c/p\u003e\n\u003cp\u003e\"You can fight later,\" I told Uilleam as I scrambled up a large rock at the base of the cliff.\u003c/p\u003e\n\u003cp\u003e\"Do we have yer oath on that?\" he asked, fingering the edge of his sword.\u003c/p\u003e\n\u003cp\u003eI looked in surprise at him for a moment. \"You speak English?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re dead, not daft,\" he said with a roll of his eyes. \"We\u0027ve naught else to do around here but listen to the tourists. At least, not until this lot came.\" He indicated the movie crew with a sweeping gesture.\u003c/p\u003e\n\u003cp\u003e\"Oh. Right. Well, then, if you guys can just hold tight for a bit, I promise you we\u0027ll find someone for you to battle later. Pretend battle. No killing or anything.\"\u003c/p\u003e\n\u003cp\u003eThe ghosts looked disappointed.\u003c/p\u003e\n\u003cp\u003e\"Later,\" I said, giving Uilleam a warning look as I reached up to where Paen was waiting to haul me up a big rock.\u003c/p\u003e\n\u003cp\u003eWe reached the outcropping where Pilar and Clare stood without any mishaps.\u003c/p\u003e\n\u003cp\u003e\"Let her go,\" Paen ordered, nodding toward Clare.\u003c/p\u003e\n\u003cp\u003ePilar smiled and released Clare, who took two steps to the side, then turned and slapped Pilar as hard as she could.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s for shooting my dress, you demonic twit!\" she told him to his startled face before storming over to Paen and me.\u003c/p\u003e\n\u003cp\u003e\"Her dress?\" Pilar asked us.\u003c/p\u003e\n\u003cp\u003eI shook my head. \"Honestly, you don\u0027t want to go there.\"\u003c/p\u003e\n\u003cp\u003e\"It was a Versace!\" came the outraged reply from where Clare was standing behind me.\u003c/p\u003e\n\u003cp\u003ePilar closed his eyes for a moment, wearing an expression that was identical to one I\u0027d seen frequently on Paen\u0027s face. I thought about pointing that out, but decided it wasn\u0027t something Paen needed to know at that moment. \"If you don\u0027t mind, I\u0027m rather anxious to have the Jilin God. Could we get on with it?\"\u003c/p\u003e\n\u003cp\u003e\"We can if you answer a couple of questions first,\" I said, taking Paen\u0027s hand. Just touching him toned down the howl of pain inside me that was my ever-present companion.\u003c/p\u003e\n\u003cp\u003ePilar glanced at the sky again and gave another shrug. Beppo gave a little squeak and leaped from Pilar to Paen, quickly scaling his arm, jumping across him to land on my shoulder. I gave the monkey a stern look. \"You didn\u0027t tell me you belonged to him,\" I said, nodding toward Pilar.\u003c/p\u003e\n\u003cp\u003e\"He is a familiar - he does not speak,\" Pilar said, as if I honestly expected the monkey to answer. \"What questions do you wish to ask of me?\"\u003c/p\u003e\n\u003cp\u003e\"Where is the Jilin God?\" Paen asked, his fingers tightening around mine. Beppo wrapped his tail around my throat and began to pick through my hair, looking for mites.\u003c/p\u003e\n\u003cp\u003e\"Within grasp in the beyond.\"\u003c/p\u003e\n\u003cp\u003e\"Why did you zap me into the place between realities? Were you afraid of what I was going to tell Caspar?\"\u003c/p\u003e\n\u003cp\u003ePilar looked at me with unemotional black eyes. \"I am afraid of nothing. It was not my intent to push you into the web; I simply wanted the statue. I didn\u0027t realize you had it until I touched you.\"\u003c/p\u003e\n\u003cp\u003e\"Are you working for your master, or for yourself?\" Paen asked.\u003c/p\u003e\n\u003cp\u003eYou took my question!\u003c/p\u003e\n\u003cp\u003eThere are plenty left for him to answer.\u003c/p\u003e\n\u003cp\u003ePilar laughed. I didn\u0027t think demons could laugh, but he did, a mirthless, cold laugh, one that sent chills down my back. \"I have no master.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a second - you do, too. Caspar said you were his minion, that he hired you to drag me in to see him, amongst other things. He\u0027s a demon lord, you\u0027re a demon - that makes him your master.\"\u003c/p\u003e\n\u003cp\u003e\"Do you not yet understand?\" Pilar asked, looking at me with an expression of something that looked a lot like disappointment. \"The being you know as Caspar Green is not my master - he is my enemy. He tried to capture me, and failed. He tried to have me thrown down from the heavens, and failed. He has sought my destruction his entire life, and now he seeks to regain his former strength in order to rule this world. I am sworn to allow neither.\"\u003c/p\u003e\n\u003cp\u003e\"But... you were working for him,\" I pointed out, wondering just how many surprises I could take in a one-week period.\u003c/p\u003e\n\u003cp\u003ePilar gave me another disappointed look. \"He did not recognize me in this form.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003ePaen\u0027s fingers tightened even more around mine until the grip was almost painful. \"You are the sworn enemy of Yan Luowang, the god of death.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Pilar said. I noticed he didn\u0027t give Paen a disappointed look.\u003c/p\u003e\n\u003cp\u003e\"He attempted to have you thrown out of heaven.\"\u003c/p\u003e\n\u003cp\u003ePaen said, and with his words, something struck a chord in me.\u003c/p\u003e\n\u003cp\u003eFigured it out yet, sweetheart?\u003c/p\u003e\n\u003cp\u003eWait a sec... thrown out of heaven?\u003c/p\u003e\n\u003cp\u003eThat\u0027s what he said.\u003c/p\u003e\n\u003cp\u003eI bit my lip as I looked closely at Pilar. He looked human, absolutely mortal, except for the cold that seemed to roll off him like a dense fog. \"Caspar said you were a kung, a Chinese water demon.\"\u003c/p\u003e\n\u003cp\u003e\"I am many things. That is just one part of what makes me a whole.\"\u003c/p\u003e\n\u003cp\u003eThe pieces of the puzzle fell together with a snap that I could have sworn was audible. \"Were you, by any chance, held prisoner in a stone prison for fifteen hundred years?\"\u003c/p\u003e\n\u003cp\u003ePilar smiled.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re Sun Wukong, aren\u0027t you? The monkey god? The subject of the Jilin statue? The one Buddha released, the one who became a champion against demons.\"\u003c/p\u003e\n\u003cp\u003e\"And their lords. Now I seek to stop Yan Luowang, whatever the cost such an action may demand.\" Pilar made a polite little bow. \"And you, Beloved, will do very nicely as the blood price.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/even-vampires-get-the-blues-dark-ones-4/page-19.html","bookId":2205,"creation":"Oct 5, 2019 10:07:54 PM","modification":"Oct 5, 2019 10:07:54 PM"}
