{"id":11664,"no":17,"title":"CHAPTER XVII. A COUNCIL OF THREE.","content":"When the inquest was over, Naball went straight home, and carefully read all the notes he had taken of the evidence given. After doing so, he came to the conclusion that the person on whom most suspicion rested was Keith Stewart.\n\u003cbr\u003e \n\u003cbr\u003e \"In the first place,\" said Naball, thoughtfully eyeing his papers, \"Stewart was the clerk of old Lazarus, and knew what was in the safe, and where the keys were kept; he is a member of an expensive club, which he can\u0027t possibly afford to pay for out of his salary as a clerk; as to his coming in for money, that\u0027s bosh!--if he had, agreement or no agreement, he wouldn\u0027t have remained with old Lazarus. He states that he left the theatre at half-past twelve, and the doctor says the death took place at midnight; but then he wasn\u0027t sure, and it might have taken place at half-past one, which would give Stewart time to commit the crime. He could not account for his time between leaving the theatre and seeing Villiers except by saying he had been walking, which is a very weak explanation. Humph! I think I\u0027ll see Mr. Stewart and ask him a few questions.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Naball glanced at himself in the mirror, arranged the set of his tie, dusted his varnished boots, and then sallied forth in search of Keith. Passing along Swanston Street, he went into a florist\u0027s, and purchased himself a smart buttonhole of white flowers, then held a short council of war with himself as to where to find Stewart.\n\u003cbr\u003e \n\u003cbr\u003e \"Wonder where he lives?\" muttered the detective, in perplexity; \"let me see, what\u0027s the time,\" glancing at his watch--\"nearly five; he\u0027s a great friend of Mr. Lazarus, and I know Lazarus is sub-editor of The Penny Whistle; I\u0027ll go along and ask him--he\u0027s sure to be in just now.\"\n\u003cbr\u003e \n\u003cbr\u003e He walked rapidly along to the newspaper office, and, being admitted to Ezra\u0027s room, found that young man just putting on his coat preparatory to going away, his labours for the day now being concluded.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, Mr. Naball,\" asked Ezra, in his soft voice, \"what can I do for you--anything about this unfortunate affair?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Naball bluntly; \"I want to see Mr. Stewart.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, you do!\" broke in a new voice, and Stewart stepped out of an adjoining room, where he had been waiting for his friend; \"what is the matter?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Nothing much,\" observed Naball, in a frank voice; \"but as this case has been put into my hands, I want to ask you a few questions.\u0027\n\u003cbr\u003e \n\u003cbr\u003e \"Am I in the way?\" asked Lazarus, taking up his hat.\n\u003cbr\u003e \n\u003cbr\u003e \"By no means,\" replied Naball politely; \"in fact, yon may be of assistance.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, fire away,\" said Keith, coolly lighting a cigarette. \"I\u0027m ready to answer anything.\"\n\u003cbr\u003e \n\u003cbr\u003e Naball glanced keenly at both the young men before he began to talk, and noted their appearance. Keith had a rather haggard look, as though he had been leading a dissipated life; while Ezra\u0027s face looked careworn and pale.\n\u003cbr\u003e \n\u003cbr\u003e \"Cut up over his father\u0027s death, I guess,\" said Naball to himself; \"poor chap!--but as for the other, it looks like late hours and drink. I must find out all about your private life, Mr. Stewart.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m waiting,\" said Keith impatiently; \"I wish you wouldn\u0027t keep me very long; I\u0027ve got to meet a train from the country to-night.\"\n\u003cbr\u003e \n\u003cbr\u003e Naball closed both doors of the room, and, resuming his seat, looked steadily at Keith, who, seated astride a chair, leaned his elbows on the back, and smoked nonchalantly.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you aware,\" asked Naball deliberately, \"if the late Mr. Lazarus had any enemies?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I can answer that question best,\" said Ezra quickly, before Keith could speak. \"Yes, he had plenty; my father, as you know, was a moneylender as well as a pawnbroker, and, as he took advantage of his possession of money to extort high interest, I know it made a lot of people feel bitter against him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Considering that you are his son, sir,\" said Naball, in a tone of rebuke, \"you do not speak very well of the dead.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have not much cause to,\" rejoined Ezra bitterly; \"he was father to me in name only. But you need not make any comments--my duty to my father\u0027s memory is between myself and my conscience. I have answered your question--he had many enemies.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So I believe also,\" said Keith slowly; \"but I don\u0027t think any one was so hostile as to desire his death.\"\n\u003cbr\u003e \n\u003cbr\u003e \"As you don\u0027t think so,\" observed Naball sharply, \"I myself believe that the murder was committed for the sake of robbery.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s easily seen,\" said Ezra calmly, \"from the fact of the safe being open and the money gone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That might have been a blind,\" retorted Naball quickly, \"but you talk of money being stolen; I think, Mr. Stewart, in your evidence to-day you said they were bank notes?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; twenty ten-pound notes,\" replied Keith.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know the numbers of them?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No; I never thought of taking the numbers.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And you handed them to Mr. Lazarus?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I did; at half-past five--he put them in his safe.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Were there any other valuables in the safe?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know,\" retorted Keith coldly; \"I was not in the confidence of my employer.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know?\" said Naball, turning to Ezra.\n\u003cbr\u003e \n\u003cbr\u003e The young Jew smiled bitterly.\n\u003cbr\u003e \n\u003cbr\u003e \"I also was not in my father\u0027s confidence,\" he said, \"so know nothing.\"\n\u003cbr\u003e \n\u003cbr\u003e \"There was some gold and silver money also in the safe,\" said Keith to Naball, knocking the ashes off his cigarette.\n\u003cbr\u003e \n\u003cbr\u003e \"Humph! that\u0027s not much guide,\" replied the detective; \"it\u0027s the notes I want--if I could only find the numbers of those notes--where did they come from?\"\n\u003cbr\u003e \n\u003cbr\u003e \"A man at Ballarat, called Forbes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh! I\u0027ll write to Mr. Forbes of Ballarat,\" said Naball, making a note, \"but if those notes are put in circulation, do you know of any means by which I can identify them?\"\n\u003cbr\u003e \n\u003cbr\u003e Keith shook his head, then suddenly gave a cry.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; I can tell you how to identify one of the notes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That will be quite sufficient,\" said the detective eagerly. \"How?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That boy, Isaiah,\" said Stewart, \"he\u0027s great on backing horses, and frequently tells me about racing. When I was making up my cash on that night, the notes were lying on the desk, and as the door of Mr. Lazarus\u0027 room was open, Isaiah was afraid to speak aloud about his tip, so he wrote it down.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But how can that identify the bank-note?\" asked the perplexed detective.\n\u003cbr\u003e \n\u003cbr\u003e \"Because the young scamp wrote his tip, \u0027Back Flat-Iron,\u0027 on the back of a ten-pound note.\"\n\u003cbr\u003e \n\u003cbr\u003e \"In pencil?\" asked Naball.\n\u003cbr\u003e \n\u003cbr\u003e \"No; in ink!\"\n\u003cbr\u003e \n\u003cbr\u003e \"So one of the notes that were stolen has the inscription \u0027Back Flat-Iron\u0027 on the back of it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Exactly!\"\n\u003cbr\u003e \n\u003cbr\u003e Naball scribbled a line or two in his pocket-book, and shut it with a snap.\n\u003cbr\u003e \n\u003cbr\u003e \"If that note goes into circulation,\" he said, in a satisfied tone, \"I\u0027ll soon trace it to its original holder.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And then?\" asked Ezra.\n\u003cbr\u003e \n\u003cbr\u003e \"And then,\" reiterated Naball quietly, \"I\u0027ll lay my hands on the man who killed your father. And now, Mr. Stewart, I want to ask you a few questions about yourself.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Go on!\" said Keith imperturbably; \"I hope you don\u0027t think I killed Lazarus?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think--nothing,\" replied Naball quietly; \"I only want to find out as much as I can. You were at the Bon-Bon Theatre on that night?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; talking to Mr. Mortimer.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Any one else with you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" replied Ezra, \"I was, and Caprice; we left about half-past eleven.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And you, Mr. Stewart?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I left at half-past twelve.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Where did you go then?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I was excited over some business I had done, and strolled about the city.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Anywhere in particular?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No. I went along Collins Street, up William Street, round about the Law Courts, and then came down Bourke Street, on my way home.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How long were you thus wandering about?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think about an hour and a half, because as I turned into Russell Street the clock struck two.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why did you turn into Russell Street?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why!\" echoed Keith, in surprise, \"because I wanted to go home. I went through Russell Street, down Flinders Street, and then walked to East Melbourne, past the Fitzroy Gardens.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh! and you saw Villiers standing about the shop?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; he was leaning against the door.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Drunk?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very!\"\n\u003cbr\u003e \n\u003cbr\u003e \"What did you do?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I ordered him off.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did he go?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; rolled down the street towards Bourke Street, singing some song.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You noticed nothing peculiar about him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Was the door of the alley leading to the back open or shut?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know--I never noticed.\"\n\u003cbr\u003e \n\u003cbr\u003e \"After Villiers disappeared, you went home?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I did--straight home.\"\n\u003cbr\u003e \n\u003cbr\u003e Naball pondered for a few moments. Stewart certainly told all he knew with perfect frankness, but then was he telling the truth?\n\u003cbr\u003e \n\u003cbr\u003e \"Do you want to ask me any more questions?\" asked Keith, rising.\n\u003cbr\u003e \n\u003cbr\u003e Naball made up his mind, and spoke out roughly,--\n\u003cbr\u003e \n\u003cbr\u003e \"I want to know how you, with a small salary, can afford to belong to an expensive club like the \u0027Skylarks?\u0027\"\n\u003cbr\u003e \n\u003cbr\u003e Keith\u0027s face grew as black as thunder.\n\u003cbr\u003e \n\u003cbr\u003e \"Who the devil gave you permission to pry into my private affairs?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No one except myself,\" retorted Naball boldly, for, though inferior to Stewart in size, he by no means wanted pluck; \"but I\u0027m engaged in a serious case, and it will be best for you to speak out frankly.\n\u003cbr\u003e \n\u003cbr\u003e \"You surely don\u0027t suspect Stewart of the murder?\" interposed Ezra warmly.\n\u003cbr\u003e \n\u003cbr\u003e \"I suspect nobody,\" retorted Naball. \"I\u0027m only asking him a question, and, if he\u0027s wise, he\u0027ll answer it.\"\n\u003cbr\u003e \n\u003cbr\u003e Keith thought for a moment. He saw that, for some extraordinary reason or another, Naball suspected him, so, in order to be on the safe side, resolved to take the detective\u0027s advice and answer the question.\n\u003cbr\u003e \n\u003cbr\u003e \"It is, as you say, a serious matter,\" he observed quietly, \"and I am the last person in the world not to give any assistance to the finding out of the criminal; ask what you please, and I will answer.\"\n\u003cbr\u003e \n\u003cbr\u003e This reply somewhat staggered Naball, but, as he had strong suspicions about Stewart\u0027s innocence, he put down the apparent frankness of the answer to crafty diplomacy.\n\u003cbr\u003e \n\u003cbr\u003e \"I only want to know,\" he said mildly, \"how a gentleman in your position can afford to belong to an expensive club.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Because I can afford to do so,\" replied Keith calmly. \"When I first came to Melbourne, I had no money, and was engaged by Mr. Lazarus as his clerk, with the understanding I should stay with him six months. To this I agreed, but shortly afterwards a sum of five hundred pounds was placed to my credit, and afforded me a chance of living in good style. I wished to leave the pawnshop, but Mr. Lazarus reminded me of my position, and I had to stay. That is all.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who placed this five hundred to your credit?\" asked Naball.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You don\u0027t know?\" echoed Naball, in surprise. \"Do you mean to say that a large sum like that was placed to your credit by a person whom you don\u0027t know?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I do.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And I can substantiate that statement,\" said Ezra quietly.\n\u003cbr\u003e \n\u003cbr\u003e Naball looked from one to the other in perplexity, puzzled what to ask next. Then he felt the only thing to be done was to go away and think the matter over. But he did not intend to lose sight of Keith, and this absurd statement about the five hundred only seemed to strengthen his suspicions, so he determined to have him shadowed.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Mr. Stewart,\" he said quietly. \"I have nothing more to ask. What time did you say you were going to meet a country train?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I mentioned no time,\" replied Keith sharply.\n\u003cbr\u003e \n\u003cbr\u003e Baffled by this answer, Naball tried another way.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you kindly give me your address?\" he asked, pulling out his pocket-book. \"I may want to communicate with you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Vance\u0027s boarding-house, Powlett Street, East Melbourne.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Naball noted this in his book, and then, with a slight nod, took his leave.\n\u003cbr\u003e \n\u003cbr\u003e \"Damn him,\" cried Keith fiercely, \"he suspects me of this crime.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Pooh! that\u0027s nonsense,\" replied Ezra, as they went out, \"you can easily prove an alibi.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I can\u0027t,\" replied Keith, in a hard tone. \"From half-past twelve o\u0027clock till two I was by myself, and no one saw me. I say I was wandering about the streets, he thinks I was in Russell Street committing a murder.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t think you need be a bit afraid of anyone suspecting you,\" said Ezra bitterly. \"Why, they might as well think I killed my father.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes. I had a quarrel with him, and then he was murdered. Oh, I assure you they could get up an excellent case against me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But you could prove an alibi.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s just where it is,\" said Ezra coolly; \"I can\u0027t.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Because, after leaving Kitty Marchurst, I went down the street to The Penny Whistle office, and found it closed. I then walked home along Collins Street, through the Fitzroy Gardens. It was a beautiful night, and, as I was thinking over my quarrel with my father, I sat down on one of the seats for a time, so I did not get home till two o\u0027clock in the morning. No one saw me, and I\u0027ve got quite as much difficulty in proving an alibi as you have.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you think Naball suspects you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No; nor do I think he suspects you, but I\u0027ve got a suspicion that he suspects some one.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And that some one--\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is called Randolph Villiers.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1861/53896.html","bookId":829,"creation":"Aug 2, 2019 4:05:46 AM","modification":"Aug 2, 2019 4:05:46 AM"}
