{"id":64455,"no":23,"title":"Page 23","content":"\u003cp\u003eThus far, Frik had called several times, but he had not yet made an appearance. Peta was hardly impressed by his lack of compassion and admitted to herself yet one more time that the Oilstar chief was not among her favorite people.\u003c/p\u003e\n\u003cp\u003eTwo days later, by which time McKendry\u0027s condition had been stabilized, Frikkie showed up at the hospital. He was not a pretty sight. His one eye hadn\u0027t yet fully healed from the explosion that had killed Paul Trujold, and his hand looked as if it had a long way to go before it was good for more than gross manipulation. His visit was short, their conversation brief and more about Simon than Terris; in neither case were his emotions involved.\u003c/p\u003e\n\u003cp\u003e\"Simon\u0027s in San Gabriel. He hasn\u0027t gone down - in the water - again yet. The weather\u0027s not been conducive. Too much rain, too many currents stirring things around.\"\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t let him - \"\u003c/p\u003e\n\u003cp\u003e\"Let him? May I remind you again that he\u0027s an adult. What he chooses to do is his own business.\"\u003c/p\u003e\n\u003cp\u003eThere was obviously no point in arguing with the man. None at all. \"I\u0027d like to see him,\" Peta said. \"I think I\u0027ll head out to San Gabriel for a day or two. I could use the rest.\"\u003c/p\u003e\n\u003cp\u003e\"What about McKendry?\"\u003c/p\u003e\n\u003cp\u003e\"Terris is a long way from full recovery, but he\u0027s doing well. Barring unforeseen complications, the hospital can manage fine without me. When they think he\u0027s ready, they\u0027ll send him on to rehab. He won\u0027t need me for that, either. If they have to reach me, they can call me in San Gabriel.\"\u003c/p\u003e\n\u003cp\u003eSomething in Frik\u0027s expression told her that this was the last thing he wanted her to do. For whatever reason, Simon\u0027s dive was of enormous importance to him. Well, that\u0027s just too bad, she thought. It was not only a man who had to do what a man had to do.\u003c/p\u003e\n\u003cp\u003eLeaving Frik at McKendry\u0027s bedside, she went outside for a smoke. It was the last American cigarette she had brought from New York. From now on, it was back to the local 555s, which were milder and cheaper anyway. I\u0027ll give up again soon, she told herself, lighting up. After having given them up for three years, she had fallen into old habit the night Arthur was killed.\u003c/p\u003e\n\u003cp\u003e\"Got another one?\" Saaliim asked.\u003c/p\u003e\n\u003cp\u003ePeta jumped. \"Didn\u0027t know you were here, and no, this is my last one.\"\u003c/p\u003e\n\u003cp\u003eShe handed it to him and they shared it the way they would have shared a joint.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to go to San Gabriel this afternoon.\" She waved away the end of the smoke. \"Think you can take me there?\"\u003c/p\u003e\n\u003cp\u003eHe drew on the butt, then crunched it underfoot. \"I have to take Mr. Frik to theAssegai, \" he said. \"After that we maybe go to the site. Mr. Frik say maybe Mr. Brousseau come dive today. Maybe not.\" He looked up at the sky. \"Maybe later it storm.\"\u003c/p\u003e\n\u003cp\u003e\"Could be.\" Eighty-four degrees. Humid. Sultry. Not a cloud to be seen. A tourist would have laughed, she thought. \"Is Manny on island?\"\u003c/p\u003e\n\u003cp\u003e\"I think so.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\" Peta glanced at the Hummer beyond them in the physician\u0027s parking lot, unsurprised that Frik would feel it his right to park there. \"I\u0027ll get my things and make arrangements with the charge nurse. Don\u0027t leave without me.\"\u003c/p\u003e\n\u003cp\u003eWhen she was ready to leave the hospital, Saaliim was half asleep behind the wheel of the car. Frik paced impatiently back and forth next to it.\u003c/p\u003e\n\u003cp\u003e\"One more minute and we\u0027d have been out of here,\" he said.\u003c/p\u003e\n\u003cp\u003ePeta didn\u0027t answer; in fact, she said little en route to Frikkie\u0027s dock, and only waved a passing good- bye as Saaliim turned the Hummer around.\u003c/p\u003e\n\u003cp\u003eTo her delight, the first person Peta saw at the dock was Manny Sheppard, inevitable Carib in hand. He was clearly happy to see her.\u003c/p\u003e\n\u003cp\u003e\"Hey, beautiful. What\u0027s up?\"\u003c/p\u003e\n\u003cp\u003eShe hugged him. \"You first, Manny. What\u0027s up with you? Which way you headed?\"\u003c/p\u003e\n\u003cp\u003e\"Which way you want me to head?\"\u003c/p\u003e\n\u003cp\u003e\"I need to get to San Gabriel.\"\u003c/p\u003e\n\u003cp\u003eHe motioned toward his small steel-hulled freighter. \"Come. I\u0027ll take you there. I got a load of supplies headed for Grenada. San Gabby\u0027s a quick stop on the way.\"\u003c/p\u003e\n\u003cp\u003eShe had known Manny since childhood, as well as anyone could ever know him. He was the sort of person with whom you could never quite tell what was real and what he was making up on the spot. He\u0027d been running boats up and down the Caribbean since he left the OECS Security Forces. What was in the boats he sailed around was always an open question, though no customs officials had ever found any evidence to back up their suspicions.\u003c/p\u003e\n\u003cp\u003e\"So what you want in San Gabby?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m looking for Simon Brousseau.\" She felt a sudden stab of anxiety. \"He hasn\u0027t gone diving today, has he?\"\u003c/p\u003e\n\u003cp\u003e\"Not so far as I know. Simon be probably resting up in San Gabriel, making the lovely ladies happy,\" he said.\u003c/p\u003e\n\u003cp\u003ePeta had no idea how many lovely ladies might be hiding in the small fishing village close to the drill site, nor did she care. If the choice was diving or diddling, sex was certainly the less life-threatening option for Simon.\u003c/p\u003e\n\u003cp\u003eThey sailed through a seascape dotted with rock outcroppings and headed toward the Dragon\u0027s Mouth\u0026nbsp;\u0026nbsp;- the narrow channel separating Trinidad from the Venezuelan mainland. San Gabriel was actually a small island off the coast of the Chaguara Peninsula, the northern spit of land pointing from Trinidad toward the body of South America. It was one of a half dozen towns that made most of their living from not-so-rich Americans and Europeans who wanted to experience diving and sport fishing, but couldn\u0027t afford the big resorts and charters.\u003c/p\u003e\n\u003cp\u003eAs many times as Peta had made the journey through the Dragon\u0027s Mouth by sea before, she was still taken by its jagged beauty. Distracted, wanting some escape from the endless worries about Simon and Terris that ran through her mind, at first she only half listened to what Manny was saying.\u003c/p\u003e\n\u003cp\u003e\"...So Paul Trujold, he...You listening to me, Peta?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Manny. I didn\u0027t mean to be rude.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" he said. \"But you need to hear this.\"\u003c/p\u003e\n\u003cp\u003eManny repeated what he had been saying. When he had finished telling her about Paul Trujold, about the real purpose of Simon\u0027s dive - to retrieve a piece of the artifact that was wedged in an underwater cave - she thought of the pendant that Arthur had given her and started to put the facts together. If there was any real basis for what Manny had told her, she could come to only one possible conclusion.\u003c/p\u003e\n\u003cp\u003e\"My God, Manny. Are you sure? Because if you are, chances are Frik is responsible for Arthur\u0027s death.\"\u003c/p\u003e\n\u003cp\u003e\"How so?\"\u003c/p\u003e\n\u003cp\u003e\"Arthur had a piece of the artifact. He always kept it on him. Frik could have seen it and put out a contract - \"\u003c/p\u003e\n\u003cp\u003e\"Yes, but you told me you saw the piece with Arthur\u0027s body.\"\u003c/p\u003e\n\u003cp\u003e\"I did. It was covered with blood and - \"\u003c/p\u003e\n\u003cp\u003e\"So you say maybe the killer - \"\u003c/p\u003e\n\u003cp\u003e\"Missed it. Yes. It\u0027s possible, what with the police and so many people.\" She stopped. \"God, Manny. If it\u0027s true and I don\u0027t get to Simon - \"\u003c/p\u003e\n\u003cp\u003eManny pointed at a speedboat. \"That\u0027s one of Frik\u0027s boats, the one Simon\u0027s been using.\" He maneuvered between a small fishing boat and the powerboat tied up to the village\u0027s makeshift pier. When he was up against the dock, he asked, \"Want me to stay here with you?\"\u003c/p\u003e\n\u003cp\u003e\"I can handle things.\"\u003c/p\u003e\n\u003cp\u003eWithout arguing, Manny tossed her duffel and medical bag onto the wooden dock, helped her out of the boat, and blew her a kiss. She watched him reverse into the channel, and waved him onward. Turning to face whatever awaited her in the village of San Gabriel, she trekked to the top of a minor incline.\u003c/p\u003e\n\u003cp\u003eIn the only bar in town, which was also its only hotel of sorts, Peta met the owner - a handsome, charming Venezuelan who introduced himself as Eduardo Blaine and kissed her hand with far too much enthusiasm and spittle for a rank stranger.\u003c/p\u003e\n\u003cp\u003e\"I am a friend of your Mr. Van Alman. He called to tell me you were on your way and told me to take care of you.\" He held on to her hand for more than a moment too long. \"I am proud to welcome you to my establishment. Your room is ready for you. It has a spectacular view.\"\u003c/p\u003e\n\u003cp\u003e\"If I could have that back.\" Peta withdrew her hand. She would like to have said that Frik was far from being her friend, but instead she asked after Simon.\u003c/p\u003e\n\u003cp\u003e\"He is in his room,\" Blaine said.\u003c/p\u003e\n\u003cp\u003e\"Please tell him I wish to see him. I\u0027ll wait at the bar.\"\u003c/p\u003e\n\u003cp\u003e\"He, um, he is - how shall I say it - not quite alone.\" Blaine winked blatantly, as if at a co-conspirator. \"He did not wish to be disturbed.\"\u003c/p\u003e\n\u003cp\u003ePeta chose not to argue. \"I\u0027m told he will be going out early tomorrow morning. I must see him before then.\"\u003c/p\u003e\n\u003cp\u003e\"If you will do me the honor of dining with me, I will promise to wake you before he leaves.\"\u003c/p\u003e\n\u003cp\u003eAnd then we arm-wrestle, Peta thought wryly. \"Dinner sounds fine,\" she said. \"But first I\u0027d like to take a shower.\"\u003c/p\u003e\n\u003cp\u003e\"Allow me to show you to your room.\" Blaine picked up her duffel.\u003c/p\u003e\n\u003cp\u003e\"How many rooms do you have?\"\u003c/p\u003e\n\u003cp\u003e\"Four.\"\u003c/p\u003e\n\u003cp\u003e\"In that case\" - she took her duffel from him - \"the key will do.\"\u003c/p\u003e\n\u003cp\u003e\"I will bring the key to you in the bar,\" he said. \"It is in the office. Please order what you wish, compliments of Eduardo Blaine.\"\u003c/p\u003e\n\u003cp\u003ePeta barely kept herself from laughing out loud. She went over to the bar, which proved not to be in Blaine\u0027s office, seated herself on a stool, and ordered and received a Carib and a pack of 555s. The pretty young barmaid in a floral dress and bare feet looked as if she was Blaine\u0027s daughter.\u003c/p\u003e\n\u003cp\u003eFor some reason, the thought of the Venezuelan having a daughter intrigued her. With a mixture of amusement and guilt, she realized that she was feeling horny about the man. His Antonio Banderas looks and overly florid South American manners were not usually the sorts of things that attracted her. She remembered the sight of Arthur splattered across the bathroom at Danny\u0027s, and her guilt won out.\u003c/p\u003e\n\u003cp\u003eDeciding that this would be a good time to check on McKendry, Peta retrieved her cell phone from her handbag and dialed the hospital. She could hear a faint voice at the other end, but static on the line made it impossible to converse.\u003c/p\u003e\n\u003cp\u003e\"Is there a telephone around here? I\u0027ll use a credit card.\" Peta lit her first 555 in three years, savored the familiar flavor, made herself the same old promise.\u003c/p\u003e\n\u003cp\u003eThe girl took an old-fashioned rotary dial phone from under the counter and pushed it shyly toward Peta, who lifted the receiver.\u003c/p\u003e\n\u003cp\u003e\"...care of her.\" Frik\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"That won\u0027t be a chore.\" Blaine. \"She is most beautiful.\"\u003c/p\u003e\n\u003cp\u003ePeta covered the mouthpiece with her hand and blessed the inefficiencies of a telephone system which so consistently crossed wires that the idea of privacy was a joke. Even if the two men had heard background noises, they would take no notice of them.\u003c/p\u003e\n\u003cp\u003e\"I have given you my word that I will take care of her,\" the Venezuelan continued.\u003c/p\u003e\n\u003cp\u003e\"You do that, Mr. Blaine,\" Frik said. \"Or I will be forced to take care of you.\"\u003c/p\u003e\n\u003cp\u003eAs the line went dead, Peta softly replaced the receiver in its cradle.\u003c/p\u003e\n\u003cp\u003eTwo possibilities raced through her mind: either Frik wanted her protected, or Frik wanted her eliminated. All she had to do was make sure that she stayed alive until she could figure out which one it was. \u003c/p\u003e","sourceLink":"https://allnovel.net/artifact/page-23.html","bookId":1691,"creation":"Oct 5, 2019 9:54:38 AM","modification":"Oct 5, 2019 9:54:38 AM"}
