{"id":64465,"no":33,"title":"Page 33","content":"\u003cp\u003eBy the time the grenades exploded, Manny and McKendry had reached the third hut. They saw two blond men on separate cots scrambling awake, shouting, looking at each other. In an instant, both of them had grabbed pistols from beneath their beds and lurched up, swinging the weapons to point at the door.\u003c/p\u003e\n\u003cp\u003eMcKendry was determined to make an arrest, as if to prove to himself that he was in control. He even shot the first round, hitting one of the terrorists squarely in the right shoulder. The crack of his weapon fire sounded loud but was rapidly overwhelmed by the racket in the encampment.\u003c/p\u003e\n\u003cp\u003eThe second blond man pulled up his own pistol as Manny charged forward and threw a pillow at the man\u0027s arm. The terrorist\u0027s shot was wild; the bullet splintered one of the wooden poles beside Manny. Even though there was no longer any need for silence, Manny chose to pull a sap from his belt. He pushed the terrorist\u0027s gun arm away and swung the sand-filled pouch hard into the man\u0027s skull. His head snapped back and he collapsed onto the bed he had only partially gotten up from.\u003c/p\u003e\n\u003cp\u003eMcKendry bent over the first downed terrorist, pleased to see he was still alive and conscious, though barely.\u003c/p\u003e\n\u003cp\u003e\"Selene Trujold. Where is she?\"\u003c/p\u003e\n\u003cp\u003eThe man coughed and bled. His eyes sharpened with awareness enough to gasp, \"Fuck you!\"\u003c/p\u003e\n\u003cp\u003eMcKendry stood up, his face grim. \"Bleed to death, then.\"\u003c/p\u003e\n\u003cp\u003eOutside he could hear more weapon fire accompanying the crackling flames from the explosion. He didn\u0027t mind that Ray had blown up the explosives depot, leaving Green Impact without its stockpile. Now was the time for open action.\u003c/p\u003e\n\u003cp\u003eThe flames from the explosion lit up the area, casting witches\u0027 shadows and creating more uncertainty than illumination. He could see that the fire had spread to the central mess hall.\u003c/p\u003e\n\u003cp\u003eA moment later, the propane tanks exploded in a cough of feathery blue fire that bowled over two of the Green Impact terrorists and splintered the trees within fifteen feet into kindling.\u003c/p\u003e\n\u003cp\u003eAt ground level, Ray and Peta and the two mercenaries were rounding up some of the Green Impact terrorists; a few others hid in the underbrush and opened fire.\u003c/p\u003e\n\u003cp\u003eMcKendry didn\u0027t care about them. He was interested in only one person, and he was determined to get her - for Keene, and for himself. He could save her a lot of trouble if she capitulated. A whole lot.\u003c/p\u003e\n\u003cp\u003ePushing his way to the open deck of the palafitos that overlooked the calm canos, McKendry shoved aside a small table where two unwashed coffee cups sat.\u003c/p\u003e\n\u003cp\u003eBelow, he saw someone climbing into a boat. He could not tell for sure in the darkness, but his every instinct told him that it was Selene Trujold. Without calling for others to join her, she slid out into the waterway, moving with spare motions.\u003c/p\u003e\n\u003cp\u003eIn a blaze of anger at Jose for disobeying instructions, McKendry raised his rifle, sighting in. He would deal with the Venezuelan later. The lazy slug was probably curled up in the bottom of one of the boats he\u0027d been sent to disable. Meanwhile, he could not let the woman get away, not after what she had done to Joshua.\u003c/p\u003e\n\u003cp\u003eAn expert marksman, he aimed, centering the crosshairs on Selene\u0027s head as she entered a shaft of starlight. Through his sight, he watched her head turn to the right, toward the fringe of the jungle. She raised her arm, and he could see the pistol in her hand.\u003c/p\u003e\n\u003cp\u003eAllowing himself no distractions, he focused on her temple and squeezed the trigger -\u0026nbsp;\u0026nbsp;\"No!\"\u003c/p\u003e\n\u003cp\u003eManny Sheppard slapped the barrel of McKendry\u0027s rifle aside as the gun went off. Looking downstream, he saw Selene drop, facedown, into the bottom of the boat, which was drifting slowly downriver.\u003c/p\u003e\n\u003cp\u003eHe turned to glare at Manny.\u003c/p\u003e\n\u003cp\u003e\"We need her alive, remember,\" Manny said. His voice was very quiet. \"She has to tell us where Frik\u0027s artifact is.\"\u003c/p\u003e\n\u003cp\u003eMcKendry remembered that Manny had been a friend of her father\u0027s, and that he had known Selene since she was a little girl. He remembered, too, that he was not a killer. Not like this. Shooting someone\u0026nbsp;\u0026nbsp;- man or woman - in the back in cold blood.\u003c/p\u003e\n\u003cp\u003eHe looked back at the boat, which continued to drift. As he watched it, he saw a bloodied hand emerge from the inside and grasp the edge.\u003c/p\u003e\n\u003cp\u003eHe shoved past Manny Sheppard. Ignoring the ladder, he leapt from the hut to the floor of the jungle and wove his way through the underbrush. He knocked branches away and splashed through shallow rivulets.\u003c/p\u003e\n\u003cp\u003eHis headlong rush came to an abrupt halt when he tripped over Jose\u0027s still-warm body. The Venezuelan had taken a bullet straight through the forehead. His knife, small protection against a pistol no matter how accurately thrown, was nowhere to be seen.\u003c/p\u003e\n\u003cp\u003eHelluva marksman, McKendry thought, remembering Selene\u0027s raised arm. He stood still and stared into the impenetrable darkness, in the direction her boat had taken.\u003c/p\u003e\n\u003cp\u003eBehind him in the camp, a few scattered shots rang out before the gunfire ceased completely.\u003c/p\u003e\n\u003cp\u003eBy dawn, after searching through the canos and the islands in the vicinity of the camp, Manny found the bloodstained boat. It was still drifting downstream, but there was no sign of Selene Trujold, or her piece of the artifact. \u003c/p\u003e","sourceLink":"https://allnovel.net/artifact/page-33.html","bookId":1691,"creation":"Oct 5, 2019 9:54:38 AM","modification":"Oct 5, 2019 9:54:38 AM"}
