{"id":93554,"no":27,"title":"Page 27","content":"\u003cp\u003eCHAPTER 51\u003c/p\u003e\n\u003cp\u003eBliss\u003c/p\u003e\n\u003cp\u003e\"What did you say?\"\u003c/p\u003e\n\u003cp\u003eBliss was paying for her new dress when she was jolted by the Visitor\u0027s voice in her head.\u003c/p\u003e\n\u003cp\u003e\"Do you take Amex?\" she asked the salesgirl sitting at the desk. She tried to maintain her composure while inside the Visitor\u0027s excitement made her head ache.\u003c/p\u003e\n\u003cp\u003e\"Allegra is awake? Allegra is alive?\"\u003c/p\u003e\n\u003cp\u003e\"Why does this bring joy to you?\" Bliss asked. \"Why would you care? She\u0027s just a coma patient in a hospital room.\"\u003c/p\u003e\n\u003cp\u003e\"Did you say something?\" the salesgirl asked, shoving the purple dress into a plain brown bag and stapling the top with the receipt.\u003c/p\u003e\n\u003cp\u003e\"No. Sorry.\" Bliss grabbed her bag and headed out of the room. She bumped into a few girls walking in.\u003c/p\u003e\n\u003cp\u003e\"Do they still have good stuff, or is it all picked over?\" one of them asked.\u003c/p\u003e\n\u003cp\u003e\"Uh... I don\u0027t know,\" Bliss muttered, pushing through. She knew they would think her incredibly rude, but it was as if her head were going to crack open.\u003c/p\u003e\n\u003cp\u003eBliss raised her hand to hail a cab. It was five in the afternoon, and all the taxis had their \"Off Duty\" signs on, a shift switch, and worse, it was starting to rain. New York weather. For a moment she missed Bobi Anne\u0027s Silver Shadow Rolls and the driver who always took her around. Finally Bliss caught a town car that had just dropped off some executive at the corner.\u003c/p\u003e\n\u003cp\u003e\"How much to 168th Street?\"\u003c/p\u003e\n\u003cp\u003e\"Twenty.\"\u003c/p\u003e\n\u003cp\u003eShe got inside the car, which felt warm and cozy after standing in the suddenly freezing rain.\u003c/p\u003e\n\u003cp\u003eShe could still feel the Visitor\u0027s excitement and agitation. Why did he care? What did he care about some stupid woman in a hospital?\u003c/p\u003e\n\u003cp\u003e\"Show some respect, the Visitor said coldly. Do not speak of your mother that way.\"\u003c/p\u003e\n\u003cp\u003e\"So it\u0027s true. I am her daughter. I am Allegra\u0027s daughter\", she thought. Her heart was pounding so loudly it hurt her chest a little bit.\u003c/p\u003e\n\u003cp\u003e\"Of course you are,\" the Visitor said in a reasonable voice that made Bliss feel even more nervous. \"We made you together. Now, I think it\u0027s time we said a proper hello to Allegra.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER 52\u003c/p\u003e\n\u003cp\u003eSchuyler\u003c/p\u003e\n\u003cp\u003eThe hospital bed was empty. Allegra Van Alen sat in a chair beside it. Schuyler\u0027s mother was the picture of elegance and restraint in a simple black dress and a string of pearls. She looked as if she had just come from the office or a charity board meeting, and not as if she had just spent the last fifteen years immobile in the same bed.\u003c/p\u003e\n\u003cp\u003eSchuyler shuffled into the room, hesitating. But once Allegra opened her arms, Schuyler hurled herself into them.\u003c/p\u003e\n\u003cp\u003e\"Mother.\" Allegra smelled like roses in the springtime; her skin was as soft as a baby\u0027s. Her presence made the room seem brighter, lighter somehow.\u003c/p\u003e\n\u003cp\u003eAllegra smoothed her daughter\u0027s hair.\u003c/p\u003e\n\u003cp\u003e\"Schuyler. You came home.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, I\u0027m so sorry,\" Schuyler sobbed. \"I\u0027m sorry for everything I said to you in Tokyo.\" She raised her tear-streaked face. \"But how?\"\u003c/p\u003e\n\u003cp\u003e\"It was time,\" Allegra said.\u003c/p\u003e\n\u003cp\u003eSchuyler broke away from the embrace. She couldn\u0027t believe what Allegra was saying.\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re telling me you could have woken at any time?\"\u003c/p\u003e\n\u003cp\u003e\"No, darling.\" Allegra shook her head. She motioned to Schuyler to pull up a chair next to hers. \"I felt the stirring deep in the glom.... Something has happened to the world.... I felt it. It would have been selfish for me to continue to stop taking the blood. To stay rooted in my isolation.\"\u003c/p\u003e\n\u003cp\u003eThen Schuyler saw what had happened as if she had been there: the comatose woman rising from her bed, tearing into the neck of an orderly who had come to change her sheets. The vampire princess awoken. Sleeping Beauty breaking through the glass.\u003c/p\u003e\n\u003cp\u003eSchuyler choked back a sob. \"Lawrence?\"\u003c/p\u003e\n\u003cp\u003e\"Is gone. I know. I spoke to him before he passed to the other side.\" Allegra nodded.\u003c/p\u003e\n\u003cp\u003e\"He told me about the Van Alen Legacy.\" Schuyler shrugged. \"Do you know what I\u0027m supposed to do?\"\u003c/p\u003e\n\u003cp\u003eIn answer, her mother pulled her closer and spoke in a voice only Schuyler could hear. \"Listen closely, my daughter. For what I am about to tell you can only be told in the shelter of the glom.\"\u003c/p\u003e\n\u003cp\u003e\"In the days when we called Paradise our home, the paths between the worlds were open. Angels moved freely between Earth, Heaven, and the underground. But after Lucifer\u0027s revolt, when the Dark Prince and his followers were cast out of Heaven, the way to Paradise was shut forever. But the seven Paths of the Dead remained open. In Rome, we still trusted Caligula then, did not know he was Lucifer behind the mask, did not know he had made it his mission to discover their locations on Earth. As emperor, he ordered a maze of tunnels built under the city of Lutetia. It was here that he discovered the first path.\u003c/p\u003e\n\u003cp\u003eIn his arrogance, he shared his secret with Michael. The Morning-star was never one for hiding his glory, which would cost him. Michael insisted they build a gate upon the path, and forge a key that Michael would hold in his trust. Lucifer agreed.\u003c/p\u003e\n\u003cp\u003eBut of course it was all a lie. Lucifer\u0027s transformation into a Croatan was complete by then. His betrayal of the Code of the Vampires created the crisis in Rome. He stole the key at the earliest opportunity, unleashing Abomination upon the world. But we would not know this until it was almost too late.\u003c/p\u003e\n\u003cp\u003eThe Blue Bloods hunted down the demons and their Silver Blood brethren. We turned Lutetia into a safe haven. Michael defeated Lucifer, taking him down the dead\u0027s path to the underworld and locking the gate behind him. Michael then ordered the Blue Bloods to find the remaining six paths, and to build gates upon them to keep the divisions between the worlds secure. The gatekeepers were called the Order of the Seven and included the seven original families of the Conclave.\u003c/p\u003e\n\u003cp\u003eThe gatekeepers agreed to scatter far and wide across the earth, hidden from one another. The knowledge of the gates would remain in the guardians\u0027 family, passed down through the generations.\u003c/p\u003e\n\u003cp\u003eThe Van Alen Legacy is just the latest name for the work that Lawrence and Cordelia began when they arrived in the New World. When young Blue Bloods were disappearing again, they suspected that what they had feared for centuries was true: that the gates were failing, and that somehow Lucifer and his Silver Bloods had survived the war in Rome and were planning their return to power.\u003c/p\u003e\n\u003cp\u003eLawrence made it his life\u0027s work to find each gate and guardian, to warn them of the danger. But Charles never believed in the Van Alen Legacy. He resented his father\u0027s doubt of the work he had forged centuries before. So Lawrence went into exile. And the Van Alen Legacy was forgotten.\"\u003c/p\u003e\n\u003cp\u003e\"But Lawrence was right\", Schuyler sent. \"They have returned.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, they have returned, and are desperately seeking to unlock the gates, to free the Devil trapped in Hell. This is why we deceived them so long ago. Charles was not the gatekeeper of Lutetia. The gate\u0027s earthly anchor had been moved. The true gatekeeper saw to that a long time ago.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know that? Are you the keeper?\"\u003c/p\u003e\n\u003cp\u003e\"No. Of the Van Alens, only Lawrence was a gatekeeper. Remember the Order of the Seven. One gate in each family.\"\u003c/p\u003e\n\u003cp\u003e\"Leviathan and Corcovado.\" Schuyler understood now.\u003c/p\u003e\n\u003cp\u003e\"Yes. Your grandfather was the keeper of the Gate of Vengeance, Leviathan\u0027s prison. With Lawrence\u0027s murder of an innocent, the gate opened and released Leviathan. But what the Silver Bloods did not know was that the Gate of Vengeance was a solom bicallis . It can only be used once, and in one direction. Once Leviathan was freed, the path was closed to all.\u003c/p\u003e\n\u003cp\u003eThe Silver Bloods will not rest. They will seek out the guardians and the gates, until all the Paths of the Dead are free once more.\u003c/p\u003e\n\u003cp\u003eSchuyler, it is up to you to find the remaining members of the Order, alert them of the danger, and keep the gates secure. As long as the gates hold, Lucifer cannot cross from the underworld to this world. That is the Van Alen Legacy, and now it is yours. That is the Van Alen Legacy, and now it is yours.\"\u003c/p\u003e\n\u003cp\u003e\"You mean, it is ours.\"\u003c/p\u003e\n\u003cp\u003e\"Alas, that is not to be. I cannot help you in your quest. I have to find Charles. He was lost, somewhere between worlds, when the Silver Bloods let loose that subvertio. Our destiny is intertwined. He needs me more than ever now. There is something broken in the universe that only we can fix together... which is part of your journey as well.\"\u003c/p\u003e\n\u003cp\u003e\"Mother, you are leaving me. Again. Now that I need you the most,\" Schuyler cried, shocked at her mother\u0027s news and the enormity of the responsibility that lay before her. Find the gates? Find the guardians? Save the world? How was she supposed to do that alone?\u003c/p\u003e\n\u003cp\u003e\"I am not leaving. I am always with you,\" Allegra said, holding Schuyler in her arms. \"My daughter, I am in you. Never forget that.\"\u003c/p\u003e\n\u003cp\u003e\"So that was really you, then, with the sword? In my dreams?\" Schuyler asked.\u003c/p\u003e\n\u003cp\u003e\"Of course.\" Allegra smiled gently, then stood up. \"Now listen closely. Leviathan has shown his hand in Paris. We know he is looking to open the gate formerly located in Lutetia. The Gate of Time. Of this I am sure, for I was there when Michael and I made him keeper. It was guarded by Tiberius Gemellus. Find him. Secure the gate.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-van-alen-legacy-blue-bloods-4/page-27.html","bookId":2122,"creation":"Oct 5, 2019 6:02:52 PM","modification":"Oct 5, 2019 6:02:52 PM"}
