{"id":93561,"no":34,"title":"Page 34","content":"\u003cp\u003eCHAPTER 65\u003c/p\u003e\n\u003cp\u003eBliss\u003c/p\u003e\n\u003cp\u003eThe Visitor had returned. He sounded manic, hysterical, barking orders that she did not understand. Bliss was groggy. The demon had knocked her out when she\u0027d tried to help Schuyler, and now her head was throbbing.\u003c/p\u003e\n\u003cp\u003e\"WAKE UP, CHILD! GO! THIS IS YOUR CHANCE!\"\u003c/p\u003e\n\u003cp\u003eWhat... what did he want? What was happening? She looked around. In the middle of the aisle, Schuyler was holding Jack in her arms, like a Pieta. She stumbled forward, still holding her bouquet. What was Schuyler doing with Jack Force? Jack was supposed to be bonded. But no, Schuyler had never followed any of the rules. The Code of the Vampires had never applied to her. What had the Visitor called her? Selfish. Unremarkable. A false friend.\u003c/p\u003e\n\u003cp\u003eBliss felt so lost and alone. Maybe the Visitor was right.\u003c/p\u003e\n\u003cp\u003eMaybe he was the only person she could really trust. Her mother had not even bothered to wait for her, to see her, to speak to the daughter who needed her so badly. As for Dylan, well, maybe he was false too, had he really disappeared? Was he really being held? He had been able to break through before, what was stopping him now?\u003c/p\u003e\n\u003cp\u003eThere was nothing to stop her.\u003c/p\u003e\n\u003cp\u003eMaybe the Visitor was right. She couldn\u0027t think anymore; she couldn\u0027t see straight. All she knew was that she was so tired of listening to the voice in her head. She was so very tired of fighting.\u003c/p\u003e\n\u003cp\u003e\"Do it!\"\u003c/p\u003e\n\u003cp\u003e\"DO IT!\"\u003c/p\u003e\n\u003cp\u003e\"KILL HER!\"\u003c/p\u003e\n\u003cp\u003eSo very, very tired of resisting and being good... And maybe if she did what he wanted, he would stop torturing her. Maybe if she did what he wanted, she would finally have peace....\u003c/p\u003e\n\u003cp\u003eBliss walked over to where Schuyler was sitting and removed the shard of glass from her bouquet.\u003c/p\u003e\n\u003cp\u003eCHAPTER 66\u003c/p\u003e\n\u003cp\u003eSchuyler\u003c/p\u003e\n\u003cp\u003eYou\u0027re going to be all right,\" Schuyler murmured. Jack lay asleep in her arms. She knew he would live. She could feel it. Her blood would save him. It was the only thing that would save him. It would bring life back to his body and fight the black fire from Leviathan\u0027s blade.\u003c/p\u003e\n\u003cp\u003eShe looked around the empty church. Mimi had not yet returned. Her former nemesis had looked broken and lost. Something had happened back there, down in the glom.\u003c/p\u003e\n\u003cp\u003eSchuyler hugged Jack tighter, but then heard footsteps. Someone was headed her way. Someone was standing, looming in front of her.\u003c/p\u003e\n\u003cp\u003e\"Bliss, what are you doing?\" Schuyler cried.\u003c/p\u003e\n\u003cp\u003eHer friend looked like a witch, with her wild red hair and her torn black dress, holding something shiny and ominous in her hand.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry, Schuyler. I\u0027m so sorry,\" Bliss sobbed.\u003c/p\u003e\n\u003cp\u003eSchuyler moved Jack so that he would be safe. She stood up and covered him protectively.\u003c/p\u003e\n\u003cp\u003e\"Bliss, put down the knife.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t... I have to,\" Bliss whimpered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry but I have to.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean? What\u0027s going on? What\u0027s happened to you?\"\u003c/p\u003e\n\u003cp\u003e\"My father... he\u0027s in my head. He tells me things. He says I have to do this or I\u0027ll never see Dylan again.\"\u003c/p\u003e\n\u003cp\u003e\"Your father?\" Schuyler asked.\u003c/p\u003e\n\u003cp\u003eBut she already knew the answer to her question. What had Cordelia once told her? We fear one of our oldest families is harboring the Dark Prince himself. We don\u0027t know how and we don\u0027t know who, but we suspect the betrayal is at the highest level of the Conclave.\u003c/p\u003e\n\u003cp\u003eBliss Llewellyn was the Silver Blood all along. Bliss carried Lucifer in her. Then Schuyler remembered something Lawrence had told her as well: Your sister will be our death. Bliss was her hidden sister. Bliss was born to kill her.\u003c/p\u003e\n\u003cp\u003e\"No, Bliss, you don\u0027t have to... I can help you. We can do something about it. You don\u0027t have to do what he tells you.\"\u003c/p\u003e\n\u003cp\u003eBliss did not respond. Instead she lunged at Schuyler, who ducked just in time. But Bliss caught the hem of Schuyler\u0027s skirt and dragged her down. Schuyler could feel the blade start to inch its way toward her chest. This was it... Jack had risked his life for her and she for him... but it was all for nothing. How could she have not known?\u003c/p\u003e\n\u003cp\u003e\"Bliss! Please!\" Schuyler sobbed. \"Don\u0027t?\"\u003c/p\u003e\n\u003cp\u003eBliss held the blade above Schuyler\u0027s heart, an inch from her chest, but at the last moment, she hesitated.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry. I\u0027m so sorry!\" Bliss cried as she released her friend, the tears streaming down her face.\u003c/p\u003e\n\u003cp\u003e\"Bliss, stop, what are you doing?\" Schuyler screamed. \"No!\" \"\u003c/p\u003e\n\u003cp\u003eWith a mighty thrust, Bliss plunged the archangel\u0027s blade deep into her own heart, breaking the glass into a million pieces, and ending her life. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-van-alen-legacy-blue-bloods-4/page-34.html","bookId":2122,"creation":"Oct 5, 2019 6:02:52 PM","modification":"Oct 5, 2019 6:02:52 PM"}
