{"id":30648,"no":17,"title":"CHAPTER XVII—THE MYSTERY OF “THE GROVE”","content":"That afternoon Adam decided to do a little exploring.\u0026nbsp; As he passed through the wood outside the gate of Diana’s Grove, he thought he saw the African’s face for an instant.\u0026nbsp; So he went deeper into the undergrowth, and followed along parallel to the avenue to the house.\u0026nbsp; He was glad that there was no workman or servant about, for he did not care that any of Lady Arabella’s people should find him wandering about her grounds.\u0026nbsp; Taking advantage of the denseness of the trees, he came close to the house and skirted round it.\u0026nbsp; He was repaid for his trouble, for on the far side of the house, close to where the rocky frontage of the cliff fell away, he saw Oolanga crouched behind the irregular trunk of a great oak.\u0026nbsp; The man was so intent on watching someone, or something, that he did not guard against being himself watched.\u0026nbsp; This suited Adam, for he could thus make scrutiny at will.\n\u003cbr\u003e \n\u003cbr\u003e The thick wood, though the trees were mostly of small girth, threw a heavy shadow, so that the steep declension, in front of which grew the tree behind which the African lurked, was almost in darkness.\u0026nbsp; Adam drew as close as he could, and was amazed to see a patch of light on the ground before him; when he realised what it was, he was determined, more than ever to follow on his quest.\u0026nbsp; The nigger had a dark lantern in his hand, and was throwing the light down the steep incline.\u0026nbsp; The glare showed a series of stone steps, which ended in a low-lying heavy iron door fixed against the side of the house.\u0026nbsp; All the strange things he had heard from Sir Nathaniel, and all those, little and big, which he had himself noticed, crowded into his mind in a chaotic way.\u0026nbsp; Instinctively he took refuge behind a thick oak stem, and set himself down, to watch what might occur.\n\u003cbr\u003e \n\u003cbr\u003e After a short time it became apparent that the African was trying to find out what was behind the heavy door.\u0026nbsp; There was no way of looking in, for the door fitted tight into the massive stone slabs.\u0026nbsp; The only opportunity for the entrance of light was through a small hole between the great stones above the door.\u0026nbsp; This hole was too high up to look through from the ground level.\u0026nbsp; Oolanga, having tried standing tiptoe on the highest point near, and holding the lantern as high as he could, threw the light round the edges of the door to see if he could find anywhere a hole or a flaw in the metal through which he could obtain a glimpse.\u0026nbsp; Foiled in this, he brought from the shrubbery a plank, which he leant against the top of the door and then climbed up with great dexterity.\u0026nbsp; This did not bring him near enough to the window-hole to look in, or even to throw the light of the lantern through it, so he climbed down and carried the plank back to the place from which he had got it.\u0026nbsp; Then he concealed himself near the iron door and waited, manifestly with the intent of remaining there till someone came near.\u0026nbsp; Presently Lady Arabella, moving noiselessly through the shade, approached the door.\u0026nbsp; When he saw her close enough to touch it, Oolanga stepped forward from his concealment, and spoke in a whisper, which through the gloom sounded like a hiss.\n\u003cbr\u003e \n\u003cbr\u003e “I want to see you, missy—soon and secret.”\n\u003cbr\u003e \n\u003cbr\u003e “What do you want?”\n\u003cbr\u003e \n\u003cbr\u003e “You know well, missy; I told you already.”\n\u003cbr\u003e \n\u003cbr\u003e She turned on him with blazing eyes, the green tint in them glowing like emeralds.\n\u003cbr\u003e \n\u003cbr\u003e “Come, none of that.\u0026nbsp; If there is anything sensible which you wish to say to me, you can see me here, just where we are, at seven o’clock.”\n\u003cbr\u003e \n\u003cbr\u003e He made no reply in words, but, putting the backs of his hands together, bent lower and lower till his forehead touched the earth.\u0026nbsp; Then he rose and went slowly away.\n\u003cbr\u003e \n\u003cbr\u003e Adam Salton, from his hiding-place, saw and wondered.\u0026nbsp; In a few minutes he moved from his place and went home to Lesser Hill, fully determined that seven o’clock would find him in some hidden place behind Diana’s Grove.\n\u003cbr\u003e \n\u003cbr\u003e At a little before seven Adam stole softly out of the house and took the back-way to the rear of Diana’s Grove.\u0026nbsp; The place seemed silent and deserted, so he took the opportunity of concealing himself near the spot whence he had seen Oolanga trying to investigate whatever was concealed behind the iron door.\u0026nbsp; He waited, perfectly still, and at last saw a gleam of white passing soundlessly through the undergrowth.\u0026nbsp; He was not surprised when he recognised the colour of Lady Arabella’s dress.\u0026nbsp; She came close and waited, with her face to the iron door.\u0026nbsp; From some place of concealment near at hand Oolanga appeared, and came close to her.\u0026nbsp; Adam noticed, with surprised amusement, that over his shoulder was the box with the mongoose.\u0026nbsp; Of course the African did not know that he was seen by anyone, least of all by the man whose property he had with him.\n\u003cbr\u003e \n\u003cbr\u003e Silent-footed as he was, Lady Arabella heard him coming, and turned to meet him.\u0026nbsp; It was somewhat hard to see in the gloom, for, as usual, he was all in black, only his collar and cuffs showing white.\u0026nbsp; Lady Arabella opened the conversation which ensued between the two.\n\u003cbr\u003e \n\u003cbr\u003e “What do you want?\u0026nbsp; To rob me, or murder me?”\n\u003cbr\u003e \n\u003cbr\u003e “No, to lub you!”\n\u003cbr\u003e \n\u003cbr\u003e This frightened her a little, and she tried to change the tone.\n\u003cbr\u003e \n\u003cbr\u003e “Is that a coffin you have with you?\u0026nbsp; If so, you are wasting your time.\u0026nbsp; It would not hold me.”\n\u003cbr\u003e \n\u003cbr\u003e When a nigger suspects he is being laughed at, all the ferocity of his nature comes to the front; and this man was of the lowest kind.\n\u003cbr\u003e \n\u003cbr\u003e “Dis ain’t no coffin for nobody.\u0026nbsp; Dis box is for you.\u0026nbsp; Somefin you lub.\u0026nbsp; Me give him to you!”\n\u003cbr\u003e \n\u003cbr\u003e Still anxious to keep off the subject of affection, on which she believed him to have become crazed, she made another effort to keep his mind elsewhere.\n\u003cbr\u003e \n\u003cbr\u003e “Is this why you want to see me?”\u0026nbsp; He nodded.\u0026nbsp; “Then come round to the other door.\u0026nbsp; But be quiet.\u0026nbsp; I have no desire to be seen so close to my own house in conversation with a—a—a nigger like you!”\n\u003cbr\u003e \n\u003cbr\u003e She had chosen the word deliberately.\u0026nbsp; She wished to meet his passion with another kind.\u0026nbsp; Such would, at all events, help to keep him quiet.\u0026nbsp; In the deep gloom she could not see the anger which suffused his face.\u0026nbsp; Rolling eyeballs and grinding teeth are, however, sufficient signs of anger to be decipherable in the dark.\u0026nbsp; She moved round the corner of the house to her right.\u0026nbsp; Oolanga was following her, when she stopped him by raising her hand.\n\u003cbr\u003e \n\u003cbr\u003e “No, not that door,” she said; “that is not for niggers.\u0026nbsp; The other door will do well enough for you!”\n\u003cbr\u003e \n\u003cbr\u003e Lady Arabella took in her hand a small key which hung at the end of her watch-chain, and moved to a small door, low down, round the corner, and a little downhill from the edge of the Brow.\u0026nbsp; Oolanga, in obedience to her gesture, went back to the iron door.\u0026nbsp; Adam looked carefully at the mongoose box as the African went by, and was glad to see that it was intact.\u0026nbsp; Unconsciously, as he looked, he fingered the key that was in his waistcoat pocket.\u0026nbsp; When Oolanga was out of sight, Adam hurried after Lady Arabella.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3244/88912.html","bookId":643,"creation":"Aug 5, 2019 2:28:42 AM","modification":"Aug 5, 2019 2:28:42 AM"}
