{"id":30649,"no":18,"title":"CHAPTER XVIII—EXIT OOLANGA","content":"The woman turned sharply as Adam touched her shoulder.\n\u003cbr\u003e \n\u003cbr\u003e “One moment whilst we are alone.\u0026nbsp; You had better not trust that nigger!” he whispered.\n\u003cbr\u003e \n\u003cbr\u003e Her answer was crisp and concise:\n\u003cbr\u003e \n\u003cbr\u003e “I don’t.”\n\u003cbr\u003e \n\u003cbr\u003e “Forewarned is forearmed.\u0026nbsp; Tell me if you will—it is for your own protection.\u0026nbsp; Why do you mistrust him?”\n\u003cbr\u003e \n\u003cbr\u003e “My friend, you have no idea of that man’s impudence.\u0026nbsp; Would you believe that he wants me to marry him?”\n\u003cbr\u003e \n\u003cbr\u003e “No!” said Adam incredulously, amused in spite of himself.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, and wanted to bribe me to do it by sharing a chest of treasure—at least, he thought it was—stolen from Mr. Caswall.\u0026nbsp; Why do you distrust him, Mr. Salton?”\n\u003cbr\u003e \n\u003cbr\u003e “Did you notice that box he had slung on his shoulder?\u0026nbsp; That belongs to me.\u0026nbsp; I left it in the gun-room when I went to lunch.\u0026nbsp; He must have crept in and stolen it.\u0026nbsp; Doubtless he thinks that it, too, is full of treasure.”\n\u003cbr\u003e \n\u003cbr\u003e “He does!”\n\u003cbr\u003e \n\u003cbr\u003e “How on earth do you know?” asked Adam.\n\u003cbr\u003e \n\u003cbr\u003e “A little while ago he offered to give it to me—another bribe to accept him.\u0026nbsp; Faugh!\u0026nbsp; I am ashamed to tell you such a thing.\u0026nbsp; The beast!”\n\u003cbr\u003e \n\u003cbr\u003e Whilst they had been speaking, she had opened the door, a narrow iron one, well hung, for it opened easily and closed tightly without any creaking or sound of any kind.\u0026nbsp; Within all was dark; but she entered as freely and with as little misgiving or restraint as if it had been broad daylight.\u0026nbsp; For Adam, there was just sufficient green light from somewhere for him to see that there was a broad flight of heavy stone steps leading upward; but Lady Arabella, after shutting the door behind her, when it closed tightly without a clang, tripped up the steps lightly and swiftly.\u0026nbsp; For an instant all was dark, but there came again the faint green light which enabled him to see the outlines of things.\u0026nbsp; Another iron door, narrow like the first and fairly high, led into another large room, the walls of which were of massive stones, so closely joined together as to exhibit only one smooth surface.\u0026nbsp; This presented the appearance of having at one time been polished.\u0026nbsp; On the far side, also smooth like the walls, was the reverse of a wide, but not high, iron door.\u0026nbsp; Here there was a little more light, for the high-up aperture over the door opened to the air.\n\u003cbr\u003e \n\u003cbr\u003e Lady Arabella took from her girdle another small key, which she inserted in a keyhole in the centre of a massive lock.\u0026nbsp; The great bolt seemed wonderfully hung, for the moment the small key was turned, the bolts of the great lock moved noiselessly and the iron doors swung open.\u0026nbsp; On the stone steps outside stood Oolanga, with the mongoose box slung over his shoulder.\u0026nbsp; Lady Arabella stood a little on one side, and the African, accepting the movement as an invitation, entered in an obsequious way.\u0026nbsp; The moment, however, that he was inside, he gave a quick look around him.\n\u003cbr\u003e \n\u003cbr\u003e “Much death here—big death.\u0026nbsp; Many deaths.\u0026nbsp; Good, good!”\n\u003cbr\u003e \n\u003cbr\u003e He sniffed round as if he was enjoying the scent.\u0026nbsp; The matter and manner of his speech were so revolting that instinctively Adam’s hand wandered to his revolver, and, with his finger on the trigger, he rested satisfied that he was ready for any emergency.\n\u003cbr\u003e \n\u003cbr\u003e There was certainly opportunity for the nigger’s enjoyment, for the open well-hole was almost under his nose, sending up such a stench as almost made Adam sick, though Lady Arabella seemed not to mind it at all.\u0026nbsp; It was like nothing that Adam had ever met with.\u0026nbsp; He compared it with all the noxious experiences he had ever had—the drainage of war hospitals, of slaughter-houses, the refuse of dissecting rooms.\u0026nbsp; None of these was like it, though it had something of them all, with, added, the sourness of chemical waste and the poisonous effluvium of the bilge of a water-logged ship whereon a multitude of rats had been drowned.\n\u003cbr\u003e \n\u003cbr\u003e Then, quite unexpectedly, the negro noticed the presence of a third person—Adam Salton!\u0026nbsp; He pulled out a pistol and shot at him, happily missing.\u0026nbsp; Adam was himself usually a quick shot, but this time his mind had been on something else and he was not ready.\u0026nbsp; However, he was quick to carry out an intention, and he was not a coward.\u0026nbsp; In another moment both men were in grips.\u0026nbsp; Beside them was the dark well-hole, with that horrid effluvium stealing up from its mysterious depths.\n\u003cbr\u003e \n\u003cbr\u003e Adam and Oolanga both had pistols; Lady Arabella, who had not one, was probably the most ready of them all in the theory of shooting, but that being impossible, she made her effort in another way.\u0026nbsp; Gliding forward, she tried to seize the African; but he eluded her grasp, just missing, in doing so, falling into the mysterious hole.\u0026nbsp; As he swayed back to firm foothold, he turned his own gun on her and shot.\u0026nbsp; Instinctively Adam leaped at his assailant; clutching at each other, they tottered on the very brink.\n\u003cbr\u003e \n\u003cbr\u003e Lady Arabella’s anger, now fully awake, was all for Oolanga.\u0026nbsp; She moved towards him with her hands extended, and had just seized him when the catch of the locked box—due to some movement from within—flew open, and the king-cobra-killer flew at her with a venomous fury impossible to describe.\u0026nbsp; As it seized her throat, she caught hold of it, and, with a fury superior to its own, tore it in two just as if it had been a sheet of paper.\u0026nbsp; The strength used for such an act must have been terrific.\u0026nbsp; In an instant, it seemed to spout blood and entrails, and was hurled into the well-hole.\u0026nbsp; In another instant she had seized Oolanga, and with a swift rush had drawn him, her white arms encircling him, down with her into the gaping aperture.\n\u003cbr\u003e \n\u003cbr\u003e Adam saw a medley of green and red lights blaze in a whirling circle, and as it sank down into the well, a pair of blazing green eyes became fixed, sank lower and lower with frightful rapidity, and disappeared, throwing upward the green light which grew more and more vivid every moment.\u0026nbsp; As the light sank into the noisome depths, there came a shriek which chilled Adam’s blood—a prolonged agony of pain and terror which seemed to have no end.\n\u003cbr\u003e \n\u003cbr\u003e Adam Salton felt that he would never be able to free his mind from the memory of those dreadful moments.\u0026nbsp; The gloom which surrounded that horrible charnel pit, which seemed to go down to the very bowels of the earth, conveyed from far down the sights and sounds of the nethermost hell.\u0026nbsp; The ghastly fate of the African as he sank down to his terrible doom, his black face growing grey with terror, his white eyeballs, now like veined bloodstone, rolling in the helpless extremity of fear.\u0026nbsp; The mysterious green light was in itself a milieu of horror.\u0026nbsp; And through it all the awful cry came up from that fathomless pit, whose entrance was flooded with spots of fresh blood.\u0026nbsp; Even the death of the fearless little snake-killer—so fierce, so frightful, as if stained with a ferocity which told of no living force above earth, but only of the devils of the pit—was only an incident.\u0026nbsp; Adam was in a state of intellectual tumult, which had no parallel in his experience.\u0026nbsp; He tried to rush away from the horrible place; even the baleful green light, thrown up through the gloomy well-shaft, was dying away as its source sank deeper into the primeval ooze.\u0026nbsp; The darkness was closing in on him in overwhelming density—darkness in such a place and with such a memory of it!\n\u003cbr\u003e \n\u003cbr\u003e He made a wild rush forward—slipt on the steps in some sticky, acrid-smelling mass that felt and smelt like blood, and, falling forward, felt his way into the inner room, where the well-shaft was not.\n\u003cbr\u003e \n\u003cbr\u003e Then he rubbed his eyes in sheer amazement.\u0026nbsp; Up the stone steps from the narrow door by which he had entered, glided the white-clad figure of Lady Arabella, the only colour to be seen on her being blood-marks on her face and hands and throat.\u0026nbsp; Otherwise, she was calm and unruffled, as when earlier she stood aside for him to pass in through the narrow iron door.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3244/88913.html","bookId":643,"creation":"Aug 5, 2019 2:28:42 AM","modification":"Aug 5, 2019 2:28:42 AM"}
