{"id":30651,"no":20,"title":"CHAPTER XX—METABOLISM","content":"“Am I looking grave?” asked Sir Nathaniel inconsequently when he re-entered the room.\n\u003cbr\u003e \n\u003cbr\u003e “You certainly are, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “We little thought when first we met that we should be drawn into such a vortex.\u0026nbsp; Already we are mixed up in robbery, and probably murder, but—a thousand times worse than all the crimes in the calendar—in an affair of ghastly mystery which has no bottom and no end—with forces of the most unnerving kind, which had their origin in an age when the world was different from the world which we know.\u0026nbsp; We are going back to the origin of superstition—to an age when dragons tore each other in their slime.\u0026nbsp; We must fear nothing—no conclusion, however improbable, almost impossible it may be.\u0026nbsp; Life and death is hanging on our judgment, not only for ourselves, but for others whom we love.\u0026nbsp; Remember, I count on you as I hope you count on me.”\n\u003cbr\u003e \n\u003cbr\u003e “I do, with all confidence.”\n\u003cbr\u003e \n\u003cbr\u003e “Then,” said Sir Nathaniel, “let us think justly and boldly and fear nothing, however terrifying it may seem.\u0026nbsp; I suppose I am to take as exact in every detail your account of all the strange things which happened whilst you were in Diana’s Grove?”\n\u003cbr\u003e \n\u003cbr\u003e “So far as I know, yes.\u0026nbsp; Of course I may be mistaken in recollection of some detail or another, but I am certain that in the main what I have said is correct.”\n\u003cbr\u003e \n\u003cbr\u003e “You feel sure that you saw Lady Arabella seize the negro round the neck, and drag him down with her into the hole?”\n\u003cbr\u003e \n\u003cbr\u003e “Absolutely certain, sir, otherwise I should have gone to her assistance.”\n\u003cbr\u003e \n\u003cbr\u003e “We have, then, an account of what happened from an eye-witness whom we trust—that is yourself.\u0026nbsp; We have also another account, written by Lady Arabella under her own hand.\u0026nbsp; These two accounts do not agree.\u0026nbsp; Therefore we must take it that one of the two is lying.”\n\u003cbr\u003e \n\u003cbr\u003e “Apparently, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “And that Lady Arabella is the liar!”\n\u003cbr\u003e \n\u003cbr\u003e “Apparently—as I am not.”\n\u003cbr\u003e \n\u003cbr\u003e “We must, therefore, try to find a reason for her lying.\u0026nbsp; She has nothing to fear from Oolanga, who is dead.\u0026nbsp; Therefore the only reason which could actuate her would be to convince someone else that she was blameless.\u0026nbsp; This ‘someone’ could not be you, for you had the evidence of your own eyes.\u0026nbsp; There was no one else present; therefore it must have been an absent person.”\n\u003cbr\u003e \n\u003cbr\u003e “That seems beyond dispute, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “There is only one other person whose good opinion she could wish to keep—Edgar Caswall.\u0026nbsp; He is the only one who fills the bill.\u0026nbsp; Her lies point to other things besides the death of the African.\u0026nbsp; She evidently wanted it to be accepted that his falling into the well was his own act.\u0026nbsp; I cannot suppose that she expected to convince you, the eye-witness; but if she wished later on to spread the story, it was wise of her to try to get your acceptance of it.”\n\u003cbr\u003e \n\u003cbr\u003e “That is so!”\n\u003cbr\u003e \n\u003cbr\u003e “Then there were other matters of untruth.\u0026nbsp; That, for instance, of the ermine collar embroidered with emeralds.\u0026nbsp; If an understandable reason be required for this, it would be to draw attention away from the green lights which were seen in the room, and especially in the well-hole.\u0026nbsp; Any unprejudiced person would accept the green lights to be the eyes of a great snake, such as tradition pointed to living in the well-hole.\u0026nbsp; In fine, therefore, Lady Arabella wanted the general belief to be that there was no snake of the kind in Diana’s Grove.\u0026nbsp; For my own part, I don’t believe in a partial liar—this art does not deal in veneer; a liar is a liar right through.\u0026nbsp; Self-interest may prompt falsity of the tongue; but if one prove to be a liar, nothing that he says can ever be believed.\u0026nbsp; This leads us to the conclusion that because she said or inferred that there was no snake, we should look for one—and expect to find it, too.\n\u003cbr\u003e \n\u003cbr\u003e “Now let me digress.\u0026nbsp; I live, and have for many years lived, in Derbyshire, a county more celebrated for its caves than any other county in England.\u0026nbsp; I have been through them all, and am familiar with every turn of them; as also with other great caves in Kentucky, in France, in Germany, and a host of other places—in many of these are tremendously deep caves of narrow aperture, which are valued by intrepid explorers, who descend narrow gullets of abysmal depth—and sometimes never return.\u0026nbsp; In many of the caverns in the Peak I am convinced that some of the smaller passages were used in primeval times as the lairs of some of the great serpents of legend and tradition.\u0026nbsp; It may have been that such caverns were formed in the usual geologic way—bubbles or flaws in the earth’s crust—which were later used by the monsters of the period of the young world.\u0026nbsp; It may have been, of course, that some of them were worn originally by water; but in time they all found a use when suitable for living monsters.\n\u003cbr\u003e \n\u003cbr\u003e “This brings us to another point, more difficult to accept and understand than any other requiring belief in a base not usually accepted, or indeed entered on—whether such abnormal growths could have ever changed in their nature.\u0026nbsp; Some day the study of metabolism may progress so far as to enable us to accept structural changes proceeding from an intellectual or moral base.\u0026nbsp; We may lean towards a belief that great animal strength may be a sound base for changes of all sorts.\u0026nbsp; If this be so, what could be a more fitting subject than primeval monsters whose strength was such as to allow a survival of thousands of years?\u0026nbsp; We do not know yet if brain can increase and develop independently of other parts of the living structure.\n\u003cbr\u003e \n\u003cbr\u003e “After all, the mediaeval belief in the Philosopher’s Stone which could transmute metals, has its counterpart in the accepted theory of metabolism which changes living tissue.\u0026nbsp; In an age of investigation like our own, when we are returning to science as the base of wonders—almost of miracles—we should be slow to refuse to accept facts, however impossible they may seem to be.\n\u003cbr\u003e \n\u003cbr\u003e “Let us suppose a monster of the early days of the world—a dragon of the prime—of vast age running into thousands of years, to whom had been conveyed in some way—it matters not—a brain just sufficient for the beginning of growth.\u0026nbsp; Suppose the monster to be of incalculable size and of a strength quite abnormal—a veritable incarnation of animal strength.\u0026nbsp; Suppose this animal is allowed to remain in one place, thus being removed from accidents of interrupted development; might not, would not this creature, in process of time—ages, if necessary—have that rudimentary intelligence developed?\u0026nbsp; There is no impossibility in this; it is only the natural process of evolution.\u0026nbsp; In the beginning, the instincts of animals are confined to alimentation, self-protection, and the multiplication of their species.\u0026nbsp; As time goes on and the needs of life become more complex, power follows need.\u0026nbsp; We have been long accustomed to consider growth as applied almost exclusively to size in its various aspects.\u0026nbsp; But Nature, who has no doctrinaire ideas, may equally apply it to concentration.\u0026nbsp; A developing thing may expand in any given way or form.\u0026nbsp; Now, it is a scientific law that increase implies gain and loss of various kinds; what a thing gains in one direction it may lose in another.\u0026nbsp; May it not be that Mother Nature may deliberately encourage decrease as well as increase—that it may be an axiom that what is gained in concentration is lost in size?\u0026nbsp; Take, for instance, monsters that tradition has accepted and localised, such as the Worm of Lambton or that of Spindleston Heugh.\u0026nbsp; If such a creature were, by its own process of metabolism, to change much of its bulk for intellectual growth, we should at once arrive at a new class of creature—more dangerous, perhaps, than the world has ever had any experience of—a force which can think, which has no soul and no morals, and therefore no acceptance of responsibility.\u0026nbsp; A snake would be a good illustration of this, for it is cold-blooded, and therefore removed from the temptations which often weaken or restrict warm-blooded creatures.\u0026nbsp; If, for instance, the Worm of Lambton—if such ever existed—were guided to its own ends by an organised intelligence capable of expansion, what form of creature could we imagine which would equal it in potentialities of evil?\u0026nbsp; Why, such a being would devastate a whole country.\u0026nbsp; Now, all these things require much thought, and we want to apply the knowledge usefully, and we should therefore be exact.\u0026nbsp; Would it not be well to resume the subject later in the day?”\n\u003cbr\u003e \n\u003cbr\u003e “I quite agree, sir.\u0026nbsp; I am in a whirl already; and want to attend carefully to what you say; so that I may try to digest it.”\n\u003cbr\u003e \n\u003cbr\u003e Both men seemed fresher and better for the “easy,” and when they met in the afternoon each of them had something to contribute to the general stock of information.\u0026nbsp; Adam, who was by nature of a more militant disposition than his elderly friend, was glad to see that the conference at once assumed a practical trend.\u0026nbsp; Sir Nathaniel recognised this, and, like an old diplomatist, turned it to present use.\n\u003cbr\u003e \n\u003cbr\u003e “Tell me now, Adam, what is the outcome, in your own mind, of our conversation?”\n\u003cbr\u003e \n\u003cbr\u003e “That the whole difficulty already assumes practical shape; but with added dangers, that at first I did not imagine.”\n\u003cbr\u003e \n\u003cbr\u003e “What is the practical shape, and what are the added dangers?\u0026nbsp; I am not disputing, but only trying to clear my own ideas by the consideration of yours—”\n\u003cbr\u003e \n\u003cbr\u003e So Adam went on:\n\u003cbr\u003e \n\u003cbr\u003e “In the past, in the early days of the world, there were monsters who were so vast that they could exist for thousands of years.\u0026nbsp; Some of them must have overlapped the Christian era.\u0026nbsp; They may have progressed intellectually in process of time.\u0026nbsp; If they had in any way so progressed, or even got the most rudimentary form of brain, they would be the most dangerous things that ever were in the world.\u0026nbsp; Tradition says that one of these monsters lived in the Marsh of the East, and came up to a cave in Diana’s Grove, which was also called the Lair of the White Worm.\u0026nbsp; Such creatures may have grown down as well as up.\u0026nbsp; They may have grown into, or something like, human beings.\u0026nbsp; Lady Arabella March is of snake nature.\u0026nbsp; She has committed crimes to our knowledge.\u0026nbsp; She retains something of the vast strength of her primal being—can see in the dark—has the eyes of a snake.\u0026nbsp; She used the nigger, and then dragged him through the snake’s hole down to the swamp; she is intent on evil, and hates some one we love.\u0026nbsp; Result . . . ”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, the result?”\n\u003cbr\u003e \n\u003cbr\u003e “First, that Mimi Watford should be taken away at once—then—”\n\u003cbr\u003e \n\u003cbr\u003e “Yes?”\n\u003cbr\u003e \n\u003cbr\u003e “The monster must be destroyed.”\n\u003cbr\u003e \n\u003cbr\u003e “Bravo!\u0026nbsp; That is a true and fearless conclusion.\u0026nbsp; At whatever cost, it must be carried out.”\n\u003cbr\u003e \n\u003cbr\u003e “At once?”\n\u003cbr\u003e \n\u003cbr\u003e “Soon, at all events.\u0026nbsp; That creature’s very existence is a danger.\u0026nbsp; Her presence in this neighbourhood makes the danger immediate.”\n\u003cbr\u003e \n\u003cbr\u003e As he spoke, Sir Nathaniel’s mouth hardened and his eyebrows came down till they met.\u0026nbsp; There was no doubting his concurrence in the resolution, or his readiness to help in carrying it out.\u0026nbsp; But he was an elderly man with much experience and knowledge of law and diplomacy.\u0026nbsp; It seemed to him to be a stern duty to prevent anything irrevocable taking place till it had been thought out and all was ready.\u0026nbsp; There were all sorts of legal cruxes to be thought out, not only regarding the taking of life, even of a monstrosity in human form, but also of property.\u0026nbsp; Lady Arabella, be she woman or snake or devil, owned the ground she moved in, according to British law, and the law is jealous and swift to avenge wrongs done within its ken.\u0026nbsp; All such difficulties should be—must be—avoided for Mr. Salton’s sake, for Adam’s own sake, and, most of all, for Mimi Watford’s sake.\n\u003cbr\u003e \n\u003cbr\u003e Before he spoke again, Sir Nathaniel had made up his mind that he must try to postpone decisive action until the circumstances on which they depended—which, after all, were only problematical—should have been tested satisfactorily, one way or another.\u0026nbsp; When he did speak, Adam at first thought that his friend was wavering in his intention, or “funking” the responsibility.\u0026nbsp; However, his respect for Sir Nathaniel was so great that he would not act, or even come to a conclusion on a vital point, without his sanction.\n\u003cbr\u003e \n\u003cbr\u003e He came close and whispered in his ear:\n\u003cbr\u003e \n\u003cbr\u003e “We will prepare our plans to combat and destroy this horrible menace, after we have cleared up some of the more baffling points.\u0026nbsp; Meanwhile, we must wait for the night—I hear my uncle’s footsteps echoing down the hall.”\n\u003cbr\u003e \n\u003cbr\u003e Sir Nathaniel nodded his approval.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3244/88915.html","bookId":643,"creation":"Aug 5, 2019 2:28:42 AM","modification":"Aug 5, 2019 2:28:42 AM"}
