{"id":30635,"no":4,"title":"CHAPTER IV—THE LADY ARABELLA MARCH","content":"“Now, there is no hurry, but so soon as you are both ready we shall start,” Mr. Salton said when breakfast had begun.\u0026nbsp; “I want to take you first to see a remarkable relic of Mercia, and then we’ll go to Liverpool through what is called ‘The Great Vale of Cheshire.’\u0026nbsp; You may be disappointed, but take care not to prepare your mind”—this to Adam—“for anything stupendous or heroic.\u0026nbsp; You would not think the place a vale at all, unless you were told so beforehand, and had confidence in the veracity of the teller.\u0026nbsp; We should get to the Landing Stage in time to meet the West African, and catch Mr. Caswall as he comes ashore.\u0026nbsp; We want to do him honour—and, besides, it will be more pleasant to have the introductions over before we go to his fête at the Castle.”\n\u003cbr\u003e \n\u003cbr\u003e The carriage was ready, the same as had been used the previous day, but there were different horses—magnificent animals, and keen for work.\u0026nbsp; Breakfast was soon over, and they shortly took their places.\u0026nbsp; The postillions had their orders, and were quickly on their way at an exhilarating pace.\n\u003cbr\u003e \n\u003cbr\u003e Presently, in obedience to Mr. Salton’s signal, the carriage drew up opposite a great heap of stones by the wayside.\n\u003cbr\u003e \n\u003cbr\u003e “Here, Adam,” he said, “is something that you of all men should not pass by unnoticed.\u0026nbsp; That heap of stones brings us at once to the dawn of the Anglian kingdom.\u0026nbsp; It was begun more than a thousand years ago—in the latter part of the seventh century—in memory of a murder.\u0026nbsp; Wulfere, King of Mercia, nephew of Penda, here murdered his two sons for embracing Christianity.\u0026nbsp; As was the custom of the time, each passer-by added a stone to the memorial heap.\u0026nbsp; Penda represented heathen reaction after St. Augustine’s mission.\u0026nbsp; Sir Nathaniel can tell you as much as you want about this, and put you, if you wish, on the track of such accurate knowledge as there is.”\n\u003cbr\u003e \n\u003cbr\u003e Whilst they were looking at the heap of stones, they noticed that another carriage had drawn up beside them, and the passenger—there was only one—was regarding them curiously.\u0026nbsp; The carriage was an old heavy travelling one, with arms blazoned on it gorgeously.\u0026nbsp; The men took off their hats, as the occupant, a lady, addressed them.\n\u003cbr\u003e \n\u003cbr\u003e “How do you do, Sir Nathaniel?\u0026nbsp; How do you do, Mr. Salton?\u0026nbsp; I hope you have not met with any accident.\u0026nbsp; Look at me!”\n\u003cbr\u003e \n\u003cbr\u003e As she spoke she pointed to where one of the heavy springs was broken across, the broken metal showing bright.\u0026nbsp; Adam spoke up at once:\n\u003cbr\u003e \n\u003cbr\u003e “Oh, that can soon be put right.”\n\u003cbr\u003e \n\u003cbr\u003e “Soon?\u0026nbsp; There is no one near who can mend a break like that.”\n\u003cbr\u003e \n\u003cbr\u003e “I can.”\n\u003cbr\u003e \n\u003cbr\u003e “You!”\u0026nbsp; She looked incredulously at the dapper young gentleman who spoke.\u0026nbsp; “You—why, it’s a workman’s job.”\n\u003cbr\u003e \n\u003cbr\u003e “All right, I am a workman—though that is not the only sort of work I do.\u0026nbsp; I am an Australian, and, as we have to move about fast, we are all trained to farriery and such mechanics as come into travel—I am quite at your service.”\n\u003cbr\u003e \n\u003cbr\u003e “I hardly know how to thank you for your kindness, of which I gladly avail myself.\u0026nbsp; I don’t know what else I can do, as I wish to meet Mr. Caswall of Castra Regis, who arrives home from Africa to-day.\u0026nbsp; It is a notable home-coming; all the countryside want to do him honour.”\u0026nbsp; She looked at the old men and quickly made up her mind as to the identity of the stranger.\u0026nbsp; “You must be Mr. Adam Salton of Lesser Hill.\u0026nbsp; I am Lady Arabella March of Diana’s Grove.”\u0026nbsp; As she spoke she turned slightly to Mr. Salton, who took the hint and made a formal introduction.\n\u003cbr\u003e \n\u003cbr\u003e So soon as this was done, Adam took some tools from his uncle’s carriage, and at once began work on the broken spring.\u0026nbsp; He was an expert workman, and the breach was soon made good.\u0026nbsp; Adam was gathering the tools which he had been using—which, after the manner of all workmen, had been scattered about—when he noticed that several black snakes had crawled out from the heap of stones and were gathering round him.\u0026nbsp; This naturally occupied his mind, and he was not thinking of anything else when he noticed Lady Arabella, who had opened the door of the carriage, slip from it with a quick gliding motion.\u0026nbsp; She was already among the snakes when he called out to warn her.\u0026nbsp; But there seemed to be no need of warning.\u0026nbsp; The snakes had turned and were wriggling back to the mound as quickly as they could.\u0026nbsp; He laughed to himself behind his teeth as he whispered, “No need to fear there.\u0026nbsp; They seem much more afraid of her than she of them.”\u0026nbsp; All the same he began to beat on the ground with a stick which was lying close to him, with the instinct of one used to such vermin.\u0026nbsp; In an instant he was alone beside the mound with Lady Arabella, who appeared quite unconcerned at the incident.\u0026nbsp; Then he took a long look at her, and her dress alone was sufficient to attract attention.\u0026nbsp; She was clad in some kind of soft white stuff, which clung close to her form, showing to the full every movement of her sinuous figure.\u0026nbsp; She wore a close-fitting cap of some fine fur of dazzling white.\u0026nbsp; Coiled round her white throat was a large necklace of emeralds, whose profusion of colour dazzled when the sun shone on them.\u0026nbsp; Her voice was peculiar, very low and sweet, and so soft that the dominant note was of sibilation.\u0026nbsp; Her hands, too, were peculiar—long, flexible, white, with a strange movement as of waving gently to and fro.\n\u003cbr\u003e \n\u003cbr\u003e She appeared quite at ease, and, after thanking Adam, said that if any of his uncle’s party were going to Liverpool she would be most happy to join forces.\n\u003cbr\u003e \n\u003cbr\u003e “Whilst you are staying here, Mr. Salton, you must look on the grounds of Diana’s Grove as your own, so that you may come and go just as you do in Lesser Hill.\u0026nbsp; There are some fine views, and not a few natural curiosities which are sure to interest you, if you are a student of natural history—specially of an earlier kind, when the world was younger.”\n\u003cbr\u003e \n\u003cbr\u003e The heartiness with which she spoke, and the warmth of her words—not of her manner, which was cold and distant—made him suspicious.\u0026nbsp; In the meantime both his uncle and Sir Nathaniel had thanked her for the invitation—of which, however, they said they were unable to avail themselves.\u0026nbsp; Adam had a suspicion that, though she answered regretfully, she was in reality relieved.\u0026nbsp; When he had got into the carriage with the two old men, and they had driven off, he was not surprised when Sir Nathaniel spoke.\n\u003cbr\u003e \n\u003cbr\u003e “I could not but feel that she was glad to be rid of us.\u0026nbsp; She can play her game better alone!”\n\u003cbr\u003e \n\u003cbr\u003e “What is her game?” asked Adam unthinkingly.\n\u003cbr\u003e \n\u003cbr\u003e “All the county knows it, my boy.\u0026nbsp; Caswall is a very rich man.\u0026nbsp; Her husband was rich when she married him—or seemed to be.\u0026nbsp; When he committed suicide, it was found that he had nothing left, and the estate was mortgaged up to the hilt.\u0026nbsp; Her only hope is in a rich marriage.\u0026nbsp; I suppose I need not draw any conclusion; you can do that as well as I can.”\n\u003cbr\u003e \n\u003cbr\u003e Adam remained silent nearly all the time they were travelling through the alleged Vale of Cheshire.\u0026nbsp; He thought much during that journey and came to several conclusions, though his lips were unmoved.\u0026nbsp; One of these conclusions was that he would be very careful about paying any attention to Lady Arabella.\u0026nbsp; He was himself a rich man, how rich not even his uncle had the least idea, and would have been surprised had he known.\n\u003cbr\u003e \n\u003cbr\u003e The remainder of the journey was uneventful, and upon arrival at Liverpool they went aboard the West African, which had just come to the landing-stage.\u0026nbsp; There his uncle introduced himself to Mr. Caswall, and followed this up by introducing Sir Nathaniel and then Adam.\u0026nbsp; The new-comer received them graciously, and said what a pleasure it was to be coming home after so long an absence of his family from their old seat.\u0026nbsp; Adam was pleased at the warmth of the reception; but he could not avoid a feeling of repugnance at the man’s face.\u0026nbsp; He was trying hard to overcome this when a diversion was caused by the arrival of Lady Arabella.\u0026nbsp; The diversion was welcome to all; the two Saltons and Sir Nathaniel were shocked at Caswall’s face—so hard, so ruthless, so selfish, so dominant.\u0026nbsp; “God help any,” was the common thought, “who is under the domination of such a man!”\n\u003cbr\u003e \n\u003cbr\u003e Presently his African servant approached him, and at once their thoughts changed to a larger toleration.\u0026nbsp; Caswall looked indeed a savage—but a cultured savage.\u0026nbsp; In him were traces of the softening civilisation of ages—of some of the higher instincts and education of man, no matter how rudimentary these might be.\u0026nbsp; But the face of Oolanga, as his master called him, was unreformed, unsoftened savage, and inherent in it were all the hideous possibilities of a lost, devil-ridden child of the forest and the swamp—the lowest of all created things that could be regarded as in some form ostensibly human.\u0026nbsp; Lady Arabella and Oolanga arrived almost simultaneously, and Adam was surprised to notice what effect their appearance had on each other.\u0026nbsp; The woman seemed as if she would not—could not—condescend to exhibit any concern or interest in such a creature.\u0026nbsp; On the other hand, the negro’s bearing was such as in itself to justify her pride.\u0026nbsp; He treated her not merely as a slave treats his master, but as a worshipper would treat a deity.\u0026nbsp; He knelt before her with his hands out-stretched and his forehead in the dust.\u0026nbsp; So long as she remained he did not move; it was only when she went over to Caswall that he relaxed his attitude of devotion and stood by respectfully.\n\u003cbr\u003e \n\u003cbr\u003e Adam spoke to his own man, Davenport, who was standing by, having arrived with the bailiff of Lesser Hill, who had followed Mr. Salton in a pony trap.\u0026nbsp; As he spoke, he pointed to an attentive ship’s steward, and presently the two men were conversing.\n\u003cbr\u003e \n\u003cbr\u003e “I think we ought to be moving,” Mr. Salton said to Adam.\u0026nbsp; “I have some things to do in Liverpool, and I am sure that both Mr. Caswall and Lady Arabella would like to get under weigh for Castra Regis.”\n\u003cbr\u003e \n\u003cbr\u003e “I too, sir, would like to do something,” replied Adam.\u0026nbsp; “I want to find out where Ross, the animal merchant, lives—I want to take a small animal home with me, if you don’t mind.\u0026nbsp; He is only a little thing, and will be no trouble.”\n\u003cbr\u003e \n\u003cbr\u003e “Of course not, my boy.\u0026nbsp; What kind of animal is it that you want?”\n\u003cbr\u003e \n\u003cbr\u003e “A mongoose.”\n\u003cbr\u003e \n\u003cbr\u003e “A mongoose!\u0026nbsp; What on earth do you want it for?”\n\u003cbr\u003e \n\u003cbr\u003e “To kill snakes.”\n\u003cbr\u003e \n\u003cbr\u003e “Good!”\u0026nbsp; The old man remembered the mound of stones.\u0026nbsp; No explanation was needed.\n\u003cbr\u003e \n\u003cbr\u003e When Ross heard what was wanted, he asked:\n\u003cbr\u003e \n\u003cbr\u003e “Do you want something special, or will an ordinary mongoose do?”\n\u003cbr\u003e \n\u003cbr\u003e “Well, of course I want a good one.\u0026nbsp; But I see no need for anything special.\u0026nbsp; It is for ordinary use.”\n\u003cbr\u003e \n\u003cbr\u003e “I can let you have a choice of ordinary ones.\u0026nbsp; I only asked, because I have in stock a very special one which I got lately from Nepaul.\u0026nbsp; He has a record of his own.\u0026nbsp; He killed a king cobra that had been seen in the Rajah’s garden.\u0026nbsp; But I don’t suppose we have any snakes of the kind in this cold climate—I daresay an ordinary one will do.”\n\u003cbr\u003e \n\u003cbr\u003e When Adam got back to the carriage, carefully carrying the box with the mongoose, Sir Nathaniel said: “Hullo! what have you got there?”\n\u003cbr\u003e \n\u003cbr\u003e “A mongoose.”\n\u003cbr\u003e \n\u003cbr\u003e “What for?”\n\u003cbr\u003e \n\u003cbr\u003e “To kill snakes!”\n\u003cbr\u003e \n\u003cbr\u003e Sir Nathaniel laughed.\n\u003cbr\u003e \n\u003cbr\u003e “I heard Lady Arabella’s invitation to you to come to Diana’s Grove.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, what on earth has that got to do with it?”\n\u003cbr\u003e \n\u003cbr\u003e “Nothing directly that I know of.\u0026nbsp; But we shall see.”\u0026nbsp; Adam waited, and the old man went on: “Have you by any chance heard the other name which was given long ago to that place.”\n\u003cbr\u003e \n\u003cbr\u003e “No, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “It was called—Look here, this subject wants a lot of talking over.\u0026nbsp; Suppose we wait till we are alone and have lots of time before us.”\n\u003cbr\u003e \n\u003cbr\u003e “All right, sir.”\u0026nbsp; Adam was filled with curiosity, but he thought it better not to hurry matters.\u0026nbsp; All would come in good time.\u0026nbsp; Then the three men returned home, leaving Mr. Caswall to spend the night in Liverpool.\n\u003cbr\u003e \n\u003cbr\u003e The following day the Lesser Hill party set out for Castra Regis, and for the time Adam thought no more of Diana’s Grove or of what mysteries it had contained—or might still contain.\n\u003cbr\u003e \n\u003cbr\u003e The guests were crowding in, and special places were marked for important people.\u0026nbsp; Adam, seeing so many persons of varied degree, looked round for Lady Arabella, but could not locate her.\u0026nbsp; It was only when he saw the old-fashioned travelling carriage approach and heard the sound of cheering which went with it, that he realised that Edgar Caswall had arrived.\u0026nbsp; Then, on looking more closely, he saw that Lady Arabella, dressed as he had seen her last, was seated beside him.\u0026nbsp; When the carriage drew up at the great flight of steps, the host jumped down and gave her his hand.\n\u003cbr\u003e \n\u003cbr\u003e It was evident to all that she was the chief guest at the festivities.\u0026nbsp; It was not long before the seats on the da?s were filled, while the tenants and guests of lesser importance had occupied all the coigns of vantage not reserved.\u0026nbsp; The order of the day had been carefully arranged by a committee.\u0026nbsp; There were some speeches, happily neither many nor long; and then festivities were suspended till the time for feasting arrived.\u0026nbsp; In the interval Caswall walked among his guests, speaking to all in a friendly manner and expressing a general welcome.\u0026nbsp; The other guests came down from the da?s and followed his example, so there was unceremonious meeting and greeting between gentle and simple.\n\u003cbr\u003e \n\u003cbr\u003e Adam Salton naturally followed with his eyes all that went on within their scope, taking note of all who seemed to afford any interest.\u0026nbsp; He was young and a man and a stranger from a far distance; so on all these accounts he naturally took stock rather of the women than of the men, and of these, those who were young and attractive.\u0026nbsp; There were lots of pretty girls among the crowd, and Adam, who was a handsome young man and well set up, got his full share of admiring glances.\u0026nbsp; These did not concern him much, and he remained unmoved until there came along a group of three, by their dress and bearing, of the farmer class.\u0026nbsp; One was a sturdy old man; the other two were good-looking girls, one of a little over twenty, the other not quite so old.\u0026nbsp; So soon as Adam’s eyes met those of the younger girl, who stood nearest to him, some sort of electricity flashed—that divine spark which begins by recognition, and ends in obedience.\u0026nbsp; Men call it “Love.”\n\u003cbr\u003e \n\u003cbr\u003e Both his companions noticed how much Adam was taken by the pretty girl, and spoke of her to him in a way which made his heart warm to them.\n\u003cbr\u003e \n\u003cbr\u003e “Did you notice that party that passed?\u0026nbsp; The old man is Michael Watford, one of the tenants of Mr. Caswall.\u0026nbsp; He occupies Mercy Farm, which Sir Nathaniel pointed out to you to-day.\u0026nbsp; The girls are his grand-daughters, the elder, Lilla, being the only child of his elder son, who died when she was less than a year old.\u0026nbsp; His wife died on the same day.\u0026nbsp; She is a good girl—as good as she is pretty.\u0026nbsp; The other is her first cousin, the daughter of Watford’s second son.\u0026nbsp; He went for a soldier when he was just over twenty, and was drafted abroad.\u0026nbsp; He was not a good correspondent, though he was a good enough son.\u0026nbsp; A few letters came, and then his father heard from the colonel of his regiment that he had been killed by dacoits in Burmah.\u0026nbsp; He heard from the same source that his boy had been married to a Burmese, and that there was a daughter only a year old.\u0026nbsp; Watford had the child brought home, and she grew up beside Lilla.\u0026nbsp; The only thing that they heard of her birth was that her name was Mimi.\u0026nbsp; The two children adored each other, and do to this day.\u0026nbsp; Strange how different they are!\u0026nbsp; Lilla all fair, like the old Saxon stock from which she is sprung; Mimi showing a trace of her mother’s race.\u0026nbsp; Lilla is as gentle as a dove, but Mimi’s black eyes can glow whenever she is upset.\u0026nbsp; The only thing that upsets her is when anything happens to injure or threaten or annoy Lilla.\u0026nbsp; Then her eyes glow as do the eyes of a bird when her young are menaced.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3244/88899.html","bookId":643,"creation":"Aug 5, 2019 2:28:42 AM","modification":"Aug 5, 2019 2:28:42 AM"}
