{"id":30636,"no":5,"title":"CHAPTER V—THE WHITE WORM","content":"Mr. Salton introduced Adam to Mr. Watford and his grand-daughters, and they all moved on together.\u0026nbsp; Of course neighbours in the position of the Watfords knew all about Adam Salton, his relationship, circumstances, and prospects.\u0026nbsp; So it would have been strange indeed if both girls did not dream of possibilities of the future.\u0026nbsp; In agricultural England, eligible men of any class are rare.\u0026nbsp; This particular man was specially eligible, for he did not belong to a class in which barriers of caste were strong.\u0026nbsp; So when it began to be noticed that he walked beside Mimi Watford and seemed to desire her society, all their friends endeavoured to give the promising affair a helping hand.\u0026nbsp; When the gongs sounded for the banquet, he went with her into the tent where her grandfather had seats.\u0026nbsp; Mr. Salton and Sir Nathaniel noticed that the young man did not come to claim his appointed place at the da?s table; but they understood and made no remark, or indeed did not seem to notice his absence.\n\u003cbr\u003e \n\u003cbr\u003e Lady Arabella sat as before at Edgar Caswall’s right hand.\u0026nbsp; She was certainly a striking and unusual woman, and to all it seemed fitting from her rank and personal qualities that she should be the chosen partner of the heir on his first appearance.\u0026nbsp; Of course nothing was said openly by those of her own class who were present; but words were not necessary when so much could be expressed by nods and smiles.\u0026nbsp; It seemed to be an accepted thing that at last there was to be a mistress of Castra Regis, and that she was present amongst them.\u0026nbsp; There were not lacking some who, whilst admitting all her charm and beauty, placed her in the second rank, Lilla Watford being marked as first.\u0026nbsp; There was sufficient divergence of type, as well as of individual beauty, to allow of fair comment; Lady Arabella represented the aristocratic type, and Lilla that of the commonalty.\n\u003cbr\u003e \n\u003cbr\u003e When the dusk began to thicken, Mr. Salton and Sir Nathaniel walked home—the trap had been sent away early in the day—leaving Adam to follow in his own time.\u0026nbsp; He came in earlier than was expected, and seemed upset about something.\u0026nbsp; Neither of the elders made any comment.\u0026nbsp; They all lit cigarettes, and, as dinner-time was close at hand, went to their rooms to get ready.\n\u003cbr\u003e \n\u003cbr\u003e Adam had evidently been thinking in the interval.\u0026nbsp; He joined the others in the drawing-room, looking ruffled and impatient—a condition of things seen for the first time.\u0026nbsp; The others, with the patience—or the experience—of age, trusted to time to unfold and explain things.\u0026nbsp; They had not long to wait.\u0026nbsp; After sitting down and standing up several times, Adam suddenly burst out.\n\u003cbr\u003e \n\u003cbr\u003e “That fellow seems to think he owns the earth.\u0026nbsp; Can’t he let people alone!\u0026nbsp; He seems to think that he has only to throw his handkerchief to any woman, and be her master.”\n\u003cbr\u003e \n\u003cbr\u003e This outburst was in itself enlightening.\u0026nbsp; Only thwarted affection in some guise could produce this feeling in an amiable young man.\u0026nbsp; Sir Nathaniel, as an old diplomatist, had a way of understanding, as if by foreknowledge, the true inwardness of things, and asked suddenly, but in a matter-of-fact, indifferent voice:\n\u003cbr\u003e \n\u003cbr\u003e “Was he after Lilla?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, and the fellow didn’t lose any time either.\u0026nbsp; Almost as soon as they met, he began to butter her up, and tell her how beautiful she was.\u0026nbsp; Why, before he left her side, he had asked himself to tea to-morrow at Mercy Farm.\u0026nbsp; Stupid ass!\u0026nbsp; He might see that the girl isn’t his sort!\u0026nbsp; I never saw anything like it.\u0026nbsp; It was just like a hawk and a pigeon.”\n\u003cbr\u003e \n\u003cbr\u003e As he spoke, Sir Nathaniel turned and looked at Mr. Salton—a keen look which implied a full understanding.\n\u003cbr\u003e \n\u003cbr\u003e “Tell us all about it, Adam.\u0026nbsp; There are still a few minutes before dinner, and we shall all have better appetites when we have come to some conclusion on this matter.”\n\u003cbr\u003e \n\u003cbr\u003e “There is nothing to tell, sir; that is the worst of it.\u0026nbsp; I am bound to say that there was not a word said that a human being could object to.\u0026nbsp; He was very civil, and all that was proper—just what a landlord might be to a tenant’s daughter . . . Yet—yet—well, I don’t know how it was, but it made my blood boil.”\n\u003cbr\u003e \n\u003cbr\u003e “How did the hawk and the pigeon come in?”\u0026nbsp; Sir Nathaniel’s voice was soft and soothing, nothing of contradiction or overdone curiosity in it—a tone eminently suited to win confidence.\n\u003cbr\u003e \n\u003cbr\u003e “I can hardly explain.\u0026nbsp; I can only say that he looked like a hawk and she like a dove—and, now that I think of it, that is what they each did look like; and do look like in their normal condition.”\n\u003cbr\u003e \n\u003cbr\u003e “That is so!” came the soft voice of Sir Nathaniel.\n\u003cbr\u003e \n\u003cbr\u003e Adam went on:\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps that early Roman look of his set me off.\u0026nbsp; But I wanted to protect her; she seemed in danger.”\n\u003cbr\u003e \n\u003cbr\u003e “She seems in danger, in a way, from all you young men.\u0026nbsp; I couldn’t help noticing the way that even you looked—as if you wished to absorb her!”\n\u003cbr\u003e \n\u003cbr\u003e “I hope both you young men will keep your heads cool,” put in Mr. Salton.\u0026nbsp; “You know, Adam, it won’t do to have any quarrel between you, especially so soon after his home-coming and your arrival here.\u0026nbsp; We must think of the feelings and happiness of our neighbours; mustn’t we?”\n\u003cbr\u003e \n\u003cbr\u003e “I hope so, sir.\u0026nbsp; I assure you that, whatever may happen, or even threaten, I shall obey your wishes in this as in all things.”\n\u003cbr\u003e \n\u003cbr\u003e “Hush!” whispered Sir Nathaniel, who heard the servants in the passage bringing dinner.\n\u003cbr\u003e \n\u003cbr\u003e After dinner, over the walnuts and the wine, Sir Nathaniel returned to the subject of the local legends.\n\u003cbr\u003e \n\u003cbr\u003e “It will perhaps be a less dangerous topic for us to discuss than more recent ones.”\n\u003cbr\u003e \n\u003cbr\u003e “All right, sir,” said Adam heartily.\u0026nbsp; “I think you may depend on me now with regard to any topic.\u0026nbsp; I can even discuss Mr. Caswall.\u0026nbsp; Indeed, I may meet him to-morrow.\u0026nbsp; He is going, as I said, to call at Mercy Farm at three o’clock—but I have an appointment at two.”\n\u003cbr\u003e \n\u003cbr\u003e “I notice,” said Mr. Salton, “that you do not lose any time.”\n\u003cbr\u003e \n\u003cbr\u003e The two old men once more looked at each other steadily.\u0026nbsp; Then, lest the mood of his listener should change with delay, Sir Nathaniel began at once:\n\u003cbr\u003e \n\u003cbr\u003e “I don’t propose to tell you all the legends of Mercia, or even to make a selection of them.\u0026nbsp; It will be better, I think, for our purpose if we consider a few facts—recorded or unrecorded—about this neighbourhood.\u0026nbsp; I think we might begin with Diana’s Grove.\u0026nbsp; It has roots in the different epochs of our history, and each has its special crop of legend.\u0026nbsp; The Druid and the Roman are too far off for matters of detail; but it seems to me the Saxon and the Angles are near enough to yield material for legendary lore.\u0026nbsp; We find that this particular place had another name besides Diana’s Grove.\u0026nbsp; This was manifestly of Roman origin, or of Grecian accepted as Roman.\u0026nbsp; The other is more pregnant of adventure and romance than the Roman name.\u0026nbsp; In Mercian tongue it was ‘The Lair of the White Worm.’\u0026nbsp; This needs a word of explanation at the beginning.\n\u003cbr\u003e \n\u003cbr\u003e “In the dawn of the language, the word ‘worm’ had a somewhat different meaning from that in use to-day.\u0026nbsp; It was an adaptation of the Anglo-Saxon ‘wyrm,’ meaning a dragon or snake; or from the Gothic ‘waurms,’ a serpent; or the Icelandic ‘ormur,’ or the German ‘wurm.’\u0026nbsp; We gather that it conveyed originally an idea of size and power, not as now in the diminutive of both these meanings.\u0026nbsp; Here legendary history helps us.\u0026nbsp; We have the well-known legend of the ‘Worm Well’ of Lambton Castle, and that of the ‘Laidly Worm of Spindleston Heugh’ near Bamborough.\u0026nbsp; In both these legends the ‘worm’ was a monster of vast size and power—a veritable dragon or serpent, such as legend attributes to vast fens or quags where there was illimitable room for expansion.\u0026nbsp; A glance at a geological map will show that whatever truth there may have been of the actuality of such monsters in the early geologic periods, at least there was plenty of possibility.\u0026nbsp; In England there were originally vast plains where the plentiful supply of water could gather.\u0026nbsp; The streams were deep and slow, and there were holes of abysmal depth, where any kind and size of antediluvian monster could find a habitat.\u0026nbsp; In places, which now we can see from our windows, were mud-holes a hundred or more feet deep.\u0026nbsp; Who can tell us when the age of the monsters which flourished in slime came to an end?\u0026nbsp; There must have been places and conditions which made for greater longevity, greater size, greater strength than was usual.\u0026nbsp; Such over-lappings may have come down even to our earlier centuries.\u0026nbsp; Nay, are there not now creatures of a vastness of bulk regarded by the generality of men as impossible?\u0026nbsp; Even in our own day there are seen the traces of animals, if not the animals themselves, of stupendous size—veritable survivals from earlier ages, preserved by some special qualities in their habitats.\u0026nbsp; I remember meeting a distinguished man in India, who had the reputation of being a great shikaree, who told me that the greatest temptation he had ever had in his life was to shoot a giant snake which he had come across in the Terai of Upper India.\u0026nbsp; He was on a tiger-shooting expedition, and as his elephant was crossing a nullah, it squealed.\u0026nbsp; He looked down from his howdah and saw that the elephant had stepped across the body of a snake which was dragging itself through the jungle.\u0026nbsp; ‘So far as I could see,’ he said, ‘it must have been eighty or one hundred feet in length.\u0026nbsp; Fully forty or fifty feet was on each side of the track, and though the weight which it dragged had thinned it, it was as thick round as a man’s body.\u0026nbsp; I suppose you know that when you are after tiger, it is a point of honour not to shoot at anything else, as life may depend on it.\u0026nbsp; I could easily have spined this monster, but I felt that I must not—so, with regret, I had to let it go.’\n\u003cbr\u003e \n\u003cbr\u003e “Just imagine such a monster anywhere in this country, and at once we could get a sort of idea of the ‘worms,’ which possibly did frequent the great morasses which spread round the mouths of many of the great European rivers.”\n\u003cbr\u003e \n\u003cbr\u003e “I haven’t the least doubt, sir, that there may have been such monsters as you have spoken of still existing at a much later period than is generally accepted,” replied Adam.\u0026nbsp; “Also, if there were such things, that this was the very place for them.\u0026nbsp; I have tried to think over the matter since you pointed out the configuration of the ground.\u0026nbsp; But it seems to me that there is a hiatus somewhere.\u0026nbsp; Are there not mechanical difficulties?”\n\u003cbr\u003e \n\u003cbr\u003e “In what way?”\n\u003cbr\u003e \n\u003cbr\u003e “Well, our antique monster must have been mighty heavy, and the distances he had to travel were long and the ways difficult.\u0026nbsp; From where we are now sitting down to the level of the mud-holes is a distance of several hundred feet—I am leaving out of consideration altogether any lateral distance.\u0026nbsp; Is it possible that there was a way by which a monster could travel up and down, and yet no chance recorder have ever seen him?\u0026nbsp; Of course we have the legends; but is not some more exact evidence necessary in a scientific investigation?”\n\u003cbr\u003e \n\u003cbr\u003e “My dear Adam, all you say is perfectly right, and, were we starting on such an investigation, we could not do better than follow your reasoning.\u0026nbsp; But, my dear boy, you must remember that all this took place thousands of years ago.\u0026nbsp; You must remember, too, that all records of the kind that would help us are lacking.\u0026nbsp; Also, that the places to be considered were desert, so far as human habitation or population are considered.\u0026nbsp; In the vast desolation of such a place as complied with the necessary conditions, there must have been such profusion of natural growth as would bar the progress of men formed as we are.\u0026nbsp; The lair of such a monster would not have been disturbed for hundreds—or thousands—of years.\u0026nbsp; Moreover, these creatures must have occupied places quite inaccessible to man.\u0026nbsp; A snake who could make himself comfortable in a quagmire, a hundred feet deep, would be protected on the outskirts by such stupendous morasses as now no longer exist, or which, if they exist anywhere at all, can be on very few places on the earth’s surface.\u0026nbsp; Far be it from me to say that in more elemental times such things could not have been.\u0026nbsp; The condition belongs to the geologic age—the great birth and growth of the world, when natural forces ran riot, when the struggle for existence was so savage that no vitality which was not founded in a gigantic form could have even a possibility of survival.\u0026nbsp; That such a time existed, we have evidences in geology, but there only; we can never expect proofs such as this age demands.\u0026nbsp; We can only imagine or surmise such things—or such conditions and such forces as overcame them.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3244/88900.html","bookId":643,"creation":"Aug 5, 2019 2:28:42 AM","modification":"Aug 5, 2019 2:28:42 AM"}
