{"id":30637,"no":6,"title":"CHAPTER VI—HAWK AND PIGEON","content":"At breakfast-time next morning Sir Nathaniel and Mr. Salton were seated when Adam came hurriedly into the room.\n\u003cbr\u003e \n\u003cbr\u003e “Any news?” asked his uncle mechanically.\n\u003cbr\u003e \n\u003cbr\u003e “Four.”\n\u003cbr\u003e \n\u003cbr\u003e “Four what?” asked Sir Nathaniel.\n\u003cbr\u003e \n\u003cbr\u003e “Snakes,” said Adam, helping himself to a grilled kidney.\n\u003cbr\u003e \n\u003cbr\u003e “Four snakes.\u0026nbsp; I don’t understand.”\n\u003cbr\u003e \n\u003cbr\u003e “Mongoose,” said Adam, and then added explanatorily: “I was out with the mongoose just after three.”\n\u003cbr\u003e \n\u003cbr\u003e “Four snakes in one morning!\u0026nbsp; Why, I didn’t know there were so many on the Brow”—the local name for the western cliff.\u0026nbsp; “I hope that wasn’t the consequence of our talk of last night?”\n\u003cbr\u003e \n\u003cbr\u003e “It was, sir.\u0026nbsp; But not directly.”\n\u003cbr\u003e \n\u003cbr\u003e “But, God bless my soul, you didn’t expect to get a snake like the Lambton worm, did you?\u0026nbsp; Why, a mongoose, to tackle a monster like that—if there were one—would have to be bigger than a haystack.”\n\u003cbr\u003e \n\u003cbr\u003e “These were ordinary snakes, about as big as a walking-stick.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, it’s pleasant to be rid of them, big or little.\u0026nbsp; That is a good mongoose, I am sure; he’ll clear out all such vermin round here,” said Mr. Salton.\n\u003cbr\u003e \n\u003cbr\u003e Adam went quietly on with his breakfast.\u0026nbsp; Killing a few snakes in a morning was no new experience to him.\u0026nbsp; He left the room the moment breakfast was finished and went to the study that his uncle had arranged for him.\u0026nbsp; Both Sir Nathaniel and Mr. Salton took it that he wanted to be by himself, so as to avoid any questioning or talk of the visit that he was to make that afternoon.\u0026nbsp; They saw nothing further of him till about half-an-hour before dinner-time.\u0026nbsp; Then he came quietly into the smoking-room, where Mr. Salton and Sir Nathaniel were sitting together, ready dressed.\n\u003cbr\u003e \n\u003cbr\u003e “I suppose there is no use waiting.\u0026nbsp; We had better get it over at once,” remarked Adam.\n\u003cbr\u003e \n\u003cbr\u003e His uncle, thinking to make things easier for him, said: “Get what over?”\n\u003cbr\u003e \n\u003cbr\u003e There was a sign of shyness about him at this.\u0026nbsp; He stammered a little at first, but his voice became more even as he went on.\n\u003cbr\u003e \n\u003cbr\u003e “My visit to Mercy Farm.”\n\u003cbr\u003e \n\u003cbr\u003e Mr. Salton waited eagerly.\u0026nbsp; The old diplomatist simply smiled.\n\u003cbr\u003e \n\u003cbr\u003e “I suppose you both know that I was much interested yesterday in the Watfords?”\u0026nbsp; There was no denial or fending off the question.\u0026nbsp; Both the old men smiled acquiescence.\u0026nbsp; Adam went on: “I meant you to see it—both of you.\u0026nbsp; You, uncle, because you are my uncle and the nearest of my own kin, and, moreover, you couldn’t have been more kind to me or made me more welcome if you had been my own father.”\u0026nbsp; Mr. Salton said nothing.\u0026nbsp; He simply held out his hand, and the other took it and held it for a few seconds.\u0026nbsp; “And you, sir, because you have shown me something of the same affection which in my wildest dreams of home I had no right to expect.”\u0026nbsp; He stopped for an instant, much moved.\n\u003cbr\u003e \n\u003cbr\u003e Sir Nathaniel answered softly, laying his hand on the youth’s shoulder.\n\u003cbr\u003e \n\u003cbr\u003e “You are right, my boy; quite right.\u0026nbsp; That is the proper way to look at it.\u0026nbsp; And I may tell you that we old men, who have no children of our own, feel our hearts growing warm when we hear words like those.”\n\u003cbr\u003e \n\u003cbr\u003e Then Adam hurried on, speaking with a rush, as if he wanted to come to the crucial point.\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Watford had not come in, but Lilla and Mimi were at home, and they made me feel very welcome.\u0026nbsp; They have all a great regard for my uncle.\u0026nbsp; I am glad of that any way, for I like them all—much.\u0026nbsp; We were having tea, when Mr. Caswall came to the door, attended by the negro.\u0026nbsp; Lilla opened the door herself.\u0026nbsp; The window of the living-room at the farm is a large one, and from within you cannot help seeing anyone coming.\u0026nbsp; Mr. Caswall said he had ventured to call, as he wished to make the acquaintance of all his tenants, in a less formal way, and more individually, than had been possible to him on the previous day.\u0026nbsp; The girls made him welcome—they are very sweet girls those, sir; someone will be very happy some day there—with either of them.”\n\u003cbr\u003e \n\u003cbr\u003e “And that man may be you, Adam,” said Mr. Salton heartily.\n\u003cbr\u003e \n\u003cbr\u003e A sad look came over the young man’s eyes, and the fire his uncle had seen there died out.\u0026nbsp; Likewise the timbre left his voice, making it sound lonely.\n\u003cbr\u003e \n\u003cbr\u003e “Such might crown my life.\u0026nbsp; But that happiness, I fear, is not for me—or not without pain and loss and woe.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, it’s early days yet!” cried Sir Nathaniel heartily.\n\u003cbr\u003e \n\u003cbr\u003e The young man turned on him his eyes, which had now grown excessively sad.\n\u003cbr\u003e \n\u003cbr\u003e “Yesterday—a few hours ago—that remark would have given me new hope—new courage; but since then I have learned too much.”\n\u003cbr\u003e \n\u003cbr\u003e The old man, skilled in the human heart, did not attempt to argue in such a matter.\n\u003cbr\u003e \n\u003cbr\u003e “Too early to give in, my boy.”\n\u003cbr\u003e \n\u003cbr\u003e “I am not of a giving-in kind,” replied the young man earnestly.\u0026nbsp; “But, after all, it is wise to realise a truth.\u0026nbsp; And when a man, though he is young, feels as I do—as I have felt ever since yesterday, when I first saw Mimi’s eyes—his heart jumps.\u0026nbsp; He does not need to learn things.\u0026nbsp; He knows.”\n\u003cbr\u003e \n\u003cbr\u003e There was silence in the room, during which the twilight stole on imperceptibly.\u0026nbsp; It was Adam who again broke the silence.\n\u003cbr\u003e \n\u003cbr\u003e “Do you know, uncle, if we have any second sight in our family?”\n\u003cbr\u003e \n\u003cbr\u003e “No, not that I ever heard about.\u0026nbsp; Why?”\n\u003cbr\u003e \n\u003cbr\u003e “Because,” he answered slowly, “I have a conviction which seems to answer all the conditions of second sight.”\n\u003cbr\u003e \n\u003cbr\u003e “And then?” asked the old man, much perturbed.\n\u003cbr\u003e \n\u003cbr\u003e “And then the usual inevitable.\u0026nbsp; What in the Hebrides and other places, where the Sight is a cult—a belief—is called ‘the doom’—the court from which there is no appeal.\u0026nbsp; I have often heard of second sight—we have many western Scots in Australia; but I have realised more of its true inwardness in an instant of this afternoon than I did in the whole of my life previously—a granite wall stretching up to the very heavens, so high and so dark that the eye of God Himself cannot see beyond.\u0026nbsp; Well, if the Doom must come, it must.\u0026nbsp; That is all.”\n\u003cbr\u003e \n\u003cbr\u003e The voice of Sir Nathaniel broke in, smooth and sweet and grave.\n\u003cbr\u003e \n\u003cbr\u003e “Can there not be a fight for it?\u0026nbsp; There can for most things.”\n\u003cbr\u003e \n\u003cbr\u003e “For most things, yes, but for the Doom, no.\u0026nbsp; What a man can do I shall do.\u0026nbsp; There will be—must be—a fight.\u0026nbsp; When and where and how I know not, but a fight there will be.\u0026nbsp; But, after all, what is a man in such a case?”\n\u003cbr\u003e \n\u003cbr\u003e “Adam, there are three of us.”\u0026nbsp; Salton looked at his old friend as he spoke, and that old friend’s eyes blazed.\n\u003cbr\u003e \n\u003cbr\u003e “Ay, three of us,” he said, and his voice rang.\n\u003cbr\u003e \n\u003cbr\u003e There was again a pause, and Sir Nathaniel endeavoured to get back to less emotional and more neutral ground.\n\u003cbr\u003e \n\u003cbr\u003e “Tell us of the rest of the meeting.\u0026nbsp; Remember we are all pledged to this.\u0026nbsp; It is a fight à l’outrance, and we can afford to throw away or forgo no chance.”\n\u003cbr\u003e \n\u003cbr\u003e “We shall throw away or lose nothing that we can help.\u0026nbsp; We fight to win, and the stake is a life—perhaps more than one—we shall see.”\u0026nbsp; Then he went on in a conversational tone, such as he had used when he spoke of the coming to the farm of Edgar Caswall: “When Mr. Caswall came in, the negro went a short distance away and there remained.\u0026nbsp; It gave me the idea that he expected to be called, and intended to remain in sight, or within hail.\u0026nbsp; Then Mimi got another cup and made fresh tea, and we all went on together.”\n\u003cbr\u003e \n\u003cbr\u003e “Was there anything uncommon—were you all quite friendly?” asked Sir Nathaniel quietly.\n\u003cbr\u003e \n\u003cbr\u003e “Quite friendly.\u0026nbsp; There was nothing that I could notice out of the common—except,” he went on, with a slight hardening of the voice, “except that he kept his eyes fixed on Lilla, in a way which was quite intolerable to any man who might hold her dear.”\n\u003cbr\u003e \n\u003cbr\u003e “Now, in what way did he look?” asked Sir Nathaniel.\n\u003cbr\u003e \n\u003cbr\u003e “There was nothing in itself offensive; but no one could help noticing it.”\n\u003cbr\u003e \n\u003cbr\u003e “You did.\u0026nbsp; Miss Watford herself, who was the victim, and Mr. Caswall, who was the offender, are out of range as witnesses.\u0026nbsp; Was there anyone else who noticed?”\n\u003cbr\u003e \n\u003cbr\u003e “Mimi did.\u0026nbsp; Her face flamed with anger as she saw the look.”\n\u003cbr\u003e \n\u003cbr\u003e “What kind of look was it?\u0026nbsp; Over-ardent or too admiring, or what?\u0026nbsp; Was it the look of a lover, or one who fain would be?\u0026nbsp; You understand?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir, I quite understand.\u0026nbsp; Anything of that sort I should of course notice.\u0026nbsp; It would be part of my preparation for keeping my self-control—to which I am pledged.”\n\u003cbr\u003e \n\u003cbr\u003e “If it were not amatory, was it threatening?\u0026nbsp; Where was the offence?”\n\u003cbr\u003e \n\u003cbr\u003e Adam smiled kindly at the old man.\n\u003cbr\u003e \n\u003cbr\u003e “It was not amatory.\u0026nbsp; Even if it was, such was to be expected.\u0026nbsp; I should be the last man in the world to object, since I am myself an offender in that respect.\u0026nbsp; Moreover, not only have I been taught to fight fair, but by nature I believe I am just.\u0026nbsp; I would be as tolerant of and as liberal to a rival as I should expect him to be to me.\u0026nbsp; No, the look I mean was nothing of that kind.\u0026nbsp; And so long as it did not lack proper respect, I should not of my own part condescend to notice it.\u0026nbsp; Did you ever study the eyes of a hound?”\n\u003cbr\u003e \n\u003cbr\u003e “At rest?”\n\u003cbr\u003e \n\u003cbr\u003e “No, when he is following his instincts!\u0026nbsp; Or, better still,” Adam went on, “the eyes of a bird of prey when he is following his instincts.\u0026nbsp; Not when he is swooping, but merely when he is watching his quarry?”\n\u003cbr\u003e \n\u003cbr\u003e “No,” said Sir Nathaniel, “I don’t know that I ever did.\u0026nbsp; Why, may I ask?”\n\u003cbr\u003e \n\u003cbr\u003e “That was the look.\u0026nbsp; Certainly not amatory or anything of that kind—yet it was, it struck me, more dangerous, if not so deadly as an actual threatening.”\n\u003cbr\u003e \n\u003cbr\u003e Again there was a silence, which Sir Nathaniel broke as he stood up:\n\u003cbr\u003e \n\u003cbr\u003e “I think it would be well if we all thought over this by ourselves.\u0026nbsp; Then we can renew the subject.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3244/88901.html","bookId":643,"creation":"Aug 5, 2019 2:28:42 AM","modification":"Aug 5, 2019 2:28:42 AM"}
