{"id":74466,"no":11,"title":"Page 11","content":"\u003cp\u003eShe wasn’t going to think about how much colder it was when Hale’s arm didn’t periodically drape across her shoulder, when his broad shoulders weren’t there to block the wind. She was the last person to care about Paraguay—or Uruguay—and whatever it was her family had decided to steal.\u003c/p\u003e\n\u003cp\u003eNo, Kat had more than enough work to do on her own, she told herself, walking a little faster, feeling a little surer. She was starting to consider calling Mr. Stein and making her next plan when she passed by a bar and heard the clink of glasses and the blaring television inside.\u003c/p\u003e\n\u003cp\u003e“The Cleopatra Emerald is one of the most famous gems in the world,” the anchorwoman was saying. “Famous for its size, its tragic legend, and—more recently—the drama that has followed it into the courts of the world. The private woman behind one of the most public court battles of recent years joins us tonight for her very first interview. Constance Miller, thank you for being here.”\u003c/p\u003e\n\u003cp\u003eAnd that was when Kat stopped. The world around her seemed to freeze as she stood, listening to the story of how Constance Miller’s father and mother and not Oliver Kelly the First had found that stone among the sands of Egypt. She’d heard the story before, of course. Once in legend, and once from a woman in the back of a diner in the rain. And now she heard it again, from a woman with a tweed jacket and a British accent.\u003c/p\u003e\n\u003cp\u003eFrom a woman whom Kat had never seen before.\u003c/p\u003e\n\u003cp\u003eIt wasn’t really an earthquake, Kat was certain. And yet it felt as if the buildings were shaking. She stood stock-still in the flow of the sidewalk. People washed over her like the tide, and yet she didn’t move.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” someone said, brushing against her, but Kat didn’t register the words. She didn’t feel a thing. Her mind was still hearing the same story from two faces, knowing at least one of them was a lie. A con.\u003c/p\u003e\n\u003cp\u003eHer phone rang, but the sound was coming from the other side of the world. Kat felt like she was moving in slow motion when she put her hand into her pocket and found the simple white card with the plain black letters that spelled the name Visily Romani.\u003c/p\u003e\n\u003cp\u003eWith one touch, Kat knew it was different from the card she and Gabrielle had seen in the Millers’ hotel room. The paper was softer, the lettering thicker. And there was no doubt in Kat’s mind that this card was real. Despite her training—her blood—Katarina Bishop couldn’t help but shiver as she turned the card over to read the handwritten words: Get it back.\u003c/p\u003e\n\u003cp\u003eCHAPTER 13\u003c/p\u003e\n\u003cp\u003eStanding at the threshold of the Brooklyn brownstone, Kat watched the light from the street drifting down the long narrow hall that led from the front stoop to the ancient kitchen. She knew what she’d find inside: the old staircase and office, the sitting room and a powder bath. Kat saw it all with her thief’s eyes. She knew which floorboards moaned and which door hinges squeaked, and yet she stood for a long time, staring into her great-uncle’s home as if it were the one place on earth she no longer had the right to tread. It felt as if a laser grid lay inside. A minefield. But also, answers.\u003c/p\u003e\n\u003cp\u003eAnd what Kat really needed was answers.\u003c/p\u003e\n\u003cp\u003e“Uncle Eddie!” she called into the dark house. The card was in her pocket and her heart was in her throat, pounding. She swallowed hard and tried again. “Uncle Eddie!”\u003c/p\u003e\n\u003cp\u003eShe crept past the sitting room, where no one ever sat, and down the hall, but the kitchen was empty and the stove was off and Kat knew without looking any farther that her uncle wasn’t there. She felt alone in the big house, trying to decide what to do. If Uncle Eddie had been there, he could have told her to sit or run, to eat or to cry. She wanted someone to do her thinking for her because she didn’t trust her own mind anymore. So she stood in the hallway, her thoughts on a constant loop, thinking…\u003c/p\u003e\n\u003cp\u003eI got conned.\u003c/p\u003e\n\u003cp\u003eI got conned.\u003c/p\u003e\n\u003cp\u003eI got…\u003c/p\u003e\n\u003cp\u003e“Kat?”\u003c/p\u003e\n\u003cp\u003eKat jumped. The lights flickered on, and Kat spun to take in the boy behind her.\u003c/p\u003e\n\u003cp\u003e“Jeez, Simon, you nearly scared me half to—”\u003c/p\u003e\n\u003cp\u003eShe stopped and studied him—he had on blue pajamas and his feet were bare. His black hair stood up at odd angles, and he didn’t look like a computer genius right then. No, he looked like a fire truck.\u003c/p\u003e\n\u003cp\u003e“Did you get some sun, Simon?” she asked.\u003c/p\u003e\n\u003cp\u003eSimon nodded. “Don’t ever set up an observation post on a water tower.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Kat said softly. She wanted to reach out and pat his back, but she didn’t know how far the burn went, and—more than that—she couldn’t quite forget that she was the one who needed comforting.\u003c/p\u003e\n\u003cp\u003e“Where’s Uncle Eddie?” Kat heard her voice break. She sounded and felt like a little girl when she told him, “I need Uncle Eddie.”\u003c/p\u003e\n\u003cp\u003e“He’s gone,” Simon said. “Left a couple of hours ago.\u003c/p\u003e\n\u003cp\u003eUncle Felix was trying to run a Groundhog with a Black-eyed Susan and…well…”\u003c/p\u003e\n\u003cp\u003e“Gas lines?” Kat guessed.\u003c/p\u003e\n\u003cp\u003eSimon nodded. “Gas lines. Eddie left for Paraguay as soon as he heard.” He glanced up and down the empty hall. “Where’s Hale?”\u003c/p\u003e\n\u003cp\u003eThere was an emptiness in Kat’s gut, a dizzy feeling in the back of her mind. Uncle Eddie had left. Hale was gone. Constance Miller—whoever she really was—was a whole different type of missing, and suddenly, Kat couldn’t take it. She had to do something, find something, be something other than the mark, so she pushed past Simon and into the office that she had seen used once or maybe twice in her entire life.\u003c/p\u003e\n\u003cp\u003eThere was only one small window in that tiny room, and the light from the street barely broke through the heavy blinds, so Kat reached for the switch. Filing cabinets lined one side, topped with boxes and old envelopes, half-finished crossword puzzles and magazines from decades long since past. Behind the desk sat a wall of bookshelves filled with papers and tools, and dusty maps of the sewer system under the Louvre.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Simon asked while Kat pulled open the top drawer of the filing cabinet closest to the door. The drawer was rusty and squeaked, but Uncle Eddie was a continent away, so she pulled harder, pushed through the files faster.\u003c/p\u003e\n\u003cp\u003eA shoe box full of old IDs.\u003c/p\u003e\n\u003cp\u003eBlueprints for a very large bank written almost entirely in Japanese.\u003c/p\u003e\n\u003cp\u003eBackground information on every guard at the Tower of London in 1980.\u003c/p\u003e\n\u003cp\u003e“Do you know if Uncle Eddie keeps anything about the other families?” She slammed the top drawer shut and jerked open the next.\u003c/p\u003e\n\u003cp\u003eShipping manifests for a tanker out of Stockholm.\u003c/p\u003e\n\u003cp\u003e“What about them?” Simon asked.\u003c/p\u003e\n\u003cp\u003eBlank letterhead from the ambassador to Ecuador.\u003c/p\u003e\n\u003cp\u003e“Names? Addresses? Any information about the other families—how to track them down.”\u003c/p\u003e\n\u003cp\u003eA ring of keys labeled Property of Montreal World’s Fair, DO NOT DUPLICATE.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Simon said. He sounded almost afraid, standing there, watching Kat slam the second drawer then step back and look at the piles and the boxes and the dust. Looking for answers.\u003c/p\u003e\n\u003cp\u003e“Simon, I need you to tell me if Uncle Eddie keeps a computer anywhere. Have you ever built him any databases or an address book or—”\u003c/p\u003e\n\u003cp\u003e“Kat.” Simon cut her off. “This is Uncle Eddie you’re talking about.”\u003c/p\u003e\n\u003cp\u003eShe pulled the chair out from behind the desk, pushed aside a perfectly-to-scale model of the Egyptian Museum in Cairo, and took a seat.\u003c/p\u003e\n\u003cp\u003e“Kat, what is going on?” Simon said in the manner of a boy who had given up on trying to understand anything that wasn’t made of ones and zeros. “What are you looking for?” Kat pulled open a desk drawer and ran her fingers through a million dollars in fake chips from a hotel that had never existed in Las Vegas. “What’s wrong?” he asked as she thumbed through a book about the catacombs and passageways that still ran beneath Vatican City.\u003c/p\u003e\n\u003cp\u003e“Kat!” Simon yelled this time. He pulled the book out of her frantic hands. “Kat, where is Hale?”\u003c/p\u003e\n\u003cp\u003eAnd suddenly Kat knew she couldn’t hide. Couldn’t run. Couldn’t lie.\u003c/p\u003e\n\u003cp\u003e“Hale is…” she started slowly.\u003c/p\u003e\n\u003cp\u003e“I’m right here.”\u003c/p\u003e\n\u003cp\u003eAnd there he was, standing in the hallway at Simon’s back. When Gabrielle appeared at his side, Kat didn’t know what she was feeling: relief or embarrassment. Shame or guilt.\u003c/p\u003e\n\u003cp\u003eShe tried to smile. “I thought you were heading to Paraguay.”\u003c/p\u003e\n\u003cp\u003eHe dropped the duffel bag to the ground and leaned against the door frame. “Yeah, but then I saw the most interesting thing on the news.”\u003c/p\u003e\n\u003cp\u003eThere was only one chair in the dusty office, little light, no food, but those weren’t the reasons why they left. The kitchen was simply where these things were discussed, so the kitchen was where they went. Well, all of them but Katarina. Kat stayed by the door.\u003c/p\u003e\n\u003cp\u003e“So how was Paraguay?” Gabrielle asked as she and Hale and Simon took their places at the table.\u003c/p\u003e\n\u003cp\u003e“There were mosquitoes. I hate mosquitoes.” Simon scratched at his leg, but his gaze drifted from Gabrielle to Hale and finally to Kat. “What happened?”\u003c/p\u003e\n\u003cp\u003eHale and Gabrielle looked at Kat. Kat looked away.\u003c/p\u003e\n\u003cp\u003e“We have a sort of…situation,” Hale said.\u003c/p\u003e\n\u003cp\u003eTo Hale’s right, Simon winced. “Here,” Gabrielle said, reaching for the burn cream Uncle Eddie kept over the stove. She grabbed the younger boy by the top of the head and said, “Hold still.”\u003c/p\u003e\n\u003cp\u003e“Was it the Russians?” Simon asked. No one answered. “Brazil?” His voice was rising higher. “Don’t tell me someone from the Henley finally—”\u003c/p\u003e\n\u003cp\u003e“It’s Romani.” Kat’s voice cut him off. “Or…we thought it was Romani—I thought it was him. But then…”\u003c/p\u003e\n\u003cp\u003e“Kat.” Hale was up and crossing the room. In a split second he reached her. “I believed them too.”\u003c/p\u003e\n\u003cp\u003e“But I should know better.”\u003c/p\u003e\n\u003cp\u003e“So it’s okay if I get taken?”\u003c/p\u003e\n\u003cp\u003eShe could tell she’d hurt him, and she hadn’t even tried. “You wanted to leave, Hale. You tried to get me to leave.”\u003c/p\u003e\n\u003cp\u003e“Um…can someone please tell me what happened?”\u003c/p\u003e\n\u003cp\u003eWhen Kat turned back to Simon, his face was oozing and covered with cream.\u003c/p\u003e\n\u003cp\u003e“We stole the Cleopatra Emerald,” Gabrielle said simply, and Simon’s face turned an even deeper shade of crimson.\u003c/p\u003e\n\u003cp\u003e“You stole the…You stole the…You stole the…How? Why? How?”\u003c/p\u003e\n\u003cp\u003e“Alice in Wonderland,” Gabrielle said simply. “Kitty here swapped the real for a fake and zoomed right out the rabbit hole without anyone suspecting a thing.” She smiled at her cousin as if she were finally starting to approve. “It was beautiful.”\u003c/p\u003e\n\u003cp\u003e“No.” Kat shook her head. “It wasn’t.”\u003c/p\u003e\n\u003cp\u003e“But…” Simon’s eyes were wide. His voice was cracking. “But Uncle Eddie says that the Cleopatra Emerald is—”\u003c/p\u003e\n\u003cp\u003e“It’s not cursed,” Hale said, but Kat couldn’t shake the feeling that she wasn’t so sure. Cleopatra jobs always end badly.\u003c/p\u003e\n\u003cp\u003eShe fingered the card in her pocket and took her place at the table. “They said Romani sent them,” Kat explained. “They said they were the stone’s rightful owners and that Romani had sent them, and I…” \u003c/p\u003e","sourceLink":"https://allnovel.net/uncommon-criminals-heist-society-2/page-11.html","bookId":2404,"creation":"Oct 5, 2019 10:31:32 AM","modification":"Oct 5, 2019 10:31:32 AM"}
