{"id":74470,"no":15,"title":"Page 15","content":"\u003cp\u003e“Not as much as having your son locked in a room at the Henley will do.”\u003c/p\u003e\n\u003cp\u003eKat shrugged. “Sorry about that.”\u003c/p\u003e\n\u003cp\u003e“No problem.” Nick glanced from Kat to the dusty file box with the big green stone on its label. “Doing some research?”\u003c/p\u003e\n\u003cp\u003e“Article for the high school paper. You?”\u003c/p\u003e\n\u003cp\u003e“Take Your Son to Work Day.” His lie was just as quick and almost as easy as her own.\u003c/p\u003e\n\u003cp\u003e“Kat!” Hale was screaming in her ear. “Kat, where are you? I’m coming back in to get you.”\u003c/p\u003e\n\u003cp\u003e“No,” Kat said, and the look in Nick’s eyes told her that he knew exactly what she was thinking.\u003c/p\u003e\n\u003cp\u003e“Time to go?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Kat said, pushing the box out from underneath the desk and starting to follow. But just then, Nick reached out and held her arm.\u003c/p\u003e\n\u003cp\u003e“Where are you going?”\u003c/p\u003e\n\u003cp\u003e“Away,” Kat said, as if the answer should be obvious.\u003c/p\u003e\n\u003cp\u003e“Don’t use the main stairs,” he warned, then pointed to a dark corner in the distance. “There’s an emergency exit back there. I think someone disabled the sensors and rigged the lock this morning.”\u003c/p\u003e\n\u003cp\u003e“Oh, someone did?” she asked.\u003c/p\u003e\n\u003cp\u003eNick nodded, crawled from under the desk, and turned in the direction his mother was heading.\u003c/p\u003e\n\u003cp\u003e“Nick?” Kat risked the extra second and the noise. She lifted the box. “What file were you looking for?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Yours.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 17\u003c/p\u003e\n\u003cp\u003eIt was relatively easy to get to the plane. Customs was no problem. What was difficult, Kat realized, was staring through the windows of the New York–bound private jet and seeing for the first time that the world was a totally different place than you had ever thought it to be.\u003c/p\u003e\n\u003cp\u003e“What about her?” Simon asked. He’d taped a white sheet to the bulkhead at the front of the cabin, and Kat turned back to it, looked at the image on the makeshift screen of a gorgeous woman dressed exactly like the Crown Princess Anastasia. “Of course, this was taken fifty years ago, but—”\u003c/p\u003e\n\u003cp\u003e“No,” Kat said, and shook her head.\u003c/p\u003e\n\u003cp\u003e“Her?” Simon asked, and the image changed to a young woman in a sarong, riding an elephant.\u003c/p\u003e\n\u003cp\u003eAnother “No,” this time from Hale.\u003c/p\u003e\n\u003cp\u003e“What about her?”\u003c/p\u003e\n\u003cp\u003e“That’s Uncle Felix in drag, Simon,” Kat told him.\u003c/p\u003e\n\u003cp\u003e“Oh, yeah,” Simon and Hale said, tilting their heads and staring at a surprisingly striking figure in an equally striking hat at the royal wedding of Charles and Diana.\u003c/p\u003e\n\u003cp\u003eHale was systematically shifting through the mound of files that Kat had carried from Interpol’s basement. Simon had his computers and wires and screens, and soon data from Interpol began flashing through the cabin at 32,000 feet.\u003c/p\u003e\n\u003cp\u003eKat herself was left to stare out the window at the tiny towns and green countryside that eventually gave way to deep blue ocean, thinking that it wasn’t such a small world after all. Sure, it was an odd thing to realize for the first time at the age of fifteen, but the brownstone’s kitchen was no more than a twelve-by-twelve room.…With the exception of three short months the previous fall, Kat had never known a world where everyone didn’t know her father and hadn’t loved her mother, where Eddie wasn’t “Uncle” to every soul she knew.\u003c/p\u003e\n\u003cp\u003eSo Kat stared out at the vastness and whispered, “The world”—she reached to touch the glass—“is big.”\u003c/p\u003e\n\u003cp\u003e“And cursed,” Gabrielle added, maneuvering her bruised body awkwardly into the plush leather chair across from Kat’s. She plopped her swollen ankle onto her cousin’s lap. “So, Katarina, back at Interpol…you were late.”\u003c/p\u003e\n\u003cp\u003eEven the best cons eventually meet someone to whom they cannot lie, and like it or not, Kat realized, for her that person was Gabrielle. In the deep silence that passed between them, both cousins seemed to know it.\u003c/p\u003e\n\u003cp\u003e“Got delayed,” Kat answered.\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“It’s not a big deal,” Kat tried.\u003c/p\u003e\n\u003cp\u003e“I’m sure it’s not.”\u003c/p\u003e\n\u003cp\u003e“There was a hitch.” Kat shrugged.\u003c/p\u003e\n\u003cp\u003e“There always is.” Gabrielle leaned closer and whispered, “Just tell me, does this hitch have a name?”\u003c/p\u003e\n\u003cp\u003eKat started to answer, but just then her cousin’s eyes went wide, and Kat knew, without looking, that Hale was standing behind her. She felt his hands settle on her shoulders as he leaned over the seat.\u003c/p\u003e\n\u003cp\u003e“Hey.”\u003c/p\u003e\n\u003cp\u003eShe looked up at him. “Hey.”\u003c/p\u003e\n\u003cp\u003e“You okay?” he asked, taking the seat beside her. He felt big and warm and safe and…terrifying. Yeah, terrifying was definitely the right word, because he leaned close to examine Gabrielle’s ankle, and all Kat could do was think, I kissed you. I kissed you. I kissed you!\u003c/p\u003e\n\u003cp\u003e“Kat?” Hale asked again.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she said, a little too quickly.\u003c/p\u003e\n\u003cp\u003eHale looked at Gabrielle, who crossed her arms, stared at her cousin, and said, “Okay. Now the real answer.”\u003c/p\u003e\n\u003cp\u003e“Nothing. It’s just that…” Kat shook her head and turned back to the window. “The world is big.”\u003c/p\u003e\n\u003cp\u003eIn the reflection of the glass she saw Hale. He reminded her of her father, full of charm and hope. “Not so big, right?” he said. “There are…what? Six major families?”\u003c/p\u003e\n\u003cp\u003e“Seven,” Kat and Gabrielle answered together.\u003c/p\u003e\n\u003cp\u003eHale pointed to one of Simon’s computers. “But this says six.”\u003c/p\u003e\n\u003cp\u003e“The Australians sort of split in the eighties.”\u003c/p\u003e\n\u003cp\u003e“Nasty business.” Gabrielle shivered. “Never get between two brothers and a sunken ship from the Spanish Armada. Trust me.”\u003c/p\u003e\n\u003cp\u003e“Okay, good.” Hale stood and strolled to where Simon sat with his computers. “Seven families. That’s a start. What else do we have?”\u003c/p\u003e\n\u003cp\u003e“Well,” Gabrielle said with a sigh, “we know she was smart enough to find Kat and play her—no offense.”\u003c/p\u003e\n\u003cp\u003e“None taken,” Kat said.\u003c/p\u003e\n\u003cp\u003e“And…” Gabrielle spoke slowly, emphasizing every word, “she’s a woman.”\u003c/p\u003e\n\u003cp\u003e“Very good, Gabrielle,” Hale tried to mock, but then he read the expression on Kat’s face. “What?”\u003c/p\u003e\n\u003cp\u003e“How many girls do you know in this business?” she asked him.\u003c/p\u003e\n\u003cp\u003e“Well…I know you two…” He trailed off, utterly stumped.\u003c/p\u003e\n\u003cp\u003e“Exactly. It’s a boys’ club, big guy.” Gabrielle crossed her good leg over the other as if to say she wouldn’t have it any other way. “There can’t be that many women who—”\u003c/p\u003e\n\u003cp\u003eSimon looked up from his keyboard. “According to Interpol, there are nine hundred and seventy-six.” He pointed to the images on the screen that were flashing through at regular intervals. “These are just the ones they have pictures for—which isn’t saying much. Most are just names—a lot are probably aliases. It would help if we had an age.”\u003c/p\u003e\n\u003cp\u003e“Fifty?” Hale guessed at the exact time Kat said, “Eighty?”\u003c/p\u003e\n\u003cp\u003e“Or a range…” Simon said, putting the data into the computer. “What about a nationality?”\u003c/p\u003e\n\u003cp\u003e“She used a British accent, but…” Hale started.\u003c/p\u003e\n\u003cp\u003e“She could be from anywhere,” Kat went on. “She could be on her way to anywhere. Let’s face it, guys” —Kat shook her head—“this woman could be anyone.”\u003c/p\u003e\n\u003cp\u003e“Not anyone,” Hale said. “I mean, I’m fairly certain she isn’t my aunt Myrtle.”\u003c/p\u003e\n\u003cp\u003eKat felt her hopes falling. “And even if we know who she is—it doesn’t give us a clue where she is or why she…and her grandson…did it.”\u003c/p\u003e\n\u003cp\u003eHale laughed. “Even on the black market, the emerald’s got to be worth millions of dollars, Kat. That’s plenty of reason right there.”\u003c/p\u003e\n\u003cp\u003e“But why do it this way?” Kat had to ask. “Why risk the wrath of Eddie and tick off an entire family if you can help it?”\u003c/p\u003e\n\u003cp\u003e“Easy.” Hale sat down and kicked his feet up. “They couldn’t help it.”\u003c/p\u003e\n\u003cp\u003e“But…why?” Kat asked. It felt good to fixate on the question, the puzzle. “Why risk having us do their dirty work when anybody who’d know the name Romani would also know a half dozen crews just as good? This woman…” Kat trailed off, words failing, as if she couldn’t even trust herself to speak.\u003c/p\u003e\n\u003cp\u003e“What?” Gabrielle asked, inching closer.\u003c/p\u003e\n\u003cp\u003e“It was nothing. Just…for a second I thought—”\u003c/p\u003e\n\u003cp\u003e“You knew her?” Gabrielle guessed.\u003c/p\u003e\n\u003cp\u003eKat thought about the moment in the park—the look in the woman’s eyes when she’d called to Kat and said thank you.\u003c/p\u003e\n\u003cp\u003e“No. It was more like she knew me. Like she was appraising me and the job. Like she knew better than some little old lady from Loxley, and so I should have known better.” Kat felt herself trying to find the right words. “She looked at me like Uncle Eddie looks at me.”\u003c/p\u003e\n\u003cp\u003e“The female Uncle Eddie.” Gabrielle’s voice was full of awe and fear in equal measure, like the woman was a cross between a dragon and a unicorn—just as mythical and twice as deadly.\u003c/p\u003e\n\u003cp\u003eThere was a TV on in the background, and the anchors talked of moving weather fronts and falling stock prices, as if those were the things in the world that really mattered.\u003c/p\u003e\n\u003cp\u003e“Uh…guys,” Simon said, but Kat had turned back to the window.\u003c/p\u003e\n\u003cp\u003e“Why con us into stealing the Cleopatra Emerald?” she said quietly, repeating the question that was sending them across the ocean and back again. It was the question, Kat knew, that could haunt her for the rest of her life.\u003c/p\u003e\n\u003cp\u003e“Guys…” Simon said again, voice rising, but Kat was lost in thought, staring at the glass.\u003c/p\u003e\n\u003cp\u003e“Why con us?” she whispered.\u003c/p\u003e\n\u003cp\u003e“Maybe because of…” Simon seemed to lose his voice before choking out, “That?”\u003c/p\u003e\n\u003cp\u003eKat spun back in time to see him raise a finger and point at the TV and the picture of the woman that Kat had come to know as Constance Miller. For a second, she thought Simon had found her somewhere among Interpol’s files—until she realized the picture was live, and the woman was standing under the glare of what seemed like a thousand flashing bulbs, holding the Cleopatra Emerald out for all to see.\u003c/p\u003e\n\u003cp\u003eSimon cleared his throat. “Okay, is it just me, or does this make her the worst thief ever?”\u003c/p\u003e\n\u003cp\u003eCHAPTER 18\u003c/p\u003e\n\u003cp\u003eAlthough the plane was state of the art, the pilots perfectly trained, Kat couldn’t shake the feeling that they were falling, plummeting out of the sky. That was the only thing that could explain the knot in her stomach as Simon turned up the volume on the TV and she read the words at the bottom of the screen. Live News Conference: Monaco.\u003c/p\u003e\n\u003cp\u003e“Did they find the fake?” Hale said, leaning closer to the screen. “Is it an arrest?”\u003c/p\u003e\n\u003cp\u003e“No.” Kat’s voice was flat and even, as if she were watching it all from outside her body. She had the kind of distance—the perspective—that would make even her great-uncle proud. “It’s a con.”\u003c/p\u003e\n\u003cp\u003eTogether they watched as a balding man in a nice suit stepped behind the podium. “Mesdames et messieurs, members of the press, I am Pierre LaFont of the LaFont Auction House here in Monaco. On behalf of Mrs. Brooks and myself, I thank you for coming today.” \u003c/p\u003e","sourceLink":"https://allnovel.net/uncommon-criminals-heist-society-2/page-15.html","bookId":2404,"creation":"Oct 5, 2019 10:31:32 AM","modification":"Oct 5, 2019 10:31:32 AM"}
