{"id":74475,"no":20,"title":"Page 20","content":"\u003cp\u003eThe child who had never had a house felt homesick. The thief who had robbed the Henley wanted help. And the girl who’d walked away from her family business came to realize that, no matter what she did, she never could leave the kitchen.\u003c/p\u003e\n\u003cp\u003e“So…someone stole the Cleopatra,” Hamish said, as if he couldn’t take the silence one minute more.\u003c/p\u003e\n\u003cp\u003eHis brother gave a low whistle and shook his head. “Wish we’d been around for that.”\u003c/p\u003e\n\u003cp\u003e“No.” Gabrielle repositioned her ice pack. “You don’t.”\u003c/p\u003e\n\u003cp\u003e“Angus,” Kat said, turning to the brothers. “Hamish, her real accent is British. Do you know her?”\u003c/p\u003e\n\u003cp\u003eThe two brothers stared, each daring the other to speak.\u003c/p\u003e\n\u003cp\u003e“No,” Amish said softly.\u003c/p\u003e\n\u003cp\u003e“How bad is it?” Hale asked her.\u003c/p\u003e\n\u003cp\u003e“Bad,” Kat said. She stared down at the granite, trying to find a pattern in the specks of light and dark, but there was no sense to be found in it. “We’re blown. She knows both of you.” She pointed between Hale and Gabrielle.\u003c/p\u003e\n\u003cp\u003e“She doesn’t know me,” Simon said.\u003c/p\u003e\n\u003cp\u003eKat laughed. “I think we should assume she knows everyone. It would be like…” She shook her head, tried to bring her mind back into focus.\u003c/p\u003e\n\u003cp\u003e“Uncle Eddie,” Gabrielle finally finished for her. “It would be like trying to con Uncle Eddie.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Kat said. “She knows…everything.”\u003c/p\u003e\n\u003cp\u003e“Like what?” Gabrielle asked.\u003c/p\u003e\n\u003cp\u003e“Like who we are…Like why we’re here…Like every con we could possibly run to get the emerald back…”\u003c/p\u003e\n\u003cp\u003e“So?” Hale asked.\u003c/p\u003e\n\u003cp\u003e“So she’s better than I am!”\u003c/p\u003e\n\u003cp\u003ePart of Kat hoped that at least one member of her crew would exclaim, Of course not ! Another part of her presumed that someone might say, Don’t be ridiculous. But no one quoted her résumé. Not a soul mentioned the Henley.\u003c/p\u003e\n\u003cp\u003e“We can’t do it,” Kat admitted slowly. “We just can’t…win.”\u003c/p\u003e\n\u003cp\u003eHamish smiled and rubbed his hands together. “Sure we can. What do you say? Pigs in a Blanket?” He leaned over the cool counter and raised his eyebrows at Gabrielle.\u003c/p\u003e\n\u003cp\u003e“The only way I’ll get under a blanket with you is if both of us are on fire,” she told him.\u003c/p\u003e\n\u003cp\u003e“You guys don’t get it,” Kat snapped. “We can’t con her.\u003c/p\u003e\n\u003cp\u003eShe knows all the old cons. She probably invented half of them.”\u003c/p\u003e\n\u003cp\u003e“So we think of some new ones.” Gabrielle rose.\u003c/p\u003e\n\u003cp\u003e“She knows us.” Kat looked at Hale.\u003c/p\u003e\n\u003cp\u003e“So we don’t rely on us,” Hale countered.\u003c/p\u003e\n\u003cp\u003e“She knows Uncle Eddie. I’d bet money she knows everyone we know.”\u003c/p\u003e\n\u003cp\u003eHale moved closer. “So we find someone she doesn’t know.”\u003c/p\u003e\n\u003cp\u003eThe ship was moving, slipping farther and farther from the shore, and yet it felt as if the whole world was watching. The kitchen was too crowded. Kat’s stomach turned, and so she kept her gaze on Hale, as if he were a solid point on the horizon that she was going to focus on until she could no longer feel the yacht rock or sway.\u003c/p\u003e\n\u003cp\u003e“We’re going to find someone she doesn’t know,” Hale said again.\u003c/p\u003e\n\u003cp\u003eRight then, Kat swore she wouldn’t look away for anything, but that was before she heard the footsteps, saw the shadow in the doorway, and heard the voice that asked, “You mean someone like me?”\u003c/p\u003e\n\u003cp\u003eCHAPTER 24\u003c/p\u003e\n\u003cp\u003eThe first time Kat had seen the boy who stood framed in the doorway, they’d both been standing on a street corner in Paris. Their first conversation had been over a picked lock and a picked pocket, and Kat had had a sneaking suspicion that she was in the room with someone with a great deal of natural talent and the subsequent disrespect for laws and truth. But those weren’t the moments that came to Kat’s mind as the whole room stood staring, waiting to see what other surprises might be lurking on the other side of that door.\u003c/p\u003e\n\u003cp\u003e“What?” Nick asked, looking at the awestruck teens. “You can’t recognize me when you aren’t leaving me in a locked gallery for the police to find?”\u003c/p\u003e\n\u003cp\u003e“Oh, don’t be silly, Nicholas,” Gabrielle said, casually inspecting her nails. “We knew museum security would find you long before the cops did.”\u003c/p\u003e\n\u003cp\u003e“Sweet as always, Gabrielle.” Nick nodded at the girl, then turned to Simon and the Bagshaws. “Fellas…sorry to barge in.”\u003c/p\u003e\n\u003cp\u003e“I think the technical term is stow away,” Hale said.\u003c/p\u003e\n\u003cp\u003eNick snapped his fingers. “I think you’re right.”\u003c/p\u003e\n\u003cp\u003e“What?” Hale looked him up and down. “No wet suit?”\u003c/p\u003e\n\u003cp\u003e“Didn’t want to mess up my hair,” Nick said with a smile.\u003c/p\u003e\n\u003cp\u003eAnd through it all, Kat sat speechless.\u003c/p\u003e\n\u003cp\u003e“Boys, boys,” Gabrielle said, leaning against the counter like a jazz singer from the thirties. “Play nice.”\u003c/p\u003e\n\u003cp\u003e“I am nice,” Hale said, but his voice was made of glass. “I was just about to ask our old friend Nick how Paris is these days.”\u003c/p\u003e\n\u003cp\u003e“Lyon,” Nick corrected. “My mom’s at Interpol headquarters now.” His gaze slid sideways to Kat. “Or didn’t you know?”\u003c/p\u003e\n\u003cp\u003eHe sounded perfectly straight when he said it, and that was when Kat realized two very important things: the first was that Nick was going to keep her secret. The second was that Nick…was good. She wasn’t sure which she wanted to think about, so instead she just said, “How long have you been here?”\u003c/p\u003e\n\u003cp\u003e“Long enough.”\u003c/p\u003e\n\u003cp\u003e“And exactly why are you here?” Kat asked. “The last time you offered your services, I seem to remember you secretly planning to catch us all red-handed and turn us over to Interpol. Or are you out of your family business?”\u003c/p\u003e\n\u003cp\u003eKat saw her reflection in the windows. There was nothing beyond the glass but an empty expanse of black.\u003c/p\u003e\n\u003cp\u003e“Maybe I switched sides.” Nick ran a hand along the granite island. “Maybe I came all this way to help you steal the Antony Emerald.”\u003c/p\u003e\n\u003cp\u003e“It’s not the Antony,” Hale corrected.\u003c/p\u003e\n\u003cp\u003e“Interpol sent a team to help authenticate it,” Nick told them. “It’s real, Kat.”\u003c/p\u003e\n\u003cp\u003e“Oh, it’s a real emerald, all right,” Gabrielle said, then smiled smugly. “It’s just not the Antony.”\u003c/p\u003e\n\u003cp\u003e“No,” Nick said. “Can’t be. The only other emerald that size is…”\u003c/p\u003e\n\u003cp\u003e“Oh yeah. It’s the Cleopatra,” Gabrielle told him.\u003c/p\u003e\n\u003cp\u003e“How do you know?” Nick asked.\u003c/p\u003e\n\u003cp\u003e“We know,” Kat said slowly, “because we’re the ones who stole it.”\u003c/p\u003e\n\u003cp\u003eLying awake in the king-size bed she shared with Gabrielle, Kat stared up at the chandelier that hung overhead, watched it sway like a pendulum with the waves.\u003c/p\u003e\n\u003cp\u003eWhen she tossed and turned, she tried to blame the sea. When sleep didn’t come, she wanted to think it was because of Gabrielle’s snoring. But when Gabrielle began to kick, Kat knew there was no use in fighting. A fully conscious Gabrielle was a force to be reckoned with. A sleeping (and possibly cursed) Gabrielle was a whole other level of dangerous, so Kat slipped from the bed and quietly toward the door.\u003c/p\u003e\n\u003cp\u003eThe phone was right where she’d left it. The number was one she knew by heart. And as she stepped out onto the deck, she realized it was early evening in Paraguay. Or was it Uruguay? It didn’t really matter, Kat thought as she stood, waiting to be able to say, “Hi, Daddy.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” he asked, and Kat laughed.\u003c/p\u003e\n\u003cp\u003e“Nothing. I just—”\u003c/p\u003e\n\u003cp\u003e“Kat, what is wrong?”\u003c/p\u003e\n\u003cp\u003e“I missed you. Is missing you not allowed?”\u003c/p\u003e\n\u003cp\u003e“No, it is allowed. In fact, it’s my preference. But you don’t exactly have a track record of preferential behavior.”\u003c/p\u003e\n\u003cp\u003eKat leaned against the railing and whispered, “I miss you.”\u003c/p\u003e\n\u003cp\u003e“You said that already,” her father told her from the other side of the world.\u003c/p\u003e\n\u003cp\u003e“Yeah, but this time I really mean it.”\u003c/p\u003e\n\u003cp\u003e“So, word on the street is that your cousin has conned you into something with a count.”\u003c/p\u003e\n\u003cp\u003e“A duke,” Kat corrected. “We’re—”\u003c/p\u003e\n\u003cp\u003e“So what are you really doing?”\u003c/p\u003e\n\u003cp\u003e“Scoping the caves around Zurich, looking for a Degas no one’s seen in sixty years.”\u003c/p\u003e\n\u003cp\u003eShe could almost imagine the smile on her father’s face when he said, “That’s my girl.”\u003c/p\u003e\n\u003cp\u003eIt was too cold on the deck, and Kat wished she’d brought a jacket, wished she’d waited for the sun. She imagined her father, tanned and tired and happy. She thought of Maggie, and for a second, considered begging for forgiveness or pleading for help, but Kat couldn’t do either. She had too much of her uncle’s pride, too little of her father’s charm. Kat was just…Kat—chasing after the past, and doing it, for better or worse, all on her own.\u003c/p\u003e\n\u003cp\u003eAfter she had said good-bye to her father, Kat stayed outside for a long time, staring at the water.\u003c/p\u003e\n\u003cp\u003e“Don’t fall in.”\u003c/p\u003e\n\u003cp\u003eKat jumped at the sound of Hale’s voice, then slowly turned to face him.\u003c/p\u003e\n\u003cp\u003e“Don’t say that. With the way our luck is going, at least one of us is bound to end up overboard before this thing is through.”\u003c/p\u003e\n\u003cp\u003eShe felt him come to stand beside her, taking his place at the rail.\u003c/p\u003e\n\u003cp\u003e“So what are you doing out here in the middle of the night?”\u003c/p\u003e\n\u003cp\u003e“Thinking.”\u003c/p\u003e\n\u003cp\u003e“See.” Hale pointed at her. “Right there. That is your problem.”\u003c/p\u003e\n\u003cp\u003eIt was long past midnight, and the Mediterranean waters looked like ink as they lapped against the W. W. Hale’s white hull. The lights of places like Saint-Tropez and Nice were tiny diamonds in the distance, and it felt to Kat as if she and Hale were closer to the moon than any other living soul or thing.\u003c/p\u003e\n\u003cp\u003e“You didn’t hear her today, Hale. She’s so…good.”\u003c/p\u003e\n\u003cp\u003e“You said that.”\u003c/p\u003e\n\u003cp\u003e“She’s seen everything. She’s done everything. Hey”—she pointed at him—“maybe a Catherine the Great? You know, Uncle Felix posed as a curator at the Cairo Museum one year, and—”\u003c/p\u003e\n\u003cp\u003e“For a while there, it looked like you were giving up on this,” he whispered.\u003c/p\u003e\n\u003cp\u003e“I know, but I thought that if we—”\u003c/p\u003e\n\u003cp\u003e“Kat…”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Stop thinking.”\u003c/p\u003e\n\u003cp\u003eOf all the things that had been asked of Kat in her fifteen years, that was perhaps the hardest. But she tried—she really did. To forget about the lapping waves and deep blue water. To ignore the ticking clock, the mounting odds, and the tiny voice in the back of her mind saying, I kissed you. I kissed you. I kissed you.\u003c/p\u003e\n\u003cp\u003eAnd you left.\u003c/p\u003e\n\u003cp\u003e“You’re the only friend I’ve ever had, Hale. You know that, right?”\u003c/p\u003e\n\u003cp\u003e“Don’t lie—”\u003c/p\u003e\n\u003cp\u003eKat shook her head. “If I were lying, it would sound a lot better than that.” She saw Hale draw a breath and ease toward her, but Kat talked on. “In my family, we take our cons seriously, you know? Like Grandmother’s pearls, or the good china. They’ve been handed down for years. Centuries. Someone taught Uncle Eddie, and Uncle Eddie taught my mom. And Mom taught Dad, and Dad taught—” \u003c/p\u003e","sourceLink":"https://allnovel.net/uncommon-criminals-heist-society-2/page-20.html","bookId":2404,"creation":"Oct 5, 2019 10:31:32 AM","modification":"Oct 5, 2019 10:31:32 AM"}
