{"id":74458,"no":3,"title":"Page 3","content":"\u003cp\u003eKat felt Hale’s leg pressing against hers under the table, but neither of them said a word. Neither of them had to.\u003c/p\u003e\n\u003cp\u003e“He took it all, Miss Bishop. In the two weeks my mother lay near death, my parents’ assistant took everything they’d worked for their entire lives.”\u003c/p\u003e\n\u003cp\u003e“He claimed the find?” Kat guessed.\u003c/p\u003e\n\u003cp\u003e“Worse,” the woman said. “He packed everything up and began to sell it. Not one piece was logged. Nothing was chronicled or examined. Artifacts were crammed into steamers and hauled across the Mediterranean. History was sold to the highest bidder at a time when the world paid very well for the treasures of the kings. Or queens, as the case may be.”\u003c/p\u003e\n\u003cp\u003eThen the woman reached for a handkerchief, but she didn’t start to cry. She just studied Kat and Hale and told them, “My parents were discredited and penniless—the laughingstock of the archaeological world. The find of their careers was gone—taken by the person they’d trusted most.”\u003c/p\u003e\n\u003cp\u003e“But surely they’d told people?” Hale didn’t even try to hide the skepticism in his voice. “Surely someone knew what they’d been working on and what they’d found.”\u003c/p\u003e\n\u003cp\u003e“Oh, but it was a wild place, Mr. Hale. Those were dangerous times. Looters were everywhere—grave robbers, treasure seekers. Real archaeologists were incredibly careful with their work. Secrecy was paramount.”\u003c/p\u003e\n\u003cp\u003e“But after…” Kat started.\u003c/p\u003e\n\u003cp\u003eThe woman huffed. “After? After, they were broken and abandoned. After, they had nothing but their pride and their children. I, Miss Bishop…My brother and I were the only things they carried out of that sand, and soon I too will turn to dust.” She took a deep breath, and her delicate hands gripped the handkerchief tighter. “It is too late for my parents to have what was theirs. But it’s not too late for Egypt to have what is Egypt’s.”\u003c/p\u003e\n\u003cp\u003eShe placed her palms on the table and leaned forward, a new urgency in her eyes. It was the look of a woman with a purpose—a plan.\u003c/p\u003e\n\u003cp\u003e“There is a museum in Cairo that will take the stone if I can deliver it to them. They should have had it a half century ago, but better late than never.” Then she stopped. She seemed to be studying Kat anew when she said, “It must be a wonderful feeling to take something beautiful and return it to its rightful home. Wouldn’t you agree, Katarina?”\u003c/p\u003e\n\u003cp\u003e“What…” Kat shook her head. “What did Visily Romani tell you about me?”\u003c/p\u003e\n\u003cp\u003e“That you steal things.” Again, the woman gave a soft laugh. Kat tried to see something of the girl from the picture in her eyes, but too much time and sun and sand stood between them.\u003c/p\u003e\n\u003cp\u003eHale sat up a little straighter. “Your parents’ assistant’s name was Kelly?”\u003c/p\u003e\n\u003cp\u003eThe woman smiled. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Oliver Kelly?” Hale asked.\u003c/p\u003e\n\u003cp\u003eThe woman laughed again and searched Kat’s eyes. “Yes, Katarina, the founder of the world’s greatest auction house was a coward, a plunderer…a thief.”\u003c/p\u003e\n\u003cp\u003eOutside, a cold rain was falling. Kat could hear the drops landing against the diner’s windows, and she thought of Warsaw and the look in Abiram Stein’s eyes as he’d talked about war and Nazis and paintings.\u003c/p\u003e\n\u003cp\u003e“Look at that picture, Katarina.” The woman slid the snapshot farther across the table.\u003c/p\u003e\n\u003cp\u003e“It’s a lovely—”\u003c/p\u003e\n\u003cp\u003e“Look closer.”\u003c/p\u003e\n\u003cp\u003eKelly. Egypt. Cleopatra. The words filled the room like the aroma of coffee and sound of the rain. Kat looked down once more and saw a little girl in a long white dress, an ornate room, two tanned hands, and the largest gem that Katarina Bishop had ever seen.\u003c/p\u003e\n\u003cp\u003e“Is that—”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“So this is—”\u003c/p\u003e\n\u003cp\u003eThe grandson swallowed. “Yes.”\u003c/p\u003e\n\u003cp\u003e“And you want us to—”\u003c/p\u003e\n\u003cp\u003e“Your friend Mr. Romani assured us that you’re perfectly qualified. If it’s a matter of financing, I’m afraid our legal efforts have left us rather poorer than we once were, but we have some assets we could liquidate. This”—the woman gripped an antique locket that hung from a chain around her neck—“I know a dealer who would give me five hundred pounds for it.”\u003c/p\u003e\n\u003cp\u003e“It’s not money,” Kat said, shaking her head. “It’s just that…you want us to track down and steal the Cleopatra Emerald?”\u003c/p\u003e\n\u003cp\u003e“The Cleopatra Emerald?” Hale added for emphasis.\u003c/p\u003e\n\u003cp\u003e“Oh yeah.” For the first time, the grandson smiled. “The one that’s cursed.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 5\u003c/p\u003e\n\u003cp\u003eIt didn’t matter that it was raining when Kat and Hale left the diner—they waved Marcus and the long black car away. It felt good, somehow, to walk in the cold wind with their collars turned up, shivering against the dreary mist. Their thoughts, after all, were on Egypt and sand.\u003c/p\u003e\n\u003cp\u003eAnd curses.\u003c/p\u003e\n\u003cp\u003e“They were nice.” Hale kept his hands in his pockets but raised his face to the sky, water pebbling on his skin.\u003c/p\u003e\n\u003cp\u003e“Yes” was Kat’s reply.\u003c/p\u003e\n\u003cp\u003e“Nice is…refreshing.”\u003c/p\u003e\n\u003cp\u003eKat laughed and turned automatically onto a narrow street. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“And risky.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“And they seem like the sort of people who could really use help.”\u003c/p\u003e\n\u003cp\u003e“From someone good,” Kat offered.\u003c/p\u003e\n\u003cp\u003e“From someone stupid.” Hale stopped so suddenly that Kat walked past him. She had to turn to see him say, “But we’re not stupid, are we, Kat?”\u003c/p\u003e\n\u003cp\u003e“No. Of course—”\u003c/p\u003e\n\u003cp\u003e“So under no circumstances are we going to take this job?”\u003c/p\u003e\n\u003cp\u003e“Of course not,” Kat said just as the rain turned to sheets, hard and cold. Hale gripped her hand and pulled her onto a familiar stoop, under the shallow overhang of the roof above. She shivered, the wooden door at her back, while Hale leaned close, sheltering her, searching her eyes.\u003c/p\u003e\n\u003cp\u003eThe windows of the brownstone were black, and the street was empty. There were no cars, no nannies pushing strollers or pedestrians jogging home. It felt to Kat as if she and Hale were the only two people in New York City. They could steal anything they wanted.\u003c/p\u003e\n\u003cp\u003eBut I don’t steal anymore, Kat told herself. Don’t steal anything at all.\u003c/p\u003e\n\u003cp\u003e“No one’s home,” she told him.\u003c/p\u003e\n\u003cp\u003eWater clung to the corners of his mouth. “We could pick a lock. Jimmy open a window.”\u003c/p\u003e\n\u003cp\u003e“You know, I bet there’s a hide-a-key around here somewhere,” she tried to tease, but Hale had moved even closer. She couldn’t see the street. She couldn’t feel the rain. Her passport was in her pocket, and when he pressed against her, she could almost feel the stamps burning, telling the world that she’d been away from home a long time.\u003c/p\u003e\n\u003cp\u003eHale’s hands were on her neck—warm and big and comforting. Strange and new and different.\u003c/p\u003e\n\u003cp\u003eKat feared she hadn’t been gone long enough.\u003c/p\u003e\n\u003cp\u003e“Kat,” Hale whispered. His breath felt warm against her skin. “When you take this job, don’t even think about stealing that emerald without me.”\u003c/p\u003e\n\u003cp\u003eKat tried to pull away, but the door was there, pressing against her back. “I’m not going to—”\u003c/p\u003e\n\u003cp\u003eBut then she couldn’t finish because nothing was against her back. Kat found herself falling, reaching for Hale, but her hands grasped only air until she was flat on her back in the doorway.\u003c/p\u003e\n\u003cp\u003e“Hello, Kitty Kat.” Kat stared up at a familiar pair of long legs and a short skirt. Her cousin Gabrielle crossed her arms and stared down. “Welcome home.”\u003c/p\u003e\n\u003cp\u003eKat hadn’t realized how cold she was until she found herself lying on the floor of the old brownstone. There was no fire in the fireplace, no lights in the parlor or on the stairs. For a second, it felt almost like a job, as if she shouldn’t be there. And maybe, she realized, she shouldn’t be.\u003c/p\u003e\n\u003cp\u003e“We didn’t know anyone was home,” Kat said.\u003c/p\u003e\n\u003cp\u003eGabrielle laughed. “I could tell.”\u003c/p\u003e\n\u003cp\u003eEven in the darkness, Kat could see a glimmer in her cousin’s eyes. A glimmer of what, however, she didn’t dare to ask. She just watched Gabrielle turn and saunter down the long hall, moving through the shadows, weightless as a ghost.\u003c/p\u003e\n\u003cp\u003eWhen Kat climbed to her feet and followed, Hale at her back, she heard the squeaky floorboards, the moaning of the old house in the storm. It seemed too big. Too dark. Too empty.\u003c/p\u003e\n\u003cp\u003e“Wow. He really left,” Hale said, dismayed.\u003c/p\u003e\n\u003cp\u003e“Yeah.” Gabrielle reached the doorway to the kitchen and exhaled a short quick laugh. “I don’t think Uncle Bobby was too happy about it, either—no one thought Eddie would actually go all the way to Paraguay. But you’ve probably heard all about that.” She studied her cousin through the dim light. “You have talked to your dad, haven’t you?”\u003c/p\u003e\n\u003cp\u003e“Of course I have,” Kat said, reaching for the light switch.\u003c/p\u003e\n\u003cp\u003eWhen the lights flickered to life, Kat had to squint against the glare. She half expected her uncle to mysteriously appear, spoon in hand, complaining that she was late and the soup was cold.\u003c/p\u003e\n\u003cp\u003e“How is Paraguay?” Hale asked, oblivious to the ghost that Kat was sensing, squeezing past her and into the kitchen as if he’d been at home there his whole life.\u003c/p\u003e\n\u003cp\u003e“Okay, I guess,” Gabrielle said with a shrug. “Or as okay as a job this big ever goes. All hands on deck.” She sat down, threw her feet onto the table, and eyed her cousin. “Well…almost all hands.” She pulled a knife from her boot and an apple from a bowl and began to peel it in one long steady spiral. “So, are you guys gonna tell me what the big secret is?” She glanced from Kat to Hale then back again. “Because it looked like you were getting fairly cozy out there, talking about something. Or maybe you weren’t talking.…”\u003c/p\u003e\n\u003cp\u003eKat felt herself start to blush, but before she could say a thing, Hale opened the refrigerator and announced, “Kat’s going to steal the Cleopatra Emerald.”\u003c/p\u003e\n\u003cp\u003e“That’s funny,” Gabrielle said. It took a moment for her knife hand to pause in midair. “It is funny, isn’t it?”\u003c/p\u003e\n\u003cp\u003eKat’s gaze was burning into Hale. “I never said I was going to do it,” she told him. “I never said—”\u003c/p\u003e\n\u003cp\u003e“Of course you’re going to do it.” The refrigerator door slammed, and Hale turned. “I mean, it’s what you do now, isn’t it? Travel the world, righting wrongs. A one-woman recovery crew.”\u003c/p\u003e\n\u003cp\u003eKat wanted to reply, but Gabrielle’s feet were already off the table, and she was leaning closer to Kat, knife in hand.\u003c/p\u003e\n\u003cp\u003e“Tell me he’s joking, Kat.…Tell me you are not seriously thinking about stealing the Cleopatra Emerald.”\u003c/p\u003e\n\u003cp\u003e“No,” Kat said. “I mean…well…we just met this woman who says the emerald was really discovered by her parents—”\u003c/p\u003e\n\u003cp\u003e“Constance Miller,” Gabrielle filled in.\u003c/p\u003e\n\u003cp\u003e“You know her?” Kat said.\u003c/p\u003e\n\u003cp\u003e“I know everything there is to know about the most valuable emerald in the world, Kat. I’m a thief.”\u003c/p\u003e\n\u003cp\u003e“So am I,” Kat shot back, but her cousin just talked on.\u003c/p\u003e\n\u003cp\u003e“I’m serious. The Cleopatra Emerald is ninety-seven karats of crazy!”\u003c/p\u003e\n\u003cp\u003e“I know.” \u003c/p\u003e","sourceLink":"https://allnovel.net/uncommon-criminals-heist-society-2/page-3.html","bookId":2404,"creation":"Oct 5, 2019 10:31:32 AM","modification":"Oct 5, 2019 10:31:32 AM"}
