{"id":74462,"no":7,"title":"Page 7","content":"\u003cp\u003e“It’s as good as you’d think it would be—maybe better. Four guards. Two uniforms at the front door, one at the staff entrance, and a plainclothes that probably rotates, depending on the day.”\u003c/p\u003e\n\u003cp\u003e“Cameras?” Hale asked.\u003c/p\u003e\n\u003cp\u003e“Lots.”\u003c/p\u003e\n\u003cp\u003e“Blind spots?” Gabrielle said.\u003c/p\u003e\n\u003cp\u003e“None.” Across the street, the lights were fading to black, and Kat saw the employees slipping from the door on the side of the building, disappearing among the commuters and workers and shoppers of midtown Manhattan.\u003c/p\u003e\n\u003cp\u003e“Night’s no good,” Kat said to their unasked question. “Even if we could get past the guards and security, the emerald’s case sinks into a reinforced titanium vault beneath the floor at closing time.”\u003c/p\u003e\n\u003cp\u003e“Basement access?” Hale asked, perking up.\u003c/p\u003e\n\u003cp\u003e“No.” Kat shook her head. “With that kind of case, there won’t be any access of any kind.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“Tokyo,” Kat and Gabrielle said at the same time.\u003c/p\u003e\n\u003cp\u003eGabrielle shrugged when Hale looked at her. “If you don’t believe us, Uncle Felix has got the blowtorch scars to prove it.”\u003c/p\u003e\n\u003cp\u003eKat’s gaze was lost in the distance, her voice low, and when she spoke, it was almost to herself, saying, “The stone is small, and small means easy to hide.” Hale and Gabrielle stayed quiet, letting her talk, mind working, gears turning. “But no one’s seen it in years, and if no one’s seen it, then everyone’s going to be staring, and staring people tend to…see. But staring also means focused, and focused people get scared, and scared people get distracted.…”\u003c/p\u003e\n\u003cp\u003e“So we’re back to Humpty Dumpty,” Gabrielle tried, but Hale was already shaking his head.\u003c/p\u003e\n\u003cp\u003e“No,” he said. “I’m telling you, even if we can get the king’s horses in there, there’s no way we make it out before someone notices the emerald is gone. And trust me, we do not want to be caught on the inside.” He cringed. “Ex-Navy SEALs. Big ones.”\u003c/p\u003e\n\u003cp\u003eWhen Kat spoke, it was more a hypothetical question than a challenge: “What if they don’t notice?”\u003c/p\u003e\n\u003cp\u003e“No, Kat. No.” Despite the snow, sweat was beading at Hale’s brow. “I’m telling you, if we had a month and a big crew…maybe. But Kelly is not messing around with this thing. We don’t have the time or the resources to—”\u003c/p\u003e\n\u003cp\u003e“What are you thinking?” Gabrielle asked, cutting him off.\u003c/p\u003e\n\u003cp\u003e“Kat!” Hale snapped, probably louder than he’d intended, because when he spoke again, the words were softer. Sadder. “Kat, Uncle Eddie couldn’t steal it.”\u003c/p\u003e\n\u003cp\u003eThere it was—the single fact that was scarier than the guards, more worrisome than the cameras. It was the one thing that, no matter what, Kat knew she could never plan a way around. What they were talking about doing was forbidden; it went against her family and its rules, and so Kat didn’t dare look at that job through Uncle Eddie’s eyes. Instead, she looked at it like Visily Romani.\u003c/p\u003e\n\u003cp\u003e“The authentication room,” Kat said, almost to herself. “We can do an Alice in Wonderland in the authentication room.”\u003c/p\u003e\n\u003cp\u003eThey stayed perfectly still in the wet air, the plan taking shape around them like puzzle pieces formed out of the falling snow. The three of them stood shaking from the cold and with the knowledge that maybe—just maybe—it might work. And maybe, Kat knew, it wouldn’t.\u003c/p\u003e\n\u003cp\u003eGabrielle stared into her cousin’s eyes. “Whatever you do, Kat, just do not say we’re gonna need a forger.”\u003c/p\u003e\n\u003cp\u003e“No, Gabrielle. We’re going to need someone who can fake the Cleopatra Emerald in seventy-two hours.” Kat started walking. Her short hair blew across her face as she turned her head and called against the wind, “We’re going to need the forger.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 9\u003c/p\u003e\n\u003cp\u003e“Do I know him?” Hale asked. Together, the cousins said, “No.” Kat and Gabrielle sat together in the backseat of the huge SUV that Hale had paid for and Marcus drove. They swayed as the big tires lunged in and out of the deep gouges in the rough road. No, Kat realized. On second thought, road was far from the appropriate word.\u003c/p\u003e\n\u003cp\u003ePath.\u003c/p\u003e\n\u003cp\u003eTrail.\u003c/p\u003e\n\u003cp\u003eDeath trap?\u003c/p\u003e\n\u003cp\u003eThe dense canopy of trees parted, and for a brief second, nothing but snow and sky stood between them and the sheer cliff with its steep drop. Gabrielle—one of the best high-wire workers to ever grace the family business—leaned close to the glass and peered into the white abyss.\u003c/p\u003e\n\u003cp\u003eHale, on the other hand, looked as if he might be sick all over the SUV’s soft leather interior. “So are we sure this guy will be there?”\u003c/p\u003e\n\u003cp\u003eKat looked at the pristine snow that lay before them, eighteen inches deep and completely untouched by man. “He’s home,” she said, certain that no one had been up—or down—that mountain in a very long time.\u003c/p\u003e\n\u003cp\u003eMarcus drove steadily faster. The tires spun, and the SUV skidded; but still they kept their forward progress, climbing.\u003c/p\u003e\n\u003cp\u003e“And how do we know he’ll be able to help us?” Hale asked, his voice an octave higher than Kat had ever heard it.\u003c/p\u003e\n\u003cp\u003e“Oh, he can help us.” Maybe it was the change in Gabrielle’s voice—the sudden inflection—or maybe Hale was just desperate to look anywhere but over the sharp cliff that Marcus was currently navigating, because he spun around and stared into the backseat.\u003c/p\u003e\n\u003cp\u003e“What does that mean?” Hale asked.\u003c/p\u003e\n\u003cp\u003e“It means…well…” Kat started, then stumbled, searching. “You see, by some standards he might be a little…”\u003c/p\u003e\n\u003cp\u003e“Weird.” Gabrielle shrugged against her cousin’s glare. “The man is ten pounds of kooky in a five-pound sack.”\u003c/p\u003e\n\u003cp\u003e“He’s eccentric,” Kat tried.\u003c/p\u003e\n\u003cp\u003e“Bizarre.”\u003c/p\u003e\n\u003cp\u003e“He’s got something of an artist’s temperament.”\u003c/p\u003e\n\u003cp\u003e“I say a screw loose.”\u003c/p\u003e\n\u003cp\u003e“He’s a little…unpredictable.”\u003c/p\u003e\n\u003cp\u003eBut this time, there was no teasing as Gabrielle corrected, “No, Kat. The word is banished.”\u003c/p\u003e\n\u003cp\u003eKat felt the truth wash over them, silent and chilly as the snow. Then she shook her head. “So he and Uncle Eddie don’t get along. That has nothing to do with his work. His work is good.”\u003c/p\u003e\n\u003cp\u003e“I know, but if Uncle Eddie doesn’t want anyone to use him—”\u003c/p\u003e\n\u003cp\u003e“Well, Uncle Eddie also says no one should steal the Cleopatra Emerald. Don’t worry, Gabrielle. Not even Uncle Eddie can kill us twice,” Kat said, turning back to the frosty glass.\u003c/p\u003e\n\u003cp\u003e“Oh, if anyone can…” Hale twisted and stared down the steep cliff again.\u003c/p\u003e\n\u003cp\u003e“Besides,” Kat said as the SUV slowed, “we’re here.”\u003c/p\u003e\n\u003cp\u003eMarcus guided the car from the twisting road into a clearing where the dense pines gave way to an even smaller lane, a low stone fence, and a tiny cabin with smoke spiraling into the sky. Icicles hung from the roof, and the whole thing might easily have been made out of gingerbread.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Hale said, staring out the window. “He’s got to be a criminal mastermind, all right.”\u003c/p\u003e\n\u003cp\u003eOutside the SUV, the snow was up to Kat’s knees, and she had to hold Hale’s arm to steady herself as they waded their way through the deep drifts to the small shaded stoop.\u003c/p\u003e\n\u003cp\u003e“Hale,” Kat said slowly, “one more thing you might want to know about Charlie.…”\u003c/p\u003e\n\u003cp\u003eGabrielle was ahead of them, her long legs skirting over the drifts like the wind.\u003c/p\u003e\n\u003cp\u003e“Yeah?” Hale said.\u003c/p\u003e\n\u003cp\u003e“He’s Eddie’s brother.…”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“And…”\u003c/p\u003e\n\u003cp\u003eLooking up at Hale, Kat had to think that the sky was so clear, so blue, so close. Hale was close. He felt with her, and she honestly didn’t know whether or not that scared her—what she should or should not say. For a moment, there didn’t seem to be anything to say at all.\u003c/p\u003e\n\u003cp\u003eBut just as quickly, that moment was over, because the door was swinging open, a gruff voice was saying, “Who’s there?” and the three of them were turning, staring at the familiar face of Uncle Eddie.\u003c/p\u003e\n\u003cp\u003e“Kat?” She heard the worry in Hale’s voice and knew he was already formulating cover stories and concocting lies.\u003c/p\u003e\n\u003cp\u003e“It’s okay, Hale. He’s—”\u003c/p\u003e\n\u003cp\u003e“Hello, Uncle Charlie.” Gabrielle pushed her sunglasses onto the top of her head, and the wind blew through her long hair. She was beautiful—Kat could see it. And yet one of the best artists in the world seemed to barely notice. He was too busy staring past her, squinting against the glare of the sun that bounced off the snow—a blinding white.\u003c/p\u003e\n\u003cp\u003e“Nadia.” His voice cracked and his lips quivered, but his gaze stayed locked on Kat. The best hands in the business were shaking as they pointed toward her.\u003c/p\u003e\n\u003cp\u003e“No, Charlie. This is Nadia’s daughter, Kat. Remember?” Gabrielle whispered. “Nadia’s gone, Charlie.”\u003c/p\u003e\n\u003cp\u003e“Of course she is,” the man snapped, and straightened and pulled back from the door. “Come inside if you’re coming.”\u003c/p\u003e\n\u003cp\u003eKat and Hale stood alone in the sun, watching the old man disappear into the shadow of the house, and that was when Hale mumbled, “Uncle Eddie’s got a twin.…There are two Uncle Eddies.”\u003c/p\u003e\n\u003cp\u003e“No.” Kat shook her head. “There aren’t.”\u003c/p\u003e\n\u003cp\u003eFalse walls and fake IDs, frames with forged paintings, necklaces with imitation gems. Kat was well aware that most things in her world were a little bit unreal, but it had never seemed so obvious until she stood on the threshold of the tiny cottage at the top of the world. She thought of Mr. Stein’s house in Warsaw, entire rooms dedicated to the search for treasures that were gone, hidden, lost—perhaps never to be seen again. But Uncle Charlie’s house…Charlie’s house was the opposite in almost every way.\u003c/p\u003e\n\u003cp\u003eThree Mona Lisas hung beside the doorway. The mantel over the fireplace held at least a dozen Fabergé eggs. There was a basket of bearer bonds by the fire with the rest of the kindling, a set of hand towels in the bathroom that, had they not been made from terry cloth, would have been, collectively, an exact replica of Leonardo’s Last Supper.\u003c/p\u003e\n\u003cp\u003eIt was the oddest sort of museum that any of them had ever seen, so they turned slowly, taking the whole sight in.\u003c/p\u003e\n\u003cp\u003e“Forgive the mess,” Charlie said, pushing aside a pile of canvases to clear a place on a faded wingback chair. “Haven’t had company in a few days.”\u003c/p\u003e\n\u003cp\u003eOr years, Kat thought, remembering the long snowy drive. She stood quietly, watching Hale’s gaze sweep over the room, waiting for his eventual, “Um…Charlie?”\u003c/p\u003e\n\u003cp\u003eThe old man jumped a little at the sound of his own name, but still managed to mutter, “What?”\u003c/p\u003e\n\u003cp\u003e“Is that a real Michelangelo?” Hale pointed to a sculpture that sat in the corner, covered with hats and scarves and dust.\u003c/p\u003e\n\u003cp\u003e“Of course it is.” Charlie patted the sculpture on the back. “Nadia helped me steal it.”\u003c/p\u003e\n\u003cp\u003eGabrielle and Hale seemed almost afraid to look at Kat then, as if the mention of her mother’s name might be too much for her. Only Charlie seemed immune to the silence.\u003c/p\u003e\n\u003cp\u003e“Now that’s one of mine.” He pointed to the Rembrandt on the wall, dusty and old and perfectly identical to the one that had hung above Uncle Eddie’s fireplace all of Kat’s life. The original didn’t matter. Not to Kat. Not when there were two perfect forgeries hanging a few thousand miles apart, like a portal linking two totally different worlds. When Kat looked at Charlie’s painting, she tried to see how it might differ from its twin, but the differences were not a matter of canvas or paint. The differences, Kat knew, were in the paintings’ lives. \u003c/p\u003e","sourceLink":"https://allnovel.net/uncommon-criminals-heist-society-2/page-7.html","bookId":2404,"creation":"Oct 5, 2019 10:31:32 AM","modification":"Oct 5, 2019 10:31:32 AM"}
