{"id":30362,"no":3,"title":"CHAPTER II. CAUGHT BY THE TIDE.","content":"\u0026nbsp;Jack ran home. \n\u003cdiv\u003e\n \"I thought you would have been in by two o\u0027clock, Jack,\" his mother said reproachfully, \"so as to see Lily before she went off to school again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I should have done, mother, but I had to stick at the work until we had finished up to the water-line. Uncle Ben thought it was not worth while knocking off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack\u0027s meal of bread and bacon was soon finished, then he waited a little until Lily had returned from school.[16]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come on, Lil,\" he said, \"I have been waiting to take you out with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Be in by six,\" Mrs. Robson said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, mother! We are only just going down to the shore.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Near the little coast-guard station they came upon Bill Corbett.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you come to-morrow, Jack?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; uncle has agreed to do without me. What time are you going to start?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will go out as late as we can, Jack. We can get down the creek till three anyhow, so at three o\u0027clock you be ready down here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Joe is going, I suppose?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, he does to carry the cockles to the boat while we scrape them out. That is a nice bawley, that new one there; she only came in this tide. That is the boat Tom Parker has had built at Brightlingsea. He expects she is going to beat the fleet. She will want to be a rare good one if she does, and I don\u0027t think Tom is the man to get the most out of her anyhow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t reckon he is,\" Jack agreed. \"He would never have bought that boat out of his own earnings, that is certain. It is lucky for him his uncle in town died and left him four hundred pounds. He is one of the lazy ones, he is. Half the times he never goes out at all. It is either too rough, or there ain\u0027t wind enough, or he don\u0027t think it is a likely day for fish. His mother will do a sight better now that he has got a boat of his own, and she will get someone else to work hers. I should not like to work on shares with him though he has got a new boat and gear.\"[17]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I must be going,\" Bill said. \"Shall I knock at your door as I pass in the morning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will find me there as the clock strikes three, Bill; but if I ain\u0027t, you knock.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bill Corbett, who was a lad some two years older than Jack, strolled away. Jack and Lily sat down on the sloping stage from which the coast-guardsmen launched their boats, and began to chat to the man standing with a telescope under his arm at the door of the boat-shed. Jack was very fond of talking to the coast-guardsmen. They had not, like the fishermen, spent all their lives between Gravesend and Harwich, but had sailed with big ships and been to foreign parts. One of them had been in the China War, another had fought in India with Peel\u0027s Naval Brigade, had helped batter down the palace fortresses of Lucknow, and when in the humour they had plenty of tales of stirring incident to relate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack was a favourite with the coast-guardsmen, for he possessed the virtue rare in boys of being able to sit still; and as his favourite place was the slip in front of the boat-house, and he would sit there cutting out toy boats by the hour, he generally came in for a good deal of talk with the men who happened to be on duty. This afternoon, however, the men were busy burnishing up their arms and getting everything into apple-pie order, as the inspecting officer was to come on his rounds the next morning; so Jack after a time strolled along the path between the railway and the track, Lily prattling by his side and stopping to gather wild convolvulus and grasses. The sea was out now, and the mud stretched away, glistening red and brown in[18] the sunlight. Beyond in the Ray lay a long line of bawleys, while a score or more nearer at hand lay heeled over on the mud as they had been left by the receding tide.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To a stranger the black hulks would have looked exactly like each other; but the Leigh men could tell every boat afloat or ashore, even without looking at the number painted on her bulwarks, just as a shepherd can pick out one sheep from a flock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is time to go back, Lily,\" Jack said at last. \"Mother said we were to be in at six, and it cannot be far off that now. There is the Yarmouth steamer going up. It is about her time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you know it is the Yarmouth steamer, Jack?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I don\u0027t know. I know her by her look. I know pretty near all of them—the Yarmouth, the Scotch, and the Dutch boats.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They all look to me alike.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah! that is because they are a long way oft, Lily. There is a lot of difference between them when you are close. We know them all, and which whistles if we are in the way, and which will give way for us, and which will come right on without minding whether they run us down or not. The colliers are the worst for that; they just go straight on, and expect you to get out of the way, and don\u0027t mind a rap about the rule of the road or anything else. I should like to see half a dozen of those captains hanged.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not think it is right to say that, Jack.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I should like to see them get five dozen lashes anyhow,\" Jack said, \"well laid on by some of[19] our fishermen. They would give it \u0027em heartily, and it would do them a world of good, and save many a life afterwards. It is too bad the way those fellows go on; they don\u0027t care a bit about running down a small craft in the dark. In the first place, they know very well that they are not likely to be recognized, and so steam straight on, and leave men to drown; and in the next, if they are recognized, they are ready to swear that black is white all round, and will take their oaths you hadn\u0027t got your side-lights burning, or that you changed your course, and that they did all in their power to prevent a collision. I wish some of the people of the Board of Trade would come down the river sometimes in sailing-boats and see the way these coasters set the law at defiance, and fine them smartly. What is the use of making rules if they are never observed? Well, here we are home, and the church is just striking six, so we have hit off the time nicely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By eight o\u0027clock Jack was in bed, and having acquired the fisherman\u0027s habit of waking at any hour he chose, he was at the door when Bill Corbett and his brother Joe came along. The day was already breaking faintly in the east, for the month was May.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Going to be fine, Bill?\" Jack asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dunno. Wind is blowing strong from the north, though we don\u0027t feel it here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The water was off the flats and had sunk some distance in the creek.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is lower than I expected,\" Bill said. \"Come on; come on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is she, Bill?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Close to the foot of the steps.\"[20]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boat had already taken ground; but Bill, getting into the water with his high boots, shoved her off. The mast was stepped and sail hoisted, and she was soon running fast down the creek.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boats were off an hour ago, I suppose?\" Jack remarked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ay, more than that. Some of them turned out at half-past one. But those whose boats were down the channel didn\u0027t go for half an hour later. Father told me. I saw him before I started. He couldn\u0027t sleep with the pain in his leg.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Twenty minutes\u0027 sailing took them down to the mouth of the creek and into the wider channel. They now turned the boat\u0027s head directly off shore, and jibed the sail, and bore off for the sands stretching away from the end of Canvey Island.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No other boats here this morning?\" Jack asked as the boat ran ashore.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; three or four of them went down to Shoebury last night. They say there are more cockles down there than there are here now. But father said we had best come here. I suppose he thought that Joe, you, and me, made but a poor cocklers\u0027 crew. Of course, with the wind blowing off shore, it is all right anyhow; but men never think us boys can do anything. Why, I would not mind a bit starting, us three, for Harwich. I reckon these boats are just as safe as the bawleys?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think so too; but they want more handling. However, I expect we could manage it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They had now got out their implements, consisting of a shovel, a large rake, and a couple of baskets, on shore, and fastening the boat with a grapnel, went to[21] the place where experience had taught them it was best to dig, and were soon at work. The cockles were for the most part buried some five or six inches in the sand, and were found in great numbers; the two elder boys digging and raking while Joe picked them up, and threw them into the baskets. As these were filled Bill carried them down on his shoulder to the boat, put the baskets into the water, gave them a heave or two to wash some of the sand off the cockles, and then emptied them into the boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a broad-beamed craft, of over twenty feet long, and would carry more than a ton of cockles if filled up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sun had long been up, the clouds were flying fast across the sky, and the wind was working round to the east, knocking up a short choppy sea as it met the ebb, and covering the river with white horses.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys worked away sturdily, ceasing occasionally from their labours to go down and shove the boat further off as the tide fell. At six it was dead low. They had each brought with them a bag with some bread and cheese, and a tin of cold tea, and now sat down on the gunwale of the boat for breakfast. Having finished that meal, they continued their work till nine o\u0027clock, by which time they had got several bushels on board.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look there!\" Joe exclaimed suddenly; \"there is a big steamer has run on to the Middle Ground.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys had just thrown down their spade and rake, and had agreed to knock off, and they now ran across to the outside of the strip of sand, which had by this time narrowed very considerably.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She will get off easy enough as the tide rises,[22]\" Joe said; \"but they won\u0027t be able to back her off now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; she does not move in the least,\" Jack agreed. \"Her screw is working hard astern now. Look how high her head is. She has run a long way up with wind and tide and steam. She must have gone on it hard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She had best get a couple of anchors out astern,\" Bill said, \"before she gets broadside on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was evidently also the view of the captain, as two boats were lowered and anchors got into them. But it is no easy matter to row a boat with a heavy weight in it against wind and tide; and before they had got fairly away from the vessel she had already swung round a considerable distance, and was heeling over a good deal from the force of the wind and tide. It was nearly half an hour before the boats were far enough off to get the anchors over with any effect.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They won\u0027t dare to haul on them now,\" Joe said. \"They would only come home. Those anchors ain\u0027t heavy enough to work her stern round. I expect when a tug comes along they will get them to help, else she will keep on driving higher and higher.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hallo!\" The exclamation came from Jack, who now happened to look round towards the boat. They had accidentally taken their stand on the highest point of the sand-bank, and in watching the steamer had forgotten all about the tide, which, under the influence of a north-east wind, had risen with great rapidity. The patch of dry sand was scarcely fifteen yards wide, and would be entirely covered in a very few minutes.[23]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look, Bill, the boat has gone!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was true. The grapnel, a very light one, with a short length of rope, had been thrown carelessly down on the sand when they last hauled the boat up, and as the full strength of the tide had caught the boat, it had dragged a considerable distance, and was drifting away up the Ray.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is to be done?\" Joe exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think we could wade along to the island, Bill?\" Jack asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bill shook his head. \"No; there are deep channels where it would be over our heads. I can\u0027t swim a stroke, no more can Joe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall I swim to the boat, Bill, and try and get her back?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe shook his head. \"She is in deep water now, Jack, and the grapnel ain\u0027t holding her a bit; she will drift as fast as you can swim. But of course you can try if you like, it don\u0027t make any difference to us, for you could never beat back against this wind and tide. What fools we have been, to be sure!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boats will soon be coming back now,\" Jack said hopefully. \"There are some of them this side of the Chapman now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bill shook his head. \"It will take them three quarters of an hour to beat up, Jack.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack turned and looked the other way. \"Here are three of them coming in from the Nore, Bill. They will not be very long before they are up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They will be here before the others, Jack; but I doubt if they will be in time. Water will be breast-high before they get up, and they may drop[24] anchor down at the mouth of the Ray, and not see us. Our best chance is the shore.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He shaded his eyes and looked steadily across at Leigh. \"There is a man running from the coast-guard station,\" he said. \"There! there are two or three others running to meet him. Now they are going back together.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys stood looking fixedly at the station.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hooray!\" Jack said after a minute; \"there comes the boat out of the house. Do you see they are getting her down the slip; now she is in the water.\" Another minute passed, and then a white sail appeared. \"She is heading straight off to us, Bill. With this wind she will be here in a quarter of an hour.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the tide was already half-way up to their knees, and the waves beginning to splash against them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will they be here in time, do you think, Bill?\" Joe asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope so, Joe,\" Bill said cheerily. \"They would be in plenty of time if it were not for the force of the tide. Still, I think it is all right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The minutes passed rapidly; higher and higher rose the water, and the waves increased fast in size. It was as much as the boys could do to stand against the sweep of the stream.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bill, you had better take Joe on your shoulders,\" Jack said. \"I have read that one man can carry another across a stream that he couldn\u0027t get over alone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jump up, young un,\" Bill said; \"and you, Jack, get off your sea-boots. You stand just behind me[25] and hold on, I feel much steadier now that I have got Joe on my shoulders. If you feel that you are going, leave go of me, you will only pull me backward holding on; and as you can swim you are all right. You have only got to keep yourself afloat, the tide will drift you up to the island in no time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t mean to go if I can help it,\" Jack said. \"Of course I could not swim with you two, but if you would lie on your back quiet I might manage to keep you up for a bit anyhow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boat, heeling far over to the breeze, was dashing along at a great pace towards them. It was a question of minutes. Jack found it extremely difficult to keep his feet, the sand seemed to be scooped out from under them by the force of the tide. The wind, which was blowing in violent gusts, added to the difficulty of withstanding the force of the current and waves.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t pull, Jack,\" Bill said, \"or you will have us over.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t hold on without, Bill. Which shall I do? Swim off alone, or hold on by you till we all go together?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go off by yourself, Jack; the boat will be here in five minutes now. I think I can hold on until then; anyhow, it is the best chance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were now waist-deep; for, little by little, as the sand gave way under their feet, they had been driven backwards towards deeper water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is one other thing, Bill. Do you think you can shift Joe so as to sit on one shoulder? If I get on your other it will add to your weight.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will try it,\" Bill said; \"I was nearly off my[26] feet then. Get on to my left shoulder, Joe. Now Jack, you climb up. Yes, I think that is better. I should be all right if the sand would not slide away so much from under my feet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Several times Jack felt Bill totter and sway; he was fast being swept back into the deeper water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you do go, Bill, do you and Joe throw yourselves on your backs, and I will try and hold you up. The boat will be here in no time now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was indeed less than a hundred yards away when Bill exclaimed, \"I am going!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Keep on your back, Bill!\" Jack shouted as he went backwards under water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The three came up close together. Jack seized the others by the hair, and throwing himself on his back, and striking out with his legs, tried to keep them in a similar position with their faces above water. Bill lay quietly enough; but Joe struggled to raise his head, and turning, grasped Jack round the body, and in a moment the three were under water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack kept his presence of mind; he knew that the boat was close at hand, and strove, not to loosen the grasp of his companions, which was impossible, but to come to the surface occasionally for an instant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Two or three times he managed this, and obtained a breath of air before he went under again. The last time, he saw the boat close at hand, and a rope fell across his face; but he could not free his hands to grasp it, and went under immediately. His senses were leaving him, when he felt something grasp him, and then knew no more till he opened his eyes, and found himself in the bottom of the boat with his two companions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3175/87056.html","bookId":859,"creation":"Aug 5, 2019 2:16:29 AM","modification":"Aug 5, 2019 2:16:29 AM"}
