{"id":78718,"no":108,"title":"Page 108","content":"\u003cp\u003e“Okay, if you don’t want to help, don’t help. But if something happens to Hawk and Gwen gains seventy pounds by going on a diet of pure cookie dough, don’t come to Nordstrom’s and expect to use my employee discount!” she snapped then flipped her phone closed and stated, “He’ll run the searches. He likes Armani suits.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe you did that, Trace, he could get into trouble.”\u003c/p\u003e\n\u003cp\u003e“Well, sure, but Hawk could also get dead.”\u003c/p\u003e\n\u003cp\u003eThis was true.\u003c/p\u003e\n\u003cp\u003eI whimpered.\u003c/p\u003e\n\u003cp\u003eTracy’s voice got soft. “It’s going to be okay, babe.”\u003c/p\u003e\n\u003cp\u003eI pressed my lips together and turned on 15th.\u003c/p\u003e\n\u003cp\u003eMy phone rang when we were on the sidewalk; I saw it said Tack Calling so I looked at Tracy.\u003c/p\u003e\n\u003cp\u003e“Can you get us coffees? I have to take this.”\u003c/p\u003e\n\u003cp\u003eShe looked at my phone then at me then she nodded and headed toward The Market on Larimer.\u003c/p\u003e\n\u003cp\u003eI flipped the phone open and put it to my ear.\u003c/p\u003e\n\u003cp\u003e“Tack.”\u003c/p\u003e\n\u003cp\u003e“Peaches, how long they give you?” he asked.\u003c/p\u003e\n\u003cp\u003e“They didn’t,” I answered.\u003c/p\u003e\n\u003cp\u003eThere was silence then, “All right, babe, there’s bad news and that’s all I got.”\u003c/p\u003e\n\u003cp\u003eMy heart squeezed so I squeezed my eyes shut too to try to block out the pain.\u003c/p\u003e\n\u003cp\u003e“What’s the bad news?” I whispered.\u003c/p\u003e\n\u003cp\u003e“We went in soft to every place we know Roarke works dirty. We got nothin’. We’re outta leads.”\u003c/p\u003e\n\u003cp\u003eShit!\u003c/p\u003e\n\u003cp\u003eI opened my eyes. “I know someone who’s a mortgage broker. He’s checking databases now. If he gets anything you haven’t got, can I feed it to you?”\u003c/p\u003e\n\u003cp\u003e“Don’t wait, babe, get his ass on it and call me.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” I whispered.\u003c/p\u003e\n\u003cp\u003e“Later,” he replied then hung up.\u003c/p\u003e\n\u003cp\u003eI looked down the street where Tracy had disappeared.\u003c/p\u003e\n\u003cp\u003eThen I made a decision.\u003c/p\u003e\n\u003cp\u003eI flipped my phone open and went to my text screen.\u003c/p\u003e\n\u003cp\u003eThen I typed in, I can’t get to her but if you trade Hawk for me, you got Tack, Chaos MC, Hawk’s boys and probably Mitch Lawson who’ll find her and trade Ginger for me. No tricks. No joke. Him for me and you get Ginger. Deal?\u003c/p\u003e\n\u003cp\u003eI hit send and stood on the sidewalk waiting. People might have passed but I didn’t notice. I just stood there staring at my phone.\u003c/p\u003e\n\u003cp\u003eThen it chirped.\u003c/p\u003e\n\u003cp\u003eI flipped it open.\u003c/p\u003e\n\u003cp\u003eShe’s at 83 Bannock. You get her, text. That’s the deal.\u003c/p\u003e\n\u003cp\u003eShit! How did I get my sister out of an FBI safe house?\u003c/p\u003e\n\u003cp\u003eShit!\u003c/p\u003e\n\u003cp\u003eMy phone chirped again and I looked down at it.\u003c/p\u003e\n\u003cp\u003eCall off Chaos or you’ll get a body to bury.\u003c/p\u003e\n\u003cp\u003eI closed my eyes.\u003c/p\u003e\n\u003cp\u003eThen I opened them, flipped my phone shut, flipped my phone open and headed to my car as I called Tack.\u003c/p\u003e\n\u003cp\u003eTracy would find her way home. She’d be pissed but she’d find her way home. And that home wouldn’t be a penitentiary which was where I was headed.\u003c/p\u003e\n\u003cp\u003eIf I was lucky.\u003c/p\u003e\n\u003cp\u003eI got Tack’s voicemail, left a message that called him off, flipped my phone shut, got in my car and headed to 83 Bannock.\u003c/p\u003e\n\u003cp\u003eI sat in my car on Bannock two houses down from 83, staring at it and thinking it was a rather nice house and didn’t look like a safe house at all. Not, of course, that I knew what safe houses looked like but still.\u003c/p\u003e\n\u003cp\u003eI flipped my phone open and I went to my texts.\u003c/p\u003e\n\u003cp\u003eI typed in, Before I do this, I want proof Hawk’s all right. No pictures. I want to hear his voice.\u003c/p\u003e\n\u003cp\u003eThen I hit send.\u003c/p\u003e\n\u003cp\u003eI sat again in suspended time as I stared at my phone.\u003c/p\u003e\n\u003cp\u003eIt rang, unknown caller, I sucked in breath, flipped it open and put the phone to my ear.\u003c/p\u003e\n\u003cp\u003e“Hello,” I whispered.\u003c/p\u003e\n\u003cp\u003e“Baby, do not do this shit,” Hawk growled in my ear and my eyes filled with tears as they closed.\u003c/p\u003e\n\u003cp\u003e“I’m doing it, Cabe,” I whispered, the tears sliding down my cheeks.\u003c/p\u003e\n\u003cp\u003e“Do not do it, Gwen.”\u003c/p\u003e\n\u003cp\u003e“I’m drowning,” I was still whispering.\u003c/p\u003e\n\u003cp\u003e“Gwen –”\u003c/p\u003e\n\u003cp\u003e“In you and I don’t want to come up for air.”\u003c/p\u003e\n\u003cp\u003e“Fuck. Baby –”\u003c/p\u003e\n\u003cp\u003eI heard the phone jostle then a man told me, “Do it. Text.”\u003c/p\u003e\n\u003cp\u003eThen I got dead air.\u003c/p\u003e\n\u003cp\u003eMy head hit the steering wheel but I didn’t feel it or see it. My eyes were still closed and tears were streaming down my face.\u003c/p\u003e\n\u003cp\u003eBaby.\u003c/p\u003e\n\u003cp\u003eThat was burned on my brain too.\u003c/p\u003e\n\u003cp\u003eBaby.\u003c/p\u003e\n\u003cp\u003e“Oh God,” I whispered, opened my eyes and stared at my thighs. “If I pull this off, Ginger, please, please forgive me.”\u003c/p\u003e\n\u003cp\u003eMy breath hitched and it did it painfully, burning my throat.\u003c/p\u003e\n\u003cp\u003eBaby, do not do this shit.\u003c/p\u003e\n\u003cp\u003eAnother sob tore from my throat.\u003c/p\u003e\n\u003cp\u003eDo not do it, Gwen.\u003c/p\u003e\n\u003cp\u003eMy hands went to the steering wheel and held on.\u003c/p\u003e\n\u003cp\u003eDo not do it…\u003c/p\u003e\n\u003cp\u003eMy fingers were curled around the steering wheel but I didn’t feel the wheel, I felt fingers curled around mine, my hand was little and they engulfed mine. In my mind, I looked up and saw Meredith with her wedding veil over her face smiling down at me.\u003c/p\u003e\n\u003cp\u003eHer fingers squeezed mine, warm and tight.\u003c/p\u003e\n\u003cp\u003eI felt my tears wet on my jeans.\u003c/p\u003e\n\u003cp\u003eShit. I couldn’t do it. I couldn’t turn over my sister, my Dad and Meredith’s daughter for my man. I couldn’t do it.\u003c/p\u003e\n\u003cp\u003eI let the steering wheel go and covered my face with my hands as the sobs burned up my throat, so powerful, they shook my shoulders.\u003c/p\u003e\n\u003cp\u003e“Baby,” I cried into my hands that picture in the Polaroid all I could see against my closed eyelids. “Oh God, baby,” I whispered as my shoulders heaved.\u003c/p\u003e\n\u003cp\u003eThe passenger door flew open, my back shot straight, my head turned and through my tears I stared in stunned shock as Ginger jumped into the passenger seat.\u003c/p\u003e\n\u003cp\u003e“What the –?” I breathed.\u003c/p\u003e\n\u003cp\u003e“Drive!” she shouted.\u003c/p\u003e\n\u003cp\u003e“What?” I asked.\u003c/p\u003e\n\u003cp\u003e“Drive, bitch, drive!” she screamed.\u003c/p\u003e\n\u003cp\u003eI blinked then straightened, turned the key in the ignition and shot from the curb.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Six\u003c/p\u003e\n\u003cp\u003eCommando Woman Lesson One\u003c/p\u003e\n\u003cp\u003e“Not my gig, Gwennie, but those shoes are hot,” Ginger said through a mouth full of Mustard’s Last Stand, Vienna beef, Chicago style, chili-cheese hotdog.\u003c/p\u003e\n\u003cp\u003eMustard’s Last Stand had always been Ginger’s favorite and that was where she wanted to go after escaping her protective custody safe house when she saw my car on the street with me sitting in it having a mental collapse. So I headed to University Boulevard, bought her a chili-cheese dog and then we drove to the Target parking lot on Colorado Boulevard so she could eat it. The whole time to and from, Ginger checked for a tail and declared we didn’t have one. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-108.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
