{"id":78720,"no":110,"title":"Page 110","content":"\u003cp\u003eShit!\u003c/p\u003e\n\u003cp\u003eHe pulled back but his eyes came to me as I heard Ginger cry out and felt her presence leave the car.\u003c/p\u003e\n\u003cp\u003e“Lee wants a word,” Crowe stated. “You come or I drag you.”\u003c/p\u003e\n\u003cp\u003e“Okey dokey,” I whispered, slid the picture in my purse, grabbed the strap and when his body pulled out of the frame, I exited the car.\u003c/p\u003e\n\u003cp\u003eGinger and I, escorted by Vance Crowe and Luke Stark, entered the Nightingale Investigations offices.\u003c/p\u003e\n\u003cp\u003eThey were posh, all gleaming wood and bronze statues.\u003c/p\u003e\n\u003cp\u003eNice.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you ditched me!” Tracy screeched after I got two feet in the door. I turned to look at her and she was advancing on me then she skidded to a halt when she saw Ginger. “Holy crap! You busted her out!” she yelled.\u003c/p\u003e\n\u003cp\u003e“I didn’t bust her out. She escaped,” I replied.\u003c/p\u003e\n\u003cp\u003e“Shee-it,” an African American woman with a very large afro and stunning tawny brown eyes was sitting behind the reception desk and staring at Ginger. “Little thing like you caused all this ruckus? Feds, cops, badasses, commandos all in a tizzy. Denver’s underground and overground spinnin’ like tops.” She smiled huge and nodded once before she finished with, “you go, girl.”\u003c/p\u003e\n\u003cp\u003eGinger grinned at her.\u003c/p\u003e\n\u003cp\u003eI looked toward an inside door that had opened and Lee Nightingale and Jorge were coming out of it.\u003c/p\u003e\n\u003cp\u003e“Smoke,” I whispered.\u003c/p\u003e\n\u003cp\u003e“Thinkin’ we should count ourselves lucky you don’t clue in that Hawk still watches your every move, babe,” Jorge said to me. “And that means your every move. He’s got a tracking device on your car.”\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003e“And in your phone,” Jorge went on.\u003c/p\u003e\n\u003cp\u003eShit!\u003c/p\u003e\n\u003cp\u003e“And we monitor your calls and texts,” he finished.\u003c/p\u003e\n\u003cp\u003eShit!\u003c/p\u003e\n\u003cp\u003e“Okay,” I replied. “So if you monitor my texts, does this mean you’ve been looking for him since this morning?”\u003c/p\u003e\n\u003cp\u003e“Lookin’ and findin’, Gwen,” Jorge returned. “Mighta went faster we didn’t have to keep your shit covered, you runnin’ around Denver, findin’ trouble.”\u003c/p\u003e\n\u003cp\u003eMy relief was so extreme, I felt lightheaded.\u003c/p\u003e\n\u003cp\u003e“You found him?” I breathed.\u003c/p\u003e\n\u003cp\u003e“Rescue mission is imminent and would be under way, we didn’t have to lock you and your sister down in Lee’s safe room to keep your shit out of trouble.”\u003c/p\u003e\n\u003cp\u003eMy relief fled as my eyes narrowed. “What did you expect me to do?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, hit base and tell us Hawk was compromised?” Jorge shot back.\u003c/p\u003e\n\u003cp\u003eSarcasm.\u003c/p\u003e\n\u003cp\u003e“I didn’t want you to go all commando and get him killed!” I yelled.\u003c/p\u003e\n\u003cp\u003e“Part of Hawk’s business is K and R, babe,” Jorge informed me.\u003c/p\u003e\n\u003cp\u003e“I don’t even know what that means,” I informed him back.\u003c/p\u003e\n\u003cp\u003e“Kidnap and ransom, or, for Hawk, the R stands for rescue,” Jorge enlightened me.\u003c/p\u003e\n\u003cp\u003eWow. That was cool.\u003c/p\u003e\n\u003cp\u003e“Really?” I whispered.\u003c/p\u003e\n\u003cp\u003e“Jesus,” Luke Stark muttered.\u003c/p\u003e\n\u003cp\u003e“Shirleen, make our guests comfortable,” Lee, clearly done with Jorge and my exchange, moved toward the outer door.\u003c/p\u003e\n\u003cp\u003e“I’m coming with you,” Ginger announced.\u003c/p\u003e\n\u003cp\u003e“You’re goin’ back to the Feds,” Lee contradicted.\u003c/p\u003e\n\u003cp\u003e“They want me,” Ginger returned.\u003c/p\u003e\n\u003cp\u003eLee stopped close to her. “They aren’t gettin’ what they want.”\u003c/p\u003e\n\u003cp\u003e“Her old man could get hurt,” Ginger told him.\u003c/p\u003e\n\u003cp\u003e“Woman, you know who I am, you know who Hawk is, you know his boys are trained, don’t talk stupid,” Lee warned.\u003c/p\u003e\n\u003cp\u003e“My sister’s old man can’t be –” Ginger started but Lee leaned into her\u003c/p\u003e\n\u003cp\u003e“He’s hangin’ from a hook right now, Ginger. I gotta stand here listenin’ to your mouth and your guilt, he hangs from that hook longer. You shut up, I can go get him and get him back to your sister. You got more to say?”\u003c/p\u003e\n\u003cp\u003e“I feel like taking a tour of the safe room,” I declared quickly, my eyes going to who I guessed was Shirleen, the tawny-eyed lady behind the reception desk. “Shirleen? Do you do tours?”\u003c/p\u003e\n\u003cp\u003eShe shot out of her chair. “Part of my job description.”\u003c/p\u003e\n\u003cp\u003e“Yay,” I said but it came out shaky.\u003c/p\u003e\n\u003cp\u003eShirleen rounded the desk and I looked to Ginger as the men headed toward the door. Shirleen scooped up Ginger as she passed her, hooking her arm through my sister’s and pulling her along.\u003c/p\u003e\n\u003cp\u003eMy eyes went to Lee who was the last one out the door and he paused before he went through, his eyes coming to me.\u003c/p\u003e\n\u003cp\u003e“Be careful,” I whispered, he nodded and I finished, “But bring him safe back to me.”\u003c/p\u003e\n\u003cp\u003e“Less than an hour, Gwen, he’ll be close enough to touch,” Lee whispered back and the tears filled my eyes and slid down my face.\u003c/p\u003e\n\u003cp\u003e“Thank you.” Those two words were barely audible\u003c/p\u003e\n\u003cp\u003eTracy’s arm hooked me, I had no choice but to turn away from Lee but before I did I saw his chin go up and then I saw the door close on his back.\u003c/p\u003e\n\u003cp\u003eTracy, Ginger, Shirleen and I were in the safe room.\u003c/p\u003e\n\u003cp\u003eIt wasn’t that big but we were all scrunched in there watching the movie 300 on a flat screen TV. This was a movie I suspected Shirleen watched a lot and I mostly suspected this because she quoted most of the dialogue while the actors were saying it. I also suspected this because it was already in the DVD player. And lastly I suspected this because she didn’t ask us what we wanted to watch, she just settled us in and turned it on.\u003c/p\u003e\n\u003cp\u003eThe room had a double bed, a reclining chair and shelves full of DVDs. Ginger was in the chair. I was tucked into a protective ball on the bed, pressed into the corner of the wall. Tracy was close to me, holding my hand. And Shirleen was lounging on her side across the foot of the bed.\u003c/p\u003e\n\u003cp\u003eGinger and Shirleen were watching the movie. I didn’t think Tracy was but I wasn’t sure because I was suspended in time.\u003c/p\u003e\n\u003cp\u003eSuddenly and without warning the door opened, my eyes shot to it and Hawk prowled through.\u003c/p\u003e\n\u003cp\u003eI sucked in breath and my heart stopped beating.\u003c/p\u003e\n\u003cp\u003eHe was clean and bloodless, his hair still wet from a shower and he was wearing a fresh pair of black cargos and a dark blue, skintight t-shirt. There was a raw, scary-looking cut on his lip, an equally raw, scary-looking cut and swelling on his cheek and around his eye. The cut on his cheek was taped closed by three, thin, short, white bandages. He also had angry red welts around both his wrists. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-110.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
