{"id":78625,"no":14,"title":"Page 14","content":"\u003cp\u003eDad’s arm squeezed me and his face, which had been slightly bemused when Hawk and Lawson were talking, had started beaming again at the thought of my Army man monitoring my house in an effort to keep me safe.\u003c/p\u003e\n\u003cp\u003eWhat he didn’t know was that it was an effort to keep tabs on me.\u003c/p\u003e\n\u003cp\u003eMy eyes moved from Dad to narrow on Hawk.\u003c/p\u003e\n\u003cp\u003e“Bax, do you think this has to do with Ginger?” Meredith whispered to my Dad and I un-narrowed my eyes and looked at my stepmom.\u003c/p\u003e\n\u003cp\u003eShe had a mass of somewhat curly, strawberry blonde hair that was streaked now with attractive white. She had a pixie-pretty face, upturned nose, cornflower blue eyes. She was petite, at least three inches shorter than me and eight inches shorter than Dad, standing at five foot five. This meant she could wear high heels, which she did almost all the time even now in the middle of the night, out to respond to the call of her stepdaughter who had a break-in, she was wearing stylish high-heeled boots. She’d taught me how to wear high heels and she taught me about style, in other words, how to embrace mine, however that came about and with her encouragement, I did.\u003c/p\u003e\n\u003cp\u003eThe skin around Dad’s eyes got tight, he looked at the men and declared, “I have another daughter and she –”\u003c/p\u003e\n\u003cp\u003eHawk broke in to announce, “We know about Ginger and it’s likely Gwen’s break-in has to do with Ginger’s recent activities.”\u003c/p\u003e\n\u003cp\u003eDad’s whole body got tight at my side and Meredith emitted a small gasp.\u003c/p\u003e\n\u003cp\u003eBut me? I lost my temper.\u003c/p\u003e\n\u003cp\u003eI stepped out from under Dad’s arm, grabbed Hawk’s hand and snapped, “Can I talk to you?”\u003c/p\u003e\n\u003cp\u003eThen I didn’t wait for him to answer. I turned and dragged him out of the kitchen, through the living room, up the stairs, down the hall and into my bedroom. I closed the door, it creaked then I turned, released his hand and stepped right into his space, getting up on my toes to get in his face.\u003c/p\u003e\n\u003cp\u003e“Why’d you do that?” I hissed under my breath.\u003c/p\u003e\n\u003cp\u003eHe was looking down at me. “Do what?”\u003c/p\u003e\n\u003cp\u003e“Tell them about Ginger!” I was snapping now but still under my breath.\u003c/p\u003e\n\u003cp\u003e“Babe,” he replied then said no more.\u003c/p\u003e\n\u003cp\u003e“Babe? That’s your answer?” I asked sharply. “You can’t tell them about Ginger.”\u003c/p\u003e\n\u003cp\u003eHis brows shot up. “Why not?”\u003c/p\u003e\n\u003cp\u003e“Because it will upset them and worry them and, I’ll repeat, upset them,” I retorted.\u003c/p\u003e\n\u003cp\u003eHis hands went to his h*ps and he replied, “Sweet Pea, I was a man with two daughters in trouble, I’d wanna know and I would not be happy that knowledge was kept from me.”\u003c/p\u003e\n\u003cp\u003e“Maybe so but I’m a daughter with a sister in trouble who knows a lot more about my family dynamic than you do and you might think you’d want to know but, trust me, Dad does not want to know and what’s more, Meredith shouldn’t know.”\u003c/p\u003e\n\u003cp\u003e“You need to explain shit to them,” he informed me and I felt my temper spike so I got closer to his face.\u003c/p\u003e\n\u003cp\u003e“Don’t tell me how to deal with my family,” I snapped.\u003c/p\u003e\n\u003cp\u003e“I can keep you safe, Gwen, and I will but I’m not expending energy to sort out your sister’s shit. She doesn’t pull off a miracle, things are gonna go bad for her. They gotta know that’s a strong eventuality.”\u003c/p\u003e\n\u003cp\u003eThere was a lot of ground I needed to cover so I started multitasking.\u003c/p\u003e\n\u003cp\u003e“I’m glad you brought that up,” I told him. “You are not doing anything, not only for Ginger but also for me. You can take down your cameras and stop keeping tabs. You and I, we’re over.”\u003c/p\u003e\n\u003cp\u003eHe grinned then he said, “We had this conversation earlier, babe.”\u003c/p\u003e\n\u003cp\u003e“Yes, you told me you end things but you live in Badass World. I live in the Real World and in the Real World, when a woman says it’s over, it carries the same weight as when a man says it.”\u003c/p\u003e\n\u003cp\u003eHawk’s eyes drifted over my face.\u003c/p\u003e\n\u003cp\u003eThen he murmured, “See my mistake.”\u003c/p\u003e\n\u003cp\u003e“What?” I snapped.\u003c/p\u003e\n\u003cp\u003eHis eyes moved to mine. “Shoulda given you time not f**kin’ you, missed out.”\u003c/p\u003e\n\u003cp\u003e“What?” I repeated on another snap.\u003c/p\u003e\n\u003cp\u003eHis hands lifted and came to my jaws so I instantly jerked my head free of his hands and took a step back.\u003c/p\u003e\n\u003cp\u003eThen, so suddenly my breath flew out of me and I couldn’t say for certain how it actually happened, I was pinned to the wall by his big, hard body, his hands were at my jaws in a way I couldn’t jerk my face free and his face was right in my face.\u003c/p\u003e\n\u003cp\u003e“About five seconds after I left you today, things between you and me, they changed,” he informed me in a quiet voice.\u003c/p\u003e\n\u003cp\u003eI felt my brows draw together as my mind processed the fact that this was not good.\u003c/p\u003e\n\u003cp\u003e“Changed?” I asked. “How?”\u003c/p\u003e\n\u003cp\u003e“You got attitude, the kind I like. So I decided I’m gonna ride that attitude wave of yours, see how things work out.”\u003c/p\u003e\n\u003cp\u003eI blinked. Then I did it again.\u003c/p\u003e\n\u003cp\u003e“You’re going to ride my attitude wave?” I asked even though, firstly, I didn’t really know what that meant so even if he affirmed I couldn’t be sure how that would affect me and secondly, I didn’t like talking about him riding anything that had to do with me.\u003c/p\u003e\n\u003cp\u003e“Yeah,” he answered and I was right, I didn’t know what that meant but I did know what it meant for him was that we weren’t over.\u003c/p\u003e\n\u003cp\u003e“You’re right,” I told him. “Earlier today, things between you and me changed but it happened about five minutes before you walked out and the way they changed means you and I are over.”\u003c/p\u003e\n\u003cp\u003eHis eyes never left me and he didn’t speak but he shook his head.\u003c/p\u003e\n\u003cp\u003e“Listen to me,” I demanded. “I just learned your name, not your real name, your nickname. I just learned you have a business, you have ‘boys’ and you watch my house. I’ve known you for over a year and you didn’t tell me any of that shit directly. This isn’t working for me anymore. This has been not right for a long time and finding out you’ve intruded into my life, investigated me, kept watch on me without my knowledge makes it not only just not right but very, very wrong. Therefore, we are over.”\u003c/p\u003e\n\u003cp\u003eHe studied me for awhile then his thumb swept my jaw before he remarked, “See you’ve decided not to make the right play.”\u003c/p\u003e\n\u003cp\u003e“And I see that you think it’s not the right play because it’s not the play you want me to make.”\u003c/p\u003e\n\u003cp\u003eHe smiled and informed me, “You don’t get it, babe. That heat in your eyes, that mouth of yours…” his thumb did another sweep as his face got even closer and when he spoke again, his voice dipped lower, “used to be, I thought about visiting you, could let myself start to get hard. Now, I just think about you, I start to get hard. You wanna play this with that attitude, Sweet Pea, I’m tellin’ you, that is not the right play because that attitude of yours is not a turn off.” \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-14.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
