{"id":78630,"no":19,"title":"Page 19","content":"\u003cp\u003eThen I asked Hawk, eyes on my computer, “What’s your real name?”\u003c/p\u003e\n\u003cp\u003e“Cabe Delgado.”\u003c/p\u003e\n\u003cp\u003eHe answered without hesitation and my head turned to him in surprise.\u003c/p\u003e\n\u003cp\u003e“Cabe Delgado?”\u003c/p\u003e\n\u003cp\u003eHe shoved more noodles into his mouth and didn’t answer.\u003c/p\u003e\n\u003cp\u003e“What kind of name is Cabe?” I asked.\u003c/p\u003e\n\u003cp\u003eHe swallowed and captured more noodles, muttering, “Who the f**k knows? Ma’s a nut.”\u003c/p\u003e\n\u003cp\u003eHis Ma was a nut.\u003c/p\u003e\n\u003cp\u003eInteresting.\u003c/p\u003e\n\u003cp\u003e“Is Delgado Mexican?” I pressed.\u003c/p\u003e\n\u003cp\u003e“Puerto Rican,” he answered, again without hesitation.\u003c/p\u003e\n\u003cp\u003e“You’re Puerto Rican?”\u003c/p\u003e\n\u003cp\u003e“Look at me, babe, not full-blooded Scandinavian.”\u003c/p\u003e\n\u003cp\u003eNope, he was definitely not that.\u003c/p\u003e\n\u003cp\u003e“Were you born in Puerto Rico?”\u003c/p\u003e\n\u003cp\u003e“Nope. Denver.”\u003c/p\u003e\n\u003cp\u003eA rare Denver native. Surprising.\u003c/p\u003e\n\u003cp\u003eI, on the other hand, was not a native. Dad had moved Meredith, Ginger and me to Denver from South Dakota when I was ten but I didn’t share this piece of information because Hawk probably already knew that.\u003c/p\u003e\n\u003cp\u003e“So your parents are Puerto Rican.”\u003c/p\u003e\n\u003cp\u003e“Dad is. Ma’s half Italian, half Cuban.”\u003c/p\u003e\n\u003cp\u003eNo wonder. Puerto Rican, Italian and Cuban – the perfect ingredients for a hot, bossy, badass cocktail.\u003c/p\u003e\n\u003cp\u003eHis brows went up. “Is this focus?”\u003c/p\u003e\n\u003cp\u003eGuess someone was done sharing.\u003c/p\u003e\n\u003cp\u003eI turned back to the computer, fished in my soup with my chopsticks, secured a big prawn, pulled it out and ate it.\u003c/p\u003e\n\u003cp\u003eFresh, spicy, brilliant.\u003c/p\u003e\n\u003cp\u003eI washed the prawn down with another sip of soup. Then I tried to focus on work with Cabe “Hawk” Delgado stretched out on my couch. Unsurprisingly, I was completely unable to do this but hopefully I was successful at pretending I could.\u003c/p\u003e\n\u003cp\u003eI’d finished my soup, leaving the mysterious bits uneaten in the bottom (I loved that soup but those mysterious bits freaked me out and I never ate them), taken a sip of my grape in preparation for the next culinary delight and opened my noodles when Hawk approached my desk, bending as he moved to snatch up the discarded bag.\u003c/p\u003e\n\u003cp\u003eHe shoved his container in the bag while I pretended to ignore him and he was reaching for my soup container when I heard, “Hawk.”\u003c/p\u003e\n\u003cp\u003eI twisted to see who I suspected was Hawk’s Numero Dos, the slim but cut man that Hawk was talking to outside earlier. He looked to be the same ethnic cocktail as Hawk and, even shorter and slighter, since he’d shared his name was “Smoke” and he had a scar that went from his temple into his dark hair, I figured he was probably not someone you messed with.\u003c/p\u003e\n\u003cp\u003e“Company,” he said to Hawk, his eyes not coming to me even for an instant then, like his name, poof! he vanished.\u003c/p\u003e\n\u003cp\u003eHawk moved, dumping my soup container into the bag and the bag into my garbage bin as he went. I moved too. Putting my noodles on my desk, I followed him.\u003c/p\u003e\n\u003cp\u003eWhen I hit the hall, Hawk stopped suddenly and turned so I ran into his front.\u003c/p\u003e\n\u003cp\u003eI took a step back, looked up at him and before I could say anything, he asked, “Any chance I tell you to stay up here you won’t give me lip?”\u003c/p\u003e\n\u003cp\u003e“No chance at all,” I answered.\u003c/p\u003e\n\u003cp\u003eHe stared at me a second then shook his head like I was intruding on his greeting company at his house rather than me walking down the stairs in my own damned house to greet my company. Then he turned and proceeded walking to the stairs.\u003c/p\u003e\n\u003cp\u003eI followed and heard him before I saw him.\u003c/p\u003e\n\u003cp\u003eThen I remembered it was Wednesday and Wednesday afternoons were Troy Days. We had a standing Wednesday afternoon appointment for coffee or beer or whatever since he had Wednesday afternoons off because he worked Saturday mornings.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003e“Who are you guys?” Troy asked as I walked down the stairs. “And where’s Gwen?”\u003c/p\u003e\n\u003cp\u003eHe came into my line of sight but by the time he did, Hawk had come into his line of sight and Troy was staring at him as I would guess anyone would have a tendency to stare at Hawk, Hawk being all that was Hawk. Then he jerked like he was pulling himself out of a trance and his eyes came to me.\u003c/p\u003e\n\u003cp\u003e“Gwen, honey, what’s going on? You didn’t tell me you were having work done.”\u003c/p\u003e\n\u003cp\u003e“Hey Troy,” I greeted as I came to stand several feet to the side of where Hawk was standing several feet from Troy.\u003c/p\u003e\n\u003cp\u003eHawk, however, didn’t like this distance and I knew this when he closed it and he didn’t close it by moving to me. He closed it by leaning to me, grabbing my forearm and giving it a tug so I had no option but to teeter sideways. I slammed into him, his hand left my arm and he caught me by clamping his arm around my shoulders.\u003c/p\u003e\n\u003cp\u003e“Wednesday,” Hawk muttered when he’d accomplished this feat, his eyes on Troy. “Shit, I forgot.”\u003c/p\u003e\n\u003cp\u003eTroy stared at Hawk, then he stared at me, then he stared at Hawk and me and he did all of this with his eyes wide and his mouth hanging open much like, I suspected, I looked on more than one occasion recently.\u003c/p\u003e\n\u003cp\u003eHowever I didn’t struggle against Hawk’s hold because I was catapulted back to yesterday when Hawk told me Troy wanted to get into my pants and therefore I was standing there, staring at Troy with his sandy blond hair and blue eyes, wearing his suit from the bank, and comparing. He was a Loan Manager. He wasn’t tall but he wasn’t short, he was, however, taller than me. He didn’t have a bad body but he wasn’t ripped by any stretch of the imagination. And he was so far from a commando it wasn’t funny.\u003c/p\u003e\n\u003cp\u003eTroy finally settled his gaze on Hawk and asked, “Who are you?”\u003c/p\u003e\n\u003cp\u003e“He’s –” I started but Hawk spoke over me.\u003c/p\u003e\n\u003cp\u003e“Hawk, Gwen’s man.”\u003c/p\u003e\n\u003cp\u003eShit! I wished he’d quit saying that!\u003c/p\u003e\n\u003cp\u003e“Gwen’s man?” Troy whispered, now his face had paled.\u003c/p\u003e\n\u003cp\u003eShit again!\u003c/p\u003e\n\u003cp\u003e“Troy, it’s not –” I began.\u003c/p\u003e\n\u003cp\u003eTroy’s pale face moved to me.\u003c/p\u003e\n\u003cp\u003e“You have a man?”\u003c/p\u003e\n\u003cp\u003e“Well… um –”\u003c/p\u003e\n\u003cp\u003e“Gwennie!” We all heard shouted and through the front door flew Tracy.\u003c/p\u003e\n\u003cp\u003eTroy turned to the door and all the commandos stopped dead. That happened a lot when Tracy Richmond entered a room and I was unsurprised that even commandos weren’t immune to Tracy’s charms.\u003c/p\u003e\n\u003cp\u003eThis was because she looked like a model, no joke. She was tall, taller than me by two inches. She had natural blonde hair that was long, sleek and straight as a sheet. She had dancing green eyes. She had perfect bone structure. She had a symmetrical face. She was thin with long, long legs and long, graceful, thin arms. She was not tits and ass. She was a human mannequin of the beautiful variety. Fashion designers the world over would be in throes of ecstasy, they caught sight of her. That was why any retail store in Denver hired her even though she was flighty and got bored easily so her average length of employment was around eleven months. If she told you something looked good on you, you’d visualize that you were her because you wanted to be her with every fiber of your being, you’d believe it and then you’d buy it. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-19.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
