{"id":78645,"no":34,"title":"Page 34","content":"\u003cp\u003eThen I muttered, “I hate it when he does that.”\u003c/p\u003e\n\u003cp\u003eBut I didn’t. If I was honest, I thought it was cool.\u003c/p\u003e\n\u003cp\u003eChapter Eleven\u003c/p\u003e\n\u003cp\u003eDress. Heels. Focus.\u003c/p\u003e\n\u003cp\u003eI was scoring through work again after getting eggs, bacon and coffee from Meredith; sharing in her delight that it was “only the living room, honey, and I’ve been after your Dad for months for a new couch” and “I really needed a few days off, so now I get to put my feet up” (told you she always looks on the bright side); saying hello to the commandos; having a shower; accepting delivery of my laptop, bag, purse and jacket direct from the “scene” from another of Hawk’s commandos; and holing myself in my office.\u003c/p\u003e\n\u003cp\u003eCam and Tracy had called. Cam because she heard talk at the Station about the firebombing. Tracy because she heard about the firebombing from Cam.\u003c/p\u003e\n\u003cp\u003eTroy didn’t call and this was either because he was nursing his wounds or because Cam and Tracy had kept this news from him because they thought he was probably nursing his wounds.\u003c/p\u003e\n\u003cp\u003eI gave some time to considering calling him but ended up deciding to give him time to nurse his wounds. Or at least this was what I told myself I was doing. Really, I was chicken.\u003c/p\u003e\n\u003cp\u003eEveryone knew that I was no go zone for chitchats outside of initial briefings about my childhood home getting firebombed, all of which were done. They knew I was about work and focus. So when my cell phone rang, I was surprised.\u003c/p\u003e\n\u003cp\u003eThen I figured it was Troy.\u003c/p\u003e\n\u003cp\u003eI picked it up, looked at the display and it said, “Hawk calling.”\u003c/p\u003e\n\u003cp\u003eI stared at it. I didn’t have his number programmed in my phone mainly because I didn’t have his number.\u003c/p\u003e\n\u003cp\u003eI flipped it open and put it to my ear wondering if Tracy was playing a practical joke and, if so, how did she pull it off and, more importantly, why?\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003e“Babe,” Hawk replied.\u003c/p\u003e\n\u003cp\u003eNope, not Tracy playing a practical joke.\u003c/p\u003e\n\u003cp\u003e“Hawk?”\u003c/p\u003e\n\u003cp\u003e“Little black dress, high heels, seven thirty,” he stated.\u003c/p\u003e\n\u003cp\u003eI blinked. Then I asked, “What?”\u003c/p\u003e\n\u003cp\u003e“Tonight.”\u003c/p\u003e\n\u003cp\u003e“Tonight what?”\u003c/p\u003e\n\u003cp\u003e“Tonight, you in a little black dress and high heels. I’ll be there at seven thirty.”\u003c/p\u003e\n\u003cp\u003eOhmigod! Hawk was asking me out on a date!\u003c/p\u003e\n\u003cp\u003eMy belly got squishy.\u003c/p\u003e\n\u003cp\u003e“Are you asking me out on a date?” I asked just to confirm.\u003c/p\u003e\n\u003cp\u003e“Sweet Pea, I’ve been f**kin’ you for a year and a half.”\u003c/p\u003e\n\u003cp\u003eMy belly stopped being squishy.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“So no, I’m not askin’. I’m tellin’ you, dress, heels, I’ll be there at seven thirty.”\u003c/p\u003e\n\u003cp\u003eUh… what?\u003c/p\u003e\n\u003cp\u003e“So, you’re not asking me out on a date, you’re telling me we’re going out on a date,” I guessed though I knew it was accurately.\u003c/p\u003e\n\u003cp\u003e“That’s about it,” he replied.\u003c/p\u003e\n\u003cp\u003e“You can’t tell me we’re going on a date!” I snapped.\u003c/p\u003e\n\u003cp\u003e“Just did, babe.”\u003c/p\u003e\n\u003cp\u003e“Con,” I muttered because that was a serious con.\u003c/p\u003e\n\u003cp\u003eHe chuckled his deep, manly, amused chuckle, then he ordered, “Get work done, I want your focus on me, not work.”\u003c/p\u003e\n\u003cp\u003e“I don’t think I’ll have time for a date. I’m buried.” This was a lie. With the work I got done last night and today, I was catching up. I totally had time for a date and I had a life creed that stated that any opportunity to wear a little black dress was to be taken up, no ifs, ands, or buts. However, I was making an exception.\u003c/p\u003e\n\u003cp\u003e“Was made pretty clear last night even before I fought a fire side-by-side with your old man that I had their blessing, Gwen, don’t think they’d step in if I dressed you myself and carried you kicking and screaming to my car.”\u003c/p\u003e\n\u003cp\u003eThis was, unfortunately, true.\u003c/p\u003e\n\u003cp\u003eI shifted focus to something else annoying.\u003c/p\u003e\n\u003cp\u003e“Did you program yourself into my phone?” I demanded to know.\u003c/p\u003e\n\u003cp\u003e“Yeah,” he answered.\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“Before I handed it off to Fang.”\u003c/p\u003e\n\u003cp\u003e“Fang?”\u003c/p\u003e\n\u003cp\u003e“My boy who brought you your shit.”\u003c/p\u003e\n\u003cp\u003eJeez. That guy’s name was Fang? I could see it, I’d noticed his eyeteeth were somewhat prominent but I couldn’t imagine he’d be okay with that nickname considering it seemed to be making fun of this unfortunate dental anomaly and he looked like he could hammer a human body through cement with his fist if he thought someone was making fun of him.\u003c/p\u003e\n\u003cp\u003e“Why?” I continued.\u003c/p\u003e\n\u003cp\u003e“Why what?” Hawk asked.\u003c/p\u003e\n\u003cp\u003e“Why did you program yourself into my phone?”\u003c/p\u003e\n\u003cp\u003eSilence then, “Babe.”\u003c/p\u003e\n\u003cp\u003eAs usual, there was no more.\u003c/p\u003e\n\u003cp\u003e“Babe what? We’ve had a non-relationship for months, now we’ve shifted and I’ve explained I’m uncertain about this shift and our future.”\u003c/p\u003e\n\u003cp\u003e“You can be as uncertain as you want, Sweet Pea, I’m certain enough for both of us. Dress. Heels. Focus. Seven thirty.”\u003c/p\u003e\n\u003cp\u003eI opened my mouth to say something but I had dead air.\u003c/p\u003e\n\u003cp\u003eI flipped my phone shut. Then I stared at it.\u003c/p\u003e\n\u003cp\u003eThen I tossed it on my desk and snapped, “God, he’s so infuriating.”\u003c/p\u003e\n\u003cp\u003eBut even as I said it, I knew deep down that firstly, I was happy I had the opportunity to don one of my little black dresses and secondly, I was just a wee bit excited that I finally, finally had a date with Cabe “Hawk” Delgado.\u003c/p\u003e\n\u003cp\u003eI went back to work pretending that I wasn’t thinking that I hoped I got to ride in his Camaro.\u003c/p\u003e\n\u003cp\u003eIt was nearly seven thirty, Dad was home and in my office watching television while Meredith was pottering around, likely rearranging all the stuff in my drawers and cupboards in the kitchen and I was in the bathroom freaking out about my date with Hawk.\u003c/p\u003e\n\u003cp\u003eThis freaking out business was partly due to the fact that I was getting ready for my date with Hawk and not sticking to my guns about not going on a date with Hawk and the fact that again, I was likely making stupid choices about all things Hawk.\u003c/p\u003e\n\u003cp\u003eIt was also partly due to the fact that I really, really hoped he liked my dress.\u003c/p\u003e\n\u003cp\u003eThe commandos were done with my security system and I knew this because Smoke had given Meredith and me a rather long lesson on how to use it.\u003c/p\u003e\n\u003cp\u003eIt seemed complicated. I’d never had an alarm system but I figured usually you punched in some numbers and presto! – security. But mine included panic buttons in my office, my bedroom, kitchen, living room and, overkill, the bathroom. It also included different codes for different types of alarms, say, windows and doors only or to activate the sensors in the house. There was also a different code that sent the message to “base” that there might be an unknown situation and they should come in “soft” whatever the hell that meant. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-34.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
