{"id":78657,"no":46,"title":"Page 46","content":"\u003cp\u003e“I’ll always be filler,” I told my toes.\u003c/p\u003e\n\u003cp\u003e“Oh honey,” Tracy whispered.\u003c/p\u003e\n\u003cp\u003eSuddenly, I pulled away, lifted my head and announced, “I need to finish on my deadline.” I looked at Cam. “Can I stay with you and Leo tonight?”\u003c/p\u003e\n\u003cp\u003e“I don’t think that’s a good idea,” Tracy stated.\u003c/p\u003e\n\u003cp\u003e“Yeah, babe, you can,” Cam replied.\u003c/p\u003e\n\u003cp\u003e“Cam!” Tracy snapped and Cam looked at her.\u003c/p\u003e\n\u003cp\u003e“She needs space,” Cam returned.\u003c/p\u003e\n\u003cp\u003eTracy looked at me. “He’s coming to you tonight, isn’t he?”\u003c/p\u003e\n\u003cp\u003e“No,” I told her. “He wants me to go to him.”\u003c/p\u003e\n\u003cp\u003eHer eyes lit and she moved in close. “Then go.”\u003c/p\u003e\n\u003cp\u003e“No,” I replied.\u003c/p\u003e\n\u003cp\u003eShe put her hands on my shoulders. “Gwennie, this is shit, I get it, this sucks but I can’t help but think that –”\u003c/p\u003e\n\u003cp\u003eI stepped back and her hands dropped. “I can. I can think it. And I’m not even mad at him, Trace. I’m not. This is me. I did this to me. I allowed this to happen. And if I’m ever going to have any self-respect after this f**king, f**king mess, I’m the one who has to stop it.”\u003c/p\u003e\n\u003cp\u003e“That’s a bad decision,” Tracy said firmly.\u003c/p\u003e\n\u003cp\u003e“Maybe so but it’s the one I’ve made,” I replied and straightened my shoulders. “Scott f**ked me over and I loved him. That killed me. I even knew it was happening and I allowed it until I couldn’t put up with allowing it anymore. With Scott, I waited too long to look after myself, hoping he’d sort his shit out, and I waited too long with Hawk. Even if things have changed for him, I’ll always know what I allowed myself to be, what other people think of me. No wonder both Lawson and Tack thought they could make a play. They want to get in there and who can blame them? A sure thing who opens her bed and her legs, no questions asked, no expectations, just an opportunity to get off and go your own way until you’re done. Shit!”\u003c/p\u003e\n\u003cp\u003e“That isn’t who you are,” Cam declared.\u003c/p\u003e\n\u003cp\u003e“No? Seems like it to me,” I shot back.\u003c/p\u003e\n\u003cp\u003e“Then, girl, you’re wrong,” Cam retorted.\u003c/p\u003e\n\u003cp\u003eI shook my head. “I can’t think about this now. I have to work. I’ll come over as soon as I send my files,” I told Cam.\u003c/p\u003e\n\u003cp\u003eShe studied me then she said quietly, “All right, girl. I’m off today. I’ll get ice cream.”\u003c/p\u003e\n\u003cp\u003e“Cookie dough,” I corrected.\u003c/p\u003e\n\u003cp\u003e“Cookie dough,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Gwennie –” Trace started and my eyes moved to her.\u003c/p\u003e\n\u003cp\u003e“I love you, babe, you know I do but not now. I can’t take your hope now. Please.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she whispered.\u003c/p\u003e\n\u003cp\u003e“I need to work,” I repeated.\u003c/p\u003e\n\u003cp\u003e“Right,” Cam replied.\u003c/p\u003e\n\u003cp\u003eI nodded my head once and twisted to turn on my computer. I snatched a Kleenex out of the box on my desk to mop up the coffee spill as I heard them move out of the room.\u003c/p\u003e\n\u003cp\u003e“Gwen?” Cam called and I turned back, coffee-wet Kleenex in my hand, she was in my door. “Scott was an ass and Delgado controls his life to within an inch of it. He got one dose of you in the light of day and he’s shifted his entire way of doing things. You are not who you think you are,” she told me.\u003c/p\u003e\n\u003cp\u003eNo, she was wrong. I was exactly who I thought I was and the worst of it was, Cabe “Hawk” Delgado knew it.\u003c/p\u003e\n\u003cp\u003e“I have to work,” I told her.\u003c/p\u003e\n\u003cp\u003e“You’re not who you think you are,” she repeated.\u003c/p\u003e\n\u003cp\u003eI stared at her.\u003c/p\u003e\n\u003cp\u003e“Cookie dough,” she whispered then disappeared from my door.\u003c/p\u003e\n\u003cp\u003e“Ready, ready,” I said to the courier who was standing inside my door, waiting, visibly impatiently, for me to finish writing out the check from the amount I’d jotted down when I called Nordstrom’s to find out exactly how much a pair of fabulous, silver, watersnake, platform, peep toed slingbacks cost.\u003c/p\u003e\n\u003cp\u003eI signed the check, ripped it off and shoved it in the envelope with the note I’d dashed out while I still had the courage.\u003c/p\u003e\n\u003cp\u003eHawk,\u003c/p\u003e\n\u003cp\u003eFor the shoes. You need to find a replacement for my shifts.\u003c/p\u003e\n\u003cp\u003eGwen\u003c/p\u003e\n\u003cp\u003eI licked the envelope, closed it and handed it to the courier.\u003c/p\u003e\n\u003cp\u003e“You don’t have a name of the company?” he asked me.\u003c/p\u003e\n\u003cp\u003eI shook my head. “No, I just know the building, fourteenth floor, turn right off the elevators, right again down the hall and second door down on the left. Tell whoever you hand it to to give it to Hawk.”\u003c/p\u003e\n\u003cp\u003eHis brows shot up. “Hawk?”\u003c/p\u003e\n\u003cp\u003e“Hawk.”\u003c/p\u003e\n\u003cp\u003eHe eyed me like he thought I had a screw loose.\u003c/p\u003e\n\u003cp\u003eThen he muttered, “Whatever,” and took his leave.\u003c/p\u003e\n\u003cp\u003eI shut the door behind him.\u003c/p\u003e\n\u003cp\u003eThen I walked upstairs and sent my work to my author with my notes. Then I packed a bag. Then I wrote a note for Dad and Meredith and left it in the kitchen. Then I got in my car which Meredith and I had gone to get from her house the day before.\u003c/p\u003e\n\u003cp\u003eThen I went to Cam and Leo’s.\u003c/p\u003e\n\u003cp\u003eChapter Fifteen\u003c/p\u003e\n\u003cp\u003eFerret Rescue\u003c/p\u003e\n\u003cp\u003eI sat at Cam and Leo’s kitchen table with Leo. I was in my nightshirt. Leo was in a gray t-shirt and plaid pajama bottoms. Cam had an early shift. Leo had a late one.\u003c/p\u003e\n\u003cp\u003eLeonard Freeman was all bulky, compacted muscle on an average height frame, kind black eyes and midnight skin. He was man from head-to-toe which made him perfect for Camille because, except for her lack of cle**age (which was camouflaged by her ample booty and beautiful face) she was all woman.\u003c/p\u003e\n\u003cp\u003eLeo took a sip of coffee and so did I.\u003c/p\u003e\n\u003cp\u003eThen he started, “Gwen –”\u003c/p\u003e\n\u003cp\u003eNope. No. Where Camille Antoine was a straight-talker, Leo was a sage. If he lived back in ancient Greece, Leo would kick Plato’s ass. He had life figured out and in a flash he could read people and situations and know exactly what was going on. This made him a good cop but a dangerous friend.\u003c/p\u003e\n\u003cp\u003eDesperate, I shifted focus and because I was desperate, I opened my mouth and inserted my foot.\u003c/p\u003e\n\u003cp\u003e“Why haven’t you asked Cam to marry you?”\u003c/p\u003e\n\u003cp\u003eHis eyes widened and he stared at me.\u003c/p\u003e\n\u003cp\u003eShit. Shit, shit, shit! Did I actually say that?\u003c/p\u003e\n\u003cp\u003e“Um…” I started to backtrack but couldn’t figure out how.\u003c/p\u003e\n\u003cp\u003e“She wants to get married?” Leo asked and it was my turn to stare. Apparently, Leo being able to read everybody didn’t extend to his live-in girlfriend.\u003c/p\u003e\n\u003cp\u003e“Well…” I hesitated, “yeah.” \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-46.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
