{"id":78665,"no":54,"title":"Page 54","content":"\u003cp\u003eHis hand went between us, finger back to my golden spot and my body jolted.\u003c/p\u003e\n\u003cp\u003e“Hawk, baby,” I moaned when what his finger and c**k were doing to my body rocked straight through that body.\u003c/p\u003e\n\u003cp\u003e“You gonna dodge me again?” he asked in my ear, driving in with his c**k and pressing and rolling with his finger.\u003c/p\u003e\n\u003cp\u003e“No,” I gasped.\u003c/p\u003e\n\u003cp\u003e“Promise, Gwen,” he demanded.\u003c/p\u003e\n\u003cp\u003e“I promise,” I gasped.\u003c/p\u003e\n\u003cp\u003eHis head came up and he looked down at me and when he did, I stared. I’d never seen his face like that in the light. I’d never seen it like that ever.\u003c/p\u003e\n\u003cp\u003eGod… God, but he was beautiful, always but more so with him filling me, pounding into me, touching me, his heavy weight bearing me down, his face dark with hunger, his eyes heated and intense.\u003c/p\u003e\n\u003cp\u003eGod.\u003c/p\u003e\n\u003cp\u003eIt was building again, just looking at him (not to mention all the other stuff).\u003c/p\u003e\n\u003cp\u003e“You gonna ride this out with me?” he growled.\u003c/p\u003e\n\u003cp\u003eOh yeah. Yeah, I was definitely going to ride this out with him.\u003c/p\u003e\n\u003cp\u003e“Yes,” I whispered.\u003c/p\u003e\n\u003cp\u003e“You gonna give me sweet?” he went on growling and pounding and pressing and rolling, relentless, amazing.\u003c/p\u003e\n\u003cp\u003e“Yes,” I whimpered because I could feel it, he was about to give me sweet. Again.\u003c/p\u003e\n\u003cp\u003eHis mouth touched mine. “I feel that,” he whispered. “Fuck, Gwen, beautiful. Always so f**kin’ beautiful. You’re there, Sweet Pea.”\u003c/p\u003e\n\u003cp\u003e“Yeah baby,” I breathed against his lips, my h*ps surged up, my limbs got tight, my back arched, I came yet again, it was brilliant and awe-inspiring yet again and he kissed me so my moans slid into his mouth\u003c/p\u003e\n\u003cp\u003eI held on as I came then I came down then he kept surging into me, his lips slid down to my ear where I listened to him grunt as he went faster, harder and I f**king loved holding all that was Hawk, the immense power of him wrapped in my limbs.\u003c/p\u003e\n\u003cp\u003eHis hands spanned my h*ps and he pulled up and thrust deep as his grunts turned to groans then finally he planted himself inside me and stopped.\u003c/p\u003e\n\u003cp\u003eUnbelievably magnificent.\u003c/p\u003e\n\u003cp\u003eI held on like I always held on because before, I didn’t want him to go. But before, I eventually loosened my hold because I knew he’d eventually go.\u003c/p\u003e\n\u003cp\u003eNow it wasn’t the middle of the night. Now he wasn’t a shadowy lover whose name I did not know. Now neither of us had anywhere to go.\u003c/p\u003e\n\u003cp\u003eSo now what did I do?\u003c/p\u003e\n\u003cp\u003eMy limbs loosened and he pulled out. I closed my eyes as he slid off to my side.\u003c/p\u003e\n\u003cp\u003eThis was familiar. Get off then retreat. Pull out and pull away. Close off.\u003c/p\u003e\n\u003cp\u003eThen I opened my eyes as the heat of him stayed glued to my side.\u003c/p\u003e\n\u003cp\u003eHis torso was partially lifted, his head was bent, his eyes were watching his hand glide from my hip to my waist, in over my belly between my br**sts and then up my neck where it moved away. Then I felt his finger slide down my hairline, pushing my hair off my neck, his hand moved to my jaw, he gently twisted my neck then his hand went away but he bent in and I felt his tongue touch the skin behind my ear as his hand slid back down my body. Finally, his arm came to rest low on my belly and curved around my hip.\u003c/p\u003e\n\u003cp\u003eHe’d never done this before. This was different. This was better. Seriously better.\u003c/p\u003e\n\u003cp\u003eOh boy.\u003c/p\u003e\n\u003cp\u003e“Just two this time,” he murmured into my ear. “Losin’ my touch.”\u003c/p\u003e\n\u003cp\u003e“What?” I whispered and his head came up but he stayed close, pressed in, his face near mine.\u003c/p\u003e\n\u003cp\u003e“My mouth and fingers, babe, you only came twice.”\u003c/p\u003e\n\u003cp\u003e“Um… well, I came once before and once after so I’m pretty sure I’m covered.”\u003c/p\u003e\n\u003cp\u003eHe grinned then he bent and touched his mouth to the base of my throat. His head moved away but he locked his eyes to mine.\u003c/p\u003e\n\u003cp\u003eThey were heated and intense.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003e“How do you heat this place?” I asked, directing post-coital pillow talk to the mundane for sanity’s sake. I didn’t want a play-by-play. My head was messed up enough, I didn’t know where this was going, I didn’t know what I was thinking and I was scared as hell of what I was feeling. Talking about how great sex was with Hawk only intensified all of that.\u003c/p\u003e\n\u003cp\u003e“What?” he asked back.\u003c/p\u003e\n\u003cp\u003e“You live in a warehouse with cement floors, Hawk, it’s a minor miracle you can heat this place.”\u003c/p\u003e\n\u003cp\u003eHis response was to shift, bending over my body, he grabbed the covers and pulled them up over us.\u003c/p\u003e\n\u003cp\u003eHe thought I was saying I was cold. Then he instantly did something about it.\u003c/p\u003e\n\u003cp\u003eOkay, maybe I did want to talk about how great sex was with Hawk because experiencing him being sweet and thoughtful messed with my head a whole lot more than his ability to give me four really, f**king fantastic orgasms in the span of thirty minutes.\u003c/p\u003e\n\u003cp\u003eThen his arm went low on my hip again and he turned me to my side facing him, his legs tangling with mine, his arm pulling me close.\u003c/p\u003e\n\u003cp\u003eFor my part, I rested my hands to his chest because I liked touching him and because I liked this. This wasn’t retreat. This wasn’t slam bam, thank you ma’am. This was nice.\u003c/p\u003e\n\u003cp\u003e“It’s not as bad as it seems,” he belatedly replied.\u003c/p\u003e\n\u003cp\u003e“Your heating bills must cost as much as my mortgage,” I remarked.\u003c/p\u003e\n\u003cp\u003eHe smiled at me. “No.”\u003c/p\u003e\n\u003cp\u003e“You would know,” I muttered, looking at his throat.\u003c/p\u003e\n\u003cp\u003e“Yeah, I do, Sweet Pea, and you need to refinance. The interest you’re payin’ is ridiculous. I’ll sort a meeting with my financial advisor.”\u003c/p\u003e\n\u003cp\u003eMy eyes lifted to his as I felt my belly start to get squishy.\u003c/p\u003e\n\u003cp\u003e“You’ll sort a meeting out with your financial advisor?” I asked.\u003c/p\u003e\n\u003cp\u003e“Yeah,” he answered.\u003c/p\u003e\n\u003cp\u003eUh-oh. He was being sweet and thoughtful again.\u003c/p\u003e\n\u003cp\u003e“Is that part of your Protect Gwendolyn Kidd Duties, to make sure I don’t get gouged by mortgage lenders?” I asked.\u003c/p\u003e\n\u003cp\u003eHe kept smiling and his arm got tighter. “There are many facets to my Protect Gwendolyn Kidd Duties.”\u003c/p\u003e\n\u003cp\u003e“Care to expand on that?”\u003c/p\u003e\n\u003cp\u003e“Not really.”\u003c/p\u003e\n\u003cp\u003eI held his eyes. Then I mumbled, “Unh-hunh.”\u003c/p\u003e\n\u003cp\u003eHis smile got bigger and I knew this because his dimples pressed deeper.\u003c/p\u003e\n\u003cp\u003e“Unh-hunh?” he prompted.\u003c/p\u003e\n\u003cp\u003e“Man of mystery,” I replied.\u003c/p\u003e\n\u003cp\u003eHis hand trailed up my back and his head dipped closer to mine. “I like surprising you, Sweet Pea. Whenever I do something you like, your face gentles.” He touched his mouth to mine and moved back a smidge. “It’s a good look,” he finished on a whisper. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-54.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
