{"id":78672,"no":61,"title":"Page 61","content":"\u003cp\u003eI was pretty shocked Hawk was explaining this but even more shocked that he shared so many words.\u003c/p\u003e\n\u003cp\u003e“Instinct?” I asked when he stopped talking, fascinated at the same time mildly freaked out.\u003c/p\u003e\n\u003cp\u003e“You can be pretty smart when you’re actin’ on instinct in order to survive. These guys, they are far from dumb. These guys have been doin’ this so long, they’re masterminds. And I’m not jokin’.”\u003c/p\u003e\n\u003cp\u003e“Oh,” I whispered.\u003c/p\u003e\n\u003cp\u003e“Through this shit, the last twenty years, Kane has been growin’ the custom bike and car business. Quiet, at first, and patient, it turns out. He’s had a plan, all this time, twenty f**kin’ years. Slowly building the reputation, slowly getting attention for it, now everyone knows about it. Hard to keep doin’ seriously bad shit when journalists and photographers are writin’ stories and takin’ photos and Hollywood movie stars are visiting your garage. He talked the club into feedin’ the money into Ride, branched out, built stores in C Springs, Boulder. Now it’s nearly as lucrative as the illegal shit and he made it that way so, when he made his move to take over, standard of living for his boys wouldn’t take that big of a hit, they cut ties with that other shit. So, that’s what he did.”\u003c/p\u003e\n\u003cp\u003e“The Chaos MC is clean?” I asked.\u003c/p\u003e\n\u003cp\u003e“Wouldn’t say that, babe, but they don’t peddle flesh or transport drugs anymore.”\u003c/p\u003e\n\u003cp\u003e“That’s good,” I noted.\u003c/p\u003e\n\u003cp\u003e“Yeah, in the sense that Kane and his boys don’t face a future where it might be that their only wardrobe choice is an orange jumpsuit. Problem is, they were good at safe transportation and now that they don’t offer that service, sometimes demand gets cut off from supply. This has made some very dangerous people not very happy. And Kane is the man behind their unhappiness. He’s got boys in his ranks would be happy to go back to what they were doin’. There’s unrest, he’s dealin’ with that, and there’s outside pressure, and he’s dealin’ with that. He’s a marked man and until he figures out who’s behind the rebellion in his Club and the outside factions sort out their shit and move on, he’s got problems.”\u003c/p\u003e\n\u003cp\u003e“How is, um…” I took in a breath and then asked, “Ginger involved with that? Is it the drugs?”\u003c/p\u003e\n\u003cp\u003e“Nope,” Hawk replied.\u003c/p\u003e\n\u003cp\u003eOh shit.\u003c/p\u003e\n\u003cp\u003e“Did she let them peddle her flesh?”\u003c/p\u003e\n\u003cp\u003e“No babe,” his arm gave me a squeeze, “she was the inside man on the theft of three custom cars and a custom bike, a shitload of gear and the contents of a safe.”\u003c/p\u003e\n\u003cp\u003e“The inside man?” I asked.\u003c/p\u003e\n\u003cp\u003eHawk paused to study me then his fingers sifted through my hair and I realized he did this for the same reasons Cam took in breath. He did it to prepare me.\u003c/p\u003e\n\u003cp\u003e“Her chosen profession, Sweet Pea. She’s got one thing goin’ for her and that is that no one takes her seriously. She was smart enough to listen and learn in a lot of places. She sold information, she provided distraction for a price and, also for a price, she provided access. She wasn’t smart enough not to keep her shit quiet, not to be invisible and not to f**k over the wrong people. She wasn’t choosy, she’s equal opportunity. She f**ked everyone and now she’s f**ked.”\u003c/p\u003e\n\u003cp\u003e“How many people has she f**ked over?” I asked.\u003c/p\u003e\n\u003cp\u003e“Too many,” Hawk answered.\u003c/p\u003e\n\u003cp\u003e“And their danger zone levels?”\u003c/p\u003e\n\u003cp\u003e“Off the charts,” Hawk replied. “Kane and Chaos are the least of her troubles and, Gwen, they may have cleaned up but that doesn’t mean they play by the rules. They caught her; they’d deal with her their own way. They would not hand her over to the cops. They’d find a way to take back what she owed them and they’d be creative about it.”\u003c/p\u003e\n\u003cp\u003eMy body gave a tremble as my hand clenched against his thermal and when it did, his hand left my hair and he slid his knuckles down my jaw.\u003c/p\u003e\n\u003cp\u003e“Yeah, baby, it is not lookin’ good for Ginger,” he whispered.\u003c/p\u003e\n\u003cp\u003e“Will you find her for me?” I blurted and then I tensed. I couldn’t ask that, I couldn’t ask Hawk and his boys to wade in –\u003c/p\u003e\n\u003cp\u003e“Already tryin’, Sweet Pea.” I stared and he talked. “Not for her, for you, your Dad and your stepmom.”\u003c/p\u003e\n\u003cp\u003eUh… wow.\u003c/p\u003e\n\u003cp\u003e“I… I don’t know what… you are?” I stammered.\u003c/p\u003e\n\u003cp\u003e“Gwen, I carried you through fire. That shit’s gotta stop.”\u003c/p\u003e\n\u003cp\u003e“Right,” I whispered, my belly squishy, my heart swelling, my throat tingling, my eyes looking into his.\u003c/p\u003e\n\u003cp\u003eHis eyes smiled. “You can pay me back, you make dinner.”\u003c/p\u003e\n\u003cp\u003e“Making dinner would be payback?”\u003c/p\u003e\n\u003cp\u003e“Nope, not all of it, but it’ll carve a bit off what you owe me.”\u003c/p\u003e\n\u003cp\u003eI felt my lips tip up as my head tipped to the side. “Does that mean I have to steam vegetables?”\u003c/p\u003e\n\u003cp\u003e“Is that a problem for you?”\u003c/p\u003e\n\u003cp\u003e“No, but the only things you have in your fridge are fruit, cottage cheese and vegetables. Your Mom used all the eggs and bacon and I had lunchmeat for lunch so that leaves veggies for dinner. I’m not sure my system will accept nothing but veggies for dinner. It might react and my guess would be that reaction would be violent.”\u003c/p\u003e\n\u003cp\u003eHe grinned at me then remarked, “There are stores in Denver. Some of them even carry groceries.”\u003c/p\u003e\n\u003cp\u003e“Now who’s the smartass?” I mumbled.\u003c/p\u003e\n\u003cp\u003e“All right, babe, get your shoes and get your ass to the Camaro. We’re goin’ to the grocery store.”\u003c/p\u003e\n\u003cp\u003e“And still bossy,” I went on mumbling.\u003c/p\u003e\n\u003cp\u003e“Are you hungry?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” I answered.\u003c/p\u003e\n\u003cp\u003e“Do you want vegetables for dinner?”\u003c/p\u003e\n\u003cp\u003e“Heck no.”\u003c/p\u003e\n\u003cp\u003e“Then get your ass up, get your shoes and get in the Camaro.”\u003c/p\u003e\n\u003cp\u003e“B-o-s-s-y.” I spelled it out like his Mom did earlier, moving to exit the recliner but his arms suddenly closed around me and I found myself plastered to his chest, his hand slid up to cup my head, tilt it then pull my lips down to his.\u003c/p\u003e\n\u003cp\u003eThen he kissed the smartass right out of me.\u003c/p\u003e\n\u003cp\u003eAfter that, I got up and did what I was ordered.\u003c/p\u003e\n\u003cp\u003e“Baby,” I breathed.\u003c/p\u003e\n\u003cp\u003e“You’re there,” Hawk growled in my ear, hand cupping my breast, fingers rolling my nipple, his other hand over mine, his finger manipulating mine at the golden spot while his c**k drove inside me. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-61.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
