{"id":78688,"no":78,"title":"Page 78","content":"\u003cp\u003eWhat was he doing there?\u003c/p\u003e\n\u003cp\u003e“What the f**k?” he clipped at Hawk, that threatening energy shifting off him in sinister waves and I saw all the badasses go on instant alert.\u003c/p\u003e\n\u003cp\u003e“Come again?” Hawk asked quietly, his eyes locked on Skull, his expression showing he was vastly unhappier than Skull was.\u003c/p\u003e\n\u003cp\u003e“A year and a half,” Skull replied, assuming a hostile stance way too close to Hawk. “I spent a year and a half of my f**kin’ life on this f**kin’ shit, the last month bangin’ that piece of trash, pretendin’ I got off on it, all the time tryin’ not to vomit and prayin’ my dick’ll stay hard at the same time prayin’ that stickin’ it in her wouldn’t buy me some disease where it would fall the f**k off and I was this close, this f**kin’ close.” He held up a finger and thumb less than an inch apart in Hawk’s face which I, personally, didn’t think was too smart. “You bust in there and that year and a half goes down the f**kin’ toilet.”\u003c/p\u003e\n\u003cp\u003eHawk’s body shifted in a scary way and he invited, still using that terrifying quiet voice, “Maybe you’ll explain.”\u003c/p\u003e\n\u003cp\u003e“He’s DEA, Hawk,” Lawson put in, this news making my body relax but that didn’t mean I didn’t feel shock.\u003c/p\u003e\n\u003cp\u003eHawk’s body didn’t relax.\u003c/p\u003e\n\u003cp\u003e“You were involved in an operation where one of my men went down,” Hawk pointed out.\u003c/p\u003e\n\u003cp\u003e“I was involved in an operation where I finally got close to a skank who I could use to nail down another skank who I could use to nail my man. When that didn’t work, she still proved valuable to get me that other skank because she got me close to that skank’s sister who I could then use either to out my tool who would help me take out the players who supply half the shit circulating Denver or who I could use directly to take out the players who supply half the f**kin’ shit circulating f**kin’ Denver,” Skull returned.\u003c/p\u003e\n\u003cp\u003eI was slightly confused by his statement but I knew the others were not. I knew this because Skull’s statement was met by a significant intensification of unfriendliness. So significant, the air became hard to breathe.\u003c/p\u003e\n\u003cp\u003e“You tellin’ me, you downed my man and were gonna use my woman as bait?” Hawk whispered and Elvira’s hand clenched mine.\u003c/p\u003e\n\u003cp\u003e“Uh-oh, I see psycho badass comin’ on,” she muttered.\u003c/p\u003e\n\u003cp\u003e“She was covered,” Skull shot back.\u003c/p\u003e\n\u003cp\u003e“By who?” Hawk asked.\u003c/p\u003e\n\u003cp\u003e“By my man inside Roarke’s crew,” Skull answered.\u003c/p\u003e\n\u003cp\u003e“Roarke?” Hawk said and how he managed to get his lips to move when his face had turned to marble was a miracle.\u003c/p\u003e\n\u003cp\u003e“Yeah, I see it’s sinkin’ in,” Skull ground out.\u003c/p\u003e\n\u003cp\u003e“You had to use Gwen, Roarke would have cut her up, Ginger knows it so she’d step in then he’d keep Gwen and enjoy his shit with Ginger and if he left either of ‘em breathin’, they would live the rest of their lives wishin’ he didn’t,” Hawk clipped back.\u003c/p\u003e\n\u003cp\u003eOh boy. That didn’t sound good. That sounded very, very bad. That sounded get my ass to the mall instantly and buy sexy underwear as a reward for my rescue bad.\u003c/p\u003e\n\u003cp\u003e“I had it covered,” Skull returned.\u003c/p\u003e\n\u003cp\u003e“Your man inside?” Hawk asked, edging toward sarcastic but still extremely displeased.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Skull answered.\u003c/p\u003e\n\u003cp\u003e“They scented him, they wouldn’t play, they’d cut his f**kin’ throat and dump him in the Platte,” Hawk growled. “In no way did you have this covered.”\u003c/p\u003e\n\u003cp\u003e“I had to use Ginger or Gwen, before I handed her over, I woulda wired her and tagged her so we’d know exactly where she was and could hear everything goin’ down,” Skull hit back. “And, by the way, it woulda helped, she was in on this shit but you and Wonder Cop here,” he jerked his thumb at Lawson, “were breathin’ so hot and heavy down her neck, the night I broke in to have my chat with her to give her a head’s up, sirens sounded before I could get her goddamned bedroom door open.”\u003c/p\u003e\n\u003cp\u003eWell, that explained that which, for me, was somewhat of a relief. At least that meant there wasn’t another unknown person out there after me for nefarious reasons.\u003c/p\u003e\n\u003cp\u003eHawk, nor Lawson, it was clear to see, felt relief.\u003c/p\u003e\n\u003cp\u003e“What?” Hawk whispered.\u003c/p\u003e\n\u003cp\u003e“You heard me, man, with your knight in shining armor bullshit, you f**ked this every way you could f**k this,” Skull returned.\u003c/p\u003e\n\u003cp\u003e“Maybe, you let Hawk and me in on this shit, it wouldn’t be f**ked,” Lawson suggested angrily.\u003c/p\u003e\n\u003cp\u003eSkull leaned back and his eyebrows shot up. “Yeah, I woulda kept my cover havin’ sit downs with The Rock and John McClane.” He leaned back in. “Did you miss me tellin’ you how far beyond the call of duty I had to go to keep my cover, bangin’ that filthy, foul-mouthed, drug-addled piece of ass?”\u003c/p\u003e\n\u003cp\u003eSarcasm and it was clear neither Hawk nor Lawson appreciated sarcasm much.\u003c/p\u003e\n\u003cp\u003e“Roarke would uncover a wire and a tag in a split second,” Lee Nightingale entered the conversation, throwing down on Hawk’s (and my) side.\u003c/p\u003e\n\u003cp\u003e“My man was primed,” Skull retorted.\u003c/p\u003e\n\u003cp\u003e“He’d out Ginger and he wouldn’t do it with a threat on Gwen, he’d do it with a blade slicing through her skin,” Luke Stark put in and he appeared to be unhappy too.\u003c/p\u003e\n\u003cp\u003e“I’ll repeat,” Skull clipped, “my man was primed.”\u003c/p\u003e\n\u003cp\u003e“You took a big chance without the primary player knowin’ you were usin’ her for this shit,” Eddie Chavez growled as he pointed at me.\u003c/p\u003e\n\u003cp\u003e“I think you know more than anyone, Chavez, that the streets of Denver have been flooded with product. You boys on the Force were so far over your heads keepin’ on top of that shit, you petitioned the Pope to declare a miracle when Kane Allen backed out of the safety business,” Skull returned, Eddie’s face got tight and a muscle clenched in his cheek. “And Gwendolyn Kidd was the second part of that miracle.”\u003c/p\u003e\n\u003cp\u003eOkay, firstly, if I was given a chance to decide if I wanted the opportunity to participate, I wouldn’t have wanted any part of that miracle not only because I was a scaredy cat but also because I felt that perhaps someone trained should have that job and secondly, I didn’t know if it was annoying or comforting to know all this shit tied together.\u003c/p\u003e\n\u003cp\u003e“We don’t play it that way in Denver,” Hank Nightingale clipped.\u003c/p\u003e\n\u003cp\u003e“Yeah, and that’s why you got so much product flooding your streets,” Skull clipped back and Hawk moved. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-78.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
