{"id":78692,"no":82,"title":"Page 82","content":"\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe jerked his chin, I turned my head and I saw Tack beside us, his head turned our way and even in the dark I knew his eyes were on me.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eI wanted to stay on Dog’s bike but I didn’t want the drama. No, I couldn’t handle the drama. I’d had enough drama for one day, thank you so very much. In fact, I’d had enough drama in the last week to last me a freaking lifetime.\u003c/p\u003e\n\u003cp\u003eSo I swung off, moved between bikes, hitched my purse more firmly on my shoulder and swung on Tack’s.\u003c/p\u003e\n\u003cp\u003eThe minute my arms closed around his middle and my cheek hit his shoulder blade, we shot off.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Six\u003c/p\u003e\n\u003cp\u003eNot Worth the Risk\u003c/p\u003e\n\u003cp\u003eI felt weight hit the bed, my eyes opened and slid up.\u003c/p\u003e\n\u003cp\u003eTack was sitting there, wearing a skintight tee and faded jeans. His hair was wet from a shower. His blue eyes were on me.\u003c/p\u003e\n\u003cp\u003eI was lying in his bed, not at the Chaos Compound, in a rather nice house in the foothills outside Denver. It was built just up the mountain. It was one story, long and had a deck that ran the front of the house. I knew it would have great views in the daylight but I didn’t take much in when we got there mainly because I was numb, exhausted and desperately fighting back hysterical tears, a tantrum and the desire to commit murder.\u003c/p\u003e\n\u003cp\u003eTack led me to his bedroom, dumped my purse on his nightstand and ordered, “Sleep, darlin’.”\u003c/p\u003e\n\u003cp\u003eThen he left.\u003c/p\u003e\n\u003cp\u003eI took off my boots, socks, jeans and since I conveniently was wearing my nightshirt, I climbed into his unmade bed and did exactly as I was told.\u003c/p\u003e\n\u003cp\u003eNow it was now and I was curled into a protective ball, my hands in prayer position under my cheek.\u003c/p\u003e\n\u003cp\u003eTack spoke. “Mornin’, peaches, you want breakfast?”\u003c/p\u003e\n\u003cp\u003e“Do you cook or do you have a biker babe that makes breakfast to order?” I replied and there it was. Automatic. The smartass.\u003c/p\u003e\n\u003cp\u003eWould I ever learn?\u003c/p\u003e\n\u003cp\u003eTack grinned. “I cook. Best pancakes you’ll ever have, you get your ass outta bed,” he answered.\u003c/p\u003e\n\u003cp\u003eFor the first time in my life, I wasn’t hungry.\u003c/p\u003e\n\u003cp\u003eNo, that wasn’t true. After I found my husband in bed with my sister and kicked his ass out, I didn’t eat for three days. I didn’t realize it, Troy did and he made me eat. But that was the last time I lost my appetite.\u003c/p\u003e\n\u003cp\u003e“Sounds good,” I lied but didn’t move.\u003c/p\u003e\n\u003cp\u003eWhen I didn’t Tack reached out, curled his fingers around my forearm and gently pulled my hand from under my face. Then he lifted my arm and his eyes dropped to my wrist. His hand slid up carefully so he could wrap his fingers around my palm and I watched as he lifted my arm further up… up… until he bent his neck and his lips touched the bruised and torn skin at my wrist.\u003c/p\u003e\n\u003cp\u003eMy breath seized.\u003c/p\u003e\n\u003cp\u003eHawk should have done that but Hawk was so busy brooding about Brett, or more likely trying to figure out how to end things with me since he conquered the challenge and was ready to move on, that last night he completely forgot I was kidnapped, bound, gagged and targeted as bait.\u003c/p\u003e\n\u003cp\u003eTack’s head lifted, his body leaned in and he pressed my hand to his chest.\u003c/p\u003e\n\u003cp\u003e“My girl had a bad day yesterday,” he said quietly.\u003c/p\u003e\n\u003cp\u003eHawk should have said that too.\u003c/p\u003e\n\u003cp\u003e“There’s bad and there’s bad and I’m discovering the many nuances but, yes… yesterday introduced me to a new level of bad.”\u003c/p\u003e\n\u003cp\u003e“Then you need pancakes.”\u003c/p\u003e\n\u003cp\u003eFinally, a man who understood the healing properties of food.\u003c/p\u003e\n\u003cp\u003e“Pancakes would be good,” I replied.\u003c/p\u003e\n\u003cp\u003eHis hand squeezed mine. “Ass outta bed, babe, I’ll be in the kitchen.”\u003c/p\u003e\n\u003cp\u003eThen he lifted my hand, touched his lips to my knuckles, released it, got up off the bed and sauntered out of the room.\u003c/p\u003e\n\u003cp\u003eI took my time, got out of bed, dug through my bag, found my toothbrush and face wash, went into the bathroom off his bedroom and did my business. Then I didn’t bother dressing, my nightshirt covered me more than most dresses I owned. I walked out of the room and since the house was built into the hill and all the rooms were to one side the hallway was filled with windows and I saw the view.\u003c/p\u003e\n\u003cp\u003eThe good news was there was a sheer drop off beyond the deck therefore difficult to execute a successful drive-by. The other good news was the view was unbelievable. And for the first time in over a week, there was no bad news.\u003c/p\u003e\n\u003cp\u003eI walked down the hall looking into rooms to my left. A bath and two other bedrooms, one that had a bed and dresser, one that was a messy office. Then I entered the open space. An open kitchen with bar delineating it from internal walkway opposite sliding glass doors to the deck and the kitchen fed into a massive living room that jutted out a bit at the front of the house.\u003c/p\u003e\n\u003cp\u003eTack was in the kitchen at the stove.\u003c/p\u003e\n\u003cp\u003eI moved to stand by him, not too close, and once there I leaned against the counter. I looked down and there were six, perfect, silver dollar pancakes cooking on a griddle.\u003c/p\u003e\n\u003cp\u003eHis head turned to me.\u003c/p\u003e\n\u003cp\u003e“Looks like you’re good at that,” I remarked.\u003c/p\u003e\n\u003cp\u003eHe didn’t respond to my remark. Instead he asked, “Do you need coffee?”\u003c/p\u003e\n\u003cp\u003e“Am I Gwendolyn Kidd, am I breathing and is it morning?” I answered.\u003c/p\u003e\n\u003cp\u003eShit! There it was again. The smartass.\u003c/p\u003e\n\u003cp\u003eTack grinned. Then he jerked his head to the counter behind me.\u003c/p\u003e\n\u003cp\u003e“Make yourself at home, peaches,” he invited.\u003c/p\u003e\n\u003cp\u003eOh boy.\u003c/p\u003e\n\u003cp\u003e“Do you need a refresh?” I asked.\u003c/p\u003e\n\u003cp\u003e“I’m good, babe,” he answered.\u003c/p\u003e\n\u003cp\u003eI moved to find mugs while speaking. “You want to tell me what that was about last night?”\u003c/p\u003e\n\u003cp\u003e“Seems we got the same thing on our mind.”\u003c/p\u003e\n\u003cp\u003eI had my hand wrapped around a mug and I turned my head to look at him as I closed the cupboard door. “What?”\u003c/p\u003e\n\u003cp\u003e“Babe, you came racin’ outta Hawk’s like the f**kin’ place was haunted and jumped on Dog’s bike.”\u003c/p\u003e\n\u003cp\u003e“Um…” I answered, dropped my head, grabbed the handle of the coffeepot and started pouring. “Why don’t you answer my question first?”\u003c/p\u003e\n\u003cp\u003eHe didn’t hesitate. “I was there ‘cause I wanted an explanation of why you got kidnapped and not an hour later put up for bid. Hawk and I made a deal and the deal was he’s supposed to have your back so that shit doesn’t happen and it did. He fell down on the job.”\u003c/p\u003e\n\u003cp\u003eI looked at Tack. “His man got shot three times, protecting me,” I said softly.\u003c/p\u003e\n\u003cp\u003eTack’s eyes locked to mine. “Like I said, fallin’ down on the job.” \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-82.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
