{"id":78698,"no":88,"title":"Page 88","content":"\u003cp\u003eBut this wasn’t going to happen to me again. Not again. He wasn’t going to think he could start this up again. Taking what he wanted and holding everything back.\u003c/p\u003e\n\u003cp\u003eNo way. No f**king way.\u003c/p\u003e\n\u003cp\u003eSo I fought him. I fought his mouth and his hands and his body.\u003c/p\u003e\n\u003cp\u003eHe was too strong and he knew what he was doing. But he also knew he was a lot stronger than me so the one advantage I had was that he didn’t want to hurt me.\u003c/p\u003e\n\u003cp\u003eI didn’t share the same desire.\u003c/p\u003e\n\u003cp\u003eSo I didn’t fight fair. I was vicious and I was determined and I used everything I had.\u003c/p\u003e\n\u003cp\u003eUnfortunately, when I was biting him, I tasted him and smelled him. Then, also unfortunately, somewhere along the way he quit trying to contain me and started doing other things to me. Therefore, somewhere along the way, I lost my nightshirt. Then I lost my determination. Then my fighting became something just as strong and overpowering and that something was hunger.\u003c/p\u003e\n\u003cp\u003eI had him on his back and I didn’t jump away. Oh no, not me. Not stupid, stupid me.\u003c/p\u003e\n\u003cp\u003eI used my hands, lips and tongue to touch him, taste him, his chest, his ni**les, down, his abs, down, I wrapped my hand around his hard c**k and circled the tip with my tongue.\u003c/p\u003e\n\u003cp\u003eMm.\u003c/p\u003e\n\u003cp\u003eThen I was in the air a brief second before I was on my back, my panties were gone a second later and my knees were lifted high with Hawk’s hands at the back of them, then they were spread wide. Then his mouth was on me. He wasn’t feeling insatiable. He was feeling in the mood to savor. So he did. He savored me and I not only let him, I slid my fingers over his hair and held him to me, it felt that good.\u003c/p\u003e\n\u003cp\u003eHe took me close, God, so close, unbelievable and I was about to come, whimpering and whispering, “Baby,” when his mouth went away, he turned me to my belly, spread my legs again, positioned between them and yanked up my h*ps so we were both on our knees.\u003c/p\u003e\n\u003cp\u003eThen he was inside me, pounding deep. Beautiful.\u003c/p\u003e\n\u003cp\u003eI arched my chest into the bed and stretched my arms out in front of me, palms into the headboard as I reared back to meet his thrusts. God, I loved this. Fucking loved it.\u003c/p\u003e\n\u003cp\u003e“Touch yourself, baby,” Hawk ordered, his voice thick and one of my hand moved from the headboard and slid between my legs. “That’s it,” he growled, “help me out.”\u003c/p\u003e\n\u003cp\u003eI helped him out, whirling as he thrust, my moans drowned by the pillow, it didn’t take long before I came and I did it hard.\u003c/p\u003e\n\u003cp\u003eIt took Hawk longer, his grip tight on my hips, he pounded in as he pulled me back and, even coming down, I loved the feel of him.\u003c/p\u003e\n\u003cp\u003eThen he groaned as his thrusts magnified, driving deep, he kept taking me as he cl**axed.\u003c/p\u003e\n\u003cp\u003eThen the power of his movements gentled but he kept moving inside me, gliding in and out slowly, an intimate caress, the most intimate there was. His fingers stopped gripping my h*ps and slid soft against the skin of my ass, my lower back, hips, down the sides and back of my thighs and it felt nice. Sweet and nice.\u003c/p\u003e\n\u003cp\u003eI closed my eyes, my face still in the pillow.\u003c/p\u003e\n\u003cp\u003eI was such… a… slut.\u003c/p\u003e\n\u003cp\u003eHow humiliating was this? There was no degree. It was off the charts. They had to make new charts to measure this kind of humiliation.\u003c/p\u003e\n\u003cp\u003eFinally he slid out and started to drop to his side at the same time I felt his hand curl around my waist to take me with him but, quick as I could, I slid away. Jumping off the bed, I bent, snatched my nightshirt off the floor and I pulled it on while I raced from the room.\u003c/p\u003e\n\u003cp\u003eI went to the bathroom and locked the door. Then I turned on the light and stood there shaking.\u003c/p\u003e\n\u003cp\u003eWhat was wrong with me?\u003c/p\u003e\n\u003cp\u003eThe tears threatened but I beat them back by deep breathing. Then I snatched a washcloth out of my bathroom closet, turned on the faucet until the water was hot and then I cleaned him from me.\u003c/p\u003e\n\u003cp\u003eHe would leave. He would leave. He always left.\u003c/p\u003e\n\u003cp\u003eThen I needed to move. Not houses, to a different state. I could work anywhere. I was free to go. It would suck, leaving everyone behind but I was up for the adventure. Dad had taken us to Boston when I was a kid, we toured the Constitution. We went to Lexington Green. We ate clam chowder and I loved it. We had lobster and that was still my most favorite thing. I was into history. I was into lobster. I could do Boston.\u003c/p\u003e\n\u003cp\u003eI sat on the toilet, thinking of Boston and I listening but I wouldn’t hear him leave. But he’d leave. He’d go. I knew it.\u003c/p\u003e\n\u003cp\u003eI waited and listened to silence.\u003c/p\u003e\n\u003cp\u003eThen I sucked in breath and went to the door. I had my hand on the light switch when I opened it but I stopped dead because Hawk was in the hall. He was wearing nothing but his cargoes, his ass was to the wall, his legs slightly out in front of him, his head bent, he was contemplating his feet.\u003c/p\u003e\n\u003cp\u003eShit. He didn’t go.\u003c/p\u003e\n\u003cp\u003eHe kept his head bent but twisted his neck and his eyes came to me.\u003c/p\u003e\n\u003cp\u003e“You need to go,” I announced, flipping off the switch and entering the hall.\u003c/p\u003e\n\u003cp\u003eThen I found my back to the wall and I was pinned there with Hawk’s body. One of his hands was at my neck, thumb in my jaw to force me to look up at him, the other one was at my hip. Mine went to his waist and I pushed, to no avail.\u003c/p\u003e\n\u003cp\u003e“You need to go,” I repeated.\u003c/p\u003e\n\u003cp\u003e“I was in the middle of an operation, an important one, they needed me. So when my wife and daughter died, they couldn’t tell me, they needed me focused. They were dead two days before I knew I’d lost them.”\u003c/p\u003e\n\u003cp\u003eOh God.\u003c/p\u003e\n\u003cp\u003e“I don’t want to hear this,” I told him. “I have no interest in this,” I went on but I said this in an effort not to convince him but to convince myself.\u003c/p\u003e\n\u003cp\u003eHawk ignored me. “I was thousands of miles away. Thousands of miles away when I lost my family, Gwen.”\u003c/p\u003e\n\u003cp\u003e“You need to go,” I said again with another push of my hands.\u003c/p\u003e\n\u003cp\u003e“I loved her,” he announced and I stopped pushing.\u003c/p\u003e\n\u003cp\u003e“Hawk, really, I don’t –”\u003c/p\u003e\n\u003cp\u003e“But I was f**kin’ pissed at her. Jesus Christ, so f**kin’ pissed. How f**kin’ stupid could she be? Not only goin’ there herself but taking our daughter?”\u003c/p\u003e\n\u003cp\u003eI closed my eyes and turned my head away.\u003c/p\u003e\n\u003cp\u003e“You should talk to someone about this,” I said, looked back at him and suggested, “Elvira. She’s a good listener.”\u003c/p\u003e\n\u003cp\u003eHe ignored me again. “I was at base when Lucas, Darla and their crew entered your house. I was in the surveillance room and one of my boys whistled to me and I looked at the screens. I called the order to mobilize on your house, got my shit sorted and started to go myself but before I reached the door, I saw Lucas carrying you out over his shoulder. You weren’t moving.” \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-88.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
