{"id":78699,"no":89,"title":"Page 89","content":"\u003cp\u003e“Lucas?”\u003c/p\u003e\n\u003cp\u003e“Brock Lucas, you know him as Skull.”\u003c/p\u003e\n\u003cp\u003e“Oh,” I whispered.\u003c/p\u003e\n\u003cp\u003e“You weren’t movin’, Gwen.”\u003c/p\u003e\n\u003cp\u003e“They’d stun gunned me,” I told him.\u003c/p\u003e\n\u003cp\u003e“I didn’t know that,” he told me. “All I knew was that 911 had received a call from one of your neighbors, shots fired at your house and you were carried out not moving. That’s all I knew.”\u003c/p\u003e\n\u003cp\u003e“They’d stun gunned me, Hawk,” I repeated.\u003c/p\u003e\n\u003cp\u003e“I didn’t know that, Gwen,” he repeated back and continued. “I was in the car when the call came in that Brett was down, three to the chest. I knew the players. I could see the play. They took your body as proof of death, the beginning, you first, then your stepmom or your Dad. They’d go through all of you and Ginger would need to step up to stop that happening.”\u003c/p\u003e\n\u003cp\u003e“It didn’t happen that way,” I informed him of what he already knew.\u003c/p\u003e\n\u003cp\u003e“Yeah, but for two hours, I didn’t know the state of you. Lee got a lock on your location, we went in and I had no idea what I’d face when I walked into that room.”\u003c/p\u003e\n\u003cp\u003e“I was fine,” I lied.\u003c/p\u003e\n\u003cp\u003e“You were bound and gagged, Gwen.”\u003c/p\u003e\n\u003cp\u003e“Yes,” I returned, “but otherwise fine.”\u003c/p\u003e\n\u003cp\u003eHe kept going. “Days earlier you were caught in a drive-by. Your car at the curb, your purse on the couch and you were gone. For f**kin’ hours, babe. The only thing I had to hold onto, seein’ as another woman of mine had been caught in a drive-by, was that no blood was at the scene and my boys saw Tack drag you out. Camera angles weren’t good so we couldn’t see for sure you’d not been hit but at least you were standing.”\u003c/p\u003e\n\u003cp\u003eShit, that hadn’t occurred to me. Why hadn’t that occurred to me?\u003c/p\u003e\n\u003cp\u003e“I was fine then too,” I reminded him.\u003c/p\u003e\n\u003cp\u003eHe pressed in deeper. “Yeah, Gwen, but I… didn’t… know that.”\u003c/p\u003e\n\u003cp\u003eAll right. I had to give him that.\u003c/p\u003e\n\u003cp\u003eStill.\u003c/p\u003e\n\u003cp\u003e“You’re telling me all this because…?” I prompted.\u003c/p\u003e\n\u003cp\u003eHis hand left my hip and went to cup the other side of my jaw as he said, “Jesus, Gwen, I’m tellin’ you this so you’ll know where my head was at.”\u003c/p\u003e\n\u003cp\u003e“Okay, now I know. Thanks for story time, Hawk, now are you going to go?”\u003c/p\u003e\n\u003cp\u003eHis hands tightened and he whispered, “Don’t do that, babe.”\u003c/p\u003e\n\u003cp\u003e“Do what? Be an unfeeling bitch in the face of your pain? Sorry, is that not okay? Because, see, the day I was kidnapped and a man was shot protecting me, after a week of dealing with a bunch of really bad shit at the same time you came at me and got me to trust you, you ripped me to shreds Hawk. Firm and unwavering. You tore right through me, leaving me in tatters and you didn’t even f**king blink.”\u003c/p\u003e\n\u003cp\u003e“And now you know where my head was at and why I did that shit.”\u003c/p\u003e\n\u003cp\u003e“No, now I know that you saw Tack playing with your f**k toy and you don’t feel like sharing.”\u003c/p\u003e\n\u003cp\u003eHis body froze and his fingers flexed. I could feel his fury but I didn’t care. I wasn’t done. The hurt he inflicted went too deep and I had to protect myself at all costs.\u003c/p\u003e\n\u003cp\u003e“That’s okay, baby,” I whispered. “There’s plenty of me to go around. But, rules are, you come, you make me come and then you go.”\u003c/p\u003e\n\u003cp\u003eHe didn’t move and I felt his anger beating against me as he held me pinned against the wall. Then suddenly his body relaxed, the anger vanished and his thumbs swept my jaws.\u003c/p\u003e\n\u003cp\u003e“I cut you,” he murmured.\u003c/p\u003e\n\u003cp\u003e“Nothing a little cookie dough can’t cure,” I returned.\u003c/p\u003e\n\u003cp\u003e“Bullshit, Sweet Pea.”\u003c/p\u003e\n\u003cp\u003eIt was then my body went still.\u003c/p\u003e\n\u003cp\u003e“Don’t call me that,” I snapped.\u003c/p\u003e\n\u003cp\u003eHe ignored me again. “We were us for a week, a f**kin’ week, and I cut you deep.”\u003c/p\u003e\n\u003cp\u003e“God!” I exclaimed pushing against his waist again. “Are you ever going to go?”\u003c/p\u003e\n\u003cp\u003eHe surprised me by moving back. Then he surprised me again by bending and putting a shoulder in my belly and then I was lifted up.\u003c/p\u003e\n\u003cp\u003e“Hawk!” I cried, pushing against his h*ps and kicking with my feet as he walked me into my room. “Put me down!” I demanded.\u003c/p\u003e\n\u003cp\u003eHe did. He bent, bumped his shoulder, I flew through the air and landed on my back with a bounce on my bed.\u003c/p\u003e\n\u003cp\u003eI got up on my elbows and opened my mouth to speak or more accurately yell but I saw in the shadows that his hands looked to be at his cargoes.\u003c/p\u003e\n\u003cp\u003eShit!\u003c/p\u003e\n\u003cp\u003eI turned to escape and nearly got to the other side of the bed when I was caught with an arm at the waist and hauled back.\u003c/p\u003e\n\u003cp\u003e“You’re not welcome to spend the night here,” I informed the room because my back was to him.\u003c/p\u003e\n\u003cp\u003eHe let me go just long enough to flip the covers over us but not long enough for me to make good an escape. Then he curled into me, deeper than normal, pinning me to the bed with his torso, his leg hitched in mine, keeping me secured to him with his arm tight around my belly.\u003c/p\u003e\n\u003cp\u003eThen he lifted his head and his mouth was at my ear. “Go to sleep, Gwen,” he ordered.\u003c/p\u003e\n\u003cp\u003eOh my God!\u003c/p\u003e\n\u003cp\u003e“Are you high?” I screeched.\u003c/p\u003e\n\u003cp\u003eHis response to my query was to touch his tongue to the skin at the back of my ear then he settled into the pillows and further into me.\u003c/p\u003e\n\u003cp\u003eHe was. He was high. Totally.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you,” I hissed.\u003c/p\u003e\n\u003cp\u003e“Go to sleep, babe.”\u003c/p\u003e\n\u003cp\u003eI strained against his arm but it got super tight so I gave up and repeated, “I… cannot… believe you.”\u003c/p\u003e\n\u003cp\u003e“Baby, go to sleep.”\u003c/p\u003e\n\u003cp\u003eI stilled at his use of the word baby because I had to. The slightest movement I knew would shatter me.\u003c/p\u003e\n\u003cp\u003eWhen I fought back the pain, I announced, “I’m moving to Boston.”\u003c/p\u003e\n\u003cp\u003eHe chuckled, deep and manly, and I felt his face in my hair at the back of my head where he said, “Babe.”\u003c/p\u003e\n\u003cp\u003eGod!\u003c/p\u003e\n\u003cp\u003eI tried again. “You can’t stay here, Hawk.”\u003c/p\u003e\n\u003cp\u003eHis arm gave me a squeeze, his head lifted and his mouth came back to my ear. “You’re livin’ in Badass World, baby,” he whispered in my ear. “Fair warning, until I fix what I cut in you, you’re there to stay.”\u003c/p\u003e\n\u003cp\u003eOh.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Nine\u003c/p\u003e\n\u003cp\u003eI Was Wrong\u003c/p\u003e\n\u003cp\u003eI woke pre-dawn, I could see a bit of light in the sky and I could feel Hawk’s heat at my back.\u003c/p\u003e\n\u003cp\u003eDamn.\u003c/p\u003e\n\u003cp\u003eI scooted out from under him, carefully but quickly, successfully made it off the bed and I grabbed my undies and rushed to the bathroom. I put them on, used the facilities and then walked out, going to my thermostat. It was on a timer and went down way low at night. It wouldn’t kick in for awhile. I turned it up and went to my office. I arranged the toss pillows on the armrest on the couch, lay down and then pulled my chenille throw over me. It would take awhile for the house to heat up. The chenille was snuggly soft and nice to cuddle under while watching TV but it wasn’t exactly ultra warm. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-89.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
