{"id":78704,"no":94,"title":"Page 94","content":"\u003cp\u003e“Four orgasms in thirty minutes?” Elvira breathed.\u003c/p\u003e\n\u003cp\u003e“Four orgasms in thirty minutes,” I confirmed\u003c/p\u003e\n\u003cp\u003eElvira put her hand flat on the table and her upper body started teetering as she mumbled, “Lordy.”\u003c/p\u003e\n\u003cp\u003e“Maybe we should get the smelling salts,” Tracy noted, her eyes on Elvira.\u003c/p\u003e\n\u003cp\u003e“Babe, I don’t have smelling salts,” Cam returned.\u003c/p\u003e\n\u003cp\u003e“I need to quit,” Elvira announced. “I gotta turn in my resignation. I can’t work with a man knowin’ his capacity to give pleasure. I mean, I can work with a man guessin’ his capacity to give pleasure but not knowin’ it. This is it. I hit the threshold. I never understood TMI. In my opinion, no amount of information is too much information but I’ve found it. I’m here.”\u003c/p\u003e\n\u003cp\u003e“You can’t quit because of me!” I hissed. “I get the sense that Hawk likes you and depends on you. If you have someone like that, you don’t want to lose them. He can’t lose you because I told you he can give multiple orgasms!”\u003c/p\u003e\n\u003cp\u003e“Those four orgasms were a multiple?” Elvira asked.\u003c/p\u003e\n\u003cp\u003e“No, those were mostly separate. He can only pull off three in a one-go multiple,” I answered.\u003c/p\u003e\n\u003cp\u003e“Holy crap,” Tracy breathed.\u003c/p\u003e\n\u003cp\u003e“No joke?” Cam asked.\u003c/p\u003e\n\u003cp\u003eElvira teetered so I put my hand on her so she wouldn’t go down and looked at Cam. “Why do you think I let him keep coming at night? I told you he was good but he’s not good, he’s good.”\u003c/p\u003e\n\u003cp\u003e“Stop talkin’,” Elvira whispered. “Where’s the martini shaker? I need a reload.”\u003c/p\u003e\n\u003cp\u003eCam got up and sauntered to the counter.\u003c/p\u003e\n\u003cp\u003eThen it hit me. “My God, if he doesn’t forgive me, I’m ruined for all other men.”\u003c/p\u003e\n\u003cp\u003e“Gwennie, honey, really, don’t stress. It hasn’t even been a day,” Tracy soothed.\u003c/p\u003e\n\u003cp\u003eCam started pouring vodka into the shaker and decreed, “All right, this is serious for you and obviously he had reasons to be a motherfucking ass**le meaning he actually never was one. So, you called, left a voicemail, said you were sorry. You wait. He doesn’t call you back by one-thirty tomorrow, you call again. Voicemails can get missed. He’s there, you explain and apologize again. He’s not there, you leave another voicemail. He doesn’t call back, say, for two days, you know where he’s at, you make a batch of cookie dough, you call us and we’ll all come over and eat it.”\u003c/p\u003e\n\u003cp\u003eThank God. A plan.\u003c/p\u003e\n\u003cp\u003eThat was all I needed.\u003c/p\u003e\n\u003cp\u003eI took in a breath, checked Elvira to make sure she was steady, let her go and looked at Cam.\u003c/p\u003e\n\u003cp\u003e“Thanks, babe.”\u003c/p\u003e\n\u003cp\u003eCamille nodded her head and poured in cranberry juice.\u003c/p\u003e\n\u003cp\u003e“He’ll call,” Tracy whispered and my eyes moved to her. She smiled her hopeful smile.\u003c/p\u003e\n\u003cp\u003eI smiled back but mine felt shaky.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-One\u003c/p\u003e\n\u003cp\u003eShe’s My Sister\u003c/p\u003e\n\u003cp\u003eI lay on my side, my knees curled up to my chest in Cam and Leo’s guest bedroom and I flipped opened the phone, went to contacts, scrolled down and hit go.\u003c/p\u003e\n\u003cp\u003eI immediately got Hawk’s, “Talk.”\u003c/p\u003e\n\u003cp\u003e“Hi,” I whispered. “I don’t know if you got my other voicemail but I wanted you to know, I drove over to Cam and Leo’s tonight and had enough to drink, it wasn’t safe to drive home so I’m spending the night.” I paused. “I just… wanted you to know where I am.” I paused again then kept whispering. “I hope, even after what happened this morning, that you managed to have a good day, baby.”\u003c/p\u003e\n\u003cp\u003eThen I flipped the phone shut and stared at it.\u003c/p\u003e\n\u003cp\u003eGod, I was such an idiot.\u003c/p\u003e\n\u003cp\u003eI tapped the phone on my forehead and then put it on the nightstand.\u003c/p\u003e\n\u003cp\u003eIt was nearly midnight. Over ten hours since I called.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eI tucked my hands under my cheek and closed my eyes tight thinking maybe I should have texted.\u003c/p\u003e\n\u003cp\u003eThen I heard a scratching at the window.\u003c/p\u003e\n\u003cp\u003eMy eyes flew open and I shot up to an elbow in the bed. I stared out the opened curtains and my heart squeezed.\u003c/p\u003e\n\u003cp\u003eGinger was standing there, partially illuminated by streetlights and the entire left side of her face was swollen, bruised, bleeding and mangled.\u003c/p\u003e\n\u003cp\u003e“Gwennie,” I heard her pained whisper.\u003c/p\u003e\n\u003cp\u003eI didn’t think. I threw the bedclothes back and raced from the room, the panels of Cam’s long, sexy, satin nightgown that would make Meredith’s mouth water and had slits up each side practically to my h*ps tangling with my legs. I went straight to the front door, unlocked it, threw it open and dashed out, running and frantic. I made it to the edge of the house, turned and collided headlong with something big, hard and solid.\u003c/p\u003e\n\u003cp\u003eI looked up into Hawk’s face.\u003c/p\u003e\n\u003cp\u003e“Gwen,” he said, “get back in the house.”\u003c/p\u003e\n\u003cp\u003e“Ginger,” I whispered worriedly, rounded him, started to fly and stopped dead.\u003c/p\u003e\n\u003cp\u003eGinger was down on her ass, back to the house under the guest bedroom window. Her knees up, her head bowed.\u003c/p\u003e\n\u003cp\u003eI ran to her, yanked up the panel to my nightgown and dropped to my knees beside her.\u003c/p\u003e\n\u003cp\u003e“Honey, look at me,” I whispered but she didn’t raise her head and she was breathing funny. “Ginger, honey, please,” I begged, reaching out to take her chin gently and lift her face to me.\u003c/p\u003e\n\u003cp\u003eI saw it and sucked in breath. It was worse close up. A lot worse.\u003c/p\u003e\n\u003cp\u003eHawk crouched low at her other side, took her chin from my hand into his own and carefully pulled her head his way. He had his phone at his other ear and he spoke as he scanned my sister’s face.\u003c/p\u003e\n\u003cp\u003e“I need a pick up at Freeman’s for Gwen and guards to stay with her at the warehouse until I get there. We were right, Ginger was going to her and she’s here. Call Doc, he needs to head out, she’s a f**kin’ mess. Safe house. Then call Lawson, he’s up.” He stopped talking a moment then said, “Out.”\u003c/p\u003e\n\u003cp\u003eHe flipped his phone shut and shoved it into his cargoes.\u003c/p\u003e\n\u003cp\u003e“You havin’ trouble breathin’?” he asked Ginger.\u003c/p\u003e\n\u003cp\u003e“Ribs,” Ginger replied.\u003c/p\u003e\n\u003cp\u003e“Fuck,” Hawk muttered. “Can you handle me carrying you into the house?”\u003c/p\u003e\n\u003cp\u003eGinger ignored him. “No cops.”\u003c/p\u003e\n\u003cp\u003e“Your plays aren’t workin’, Ginger, you’re gonna try mine.”\u003c/p\u003e\n\u003cp\u003e“No cops,” she repeated and I reached out and grabbed her hand, holding on tight.\u003c/p\u003e\n\u003cp\u003e“You love your sister?” Hawk asked suddenly and Ginger pulled her chin away from his hand, then she whimpered. “I asked you a question,” he pushed. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-94.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
