{"id":78705,"no":95,"title":"Page 95","content":"\u003cp\u003e“She’s my sister,” Ginger answered and the tears hit my eyes, no warning this time, they just hit them and spilled over.\u003c/p\u003e\n\u003cp\u003eAnd they did this because this meant yes.\u003c/p\u003e\n\u003cp\u003eI moved closer and held her hand harder.\u003c/p\u003e\n\u003cp\u003e“Then trust me to do right by you,” Hawk replied, knowing what she meant.\u003c/p\u003e\n\u003cp\u003e“You can’t fix this,” Ginger told him.\u003c/p\u003e\n\u003cp\u003e“I sure as f**k can try,” Hawk returned and looked at me. “Let her go, I need to get her up.”\u003c/p\u003e\n\u003cp\u003eI let her go and Hawk leaned in and lifted Ginger in his arms. This didn’t cause whimpers, it caused moans. I raced ahead of him, swiping at my face, opened the front door and left it open while I moved around the room turning on lights. Hawk came in and laid Ginger down on the couch while I moved down the hall. Leo was already out of his bedroom and I rushed to him.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry, she found me, Ginger’s here,” I told him quietly.\u003c/p\u003e\n\u003cp\u003e“Fuck,” he muttered and Cam came out, her eyes alert.\u003c/p\u003e\n\u003cp\u003e“Ginger’s here,” I told her.\u003c/p\u003e\n\u003cp\u003e“Fuck,” she muttered.\u003c/p\u003e\n\u003cp\u003eI raced away and Leo and Cam followed me. Ginger was on the couch, Hawk was nowhere.\u003c/p\u003e\n\u003cp\u003eThis alarmed me but I moved straight to Ginger and got down on my knees by the couch. I took her hand again and she turned her head away.\u003c/p\u003e\n\u003cp\u003e“We’ll get you sorted, honey, promise,” I whispered.\u003c/p\u003e\n\u003cp\u003e“Don’t call Mom and Dad, Gwen,” she told the back of the couch.\u003c/p\u003e\n\u003cp\u003e“Right now, I’m about you, Ginger.”\u003c/p\u003e\n\u003cp\u003eShe turned to face me. “Don’t call Mom and Dad.”\u003c/p\u003e\n\u003cp\u003e“I won’t,” I promised.\u003c/p\u003e\n\u003cp\u003e“Promise it and mean it and not like you meant it when I told you I snuck out and met Darren Petri and then you heard he had the clap so you told on me. Promise it and mean it.”\u003c/p\u003e\n\u003cp\u003eJeez. Darren Petri was ages ago.\u003c/p\u003e\n\u003cp\u003e“Ginger, you kept sleeping with him and he had the clap,” I reminded her.\u003c/p\u003e\n\u003cp\u003e“He was cute,” she reminded me.\u003c/p\u003e\n\u003cp\u003eShe was right. He was. Still, he had the freaking clap and she told me they didn’t use protection. What was I supposed to do?\u003c/p\u003e\n\u003cp\u003eSuddenly Hawk was crouched at my side. “Gwen, reunion later if you’re lucky. Go get your shit,” he ordered and then held a dishtowel with ice to Ginger’s swollen face.\u003c/p\u003e\n\u003cp\u003eI watched her eyes close when the towel gingerly hit her skin and I could tell that felt good.\u003c/p\u003e\n\u003cp\u003e“I’m staying with Ginger.”\u003c/p\u003e\n\u003cp\u003e“Go get your shit,” Hawk repeated and I looked at him.\u003c/p\u003e\n\u003cp\u003e“Baby, I need to stay with my sister,” I whispered.\u003c/p\u003e\n\u003cp\u003e“No, Gwen, you need to trust her to my care and go get your shit,” he stated and scarily went on. “My boys’ll be here in five to take you to my place and I’m takin’ care of her. I followed her here and others followed me. She needs to be gone so your friends’ll be safe and you need to be gone. Get me?”\u003c/p\u003e\n\u003cp\u003eOh shit. I got him.\u003c/p\u003e\n\u003cp\u003e“You’ll keep her safe?” I asked.\u003c/p\u003e\n\u003cp\u003eHawk just looked at me.\u003c/p\u003e\n\u003cp\u003eHe’d keep her safe.\u003c/p\u003e\n\u003cp\u003eI didn’t know where he and I were with our relationship but still, I lifted my hand, curled my fingers around his neck and leaned in to touch my mouth to his as my show of gratitude.\u003c/p\u003e\n\u003cp\u003e“Fuck me, I’m gonna be sick,” Ginger groaned and my mouth left Hawk’s, my hand went away from his neck and I twisted to Ginger.\u003c/p\u003e\n\u003cp\u003e“Do you need a bowl?” I asked, squeezing her hand which I still held.\u003c/p\u003e\n\u003cp\u003e“No, Gwen, f**k, at you.” Her one unswollen eye not covered in an iced up dishtowel slid to Hawk. “She’s always been gushy. It’s sick. Even somethin’ stupid, like watchin’ TV, she’d curl up to me. Fuck.”\u003c/p\u003e\n\u003cp\u003eHawk had no response.\u003c/p\u003e\n\u003cp\u003e“I thought you liked cuddling,” I stated.\u003c/p\u003e\n\u003cp\u003e“Yeah, when I was five,” Ginger replied, I sucked in breath and prepared to retort.\u003c/p\u003e\n\u003cp\u003e“Gwen,” Hawk spoke in a warning low voice and I looked at him.\u003c/p\u003e\n\u003cp\u003e“Right,” I whispered, turned back to Ginger and pulled her hand to my mouth. “Whatever happens next, honey, and whatever we left behind, I love you and I always have. You can believe me or not. I don’t care. I need to say it and tell you I mean it. It’s your choice whether you believe it.”\u003c/p\u003e\n\u003cp\u003eThen I kissed her knuckles, let her go and raced through Cam and Leo to the guest room.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Two\u003c/p\u003e\n\u003cp\u003eIs Everything All Right?\u003c/p\u003e\n\u003cp\u003eMy guards were Fang and a man named Suarez.\u003c/p\u003e\n\u003cp\u003eSuarez was a mini-commando in the sense that he was younger than the rest and not in the sense he was less scary than the rest. His body was such that they could use it in anatomy class to teach musculature, such was the definition.\u003c/p\u003e\n\u003cp\u003eWhen we made it to the warehouse, Fang took his position outside, Suarez took me inside then positioned himself at the door.\u003c/p\u003e\n\u003cp\u003eI asked if he wanted coffee. He said no.\u003c/p\u003e\n\u003cp\u003eThat was the extent of our conversation. This was because Suarez was clearly a conversationalist of the Fang variety but also because I didn’t have conversation in me.\u003c/p\u003e\n\u003cp\u003eThen I paced. After I paced for awhile I realized I was trembling. I wasn’t trembling because I was cold; I was trembling because I was scared. So I raced up the iron steps and went to Hawk’s wardrobe. I should have gotten dressed. But being in a Do As I’m Told mood, my clothes, jacket and shoes had hastily been stuffed in a plastic grocery bags so I could carry out Hawk’s orders and I was too wired to get dressed. I searched and found a navy blue flannel shirt of Hawk’s. Then I put it on. After I put it on, I stopped trembling.\u003c/p\u003e\n\u003cp\u003eThere you go. Hawk’s superhero superpowers extended to his clothes.\u003c/p\u003e\n\u003cp\u003eGood to know.\u003c/p\u003e\n\u003cp\u003eThen I walked back down the stairs and started pacing again.\u003c/p\u003e\n\u003cp\u003eAfter I did this for a good long while, Suarez spoke.\u003c/p\u003e\n\u003cp\u003e“Maybe you should try to sleep,” he suggested.\u003c/p\u003e\n\u003cp\u003eYeah, like that would happen.\u003c/p\u003e\n\u003cp\u003e“I’m not thinking that’s a possibility,” I informed him then asked, “Can I watch TV?”\u003c/p\u003e\n\u003cp\u003e“Rather be able to hear,” he answered.\u003c/p\u003e\n\u003cp\u003eRight. It was probably better that, if bad guys approached, he had advance warning.\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003eThen I paced some more.\u003c/p\u003e\n\u003cp\u003eTime slid by, adrenalin seeped out and exhaustion seeped in. So I lay down on Hawk’s couch, curled up and stared at the moonlight on the scrub opposite the small-river-maybe-large-creek and thought about breaking my promise to Ginger and calling my folks. Then I thought about Ginger’s face. Then I thought about how I’d never forget Ginger’s face. Then I hoped that I’d see it again when it wasn’t bleeding, mangled and swollen. \u003c/p\u003e","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-95.html","bookId":1850,"creation":"Oct 5, 2019 4:10:39 PM","modification":"Oct 5, 2019 4:10:39 PM"}
