{"id":66833,"no":14,"title":"Page 14","content":"\u003cp\u003eThat was just one of the many incentives for taking the job, but even if he didn’t make this move, he still needed to find the time to go home more often. He missed his family.\u003c/p\u003e\n\u003cp\u003eOver the weekend, the entire Buchanan clan had gathered at their parent’s sprawling island home on Nathan’s Bay to celebrate their father’s birthday. Nick and his wife, Laurant, had brought their baby girl to the island for the first time.\u003c/p\u003e\n\u003cp\u003eWhile he was there, Nick, along with the oldest brother, Theo, worked on Alec to accept the offer from the FBI. They tried to convince him that it was a family obligation. Theo was an attorney with the Justice Department, and Nick had been an agent for a special branch of the FBI for many years. Alec did love Boston, and Nick, now that he had a family and needed a bigger place, was offering him a great deal on his town house.\u003c/p\u003e\n\u003cp\u003eIt was time for a change, and Alec had a lot to think about. Being back home had been wonderful, even though he’d taken quite a beating playing football with all of his brothers. Ironically, the bruised shoulder that hurt the most had actually been inflicted by one of his younger sisters, Jordan. He smiled when he thought about her. Jordan was brilliant, no argument there, and had made them all a fortune when they invested in her design for a computer chip that revolutionized the industry, but as smart as she was, she had absolutely no common sense. She was also a klutz. She hadn’t meant to tackle him; she’d simply tripped over her own feet. Fortunately for her, his shoulder took the brunt of her fall, and he’d caught her before she broke any bones.\u003c/p\u003e\n\u003cp\u003eIt was raining when he drove away from O’Hare. Traffic was a bitch, but it still wasn’t as bad as Boston’s rush hour. He took shortcuts back to his apartment, unpacked, and put on his favorite pair of worn-out jeans. He was about to check his messages when his old partner, Gil Hutton, called. Gil had recently retired but still kept his fingers in the gossip pie. Alec swore Gil was clairvoyant. He knew things before they happened.\u003c/p\u003e\n\u003cp\u003eGil didn’t waste words on pleasantries. “I got the lowdown on Lewis.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” Alec laughed as he opened the refrigerator and took out a beer. He popped the tab, and took a long swallow. He could just picture Gil rubbing his head—a habit that used to drive Alec nuts—and gloating. The man loved to gloat when he had hot news.\u003c/p\u003e\n\u003cp\u003eAlec was feeling a little guilty because he hadn’t confided in his friend about leaving the department. He had good reason. Alec knew Gil wouldn’t be able to keep quiet about his interview with the FBI.\u003c/p\u003e\n\u003cp\u003e“Lewis was real pissed you fought him about firing that rookie. Know how he’s getting even?”\u003c/p\u003e\n\u003cp\u003eAlec was suddenly weary. He dropped down on the sofa and closed his eyes. God, how he hated politics. “How?”\u003c/p\u003e\n\u003cp\u003e“If you try to get a transfer out, he’s gonna block it.”\u003c/p\u003e\n\u003cp\u003e“I didn’t put in for a transfer.”\u003c/p\u003e\n\u003cp\u003e“Yeah? Why not? I just assumed …”\u003c/p\u003e\n\u003cp\u003eGil’s radar was up. It wouldn’t take him long to put two and two together and figure out that Alec was leaving.\u003c/p\u003e\n\u003cp\u003e“I haven’t had time to do the paperwork,” he said. That much was true, he thought. He hadn’t had time.\u003c/p\u003e\n\u003cp\u003e“Well, Lewis will block it. I just thought you should know.”\u003c/p\u003e\n\u003cp\u003eAlec didn’t ask him where he got his information, but he thought Gil must spend most of his day on the phone, gathering little tidbits.\u003c/p\u003e\n\u003cp\u003e“You need to get a life.”\u003c/p\u003e\n\u003cp\u003eHis ex-partner ignored the comment. “Lewis is a real prick.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Alec agreed. “And a game player.”\u003c/p\u003e\n\u003cp\u003eWorse, he thought, the lieutenant didn’t back up his men the way he should. He hung anyone in trouble out to dry, like the young policeman who really hadn’t done anything wrong except have the bad luck to be in the wrong place at the wrong time.\u003c/p\u003e\n\u003cp\u003e“He’s lost the respect of his detectives,” Gil remarked.\u003c/p\u003e\n\u003cp\u003e“He never earned our respect. So tell me. Did he block the kid’s transfer?”\u003c/p\u003e\n\u003cp\u003e“That kid is only four years younger than you are.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but he doesn’t have my experience or cynicism.”\u003c/p\u003e\n\u003cp\u003e“Lewis wasn’t able to block that one. Hey, you want to grab a beer down at Finnegan’s?”\u003c/p\u003e\n\u003cp\u003e“Not tonight.”\u003c/p\u003e\n\u003cp\u003e“Maybe tomorrow night then? I want to hear your theories about Detective Sweeney.”\u003c/p\u003e\n\u003cp\u003e“What about Sweeney?”\u003c/p\u003e\n\u003cp\u003e“You didn’t hear?”\u003c/p\u003e\n\u003cp\u003eAlec was losing patience. “Hear what?”\u003c/p\u003e\n\u003cp\u003e“Oh, man, I thought you knew, but of course you couldn’t have heard since you’ve been in Boston. Don’t you check your messages?”\u003c/p\u003e\n\u003cp\u003e“I was about to when you called. So tell me. What about him?”\u003c/p\u003e\n\u003cp\u003e“He was murdered last night.”\u003c/p\u003e\n\u003cp\u003eChapter Fifteen\u003c/p\u003e\n\u003cp\u003eREGAN HAD REALLY MADE A MESS OF HER KNEE. AS MUCH AS SHE wanted to, she knew she couldn’t put off the surgery any longer. She called the orthopedic surgeon’s office Monday morning, fully expecting that, because of his busy schedule, he wouldn’t be able to get to her for at least a month or two. That would give her sufficient time to get ready mentally and physically. As it turned out, he had a last-minute cancellation Tuesday morning. She didn’t tell anyone except Henry, her assistant, because she didn’t want her brothers or her friends worrying about her.\u003c/p\u003e\n\u003cp\u003eThe doctor was able to do arthroscopic surgery, which meant a much shorter recovery time. She only had to use crutches for two days, and after two additional days of taking it easy, she began rehab.\u003c/p\u003e\n\u003cp\u003eShe had just finished a workout to strengthen her knee when Sophie and Cordie stopped by her suite in the hotel.\u003c/p\u003e\n\u003cp\u003e“I’m still angry with you, Regan,” Sophie said. “We had to find out you had surgery after the fact.”\u003c/p\u003e\n\u003cp\u003eCordie agreed. “You’d be furious if Sophie or I did that to you.”\u003c/p\u003e\n\u003cp\u003e“You’re right. I was wrong,” she said. “I just didn’t want you to worry, and it was no big deal.”\u003c/p\u003e\n\u003cp\u003e“I don’t care if it was a big deal or not. You should have told us,” Sophie argued.\u003c/p\u003e\n\u003cp\u003e“I don’t know what irritates me more. That you had surgery without us, or that you bailed on that godawful seminar where we had to listen to that quack doctor do one stupid exercise after another. It was the most miserable weekend of my life.”\u003c/p\u003e\n\u003cp\u003e“It was pretty awful,” Sophie agreed. “After the seminar, I talked to Shields’s people about refunding your fee, but they refused. I told them you had hurt your knee, but they weren’t at all sympathetic. The woman told us Shields has a strict policy. No refunds. How come I’m not surprised?”\u003c/p\u003e\n\u003cp\u003e“I demanded to talk to the doctor himself,” Cordie said. She had spotted a candy dish on the credenza and was sorting through the hard candies looking for peppermints.\u003c/p\u003e\n\u003cp\u003e“And that’s when we found out Shields has gone to his vacation home. Debbie said he needs his alone-time to rejuvenate. I translated that to mean he needs time to come up with more idiotic exercises.”\u003c/p\u003e\n\u003cp\u003eRegan nodded. “I don’t think he can top the people-I-want-dead list.”\u003c/p\u003e\n\u003cp\u003eSophie grinned. “That one was really kind of fun.”\u003c/p\u003e\n\u003cp\u003e“Who did you put on your list?” Regan asked. “Anyone I know?”\u003c/p\u003e\n\u003cp\u003eSophie’s eyes widened. “Of course not. That would have been … barbaric. I made up names. And they all rhymed.”\u003c/p\u003e\n\u003cp\u003e“What about you, Cordie?”\u003c/p\u003e\n\u003cp\u003e“The Seven Dwarfs,” she said.\u003c/p\u003e\n\u003cp\u003eRegan’s face was turning red. Cordie noticed. “You wrote real names, didn’t you?”\u003c/p\u003e\n\u003cp\u003eShe didn’t have to answer. They both knew she had. She waited until they’d stopped laughing and said, “Okay, it’s official. I’m a complete idiot. It just never occurred to me to make up names. I guess I was feeling stressed at the time.”\u003c/p\u003e\n\u003cp\u003e“Which brings me to my proposition,” Sophie said. She gave her friend a sly grin and continued. “I think we should take a vacation. I’ve rented a condo, and it’s right on the beach. It would do us all good to get away. You could use a rest, Regan.”\u003c/p\u003e\n\u003cp\u003e“Where is this beach?”\u003c/p\u003e\n\u003cp\u003e“The Caymans,” she answered. “So, what do you say? I’ve called the airline, and we can leave this evening.”\u003c/p\u003e\n\u003cp\u003eRegan glanced at Cordie, who was looking sheepish, and then turned back to Sophie. She recognized that look in her eye.\u003c/p\u003e\n\u003cp\u003e“So, what’s the real reason, Sophie?” Regan asked. “Something’s up. I can tell.”\u003c/p\u003e\n\u003cp\u003eSophie confessed. “Well … I did some digging. And guess where Dr. Shields’s vacation home is?”\u003c/p\u003e\n\u003cp\u003eRegan caught on quickly. “The Caymans,” she answered. She turned to Cordie. “And you’re in on this?”\u003c/p\u003e\n\u003cp\u003eCordie nodded. “I know. I can’t believe I’m just dropping everything and running off to the Cayman Islands.”\u003c/p\u003e\n\u003cp\u003e“Daddy says that lots of people use the Cayman banks to hide their money from their spouses or creditors—”\u003c/p\u003e\n\u003cp\u003e“Or the IRS?” Regan asked.\u003c/p\u003e\n\u003cp\u003e“Definitely the IRS,” Sophie said.\u003c/p\u003e\n\u003cp\u003e“And you’re sure that Shields is in the Caymans now?” Regan asked.\u003c/p\u003e\n\u003cp\u003e“He’s been spotted on the beach behind his house,” Sophie answered confidently.\u003c/p\u003e\n\u003cp\u003e“What do you mean, ‘he’s been spotted’? How would you know—”\u003c/p\u003e\n\u003cp\u003e“Daddy gave me the name of a guy to call, and he was happy to check. Shields is there, all right.”\u003c/p\u003e\n\u003cp\u003e“How long are you going to be gone?” Regan asked.\u003c/p\u003e\n\u003cp\u003e“We’ve got the condo for two weeks,” Sophie said. “It all depends.”\u003c/p\u003e\n\u003cp\u003e“Can you take that much time?”\u003c/p\u003e\n\u003cp\u003eCordie answered. “Why not? Sophie’s a good two months ahead with her column, and I’m officially through with school until next term. I’ve got the entire summer off to work on my dissertation, but I’m not going to take any work with me. I plan to sit in the shade and relax. This constant rain is depressing, and when I get depressed, I eat.”\u003c/p\u003e\n\u003cp\u003e“I wish I could go with you, but I can’t,” Regan said. “The art auction is coming up. I can’t miss it, and I’ve got to get ready for the annual family meeting.”\u003c/p\u003e\n\u003cp\u003e“I don’t know why you bother,” Sophie said. “Your vote doesn’t count for anything. Spencer always votes with Aiden, Walker abstains, and you’re always the dissenting vote. You don’t have any power—”\u003c/p\u003e\n\u003cp\u003eCordie interrupted. “You know that’s not true. Aiden can’t start another hotel without all four signatures. She has the power to stop any kind of expansion. Without her vote, everything comes to a complete standstill.”\u003c/p\u003e\n\u003cp\u003e“But I won’t do that,” Regan said. “I want more money for the art projects Henry and I started last year. You’ve seen the response. It’s been phenomenal.” She sighed then. “We’re getting off the track. I’ve got to write a report to justify the increase I want, and that’s going to take time. I really wish you’d go somewhere else for a vacation.”\u003c/p\u003e\n\u003cp\u003e“This isn’t a vacation,” Sophie said.\u003c/p\u003e\n\u003cp\u003e“It is for me,” Cordie countered.\u003c/p\u003e\n\u003cp\u003e“Shields could be dangerous. If he did send his bodyguards to Mary Coolidge’s house—”\u003c/p\u003e\n\u003cp\u003eSophie interrupted. “I know, but I’m not going to back away from this. I’m going to nail him, one way or another.”\u003c/p\u003e\n\u003cp\u003e“I don’t like the sound of that,” Regan said. “Don’t do anything illegal. And please be careful.”\u003c/p\u003e\n\u003cp\u003eSophie shrugged. “He stood me up, you know.”\u003c/p\u003e\n\u003cp\u003e“Excuse me?” Regan said.\u003c/p\u003e\n\u003cp\u003e“The last day of the seminar, he asked me out … to dinner,” she said. “And I agreed. We were supposed to meet at the top of the Hyatt, and I waited for over an hour. He never showed.”\u003c/p\u003e\n\u003cp\u003e“You agreed to go out with that creep?” Regan asked.\u003c/p\u003e\n\u003cp\u003e“I didn’t agree to go to bed with him, so stop looking so horrified. We hadn’t been able to get into his computer or find any records at the seminar. I just wanted to get close to him so I could—”\u003c/p\u003e\n\u003cp\u003e“Get to his records?” Cordie asked. “Sophie, you need to start thinking things through.”\u003c/p\u003e\n\u003cp\u003e“Have you got any better ideas?”\u003c/p\u003e\n\u003cp\u003e“What will you do when you find him in the Caymans?” Regan asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know yet,” Sophie answered, “but I’ll think of something.”\u003c/p\u003e\n\u003cp\u003eChapter Sixteen\u003c/p\u003e\n\u003cp\u003eIT WAS REGAN’S FIRST FULL DAY BACK AT WORK AND HENRY WAS DRIVing her nuts trying to pamper her. He hovered like a doting grandmother. He wouldn’t even let her reach for a pencil. Fortunately, he had a full schedule and several errands to run that morning. As he was leaving, she asked him to stop by the parking garage and get her cell phone from her car. She was sure that’s where she had left it.\u003c/p\u003e\n\u003cp\u003eThe second the door closed behind him, Regan turned back to her desk. She was determined to clear her e-mails as quickly as possible. She’d finished thirty without interruption, took a break to answer phone calls and eat lunch, and then went back to her task.\u003c/p\u003e\n\u003cp\u003eThe next e-mail was from Henry. Whenever he received anything he thought Regan would be interested in, he forwarded it to her computer. The subject line was blank, and when she scrolled down, there was just an attachment, but no typed message from Henry. That was a bit peculiar. She assumed he’d been in a hurry.\u003c/p\u003e\n\u003cp\u003eShe clicked on the paper clip icon and waited.\u003c/p\u003e\n\u003cp\u003eHenry walked into her office just as the picture appeared on the screen.\u003c/p\u003e\n\u003cp\u003e“Your phone wasn’t in your car. I looked under the seats, between them … hey, Regan, what’s the matter. Are you sick?”\u003c/p\u003e\n\u003cp\u003e“Oh, my God …” She was so repulsed by what she was looking at she couldn’t go on.\u003c/p\u003e\n\u003cp\u003eHenry ran around the desk. He stopped short when he saw the screen. In front of him was a picture of a dead man, hanging by a thick rope from a beam in a basement somewhere, his face grotesquely swollen. His eyes were wide open, and his flabby skin was a chalky gray.\u003c/p\u003e\n\u003cp\u003e“Gross,” Henry whispered. “What kind of pervert would send …”\u003c/p\u003e\n\u003cp\u003e“The e-mail came from you,” she said.\u003c/p\u003e\n\u003cp\u003e“No way would I send anything like this.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Someone must have gotten hold of our private e-mail addresses.”\u003c/p\u003e\n\u003cp\u003eHenry pointed to the screen. “It’s not real,” he said. “Someone’s just playing a sick joke on you. Get rid of it,” he added as he reached for the delete key.\u003c/p\u003e\n\u003cp\u003eShe pushed his hand away. “I know this man.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I know him.” \u003c/p\u003e","sourceLink":"https://allnovel.net/murder-list-buchanan-renard-4/page-14.html","bookId":2674,"creation":"Oct 5, 2019 10:02:32 AM","modification":"Oct 5, 2019 10:02:32 AM"}
