{"id":66839,"no":20,"title":"Page 20","content":"\u003cp\u003eShe didn’t immediately answer. She was anxiously gripping her hands together as she continued to wait for the machine to spit the page out. It seemed to be taking forever.\u003c/p\u003e\n\u003cp\u003eAnd there it was.\u003c/p\u003e\n\u003cp\u003eOh, God, another picture, this one of a woman lying on what looked like a metal slab. Her ashen face was peaceful in death.\u003c/p\u003e\n\u003cp\u003eIt took Regan several seconds to remember where she’d seen the woman before.\u003c/p\u003e\n\u003cp\u003e“This can’t be happening.”\u003c/p\u003e\n\u003cp\u003e“Tell me,” he demanded.\u003c/p\u003e\n\u003cp\u003e“I know this woman,” she said. “She works at Dickerson’s Bath Shop on Michigan Avenue. I stopped in there a couple of weeks ago to buy a bottle of body lotion. She’s a saleswoman.”\u003c/p\u003e\n\u003cp\u003eHer knees felt as though they were going to buckle on her. She fell back against the desk and took a deep breath. Her mind was reeling.\u003c/p\u003e\n\u003cp\u003e“She was wearing a name tag … Ms. Patsy.”\u003c/p\u003e\n\u003cp\u003e“You remembered her name?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “She was rude, terribly rude. She was probably just having a bad day, and it was wrong of me to judge her so harshly. And now she’s dead.”\u003c/p\u003e\n\u003cp\u003eThat much was pretty obvious. “Are you going to get sick?” Alec was already looking around for a trash can.\u003c/p\u003e\n\u003cp\u003e“No, no. This is all my fault.”\u003c/p\u003e\n\u003cp\u003e“How could this be your fault? If what this maniac says is true, she died of a heart attack.”\u003c/p\u003e\n\u003cp\u003eShe was barely listening to him. Oh, God, what had she done? What had she done?\u003c/p\u003e\n\u003cp\u003e“Regan?”\u003c/p\u003e\n\u003cp\u003eShe took another deep breath. “You read the note. He said he was too late, that she was already dead. It’s obvious to me he went after her to kill her.”\u003c/p\u003e\n\u003cp\u003e“You didn’t kill her.”\u003c/p\u003e\n\u003cp\u003eHer face was turning gray. Alec was becoming concerned she might pass out on him now. He stepped closer just in case so he could catch her if she collapsed.\u003c/p\u003e\n\u003cp\u003e“No, but I put her on the list.”\u003c/p\u003e\n\u003cp\u003eHis head snapped back. “You what?”\u003c/p\u003e\n\u003cp\u003e“The murder list … it’s mine.”\u003c/p\u003e\n\u003cp\u003eChapter Twenty-three\u003c/p\u003e\n\u003cp\u003eREGAN WAS A LITTLE SURPRISED HE DIDN’T PUT HANDCUFFS ON her and read her her rights. Actually, Detective Buchanan took the news well, considering that she surely now was his number one suspect.\u003c/p\u003e\n\u003cp\u003eHe was quite good at hiding his reactions. Had she not been looking into his eyes, she wouldn’t have noticed his attitude had hardened toward her.\u003c/p\u003e\n\u003cp\u003eShe was too shaken to care what the detective thought about her. She was scared and worried and didn’t like feeling that way at all. She checked the time, calculated that Henry would be back at his desk in about fifteen minutes, and left him a note explaining where she was going. She also instructed him to call Sam Baldwin, the in-house attorney who, with an overworked staff of three other full-time attorneys, handled all the legal problems involving the Hamilton Hotels and/or any of the Madisons. Spencer jokingly referred to the attorneys as Walker’s personal team, since he was the family member who most often needed their expertise. Sam would be shocked to hear it was Regan who now needed him.\u003c/p\u003e\n\u003cp\u003eShe rode in the detective’s car to the police station, and on the way she tried to explain all about the spontaneous exercise Dr. Shields had had the registrants do during the reception.\u003c/p\u003e\n\u003cp\u003eHe was weaving in and out of traffic, narrowly missing one car after another. The man drove like a maniac, and she felt it was her duty as a concerned citizen to tell him so.\u003c/p\u003e\n\u003cp\u003e“Are you kidding me?” he said. “You’re Walker Madison’s sister, aren’t you? If anyone drives like a maniac, it’s your brother.” He paused to think about what she had been telling him and then asked, “What did you mean when you said the bodyguard was still watching you? Had something happened earlier that got his attention?”\u003c/p\u003e\n\u003cp\u003e“No,” she answered. “But from the minute I walked into the room, he locked in on me. It was really strange. I hadn’t done anything to draw his attention, but he wouldn’t stop staring at me.”\u003c/p\u003e\n\u003cp\u003eAlec didn’t think it was strange at all. Rude, maybe, but not strange. Hell, he himself was having trouble not staring. The bodyguard was a man, and Regan Madison was a very beautiful woman.\u003c/p\u003e\n\u003cp\u003e“I can prove all of this happened,” she said.\u003c/p\u003e\n\u003cp\u003eHe glanced at her. “Prove what?”\u003c/p\u003e\n\u003cp\u003e“That I’m not making this up … the exercise, I mean. Sophie taped it. She had a recorder in her purse, and she sat close to Shields. You can listen to it.”\u003c/p\u003e\n\u003cp\u003e“Yes, I will.”\u003c/p\u003e\n\u003cp\u003e“And just so you understand, I didn’t have any intention of doing the exercise, but then Shields said that, when time was up, we all had to hold up our lists, and he was going to walk around the room to see if we’d all written names. I decided then I’d let him know what I thought of him. He posed the question, after all, and he told us that if the world would be a better place without certain people in it, then put their names down.”\u003c/p\u003e\n\u003cp\u003e“His name was on your list?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“How many names did you write on your notepad?”\u003c/p\u003e\n\u003cp\u003e“Six … no, five.”\u003c/p\u003e\n\u003cp\u003e“You’re sure?”\u003c/p\u003e\n\u003cp\u003e“Yes, there were five names.” She prayed to God she was right.\u003c/p\u003e\n\u003cp\u003e“Okay, so Shields was one, and the Patsy woman, and Detective Sweeney,” he said. “Who are the other two?”\u003c/p\u003e\n\u003cp\u003e“The bodyguards.”\u003c/p\u003e\n\u003cp\u003e“Ah.”\u003c/p\u003e\n\u003cp\u003e“I’m not normally so bloodthirsty.”\u003c/p\u003e\n\u003cp\u003eHe flashed a grin. “I didn’t think you were.”\u003c/p\u003e\n\u003cp\u003e“The reception seems such a long time ago. I had surgery shortly after that and the days all blended together. As far as the list goes …”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I thought I was going to tear it up and throw it in the fire like all the other people were doing, but I had to step into the hall to take a phone call, and when I went back inside, Sheilds had moved on to what Cordie called his inspirational, aren’t-I-wonderful segment.”\u003c/p\u003e\n\u003cp\u003e“What was that like?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I didn’t listen. I went to get the car. That’s when the man came after me, and I fell. I dropped everything. I didn’t realize I’d left my phone and the folder there.”\u003c/p\u003e\n\u003cp\u003e“So, tell me exactly what was in the folder.”\u003c/p\u003e\n\u003cp\u003eShe looked off into space trying to remember. The image of the blue folder filled with the glossy pages vaguely emerged. “There was the notebook I wrote the list on … and there were testimonials about Shields … and photos … I took one of them and began a reminder list … notes, work stuff … things I needed to get done … just stuff.”\u003c/p\u003e\n\u003cp\u003e“You’re going to have to remember what all the ’stuff was and, when we get to the station, you can write it down for Detective Wincott.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Those notes were left in the folder. He’s going to want to know about them.”\u003c/p\u003e\n\u003cp\u003eRegan didn’t know if she could remember what she’d written. She thought about it and didn’t say another word the rest of the way to the station.\u003c/p\u003e\n\u003cp\u003eAlec parked the car in the adjacent parking lot, opened her door for her, and took hold of her arm when they crossed the street.\u003c/p\u003e\n\u003cp\u003e“It’s going to be a long afternoon,” he said. “Everything you’ve gone over with me, you’ll have to go over with Wincott.” Again and again and again, he silently added. Wincott was big on repetition.\u003c/p\u003e\n\u003cp\u003e“And what will you be doing?”\u003c/p\u003e\n\u003cp\u003e“I’ve got some calls to return and some paperwork to finish up. Wincott will let me know when you’re finished.”\u003c/p\u003e\n\u003cp\u003e“I don’t need a bodyguard.”\u003c/p\u003e\n\u003cp\u003e“I think maybe you do.”\u003c/p\u003e\n\u003cp\u003e“Then I’ll hire—”\u003c/p\u003e\n\u003cp\u003eHe interrupted. “Look, you’re stuck with me no matter how many others you hire. The choice isn’t yours.”\u003c/p\u003e\n\u003cp\u003eShe decided that arguing with him would be pointless. She must have looked forlorn, though, because he said, “Cheer up. It could be worse.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“You could have written ten names on that list, or twenty, or thirty …”\u003c/p\u003e\n\u003cp\u003eThey started up the flight of stairs. “How many names did your friend Cordie write?”\u003c/p\u003e\n\u003cp\u003e“Seven,” she said.\u003c/p\u003e\n\u003cp\u003eThey reached the landing, and he led her down a narrow hallway. “There you go,” he said. “Your friend’s more bloodthirsty than you are. That ought to make you feel better.”\u003c/p\u003e\n\u003cp\u003e“Not really. She wrote the names of the Seven Dwarfs.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “You’re kidding.”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“What’s she got against the Seven Dwarfs?” he asked.\u003c/p\u003e\n\u003cp\u003eShe gave him a weak smile. “Nothing.”\u003c/p\u003e\n\u003cp\u003e“It’s impressive,” he added. He opened the door and stepped back so that she could go inside first.\u003c/p\u003e\n\u003cp\u003e“What’s impressive?” she asked as she walked past him. “That Sophie and Cordie were smart enough not to write names of real people?”\u003c/p\u003e\n\u003cp\u003e“No, it’s impressive Cordie could name all Seven Dwarfs. I can only get to four. Let’s see. There’s Doc and Sleepy and Dopey and Slurpy—”\u003c/p\u003e\n\u003cp\u003eShe interrupted. “Slurpy isn’t one of the Seven Dwarfs. It’s a beverage.”\u003c/p\u003e\n\u003cp\u003e“Huh. What about Loopy?”\u003c/p\u003e\n\u003cp\u003e“Sorry, no,” she said. And then she laughed. “Are you trying to make me feel better?”\u003c/p\u003e\n\u003cp\u003e“Maybe a little.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because you look like you’re on your way to a firing squad. And we stopped doing that over a month ago. And like I said, it’s going to be a long afternoon for you.”\u003c/p\u003e\n\u003cp\u003eThe police station seemed to be a maze of corridors. Alec reached around her to open yet another door. She was going to need bread crumbs to find her way out of here.\u003c/p\u003e\n\u003cp\u003e“Where are we going now?”\u003c/p\u003e\n\u003cp\u003e“The coffee room. I told Wincott we’d wait there for him to get back.”\u003c/p\u003e\n\u003cp\u003e“What about the sketch artist?”\u003c/p\u003e\n\u003cp\u003e“He’s next.”\u003c/p\u003e\n\u003cp\u003eHe pulled a chair out for her and got a whiff of her perfume. Damn, she smelled good.\u003c/p\u003e\n\u003cp\u003e“Do you want something to drink?” he asked.\u003c/p\u003e\n\u003cp\u003e“Water, please.”\u003c/p\u003e\n\u003cp\u003eRegan looked around with interest. The coffee room was nothing like the ones she had seen on television with peeling paint and dirty barred windows. This one was spacious and clean and had obviously just been remodeled. The faint smell of paint still lingered in the air. The walls were bright—almost too bright—and the color was a rather putrid shade of turquoise. There were two square tables with chairs that looked new.\u003c/p\u003e\n\u003cp\u003eAlec noticed her staring at the walls. “Makes you want to put on sunglasses, doesn’t it?”\u003c/p\u003e\n\u003cp\u003e“Who picked out this color?”\u003c/p\u003e\n\u003cp\u003e“No one will own up to it.”\u003c/p\u003e\n\u003cp\u003eThe refrigerator was also new and was stocked with water and soft drinks. Alec handed her a bottle of water and then pulled out a chair across from her and sat down.\u003c/p\u003e\n\u003cp\u003eThere was a steno pad and a ballpoint pen in the center of the table. Alec pushed both toward her. “You might as well get a head start and write the names you put on your murder list.”\u003c/p\u003e\n\u003cp\u003eMurder list. Oh, God, what a mess this was. She picked up the pen and quickly wrote the five names. She labeled the bodyguards A and B since she didn’t know their real names. When she was finished, she pushed the pad toward him.\u003c/p\u003e\n\u003cp\u003eHe leaned across, glanced at the list, and then pushed the pad toward her again.\u003c/p\u003e\n\u003cp\u003e“Okay, now write down all the notes you were making while Shields was talking.”\u003c/p\u003e\n\u003cp\u003eThat was easier said than done. She tapped the toe of her shoe on the linoleum floor while she tried to concentrate. Emily Milan came to mind. Regan remembered she’d made a note to have it out with Aiden’s assistant. Oh, and Peter Morris. How could she have forgotten him? She’d made a note to talk to security about him. But who else? Was there anyone else?\u003c/p\u003e\n\u003cp\u003eThe tapping increased. “There’s no need to be nervous,” he said.\u003c/p\u003e\n\u003cp\u003e“I’m not nervous.” It was a lie, and he knew it.\u003c/p\u003e\n\u003cp\u003eThen she realized she was jiggling the table with her knee, making a racket with her foot. She forced herself to stop. “Maybe I’m a little nervous.”\u003c/p\u003e\n\u003cp\u003eShe put the pen down and once again pushed the notepad toward him. He looked at her notes but didn’t comment.\u003c/p\u003e\n\u003cp\u003eShe stared at the tabletop while she tried to recall what else she’d written on those papers. Had she left anyone off her doom list? She remembered wanting to add Emily’s name at the last minute, but she never got the chance.\u003c/p\u003e\n\u003cp\u003eShe looked up at Alec, and for a second she actually lost her concentration. That had never happened before. But then, Detective Buchanan was a very interesting man—and a definite contradiction. He was a bit disheveled with his tie still askew, his wrinkled suit jacket, and his desperate need for a shave, but he had impeccable manners, was obviously well-educated, and had a sense of humor—a trait she thought would have been the first to vanish in his line of work. When he was giving her his full attention, she could almost feel a magnetic pull.\u003c/p\u003e\n\u003cp\u003eOkay, I’m losing it, she thought. She cleared her throat and said, “I saw you in Lieutenant Lewis’s office when I was there before, talking to Detective Sweeney.”\u003c/p\u003e\n\u003cp\u003e“I saw you too.”\u003c/p\u003e\n\u003cp\u003eMomentarily sidetracked by his admission, she said, “You did?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“Yes, well, the thing is … the lieutenant was shouting at a police officer,” she said. “Actually, as I remember, he was screaming. I had never seen anyone behave like that. No one in such a position of authority, anyway. I thought his conduct was appalling.”\u003c/p\u003e\n\u003cp\u003e“He wanted to get rid of the officer.”\u003c/p\u003e\n\u003cp\u003e“You defended him.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “You saw that too?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said. “I saw you arguing with the lieutenant, but I couldn’t hear what you were saying to him. Unlike your superior, you didn’t raise your voice. I remember thinking that he … Lewis … was humiliating that officer.”\u003c/p\u003e\n\u003cp\u003eAlec disagreed. “No,” he said. “He tried to humiliate him, but he didn’t succeed. The officer knew he hadn’t done anything wrong. How come we’re talking about this now?”\u003c/p\u003e\n\u003cp\u003eShe couldn’t hold his stare but looked over his shoulder. “I was going to put the lieutenant’s name on the list.”\u003c/p\u003e\n\u003cp\u003eHe was trying hard not to smile. “But you didn’t?”\u003c/p\u003e\n\u003cp\u003e“No, I didn’t. I would have, though, if I hadn’t been interrupted. My cell phone rang, and I had to hurry out into the hall to answer it. I would have added his name if I’d continued. I just thought you should know.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t tell Detective Wincott if I were you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/murder-list-buchanan-renard-4/page-20.html","bookId":2674,"creation":"Oct 5, 2019 10:02:32 AM","modification":"Oct 5, 2019 10:02:32 AM"}
