{"id":66845,"no":26,"title":"Page 26","content":"\u003cp\u003eHer brothers weren’t the only ones giving her trouble. She was also developing a love/hate relationship with Alec. The truth was, she loved being with him—he was smart and funny and sweet and kind—but she hated the reason why he was always there at her side.\u003c/p\u003e\n\u003cp\u003eFor two weeks now, she and Alec had been inseparable. He refused to take any days off and only left her after a policeman had been posted on her floor, between the elevator doors and the stairs, which were the only ways to get to her suite. Alec was the last person she saw every night before she locked her door, and the first person she saw in the morning when she stepped out into the hall.\u003c/p\u003e\n\u003cp\u003eHe was definitely growing on her, but she kept wondering—would he even have given her the time of day if it hadn’t been his job to protect her? If he had met her under different circumstances, would he have been interested? Would he have wanted to ask her out?\u003c/p\u003e\n\u003cp\u003eHenry also liked having him around. The two seemed to talk for hours about sports trivia and rock bands, and when Henry was struggling over a paper he was writing for a summer political science course, Alec offered to help him. Before long, Henry was asking his advice about girlfriends and his own future.\u003c/p\u003e\n\u003cp\u003eIn the evenings, Regan and Henry and Alec changed into running clothes and worked out together in the gym. Alec beat the socks off her and Henry on the track. He was in much better shape than she was and gleefully pointed that out, several times, as a matter of fact. She used her recent surgery as an excuse for having to hold back, but each day she went a little faster and a little farther. There was an annual charity race coming up, she told him, and she wanted to walk as much of the course as she could.\u003c/p\u003e\n\u003cp\u003eRegan knew she couldn’t follow her normal routine, and she cooperated as much as she could, but there were a couple of events she refused to cancel or postpone because she felt they were too important. One of them took place at the hotel, and that made things easier for Alec.\u003c/p\u003e\n\u003cp\u003eIt was toward the end of the second week, and Regan was getting ready for the reception she was hosting that evening. She wanted everything to go smoothly. Alec helped her measure the spacing between hooks on the walls in the corridor leading from the lobby to the gift shop, and when they were finished there, he followed her to the atrium and she checked the measurements there. She had already had the electricians work on the gallery lighting, and Frank from maintenance was happy to lend a hand.\u003c/p\u003e\n\u003cp\u003e“Are you going to tell me what we’re doing and why?” Alec asked as he handed her the measuring tape again.\u003c/p\u003e\n\u003cp\u003e“We’re measuring the distance between the paintings one last time just to make sure the spacing is right. I don’t want them to look crammed together.”\u003c/p\u003e\n\u003cp\u003e“Where are these paintings?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “You’ll see.”\u003c/p\u003e\n\u003cp\u003eHe could feel her excitement, and his curiosity was aroused. He didn’t even mind that he had to wear his suit a little longer.\u003c/p\u003e\n\u003cp\u003eRegan changed into a simple black dress with a jewel neckline. Because she was running late, she didn’t have time to put her hair up. She brushed it, sprayed it, and then put on lip gloss and blush and was on her way out the door with five minutes to spare.\u003c/p\u003e\n\u003cp\u003eThe reception began at seven o’clock. Alec wasn’t happy about the crowd gathered in the atrium. She was ecstatic. When she tried to walk away from him, he grabbed her hand and forced her in to his side.\u003c/p\u003e\n\u003cp\u003eHe leaned down and whispered, “Stay with me.”\u003c/p\u003e\n\u003cp\u003eShe nodded to let him know she had heard what he said.\u003c/p\u003e\n\u003cp\u003eThey were both getting speculative looks from men and women. Regan introduced Alec as her friend, but Henry was being plied with questions. Was Regan serious about this man? Who exactly was he, and what did he do for a living?\u003c/p\u003e\n\u003cp\u003eHenry’s friend Kevin had also been invited, and he helped Henry with last-minute details.\u003c/p\u003e\n\u003cp\u003eAfter Regan had welcomed her guests, she took Alec’s hand and led him to the first of twelve beautifully framed paintings. The cream-colored walls came to life next to the vibrant and joyful colors. Yes, joyful, Alec thought as he studied one bold abstract. The names of the artists were printed in black block letters on a white square plate underneath each painting.\u003c/p\u003e\n\u003cp\u003e“I’ve never heard of any of these artists,” he said.\u003c/p\u003e\n\u003cp\u003e“You’ll get to meet them before they become famous. Do you have a favorite painting?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I like all of them.”\u003c/p\u003e\n\u003cp\u003eHenry and Kevin stood together while they waited for a quiet moment to talk to Alec. Kevin’s hands were jammed into his pockets, and he was shifting from foot to foot.\u003c/p\u003e\n\u003cp\u003e“Don’t lose your nerve,” Henry whispered. “Alec will help you. I know he will.”\u003c/p\u003e\n\u003cp\u003e“I won’t lose my nerve. I’m gonna do it. So when do you think—”\u003c/p\u003e\n\u003cp\u003e“After the presentation but before he takes Regan upstairs.” Henry’s gaze was on Regan and Alec. “They look good together, don’t they?”\u003c/p\u003e\n\u003cp\u003eThey were laughing and talking, and Henry noticed Regan taking Alec’s arm as she guided him from picture to picture. They seemed so comfortable with each other. As they headed back to the atrium, Henry and Kevin intercepted them. Alec shook Kevin’s hand when Henry introduced him. He could feel the kid trembling, but he already knew from the look in his eyes that he was scared.\u003c/p\u003e\n\u003cp\u003e“You look familiar,” he said, thinking he might have busted him at one time.\u003c/p\u003e\n\u003cp\u003e“I work at The Palms,” Kevin said. “Maybe you saw me there.”\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003eRegan didn’t seem to notice there was anything wrong. She spotted a woman who nodded to her. “They’re here,” she told Henry.\u003c/p\u003e\n\u003cp\u003e“Maybe later we could … uh, you know, maybe talk,” Kevin said to Alec.\u003c/p\u003e\n\u003cp\u003e“Yeah, okay. Later.”\u003c/p\u003e\n\u003cp\u003e“Are you ready, Henry?” Regan asked.\u003c/p\u003e\n\u003cp\u003e“Let’s do it.”\u003c/p\u003e\n\u003cp\u003eAlec stayed by Regan’s side as they made their way through the crowd to the podium. The guests had all been plied with food and drink, and the mood was quite jovial.\u003c/p\u003e\n\u003cp\u003eThe uninvited guest stood in the crowd watching her, waiting for his opportunity. Slowly he maneuvered his way toward her, closer and closer. For a few minutes he stood just feet away pretending to admire a painting while he eavesdropped on her conversation with a man she called Alec. If he could just get close enough to touch her, maybe he could separate her from the throng of people, get her alone, but each time he made his move, the man she was with got in the way and wouldn’t let her out of his sight. She was the center of attention, the star. Wherever she turned, there was another guest eager for a moment of her time. It took him twenty minutes to weave his way close again, but just as he was extending his hand to take hers and request a moment of privacy, Alec ushered her in the opposite direction. His frustration grew. He couldn’t get to her. Tonight would not be the night. He would have to wait for another opportunity, but eventually the right moment would come, and he would be ready. Unnoticed, he slipped out the side door.\u003c/p\u003e\n\u003cp\u003eHenry motioned to the string quartet to take a break. He stood next to Regan as she once again welcomed everyone, and then she introduced Henry and moved back so that he could speak into the microphone.\u003c/p\u003e\n\u003cp\u003eAs he was talking about the importance of art and music in the public schools, the twelve artists filed in and stood in front of the podium. With a great deal of pride in his voice, Henry presented each one.\u003c/p\u003e\n\u003cp\u003eAlec was impressed and a little stunned. Not one of the artists was more than fourteen or fifteen years old. Now he understood what Regan had meant when she said he would meet them before they became famous, for their amazing talent was just beginning to blossom. The paintings were for sale, the price of each steep, but every dollar would go to the art departments in the schools the artists represented. Henry also introduced the teachers involved in the new program and explained that the artists would receive scholarships and art supplies.\u003c/p\u003e\n\u003cp\u003eEvery painting had been sold by nine o’clock. Regan was thrilled and so proud of Henry, she hugged him. She kept giving him all the credit, but Henry told Alec that Regan had come up with the idea. He’d merely implemented it.\u003c/p\u003e\n\u003cp\u003eThe party was over by ten, and though it wasn’t all that late, Regan was tired and wanted to go up to her suite, take a hot shower, and fall into bed.\u003c/p\u003e\n\u003cp\u003eThey were crossing the lobby together with Henry and Kevin trailing behind. She was telling Alec the reason behind the art project.\u003c/p\u003e\n\u003cp\u003e“Whenever schools run into financial trouble, they take away money for art and music. The administrators … they forget.”\u003c/p\u003e\n\u003cp\u003e“Forget what?” he asked.\u003c/p\u003e\n\u003cp\u003eHenry answered. “It’s like Regan says. Education isn’t just about feeding the brain. Art and music feed the heart and the soul.”\u003c/p\u003e\n\u003cp\u003eAlec agreed. Then Henry said, “There will always be paintings hanging on those walls, and when one sells, we’ll put another one up. It will be an ongoing thing. It’s a cool idea, isn’t it? The goal is to do this in all the Hamilton hotels.”\u003c/p\u003e\n\u003cp\u003eKevin nudged Henry and whispered, “I want to get this over with.”\u003c/p\u003e\n\u003cp\u003eHenry spoke up. “Hey, Regan, how about stopping for a drink?”\u003c/p\u003e\n\u003cp\u003eThe bar was just off the lobby, and there were only a couple of people inside. Alec suggested they get a table and order a drink, a nonalcoholic drink he stressed.\u003c/p\u003e\n\u003cp\u003eAlec squeezed Regan’s hand. “If you want me to take you upstairs, I’m sure the policeman is already stationed outside your door. I’ll check your suite, lock you in, and come back down here. The guys won’t mind waiting.”\u003c/p\u003e\n\u003cp\u003e“That’s okay,” she said. “I’ll get a drink with you.”\u003c/p\u003e\n\u003cp\u003eThe bar was dark and cozy, the walls a rich walnut paneling. Candlelight flickered softly from votives on all the tables. Henry rushed ahead and found a table tucked in the corner that faced the side exit. He pulled out a chair for Regan, but Alec didn’t approve. He wanted her to sit with her back against the wall. Once Regan was settled, she expected the three men to join her, but none of them sat down. Henry and Kevin had their heads down and were looking very ill at ease.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” she asked.\u003c/p\u003e\n\u003cp\u003eHenry darted a quick look at Alec before answering. “What it is …” he began, and then nudged Kevin.\u003c/p\u003e\n\u003cp\u003e“Yes?” she asked.\u003c/p\u003e\n\u003cp\u003eShe marveled at the change in Henry. When he had stood at the podium and had spoken to the guests tonight, he had been polished and eloquent. Now he was acting like an insecure teenager. Henry only reverted to that behavior when something was very wrong or had him riled up.\u003c/p\u003e\n\u003cp\u003e“I just thought that maybe Kevin would want to talk to Detective Buchanan for a couple of minutes, and he said okay, about talking … you know, so Kevin can run something by him.”\u003c/p\u003e\n\u003cp\u003eHenry seemed to need her approval, and so she said, “That’s fine.”\u003c/p\u003e\n\u003cp\u003eAlec put his hand on Henry’s shoulder. “Henry, sit with Regan while Kevin and I talk.” He turned to Regan. “Don’t you move,” he said.\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. Ordering her to stay put hadn’t really been necessary, since he never let her out of his sight. He and Kevin went down the three steps to the corridor and stood off to the side. Alec towered over Kevin, so he leaned down to hear what he was saying.\u003c/p\u003e\n\u003cp\u003eRegan couldn’t read anything in Alec’s expression, but poor Kevin was clearly falling apart. His complexion went from ashen white to flushed red, and he was talking fast and gesturing with his hands. A tear slipped down his cheek, and he angrily wiped it away. Then he glanced at Regan. She quickly turned to Henry, so Kevin wouldn’t know she had been watching him.\u003c/p\u003e\n\u003cp\u003e“Is Kevin in trouble?”\u003c/p\u003e\n\u003cp\u003e“Not Kevin … someone else. It’s kind of private stuff, but he said I could tell you.”\u003c/p\u003e\n\u003cp\u003eThe waiter appeared with a small silver bowl filled with cashews. Henry ordered soft drinks for all of them and then sat back. He continued. “He’s scared. His mother … you know, she left a couple of years ago. She just walked out.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know,” Regan replied.\u003c/p\u003e\n\u003cp\u003e“His dad got a divorce, and that was a good move, and he got sole custody of the kids too. Anyway, Kevin’s mother suddenly showed up again and she wasn’t alone … and they’re bringing the junk back into the house … you know, drugs.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t Kevin’s father—?”\u003c/p\u003e\n\u003cp\u003e“Kick them out? He tried, but they aren’t going anywhere. His dad farmed the kids out to friends, and Kevin thought maybe Alec could help him.”\u003c/p\u003e\n\u003cp\u003e“Poor Kevin,” she whispered. “I can’t imagine how he must be feeling.”\u003c/p\u003e\n\u003cp\u003e“He thinks he’s playing it cool, but he isn’t.” Henry watched his friend for a minute and then turned back to Regan. “How do you do it?”\u003c/p\u003e\n\u003cp\u003e“Do what?”\u003c/p\u003e\n\u003cp\u003e“Stay cool. I mean, come on, you’ve got a nut out there doing crazy stuff. You’ve got a bodyguard and security—”\u003c/p\u003e\n\u003cp\u003e“I’m not cool about it,” she said. “But I try not to dwell on it.”\u003c/p\u003e\n\u003cp\u003e“Waiting for something to happen … that’s what’s scary. I get freaked out thinking about it. If anything happened to you, I don’t know what I’d do. I mean …”\u003c/p\u003e\n\u003cp\u003eShe put her hand on top of his. “It’s going to be okay. You’ll see.”\u003c/p\u003e\n\u003cp\u003eShe sounded as though she knew what she was talking about, but like Henry, she got scared thinking about it. Then she looked at Alec and she relaxed. As long as she was with him, she was safe.\u003c/p\u003e\n\u003cp\u003eThe waiter placed the drinks on the table. She thanked him, picked up her glass, and took a sip. Her gaze kept going back to Alec. Henry noticed.\u003c/p\u003e\n\u003cp\u003e“What are you going to do when he leaves?”\u003c/p\u003e\n\u003cp\u003e“I guess someone else will be assigned to follow me around.”\u003c/p\u003e\n\u003cp\u003e“That’s not what I mean. Come on, Regan. You’re talking to me. You don’t have to pretend. I’ve been watching you two. You’ve got this connection. You know what I’m talking about?”\u003c/p\u003e\n\u003cp\u003eOh, boy, did she. “I like him,” she admitted. “He kind of grows on you, but he isn’t at all my type.”\u003c/p\u003e\n\u003cp\u003e“You mean the sterile type?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “What’s that?”\u003c/p\u003e\n\u003cp\u003e“Every button buttoned, always in a suit and tie, and looking immaculate all the time. I used to think Aiden was the sterile type, but then I played rugby with him in that charity game, and man, did I change my mind. He was muddy and brutal. Definitely not the sterile type. And neither is Detective Buchanan—I mean Alec.\u003c/p\u003e\n\u003cp\u003eHe told me to call him Alec—I’ll bet he’d be brutal on the field too.”\u003c/p\u003e\n\u003cp\u003e“I’m sure he’d play to win,” she agreed. “He is kind of … sloppy,” she added, and almost made it sound like a compliment. \u003c/p\u003e","sourceLink":"https://allnovel.net/murder-list-buchanan-renard-4/page-26.html","bookId":2674,"creation":"Oct 5, 2019 10:02:32 AM","modification":"Oct 5, 2019 10:02:32 AM"}
