{"id":66857,"no":38,"title":"Page 38","content":"\u003cp\u003eHenry smiled. “Thank you, sir, but I’m good here. Besides, someday this is all going to be mine.”\u003c/p\u003e\n\u003cp\u003eAiden laughed. “The hotel, or this office?”\u003c/p\u003e\n\u003cp\u003e“Stop recruiting him,” Regan said.\u003c/p\u003e\n\u003cp\u003eAiden ignored her. “If this is really what you want …”\u003c/p\u003e\n\u003cp\u003e“It is, sir. Besides, I could never work with …”\u003c/p\u003e\n\u003cp\u003e“The dragon? Isn’t that what you call Emily?”\u003c/p\u003e\n\u003cp\u003eHenry didn’t seem embarrassed or look the least contrite. “Most of the time that’s what I call her, but I’ve also got a couple of other names for her.”\u003c/p\u003e\n\u003cp\u003e“Yes. I’ve heard about those too.”\u003c/p\u003e\n\u003cp\u003e“I appreciate your offer,” he said. “But I love what I’m doing, and like I said, I could never work with Emily.”\u003c/p\u003e\n\u003cp\u003e“Apparently no one can.” He was looking at Regan when he made that remark.\u003c/p\u003e\n\u003cp\u003eShe didn’t ask him what, if anything, he planned to do about his assistant because he might use that as a bargaining chip to get her to sign the papers. She was happy, though, to know that he was aware he had a problem.\u003c/p\u003e\n\u003cp\u003eHer brother nudged her shoulder as he walked by. “I left the papers on your desk. Sign them.”\u003c/p\u003e\n\u003cp\u003e“Triple my budget and I will.”\u003c/p\u003e\n\u003cp\u003e“That’s not going to happen.”\u003c/p\u003e\n\u003cp\u003eAs soon as Aiden was out of earshot, Henry whispered, “He’s never going to go for triple. That was reaching.”\u003c/p\u003e\n\u003cp\u003e“I know he won’t. So we’ll negotiate, and we’ll get double, which is what we want.”\u003c/p\u003e\n\u003cp\u003eHenry shook his head. “Aiden’s got to know what you’re up to.”\u003c/p\u003e\n\u003cp\u003e“Of course he knows,” she said. “But he’ll still give in to us. At least I hope he will.”\u003c/p\u003e\n\u003cp\u003e“He acts like he doesn’t care about the job we do, but he does care, doesn’t he? It’s not just about a tax write-off.”\u003c/p\u003e\n\u003cp\u003e“No, he cares, and so does Spencer. They’re just so busy building their empire, they don’t have time for anything else.” She glanced around the office. “Henry, who were you talking to when I was inside with Spencer and Aiden?”\u003c/p\u003e\n\u003cp\u003e“Alec.”\u003c/p\u003e\n\u003cp\u003e“Alec was here?”\u003c/p\u003e\n\u003cp\u003eHer reaction to the news was bizarre. She could feel herself blushing, and she hoped Henry wouldn’t notice. She tried to sound nonchalant when she asked, “Did Alec happen to overhear any of the conversation?”\u003c/p\u003e\n\u003cp\u003eHenry smiled. “Are you asking me if he heard you and Spencer shouting?”\u003c/p\u003e\n\u003cp\u003eSo much for trying to act nonchalant. “Yes, that’s exactly what I’m asking.”\u003c/p\u003e\n\u003cp\u003e“I know he heard some of it because he started laughing,” he said. “But I don’t remember how much. Why? Is that important?”\u003c/p\u003e\n\u003cp\u003eShe shook her head and then decided to change the subject. “You know what? I should have talked to Aiden about Emily. He needs to know how much trouble she’s causing, and I want him to know I don’t like the way she blames you for her mistakes.”\u003c/p\u003e\n\u003cp\u003e“You heard Aiden. He’s going to do something about her. I hope he follows Cordie’s suggestion.”\u003c/p\u003e\n\u003cp\u003e“And that was?”\u003c/p\u003e\n\u003cp\u003e“Fire her ass.”\u003c/p\u003e\n\u003cp\u003eRegan tried not to laugh. “Those were her exact words, weren’t they?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Shame on her, corrupting a young, impressionable boy.”\u003c/p\u003e\n\u003cp\u003eHenry laughed. “I’ve heard worse.”\u003c/p\u003e\n\u003cp\u003eRegan went back into her office and closed the doors. She was feeling horribly nervous and thought she would hide until she had rehearsed what she was going to say to Alec about last night. Maybe he wouldn’t bring it up. Then again, maybe he would, and she wanted to be prepared.\u003c/p\u003e\n\u003cp\u003eShe knew she was being foolish. What happened last night wouldn’t happen again; they had agreed on that, and Alec surely wouldn’t mention it today. Besides, he was on duty. He probably wouldn’t even be thinking about it.\u003c/p\u003e\n\u003cp\u003e“I can do this,” she whispered.\u003c/p\u003e\n\u003cp\u003eShe took a deep breath, straightened her shoulders, and opened the door again. She was going to find Alec and say hello. The sooner she got through the awkwardness of seeing him for the first time after … oh, God, she was doing it again. Getting all flustered and panicky. If this is what love felt like, she didn’t want any part of it. She certainly didn’t want the broken heart she knew was coming either, but she couldn’t do anything about that now, could she? She had no one to blame for that misery but herself.\u003c/p\u003e\n\u003cp\u003eShe walked past Henry and said, “Go have some fun. It’s Sunday. The mail will be here tomorrow.”\u003c/p\u003e\n\u003cp\u003e“I’m leaving,” he promised. “I just want to do a little catch-up. I won’t stay long.”\u003c/p\u003e\n\u003cp\u003eTime to get the moment over with, she thought as she walked out into the hall. She stopped short. Aiden and Alec were standing in front of Aiden’s office at the end of the hallway. Aiden was doing most of the talking, and Alec was nodding every now and then. She stood there a long minute, waiting until they finished their conversation. She assumed Aiden wanted the latest update on the investigation.\u003c/p\u003e\n\u003cp\u003eThey both noticed her at the same time. Aiden nodded, then walked around the corner to the elevators. Alec started toward her.\u003c/p\u003e\n\u003cp\u003eHe looked wonderful. And sloppy, of course, but comfortable sloppy. He had a five o’clock shadow, so he hadn’t bothered to shave this morning. And did he ever comb his hair? No man should be this sexy. She swallowed and tried to block out the memories of last night. What was it she was going to say to him when she saw him? What had she come up with? She couldn’t remember. She had to look over his shoulder in order to concentrate.\u003c/p\u003e\n\u003cp\u003e“I thought you weren’t coming in today.”\u003c/p\u003e\n\u003cp\u003eGood. That worked. She’d sounded quite normal, and she was sure nothing of what she was feeling was showing in her face.\u003c/p\u003e\n\u003cp\u003e“I told you I was.”\u003c/p\u003e\n\u003cp\u003eShe nodded. Okay. The awkward moment was over. They were now having a normal conversation. She began to relax. Definitely okay. He wasn’t going to say anything about last night, and neither was she. She could stop worrying.\u003c/p\u003e\n\u003cp\u003e“Regan?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Did it feel good?”\u003c/p\u003e\n\u003cp\u003eShe was mortified. She knew her mouth dropped open. The question so shocked her. She couldn’t believe what he’d just asked, and so she made him repeat it.\u003c/p\u003e\n\u003cp\u003e“I asked you if it felt good.”\u003c/p\u003e\n\u003cp\u003eIn seconds her face was burning with embarrassment. “Alec, I think it would be best if we didn’t discuss last night.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “I was asking if it felt good to stand up for yourself with your brothers.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Instantly flustered, she said, “Yes, of course it felt … wait a minute. You did that on purpose, didn’t you?”\u003c/p\u003e\n\u003cp\u003eHe pretended not to know what she was talking about. “Did what?”\u003c/p\u003e\n\u003cp\u003e“Phrasing the question the way you did, asking if it felt good but not explaining … oh, never mind.”\u003c/p\u003e\n\u003cp\u003eHe loved how easily he could embarrass her. “So did it?”\u003c/p\u003e\n\u003cp\u003eShe sighed. “Yes. I think maybe fighting with my brothers occasionally is a nice outlet for all my pent-up nervous energy.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I think maybe we found a better outlet last night.” He grinned as he added, “and I’m not going to ask you if that felt good. I know it did.”\u003c/p\u003e\n\u003cp\u003eHis arrogance was totally out of control, and he certainly didn’t seem to need any confirmation from her. But then, why would he? Last night had been incredible. He didn’t need her to tell him so. He was there, after all. Oh, boy, was he.\u003c/p\u003e\n\u003cp\u003eShe really needed to think about something else … anything else. She wanted to kiss him. She stepped back instead. “I think we should change the subject.”\u003c/p\u003e\n\u003cp\u003e“Yes, okay.”\u003c/p\u003e\n\u003cp\u003e“And please, stop looking at me that way,” she whispered.\u003c/p\u003e\n\u003cp\u003e“What way?”\u003c/p\u003e\n\u003cp\u003e“Like you’d like to find the nearest closet.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t thinking closet. I was thinking—”\u003c/p\u003e\n\u003cp\u003eShe interrupted. “We are finished talking about this.” She folded her arms across her waist. “Okay?”\u003c/p\u003e\n\u003cp\u003eBefore he could argue, she asked, “What were you and Aiden talking about?”\u003c/p\u003e\n\u003cp\u003e“I asked him if there were any grudges against your family, any disgruntled employees, any threats, lawsuits, et cetera. He said he’d already talked to Wincott about that, but he’d set it up for us to talk to your family attorney. I’m just trying to cover all the angles, and I want to know what the legal problems have been.”\u003c/p\u003e\n\u003cp\u003e“With my brothers?”\u003c/p\u003e\n\u003cp\u003e“And you.”\u003c/p\u003e\n\u003cp\u003e“Oh.” She was taken aback by that admission. “I doubt you’ll find anything.”\u003c/p\u003e\n\u003cp\u003e“I’m still going to talk to Sam.”\u003c/p\u003e\n\u003cp\u003e“Yes, of course.”\u003c/p\u003e\n\u003cp\u003e“Are you hungry? You want to get something to eat?”\u003c/p\u003e\n\u003cp\u003eThe abrupt change in subjects jarred her. “Yes … okay.”\u003c/p\u003e\n\u003cp\u003eShe walked around him and headed for the elevators. He caught up with her in two strides. “By the way, the answer is yes.”\u003c/p\u003e\n\u003cp\u003eShe glanced up at him. “What was the question?”\u003c/p\u003e\n\u003cp\u003e“You asked your brothers if anyone was ever faithful, and I’m telling you yes, some are.”\u003c/p\u003e\n\u003cp\u003eShe reached to push the button for the elevator. He grabbed her hand and forced her to look at him. “I’ve got a lot of examples,” he said softly. “But there’s only one you need to know about.”\u003c/p\u003e\n\u003cp\u003e“Oh? Who?”\u003c/p\u003e\n\u003cp\u003e“Me.”\u003c/p\u003e\n\u003cp\u003eShe didn’t know how to respond. “Why are you telling me this?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I don’t know. I just thought you ought to know that I’d be faithful.”\u003c/p\u003e\n\u003cp\u003e“If you ever married.”\u003c/p\u003e\n\u003cp\u003e“That’s right,” he replied. “If”\u003c/p\u003e\n\u003cp\u003eThe conversation was cut short when his cell phone rang. Henry was calling, and he sounded frantic.\u003c/p\u003e\n\u003cp\u003e“Where are you?”\u003c/p\u003e\n\u003cp\u003e“Right down the hall. What’s going on?”\u003c/p\u003e\n\u003cp\u003e“You’ve got to get back here right away. You’ve got to see this.”\u003c/p\u003e\n\u003cp\u003eAlec had already turned around and was pulling Regan along as he strode back to the offices.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003eHe didn’t need to answer her because Henry was standing in the doorway, and as soon as he spotted Alec and Regan coming around the corner, he blurted, “I opened this letter. It’s on our hotel stationery, and it came in one of our envelopes. You know what that means? He was here. He was in the hotel.”\u003c/p\u003e\n\u003cp\u003eAlec let go of her hand and went to the desk. She touched Henry’s arm and said, “Take a deep breath.”\u003c/p\u003e\n\u003cp\u003e“Regan, he was here.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Yes, I heard you. And he sent a letter?” she asked, but she was already walking over to his desk.\u003c/p\u003e\n\u003cp\u003eShe leaned against Alec and looked at the sheet of stationery Henry had put on the blotter. He’d placed a long silver letter opener on the edge of the paper to keep it from folding up again.\u003c/p\u003e\n\u003cp\u003eIt wasn’t a letter, though. It was another murder list. This one had a different heading. “Our Murder List” was written on top of the paper, and the Our was underlined several times. The killer had hand-printed this one. All of the names on the list were there, but lines had been drawn through Ms. Patsy’s name and Detective Sweeney’s. There were question marks next to Shields’s name and the references to the two bodyguards.\u003c/p\u003e\n\u003cp\u003eAnother name had been added to the list. Haley Cross. On the bottom, just below her name, he’d written, “You owe me for this one too.”\u003c/p\u003e\n\u003cp\u003eAlec was on his cell phone dialing Wincott. While he was waiting for the detective to answer, he asked Regan, “Did you know this woman?”\u003c/p\u003e\n\u003cp\u003eShe didn’t pick up on the fact that he’d asked about the woman in the past tense.\u003c/p\u003e\n\u003cp\u003e“No,” she said. “Alec, we have to warn her. Oh, dear God, the police need to find her before …”\u003c/p\u003e\n\u003cp\u003eHenry pointed to the paper. His voice was shaking when he said, “There’s a line through her name, Regan, like he’s already … you know … killed her.”\u003c/p\u003e\n\u003cp\u003e“Henry, we cannot assume just because he’s put a line through her name that she’s dead. He might not have … Oh, God.” She could feel the panic building inside. “There has to be time to save her.”\u003c/p\u003e\n\u003cp\u003eWincott answered the phone, and Alec let go of Regan and walked toward the hallway as he explained what Henry had found.\u003c/p\u003e\n\u003cp\u003eRegan was feeling sick to her stomach. She leaned against Henry’s desk and stared at the wall. “I don’t understand,” she whispered. “Why would he send me this? And what in God’s name does he mean by ‘Our Murder List’?”\u003c/p\u003e\n\u003cp\u003e“Haley Cross. I swear I’ve heard that name before, but I can’t remember where.”\u003c/p\u003e\n\u003cp\u003eAlec ended the call and walked back into the office. “Wincott and Bradshaw are on their way over.”\u003c/p\u003e\n\u003cp\u003e“On Sunday?” Henry realized how foolish the question was as soon as the words were out of his mouth.\u003c/p\u003e\n\u003cp\u003e“John was at work, but Bradshaw was home.”\u003c/p\u003e\n\u003cp\u003e“Are they going to look for the woman? Are they …”\u003c/p\u003e\n\u003cp\u003eAlec put his arm around her. “It’s too late.”\u003c/p\u003e\n\u003cp\u003eShe jerked away. His quick acceptance that the girl was dead infuriated her. “You can’t know that. If they could just warn her … if they could find her and …”\u003c/p\u003e\n\u003cp\u003eAlec rubbed the knot in the back of his neck while he watched her pace. “They know where she is.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“In the morgue.”\u003c/p\u003e\n\u003cp\u003e“Oh, God.”\u003c/p\u003e\n\u003cp\u003eShe sagged against Alec, bowed her head, and closed her eyes. He wrapped his arms around her and held her close. Henry had all but fallen into his chair.\u003c/p\u003e\n\u003cp\u003e“How did he kill her?” he asked.\u003c/p\u003e\n\u003cp\u003eAlec was staring at the article on the wall behind Henry’s head. It all suddenly clicked. He didn’t answer Henry’s question, but said, “She was running on the path in—”\u003c/p\u003e\n\u003cp\u003e“Conrad Park,” Henry blurted. “That’s where I read the name. Regan, don’t you remember? I told you about it. At least I think I told you.”\u003c/p\u003e\n\u003cp\u003eAlec walked over to read the article again. “You’re quoted here as saying you run there at least three nights a week.”\u003c/p\u003e\n\u003cp\u003e“Yes, I did.”\u003c/p\u003e\n\u003cp\u003e“But then the track was finished upstairs,” Henry said.\u003c/p\u003e\n\u003cp\u003eAlec got Wincott on the phone again. “Where are you?”\u003c/p\u003e\n\u003cp\u003e“Getting out of the car in front of the hotel.”\u003c/p\u003e\n\u003cp\u003e“What was the physical description of Haley Cross?”\u003c/p\u003e\n\u003cp\u003e“I’ve got some copies of the file with me, and I’ve got her photo. Hang on, Alec, I’ll be right there.” \u003c/p\u003e","sourceLink":"https://allnovel.net/murder-list-buchanan-renard-4/page-38.html","bookId":2674,"creation":"Oct 5, 2019 10:02:32 AM","modification":"Oct 5, 2019 10:02:32 AM"}
