{"id":66864,"no":45,"title":"Page 45","content":"\u003cp\u003eWincott stood and stretched. “That’s about it.”\u003c/p\u003e\n\u003cp\u003eSophie also stood. “I’m going home. You scared me to death today, Regan. I swear it’s going to take me a week of shopping to get over it.”\u003c/p\u003e\n\u003cp\u003e“Am I supposed to apologize?”\u003c/p\u003e\n\u003cp\u003eSophie grinned. “If you want to.”\u003c/p\u003e\n\u003cp\u003e“Sophie, you have to drive me home,” Cordie said. “And if Regan apologizes to anyone, it should be me. I didn’t want to walk in that race anyway. If you’ll remember, I suggested we go to the frozen custard shop.”\u003c/p\u003e\n\u003cp\u003e“No, we were supposed to meet there after the race,” Sophie said.\u003c/p\u003e\n\u003cp\u003eThey were arguing as they walked out of the suite. Wincott said good-bye, shook hands with her brothers, and also left. Alec followed him.\u003c/p\u003e\n\u003cp\u003e“Hey, John, hold up. I want to run something by you.”\u003c/p\u003e\n\u003cp\u003eAiden and Spencer also headed for the door. “Are you going to be okay tonight?” Spencer asked Regan.\u003c/p\u003e\n\u003cp\u003e“I’ll be fine.”\u003c/p\u003e\n\u003cp\u003eShe walked over to Aiden and nudged him in his back as he was walking out the door. “You want to hear something funny?”\u003c/p\u003e\n\u003cp\u003e“I could use a laugh about now.”\u003c/p\u003e\n\u003cp\u003e“You know that little problem I had?”\u003c/p\u003e\n\u003cp\u003e“Which little problem?” He made it sound as though she had too many problems for him to keep track of.\u003c/p\u003e\n\u003cp\u003e“The problem with sleazebags.”\u003c/p\u003e\n\u003cp\u003e“You mean old men marrying young women?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I remember telling you to get over it.”\u003c/p\u003e\n\u003cp\u003e“I did get over it, but that’s how I noticed Eric Gage. There was this older man with this very young woman walking across the street. I, of course, homed right in on them. Old habits die hard,” she explained. “And I was thinking that I shouldn’t react with such disgust, just because … well, let’s face it, he was a sleaze-bag.”\u003c/p\u003e\n\u003cp\u003e“Oh, yes, I can tell you’ve gotten over your problem.”\u003c/p\u003e\n\u003cp\u003e“If I didn’t have that problem, I wouldn’t have noticed him. That’s all I’m trying to say.”\u003c/p\u003e\n\u003cp\u003e“And did noticing him in any way affect what happened later?”\u003c/p\u003e\n\u003cp\u003eShe knew where he was headed and was sorry she’d started the conversation.\u003c/p\u003e\n\u003cp\u003e“Never mind.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “You know what, Regan?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe tweaked her nose just to aggravate her and said, “We love you. You know that, don’t you?”\u003c/p\u003e\n\u003cp\u003eShe nodded and became teary-eyed again. “Does that mean you’ll triple my budget next year?”\u003c/p\u003e\n\u003cp\u003e“No, it means we love you. But nice try.”\u003c/p\u003e\n\u003cp\u003eAlec had walked with Wincott to the elevator and was on his way back to the suite when Aiden stopped him. Spencer was in the doorway talking to Regan.\u003c/p\u003e\n\u003cp\u003eNeither Aiden nor Alec minced words.\u003c/p\u003e\n\u003cp\u003e“What’s going on with my sister?”\u003c/p\u003e\n\u003cp\u003e“I’m going to marry her.”\u003c/p\u003e\n\u003cp\u003e“You are?”\u003c/p\u003e\n\u003cp\u003eAlec nodded. “It’s going to take some time for me to convince her, but I’ll eventually wear her down.”\u003c/p\u003e\n\u003cp\u003eAiden obviously approved. He shook Alec’s hand, looked at Regan, and said, “I don’t think it will take too long.”\u003c/p\u003e\n\u003cp\u003eSpencer joined them, and Alec told him his intentions. Spencer was more protective and reserved. “If you ever make my sister cry …” He suddenly stopped. He glanced at Regan just as she wiped a tear away from her cheek and said, “Never mind.”\u003c/p\u003e\n\u003cp\u003eRegan waited for Alec. She stood in the doorway and watched him walk toward her.\u003c/p\u003e\n\u003cp\u003eHe thought she looked as if she wanted to give him hell.\u003c/p\u003e\n\u003cp\u003e“I want to thank you for your help today,” she said.\u003c/p\u003e\n\u003cp\u003eHe smiled. “Okay.”\u003c/p\u003e\n\u003cp\u003e“You saved my life.”\u003c/p\u003e\n\u003cp\u003e“You saved mine.”\u003c/p\u003e\n\u003cp\u003e“Then we’re even.”\u003c/p\u003e\n\u003cp\u003eShe stepped back and had every intention of shutting the door in his face just to let him know how upset she was, but his next question stopped her.\u003c/p\u003e\n\u003cp\u003e“How come you’re so cranky?”\u003c/p\u003e\n\u003cp\u003eShe swung the door wide and stepped forward again. “I am not cranky. I assume you’ll be going on your way now … you know, going forward” she stressed. “And I want to wish you good luck with your career.”\u003c/p\u003e\n\u003cp\u003e“Really.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eHe started to reach for her, but she put her hand up and shook her head.\u003c/p\u003e\n\u003cp\u003e“I am not going to let you break my heart again. You listen to me, Alec. You can’t tell me you’re leaving and then come back and put your arms around me and … you just can’t.” She was just warming up. She folded her arms across her chest. “You’re moving forward, remember. That’s what you told me. So go ahead, Alec. Go forward, right out the door.”\u003c/p\u003e\n\u003cp\u003eShe was ready for a fight, but he didn’t play fair.\u003c/p\u003e\n\u003cp\u003e“I love you, Regan.”\u003c/p\u003e\n\u003cp\u003eShe blinked. “No.”\u003c/p\u003e\n\u003cp\u003eHis grin was adorable. “Yeah, I do. I love you.”\u003c/p\u003e\n\u003cp\u003eShe wouldn’t believe him. “But ‘If I’m ever in Boston’ … you said, ‘If I’m ever in Boston’ …”\u003c/p\u003e\n\u003cp\u003e“I’m not going anywhere without you.”\u003c/p\u003e\n\u003cp\u003eShe was determined to make him squirm a little before she forgave him. But her heart belonged to him.\u003c/p\u003e\n\u003cp\u003eShe stepped back and said, “If you’re ever in Chicago …”\u003c/p\u003e\n\u003cp\u003eShe tried to shut the door. His foot got in the way. He was laughing when he backed her up and then shut the door behind him.\u003c/p\u003e\n\u003cp\u003e“Maybe you didn’t notice …”\u003c/p\u003e\n\u003cp\u003eOh, but she loved him. “Yes?”\u003c/p\u003e\n\u003cp\u003e“I’m already here.”\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eALEC WAS TAKING REGAN HOME TO MEET HIS FAMILY. SHE WAS nervous and worried they might not like her. He thought that was the craziest thing he’d ever heard. He couldn’t imagine why she was feeling so insecure, but he did his best to reassure her as they walked side by side through the airport.\u003c/p\u003e\n\u003cp\u003eThey were an odd-looking couple. Alec had let his hair and his beard grow for an undercover assignment he’d just completed for the Bureau, and he hadn’t had time to shave and get a haircut. He’d showered and put on his comfortable off-duty uniform, a T-shirt and worn-out jeans.\u003c/p\u003e\n\u003cp\u003eRegan was picture-perfect. She wore a pink blouse, a short khaki skirt, and sandals. Her only jewelry was a pair of tiny diamond studs and her engagement ring.\u003c/p\u003e\n\u003cp\u003eShe looked like a cover girl. He looked like a serial killer.\u003c/p\u003e\n\u003cp\u003eMen tried to make eye contact with her, and women tried not to scream when they looked at him.\u003c/p\u003e\n\u003cp\u003eThey were seated in the last row of first class, which afforded them a little privacy, and as soon as the seat belt light went off, he leaned across the armrest and kissed her. He took his time, deliberately trying to fluster her. Then he told her how much he loved her.\u003c/p\u003e\n\u003cp\u003e“You know what people are thinking when they see us together?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she whispered. “They’re thinking how lucky I am.”\u003c/p\u003e\n\u003cp\u003e“That’s right. That’s exactly what they’re thinking.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “You’d better remove that earring before your brothers see it. From what you’ve told me about them, they’ll be merciless ribbing you.”\u003c/p\u003e\n\u003cp\u003e“I’ll let them have some fun. Then I’ll take if off.”\u003c/p\u003e\n\u003cp\u003e“Did you have a chance to read Sophie’s follow-up article about Shields yet?”\u003c/p\u003e\n\u003cp\u003e“Yes, I did. She did a great job.”\u003c/p\u003e\n\u003cp\u003e“She’s very talented. Does that surprise you?”\u003c/p\u003e\n\u003cp\u003eHe stretched his legs out, adjusted his seat, and took hold of her hand. “Sweetheart, after finding out that she’s Bobby Rose’s daughter, nothing she does will surprise me. Tell me how you met Cordie and Sophie. I know you became friends in school …”\u003c/p\u003e\n\u003cp\u003e“Spencer told you about the bully, didn’t he?”\u003c/p\u003e\n\u003cp\u003e“No, he said to make you tell me.”\u003c/p\u003e\n\u003cp\u003e“It all started with a pair of barrettes,” she began, and then she told him the story of Morgan the Bully. Alec thought it was hilarious that Regan had thrown up on the girl.\u003c/p\u003e\n\u003cp\u003e“Did she leave you and your friends alone after that?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “I haven’t seen her in years.”\u003c/p\u003e\n\u003cp\u003e“I wonder what happened to her.”\u003c/p\u003e\n\u003cp\u003e“Oh, I know what happened. She went into politics. She’s a senator now.”\u003c/p\u003e\n\u003cp\u003eHe laughed again, sure she was joking.\u003c/p\u003e\n\u003cp\u003eShe loved the way he laughed. She loved just about everything about him. He had walked into her office and forever changed her life.\u003c/p\u003e\n\u003cp\u003eThe man of her dreams was falling asleep. “Alec?”\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003e“When are you going to show me Nick’s town house?”\u003c/p\u003e\n\u003cp\u003e“It’s our town house now,” he corrected. “We could go over tomorrow if you want, and if you don’t like it, we’ll put it on the market and look for something else.”\u003c/p\u003e\n\u003cp\u003e“I’ll like it.”\u003c/p\u003e\n\u003cp\u003e“It’s got enough bedrooms for your friends. I know you’re going to miss them.”\u003c/p\u003e\n\u003cp\u003eShe would miss seeing them, but she knew she’d continue to talk to them every day.\u003c/p\u003e\n\u003cp\u003e“I’ll be going back and forth for a couple of months, until Paul and Henry don’t need me anymore.”\u003c/p\u003e\n\u003cp\u003e“How did Henry take the news that you’ll be working out of the Boston hotel?”\u003c/p\u003e\n\u003cp\u003e“Same way your friend took the news when you told him you were going into the FBI.”\u003c/p\u003e\n\u003cp\u003e“So he cried like a baby too, huh?”\u003c/p\u003e\n\u003cp\u003e“I forgot to tell you the news. Your computer tech is now working for the Hamilton.”\u003c/p\u003e\n\u003cp\u003e“Melissa took the job?”\u003c/p\u003e\n\u003cp\u003eRegan smiled. “Aiden didn’t know what to make of her. She told him she wanted to replace all of our ‘piece of junk’ computers.”\u003c/p\u003e\n\u003cp\u003e“‘Junk’? She said ‘junk’?”\u003c/p\u003e\n\u003cp\u003e“She’s working on her language skills.”\u003c/p\u003e\n\u003cp\u003eRegan was telling him about the improvements she was going to make in the office she was setting up at the hotel in Boston. She stopped when she realized Alec had fallen asleep.\u003c/p\u003e\n\u003cp\u003eShe kissed his cheek. “I love you, Alec.”\u003c/p\u003e\n\u003cp\u003eNow and forever. \u003c/p\u003e","sourceLink":"https://allnovel.net/murder-list-buchanan-renard-4/page-45.html","bookId":2674,"creation":"Oct 5, 2019 10:02:32 AM","modification":"Oct 5, 2019 10:02:32 AM"}
