{"id":66825,"no":6,"title":"Page 6","content":"\u003cp\u003e“Lecher,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Doing a little gardening?”\u003c/p\u003e\n\u003cp\u003eRegan jumped at the sound of Sophie’s voice. She hastily let go of the fern, dodged another leafy ficus branch, and sat down.\u003c/p\u003e\n\u003cp\u003e“You’re late.”\u003c/p\u003e\n\u003cp\u003eSophie ignored the criticism. “What were you doing? Looking at a gorgeous man, I hope.”\u003c/p\u003e\n\u003cp\u003e“Sorry, no. I was watching another sleazebag.”\u003c/p\u003e\n\u003cp\u003e“So you’re still doing that, huh?”\u003c/p\u003e\n\u003cp\u003eRegan nodded. “I can’t seem to help myself. Honest to heaven, they’re everywhere.”\u003c/p\u003e\n\u003cp\u003eSophie laughed. Regan thought she looked like a young teenager. Her hair was up in a ponytail, and her cheeks were flushed from running. Sophie ran everywhere because she was usually late. She looked lovely today, but then she always did. “Is that a new blouse? I like it.”\u003c/p\u003e\n\u003cp\u003e“I wear too much pink,” Sophie said. “But I saw this and I just had to have it.”\u003c/p\u003e\n\u003cp\u003eThe waiter appeared at the table and took Sophie’s drink order.\u003c/p\u003e\n\u003cp\u003eRegan turned toward the entrance of the restaurant and said, “I can’t believe you beat Cordie here. I wonder what’s keeping her. She’s never late.”\u003c/p\u003e\n\u003cp\u003e“I told her she didn’t need to be here until one or a quarter of,” she said.\u003c/p\u003e\n\u003cp\u003eThe waiter had returned with a tall glass of iced tea. Sophie immediately grabbed three sugar packets and dumped the contents into the glass.\u003c/p\u003e\n\u003cp\u003e“Why did you tell her—”\u003c/p\u003e\n\u003cp\u003e“She already knows what I want to talk to you about. I dragged her into this a good month ago, but I didn’t want to bother you because you were doing so much traveling back then.”\u003c/p\u003e\n\u003cp\u003e“I just went to Rome.”\u003c/p\u003e\n\u003cp\u003e“Excuse me. Before Rome you were in Houston and Miami and …”\u003c/p\u003e\n\u003cp\u003e“L.A.,” she supplied. “I guess I have done a lot of traveling in the last two months. So tell me. What’s the ‘this’ you dragged Cordie into?”\u003c/p\u003e\n\u003cp\u003e“The plan.”\u003c/p\u003e\n\u003cp\u003eShe’d used the word with relish, and Regan saw a gleam in her eyes.\u003c/p\u003e\n\u003cp\u003e“You’re sounding awfully earnest, Sophie. So, tell me about the plan” she added, exaggerating the words.\u003c/p\u003e\n\u003cp\u003e“Don’t mock me.”\u003c/p\u003e\n\u003cp\u003eRegan put a hand up. “I’m not mocking you. I swear it on your iced tea.”\u003c/p\u003e\n\u003cp\u003eThe waiter had heard “iced tea,” and a few seconds later a tall glass was placed before Regan. She didn’t tell the eager man she didn’t want it. She thanked him instead.\u003c/p\u003e\n\u003cp\u003eSophie folded her hands. “To begin with, the plans have changed for this evening.”\u003c/p\u003e\n\u003cp\u003e“We aren’t going to dinner?”\u003c/p\u003e\n\u003cp\u003e“Yes, of course we’re going to dinner. Cordie already made the reservations. We’re going to a reception first.” She turned to her purse and pulled out a wad of folded papers and placed them on the table.\u003c/p\u003e\n\u003cp\u003e“What are those?”\u003c/p\u003e\n\u003cp\u003e“I’ll explain in a minute.”\u003c/p\u003e\n\u003cp\u003e“Okay. Then tell me about the reception.”\u003c/p\u003e\n\u003cp\u003eSophie was frowning at a group of businessmen seated at a long table adjacent to them.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Those men are staring at you.”\u003c/p\u003e\n\u003cp\u003e“They aren’t staring at me. They’re staring at you,” Regan said. “Just ignore them.”\u003c/p\u003e\n\u003cp\u003e“The one on the end is really quite cute.”\u003c/p\u003e\n\u003cp\u003eRegan didn’t look. “Tell me about the reception.”\u003c/p\u003e\n\u003cp\u003eSophie finally gave Regan her full attention. “It’s for the men and women who register early for the weekend seminar we’re all going to attend.”\u003c/p\u003e\n\u003cp\u003eShe’d blurted it all out and then gave Regan her brightest smile. It didn’t work.\u003c/p\u003e\n\u003cp\u003e“Can’t do it.”\u003c/p\u003e\n\u003cp\u003e“Sure you can. You’re all stressed out from the trip to Rome, and having to be in the same room with your sleazebag stepfather—to borrow your opinion of the man. This is something completely different and … noble. Yes, what we’re going to do is noble.”\u003c/p\u003e\n\u003cp\u003e“How noble?”\u003c/p\u003e\n\u003cp\u003eSophie leaned forward. In a whisper she said, “We’re going to catch a murderer.”\u003c/p\u003e\n\u003cp\u003eChapter Five\u003c/p\u003e\n\u003cp\u003eREGAN HADN’T BEEN SHOCKED BY SOPHIE’S ANNOUNCEMENT. After all, she’d grown up with her and was certainly used to her dramatic ways. “‘We’re going to catch a murderer’? Is that what you just said?” Regan asked.\u003c/p\u003e\n\u003cp\u003e“Yes, that’s exactly what we’re going to do.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she said. “And how exactly are we going to do that?” “I’m serious, Regan. I really want to get this bastard.” Regan raised an eyebrow. It wasn’t like Sophie to ever curse. “Who are we talking about?”\u003c/p\u003e\n\u003cp\u003e“Dr. Lawrence Shields,” she said. “He’s a doctor of psychology who uses his mail-order credentials to fleece rich but lonely, vulnerable women, both young and old.”\u003c/p\u003e\n\u003cp\u003eRegan was nodding. “Have you heard of him?” Sophie asked.\u003c/p\u003e\n\u003cp\u003e“I’ve read a couple of articles about him in the newspaper.”\u003c/p\u003e\n\u003cp\u003eSophie took a drink of her tea and then said, “His self-help, let-me-show-you-how-to-turn-your-miserable-life-around seminars draw hundreds of unsuspecting men and women. It’s so sad, really. The young are looking for a guru for guidance in figuring out what they should do with their futures, and the older men and women are looking for ways to change the paths they’ve taken.”\u003c/p\u003e\n\u003cp\u003e“I remember reading that Dr. Shields is considered to be a miracle worker.”\u003c/p\u003e\n\u003cp\u003e“He most certainly is not. Those articles and interviews are paid advertisements. Shields spends a considerable amount of money promoting his seminars. He does two a year here in Chicago.”\u003c/p\u003e\n\u003cp\u003eSophie was getting all worked up. The spots of color on her cheeks had spread.\u003c/p\u003e\n\u003cp\u003e“I imagine he makes quite a lot of money on those seminars,” Regan said, wondering how much the man charged for a weekend of group therapy. It was probably exorbitant.\u003c/p\u003e\n\u003cp\u003eHer friend picked up the stack of folded papers and handed them to Regan. “These are photocopies of a diary written by a woman named Mary Coolidge. She’s one of the women Shields conned.”\u003c/p\u003e\n\u003cp\u003e“I’ll read this later,” she promised. “Just give me the highlights now.”\u003c/p\u003e\n\u003cp\u003eSophie agreed with a nod. “Mary Coolidge’s husband died two years ago, and after that, she moved around in a fog of depression. Her daughter, Christine, tried to help, but Mary refused to go to counseling or take medication.”\u003c/p\u003e\n\u003cp\u003e“After you lose someone you love, it’s natural to mourn,” Regan said. “It’s still hard for me to deal with my mother’s death, and she’s been gone almost a full year.”\u003c/p\u003e\n\u003cp\u003e“Yes, it’s natural to mourn, but it took Mary two years before she’d even leave her house.”\u003c/p\u003e\n\u003cp\u003e“So what did she do?” Regan asked. She watched Sophie add yet another packet of sugar to her drink and was a little amazed she could stand the taste.\u003c/p\u003e\n\u003cp\u003e“Mary heard about the seminars Shields held, and without telling her daughter or any of her friends, she paid the thousand-dollar fee and attended the two-day workshop.”\u003c/p\u003e\n\u003cp\u003e“A thousand dollars? How many people attend these workshops?”\u003c/p\u003e\n\u003cp\u003e“Three or four hundred. Why?”\u003c/p\u003e\n\u003cp\u003e“Do you realize how much money he’s taking in?” She leaned back against the padded booth and said, “I’m sorry. I didn’t mean to interrupt. Please continue.”\u003c/p\u003e\n\u003cp\u003e“Shields was as good as his promise. He did change Mary’s life. The charismatic fraud pounced on her loneliness, methodically weaseled his way into her heart, and then took every dollar her husband had left her, which, as it turned out, was well over two million dollars. Shields is a snake,” she added. “But a clever snake. Everything he did was legal. Mary willingly turned her assets over to him.”\u003c/p\u003e\n\u003cp\u003e“And this is all in her diary?” Regan asked.\u003c/p\u003e\n\u003cp\u003eSophie nodded. “Had her daughter not found the thing, she never would have known all the details of what had happened. Mary had written all about her whirlwind romance. Just three short months after meeting Shields, he asked her to marry him and she agreed. He insisted she keep their engagement their little secret until he had the time—and the money—to buy her a proper engagement ring.”\u003c/p\u003e\n\u003cp\u003e“What do you mean, until he had the money? If he was charging—”\u003c/p\u003e\n\u003cp\u003eSophie cut her off. “It was a con, of course. He told her he was experiencing ‘temporary’ money problems, and she, wanting to prove her love and trust, willingly transferred her savings over to him.”\u003c/p\u003e\n\u003cp\u003e“How could she have been so gullible?”\u003c/p\u003e\n\u003cp\u003e“Loneliness,” she said. “You know what happened next, don’t you?”\u003c/p\u003e\n\u003cp\u003e“He changed his mind.”\u003c/p\u003e\n\u003cp\u003e“Exactly,” she said. “He told her he’d had a change of heart. Not only didn’t he want to marry her, he didn’t want to give her the money back. He also pointed out that there really wasn’t anything she could do about it.”\u003c/p\u003e\n\u003cp\u003e“That poor woman.”\u003c/p\u003e\n\u003cp\u003eThe waiter interrupted to take their lunch orders.\u003c/p\u003e\n\u003cp\u003e“I think we should go ahead,” Sophie said. “I can’t take a long lunch today.”\u003c/p\u003e\n\u003cp\u003eRegan checked the time. It wasn’t quite one yet. “I’ll wait for Cordie, but you go ahead.”\u003c/p\u003e\n\u003cp\u003eSophie ordered a salad and a refill on her iced tea. The second the waiter left, Regan asked, “What happened to Mary?”\u003c/p\u003e\n\u003cp\u003e“She killed herself. At least that’s what everyone believes.”\u003c/p\u003e\n\u003cp\u003e“Everyone but you?”\u003c/p\u003e\n\u003cp\u003eShe nodded. She put her napkin down and excused herself. “I’ll explain when I come back.”\u003c/p\u003e\n\u003cp\u003eSophie headed for the ladie’s room, leaving Regan hanging. Regan noticed the men at the table were all watching her friend pass by. Sophie knew it too, which was why she was walking with such an exaggerated stride. It’s all in the hips, she used to tell Cordie and Regan. If you wanted to get a man’s attention, move the hips. And heavens, was she moving them now. It certainly worked for her, Regan thought. She picked up the papers to look them over and happened to glance toward the entrance just as Cordie walked in.\u003c/p\u003e\n\u003cp\u003eEverything about Cordie was a contradiction. Men found her quite sexy because she had an hourglass shape, long dark hair, and moved with the grace of a feline, but she was totally oblivious of any stares of admiration—the men at the table were now gawking at her—and she was far more comfortable underneath a car than inside it. Like Sophie, she was an only child and had lost her mother at an early age. Her father owned an extremely lucrative chain of auto repair shops all through the Midwest. Though he’d become a very wealthy man, in his heart he was still a mechanic, and as a way of bonding with his daughter, had taught her everything he knew about cars. He’d given her an old Ford a couple of years ago, and since then, she had rebuilt the engine and replaced everything but the muffler and the windshield. One night a week Cordie taught an auto mechanics class. She also taught chemistry at a local high school and at the same time was working on her PhD at the university. If she stayed on schedule, she’d be finished with her dissertation in another year.\u003c/p\u003e\n\u003cp\u003eShe was dressed in a black suit and a pale silk blouse. She looked quite chic. If Cordie had any flaws, it was her terrible taste in men.\u003c/p\u003e\n\u003cp\u003eSophie bumped into her on her way back from the ladie’s room. They both stopped to talk to Kevin.\u003c/p\u003e\n\u003cp\u003eRegan watched them, smiling. Sophie was waving her hands around as she explained something. Kevin looked enraptured by whatever she was telling him, while Cordie stood there with her arms folded, nodding every so often.\u003c/p\u003e\n\u003cp\u003eSophie had the most energy of the three friends. Taller than Regan and Cordie, and almost a full year older than the two of them, she believed that since she was the oldest, she should always be in charge. In high school she was labeled a troublemaker—a title she worked hard to earn—and because she dragged Regan and Cordie into her schemes, they landed in detention on a regular basis. Sophie was still bossy, but nowadays, Cordie and Regan rarely went along with any of her plans.\u003c/p\u003e\n\u003cp\u003eRegan had a feeling that this weekend might turn out to be an exception.\u003c/p\u003e\n\u003cp\u003eCordie gave a quick wave as she walked down the aisle and slid into the booth across from Regan. Sophie was still talking to Kevin. His boss, Mr. Laggia, had joined the conversation.\u003c/p\u003e\n\u003cp\u003e“I’m starving,” Cordie said. “And no wonder. It’s one o’clock. Are you ready to order? Sophie said she already did.”\u003c/p\u003e\n\u003cp\u003e“I’m ready. What’s she talking to Kevin and Mr. Laggia about?”\u003c/p\u003e\n\u003cp\u003e“She thinks it would be a nice idea to feature the restaurant again and is going to talk to the food editor about it.”\u003c/p\u003e\n\u003cp\u003eCordie motioned to the waiter, and after the two of them had ordered their lunch, she nodded to the folded papers. “Are those copies of Mary Coolidge’s diary?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Regan answered. “You’ve read it?”\u003c/p\u003e\n\u003cp\u003e“I have. It’s heartbreaking.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you mention any of this when you called?”\u003c/p\u003e\n\u003cp\u003e“I knew Sophie would want to tell you. It’s her plan after all.”\u003c/p\u003e\n\u003cp\u003e“I haven’t heard the plan yet.”\u003c/p\u003e\n\u003cp\u003eCordie smiled. “You will,” she said. “Besides, she already made me promise I’d attend the reception and the weekend seminar, and I knew she was going to rope you into going too. She’s had some hare-brained ideas in the past, but this one is for a good cause.”\u003c/p\u003e\n\u003cp\u003eThe waiter placed the Diet Coke she’d ordered on the table with a bread basket.\u003c/p\u003e\n\u003cp\u003eCordie immediately took a wheat roll and was tearing it apart when Regan said, “If what Sophie has told me about Mary Coolidge is accurate, then Shields should be in prison. Why isn’t he?”\u003c/p\u003e\n\u003cp\u003e“He’s as slick as an eel, that’s why,” she said. “I’ve filed a complaint with the state board hoping they’ll yank his license, and I’m sure others have done the same. Something needs to be done to stop him from preying on other vulnerable women.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand. He’s making a fortune with his seminars,” she said. “Why would he …”\u003c/p\u003e\n\u003cp\u003eShe was searching for the right word. Cordie supplied it. “Fleece? Rob? Steal?”\u003c/p\u003e\n\u003cp\u003e“… fleece lonely women? He doesn’t need the money.”\u003c/p\u003e\n\u003cp\u003e“I don’t think it’s a question of need with him,” she said. “I think he does it for the power it gives him. I think he gets off on it.”\u003c/p\u003e\n\u003cp\u003e“Who’s getting off on what?” Sophie asked as she sat down next to Cordie. “Hand me my iced tea, please.”\u003c/p\u003e\n\u003cp\u003e“We’re talking about why Shields goes after rich, unhappy women,” Cordie said. She handed Sophie her drink as she added, “And I was saying it isn’t about the money.” \u003c/p\u003e","sourceLink":"https://allnovel.net/murder-list-buchanan-renard-4/page-6.html","bookId":2674,"creation":"Oct 5, 2019 10:02:32 AM","modification":"Oct 5, 2019 10:02:32 AM"}
