{"id":74937,"no":10,"title":"Page 10","content":"\u003cp\u003e\"But I think you should know-\"\u003c/p\u003e\n\u003cp\u003e\"And I want you to know, Tom,\" Blackburn said, \"that I don\u0027t have any judgment about what may have happened. That\u0027s not my concern or my interest. I\u0027m just trying to solve a difficult problem for the company.\"\u003c/p\u003e\n\u003cp\u003e\"Phil. Listen. I didn\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003e\"I understand that\u0027s probably how you feel, but-\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t harass her. She harassed me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure,\" Blackburn said, \"it may have .Teemed like that to you at the time, but-\"\u003c/p\u003e\n\u003cp\u003e\"Phil, I\u0027m telling you. She did everything but rape me.\" He paced angrily. \"Phil: .The harassed me.\"\u003c/p\u003e\n\u003cp\u003eBlackburn sighed and sat back in his chair. He tapped his pencil on the corner of his desk. \"I have to tell you frankly, Tom. I find that difficult to believe.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s what happened.\"\u003c/p\u003e\n\u003cp\u003e\"Meredith\u0027s a beautiful woman, Tom. A very vital, sexy woman. I think it\u0027s natural for a man to, uh, lose control.\"\u003c/p\u003e\n\u003cp\u003e\"Phil, you aren\u0027t hearing me. She harassed me.\"\u003c/p\u003e\n\u003cp\u003eBlackburn gave a helpless shrug. \"I hear you, Tom. I just . . . I find that difficult to picture.\"\u003c/p\u003e\n\u003cp\u003e\"Well, she did. You want to hear what really happened last night?\"\u003c/p\u003e\n\u003cp\u003e\"Well.\" Blackburn shifted in his chair. \"Of course I want to hear your version. But the thing is, Tom, Meredith Johnson is very well connected in this company. She has impressed a lot of extremely important people.\"\u003c/p\u003e\n\u003cp\u003e\"You mean Garvin.\"\u003c/p\u003e\n\u003cp\u003e\"Not only Garvin. Meredith has built a power base in several areas.\"\u003c/p\u003e\n\u003cp\u003e\"Conley-White?\"\u003c/p\u003e\n\u003cp\u003eBlackburn nodded. \"Yes. There, too.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t want to hear what I say happened?\"\u003c/p\u003e\n\u003cp\u003e\"Of course I do,\" Blackburn said, running his hands through his hair. \"Absolutely, I do. And I want to be scrupulously fair. But I\u0027m trying to tell you that no matter what we\u0027re going to have to make some transfers here. And Meredith has important allies.\"\u003c/p\u003e\n\u003cp\u003e\"So it doesn\u0027t matter what I say.\"\u003c/p\u003e\n\u003cp\u003eBlackburn frowned, watching him pace. \"I understand that you are upset. I can see that. And you\u0027re a valued person in this company. But what I\u0027m trying to do here Tom is to get you to look at the situation.\"\u003c/p\u003e\n\u003cp\u003e\"What situation?\" Sanders said.\u003c/p\u003e\n\u003cp\u003eBlackburn sighed. \"Were there any witnesses, last night?\" No.\u003c/p\u003e\n\u003cp\u003e\"So it\u0027s your word against hers.\"\u003c/p\u003e\n\u003cp\u003e\"I guess so.\"\u003c/p\u003e\n\u003cp\u003e\"In other words, it\u0027s a pissing match.\"\u003c/p\u003e\n\u003cp\u003e\"So? That\u0027s no reason to assume I\u0027m wrong, and she\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" Blackburn said. \"But look at the situation. A man claiming sexual harassment against a woman is, well, pretty unlikely. I don\u0027t think there\u0027s ever been a case in this company. It doesn\u0027t mean it couldn\u0027t happen. But it does means that it\u0027d be very uphill for you even if Meredith wasn\u0027t so well connected.\" He paused. \"I just don\u0027t want to see you get hurt in this.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve already been hurt.\"\u003c/p\u003e\n\u003cp\u003e\"Again, we\u0027re talking about feelings here. Conflicting claims. And unfortunately, Tom, no witnesses.\" He rubbed his nose, tugged at his lapels.\u003c/p\u003e\n\u003cp\u003e\"You move me out of the APD, and I\u0027m hurt. Because I won\u0027t get to be part of the new company. The company I worked on for twelve years.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s an interesting legal position,\" Blackburn said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not talking about a legal position. I\u0027m talking about-\"\u003c/p\u003e\n\u003cp\u003e\"Look. Tom. Let me review this with Garvin. Meanwhile, why don\u0027t you go off and think this Austin offer over. Think about it carefully. Because no one wins in a pissing match. You may hurt Meredith, but you\u0027ll hurt yourself much more. That\u0027s my concern here, as your friend.\"\u003c/p\u003e\n\u003cp\u003e\"If you were my friend-\" Sanders began.\u003c/p\u003e\n\u003cp\u003e\"I am your friend,\" Blackburn said. \"Whether you know it at this moment, or not.\" He stood up behind his desk. \"You don\u0027t need this splashed all over the papers. Your wife doesn\u0027t need to hear about this, or your kids. You don\u0027t need to be the gossip of Bainbridge for the rest of the summer. That isn\u0027t going to do you any good at all.\"\u003c/p\u003e\n\u003cp\u003e\"I understand that, but-\"\u003c/p\u003e\n\u003cp\u003e\"But we have to face reality, Tom,\" Blackburn said. \"The company is faced with conflicting claims. What\u0027s happened has happened. We have to go on from here. And all I\u0027m saying is, I\u0027d like to resolve this quickly. So think it over. Please. And get back to me.\"\u003c/p\u003e\n\u003cp\u003eAfter Sanders left, Blackburn called Garvin. \"I just talked with him,\" he told Garvin.\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"He says it was the other way around. That she harassed him.\"\u003c/p\u003e\n\u003cp\u003e\"Christ,\" Garvin said. \"What a mess.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. But on the other hand, it\u0027s what you\u0027d expect him to say,\" Blackburn said. \"It\u0027s the usual response in these cases. The man always denies it.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Well. This is dangerous, Phil.\"\u003c/p\u003e\n\u003cp\u003e\"I understand.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want this thing to blow up on us.\"\u003c/p\u003e\n\u003cp\u003e\"No, no.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing more important right now than getting this thing resolved.\"\u003c/p\u003e\n\u003cp\u003e\"I understand, Bob.\"\u003c/p\u003e\n\u003cp\u003e\"You made him the Austin offer?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. He\u0027s thinking it over.\"\u003c/p\u003e\n\u003cp\u003e\"Will he take it?\"\u003c/p\u003e\n\u003cp\u003e\"My guess is no.\"\u003c/p\u003e\n\u003cp\u003e\"And did you push it?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I tried to convey to him that we weren\u0027t going to back down on Meredith. That we were going to support her through this.\"\u003c/p\u003e\n\u003cp\u003e\"Damn right we are,\" Garvin said.\u003c/p\u003e\n\u003cp\u003e\"I think he was clear about that. So let\u0027s see what he says when he comes back to us.\"\u003c/p\u003e\n\u003cp\u003e\"He wouldn\u0027t go off and file, would he?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s too smart for that.\" \"We hope,\" Garvin said irritably, and hung up.\u003c/p\u003e\n\u003cp\u003eLook at the .situation.\u003c/p\u003e\n\u003cp\u003eSanders stood in Pioneer Park and leaned against a pillar, staring at the light drizzle. He was replaying the meeting with Blackburn.\u003c/p\u003e\n\u003cp\u003eBlackburn hadn\u0027t even been willing to listen to Sanders\u0027s version. He hadn\u0027t let Sanders tell him. Blackburn already knew what had happened.\u003c/p\u003e\n\u003cp\u003eShe\u0027s a very sexy woman. It\u0027s natural for a man to lose control.\u003c/p\u003e\n\u003cp\u003eThat was what everyone at DigiCom would think. Every single person in the company would have that view of what had happened. Blackburn had said he found it difficult to believe that Sanders had been harassed. Others would find it difficult, too.\u003c/p\u003e\n\u003cp\u003eBlackburn had told him it didn\u0027t matter what happened. Blackburn was telling him that Johnson was well connected, and that nobody would believe a man had been harassed by a woman.\u003c/p\u003e\n\u003cp\u003eLook at the .situation.\u003c/p\u003e\n\u003cp\u003eThey were asking him to leave Seattle, leave the APG. No options, no big payoff. No return for his twelve long years of work. All that was gone.\u003c/p\u003e\n\u003cp\u003eAustin. Baking hot, dry, brand-new.\u003c/p\u003e\n\u003cp\u003eSusan would never accept it. Her practice in Seattle was successful; she had spent many years building it. They had just finished remodeling the house. The kids liked it here. If Sanders even suggested a move, Susan would be suspicious. She\u0027d want to know what was behind it. And sooner or later, she would find out. If he accepted the transfer, he would be confirming his guilt to his wife.\u003c/p\u003e\n\u003cp\u003eNo matter how he thought about it, how he tried to put it together in his mind, Sanders could see no good outcome. He was being screwed.\u003c/p\u003e\n\u003cp\u003eI\u0027m your friend, Tom. Whether you know it right now or not.\u003c/p\u003e\n\u003cp\u003eHe recalled the moment at his wedding when Blackburn, his best man, said he wanted to dip Susan\u0027s ring in olive oil because there was always a problem about getting it on the finger. Blackburn in a panic, in case some little moment in the ceremony went wrong. That was Phil: always worried about appearances.\u003c/p\u003e\n\u003cp\u003eYour wife doesn\u0027t need to hear about this.\u003c/p\u003e\n\u003cp\u003eBut Phil was screwing him. Phil, and Garvin behind him. They were both screwing him. Sanders had worked hard for the company for many years, but now they didn\u0027t give a damn about him. They were taking Meredith\u0027s side, without any question. They didn\u0027t even want to hear his version of what had happened.\u003c/p\u003e\n\u003cp\u003eAs Sanders stood in the rain, his sense of shock slowly faded. And with it, his sense of loyalty. He started to get angry.\u003c/p\u003e\n\u003cp\u003eHe took out his phone and placed a call.\u003c/p\u003e\n\u003cp\u003e\"Mr. Perry\u0027s office.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Tom Sanders calling.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Mr. Perry is in court. Can I give him a message?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe you could help me. The other day he mentioned that you have a woman there who handles sexual harassment cases.\"\u003c/p\u003e\n\u003cp\u003e\"We have several attorneys who do that, Mr. Sanders.\"\u003c/p\u003e\n\u003cp\u003e\"He mentioned a Hispanic woman.\" He was trying to remember what else Perry had said about her. Something about being sweet and demure? He couldn\u0027t recall for sure.\u003c/p\u003e\n\u003cp\u003e\"That would be Ms. Fernandez.\"\u003c/p\u003e\n\u003cp\u003e\"I wonder if you could connect me,\" Sanders said.\u003c/p\u003e\n\u003cp\u003eFernandez\u0027s office was small, her desk stacked high with papers and legal briefs in neat piles, a computer terminal in the corner. She stood up as he came in. \"You must be Mr. Sanders.\"\u003c/p\u003e\n\u003cp\u003eShe was a tall woman in her thirties, with straight blond hair and a handsome, aquiline face. She was dressed in a pale, cream-colored suit. She had a direct manner and a firm handshake. \"I\u0027m Louise Fernandez. How can I help you?\"\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t at all what he had expected. She wasn\u0027t sweet and demure at all. And certainly not Hispanic. He was so startled that without thinking he said, \"You\u0027re not what I\"\u003c/p\u003e\n\u003cp\u003e\"Expected?\" She raised an eyebrow. \"My father\u0027s from Cuba. We left there when I was a child. Please sit down, Mr. Sanders.\" She turned and walked back around her desk.\u003c/p\u003e\n\u003cp\u003eHe sat down, feeling embarrassed. \"Anyway, thank you for seeing me so quickly.\"\u003c/p\u003e\n\u003cp\u003e\"Not at all. You\u0027re John Perry\u0027s friend?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. He mentioned the other day that you, uh, specialized in these cases.\"\u003c/p\u003e\n\u003cp\u003e\"I do labor law, primarily constructive termination and Title VII suits.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" He felt foolish that he had come. He was taken aback by her brisk manner and elegant appearance. In fact, she reminded him very much of Meredith. He felt certain that she would not be sympathetic to his case.\u003c/p\u003e\n\u003cp\u003eShe put on horn-rimmed glasses and peered at him across the desk. \"Have you eaten? I can get you a sandwich if you like.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not hungry, thanks.\"\u003c/p\u003e\n\u003cp\u003eShe pushed a half-eaten sandwich to the side of her desk. \"I\u0027m afraid I have a court appearance in an hour. Sometimes things get a bit rushed.\" She got out a yellow legal pad and set it before her. Her movements were quick, decisive.\u003c/p\u003e\n\u003cp\u003eSanders watched her, sure she was the wrong person. He should never have come here. It was all a mistake. He looked around the office. There was a neat stack of bar charts for a courtroom appearance.\u003c/p\u003e\n\u003cp\u003eFernandez looked up from the pad, her pen poised. It was one of those expensive fountain pens. \"Would you like to tell me the situation?\"\u003c/p\u003e\n\u003cp\u003e\"Uh . . . I\u0027m not sure where to begin.\"\u003c/p\u003e\n\u003cp\u003e\"We could start with your full name and address, and your age.\"\u003c/p\u003e\n\u003cp\u003e\"Thomas Robert Sanders.\" He gave his address.\u003c/p\u003e\n\u003cp\u003e\"And your age?\" \"Forty-one.\"\u003c/p\u003e\n\u003cp\u003e\"Occupation?\" \"I\u0027m a division manager at Digital Communications. The Advanced Products Division.\"\u003c/p\u003e\n\u003cp\u003e\"How long have you been at that company?\"\u003c/p\u003e\n\u003cp\u003e\"Twelve years.\" \"Uh-huh. And in your present capacity?\"\u003c/p\u003e\n\u003cp\u003e\"Eight years.\" \"And why are you here today, Mr. Sanders?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been sexually harassed.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh.\" She showed no surprise. Her expression was completely neutral. \"You want to tell me the circumstances?\"\u003c/p\u003e\n\u003cp\u003e\"My boss, ah, came on to me.\" \"And the name of your boss?\"\u003c/p\u003e\n\u003cp\u003e\"Meredith Johnson.\"\u003c/p\u003e\n\u003cp\u003e\"Is that a man or a woman?\"\u003c/p\u003e\n\u003cp\u003e\"A woman.\" \"Uhhuh.\" Again, no sign of surprise. She continued making notes steadily, the pen scratching. \"When did this happen?\"\u003c/p\u003e\n\u003cp\u003e\"Last night.\"\u003c/p\u003e\n\u003cp\u003e\"What were the exact circumstances?\"\u003c/p\u003e\n\u003cp\u003eHe decided not to mention the merger. \"She has just been appointed my new boss, and we had several things to go over. She asked if we could meet at the end of the day.\"\u003c/p\u003e\n\u003cp\u003e\"She requested this meeting?\" \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And where did the meeting take place?\" \"In her office. At six o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003e\"Anybody else present?\"\u003c/p\u003e\n\u003cp\u003e\"No. Her assistant came in briefly, at the start of the meeting, then left. Before anything happened.\"\u003c/p\u003e\n\u003cp\u003e\"I see. Go on.\"\u003c/p\u003e\n\u003cp\u003e\"We talked for a while, about business, and we had some wine. She had gotten some wine. And then she came on to me. I was over by the window and suddenly she started kissing me. Then pretty soon we were sitting on the couch. And then she started, uh . . .\" He hesitated. \"How much detail do you want?\"\u003c/p\u003e\n\u003cp\u003e\"Just the broad strokes for now.\" She bit her sandwich. \"You say you were kissing.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And she initiated this?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"What was your reaction when she did that?\"\u003c/p\u003e\n\u003cp\u003e\"I was uncomfortable. I\u0027m married.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. What was the general atmosphere in the meeting, prior to this kiss?\"\u003c/p\u003e\n\u003cp\u003e\"It was a regular business meeting. We were talking about business. But all the time, she was making, uh, suggestive remarks.\"\u003c/p\u003e\n\u003cp\u003e\"Like what.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, about how good I looked. How I was in shape. How glad she was to see me.\"\u003c/p\u003e\n\u003cp\u003e\"How glad she was to see you,\" Fernandez repeated, with a puzzled look.\u003c/p\u003e\n\u003cp\u003e\"Yes. We knew each other before.\"\u003c/p\u003e\n\u003cp\u003e\"You had a prior relationship?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"When was that?\"\u003c/p\u003e\n\u003cp\u003e\"Ten years ago.\"\u003c/p\u003e\n\u003cp\u003e\"And were you married then?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Did you both work for the same company at that time?\"\u003c/p\u003e\n\u003cp\u003e\"No. I did, but she worked for another company.\"\u003c/p\u003e\n\u003cp\u003e\"And how long did your relationship last?\"\u003c/p\u003e\n\u003cp\u003e\"About six months.\" \"And have you kept up contact?\"\u003c/p\u003e\n\u003cp\u003e\"No. Not really.\"\u003c/p\u003e\n\u003cp\u003e\"Any contact at all?\"\u003c/p\u003e\n\u003cp\u003e\"Once.\"\u003c/p\u003e\n\u003cp\u003e\"Intimate?\"\u003c/p\u003e\n\u003cp\u003e\"No. Just, you know, hello in the hallway. At the office.\"\u003c/p\u003e\n\u003cp\u003e\"I see. In the last eight years, have you ever been to her house or apartment?\"\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003e\"Dinners, drinks after work, anything?\"\u003c/p\u003e\n\u003cp\u003e\"No. I really haven\u0027t seen her at all. When she joined the company, she was in Cupertino, in Operations. I was in Seattle, in Advanced Products. We didn\u0027t have much contact.\"\u003c/p\u003e\n\u003cp\u003e\"So during this time, she wasn\u0027t your superior?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Give me a picture of Ms. Johnson. How old?\"\u003c/p\u003e\n\u003cp\u003e\"Thirty-five.\"\u003c/p\u003e\n\u003cp\u003e\"Would you characterize her as attractive?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Very attractive?\"\u003c/p\u003e\n\u003cp\u003e\"She was a Miss Teenage something as a kid.\"\u003c/p\u003e\n\u003cp\u003e\"So you would say she\u0027s very attractive.\" The pen scratched on the legal pad.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And how about other men-would you say they find her very attractive?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"What about her manner with regard to sexual matters? Does she make jokes? Sexual jokes, innuendoes, ribald comments?\"\u003c/p\u003e\n\u003cp\u003e\"No, never.\"\u003c/p\u003e\n\u003cp\u003e\"Body language? Flirtatious? Does she touch people?\"\u003c/p\u003e\n\u003cp\u003e\"Not really. She certainly knows she\u0027s good-looking, and she can play on that. But her manner is . . . kind of cool. She\u0027s the Grace Kelly type.\"\u003c/p\u003e\n\u003cp\u003e\"They say Grace Kelly was very sexually active, that she had affairs with most of her leading men.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. What about Ms. Johnson, does she have affairs inside the company?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t know. I haven\u0027t heard anything.\"\u003c/p\u003e\n\u003cp\u003eFernandez flipped to a new page on her pad. \"All right. And how long has she been your supervisor? Or is she your supervisor?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, she is. One day.\"\u003c/p\u003e\n\u003cp\u003eFor the first time, Fernandez looked surprised. She glanced at him, and took another bite of her sandwich. \"One day?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Yesterday was the first day of a new company organization. She had just been appointed.\"\u003c/p\u003e\n\u003cp\u003e\"So the day she is appointed, she meets with you, in the evening.\" \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"All right. You were telling me, you were sitting on the couch and she was kissing you. And what happened then?\"\u003c/p\u003e\n\u003cp\u003e\"She unzipped-well, first of all, she started rubbing me.\"\u003c/p\u003e\n\u003cp\u003e\"Your genitals.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. And kissing me.\" He found himself sweating. He wiped his forehead with his hand.\u003c/p\u003e\n\u003cp\u003e\"I understand this is difficult. I\u0027ll try to make this as brief as possible,\" Fernandez said. \"And then?\"\u003c/p\u003e\n\u003cp\u003e\"Then, she unzipped my pants, and started rubbing me with her hand.\"\u003c/p\u003e\n\u003cp\u003e\"Was your penis exposed?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Who exposed it?\"\u003c/p\u003e\n\u003cp\u003e\"She took it out.\"\u003c/p\u003e\n\u003cp\u003e\"So she took your penis out of your pants, and then rubbed it with her hand, is that right?\" She peered at him over her glasses, and for a moment he glanced away in embarrassment. But when he looked back at her, he saw that she was not the least embarrassed, that her manner was more than clinical, more than professional-that she was in some deep way detached, and very cold.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said. \"That\u0027s what happened.\"\u003c/p\u003e\n\u003cp\u003e\"And what was your reaction?\"\u003c/p\u003e\n\u003cp\u003e\"Well.\" He gave an embarrassed shrug. \"It worked.\"\u003c/p\u003e\n\u003cp\u003e\"You were sexually aroused.\" Yes.\u003c/p\u003e\n\u003cp\u003e\"Did you say anything to her?\"\u003c/p\u003e\n\u003cp\u003e\"Like what?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just asking whether you said anything to her.\"\u003c/p\u003e\n\u003cp\u003e\"Like what? I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Did you say anything at all?\"\u003c/p\u003e\n\u003cp\u003e\"I said something, I don\u0027t know. I was feeling very uncomfortable.\"\u003c/p\u003e\n\u003cp\u003e\"Do you remember what you said?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/disclosure/page-10.html","bookId":2410,"creation":"Oct 5, 2019 10:33:47 AM","modification":"Oct 5, 2019 10:33:47 AM"}
