{"id":74948,"no":21,"title":"Page 21","content":"\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e`Jesus,\" Alan said. \"Who\u0027s she got behind her?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d love to know,\" Fernandez said.\u003c/p\u003e\n\u003cp\u003eSanders flipped open his cellular phone and checked in with his office. \"Cindy, any messages?\"\u003c/p\u003e\n\u003cp\u003e`Just two, Tom. Stephanie Kaplan asked if she could meet with you today.\"\u003c/p\u003e\n\u003cp\u003e\"She say why?\"\u003c/p\u003e\n\u003cp\u003e\"No. But she said it wasn\u0027t important. And Mary Anne has come by twice, looking for you.\"\u003c/p\u003e\n\u003cp\u003e\"Probably wants to skin me,\" Sanders said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so, Tom. She\u0027s about the only one who-she\u0027s very concerned about you, I think.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. I\u0027ll call her.\"\u003c/p\u003e\n\u003cp\u003eHe started to dial Mary Anne\u0027s number when Fernandez nudged him in the ribs. He looked over and saw a slender, middle-aged woman walking up from the parking lot toward them. \"Buckle up,\" Fernandez said. \"Why? Who\u0027s that?\" \"That,\" Fernandez said, \"is Connie Walsh.\"\u003c/p\u003e\n\u003cp\u003eConnie Walsh was about forty-five years old, with gray hair and a sour expression. \"Are you Tom Sanders?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eShe pulled out a tape recorder. \"Connie Walsh, from the Post Intelligencer. Can we talk for a moment?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely not,\" Fernandez said.\u003c/p\u003e\n\u003cp\u003eWalsh looked over at her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Mr. Sanders\u0027s attorney.\"\u003c/p\u003e\n\u003cp\u003e\"I know who you are,\" Walsh said, and turned back to Sanders. \"Mr. Sanders, our paper\u0027s going with a story on this discrimination suit at DigiCom. My sources tell me that you are accusing Meredith Johnson of sex discrimination, is that correct?\"\u003c/p\u003e\n\u003cp\u003e\"He has no comment,\" Fernandez said, stepping between Walsh and Sanders.\u003c/p\u003e\n\u003cp\u003eWalsh looked past her shoulder and said, \"Mr. Sanders, is it also true that you and she are old lovers, and that your accusation is a way to even the score?\"\u003c/p\u003e\n\u003cp\u003e\"He has no comment,\" Fernandez said.\u003c/p\u003e\n\u003cp\u003e\"It looks to me like he does,\" Walsh said. \"Mr. Sanders, you don\u0027t have to listen to her. You can say something if you want to. And I really think you should take this opportunity to defend yourself. Because my sources are also saying that you physically abused Ms. Johnson in the course of your meeting. These are very serious charges people are making against you, and I imagine you\u0027ll want to respond. What do you have to say to her allegations? Did you physically abuse her?\"\u003c/p\u003e\n\u003cp\u003eSanders started to speak, but Fernandez shot him a warning glance, and put her hand on his chest. She said to Walsh, \"Has Ms. Johnson made these allegations to you? Because she was the only other one besides Mr. Sanders who was there.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not free to say. I have the story from very well-informed sources.\"\u003c/p\u003e\n\u003cp\u003e\"Inside or outside the company?\"\u003c/p\u003e\n\u003cp\u003e\"I really can\u0027t say.\"\u003c/p\u003e\n\u003cp\u003e\"Ms. Walsh,\" Fernandez said, \"I am going to forbid Mr. Sanders to talk to you. And you better check with the P-I counsel before you run any of these unsubstantiated allegations.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not unsubstantiated, I have very reliable\"\u003c/p\u003e\n\u003cp\u003e\"If there is any question in your counsel\u0027s mind, you might have her call Mr. Blackburn and he will explain what your legal position is in this matter.\"\u003c/p\u003e\n\u003cp\u003eWalsh smiled bleakly. \"Mr. Sanders, do you want to make a comment?\"\u003c/p\u003e\n\u003cp\u003eFernandez said, `Just check with your counsel, Ms. Walsh.\"\u003c/p\u003e\n\u003cp\u003e\"I will, but it won\u0027t matter. You can\u0027t squash this. Mr. Blackburn can\u0027t squash this. And speaking personally, I have to say I don\u0027t know how you can defend a case like this.\"\u003c/p\u003e\n\u003cp\u003eFernandez leaned close to her, smiled, and said, \"Why don\u0027t you step over here with me, and I\u0027ll explain something to you.\"\u003c/p\u003e\n\u003cp\u003eShe walked with Walsh a few yards away, across the courtyard.\u003c/p\u003e\n\u003cp\u003eAlan and Sanders remained where they were. Alan sighed. He said, \"Wouldn\u0027t you give anything to know what they were saying right now?\"\u003c/p\u003e\n\u003cp\u003eConnie Walsh said, \"It doesn\u0027t matter what you say. I won\u0027t give you my source.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not asking for your source. I\u0027m simply informing you that your story is wrong-\"\u003c/p\u003e\n\u003cp\u003e\"Of course you\u0027d say that-\"\u003c/p\u003e\n\u003cp\u003e\"And that there\u0027s documentary evidence that it\u0027s wrong.\"\u003c/p\u003e\n\u003cp\u003eConnie Walsh paused. She frowned. \"Documentary evidence?\"\u003c/p\u003e\n\u003cp\u003eFernandez nodded slowly. \"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eWalsh thought it over. \"But there can\u0027t be,\" she said. \"You said it yourself. They were alone in the room. It\u0027s his word against hers. There\u0027s no documentary evidence.\"\u003c/p\u003e\n\u003cp\u003eFernandez shook her head, and said nothing.\u003c/p\u003e\n\u003cp\u003e\"What is it? A tape?\"\u003c/p\u003e\n\u003cp\u003eFernandez smiled thinly. \"I really can\u0027t say.\"\u003c/p\u003e\n\u003cp\u003e\"Even if there is, what can it show? That she pinched his butt a little? She made a couple of jokes? What\u0027s the big deal? Men have been doing that for hundreds of years.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not the issue in this-\"\u003c/p\u003e\n\u003cp\u003e\"Give me a break. So this guy gets a little pinch, and he starts screaming bloody murder. That\u0027s not normal behavior in a man. This guy obviously hates and demeans women. That\u0027s clear, just to look at him. And there\u0027s no question: he hit her, in that meeting. The company had to call a doctor to examine her for a concussion. And I have several reliable sources that tell me he\u0027s known to be physically abusive. He and his wife have had trouble for years. In fact, she\u0027s left town with the kids and is going to file for divorce.\" Walsh was watching Fernandez carefully as she said it.\u003c/p\u003e\n\u003cp\u003eFernandez just shrugged.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a fact. The wife has left town,\" Walsh said flatly. \"Unexpectedly. She took the kids. And nobody knows where she went. Now, you tell me what that means.\"\u003c/p\u003e\n\u003cp\u003eFernandez said, \"Connie, all I can do is advise you in my capacity as Mr. Sanders\u0027s attorney that documentary evidence contradicts your sources about this harassment charge.\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to show me this evidence?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely not.\"\u003c/p\u003e\n\u003cp\u003e\"Then how do I know it exists?\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t. You only know I have informed you of its existence.\" \"And what if I don\u0027t believe you?\"\u003c/p\u003e\n\u003cp\u003eFernandez smiled. \"These are the decisions a journalist must make.\" \"You\u0027re saying it\u0027d be reckless disregard.\"\u003c/p\u003e\n\u003cp\u003e\"If you go with your story, yes.\"\u003c/p\u003e\n\u003cp\u003eWalsh stepped back. \"Look. Maybe you\u0027ve got some kind of a technical legal case here, and maybe you don\u0027t. But as far as I\u0027m concerned, you\u0027re just another minority woman trying to get ahead with the patriarchy by getting down on her knees. If you had any self-respect you wouldn\u0027t be doing their dirty work for them.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, Connie, the person who seems to be caught in the grip of the patriarchy is you.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a lot of crap,\" Walsh said. \"And let me tell you, you\u0027re not going to evade the facts here. He led her on, and then he beat her up. He\u0027s an ex-lover, he\u0027s resentful, and he\u0027s violent. He\u0027s a typical man. And let me tell you, before I\u0027m through, he\u0027ll wish he had never been born.\"\u003c/p\u003e\n\u003cp\u003eSsanders said, \"Is she going to run the story?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Fernandez said. She stared across the courtyard at Johnson, Heller, and Blackburn. Connie Walsh had gone over to Blackburn and was talking to him. \"Don\u0027t get distracted by this,\" Fernandez said. \"It\u0027s not important. The main issue is: what\u0027re they going to do about Johnson.\"\u003c/p\u003e\n\u003cp\u003eA moment later, Heller came toward them. He said, \"We\u0027ve been going over things on our side, Louise.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve concluded that we see no purpose to further mediation and are withdrawing, as of now. I\u0027ve informed judge Murphy that we will not continue.\"\u003c/p\u003e\n\u003cp\u003e\"Really. And what about the tape?\"\u003c/p\u003e\n\u003cp\u003e\"Neither Ms. Johnson nor Mr. Sanders knew they were being taped. Under law, one party must know the interaction is being recorded. Therefore the tape is inadmissible.\"\u003c/p\u003e\n\u003cp\u003e\"But Ben-\"\u003c/p\u003e\n\u003cp\u003e\"We argue that the tape should be disallowed, both from this mediation and from any subsequent legal proceeding. We argue that Ms. Johnson\u0027s characterization of the meeting as a misunderstanding between consenting adults is the correct one, and that Mr. Sanders bears a responsibility for that misunderstanding. He was an active participant, Louise, no way around it. He took her panties off. Nobody held a gun to his head. But since there was fault on both sides, the proper thing is for the two parties to shake hands, let go of all animosity, and return to work. Apparently Mr. Garvin has already proposed this to Mr. Sanders, and Mr. Sanders has refused. We believe that under the circumstances Mr. Sanders is acting unreasonably and that if he does not reconsider in a timely manner, he should be fired for his refusal to show up for work.\"\u003c/p\u003e\n\u003cp\u003e\"Son of a bitch,\" Sanders said.\u003c/p\u003e\n\u003cp\u003eFernandez laid a restraining hand on his arm. \"Ben,\" she said calmly. \"Is this a formal offer of reconciliation and return to the company?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Louise.\"\u003c/p\u003e\n\u003cp\u003e\"And what are the sweeteners?\"\u003c/p\u003e\n\u003cp\u003e\"No sweeteners. Everybody just goes back to work.\"\u003c/p\u003e\n\u003cp\u003e\"The reason I ask,\" Fernandez said, \"is that I believe I can successfully argue that Mr. Sanders was aware the tape was being made, and thus it is indeed admissible. I will argue further that it is admissible under discovery of public records over common carriers as defined in Waller v. Herbst. I will argue further that the company knew of Ms. Johnson\u0027s long history of harassment, and has failed to take proper steps to investigate her behavior, either prior to this incident, or now. And I will argue that the company was derelict in protecting Mr. Sanders\u0027s reputation when it leaked the story to Connie Walsh.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a minute here-\"\u003c/p\u003e\n\u003cp\u003e\"I will argue that the company had a clear reason for leaking it: they desired to cheat Mr. Sanders out of his well-deserved reward for more than a decade of service to the company. And you\u0027ve got an employee in Ms. Johnson who has had some trouble before. I will claim defamation and ask for punitive damages of sufficient magnitude to send a message to corporate America. I\u0027ll ask for sixty million dollars, Ben. And you\u0027ll settle for forty million-the minute I get the judge to allow the jury to hear this tape. Because we both know that when the jury hears that tape, they will take about five seconds to find against Ms. Johnson and the company.\"\u003c/p\u003e\n\u003cp\u003eHeller shook his head. \"You\u0027ve got a lot of long shots there, Louise. I don\u0027t think they\u0027ll ever let that tape be played in court. And you\u0027re talking about three years from now.\"\u003c/p\u003e\n\u003cp\u003eFernandez nodded slowly. \"Yes,\" she said. \"Three years is a long time.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re ,telling me, Louise. Anything can happen.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, and frankly, I\u0027m worried about that tape. So many untoward things can happen with evidence that is so scandalous. I can\u0027t guarantee somebody hasn\u0027t made a copy already. It\u0027d be terrible if one fell into the hands of KQEM, and they started playing it over the radio.\"\u003c/p\u003e\n\u003cp\u003e\"Christ,\" Heller said. \"Louise, I can\u0027t believe you said that.\"\u003c/p\u003e\n\u003cp\u003e\"Said what? I\u0027m merely expressing my legitimate fears,\" Fernandez said. \"I\u0027d be derelict if I did not let you know my concerns. Let\u0027s face facts here, Ben. The cat\u0027s out of the bag. The press already has this story. Somebody leaked it to Connie Walsh. And she printed a story that\u0027s very damaging to Mr. Sanders\u0027s reputation. And it seems that somebody is still leaking, because now Connie is planning to write some unfounded speculation about physical violence by my client. It\u0027s unfortunate that someone on your side should have chosen to talk about this case. But we both know how it is with a hot story in the press you never know where the next leak will come from.\"\u003c/p\u003e\n\u003cp\u003eHeller was uneasy. He glanced back at the others by the fountain. \"Louise, I don\u0027t think there\u0027s any movement over there.\"\u003c/p\u003e\n\u003cp\u003e\"Well, just talk to them.\"\u003c/p\u003e\n\u003cp\u003eHeller shrugged, and walked back.\u003c/p\u003e\n\u003cp\u003e\"What do we do now?\" Sanders said.\u003c/p\u003e\n\u003cp\u003e\"We go back to your office.\"\u003c/p\u003e\n\u003cp\u003e\"We?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Fernandez said. \"This isn\u0027t the end. More is going to happen today, and I want to be there when it does.\"\u003c/p\u003e\n\u003cp\u003eDriving back, Blackburn talked on the car phone with Garvin. V \"The mediation\u0027s over. We called it off.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re pushing Sanders hard to go back to work. But he\u0027s not responding so far. He\u0027s hanging tough. Now he\u0027s threatening punitive damages of sixty million dollars.\"\u003c/p\u003e\n\u003cp\u003e\"Christ,\" Garvin said. \"Punitive damages on what basis?\"\u003c/p\u003e\n\u003cp\u003e\"Defamation from corporate negligence dealing with the fact that we supposedly knew that Johnson had a history of harassment.\"\u003c/p\u003e\n\u003cp\u003e\"I never knew of any history,\" Garvin said. \"Did you know of any history, Phil?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Blackburn said.\u003c/p\u003e\n\u003cp\u003e\"Is there any documentary evidence of such a history?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Blackburn said. \"I\u0027m sure there isn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Then let him threaten. Where did you leave it with Sanders?\"\u003c/p\u003e\n\u003cp\u003e\"We gave him until tomorrow morning to rejoin the company at his old job or get out.\"\u003c/p\u003e\n\u003cp\u003e\"All right,\" Garvin said. \"Now let\u0027s get serious. What have we got on him?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re working on that felony charge,\" Blackburn said. \"It\u0027s early, but I think it\u0027s promising.\"\u003c/p\u003e\n\u003cp\u003e\"What about women?\"\u003c/p\u003e\n\u003cp\u003e\"There isn\u0027t any record on women. I know Sanders was screwing one of his assistants a couple of years back. But we can\u0027t find the records in the computer. I think he went in and erased them.\"\u003c/p\u003e\n\u003cp\u003e\"How could he? We blocked his access.\"\u003c/p\u003e\n\u003cp\u003e\"He must have done it some time ago. He\u0027s a cagey guy.\"\u003c/p\u003e\n\u003cp\u003e\"Why the hell would he do it some time ago, Phil? He had no reason to expect any of this.\"\u003c/p\u003e\n\u003cp\u003e\"I know, but we can\u0027t find the records now.\" Blackburn paused. \"Bob, I think we should move up the press conference.\"\u003c/p\u003e\n\u003cp\u003e\"To when?\"\u003c/p\u003e\n\u003cp\u003e\"Late tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Good idea,\" Garvin said. \"I\u0027ll arrange it. We could even do it noon tomorrow. John Marden is flying in in the morning,\" he said, referring to Conley-White\u0027s CEO. \"That\u0027ll work out fine.\"\u003c/p\u003e\n\u003cp\u003e\"Sanders is planning to string this out until Friday,\" Blackburn said. \"Let\u0027s just beat him to the punch. We\u0027ve got him blocked as it is. He can\u0027t get into the company files. He can\u0027t get access to Conrad or anything else. He\u0027s isolated. He can\u0027t possibly come up with anything damaging between now and tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" Garvin said. \"What about the reporter?\"\u003c/p\u003e\n\u003cp\u003e\"I think she\u0027ll break the story on Friday,\" Blackburn said. \"She already has it, I don\u0027t know where from. But she won\u0027t be able to resist trashing Sanders. It\u0027s too good a story; she\u0027ll go with it. And he\u0027ll be dead meat when she does.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s fine,\" Garvin said.\u003c/p\u003e\n\u003cp\u003eMeredith Johnson came off the fifth-floor elevator at DigiCom and ran into Ed Nichols. \"We missed you at the morning meetings,\" Nichols said.\u003c/p\u003e\n\u003cp\u003e\"Yeah, I had some things to take care of,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Anything I should know?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she said. \"It\u0027s boring. Just some technical matters about tax exemptions in Ireland. The Irish government wants to expand local content at the Cork plant and we\u0027re not sure we can. This has been going on for more than a year.\"\u003c/p\u003e\n\u003cp\u003e\"You look a little tired,\" Nichols said, with concern. \"A little pale.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m okay. I\u0027ll be happy when this is all over.\"\u003c/p\u003e\n\u003cp\u003e\"We all will,\" Nichols said. \"You have time for dinner?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe Friday night, if you\u0027re still in town,\" she said. She smiled. \"But really, Ed. It\u0027s just tax stuff.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, I believe you.\"\u003c/p\u003e\n\u003cp\u003eHe waved and went down the hallway. Johnson went into her office.\u003c/p\u003e\n\u003cp\u003eShe found Stephanie Kaplan there, working at the computer terminal on Johnson\u0027s desk. Kaplan looked embarrassed. \"Sorry to use your computer. I was just running over some accounts while I waited for you.\u003c/p\u003e\n\u003cp\u003eJohnson threw her purse on the couch. \"Listen, Stephanie,\" she said. \"Let\u0027s get something straight right now. I\u0027m running this division, and nobody\u0027s going to change that. And as far as I\u0027m concerned, this is the time when a new vice president decides who\u0027s on their side, and who isn\u0027t. Somebody supports me, I\u0027ll remember. Somebody doesn\u0027t, I\u0027ll deal with that, too. Do we understand each other?\"\u003c/p\u003e\n\u003cp\u003eKaplan came around the desk. \"Yes, sure, Meredith.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t fuck with me.\"\u003c/p\u003e\n\u003cp\u003e\"Never entered my mind, Meredith.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Thank you, Stephanie.\" \"No problem, Meredith.\" Kaplan left the office. Johnson closed the door behind her and went directly to her computer terminal and stared intently at the screen.\u003c/p\u003e\n\u003cp\u003eSanders walked through the corridors of DigiCom with a sense of unreality. He felt like a stranger. The people who passed him in the halls looked away and brushed past him, saying nothing.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t exist,\" he said to Fernandez.\u003c/p\u003e\n\u003cp\u003e\"Never mind,\" she said.\u003c/p\u003e\n\u003cp\u003eThey passed the main part of the floor, where people worked in chest-high cubicles. Several pig grunts were heard. One person sang softly, \"Because I used to fuck her, but it\u0027s all over now . . .\"\u003c/p\u003e\n\u003cp\u003eSanders stopped and turned toward the singing. Fernandez grabbed his arm.\u003c/p\u003e\n\u003cp\u003e\"Never mind,\" she said.\u003c/p\u003e\n\u003cp\u003e\"But Christ . . .\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make it worse than it is.\"\u003c/p\u003e\n\u003cp\u003eThey passed the coffee machine. Beside it, someone had taped up a picture of Sanders. They had used it for a dartboard.\u003c/p\u003e\n\u003cp\u003e`Jesus.\"\u003c/p\u003e\n\u003cp\u003e\"Keep going.\"\u003c/p\u003e\n\u003cp\u003eAs he came to the corridor leading to his office, he saw Don Cherry coming the other way.\u003c/p\u003e\n\u003cp\u003e\"Hi, Don.\"\u003c/p\u003e\n\u003cp\u003e\"You screwed up bad on this one, Tom.\" He shook his head and walked on.\u003c/p\u003e\n\u003cp\u003eEven Don Cherry.\u003c/p\u003e\n\u003cp\u003eSanders sighed.\u003c/p\u003e\n\u003cp\u003e\"You knew this was going to happen,\" Fernandez said.\u003c/p\u003e\n\u003cp\u003e\"Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"You did. This is the way it works.\"\u003c/p\u003e\n\u003cp\u003eOutside his office, Cindy stood up when she saw him. She said, \"Tom, Mary Anne asked you to call her as soon as you got in.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"And Stephanie said to say never mind, she found out whatever she needed to know. She said, uh, not to call her.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003eHe went in the office and closed the door. He sat down behind his desk and Fernandez sat opposite him. She took her cellular phone out of her briefcase, and dialed. \"Let\u0027s get one thing squared away-Ms. Vries\u0027s office please . . . Louise Fernandez calling.\"\u003c/p\u003e\n\u003cp\u003eShe cupped her hand over the phone. \"This shouldn\u0027t take- Oh, Eleanor? Hi, Louise Fernandez. I\u0027m calling you about Connie Walsh. Uh-huh . . . I\u0027m sure you\u0027ve been going over it with her. Yes, I know she feels strongly. Eleanor, I just wanted to confirm to you that there is a tape of the event, and it substantiates Mr. Sanders\u0027s version rather than Ms. Johnson\u0027s. Actually, yes, I could do that. Entirely off the record? Yes, I could. Well, the problem with Walsh\u0027s source is that the company now has huge liability and if you print a story that\u0027s wrong-even if you got it from a source I think they have an action against you. Oh yes, I think absolutely Mr. Blackburn would sue. He wouldn\u0027t have any choice. Why don\u0027t you-I see. Uh-huh. Well, that could change, Eleanor. Uh-huh. And don\u0027t forget that Mr. Sanders is considering defamation right now, based on the Mr. Piggy piece. Yes, why don\u0027t you do that. Thank you.\"\u003c/p\u003e\n\u003cp\u003eShe hung up and turned to Sanders. \"We went to law school together. Eleanor is very competent and very conservative. She\u0027d never have allowed the story in the first place, and would never have considered it now, if she didn\u0027t place a lot of reliance on Connie\u0027s source.\"\u003c/p\u003e\n\u003cp\u003e\"Meaning?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m pretty sure I know who gave her the story,\" Fernandez said. She was dialing again.\u003c/p\u003e\n\u003cp\u003e\"Who?\" Sanders said.\u003c/p\u003e\n\u003cp\u003e\"Right now, the important thing is Meredith Johnson. We\u0027ve got to document the pattern, to demonstrate that she has harassed employees before. Somehow we\u0027ve got to break this deadlock with Conrad Computer.\" She turned away. \"Harry? Louise. Did you talk to Conrad? Uhhuh. And?\" A pause. She shook her head irritably. \"Did you explain to them about their liabilities? Uh-huh. Hell. So what\u0027s our next move? Because we\u0027ve got a time problem here, Harry, that\u0027s what I\u0027m concerned about.\"\u003c/p\u003e\n\u003cp\u003eWhile she was talking, Sanders turned to his monitor. The e-mail light was flashing. He clicked it.\u003c/p\u003e\n\u003cp\u003eYOU HAVE 17 MESSAGES WAITING.\u003c/p\u003e\n\u003cp\u003eChrist. He could only imagine. He clicked the READ button. They flashed up in order.\u003c/p\u003e\n\u003cp\u003eFROM: DON CHERRY, CORRIDOR PROGRAMMING TEAM TO: ALL SUBJECTS\u003c/p\u003e\n\u003cp\u003eWE HAVE DELIVERED THE VIE UNIT TO CONLEY-WHITE\u0027S PEOPLE. THE UNIT IS NOW ACTIVE INTO THEIR COMPANY DB SINCE THEY GAVE US THE HOOKS TODAY. JOHN CONLEY ASKED THAT IT BE DELIVERED TO A SUITE AT THE FOUR SEASONS HOTEL BECAUSE THEIR CEO IS ARRIVING THURSDAY MORNING AND WILL SEE IT THEN. ANOTHER PROGRAMMING TRIUMPH BROUGHT TO YOU BY THE SWELL FOLKS AT VIE.\u003c/p\u003e\n\u003cp\u003eDON THE MAGNIFICENT\u003c/p\u003e\n\u003cp\u003eSanders flipped to the next one.\u003c/p\u003e\n\u003cp\u003eFROM: DIAGNOSTICS GROUP TO: APG TEAM\u003c/p\u003e\n\u003cp\u003eANALYSIS OF TWINKLE DRIVES. THE PROBLEM WITH THE CONTROLLER TIMING LOOP DOES NOT SEEM TO COME FROM THE CHIP ITSELF. WE VERIFIED MICRO-FLUCTUATIONS IN CURRENT FROM THE POWER UNIT WHICH WAS APPARENTLY ETCHED WITH SUBSTANDARD OR INADEQUATE RESISTANCES ON THE BOARD BUT THIS IS MINOR AND DOES NOT EXPLAIN OUR FAILURE TO MEET SPECS. ANALYSIS IS CONTINUING.\u003c/p\u003e\n\u003cp\u003eSanders viewed the message with a sense of detachment. It didn\u0027t really tell him anything. Just words that concealed the underlying truth: they still didn\u0027t know what the problem was. At another time, he\u0027d be on his way down to the Diagnostics team, to ride them hard to get to the bottom of it. But now . . . He shrugged and went to the next message.\u003c/p\u003e\n\u003cp\u003eFROM: BASEBALL CENTRAL TO: ALL PLAYERS RE: NEW SUMMER SOFTBALL SCHEDULE\u003c/p\u003e\n\u003cp\u003eDOWNLOAD FILE BB.72 TO GET THE NEW REVISED SUMMER SCHEDULE. SEE YOU ON THE FIELD!\u003c/p\u003e\n\u003cp\u003eHe heard Fernandez say on the phone, \"Harry, we\u0027ve got to crack this one somehow. What time do they close their offices in Sunnyvale?\" Sanders went to the next message.\u003c/p\u003e\n\u003cp\u003eNO MORE GROUP MESSAGES. DO YOU WANT TO READ PERSONAL MESSAGES?\u003c/p\u003e\n\u003cp\u003eHe clicked the icon.\u003c/p\u003e\n\u003cp\u003eWHY DON\u0027T YOU JUST ADMIT YOU ARE GAY?\u003c/p\u003e\n\u003cp\u003e(UNSIGNED)\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t bother to see where it had come from. They would probably have manually entered it as coming from Garvin\u0027s address, or something like that. He could check the real address inside the system, but not without the access privileges they had taken away. He went to the next message.\u003c/p\u003e\n\u003cp\u003eSHE\u0027S BETTER LOOKING THAN YOUR ASSISTANT, AND YOU DIDN\u0027T SEEM TO MIND SCREWING HER.\u003c/p\u003e\n\u003cp\u003e(UNSIGNED)\u003c/p\u003e\n\u003cp\u003eSanders clicked to the next one.\u003c/p\u003e\n\u003cp\u003eYOU SLIMY WEASEL - GET OUT OF THIS COMPANY.\u003c/p\u003e\n\u003cp\u003eYOUR BEST ADVICE\u003c/p\u003e\n\u003cp\u003eChrist, he thought. The next one:\u003c/p\u003e\n\u003cp\u003eLITTLE TOMMY HAD A PECKER HE PLAYED WITH EVERY DAY\u003c/p\u003e\n\u003cp\u003eBUT WHEN A LADY TRIED TO TOUCH IT LITTLE TOMMY SAID GO AWAY.\u003c/p\u003e\n\u003cp\u003eThe verses ran on, down to the bottom of the screen, but Sanders didn\u0027t read the rest. He clicked and went on.\u003c/p\u003e\n\u003cp\u003eIF YOU WEREN\u0027T FUCKING YOUR DAUGHTER SO MUCH YOU MIGHT BE ABLE TO\u003c/p\u003e\n\u003cp\u003eHe clicked again. He was clicking faster and faster, going through the messages.\u003c/p\u003e\n\u003cp\u003eGUYS LIKE YOU GIVE MEN A BAD NAME YOU ASSHOLE.\u003c/p\u003e\n\u003cp\u003eBORIS\u003c/p\u003e\n\u003cp\u003eClick.\u003c/p\u003e\n\u003cp\u003eYOU FILTHY LYING MALE PIG\u003c/p\u003e\n\u003cp\u003eClick.\u003c/p\u003e\n\u003cp\u003eHIGH TIME SOMEBODY STUCK IT TO THE WHINING BITCHES. I\u0027M TIRED OF THE WAY THEY BLAME EVERYBODY BUT THEIRSELVES. TITS AND BLAME ARE SEX-LINKED TRAITS. THEY\u0027RE BOTH ON THE XCHROMOSOME.\u003c/p\u003e\n\u003cp\u003eKEEP ON TRUCKIN\u0027\u003c/p\u003e\n\u003cp\u003eHe went through them, no longer reading. Eventually he was going so fast he almost missed one of the later ones:\u003c/p\u003e\n\u003cp\u003eJUST RECEIVED WORD THAT MOHAMMED JAFAR IS DYING. HE\u0027S STILL IN THE HOSPITAL, AND NOT EXPECTED TO SURVIVE UNTIL MORNING. I GUESS MAYBE THERE\u0027S SOMETHING TO THIS SORCERY BUSINESS, AFTER ALL. \u003c/p\u003e","sourceLink":"https://allnovel.net/disclosure/page-21.html","bookId":2410,"creation":"Oct 5, 2019 10:33:47 AM","modification":"Oct 5, 2019 10:33:47 AM"}
