{"id":22076,"no":26,"title":"CHAPTER XXVI","content":"After two or three weeks in the forest, where “the slow-growing trees do patience teach,” and the strong, effortless waters go by and seem only merry and idle, there comes to some men a sense of being at home. It does not come at once. We are all of us, in our busier lives of varied work or pleasure, actors in ever-changing r?les. It can hardly be otherwise. Almost the simplest lives involve some use of the art of the actor. In the woods, away from men and their struggles and ambitions, with the absence of need to be this or that, as duty, work, or social claims demand, we lose the resultant state of tension, of being on guard. It is readily possible to notice this effect in the rapid erasure from the faces of the constantly strained, intellectual workman of the lines of care which mark the features of those on whom, in one or another position, the world relies to carry its burdens.\n\u003cbr\u003e \n\u003cbr\u003e At first, on passing from great mental occupation to the life of the forest, there is a period of unrest, of vague disappointment. But soon or late, with repose of mind, and the cessation of endless claims upon the sentinel senses, arises a distinct and less explicable 334indifference to what a fortnight back was important. Our whole world of relation is gradually changed. The passion, strife, and more or less worthy motives of the great camps of men shrink to valueless dimensions, so that we look back and wonder how this or that should have caused us a thought, or called forth that irritability which is apt to be the offspring of the unceasing strain of modern life.\n\u003cbr\u003e \n\u003cbr\u003e At last we lose count of the days, and acquire a strange impression of the remoteness of the tumult of the active life from which we have fled. So complete may be this feeling that at times the busy past seems to fade into dreamy unreality, as with sense of relief we give ourselves unresistingly to the wholesome influence of the woodland and the waters. Much of this ease of mind must be due to the physical well-being which this existence surely brings to those who know how to get out of it the best it holds.\n\u003cbr\u003e \n\u003cbr\u003e This calm of spirit, and this feeling of perfect fullness of bodily health, were what Archibald Lyndsay unfailingly secured in his summer holiday. He had become careful to humor the pleasant mood, and to be annoyed when anything took place which forced him even for an hour to return to the problems of the outer world.\n\u003cbr\u003e \n\u003cbr\u003e Such a summons had come from Anne. She had not explained why she had spoken, nor could she have given a reason beyond the fact that she and he habitually discussed in common all family interests, and that it was not always quite safe for Anne to talk of them to Margaret. That gentle little woman was indisposed to have others, as she said, “come between 335her and her children,” and was in fact jealous, with a steadiness of jealousy which unwillingly accepted even love as an excuse, and heard, with unreasoning lack of logic, explanations, advice, or comment, which another might have welcomed, or at least calmly considered. Thus, when Anne wished to influence Margaret, she was apt to talk to the husband, who, in turn, was shrewd enough to profit by the counsel without betraying the counselor.\n\u003cbr\u003e \n\u003cbr\u003e Archibald Lyndsay’s uneasiness had been extreme from the time Anne had spoken of Carington. Now he was in the canoe with his wife, and was being poled up-stream by the two Indians, who could understand but little of the rapid speech of the white man, and before whom, therefore, he could talk at ease. Lyndsay sat with his back to the bowman, his wife facing him and lying against a pile of cushions. After a little he said, speaking low:\n\u003cbr\u003e \n\u003cbr\u003e “Margaret, has it occurred to you that possibly all this unavoidable intimacy between Rose and young Carington might—well, might result in some serious attachment, and—”\n\u003cbr\u003e \n\u003cbr\u003e “Of course,” she broke in, with the wife’s privilege of apprehending more than the husband has said, “of course, any one—”\n\u003cbr\u003e \n\u003cbr\u003e “My dear Margaret, I wish you would listen until I have finished—”\n\u003cbr\u003e \n\u003cbr\u003e “Very well, dear, I will listen. I only meant to remind you that I have already spoken of this, and that you said it was not of any moment; and that I was too much given to anticipating trouble. The fact is, Archie, when you are on your holiday, you 336hate to have anything serious brought to your mind, and you are pretty apt just to put it aside.”\n\u003cbr\u003e \n\u003cbr\u003e Lyndsay, well versed in the fine art of matrimonial diplomacy, made no instant reply to this arraignment.\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps, my good wife, we may be as to this a little alike. When you are very full of a subject, or have decided it in your own mind, you are inclined not to hear me out.”\n\u003cbr\u003e \n\u003cbr\u003e “That may be so. I beg pardon, Archie. What is it?”\n\u003cbr\u003e \n\u003cbr\u003e “What was I saying? Where was I? It is like taking the marker out of a book you are reading.”\n\u003cbr\u003e \n\u003cbr\u003e “You were saying it might result in a serious attachment.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, that was it; or something to that effect. Perhaps I should not have been quite so definite. Yes, that was it. It has seemed to me that Rose is a girl who would readily be captured by—well, by a man who had a chance to show force of character, and this very thing has happened. You know, dear, in the ordinary chances of life these opportunities are rare, but—well, you understand.”\n\u003cbr\u003e \n\u003cbr\u003e She did; and also she had a suspicion that this bit of social reflection was somebody else’s wisdom.\n\u003cbr\u003e \n\u003cbr\u003e “Has Anne mentioned the matter?”\n\u003cbr\u003e \n\u003cbr\u003e “I did say something to her about it yesterday—no, this morning.”\n\u003cbr\u003e \n\u003cbr\u003e “I would much rather, Archie, when you want to discuss the children, that you come to me first.”\n\u003cbr\u003e \n\u003cbr\u003e Clearly he had brought this on himself. She went on:\n\u003cbr\u003e \n\u003cbr\u003e “Anne is ready enough to interfere without being 337given an excuse, and now, I suppose— She has not talked to Rose, I trust?”\n\u003cbr\u003e \n\u003cbr\u003e “No, my dear. She has not and never will. That would be very unlike Anne.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know. One never knows what to expect.”\n\u003cbr\u003e \n\u003cbr\u003e “But you do now. Have you noticed of late how thin Anne looks? I sometimes think she will trouble none of us very long.”\n\u003cbr\u003e \n\u003cbr\u003e “I think you are rather prone to exaggerate about Anne. She isn’t well, but these chronic invalids outlast the healthy.” Margaret had the occasional hardness of the very tender. “As to Rose, it is as well to comprehend the matter, and then, as the man seems unexceptionable, to let Rose alone.”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Lyndsay’s good sense usually kept her at the end on the ways of reasonable decisions. If she could always have acted without speaking, she would have had more credit for wisdom. But acts are rare, and speech is not; so that people were apt to say, “Margaret Lyndsay is a very good woman, but not always very wise.” Those who knew her best did not so think, and especially Lyndsay, who well understood that great goodness cannot coexist with foolishness, because the more valuable goodness must have intelligence for one parent. There are people who reflect very little about what they are going to say, and a great deal about what they are about to do: of this kind was Lyndsay’s wife; but then, under some circumstances, words are acts, or have their force, and so she made mischief occasionally for herself and for others.\n\u003cbr\u003e \n\u003cbr\u003e “I quite agree with you, my dear,” he replied. “It 338were best left to Rose’s good sense. In the end you and I are sure enough to agree.”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps you might give Anne a hint, or—shall I?” She was a trifle afraid of her sister-in-law.\n\u003cbr\u003e \n\u003cbr\u003e “It won’t be required. She has quite our own ideas about it”; and then Margaret knew that Anne had fully discussed this question with Lyndsay. She did not like it, but this time held her tongue.\n\u003cbr\u003e \n\u003cbr\u003e The sun was low when they drew to the shore, a little above the point where Joe had left his dugout two days before. The oblong white box of a church stood on the upland, a dismal architectural symbol. Its closed doors and windows, the broken steps at the entrance, and the ragged, storm-worn paint looked dreary enough to Lyndsay as he passed with his wife through the open gateway.\n\u003cbr\u003e \n\u003cbr\u003e “How hideous it is!” he said. “Would not you like it, my dear Margaret, if in the fall I had our boy brought home to rest among our own dead?”\n\u003cbr\u003e \n\u003cbr\u003e “Very much, Archie.”\n\u003cbr\u003e \n\u003cbr\u003e “It shall be done,” he said.\n\u003cbr\u003e \n\u003cbr\u003e “Thank you.” By this time they had picked their way around the church amidst growth of thistles and wild raspberry vines. Lyndsay led, and presently they were in the scantily-peopled half-acre back of the chapel. He stood a moment, confused.\n\u003cbr\u003e \n\u003cbr\u003e “I don’t see the stone,” he said.\n\u003cbr\u003e \n\u003cbr\u003e “What? What is that?”\n\u003cbr\u003e \n\u003cbr\u003e He turned, and said again, “I don’t see it!”\n\u003cbr\u003e \n\u003cbr\u003e Margaret went by him swiftly.\n\u003cbr\u003e \n\u003cbr\u003e “It was here! here!” and, utterly bewildered, she stood, looking up at her husband, or down at the 339grave, and then around her. “Archie! It is gone! This is—is horrible.”\n\u003cbr\u003e \n\u003cbr\u003e Lyndsay paused a moment. He was both troubled and perplexed; but the intellectual puzzle was uppermost, and, as usual with him, was merely fed with motives for action and decisions by the shock of horror with which the thing affected him. As for his wife, she looked down again at the trampled ground and broken flower-stems, and then saying, “What is it? Where is it?” began to go to and fro, irregularly, among the graves, and along the tumbling stone wall of the inclosure.\n\u003cbr\u003e \n\u003cbr\u003e At last she ran, like a scared thing, back to her husband, threw her arms about him, and burst into violent sobbing.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, my boy! my boy!” she cried. Her face twitched, and she broke out into unnatural laughter. Lyndsay caught her as she reeled to and fro.\n\u003cbr\u003e \n\u003cbr\u003e “Take care, Margaret! Margaret! Be quiet. No more of this! I command you to control yourself!”\n\u003cbr\u003e \n\u003cbr\u003e As he spoke he lifted her slight figure, and carried her to the gate.\n\u003cbr\u003e \n\u003cbr\u003e “Sit down,” he said. “Now, no more of this! I want your clearest head—your help.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, yes, Archie,” she said. “I will try. I—oh, I couldn’t help it! Don’t scold me.”\n\u003cbr\u003e \n\u003cbr\u003e His eyes filled. “No, dear love, not I. But keep still. I want to look. This is a mere vulgar, brutal theft. Wait a moment, can you?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, but don’t be long.”\n\u003cbr\u003e \n\u003cbr\u003e He walked back again to the little grave, and carefully examined the place. It was broken and battered 340by large footmarks, and these led away toward the low stone wall, and were lost in the underbrush beyond the broken fence-rail on the far side of the unused road. He saw that the break in the rail was recent. At last he returned to his wife.\n\u003cbr\u003e \n\u003cbr\u003e “The grave, dear, is not disturbed. Some fool has stolen the stone. Come with me; I want to go through the drift yonder, and I do not want to leave you alone.”\n\u003cbr\u003e \n\u003cbr\u003e She stood up, and followed him around the church, and back to where he had found the rail broken. “Ah, here again is a footmark,” he said. At the river he walked along the margin, and at length came upon the place where a dugout had been drawn up and where were other footprints in the wet clay margin.\n\u003cbr\u003e \n\u003cbr\u003e “It is very simple,” he said. “We shall soon know. But why any man should do such a thing I cannot imagine.”\n\u003cbr\u003e \n\u003cbr\u003e “He ought to be killed,” said our quiet Margaret.\n\u003cbr\u003e \n\u003cbr\u003e “That will do for the present,” he said, and then called to his men to drop down from the landing where he had left them. In a minute or two they were at the shore.\n\u003cbr\u003e \n\u003cbr\u003e “Now, dear,” he said, as they came near, “try to keep this thing a secret for the few days left us here. It is an intolerable bit of wickedness, possibly of malice, but this I do not believe. The more quiet we can keep it, the better my chance of discovering who has done it.”\n\u003cbr\u003e \n\u003cbr\u003e “I will try; but Anne!”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Anne, of course, and Rose perhaps. It is the men who must not know, and the boys.”\n\u003cbr\u003e \n\u003cbr\u003e 341“That is easier. What shall you do about it, Archie? Who could have been so cruel?”\n\u003cbr\u003e \n\u003cbr\u003e “Unusual crime,” he said, thoughtfully, “has commonly unusual causes. I do not as yet know what I shall do. And now, dear, let us not discuss it any more. And will you tell Anne, or shall I?”\n\u003cbr\u003e \n\u003cbr\u003e “I would prefer to do it myself, Archie.”\n\u003cbr\u003e \n\u003cbr\u003e As the sick animal knows by instinct what wild grasses it shall eat, this woman apprehended her need for a woman’s strength and sure community of feeling. She was as certain to fall back on Anne’s opinion or help in the end, or where she herself was honestly puzzled, as she was to resent her sister-in-law’s independent assertion of her right to have a say where the question was one as to which Mrs. Lyndsay thought that the title mother or wife was in itself a victorious defense of all decisions needed in either capacity.\n\u003cbr\u003e \n\u003cbr\u003e In this present trouble it was a woman’s help she wanted. She had been for the first time in her life close to an hysterical attack. Without the forceful tonic of her husband’s call upon her self-command, the discipline of years would have been of no avail: she would have been entirely routed. As it was, there had been sad disorder in the ranks of the governing qualities of a being unused to yield to the lawlessness of unrestrained emotion. This nearness of defeat was more or less due to the preparative softening influences with which she came to say a silent farewell to her dead, and to the suddenness of the shock of horror and of insult.\n\u003cbr\u003e \n\u003cbr\u003e None turned to Anne Lyndsay in vain. As Lyndsay 342and his wife approached the cabin, where, as usual, Anne was lying in her hammock, she saw at once that something had gone wrong. Her long walk was exacting the sad price of all physical exertion which took her beyond the limits of the most carefully measured exercise. She was in great pain, and, for a half hour, had been resolutely struggling to ignore it by forcing herself to give deliberate attention to a difficult passage in the second part of “Faust.” She dropped her dictionary as they came up, put a marker in the page she had been reading, and rose on one elbow.\n\u003cbr\u003e \n\u003cbr\u003e “Go and talk to Anne,” said Lyndsay. “Is Rose still out, sister?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; and the boys, except Ned. He is in the wood, somewhere. I am all alone, Margaret. What is it, dear?”\n\u003cbr\u003e \n\u003cbr\u003e “Something very unpleasant has happened, Anne; nothing serious—I mean, no personal calamity. Margaret will explain.” And so saying, he went into the cabin, while Mrs. Lyndsay sat down on a low stool, and, letting her head fall on Anne’s bosom, began to cry. But this time she had herself well in hand, and the burst of tears was wholesome, as Anne instantly knew. She let her hand fall over Margaret’s neck.\n\u003cbr\u003e \n\u003cbr\u003e “Have it out, dear,” she said. “A man always says, ‘Don’t cry’; a woman says, ‘Cry; it will help you.’ Cry as much as you want to. God knew our wants when he gave us tears. No; don’t try to explain,—not yet, not yet.” And the reassuring hand put back a stray lock of hair, and rested in tender caress on the wet cheek.\n\u003cbr\u003e \n\u003cbr\u003e 343Both were still for a few minutes, save for an occasional sob.\n\u003cbr\u003e \n\u003cbr\u003e “Now I am better, Anne. I can talk now. How well you know!—what is it, dear?” she added, abruptly, for a brief exclamation, “Oh, my God!” broke from Anne’s lips. She was in the extremity of physical pain. The tone and words were unusual, as coming from these lips, and Margaret, instantly turning aside from her own trouble, caught the look of suffering on the other woman’s face. She wiped her eyes hastily.\n\u003cbr\u003e \n\u003cbr\u003e “Are you ill, Anne?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. Oh, not ill! I had a stitch in my poor old side.” Then she laughed low. “I am sure it is years older than the rest of me. Get me your smelling-salts.”\n\u003cbr\u003e \n\u003cbr\u003e Margaret got up at once and went into the cabin. As for Anne, smelling-salts, hot-water bags, sedatives, and, in fact, the whole armament of the invalid, were to her altogether unpleasant. But now she was in some want of a minute to herself. She got it, and more, for Margaret was some time before she came out with the smelling-salts and a flask.\n\u003cbr\u003e \n\u003cbr\u003e “No, dear,” said Anne; “no brandy.” She used the smelling-salts, and returned them to her sister-in-law. “I hate all scented things. I am better now. Tell me all about it, and don’t hurry. What is it?”\n\u003cbr\u003e \n\u003cbr\u003e “We went up to my boy’s grave, and, Anne, Anne, some one had trampled it all over—trod on my—my dead!”\n\u003cbr\u003e \n\u003cbr\u003e “Well, dear. Take care! Don’t give way, or you will go to pieces. There! What else?”\n\u003cbr\u003e \n\u003cbr\u003e 344“And some cruel brute has taken away the tombstone. It was not there. Do you understand?” she cried, with fierce energy. “They stole it! It is gone!”\n\u003cbr\u003e \n\u003cbr\u003e Anne understood well enough; but the fact, as told her, was so strange, so unlooked for, that she was amazed for a brief time beyond power of comment. The next moment all her heart went out to the mother at her side.\n\u003cbr\u003e \n\u003cbr\u003e “It is horrible!” she cried. “Oh, for me, even, for me! And for you, what must it be?” She saw, as few would have done, the broken flower-fence, the rudely profaned and trampled grave, the gap in the earth where the stone had been. “For me, horrible—but, my dear God! what must it have been for you!”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; I am his mother!” She was moved because Anne did not pretend to share the maternal intensity of her feelings. “Only a mother could know. Archie says I must not think about it; but that is beyond my power—I must think about it. Who could have done it? I can’t see any reason in the theft. Do you think it could have been to annoy us, or to get a reward? I—”\n\u003cbr\u003e \n\u003cbr\u003e “No,” said Anne. “Neither.”\n\u003cbr\u003e \n\u003cbr\u003e “Then what could it have been? There must have been a motive.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, there must have been.”\n\u003cbr\u003e \n\u003cbr\u003e “And what? We are liked, I think, on the river. “We do try to help these people.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “Who could have done it?”\n\u003cbr\u003e \n\u003cbr\u003e “Joe Colkett!”\n\u003cbr\u003e \n\u003cbr\u003e 345“Archibald! Archibald!” cried Margaret, instantly rising. He came out at once.\n\u003cbr\u003e \n\u003cbr\u003e “What is it?”\n\u003cbr\u003e \n\u003cbr\u003e “Anne says Colkett took it!”\n\u003cbr\u003e \n\u003cbr\u003e “What does this mean, Anne?” he said.\n\u003cbr\u003e \n\u003cbr\u003e “Only this: Rose told us yesterday, you remember, that Colkett had been to see Dorothy about an inscription for a board to set over his wife’s children. You heard her speak of it.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; but what then?”\n\u003cbr\u003e \n\u003cbr\u003e “That man is the thief!”\n\u003cbr\u003e \n\u003cbr\u003e “You are a most astonishing woman, Anne. What reason have you? You must have a reason.”\n\u003cbr\u003e \n\u003cbr\u003e “I shall have; but now, as yet, I have none.”\n\u003cbr\u003e \n\u003cbr\u003e “I am sorry, then. You have quite upset Margaret.”\n\u003cbr\u003e \n\u003cbr\u003e “No. I saw the man take it.”\n\u003cbr\u003e \n\u003cbr\u003e “Saw him? Nonsense—I beg pardon, dear, I don’t quite mean that.” He was nice always in his home ways with the women he loved. “I mean that you have spoken unadvisedly.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, I had no advice from within or without, for that matter; but I know that man is the thief.”\n\u003cbr\u003e \n\u003cbr\u003e “It is a serious charge.”\n\u003cbr\u003e \n\u003cbr\u003e “It is. When you come to think it over, you will agree with me.”\n\u003cbr\u003e \n\u003cbr\u003e Lyndsay was silent a moment. Then he called, “Tom! Tom! I am going up to the Island Camp; put the canoe in the water.”\n\u003cbr\u003e \n\u003cbr\u003e “What are you going to do, Archie!” asked Margaret.\n\u003cbr\u003e \n\u003cbr\u003e “I want to talk to Carington. He knows all these people; has known them for years.”\n\u003cbr\u003e \n\u003cbr\u003e 346“Shall you tell him what my own belief is?” said Anne.\n\u003cbr\u003e \n\u003cbr\u003e “Certainly! Why not?”\n\u003cbr\u003e \n\u003cbr\u003e “But,” exclaimed Margaret, “do you not think—”\n\u003cbr\u003e \n\u003cbr\u003e “No. No, dear, I don’t think at all as yet. I have no material for thinking—very little, at least.” He spoke with unhabitual impatience. “Evidence is what we want.”\n\u003cbr\u003e \n\u003cbr\u003e He was annoyed by this mysterious crime in the midst of his idle hours; troubled by his wife’s distress; and finally, if but to a slight extent, irritated at Anne’s unreasoning dash at a decisive conclusion. Perhaps he was the more disturbed because, on hearing her, he had at once begun to put together facts, always within his own knowledge, which he felt should have caused him to have gone, under guidance of reason, toward the goal which she had reached at a bound.\n\u003cbr\u003e \n\u003cbr\u003e “I shall be back in three or four hours. Do not keep the dinner waiting. Good-by.”\n\u003cbr\u003e \n\u003cbr\u003e “But, Archibald, do listen to me. It is not about—about this—” And she followed him as she spoke, and, at the edge of the cliff, said a few words hastily, but with earnestness.\n\u003cbr\u003e \n\u003cbr\u003e “No,” he said, so that Anne heard. “I see—I see, of course; but there is no help for it; and, after all, Carington is not a man—” And the rest was lost to Anne’s ear.\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps not,” said Margaret. “I suppose you know best.” And she went back to Anne.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1645/48643.html","bookId":1206,"creation":"Aug 2, 2019 2:34:35 PM","modification":"Aug 2, 2019 2:34:35 PM"}
