{"id":72592,"no":10,"title":"Page 10","content":"\u003cp\u003e“My mom was there when the cops came for me.” Spencer thought about the horrific scene at the house. “You should have seen the look on her face.”\u003c/p\u003e\n\u003cp\u003eEmily looked shiftily back and forth. “Why now?”\u003c/p\u003e\n\u003cp\u003eAria laid her head on the table. “Maybe I’m being punished for trying to get answers out of Noel.”\u003c/p\u003e\n\u003cp\u003e“No, it’s because I went to The Preserve,” Emily insisted. Spencer looked at her, surprised. Emily filled her in.\u003c/p\u003e\n\u003cp\u003e“Maybe it’s because I told Mike,” Hanna murmured.\u003c/p\u003e\n\u003cp\u003eSpencer felt a lump in her throat. “I’m to blame, too. I tracked down the building from that surveillance photo. The one that had Ali in it.”\u003c/p\u003e\n\u003cp\u003eHanna’s head whipped up. “You did? What happened?” Her voice rose in volume, and she clapped her mouth shut.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you say anything?” Aria said under her breath.\u003c/p\u003e\n\u003cp\u003eSpencer hunched her shoulders and looked at the others. “Ali wasn’t there. I don’t think she’d ever been there. I guess it was a trap all along.”\u003c/p\u003e\n\u003cp\u003e“We never should have pursued any of this,” Emily hissed. “Noel wasn’t punishment enough—Ali needed to make us pay. And she had all the ammo she needed.”\u003c/p\u003e\n\u003cp\u003e“I guess we just lost sight of everything A knew about us,” Aria said softly.\u003c/p\u003e\n\u003cp\u003eSpencer looked around. “But why are we here, at the FBI? I mean, yes, Emily and Aria, it makes sense for you guys. But why did they bring all of us here? Why are we in the same room?”\u003c/p\u003e\n\u003cp\u003eEmily picked at her fingernail. “Well, you know who works for the FBI. Fuji.”\u003c/p\u003e\n\u003cp\u003eSpencer pressed her tongue hard against the roof of her mouth. Jasmine Fuji was an FBI agent who’d been asking the girls questions about Tabitha Clark’s death. Jamaica? she mouthed.\u003c/p\u003e\n\u003cp\u003eAria looked around nervously. “Maybe they found out about . . . you know.” She drew a T on the table with her finger. T for Tabitha.\u003c/p\u003e\n\u003cp\u003e“Maybe Ali told them,” Emily said.\u003c/p\u003e\n\u003cp\u003e“But we have proof that we didn’t do it,” Hanna said. “Ali texted us and said she killed her. We’ll just show them that.”\u003c/p\u003e\n\u003cp\u003e“How can we?” Emily said, her eyes full of fear. She drew something on the table with her finger, too. The letter A.\u003c/p\u003e\n\u003cp\u003eSpencer knew what she meant. If they told about A, A might hurt someone else.\u003c/p\u003e\n\u003cp\u003eAria sat back in the chair, making it creak. “I wish there was a way to talk but to remain protected. Besides the witness protection program.”\u003c/p\u003e\n\u003cp\u003eSpencer licked her lips. “We could request immunity,” she whispered. “Make them promise to protect us if we come forward about A.”\u003c/p\u003e\n\u003cp\u003eEmily looked nervous. “But what if they say no . . . and then manipulate it out of us anyway?”\u003c/p\u003e\n\u003cp\u003e“Or what if they say they’ll protect us but don’t follow through with it?” Aria asked.\u003c/p\u003e\n\u003cp\u003e“Yeah, I don’t think that sounds like a good plan,” Hanna said, biting a nail.\u003c/p\u003e\n\u003cp\u003e“It is a good plan,” Spencer insisted. “I see it on Law and Order all the time.”\u003c/p\u003e\n\u003cp\u003eFootsteps rang out in the hall, growing closer. Then the door opened, and a woman walked through. Everyone jumped. “Hello, girls,” a familiar brisk voice said.\u003c/p\u003e\n\u003cp\u003eIt was Agent Fuji. She shut the door behind her. Spencer swallowed hard. This was about Tabitha.\u003c/p\u003e\n\u003cp\u003eFuji’s black hair was sleekly styled as usual, but there was something tired-looking about her face. When she pulled out a chair to sit, one of her nails broke. “Let’s talk,” she said. Fuji glanced at each of them as she sat down.\u003c/p\u003e\n\u003cp\u003eNo one said a word. Hanna’s hair hung in her face. Aria wiped tears with her sleeve. Spencer had picked away all the skin on the side of her thumbnail. She wondered if Fuji had heard everything.\u003c/p\u003e\n\u003cp\u003eAgent Fuji settled back in her chair and jingled her keys. Her keychain held a picture of a West Highland terrier with pink bows in its hair. Spencer hadn’t pinned Fuji as the type who liked dogs.\u003c/p\u003e\n\u003cp\u003eOutside, another door slammed. A phone rang. A heater clicked on with a rattle. “Okay,” Fuji said finally. “Hit and run. Aiding and abetting. Dating a fugitive. And international art theft. And it all comes out at once? It seems like an awful coincidence. You girls could face serious prison time. This will ruin your father’s campaign, Hanna. If you’ve gotten accepted to colleges, they’ll probably renege the offers. You’re ruining your lives. Did you even think about that?”\u003c/p\u003e\n\u003cp\u003eNo one dared to look at Fuji. Spencer’s heart banged in her chest.\u003c/p\u003e\n\u003cp\u003e“I’ve been working with the state and local police forces on this Clark case, and I think there’s stuff you’re hiding from me about that, too.” Fuji folded her hands. “You’d better start talking—about something.”\u003c/p\u003e\n\u003cp\u003eHanna shifted. Aria wiped another tear from her cheek. Spencer cleared her throat and glanced around the table. “Anderson Cooper,” she said in a calm, even voice. Their secret code for Ali.\u003c/p\u003e\n\u003cp\u003e“Spence, I don’t know.” Aria looked pained.\u003c/p\u003e\n\u003cp\u003eHanna gulped. “Yeah, maybe we should—”\u003c/p\u003e\n\u003cp\u003e“We have to,” Spencer interrupted. “It’s the only way. Just trust me on this.”\u003c/p\u003e\n\u003cp\u003eEveryone clammed up. Fuji stared at them, waiting. Then Aria sighed. “Fine. Let’s do it.”\u003c/p\u003e\n\u003cp\u003eAfter a moment, Hanna ever-so-faintly nodded. Emily did, too. Spencer glanced around the room, seeing things for the very last time before they finally came clean about Tabitha. Before their lives, possibly, changed forever. But she knew it was the right thing to do. They were drowning by themselves. They needed help.\u003c/p\u003e\n\u003cp\u003eShe leaned forward and gazed at Fuji. “Look. We’re not saying that what we did was right, but we messed up, and we’re sorry about what we did. But there are reasons why we haven’t come clean. And we do have more information on Tabitha, but we haven’t been able to tell you.”\u003c/p\u003e\n\u003cp\u003e“Why not?” Fuji asked sharply.\u003c/p\u003e\n\u003cp\u003e“Because it hasn’t been safe,” Spencer explained. “We’re being threatened. What we know is really, really dangerous. So if we say something, we want something in return.”\u003c/p\u003e\n\u003cp\u003e“Go on.” Fuji folded her hands. “I’m listening.”\u003c/p\u003e\n\u003cp\u003e“We need to make sure you’ll keep us safe,” Spencer said firmly. “We don’t want anything to happen to us or our families.”\u003c/p\u003e\n\u003cp\u003eFuji nodded. “All right. We can arrange that.”\u003c/p\u003e\n\u003cp\u003e“And we also want our charges dropped. Everything we did—the drugs, the theft, the secret communication with the fugitive, and the accident—it needs to be wiped clean from our records.”\u003c/p\u003e\n\u003cp\u003e“Spencer!” Emily cried.\u003c/p\u003e\n\u003cp\u003eAria covered her eyes.\u003c/p\u003e\n\u003cp\u003eBut Spencer didn’t apologize or renege the demand. She adopted the tactic she used when she used to play forward in field hockey: stare down your opponent during face-off. Don’t let them see you sweat. Don’t back down. “That’s what we want. Can you do that for us?”\u003c/p\u003e\n\u003cp\u003eFuji was the first to blink. “Okay. But whatever you have, it had better be good.”\u003c/p\u003e\n\u003cp\u003eSpencer took a breath. She hadn’t thought Fuji would actually go for it.\u003c/p\u003e\n\u003cp\u003eThen she explained what they knew, including how they’d accidentally pushed Tabitha off the balcony but didn’t kill her. They couldn’t tell anyone the truth, though, because of how it looked. And because someone was threatening them.\u003c/p\u003e\n\u003cp\u003eAgent Fuji tented her fingers. “So there’s another A?”\u003c/p\u003e\n\u003cp\u003eEmily glanced at the others. “More than one, we think.”\u003c/p\u003e\n\u003cp\u003eFuji folded her hands. “And who do you think your stalker might be?”\u003c/p\u003e\n\u003cp\u003eAgain, everyone exchanged a glance. Aria cleared her throat. “Alison,” she said loudly.\u003c/p\u003e\n\u003cp\u003eFuji widened her eyes. “I see.”\u003c/p\u003e\n\u003cp\u003eSpencer launched into an explanation of exactly why they thought A was Ali and how all the pieces fit. “Wait a minute,” Agent Fuji interrupted, when they got to that part about Emily’s baby. “You think Alison killed Gayle Riggs?”\u003c/p\u003e\n\u003cp\u003eSpencer nodded.\u003c/p\u003e\n\u003cp\u003eFuji squinted hard. “But in the police notes, you girls said it sounded like A spoke to the person who shot her.”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Emily said. “We heard Gayle talking to someone. Kind of like, What are you doing here? And then there was the shot.”\u003c/p\u003e\n\u003cp\u003eFuji’s brow furrowed. “So perhaps Gayle knew Alison?”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Spencer said. “Or maybe she knew her helper.”\u003c/p\u003e\n\u003cp\u003e“Do you have any idea who her helper might be?”\u003c/p\u003e\n\u003cp\u003eThe girls looked at one another. “We had a lot of theories,” Spencer said. “Graham Pratt for a while. And then Noel Kahn.”\u003c/p\u003e\n\u003cp\u003e“Noel?” Fuji cocked her head. “What does he have to do with this?”\u003c/p\u003e\n\u003cp\u003eSpencer opened her mouth to explain, but Aria caught her arm. “It was a false lead,” she said quickly. A look flashed across her face that said, Let’s not rat out Noel right now. Spencer just shrugged.\u003c/p\u003e\n\u003cp\u003e“This is really, really serious, girls,” Fuji said. “We’re talking about a serial killer. I’m glad you finally came to me about this—there’s no way you can handle this on your own, and you shouldn’t have to.”\u003c/p\u003e\n\u003cp\u003eNo one spoke. Spencer held her breath.\u003c/p\u003e\n\u003cp\u003e“With your permission, I’d like to keep your phones. I want to look at all of these texts A has sent. There are ways to track which phone they’re being sent from, even from what part of the Philadelphia area. Give me any other evidence you can think of, too. Things these people might have touched. Places they might have been. We need every tip you can get.”\u003c/p\u003e\n\u003cp\u003eSpencer brightened. “I think Ali and her helper trashed my stepfather’s model home.”\u003c/p\u003e\n\u003cp\u003eFuji nodded. “Maybe there are fingerprints.”\u003c/p\u003e\n\u003cp\u003e“I’m also worried that Ali might have done something to a girl named Iris Taylor,” Emily added, explaining how Ali had known Iris and that Iris had gone missing after Emily asked her questions.\u003c/p\u003e\n\u003cp\u003eFuji wrote Iris’s name on a notepad. “We’ll look into her.”\u003c/p\u003e\n\u003cp\u003eHanna tentatively raised a hand. “We have a lot more texts, but we’ll have to get them off our old phones from home. We switched phones when we figured out A was tracking us.”\u003c/p\u003e\n\u003cp\u003e“A lot of notes aren’t on our phones at all,” Spencer added, thinking of the very first missive they’d received from this A. It had been a postcard inside Ali’s mailbox—Jamaica is beautiful this time of year! Too bad you can’t ever go back.\u003c/p\u003e\n\u003cp\u003e“That’s fine,” Fuji said. “Collect everything and bring it back to me as soon as you can. And as far as security goes, you have my personal promise for a twenty-four-seven security team on all of you—and your families—until we crack the case. A won’t be able to get to you anymore.”\u003c/p\u003e\n\u003cp\u003eAria blinked hard. “So you’re really letting us go?”\u003c/p\u003e\n\u003cp\u003eFuji nodded. “I’ll talk to my partners and the state police and let them know that your charges are dropped.”\u003c/p\u003e\n\u003cp\u003e“So my dad won’t know about this?” Hanna bleated.\u003c/p\u003e\n\u003cp\u003eEmily’s hands trembled. “I’m not in trouble with the FBI?”\u003c/p\u003e\n\u003cp\u003e“What you gave me is very important. I need to hold up my end of the bargain,” Fuji said as she stood. “However, if you receive another A note, I want you to forward it to me immediately. But I ask that you tell no one about what we’re doing or why you have a security detail. The less people know, the better. Is that clear?” \u003c/p\u003e","sourceLink":"https://allnovel.net/deadly-pretty-little-liars-14/page-10.html","bookId":2390,"creation":"Oct 5, 2019 10:24:50 AM","modification":"Oct 5, 2019 10:24:50 AM"}
