{"id":72599,"no":17,"title":"Page 17","content":"\u003cp\u003eAsher cocked his head and smiled at Aria. “Or you can take a look, if you like.”\u003c/p\u003e\n\u003cp\u003eHe set the portfolio on the desk and opened it up. Inside were a bunch of photographic images. All of them had an ethereal, out-of-focus quality to them, and most featured people caught in movement—jumping, spinning, flipping on a trampoline. Aria leaned down and inspected one picture of a little girl running through a sprinkler more closely. It wasn’t a photo at all but made of tiny pixels, like a mosaic.\u003c/p\u003e\n\u003cp\u003e“Whoa,” Aria said. “You’re a digital Chuck Close.”\u003c/p\u003e\n\u003cp\u003eA corner of Asher’s bow-shaped mouth rose. “A few reviewers have said that, too.”\u003c/p\u003e\n\u003cp\u003e“He’s one of my favorites,” Aria admitted. “I’ve tried to do pieces in his style, but I’m not talented enough.” She’d been inspired after going to a Chuck Close retrospective at the Philadelphia Museum of Art last summer. Noel had gone with her, spending hours there while she intently studied each work, not saying even once that he was bored.\u003c/p\u003e\n\u003cp\u003eShe stiffened. Don’t think about Noel, Aria chided silently, giving herself a mental slap. She cleared her throat. “Don’t take this the wrong way, but why are you in Rosewood?”\u003c/p\u003e\n\u003cp\u003eAsher raised his head and chuckled. “I’m in Hollis because I have a fellowship gig I have to fulfill. Before that, I was in San Francisco.”\u003c/p\u003e\n\u003cp\u003e“Really?” Aria picked up a coaster that featured a fly trapped in a blob of amber, kind of feeling sorry for the poor bug. “I’ve always wanted to go there.”\u003c/p\u003e\n\u003cp\u003e“It’s chill.” He stretched his long, sinewy arms over his head. “Tell the truth. You thought I was going to be one of those artists who painted Amish buggies and cow pastures, huh?”\u003c/p\u003e\n\u003cp\u003e“Well, maybe,” Aria admitted. Her gaze returned to Asher’s work again. “Have you had a lot of shows?”\u003c/p\u003e\n\u003cp\u003e“I have an agent in New York, so I’ve been lucky.” He lowered his long lashes. “A couple of celebs have been interested in my work, so that’s kind of cool.”\u003c/p\u003e\n\u003cp\u003eAria raised an eyebrow. “Anyone I’d know?”\u003c/p\u003e\n\u003cp\u003eAsher closed the portfolio. “A lot of indie musicians, old players in the art-gallery scene. The biggest name was probably Madonna.”\u003c/p\u003e\n\u003cp\u003e“The Madonna?” Aria couldn’t control her shriek. “Did you actually meet her?”\u003c/p\u003e\n\u003cp\u003eAsher looked embarrassed. “Oh no. I’ve talked to her on the phone. She’s so stuck-up with that fake British accent.”\u003c/p\u003e\n\u003cp\u003e“Oh, right,” Aria said, trying to regain her cool.\u003c/p\u003e\n\u003cp\u003eAsher closed the portfolio lid. “So you’re an artist, too?”\u003c/p\u003e\n\u003cp\u003eAria fiddled with a stray lock of hair that had fallen out of her ponytail. “Oh, not really. Not seriously.” Her gaze darted to her own cardboard portfolio in the corner. It looked so shabby compared to Asher’s leather one. “There’s some stuff I’m still fiddling with.”\u003c/p\u003e\n\u003cp\u003eAsher’s blue eyes lit up. “Can I check it out?”\u003c/p\u003e\n\u003cp\u003eBefore Aria could give permission, Asher strode over to the folder, lifted it up, and laid it next to his own on the desk. When he opened to the first piece, Aria’s face felt hot. It was a colorful, surreal painting of Noel. His skin was purplish. His hair was green. His body melted into a puddle. But it was Noel all the same—his eyes, his smile, his tufty hair. There was a hum inside her chest.\u003c/p\u003e\n\u003cp\u003eAsher flipped to another image of Noel. Then another. Aria glanced away, suddenly unable to endure them. Noel used to tease her about painting him over and over; he’d asked if he could have her work after the end-of-the-year art show at Rosewood Day. “Will you bring them to college with you?” Aria had joked. “Duh,” Noel had answered. “I’ll hang them in my room, next to my roommate’s porn pinups.” She supposed that wouldn’t be happening now.\u003c/p\u003e\n\u003cp\u003e“Are you okay?”\u003c/p\u003e\n\u003cp\u003eAria blinked hard. To her horror, tears had filled her eyes. She tried to smile. “Sorry. All those paintings are of an ex. I’m still getting over him. I actually hate all this stuff. I should burn it.”\u003c/p\u003e\n\u003cp\u003eAsher peered at Noel’s face for a beat, then shut the folder. “I incorporate people I’m in love with in my paintings as well. It’s only human, you know?” He rolled toward her. “Don’t burn these. They could be worth something someday.”\u003c/p\u003e\n\u003cp\u003eAria looked at him crazily. “Yeah, right.”\u003c/p\u003e\n\u003cp\u003e“I’m serious. These are amazingly deep. You’re really talented.”\u003c/p\u003e\n\u003cp\u003eThe sun emerged from a cloud and streamed in through the window. Aria swallowed hard, not knowing whether she should smile or burst into tears. “Thank you,” she said softly.\u003c/p\u003e\n\u003cp\u003eAsher laced his fingers together. “You should keep at it. Show me stuff as you finish it. I could put you in touch with my agent.”\u003c/p\u003e\n\u003cp\u003e“What?” Aria blurted.\u003c/p\u003e\n\u003cp\u003eBut Asher just smiled confidently. “I know talent when I see it.” Then he grabbed the stack of papers from the desk, slipped them into his portfolio, and tucked the whole thing under his arm. “Anyway, I’ll be in touch. Have your mom call me.”\u003c/p\u003e\n\u003cp\u003e“I will,” Aria said.\u003c/p\u003e\n\u003cp\u003eA warm, pleasant feeling enveloped her as she watched him step off the porch and lope down the street. She wanted to call someone right now and tell them a famous artist had encouraged her to paint more—imagine if he really hooked her up with his agent! Then she realized who it was she wanted to call: Noel.\u003c/p\u003e\n\u003cp\u003eBut as Asher turned the corner, her mood shifted. The street was so dark and shadowless, suddenly. A car swished past a side street and didn’t slow. A cat meowed in an unseen alley.\u003c/p\u003e\n\u003cp\u003ePing.\u003c/p\u003e\n\u003cp\u003eHer phone vibrated in her palm. Aria flinched and stared at the screen. ONE NEW MESSAGE FROM ANONYMOUS. She opened the text.\u003c/p\u003e\n\u003cp\u003eDon’t get too close to your new little artist friend, Aria. Or I’ll just hurt him, too. —A\u003c/p\u003e\n\u003cp\u003eAria’s stomach clenched. How did Ali know? Was she listening? Was she just going to take down everyone Aria knew?\u003c/p\u003e\n\u003cp\u003eThere was a way to solve this. She hit FORWARD and sent the note to Fuji. Then she stuffed her phone into her bag and willed herself to walk back into the gallery with her head held high. You’re safe, she repeated over and over in her mind. It’s all over. You’re finally going to move on.\u003c/p\u003e\n\u003cp\u003eAt least she hoped so.\u003c/p\u003e\n\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eHANNA MARIN, POSTER CHILD\u003c/p\u003e\n\u003cp\u003eThat afternoon, Hanna stared into the impassive eye of a TV camera lens. When the red light that indicated they were filming began to blink, she smiled brightly. “And that’s why I stand behind Tom Marin’s Zero-Tolerance Plan,” she said clearly and slowly. She was six takes into the Tom and Hanna Marin Families Against Drunk Driving PSA, and this one was going to be a keeper.\u003c/p\u003e\n\u003cp\u003eHer father, who sat on the stool next to her, recited his lines in a presidential voice. The cameras did a close-up on him, and Hanna peeked at her reflection in the mirror that was set up on the other side of her father’s campaign headquarters-turned-studio. She wore a navy-blue sheath dress and a pearl necklace she’d borrowed from her mom. Her auburn hair had been professionally blown out, cascading in a smooth waterfall down her back. Her green eyes sparkled, and her skin glowed, thanks to an expensive cream in the makeup artist’s tool bag. Hanna definitely had to get its name.\u003c/p\u003e\n\u003cp\u003eThe camera turned back to Hanna. “We need to keep teens of Pennsylvania safe,” she said emphatically. “I know this not only as a teen of Pennsylvania . . . but also as a victim of stalking and drunk driving.”\u003c/p\u003e\n\u003cp\u003ePause. Smile bright. Look earnest and patriotic. “And . . . cut!” said the director, who was perched on a stool behind the camera. “I think that one’s a winner!”\u003c/p\u003e\n\u003cp\u003eEveryone in the room applauded. Mr. Marin patted Hanna’s shoulder. “Good work.”\u003c/p\u003e\n\u003cp\u003e“That really was amazing,” Kate agreed, appearing by Hanna’s side. “You’re a natural in front of the camera, Han. I’m so impressed.”\u003c/p\u003e\n\u003cp\u003e“She gets that from me,” boasted Hanna’s mom. Hanna was pretty sure her mom and Kate had never been together in such a small room, but they seemed to be getting along okay. Isabel, however, was standing in the opposite corner gripping a clipboard so tightly, Hanna was surprised she hadn’t bent it in half by now.\u003c/p\u003e\n\u003cp\u003eSidney, Mr. Marin’s top aide, approached. “I’ve been thinking. Let’s spin this so that the bar that served Hanna and Madison is to blame. It will test well with our voters, Tom,” he said. “People will think, If they would have been tougher about carding, this accident never would have happened.”\u003c/p\u003e\n\u003cp\u003e“Exactly.” Then Mr. Marin’s expression grew serious. “What was the name of that bar that served you? We should shut them down. Make an example of them.”\u003c/p\u003e\n\u003cp\u003e“The Cabana.” Hanna had thought a lot about the South Street dive she’d ducked into that fateful day. The smell of smoke and the twangy country song washed back to her. So did Madison’s boozy breath and the way the soles of Hanna’s shoes were sticky after walking across the bathroom floor.\u003c/p\u003e\n\u003cp\u003e“Got it.” Mr. Marin tapped something into his iPhone. “Okay, Han. Ready for Phase Two?”\u003c/p\u003e\n\u003cp\u003eHanna shifted uneasily. Phase Two was apologizing to Madison at Immaculata University, where she’d transferred after the accident. Madison had agreed to speak to Hanna, but it still made Hanna feel uneasy. If only they could skip it.\u003c/p\u003e\n\u003cp\u003eSensing Hanna’s apprehension, Mr. Marin wrapped his arm around her. “I’ll be with you the whole time, honey, I promise. We’ll do it together.”\u003c/p\u003e\n\u003cp\u003eIsabel rushed forward. “But Tom, we’ve got that meeting with your new donors today at four.”\u003c/p\u003e\n\u003cp\u003eMr. Marin set his jaw. “Reschedule it.”\u003c/p\u003e\n\u003cp\u003eIsabel’s face clouded. “You lost a huge donation when Gayle Riggs died—we need the cash.” She cleared her throat. “Speaking of Gayle, did you hear the news? There was a break in the case. The police are looking through her house again for new evidence.”\u003c/p\u003e\n\u003cp\u003eHanna shifted her weight. Of course there was a break in the case. It was from them.\u003c/p\u003e\n\u003cp\u003eMr. Marin started for the door. “I’m sure the donors can wait a day, Iz. I told Hanna I’d do this with her, and I want to honor that.”\u003c/p\u003e\n\u003cp\u003e“Good for you, Tom,” Hanna’s mom gushed. She shot Isabel a snarky smile. A deep wrinkle appeared between Isabel’s eyes. Hanna had a feeling that if they didn’t get out of here soon, it would devolve into an episode of Real Housewives: Rosewood, PA.\u003c/p\u003e\n\u003cp\u003e“I’ll be ready in a second,” Hanna said quickly to her father. “I just want to call Mike.” She hadn’t heard from him all day, and she wanted to make sure he was okay. Usually, Mike texted her nonstop, even during school.\u003c/p\u003e\n\u003cp\u003eShe stepped out of her father’s office, stood on the walkway that overlooked a large atrium with a burbling fountain, and dialed Mike’s number. Once again, it went to voicemail. Hanna hung up without leaving a message. Where was he?\u003c/p\u003e\n\u003cp\u003eWhen a door slammed shut, Hanna jumped. It echoed so loudly, like it was right behind her. Just being in this building gave her the creeps; a few months ago, A—Ali—trapped Hanna in the elevator. The lights had gone out, the power had died, and when Hanna had gotten free and on solid ground again, she’d found the elevator control box wide open, its levers and switches tampered with. Ali’s telltale vanilla perfume had wafted through the air, taunting her nostrils. If only Hanna had called the cops then. \u003c/p\u003e","sourceLink":"https://allnovel.net/deadly-pretty-little-liars-14/page-17.html","bookId":2390,"creation":"Oct 5, 2019 10:24:50 AM","modification":"Oct 5, 2019 10:24:50 AM"}
