{"id":72609,"no":27,"title":"Page 27","content":"\u003cp\u003eEmily stepped toward her mom. “It’s so nice to see you home,” she said shakily. “How are you feeling?”\u003c/p\u003e\n\u003cp\u003eMrs. Fields stared at her hands. All at once, her breathing began to quicken.\u003c/p\u003e\n\u003cp\u003e“Tired?” Emily tried. “Did they feed you okay in the hospital?”\u003c/p\u003e\n\u003cp\u003eMrs. Fields was actually wheezing now. Carolyn let out a whimper. “Dad, do something.”\u003c/p\u003e\n\u003cp\u003e“She shouldn’t be here,” Beth said quickly, sharply.\u003c/p\u003e\n\u003cp\u003eMr. Fields rose from the TV stand. He had disconnected the cable box from the television. Were they so broke that they couldn’t even afford cable anymore? “You need to go back upstairs,” he said firmly to Emily, his eyes cold.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, everyone,” she eked out. “I’m really, really sorry.”\u003c/p\u003e\n\u003cp\u003eThen she fled back upstairs, holding in her sobs only until she was safely behind her closed door. Her phone was flashing on the bed. GOOGLE ALERT FOR THE PREPPY THIEF, said the screen. Emily scanned the headlines. Jordan’s sentencing trial was scheduled for next week. Experts say her sentence will be somewhere between twenty and fifty years.\u003c/p\u003e\n\u003cp\u003eEmily threw the phone against the wall. Jordan would have been fine if it weren’t for Emily. She’d ruined her life, too.\u003c/p\u003e\n\u003cp\u003eAll at once, she thought of Derrick, her pal from last summer. How many times had he held her hand in the break room when she’d poured her heart out about how scared she was about having the baby? How many times had she called him in the middle of the night because she couldn’t sleep? She’d seen him not too long ago, when A was tormenting her about Gayle, so she knew he was still around. Maybe he’d listen. Maybe he’d understand.\u003c/p\u003e\n\u003cp\u003eShe scooped up her phone from the carpet and dialed his number, but the call went to voicemail. Emily hung up without leaving a message. What if Derrick saw her number and hit IGNORE? Maybe he thought she was a killer, just like everyone else did. Maybe he was still upset that she’d cost him his job with Gayle, because she hadn’t given Gayle her baby—the last time she’d seen him, he’d mentioned it. She’d negatively impacted Derrick’s life, too.\u003c/p\u003e\n\u003cp\u003eShe was the opposite of King Midas—everything and everyone she touched turned rotten, and there was so little now she could fix. Suddenly, something occurred to her. A lot of this was out of her control, but there was a way she could make her family happy again, get their money back, and heal their mother. She could disappear completely.\u003c/p\u003e\n\u003cp\u003eBut did she dare even think it?\u003c/p\u003e\n\u003cp\u003eEmily squeezed her pillow hard. If she weren’t here right now, if she weren’t a constant stressor, her mom would recover. But when she thought about vanishing, she didn’t mean simply leaving town. It was a bigger, scarier, more definite decision than that.\u003c/p\u003e\n\u003cp\u003eShe’d save her family. And who would miss her?\u003c/p\u003e\n\u003cp\u003eA laugh exploded from downstairs. Someone opened a door and shut it again. Emily rose from her bed and stood in the middle of the room, fingertips twitching. All at once, she couldn’t get the thought out of her mind. It made so much sense. She couldn’t live like this. She couldn’t let her family suffer. She couldn’t go to Jamaica, either. Maybe the rumors weren’t swirling because Ali and her helper planted them. Maybe everyone thought it was the next logical step.\u003c/p\u003e\n\u003cp\u003eEmily shut her eyes and thought for a moment. The Rosewood covered bridge came to mind. Most of the bridge had a roof over it, the inside walls coated with graffiti, but there was a tiny walkway on the outside that was open to the water below. The stream was deep this time of year from all the melted snow. It would still be cold, too. Numbing.\u003c/p\u003e\n\u003cp\u003eHeart pounding, she pulled on jeans and a T-shirt. Then, gathering up her courage, she hefted open her window, crept onto the roof, climbed onto the oak tree, and slid down the trunk, the way she always did when she snuck out. The bridge was about a twenty-minute walk. By the time her father checked on her—if he even did check on her—she’d be long gone.\u003c/p\u003e\n\u003cp\u003e27\u003c/p\u003e\n\u003cp\u003eFRIENDS DON’T LET FRIENDS JUMP\u003c/p\u003e\n\u003cp\u003eThat same morning, Spencer and Melissa stood on the Rosewood Day Commons. All one hundred and six of Spencer’s senior classmates, dressed in white and black graduation gowns and blue-tasseled caps, sat on folding chairs in front of a makeshift stage. Spencer, however, was in a plain cotton dress and wore no cap at all.\u003c/p\u003e\n\u003cp\u003eFaces of kids she’d spent the last twelve years with lined the rows. Phi Templeton sat next to Devon Arliss. Spencer’s field-hockey friend, Kirsten Cullen, giggled with Maya St. Germain. Noel Kahn, still looking a little weak, sat with his lacrosse buddies. Naomi Zeigler, Riley Wolfe, and Klaudia Huusko whispered to one another. Cast members from countless school plays Spencer had starred in fiddled with their tassels. Her cohorts on newspaper and yearbook fanned themselves with their programs. None of them glanced back at her. There weren’t even four empty seats, indicating where Spencer, Aria, Emily, and Hanna should be sitting. It was like Rosewood Day had wiped them clean from its memory.\u003c/p\u003e\n\u003cp\u003eSpencer looked around, wondering if any of the others had come. She finally spied Aria and her mother on the other side of the field. Hanna was under the bleachers. Emily wasn’t anywhere. Maybe she had the right idea.\u003c/p\u003e\n\u003cp\u003ePrincipal Appleton cleared his throat on the stage. “And now, I present to you, our valedictorian, Mason Byers.”\u003c/p\u003e\n\u003cp\u003eThere was thundering applause as Mason rose from a seat in the front row and took the stage. Spencer shook her head ever so slightly. Mason Byers? Sure, he was smart, but she had no idea he was next in line for valedictorian. She was supposed to be up there right now. She’d had a speech prepared since sophomore year. Knowing Mason, who never stressed about anything, he’d probably written the speech last night.\u003c/p\u003e\n\u003cp\u003eMelissa reached over and squeezed Spencer’s hand. “It’s going to be okay.”\u003c/p\u003e\n\u003cp\u003eSpencer swallowed a lump in her throat, grateful to have someone next to her who understood how painful this was. But it was too much. “Let’s get out of here,” she grumbled, walking toward the parking lot.\u003c/p\u003e\n\u003cp\u003eMelissa followed her. As they passed the big fountain in the front of the gym, she coughed. “Listen, we’re working on finding you a top-notch lawyer from Jamaica. Darren has some contacts down there, and so does Dad.”\u003c/p\u003e\n\u003cp\u003eSpencer pinched the bridge of her nose, hating that the lawyers weren’t even considering the possibility of trying the case in the United States anymore. “Do you know how long it takes for a case to go to trial in Jamaica?”\u003c/p\u003e\n\u003cp\u003e“I’ve gotten conflicting answers.” Melissa’s heels clicked on the sidewalk. “Some people said only a few months. Others said years.”\u003c/p\u003e\n\u003cp\u003eSpencer made a small whimper.\u003c/p\u003e\n\u003cp\u003eA cheer rang out from the Commons. Melissa stopped in the middle of the jammed parking lot. “I’m sorry,” she said with a pained look on her face. She glanced around the lot, then leaned closer. “If you do get sent to Jamaica, I’ll look for her after you’re gone. I don’t want to stop until she’s dead.”\u003c/p\u003e\n\u003cp\u003eSpencer shook her head. “Don’t. It’s awesome that you’d offer, but she’s dangerous. She’ll kill you, Melissa. I couldn’t live with that.”\u003c/p\u003e\n\u003cp\u003e“But . . .” Melissa trailed off and sighed. “It’s just not fair.”\u003c/p\u003e\n\u003cp\u003eSpencer didn’t think it was fair, either. And this was so ironic: Just when she and Melissa were really, truly bonding, becoming the sisters Spencer had always hoped they’d be, her life was ending.\u003c/p\u003e\n\u003cp\u003eHer phone beeped loudly. Spencer looked at the ID. EMILY. As Melissa unlocked the car, Spencer answered it. There was no reply, only the sound of wind. “Hello?” Spencer said. “Em?”\u003c/p\u003e\n\u003cp\u003eAnd then she heard crying. The sobs were soft at first, but then they intensified.\u003c/p\u003e\n\u003cp\u003e“Emily!” Spencer shouted into the phone. “Em, are you there? Why aren’t you at graduation?”\u003c/p\u003e\n\u003cp\u003eThe sobbing stopped. There was some rustling, and then Emily sniffled loudly into the receiver. “S-Spencer?” she bleated.\u003c/p\u003e\n\u003cp\u003eSpencer sat up straighter. “Why aren’t you at graduation?”\u003c/p\u003e\n\u003cp\u003e“I just wanted to call to say good-bye.”\u003c/p\u003e\n\u003cp\u003eMore wind blew against the speaker. On Spencer’s end, the band had just struck up the beginning notes of “Pomp and Circumstance.”\u003c/p\u003e\n\u003cp\u003e“What’s going on?” All at once, it sounded like Emily was crying again. Spencer clutched the phone tighter. “Em. What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“I just can’t do this anymore,” Emily said. Her voice had no intonation to it. “I’m really sorry. I’m just . . . done.”\u003c/p\u003e\n\u003cp\u003eSpencer’s skin prickled. She’d heard Emily despair before, especially after she’d had her baby. But this seemed different, like Emily was in a dark, dark place and had no idea how to save herself.\u003c/p\u003e\n\u003cp\u003e“Where are you?” she demanded, gripping the phone hard. Melissa paused from getting into the car, giving Spencer a curious look.\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter.” There was a swish, maybe a car passing. “You’ll never get here in time.”\u003c/p\u003e\n\u003cp\u003eSpencer’s heart pounded. “What do you mean?” she demanded, even though, horrifyingly, she thought she knew. She spun in a circle, feeling helpless. “Em, whatever you’re thinking of doing, don’t. I know things are tough right now, but you have to hang on. Just tell me where you are, okay?”\u003c/p\u003e\n\u003cp\u003eEmily laughed bitterly. “I probably won’t even drown, you know. That’s the thing I was thinking just before I accidentally called you. I picked a bridge—and I’m a freaking swimmer.”\u003c/p\u003e\n\u003cp\u003e“A bridge?” Spencer’s eyes darted back and forth. Melissa was now standing next to her, her eyes wide and full of question. “Which one? The covered bridge?”\u003c/p\u003e\n\u003cp\u003e“No,” Emily said quickly, but Spencer could tell she was lying. “Don’t come, Spencer. I’m hanging up now.”\u003c/p\u003e\n\u003cp\u003e“Em, don’t!” Spencer screamed. The call ended. Spencer tried to dial Emily back, but it rang and rang, not even going to voicemail.\u003c/p\u003e\n\u003cp\u003e“Shit,” Spencer said out loud.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Melissa asked.\u003c/p\u003e\n\u003cp\u003eSpencer’s throat felt dry. “It’s Emily. She’s on a bridge. I think she’s going to . . .” She trailed off, but by the look on Melissa’s face, it was obvious she knew what Spencer meant.\u003c/p\u003e\n\u003cp\u003e“Which bridge?” Melissa demanded.\u003c/p\u003e\n\u003cp\u003e“The covered one on the other side of town,” Spencer said. She stared at Melissa. “Can I take your car?”\u003c/p\u003e\n\u003cp\u003eMelissa pursed her lips. “I’ll go with you.”\u003c/p\u003e\n\u003cp\u003eSpencer swung around. “I don’t want to involve you in this.” What if Ali had led Emily there? What if it was dangerous?\u003c/p\u003e\n\u003cp\u003eMelissa’s eyes were firm. “Stop it. Come on.”\u003c/p\u003e\n\u003cp\u003eOn the lawn, kids were marching up the stage and collecting their diplomas to thunderous applause. Spencer got into the car and slammed the door. Melissa started the engine and gunned out of the lot onto the mercifully empty street. “It won’t take us long to get there,” she said, staring steadily at the road.\u003c/p\u003e\n\u003cp\u003eAs Principal Appleton called out Chassey Bledsoe’s name, Spencer dialed 911. “A friend of mine is going to jump off the covered bridge in Rosewood,” she shouted to the dispatcher, when she answered. “Send an ambulance, now!” \u003c/p\u003e","sourceLink":"https://allnovel.net/deadly-pretty-little-liars-14/page-27.html","bookId":2390,"creation":"Oct 5, 2019 10:24:50 AM","modification":"Oct 5, 2019 10:24:50 AM"}
