{"id":72588,"no":6,"title":"Page 6","content":"\u003cp\u003e“We’re almost positive, yes.”\u003c/p\u003e\n\u003cp\u003e“So, basically, Ali has tried to kill you and my sister, like, six times by now, and she’s framing you for shit that she did. We need to find this bitch. Now.”\u003c/p\u003e\n\u003cp\u003eHanna glanced worriedly around the yard. “Spencer and Emily seem to think it’s a bad idea. The last time we looked for Ali, Noel ended up in the hospital.”\u003c/p\u003e\n\u003cp\u003eMike kicked at loose gravel in the flower bed. “So we’re just supposed to sit around?”\u003c/p\u003e\n\u003cp\u003eHanna peeked through the trees, hating how secluded her mother’s property was. Anybody could spy on them at close range, and they’d never know. “I’m just afraid that if we get any closer to where they are or who her helper is, someone else is going to get hurt. Maybe you. Maybe me.”\u003c/p\u003e\n\u003cp\u003eMike’s icy blue eyes narrowed. “I promise you, Hanna, that she will never, ever get you. She’ll have to get through me first. I’ll stand guard outside your bedroom if I have to. Stay by your side at every class. I’ll even come into your dressing room at Otter if you want.”\u003c/p\u003e\n\u003cp\u003eHanna gave him a playful shove. “You’d love coming into my dressing room at Otter.”\u003c/p\u003e\n\u003cp\u003e“Of course I would.” Mike leaned in and gave Hanna a gentle kiss on the nose.\u003c/p\u003e\n\u003cp\u003eHanna tilted her head up and kissed his lips. Something broke inside her. Salty tears flooded down her cheeks. “I’m so glad you figured it out,” she whispered in his ear.\u003c/p\u003e\n\u003cp\u003e“I’m glad, too,” Mike said.\u003c/p\u003e\n\u003cp\u003eThey kissed again, long and deep. Mike moved his hands up and down her back. She took small steps toward the side door, and in seconds, they were inside and lying on her mom’s couch in the den, making out furiously. The only thing Hanna wanted to think about was the feel of Mike’s lips on hers, the warmth of his hands, the weight of his body. She clung to him like he was a life raft, then found herself pulling her shirt over her head.\u003c/p\u003e\n\u003cp\u003eGoose bumps rose in her skin. Mike pulled off his shirt, too, revealing his strong chest and toned-from-lacrosse abs. He hesitated above her. Hanna knew, suddenly, what was going to happen next. It was something they’d danced around, teased each other about, plotted for weeks . . . but something they hadn’t exactly gotten around to. They would be each other’s firsts, after all, and they both seemed to realize how special the moment needed to be. But maybe here, in this empty house, on this terrible day, was exactly the right time.\u003c/p\u003e\n\u003cp\u003eHanna undid the button of her jeans. Mike’s eyes slid down to watch. “Is this okay?” he whispered, his voice stretched taut.\u003c/p\u003e\n\u003cp\u003e“Yes,” Hanna said, a wave crashing inside her. She grabbed Mike hard and pulled him closer than she ever had before.\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eA MISSING GIRL\u003c/p\u003e\n\u003cp\u003eThe moment Emily Fields burst out of the exit of Rosewood Day from picking up her assignments later that day, the unwelcome jeers began.\u003c/p\u003e\n\u003cp\u003e“Miss Fields! It’s Alyssa Gaden from the Philadelphia Sentinel! Do you have a moment?”\u003c/p\u003e\n\u003cp\u003e“Emily! Over here!”\u003c/p\u003e\n\u003cp\u003eFlashbulbs popped. Reporters shoved microphones at her face. Emily tried to scurry past them, but they followed her.\u003c/p\u003e\n\u003cp\u003e“Is it true you were the ones who found Noel Kahn in the storage shed behind the school?” the Sentinel woman shouted.\u003c/p\u003e\n\u003cp\u003e“Can you tell us what led you there?” a man screamed.\u003c/p\u003e\n\u003cp\u003e“Do you girls have a suicide pact?” another voice bleated. “Is that why you went out on that lifeboat?”\u003c/p\u003e\n\u003cp\u003eEmily winced. After the cruise ship had been bombed, everyone had evacuated on lifeboats. Emily and her friends had taken their own boat and sailed away from shore to bury Tabitha’s old necklace—A had managed to get it in Aria’s hands, and the girls didn’t want to be connected to it. But the lifeboat punctured out at sea, trapping them. A crew from the boat had rescued them, and the rumors had begun that they’d sailed out alone to die.\u003c/p\u003e\n\u003cp\u003eSomeone placed a hand on her shoulder, forming a barricade between Emily and the reporters. “No comment, no comment, no comment.”\u003c/p\u003e\n\u003cp\u003eIt was Principal Appleton. He draped an arm around Emily and hustled her up the slope to the student parking lot. “I’m so sorry, dear,” he said gently.\u003c/p\u003e\n\u003cp\u003e“Thanks,” Emily said gratefully.\u003c/p\u003e\n\u003cp\u003eAppleton left Emily at her car with a nod and a few encouraging words to hang in there. Emily slumped into the driver’s seat of the family’s Volvo wagon. For the past few years, she and her friends had been the target of media scrutiny—they even had a movie made about them called Pretty Little Killer. She was so, so, so sick of it.\u003c/p\u003e\n\u003cp\u003eIf those crows on the telephone pole lift off in the next ten seconds, everything will be fine, Emily thought, staring at the wires by the trees. The birds didn’t move. More crows joined them, hunched, black smears against the gray sky.\u003c/p\u003e\n\u003cp\u003eSighing, she pulled out her phone and checked her e-mail. The only one was from Hanna: Will you guys go to Graham’s funeral with me tomorrow? I need moral support.\u003c/p\u003e\n\u003cp\u003eAria had agreed. Emily wrote and said she would go, too. She exited out of her e-mail program, then looked longingly at the wallpaper on her home screen. It was a shot of her and her girlfriend, Jordan Richards, on the deck of the cruise ship as it pulled away from San Juan, Puerto Rico.\u003c/p\u003e\n\u003cp\u003eShe shut her eyes, quietly reliving the moment. She and Jordan had connected so quickly and intensely. Emily longed to talk to Jordan now, but Jordan was on the run from the FBI. In fact, they’d made plans to run away together, but A had called the Feds on the Preppy Thief. Now Jordan was hiding out somewhere in the Caribbean to escape arrest. If only Emily could contact her and arrange to meet up with her. What did she have here, after all? It would be the perfect escape from A. But there was no way to get in touch with Jordan.\u003c/p\u003e\n\u003cp\u003eOr was there?\u003c/p\u003e\n\u003cp\u003eShe tapped the Twitter app. Need to talk, she wrote in a direct message to Jordan’s secret Twitter alias. It’s important.\u003c/p\u003e\n\u003cp\u003eShe sent off the message and waited, figuring Jordan probably wouldn’t respond—she’d gotten back to Emily a few times, but she’d said over and over that it was really dangerous. But to her surprise, there was a new private message in her inbox within a minute. Is everything okay? Jordan wrote. I just saw that stuff on the news about that boy from Rosewood. He was your friend’s boyfriend, right?\u003c/p\u003e\n\u003cp\u003eEmily swallowed hard. He was, she wrote. But I’m okay, and so are my friends.\u003c/p\u003e\n\u003cp\u003eGood, Jordan said. I’m glad.\u003c/p\u003e\n\u003cp\u003eI miss you, Emily typed fast. I’m desperate to leave. Things super scary. Where are u?\u003c/p\u003e\n\u003cp\u003eA new message popped up after a moment. I wish I could tell you, but you know I can’t right now. It’s too risky.\u003c/p\u003e\n\u003cp\u003eEmily shifted her weight in the seat, peering through the windshield at a few kids traipsing up the hill to their cars. It had been a long shot, but she’d hoped Jordan would say yes. I’ll wait for you, she promised.\u003c/p\u003e\n\u003cp\u003eGood. I’ll wait for you, too.\u003c/p\u003e\n\u003cp\u003eJordan signed the message with an XO. Emily exited out of the Twitter program and tucked her phone back into her backpack. She felt like she did whenever she had a bite of her mom’s macaroni and cheese—she could never have just a little. If only she and Jordan could talk for hours instead of seconds. If only she knew where Jordan was.\u003c/p\u003e\n\u003cp\u003eHer phone beeped. It was a Google Alert e-mail for The Preserve at Addison-Stevens, Ali’s mental hospital—Emily had set up the alerts a while ago, just in case any pertinent news popped up about escaped patients who could potentially be Ali’s secret boyfriend. This e-mail was a press release about a new therapy pool that had been built on the grounds. A picture had been included. Emily stared hard at the patients in the pool, their faces blurred. None of them had white-blond hair like Iris Taylor, the girl she’d busted out of The Preserve last week, chauffeuring her around Rosewood and asking her about Ali, who’d been Iris’s old roommate. As far as Emily knew, Iris had returned to The Preserve after the prom. The Preserve didn’t allow e-mail, texts, or phone calls, though, so Emily didn’t know how she’d settled back in.\u003c/p\u003e\n\u003cp\u003eEmily paused. Hanna had known Iris during a short stint at The Preserve, and she’d seemed incredibly creepy—maybe even on Ali’s team. But Emily had seen a different side of her—she was just a sad, insecure girl who needed someone to pay attention to her. In a world where nearly everyone Emily knew ended up not being what they seemed, it was nice that Iris had turned out to be not so bad. Suddenly, Emily kind of missed her.\u003c/p\u003e\n\u003cp\u003eA thought took shape in her mind. Maybe we could go to The Preserve, Hanna had suggested at the hospital. Figure out if there was a guy patient whose name started with N. Maybe Iris knew who that was. Delving back into the investigation scared Emily to death, but what if there was a vital clue sitting right under her nose?\u003c/p\u003e\n\u003cp\u003eShe pulled out of the parking lot, charged with purpose. Instead of turning right, toward her family’s development, she took a left that led her down a winding back road, past the farmhouses and the ice-cream stand, and up the long hill. Traffic was light, and she arrived at The Preserve at Addison-Stevens sooner than she’d estimated. As her car climbed the steep hill to the fortlike hospital, all stone and brick and pointy turrets, an ambulance passed, going the other direction. Emily shivered, wondering who was inside—and why.\u003c/p\u003e\n\u003cp\u003eShe parked and strolled into the lobby, glancing at the familiar planters and fountains. A man standing at the front desk smiled at her. “Good afternoon.”\u003c/p\u003e\n\u003cp\u003eEmily nodded shakily. “I’m here to see Iris Taylor. I’m a friend. Emily Fields.”\u003c/p\u003e\n\u003cp\u003eThe man glanced at something on his screen, then frowned. “Iris is no longer a patient here.”\u003c/p\u003e\n\u003cp\u003eEmily cocked her head. “What does that mean?” Had Iris’s cruel parents checked her out? Had she been transferred to another hospital?\u003c/p\u003e\n\u003cp\u003eThe man looked back and forth, then leaned toward her. “Since you’re a friend, you should know. She’s been missing from her bed since yesterday morning.”\u003c/p\u003e\n\u003cp\u003eEmily blinked hard. Missing? Iris had been miserable here—maybe she’d escaped, just like she’d escaped with Emily last week. But something on the man’s face seemed tense, as if he’d left something out. “I-is she okay?”\u003c/p\u003e\n\u003cp\u003eAnother nurse came through the door just then, and the man clammed up. “It’s a private matter,” he said, glancing shiftily at the second nurse. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eEmily hitched forward. “Can you tell me if there was a male patient in the teenage wing a few years ago whose name started with N? He was friends with, um, Courtney DiLaurentis.”\u003c/p\u003e\n\u003cp\u003eThe man’s lips twitched. He glanced at Emily for a split second and then at the nurse who was standing close by. “I’m sorry,” he whispered.\u003c/p\u003e\n\u003cp\u003e“You can’t just let me look at a patient list for a second?” Emily pleaded. “It’s important.”\u003c/p\u003e\n\u003cp\u003eThe second nurse cleared her throat loudly. The man gave her a helpless shrug.\u003c/p\u003e\n\u003cp\u003eEmily turned away, her mind spinning. Iris had seemed so optimistic about returning to The Preserve to recover for good. Why would she have left so soon?\u003c/p\u003e\n\u003cp\u003eA horrible thought struck her. Iris had given Emily and the others vital information about Ali. Did Ali know?\u003c/p\u003e\n\u003cp\u003eThe automatic doors swished open, and Emily walked into the brick courtyard that led to the parking lot, her head spinning. Just as she passed the bench that bore the IN MEMORY OF TABITHA CLARK plaque, her phone beeped. She pulled it out of her pocket, hoping that somehow it was Iris, letting her know she was okay. But the text was from a jumble of letters and numbers. Emily’s heart fell. \u003c/p\u003e","sourceLink":"https://allnovel.net/deadly-pretty-little-liars-14/page-6.html","bookId":2390,"creation":"Oct 5, 2019 10:24:50 AM","modification":"Oct 5, 2019 10:24:50 AM"}
