{"id":93067,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Oh God … ,” he said in a voice that was hollow, empty of all emotion and certainly of all hope.\u003c/p\u003e\n\u003cp\u003eSwann stared up at the young man and he said it as well.\u003c/p\u003e\n\u003cp\u003e“Oh, God.”\u003c/p\u003e\n\u003cp\u003e— 15 —\u003c/p\u003e\n\u003cp\u003eOctober 12, 3:18 a.m.\u003c/p\u003e\n\u003cp\u003eNew York Presbyterian Hospital\u003c/p\u003e\n\u003cp\u003eZero Days until the V-Event\u003c/p\u003e\n\u003cp\u003eSwann sat on the edge of the gurney in a hospital johnnie and his socks. Everything hurt. His body, his mind, and his heart. He glanced at the wall clock. It was nine hours and change since the doors banged open and both rooms — interrogation room and observation room — had been flooded with cops. Everybody had been yelling; everybody had a gun.\u003c/p\u003e\n\u003cp\u003eFayne did not protest, did not resist, but the cops still clubbed him down and piled on him. They put plastic cuffs on his wrists and ankles. One of the officers stood over him with a Taser and dared him to move. Fayne face was covered with blood that leaked from his scalp and from his nostrils. He screamed and screamed, but not to be let go. Fayne simply screamed.\u003c/p\u003e\n\u003cp\u003eAfter that, things got a little hazy for Swann. There were so many people crowding around him. First police officers of every kind, then EMTs, then hospital staff. He remembered injections and tweezers and stitches, but now as he sat there, it all seemed like it was something that had happened to someone else. After all, he was a college professor. He could not have been injured by flying glass in a police interrogation room after interviewing a man who was suspected of the brutal murder of at least two people, and who might actually be a …\u003c/p\u003e\n\u003cp\u003eA what?\u003c/p\u003e\n\u003cp\u003eEven now, even with everything that he’d seen and heard, Swann did not want to put the name to it. To do so would be to cross a line. He preferred to stay on the sane side of that line. On that side of the line, vampires were a cultural phenomenon. Vampires were the creations of superstitious people who could not otherwise explain things like plagues and Sudden Infant Death Syndrome and catalepsy and porphyria. Vampirism was the stuff of folktales and movies and pop culture and his own heavily footnoted scholarly books.\u003c/p\u003e\n\u003cp\u003eVampires were not young men in holding cells in New York police stations.\u003c/p\u003e\n\u003cp\u003eNo. They were not that. That was all on the other side of the line.\u003c/p\u003e\n\u003cp\u003eSwann was an academic. For people like him, there was no other side of the line. There could not be.\u003c/p\u003e\n\u003cp\u003eHe sat there, swathed in bandages which hid proof that he was wrong.\u003c/p\u003e\n\u003cp\u003eSwann closed his eyes and tried not to see anything.\u003c/p\u003e\n\u003cp\u003eHe heard the soft scuff of a shoe and opened his eyes to see Schmidt standing there. The detective had a line of butterfly stitches across the left side of his forehead but no other signs of injury. Schmidt’s face was on the dour side of blank, with a hint of a frown and eyes that held no light.\u003c/p\u003e\n\u003cp\u003e“Professor,” he said.\u003c/p\u003e\n\u003cp\u003e“Detective,” said Swann, and they studied each other for a long, silent moment. From a detached angle, Swann understood the implications of this moment. They had both been there, they’d both seen what happened, and they both knew the rest of it. The crime scene reports, the lab work. All of it. Until now, however, it was nothing more than a collection of bizarre and anomalous information that had no common thread.\u003c/p\u003e\n\u003cp\u003eBut now … ?\u003c/p\u003e\n\u003cp\u003eNow they were going to have to talk about it. Now they were going to have to put a name to it. Both of their lives and all of the world around them hinged on that conversation.\u003c/p\u003e\n\u003cp\u003eSwann wanted no part of it, though, and he tried to stall. “How’s Detective Yanoff?”\u003c/p\u003e\n\u003cp\u003e“Resting,” said Schmidt.\u003c/p\u003e\n\u003cp\u003e“His leg?”\u003c/p\u003e\n\u003cp\u003e“He’ll keep it. Might have a limp, though.”\u003c/p\u003e\n\u003cp\u003e“That going to affect him on the job? I mean, will they let him — ?”\u003c/p\u003e\n\u003cp\u003e“He’ll be fine, professor,” said Schmidt, his tone curt, his eyes dead.\u003c/p\u003e\n\u003cp\u003eThey studied each other and the moment stretched.\u003c/p\u003e\n\u003cp\u003e“Say it,” Swann said softly.\u003c/p\u003e\n\u003cp\u003e“No,” said Schmidt. “I want you to say it. You were in that room, you spoke with him. I want you to tell me what happened.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what happened.”\u003c/p\u003e\n\u003cp\u003e“Bullshit. You saw the medical reports and you spoke with him —”\u003c/p\u003e\n\u003cp\u003e“I saw blood work, detective. I need to see the DNA.”\u003c/p\u003e\n\u003cp\u003e“That’s going to take days.”\u003c/p\u003e\n\u003cp\u003e“I know. While we’re waiting for that we should be getting a team of specialists in on this. Hematologists, physiologists, a pathologist, maybe an epidemiologist and the best diagnostician in the city. We need to do a full work-up. Everything.”\u003c/p\u003e\n\u003cp\u003e“And we’ll do that, professor, but that isn’t what I need right now.”\u003c/p\u003e\n\u003cp\u003e“I know what you want me to say, detective but —”\u003c/p\u003e\n\u003cp\u003eSchmidt suddenly pulled the curtains around their tracks and sealed off the examination room. When he spoke, his voice was low and urgent. “Listen to me, professor,” he said with heat, “Fayne broke that glass with his bare hands and I want to know how. Understand me here … I’ve seen methed-out freaks and three hundred pound Hell’s Angels throw chairs at that glass and not so much as scratch it. I know for a fact that a gun was fired in that room three years ago and the bullet — a nine millimeter round — bounced off of it. So why don’t you tell me how a one-hundred-seventy-pound barista smashed shatter-proof glass with his bare hands?”\u003c/p\u003e\n\u003cp\u003eSwann said nothing. His mouth was as dry as a desert.\u003c/p\u003e\n\u003cp\u003e“How did he do that, professor?” demanded Schmidt, his voice still low and fiery. “How does anyone do that? What are we dealing with? What is he?”\u003c/p\u003e\n\u003cp\u003eLuther Swann closed his eyes for a moment and sighed. Schmidt’s anger and fear were like fists punching him in the chest.\u003c/p\u003e\n\u003cp\u003e“Detective,” Swann began slowly, “I don’t believe in any of this.”\u003c/p\u003e\n\u003cp\u003eHe opened his eyes and Schmidt was right there, right in his face.\u003c/p\u003e\n\u003cp\u003e“This isn’t real,” said Swann. “It can’t be.”\u003c/p\u003e\n\u003cp\u003e“Then what is it? What is he?”\u003c/p\u003e\n\u003cp\u003e“I …”\u003c/p\u003e\n\u003cp\u003e“Say it, for Christ’s sake.” There was a mad light in Schmidt’s eyes and he looked like he was going to cry. Or scream.\u003c/p\u003e\n\u003cp\u003eBut Swann shook his head. “Listen to me, detective, hear me out for a moment. We have to tread very carefully here. If we put a label on this and we’re wrong, then both of us are done. Our careers are done. You’d be laughed out of the police department, and I’d be lucky to get a job teaching English as a second language at a community college. Ifthis is … what it seems to be … then any label we put on it is going to change the world. Not just this case, and not just our lives. Do you understand that, detective? This is so much bigger than a murder case, even a multiple murder case. If we are right, then we stand at an open doorway into a future that no longer conforms to any version of reality that either of us has ever understood. We are stepping out of our world and into something else. Do you understand that?”\u003c/p\u003e\n\u003cp\u003eSchmidt nodded, but he said nothing.\u003c/p\u003e\n\u003cp\u003eSwann licked his lips. “We need that DNA and we need those specialists. You get me that, you get every test done, and then I’ll say whatever you need me to say.”\u003c/p\u003e\n\u003cp\u003eThe detective nodded again. “I need you to tell me that we’re wrong about this.”\u003c/p\u003e\n\u003cp\u003e“I know,” said Swann. “I know.\u003c/p\u003e\n\u003cp\u003e— 16 —\u003c/p\u003e\n\u003cp\u003eOctober 12, 5:22 a.m.\u003c/p\u003e\n\u003cp\u003eOffices of Global Satellite News, NY\u003c/p\u003e\n\u003cp\u003eZero Days until the V-Event\u003c/p\u003e\n\u003cp\u003e“Hey,” said Officer Sims, “it’s me.”\u003c/p\u003e\n\u003cp\u003eYuki already knew that from the caller I.D. on her phone. “What do you have?”\u003c/p\u003e\n\u003cp\u003e“I got enough for a bonus,” he said bluntly.\u003c/p\u003e\n\u003cp\u003e“If it’s good stuff, then count on it.” Yuki was able to make that statement without a blink. The footage she’d gotten from her lipstick camera had all but made her news director come in his pants. It had so thoroughly scooped the other networks that a few of them had offered cash and other incentives to replay the footage. However, Regional Satellite News was only leasing it to the wire services, and even then the fees they were charging was a half-step short of actual armed robbery. Yuki was suddenly operating with a budget for sources.\u003c/p\u003e\n\u003cp\u003e“Okay,” said Sims, “I got a name, a social security number, a home address, and the information on where he’s being transferred to.”\u003c/p\u003e\n\u003cp\u003e“Transferred? He’s not in the precinct lock-up?”\u003c/p\u003e\n\u003cp\u003e“Not anymore,” said Sims with a chuckle in his voice, “and that’s the other thing. That’s the thing that’s going to double the bonus.”\u003c/p\u003e\n\u003cp\u003e“Hey, I don’t like to be fleeced here, Charlie.”\u003c/p\u003e\n\u003cp\u003e“Believe me, Yuke, you’ll think you’re getting bargain prices on solid gold when I tell you what just happened.”\u003c/p\u003e\n\u003cp\u003e“Don’t screw with me, Charlie. I mean it.”\u003c/p\u003e\n\u003cp\u003e“I’m not. Really, this is pure frigging gold. I mean … this is some very, very weird shit here. Creepy weird.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she said, her chest tingling with excitement despite the reluctance she was faking into her voice, “hit me.”\u003c/p\u003e\n\u003cp\u003eHe did.\u003c/p\u003e\n\u003cp\u003eBy the time he was finished telling her everything about Michael Fayne, Dr. Luther Swann and the incident in the interrogation room, Yuki Nitobe felt dizzy. She had to drag a chair over and sit down. Her heart was hammering in her chest.\u003c/p\u003e\n\u003cp\u003e“They just took him out of here,” concluded Sims. “They’re taking him to the psych ward at Bellevue.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“At a guess I’d say it was a combination of four point restraints, padded rooms, and a lot of tranquilizers.”\u003c/p\u003e\n\u003cp\u003e“Wait, wait, wait,” said Yuki, fanning back through her notes, “This professor? Swann?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“You said he was an authority in what?”\u003c/p\u003e\n\u003cp\u003e“You heard me,” Sims laughed. “Vampires, baby. Count Dracula. Team Sparkly. Vam-frigging-pires.”\u003c/p\u003e\n\u003cp\u003e“God, Charlie, if you’re scamming me here I’ll cut your nuts off.”\u003c/p\u003e\n\u003cp\u003eOfficer Sims was laughing when he disconnected the call.\u003c/p\u003e\n\u003cp\u003eYuki grabbed her purse and ran out of her office, screaming for a camera crew. \u003c/p\u003e","sourceLink":"https://allnovel.net/v-wars/page-26.html","bookId":2571,"creation":"Oct 5, 2019 6:00:04 PM","modification":"Oct 5, 2019 6:00:04 PM"}
