{"id":93074,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eStaring at the display, she saw an e-mail from Mickey Solano. “I guess you seen the news. I’m sorry, Hugues, but you TOLD me you wasn’t running again. I ain’t gonna air your dirty laundry in public, coz I don’t play that, but damn, man, you said you wasn’t running! You KNEW I had an exploratory committee, you KNEW I was scouting out campaign locations, so why do you wanna do me like that? Well, I’m sorry, but I been planning this for way too long to give up now. It’s my TURN, and you ain’t taking this away from me, no way, no how.”\u003c/p\u003e\n\u003cp\u003e“Dirty laundry?” Barel handed the iPhone back to Charlie. “Is he kidding? Did you actually promise him anything?”\u003c/p\u003e\n\u003cp\u003eBig Charlie shrugged his immense shoulders. “I said only that I was not planning to seek re-election — which, at the time, I was not — and that the field was open to him if he wished.”\u003c/p\u003e\n\u003cp\u003eJudy shook her head, and Barel feared she would draw blood from the left-hand side of her lip. “Why would you even do that? Especially to Mickey? He’s a snake.”\u003c/p\u003e\n\u003cp\u003e“He’s not a snake.” Barel was shaking her head. “He’s the guy the snake sends to the bodega to buy his cigarettes. And now he’s gonna be crawling up our tuch — our asses. Hope you’re happy.” She tossed her legal pad aside. “Well, that’s useless now. It doesn’t matter who dropped out, because it’s a race again.”\u003c/p\u003e\n\u003cp\u003e“It was always a race, Barel.”\u003c/p\u003e\n\u003cp\u003e“No, it was a cakewalk. Your only opposition were the down-ballot nutjobs. We weren’t even going to have to debate those — those guys.” She managed to swallow another Yiddishism. “Now, though, we have to actually have a debate.”\u003c/p\u003e\n\u003cp\u003eBig Charlie stood up, looming over both women. “Then we shall have a debate.” And then he strode out of the conference room and headed to the front door.\u003c/p\u003e\n\u003cp\u003e“I guess he’s going home. Great.” Barel looked at Judy, who was now chewing on her right lip.\u003c/p\u003e\n\u003cp\u003e“I’ll do up a press release, saying we welcome the competition, the airing of issues, and so on. Y’know, the usual bullshit.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Barel shook her head. “You know Mia Fitzsimmons at the News?”\u003c/p\u003e\n\u003cp\u003eJudy nodded. “Yeah, we went to the same high school.”\u003c/p\u003e\n\u003cp\u003e“Friends?”\u003c/p\u003e\n\u003cp\u003eShe grinned. “Not then. I was the cool Latina chick, she was the brainiac Irish girl.”\u003c/p\u003e\n\u003cp\u003e“Well, she did a nice job on the announcement, and I think we should give her more access. If Mickey’s throwing his fedora in, we’re gonna need all the favorable press coverage we can get.”\u003c/p\u003e\n\u003cp\u003e— 4 —\u003c/p\u003e\n\u003cp\u003eMia Fitzsimmons stood on the steps of the Bronx County Courthouse, the midday June sun blasting down on her, and wondered what this press conference was about.\u003c/p\u003e\n\u003cp\u003eBig Charlie and Mickey Solano hadn’t even had their first debate yet, though it was scheduled (finally) for two weeks’ hence.\u003c/p\u003e\n\u003cp\u003eJack Napolitano approached, his jaw arriving half a second before the rest of him. He went from being an anchor on Channel 12 to a political beat reporter for Channel 5, the local Fox affiliate, and with his chiseled good looks, he was bound for an anchor there, too, if not something national.\u003c/p\u003e\n\u003cp\u003eIn case Mia ever forgot all that, Jack was likely to remind her of it.\u003c/p\u003e\n\u003cp\u003e“So I heard it through the grapevine that you got the other question.”\u003c/p\u003e\n\u003cp\u003eMia frowned. “Excuse me?”\u003c/p\u003e\n\u003cp\u003e“Judy told me only two people are asking questions after he makes whatever big statement he’s making, and a little bird told me that you’re number two.”\u003c/p\u003e\n\u003cp\u003eIn fact, the impression Mia had gotten from Judy’s e-mail was that she was the only one asking questions, but thinking back over the text of it, realized that she’d never been that specific. It burned her britches a bit that she had to share with this jackass, but Channel 5 was the most-watched local news channel, so she could understand the logic.\u003c/p\u003e\n\u003cp\u003e“So you have any idea what this is about? I’ve been keeping my ear to the ground, but everyone’s lips are sealed.”\u003c/p\u003e\n\u003cp\u003e“No idea.”\u003c/p\u003e\n\u003cp\u003e“He’s gotta be dropping out.” Jack shook his head, and Mia felt the need to duck, as his jaw had quite the turn radius. “Why else would mum be the word?”\u003c/p\u003e\n\u003cp\u003eMia shook her head. “He’s not dropping out.”\u003c/p\u003e\n\u003cp\u003e“How’re you so sure?” Jack asked, sounding offended that she would disagree with him.\u003c/p\u003e\n\u003cp\u003eHad she been she speaking to someone she liked — or respected — or didn’t want to sock in his oversize, cliché-spouting jaw — Mia would have said something like, “His mother wants him to run, and he’s the world’s biggest maman’s boy,” but instead she just shrugged. “Call it instinct.”\u003c/p\u003e\n\u003cp\u003e“If you insist.” He let out a sigh. “I hope this doesn’t take long. I’ve got an interview with RSN. I think I’m a shoo-in for that one.”\u003c/p\u003e\n\u003cp\u003eMia suddenly experienced a massive coughing fit, which covered her look of disgust. Yuki Nitobe had broken the “vampire” story for the Regional Satellite Network, and that got her a promotion — once she was released from the hospital, anyhow. Mia herself had been dubious about the whole thing, but then Mick McCarthy told her, and the rest of the reporters in the city room, about what he saw at Bellevue that night. Just Mick’s descriptions of it had given Mia nightmares. She couldn’t imagine what it must have been like for Yuki.\u003c/p\u003e\n\u003cp\u003eBut she’d broken the story and now was the go-to girl for I1V1, the virus that was turning people into vampires. “The V-Event,” some marketing dork at RSN had called it. Her promotion meant a job opening, and Mia was completely not surprised that Jack had dusted off his résumé to take his shot at it.\u003c/p\u003e\n\u003cp\u003e“It’s showtime.”\u003c/p\u003e\n\u003cp\u003eAt Jack’s words, Mia looked up to see Judy Alejo approaching the podium that was set up on the courthouse steps. Big Charlie was just a few feet behind her, looking far more solemn than Mia could ever recall the jovial prosecutor appearing.\u003c/p\u003e\n\u003cp\u003eOnce everyone quieted down, Judy spoke. “Thank you, ladies and gentlemen, for coming. Without further ado, here’s Bronx District Attorney Hugues Charles.”\u003c/p\u003e\n\u003cp\u003eMia blinked with surprise at Judy’s clipped tone and terse introduction. She usually provided a bit more buildup than that. It was odd on several levels, not the least being that she never had anything but a happy face on for the fourth estate. The last time Mia saw such a sour expression on Judy’s face, it was in high school when she lost the election for Latin American Club president to Paolo Sandoval.\u003c/p\u003e\n\u003cp\u003eSomething bad’s going on here. She jotted some quick notes on a small paper notepad. Jack, who was cradling a tablet, made a tch noise. “Paper? That’s so twentieth century.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Judy,” Big Charlie said. “I have spent my entire career — indeed, my entire life — being truthful with the people of this community, and I do not wish to cease this tendency now.”\u003c/p\u003e\n\u003cp\u003eThe plot thickens. Mia noted that the reporters were unusually quiet. If not for the traffic noise of cars and buses on 161st and on the Concourse, it would’ve been eerily silent.\u003c/p\u003e\n\u003cp\u003e“Many of you are, I assume, aware of the I1V1 virus that has been spreading across the entire world. Several people standing in front of me right now reported on poor Michael Fayne, shot down while in custody at Bellevue Hospital only a few months ago. I1V1 has been especially strong here in our great city, and it would seem that I am among those who are affected by it.”\u003c/p\u003e\n\u003cp\u003eThat broke the quiet. Everyone around her started bellowing questions at once, voices overlapping each other into a wall of meaningless noise.\u003c/p\u003e\n\u003cp\u003eBut Mia was just staring at Big Charlie as he said, “Please, calm down, my friends. I will take questions once I have completed my statement. Thank you.”\u003c/p\u003e\n\u003cp\u003eA million questions went through Mia’s mind, the most prominent of which was: How did I miss this? She’d been around Big Charlie for almost a month now, and hadn’t seen a single sign of this.\u003c/p\u003e\n\u003cp\u003eThat, however, was not the question she could ask him when the time came.\u003c/p\u003e\n\u003cp\u003eOnce the noise died down again, Big Charlie went on. “It seems that I have loup garou in my ancestry. My mother told me stories of men who could turn themselves into wolves — I had no idea that I would become such a creature myself.”\u003c/p\u003e\n\u003cp\u003eMia noticed Jack frantically tapping on his tablet, cadging a wireless signal from the courthouse to look up loup garou. Mia would do likewise when she got back to the office, but she could afford patience. Jack was going to be on camera in a minute, where Mia had until late evening to file her story.\u003c/p\u003e\n\u003cp\u003e“Let me assure you of several things. First of all, I retain complete control over the transformation. It is not triggered by the full moon or by stress or by any outside factors that are out of my control.”\u003c/p\u003e\n\u003cp\u003eOne of the reporters standing behind Mia muttered, “So not Lon Chaney and not the Incredible Hulk.” Mia snorted a quick chuckle.\u003c/p\u003e\n\u003cp\u003e“I can become the wolf purely by force of will. Indeed, I could demonstrate for you now — but the transformation changes my shape in such a way that it would destroy this rather expensive suit I am wearing …”\u003c/p\u003e\n\u003cp\u003eThat got some more chuckles. Mia could see the trademark Hugues Charles disarming technique at work. The soft voice, the smile, the yes-I’m-massive-but-I’m-a-big-teddy-bear-really mien. But this time, she wasn’t buying it.\u003c/p\u003e\n\u003cp\u003e“Secondly, I have gone to see a physician, and while there is much about I1V1 that remains unknown, I have received a clean bill of health. The results of that examination will be made public, rest assured.”\u003c/p\u003e\n\u003cp\u003eThat got a derisive snort from Jack. Mia looked over and saw that the Channel 5 reporter was salivating. This story would make a nice addition to the reel he sent RSN.\u003c/p\u003e\n\u003cp\u003e“Finally, I have not changed. I’m still the same man that ever I was. I am still the District Attorney of Bronx County, a position I intend to retain for at least another four years after this one. Now, then, I can take a couple of questions.” Several reporters raised their hands, even though Mia and Jack were, as far as she knew, the only ones who would get called on. “Yes, Jack?” \u003c/p\u003e","sourceLink":"https://allnovel.net/v-wars/page-33.html","bookId":2571,"creation":"Oct 5, 2019 6:00:04 PM","modification":"Oct 5, 2019 6:00:04 PM"}
