{"id":93084,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eInstead, she gave him another jab in the kidney. “Drop it,” she said, and her voice was steady and clear even though the walls still shook around them.\u003c/p\u003e\n\u003cp\u003e“What?” Artus whispered, and the sap seemed to run out of his legs and he eased himself against the wall. The tip of the shotgun thunked against the floor, and he tried to make sense of the fire that had sparked itself to life behind his rib cage.\u003c/p\u003e\n\u003cp\u003eHe sagged and slid down the wall until he was in a sitting position, fighting to catch his breath. Billy eased down the hall, his feet making no sound now, almost like he was gliding on a carpet of air.\u003c/p\u003e\n\u003cp\u003eLike a raven…\u003c/p\u003e\n\u003cp\u003eArtus looked up at Betty Ann, and she was pointing the .22 at his face, and she held the rifle as if she knew her way around it. Like maybe she’d been practicing behind his back.\u003c/p\u003e\n\u003cp\u003eBehind my back…that would be funny if I didn’t hurt so damned much…\u003c/p\u003e\n\u003cp\u003eA noise on the stairs drew him out of his suffering long enough to see the others. One of the Standingdeer brothers, and a couple of other Injuns he didn’t recognize. They had that same solid blackness to their eyeballs, like marbles that had been rolled from the deepest corner of the ancient night.\u003c/p\u003e\n\u003cp\u003e“He’s all yours,” Betty Ann yelled, and she wasn’t talking to Artus.\u003c/p\u003e\n\u003cp\u003eArtus let the shotgun fall across his lap. The thoughts swirled as Billy and the others closed in:\u003c/p\u003e\n\u003cp\u003eThe red-hot spike that had been yanked fresh from the forge and driven deep in his chest …\u003c/p\u003e\n\u003cp\u003eThe pursed lips of Billy Standingdeer’s grin, which made his mouth resemble a dark beak …\u003c/p\u003e\n\u003cp\u003eBetty Ann’s face as calm as he’d ever seen it, and he wondered if he’d ever actually looked at her in their forty years of marriage …\u003c/p\u003e\n\u003cp\u003eBut most of all, he remembered that Jap reporter talking about vampires, and he decided he was glad these things were Raven Mockers instead, because he sure as hell didn’t want to die and come back as a goddamned blood-sucking Injun. Or worse, be kept around in a pen for the filthy redskin to feed on whenever he took a craving.\u003c/p\u003e\n\u003cp\u003eAnd then Billy was reaching for Artus’s chest, for his wasted, flaming heart, and he wondered how they all would divide up his years they had stolen, and whether they’d get Betty Ann’s years next.\u003c/p\u003e\n\u003cp\u003eThe other Injuns huddled around, waiting their turn, with Betty Ann stepping aside to make room for them.\u003c/p\u003e\n\u003cp\u003eBut just before the first heart-stealer reached inside, he decided Betty Ann had a lot of years left, and they might be the best years of her life.\u003c/p\u003e\n\u003cp\u003eWhile the rest of his life …\u003c/p\u003e\n\u003cp\u003e… didn’t last long.\u003c/p\u003e\n\u003cp\u003e\"JUNK\" PT.6\u003c/p\u003e\n\u003cp\u003eJonathan Maberry\u003c/p\u003e\n\u003cp\u003e— 25 —\u003c/p\u003e\n\u003cp\u003eOctober 12, 10:33 p.m.\u003c/p\u003e\n\u003cp\u003eBellevue Hospital\u003c/p\u003e\n\u003cp\u003eZero Days until the V-Event\u003c/p\u003e\n\u003cp\u003eLuther Swann sank into one of the leather guest chairs in Dr. Feldman’s office. Schmidt remained standing, hands in pockets, shoulder resting against a crammed bookshelf.\u003c/p\u003e\n\u003cp\u003eAlice Feldman had a thick folder open on her desk.\u003c/p\u003e\n\u003cp\u003e“We may have something,” said Feldman. Her face was clean of alltraces of blood, but she was very pale. Swann wondered how much of that was the result of blood loss and how much was because of everything that had happened. She tapped the file with her fingernail. “These are Michael Fayne’s medical records. I had them faxed over from Presbyterian Hospital. Fayne was admitted there last March and spent two days being treated for acute dehydration and fever that were the result of a virus.”\u003c/p\u003e\n\u003cp\u003e“Which virus?” asked Swann.\u003c/p\u003e\n\u003cp\u003e“I1V1.”\u003c/p\u003e\n\u003cp\u003e“The ice virus?” blurted Schmidt? “I thought that was all a big nothing.”\u003c/p\u003e\n\u003cp\u003eFeldman pursed her lips. “What do you know about it?”\u003c/p\u003e\n\u003cp\u003e“What everyone else knows,” said Swann. “The news said that it was something released from melting ice caps. An ancient virus. It spread fast and a lot of people got sick —”\u003c/p\u003e\n\u003cp\u003e“But no one died,” added Schmidt.\u003c/p\u003e\n\u003cp\u003e“— and then it kind of went away,” Swann concluded.\u003c/p\u003e\n\u003cp\u003e“That’s the oversimplified version,” agreed Feldman. “I1V1 is one of many new — or, to be more precise, ‘old’ — viruses and bacteria that have been introduced to our modern biosphere by the melting of the ice caps. When it presented, there was a great deal of concern in the medical community, especially in the early days before we identified the source of the virus. Naturally, there was a fear that it was a bioengineered virus.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Probably because it came out of nowhere,” suggested Swann, “and didn’t resemble anything currently going around.”\u003c/p\u003e\n\u003cp\u003eFeldman nodded approval. “Like H1N1 in 2009, there was a sudden fear of a global pandemic. Every day there is a tremendous movement of populations around the world.”\u003c/p\u003e\n\u003cp\u003e“Planes, trains and automobiles,” said Schmidt.\u003c/p\u003e\n\u003cp\u003e“Global transportation is what helped the Spanish Flu to spread beyond control in 1918. Most major plagues that became pandemics can be tied to migration or transportation.” Feldman placed her hand on the file. “And I1V1 cases turned up everywhere, on every continent. I did a check after reading Fayne’s file and the estimated number of infected worldwide is a much larger number than ever made the news.” She paused. “A conservative estimate by the World Health Organization is that twenty-eight percent of the human population experienced some symptoms consistent with this virus.”\u003c/p\u003e\n\u003cp\u003e“Holy God,” said Swann.\u003c/p\u003e\n\u003cp\u003e“The Centers for Disease Control put the estimate closer to fifty percent.”\u003c/p\u003e\n\u003cp\u003e“But nobody died,” insisted Schmidt.\u003c/p\u003e\n\u003cp\u003e“Most people experienced only very minor symptoms. The sniffles, a headache, that sort of thing,” said Feldman. “But people did die, detective. Granted, most of those cases were in third world areas and related to the symptom of dehydration. What matters most, however, is that there are secondary effects to most diseases, and the CDC and WHO have been tracking them.”\u003c/p\u003e\n\u003cp\u003e“What kind of secondary effects?” asked Swann.\u003c/p\u003e\n\u003cp\u003e“Genetic disorders,” she said. “Specifically, the emergence of genetic disorders that had previously been dormant in the patients prior to the onset of I1V1. Many people carry the genetic potential for a variety of diseases, but these are inactive. Not everyone with the potential for Parkinson’s or Sickle Cell or other disorders becomes victims of those diseases. You can see that in every family. We talk about traits ‘skipping a generation,’ which is a nonmedical way of saying that although the genetic potential is present, the gene has not actively coded for the symptoms. Am I making sense?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Swann.\u003c/p\u003e\n\u003cp\u003e“Kind of,” said Schmidt. “Pretend for a minute that I’m a cop, not a scientist.”\u003c/p\u003e\n\u003cp\u003eShe gave him a tolerant, almost pitying smile. “We have to look at the possibility that Professor Swann is correct in that vampirism may be a phenomenon that belongs to our complex evolutionary family tree. If we can strip away the more sensational and irrational elements of the vampire story, we can probably make a list of symptoms that are possible, even within our current understanding of human genetics. It may be that the potential for vampirism is in all human DNA.”\u003c/p\u003e\n\u003cp\u003e“Junk,” said Swann.\u003c/p\u003e\n\u003cp\u003e“Exactly,” said Feldman.\u003c/p\u003e\n\u003cp\u003e“What?” asked Schmidt.\u003c/p\u003e\n\u003cp\u003e“In genetics,” explained Feldman, “there are significant portions of the human genome sequence for which no discernible function has been identified. Junk DNA. That’s a term coined in 1972 by Susumu Ohno, a noted geneticist and evolutionary biologist, and one of the seminal researchers in the field of molecular evolution. These noncoding DNA are components of DNA that do not encode for protein sequences. Recent genetic studies have determined that much of this ‘junk’ actually does serve biological functions, including the transcriptional and translational regulation of protein-coding sequences. With time we’ll understand all of this, but there is much we don’t know. Research indicates that many junk DNA sequences probably have unidentified functional activity, and others may have had functions in the past. And some may be entirely nonfunctional.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” said Swann.\u003c/p\u003e\n\u003cp\u003eFeldman nodded. “Even those apparently inert genes are never discounted in science. Genetics, for all of its advances, is still a young science.”\u003c/p\u003e\n\u003cp\u003e“How’s the ice virus play into this?” asked Schmidt.\u003c/p\u003e\n\u003cp\u003e“Viruses have been known to affect genes in a variety of ways,” Feldman told him. “Sometimes even in positive ways.”\u003c/p\u003e\n\u003cp\u003e“But Fayne’s not the only person to get sick with the ice flu,” said Schmidt.\u003c/p\u003e\n\u003cp\u003eFeldman again tapped the medical records. “No, but there is something very significant here. Mr. Fayne is an actor and one of the movies he made was filmed in Alaska. He was among the first fifty people to present at a hospital in North America with symptoms of I1V1, and he was one of six whose symptoms were severe enough to warrant admission and observation. For now he is the index patient, the person around whom the research and any resulting science will be based.”\u003c/p\u003e\n\u003cp\u003e“Patient zero,” said Swann, and Feldman gave a short, reluctant nod.\u003c/p\u003e\n\u003cp\u003e“Does that mean that Fayne’s behavior, his actions, and his blackouts are all symptoms of a disease?” asked Schmidt.\u003c/p\u003e\n\u003cp\u003e“Possibly,” said Feldman. “And, before you ask, we’re shooting in the dark here, so until we have completed an exhaustive series of tests, ‘possibly’ is as far as I’ll go.”\u003c/p\u003e\n\u003cp\u003e“Can we treat him in some way?” Schmidt asked. “Give him something to dial down the, um … outbursts?”\u003c/p\u003e\n\u003cp\u003e“Too soon to know that,” said Swann, and Feldman nodded agreement.\u003c/p\u003e\n\u003cp\u003e“We’re at the very beginning of this, gentlemen,” she said. “We have no idea how Fayne will react to even ordinary drugs like over-the-counter painkillers. If he becomes violent again in ways that are a danger to himself and others, we may attempt to narcotize him, but even then I would hesitate before committing to any kind of treatment. This is an entirely unknown disorder — if it’s even a disorder. What alarms me the most is how well developed Fayne’s symptoms are. Genetic traits don’t suddenly appear. This has been happening to him for a while now. Weeks at least, probably months. That isn’t good news because it opens the door to so much speculation.” \u003c/p\u003e","sourceLink":"https://allnovel.net/v-wars/page-43.html","bookId":2571,"creation":"Oct 5, 2019 6:00:04 PM","modification":"Oct 5, 2019 6:00:04 PM"}
