{"id":93125,"no":84,"title":"Page 84","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAt least he hadn’t lost his leg, like the V-8 team leader; or been blinded like the TV reporter from Chicago. All Swann had were sixty-seven stitches and eight broken bones. The thigh was the worst, but in this war, that was getting off light.\u003c/p\u003e\n\u003cp\u003e“Tell us about the vampires in Scranton,” asked the senator, repeating his question louder.\u003c/p\u003e\n\u003cp\u003eSwann said, “Most of the vampires killed in the raid on the New Red Coalition headquarters in Scranton were too badly burned or mangled for us to classify them. However, of the twenty-eight prisoners taken there and the four scouts arrested later that day, we have members of nine separate vampires species, including another kathakano and two more of the German alps. There was also one previously unrecorded species.”\u003c/p\u003e\n\u003cp\u003e“Unrecorded at all, or —?”\u003c/p\u003e\n\u003cp\u003e“No, unrecorded in this conflict. Henry Periot of Albany demonstrated qualities consistent with a craqueuhhe, a kind of necrophageous vampire from France. Mr. Periot’s physical strength was far greater than most other species of vampire and even though he was shot four times he did not sustain life-threatening injuries. Dr. Feldman can speak to that, but apparently his body’s wound-repair system is working at a super-normal level.”\u003c/p\u003e\n\u003cp\u003e“How many species does that make so far?” asked the senator from Maine.\u003c/p\u003e\n\u003cp\u003e“Twenty-seven,” he said. “But if we count those species who have played no part in the hostilities, then the number jumps to eighty-nine. And that includes a few species from the non-hostile population that we haven’t yet labeled and which, apparently, are not mentioned in the literature of world myth.”\u003c/p\u003e\n\u003cp\u003eThe senators studied him.\u003c/p\u003e\n\u003cp\u003e“How many reported cases of infection?” asked the senator from Maryland.\u003c/p\u003e\n\u003cp\u003eSwann rubbed his eyes. “In the United States? Just under eighteen hundred. Worldwide, just over five thousand.”\u003c/p\u003e\n\u003cp\u003e“Do you have a guess as to why America has a disproportionate number of cases based on world population?”\u003c/p\u003e\n\u003cp\u003e“I have a few opinions,” said Swann. “The first is that America is a melting pot. It’s in our tourist brochures. We have an incredibly wide and deep genetic pool here. That accounts for a lot of it, and because of so many people with mixed heritage, it’s obvious why we’re seeing so many of the most dramatic variations on the classic ethnic vampire model.”\u003c/p\u003e\n\u003cp\u003eThe Maryland senator cocked an eyebrow, “But …?”\u003c/p\u003e\n\u003cp\u003e“But overall, I think the math is wrong.”\u003c/p\u003e\n\u003cp\u003e“Wrong … how?”\u003c/p\u003e\n\u003cp\u003e“The numbers are low. Way too low. It’s almost two hundred days since the first outbreak, since Michael Fayne. We know that the I1V1 virus has had a chance to spread everywhere. The ease of international travel and the movement of so many people every minute of every day has spread the disease everywhere. And our scientists are still insisting that it’s in the atmosphere, that it’s being released every day by the melting of the polar ice. Taking all of that into account, and given that everyone on earth carries the dormant gene for vampirism, then there is no argument to support why there aren’t many more cases of active infection.”\u003c/p\u003e\n\u003cp\u003e“Many more? How many more would you like?” asked the senator, grinning at his own bad joke.\u003c/p\u003e\n\u003cp\u003eSwann gave him a flat stare. “It’s not a matter of what I would like, senator, it’s a matter of what makes sense. There should be tens of thousands of infected by now. Maybe hundreds of thousands. Here and abroad.”\u003c/p\u003e\n\u003cp\u003eThe senator from Maine leaned forward. “Do you have any explanation for why there aren’t more infected? I mean, if you’re correct, there should be vampires everywhere.”\u003c/p\u003e\n\u003cp\u003eSwann was a long time in answering. He looked into eyes of the men and women who sat at the long table across from him.\u003c/p\u003e\n\u003cp\u003e“Senator, I think there are more infected. Many more.”\u003c/p\u003e\n\u003cp\u003eThe senators said nothing. Not all of them looked shocked. Swann studied the faces of those who did not look at all surprised.\u003c/p\u003e\n\u003cp\u003e“After the first wave of the infection, what did we do?” asked Swann. “We went to war with them. Immediately. No pause, no hesitation. By the fifth reported case we were labeling the infected as terrorists. Granted, some of them attacked first, but when we pushed back we pushed back very hard. Perhaps too hard. I warned General May about this. Perhaps we pushed back so hard that the vampires learned a valuable lesson.”\u003c/p\u003e\n\u003cp\u003e“What lesson is that?” asked the senator from Georgia.\u003c/p\u003e\n\u003cp\u003e“They learned to wait. They learned to watch. They learned that to survive, they have to hide from us.”\u003c/p\u003e\n\u003cp\u003e“So, you think that there are more of them out there?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir, I do.”\u003c/p\u003e\n\u003cp\u003e“What are they waiting for? To attack when we’re not looking? To blindside us?”\u003c/p\u003e\n\u003cp\u003e“I would think, senator,” said Swann, “that they’re studying us. They know that we are their enemies. We’ve taught them that. Just as we’ve taught them to fear us and hate us.”\u003c/p\u003e\n\u003cp\u003e“That goes both ways,” said the senator from Maine.\u003c/p\u003e\n\u003cp\u003e“It does, in some cases,” admitted Swann. “But I’ve been saying all along that we need to look at the numbers, to consider the percentage of the vampires who have been openly aggressive toward us. Even now, even after all this conflict, we’re still only talking about a small percentage of that population. Two percent, maybe. But now … after what we’ve done, after Scranton and Philadelphia and the other major offensives, what do you think is going through the minds of that other ninety-eight percent? What do you think is going through the minds of all of the vampires who are still hidden? The vampires who are to blend in? What do you think they’re thinking about us?”\u003c/p\u003e\n\u003cp\u003eThe senators were quiet for a moment, then the senator from Louisiana spoke. She had been quiet for most of the hearing. “I have two additional questions.”\u003c/p\u003e\n\u003cp\u003eSwann nodded.\u003c/p\u003e\n\u003cp\u003e“Do you truly and unreservedly believe that there is a large population of undeclared infected hidden within the human population?”\u003c/p\u003e\n\u003cp\u003e“Yes, senator, I do.”\u003c/p\u003e\n\u003cp\u003e“And … do you believe that this war is over?”\u003c/p\u003e\n\u003cp\u003e“As long as both sides react with fear and aggression, then no, senator, I do not.” Swann gave her a small smile. “Do you?”\u003c/p\u003e\n\u003cp\u003eThe senator paused for just a moment before replying. “No, I do not.”\u003c/p\u003e\n\u003cp\u003eSwann cocked his head to one side. “Then I hope we make better choices tomorrow than we did today, because if this escalates into another full-blown open conflict, I don’t think either side can win. Or, to put it another way, I think both sides would lose. Wouldn’t you agree with that, senator?”\u003c/p\u003e\n\u003cp\u003eThe senator from Louisiana gave him the smallest of smiles in return. “Yes, Professor Swann, I believe I would.” \u003c/p\u003e","sourceLink":"https://allnovel.net/v-wars/page-84.html","bookId":2571,"creation":"Oct 5, 2019 6:00:04 PM","modification":"Oct 5, 2019 6:00:04 PM"}
