{"id":13188,"no":2,"title":"CHAPTER II. THE YOUNG INVENTOR.","content":"Clifford’s plan was to buy diving suits, and at once look up men used to descending into the greatest depths of the sea.\n\u003cbr\u003e \n\u003cbr\u003e But these were not easily found. Neither were they at once successful in finding the right sort of a sailing craft for their purpose.\n\u003cbr\u003e \n\u003cbr\u003e While thus somewhat perplexed a curious incident occurred which completely changed their plans.\n\u003cbr\u003e \n\u003cbr\u003e Clifford chanced to pick up a newspaper and read a large heading:\n\u003cbr\u003e “A Wonderful Invention!\n\u003cbr\u003e \n\u003cbr\u003e “Frank Reade, Jr., the young inventor, once more to the fore. This time it is a famous submarine boat which is a complete success, and with which the wonderful young man intends to sail around the world under water. The problem of deep-sea navigation solved. The naval and marine world in general much interested.”\n\u003cbr\u003e \n\u003cbr\u003e More followed of a descriptive nature, and Clifford read every line. Then he drew a deep breath.\n\u003cbr\u003e \n\u003cbr\u003e He arose and put on his hat.\n\u003cbr\u003e \n\u003cbr\u003e “Hartley,” he said, “come with me.”\n\u003cbr\u003e \n\u003cbr\u003e The manner of the great traveler impressed the captain. He looked up in surprise and asked:\n\u003cbr\u003e \n\u003cbr\u003e “Where?”\n\u003cbr\u003e \n\u003cbr\u003e “I am going to Readestown.”\n\u003cbr\u003e \n\u003cbr\u003e “To Readestown?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “What for?”\n\u003cbr\u003e \n\u003cbr\u003e “To see Frank Reade, Jr.”\n\u003cbr\u003e \n\u003cbr\u003e “What——”\n\u003cbr\u003e \n\u003cbr\u003e “Ask no questions until we get there. Then you will understand all. Come along!”\n\u003cbr\u003e \n\u003cbr\u003e Hartley knew there was no use in trying to argue the 7point. It was always best to give Clifford his own way. So he followed him.\n\u003cbr\u003e \n\u003cbr\u003e Readestown was a neat little town on a river leading down to the sea. It was chiefly noted for the family of great inventors, the Reades, who had founded the place.\n\u003cbr\u003e \n\u003cbr\u003e Frank Reade, Jr., himself, sat in his private office at the machine works looking over some plans.\n\u003cbr\u003e \n\u003cbr\u003e He was a tall, handsome youth, with a certain bearing which distinguished him wherever he went.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly the door opened and a woolly head appeared in the space between the door and the frame.\n\u003cbr\u003e \n\u003cbr\u003e A negro, black as a coal and with gleaming ivories, stood there.\n\u003cbr\u003e \n\u003cbr\u003e “Well, Pomp,” said Frank, looking up, “what is it?”\n\u003cbr\u003e \n\u003cbr\u003e “Suah, sah, two gentlemen as wants fo’ to see yo’, sah. Dey won’t take no, sah!”\n\u003cbr\u003e \n\u003cbr\u003e Frank took the cards handed him and glanced at the names.\n\u003cbr\u003e “Joseph Hartley—Cecil Clifford.\n\u003cbr\u003e “New York City.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know them,” he said. “What is their business?”\n\u003cbr\u003e \n\u003cbr\u003e “Berry important, sah, so dey say. Kain’t tell no mo’.”\n\u003cbr\u003e \n\u003cbr\u003e “Show them in.”\n\u003cbr\u003e \n\u003cbr\u003e “A’right, sah.”\n\u003cbr\u003e \n\u003cbr\u003e Pomp disappeared, but he had no sooner vanished than a shock of red hair and a genial Irish mug appeared in the spot he had left.\n\u003cbr\u003e \n\u003cbr\u003e “Shure, Misther Frank, ivery bit av the sthores is aboard the boat, sor.”\n\u003cbr\u003e \n\u003cbr\u003e “Good for you, Barney O’Shea!” replied the young inventor. “Everything is then in readiness for the start.”\n\u003cbr\u003e \n\u003cbr\u003e “Yis, sor.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well, that will do.”\n\u003cbr\u003e \n\u003cbr\u003e The red hair and grinning mug then vanished.\n\u003cbr\u003e \n\u003cbr\u003e Barney and Pomp were Frank Reade, Jr.’s faithful body servants. They had been long in his employ.\n\u003cbr\u003e \n\u003cbr\u003e Steps were heard outside a few moments later, and two men entered.\n\u003cbr\u003e \n\u003cbr\u003e Captain Hartley and Cecil Clifford shook hands with Frank Reade, Jr. In a very few moments they were the warmest of friends, so instinctive was the sympathetic tie between kindred souls.\n\u003cbr\u003e \n\u003cbr\u003e “We understand you have perfected a submarine boat, Mr. Reade,” said Clifford.\n\u003cbr\u003e \n\u003cbr\u003e “That is true,” replied Frank.\n\u003cbr\u003e \n\u003cbr\u003e “That is a wonderful triumph. We congratulate you.”\n\u003cbr\u003e \n\u003cbr\u003e “Thank you.”\n\u003cbr\u003e \n\u003cbr\u003e 8“Do you intend starting for a deep-sea cruise very soon?”\n\u003cbr\u003e \n\u003cbr\u003e “In a very few days.”\n\u003cbr\u003e \n\u003cbr\u003e “Have you an object in view beyond simple exploration?”\n\u003cbr\u003e \n\u003cbr\u003e “Nothing special.”\n\u003cbr\u003e \n\u003cbr\u003e Clifford and the captain exchanged glances. Then the former said:\n\u003cbr\u003e \n\u003cbr\u003e “Will you kindly listen to a little story we have to tell, Mr. Reade?”\n\u003cbr\u003e \n\u003cbr\u003e “With pleasure,” replied Frank.\n\u003cbr\u003e \n\u003cbr\u003e Then Clifford detailed the story of the Donna Veneta and her treasure.\n\u003cbr\u003e \n\u003cbr\u003e As he dwelt upon the story of the sunken galleon’s gold, Frank grew interested.\n\u003cbr\u003e \n\u003cbr\u003e For some moments after Clifford finished his story he was thoughtful.\n\u003cbr\u003e \n\u003cbr\u003e Then he said:\n\u003cbr\u003e \n\u003cbr\u003e “So Gilbert Parker would not lend his ship Aurelian to such an enterprise?”\n\u003cbr\u003e \n\u003cbr\u003e “No,” said Clifford.\n\u003cbr\u003e \n\u003cbr\u003e “Which shows his folly. Gentlemen, what if I propose to place the submarine boat Dolphin at your disposal?”\n\u003cbr\u003e \n\u003cbr\u003e Clifford and Hartley sprang forward, and each grasped a hand of the young inventor.\n\u003cbr\u003e \n\u003cbr\u003e “Hurrah! You have saved the day!” cried Clifford. “We knew that you would look with favor on our plans!”\n\u003cbr\u003e \n\u003cbr\u003e “Only think of having a submarine boat at our disposal!” cried Hartley. “Success is assured!”\n\u003cbr\u003e \n\u003cbr\u003e “Well, gentlemen, I am decided,” said Frank. “We will all go aboard the Dolphin in search of the galleon’s gold. The start shall be made at once, and old Parker will find out what a colossal old ass he is.”\n\u003cbr\u003e \n\u003cbr\u003e Hartley and Clifford cheered vociferously. But Frank pulled chairs up to the table, and said:\n\u003cbr\u003e \n\u003cbr\u003e “Where is your plan or diagram?”\n\u003cbr\u003e \n\u003cbr\u003e Hartley pulled out the portfolio and opened it; he spread some papers on the table.\n\u003cbr\u003e \n\u003cbr\u003e They were quickly examined, and then all three men looked at each other blankly.\n\u003cbr\u003e \n\u003cbr\u003e “Jericho!” gasped Hartley. “Where are the diagrams, Cecil?”\n\u003cbr\u003e \n\u003cbr\u003e “They ought to be here!”\n\u003cbr\u003e \n\u003cbr\u003e “But they are not!”\n\u003cbr\u003e \n\u003cbr\u003e Clifford and Hartley were aghast.\n\u003cbr\u003e \n\u003cbr\u003e “What has become of them?” he gasped, weakly. “My soul, Hartley, you don’t believe that they have been stolen?”\n\u003cbr\u003e \n\u003cbr\u003e “Stolen!” exclaimed the captain in a hollow voice. “That is their fate. Cecil, we are ruined men!”\n\u003cbr\u003e \n\u003cbr\u003e Frank glanced from one to the other.\n\u003cbr\u003e \n\u003cbr\u003e 9“Who could have stolen them?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e “We do not know.”\n\u003cbr\u003e \n\u003cbr\u003e “To whom else have you shown them?”\n\u003cbr\u003e \n\u003cbr\u003e “To no one—except——”\n\u003cbr\u003e \n\u003cbr\u003e Clifford and Hartley stared at each other. Then both gasped in the same breath:\n\u003cbr\u003e \n\u003cbr\u003e “Gilbert Parker!”\n\u003cbr\u003e \n\u003cbr\u003e “The old hound!” rejoined Hartley, hotly. “Would he dare do such a villainous thing?”\n\u003cbr\u003e \n\u003cbr\u003e “I believe him capable of anything,” said Cecil. “I know he is an old villain!”\n\u003cbr\u003e \n\u003cbr\u003e Hartley took several turns up and down the room.\n\u003cbr\u003e \n\u003cbr\u003e “We can prove nothing,” he said. “Of course he will deny it. Again, perhaps we have lost them. What shall we do? Can you not repeat that diagram from memory, Cecil?”\n\u003cbr\u003e \n\u003cbr\u003e In answer, the traveler sat down, and after some time drew crude lines upon paper.\n\u003cbr\u003e \n\u003cbr\u003e “This is as near as I can remember it,” he said, “but I lose much valuable detail.”\n\u003cbr\u003e \n\u003cbr\u003e “What could have prompted us to attempt to take Parker into the scheme at all?” cried Hartley, with self anger. “I might have known that he would try to figure it all into his own coffers. What shall we do?”\n\u003cbr\u003e \n\u003cbr\u003e “There is only one thing,” said Frank, arising.\n\u003cbr\u003e \n\u003cbr\u003e “And that?”\n\u003cbr\u003e \n\u003cbr\u003e “We will accept this diagram and scour every foot of the Honduras Gulf. We shall have an advantage in the submarine boat.”\n\u003cbr\u003e \n\u003cbr\u003e “Right!” cried Clifford, in a transport of joy. “There is a solution of all! We will beat Mr. Parker at his own game! Mr. Reade, we owe all to you.”\n\u003cbr\u003e \n\u003cbr\u003e “That is nothing,” said Frank. “I am with you body and soul! But enough! Would you not like to take a look at the Dolphin?”\n\u003cbr\u003e \n\u003cbr\u003e “Delighted!” both cried.\n\u003cbr\u003e \n\u003cbr\u003e “Come on, then!”\n\u003cbr\u003e \n\u003cbr\u003e Frank led the way through high gates into an inner yard. In the center of this was a deep basin or tank of water.\n\u003cbr\u003e \n\u003cbr\u003e It was connected with the river several hundred yards below by means of a canal and a lock.\n\u003cbr\u003e \n\u003cbr\u003e In the center of the tank floated the submarine boat.\n\u003cbr\u003e \n\u003cbr\u003e It was a wonderful specimen of seacraft. The two new-comers gazed at it spellbound.\n\u003cbr\u003e \n\u003cbr\u003e In shape the Dolphin was long and rakish and her lines indicated speed. Her hull was of plates of steel.\n\u003cbr\u003e \n\u003cbr\u003e Her main deck was roofed over entirely, giving her an odd appearance as she lay there in the water. In this roof was 10an enormous plate-glass skylight and any number of dead-eyes.\n\u003cbr\u003e \n\u003cbr\u003e These were wholly for purposes of observation from the interior of the boat. There was a large observation window and conning tower upon each side of the vessel about midships.\n\u003cbr\u003e \n\u003cbr\u003e A pilot-house with a conical dome and heavy glass windows was forward. There was an outer deck or platform to the width of six feet, which extended all around the vessel and was protected by a guard rail.\n\u003cbr\u003e \n\u003cbr\u003e The Dolphin had three steel masts and a long bowsprit with rigging of steel ropes. These were more for the steadying of the craft than practical use.\n\u003cbr\u003e \n\u003cbr\u003e She had twin screws, which were driven by powerful electric engines on a peculiar storage plan, which was wholly the invention of Frank Reade, Jr.\n\u003cbr\u003e \n\u003cbr\u003e So light and clean cut was the Dolphin that she could make a famous rate of speed even under water.\n\u003cbr\u003e \n\u003cbr\u003e The interior of the boat was most palatially furnished. Every comfort and convenience known to science was there.\n\u003cbr\u003e \n\u003cbr\u003e From the pilot-house to the engine-room, salons, staterooms, magazine and all were complete.\n\u003cbr\u003e \n\u003cbr\u003e There was also the huge pneumatic reservoir or tank for the sinking or rising of the boat. This was done by simply admitting or expelling water.\n\u003cbr\u003e \n\u003cbr\u003e Also the chemical generator, with its tubes extending to every part of the boat for the furnishing of pure air while under water. Altogether the submarine boat was a marvel.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1797/52221.html","bookId":1056,"creation":"Aug 2, 2019 5:14:57 AM","modification":"Aug 2, 2019 5:14:57 AM"}
