{"id":13191,"no":5,"title":"CHAPTER V. ON THE REEF.","content":"In his horror, Clifford forgot himself and shouted wildly to Frank, but the young inventor did not reply.\n\u003cbr\u003e \n\u003cbr\u003e Of course he could not hear. Indeed, the only way conversation could be carried on was by placing the helmets closely together and loudly shouting.\n\u003cbr\u003e \n\u003cbr\u003e So that the young inventor, intent on examining the Dolphin’s position, thought of nothing else, until by chance he turned his head.\n\u003cbr\u003e \n\u003cbr\u003e Then the sight which he beheld filled him with horror.\n\u003cbr\u003e \n\u003cbr\u003e For a moment he could not act.\n\u003cbr\u003e \n\u003cbr\u003e “My God!” he gasped, “Clifford is lost!”\n\u003cbr\u003e \n\u003cbr\u003e Then his senses returned.\n\u003cbr\u003e \n\u003cbr\u003e He realized that his friend was in mortal peril, and that he must go to his aid. At any cost he must try and save him.\n\u003cbr\u003e \n\u003cbr\u003e So he drew his ax from his girdle and made a leap forward.\n\u003cbr\u003e \n\u003cbr\u003e In the meanwhile Clifford had been fighting for all that was in his power. He wielded his ax with desperate energy.\n\u003cbr\u003e \n\u003cbr\u003e He struck blow after blow at the huge tentacle which held him so firmly. Each blow threatened to sever it.\n\u003cbr\u003e \n\u003cbr\u003e But even as success was crowning his efforts, out darted another arm and encircled him.\n\u003cbr\u003e \n\u003cbr\u003e This was surely drawing him into the orifice, when Frank came to the rescue.\n\u003cbr\u003e \n\u003cbr\u003e The young inventor dealt a terrific blow at the tentacle. It partly severed it. Another huge arm came stealing out, and Frank dealt it a blow also.\n\u003cbr\u003e \n\u003cbr\u003e Clifford was too exhausted to do more. But Frank threw an arm about him, and dealing the tentacle a severing blow drew his friend quickly out of reach.\n\u003cbr\u003e \n\u003cbr\u003e Nothing more was seen of the octopus.\n\u003cbr\u003e \n\u003cbr\u003e It did not emerge from its den, but a dense cloud of black fluid did, and it so clouded the water that Frank was obliged to drag Clifford some distance away.\n\u003cbr\u003e \n\u003cbr\u003e The latter recovered quickly. Frank put his helmet close and shouted:\n\u003cbr\u003e \n\u003cbr\u003e “Are you all right?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” replied Clifford; “it was a close call!”\n\u003cbr\u003e \n\u003cbr\u003e “Indeed it was!”\n\u003cbr\u003e \n\u003cbr\u003e “But for you I should have lost my life!”\n\u003cbr\u003e \n\u003cbr\u003e Frank made signs to return to the Dolphin, but Clifford felt sufficient curiosity to ask:\n\u003cbr\u003e \n\u003cbr\u003e “How about the boat?”\n\u003cbr\u003e \n\u003cbr\u003e “There is but one way to get her off the reef.”\n\u003cbr\u003e \n\u003cbr\u003e 20“And that——”\n\u003cbr\u003e \n\u003cbr\u003e “I will explain when we get back to the boat.”\n\u003cbr\u003e \n\u003cbr\u003e “All right!”\n\u003cbr\u003e \n\u003cbr\u003e In a few moments they reached the rail. To their surprise they saw Barney in the vestibule, all in his diver’s suit.\n\u003cbr\u003e \n\u003cbr\u003e The brave Celt had seen their distress and was coming to their rescue.\n\u003cbr\u003e \n\u003cbr\u003e “Begorra, Misther Frank!” he cried, when the two divers were once more safely aboard. “I thought it was the end av yez. May the Howly Vargin be praised, yez are all roight an’ safe!”\n\u003cbr\u003e \n\u003cbr\u003e “Well; I thought our friend, Clifford, was surely done for,” said Frank, “but by the best of good fortune he is still with us.”\n\u003cbr\u003e \n\u003cbr\u003e “Which happy fact I owe to Mr. Reade,” declared Clifford. “I shall never forget it.”\n\u003cbr\u003e \n\u003cbr\u003e The matter was dropped now, however, for another important one. The question as to the fate of the Dolphin was now brought up.\n\u003cbr\u003e \n\u003cbr\u003e Frank was thoughtful for some while, and finally said:\n\u003cbr\u003e \n\u003cbr\u003e “Wait until to-morrow. Then I will be able to decide.”\n\u003cbr\u003e \n\u003cbr\u003e That night few in the party slept very soundly; at an early hour Pomp had a steaming breakfast ready.\n\u003cbr\u003e \n\u003cbr\u003e All were rather sober as they sat around the table.\n\u003cbr\u003e \n\u003cbr\u003e “Well,” said Frank, “if we are doomed to spend the rest of our days at the bottom of the sea we can count upon extending our span of life to a limit of about two years.”\n\u003cbr\u003e \n\u003cbr\u003e “How do you make that exact calculation?” asked Captain Hartley.\n\u003cbr\u003e \n\u003cbr\u003e “There are just stores enough on board to last two years,” replied Frank.\n\u003cbr\u003e \n\u003cbr\u003e “After they are gone?”\n\u003cbr\u003e \n\u003cbr\u003e Frank laughed nervously.\n\u003cbr\u003e \n\u003cbr\u003e “Two years is a good long while in which to make up our minds what to do. Perhaps before that time we may hit upon a good scheme.”\n\u003cbr\u003e \n\u003cbr\u003e “Let us hope so,” said Clifford; “but we should like to hear of your scheme of yesterday, Frank.”\n\u003cbr\u003e \n\u003cbr\u003e “By all means!” cried Hartley.\n\u003cbr\u003e \n\u003cbr\u003e “Huh! neber you mind,” cried Pomp. “Marse Frank he neber get stuck. He fin’ some way out ob any kin’ ob a scrape.”\n\u003cbr\u003e \n\u003cbr\u003e “Bejabers, that’s roight!” averred Barney.\n\u003cbr\u003e \n\u003cbr\u003e After some reflection and much persuasion Frank divulged the plan which had occurred to him.\n\u003cbr\u003e \n\u003cbr\u003e “It is a simple one,” he said; “it consists merely of digging a mine under the boat and trying to dislodge her with dynamite.”\n\u003cbr\u003e \n\u003cbr\u003e 21“Hurrah!” cried Clifford. “What could be better?”\n\u003cbr\u003e \n\u003cbr\u003e “So say I!” said Hartley.\n\u003cbr\u003e \n\u003cbr\u003e But Frank shook his head slowly.\n\u003cbr\u003e \n\u003cbr\u003e “There are many risks involved,” he said. “We must consider the possibility of the Dolphin springing a leak, or of the dynamite straining her timbers.”\n\u003cbr\u003e \n\u003cbr\u003e “But—how can she spring a leak?”\n\u003cbr\u003e \n\u003cbr\u003e “Her timbers or plates may be already started, and dislodging her may start the leak in an instant.”\n\u003cbr\u003e \n\u003cbr\u003e The faces of all fell.\n\u003cbr\u003e \n\u003cbr\u003e “Is there any certainty of such being the case?” asked Hartley.\n\u003cbr\u003e \n\u003cbr\u003e “No certainty,” replied Frank, “only a possibility, and a very strong one at that.”\n\u003cbr\u003e \n\u003cbr\u003e “Then it is narrowed down to a question of expediency, whether it is better to risk instant death or the more lingering fate of two years under the deep sea.”\n\u003cbr\u003e \n\u003cbr\u003e “Exactly,” agreed Frank. “If we explode the dynamite now the boat may fill and sink in ten minutes. There is the chance.”\n\u003cbr\u003e \n\u003cbr\u003e “Humph!” said Hartley. “If we have got to die it may as well be now as two years from now.”\n\u003cbr\u003e \n\u003cbr\u003e Frank glanced around the little circle inquiringly.\n\u003cbr\u003e \n\u003cbr\u003e “What do the rest of you say?” he asked. “Shall we accept the chance?”\n\u003cbr\u003e \n\u003cbr\u003e “Put it to ballot,” said Hartley.\n\u003cbr\u003e \n\u003cbr\u003e “Agreed!”\n\u003cbr\u003e \n\u003cbr\u003e Clifford made out some ballots and handed them around. They were marked and thrown on the table.\n\u003cbr\u003e \n\u003cbr\u003e Hartley counted them.\n\u003cbr\u003e \n\u003cbr\u003e His face wore an indescribable expression as he looked up and said:\n\u003cbr\u003e \n\u003cbr\u003e “The question is settled. The ballot is unanimous.”\n\u003cbr\u003e \n\u003cbr\u003e “In favor of——”\n\u003cbr\u003e \n\u003cbr\u003e “The dynamite.”\n\u003cbr\u003e \n\u003cbr\u003e Frank Reade, Jr., arose from his chair. He was very cool and steady as he said to Barney:\n\u003cbr\u003e \n\u003cbr\u003e “Bring up the metal canisters from the hold. Rig a wire with the battery. Then procure picks and spades, put on your suits, you and Pomp, and come with me.”\n\u003cbr\u003e \n\u003cbr\u003e Pomp went for the picks and spades. In a few moments all was in readiness.\n\u003cbr\u003e \n\u003cbr\u003e Frank, with Barney and Pomp, donned diving suits.\n\u003cbr\u003e \n\u003cbr\u003e Then they went out on deck, and a little later were at the keel of the boat.\n\u003cbr\u003e \n\u003cbr\u003e Frank directed the digging of the mine.\n\u003cbr\u003e \n\u003cbr\u003e The coral was easily picked away, but the ledge rock required drilling and splitting.\n\u003cbr\u003e \n\u003cbr\u003e 22Slowly but surely the mine was made. All that day the work went on.\n\u003cbr\u003e \n\u003cbr\u003e It was noon of the succeeding day, however, before it was finished. Then the cartridges were placed.\n\u003cbr\u003e \n\u003cbr\u003e Great bales, made of soft burlap filled with sand, were placed under the keel and over the dynamite to act as a cushion and reduce the shock.\n\u003cbr\u003e \n\u003cbr\u003e Then the wires were connected, and the three divers went aboard the Dolphin.\n\u003cbr\u003e \n\u003cbr\u003e They removed their diving suits, and Frank faced Clifford and Hartley, who were pale and somewhat excited.\n\u003cbr\u003e \n\u003cbr\u003e Now that the critical moment had come, each really shrank from the mighty risk. Yet neither could justly be called a coward.\n\u003cbr\u003e \n\u003cbr\u003e “Well?” said Hartley.\n\u003cbr\u003e \n\u003cbr\u003e “Well!” exclaimed Clifford.\n\u003cbr\u003e \n\u003cbr\u003e Then there was a period of silence. Frank looked keenly at the two men.\n\u003cbr\u003e \n\u003cbr\u003e “What shall it be?” he asked. “I shall leave it all with you.”\n\u003cbr\u003e \n\u003cbr\u003e “Do not hesitate on our account,” said Hartley firmly; “we do not shrink from it.”\n\u003cbr\u003e \n\u003cbr\u003e “All will be over in a very few moments. We shall know if it is to be life or death.”\n\u003cbr\u003e \n\u003cbr\u003e “It would be death in the long run anyway,” declared Clifford. “Whatever it is, let us all meet our fate like brave men.”\n\u003cbr\u003e \n\u003cbr\u003e “That settles it,” declared Frank, “prepare for the shock!”\n\u003cbr\u003e \n\u003cbr\u003e Everything movable aboard the boat was carefully secured. Then Frank announced all in readiness.\n\u003cbr\u003e \n\u003cbr\u003e It was a moment of suspense.\n\u003cbr\u003e \n\u003cbr\u003e Frank stood by the vestibule door with the wire and electric key in his hand. He closed his eyes and spasmodically pressed it.\n\u003cbr\u003e \n\u003cbr\u003e It was all a matter of momentous doubt. All hinged upon the result of the explosion. Five human lives hung in the balance.\n\u003cbr\u003e \n\u003cbr\u003e The result was instantaneous.\n\u003cbr\u003e \n\u003cbr\u003e All that the voyagers could ever remember of the affair afterward was that there was a terrific shock, a confused jumbling of ideas and incidents, and then——\n\u003cbr\u003e \n\u003cbr\u003e Frank Reade, Jr., opened his eyes and looked about him.\n\u003cbr\u003e \n\u003cbr\u003e Wonder of wonders!\n\u003cbr\u003e \n\u003cbr\u003e It was broad daylight.\n\u003cbr\u003e \n\u003cbr\u003e They were on the surface of the sea. All about them was one heaving expanse of blue.\n\u003cbr\u003e \n\u003cbr\u003e “Great whales!” cried Captain Hartley. “What sort of a transformation do you call this, mates?”\n\u003cbr\u003e \n\u003cbr\u003e 23“We are saved!” cried Clifford.\n\u003cbr\u003e \n\u003cbr\u003e “Begorra, it’s on the surface we are,” averred Barney. “Howiver did this happen?”\n\u003cbr\u003e \n\u003cbr\u003e “Huh! Don’ yo’ know, I’ish?” cried Pomp. “Yo’ done lef de switch ob de reservoir turned on.”\n\u003cbr\u003e \n\u003cbr\u003e “Bejabers that’s thrue!” cried the Celt. “I shure fergot it.”\n\u003cbr\u003e \n\u003cbr\u003e “It’s all right!” cried Frank; “it helped the explosion to raise the boat. Now it is only a question as to whether the boat leaks or not.”\n\u003cbr\u003e \n\u003cbr\u003e “How shall we find out?”\n\u003cbr\u003e \n\u003cbr\u003e “We will sink if she does,” laughed Frank; “but I think we could hear the water coming in if such was the case.”\n\u003cbr\u003e \n\u003cbr\u003e With which Frank went below. He listened at the bulkheads leading into the hold.\n\u003cbr\u003e \n\u003cbr\u003e But the boat seemed as buoyant as ever. There was not the slightest indication that she was leaking.\n\u003cbr\u003e \n\u003cbr\u003e The spirits of all now waxed more cheerful. It was a moral certainty that the boat was saved and their lives as well.\n\u003cbr\u003e \n\u003cbr\u003e But as this realization fully dawned upon them, a loud cry came from Pomp.\n\u003cbr\u003e \n\u003cbr\u003e “Hi, dar! luk out or we be run down, Marse Frank!”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1797/52224.html","bookId":1056,"creation":"Aug 2, 2019 5:15:04 AM","modification":"Aug 2, 2019 5:15:04 AM"}
