{"id":26159,"no":1,"title":"PART I CHAPTER I MR LEAVESLEY","content":"\"You may take away the things, Belinda,\" said Mr Leavesley, lighting his pipe and taking his seat at the easel. \"Nobody called this morning, I suppose?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Only the Capting, sir,\" replied Belinda, piling the tray. \"He called at seven to borry your umbrella.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did you give it him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir, Mr Verneede\u0027s got it; you lent it to him the night before last, and he hasn\u0027t brought it back.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ah, so I did,\" said Mr Leavesley, squeezing Naples yellow from an utterly exhausted[Pg 2] looking tube. \"So I did, so I did; that\u0027s the fifteenth umbrella or so that Verneede has annexed of mine: what does he do with them, do you think, Belinda?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sure I don\u0027t know, sir,\" replied the maid-of-all-work, looking round the studio as if in search of inspiration, \"unless he spouts them.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That will do, Belinda,\" said the owner of the lost umbrellas, turning to his work, and the servant-maid departed.\n\u003cbr\u003e \n\u003cbr\u003e It was a large, pleasant studio, furnished with very little affectation, and its owner was a slight, pleasant-faced youth, happy-go-lucky looking, with a glitter in his grey eyes suggesting a touch of genius or insanity in their owner.\n\u003cbr\u003e \n\u003cbr\u003e He was an orphan blessed with a small competency. His income, to use his own formula, consisted of a hundred a year and an uncle. During the first four months or so of the year he spent the hundred pounds, during the rest of the year he squandered his uncle; that is to say he would have squandered him only for the fact that Mr James Hancock, of the firm of Hancock \u0026amp; Hancock, solicitors, was a person most difficult to \"negotiate.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 3]\n\u003cbr\u003e \n\u003cbr\u003e Art, however, was looking up. He had sold several pictures lately. The morning mists on the road to success were clearing away, leaving to the view in a prospect distant tremulous and golden the mysterious city of attainment.\n\u003cbr\u003e \n\u003cbr\u003e He would have whistled as he worked only that he was smoking.\n\u003cbr\u003e \n\u003cbr\u003e Through the open windows came the pulse-like sound of the omnibuses in the King\u0027s Road, the sleigh bells of the hansoms, the rattle of the coster\u0027s barrow, and voices.\n\u003cbr\u003e \n\u003cbr\u003e As he painted, the sounds outside brought before him the vision of the King\u0027s Road, Chelsea, where flaming June was also at work with her golden brush and palette of violet colours.\n\u003cbr\u003e \n\u003cbr\u003e He saw in imagination the scarlet pyramids of strawberries in the shops. The blazing barrow of flowers all a-growing and a-blowing, the late-June morning crowd, and through the crowd wending its way the figure of a girl.\n\u003cbr\u003e \n\u003cbr\u003e He was in love.\n\u003cbr\u003e \n\u003cbr\u003e In the breast-pocket of his coat (on the heart side) lay a letter he had received by the early morning post. The handwriting[Pg 4] was large and generous and careless, for no man living could tell the \"m\u0027s\" from the \"w\u0027s,\" or the \"t\u0027s\" from the \"l\u0027s.\" It ran somewhat to this effect:\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"The Laurels, Highgate.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Father is worrying dreadfully, and I want your advice. I think I will be in the King\u0027s Road to-morrow, and will call on you. Excuse this scrawl.—In wild haste,\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Fanny Lambert.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"How\u0027s the picture?\"\n\u003cbr\u003e \n\u003cbr\u003e Occasionally as he painted he touched his coat where the letter lay, as if to make sure of its presence.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly he ceased working. There was a step on the stairs, a knock at the door. Could it be?——\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1872/54154.html","bookId":812,"creation":"Aug 3, 2019 4:43:15 PM","modification":"Aug 3, 2019 4:43:15 PM"}
