{"id":86406,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eRory drank, swept with a desire to do anything to please him. His blood tasted so delicious, he slurped greedily at it, closed his eyes, and sucked it down until Casey stopped him by inserting a finger into his mouth and breaking the suction. Rory sucked at his finger then, only stopping when Casey pulled it away with a little plop.\u003c/p\u003e\n\u003cp\u003e“Enough for now, baby. You’ll make yourself sick.”\u003c/p\u003e\n\u003cp\u003eCasey sat back on his heels, looking down at him. He was still naked, and Rory reached for his beautiful cock, driving to hold it in his hands and guide it inside him. Casey pushed his hands away, smiling. “You’re in heat, darlin’. It won’t last too long, but until it’s over, you’ll be dizzy and disoriented—and pretty horny. I can’t fuck you too much, or I’ll make you too weak. How do you feel?” He gazed down at him closely, looking for signs of distress.\u003c/p\u003e\n\u003cp\u003e“I-I feel…tired. Weak. I want you, though. Fuck me, Casey, make love to me. Please, Casey.”\u003c/p\u003e\n\u003cp\u003e“I will, baby, after you’ve rested. You’re not yourself right now. You need to sleep some, and I’ll hold you while you sleep. We need to make love again soon to get you through the heat, but just not right now. It will soothe you some when we can do it again. Do you trust me to take care of you?”\u003c/p\u003e\n\u003cp\u003e“Oh yes,” Rory said, reaching for him again. “I trust you, darling. I love you so much.”\u003c/p\u003e\n\u003cp\u003e“I love you too, baby. You’re mine now. You know that, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm. Come and hold me, Casey. I need you.”\u003c/p\u003e\n\u003cp\u003eCasey looked almost conflicted as he gazed down at him, but as Rory reached for him, he lay down beside him and gathered him closely in his arms, Casey’s lips on the top of his head. Rory scooted his ass back into Casey’s groin and pulled his arm tightly around him. Damn his ass hurt and his insides ached, but he still squirmed and twisted, seeking to drive Casey’s cock deep inside him. He drifted off, soothed with Casey fondling his balls and kissing his neck.\u003c/p\u003e\n\u003cp\u003eChapter Three\u003c/p\u003e\n\u003cp\u003eCasey awoke to an insistent knocking on the door. Exhausted, having been up half the night making love to Rory, holding and fondling him, it took him a minute to come fully awake and realize what was going on.\u003c/p\u003e\n\u003cp\u003e“Open the door, Casey. It’s Marco.” He sat up, rubbing the sleep from his eyes, and pulled away from Rory. The knocking came again, harder this time. “Casey! I know you’re in there. Open the door!”\u003c/p\u003e\n\u003cp\u003e“Okay, okay,” he said irritably and got out of bed, picking up his jeans from the floor and pulling them on before going to open the door.\u003c/p\u003e\n\u003cp\u003eMarco stood there with his hands shoved in his pockets. “Is Rory in there with you?”\u003c/p\u003e\n\u003cp\u003eCasey stood so his body blocked the door. “Yeah, he’s in here.”\u003c/p\u003e\n\u003cp\u003eMarco nodded tersely. “I know you mated with him. Everyone in the compound does. Is he —is he okay?”\u003c/p\u003e\n\u003cp\u003e“Of course he’s okay. What did you think?”\u003c/p\u003e\n\u003cp\u003eMarco looked up sharply at the tone, but Casey held his ground. Maybe it was time to let Marco know who he really was. Casey was an alpha too, and it had been hard taking orders all these weeks.\u003c/p\u003e\n\u003cp\u003e“You know what I mean, Casey. He was worried about what would happen if he mated with you.”\u003c/p\u003e\n\u003cp\u003e“I know, and he was right to be worried. I think his wolf is dead. Rory’s changed now.”\u003c/p\u003e\n\u003cp\u003e“What?” Marco looked shocked. “What do you mean he’s changed? What happened? What did you do to him?”\u003c/p\u003e\n\u003cp\u003e“I didn’t do anything but mate with him. He tried to shift while we were tied up, after I’d given him the mating bite. It didn’t work, and he tried again. It retreated deep inside him and finally—died, I think. Anyway, it’s gone, but I didn’t do anything but mate with him.”\u003c/p\u003e\n\u003cp\u003eMarco shook his head sadly. “He’ll be devastated.”\u003c/p\u003e\n\u003cp\u003e“It’s for the best. His wolf made him a murderer, and I’m glad that little son-of-a-bitch is dead.”\u003c/p\u003e\n\u003cp\u003eStunned, Marco exclaimed, “What are you talking about? How can you say such a thing?”\u003c/p\u003e\n\u003cp\u003e“Because it’s true! You asked me yesterday how I came to be with Shawna’s pack. Well, it’s time you know the truth. I was never with Shawna’s pack, not really. I used them to get inside this compound. I’m Alpha of the Sapphire Valley Wolf Pack. My brother was the man Rory killed last year.”\u003c/p\u003e\n\u003cp\u003e“Your brother! Your brother was the man who kidnapped Nicky?”\u003c/p\u003e\n\u003cp\u003e“Yes. He was wrong in what he did, I admit, but he didn’t deserve to die like that. Your people—Rory—killed him and left him on the side of the trail like garbage. Did you really expect he wouldn’t be avenged by his family?”\u003c/p\u003e\n\u003cp\u003e“Your brother kidnapped and would have raped my mate if we hadn’t caught him, and he was going to kill him!”\u003c/p\u003e\n\u003cp\u003e“Says who? You have no proof of anything more than he took him. The truth is your mate wasn’t harmed, not really, and you never waited to ask questions or talk to my brother. Rory attacked him before he could shift. He never had a chance, and you stood by and let it happen.”\u003c/p\u003e\n\u003cp\u003eThe two alphas stood and glared at each other for a long moment, both of their wolves close to the surface. They might even have shifted and fought it out right there in the hallway, except for a voice calling out behind them.\u003c/p\u003e\n\u003cp\u003e“Marco! Casey! What are you doing?” Nicky ran up beside Marco, and Marco instinctively pushed Nicky behind him, but he wouldn’t stay put. “Stop it right now, both of you.” Nicky put a hand on both their chests, holding them apart. Casey was so shocked at the sensation of Nicky’s warm hand on his chest he jumped back out of the way. Nicky belonged to Marco, and universal pack law forbade him to touch another wolf’s mate or be touched by one unless they were family. It was one of the oldest laws. The thought that Aaron had broken that law when he took Nicky flashed through Casey’s mind. He ignored it, watching Marco pull Nicky roughly back from him, giving Casey a vicious look, even though it hadn’t been his fault.\u003c/p\u003e\n\u003cp\u003e“Nicky, get out of here and let me deal with him.”\u003c/p\u003e\n\u003cp\u003e“You can’t, Marco. Think of Rory. They’re mated now.”\u003c/p\u003e\n\u003cp\u003eThe reminder made Marco back off a step, but the hatred and anger were still there.\u003c/p\u003e\n\u003cp\u003eNicky worked to smooth the explosive situation. “I could hear the two of you yelling all the way outside, and so could half the compound.” Nicky turned to Casey and spoke gently to him. “Casey, can I please see Rory? I know he’s your mate now, but I just want to see him. I promise I won’t get him upset.”\u003c/p\u003e\n\u003cp\u003eCasey bit his lip in indecision, but Nicky stretched out a hand to him in supplication, careful not to touch him again. “Please, Casey.”\u003c/p\u003e\n\u003cp\u003e“All right. But just you—not him!”\u003c/p\u003e\n\u003cp\u003eNicky pushed back against Marco’s chest when he growled and would have charged Casey again and smiled up at Casey. “Thank you, Casey. Marco, please wait for me right here while I go check on him, okay? Please, darling.”\u003c/p\u003e\n\u003cp\u003eCasey stepped back to allow Nicky inside. Nicky blew Marco a kiss as the door closed firmly in his face. He crossed over to the bed. Even sound asleep, Rory’s hands grasped for Casey, and he moaned his name.\u003c/p\u003e\n\u003cp\u003e“God, he’s pretty bad, isn’t he?” Nicky bent over and laid a hand on his forehead. “He’s burning up, Casey. Are you sure he’s okay?”\u003c/p\u003e\n\u003cp\u003e“I think so,” he said worriedly, putting a hand on Rory’s head and smoothing back his hair. “It’s not like I have a lot of experience in this either, you know. He woke up a little while ago, and he said he felt all right—just dizzy and tired.”\u003c/p\u003e\n\u003cp\u003e“Yes, I remember I felt that way, too, after I fed. If he’s not out of this before tonight, you might call the doctor.”\u003c/p\u003e\n\u003cp\u003e“I’ll think about it.”\u003c/p\u003e\n\u003cp\u003e“I heard you and Marco shouting as I came inside. You said his wolf—died—inside him?” “Yeah, I’m pretty sure. That’s what it felt like.”\u003c/p\u003e\n\u003cp\u003e“That may be why he has such a fever. The doctor—”\u003c/p\u003e\n\u003cp\u003e“I said I’d think about it.”\u003c/p\u003e\n\u003cp\u003eNicky nodded, not pushing anymore. “So his wolf really might be dead. Poor Rory.”\u003c/p\u003e\n\u003cp\u003e“You don’t have to feel sorry for him. He’s fine. He’s perfect now that murdering wolf of his is gone. I’ll take care of him. He’s mine and under my control.”\u003c/p\u003e\n\u003cp\u003e“Nicky, get back out here!” A loud banging sounded on the door, and Marco’s voice came through, sounding anxious.\u003c/p\u003e\n\u003cp\u003eNicky shrugged and grinned. “My master’s voice.” Turning serious, he said, “Now that you have a mate maybe you’ll understand better how Marco felt when your brother took me and why Rory did what he did.” He walked over to the door and opened it, stepping out and into Marco’s arms.\u003c/p\u003e\n\u003cp\u003eCasey was momentarily stunned at the idea of someone taking Rory like Aaron took Nicky, but he quickly put that disloyal thought out of his mind and refused to listen. He stepped out behind Nicky. “We’ll be leaving as soon as he’s able to travel,” Casey said, glaring at Marco.\u003c/p\u003e\n\u003cp\u003e“Where are you taking him?” Marco demanded.\u003c/p\u003e\n\u003cp\u003e“Back to my pack. They’ve been without my guidance long enough.”\u003c/p\u003e\n\u003cp\u003e“You can’t take him away from the only home he’s ever known.”\u003c/p\u003e\n\u003cp\u003e“He’s mine now. He belongs with me in my home just like your mate does with you,” he said pointedly.\u003c/p\u003e\n\u003cp\u003e“I can’t kill you for what you’ve done, but I can stop you from taking your revenge out on Rory. You aren’t going to hurt him.”\u003c/p\u003e\n\u003cp\u003eCasey looked at him with disgust. “He’s mine, and I’ll do what I want to him. That’s all you need to know.”\u003c/p\u003e\n\u003cp\u003e“Watch your mouth, asshole! You’re on my turf now!” Marco bristled visibly and acted like he would have attacked if Nicky hadn’t stood between them. He settled for pointing a finger in Casey’s face. “You won’t leave here with him. Is that clear? If you try, I’ll stop you!”\u003c/p\u003e\n\u003cp\u003e“You can’t keep me here against my will! My pack will attack you.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, bring it! You’re free to go any time you want to—Rory is not going anywhere!” \u003c/p\u003e","sourceLink":"https://allnovel.net/cry-wolf-dark-hollow-wolf-pack-2/page-10.html","bookId":2254,"creation":"Oct 5, 2019 5:14:16 PM","modification":"Oct 5, 2019 5:14:16 PM"}
