{"id":86408,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Bite me, Marco,” he screamed.\u003c/p\u003e\n\u003cp\u003eNicky’s orgasm seared its way through his body and as he began to spurt, he gave in to mindless pleasure, coming so hard when Marco’s love bite clamped down on his throat he almost blacked out, and the room went dim around him. When Marco climaxed, seconds later, Nicky was hardly even aware of it for the waves of ecstasy shaking his body. When he came back to himself, Marco was kissing him all over his face and down his throat.\u003c/p\u003e\n\u003cp\u003e“Who do you belong to, baby?”\u003c/p\u003e\n\u003cp\u003e“You and only you forever,” Nicky said dazedly, already drifting off to sleep. He raised one eyelid. “And what about you, Marco? Who do you belong to?”\u003c/p\u003e\n\u003cp\u003eMarco smiled. “You, darling. Always and forever.”\u003c/p\u003e\n\u003cp\u003eNicky nodded, satisfied. “Good,” he said, and went contentedly back to sleep.\u003c/p\u003e\n\u003cp\u003eIt was much later when Nicky rolled over and nuzzled Marco to wake him up. “We’re still on the floor, babe.”\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm.”\u003c/p\u003e\n\u003cp\u003eNicky laughed and kissed him again. “So now that I’ve had my refresher course, can I go see Casey?”\u003c/p\u003e\n\u003cp\u003eMarco nodded, and Nicky leaned over for a kiss to seal the deal.\u003c/p\u003e\n\u003cp\u003e“So long as you’re not totally alone with him. Leave the door open, and don’t you dare touch him again. I have to protect my mate too, you know.” He pulled Nicky closer, smiling over Nicky’s little self-satisfied moans.\u003c/p\u003e\n\u003cp\u003eNicky, of course, was thoroughly tempted to be bad, just to have to suffer his lesson again.\u003c/p\u003e\n\u003cp\u003eRory woke up slowly, stretching like a cat. The bed was warm and cozy, and he could hear a storm raging outside the windows. He was a little sore and his backside was achy, but mostly he felt wonderful. He turned over to find Casey stretched on his back beside him, his arms thrown up over his head, and snoring gently with his mouth open. Smiling, he put a leg over Casey’s and snuggled up close to him before to putting a finger under his chin and closing his mouth. Casey snorted and jumped, only half awake. His arms flailed in the air and Rory pushed them down. He pulled Casey closer, patting him. “Settle down, baby, I’m right here.”\u003c/p\u003e\n\u003cp\u003eComing more fully awake, Casey opened his eyes wider in surprise. “Rory!” “Hi, baby,” Rory smiled down at him.\u003c/p\u003e\n\u003cp\u003e“Hi yourself. Are you…are you all right?” Casey looked closely at him.\u003c/p\u003e\n\u003cp\u003e“Of course I am. Why wouldn’t I be?”\u003c/p\u003e\n\u003cp\u003e“Uh…I don’t know. You’ve been kind of uh…in heat…for the past twenty-four hours or\u003c/p\u003e\n\u003cp\u003eso.”\u003c/p\u003e\n\u003cp\u003e“I have? In heat, huh? I don’t remember a thing about it. The last thing I remember was you\u003c/p\u003e\n\u003cp\u003ewere making love to me. We’re mated now, right?”\u003c/p\u003e\n\u003cp\u003e“Oh yeah. Definitely mated. We were tied up for hours. You sure you don’t remember any\u003c/p\u003e\n\u003cp\u003eof it?”\u003c/p\u003e\n\u003cp\u003e“No, not a thing. Well, I do kind of remember your knot and didn’t you feed me your blood\u003c/p\u003e\n\u003cp\u003eat one point?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Casey said slowly. “Several times actually, trying to calm you. You were a little\u003c/p\u003e\n\u003cp\u003eupset.”\u003c/p\u003e\n\u003cp\u003e“About what?”\u003c/p\u003e\n\u003cp\u003eCasey sat up and pulled some pillows behind him before pulling Rory up to settle him\u003c/p\u003e\n\u003cp\u003eagainst his arm. “When we were making love…when you started to have the multiple orgasms\u003c/p\u003e\n\u003cp\u003ethat the gland and bite bring on, you—you tried to shift.”\u003c/p\u003e\n\u003cp\u003e“I did?”\u003c/p\u003e\n\u003cp\u003e“Yeah, and you couldn’t. You tried a couple of times, and you weren’t able to. Look down\u003c/p\u003e\n\u003cp\u003eat yourself.” He pulled the sheet back to expose Rory’s re-shaped penis. Rory looked down at\u003c/p\u003e\n\u003cp\u003ehimself for a moment seemingly without comprehension and then his eyebrows raised almost\u003c/p\u003e\n\u003cp\u003ecomically, and he looked back up at Casey. “What the fuck?”\u003c/p\u003e\n\u003cp\u003e“Your knot—your gland is gone. Your penis is like a pet’s now or a human’s.” Rory looked at him, not understanding. “What?”\u003c/p\u003e\n\u003cp\u003e“I guess it happened when you tried to shift and couldn’t or maybe because it was two\u003c/p\u003e\n\u003cp\u003ewolves mating. I’m not sure, Rory, but your wolf is gone. I think it’s dead.”\u003c/p\u003e\n\u003cp\u003e“What?” Throwing back the covers, Rory jumped to his feet and ran into the bathroom to get\u003c/p\u003e\n\u003cp\u003ea look at himself in the mirror. He looked up in horror at Casey who was right on his heels.\u003c/p\u003e\n\u003cp\u003e“What did you do to me?”\u003c/p\u003e\n\u003cp\u003eCasey shrugged and shook his head. “I didn’t do anything. It just happened.” “Oh my God, Casey! What does this mean?” Even upset, Rory still stepped closer to Casey\u003c/p\u003e\n\u003cp\u003eto be comforted.\u003c/p\u003e\n\u003cp\u003eCasey put his arm around him. “I don’t know. Come back in here and sit down. We need to\u003c/p\u003e\n\u003cp\u003etalk about some things.”\u003c/p\u003e\n\u003cp\u003eRory followed him back to the bedroom as if in a daze. He sat on the bed, and Casey sat\u003c/p\u003e\n\u003cp\u003ebeside him. The time had come to announce his revenge.\u003c/p\u003e\n\u003cp\u003e“Do you remember almost a year ago when Nicky and another boy were kidnapped?” Rory nodded. “Yes, of course. The other boy was my little brother, Adam.” “Your brother?”\u003c/p\u003e\n\u003cp\u003e“Yes. They were both in my charge that day, and I-I fell asleep.”\u003c/p\u003e\n\u003cp\u003e“You fell asleep?” Casey looked at him in disbelief. This was the first time he’d ever heard\u003c/p\u003e\n\u003cp\u003eabout Rory watching the two boys. To fall asleep when pets were in your charge was pretty\u003c/p\u003e\n\u003cp\u003eunforgiveable. If Rory had been attentive, he and Aaron would never have been able to get their\u003c/p\u003e\n\u003cp\u003ehands on the boys to start with. His brother would never have been killed. Rory would never\u003c/p\u003e\n\u003cp\u003ehave become his enemy.\u003c/p\u003e\n\u003cp\u003e“Yeah. I know. Marco almost took my head off for that one, but nobody could have blamed\u003c/p\u003e\n\u003cp\u003eme more than I blamed myself.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well the point is, Rory, the man who kidnapped your brother was me. And my\u003c/p\u003e\n\u003cp\u003ebrother, Aaron, got Nicky.”\u003c/p\u003e\n\u003cp\u003eRory stared at him uncomprehendingly. “I-I don’t understand. How can that be?” “I’m not who you think I am, Rory. I’m Alpha of the Sapphire Pack. Look, I’ve got to just\u003c/p\u003e\n\u003cp\u003ecome out and say this. I came to this compound for one reason—to kill you.”\u003c/p\u003e\n\u003cp\u003eRory tilted his head slightly. “K-kill me?”\u003c/p\u003e\n\u003cp\u003e“I didn’t know you, baby. I only knew your name, but you killed my brother, Rory. We have\u003c/p\u003e\n\u003cp\u003eto face the fact and find a way to move on. The man you attacked when you shifted was my\u003c/p\u003e\n\u003cp\u003ebrother, Aaron. He never had a chance against you in your wolf form, and you had to know that.” Rory was silent, still staring at Casey, looking as if someone had kicked him in the head. “I-I\u003c/p\u003e\n\u003cp\u003eprotected my alpha’s mate. He was holding a knife to Nicky’s throat.”\u003c/p\u003e\n\u003cp\u003e“Aaron told me he was going to negotiate with Marco. Wasn’t that what he was doing?” “He had a knife, Casey, at Nicky’s throat.”\u003c/p\u003e\n\u003cp\u003e“But he hadn’t hurt anybody.”\u003c/p\u003e\n\u003cp\u003e“That didn’t mean he wasn’t about to. I did what I thought I had to do.”\u003c/p\u003e\n\u003cp\u003e“Doesn’t make it right.”\u003c/p\u003e\n\u003cp\u003eRory snapped out of his daze. “You’re going to talk to me about what’s right? The two of\u003c/p\u003e\n\u003cp\u003eyou kidnapped my brother and Nicky.”\u003c/p\u003e\n\u003cp\u003e“Be quiet. Don’t argue with me! I’m trying to tell you I have these crazy mixed-up feelings\u003c/p\u003e\n\u003cp\u003eabout you. I came here to kill you before I knew you were my bloodmate. I took a vow of vengeance against you. How in the hell am I going to reconcile that with wanting to fuck you\u003c/p\u003e\n\u003cp\u003eevery time you come close to me.”\u003c/p\u003e\n\u003cp\u003e“Fuck me, not make love to me? So you’re saying you don’t love me.”\u003c/p\u003e\n\u003cp\u003e“No, damn it! I do love you. That’s what’s tearing me apart. Suppose I’d killed your little\u003c/p\u003e\n\u003cp\u003ebrother that day. On purpose. How would you feel about me?”\u003c/p\u003e\n\u003cp\u003eRory shook his head. “It’s a totally different situation. My little brother was an innocent pet,\u003c/p\u003e\n\u003cp\u003ekidnapped away from his home. Your brother was a wolf who deliberately put himself into that\u003c/p\u003e\n\u003cp\u003esituation.”\u003c/p\u003e\n\u003cp\u003e“He was still my brother, and he didn’t have to die like that!”\u003c/p\u003e\n\u003cp\u003e“Well, I guess I’d have to try to forgive you then if it were me. If I couldn’t, then I’d reject\u003c/p\u003e\n\u003cp\u003eyou as my mate.”\u003c/p\u003e\n\u003cp\u003e“Not a chance,” Casey said angrily. “Stop trying to get away from me. No, I can’t let you\u003c/p\u003e\n\u003cp\u003ego, but you have to be punished. It’s the only thing I can do to stay loyal to my brother.” “Punished? I’m not your child, Casey. Or your prisoner.”\u003c/p\u003e\n\u003cp\u003e“That’s exactly what you are. You’ll do as I tell you to now, Rory. I’m in charge, and it’s\u003c/p\u003e\n\u003cp\u003etime you learned that and took your proper role in this relationship. Now be quiet and say yes sir\u003c/p\u003e\n\u003cp\u003elike a good pet.”\u003c/p\u003e\n\u003cp\u003eRory stood up abruptly. “You go to hell!” He began to pace around the room still stark\u003c/p\u003e\n\u003cp\u003enaked.\u003c/p\u003e\n\u003cp\u003eCasey could see the anger in his face. He watched him carefully.\u003c/p\u003e\n\u003cp\u003e“Don’t tell me to be quiet, like I’m some kind of slave here. You tell me you’re an alpha\u003c/p\u003e\n\u003cp\u003ewho came here to avenge your brother’s death, that you’re the man who kidnapped my brother,\u003c/p\u003e\n\u003cp\u003eand oh yeah, you came here to kill me. And I’m supposed to do what? Kneel down and present\u003c/p\u003e\n\u003cp\u003emy throat for you to rip out? Or just kneel down and kiss your ass? Or maybe give you mine?” “Shut up, Rory, I’m warning you.”\u003c/p\u003e\n\u003cp\u003e“Warning me? What’s your plan, Casey? Gonna kill me now?”\u003c/p\u003e\n\u003cp\u003eCasey lunged up, crossing the room, hand out toward Rory’s throat. “Shut up, Rory!” Rory knocked his hand away. “No! I won’t shut up. I’m leaving!” He turned looked for his\u003c/p\u003e\n\u003cp\u003eclothes, swaying a little. “Where are my clothes?”\u003c/p\u003e\n\u003cp\u003eCasey pointed. Rory went over to the chair and held up a pair of the traditional leather pants\u003c/p\u003e\n\u003cp\u003eworn by pets before the rules had been relaxed. “I’m not wearing these!”\u003c/p\u003e\n\u003cp\u003e“You can stay naked if you like. Suits me just fine.”\u003c/p\u003e\n\u003cp\u003e“You know what I mean! I won’t wear these to go out!”\u003c/p\u003e\n\u003cp\u003e“Who said you were going anywhere?” \u003c/p\u003e","sourceLink":"https://allnovel.net/cry-wolf-dark-hollow-wolf-pack-2/page-12.html","bookId":2254,"creation":"Oct 5, 2019 5:14:16 PM","modification":"Oct 5, 2019 5:14:16 PM"}
