{"id":86411,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCasey groaned, pulled him into his arms, and rolled Rory beneath him. He stretched out on top of Rory and ground his cock into his as he kissed him thoroughly. His hands strayed down to part the blanket and give him access to Rory’s still naked body. He ran his hands over it possessively and pushed both hands under Rory’s ass, holding him firmly beneath him.\u003c/p\u003e\n\u003cp\u003e“I love you too,” he whispered against his mouth. “I went a little crazy when you said you were leaving me. I didn’t mean to hit you so hard. I’m sorry, and I’ll never do it again. When you did walk out and Marco kept me away from you, I thought I might never see you again, baby. I couldn’t have stood that. I would have gone crazy.”\u003c/p\u003e\n\u003cp\u003e“We’re together now.”\u003c/p\u003e\n\u003cp\u003eCasey shuddered and together they pulled at his clothes. Once his skin was gloriously bare, Rory kissed every inch of it he could get to while pinned down again so completely. Breathing hard, Casey looked desperately around the room. “Lube?”\u003c/p\u003e\n\u003cp\u003eRory smiled happily. “Check the bedside drawer. Knowing Ian, he thought of everything.”\u003c/p\u003e\n\u003cp\u003eCasey reached across to it and eagerly grabbed the new tube lying inside the drawer. Ian had, indeed, anticipated their needs. Casey got on his knees and squeezed some on his fingers. Keeping eye contact with Rory, whose legs fell open for him, he gently prepared him, stretching with his fingers and smoothing it deep inside Rory’s still tender ass.\u003c/p\u003e\n\u003cp\u003eCasey leaned down between Rory’s spread legs to kiss the tip of Rory’s cock and when it responded enthusiastically by rising even farther up to stand against Rory’s stomach, he put his mouth over the length, taking him in all the way to the bottom of his shaft, then slowly sliding his mouth up and down until Rory moaned and twisted beneath him. He finished with a swirling kiss to the tip before he pulled Rory’s legs up over his shoulders.\u003c/p\u003e\n\u003cp\u003e“I want to see you when I’m loving you,” he whispered to Rory, and Rory nodded, unable to speak.\u003c/p\u003e\n\u003cp\u003eHe positioned the tip of his cock at Rory’s entrance, slid in slowly, pausing to see if Rory showed discomfort before gently pressing in farther. When he had filled him completely, he bent to kiss his nipples, licking at them and teasing with his tongue.\u003c/p\u003e\n\u003cp\u003e“Oh God,” Rory groaned. “Casey, I love you so much.”\u003c/p\u003e\n\u003cp\u003eCasey moved, seeking the spot deep inside that would drive Rory crazy and when he found it, Rory gasped aloud.\u003c/p\u003e\n\u003cp\u003eCasey smiled and teased some more with his cock. “There, baby? Right there?”\u003c/p\u003e\n\u003cp\u003eRory came, spurting cum hard against his and Casey’s chests. Casey followed him seconds later, adding his groans to Rory’s. Finally they lay together, happily spent and breathing hard. Casey let himself soften inside Rory before he rose and went to the bathroom to clean himself. He brought a warm cloth back for Rory and tenderly wiped him clean as he lay exhausted on the bed. Finished, he got into bed and turned Rory on his side to spoon him and cradle him in his arms.\u003c/p\u003e\n\u003cp\u003eHe whispered softly, “I love you, Rory. I’ll never stop loving you. I can’t do what I said. I knew I couldn’t keep hurting you when you walked out of that room. If I’d lost you, I’d have lost everything.”\u003c/p\u003e\n\u003cp\u003eRory heard him, but was too sleepy to do more than murmur unintelligibly back at him before sinking down into his dreams.\u003c/p\u003e\n\u003cp\u003eChapter Five\u003c/p\u003e\n\u003cp\u003eCasey woke up slowly, comfortable with Rory’s sweet, little body close to his. Someone knocked insistently on the bedroom door. “Casey? Rory? I’ve cooked breakfast for us. Come out when you’re ready.”\u003c/p\u003e\n\u003cp\u003eLeaving Rory sleeping soundly, Casey went into the bathroom to pee and splash water on his face. He put on his jeans and T-shirt and padded softly out to the kitchen, where Ian was already drinking a cup of coffee and buttering a piece of toast.\u003c/p\u003e\n\u003cp\u003e“I hope you like sausage and eggs.” Ian spread some blackberry jam on his toast and took a big bite.\u003c/p\u003e\n\u003cp\u003e“I’m starving.” Casey sat down to eat, motioning over his shoulder at the bedroom. “Rory’s still asleep. He hadn’t had a chance to recover from the mating and being in heat before all this started.”\u003c/p\u003e\n\u003cp\u003e“We’ll save him some. Actually, I wanted to talk to you anyway before Marco comes over to question you both.”\u003c/p\u003e\n\u003cp\u003e“God, Marco again? I’m gonna punch his lights out before this is over.”\u003c/p\u003e\n\u003cp\u003e“I know you two don’t get along, but Marco is Rory’s uncle, don’t forget, and he’s practically raised him since his father died. He loves Rory, just like you do.”\u003c/p\u003e\n\u003cp\u003e“Not just like I do. Nobody loves him as much as I do.”\u003c/p\u003e\n\u003cp\u003e“Sorry, I stand corrected, but you understand what I mean. He does love Rory and wants him to be happy. If he finds happiness with you, fine, but if not…”\u003c/p\u003e\n\u003cp\u003e“Rory’s happy. I keep him well satisfied.”\u003c/p\u003e\n\u003cp\u003e“I have no doubt you’ll keep him sexually satisfied, but are you capable of giving him the other things he needs to be happy?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“You have to forgive him for your brother and end your quest for revenge.” “Rory’s wolf killed him, and now the wolf is dead.” He shrugged. “End of problem.”\u003c/p\u003e\n\u003cp\u003e“That isn’t what you told him, and mental abuse is as cruel as physical. Rory’s wolf may have died physically, but he’s still wolf in his mind. He isn’t a pet and shouldn’t be treated or exhibited as such.”\u003c/p\u003e\n\u003cp\u003e“That’s over with. I told him I was wrong, and I meant it.”\u003c/p\u003e\n\u003cp\u003eIan nodded and moved away from the subject. “Wolves are all dominants—some more than others, though. You’re obviously an alpha, and I suspect, like myself, you are the type who likes the dominant lifestyle domestically, and plays it, shall we say, a little rough in the bedroom.”\u003c/p\u003e\n\u003cp\u003eCasey flushed. “I wouldn’t abuse him, if that’s what you’re getting at.”\u003c/p\u003e\n\u003cp\u003e“Maybe not intentionally. Playing the dominant may not be new to you, but being a submissive in any way is to Rory. That swat you gave him, hurt him. Sometimes we don’t realize our own strength. Remember, you are trying to correct behavior, not inflict pain. And you never ever correct when you’re angry or upset.” Ian leaned forward to emphasize the point.\u003c/p\u003e\n\u003cp\u003eCody blushed and ducked his head. “I know that now. I’ll tell him how sorry I am.”\u003c/p\u003e\n\u003cp\u003e“As for sexual play,” Ian continued. “Does he have a safe word?”\u003c/p\u003e\n\u003cp\u003e“A what?”\u003c/p\u003e\n\u003cp\u003e“A word he can say when it gets to be too much for him. A random word you know he wouldn’t say in the normal course of your love play.”\u003c/p\u003e\n\u003cp\u003e“We really haven’t had much love play yet.” They hadn’t. They’d only had sex once after Rory woke from the mating and heat induced sleep.\u003c/p\u003e\n\u003cp\u003e“Be sure you give him one, and if he uses it, everything stops immediately. I have some books you could read. You really need to be trained properly if you want to dominate him seriously. Remember being a Dom doesn’t mean you have the right to be an asshole. It’s got to be consensual, or it’s abuse, plain and simple. Talk to Rory. I think he must be a natural sexual submissive since your blood chose him, but he’s very young and very shy. Find out what his limits are. Then respect them. Understand?”\u003c/p\u003e\n\u003cp\u003eCasey had been paying careful attention and nodded thoughtfully. “I’d never hurt him, you know.” Not again, not knowing what losing Rory did to him even if it had only been a few hours. When Rory rejected their mating, he had gone crazy, and once he calmed down, he understood what Marco had felt when Nicky had been kidnapped and how those feelings had been transmitted to his pack, and to Rory. It was what made Rory attack his brother. He had to believe what Nicky said too. No matter how painful it was to think of his brother as a rapist, he knew deep down Aaron had intended to rape him.\u003c/p\u003e\n\u003cp\u003e“I know you wouldn’t hurt him intentionally. If he’s agreed to put himself in your hands, then he’s given you a great gift and an awesome responsibility. Respect it.”\u003c/p\u003e\n\u003cp\u003e“Are you talking about me, Ian?”\u003c/p\u003e\n\u003cp\u003eBoth men turned as Rory came into the room, still wrapped in a blanket. In all the confusion of the night before, he’d never retrieved anything to wear. He walked over and poured a cup of coffee, repeating his question. “Are you?”\u003c/p\u003e\n\u003cp\u003eIan smiled at him. “Maybe just a little. How are you feeling, Rory? Did you sleep well?”\u003c/p\u003e\n\u003cp\u003eRory smiled shyly. “Yes, very well, thanks.”\u003c/p\u003e\n\u003cp\u003e“Eat some breakfast, honey,” Casey told him. “You haven’t had anything for hours.”\u003c/p\u003e\n\u003cp\u003e“I just want coffee for now. Maybe later.”\u003c/p\u003e\n\u003cp\u003eCasey filled a plate with some toast and eggs and pushed it over to him. “Eat. I don’t want you to get sick.”\u003c/p\u003e\n\u003cp\u003eRory sighed and blushed. “Oh all right.” He picked up a fork and began to eat, while Casey watched him carefully. He must have been hungrier than he thought, because he finished it in just a few minutes. Ian smiled across the table at Casey and nodded.\u003c/p\u003e\n\u003cp\u003eA knock came on the door, but before Ian could open it, Nicky poked in his golden head and bounced into the room and over to the table. Marco came in more slowly and much more solemnly. Nicky bent down and hugged Rory, smiling over at Casey. “Hey, brat! Are you still causing trouble?”\u003c/p\u003e\n\u003cp\u003eRory rolled his eyes. “God, did you have to bring Nicky, Marco? My life is not irritating enough?”\u003c/p\u003e\n\u003cp\u003eNicky laughed and went back over to Marco, who opened his arms, it seemed, automatically. Nicky certainly had Marco well trained, Casey thought with amusement. Then Rory scooted his chair over next to his and leaned heavily against him. He immediately put an arm around him. The little sneer on Casey’s face at Marco’s expense suddenly died as he realized Rory was doing the same thing to him.\u003c/p\u003e\n\u003cp\u003eMarco spoke to Rory. “Nicky wanted a chance to see you, Rory, but I think it would be a good idea if you and I went for a walk. Nicky wants to talk to Casey alone.”\u003c/p\u003e\n\u003cp\u003eRory turned to Casey. “Is it okay if I go with him?”\u003c/p\u003e\n\u003cp\u003eMarco frowned, but Casey thrilled at the fact he asked permission and kissed the top of Rory’s head. “Sure, baby, go ahead. I’ll stay and talk to Nicky.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cry-wolf-dark-hollow-wolf-pack-2/page-15.html","bookId":2254,"creation":"Oct 5, 2019 5:14:16 PM","modification":"Oct 5, 2019 5:14:16 PM"}
