{"id":93980,"no":17,"title":"Page 17","content":"\u003cp\u003eCara stood in front of the bathroom mirror, examining her appearance with a critical eye. She wanted to look pretty for Vince. She had donned her favorite pair of slinky black slacks, a hot pink silk shirt, and a pair of black high-heeled sandals. She wore her hair loose, pulled away from her face with a pair of silver combs.\u003c/p\u003e\n\u003cp\u003eShe had just put on her lipstick when she heard his knock at the door. What felt like a million butterflies immediately started doing somersaults in the pit of her stomach. He was here!\u003c/p\u003e\n\u003cp\u003eShe took a slow, deep breath, and then another one before forcing herself to walk slowly to the door.\u003c/p\u003e\n\u003cp\u003eShe took another deep breath before she opened it. \"Hi.\"\u003c/p\u003e\n\u003cp\u003eHe whistled softly. \"Hi, yourself. Wow, you look fantastic!\"\u003c/p\u003e\n\u003cp\u003e\"Thank you. Come on in.\"\u003c/p\u003e\n\u003cp\u003eWhen he stepped across the threshold, she felt a funny little tingle slip down her spine.\u003c/p\u003e\n\u003cp\u003e\"So,\" he said, \"where would you like to go tonight?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" She lowered her gaze. \"Do we have to go somewhere?\"\u003c/p\u003e\n\u003cp\u003e\"Not if you don\u0027t want to.\"\u003c/p\u003e\n\u003cp\u003e\"I could order something from room service and we could stay in and watch a movie.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, darlin\u0027, if that\u0027s what you want.\"\u003c/p\u003e\n\u003cp\u003e\"Are you hungry?\"\u003c/p\u003e\n\u003cp\u003e\"You bet. You look good enough to eat.\"\u003c/p\u003e\n\u003cp\u003eShe stared at him, wide-eyed, her cheeks almost as pink as her shirt. \"Vince...\"\u003c/p\u003e\n\u003cp\u003eHe pulled her into his arms, his gaze capturing hers. \"Do you want me to stop?\"\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t done anything yet,\" she said, her voice little more than a squeak.\u003c/p\u003e\n\u003cp\u003e\"But I want to.\" His lips brushed her cheek, the tip of her nose, her eyelids. \"I want to taste every inch of you, explore every curve.\"\u003c/p\u003e\n\u003cp\u003eShe blinked up at him, her eyelids fluttering down as his mouth closed over hers. She was drowning in a haze of sensation. His mouth was everywhere, dropping feather-light kisses along both sides of her neck, nuzzling her breasts. His breath penetrated the thin silk of her shirt, heating her skin, melting her resistance. He kissed her again, long and deep, and when his tongue tangled with hers, she felt the electric heat of it sizzle all the way to the very center of her being.\u003c/p\u003e\n\u003cp\u003eWithout knowing quite how they got there, she found herself lying on the sofa with Vince stretched out beside her, his mouth on hers, their bodies pressed intimately together from shoulder to thigh. His hand slid slowly, seductively, up and down her side, his thumb skimming the edge of her breast.\u003c/p\u003e\n\u003cp\u003eShe moaned softly, thinking she had never known such pleasure, or such torment. She strained against him, her hips moving in the age-old dance of mating. Her body was on fire, screaming for relief.\u003c/p\u003e\n\u003cp\u003e\"Cara, dammit...\"\u003c/p\u003e\n\u003cp\u003eHis breath whispered against her neck. She felt the heat of his tongue, the scrape of his teeth.\u003c/p\u003e\n\u003cp\u003e\"Vince... please, Vince.\"\u003c/p\u003e\n\u003cp\u003eHer voice spurred him on, urging him to take what she was offering, to satisfy her hunger and his own, even as the voice of his conscience warred within him. He closed his eyes, the scent of her need and her blood arousing him until it was almost painful.\u003c/p\u003e\n\u003cp\u003eIt took every ounce of willpower he possessed to let her go. He took a deep breath, about to sit up and tell her they needed to take a walk and cool off, when her hand slid between their bodies, cupping his manhood, driving him over the edge.\u003c/p\u003e\n\u003cp\u003eScooping her into his arms, he carried her into the bedroom and laid her on the bed.\u003c/p\u003e\n\u003cp\u003eShe looked up at him, her eyes smoky with desire and a hint of uncertainty.\u003c/p\u003e\n\u003cp\u003eVince swore softly. What the hell was he thinking? He had to tell her the truth, now. And when he did, she\u0027d walk out of his life just like she\u0027d walked away from her parents.\u003c/p\u003e\n\u003cp\u003e\"Cara...\"\u003c/p\u003e\n\u003cp\u003e\"Make love to me, Vince.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think that\u0027s a good...\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t think.\" She reached for his hand, drawing him down on the bed beside her. \"Don\u0027t you want me?\"\u003c/p\u003e\n\u003cp\u003e\"Is that a trick question?\" He had to keep things light between them before he did something they would both regret when it was over.\u003c/p\u003e\n\u003cp\u003e\"Now you\u0027re making fun of me.\"\u003c/p\u003e\n\u003cp\u003e\"No, darlin\u0027. I just don\u0027t want to hurt you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a big girl. I know what I\u0027m doing.\" She ran her hands over his chest, up over his shoulders, down his arms.\u003c/p\u003e\n\u003cp\u003e\"Have you ever been with a man before?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eHe drew his fingertip along her cheek. \"Now, why don\u0027t I believe you?\"\u003c/p\u003e\n\u003cp\u003e\"Come closer,\" she said, her hand sliding seductively over his belly, \"and I\u0027ll prove it.\"\u003c/p\u003e\n\u003cp\u003e\"Cara, we need to talk.\"\u003c/p\u003e\n\u003cp\u003e\"Later,\" she said, and drawing his head down, she kissed him, and he was lost.\u003c/p\u003e\n\u003cp\u003eWith a low groan, he pulled her into his arms and surrendered to the hunger burning through him.\u003c/p\u003e\n\u003cp\u003eHer skin was soft and smooth, warm with life, her lips sweeter than wine. His hand delved into the wealth of her hair, loving the way the strands curled around his fingers. He massaged her nape, her back, gentling her to his touch. She was passionate and pliable in his arms, willing to follow wherever he led. He caressed her until she writhed beneath him, as eager and anxious as he.\u003c/p\u003e\n\u003cp\u003eHe basked in her touch as she explored his body in return. It took all his willpower to hold both his hunger and his desire in check until, with a soft whimper, she urged him to take her.\u003c/p\u003e\n\u003cp\u003eMurmuring her name, he lifted her hips to receive him, only then realizing that he had been right all along.\u003c/p\u003e\n\u003cp\u003eShe had never been intimate with a man. But by then, it was too late.\u003c/p\u003e\n\u003cp\u003eShe fell asleep in his arms.\u003c/p\u003e\n\u003cp\u003eFeeling like the worst kind of heel, Vince stroked her hair while his nostrils filled with the scent of her blood, not just the blood he had tasted, but the virginal blood that stained the sheets, proving she had been a maiden.\u003c/p\u003e\n\u003cp\u003eHe swore softly.\u003c/p\u003e\n\u003cp\u003eHow could he have done such a despicable thing? Sure, he was a vampire, but he had always prided himself on remaining a gentleman. He didn\u0027t satisfy his thirst on the blood of innocents. He didn\u0027t vent his lust on virgins.\u003c/p\u003e\n\u003cp\u003eTonight he had done both.\u003c/p\u003e\n\u003cp\u003eWhat was he to do with her now?\u003c/p\u003e\n\u003cp\u003eAnd what would Roshan do when he found out Vince had defiled his little girl? Vince swore softly.\u003c/p\u003e\n\u003cp\u003eWhatever DeLongpre did to him would be no more than he deserved.\u003c/p\u003e\n\u003cp\u003eHe was tempted to sneak out of the hotel and never see her again, but he couldn\u0027t bring himself to do such a cowardly thing. It was bad enough that he had defiled her.\u003c/p\u003e\n\u003cp\u003eInstead, he held her in his arms until he felt the approach of dawn, and then he kissed her cheek, pulled on his pants, and went home.\u003c/p\u003e\n\u003cp\u003eCara woke with a smile on her face. For a moment, she lay there, her eyes closed, remembering the night past. Making love to Vince had been the most wonderful, incredible experience of her life. For a moment, she held the memory close, reliving every kiss, every caress, every word he had whispered in her ear, the way he had cried her name as his body melded with hers, the soul shattering ecstasy that had followed.\u003c/p\u003e\n\u003cp\u003eVince. Feeling suddenly shy, she reached for him, only he wasn\u0027t there.\u003c/p\u003e\n\u003cp\u003eOpening her eyes, she sat up and glanced around the room. Then she saw the note on his pillow. Sitting up, she read it out loud.\u003c/p\u003e\n\u003cp\u003e\"Cara, I had an early appointment and I didn\u0027t want to wake you. I\u0027ll meet you at the library at 9. Love, V.\"\u003c/p\u003e\n\u003cp\u003eShe hugged the note to her breast and then, unbidden but inevitable, came the guilt. She had slept with a man she hardly knew. She told herself it didn\u0027t matter, that these days lots of people slept together when they weren\u0027t married or even engaged. No one even gave it a second thought. Couples lived together, slept together, and moved on. Movies and TV shows were all about sex. Advertisers used sex to sell everything from toothpaste to deodorant. And yet, deep inside, no matter how she tried to rationalize it, she knew what she had done was wrong.\u003c/p\u003e\n\u003cp\u003eWith a sigh, she flopped down on her stomach. If her parents found out, they would be disappointed in her. She told herself she didn\u0027t care what they thought. They were vampires, after all. But she did care, far more than she wanted to.\u003c/p\u003e\n\u003cp\u003eLying there in bed, she remembered all the good times she had shared with her parents. They had always made a big fuss over her birthdays, showering her with presents. Christmases had always been special.\u003c/p\u003e\n\u003cp\u003eShe smiled as she remembered how her father had always searched for the tallest tree, and how the three of them had always stayed up late to decorate it. She remembered laughter and presents and love. Lots of love. Her parents had taken her ice skating in the moonlight and for carriage rides in the park. They had arranged for her to take horseback riding lessons and ballet lessons. She remembered Easter egg hunts and enormous chocolate Valentines. She had never wanted for anything. Even now, she had a savings account with a balance of several thousand dollars that was hers to do with as she pleased.\u003c/p\u003e\n\u003cp\u003eShe punched her fist into the pillow as the word vampire slithered through her mind. She told herself it didn\u0027t matter, but it did. She no longer knew how to relate to them. It was like suddenly finding out they were aliens or pod people. Their whole lifestyle was foreign to her.\u003c/p\u003e\n\u003cp\u003eRising, she wandered into the living room. She didn\u0027t like staying in a hotel; she wasn\u0027t ready to go back home. But she could rent a house! Of course, it was the perfect solution.\u003c/p\u003e\n\u003cp\u003eExcited by the idea, she showered and dressed, grabbed a cup of coffee and a cinnamon roll at the hotel coffee shop, and then drove to the nearest real estate office. A glance in her rearview mirror told her that her watchdog was still watching-not that she was surprised. She was certain her father had informed Di Giorgio of her whereabouts the minute he got home.\u003c/p\u003e\n\u003cp\u003eHowever, she was too excited at the prospect of having a house of her own to be upset.\u003c/p\u003e\n\u003cp\u003eVince spent the day alternately working on putting a new engine in an ancient Chevy and worrying about his date with Cara. Making love to her last night had changed everything.\u003c/p\u003e\n\u003cp\u003eHe had never intended to fall in love, especially with a mortal female. He wasn\u0027t even sure when he had fallen in love with Cara DeLongpre. Sure, he had fallen in lust the moment he saw her in The Nocturne.\u003c/p\u003e\n\u003cp\u003eWhat man wouldn\u0027t? But love? How the hell had that happened? He tried to tell himself he hadn\u0027t known her long enough to love her, but from that first night, he couldn\u0027t imagine his life without her.\u003c/p\u003e\n\u003cp\u003eOf course, he had never intended to make love to her, either. As good as it had been, he couldn\u0027t help feeling it had been a big mistake. Taking her blood had been an even bigger one, but, like taking her innocence, it couldn\u0027t be undone.\u003c/p\u003e\n\u003cp\u003eHe muttered an oath as he scraped his hand on the engine block. He stared at the blood oozing from his knuckles, remembering how sweet Cara\u0027s had been, wondering if she remembered that, at the height of their lovemaking, he had tasted her.\u003c/p\u003e\n\u003cp\u003eWhen the phone rang, he figured it was the Chevy\u0027s owner calling to see if his car was ready. Instead, he heard Cara\u0027s voice, sweet and a little breathless.\u003c/p\u003e\n\u003cp\u003e\"Hi,\" she said. \"I hope you don\u0027t mind me calling you at work.\"\u003c/p\u003e\n\u003cp\u003e\"Not at all.\" Lord, just hearing her voice made him hard. \"You can call me anytime.\"\u003c/p\u003e\n\u003cp\u003e\"Guess what I did this afternoon?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t imagine.\"\u003c/p\u003e\n\u003cp\u003e\"I rented a house! Wait until you see it. I\u0027m on my way to the store to buy dishes and stuff before I go to work. So, what are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Putting a new engine in an old Chevy.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003eHe sat on a corner of the desk. \"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I thought... never mind.\"\u003c/p\u003e\n\u003cp\u003e\"You thought what?\"\u003c/p\u003e\n\u003cp\u003e\"That maybe you\u0027d go shopping with me. I could come by and pick you up.\"\u003c/p\u003e\n\u003cp\u003eVince glanced outside. It wouldn\u0027t be dark for another couple of hours. \"I\u0027m afraid I can\u0027t leave right now, but we\u0027re still on for tonight, right? Nine o\u0027clock?\"\u003c/p\u003e\n\u003cp\u003e\"Right.\" Though she tried to hide it, he heard the disappointment in her voice.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, darlin\u0027.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay, I understand. See ya later.\"\u003c/p\u003e\n\u003cp\u003eHe swore softly as he hung up the receiver. Not that he particularly wanted to go shopping for dishes, but he hated to disappoint Cara. Still, it couldn\u0027t be helped.\u003c/p\u003e\n\u003cp\u003eAt dusk, he took the Chevy for a test run. Twenty minutes later, the owner came to pick it up.\u003c/p\u003e\n\u003cp\u003eVince closed up shop, took a shower, pulled on a pair of jeans and a black shirt, and combed his hair.\u003c/p\u003e\n\u003cp\u003eLeaving the garage, he prowled the streets, searching for prey. It didn\u0027t take him long. He fed quickly, then went to The Nocturne to pass a few hours until it was time to meet Cara.\u003c/p\u003e\n\u003cp\u003eIt was with a mingled sense of anticipation and trepidation that he slid behind the wheel of the Mustang and drove to the library. Tonight. He would tell her the truth tonight.\u003c/p\u003e\n\u003cp\u003eCara looked up when the library door opened. All night, she had been on pins and needles. Every time the door opened, she had hoped it would be Vince. She checked the time, thinking that the hours had never passed so slowly.\u003c/p\u003e\n\u003cp\u003eShe was working in the stacks a few minutes before closing time when she sensed a presence behind her.\u003c/p\u003e\n\u003cp\u003eHoping it was Vince, she turned around, only to come face to face with Anton.\u003c/p\u003e\n\u003cp\u003e\"Hi, sweet cakes,\" he said cheerfully.\u003c/p\u003e\n\u003cp\u003e\"Hello.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t seen you for a while, so I thought I\u0027d come by and make sure you\u0027re all right.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine, thank you.\"\u003c/p\u003e\n\u003cp\u003eHe canted his head to one side. \"You\u0027re mad at me, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Why should I be mad?\" she retorted.\u003c/p\u003e\n\u003cp\u003e\"Why, indeed?\"\u003c/p\u003e\n\u003cp\u003e\"You were right about my parents,\" she said. \"I guess I can\u0027t be mad at you for that.\" Even though you made me see my parents for what they truly are and ruined my life, she thought bleakly.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry if I spoke out of turn,\" he said with an apologetic smile, \"but I really thought you should know.\"\u003c/p\u003e\n\u003cp\u003e\"And now I do. If you\u0027ll excuse me, I\u0027ve got work to do.\"\u003c/p\u003e\n\u003cp\u003e\"How about if I wait for you to get off? We could go out for a drink.\"\u003c/p\u003e\n\u003cp\u003e\"No, thank you. I have a date.\"\u003c/p\u003e\n\u003cp\u003e\"I see. How about tomorrow night?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"So you are mad.\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m just not interested in seeing you anymore. I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Because I told you about your parents?\"\u003c/p\u003e\n\u003cp\u003e\"Partly.\"\u003c/p\u003e\n\u003cp\u003eHe lifted one brow. \"Partly?\"\u003c/p\u003e\n\u003cp\u003e\"I really have to go, Anton.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, his eyes narrowing. He looked suddenly ominous, even dangerous. She told herself she was seeing things that weren\u0027t there, but she couldn\u0027t stifle the shiver of unease that ran down her spine. She watched him walk away and breathed a sigh of relief when he went out the door. Hopefully, she would never see him again.\u003c/p\u003e\n\u003cp\u003e\"Is that him?\" Sarah Beth asked, coming up behind her.\u003c/p\u003e\n\u003cp\u003e\"Him?\" Cara shelved the last book on the cart and started toward the front desk.\u003c/p\u003e\n\u003cp\u003e\"The man who\u0027s had you tied in knots the last few days,\" Sarah Beth said, falling into step beside her.\u003c/p\u003e\n\u003cp\u003e\"Oh, no.\"\u003c/p\u003e\n\u003cp\u003e\"Good, cause I don\u0027t like his looks at all.\"\u003c/p\u003e\n\u003cp\u003eBefore Cara could reply, the door opened again. This time she didn\u0027t have to look to know that Vince had arrived.\u003c/p\u003e\n\u003cp\u003eShe ran a hand over her hair, took a deep breath, and turned to face him.\u003c/p\u003e\n\u003cp\u003eHis megawatt smile made her heart skip a beat. \"I guess I\u0027m a little early.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all right. Vince, this is my best friend, Sarah Beth. Bethy, this is Vince.\"\u003c/p\u003e\n\u003cp\u003e\"Pleased to meet you, Sarah Beth,\" Vince said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nice to meet you, too,\" Sarah Beth replied airily. \"Now I\u0027ve got a face to go with the name.\"\u003c/p\u003e\n\u003cp\u003eVince looked at Cara, one brow raised quizzically. \"You been talking about me?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"Maybe, a little.\"\u003c/p\u003e\n\u003cp\u003e\"Only good things, I hope,\" he said with a teasing grin.\u003c/p\u003e\n\u003cp\u003e\"Of course.\" Picking up the microphone on the desk, Cara made the announcement that the library would be closing in ten minutes.\u003c/p\u003e\n\u003cp\u003e\"Run along, you two,\" Sarah Beth said, making a shooing motion with her hand. \"Mary and I can lock up.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure?\" Cara asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure,\" Sarah Beth said emphatically. \"Now, go on, get!\"\u003c/p\u003e\n\u003cp\u003e\"So,\" Cara said as they left the library, \"what shall we do tonight?\"\u003c/p\u003e\n\u003cp\u003e\"I thought you were fixin\u0027 to show me your new house.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to.\"\u003c/p\u003e\n\u003cp\u003e\"Then that\u0027s what we\u0027ll do.\" He walked her to her car, waited while she unlocked the door. \"I\u0027ll follow you,\" he said.\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003eHe closed her door, then walked to his own car. Di Giorgio pulled out of the lot behind him.\u003c/p\u003e\n\u003cp\u003eVince tapped his hand on the steering wheel. Being alone with Cara seemed like a really bad idea, especially after last night. He told himself it couldn\u0027t happen again, but he doubted he had the willpower to leave her alone now that he knew what it was like to make love to her, to taste her sweetness. He had thought of little else all day. Time and again his mind had strayed toward last night. Mara might have been the most accomplished lover he had ever known, but she couldn\u0027t hold a candle to Cara\u0027s sweet innocence. His body had reacted every time he remembered how willingly Cara had given herself to him, how soft and supple her body had been, how her warmth had chased away the perpetual cold that was part of him now. All day, he had wanted nothing more than to make love to her again.\u003c/p\u003e\n\u003cp\u003eA short time later, she pulled up in front of a two-story house surrounded by a white picket fence. Rose bushes grew on both sides of the yard; flowers bloomed along the red brick walkway that led up to the house. A wicker rocking chair occupied one corner of the porch.\u003c/p\u003e\n\u003cp\u003eVince swore softly as he parked his car behind hers. Talk about your vine-covered cottage! All that was missing was a cat sleeping on the rocker.\u003c/p\u003e\n\u003cp\u003e\"What do you think?\" Cara asked as he got out of the car.\u003c/p\u003e\n\u003cp\u003e\"Looks nice.\"\u003c/p\u003e\n\u003cp\u003e\"It is. I love it! Of course, it\u0027s not nearly as big or as nice as... never mind.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay. This place looks more like you than that old mansion.\"\u003c/p\u003e\n\u003cp\u003e\"Do you really think so?\"\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eShe waved to Frank, then took Vince\u0027s hand in hers as they went up the walkway to the porch. She unlocked the front door, then waited for him to precede her.\u003c/p\u003e\n\u003cp\u003e\"After you,\" he said.\u003c/p\u003e\n\u003cp\u003eCara stepped inside, then glanced over her shoulder, frowning when she saw he was still standing out on the porch. \"Aren\u0027t you coming in?\"\u003c/p\u003e\n\u003cp\u003e\"My mama always taught me to wait to be invited.\"\u003c/p\u003e\n\u003cp\u003eIf Cordova comes to call, he can\u0027t enter unless you invite him inside. Her father\u0027s words rose in the back of her mind, but she dismissed them out of hand. She had seen Vince during the day, she had talked to him on the phone when the sun was high in the sky. He couldn\u0027t be a vampire. It had just been her father\u0027s way of trying to break them up.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" she said, flicking on the light switch, \"you\u0027re invited. Come on in.\"\u003c/p\u003e\n\u003cp\u003eVince crossed the threshold, his skin tingling as he did so. He wondered what it was about thresholds that had the power to repel him. If he ever saw Cara\u0027s father again, maybe he would ask him. Come to think of it, he still had a lot of unanswered questions about his new lifestyle.\u003c/p\u003e\n\u003cp\u003e\"So, what do you think?\" Cara asked as he looked around. \"Most of the furniture came with the house. I really like the sofa, but I\u0027m not sure I like the end tables or the...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s real nice, darlin\u0027,\" he said, and it was.\u003c/p\u003e\n\u003cp\u003eThe walls were off-white, the floor was hardwood. A blue and white flowered sofa and matching love seat were arranged on opposite sides of a glass-topped coffee table. The end tables were a dark red oak, the lamps were wrought iron. An entertainment center took up most of one wall.\u003c/p\u003e\n\u003cp\u003e\"Come on,\" she said, taking him by the hand, \"I\u0027ll give you a tour.\"\u003c/p\u003e\n\u003cp\u003eHe followed her into the kitchen, which was a sort of sage green with stainless steel appliances. A small round table held a vase of fresh flowers. In addition to the living room and kitchen, there was also a small guestroom, a bathroom, and a large linen closet on the first floor.\u003c/p\u003e\n\u003cp\u003eHe followed Cara upstairs. There were two bedrooms here, each with their own bathroom. One bedroom was yellow; the other, larger room was a pale blue. She had taken the blue bedroom for herself.\u003c/p\u003e\n\u003cp\u003eVince glanced at the bed. The spread was white. Several pillows in various shades of blue were scattered near the headboard. He swore softly as his mind immediately conjured an image of the two of them snuggling under the covers, their arms and legs intimately entwined.\u003c/p\u003e\n\u003cp\u003eHe blew out a breath, banishing the images from his mind.\u003c/p\u003e\n\u003cp\u003e\"I still need to buy a few things,\" Cara remarked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a nice place,\" Vince said. \"It suits you.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\" She smiled, pleased. It was important to her that he liked the place, though she wasn\u0027t sure why. \"Can I get you anything? Coffee? A cold drink?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m fine.\"\u003c/p\u003e\n\u003cp\u003eStill holding his hand, she led him back into the living room and sat down on the sofa. He dropped down beside her, every fiber of his being attuned to her presence-the scent of her hair and skin, the steady beat of her heart, the rhythm of her breathing, the warmth of her thigh brushing against his own. His body grew hard. His fangs ached.\u003c/p\u003e\n\u003cp\u003eHe swore under his breath, quietly cursing himself for his lack of restraint last night, and for the hunger raging through him now. He had fed earlier and, for the first time, he had found little satisfaction in it.\u003c/p\u003e\n\u003cp\u003eHaving tasted Cara\u0027s sweetness, he was afraid he would never be satisfied with anything else.\u003c/p\u003e\n\u003cp\u003e\"Do you want to watch some TV?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t miss the tremor in her voice. Was she as nervous as he was? Did her body ache for his touch the way his ached for hers? He should tell her the truth tonight. It was the right thing to do, but he couldn\u0027t bear to lose her, not now.\u003c/p\u003e\n\u003cp\u003e\"Vince?\"\u003c/p\u003e\n\u003cp\u003e\"Sure, darlin\u0027, whatever you want to do is fine with me.\"\u003c/p\u003e\n\u003cp\u003ePicking up the remote, she turned on the TV, then turned it off again. \"I\u0027d rather talk, if that\u0027s all right with you.\"\u003c/p\u003e\n\u003cp\u003e\"Something on your mind?\"\u003c/p\u003e\n\u003cp\u003e\"You,\" she replied candidly. \"I really don\u0027t know very much about you.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"There isn\u0027t a whole hell of a lot to know.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me about your family. Are you close? Do you see them often?\"\u003c/p\u003e\n\u003cp\u003e\"Not as often as I\u0027d like. I think I told you I\u0027ve got three brothers and a sister.\"\u003c/p\u003e\n\u003cp\u003e\"And a cat.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"Are you the oldest? The youngest?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the youngest son. My oldest brother, Ray, is a cop. He\u0027s married to an accountant and they\u0027ve got three kids. My brother Frank is a fireman. He got married two years ago. Baby on the way. Joe is a paramedic. He\u0027s got four kids and another due any time now. My sister, Eve, got married last year. She\u0027s two years younger than I am.\"\u003c/p\u003e\n\u003cp\u003e\"Are your parents still alive?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. My old man was a mechanic. My mother\u0027s a stay-at-home mom, although she\u0027s been talking about going to work since my dad retired,\" Vince said, grinning. \"She said she understands now why so many older women go to work. She complains a lot about him being underfoot all day, but she doesn\u0027t mean it.\"\u003c/p\u003e\n\u003cp\u003e\"It sounds like you have a wonderful family,\" Cara said wistfully. \"I wish I had brothers and sisters.\"\u003c/p\u003e\n\u003cp\u003e\"There were times when I wished I didn\u0027t,\" Vince remarked. Times like now, when he no longer fit into\u003c/p\u003e\n\u003cp\u003ethe family. \"Have you talked to your folks lately?\"\u003c/p\u003e\n\u003cp\u003e\"No. I don\u0027t know what to say.\" She blinked back the hot tears that threatened to fall. \"I\u0027m not sure how I feel about them anymore. Why didn\u0027t they tell me the truth?\"\u003c/p\u003e\n\u003cp\u003e\"Probably because they were afraid you\u0027d react just the way you did.\"\u003c/p\u003e\n\u003cp\u003e\"They should have told me years ago.\"\u003c/p\u003e\n\u003cp\u003e\"Would that have made it any easier to believe?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" she said miserably. \"Maybe if they\u0027d told me when I was a child, it would have been easier to accept.\" She shook her head. \"Maybe not.\"\u003c/p\u003e\n\u003cp\u003e\"They were probably afraid you\u0027d tell someone when you were younger,\" Vince suggested. \"It might have been a hard secret to keep.\"\u003c/p\u003e\n\u003cp\u003e\"I guess so.\" She tried to imagine how she would have reacted if she had found out when she was eight or nine or fifteen. Would she even have believed it? As for keeping such a thing a secret, until she went to school, she\u0027d had no one to tell.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve been good to you, Cara. They raised you the best they could. It\u0027s obvious that they love you. I think you\u0027re being too hard on them.\"\u003c/p\u003e\n\u003cp\u003eShe rested her head on his shoulder. \"Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re the only parents you\u0027ve got,\" Vince said quietly. \"You might want to remember that.\"\u003c/p\u003e\n\u003cp\u003eA tear slipped down her cheek. He was right, she thought. Vampires or not, they were the only family she had. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-touch-children-of-the-night-2/page-17.html","bookId":2300,"creation":"Oct 5, 2019 6:05:51 PM","modification":"Oct 5, 2019 6:05:51 PM"}
