{"id":93995,"no":32,"title":"Page 32","content":"\u003cp\u003eCara glanced at her father for reassurance, though she found little to reassure her. The smell of his singed flesh filled the confines of the room. The skin at his wrists was raw and bright red, as was the skin at his neck, ankles, and chest. His face was also badly burned. Though his expression remained impassive, she knew he must be in agony.\u003c/p\u003e\n\u003cp\u003eShe tugged on the leather straps that bound her hands and feet. She had to get free, had to help him. She had always thought her father was indomitable. Since learning he was a vampire, she had assumed he was indestructible. It was frightening to see him subdued and helpless. If he couldn\u0027t fight Serafina, what hope did she have of getting away from the woman?\u003c/p\u003e\n\u003cp\u003eA movement at the other end of the table drew Cara\u0027s gaze. There was a sudden hush as Serafina lit a long white candle and placed it in a holder in the center of the cloth-covered table beside the crypt.\u003c/p\u003e\n\u003cp\u003eShaking out the match, Serafina turned toward Anton, who held out his left arm. She filled a syringe with his blood and emptied it into a small glass vial. Next, she drew blood from her own arm and put it into another vial. In all, there were five vials on the table, along with three jars and a silver bowl. Serafina smiled at her son, and then she began to chant softly.\u003c/p\u003e\n\u003cp\u003e\"On All Hallow\u0027s Eve, between dusk and dawn, the blood of kin must be drawn.\" She picked up an eye-dropper and dipped it into one of the vials. \"Nine drops, no more, no less, the blood of kin you must bless.\"\u003c/p\u003e\n\u003cp\u003eShe made a pagan sign over the eye-dropper, then slowly added nine drops of Anton\u0027s blood to the silver bowl.\u003c/p\u003e\n\u003cp\u003e\"To this the blood of love you add, and the blood of an enemy, it must be had. Seven drops of each, one by one, quickly now, it must be done.\"\u003c/p\u003e\n\u003cp\u003eOnce again, she added blood to the bowl, seven drops of her own blood, seven drops of Roshan\u0027s.\u003c/p\u003e\n\u003cp\u003e\"Five drops of a maiden\u0027s blood,\" she intoned, and added five drops of Cara\u0027s blood to the bowl.\u003c/p\u003e\n\u003cp\u003e\"Rosemary for remembrance.\" She sprinkled rosemary into the dish. \"An infant\u0027s blood, three drops for life anew.\" More blood was added to the bowl. \"A sprinkling of yarrow, a dash of rue.\"\u003c/p\u003e\n\u003cp\u003eSerafina added the remaining ingredients, then stirred them together with a silver spoon. \"Spread the blood upon the crypt, when the moon commands the sky.\" Serafina knelt beside the crypt, her expression rapt as she poured the contents of the bowl onto the crypt and then smeared the bloody mixture over the top with her bare hands. When that was done, she nodded at Anton, who pushed the top of the stone crypt aside. It fell to the floor with a resounding crash, revealing the casket within.\u003c/p\u003e\n\u003cp\u003e\"Call forth the dead, his name times three. Doubt not, and he will come to thee.\" Serafina stood, her arms lifted over her head, blood dripping from her fingertips. \"Anthony!\" she cried. \"Anthony! Anthony!\"\u003c/p\u003e\n\u003cp\u003eCara felt a shiver run down her spine as Serafina\u0027s voice echoed off the walls. She felt the hair raise along the back of her neck and along her arms as a strange current ran through the room. She glanced at her father. Judging by his expression and the way he jerked weakly against his restraints, she guessed that he, too, had sensed the otherworldly power vibrating through the night.\u003c/p\u003e\n\u003cp\u003eSerafina continued to stare at the coffin, as if she could will her beloved to rise.\u003c/p\u003e\n\u003cp\u003eAnton frowned at her. \"Maybe you did it wrong.\"\u003c/p\u003e\n\u003cp\u003e\"No!\" Serafina exclaimed. \"I did everything I was supposed to do.\" With her bare hands, she ripped the\u003c/p\u003e\n\u003cp\u003elid off the coffin. A horrible smell rose in the air. \"Anthony, come to me!\"\u003c/p\u003e\n\u003cp\u003eA low hum vibrated through the air and then, to Cara\u0027s horror, the body inside the coffin moved.\u003c/p\u003e\n\u003cp\u003e\"Yes!\" Serafina\u0027s voice was filled with exultation. \"Yes, my love, come to me!\"\u003c/p\u003e\n\u003cp\u003eAnd Anthony Loken rose from the coffin.\u003c/p\u003e\n\u003cp\u003eCara stared at the thing that had once been Anthony Loken. His eyes glowed a dull red, his skin was pale; in some places, it had rotted away.\u003c/p\u003e\n\u003cp\u003eAnton stared at his father in horror. \"Something\u0027s gone wrong!\"\u003c/p\u003e\n\u003cp\u003eSerafina whirled around, her eyes wild. She held up her hand, fingers spread wide. \"The blood of kin,\"\u003c/p\u003e\n\u003cp\u003eshe said, folding one finger down. \"The blood of love.\" She folded another finger down. \"The blood of an enemy. A maiden\u0027s blood.\" She stabbed her forefinger in Cara\u0027s direction. \"Are you a virgin?\"\u003c/p\u003e\n\u003cp\u003eCara stared at the woman, wondering which would serve her better, the truth or a lie?\u003c/p\u003e\n\u003cp\u003eThe witch turned on her son. \"Did you touch her?\"\u003c/p\u003e\n\u003cp\u003e\"No, I swear it.\"\u003c/p\u003e\n\u003cp\u003eOnce again, Serafina directed her attention to Cara. \"Whore! Your blood was not pure! See what you\u0027ve done!\"\u003c/p\u003e\n\u003cp\u003eShe turned toward the thing that had been Anthony.\u003c/p\u003e\n\u003cp\u003eThe creature stood in front of the coffin, unmoving except for his eyes, which were filled with confusion.\u003c/p\u003e\n\u003cp\u003e\"Mother, you\u0027ve got to put him back,\" Anton said. \"You haven\u0027t raised my father. You\u0027ve raised a monster!\"\u003c/p\u003e\n\u003cp\u003eThe thing that had been Anthony Loken turned its head and stared at Anton. \"Son?\" His voice was rusty with disuse.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Serafina said, her smile radiant. \"Our son.\"\u003c/p\u003e\n\u003cp\u003e\"Liar!\" Loken roared.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true, my love.\" Apparently unaware of any danger, Serafina moved toward Anthony, one hand outstretched, a smile of welcome on her face. \"Anthony, my beloved, come to me.\"\u003c/p\u003e\n\u003cp\u003eTeeth bared, he reached for her. There was a sharp crack as he broke her neck, and then he tossed her aside.\u003c/p\u003e\n\u003cp\u003eAnton took one look at his mother\u0027s broken body and ran out the door and up the stairs.\u003c/p\u003e\n\u003cp\u003eFear congealed deep in Cara\u0027s belly as Anthony Loken moved woodenly toward her. She screamed as he drew near, went weak with relief when he lumbered past her toward the stairway.\u003c/p\u003e\n\u003cp\u003eVince\u0027s head snapped up as Cara\u0027s voice rang out in his mind. He had no sense of where she was, only that she was terrified.\u003c/p\u003e\n\u003cp\u003eWith preternatural speed, he left The Nocturne. Where was she? He knew Mara could find anyone at\u003c/p\u003e\n\u003cp\u003eany time, but he hadn\u0027t yet perfected that part of his vampiric nature.\u003c/p\u003e\n\u003cp\u003eHowever, some things came easy. A thought took him to the library. Sarah Beth told him that Cara had gone outside with Anton a little after six o\u0027clock and hadn\u0027t returned.\u003c/p\u003e\n\u003cp\u003e\"I went outside at six-thirty and she was gone, though her car\u0027s still here, and so is her bodyguard\u0027s. I called her cell phone a few times, but she\u0027s not answering.\" Sarah Beth shook her head. \"I\u0027ve spent the last half hour wondering if I should call the police. Do you think I should call them?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Vince said curtly. He didn\u0027t want anyone to get hold of Anton before he did. Keeping a tight rein on his anger, he headed for Cara\u0027s house, telling himself all the while that there was nothing to worry about. She had dated Anton before; perhaps she was dating him again. He didn\u0027t believe it for a minute, but he clung to the thought in an effort to stave off an ever-increasing sense of dread.\u003c/p\u003e\n\u003cp\u003eHe knew her house was empty even before he rang the bell. Something was definitely wrong. He could feel it in his gut. Fighting down a growing sense of panic, he headed for DeLongpre\u0027s house. He needed help, and he couldn\u0027t think of anyone more qualified than her father.\u003c/p\u003e\n\u003cp\u003eBrenna met him at the door. \"Roshan, did you... Vince! What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m looking for Cara. Do you know where she is?\"\u003c/p\u003e\n\u003cp\u003e\"No, and it\u0027s driving me crazy with worry. Roshan left here hours ago with Anton Bouchard.\"\u003c/p\u003e\n\u003cp\u003e\"Bouchard!\" Damn, what was Anton up to? Nothing good, that was for sure.\u003c/p\u003e\n\u003cp\u003e\"Yes, I wanted to go with them, but Roshan told me to stay here. I overheard Anton telling Roshan that his mother had Cara.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know where they might have gone?\"\u003c/p\u003e\n\u003cp\u003e\"I have a feeling they\u0027ve gone to that abandoned laboratory outside of town. I was just about to go out there.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go with you.\"\u003c/p\u003e\n\u003cp\u003e\"I sent Frank to check it out He\u0027s probably there by now.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eIt was strange, traveling at preternatural speed with another vampire. He had never done it before. They passed through the night like shadows, invisible to human eyes.\u003c/p\u003e\n\u003cp\u003eIt was a peculiar sensation. Like everything else in his new lifestyle, it had taken some practice to master, and some getting used to. He wondered how long it would take for things like shape shifting and dissolving into mist to become second nature.\u003c/p\u003e\n\u003cp\u003eThey reached the lab in a matter of moments. One of DeLongpre\u0027s cars was parked off the road, screened by a section of dense brush. Di Giorgio was waiting for them by the car. He carried a sawed-off shotgun. It looked very much at home in the crook of his arm.\u003c/p\u003e\n\u003cp\u003e\"Have you seen anything?\" Brenna asked anxiously.\u003c/p\u003e\n\u003cp\u003e\"No. I circled the building. The only entrance is the front door, and it\u0027s locked.\"\u003c/p\u003e\n\u003cp\u003e\"Come on,\" Brenna said. \"Roshan\u0027s in trouble.\"\u003c/p\u003e\n\u003cp\u003eFrank went first, followed by Brenna and Vince. Vince nodded in grim satisfaction as a blast of the shotgun shattered the lock. So much for the element of surprise, he mused as he followed the bodyguard and Cara\u0027s mother down a flight of stairs, wondering, as he did so, why the threshold had no power to stop him. Perhaps it only worked on homes, he thought, and then he smelled blood and he knew the answer. Violence had been done here, shattering the threshold\u0027s protective power.\u003c/p\u003e\n\u003cp\u003eThey paused in the first room before moving through it to another flight of stairs.\u003c/p\u003e\n\u003cp\u003eAgain, Di Giorgio went first, his shotgun at the ready.\u003c/p\u003e\n\u003cp\u003eA cry of horror escaped Brenna\u0027s lips when she entered the room at the bottom of the stairs.\u003c/p\u003e\n\u003cp\u003eComing up behind her, Vince swore a vile oath. The last vestiges of black magick hung heavy in the air, along with the scent of blood, death, and decay.\u003c/p\u003e\n\u003cp\u003eHe stared at the woman sprawled facedown on the floor. It was obvious, from the angle of her neck, that she was dead.\u003c/p\u003e\n\u003cp\u003eHe swept past Brenna to Cara. After freeing her from the restraints, he drew her into his arms. \"Are you all right?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"My dad...\"\u003c/p\u003e\n\u003cp\u003eVince glanced at the vampire. Roshan\u0027s eyes were closed, his skin the color of old parchment.\u003c/p\u003e\n\u003cp\u003eBrenna reached for one of the straps holding her husband down only to let out a harsh cry of pain as the silver burned her hand. \"Frank! Do something!\"\u003c/p\u003e\n\u003cp\u003eSetting the shotgun aside, Di Giorgio quickly removed the silver manacles that bound DeLongpre to the table.\u003c/p\u003e\n\u003cp\u003e\"Roshan!\" Brenna placed her hand on his shoulder. \"Roshan, can you hear me?\"\u003c/p\u003e\n\u003cp\u003eCara went to stand beside her mother. \"What\u0027s wrong with him?\" she asked, her voice thick with unshed tears. \"He can\u0027t be dead!\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the silver,\" Brenna explained. \"It\u0027s like poison to us. We\u0027ve got to get him off that table. Frank...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take him,\" Vince said. \"Di Giorgio, you go on ahead, make sure the coast is clear.\"\u003c/p\u003e\n\u003cp\u003eWith a curt nod, Di Giorgio scooped up the shotgun and moved toward the stairs. Brenna and Cara followed him. Both women glanced repeatedly over their shoulders to make sure Vince was right behind them.\u003c/p\u003e\n\u003cp\u003eWhen they reached the top of the stairs, Cara came to an abrupt halt. \"Wait. The baby...\"\u003c/p\u003e\n\u003cp\u003e\"What baby?\" Brenna asked.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a baby in the lab. We can\u0027t just leave it.\"\u003c/p\u003e\n\u003cp\u003e\"Who does it belong to?\" Brenna asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, but we can\u0027t leave it here.\" Turning on her heel, Cara ran to the lab and scooped the baby\u003c/p\u003e\n\u003cp\u003efrom the crib. Still drugged, it lay in her arms like a rag doll. Crooning softly, Cara rejoined the others.\u003c/p\u003e\n\u003cp\u003e\"Poor little thing,\" she murmured.\u003c/p\u003e\n\u003cp\u003eVince stared at her. She made a pretty picture, standing there with the infant cradled in her arms. For a moment, he imagined she was his wife and that the baby was his. The impossibility of such a thing filled him with a nameless anger.\u003c/p\u003e\n\u003cp\u003e\"What the hell are you going to do with it?\" he asked gruffly.\u003c/p\u003e\n\u003cp\u003e\"After we get my father home, I\u0027ll take the baby to the police and say that I found it. I\u0027m sure the parents must be frantic.\"\u003c/p\u003e\n\u003cp\u003e\"What if it\u0027s an orphan?\" Brenna wondered aloud.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Cara said. \"We\u0027ll cross that bridge when we come to it.\"\u003c/p\u003e\n\u003cp\u003eVince grunted softly as he followed her outside. He hadn\u0027t missed the wistful note in Brenna\u0027s voice. He couldn\u0027t help wondering if she was thinking about adopting another baby or, in this case, stealing one. But it wasn\u0027t his concern.\u003c/p\u003e\n\u003cp\u003eHe settled Roshan in the back seat of Frank Di Giorgio\u0027s car. Brenna refused to be separated from her husband. Climbing into the back seat, she cradled his head in her lap. Cara got into the front seat with the baby, and Vince squeezed in beside her.\u003c/p\u003e\n\u003cp\u003e\"Someone should burn that horrible place down,\" Brenna muttered.\u003c/p\u003e\n\u003cp\u003e\"Maybe someone will,\" Di Giorgio remarked.\u003c/p\u003e\n\u003cp\u003eSeeing the expression on the bodyguard\u0027s face, Vince was pretty sure that the lab would be nothing but a pile of rubble come morning.\u003c/p\u003e\n\u003cp\u003eThey traveled in silence for a while and then Cara looked up at Vince. \"Where did you go?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Why did you leave like that, without even telling me good-bye.\"\u003c/p\u003e\n\u003cp\u003eMindful of the others in the car, he said, \"I had to leave town suddenly.\"\u003c/p\u003e\n\u003cp\u003e\"So suddenly you couldn\u0027t take five minutes to call me?\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t get to a phone.\" Another lie, he thought ruefully. When would it end?\u003c/p\u003e\n\u003cp\u003e\"So, when did you get back in town?\"\u003c/p\u003e\n\u003cp\u003e\"Late last night.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Where are you staying?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m back at the garage,\" he said, grinning. \"The owner made me sign a one-year lease this time.\"\u003c/p\u003e\n\u003cp\u003eBefore she could ask any more questions, the car careened around a corner and rattled over a rut in the road. A short time later, Di Giorgio pulled up in front of DeLongpre\u0027s house.\u003c/p\u003e\n\u003cp\u003eHolding the baby in one arm, Cara ran to open the front door. Di Giorgio went back to close and lock the gate while Vince carried DeLongpre into the house. Brenna hovered at his side.\u003c/p\u003e\n\u003cp\u003e\"Upstairs,\" Brenna directed, running ahead.\u003c/p\u003e\n\u003cp\u003eWith a nod, Vince carried the unconscious vampire up the stairs and into the bedroom where Brenna waited. She had turned down the covers on the bed and Vince settled the vampire on the mattress.\u003c/p\u003e\n\u003cp\u003eCara stood in the doorway, her face pale. \"Will he be all right?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll be fine,\" Brenna said, stroking his hair. \"He just needs rest.\"\u003c/p\u003e\n\u003cp\u003eAnd blood, Vince thought. He looked across the bed at Brenna and knew she was thinking the same thing.\u003c/p\u003e\n\u003cp\u003e\"Cara,\" Brenna said quietly, \"send Frank up here, then wait for me downstairs.\"\u003c/p\u003e\n\u003cp\u003e\"Why? What can he do?\"\u003c/p\u003e\n\u003cp\u003eBrenna blew out a sigh. \"Your father needs blood right away.\"\u003c/p\u003e\n\u003cp\u003e\"Frank knows what you are?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eCara glanced at her father, then took a deep breath. \"If he needs blood, he can have mine.\"\u003c/p\u003e\n\u003cp\u003e\"No, Cara.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Because he wouldn\u0027t want you to see this part of our existence.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care. He\u0027s my father and he needs help. I\u0027ve given blood before...\" She laughed humorlessly.\u003c/p\u003e\n\u003cp\u003e\"Recently, in fact.\"\u003c/p\u003e\n\u003cp\u003e\"But not like this.\"\u003c/p\u003e\n\u003cp\u003eCara laid the baby on the love seat by the fireplace then looked at her mother. \"We\u0027re wasting time. Tell me what to do.\"\u003c/p\u003e\n\u003cp\u003eBrenna\u0027s shoulders slumped in defeat. Every moment she wasted arguing was one more moment of suffering for Roshan.\u003c/p\u003e\n\u003cp\u003e\"Come, child,\" she said, \"sit here, beside him.\"\u003c/p\u003e\n\u003cp\u003eNow that she\u0027d gotten her way, Cara began to have doubts, but she thrust them aside. All her life, her father had cared for her, loved her, and protected her as best he could. She wasn\u0027t going to turn her back on him now, when he needed her.\u003c/p\u003e\n\u003cp\u003e\"Are you sure you want to do this?\" Brenna asked. \"It\u0027s going to hurt.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure,\" Cara said, though her voice quivered noticeably.\u003c/p\u003e\n\u003cp\u003eBrenna looked over at Vince. \"I need your help.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got it.\"\u003c/p\u003e\n\u003cp\u003e\"Stand here and hold Cara\u0027s other hand.\"\u003c/p\u003e\n\u003cp\u003eVince did as she asked, effectively blocking Cara\u0027s view of what was about to happen. Taking a deep\u003c/p\u003e\n\u003cp\u003ebreath, Brenna used her thumbnail to make an incision in Cara\u0027s wrist.\u003c/p\u003e\n\u003cp\u003eBlood flowed in the wake of the cut.\u003c/p\u003e\n\u003cp\u003eLifting Cara\u0027s arm, Brenna held it to Roshan\u0027s lips. \"Drink, love,\" she commanded softly.\u003c/p\u003e\n\u003cp\u003eA shudder ran through the vampire\u0027s body as he grasped his daughter\u0027s arm with both hands, his mouth closing over the wound.\u003c/p\u003e\n\u003cp\u003eVince understood why Brenna didn\u0027t offer her husband her own blood. It was a rare thing for one vampire to drink the blood of another, but in this instance, he heartily wished that Brenna had refused Cara\u0027s offer.\u003c/p\u003e\n\u003cp\u003eThe scent of her blood teased his nostrils, tempting him to push Roshan aside and lift her arm to his own lips.\u003c/p\u003e\n\u003cp\u003eCara stared into Vince\u0027s eyes, unable to believe what was happening, wondering if now she, too, would become a vampire. As repulsive as the idea was, it seemed a small price to pay to save her father\u0027s life.\u003c/p\u003e\n\u003cp\u003eAfter what seemed like a very long time but was only a few moments, Brenna drew Cara\u0027s arm away.\u003c/p\u003e\n\u003cp\u003eShe ran her tongue over the wound and it immediately stopped bleeding.\u003c/p\u003e\n\u003cp\u003eVince lifted Cara to her feet and put his arms around her. \"Are you all right?\"\u003c/p\u003e\n\u003cp\u003eCara nodded, her gaze on her father. He looked a little better, she thought, not quite so pale.\u003c/p\u003e\n\u003cp\u003eAnd then, to her surprise, her mother made a gash in her own wrist and held it to her father\u0027s lips. Only for a moment, but the transformation was amazing.\u003c/p\u003e\n\u003cp\u003eThe lines of pain that had been etched deep into his face disappeared as if by magic. The color returned to his cheeks. Even the raw places where the silver had touched his skin didn\u0027t look as red and angry as before.\u003c/p\u003e\n\u003cp\u003eOpening his eyes, Roshan saw Brenna hovering over him. \"Cara?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s here,\" Brenna said, taking his hand in hers.\u003c/p\u003e\n\u003cp\u003e\"Hi, Dad,\" Cara said, moving closer to the bed. \"How do you feel?\"\u003c/p\u003e\n\u003cp\u003eRoshan stared at his daughter, an expression of horror crossing his face. \"Why?\" He looked at Brenna.\u003c/p\u003e\n\u003cp\u003e\"Why did you let her do it?\"\u003c/p\u003e\n\u003cp\u003e\"You needed blood,\" Brenna said, squeezing his hand.\u003c/p\u003e\n\u003cp\u003e\"You should have asked Di Giorgio.\"\u003c/p\u003e\n\u003cp\u003e\"I wanted to,\" Brenna said, \"but Cara insisted.\"\u003c/p\u003e\n\u003cp\u003eRoshan looked at his daughter. He could feel her blood flowing through his veins; he had but to wish it to read her thoughts. \"I never wanted you to see, to know...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" Cara said, forcing a smile.\u003c/p\u003e\n\u003cp\u003e\"No.\" He closed his eyes, as if he could shut it from his mind. \"No, it\u0027s not.\"\u003c/p\u003e\n\u003cp\u003eStill holding Roshan\u0027s hand, Brenna looked at her daughter. \"What happened back there?\"\u003c/p\u003e\n\u003cp\u003e\"Anton\u0027s mother used our blood to raise a man from the dead,\" Cara said. She folded her arms across her chest, as if she had a sudden chill. \"Only something went wrong.\" She shivered, remembering the crazed look in the witch\u0027s eyes. \"Anton ran out of the lab and the thing went after him.\" She shivered again. \"I thought it was coming after me.\"\u003c/p\u003e\n\u003cp\u003e\"What of the witch?\" Roshan asked.\u003c/p\u003e\n\u003cp\u003e\"Serafina\u0027s dead,\" Brenna said without regret.\u003c/p\u003e\n\u003cp\u003e\"If her incantation didn\u0027t raise Anton\u0027s father, what did it raise?\" Cara asked.\u003c/p\u003e\n\u003cp\u003e\"A zombie, I would imagine,\" Brenna replied. \"If it finds Anton...\"\u003c/p\u003e\n\u003cp\u003eThe unfinished sentence hung in the air. There was no telling what would happen to Anton if the creature Serafina had raised found him, Cara thought. The creature hadn\u0027t seemed to believe Serafina\u0027s claim that Anton was his son, or had that enraged \"No!\" been a horrified response to finding himself resurrected in such a ghastly form? Did he even know who he was, or was he simply a shell of a man without a mind, without a soul?\u003c/p\u003e\n\u003cp\u003eCara couldn\u0027t help feeling a twinge of guilt. If she had been a virgin, would Anthony Loken have risen whole and healthy from the grave?\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go downstairs,\" Brenna said. \"Roshan needs to rest.\"\u003c/p\u003e\n\u003cp\u003e\"And I need to take the baby to the police,\" Cara said, lifting the infant into her arms.\u003c/p\u003e\n\u003cp\u003e\"Speaking of the police,\" Vince said, \"shouldn\u0027t we be reporting the fact that Anton kidnapped Cara?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Roshan said, his voice gruff but firm. \"No police.\"\u003c/p\u003e\n\u003cp\u003e\"Why the hell not?\" Vince asked, but even as he spoke the words, he knew the answer. The last thing DeLongpre wanted was a bunch of cops coming around asking questions.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll take care of this ourselves,\" Roshan said.\u003c/p\u003e\n\u003cp\u003e\"What about the baby?\" Cara asked. She stroked the infant\u0027s downy cheek with her finger. \"Poor little thing. We\u0027ve got to get him back to his parents as soon as we can.\"\u003c/p\u003e\n\u003cp\u003eRoshan was silent a moment, then sighed heavily. \"You\u0027re right. Go.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go with her,\" Vince said.\u003c/p\u003e\n\u003cp\u003e\"Take Frank, too,\" Brenna said, following the two of them down the stairs.\u003c/p\u003e\n\u003cp\u003e\"Maybe he should stay here, with you,\" Cara suggested.\u003c/p\u003e\n\u003cp\u003eBrenna shook her head. \"Don\u0027t worry about me. I can take care of things here. Frank...\"\u003c/p\u003e\n\u003cp\u003eShe frowned. \"Where is he?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Cara said, cuddling the baby. \"Maybe he went to his place.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not like him to just take off without telling anyone,\" Brenna said, frowning.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll go by his house,\" Cara said. \"Be sure to lock the door behind us.\"\u003c/p\u003e\n\u003cp\u003eBrenna looked at her daughter and smiled. \"Anyone who comes here tonight will get more trouble than he\u0027s looking for.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-touch-children-of-the-night-2/page-32.html","bookId":2300,"creation":"Oct 5, 2019 6:05:51 PM","modification":"Oct 5, 2019 6:05:51 PM"}
