{"id":94005,"no":42,"title":"Page 42","content":"\u003cp\u003eAnton Bouchard invited the two gray-clad women into his house, bid them make themselves comfortable, and offered them refreshment. He had only recently returned to town, having decided that a lengthy vacation would be good for his health. He had spent the last several months enjoying la dolce vita. During his absence, he had enlisted two of the witches from his mother\u0027s coven to keep an eye the DeLongpre-Cordova families.\u003c/p\u003e\n\u003cp\u003eNow he was back and eager to hear of any developments that had taken place while he was away.\u003c/p\u003e\n\u003cp\u003eEnough time had passed that DeLongpre had probably forgotten him, Anton thought, but he would never forget them-not the vampire who had killed his father so many years ago, and not the people responsible for ruining his mother\u0027s plans so that, instead of raising his father, she had raised a monster.\u003c/p\u003e\n\u003cp\u003eHe listened carefully as Estelle, the older of the two witches, brought him up to date, ending with the news that Cara Cordova was pregnant.\u003c/p\u003e\n\u003cp\u003eAnton stared at her. \"Pregnant!\" That was something he hadn\u0027t counted on. \"Are you sure?\"\u003c/p\u003e\n\u003cp\u003eThe witch delved into one of her voluminous pockets and withdrew Cara\u0027s medical records. \"She\u0027s due any day now.\"\u003c/p\u003e\n\u003cp\u003eAnton read the report, then, muttering a vile oath, he wadded the paper up and threw it across the room.\u003c/p\u003e\n\u003cp\u003eAs much as he wanted revenge, he wasn\u0027t sure he could destroy Cara while she was pregnant. Of course, he could take the baby from her. There were spells that required the blood of an unborn child...\u003c/p\u003e\n\u003cp\u003eHe shook the thought from his mind. He would not go down that path. His parents had both dabbled in Dark Magick, and both had met untimely ends.\u003c/p\u003e\n\u003cp\u003eNot that he was above using a little Dark Magick now and then. In the months he had been away, he had sought out the world\u0027s most knowledgeable wizards. He had practiced his craft until he was certain that he was more powerful than DeLongpre or his witch wife. Now, certain that he was invincible, he had returned to exact vengeance on those who had killed his mother and destroyed his father. He would make no mistakes this time. It no longer mattered if Roshan and the others knew who it was who killed them, or if he saw their faces as they died. It was regrettable that Cara was pregnant, but that was her misfortune, not his. He had only to wait until they were all together and then he would have his revenge.\u003c/p\u003e\n\u003cp\u003eA spell he had learned in Italy, a fire, and all those who had harmed his family would at last meet their doom. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-touch-children-of-the-night-2/page-42.html","bookId":2300,"creation":"Oct 5, 2019 6:05:51 PM","modification":"Oct 5, 2019 6:05:51 PM"}
