{"id":94007,"no":44,"title":"Page 44","content":"\u003cp\u003eVince was on his way back to the hospital when Mara appeared at his side. \"I\u0027ve come to say good-bye,\" she said, slipping her arm through his.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re leaving?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I find this little town extremely boring, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eGrunting softly, Vince thought about the family waiting for him in the hospital and shook his head. \"Not anymore. So, where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure. Italy, perhaps. I haven\u0027t been there in the last thirty or forty years. Why don\u0027t you come with me?\"\u003c/p\u003e\n\u003cp\u003eHe laughed softly. \"Italy sounds mighty tempting, but I\u0027m afraid I can\u0027t leave right now.\"\u003c/p\u003e\n\u003cp\u003e\"Of course, I forgot, you\u0027re tied to that mortal now.\"\u003c/p\u003e\n\u003cp\u003e\"More than you know,\" he said, grinning. \"I\u0027m a father.\"\u003c/p\u003e\n\u003cp\u003eMara came to an abrupt halt, her eyes wide with disbelief as she looked up at him. \"What did you say?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a father.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s impossible.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, that\u0027s what everybody keeps telling me.\"\u003c/p\u003e\n\u003cp\u003e\"Where is it? I want to see it.\"\u003c/p\u003e\n\u003cp\u003e\"Them,\" Vince said. \"Not it.\"\u003c/p\u003e\n\u003cp\u003eShe blinked at him in disbelief. \"Them? As in, more than one?\"\u003c/p\u003e\n\u003cp\u003e\"Yep. I\u0027ve got twin boys. Come on, I\u0027ll prove it to you.\"\u003c/p\u003e\n\u003cp\u003eCara was still sleeping soundly when Vince and Mara entered her room.\u003c/p\u003e\n\u003cp\u003eMara immediately went to where the babies lay sleeping, her expression softening as she gazed at the two infants. \"How can this be?\"\u003c/p\u003e\n\u003cp\u003e\"Beats the hell out of me,\" Vince said. \"Near as I can figure, it was a combination of you being so old in the life and me being so young.\"\u003c/p\u003e\n\u003cp\u003eShe mulled that over a bit and then nodded. \"I suppose that could explain it, but...\" She shook her head.\u003c/p\u003e\n\u003cp\u003e\"No one will believe this.\"\u003c/p\u003e\n\u003cp\u003e\"Since you\u0027re partly responsible, how would you like to be their godmother?\"\u003c/p\u003e\n\u003cp\u003eMara gaped at him. \"Me? A godmother?\" A slow smile spread over her face. \"I\u0027d like that very much.\u003c/p\u003e\n\u003cp\u003eWhat are their names?\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t have any.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003eVince shrugged. \"Cara and I can\u0027t find any that we agree on.\"\u003c/p\u003e\n\u003cp\u003eMara studied the babies for a moment; then, lifting her hand, she placed her finger on the forehead of Vince\u0027s firstborn son. \"This one shall be called Raphael,\" she said. \"And this one,\" she said, touching the other baby\u0027s brow, \"will be Rane.\"\u003c/p\u003e\n\u003cp\u003eVince nodded, wondering how he would explain what had just happened to Cara and how they would change the babies names without hurting Mara\u0027s feelings if Cara didn\u0027t like them.\u003c/p\u003e\n\u003cp\u003eHe was still wondering about that when Mara picked up Raphael. Before he realized what she meant to do, she scored the pad of the baby\u0027s thumb with her fingernail, and licked the single drop of blood that oozed from the tiny cut.\u003c/p\u003e\n\u003cp\u003e\"What the hell do you think you\u0027re doing?\" Vince demanded.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m bonding with my godson,\" she said.\u003c/p\u003e\n\u003cp\u003eVince stared at her, his eyes narrowed.\u003c/p\u003e\n\u003cp\u003e\"This way, I\u0027ll always know where he is,\" she explained, kissing the top of the baby\u0027s head, \"and how he is.\"\u003c/p\u003e\n\u003cp\u003eVince watched as she gently put the baby back in his bed, then picked up Rane. Watching Mara lick his son\u0027s blood, he decided this was something Cara didn\u0027t need to know about.\u003c/p\u003e\n\u003cp\u003eMara smiled as she kissed Rane\u0027s cheek, then put him back to bed. \"I guess I won\u0027t be leaving town after all,\" she said, \"at least not for fifteen or twenty years.\"\u003c/p\u003e\n\u003cp\u003eShe kissed each baby again and then, with a wave of her hand, she was gone.\u003c/p\u003e\n\u003cp\u003eVince stared after her, wondering how he would tell Cara that her children\u0027s godmother was a vampire.\u003c/p\u003e\n\u003cp\u003eAnd then he grinned. Another vampire in the family shouldn\u0027t come as much of a shock. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-touch-children-of-the-night-2/page-44.html","bookId":2300,"creation":"Oct 5, 2019 6:05:51 PM","modification":"Oct 5, 2019 6:05:51 PM"}
