{"id":35949,"no":18,"title":"CHAPTER XVII RECEIVING POINTERS","content":"\u0026nbsp;“Much money in it?” asked several. \n\u003cdiv\u003e\n “All we had, save a few dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Railroad tickets, too?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I have those. At least, I think I have,” said Phil. “They were in my coat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better look and make sure,” advised Mr. Hopkins. “Come, Ted, we’ll go find the conductor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere the boy and his friend had left the car, Phil called:\n\u003c/div\u003e \n\u003cdiv\u003e\n “The tickets are safe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Evidently the thief dropped the coat before he could search it,” commented Mr. Hopkins. “I’m glad of that. How much money did you lose, Ted?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It wasn’t money, sir. We had a letter of credit.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good for you. Then you won’t lose a cent. Just have a little delay, that’s all. I’ll have the conductor notify your bank. In the meantime, if you need any ready money, I shall be glad—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, we have about thirty dollars between us, in other pockets.”\n\u003c/div\u003e \n\u003cdiv\u003e\n While they had been talking, the two had passed through three coaches in quest of the conductor, finally finding him in the fourth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suspect any one?” demanded that official, when he had been apprised of the robbery.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” returned Ted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it’s a hopeless task to locate the thief, I’m afraid,” said the conductor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just write a telegram to the bank and I’ll send it at the next station.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ordering a brakeman to stay in each passenger coach for the remainder of the night, the man in charge of the train went to the scene of the theft and closely questioned all the passengers, but none of them had seen or heard anything until awakened by Phil’s cries.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning, the conductor reported that a passenger was missing from the car ahead of the boys.\n\u003c/div\u003e \n\u003cdiv\u003e\n At the announcement Ted started, then, without a word of explanation, hastened to the forward coach, where he found that his talkative acquaintance was nowhere to be seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n When informed of the facts, the conductor obtained a description of the missing man, which was telegraphed broadcast, and ere evening word was received of the fellow’s arrest, with the letter of credit intact, though he had destroyed Ted’s correspondence.\n\u003c/div\u003e \n\u003cdiv\u003e\n Assured that their “letter” was being forwarded to them on the train following, the boys recovered their former high spirits. The wheat fields had given way to the grazing grounds of Montana, and they beheld with interest the herds of cattle and horses, and cried out in delight at their first sight of real cowboys galloping over the range.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look! Look! Those must be the Rockies!” exclaimed Ted, as he caught a glimpse of a towering mass from his window toward the middle of the afternoon.\n\u003c/div\u003e \n\u003cdiv\u003e\n His words sent the other passengers to their windows, and they gazed with awe and wonder at the massive mountains whose summits sparkled with dazzling brilliance, in marvellous colours reflecting the sun’s rays as they danced on the snow-capped peaks.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now what do you think of your Eastern hills?” smiled Mr. Hopkins, turning toward Ted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are more beautiful because they are entirely wooded. These are too big and brutal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you are right, anyhow you are loyal,” laughed the man. “The Rockies are certainly ‘bad medicine,’ as they say out here, to any one who gets lost on them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This remark evoked many stories of men who had never been seen after entering the mountains, to which the young people listened eagerly until their attention was diverted by a man and woman, both scarcely out of their teens, who boarded the car when a train stopped at a forsaken railroad junction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “B. and G.,” snickered Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s a B. and G.?” asked one of the others.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush, not so loud!” cautioned Ted. “It means bride and groom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At the words the newcomers became the centre of attraction, but they did not seem to mind in the least, for, after they had stowed their luggage and removed their hats and coats, they joined the group in the middle of the car.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just been down to the government’s experiment station at Boscow,” announced the young chap.\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly the young homesteaders were all attention. Before purchasing their tickets in Duluth, they had debated the advisability of visiting one of these farms, but had abandoned the idea because of the increased expense.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Me and my wife ’lowed we’d combine business and pleasure. We just been hitched, so—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lawsy, Jerry, do be quiet!” pouted the bride. “There ain’t no need of telling everybody we are—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, ain’t ashamed, even if you be,” retorted Jerry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “’Tain’t that, and you know it, but everybody has troubles of their own.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As if you was a trouble, Rosey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Fearing that the other young people might not be able to restrain their amusement at this scene much longer, Mr. Hopkins put an end to the danger of offending the bride and groom by asking:\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you find things at Boscow? I’ve always thought I should like to see how they run one of those experimental farms, or stations, as they call them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you’d better save your money. It’s interesting, of course, but it’s all experiment,” replied Jerry. “The whole farm is divided up into sections. In one they grow stuff according to the way it’s always been growed, and in the next they are experimenting with some idee one of the experts has had. Then, ’s like as not, the next section ain’t got nothing planted at all, just going to waste. And the whole kerboodle of ’em is jest ‘loco’ over one idee—‘cultivation.’ If you ask how many times to irrigate a field of wheat, they’ll say ‘depends on how it’s been cultivated.’ It’s ‘cultivate’ all the time. Dryfarming may be all right, but there’s too much ‘cultivating’ and subsoil business about it for me. I’ll bet if you waked any of ’em up and told them there was a tornado coming, they’d ask how often it had been ‘cultivated.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m afraid you were more interested in Rosey than in the farm,” smiled Mr. Hopkins, as the young husband paused in his tirade against the government stations. “Thanks to the experiments conducted by the government, millions of acres that were considered barren are now bearing crops, and it is cultivation that has wrought the change. Where the rainfall is light and the expense of irrigation is high, the lack of water can be overcome to a certain extent by keeping the soil free from weeds and from a sun-baked crust, which cultivation does. In other words, dry-farming where the subsoil is suitable. Yet it is only through numerous experiments that this has been proved. The field that you thought was going to waste was undoubtedly a ‘summer fallow.’ In the semi-arid regions the ground cannot produce crops year after year. When a field which has been cultivated has been left unplanted, it is called a ‘fallow.’ But in order to enable it to regain its vigour, the ground must be kept free from weeds and the crust broken, in other words, cultivated.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why couldn’t they tell me how many times to irrigate a wheat field?” demanded Jerry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because that depends on several things—the kind of soil, the grade of the land, the number of years it has been planted, and its general condition. After all, it is a matter of experience.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then what’s the use of the experiment stations?” persisted the groom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just this. The experts on them plant several fields of, say, wheat and employ a different method with each. A record is kept of each field, and when the wheat is harvested, the yields are compared. The method that has produced the most bushels per acre is then recommended to wheat-growers where the soil conditions are similar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say, I wish the government would put you on the Boscow station, then a fellow could know what they were talking about without toting a dictionary round with him,” commented Jerry. “How can I tell if the subsoil is fit for dry-farming or not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only by examination. They use a bore some six feet long; I suppose you saw one at Boscow. No? Well, it is a great big augur, with a mark at every foot. Samples of the soil are taken at each foot, and these are examined for moisture and composition. As a usual thing, the greatest moisture is found at a depth of from three to four feet, where there is generally a crust-like formation which holds it. This means that the roots of plants and grains must go down three feet for water when the surface ground is dry. Where this moisture reservoir is five or more feet below the level of the field, the subsoil is said to be unadapted to dry-farming.”\n\u003c/div\u003e \n\u003cdiv\u003e\n For a long time the young homesteaders listened while Mr. Hopkins and Jerry discussed various phases of farming and irrigation; then their attention was absorbed in looking at the gorges and canyons disclosed as the train wound in and out in its ascent of the Rockies.\n\u003c/div\u003e \n\u003cdiv\u003e\n At last the station was announced at which the Hopkinses were to leave.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t forget to send that list to your mother,” reminded the kind-hearted woman, as she bade the boys good-bye.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And be sure to let me know how you are getting along and to come to see us, if you ever have the chance,” chimed in her husband. “We make our home with my son Fred, here at Avon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Heartily the boys thanked them for the invitation, their many kindnesses, and the very useful and practical advice.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seems as though we were leaving old friends, doesn’t it, Phil?” observed Ted, as they returned to the car, having assisted Mr. and Mrs. Hopkins to carry out their bundles.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you aren’t going into a funk every time any one gets off,” scoffed his brother. But Jerry prevented any reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who was that old party?” he asked, dropping into the boys’ section.\n\u003c/div\u003e \n\u003cdiv\u003e\n “His name is Silas Hopkins, that’s all I can tell you about him,” returned Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not really?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So he told us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lawsy me! And here I was a-talking to him jest as though he was you or me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jerry’s surprise amused the young homesteaders, and, after laughing at it, Ted asked:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t you? We were fellow passengers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Me talk to Silas Hopkins like I did if I’d knowed who he was? Not on your alfalfa! I wouldn’t have dared open my yip, let alone a-disputing with him. Lawsy me! Rosey, come here!” he suddenly called. “Who do you suppose it was that I was a-arguing with?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How should I know, if you didn’?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was Silas Hopkins!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lawsy!” gasped the bride, rolling her eyes up.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was the boys’ turn to be surprised at the effect of the name upon the two Westerners, and they wondered at it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is Silas Hopkins?” finally asked Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is he? Say, where do you come from?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boston.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you ain’t heered of Si Hopkins?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I guess I ain’t such a gawp, after all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But who is he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The biggest wheat-grower west of the Rockies and a millionaire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A mult-i-millionaire,” corrected Rosey.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2777/76871.html","bookId":1325,"creation":"Aug 5, 2019 6:48:51 AM","modification":"Aug 5, 2019 6:48:51 AM"}
