{"id":35964,"no":33,"title":"CHAPTER XXXIII FIGHTING FOR THEIR HOME","content":"\u0026nbsp;Early the next morning the boys, who had slept in Steve’s cabin while their mother and sisters had used Jennie’s room, were awakened by Andy, who was talking earnestly to Steve. \n\u003cdiv\u003e\n Starting to rise up on his elbow, Phil was pulled back by his brother, who motioned him to lie quiet and listen.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know whether we shall be able to stop it or not,” the agent was saying. “It’s a pity that Mrs. Porter and the girls couldn’t have waited a bit longer. It will be an awful disappointment to them to get out here and then find their claim wiped out. I came back by way of the camp and sent your jacks over to E 1. I told Thomas to put them at work hauling the brush we’ve cleared off back onto the fields at the west. I opened the head gate as I came along. From the way things were going, I don’t believe it will be possible to save Jay’s. He and Joy were packing up what stuff they could and loading it into their old schooner. They’re going to bring them and their livestock over to the boys’ shakedown. If we can’t stop the fire at E 1, it will sweep the country right through to your camp. Be quiet about going out so as not to waken Ted and Phil. I’m afraid they would be so anxious to help that they would get into trouble. They don’t know anything about fighting fire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may think you can keep us from fighting for our home, but you can’t!” declared Ted, leaping from the bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And we’ll show you that we aren’t such duffers, after all,” added his brother. “We’re going with you—and you can’t keep us away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how about your mother and sisters?” queried Steve. “One of you ought to stay here with them and quiet them. If I had my way, you’d both stay. Two men more or less will not make any difference in checking the fire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At the thought of the little woman and the girls, the young homesteaders looked at one another in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m older and I shall go. You must stay. As head of the family, I order you to,” exclaimed Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Like fun!—” began the younger boy, when a timid knock at the door interrupted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Please, Mr. Jackson has sent over here for coffee and food for the fire-fighters and the ladies are taking on something awful,” gasped Jennie from the door which Steve had opened.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The whole kettle is in the fire now,” growled Andy. “Come on, we’ll go over to the store and question Jackson’s man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Phil, this man says our homestead is going to be burned up,” wailed Margie, as she caught sight of her brother in the dim light of the store.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nonsense. You should know better than that, Ivers,” snapped Andy, who, noting at a hurried glance that Mrs. Porter seemed on the verge of collapse, was endeavouring to ease her mind. “If there is one place where we can check the blaze, it is at E 1.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Like—” began the messenger, only to be cut short by Steve.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did you come over for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Coffee and all the food I can carry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then get it and get out. Tell Jackson that my jacks are on E 1. Because of the cleared ground there, that is the place to check the fire. Tell him we are going over there ourselves directly, and ask him to send his force, or all that he can spare, over to us,” instructed Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n In short order Ivers was loaded down with cans of all kinds of food, and quickly he galloped away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry you have learned about the fire, Mrs. Porter,” said the agent, “but it may be just as well, after all. Steve and I are going over. You will be perfectly safe here, and you can rest assured that we shall do everything in our power to save your homestead.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And we’re going too,” announced Ted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we shall all go,” declared the little mother. “I should never have a second’s peace if I should stay here while you are all over there. No, it won’t do me nearly as much harm to go over as it would to force me to remain here. Margie, run and get our things. We will be ready in a few minutes, Mr. Howe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At this decision the agent looked at the foreman.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Reckon it may be the best thing, after all,” murmured Steve. “Anyhow, it will put more heart into the men to know that the family is on the quarter.” And accordingly the men hastened away to harness the blacks, while the others bustled about making ready, and at last, with Ted driving, his mother and sisters seated on piles of blankets and cushions, they set out, Phil, Andy, and Steve having ridden on ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n Pausing at the ridge overlooking their homestead, the boy cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s E 1, Momsy, down where you see all those fields.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In silence the woman and her daughters looked upon the haven, then impulsively threw their arms about one another’s necks. And alternately crying and laughing, they arrived at the shakedown, where they found Joy already busy making a washboiler full of coffee.\n\u003c/div\u003e \n\u003cdiv\u003e\n The pall of smoke could be seen in the west. Under its stress the introductions were short, and quickly the girls were assisting Joy in preparing the drink and food for which men were beginning to come in, some waiting to eat, others carrying back baskets and pails full to those on the fire lines.\n\u003c/div\u003e \n\u003cdiv\u003e\n Assured of their mother’s safety, the boys hastened away to the fire, but they went no farther than the edge of their quarter, where men were busily felling trees so that the branches and tops fell toward the blaze.\n\u003c/div\u003e \n\u003cdiv\u003e\n Seeing Andy, Steve, and another man talking, Phil and Ted rode to them just in time to hear the stranger say:\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was a splendid idea making our stand on this clearing. There’s no doubt about our being able to check the fire here.” And, after being introduced to the district chief, for the stranger was none other than Mr. Jackson, the boys hurried back to carry the gladsome news to their mother and sisters that their home was safe, after all.\n\u003c/div\u003e \n\u003cdiv\u003e\n Not without herculean effort was it, however, that the fire was checked on E 1. As the flames fell upon the tree-tops lying toward them, they leaped into the air, sending forth heat and smoke before which the fire-fighters were compelled to give way. And as they yielded ground, little tongues of flame shot out into the grass, and soon the entire section seemed to be ablaze.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better move the women. The shakedown is doomed,” announced Mr. Jackson to Andy. “We can hold the fire on E 1, all right, but we can’t save the hut.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As cheerfully as he could, the agent delivered his instructions. And to his relief, the women did not go into hysterics.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where do you wish us to go?” asked Mrs. Porter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To the dam. We’ll load everything into the wagon, there is plenty of time, and haul it up there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s too bad the shakedown must go, it’s so cute,” sighed Margie. “And I did so want to sleep on a bed of boughs.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll have chance enough, and without a roof over your head, either,” returned Ted. “We’ll be obliged to sleep outdoors until we build a cabin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Which won’t be very long,” smiled Andy, as he noted the look of horror which settled on Sallie’s face. “I’ll speak to some of the boys and we’ll have a regular, old-fashioned house-raising.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Before either of the girls could ask what such an occasion was like, Andy was summoned, and he waited only long enough to give the boys directions for action in case it should be necessary to resort to heroic measures at the dam, then hurried away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he’s just grand!” exclaimed Sallie, following the lithe form of the agent as he walked away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better chain your children up, Momsy,” chuckled Ted. “If you don’t you’ll lose them out here. I’m just holding Phil by the hair of his head.” And without giving his brother time to reply, he started the horses, while the rest of the little family walked.\n\u003c/div\u003e \n\u003cdiv\u003e\n As they stopped at the dam and looked down upon the burning section, the flames leaped upon the hut.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, dear, there goes our home. I feel just as though we were losing everything, section and all,” wailed Margie, bursting into tears.\n\u003c/div\u003e \n\u003cdiv\u003e\n The words, recalling their anything but satisfactory visit at the Land Office, caused the boys to glance sharply at one another, and neither could find the heart to speak.\n\u003c/div\u003e \n\u003cdiv\u003e\n After the first terrific flash as the grass and brush caught fire, the blaze soon died down, and the fire-fighters were soon able to check the ground-running tongues of flame, even before they reached the area which Andy had flooded.\n\u003c/div\u003e \n\u003cdiv\u003e\n At last, word was brought to the anxious little group that all danger was over, and in ecstasy of thanksgiving they dropped on their knees and prayed.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2777/76886.html","bookId":1325,"creation":"Aug 5, 2019 6:48:51 AM","modification":"Aug 5, 2019 6:48:51 AM"}
