{"id":76912,"no":58,"title":"Page 58","content":"\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Good journey to you, then.\" And with that she tried to leave.\u003c/p\u003e\n\u003cp\u003e\"We aren\u0027t finished yet.\"\u003c/p\u003e\n\u003cp\u003e\"What more do you want from me?\"\u003c/p\u003e\n\u003cp\u003e\"More? I haven\u0027t asked anything of you yet… have I?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e\"Come closer, Bridgid.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine where I am.\"\u003c/p\u003e\n\u003cp\u003e\"Come closer,\" he commanded, and there was a thread of steel in his voice now.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t going to miss his bossiness, she decided as she walked forward. She stopped directly in front of him. \"Is this satisfactory?\"\u003c/p\u003e\n\u003cp\u003e\"Closer,\" he ordered.\u003c/p\u003e\n\u003cp\u003eShe moved to stand between his outstretched legs. \"Is this close enough for you?\"\u003c/p\u003e\n\u003cp\u003e\"For the moment.\"\u003c/p\u003e\n\u003cp\u003eHe was obviously enjoying her discomfort, and she was thoroughly confused. Ramsey seemed to be toying with her, and that didn\u0027t make any sense at all. He couldn\u0027t possibly know what agony it was for her to be so close to him and not touch him. God, how she wished she didn\u0027t love him. It was misery. Just thinking about watching him leave made her want to weep, but she vowed she\u0027d die before he saw one tear.\u003c/p\u003e\n\u003cp\u003e\"Uncle Morgan said you wanted to tell me something. What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Uncle Morgan? When did he become a relative?\"\u003c/p\u003e\n\u003cp\u003eHer chin came up a notch. \"I\u0027ve become very close to him.\"\u003c/p\u003e\n\u003cp\u003eHe rolled his eyes. \"You aren\u0027t staying here. That\u0027s what I wanted to tell you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve made up my mind to stay.\"\u003c/p\u003e\n\u003cp\u003e\"Then unmake it. You\u0027re going home with me.\"\u003c/p\u003e\n\u003cp\u003eBridgid was suddenly so angry with him for being such a stupid, obstinate man, her temper exploded.\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not going back. I\u0027m staying right here. Uncle Morgan said that I could. I like England, Laird. Yes, I do. You and all the other soldiers blatantly lied to me. You made England sound like purgatory, but I found out the truth. The land is as beautiful as ours, and the people are just like us. I\u0027ll admit they\u0027re a little difficult to understand because of the way they speak, but I\u0027m getting used to it. Do you know how many Englishmen helped Gillian and me on our journey here? Hundreds,\" she exaggerated. \"Families who could ill-afford to share insisted that we take their food and their blankets. They even offered us their beds. They looked out for us, and we were strangers to them. All those stories were just lies. I like this country, and I like Gillian\u0027s uncle. He\u0027s kind and sweet.\"\u003c/p\u003e\n\u003cp\u003eThe last of her tirade made him laugh. \"You think Morgan\u0027s kind and sweet?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she insisted. \"And he likes me too.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027re a Sinclair.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing for me there.\"\u003c/p\u003e\n\u003cp\u003e\"What about the man you told me you loved?\"\u003c/p\u003e\n\u003cp\u003eShe took a step back, but Ramsey grabbed her and pulled her close to him. She tried to look everywhere but at him so she could concentrate.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t love him anymore,\" she declared.\u003c/p\u003e\n\u003cp\u003e\"What the hell do you mean you don\u0027t love him anymore? Are your feelings so shallow, then, Bridgid?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she answered. \"I loved him for the longest time, since I was a little girl, but now I realize he\u0027s completely unsuitable.\"\u003c/p\u003e\n\u003cp\u003eRamsey didn\u0027t like hearing that. \"What exactly is unsuitable about him?\"\u003c/p\u003e\n\u003cp\u003e\"Everything,\" she cried out. \"He\u0027s obstinate and arrogant and very stupid. Yes, he is. He\u0027s a womanizer too, and the man I marry will be faithful to me. I\u0027m not going to waste my time on him any longer. Besides, he can have any woman he wants. They throw themselves at his feet,\" she added with a nod. \"And he\u0027s completely unaware of me.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, Bridgid, he\u0027s very aware of you.\"\u003c/p\u003e\n\u003cp\u003e\"The man doesn\u0027t even care that I exist.\"\u003c/p\u003e\n\u003cp\u003eRamsey smiled. \"Of course he cares.\"\u003c/p\u003e\n\u003cp\u003eShe pushed his hands away, but Ramsey caught her about her waist and began to slowly pull her up against him.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"What I\u0027ve wanted to do for a long time.\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t move, couldn\u0027t think. She was lost in his dark eyes, and as he slowly lowered his head toward hers, she whispered, \"Are you going to throttle me, then?\"\u003c/p\u003e\n\u003cp\u003eHe was laughing when he kissed her. Lord, she had the softest, sweetest lips, and he felt such incredible joy and peace holding her in his arms. His mouth opened over hers, taking absolute possession. His tongue swept inside to lazily mate with hers, and he was taking his time savoring her taste, believing he was in full control, until she began to kiss him back.\u003c/p\u003e\n\u003cp\u003eShe shook him to the core. Ramsey had never experienced anything like it. His arrogance and his control vanished, and he was shaking with desire. It happened so swiftly, he had trouble catching his breath. His mouth slanted over hers again and again and passion ignited. He couldn\u0027t get close enough to her to satisfy him.\u003c/p\u003e\n\u003cp\u003eWhen he realized he was trying to justify tossing her on the table and making love to her then and there, he forced himself to stop. They were both panting for breath when he lifted his head.\u003c/p\u003e\n\u003cp\u003eShe was having as much trouble regaining her senses as he was. She actually swayed when she took a step back. \"Why did you kiss me?\"\u003c/p\u003e\n\u003cp\u003e\"I wanted to,\" he answered, his voice as smooth as velvet.\u003c/p\u003e\n\u003cp\u003e\"Were you… Was it… a farewell kiss? Were you saying good-bye?\"\u003c/p\u003e\n\u003cp\u003eHe laughed. \"No,\" he answered. \"You\u0027re going home with me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m staying here. I\u0027m going to marry an Englishman.\"\u003c/p\u003e\n\u003cp\u003e\"The hell you are,\" he roared, and he was more stunned than she was by his burst of temper. No woman had ever been able to get that kind of reaction from him, but the thought of his Bridgid with any other man enraged him.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a Sinclair, and you belong with us.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you want me to go back?\"\u003c/p\u003e\n\u003cp\u003eFor the first time in his life, Ramsey felt thoroughly vulnerable. It was a hell of a miserable feeling. \"You want the truth, Bridgid?\" he stalled.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eTheir gazes held while Ramsey got up the courage to tell her what was in his heart.\u003c/p\u003e\n\u003cp\u003e\"You make the Sinclair land a joyful place. I cannot imagine life without you.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"No, you just want to marry me to some—\"\u003c/p\u003e\n\u003cp\u003eHe stood up and took a step toward her. \"There has been a request for your hand in marriage.\"\u003c/p\u003e\n\u003cp\u003e\"Is that why you kissed me? So you could take me home and then marry me to a man I don\u0027t love? Who is he?\" she demanded, emotionally spent now and uncaring that tears were streaming down her face.\u003c/p\u003e\n\u003cp\u003eHe started toward her.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you dare kiss me again,\" she ordered. \"I can\u0027t think when you… Just don\u0027t,\" she stammered. \"And as for the offer, I decline.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t decline until you know who he is,\" he reasoned.\u003c/p\u003e\n\u003cp\u003e\"All right. Tell me his name, and then I\u0027ll decline. You\u0027re going to praise him first though, aren\u0027t you? That\u0027s what you always do to try to get me to agree,\" she ended, and even she could hear the heartbreak in her voice.\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not going to praise him. He\u0027s riddled with flaws.\"\u003c/p\u003e\n\u003cp\u003eShe stopped trying to run away. \"He is?\"\u003c/p\u003e\n\u003cp\u003eHe slowly nodded. \"I have it on good authority that he\u0027s stupid and arrogant and obstinate, or at least he was until he realized what a fool he has been.\"\u003c/p\u003e\n\u003cp\u003e\"But that\u0027s what I said about… you.\"\u003c/p\u003e\n\u003cp\u003e\"I love you, Bridgid. Will you marry me?\"\u003c/p\u003e\n\u003cp\u003eBrodick didn\u0027t know what the hell he was going to do. He felt as though his hands were tied behind his back because Morgan was his elder and he therefore couldn\u0027t browbeat him into ordering Gillian to go home with her husband, and he sure as certain couldn\u0027t tear the man\u0027s home apart searching for her. At the root of his frustration lurked the dark possibility that Gillian would never forgive him for breaking his word to her, but life without her at his side would be unbearable.\u003c/p\u003e\n\u003cp\u003eRamsey might have been able to help him sway the baron—he was the diplomat, after all—but he was too busy wooing Bridgid to think about anything else. It had taken him a good hour to convince her he was sincere and determined to marry her, and after she had finally agreed to his proposal, they\u0027d left for home. Iain hadn\u0027t stayed around to help either, as he was anxious to get back to his wife.\u003c/p\u003e\n\u003cp\u003eAnd that left Brodick to deal with the bad-tempered baron on his own,\u003c/p\u003e\n\u003cp\u003eMorgan was vastly amused when Brodick didn\u0027t eat any of his supper. Just as he finally made up his mind to help the poor, lovesick man, Morgan spotted Gillian coming down the stairs.\u003c/p\u003e\n\u003cp\u003eBrodick\u0027s back was to the entrance, and Morgan knew he hadn\u0027t spotted his wife.\u003c/p\u003e\n\u003cp\u003e\"Son, you had to have known how stubborn Gillian was before you married her. Anyone who spends more than five minutes with the woman figures that out.\"\u003c/p\u003e\n\u003cp\u003e\"I knew she was stubborn,\" Brodick agreed. \"But I don\u0027t consider that a flaw.\"\u003c/p\u003e\n\u003cp\u003e\"I think you should leave her here and go on home. You\u0027ll be better off.\"\u003c/p\u003e\n\u003cp\u003eBrodick was shocked by the obscene suggestion. \"I don\u0027t have a home without her,\" he muttered. \"How could you think I would leave her?\"\u003c/p\u003e\n\u003cp\u003e\"I would,\" Morgan replied cheerfully. \"Tell me, why did you break your word to her?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve already explained why,\" he snapped.\u003c/p\u003e\n\u003cp\u003eMorgan snapped back. \"Explain it again.\"\u003c/p\u003e\n\u003cp\u003e\"Because the thought of her in danger was unacceptable to me. I cannot lose her.\"\u003c/p\u003e\n\u003cp\u003e\"Then don\u0027t ever lie to me again.\"\u003c/p\u003e\n\u003cp\u003eThe sound of her voice made his heart feel as though it were about to burst with joy. He sighed, calm now, for his world suddenly made sense to him again. And then he turned around. \"Don\u0027t you ever put me through this torment again,\" he ordered.\u003c/p\u003e\n\u003cp\u003e\"Promise me that you will never lie to me again.\"\u003c/p\u003e\n\u003cp\u003e\"Not until you promise me that you\u0027ll stop taking such foolish risks. When Proster told me you were inside with that bastard, I thought I was going to… damn it, you scared the hell out of me, Gillian, and I never want to go through that again.\"\u003c/p\u003e\n\u003cp\u003e\"You hurt me.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all you have to say? You know you hurt me? Then I\u0027m staying here. Go home, Brodick.\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" he answered. Bowing to Baron Morgan, he walked out of the hall. She waited until the doors had closed behind him and then burst into tears.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s leaving me,\" she cried as she ran to her uncle.\u003c/p\u003e\n\u003cp\u003e\"You just told him to leave,\" he pointed out.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s going home without me.\"\u003c/p\u003e\n\u003cp\u003e\"But you just told him to,\" he argued. \"I heard you plain and clear.\"\u003c/p\u003e\n\u003cp\u003e\"But he never does what I tell him to do. Uncle, how am I going to live without him?\"\u003c/p\u003e\n\u003cp\u003eHe awkwardly patted her back, trying to console her. \"You\u0027ll do just fine.\"\u003c/p\u003e\n\u003cp\u003e\"I love him so much.\"\u003c/p\u003e\n\u003cp\u003e\"But he lied to you, remember?\"\u003c/p\u003e\n\u003cp\u003e\"He was only trying to be noble. He wanted to protect me.\"\u003c/p\u003e\n\u003cp\u003e\"Then why didn\u0027t you forgive him?\"\u003c/p\u003e\n\u003cp\u003e\"I was going to forgive him,\" she sobbed. \"I don\u0027t want to live without him. How could he leave me?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re giving me a pounding headache, lass. Sit down and calm yourself,\" he suggested as he pulled a chair out and gently pushed her down. \"Let me go look out the window and see if he\u0027s left yet.\"\u003c/p\u003e\n\u003cp\u003e\"I cannot believe he would leave me,\" she whispered.\u003c/p\u003e\n\u003cp\u003eMorgan rolled his eyes heavenward and prayed for patience. Was his niece blind? Couldn\u0027t she see how much her husband loved her? He was too old and cranky to deal with a near hysterical woman, and he decided then that matters of the heart should be left to the young. They had more stamina.\u003c/p\u003e\n\u003cp\u003eHe watched Brodick remove the saddle from his horse and toss it to one of his men. All of his soldiers had dismounted and were making themselves at home in his yard. When Brodick started back to the castle, Morgan decided to go upstairs. He\u0027d had enough excitement for one day, and Gillian and her husband needed privacy.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right back,\" he lied. \"You stay where you are and wait for me,\" he hastily added so she wouldn\u0027t get the notion she could follow him the way she used to and drive him daft with her complaints until he gave in to whatever it was she wanted. He smiled when he realized she was more stubborn and strong-willed than he was.\u003c/p\u003e\n\u003cp\u003ePausing at the entrance, he called out, \"You know I love you, girl, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I know. I love you too, Uncle Morgan.\"\u003c/p\u003e\n\u003cp\u003eHe started up the stairs then, but stopped when he heard the door open behind him. He didn\u0027t have to turn around to know who was there.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll treat her well.\" It wasn\u0027t a question but a statement of fact.\u003c/p\u003e\n\u003cp\u003e\"Yes, sir, I will.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t deserve her.\"\u003c/p\u003e\n\u003cp\u003e\"I know I don\u0027t, but I\u0027m keeping her anyway.\"\u003c/p\u003e\n\u003cp\u003e\"You know, son, you remind me of someone, but I can\u0027t think who it is.\" He shook his head in bewilderment and then suggested, \"You\u0027d best get on inside before she floods my hall with her tears. If anyone could do it, she could.\"\u003c/p\u003e\n\u003cp\u003eAt the sound of her uncle\u0027s laughter, she glanced up and saw Brodick standing in the entrance, watching her. She stood up then and took a step toward him.\u003c/p\u003e\n\u003cp\u003e\"You came back.\"\u003c/p\u003e\n\u003cp\u003e\"I never left.\"\u003c/p\u003e\n\u003cp\u003eAs though drawn by a magnet, they moved toward one another.\u003c/p\u003e\n\u003cp\u003e\"You were angry with me. I saw it in your eyes.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I was angry. I didn\u0027t know if I could keep you safe, and that scared the hell out of me.\"\u003c/p\u003e\n\u003cp\u003eHe was close enough to take her into his arms, but he didn\u0027t dare touch her yet because he knew that once he started kissing her, he wouldn\u0027t stop, and he needed to mend the hurt he had caused her. Telling her what was in his heart seemed so easy to him now, and he couldn\u0027t understand why he\u0027d been such a fool. Love didn\u0027t weaken a man; it strengthened him, made him feel invincible when he had a woman like Gillian at his side.\u003c/p\u003e\n\u003cp\u003e\"I thought you went home.\"\u003c/p\u003e\n\u003cp\u003e\"How could I go home without you? I\u0027ve searched my entire life for you. I could never leave you. Home is wherever you are.\" His hand shook as he gently caressed the side of her face. \"Don\u0027t you understand? I love you, and I want to wake up with you beside me every morning for the rest of my life. If that means I have to live in England to be with you, then that\u0027s what I\u0027ll do.\"\u003c/p\u003e\n\u003cp\u003eTears of joy brimmed in her eyes. She was overwhelmed by the depth of his feelings for her and the tender, romantic way he\u0027d told her how he felt.\u003c/p\u003e\n\u003cp\u003eShe knew it was difficult for him. He hid his feelings behind his gruff exterior. She realized then she knew him better than he knew himself. It didn\u0027t matter that he\u0027d broken out in a cold sweat or that he looked quite ill now; he\u0027d given her what she needed. Aye, he\u0027d said the words, and he couldn\u0027t take them back. \u003c/p\u003e","sourceLink":"https://allnovel.net/ransom-highlands-lairds-2/page-58.html","bookId":1843,"creation":"Oct 5, 2019 3:33:36 PM","modification":"Oct 5, 2019 3:33:36 PM"}
