{"id":28360,"no":14,"title":"CHAPTER XIII MR. BANKS, THE SUPERINTENDENT","content":"\u0026nbsp;After his interview with Squire Leech, Herbert walked home slowly and thoughtfully. He comprehended now all the danger of the situation. The squire wanted their house, and was mean enough to desire to get it at less than its value, though two or three hundred dollars would have been of little account to him, while to the poor widow whom he wished to defraud it was a great sum. \n\u003cdiv\u003e\n “How can a rich man be so mean?” exclaimed Herbert, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n That question has puzzled more than our hero. Is there something in riches that dwarfs the man, and makes him mean and ignoble? In too many instances such appears to be the effect.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, mother,” said Herbert, when he returned to the cottage, “I\u0027ve been to see Squire Leech.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What success did you meet with?” asked his mother, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will probably give me employment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You see, Herbert, you misjudged him, after all,” said the widow, her face brightening.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait and see if I did. There is a condition attached.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That you will sell him the cottage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he mention that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he offered three hundred dollars over and above the mortgage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, he offered more than that last year.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reminded him of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did he say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He said he would have given three hundred and fifty if we hadn\u0027t been so unreasonable as to refuse then. Now, as you have been sick, he expects he can get the place on his own terms.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t think Squire Leech would be so ungenerous.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He hinted, besides, that when the next interest is due, he would foreclose, if the money were not ready.” “It won\u0027t be ready, I am afraid, Herbert,” said his mother, depressed. “What shall we do? I am afraid we shall be forced to sell the place, though it would be hard to leave it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s a month before the interest comes due, mother,” said Herbert, with energy. “Something may turn up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But his mother was not so hopeful as he.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What can turn up?” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may get employment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Even if you do, a boy can earn little in the country.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true, mother, but somehow I feel hopeful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is because you are young, Herbert. It is natural for youth to be hopeful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, mother, isn\u0027t it better to be hopeful than despondent?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But it won\u0027t alter wants.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose the worst to happen—suppose we do leave the house—we shall have three hundred or three hundred and fifty dollars in cash, to keep us from starving.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when that is gone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Before that is gone, I shall be earning good wages somewhere. You see, mother, matters are not as bad as they might be, after all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In spite of her doubts, Mrs. Carter was cheered by her son\u0027s hopeful tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you are right,” she said. “Since God orders all things, we ought not to be discouraged.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now you are sensible, mother. How much money have you got left?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twenty-five dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, that\u0027s enough to pay the interest, and a little over.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how are we to live for the next month?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ought to earn money enough for that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If there were any chance of finding work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I will go out again to-morrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert spoke with a confidence which he did not feel. Wrayburn was not a large village, and, in general, boys were to be found in families where a boy\u0027s work was required. In fact, the only one who seemed likely to have work for a boy was Mr. Banks, the squire\u0027s farm superintendent. His son, Tom, might indeed have worked, had he been inclined; but he was naturally indolent, and his father was too indulgent to compel him to work. He was an only child, and bade fair to be spoiled. Though only fifteen, he had already learned to smoke and drink, and the only limit to either was his scanty pocket money.\n\u003c/div\u003e \n\u003cdiv\u003e\n As Herbert was walking up the street in perplexity, he fell in with Tom, who was smoking a cheap cigar with the air of an old smoker.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you bound, Herbert?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nowhere in particular. I wish I knew where to go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come fishing with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven\u0027t time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You said you were not going anywhere in particular.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I don\u0027t know where to go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, why not go with me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want to find work somewhere.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s just what I am not anxious to find,” he said. “My father keeps thinking every day that I ought to be at work, but I don\u0027t see it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom winked here, and looked, or thought he looked, uncommonly sly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, your father has work for a boy to do,” said Herbert, getting interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, it is spring now, and the busy season is beginning. But that sort of work don\u0027t suit me. I will never be a farmer. When I get a little older, I should like to go to the city, and enter a store. That would be jolly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You might get tired of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I wouldn\u0027t; I\u0027m sick of this stupid old town, though. There\u0027s nothing going on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, Tom, as you don\u0027t want to work, do you think your father would give me a chance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know,” said Tom. “I\u0027ll speak to him if you want me to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish you would.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027ll be one advantage about it. If he hires you, he won\u0027t be at me to work all the time. I\u0027ll do it. Come along, and I\u0027ll speak to him now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you needn\u0027t thank me. It\u0027s for my own sake I\u0027m doing it as much as yours,” said Tom, who was at least frank in his selfishness.\n\u003c/div\u003e \n\u003cdiv\u003e\n They went to the small house occupied, much against his will, by Amos Banks. He was in the field, with one of his men, when Tom and Herbert came up, and, jumping over the stone wall, approached him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Tom,” said his father, “you have come just in time. I want you to ride the horse to plow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t, father; I don\u0027t feel well to-day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s the matter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I\u0027ve got a headache.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Riding will do you good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, it won\u0027t,” said Tom, confidently; “but if you want a boy to help you, here he is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Banks turned to Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are Herbert Carter,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. I would like very much to get a chance to work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re the widow Carter\u0027s son?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has your mother decided to sell her cottage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t think she has, Mr. Banks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course you know that Squire Leech wants to buy it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. He told me that he wanted to purchase it for your use.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so,” said the superintendent, stopping work: “I\u0027ve taken a fancy to that house, and so has Mrs. Banks You had better accept the squire\u0027s offer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That would be too much of a sacrifice, Mr. Banks The squire wants to get the place considerably below its value.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very likely you overvalue it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mother is attached to it. She would rather have it than a nicer house. Father built it, and it was here they lived for nearly fifteen years.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No doubt—no doubt,” said Banks, impatiently; “but poor folks can\u0027t afford to be sentimental. If it\u0027s for your mother\u0027s interest to sell, then she\u0027d ought to sell, that\u0027s my opinion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We may have to sell some time, but as long as we can hold on to the place, we mean to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may as well say,” said the superintendent, “that the squire has authorized me to hire you to work, in case your mother consents to sell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that the condition?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” said Herbert, turning away, “I am afraid I must give up the chance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s an obstinate boy,” said Banks, looking after him; “but he\u0027ll come around after a while. The squire says he\u0027ll have to, or be turned out for not paying the interest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2977/82053.html","bookId":346,"creation":"Aug 5, 2019 12:05:13 AM","modification":"Aug 11, 2019 1:35:24 PM"}
