{"id":28361,"no":15,"title":"CHAPTER XIV HERBERT\u0027S NEW UNDERTAKING","content":"\u0026nbsp;To be willing to work, and yet to be unable to find an opportunity, was certainly a hardship. Herbert was a boy of active temperament, and, even had he not needed the wages of labor, he would still have felt it necessary to his happiness to do something. \n\u003cdiv\u003e\n In the course of his walks about the village, he stopped at the house of a carpenter, who bore the rather peculiar name of Jeremiah Crane. Mr. Crane owned about an acre and a half of land, which might have been cultivated, but at the time Herbert called, early in April, there were no indications of this intention. The carpenter was at work in a small shop just beyond the house, and there Herbert found him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Herbert,” said Mr. Crane, in a friendly manner, “what are you up to nowadays?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing profitable, Mr. Crane; I am wandering about in search of work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can\u0027t you find any?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you been to Squire Leech?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should think he might find something for you to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is a little difficulty in the way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Herbert told Mr. Crane about the squire\u0027s wish to purchase their cottage, and his vexation because they were not willing to sell.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seems to me that\u0027s unreasonable in the squire. He acts as if it was your duty to oblige him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know but we shall have to come to his terms,” said Herbert, rather dejectedly. “We certainly shall if I don\u0027t find anything to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I could help you; but, if you were to learn my trade, you wouldn\u0027t be worth any wages for nigh a year, and you couldn\u0027t afford to work so long without pay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I couldn\u0027t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Besides, in a village like this, there isn\u0027t more than enough work for one man. Why, there isn\u0027t more than one new house built a year. If the squire wants to provide Mr. Banks with a house, why doesn\u0027t he build him one? He might just as well as not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would cost him more than to buy our place at the price he offers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So it would. Your place must have cost fifteen hundred dollars, land and all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I did, but the squire laughed at the idea. All he offers is eleven hundred.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t you sell at that price. It would be too much of a sacrifice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We won\u0027t unless we are obliged to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you won\u0027t be obliged to. A man as rich as Squire Leech ought not to try to get it under price.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose he wants to make a good bargain, no matter if it is at our expense. I wish you had a farm, Mr. Crane, so you could give me work on it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve got more farm now than I can take care of.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t you have a garden?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve got the land, but no time to work on it. My wife often wishes we had our own vegetables, instead of having to buy, but you see, after working in the shop, or outside, all day, I\u0027m too tired to work on land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much land have you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About an acre that I could cultivate, I suppose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Engage me to take care of it. I\u0027ll do all the work, and your wife can have her own vegetables.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really, I never thought of that,” said the carpenter. “I don\u0027t know but it might be a good idea. How much pay would you want?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll tell you,” said Herbert, who had a business turn, and who had already matured the plan in his own mind. “If you will pay for plowing, and provide seed, I will do the planting, and gather it when harvest time comes, for one-third of the crop.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean, you will take your pay in vegetables?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Herbert, promptly. “If there is more than you need, I can sell the surplus. What do you say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It strikes me as a fair offer, Herbert. Just wait a minute, and I\u0027ll go and ask my wife what she thinks of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Crane went into the house, leaving Herbert in the shop. He reappeared in five minutes. Herbert, to whom the plan seemed every minute more desirable, awaited his report eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My wife is all for your plan,” he said. “She says it is the only way she knows of likely to give her the fresh vegetables she wants. Besides, she thinks well of you. So, it\u0027s a settled thing, if you say so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do say so,” Herbert replied, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, when will you have it plowed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall leave all that to you. I haven\u0027t time to make arrangements. You can engage anybody you like to do the plowing, and I will pay the bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, as to the seed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There, again, I trust all to you. You can buy what you find to be necessary, and the bill may be sent to me. You may ask Mrs. Crane what vegetables she wants.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Please understand,” said the carpenter, “that I will do what I have said, but I don\u0027t want to be worried about the details. You are a boy, but I shall trust to your judgment, as you are interested in the result.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Herbert, rather proud of the confidence reposed in him. “I will do what I can to justify your confidence. I\u0027ll go right off and see about the plowing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatever Herbert did was done promptly. He knew of a man named Kimball, a farmer on a small scale, who was accustomed to do work for neighbors, not having enough work of his own to occupy his whole time. He went to see him at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Kimball,” he said, “I want to know if I can engage you to do some plowing for me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “For you!” repeated the farmer, opening his eyes. “Why, you haven\u0027t taken a farm, have you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not yet,” said Herbert, smiling; “but I\u0027ve agreed to cultivate a little land on shares.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sho! you don\u0027t say so! What land is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s the field behind Mr. Crane\u0027s house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So he\u0027s engaged you, has he? Well, I\u0027ve often wondered why he didn\u0027t cultivate it. Might as well as not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s my idea. I proposed it to him. Now, when can you come?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait a minute,” said the farmer, cautiously; “who\u0027s a-going to pay me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Crane. He told me to engage somebody, and he would pay the bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s all right, then,” said the farmer, in a tone of satisfaction; “Crane\u0027s a man that always pays his bills.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope I shall have the same reputation,” said Herbert. “I hope you will, but you\u0027re only a boy, you know, and I couldn\u0027t collect of a minor. That\u0027s the law.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shouldn\u0027t think anybody\u0027d be dishonest enough to bring that as an excuse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Plenty would do it, so I have to be careful What time do you want me to do the work for you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As soon as you can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me see, I guess I can come to-morrow. There ain\u0027t anything very pressing for me to do then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s good,” said Herbert, with satisfaction. “You\u0027ll find me there, and I can ride the horse to plow if you want me to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to have you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” thought Herbert, as he started for home to tell his mother what he had done, “I\u0027ve made a beginning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you haven\u0027t found any work yet, Herbert,” said his mother, in a tone of resignation, as he entered the little cottage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I have; though I shall have to wait some time for the pay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, Herbert?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m going to cultivate a garden on shares, mother; so next fall and winter you can have all the vegetables you want.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How is that, Herbert? Tell me all about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When Herbert had detailed the contract he had entered into, he was glad to find that his mother approved of it. She declared that it would be very satisfactory to her to have an abundant stock of vegetables, but she said, doubtfully: “Do you think you know enough of farming to attend to all the work?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I don\u0027t I can easily ask some farmer,” said Herbert, confidently. “I am not in the least afraid to undertake the job.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He went to bed that night feeling that at last he had obtained something to do.\n\u003c/div\u003e \n\u003cdiv\u003e\n The reader will perhaps recall the statement in our first chapter that there was a little land connected with the cottage, which was used for the growth of vegetables. This, in fact, supplied nearly all that was required by the widow and her son, and the probability was that Herbert would be able to send to market nearly all his share of vegetables obtained under his new contract, and thus obtain payment in money, of which they were so much in need.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2977/82054.html","bookId":346,"creation":"Aug 5, 2019 12:05:13 AM","modification":"Aug 11, 2019 1:35:26 PM"}
