{"id":28363,"no":17,"title":"CHAPTER XVI AN UNEXPECTED OFFER","content":"\u0026nbsp;It was with very little confidence in his ultimate success that Herbert set out on his borrowing expedition. The number of those who could be called capitalists in a small village like Wrayburn was very small, and it happened very remarkably that all of them were short of funds. One man had just bought a yoke of oxen, and so spent all his available cash; another had been shingling his barn; and still another confessed to having money, but it was in the savings bank, and he didn\u0027t like to disturb it. \n\u003cdiv\u003e\n So, at supper time, Herbert came in, depressed and dispirited.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, mother, it\u0027s no use,” he said, as her anxious look met his.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t much think you could borrow the money,” she answered, trying to look cheerful.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s only one thing remains to be done,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To try to induce the squire to give us more time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t think he will do that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor I. In that case we must come to his terms; but it\u0027s a pity to sacrifice the property, mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Herbert; I shall be sorry to leave the old place,” she sighed. “You were born here, and your father was always very much attached to it. But poor folks can\u0027t have everything they wish, and it might be worse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it might be worse, and if the squire was not so bent in getting the place into his hands, it might be better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose we ought not to blame him for looking out for his own interest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, we ought; when it seems that he is ready to injure his poorer neighbors.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Carter did not reply. She did not wish further to incense her son against the squire, yet in her heart she could not help agreeing with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day Herbert did not go to work as usual. He did not feel like it, while matters were in such uncertainty. He knew the squire would be at the cottage a little before twelve o\u0027clock, and he wanted to be with his mother at that time, for he felt that, if the place must be sold, he would be more likely to get good terms for it than his mother, who was of an easy and yielding disposition.\n\u003c/div\u003e \n\u003cdiv\u003e\n He took a little walk in the course of the forenoon, not with any particular object in view, but in order to pass the time. As he was passing the hotel—for there was a small hotel in the village—he heard his name called. Turning round, he found that it was the landlord who had called him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come here a minute, Herbert,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert obeyed the summons.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you doing nowadays?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have turned farmer,” said our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whom are you working for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “For myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How is that? I don\u0027t understand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am cultivating Mr. Crane\u0027s land on shares.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does it take up all jour time?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I would only work part of the day if I had anything else to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll tell you what I have been thinking of. There\u0027s a young man boarding with me from the city, a Mr. Cameron. He was a college student, but his eyes gave out, and the doctor sent him out of the city to get well. He wants some one to read to him part of the time, and go about with him for company. He is from a rich family—the son of a wealthy manufacturer—and he will be willing to pay a fair price.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think I would suit him?” asked Herbert, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I think you would. You are a good scholar, and when I mentioned you to him, he said he would like to see you. He said he would prefer a boy, as he would be more ready to adapt himself to his wishes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When can I see Mr. Cameron?” asked our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come in now. You will find him in his room. Here, John, show Herbert up to number six.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert was ushered into one of the best rooms the hotel afforded. A young man, of pleasant appearance, was sitting at the window, with a green shade over his eyes. He pushed up this, that he might see Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is Herbert Carter, Mr. Cameron,” said John, unceremoniously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to see you, Herbert,” said the young man, smiling as he extended his hand. He was secretly pleased with Herbert\u0027s open and manly face. “Did the landlord say why I might need your assistance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He said your eyes were affected.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, they broke down a month since. I am a student of Yale College, in the junior class. I suppose I tasked my eyes too severely. At any rate, they gave out, and I am forbidden to use them at all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That must be a great loss to you,” said Herbert, with sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is. I am very fond of reading and study, and the time passes very heavily in the absence of my usual employment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know what I should do if I could not use my eyes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You would find it a great hardship. Now I must tell you why I came here. The doctor told me I should be better off in the country than in the city. He said that the sight of the green grass would be good for me, and the fresh air, in improving my general health, would help my eyes also. I hadn\u0027t much choice as to a place, but some one mentioned Wrayburn, and so I came here. But I soon found that, unless I got some pleasant company and some one who could read to me, I should die of weariness. That brings me to my object in asking you to call upon me. How is your time occupied?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have taken an acre of land to cultivate on shares,” answered Herbert. “It was because I could find nothing else to do, and must do something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does that keep you pretty busy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is planting time now, but I could get along with working there half a day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And could you place yourself at my disposal the other half?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should be glad to do it,” answered Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose, then, that you work in the field in the forenoon, and give me every afternoon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said Herbert, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now comes another question. What pay would you expect for giving me so much of your time?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shouldn\u0027t know what to charge, Mr. Cameron. I leave that matter entirely with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you be satisfied with five dollars a week?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Five dollars a week! Herbert could hardly believe his ears. Why, he would have been well paid if this had been given him for the whole of his time, but for half it seemed munificent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid I can\u0027t earn that much,” he answered. “I would be willing to take less.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t know how hard I shall make you work,” said the young man, smiling. “I insist upon paying you five dollars a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t seriously object,” said Herbert, smiling; “but if you think, after the first week, that it is too much, you can pay me less.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see that we are not likely to quarrel on the subject of salary then. When can you begin?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This afternoon, if you wish.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do wish it, otherwise the afternoon would pass very slowly to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, I will be here at one o\u0027clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Half past one will do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will be on hand. Till then I will bid you good morning, as I shall be wanted at home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, Herbert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert left the room and hurried home, for it was nearly twelve. On the way he stopped at the post office, and found a letter addressed to his mother. He did not recognize the handwriting, nor, such was his hurry, did he notice where it was postmarked. He had no watch, but thought it must be close upon twelve o\u0027clock. So he thrust the letter into his pocket, and continued his way homeward on a half run. He was in time, for, just as he reached the front gate from one direction, the squire reached it from the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good morning,” said the squire, a little stiffly. “Is your mother at home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I presume she is. Won\u0027t you come in?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder if they\u0027ve got the money ready,” thought the squire, as he followed Herbert into the modest sitting room.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2977/82056.html","bookId":346,"creation":"Aug 5, 2019 12:05:13 AM","modification":"Aug 11, 2019 1:35:29 PM"}
