{"id":28368,"no":22,"title":"CHAPTER XXI ROWING","content":"\u0026nbsp;The little boat touched its moorings. \n\u003cdiv\u003e\n “Mr. Cameron,” said Herbert, “allow me to introduce to you the owner of the boat, Mr. James Leech.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Leech,” said Cameron, “I have to apologize for taking your boat without leave. I hope I haven\u0027t kept you waiting for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n If the young collegian had not been the son of a wealthy man, whose social position was higher than his own, James would not so readily have accepted the apology. As it was, he said, graciously: “Oh it\u0027s no matter. I\u0027m glad you took the boat. How beautifully you row!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you for the compliment. Last year I belonged to the Sophomore crew at Yale.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I could row as well as you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a matter of practice. If I can give you any hints I shall be glad to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said James, eagerly. “Would you have time this afternoon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I have an hour to spare. If you and my friend Herbert will get into the boat and row out a little way, I shall get an idea of your style of rowing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would rather row out alone,” said James, haughtily, with a disparaging look at Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unfortunately that won\u0027t do as well. You must learn to row with one oar first.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then suppose you get into the boat with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That won\u0027t do as well. I am much heavier than you. Now you and Herbert are about the same weight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, then,” said James, and turning to Herbert, he said, ungraciously: “Will you row with me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you desire it,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Get in, then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When they returned Cameron made some criticisms Upon their rowing. They started out again but Herbert profited better by the instructions he had received and the young collegian said so when they returned.\n\u003c/div\u003e \n\u003cdiv\u003e\n James was far from liking this and when Cameron asked him if he would try another row he answered: “No, I am tired of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you get tired so soon, I am afraid you will have to strengthen your arms by gymnastic exercises.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I am not tired. I don\u0027t feel like rowing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then suppose we walk back to the village. Does your way lie with ours?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nearly all the way,” said James.\n\u003c/div\u003e \n\u003cdiv\u003e\n He enjoyed the idea of walking with the collegian, but it was rather a drawback that Herbert was to share that pleasure with him. Still he could not very well suggest that Herbert should leave them.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you seen my father\u0027s house?” asked James.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps, without knowing whose it was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You couldn\u0027t help knowing it. It is the best in the village,” said James, pompously.\n\u003c/div\u003e \n\u003cdiv\u003e\n Cameron looked at him curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he comes to Yale,” he thought, “and puts on these airs, he\u0027ll be taken down without ceremony.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, indeed!” he said aloud, dryly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to stay here long?” asked James.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t say how long. I am here for my health.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must come and see us. My father will be very glad to see you. My aunt has written us about you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed! May I ask your aunt\u0027s name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Her name is Davenport—Mrs. John Davenport. She lives in New Haven.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, I have met her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Cameron smiled to himself. The lady referred to was not unlike her brother and nephew, being pompous and presuming—one, indeed, whom he secretly disliked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She wants me to prepare for Yale,” said James.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course we Yale men are biased, but we think no student can do better than to come to Yale.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My father wants me to be a professional man—a lawyer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A good profession. Do you think you should like it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said James, complacently. “It\u0027s a very genteel profession. Besides, most of our public men are lawyers. I might stand a chance to get into public life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Should you like it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I should like to be a member of Congress. My father has a good deal of influence and I am his only son, so I should have a very good chance; don\u0027t you think so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would seem so,” said Cameron, with a quiet smile. “I think you had better come to Yale. You would be improved in many ways.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He referred to the possibility of James having some of the self-conceit taken out of him; but then the squire\u0027s son interpreted the remark as a compliment. “Have you ever thought of going to college, Herbert?” asked Cameron, turning to our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I always thought I should like to go,” answered Herbert, “but I never thought there was any chance of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n James laughed scornfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I should think not,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why?” asked Cameron, meaning to draw him out.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027s too poor,” said James.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You, I suppose, have no trouble in that way?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My father is the richest man in Wrayburn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is lucky for you,” said the collegian.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shouldn\u0027t like to be as poor as Carter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn\u0027t pleasant or convenient to be poor,” said Herbert, quietly. “I don\u0027t mean always to be poor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You probably will be,” said James. “Poor boys don\u0027t always stay poor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There isn\u0027t much chance for you to rise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know why,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it seems, Herbert,” said Cameron, smiling, “there is not much chance of my welcoming you at Yale.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish there was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you will have to be content with serving as my professor here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n James did not understand this allusion, but privately wondered how Cameron could talk so intimately with a boy in Herbert\u0027s low social position.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I turn off here,” he said. “That is our house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it?” said Cameron, indifferently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your friend seems to have a very vain idea of his high position,” said Cameron, when James was out of hearing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And a very low idea of mine,” added Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does that disturb you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A little. He carries it so far as to be annoying.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Circumstances may change with you both.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope they may with me,” said Herbert. “I don\u0027t want James to come down in the world, but I hope to rise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day Cameron was honored by a special call from Squire Leech, who left an invitation for the young collegian to take tea with him the following afternoon. This invitation Cameron accepted.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2977/82061.html","bookId":346,"creation":"Aug 5, 2019 12:05:13 AM","modification":"Aug 11, 2019 1:35:38 PM"}
