{"id":28379,"no":33,"title":"CHAPTER XXXII OPENING THE CAMPAIGN","content":"\u0026nbsp;Not knowing his way, but wandering wherever the fancy seized him, Herbert finally came to Washington Square, and took a seat on one of the benches provided for the public. He looked around him with interest, surveying the groups that passed him, though without the expectation of recognizing anyone. But, as good fortune would have it, the very person he most desired to see strolled by. \n\u003cdiv\u003e\n Mr. Cornelius Dixon looked like a cheap swell. In his dress he caricatured the fashion, and exhibited a sort of pretentious gentility which betrayed his innate vulgarity. He stared in wonder when a boy with a bundle under his arm started from his seat, and hurried toward him with the greeting: “How do you do, Mr. Dixon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really,” drawled Cornelius, “you have the advantage of me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t you remember me? I am your cousin, Herbert Carter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What! the boy the old fellow left his old clothes to?” asked Cornelius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The same one,” answered Herbert, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You haven\u0027t got any of \u0027em on, have you?” asked Mr. Dixon, surveying him with curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; this coat was made from my uncle\u0027s cloak.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shouldn\u0027t have thought it. It looks quite respectable, \u0027pon my honor. When did you come to the city?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only this morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On a visit?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I want to find a place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Humph!” muttered Cornelius, thoughtfully. “Places don\u0027t grow on every bush. Where are you hanging out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven\u0027t found a place yet. I want to find a cheap boarding house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You might come to mine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you pay more than I could afford,” suggested Herbert, who was not aware that Cornelius had a very limited income, and occupied a room on the fourth floor of a Bleecker Street boarding house, at the weekly expense of five dollars.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can come into my room for a day or two, and then we\u0027ll see what arrangement we can make. I\u0027m going there now. Will you come along?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert gladly accepted the invitation. He was tired of wandering about the great city, not knowing where to lay his head; accordingly he joined his genteel cousin, and they walked toward Bleecker Street.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got any money?” queried Cornelius, cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not much. If I don\u0027t find something to do in a week, I must go back to the country.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A week\u0027s a short time to find a place. But hold on! We want a boy in our store. I guess I could get you in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What wages would I get?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two dollars a week, to begin with.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I couldn\u0027t live on that, could I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess not. Four dollars a week would be the least you could get boarded for.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it will be better for me to go home than to stay here, and get into debt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps it would,” said Cornelius, who was afraid Herbert might want to borrow of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can\u0027t I get something better? How much do you get?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ahem! only twenty dollars a week,” answered Mr. Dixon, who really got about half that.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, that\u0027s splendid!” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So it would be if I only got it,” thought Cornelius. “I can\u0027t save anything,” he answered. “I have to dress in the fashion, you know, on account of my position in society.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert privately thought, from an inspection of his cousin\u0027s wardrobe, that the fashion was a queer one, but he did not say so.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s a shame the old man didn\u0027t leave us more,” said Mr. Dixon, in an aggrieved tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would have been convenient,” Herbert admitted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He ought to have left us ten thousand dollars apiece.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What would you have done with so much money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gone into business on my own account. If I had a store of my own I might have offered you a place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But suppose I had ten thousand dollars, too?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I would have taken you into partnership. It would be a grand thing for you to be junior partner in a New York firm.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert thought so, too, though it is doubtful whether a firm of which Mr. Dixon was the head would have occupied so proud a position as some others.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you have spent all your legacy?” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should say so. What\u0027s a hundred dollars? I bought a new suit of clothes, a dozen pair of kids, and a box of cigars, and that took up about all of it. You don\u0027t smoke, do you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, no,” answered Herbert, surprised at the question.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better not. It\u0027s expensive. Wait a minute. I want to buy a cigar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Dixon dove into a cigar store, and emerged with one in his mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon they reached the boarding house. It was a five-story brick building, rather shabby outwardly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Cornelius opened the door with a night key, and bade Herbert follow. So he did, up to the fifth floor, where his guide opened a door and admitted him into a room about ten feet square, in a bad state of disorder. In the corner was a bed, not very inviting in appearance. It looked very different from the neat little bed which Herbert slept in at home. The furniture was of hair, and had evidently seen better days. There were two chairs, both of them covered with portions of Mr. Dixon\u0027s wardrobe. Cornelius cleared off one, and invited Herbert to be seated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is my den,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Den,” seemed to be the right word, though Herbert did not say so. He wondered why a man with so large an income did not live better.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can brush your hair if you want to,” said Cornelius. “The supper bell will ring right off. I\u0027ll take you down with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will there be room?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes; I\u0027ll arrange about that. If you like you can room with me, and I guess I can fix it so you needn\u0027t pay more than four dollars a week, getting your lunch outside.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish you would,” said Herbert, who felt that, dirty as the room was, it would be more like home to him than where he was wholly unacquainted.\n\u003c/div\u003e \n\u003cdiv\u003e\n At the table below, Herbert found a seat next to Cornelius. There were other clerks at the table whom Mr. Dixon knew, also two or three married couples, and two extra ladies.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That lady is an actress,” whispered Cornelius, pointing to a rather faded woman, of about thirty, on the opposite side of the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is she?” returned Herbert, examining her with considerable curiosity. “Where does she play?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At the Olympic,” said Mr. Dixon. “She is Rosalie Vernon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s a pretty name.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s only her stage name. Her real name is Brown.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you ever see her play?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Often; she\u0027s good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She looks very quiet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She don\u0027t say much here; but on the stage she has enough to say for herself. Do you see that man with gray hair and spectacles?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027s an Italian count. He lost his property somehow, and is obliged to give lessons in French and Italian. Quite a come-down, isn\u0027t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n In the evening he discussed his plans with Cornelius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can\u0027t I get more than two dollars a week in a store?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid not; though you might stumble on a place where they would give three.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Even that would not be enough to live upon. I must make that, at any rate, and I hoped to be able to save something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There are some newsboys who make a dollar a day,” suggested Cornelius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A dollar a day? That\u0027s six dollars a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Exactly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think I could go into that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course you can, if you\u0027ve got money enough to buy a stock of papers to start with. You\u0027ll be your own boss. Then there\u0027s boot-blacking; but that ain\u0027t genteel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should prefer selling papers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you\u0027d better try it. I\u0027ve spoken to the landlady, and she\u0027ll take you for four dollars a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert closed the day in good spirits. He thought he saw his way clear to supporting himself in the city. Before he went to bed he wrote a cheerful letter to his mother and deposited it in a post office box at the corner.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2977/82072.html","bookId":346,"creation":"Aug 5, 2019 12:05:13 AM","modification":"Aug 11, 2019 1:35:58 PM"}
