{"id":28382,"no":36,"title":"CHAPTER XXXV HERBERT\u0027S RETURN","content":"\u0026nbsp;Mrs. Carter was setting the table for her solitary supper. She had been very lonely since Herbert went away. The days seemed doubly long. Most of all she missed him at mealtime. He kept her informed of all that was going on in the village, and when there was no news to tell he talked over their plans for the future. Life seemed very dull and monotonous without him. Yet the poor mother always wrote cheerfully, for she did not want to damp his courage, or interfere with the plan of life he had formed. She felt that there was nothing for him to do in Wrayburn, and, since she could not go to him, they must be content to live apart for the present. \n\u003cdiv\u003e\n “I wish I could see my boy,” she sighed, as she poured out her solitary cup of tea, and tried to force down a few mouthfuls of toast. “Shall we ever be able to live together again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a noise at the outer door, a quick step was heard, and Herbert rushed in, nearly upsetting the table in his impetuosity, as he embraced his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you glad to see me, mother?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t know how I have longed to see you!” was the heartfelt reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n She did not ask what brought him home, nor care to ask just yet. She was too happy in having him back.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t ask for my news, mother,” said Herbert, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it good news?” she asked, wistfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose I should tell you that Mr. Cameron\u0027s father has agreed to pay two hundred dollars for father\u0027s model!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he, really?” asked Mrs. Carter, her face lighting up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has bought it, that is, half of it; but he is to pay more than that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “More than two hundred dollars, Herbert?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “More than three hundred. What do you think of that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you in earnest, Herbert?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Quite in earnest, mother; only it is better than a dream. You mustn\u0027t be too much excited, mother, when you hear the whole. I will only say that we shan\u0027t have to pinch any more, or lie awake thinking how to ward off starvation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And can we be together again, Herbert? You don\u0027t know how lonely it is without you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poor mother! How lonesome it must have been! Yes; we can be together again, if you think a thousand dollars a year will pay our expenses.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A thousand dollars a year!” exclaimed Mrs. Carter, thinking that Herbert was bereft of his senses. “It can\u0027t be that your father\u0027s invention is worth as much as that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Cameron has offered that for half the invention, and I have agreed to sell to him. I supposed you would not object.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Object? I did not dream of getting one-tenth as much. It seems to me like a dream.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a happy dream, mother, and a true one. Father little thought what a handsome legacy he was leaving us when he left us that model.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How happy it would have made him had he known it before he died! Tell me how it all happened.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So Herbert had to tell his mother about his fortunate meeting with Mr. Cameron, and what resulted from it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Cameron is a very honorable man,” he concluded, “for he might easily have offered one-quarter as much, and I should have agreed to it. Now, mother, let me tell you my plans for the future. In the first place, are you willing to leave Wrayburn?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am willing to live anywhere if we are together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Cameron proposed to me to accept a clerkship in his office, but for the present, I told him, I wished to make up the deficiencies in my education. In the town where he lives there is a flourishing academy. I propose that we move there, and I spend the next two years in study. We shall have a competent income, more than enough to support us, and so I can afford the time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I fully approve of your proposal, Herbert. We may sometime lose our money, but a good education never.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was sure you would agree with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall we have any difficulty in finding a house of suitable size?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I inquired about that. There is a very pretty cottage just vacated, not far from the academy. I find we can have it at a moderate rent. I have already got the refusal of it, and will write at once that we will hire it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what shall we do with this house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We won\u0027t sell it to Squire Leech at a sacrifice. That is one thing certain. By the way, day after to-morrow is the day for paying the interest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I have been troubling myself about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is no occasion; I have a hundred dollars in my pocket, given me on account by Mr. Cameron. So the squire is checkmated. But, mother, I have a favor to ask of you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “For two days keep secret our good fortune.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, Herbert?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want the squire to be deceived—to think the place is in his grasp, and realize that there is many a slip between the cup and the lip.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What shall I say to the neighbors if they ask why you have got home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say that I am not going back to New York—that I couldn\u0027t earn enough there to save anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will do as you think best, Herbert; but I am afraid that my joy at the good news you have brought will betray me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will be attributed to your joy in having me back. We\u0027ll keep things secret for a day or two—that\u0027s all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n After supper Herbert walked out. He was popular in the village, and received many cordial greetings. To the inevitable inquiries he replied as he had suggested to his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently he met James Leech. He smiled to himself as he saw James advancing to meet him, but assumed a sober, downcast look.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hello, Carter! Have you got back?” said James.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Got tired of New York?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like New York well enough, if I could make enough money there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you\u0027re not going back?” asked James, in a tone of satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at present.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you\u0027d be coming back,” said James, in a tone of triumph.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What made you think so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I knew you couldn\u0027t get along there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I supported myself while I was there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you didn\u0027t make anything over?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you might as well be back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know. I am not sure of doing that in Wrayburn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t think I shall stay in Wrayburn long. Father talks of moving to New York,” said James, in a burst of confidence. “What do you expect to do here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think your father would give me work?” asked Herbert, demurely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know. He might, if you agreed to sell the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We may, if we can get enough for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027ll have to, anyway. You must be very poor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We\u0027ve got a little money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I\u0027ll mention your case to father. I\u0027m sorry for you, but I knew beforehand you wouldn\u0027t succeed in New York.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert smiled quietly as James walked away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027ll be astonished when he hears the truth,” thought he.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2977/82075.html","bookId":346,"creation":"Aug 5, 2019 12:05:13 AM","modification":"Aug 11, 2019 1:36:03 PM"}
