{"id":72181,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDalton made a growling noise and Rory found herself pressed against the door by two hundred pounds of cowboy. “Deal is, you touch me, I get to touch you.”\u003c/p\u003e\n\u003cp\u003e“Hey. I didn’t agree to that deal.”\u003c/p\u003e\n\u003cp\u003e“It’s unspoken.” Dalton angled his head and placed a kiss on the side of her neck.\u003c/p\u003e\n\u003cp\u003eShe should’ve demanded he stop after that first soft kiss. Or the second, placed on her neck below the first. She really shouldn’t have let him string hot kisses down one side of her throat and up the other side. She probably should’ve moved away instead of leaning closer when he started rubbing his smooth face against hers.\u003c/p\u003e\n\u003cp\u003eBut it felt so good.\u003c/p\u003e\n\u003cp\u003e“Rory,” he murmured in her ear. “Have me for lunch.”\u003c/p\u003e\n\u003cp\u003eThat snapped her out of it. “What?”\u003c/p\u003e\n\u003cp\u003e“Have lunch with me.”\u003c/p\u003e\n\u003cp\u003eJesus. This man muddled her brain to the point he could make her hear things she wanted to hear. “Dalton. I can’t.”\u003c/p\u003e\n\u003cp\u003e“Too short of notice, huh?”\u003c/p\u003e\n\u003cp\u003e“It’s not that.”\u003c/p\u003e\n\u003cp\u003eDalton eased back but his hands remained braced beside her head on the door. “Then what?”\u003c/p\u003e\n\u003cp\u003e“This is going way too fast for me. You show up at the Twin Pines and bully-kiss me into giving you my phone number.”\u003c/p\u003e\n\u003cp\u003e“Bully-kiss? Never heard that one before.”\u003c/p\u003e\n\u003cp\u003e“The night before last when we had supper at your place you used that bully-kiss tactic on me then too.”\u003c/p\u003e\n\u003cp\u003e“I didn’t use the bully-kiss tactic yesterday,” he pointed out.\u003c/p\u003e\n\u003cp\u003e“Only because you went to visit your mom and we didn’t see each other,” she retorted.\u003c/p\u003e\n\u003cp\u003e“I haven’t used the bully-kiss tactic today.” He grinned at her. “Not yet anyway.”\u003c/p\u003e\n\u003cp\u003eHer eyes searched his. “I’m serious. You just blow into town after three years and I’m supposed to take it on faith that you want to be with me? Especially after we hadn’t been on the best terms for several years before that? It’s only been three days.”\u003c/p\u003e\n\u003cp\u003eA fierce look entered his eyes. “If I’d known you were back after breaking your engagement I’d been here six months ago.”\u003c/p\u003e\n\u003cp\u003eRory stilled. Dalton hadn’t brought up her broken engagement the other night so she wasn’t sure he’d known about it. “How’d you find out?”\u003c/p\u003e\n\u003cp\u003e“That you kicked that douche-fucker—who wasn’t good enough to date you, let alone marry you—to the curb? Sierra told me four hours after I left Montana. And I let her have it for keeping such a big fucking secret from me.”\u003c/p\u003e\n\u003cp\u003eRory ducked under his arm and put distance between them. “I didn’t know you were so tight with Sierra.”\u003c/p\u003e\n\u003cp\u003e“I keep in touch with her because she’s the only McKay who never knew me during my growing up years, so she doesn’t hold a fixed opinion about me.”\u003c/p\u003e\n\u003cp\u003e“So you could keep in touch with her, but not me?” Crap. Why had she said that? “Did Sierra blab all about me?”\u003c/p\u003e\n\u003cp\u003eDalton crowded her again. “Only if I asked. So I knew about your engagement. You were seriously gonna marry a guy named Dillon Doland?”\u003c/p\u003e\n\u003cp\u003e“He goes by Dil. Besides, it’s not the person’s name you fall in love with, but the person.”\u003c/p\u003e\n\u003cp\u003eHe grabbed her upper arms and pulled her closer. “Were you in love with him?”\u003c/p\u003e\n\u003cp\u003eGiven the jealous fire flashing in Dalton’s eyes, she was surprised how easily she manipulated the truth. “We had a lot in common.”\u003c/p\u003e\n\u003cp\u003e“Did. You. Love. Him.”\u003c/p\u003e\n\u003cp\u003e“Why does it matter now?”\u003c/p\u003e\n\u003cp\u003e“Dammit Rory, I can’t stand the thought…” Then Dalton’s hands slid up, framing her face as his mouth took possession of hers.\u003c/p\u003e\n\u003cp\u003eThe kiss started out red-hot and spiraled higher from there. Every slide of his tongue against hers, every tiny suck, every nibble, every time he pulled back he made a low groan and dove into the kiss again. He read her reactions and adjusted accordingly with the perfect combination of passion and temptation. Making her crave more body-to-body contact, more…everything.\u003c/p\u003e\n\u003cp\u003eHe slowed the kiss and backed off. “Didn’t mean to do that here, but I just wanted you to know.”\u003c/p\u003e\n\u003cp\u003eShe rested her backside against the desk because her legs were jelly. “You wanted me to know that you intend to romance the hell out of me?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Know what then?”\u003c/p\u003e\n\u003cp\u003eBefore he could respond, the door swung open and Hannah walked right in.\u003c/p\u003e\n\u003cp\u003eRory was relieved Hannah hadn’t showed up two minutes earlier and caught her and Dalton in a hardcore lip lock.\u003c/p\u003e\n\u003cp\u003e“Oh, hello,” Hannah said to Dalton’s chest, “I didn’t realize you had a visitor, Rory.”\u003c/p\u003e\n\u003cp\u003eLike hell you didn’t.\u003c/p\u003e\n\u003cp\u003eDalton said, “I’ll leave and let you get back to work.”\u003c/p\u003e\n\u003cp\u003eThe hungry way Hannah was eyeing Dalton annoyed the piss out of her. Rory set her hand on Dalton’s arm. “We’re still on for lunch, right?”\u003c/p\u003e\n\u003cp\u003eHe didn’t miss a beat. “Of course. Is the Mexican joint still in business?”\u003c/p\u003e\n\u003cp\u003e“Yes. I’ll meet you there in…fifteen minutes?”\u003c/p\u003e\n\u003cp\u003e“Works for me.” He gave Hannah the cowboy nod before he walked out.\u003c/p\u003e\n\u003cp\u003eAnd lecherous Hannah cranked her head around—much like that chick in The Exorcist—to watch his backside as he ambled out.\u003c/p\u003e\n\u003cp\u003e“Was there something you needed, Hannah?”\u003c/p\u003e\n\u003cp\u003e“Just checking to see if you ordered additional office supplies for your new temporary position.”\u003c/p\u003e\n\u003cp\u003eRight. Hannah just wanted to let Rory know she could barge in any time she liked—regardless if she technically wasn’t Rory’s boss for the next few months. “No. I’m covered.”\u003c/p\u003e\n\u003cp\u003eAfter Hannah exited the office, Rory spent five minutes brightening her makeup before she drove the mile into town.\u003c/p\u003e\n\u003cp\u003eDalton stood when he saw her and kissed her cheek. But he frowned when Rory sat across from him and not next to him.\u003c/p\u003e\n\u003cp\u003e“Did you get in trouble with your boss lady?”\u003c/p\u003e\n\u003cp\u003e“No. She’s just a snoopy bitch.”\u003c/p\u003e\n\u003cp\u003e“I figured as much. I didn’t order you a margarita because I wasn’t sure if you could have a drink at lunch.”\u003c/p\u003e\n\u003cp\u003e“Better not. Hannah will probably do a breath check on me when I get back.” She scrolled down the menu choices. “I’m so glad I don’t have to answer to her for the next three months while I’m in charge of a special project.”\u003c/p\u003e\n\u003cp\u003e“What’s the project?”\u003c/p\u003e\n\u003cp\u003eRory looked up at him and grinned. “It’s a fulltime project, that’s what matters at this point.”\u003c/p\u003e\n\u003cp\u003e“Is this project a stepping stone to getting a fulltime position at the WNRC?”\u003c/p\u003e\n\u003cp\u003eGod she hoped not. If anything it’d add interest to her resume so she could escape this job from hell. She hedged. “We’ll see. I gave notice at the Twin Pines. I have to work Saturday night but after that I’m done. One job.”\u003c/p\u003e\n\u003cp\u003e“Will you know what to do with yourself with only one job?” he teased.\u003c/p\u003e\n\u003cp\u003e“Probably not.”\u003c/p\u003e\n\u003cp\u003e“Luckily I’ve got some great ideas on how to keep you entertained.”\u003c/p\u003e\n\u003cp\u003eI’ll just bet you do. As Rory was about to point out that she wasn’t a source of entertainment while he killed time in Sundance, the waitress came by.\u003c/p\u003e\n\u003cp\u003eRory ordered a pulled pork burrito and Dalton ordered a salad with spicy grilled chicken. “A salad in a Mexican restaurant? Really?”\u003c/p\u003e\n\u003cp\u003e“I’m not used to eating this much. Between the junk food feast the other night and my mom cooking a triple helping of my favorite meal, which included cake, I’ve gotta watch it.”\u003c/p\u003e\n\u003cp\u003e“You look more…buff since I saw you last.”\u003c/p\u003e\n\u003cp\u003e“Logging will bulk you up in a helluva hurry.”\u003c/p\u003e\n\u003cp\u003e“How is your mom?”\u003c/p\u003e\n\u003cp\u003e“Really good. She dragged me to a hole-in-the-wall bar last night, where apparently she’s a regular. I got a huge kick outta seeing that side of her.”\u003c/p\u003e\n\u003cp\u003e“My mom is different since she and Gavin hooked up. Not in a bad way. She’s got that best friend, confidant, lover thing with Gavin. I’m happy for her because she deserves it.”\u003c/p\u003e\n\u003cp\u003eDalton took her hand. “But?”\u003c/p\u003e\n\u003cp\u003e“But nothing. Although there is the teeniest part of me that is jealous.”\u003c/p\u003e\n\u003cp\u003e“Is that why you decided to settle for Dildo?”\u003c/p\u003e\n\u003cp\u003e“Dildo?” she repeated.\u003c/p\u003e\n\u003cp\u003e“Dillon Doland, your ex-fiancé. Dildo for short, from here on out.”\u003c/p\u003e\n\u003cp\u003eShe laughed. Hard. “I forgot how funny you are.”\u003c/p\u003e\n\u003cp\u003e“I didn’t forget how beautiful you are when you laugh.”\u003c/p\u003e\n\u003cp\u003e“Dalton. Don’t.”\u003c/p\u003e\n\u003cp\u003e“Don’t what?” His thumb swept over her knuckles as his gaze roamed her face. “Tell you when Sierra told me you planned to marry someone else that I drowned my sorrows in a fifth of scotch?”\u003c/p\u003e\n\u003cp\u003e“You did?”\u003c/p\u003e\n\u003cp\u003e“Yep. For three nights in a row. You might find this hard to believe, but my fightin’ days ended after I left Wyoming. So it’d been a while since I’d picked a fight. But I found the biggest, meanest logger in the bar. You know how the rest of this goes—he beat the fuck outta me.”\u003c/p\u003e\n\u003cp\u003eRory’s gut clenched. Not only at the mental image of him being bruised and bloody, but that he’d actually told her the engagement caused him to snap.\u003c/p\u003e\n\u003cp\u003eDon’t fall for it. He’s playing you.\u003c/p\u003e\n\u003cp\u003e“Don’t you believe me?”\u003c/p\u003e\n\u003cp\u003e“I just don’t get why you’re telling me this now.”\u003c/p\u003e\n\u003cp\u003e“So you know that the supposed fast pace between us and the way I feel about you…ain’t something that just happened in the last three days.”\u003c/p\u003e\n\u003cp\u003eTalk about being steamrolled. Before she could ask how he felt about her, the waitress delivered chips and salsa.\u003c/p\u003e\n\u003cp\u003e“Got plans for tonight?”\u003c/p\u003e\n\u003cp\u003e“Yes, I do.”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed when she fidgeted. “With who?”\u003c/p\u003e\n\u003cp\u003eRory glanced down.\u003c/p\u003e\n\u003cp\u003eStrong fingers lifted her chin. “With who?” he repeated.\u003c/p\u003e\n\u003cp\u003e“A couple of girls I met at the community center. We’re all single so we call it our Friday night date.” \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-13.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
