{"id":72182,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDalton continued to stare at her. “Then you’ll just have to invite me as your date next Friday night. Because, sweetheart, you’re no longer single.”\u003c/p\u003e\n\u003cp\u003eHer jaw dropped. “You’re kidding, right?”\u003c/p\u003e\n\u003cp\u003e“Nope.” He angled forward and flashed his teeth. “I want to make it very clear to everyone that you and I are together.”\u003c/p\u003e\n\u003cp\u003e“What if I’m not ready for that?” Rory demanded.\u003c/p\u003e\n\u003cp\u003e“Then get ready. I’ve waited long enough.”\u003c/p\u003e\n\u003cp\u003e“FYI: I don’t like the pushy bastard McKay side of you.”\u003c/p\u003e\n\u003cp\u003eDalton got nose to nose with her. “FYI: Tough shit. I’m not hiding our relationship from anyone.”\u003c/p\u003e\n\u003cp\u003e“We don’t have a relationship. One lunch date, one dinner date and a bunch of stolen kisses do not a relationship make, Dalton.”\u003c/p\u003e\n\u003cp\u003e“Fine. Rory, will you go steady with me?”\u003c/p\u003e\n\u003cp\u003eShe scowled at him. “Not funny.”\u003c/p\u003e\n\u003cp\u003e“You have a set number of dates in mind before we can call this what it really is?”\u003c/p\u003e\n\u003cp\u003e“What this is, is you having delusions about what we—”\u003c/p\u003e\n\u003cp\u003eHis very loud, very male growl of displeasure stopped the flow of bullshit from her brain to her mouth.\u003c/p\u003e\n\u003cp\u003e“Don’t pretend this is one-sided.”\u003c/p\u003e\n\u003cp\u003eShe said nothing.\u003c/p\u003e\n\u003cp\u003eWhich seemed to further annoy him. “If you don’t want me in your life at all, say the word. I’ll walk away right now and you won’t see me again.”\u003c/p\u003e\n\u003cp\u003eHer mouth opened. Closed. She tried to open it again but she’d contracted a case of lockjaw in the past five seconds. She couldn’t force the denial out of her tightly closed lips.\u003c/p\u003e\n\u003cp\u003eThat’s because you can’t deny it.\u003c/p\u003e\n\u003cp\u003eChrist. She had to be the most masochistic woman on the planet, jumping in the mosh pit with Dalton McKay again.\u003c/p\u003e\n\u003cp\u003eBut Dalton didn’t gloat. He seemed relieved. “Answer the question. How many dates?”\u003c/p\u003e\n\u003cp\u003eSomehow, Rory tossed out, “Five dates. Real dates.”\u003c/p\u003e\n\u003cp\u003e“What constitutes a real date?”\u003c/p\u003e\n\u003cp\u003e“The usual. We meet. We talk.” Too easy. Add another stipulation. “And we kiss.”\u003c/p\u003e\n\u003cp\u003e“I’ll agree with that definition.”\u003c/p\u003e\n\u003cp\u003eWait a second. Why was he being so agreeable? And why did she feel she’d stumbled into another trap?\u003c/p\u003e\n\u003cp\u003e“Our first date was down by the creek the time you asked if we could touch tongues because you didn’t get how French kissing could be fun and not gross.”\u003c/p\u003e\n\u003cp\u003e“That was not a date! We were ten and twelve years old.”\u003c/p\u003e\n\u003cp\u003e“Hey, I’m following your criteria.” His voice dropped to a husky murmur. “And we kissed that day, jungle girl. I still remember the taste of your lip gloss. Something sweet and fruity. The flavor was sugar…something.”\u003c/p\u003e\n\u003cp\u003e“Sugarplum.”\u003c/p\u003e\n\u003cp\u003e“You still use it?”\u003c/p\u003e\n\u003cp\u003e“My tastes are a little more refined than a ten-year-old girl’s these days.”\u003c/p\u003e\n\u003cp\u003e“Pity. Our second date was the night I so charmingly rid you of that pesky virginity. I kissed you then.”\u003c/p\u003e\n\u003cp\u003e“You’re insane.”\u003c/p\u003e\n\u003cp\u003e“Our third date was the night in Laramie when I drove you home from the bar and we ended up in bed. I kissed you then too.” His gaze dipped to her chest. “More than just your mouth, if I recall.”\u003c/p\u003e\n\u003cp\u003eHer face heated from his purely sexual look. “If I recall, I was drunk, so it shouldn’t count.”\u003c/p\u003e\n\u003cp\u003e“You sobered up damn fast after you threw up all the alcohol. You knew exactly what you were doin’ when you invited me into your bed.”\u003c/p\u003e\n\u003cp\u003eWhy didn’t he have selective memory like most men?\u003c/p\u003e\n\u003cp\u003e“Then the night I caught up with you at the Twin Pines? Date four.”\u003c/p\u003e\n\u003cp\u003eRory shook her head. “No way. That one is reaching.”\u003c/p\u003e\n\u003cp\u003e“How about the second time we were together in Laramie?”\u003c/p\u003e\n\u003cp\u003eShe remained stoic. “I don’t even want to think about that time, Mr. How-fast-can-I-put-my-pants-on-and-run-out?”\u003c/p\u003e\n\u003cp\u003e“Not fast enough if I recall correctly. Didn’t you kick me in the balls?”\u003c/p\u003e\n\u003cp\u003eRory smirked.\u003c/p\u003e\n\u003cp\u003e“I’ll disqualify that one. How about two nights ago when you came to my place? That was very date-like and we kissed. So by my count? We’ve reached that magical dating number today. Right now as a matter of fact.” He smiled with utter confidence and charm. “Face it, sugarplum. We are officially in a relationship. Feel free to tell your girlfriends you’ll have a plus one next Friday night for date night.”\u003c/p\u003e\n\u003cp\u003eThe food arrived, cutting off her retort.\u003c/p\u003e\n\u003cp\u003eWhile she shoved bites of burrito in her mouth, Dalton kept sneaking looks at her and smiling, a little too…pleased with himself.\u003c/p\u003e\n\u003cp\u003eShe set her fork on her plate. “You’re gonna make me ask about that smirk, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Nope. It’s not a smirk; it’s a smile. This is what I look like when I’m happy.” He picked up her hand and kissed her knuckles. “You have no idea how happy I am.”\u003c/p\u003e\n\u003cp\u003eOh, how sweet.\u003c/p\u003e\n\u003cp\u003eAre you out of your fucking mind? He’s not sweet. This man has an agenda, he’s working an angle. And you’re falling for it.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003eYou. Me. This. But mostly me because I cannot believe I’m getting sucked in by you again. “I, ah, think I ate too fast.”\u003c/p\u003e\n\u003cp\u003eHis eyes showed concern. “Do you have antacids? If not I’ve probably got some in my truck.”\u003c/p\u003e\n\u003cp\u003eSee? Sweet. Genuinely sweet. Like the time when you were kids and you jabbed a piece of wood in the bottom of your foot and he carried you to the cabin.\u003c/p\u003e\n\u003cp\u003eShe’d forgotten that. What other good things had she forgotten about Dalton McKay? A lot.\u003c/p\u003e\n\u003cp\u003eWhat’s goin’ on between us ain’t really so sudden.\u003c/p\u003e\n\u003cp\u003eThat freaked her the fuck out. She stood abruptly. “Thanks for lunch, I gotta go or I’m gonna be late getting back to work.”\u003c/p\u003e\n\u003cp\u003eThat marked the first time she ran away from Dalton McKay.\u003c/p\u003e\n\u003cp\u003eChapter Eight\u003c/p\u003e\n\u003cp\u003eFor the past two days, Rory’s concerns, accusations, whatever they were, kept popping up while Dalton was alone working on the house. He admitted they had a tumultuous past, but it hadn’t started out that way.\u003c/p\u003e\n\u003cp\u003eDalton remembered the first time he’d met Rory when he’d been nine years old. Most kids didn’t recall specific days from their childhood with such clarity, but meeting her had been a life-changing event for him.\u003c/p\u003e\n\u003cp\u003eHad he ever told her that?\u003c/p\u003e\n\u003cp\u003eProbably not. And if he told her that now she wouldn’t believe him. The woman was so damn suspicious of him. Not that he blamed her, given their history.\u003c/p\u003e\n\u003cp\u003eThat afternoon he’d raced away from home as fast as his legs could carry him to the secret spot he’d discovered—a mini oasis compared to the dry, flat land around his house. The creek zigzagged, leaving one section accessible through the fence line. He’d been warned to stay out of the area, but the sound of water soothed him. The icy coldness of it numbed the pain from the strap marks on his backside. He could lie on the flat rock beside the creek and gaze at the sky, lazing in the sun like an old barn cat. Lazing in a way that’d get him whupped again at home. He’d hidden himself away there more than a dozen times, always alone.\u003c/p\u003e\n\u003cp\u003eUntil that day.\u003c/p\u003e\n\u003cp\u003eA shout of, “Hey!” had jolted him out of the peaceful place.\u003c/p\u003e\n\u003cp\u003eDalton had turned around so fast he’d tumbled off the rock. He’d been on his hands and knees, when a pair of red cowboy boots had stopped right in front of him. He looked up into the scowling face of a pigtailed blonde.\u003c/p\u003e\n\u003cp\u003e“What are you doing on my rock?” she demanded.\u003c/p\u003e\n\u003cp\u003eBefore he could answer, she hit him with another accusation.\u003c/p\u003e\n\u003cp\u003e“You’re not supposed to be on our land.”\u003c/p\u003e\n\u003cp\u003eHe’d picked himself up off the dirt and loomed over her. “Yeah, what are you gonna do about it, short stuff? Tattle?”\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003e“Hey, I know you. You’re in first grade.”\u003c/p\u003e\n\u003cp\u003e“I’m going into second grade,” she corrected him.\u003c/p\u003e\n\u003cp\u003eHe eyed her suspiciously. “If this is your land, how come you don’t ride the bus with me’n my brothers?”\u003c/p\u003e\n\u003cp\u003e“Because my mom works in town and she picks me up after school.”\u003c/p\u003e\n\u003cp\u003e“What about your dad?”\u003c/p\u003e\n\u003cp\u003e“I don’t got a dad.”\u003c/p\u003e\n\u003cp\u003e“Why? Did he die or something?”\u003c/p\u003e\n\u003cp\u003e“No. It’s just me’n my mom.” She scowled. “How’d you sneak in here?”\u003c/p\u003e\n\u003cp\u003e“Didn’t sneak. I walked.” He pointed. “From that way.”\u003c/p\u003e\n\u003cp\u003eHer mouth formed an “O”.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You’re one of them.”\u003c/p\u003e\n\u003cp\u003eEven at age nine Dalton hadn’t needed an explanation on what she’d meant. But he’d immediately shot back, “And you’re one of them hippies.”\u003c/p\u003e\n\u003cp\u003e“Am not!”\u003c/p\u003e\n\u003cp\u003e“Are too!”\u003c/p\u003e\n\u003cp\u003e“Am not!” Then the blonde sprite had charged him, knocking him on his butt in the dirt. He’d cried out, not only because a girl had tackled him—a girl!—but by pouncing on him, he’d hit the ground hard.\u003c/p\u003e\n\u003cp\u003e“You take that back,” she’d shouted in his face.\u003c/p\u003e\n\u003cp\u003eShe’d sat on him and kept his arms pinned down. Man, she was really strong. “Lemme go.”\u003c/p\u003e\n\u003cp\u003e“Not until you take it back.”\u003c/p\u003e\n\u003cp\u003e“All right, all right, you’re not a hippie.”\u003c/p\u003e\n\u003cp\u003eNot three seconds later she’d grinned at him and let him go before she stood.\u003c/p\u003e\n\u003cp\u003eIndignant, Dalton heaved himself to his feet. “I wasn’t really tryin’, you know. I could’ve gotten away from you at any time.”\u003c/p\u003e\n\u003cp\u003e“Then why didn’t you, huh?”\u003c/p\u003e\n\u003cp\u003e“Because I ain’t supposed to hit girls.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“What’s your name anyway?”\u003c/p\u003e\n\u003cp\u003e“Aurora Rose Wetzler. But everyone calls me Rory.”\u003c/p\u003e\n\u003cp\u003e“Aurora Rose? Ain’t that the name of one of them Disney princesses?”\u003c/p\u003e\n\u003cp\u003eShe lifted her chin. “No. The princess in Sleeping Beauty was named Briar Rose when she was in hiding with the fairies. I’m Aurora Rose. Not the same at all.” \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-14.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
