{"id":72183,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Huh. I’m Dalton—”\u003c/p\u003e\n\u003cp\u003e“McKay,” she finished with him. “You’re in third grade.”\u003c/p\u003e\n\u003cp\u003e“Goin’ into fourth grade,” he corrected.\u003c/p\u003e\n\u003cp\u003eRory walked around him and scrambled on top of the rock. “This is my rock.”\u003c/p\u003e\n\u003cp\u003e“Says who?”\u003c/p\u003e\n\u003cp\u003e“Says me.”\u003c/p\u003e\n\u003cp\u003e“Bet I can knock you off and make it my rock.”\u003c/p\u003e\n\u003cp\u003e“But you ain’t supposed to hit girls, remember?”\u003c/p\u003e\n\u003cp\u003eThat’d put him in a dilemma. He’d scrambled onto the rock beside her. “Not the same thing. It’s like a contest. Or a game. Like playing king of the mountain.”\u003c/p\u003e\n\u003cp\u003e“That’s a stupid game.”\u003c/p\u003e\n\u003cp\u003e“We could play something else.” Might be fun to play with a girl for a change. He used to play with his cousin Keely but she bossed him around as much as his brothers did. Not that his brothers wanted to play anymore. And since he was older than Rory, he’d get to be in charge. “We could play pirates! The rock could be our ship.” Dalton struck a pose. “I could be the pirate king. You could be the princess I rescued from another ship.”\u003c/p\u003e\n\u003cp\u003e“No way,” Rory said. “I don’t wanna be some dumb princess. I wanna be the pirate king.”\u003c/p\u003e\n\u003cp\u003e“You’re a girl, you can’t be a king,” he scoffed.\u003c/p\u003e\n\u003cp\u003e“Then I’ll be the queen of the jungle.” She’d pushed him off the rock.\u003c/p\u003e\n\u003cp\u003eRather than getting mad, he laughed at her audacity.\u003c/p\u003e\n\u003cp\u003eSurprised by his laughter, she laughed. And they’d become fast friends. Secret friends, running through the woods, splashing in the creek, making forts. The friendship parameters had changed during their teen years, but they’d been a constant in each other’s lives.\u003c/p\u003e\n\u003cp\u003eDalton needed to remind her there was more than just bad history between them.\u003c/p\u003e\n\u003cp\u003eSo on a whim Sunday morning he’d texted Rory, telling her he’d swing by her place at noon. But Rory’s dog, Jingle, was a lot happier to see him than Rory was—and Jingle growled at him.\u003c/p\u003e\n\u003cp\u003eOnly not as much as Rory did. “You cannot just show up at my house whenever you feel like it, Dalton McKay.”\u003c/p\u003e\n\u003cp\u003e“I texted you.”\u003c/p\u003e\n\u003cp\u003eArms crossed over her chest, she blocked the entrance to her cabin. “You didn’t ask if you could come over. You just said you were coming over. Big difference.”\u003c/p\u003e\n\u003cp\u003eMan, her hackles were up as much as Jingle’s—not that he’d voice that comparison. “So you’re not interested in the glazed donuts and raspberry-filled bismarcks I brought?”\u003c/p\u003e\n\u003cp\u003eHer gaze moved to the grocery bag dangling from his fingertips. “That is cheating. Plying me with my favorite donuts so I forgive your breach of etiquette.”\u003c/p\u003e\n\u003cp\u003e“Then why don’t you go ahead and add this onto my list of broken rules.” He pressed his mouth to hers, intending to share a sweet kiss. But the instant her lips parted, he couldn’t help but sneak his tongue inside for a tiny taste of her, which wasn’t enough. So by the time he forced himself to back off, his cock was as hard as his breathing.\u003c/p\u003e\n\u003cp\u003eGood thing he wore a long coat.\u003c/p\u003e\n\u003cp\u003e“Not fair,” she murmured against his cheek.\u003c/p\u003e\n\u003cp\u003e“I warned you I ain’t gonna play fair.” He kissed her temple. “I haven’t seen you for two days. Which is two days too long. So you gonna let me in? Or will I be sharing these donuts with Jingle?”\u003c/p\u003e\n\u003cp\u003e“Come in.”\u003c/p\u003e\n\u003cp\u003eDalton kicked off his boots and headed for the small kitchen.\u003c/p\u003e\n\u003cp\u003e“Sit and I’ll get plates. Would you like coffee?”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eNeither spoke until they were both settled at the table with food and drink. “How late did you work last night?” Dalton asked.\u003c/p\u003e\n\u003cp\u003e“Till it closed at two. The bar side was hopping so I helped out.” She ran a hand over the top of her head. “That’s why I’m a mess. I slept in.”\u003c/p\u003e\n\u003cp\u003e“You don’t look a mess to me. You look perfectly beautiful, as always.”\u003c/p\u003e\n\u003cp\u003eRory’s green eyes turned shrewd. “Yeah, I’m some stunner today. No makeup, my hair pulled into a ponytail and I’m wearing sweats.”\u003c/p\u003e\n\u003cp\u003eDalton shrugged. “I stick by what I said. Ain’t the clothes that make a woman sexy.”\u003c/p\u003e\n\u003cp\u003eNot sure what to say, Rory focused on demolishing her donut. “So why are you here?”\u003c/p\u003e\n\u003cp\u003e“To bully-kiss you, ’cause I know you missed it.”\u003c/p\u003e\n\u003cp\u003eShe snorted.\u003c/p\u003e\n\u003cp\u003e“I thought I’d see what your plans were for today.”\u003c/p\u003e\n\u003cp\u003e“Not much. Laundry. Catching up on some reading for work. Why?”\u003c/p\u003e\n\u003cp\u003e“Because I need furniture. You’ve got great taste so I’d like your help.”\u003c/p\u003e\n\u003cp\u003e“That’s it? You’re falling down in the charming and cajoling department. Try again.”\u003c/p\u003e\n\u003cp\u003eFishing for compliments? He could oblige her. “Rory, my stunningly gorgeous, sinfully sexy, surprisingly sweet, whip-smart and all-around perfect dream woman. If you don’t help me choose decent furnishings, I’ll buy mismatched bean bag chairs and TV trays and call it good.” Dalton leaned forward, the picture of earnestness. “Please, goddess of all that requires a shrewd eye and a deft hand, save me from myself.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “That’s much better. We going into Rapid City?”\u003c/p\u003e\n\u003cp\u003e“I thought we’d start in Spearfish.”\u003c/p\u003e\n\u003cp\u003e“Why? You interested in antiques? Secondhand stores?”\u003c/p\u003e\n\u003cp\u003e“No and no.”\u003c/p\u003e\n\u003cp\u003e“That narrows your shopping choices in Spearfish.”\u003c/p\u003e\n\u003cp\u003eJingle put her paws on Dalton’s knee and he ruffled the dog’s ears. “Then let’s head into Rapid. I don’t want anything that has to be special ordered. The furniture has to be in stock so they can deliver it next week. I’m sick of sitting on the damn floor and sleeping on the floor.”\u003c/p\u003e\n\u003cp\u003eRory drained her coffee and stood. “I’ll go get ready.”\u003c/p\u003e\n\u003cp\u003eDalton was pleasantly surprised when Rory walked out of her bedroom about five minutes later. In his past experience with women, “getting ready” took anywhere from twenty minutes to an hour. “That was fast.”\u003c/p\u003e\n\u003cp\u003e“No need to fuss when you’ve already seen me au natural.”\u003c/p\u003e\n\u003cp\u003eHe tugged her against his body. “I haven’t seen you au natural for a long damn time and I’m makin’ it a priority to change that.”\u003c/p\u003e\n\u003cp\u003eRory twined her arms around his neck. “I half-expected your reason for showing up today was to convince me to take a tumble or ten with you, since I actually have a bed we could tumble into.”\u003c/p\u003e\n\u003cp\u003e“Tempting.” He kissed her. “Make no mistake that I want you like fucking crazy, but I won’t rush it.”\u003c/p\u003e\n\u003cp\u003e“So if I said I wanted you to drag me to my bed and ravish me right now…?”\u003c/p\u003e\n\u003cp\u003eDalton clamped his hands on her ass and started pushing her toward the bedroom.\u003c/p\u003e\n\u003cp\u003eShe laughed. “Just checking.”\u003c/p\u003e\n\u003cp\u003eHe’d always hated shopping until he’d gone with Rory.\u003c/p\u003e\n\u003cp\u003eShe refused to let him settle for bachelor-bland furnishings. But the couch, loveseat and recliner she picked were comfortable and not too girly. He chose a king-sized mattress and she convinced him he needed a nightstand and a chest of drawers.\u003c/p\u003e\n\u003cp\u003eHowever, she wasn’t invested in his home entertainment choices at the electronics store. Dalton picked the most basic setup, including a dish for satellite TV and the internet, a DVR and a DVD player and it still set him back more than he expected.\u003c/p\u003e\n\u003cp\u003eOn the way back to Wyoming, he joked, “I intended to take you someplace nice for helping me out today, but I’m thinking DQ is the extent of my budget.” Might make him pathetic, but he was testing the waters—see if Rory had an issue being seen in public with him in Sundance. “I’m sure Dewey’s has a decent Sunday special. If you’re all right eating there.”\u003c/p\u003e\n\u003cp\u003e“Cool.”\u003c/p\u003e\n\u003cp\u003eDewey’s Delish Dish was nearly empty. The hostess seated them in the back row of booths.\u003c/p\u003e\n\u003cp\u003eRory ordered hot tea. Dalton ordered iced tea. They both chose the same open-faced hot turkey sandwich and a dinner salad.\u003c/p\u003e\n\u003cp\u003e“See? We have things in common.”\u003c/p\u003e\n\u003cp\u003e“Food? That’s hardly an endorsement for our compatibility.”\u003c/p\u003e\n\u003cp\u003eTheir easy companionship from the day had vanished.\u003c/p\u003e\n\u003cp\u003e“Dalton, I need to ask you something.” When she struggled to speak he knew he wouldn’t like her question. “Why do you think a relationship will work between us?”\u003c/p\u003e\n\u003cp\u003e“It just will.”\u003c/p\u003e\n\u003cp\u003eThe waitress dropped off their salads.\u003c/p\u003e\n\u003cp\u003e“Why are you supposedly so crazy about me?”\u003c/p\u003e\n\u003cp\u003eIt appeared Rory wasn’t letting him off the hook. “You’re talkin’ like this is something that just came up.”\u003c/p\u003e\n\u003cp\u003e“But it did just come up when you returned to Sundance.”\u003c/p\u003e\n\u003cp\u003e“So the fact I’ve known you since you were a bratty, pig-tailed six-year-old doesn’t hold any weight with you?”\u003c/p\u003e\n\u003cp\u003eRory stabbed her salad. “I’m no more the bratty six-year-old than I am the virginal eighteen-year-old, or the big-mouthed twenty-two-year-old that you used to know. You’re trying to convince me that you’ve changed?” She looked at him. “So have I.”\u003c/p\u003e\n\u003cp\u003e“I realize that.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah? Maybe that’s what you oughta be proving to me. Not that you’ve changed, but in the few times we’ve seen each other you’ve noticed the changes in me.”\u003c/p\u003e\n\u003cp\u003eDalton gestured for her to bring-it-on while he forked a chunk of iceberg lettuce into his mouth.\u003c/p\u003e\n\u003cp\u003e“Name three things about me that are different from three years ago. And any cosmetic changes aren’t an acceptable answer,” she warned.\u003c/p\u003e\n\u003cp\u003eDalton sipped his tea. “If I do this are you willing to do the same for me? And admit I’ve changed?”\u003c/p\u003e\n\u003cp\u003e“Sure. But only if I agree your three guesses are accurate.”\u003c/p\u003e\n\u003cp\u003e“I ain’t gonna be guessing, ’cause sugarplum, I know that’s what scares you.” He paused with his fork midair. “There’s a melancholy in you that’s never been visible before. Maybe it’s always been there and you’ve been good at hiding it, but now I see it.” He said, “How’d I do?” before he shoveled in a bite of cucumber. \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-15.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
