{"id":72187,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNot her finest hour.\u003c/p\u003e\n\u003cp\u003eEspecially not when she’d locked herself in the bathroom because she couldn’t stand to see him walk out on her again. After her crying fit, she’d stared at her red-rimmed eyes and blotchy face in the mirror, then she’d scrutinized the suck marks on her neck and repeated, “Never again, Douchebag McKay,” until her hatred overtook her hurt.\u003c/p\u003e\n\u003cp\u003eSo things had turned ugly between them every time they’d crossed paths after that incident. Dalton had too much McKay pride to apologize for who he was and Rory had too much anger to let it slide.\u003c/p\u003e\n\u003cp\u003eOnce Sierra had stepped in, keeping Rory from taking a swing at Dalton’s pretty face—even when he’d sworn he’d only been trying to apologize.\u003c/p\u003e\n\u003cp\u003eBut she had no choice except to be civil when Addie and Dalton became engaged. For all intents and purposes the groom and the maid of honor had avoided each other—not that anyone noticed.\u003c/p\u003e\n\u003cp\u003eSo Dalton’s confession of why he’d ditched Addie at the altar had knocked her sideways. Even when that time, she knew he hadn’t been feeding her a line. Remembering the look in his eyes at that moment still gave her chills.\u003c/p\u003e\n\u003cp\u003eNow here he was acting like nothing had changed. Like he’d just been waiting for her to get her shit together.\u003c/p\u003e\n\u003cp\u003eWrong.\u003c/p\u003e\n\u003cp\u003eDalton had run out on her too many times for her to take his insistence he’d changed at face value. He’d leave when it suited him—like he always did, regardless of who it hurt.\u003c/p\u003e\n\u003cp\u003eBut this time it could be different—because she was different. Rory wasn’t some starry-eyed eighteen-year-old with visions of forever. She had goals and dreams and no man would ever get in the way of them again. Living in Sundance, working at the WNRC wasn’t anything more than a temporary pit stop on her way to something better.\u003c/p\u003e\n\u003cp\u003eSo Dalton wanted her—no surprise. She wasn’t immune to Dalton’s charms—a fact he was perfectly aware of. As much as he’d use it to his advantage, she’d use it to hers too. Let him try and convince her he’d changed. Let him prove to her sex between them would be off the charts fantastic.\u003c/p\u003e\n\u003cp\u003eAfter all the shit he’d put her through over the years, she deserved every bit of his sexual attention and expertise. She had no delusions about what she wanted from him; hot sex, companionship on her terms that didn’t interfere with her career goals. She could reap all the benefits and take none of the risks.\u003c/p\u003e\n\u003cp\u003eBecause she’d be the one walking away from him this time with her heart and her pride intact.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eStay cool.\u003c/p\u003e\n\u003cp\u003eDalton tried to pretend he was calm about seeing Addie as he parked in front of the house she shared with Truman.\u003c/p\u003e\n\u003cp\u003eAfter all, three years had passed since he’d left her and left town. She’d married one of his best buddies and according to Rory, was perfectly happy with her life. He knew she’d never forget what he’d done, but had she forgiven him?\u003c/p\u003e\n\u003cp\u003eHe’d opted to show up early to clear the air. He rang the doorbell. Dang. Should he have brought flowers?\u003c/p\u003e\n\u003cp\u003eToo late now, he thought as the door opened. “Hey, Addie.”\u003c/p\u003e\n\u003cp\u003eAddie squinted through the screen. “Dalton? What’re you doin’ here? Supper isn’t for another hour.”\u003c/p\u003e\n\u003cp\u003e“I figured maybe you and me oughta talk beforehand.”\u003c/p\u003e\n\u003cp\u003eIt appeared she might slam the door in his face, but she grudgingly said, “You’re probably right.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” He stepped inside. As in most ranch houses, the door opened into the living room. He paused and wiped his boots.\u003c/p\u003e\n\u003cp\u003e“I’m in the kitchen putting everything together for tonight,” she tossed over her shoulder and disappeared around the corner.\u003c/p\u003e\n\u003cp\u003eOnce he’d settled at the kitchen table, he got his first solid look at Addie. She didn’t look much different except for her pregnancy. He smiled. “Smells wonderful in here.”\u003c/p\u003e\n\u003cp\u003e“Nothin’ fancy, I assure you. I’m too tired lately to do more than throw food together.”\u003c/p\u003e\n\u003cp\u003e“You look great, Addie. When’s the baby due?”\u003c/p\u003e\n\u003cp\u003e“Two months. We’re having a little boy.” She rubbed her belly, as so many pregnant women did. “Would you like something to drink?”\u003c/p\u003e\n\u003cp\u003e“A glass of water would be great.”\u003c/p\u003e\n\u003cp\u003eAddie filled a glass and sat across from him.\u003c/p\u003e\n\u003cp\u003e“Thanks.” He wet his dry throat.\u003c/p\u003e\n\u003cp\u003eAn uncomfortable pause lingered.\u003c/p\u003e\n\u003cp\u003eThere was no way to ease into this, so he jumped in. “I’m truly sorry for the crap you had to deal with after I didn’t go through with the wedding.”\u003c/p\u003e\n\u003cp\u003eShe folded her arms over her chest, her brown eyes unreadable. “I had no choice but to deal with it since you skipped town.”\u003c/p\u003e\n\u003cp\u003e“Skipped town, chased out of town…big difference. Although I was a brawler back then, my body couldn’t take any more punishment from people who beat the shit outta me on your behalf.”\u003c/p\u003e\n\u003cp\u003eHer face paled. “What happened?”\u003c/p\u003e\n\u003cp\u003e“Your family, your coworkers, your current husband,” he said dryly, “all took turns whaling on me.”\u003c/p\u003e\n\u003cp\u003e“Dalton. Are you serious?”\u003c/p\u003e\n\u003cp\u003eHe gave her a suspicious look. “No one bragged about it? No one told you they had your back and they’d taken care of me?”\u003c/p\u003e\n\u003cp\u003e“No! My god. I had no idea.”\u003c/p\u003e\n\u003cp\u003e“I admit I didn’t fight back because I probably deserved it. Except for the scuffle with Truman. I hobbled around for two days after he finished with me.”\u003c/p\u003e\n\u003cp\u003e“Is that why you left Sundance?”\u003c/p\u003e\n\u003cp\u003e“Partially. I knew it’d be a while before I wasn’t the object of scorn. But there was other stuff goin’ on that pushed me that direction.” He slid his glass back and forth on the quilted placemat. “There was a lot of stuff that we never discussed, Addie.”\u003c/p\u003e\n\u003cp\u003e“I know that now. At the time, I didn’t wanna sweat those small details. I thought we’d deal with them after the wedding. For about two months after you left, my mind kept going back to those months we were engaged. Trying to find warning signs I missed.”\u003c/p\u003e\n\u003cp\u003eDalton met her gaze. “What did you think you missed? Because I had every intention of marrying you that day. Up until the…” Moment I looked across the altar and really saw Rory.\u003c/p\u003e\n\u003cp\u003e“Moment you realized you were about to say vows that were a lie,” she said softly.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“The signs were there. You had no interest in wedding planning—I chalked it up to being a guy thing. You hadn’t moved a single item from your trailer into my house. In fact, you never brought up the difficulties of living in town when all your family members live and work on the ranch.”\u003c/p\u003e\n\u003cp\u003eHis brothers hadn’t brought it up either, another reminder how out of touch they’d all been.\u003c/p\u003e\n\u003cp\u003e“Why were we both eager to pledge ourselves to each other?” Addie shifted in her seat. “When I think back to our engagement? I didn’t know you at all.”\u003c/p\u003e\n\u003cp\u003e“I had a moment of doubt at our rehearsal dinner when the minister started askin’ me that list of your favorites. I got one right, your favorite movie, only because we spent a lot of time watching TV.”\u003c/p\u003e\n\u003cp\u003e“I was equally shocked when I got so many of your favorites wrong.”\u003c/p\u003e\n\u003cp\u003eDalton would never admit Addie had gotten most of his favorite things right, but because he’d sucked at naming her favorites, he’d lied just so she looked as clueless as him.\u003c/p\u003e\n\u003cp\u003eYou were some prize.\u003c/p\u003e\n\u003cp\u003e“It’s not like we had any excuses not to know each other better. We dated for three months and were engaged for six.” She fiddled with the ruffled placement edging. “What I can’t figure out? Why did you propose to me in the first place?”\u003c/p\u003e\n\u003cp\u003e“Because you said you loved me.”\u003c/p\u003e\n\u003cp\u003eHer mouth dropped open.\u003c/p\u003e\n\u003cp\u003e“And you were sincere. You were too good for me, Addie.” That had appealed to him. Marrying Addie might make him a better man. He’d known for months prior to their engagement things in his life needed to change. He believed Addie was the catalyst. And she had been—just not in the way either of them expected.\u003c/p\u003e\n\u003cp\u003e“Is that why you suggested we wait until our wedding night to have sex?”\u003c/p\u003e\n\u003cp\u003eDalton blushed. “Most likely. Although I’d convinced myself that’s what you wanted. In hindsight, I attributed a lot of feelings and ideas to you that weren’t there.”\u003c/p\u003e\n\u003cp\u003e“You got that right.” She leaned forward. “A little secret between you and me? I didn’t tell Truman that you and I never had sex. In fact…” She laughed. “Exactly the opposite. I told him you were an animal in bed and no man could ever compare.”\u003c/p\u003e\n\u003cp\u003eNow his jaw nearly hit the table. “Addie! Why in the hell would you do that?”\u003c/p\u003e\n\u003cp\u003e“What? You owed me that lie, given your reputation as a McKay stud that I didn’t get to experience.” She smirked. “Besides, Truman got it in his head that he needed to be a lover to me that’d make me forget all others and whoo-ee. It’s worked. I’m always walking around with a big ol’ smile on my face.” She shook her finger at him. “So don’t you ruin my sweet gig and offer some kind of confession to my husband tonight, got it?”\u003c/p\u003e\n\u003cp\u003e“Got it.”\u003c/p\u003e\n\u003cp\u003e“That said, I cursed your name for months after you left, Dalton McKay. But as time marched on, I realized you were right to call off the wedding. I wish you’d done it before the ceremony. Getting left at the altar ranks as one of the worst things that’s happened to me, yet it also led to the best thing that’s ever happened to me.” She smiled. “Truman.”\u003c/p\u003e\n\u003cp\u003e“I’m glad that you’re so happy, Addie. I really am. Although, I gotta admit I never would’ve put you and Truman together.”\u003c/p\u003e\n\u003cp\u003e“He’s no McKay bad boy, that’s for sure. Then again, neither were you when we were together.”\u003c/p\u003e\n\u003cp\u003e“Was that why you agreed to date me? Because I was the last supposedly wild McKay?”\u003c/p\u003e\n\u003cp\u003e“That was part of it. I wasn’t the type guys panted over. Not like Rory.”\u003c/p\u003e\n\u003cp\u003eLike Dalton needed the reminder that guys had lusted after Rory. She’d been sort of sweetly clueless about it. Or hostile about it, depending on the day. \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-19.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
