{"id":72199,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWhen her grip loosened, he shuttled his cock in and out of her slick channel until that moment when pleasure blindsided him and he erupted. Wave after wave of heat shot out of his cock and he freakin’ loved the slick feeling it added to her pussy since they’d stopped using condoms.\u003c/p\u003e\n\u003cp\u003eOnce he could breathe, he kissed her neck. “Aurora.”\u003c/p\u003e\n\u003cp\u003e“Say it again,” she murmured.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“My name. I love the way you say it after you come. It’s so sexy.”\u003c/p\u003e\n\u003cp\u003e“Aurora.”\u003c/p\u003e\n\u003cp\u003eShe shivered. Then she rubbed her bare leg up and down his. “Now what did you say you wanted to do tonight?”\u003c/p\u003e\n\u003cp\u003e“Hell if I remember.”\u003c/p\u003e\n\u003cp\u003eChapter Fifteen\u003c/p\u003e\n\u003cp\u003eFriday night after work Rory slid into the booth, grateful Mandie and Vanessa had ordered her a martini. She drained it in two big gulps and waved to the cocktail waitress for another round. “Ah. That’s what I needed.”\u003c/p\u003e\n\u003cp\u003eMandie and Vanessa exchanged a look. “What is up with you? You’re like thirty minutes late.”\u003c/p\u003e\n\u003cp\u003e“I went over to Dalton’s to change out of my uniform. Any time he sees me half-naked, he seizes the chance to get me completely naked and well, it’s not like I resisted.”\u003c/p\u003e\n\u003cp\u003e“So you just had sex,” Mandie stated.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“And how was it?” Vanessa prompted.\u003c/p\u003e\n\u003cp\u003e“Let’s put it this way, I’m lucky I’m only thirty minutes late. The man is a sex fiend. He’s relentless.” She grinned. “It is so very good to be me.”\u003c/p\u003e\n\u003cp\u003e“I’m so freakin’ jealous I could spit.”\u003c/p\u003e\n\u003cp\u003e“I didn’t spit when you were getting it on all the time with Thomas,” Rory reminded Mandie.\u003c/p\u003e\n\u003cp\u003e“All the time,” she scoffed. “He never lasted long enough to make me thirty minutes late for something.”\u003c/p\u003e\n\u003cp\u003e“Is that why you broke up with him?”\u003c/p\u003e\n\u003cp\u003eMandie shook her head. “I couldn’t stand his family. I didn’t see it going anywhere because of that.”\u003c/p\u003e\n\u003cp\u003eThe waitress brought a fresh round.\u003c/p\u003e\n\u003cp\u003e“Well I don’t have to worry about Dalton’s family because I’m just in it for the sex.”\u003c/p\u003e\n\u003cp\u003eEven Vanessa looked skeptical. “Just sex? Nothing else? You’re sure it’s not becoming something more?”\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003e“Did he really last thirty minutes?” Mandie asked.\u003c/p\u003e\n\u003cp\u003eWhy was her friend focused on that? “I don’t know. I wasn’t exactly looking at my watch while he was rocking my world. But probably. He does have incredible staying power. And recovery time.” She smirked. “And tenacity.” And a possessive streak. He’d fucked her almost as a way to mark her before she went to a bar on a Friday night. Reminding her she’d never get it as good anywhere else as she was already getting with him. All. The. Freakin’. Time.\u003c/p\u003e\n\u003cp\u003e“How many times did you…?”\u003c/p\u003e\n\u003cp\u003eRory sipped her drink with one hand and lifted two fingers in the air.\u003c/p\u003e\n\u003cp\u003e“Twice? You had two orgasms…in thirty minutes?”\u003c/p\u003e\n\u003cp\u003eMandie groaned. “I hate you.”\u003c/p\u003e\n\u003cp\u003e“Remember, we just started sleeping together. It’ll probably burn out.” Rory ignored her libido when it piped up and bet her willpower fifty bucks it’d never happen.\u003c/p\u003e\n\u003cp\u003e“How many times have you had sex this week?”\u003c/p\u003e\n\u003cp\u003e“Since Friday?” Rory thought about it and tossed out a random number. “Seventeen.”\u003c/p\u003e\n\u003cp\u003eHer friends’ mouths nearly hit the table.\u003c/p\u003e\n\u003cp\u003e“Seventeen?” Vanessa repeated. “After as long as you’ve gone without, I’m surprised you’re not sore.”\u003c/p\u003e\n\u003cp\u003eShe was a little tender. But that disappeared when Dalton put his hands on her. Or his mouth on her. Or when he looked at her with that…gleam that made her go all hot and tingly and absolutely sopping wet.\u003c/p\u003e\n\u003cp\u003e“Well, even if she is sore she can’t tell him she’s sore,” Mandie said.\u003c/p\u003e\n\u003cp\u003e“Why not?” Vanessa demanded.\u003c/p\u003e\n\u003cp\u003e“Because if she complains her lady part is chafed he’ll just want anal instead,” Mandie stated.\u003c/p\u003e\n\u003cp\u003eRory choked on her drink.\u003c/p\u003e\n\u003cp\u003e“I wondered if part of the reason you’re not sore after having sex seventeen freakin’ times in a week is because you were taking it up the ass.”\u003c/p\u003e\n\u003cp\u003e“Seriously, Mandie. What. The. Hell.”\u003c/p\u003e\n\u003cp\u003e“What? No butt sex for you yet?”\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003e“He’s gonna want it. Soon probably.” Mandie’s voice dropped to a whisper. “My advice? Lots of lube.”\u003c/p\u003e\n\u003cp\u003e“I cannot believe we’re having this conversation.” She really couldn’t. She and her mom had never discussed sex beyond the you’re going on the pill conversation when Rory had left for college. She’d never wanted to hear about Addie and Dalton doing the nasty. Ditto for Addie and Truman. All the women in her office were much older and married. So she’d never swapped sex stories, tips, dos and don’ts, how tos with girlfriends until she’d started hanging out with these two. And up until last week, she’d had nothing to share. Her sex life with Dillon had been pathetic with a capital P. So she couldn’t wait to share the juicy tidbits.\u003c/p\u003e\n\u003cp\u003eDalton is a little touchy about his previous reputation as a horndog manwhore. He wouldn’t like you blabbing to your friends about his studly moves in the sack.\u003c/p\u003e\n\u003cp\u003eThe booze kicked in and the he-done-me-wrong girl inside her shouted tough shit. But when Rory opened her mouth to tell all about the size and shape and amazing tricks performed by Dalton’s wonder dick…nothing came out.\u003c/p\u003e\n\u003cp\u003eBecause you know it’s wrong.\u003c/p\u003e\n\u003cp\u003eTempting to drown her stupid conscience in half a dozen martinis and see if it still functioned properly.\u003c/p\u003e\n\u003cp\u003e“You got really quiet and then you looked like you were about to share something juicy,” Vanessa said.\u003c/p\u003e\n\u003cp\u003e“No. I just wondered how Mandie knows so much about anal sex.”\u003c/p\u003e\n\u003cp\u003eMandie drained her martini and signaled for another. “I think Rory’s right. We oughta talk about something else.\u003c/p\u003e\n\u003cp\u003eAfter Rory returned to Dalton’s house from the bar, he dragged her back to bed and thoroughly fucked her in that slow and sweet way she craved because he did it so well.\u003c/p\u003e\n\u003cp\u003eSo she was naked, sprawled on her stomach, the sheet twisted around her feet, basking in the afterglow. Happier than she could remember being in a long time.\u003c/p\u003e\n\u003cp\u003eIs that all it takes to make you happy? Sexual attention from a man who’d keep you tied to his bed all day and night until he gets tired of you?\u003c/p\u003e\n\u003cp\u003eWhoa. Where had that come from?\u003c/p\u003e\n\u003cp\u003eDalton trailed his fingers up and down her spine. Then he’d randomly kiss spots on her body. The ball of her shoulder was the winner of that soft kiss. “I love bein’ with you like this,” he said.\u003c/p\u003e\n\u003cp\u003e“What? Naked, spent and sweaty?”\u003c/p\u003e\n\u003cp\u003e“Yes, but not just that.” He brushed her hair away from her neck. “In our own little world.”\u003c/p\u003e\n\u003cp\u003eOoh. That was a sweet, melt-her-heart thing to say.\u003c/p\u003e\n\u003cp\u003eSex-drunk and a little martini-drunk, you’d melt if he recited an ode to the pockmarks on your ass.\u003c/p\u003e\n\u003cp\u003eTrue.\u003c/p\u003e\n\u003cp\u003e“That was a heavy sigh. Something wrong?”\u003c/p\u003e\n\u003cp\u003eYes. I’m pretty sure I left my backbone at home next to Jingle’s rawhide treats. “No. Not really.”\u003c/p\u003e\n\u003cp\u003e“That didn’t sound very convincing, sugarplum. I don’t want to pester you to talk to me, but I will.”\u003c/p\u003e\n\u003cp\u003e“Pester,” she said with a snort. “Nice way of saying you’ll be a pushy bastard until I crack.”\u003c/p\u003e\n\u003cp\u003e“So save me the trouble and tell me.”\u003c/p\u003e\n\u003cp\u003e“Can we cool it on the sex for the rest of the night?”\u003c/p\u003e\n\u003cp\u003eHis eyes darkened with concern. “Did I hurt you?”\u003c/p\u003e\n\u003cp\u003e“No. But I am a little sore from excessive use.”\u003c/p\u003e\n\u003cp\u003e“That’s because I can’t get enough of you. But I will back off.” Dalton kissed her shoulder again. “So, you had a good time with your friends tonight?”\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm. They gave me shit for being late. And because of that our conversation turned to sex.” She groaned. “That’s actually a cliché, three single women in a bar, sipping martinis, dissing on sex.”\u003c/p\u003e\n\u003cp\u003e“What’d you give as a reason for bein’ late?”\u003c/p\u003e\n\u003cp\u003e“That you’re an insatiable stud. Then Mandie went off on this tangent about anal sex. She pretty much guaranteed that if we were having sex this much you’d want that soon.”\u003c/p\u003e\n\u003cp\u003eDalton’s fingers stopped moving.\u003c/p\u003e\n\u003cp\u003e“Is that true?”\u003c/p\u003e\n\u003cp\u003eHe didn’t respond right away. “Rory, I don’t want you talkin’ about our sex life to your friends.”\u003c/p\u003e\n\u003cp\u003eShe rolled away from him and pulled the sheet to her chest. “Excuse me. I thought I was doing you a favor by letting it slip that Dalton McKay is still a legendary cocksman.”\u003c/p\u003e\n\u003cp\u003e“That’s not who I am or ever wanna be again. I only give a damn about bein’ a legendary cocksman in your eyes and in our bed. What happens between us is—”\u003c/p\u003e\n\u003cp\u003e“Special?” she said a little snottily.\u003c/p\u003e\n\u003cp\u003e“Yes. It is. It’s intimacy on a level I’ve never had and I don’t think you have either. So I don’t want to share what’s special between us with anyone else.”\u003c/p\u003e\n\u003cp\u003eRather than agreeing—Rory turned combative. “Maybe I didn’t want you sharing the snatch-and-run job you did with my virginity with anyone else either, but that didn’t seem to stop you.”\u003c/p\u003e\n\u003cp\u003e“And…we’re back to this. Fuckin’ awesome.” Dalton scooted to the edge of the bed. He yanked on his flannel pajama bottoms and a hoodie. Then he left the room without another word.\u003c/p\u003e\n\u003cp\u003eWay to go.\u003c/p\u003e\n\u003cp\u003eThe thing that sucked? She knew tossing that in his face wasn’t the real problem. The real problem was after totaling up the number of sexcapades for the last week, she realized she had been at Dalton’s beck and call—and she’d sworn she wouldn’t be. She had several job listings she should’ve applied for that she’d blown off to blow him. Her mom had returned from her latest trip and had asked several times when they could get together, but Dalton had Rory on her back too many times to even call her mother back. \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-31.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
