{"id":72203,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDalton turned her to face him. “Because tellin’ your mama that I’m takin’ you to Deadwood, when she knows I’ve been a professional gambler doesn’t sound near as romantic as it’s gonna be.” He kissed her. “It’s late and I woke you up pretty early this morning, so I should go.”\u003c/p\u003e\n\u003cp\u003eShe cut the loaf of bread in half and handed it to him. “Here. For breakfast tomorrow.”\u003c/p\u003e\n\u003cp\u003e“You’re sharing your precious pumpkin bread with me?” He kissed her and grinned. “I think you’re beginning to like me a little.”\u003c/p\u003e\n\u003cp\u003e“Maybe just a little.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Was that hard to admit?”\u003c/p\u003e\n\u003cp\u003eShe gave a mock shudder. “Excruciating.”\u003c/p\u003e\n\u003cp\u003eDalton wasn’t looking forward to his old friend Reggie’s bachelor party. Maybe it made him pussy whipped, but he’d much rather be with Rory.\u003c/p\u003e\n\u003cp\u003eIn the last week he and Rory had found common interests besides their sexual compatibility. They challenged each other at Wii games ranging from marksmanship to body balance to bowling. They’d also done more normal dating things—although they were well beyond mere dating in Dalton’s mind. They’d sampled a few local restaurants. They’d gone grocery shopping, which they quickly learned they both hated. One night they’d gone out to listen to a band at the Twin Pines. They’d danced, had a few drinks and had run into a million people they both knew. No one seemed surprised he and Rory were together. His old pals were more surprised they hadn’t seen him out and about in the month he’d been back.\u003c/p\u003e\n\u003cp\u003eAfter living in the Montana wilderness, where he’d purposely isolated himself, he realized he couldn’t do that all the time in his hometown. Now that they’d seen him out with Rory, his former drinking buddies had been pestering him to hang out. Dalton knew he’d come across as a self-righteous reformed dick if he told them his barhopping, strip-club-visiting days were behind him. So he’d said yes when Reggie had asked him to stop by his bachelor party.\u003c/p\u003e\n\u003cp\u003eHe plastered on a smile as he entered the private back room at the Golden Boot. He’d stay for an hour—max. Congratulate his buddy on his upcoming wedding, offer to buy him a shot and then bail.\u003c/p\u003e\n\u003cp\u003eHe’d crashed bachelor and bachelorette parties over the years in this room. Odd to think the last one he’d attended here had been his own. Talk about tame. No strippers. No porn. No open bar. Dalton didn’t recall much from that night—not because he’d drank to excess. He’d ended up sitting in the corner with Leif West—who’d tagged along to the party as Chet and Remy’s guest—discussing Las Vegas gaming. Since Leif lived in Vegas, he had a completely different take on gambling, which Dalton had found fascinating.\u003c/p\u003e\n\u003cp\u003eSo the big whoop-de-do for the last single McKay had fizzled out by eleven p.m.\u003c/p\u003e\n\u003cp\u003e“Dalton! Over here.”\u003c/p\u003e\n\u003cp\u003eHe turned to see Lee Anderson waving at him. As he crossed the room, he accepted a drink from the tiniest cocktail waitress he’d ever seen. She was the size of a twelve-year-old girl—the top of her head barely reached his sternum—and he wondered how in the hell she didn’t tip over with her massive tits weighting her top half. Since she was scantily dressed in sparkly green, she reminded him of a slutty leprechaun. He heard his name again and looked up. When he looked down to excuse himself, she’d vanished.\u003c/p\u003e\n\u003cp\u003eLee clapped him on the back. “Glad you could make it. Me’n Tick and Busby were beginning to think you didn’t want nothin’ to do with us no more, bein’s you’ve been back in town for a while and we haven’t heard from you.”\u003c/p\u003e\n\u003cp\u003eDalton knocked back a swallow of booze. “Aw, I didn’t know you missed me so much. Didn’t mean to butt hurt your poor wittle feewings.”\u003c/p\u003e\n\u003cp\u003e“Fuck off.” Lee grinned. “But I’m happy to see you ain’t changed a whole lot in the past few years.”\u003c/p\u003e\n\u003cp\u003eAnd there it was. The reason he hadn’t wanted to come. That whole you-haven’t-changed-a-bit bullshit. “Where is Busby?”\u003c/p\u003e\n\u003cp\u003e“Hell if I know. So whatcha been up to? We heard you were living on the streets in Vegas after you lost that poker game on TV,” Tick said.\u003c/p\u003e\n\u003cp\u003eDalton rolled his eyes. “Who’d you hear that from?”\u003c/p\u003e\n\u003cp\u003e“Don’t remember now. But you ain’t been back forever. You know how them rumors go if you ain’t around to set ’em straight.”\u003c/p\u003e\n\u003cp\u003e“I’ll set the record straight now.” He gave the bare bones version of his life. A few more guys from their graduating class joined their group, ragging on Dalton for missing their ten-year reunion. Busby showed up with two more “friends” both sporting tits the size of basketballs, collagen lips and vacant eyes. The room was getting crowded, yet Dalton’s glass never dipped below the half-full mark.\u003c/p\u003e\n\u003cp\u003eThe groom arrived and after being subjected to a speech about the horrors of marriage, he was dragged front and center for wedding night tips by Busby’s friends.\u003c/p\u003e\n\u003cp\u003eAll eyes were on the makeshift stage. As soon as the strippers had finished torturing Reggie, other guys pulled out their wallets to get in on the action.\u003c/p\u003e\n\u003cp\u003eDalton didn’t move.\u003c/p\u003e\n\u003cp\u003eTruman slipped in beside him and rested his elbows on the table. “I’m surprised you’re not in line for a lap dance, McKay. Strippers used to be your thing.”\u003c/p\u003e\n\u003cp\u003e“They used to be your thing too, Truman. So why aren’t you in line?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Not my thing anymore.”\u003c/p\u003e\n\u003cp\u003e“Not mine either.” Dalton sipped his drink. “You think any of these married guys will tell their wives they paid a strange chick with monster tits to grind on them?”\u003c/p\u003e\n\u003cp\u003e“Hell no. We both know they’re gonna go home and swear up and down there weren’t strippers at this bachelor party.” Truman shot him a sideways glance. “The only bachelor party that I’ve ever been to that didn’t have strippers? Yours. And who’d believe that of stripper-loving Dalton McKay?”\u003c/p\u003e\n\u003cp\u003eDalton laughed. “Point taken. So did you have strippers at your bachelor party?”\u003c/p\u003e\n\u003cp\u003e“Didn’t have a party. Didn’t do any of the normal wedding stuff with Addie after you…” He cleared his throat. “We opted for small.”\u003c/p\u003e\n\u003cp\u003eThe cocktail waitress, aka—the backup stripper, stood in front of Dalton and rested her enormous rack on the bar. Yeah, he looked—hard to miss those gigantic blobs of flesh when they were right in his fucking face.\u003c/p\u003e\n\u003cp\u003eShe cooed, “Why the frown? You want a lap dance but don’t wanna wait in line?” She smiled and dragged a long red fingernail across her cleavage. “How about if I put a smile on that handsome face of yours, slick?”\u003c/p\u003e\n\u003cp\u003e“How much?” Dalton asked flatly.\u003c/p\u003e\n\u003cp\u003e“Twenty for a five-minute dance. Forty if you want me to face you and let you touch these.” She cupped her breasts.\u003c/p\u003e\n\u003cp\u003e“Pass.”\u003c/p\u003e\n\u003cp\u003e“You sure?” she purred. “What these hips can do puts these girls’ lame moves to shame.”\u003c/p\u003e\n\u003cp\u003e“Pass,” he said again.\u003c/p\u003e\n\u003cp\u003eShe might’ve muttered cheap bastard under her breath as she stomped away.\u003c/p\u003e\n\u003cp\u003eTruman laughed. “Well, you may not want them, but the strippers are still flocking to you.”\u003c/p\u003e\n\u003cp\u003e“Flocking,” he repeated with a laugh. “More like fleecing. Nothin’ more attractive than a drunk man with an open wallet.”\u003c/p\u003e\n\u003cp\u003e“Cynical.”\u003c/p\u003e\n\u003cp\u003e“I prefer to think of it as mature.”\u003c/p\u003e\n\u003cp\u003eDalton had fun providing running commentary to Truman as they watched the strippers working the room. At one point they were laughing so hard a couple guys still in line gave them dirty looks.\u003c/p\u003e\n\u003cp\u003eAfter about an hour, Truman picked up his glass. “How can this be magically full again?”\u003c/p\u003e\n\u003cp\u003eDalton squinted at the table in front of them after he saw a flash of green. Had that leprechaun chick been sneaking under the table and filling their glasses?\u003c/p\u003e\n\u003cp\u003e“What the fuck is in this drink?” Truman asked. “I swear I’ve had one and it feel like five. Shit. I’m buzzed.”\u003c/p\u003e\n\u003cp\u003e“Me too.”\u003c/p\u003e\n\u003cp\u003eTruman shoved the glass away. “Man. I gotta eat something and sober up. I’d never hear the end of it if I had to call my pregnant wife to haul my drunken ass home after a bachelor party.” He clapped Dalton on the shoulder. “Great seein’ you, McKay. I’m glad you’re sticking around.”\u003c/p\u003e\n\u003cp\u003eWhat? Wait. When had he said that?\u003c/p\u003e\n\u003cp\u003eMaybe he was drunker than he thought.\u003c/p\u003e\n\u003cp\u003eUsed to be Dalton loved the happy buzz he got after several drinks. The happy place where he knew the people around him were his true friends. The happy place where he knew the women were laughing at his jokes because he was one damn funny man. The happy place where he knew he’d found his place.\u003c/p\u003e\n\u003cp\u003eBut Dalton wasn’t feeling any of that now.\u003c/p\u003e\n\u003cp\u003eThis wasn’t who he was anymore.\u003c/p\u003e\n\u003cp\u003eAnd he couldn’t wait to get the hell out of here.\u003c/p\u003e\n\u003cp\u003eDalton ducked out of the backroom and into the hallway. He had to close one eye because everything was so blurry. He slumped against the wall.\u003c/p\u003e\n\u003cp\u003eFuck being drunk. He hated this. No fucking wonder he never did this stupid shit anymore.\u003c/p\u003e\n\u003cp\u003eHe patted his pocket and found his cell phone. By holding his phone right up to his face he could sort of read the names. Selecting the one he wanted, he poked the Call button. “Hey. Sorry to do this to you but I’m at the Golden Boot and I’m really drunk and I need a ride so can you come and get me right now please? Thanks.”\u003c/p\u003e\n\u003cp\u003eHe hung up and stumbled outside to wait for his ride.\u003c/p\u003e\n\u003cp\u003eThe caller ID on Rory’s phone read Sierra. ’Bout damn time that little shit called her. Rory answered with, “Lemme guess; boy troubles.”\u003c/p\u003e\n\u003cp\u003e“Fuck off,” Sierra said by way of greeting. “I don’t only call you when I’ve got guy problems.”\u003c/p\u003e\n\u003cp\u003e“Do too.”\u003c/p\u003e\n\u003cp\u003e“Do not. Anyway, it’s not my guy that’s giving me problems. It’s yours.”\u003c/p\u003e\n\u003cp\u003e“What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“I just got a phone call from Dalton. A very drunk Dalton. He’s at the Golden Boot and needs a ride home.”\u003c/p\u003e\n\u003cp\u003eRory frowned. “Why would he call you in Arizona to give him a ride home in Wyoming?” \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-35.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
