{"id":72208,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eGooseflesh broke out across her entire body and she released a soft moan.\u003c/p\u003e\n\u003cp\u003e“That moan drives me fucking insane. I wanna slip my hand under your skirt and finger you until you come. Then I’d lick that sweet cream from my fingers.”\u003c/p\u003e\n\u003cp\u003eRory turned her head to nuzzle his jaw. “Then I’d suck it from your tongue.” She actually felt his pulse jump.\u003c/p\u003e\n\u003cp\u003e“Jungle girl, we’re gonna rip each other to pieces when we’re alone.” His mouth grazed her ear. “And. I. Can’t. Fucking. Wait.” He punctuated each word with a kiss.\u003c/p\u003e\n\u003cp\u003eHer entire body hummed with anticipation.\u003c/p\u003e\n\u003cp\u003e“But I promised to feed you first, so let’s go.”\u003c/p\u003e\n\u003cp\u003eDalton clasped her hand and they climbed the stairs to the next level.\u003c/p\u003e\n\u003cp\u003eThe host escorted them to a private table in the corner with windows on both sides.\u003c/p\u003e\n\u003cp\u003eShe unrolled her silverware from her napkin and tried not to gawk. “This place is like…wow. Really upscale.”\u003c/p\u003e\n\u003cp\u003eDalton looked up from the menu. “Food looks good. Since this meal is on the house, have whatever you want.”\u003c/p\u003e\n\u003cp\u003eThe waiter delivered bottle of champagne and poured two flutes.\u003c/p\u003e\n\u003cp\u003eRory raised her glass. “To Dalton McKay’s poker face and his incredible luck at cards.” When he growled, she laughed. “Kidding. To your winning strategy.”\u003c/p\u003e\n\u003cp\u003eThey drank. Dalton refilled their glasses.\u003c/p\u003e\n\u003cp\u003eAs he contemplated the menu, Rory studied him. Candle glow looked amazing on him. He’d mussed up his hair during the games and she preferred that wild look. His full lips were pursed as if he was deep in thought. When he glanced up at her from beneath the brim of his black hat, she was struck anew by his rugged good looks. It’d taken him longer to grow into that handsome face, but man, was it worth the wait.\u003c/p\u003e\n\u003cp\u003e“Sugarplum, why’re you lookin’ at me like you’ve never seen me before?”\u003c/p\u003e\n\u003cp\u003e“Because you’re gorgeous. Every woman in this restaurant is staring at you. They’re wondering what you’re like in bed.”\u003c/p\u003e\n\u003cp\u003e“If there are women in here besides you, I didn’t notice.”\u003c/p\u003e\n\u003cp\u003eShe bit back a sigh and refused to let her cynical side get a foothold and warn her it was just another line.\u003c/p\u003e\n\u003cp\u003eDalton ordered the elk medallions with a wild mushroom and bourbon demi-glaze. Rory ordered the pumpkin ravioli in a sweet cream sauce.\u003c/p\u003e\n\u003cp\u003eAfter the waiter left, she glanced up at Dalton to see him staring at her with a decidedly predatory look. “What?”\u003c/p\u003e\n\u003cp\u003e“Think anyone would notice if you hiked up your skirt and crawled onto my lap?”\u003c/p\u003e\n\u003cp\u003e“Pretty sure the entire restaurant would notice.”\u003c/p\u003e\n\u003cp\u003e“I’m game.”\u003c/p\u003e\n\u003cp\u003e“Well, I’m not. I don’t want anyone to see how it is between us.”\u003c/p\u003e\n\u003cp\u003e“Because it’s special?” he prompted.\u003c/p\u003e\n\u003cp\u003e“Because it’s so scorching hot between us that watching might make their eyeballs explode.”\u003c/p\u003e\n\u003cp\u003eDalton smiled the wolfish gleam that turned the delicious curl of want inside her into a raging inferno.\u003c/p\u003e\n\u003cp\u003e“Stop that,” she hissed. “I am not gonna crawl on your cock and ride you like a pony.”\u003c/p\u003e\n\u003cp\u003e“Shame. Do I have other options?” He drained the champagne and poured more.\u003c/p\u003e\n\u003cp\u003e“Such as?”\u003c/p\u003e\n\u003cp\u003e“Watching you masturbate.”\u003c/p\u003e\n\u003cp\u003e“Right here, right now?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Are you drunk?” she demanded.\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eRory cocked her head. “Suppose I did spread my legs and slip my fingers into my cunt to get myself off. You’d still be hard and horny. How would you benefit?”\u003c/p\u003e\n\u003cp\u003eDalton plucked up her hand and rubbed the tips of his fingers on his lips. “The benefit for me is that you did what I told you. You have no idea how much I love watching you come. It’s even better—” he kissed her fingertips, “—and hotter when you do it for me.”\u003c/p\u003e\n\u003cp\u003e“Dalton, the list of things I won’t do with you or to you or have you do to me is pretty short. But I draw the line at diddling myself between courses in a four-star restaurant.”\u003c/p\u003e\n\u003cp\u003eThat aw-shucks grin appeared. “Worth a try.”\u003c/p\u003e\n\u003cp\u003eTempting to chuck a dinner roll at him but she resisted. “Can you dial back the I need to fuck your brains out vibe, please? At least while we’re enjoying this meal?” Her gaze took in every inch of his face. “It’s a nice change for us, being out on the town, dressed up and eating fancy food.”\u003c/p\u003e\n\u003cp\u003eHis eyes softened. “Baby, I’ll take you out for a nice dinner and show you off every night of the week if that’s what you want.”\u003c/p\u003e\n\u003cp\u003e“Not necessary. I want this night out with you. Celebrating you being the big money winner.”\u003c/p\u003e\n\u003cp\u003e“Deal.”\u003c/p\u003e\n\u003cp\u003eDuring dinner he entertained her with stories from his travels in Europe.\u003c/p\u003e\n\u003cp\u003eYet he didn’t dial down the sexual intensity completely. It buzzed between them, making her hyperaware of his every movement. His every breath. His every uncompromising stare.\u003c/p\u003e\n\u003cp\u003eAs Rory pondered dessert choices, she asked if he wanted to share. The molten look in his eyes when he murmured, “I’m havin’ you for dessert,” almost had her skipping the three layer chocolate cake with vanilla bean crème freche.\u003c/p\u003e\n\u003cp\u003eAlmost.\u003c/p\u003e\n\u003cp\u003eFloating on champagne, an amazing meal and a cup of strong coffee, Rory faced Dalton when he placed his hand in the small of her back as they left the restaurant.\u003c/p\u003e\n\u003cp\u003eHe lowered his head and she expected a gentle peck. But he consumed her mouth in a blistering kiss, revving that sexual need into overdrive. When he finally released her lips, she knew the buzz she felt was all from him.\u003c/p\u003e\n\u003cp\u003eThe elevator dinged and the doors slid open. As soon as the doors closed, Dalton shoved a keycard into the slot and they descended to the lowest level—which she remembered was not street level.\u003c/p\u003e\n\u003cp\u003e“Dalton—”\u003c/p\u003e\n\u003cp\u003eThen that avid mouth was on hers again. He’d crowded her into the corner with one hand gripping her hair and the other hand squeezing her hip.\u003c/p\u003e\n\u003cp\u003eBy the time the elevator stopped, her head spun, her heart raced, and the inside of her thighs were damp and sticky. He could get her hot and bothered in the span of two floors.\u003c/p\u003e\n\u003cp\u003eAfter the doors opened he hit the button sending it back up. The space was dark. The only illumination came from the glow of the exit signs.\u003c/p\u003e\n\u003cp\u003e“Where are we?”\u003c/p\u003e\n\u003cp\u003e“The extra gaming room in the basement. The casino only uses it when they run a big tournament. No cameras down here,” he said against her throat. His big body pushed her backward. “Jesus. I want you so fuckin’ bad I can’t even walk a straight line.”\u003c/p\u003e\n\u003cp\u003e“But how…” Rory moaned when his teeth skimmed the tendons straining in her neck.\u003c/p\u003e\n\u003cp\u003e“The head of hotel security owed me a favor.”\u003c/p\u003e\n\u003cp\u003eHer ass bumped into something solid and she stopped.\u003c/p\u003e\n\u003cp\u003eDalton said, “Hold on to me and hop up.”\u003c/p\u003e\n\u003cp\u003eOnce she was seated, she glanced down to see what she was seated on.\u003c/p\u003e\n\u003cp\u003eA table covered in green felt.\u003c/p\u003e\n\u003cp\u003eHe created space for himself between her thighs. “So fuckin’ hot in this skirt,” he hissed in her ear as he rolled it up to her hips. “Need to get under it, get in you, before I explode.”\u003c/p\u003e\n\u003cp\u003eSeeing Dalton this crazed to have her, feeling that pure sexual energy pulsing off him, made her wet, made her burn, made her brave. For him she could be the kinky girl who got fucked on a gaming table in the basement of a casino. In his eyes she was the red-hot lover that her lover couldn’t get enough of. She could prove she was the reckless woman who got off on getting her man off any time, any place.\u003c/p\u003e\n\u003cp\u003eHis lips danced across her skin, soft and wet and perfect. “I want you.” A soft pass. “But first I’m gonna eat my dessert.”\u003c/p\u003e\n\u003cp\u003e“How did you—” was all she managed before she found herself flat on her back—on a poker table!—with Dalton yanking her thong aside.\u003c/p\u003e\n\u003cp\u003eThen she didn’t give a rip where she was. Dalton’s mouth was licking her pussy, sucking every bit of juice from her swollen tissues. His growling moans vibrated against her flesh until that teasing tingle started behind her tailbone.\u003c/p\u003e\n\u003cp\u003eBut that wasn’t what she wanted or what he needed.\u003c/p\u003e\n\u003cp\u003eShe clapped her hands on his cheeks and pulled that skillful mouth off her. “I’m wet, you’re hard. Fuck me. Now.”\u003c/p\u003e\n\u003cp\u003eHis eyes glittered and he undid his belt. His jeans and boxers hit the tops of his boots. He gripped the insides of her thighs and shoved them wider apart.\u003c/p\u003e\n\u003cp\u003eThen he crammed his cock into her so fast and hard she arched off the table.\u003c/p\u003e\n\u003cp\u003e“Hold on,” he panted as he worked his cock in and out with long strokes. “Pull your shirt down so I can watch your tits bounce as I fuck you like this.”\u003c/p\u003e\n\u003cp\u003eRather than rip the buttons to do his bidding, Rory undid the buttons one at a time. “You like these?” She cupped her breasts and pushed them up, creating a deep line of cleavage.\u003c/p\u003e\n\u003cp\u003e“Yes,” he gritted out. His hips began doing that twisty thing as he pumped inside her. “Show me.”\u003c/p\u003e\n\u003cp\u003e“Huh-uh high roller. You wanna see ’em, free ’em yourself.”\u003c/p\u003e\n\u003cp\u003eDalton’s palms moved up her hips. Wearing the depraved grin that made her belly swoop, Dalton unhooked the first two hooks on the bustier before he tugged it down. Then her breasts were free, bouncing with abandon. “Fuck that’s hot.” He watched with a gleam in his eye, bottoming out on every thrust to make the flesh shake.\u003c/p\u003e\n\u003cp\u003e“I love the way you fuck me.”\u003c/p\u003e\n\u003cp\u003e“And what way is that?”\u003c/p\u003e\n\u003cp\u003e“However you want.”\u003c/p\u003e\n\u003cp\u003eKeeping his eyes on hers, Dalton bent forward and licked her nipple. Just one lash of his wet tongue. “Brace your hands above your head on the rail.”\u003c/p\u003e\n\u003cp\u003eAs soon as she did, his hand slid between her legs and he traced her slit from where his cock filled her to the fleshy folds of her pussy lips. He bit down on her nipple—the shock of pain immediately gave way to pleasure as the heat and wetness of his mouth surrounded the rock hard tip. He lifted his head, dark hair falling across his forehead in that untamed manner and his teeth hovered over her nipple. But the same time he bit down, he pinched her clit.\u003c/p\u003e\n\u003cp\u003eRory gasped as the orgasm came out of nowhere. Her clit throbbed beneath his pinching fingers; his sucking mouth was firmly latched onto her nipple as he fucked her into that white void of bliss. \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-40.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
