{"id":72173,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThose blue eyes turned shrewd. “But you weren’t happy. Addie and I weren’t a good match…why? Because she’s too good for me?”\u003c/p\u003e\n\u003cp\u003e“Fuck that. You two only ended up together because you were both lonely and wanted to end that loneliness. She’d felt that way a lot longer than you. She wanted to be a wife and a mother more than anything in the world. You offered it to her so she took it.” Immediately Rory regretted blurting that out. “Sorry.”\u003c/p\u003e\n\u003cp\u003e“Sorry because it’s true?”\u003c/p\u003e\n\u003cp\u003e“Maybe.” Rory exhaled. “Look, you should’ve been honest with her when you started having doubts.”\u003c/p\u003e\n\u003cp\u003eDalton laughed. A little hysterically.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Nothin’.”\u003c/p\u003e\n\u003cp\u003e“You insisted on this honesty thing, you damn well better stick to it.”\u003c/p\u003e\n\u003cp\u003eHis blue eyes were fierce when he got in her face. “I had worries, not doubts, certainly not flat-out what the fuck am I doin’ thoughts prior to putting on my tuxedo last Saturday morning. I didn’t feel that doubt, that absolute wrongness of standing in front of a minister, about to promise my devotion and my life to the wrong woman until…”\u003c/p\u003e\n\u003cp\u003eRory didn’t back down and she wouldn’t let him either. “Until…?”\u003c/p\u003e\n\u003cp\u003e“Until I looked across the altar and saw you.”\u003c/p\u003e\n\u003cp\u003eEvery molecule of air left her body.\u003c/p\u003e\n\u003cp\u003e“In that moment I knew marrying her would be the biggest mistake of my life. Don’t insult me and pretend you didn’t feel it when I looked at you, Rory.”\u003c/p\u003e\n\u003cp\u003eShe’d felt it. Everything she’d ever wanted from him had been right there in his eyes…as he was about to marry her best friend.\u003c/p\u003e\n\u003cp\u003e“Since I’ve had several days to do nothin’ but think about this fucking mess, I realized if you’d been here instead of in South America, I never would’ve proposed to her.”\u003c/p\u003e\n\u003cp\u003e“Omigod. You are not seriously blaming this on me, Dalton McKay.”\u003c/p\u003e\n\u003cp\u003e“I’m saying if you’d been around I would’ve been reminded.”\u003c/p\u003e\n\u003cp\u003e“Of what? Of all the great times we’ve had together in the last six years? Let’s not forget all the shitty things that you’ve done to me—”\u003c/p\u003e\n\u003cp\u003eDalton grabbed her upper arms and yanked her closer. “Shitty things we’ve done to each other. You’re not completely blameless in this, Rory.”\u003c/p\u003e\n\u003cp\u003eShe hated the truth in that statement. He’d acted; she’d reacted. She closed her eyes. “Stop. Let go of me, Dalton.”\u003c/p\u003e\n\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“Why do we keep doing this to each other? You should’ve just married her and we’d be done with this.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“No, goddammit, look at me.”\u003c/p\u003e\n\u003cp\u003eRory lifted her chin and met his gaze.\u003c/p\u003e\n\u003cp\u003e“I’ve got no idea on how to make this right. It’s all too…raw right now.” His eyes were filled with anguish. “I won’t compound the problem and ruin a friendship between you and Addie by asking you to be with me here. Even when that’s what I want.” He reached for her ponytail, sifting the long strands through his fingers. “It’s what I’ve always wanted.”\u003c/p\u003e\n\u003cp\u003e“Don’t do this to me.”\u003c/p\u003e\n\u003cp\u003e“I can’t help it.”\u003c/p\u003e\n\u003cp\u003e“I can’t be with you anyway. My life is in Laramie, not here. I’ve got two years left before I get my master’s degree. I’ve busted my ass my entire academic life to get to this point.”\u003c/p\u003e\n\u003cp\u003e“What then?”\u003c/p\u003e\n\u003cp\u003e“I don’t know where I’ll be when I’m done with school. But I know exactly where you’ll be.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“Right here.”\u003c/p\u003e\n\u003cp\u003e“Don’t be so sure of that.”\u003c/p\u003e\n\u003cp\u003eNow Rory knew he was bullshitting her. His McKay roots were sunk deep in ranching, his family and Wyoming. He’d never leave.\u003c/p\u003e\n\u003cp\u003eExcept…last time they’d crossed paths, he’d mentioned feeling untethered. She thought he’d found an anchor in Addie. But now he made it sound like she—Aurora Rose Wetzler—was the missing piece in his life.\u003c/p\u003e\n\u003cp\u003eDon’t get your hopes up.\u003c/p\u003e\n\u003cp\u003eConfused by his mixed signals and the stupid girlish hope that things would work out between them like they were supposed to, she scooted off the rock.\u003c/p\u003e\n\u003cp\u003e“Rory. Don’t go.”\u003c/p\u003e\n\u003cp\u003e“I can’t stay here with you, Dalton. I need…time.”\u003c/p\u003e\n\u003cp\u003e“I get that. When can we talk again?”\u003c/p\u003e\n\u003cp\u003e“I leave for Laramie on Sunday.”\u003c/p\u003e\n\u003cp\u003eShe started up the path toward her house.\u003c/p\u003e\n\u003cp\u003e“Don’t leave things like this. Please.”\u003c/p\u003e\n\u003cp\u003eWhen had Dalton McKay ever said please? She found herself stopping and facing him. “When do you want to talk?”\u003c/p\u003e\n\u003cp\u003e“Come by my house tomorrow night. We’ll figure it out this time. I swear.”\u003c/p\u003e\n\u003cp\u003eBut she’d showed up to find him gone. No note. No text. No nothing. Just…gone.\u003c/p\u003e\n\u003cp\u003eAnd he’d stayed gone for over three years.\u003c/p\u003e\n\u003cp\u003eShe’d been right not to trust him, not to pin her hopes on that one perfect moment they’d shared—because maybe it hadn’t been as perfect as she’d remembered.\u003c/p\u003e\n\u003cp\u003eQuestion was: what did he want from her now?\u003c/p\u003e\n\u003cp\u003eChapter Three\u003c/p\u003e\n\u003cp\u003eDalton had agreed to meet his brothers at Brandt and Jessie’s place. Things had been strained between them at the rehab hospital the previous afternoon. They hadn’t recognized him at first, and then they’d given him a rash of crap about turning into a Montana mountain man. There’d been a thread of unease in all their conversations, so it’d be interesting to see if they’d hide their hostility when they weren’t in public or whether they’d toss it down like a gauntlet.\u003c/p\u003e\n\u003cp\u003eA few things had changed at Brandt and Jessie’s house. A jungle gym, a tree house and a swing set were situated behind a new two car garage. A line of trees had been planted on the left side of the house. The expanded garden was enclosed by a five-foot-high fence. The improvements over the years allowed Dalton to forget he’d been raised here. Much happier memories were being made in the house these days.\u003c/p\u003e\n\u003cp\u003eTell’s truck was parked next to Brandt’s. An SUV, probably Georgia’s, was lined up behind it.\u003c/p\u003e\n\u003cp\u003eFor some reason Dalton’s gut knotted climbing the steps.\u003c/p\u003e\n\u003cp\u003eJessie opened the door and threw herself into his arms. “Dalton McKay, I was beginning to wonder if you’d ever come home.” She squeezed him tightly—as if she really was happy to see him. When she pulled back, she hastily wiped her tears.\u003c/p\u003e\n\u003cp\u003eHis stomach dropped. “Jess—”\u003c/p\u003e\n\u003cp\u003e“He missed you, okay?” she whispered. “We all did. It’s been harder on him than he’ll ever admit. Yes, we have our own family now, but that doesn’t mean you aren’t…” She stopped. Inhaled. Smiled. “Sorry. Too soon for this.” She reached up and ruffled his beard. “Brandt warned me, but it in no way prepared me for how different you look.”\u003c/p\u003e\n\u003cp\u003e“Grizzly Adams is one of the least offensive comparisons that’ve been made,” he said dryly.\u003c/p\u003e\n\u003cp\u003e“Come in. We’re all bustin’ our buttons for you to meet the newest McKays.”\u003c/p\u003e\n\u003cp\u003eDalton wiped off his boots and shrugged out of his Carhartt jacket. When he looked up, he saw Tell with a black-haired boy cocked on his hip.\u003c/p\u003e\n\u003cp\u003e“Jackson, that’s your Uncle Dalton. You wanna go say hi?”\u003c/p\u003e\n\u003cp\u003eJackson yelled, “No!”\u003c/p\u003e\n\u003cp\u003e“Our two-year-old’s favorite word,” Georgia said behind him.\u003c/p\u003e\n\u003cp\u003eHe turned and grinned at his pregnant sister-in-law. “Is it my brother’s goal to keep you knocked up?”\u003c/p\u003e\n\u003cp\u003eGeorgia hugged him. “It’s a McKay plot, since Jess has another bun in the oven too.”\u003c/p\u003e\n\u003cp\u003e“Holy sh…shoot.” He glanced over at his brother and sis-in-law. “Congrats.”\u003c/p\u003e\n\u003cp\u003eThen two boys raced into the room and Jackson squealed to be let down. They skidded to a stop in front of Dalton. Hard to believe the last time he’d seen Tucker the kid had just started walking. He’d never met Wyatt, Brandt and Jessie’s two-and-a-half-year-old son. Tucker looked like Brandt, dark-haired and stocky. Wyatt had lighter hair and Jessie’s hazel eyes. They didn’t look like brothers.\u003c/p\u003e\n\u003cp\u003eThat thought sliced him to the bone because everyone used to say that about him and his brothers.\u003c/p\u003e\n\u003cp\u003eNot the time nor the place to think about this.\u003c/p\u003e\n\u003cp\u003eHe crouched down. “Hey, guys.”\u003c/p\u003e\n\u003cp\u003eJackson joined his cousins in staring at Dalton.\u003c/p\u003e\n\u003cp\u003e“Why you got that long beard?” Tucker asked. “You hidin’ scars on your face or something?”\u003c/p\u003e\n\u003cp\u003eDalton tried not to laugh when he heard Jessie’s sharp, “Tucker McKay, you will apologize to your uncle right now.”\u003c/p\u003e\n\u003cp\u003e“Sorry.” But Tucker’s narrowed gaze took in every inch of Dalton’s face like he was checking for evidence.\u003c/p\u003e\n\u003cp\u003e“I don’t s’pose you remember me,” Dalton asked. “I used to babysit you sometimes.”\u003c/p\u003e\n\u003cp\u003eTucker shook his head.\u003c/p\u003e\n\u003cp\u003e“Uncle Dalton sent you the rhinoceros horn, the maracas and the stuffed toy elk,” Jessie prompted.\u003c/p\u003e\n\u003cp\u003e“Really? That was you?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Where’d you get all that stuff?”\u003c/p\u003e\n\u003cp\u003e“Picked it up in my travels.”\u003c/p\u003e\n\u003cp\u003e“Cool. Did you give Wyatt that stuffed grizzly bear?”\u003c/p\u003e\n\u003cp\u003e“Yes sir. And I gave you—” he poked Jackson in the belly, “—the stuffed buffalo.”\u003c/p\u003e\n\u003cp\u003eJackson blinked at him. Up close the kid was a perfect mix of Tell and Georgia. Black hair, icy blue eyes.\u003c/p\u003e\n\u003cp\u003e“Why’re you here?” Tucker asked.\u003c/p\u003e\n\u003cp\u003e“Because Grandpa is in the hospital,” Brandt said.\u003c/p\u003e\n\u003cp\u003e“Are you really my dad’s brother?”\u003c/p\u003e\n\u003cp\u003e“I really am. I’m Uncle Tell’s brother too.”\u003c/p\u003e\n\u003cp\u003e“Not the one who died. That’s Landon’s dad, Luke.” He frowned. “How come I don’t remember you?”\u003c/p\u003e\n\u003cp\u003e“I’ve been gone a while.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eJesus. Did this kid ever stop asking questions? \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-5.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
