{"id":72218,"no":50,"title":"Page 50","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I guess.” He signaled to the waitress. He’d been in here enough times the past few weeks that she knew what he wanted. She slid a plate of warm bread pudding in front of Dalton and poured Cord and Colt each a cup of coffee.\u003c/p\u003e\n\u003cp\u003e“So what’s up?”\u003c/p\u003e\n\u003cp\u003e“We owe you an apology.”\u003c/p\u003e\n\u003cp\u003eThat’d come out quick. But his cousins weren’t the type to beat around the bush. Dalton sliced off a chunk of dessert and popped it in his mouth.\u003c/p\u003e\n\u003cp\u003eColt said, “Neither of us handled the news about your plans in the best way. I’d blame my reaction on booze except I don’t drink.”\u003c/p\u003e\n\u003cp\u003eDalton snorted.\u003c/p\u003e\n\u003cp\u003e“So bein’ an asshole is all on me, cuz, and I am sorry for that,” Colt said.\u003c/p\u003e\n\u003cp\u003e“While I still don’t agree with what you’re doin’ as far as applying for an elk farm permit for land that borders our ranch land, it don’t excuse me bein’ a dick to you.”\u003c/p\u003e\n\u003cp\u003e“It happens.”\u003c/p\u003e\n\u003cp\u003e“Happens a lot, according to my son,” Cord grumbled.\u003c/p\u003e\n\u003cp\u003e“Kyler said that?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Cord pushed his hat up and looked at him. “Kid’s got a case of hero worship since he’s been helpin’ you. So when he overheard me’n AJ talkin’ about what’d happened after the poker game, he lit into me. Jesus. Said I was a hypocrite and if I took issue when someone tried to tell me what I could do on my land, then I had no right to tell you what to do with yours.”\u003c/p\u003e\n\u003cp\u003eDalton bit back a smile.\u003c/p\u003e\n\u003cp\u003e“And rather than waitin’ to see if he’d made his point with me, he kept goin’. So in addition to bein’ a hypocrite, I’m a controlling asshole who doesn’t remember what it’s like to be young. Or what it’s like to want to do something besides bein’ a rancher.”\u003c/p\u003e\n\u003cp\u003e“Ouch. How’d you handle that?”\u003c/p\u003e\n\u003cp\u003eCord sighed. “Not well. But that’s pretty much par for the course between me’n Ky these days. Half the time I wanna throttle him.”\u003c/p\u003e\n\u003cp\u003e“And the rest of the time?”\u003c/p\u003e\n\u003cp\u003e“I want to make the most of the two years we’ve got left before he heads off to college because it doesn’t seem that long ago he was five and he hero worshipped me.”\u003c/p\u003e\n\u003cp\u003e“He’s a good kid, Cord. At least he ain’t afraid to voice his opinion to you.”\u003c/p\u003e\n\u003cp\u003eColt nudged Cord. “Getting off the subject.”\u003c/p\u003e\n\u003cp\u003eDalton shrugged. “It’s probably a more productive subject for us anyway. Not that I’m one to offer up any advice about father-son relations.”\u003c/p\u003e\n\u003cp\u003e“No change with Casper?” Cord asked.\u003c/p\u003e\n\u003cp\u003eThe man is incapable of change. “Nope.”\u003c/p\u003e\n\u003cp\u003e“That’s gotta be hard on you guys. But I know Brandt and Tell are glad to have you back.” Colt sipped his coffee. “Man, did they lay into us. Between them and Kane and Kade tossing in their two cents’ worth I felt about an inch high by the time they finished with me.”\u003c/p\u003e\n\u003cp\u003e“Me too,” Cord added. “Though I’m pretty sure Tell was jokin’ when he suggested we write our apology in blood.”\u003c/p\u003e\n\u003cp\u003e“Is that why you’re here?” Dalton asked suspiciously. “Because my brothers demanded it?”\u003c/p\u003e\n\u003cp\u003eColt laughed. “Take it down a notch. We’re apologizing because we said a buncha shit to you that was wrong. Colby would’ve come too but he got waylaid.”\u003c/p\u003e\n\u003cp\u003e“Letting something fester ain’t good. Best to get this out in the open, deal with it and move on,” Cord said.\u003c/p\u003e\n\u003cp\u003e“Along those lines, Ben said to tell you that the two of you are squared up now. Something about you both bein’ dumbasses that overreact?” Colt looked at him. “Does that make any sense to you?”\u003c/p\u003e\n\u003cp\u003e“Yeah, it does.”\u003c/p\u003e\n\u003cp\u003eCord raised an eyebrow but didn’t ask specifics. “So on certain points of this issue, we’ll agree to disagree for the time bein’.”\u003c/p\u003e\n\u003cp\u003e“Agreed. I appreciate the olive branch.”\u003c/p\u003e\n\u003cp\u003e“So we’re cool then?” Colt asked.\u003c/p\u003e\n\u003cp\u003eDalton grinned. “At least until the next poker game and you guys are pissed off that I cleaned you out again.”\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Three\u003c/p\u003e\n\u003cp\u003eSeething, Rory sat in the WNRC truck and beat her hands on the steering wheel, punctuating each, “sonuvabitching, motherfucking cocksucking goddamned asshole” with another smack of her hands. When she missed and hit the horn, she scared herself so bad she screamed.\u003c/p\u003e\n\u003cp\u003eOkay. Enough. Breathe. Focus on deep cleansing breath in, negative energy out.\u003c/p\u003e\n\u003cp\u003eRory closed her eyes. Inhale one, two, three…hold. Exhale one, two, three. Again. Three more cycles and she should’ve been calmer. She shouldn’t have been thinking, fucking know-it-all asswipe douchebag and imagining clipping him with the four-wheeler so hard he tumbled into the ravine.\u003c/p\u003e\n\u003cp\u003eShe really, really, really fucking hated her job today.\u003c/p\u003e\n\u003cp\u003eUp at the crack of dawn, hauling an ATV on back roads two hours away. Only to be confronted by a foul-tempered, big-mouthed, sexist, ageist, government-hating rancher who spewed vitriol from the moment she’d opened the pickup door until three hours later when she’d finished the survey of his land for the proposed elk farm permit.\u003c/p\u003e\n\u003cp\u003eAnd to top it off, the smug man had only applied for the permit to fuck with the “useless, liberal-leaning, pseudo-regulatory agency” that she worked for.\u003c/p\u003e\n\u003cp\u003eThe trip was an entire waste of her day. She could’ve checked out three other proposed landowner sites, but no, she had to give each permit equal consideration. Even those who openly professed they were dicking with her.\u003c/p\u003e\n\u003cp\u003eRory had half a mind to report the jerk-off to the brand board for improper tagging or to the Wyoming Livestock Board, aka—the Wyoming CDC-cow disease control—for possible foot and mouth disease.\u003c/p\u003e\n\u003cp\u003eSucked that she was too…honest to do it. Sometimes she wished she could just be a devious, coldhearted, vengeful bitch.\u003c/p\u003e\n\u003cp\u003eWho was she kidding? She couldn’t even be honest with herself. What happened to her plan of indulging in the most amazing sex in the history of mankind with sex god Dalton McKay and not falling for him?\u003c/p\u003e\n\u003cp\u003eShe was so so so screwed.\u003c/p\u003e\n\u003cp\u003eBerating herself wasn’t helping. She needed a physical activity that’d burn off this negativity. Too bad she couldn’t chop wood. That always worked off a good mad. But her mom had replaced the wood stove in the cabin with electric heat.\u003c/p\u003e\n\u003cp\u003eNot enough snow to shovel.\u003c/p\u003e\n\u003cp\u003eShe could take Jingle for a run. Except Rory didn’t run—ever—and Jingle preferred to sit on the couch like a pampered pooch.\u003c/p\u003e\n\u003cp\u003eYoga…for being a great workout, her mind needed stimulation, not serenity.\u003c/p\u003e\n\u003cp\u003eRory could tag Vanessa and see if she was up for booty-shaking at the Back Porch, the college dance bar in Spearfish. But then she’d be tempted to drink and she had to get up early tomorrow and face another angry rancher or three.\u003c/p\u003e\n\u003cp\u003eWait. Wasn’t a Zumba class offered at the community center tonight? The body-pumping, sweating action with loud music blocking out all her crappy, crabby thoughts was exactly what she needed.\u003c/p\u003e\n\u003cp\u003eShe parked the truck and trailer in the fenced-in lot at the WNRC and hopped in her Jeep. Since she had her gym bag with her workout clothes she drove straight to the community center.\u003c/p\u003e\n\u003cp\u003eThe class was jammed with women of all ages. The mood in the big gymnasium buzzed with high energy even before the class started.\u003c/p\u003e\n\u003cp\u003eRory wasn’t familiar with the routines so she picked a spot in the very back of the room. When Heather, the class leader, bounded in, headset on, hands clapping in the air, the room went wild.\u003c/p\u003e\n\u003cp\u003eHuh. She never got that kind of reaction at the start of yoga class. Then again, Heather was one of those itty bitty pocket-sized women—five foot one, ninety pounds of solid muscle, gleaming red hair, alabaster skin, infectious smile. Rory could hate high-energy Heather if she wasn’t the most genuinely sweet person she’d ever met.\u003c/p\u003e\n\u003cp\u003e“All right, ladies! Let’s get this party started. And pay attention because I’m gonna sneak in some new dance moves.”\u003c/p\u003e\n\u003cp\u003eThe music blared from the speakers and bodies started gyrating to the beat.\u003c/p\u003e\n\u003cp\u003eForty-five minutes later, Rory was sweaty, gasping for breath and much happier. As she waited in line at the drinking fountain, laughing with other class members, her yoga student Ricki nudged her. “Don’t turn around, but that guy who came to your yoga class that one time is here.”\u003c/p\u003e\n\u003cp\u003e“Dalton?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. And if his eyes could talk they’d be yelling at you to strip and get on all fours.”\u003c/p\u003e\n\u003cp\u003e“Ricki!”\u003c/p\u003e\n\u003cp\u003e“I’m serious. He hasn’t taken his eyes off you—I mean off your butt—since the moment I saw him. With the way some of the women were looking at the doorway the last ten minutes of class, he must’ve been standing there watching you then.”\u003c/p\u003e\n\u003cp\u003e“Why were women turning around?”\u003c/p\u003e\n\u003cp\u003e“Duh. Because the man is sex on legs. And he’s wearing a skintight wife beater and my god, have you seen his freakin’ chest and arm muscles? What does he do for a living? Lift cars?”\u003c/p\u003e\n\u003cp\u003e“No, he lifts logs, actually.”\u003c/p\u003e\n\u003cp\u003eRicki’s eyes widened. “You know him?”\u003c/p\u003e\n\u003cp\u003eRory mopped her face with her towel. “Yep. I’m sleeping with him.”\u003c/p\u003e\n\u003cp\u003e“I kinda hate you a little bit right now.”\u003c/p\u003e\n\u003cp\u003eShe laughed. She took several long drinks of water before she walked over to where she’d left her gym bag. Knowing Dalton’s gaze was on her, she twisted her shoulders as if working out some kinks in her neck. Then she set her hands on her hips and slowly leaned forward, until the top of her head touched the floor. Hanging upside down, Rory sent him a look that said, baby, I’d love to work out some kinks with you.\u003c/p\u003e\n\u003cp\u003eThe depraved man grinned at her and crooked his finger.\u003c/p\u003e\n\u003cp\u003eSo, yeah, maybe she added an extra sway of her hips as she sauntered over to him. And maybe she hooked her arm around his neck and gave him a big smacking kiss in front of everybody, her he’s mine vibe readily apparent.\u003c/p\u003e\n\u003cp\u003eDalton’s blue eyes shone with male amusement. “Kiss me again. I don’t think those two women in the corner quite got the message that you’n me are a couple.”\u003c/p\u003e\n\u003cp\u003e“Gladly.” This time she hooked the towel around his neck and tugged him closer, her mouth snaring his in a steamy kiss. \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-50.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
