{"id":72233,"no":65,"title":"Page 65","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNow that made Dalton smile. “You didn’t.”\u003c/p\u003e\n\u003cp\u003e“I did. He lost his mind and the restaurant manager had to intervene. I left. I let Casper stew on that for a few weeks. Petty thing to do, but it gave me a sense of satisfaction and I was able to overcome a few blocks I had with the situation. I did show up at his church a couple times a year, just to be ornery, just to watch him squirm.”\u003c/p\u003e\n\u003cp\u003e“God, Ma. I love you.”\u003c/p\u003e\n\u003cp\u003eShe smiled. “Good to hear. So you might think after Tell told me this last bullshit manipulative lie your father spewed I would’ve confronted him. But this time I didn’t.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because that’s what the man wanted and I wouldn’t give him the pleasure. You didn’t give it to him either. Isn’t it pathetic he’s been waiting over three years for the fallout to begin? He died disappointed and alone and maybe it makes me a horrible human being to say this, but I can’t think of any man who deserves it more.”\u003c/p\u003e\n\u003cp\u003eDalton watched her chin tremble and he picked up her hand. “But?”\u003c/p\u003e\n\u003cp\u003e“But as much as I hate him and what he’s done, if not for him…I wouldn’t have my sons. My wonderful sons. You boys are the light in my life and living proof that genes don’t matter. You’re all fine examples of good men, and that’s a miracle to me because you didn’t have that example growing up. You became who you are in spite of your genes and I couldn’t be prouder.” She sniffled. “And today, I couldn’t be sadder that your father died without really knowing any of you. Really sad because that was his choice.”\u003c/p\u003e\n\u003cp\u003eThey stayed like that for a while. Not speaking, just holding hands, lost in their own thoughts.\u003c/p\u003e\n\u003cp\u003eFinally Dalton said, “Were you with Brandt and Tell tonight?”\u003c/p\u003e\n\u003cp\u003e“For a little while.”\u003c/p\u003e\n\u003cp\u003e“How are they?”\u003c/p\u003e\n\u003cp\u003e“Surrounded by their wives and kids.”\u003c/p\u003e\n\u003cp\u003e“They’re lucky.” He shook his head and drained his booze, shoving the glass aside. “Not lucky. They worked to have the lives they’ve got. I’m happy for them.”\u003c/p\u003e\n\u003cp\u003e“There’s room for you in all their lives. In mine too. We missed you, but we’re all very glad you’re back home.” She stood. Wobbled. Laughed and sat back down. “I think I’ve had a little too much.”\u003c/p\u003e\n\u003cp\u003e“Probably. You oughten be drivin’. Where are you staying tonight?”\u003c/p\u003e\n\u003cp\u003eHis mom looked confused. “Hadn’t really thought about it.”\u003c/p\u003e\n\u003cp\u003e“So crash here. I’d like the company.”\u003c/p\u003e\n\u003cp\u003eTears swam in her eyes. “I’d like that too.”\u003c/p\u003e\n\u003cp\u003eDalton picked up the bottle of booze. “But we’re putting a lid on the truth serum.”\u003c/p\u003e\n\u003cp\u003eShe stretched out on the couch.\u003c/p\u003e\n\u003cp\u003e“Ma. I don’t expect you to sleep on the couch. You can have my bed.”\u003c/p\u003e\n\u003cp\u003e“I’m fine here. I prefer it actually. That way when I can’t sleep I’ll have more room to pace.”\u003c/p\u003e\n\u003cp\u003eHe probably wouldn’t sleep much either.\u003c/p\u003e\n\u003cp\u003eAfter he’d brought her a pillow and a blanket, she asked, “Did the truth set you free?”\u003c/p\u003e\n\u003cp\u003e“No. But it hasn’t weighed me down, either.”\u003c/p\u003e\n\u003cp\u003e“I can live with that.”\u003c/p\u003e\n\u003cp\u003eHe could too.\u003c/p\u003e\n\u003cp\u003eJingle barked like crazy and jumped off the bed, growling as she raced to the front door.\u003c/p\u003e\n\u003cp\u003eRory sat up and squinted at the clock. Midnight. Sometimes turkey or deer would trip Jingle offline, but the barks were a sharp warning, which meant a person, not an animal was outside the house.\u003c/p\u003e\n\u003cp\u003eJust as Rory reached for her handgun in the nightstand drawer, Jingle’s barks turned into happy yips and she knew her late night caller was Dalton.\u003c/p\u003e\n\u003cp\u003eHe’d left Carson and Carolyn’s house without a word to her. As helpless as she’d felt, as much as she’d ached to comfort him, she had no idea how to go about it, so she’d left him alone. The last thing Rory wanted was to intrude on his grief.\u003c/p\u003e\n\u003cp\u003eShe hadn’t heard from him yesterday at all.\u003c/p\u003e\n\u003cp\u003eShe remained in bed, listening to his deep voice as he talked to Jingle. The cupboard door squeaked. The man was such a sucker, spoiling the dog with treats. In the small entryway she heard the thump thump of Dalton’s boots hitting the floor. The faucet turning on and off. The gnawing sound of Jingle attacking her rawhide chew.\u003c/p\u003e\n\u003cp\u003eFootsteps moved closer, stopping at the edge of the bed. The rustle of clothes being removed. The mattress dipped and that warm, hard male body spooned in behind her, pulling her close.\u003c/p\u003e\n\u003cp\u003eHe sighed.\u003c/p\u003e\n\u003cp\u003e“You know, you’re ruining Jingle’s killer instincts. She was ready to tear your leg off to protect me.”\u003c/p\u003e\n\u003cp\u003e“Which is why I rewarded her with a treat for bein’ your badass protector when I’m not around.” He kissed the back of her head. “Sorry if I woke you. I just…”\u003c/p\u003e\n\u003cp\u003e“Dalton. It’s okay.”\u003c/p\u003e\n\u003cp\u003eAfter a long while, he said, “I couldn’t sleep.”\u003c/p\u003e\n\u003cp\u003e“That’s understandable.”\u003c/p\u003e\n\u003cp\u003e“I thought I wanted to be alone.”\u003c/p\u003e\n\u003cp\u003e“Also understandable. I imagine it’s been rough.”\u003c/p\u003e\n\u003cp\u003eThat’s when he pulled away from her. He rolled over and sat on the edge of the bed.\u003c/p\u003e\n\u003cp\u003eRory saw him hunched over, his head in his hands. Was Dalton…crying? She pushed to her knees and moved in behind him, pressing her face into the back of his neck and wrapping her arms around him.\u003c/p\u003e\n\u003cp\u003eBut he wasn’t crying.\u003c/p\u003e\n\u003cp\u003e“I don’t know how to do this, Rory.”\u003c/p\u003e\n\u003cp\u003e“Do what?”\u003c/p\u003e\n\u003cp\u003e“Grieve him,” he said softly.\u003c/p\u003e\n\u003cp\u003eHer chest tightened. Her throat constricted.\u003c/p\u003e\n\u003cp\u003e“I don’t know if I can. That makes me a cold goddamn bastard. Even after all the shit he did I never wished for him to die. But now that he’s dead and buried, I still don’t feel anything. No relief, no remorse, not even a tiny kernel of happiness that I’ll never have to deal with him again. Makes me sound fucking heartless. But at least if I was gloating or angry that nothin’ ever got resolved between us I’d feel something.”\u003c/p\u003e\n\u003cp\u003eShe squeezed her eyes shut. Hurting for this man on more levels than she could possibly fathom.\u003c/p\u003e\n\u003cp\u003e“The worst part is I never held out hope there’d be reconciliation. I wouldn’t have believed him if he’d tried to make amends with me. How fucking sad is that?” He shoved his hand through his hair. “That movie mindset is fucking with my head in a bad way. Where there’s some kind of deathbed apology, confession, whatever, where all the past issues are resolved, where forgiveness is offered and accepted, where everyone has a good cry and the person who wronged you your whole life drifts off, finally at peace. Real life ain’t so tidy. People die and shit doesn’t get resolved. And the person who doesn’t deserve the peace is the person who’s dead. The living are the ones who need it.”\u003c/p\u003e\n\u003cp\u003eRory tilted her head and wiped her tears on the sleeve of her nightgown. Dalton didn’t need her tears. He needed her strength.\u003c/p\u003e\n\u003cp\u003eHe shivered. Then he tried to shake her off. “Sorry. You don’t need me showing up at midnight and laying all this bullshit on you.”\u003c/p\u003e\n\u003cp\u003e“Stop apologizing.” She tried to tug him back into bed but he wouldn’t budge. She tugged harder. “Come here.”\u003c/p\u003e\n\u003cp\u003e“Rory—”\u003c/p\u003e\n\u003cp\u003e“Get under the covers with me. You’re freezing.”\u003c/p\u003e\n\u003cp\u003e“I should go.”\u003c/p\u003e\n\u003cp\u003e“No. You should stay with me. I’ve missed you.” She squeezed him hard. “Please.”\u003c/p\u003e\n\u003cp\u003eAfter a few beats, he said, “Okay.”\u003c/p\u003e\n\u003cp\u003eRather than snuggling into him like she usually did, she propped herself up on the pillows and brought his head against her chest.\u003c/p\u003e\n\u003cp\u003eWhen Dalton curled into her completely, she briefly squeezed her eyes shut to stem the tears.\u003c/p\u003e\n\u003cp\u003eShe sifted her fingers through his hair. Petting him. Soothing him. Trying to comfort him.\u003c/p\u003e\n\u003cp\u003eDalton pressed a soft kiss on the top of her breast. “Thank you.” Finally his big body relaxed. His breathing turned slow and steady.\u003c/p\u003e\n\u003cp\u003eRory couldn’t get to sleep. She’d been tossing and turning before he’d showed up. Wondering how she’d tell him she’d be gone all this week.\u003c/p\u003e\n\u003cp\u003eWhat kind of woman left her lover alone to deal with his grief just a few days after he’d buried his father?\u003c/p\u003e\n\u003cp\u003eShe’d debated on postponing the in-person interviews she’d scheduled, but she’d opted to keep the appointments. She’d waited for nine months for these opportunities so no way could she afford to pass them up.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Nine\u003c/p\u003e\n\u003cp\u003eThe call from Tell the following week asking Dalton to come over wasn’t posed as a request. Or maybe he’d misunderstood. Seemed he’d been doing that a lot these days.\u003c/p\u003e\n\u003cp\u003eThe weather was crappy. Blowing snow that cut visibility to a few feet out on the road. Took him fifteen minutes longer to reach Tell and Georgia’s place than it should have.\u003c/p\u003e\n\u003cp\u003eHe entered the screened entryway and brushed the snow pellets off his outerwear before he hung up his duster. He automatically kicked off his boots. He glanced up to see Georgia standing in front of the glass door that connected the house and the entryway.\u003c/p\u003e\n\u003cp\u003eShe smiled and opened the door, standing back so her baby bump wasn’t in the way. “Glad you made it. Looks like it’s getting worse.”\u003c/p\u003e\n\u003cp\u003e“It is. I left Sundance forty minutes ago.”\u003c/p\u003e\n\u003cp\u003e“The good news is we’ve got food, drink and an extra bed if you get stuck here.” She playfully pushed him. “Oh, don’t look so horrified. Might be fun.”\u003c/p\u003e\n\u003cp\u003eThey walked through the kitchen into the living room.\u003c/p\u003e\n\u003cp\u003eBrandt and Tell sat on opposite ends of the sofa watching TV. “Hey, bro. Come check this out. It’s so bad out there we made the national news.”\u003c/p\u003e\n\u003cp\u003e“Uh, yeah, I know. I was just out in it.”\u003c/p\u003e\n\u003cp\u003e“They’re advising no travel,” Brandt said.\u003c/p\u003e\n\u003cp\u003eHe stared hard at his brothers. “And yet you insisted I haul ass over here right away, in a freakin’ blizzard?”\u003c/p\u003e\n\u003cp\u003e“Yep. Cause we’re supposed to get ten more inches,” Tell said. “Checkin’ cattle is gonna suck. Good thing we’ve got an extra pair of hands.” \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-65.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
