{"id":72236,"no":68,"title":"Page 68","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Rory?”\u003c/p\u003e\n\u003cp\u003eShe glanced at her mom. “Sorry I’m a little spacey.”\u003c/p\u003e\n\u003cp\u003e“It’s okay. I want you to do what makes you happy, sweetheart. Wherever that may be and whoever you might be with.”\u003c/p\u003e\n\u003cp\u003e“Meaning…you don’t think Dalton—”\u003c/p\u003e\n\u003cp\u003e“What matters is what you think. But more importantly, it matters what you do.” Her mom grabbed the empty bottles and stood. “One thing’s for sure, you’ll have plenty of time to think about it with all the time you’ll spend in the car the next few days.”\u003c/p\u003e\n\u003cp\u003e“Thanks Mom.”\u003c/p\u003e\n\u003cp\u003e“Anytime.”\u003c/p\u003e\n\u003cp\u003eChapter Thirty\u003c/p\u003e\n\u003cp\u003eRory showed up on Dalton’s doorstep a week later. Although they’d kept in touch, it’d been two long weeks since she’d seen him.\u003c/p\u003e\n\u003cp\u003eShe knocked on the door.\u003c/p\u003e\n\u003cp\u003eDalton opened it and stared at her like she was an apparition. He said, “You’re here,” and crushed her against his chest. His mouth found hers, and he kissed her with surety and tenderness. With love. With passion. This kiss was perfect. So perfect how he knew exactly what she needed. A girly rush of emotions pushed front and center and she just about blurted out that she loved him when he broke the kiss. Just to be safe, Rory kept her face tucked in his neck.\u003c/p\u003e\n\u003cp\u003e“I wasn’t expecting you.”\u003c/p\u003e\n\u003cp\u003e“I like to keep you on your toes.”\u003c/p\u003e\n\u003cp\u003e“And I like to keep you on your back.”\u003c/p\u003e\n\u003cp\u003eShe lightly punched him in the stomach and he laughed.\u003c/p\u003e\n\u003cp\u003eThen he nuzzled her ear. “I missed you like crazy, Rory.”\u003c/p\u003e\n\u003cp\u003eAs much as Rory took comfort in that, her belly fluttered with nerves. “I missed you too, McKay. I just finished up the last of the paperwork for the special project. I thought I’d swing by. So we could talk.”\u003c/p\u003e\n\u003cp\u003e“Is this a coffee conversation? Or a whiskey conversation?”\u003c/p\u003e\n\u003cp\u003e“Got the makings for an Irish coffee conversation.”\u003c/p\u003e\n\u003cp\u003e“Compromise. I like that about you.” Dalton took her hand and pulled out a chair at the breakfast bar. “Sit. I’ll start the coffee.”\u003c/p\u003e\n\u003cp\u003eShe dropped her satchel on the chair next to her. “Tell me about your day.”\u003c/p\u003e\n\u003cp\u003e“Not much to tell. I spent the day doin’ my Cinderella imitation cleaning this place now that all the remodeling is done.”\u003c/p\u003e\n\u003cp\u003e“Looks great. I love that you’re comfortable enough in your masculinity that you don’t see cleaning as demeaning.” She groaned. “Unintentional rhyme, I swear.”\u003c/p\u003e\n\u003cp\u003eDalton grinned. “Glad to hear it. I worried maybe you’d secretly been penning poetry.”\u003c/p\u003e\n\u003cp\u003e“Dealing with government regulations has sucked every ounce of verbal creativity out of my soul.”\u003c/p\u003e\n\u003cp\u003e“I imagine.” He grabbed two coffee mugs. Poured a generous slug of whiskey in each one.\u003c/p\u003e\n\u003cp\u003e“It smells clean in here. Sometimes I wonder if my house smells like dog.” Way to babble. Maybe you could ask him what product he used that left behind the lemony fresh scent.\u003c/p\u003e\n\u003cp\u003e“Not that I’ve noticed.” His gaze pinned hers. “Why you acting so nervous?”\u003c/p\u003e\n\u003cp\u003e“Because I am. I have something to tell you.”\u003c/p\u003e\n\u003cp\u003eDalton crossed his arms over his chest. “I’m not gonna like this, am I?”\u003c/p\u003e\n\u003cp\u003e“Depends.”\u003c/p\u003e\n\u003cp\u003e“So this paperwork you finished up… That means you’ve made your final decisions on who gets awarded the permits?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“Is that why you’re here?”\u003c/p\u003e\n\u003cp\u003e“Partially.” Stop stalling. Rory dug in her satchel and pulled out two pieces of paper.\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“Your future.” She placed the identical documents on the counter. “I did all the research on this, but the final decision is up to you.” She tapped the closest document. “This one recommends your land for the elk farm permit.” Then she tapped the next. “This one denies it.”\u003c/p\u003e\n\u003cp\u003e“I’m confused.”\u003c/p\u003e\n\u003cp\u003eShe shoved both papers at him. “You get to choose. Whether you stay here and run it. Or whether you don’t. I’ll back you on either decision.”\u003c/p\u003e\n\u003cp\u003eHe stared at the papers in silence. Then he poured coffee.\u003c/p\u003e\n\u003cp\u003e“I know it’d mean a lot to you, finally getting to utilize the land you own for something you want. And I wouldn’t recommend it if I didn’t believe the habitat was more than adequate.”\u003c/p\u003e\n\u003cp\u003e“So why are you givin’ me the option?”\u003c/p\u003e\n\u003cp\u003e“There’s something else you need to know first.” Rory swallowed a mouthful of coffee. The burn of the whiskey and the hot liquid sent her into a coughing fit.\u003c/p\u003e\n\u003cp\u003eDalton was right there, rubbing her back, asking if she was all right, asking how he could help her.\u003c/p\u003e\n\u003cp\u003e“I’m okay. Maybe some water.”\u003c/p\u003e\n\u003cp\u003e“Be right back.”\u003c/p\u003e\n\u003cp\u003eMaybe his concern was a stupid little thing, but it just reinforced her feelings for him. Dalton McKay was a capable caretaker, something she wouldn’t have believed if he hadn’t proven it to her time and time again over the past few months. No one had ever believed Dalton capable of taking care of himself, let alone anyone else. The fact he showed her that side of himself meant she had a part of him that no one else did. He didn’t only act sweet and loving when he wanted something from her in return.\u003c/p\u003e\n\u003cp\u003eHe handed her the glass of water and watched as she drank. “Better?”\u003c/p\u003e\n\u003cp\u003e“Much. Thank you.”\u003c/p\u003e\n\u003cp\u003e“Will you please tell me what’s goin’ on?”\u003c/p\u003e\n\u003cp\u003e“I haven’t been happy in my job, prior to this special assignment. I’ve been dreading going back to being a part-time lackey.”\u003c/p\u003e\n\u003cp\u003e“I thought you said they might reward you for a good job and move you up the ladder?”\u003c/p\u003e\n\u003cp\u003eRory forced herself to maintain eye contact. “That was a lie. I’ve been applying for jobs with other agencies for months. I never intended on staying in Sundance permanently.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me that?”\u003c/p\u003e\n\u003cp\u003e“Because you’re you. Or I thought you were the same love ’em and leave ’em guy you’d always been. Showing up here after three years and swearing we were meant to be together. I didn’t believe it. I didn’t trust it. I didn’t trust you. I suspected you had an agenda—even before the permit issue arose between us.” As much as she wanted to hide her face, she looked him dead in the eye. “I decided I’d hang out with you to cure my loneliness, gorge myself on hot sex with you until I had a great new job and I’d move on.”\u003c/p\u003e\n\u003cp\u003eThe strong muscle in his jaw worked but he said nothing.\u003c/p\u003e\n\u003cp\u003e“But something happened. I fell in love with you. The Dalton I knew now. Not the asshole from years ago, not even the sweet, bossy Dalton I used to antagonize when we played in the woods.”\u003c/p\u003e\n\u003cp\u003e“Rory—”\u003c/p\u003e\n\u003cp\u003e“Just hear me out. Inasmuch as I realized that assholish side of you didn’t exist anymore, I understood I haven’t been that wronged girl for a number of years. I may talk tough, may act tough sometimes, but I’m not cruel. I’ve never been a cruel person and I won’t start being that way now—especially to you. You’ve dealt with enough cruelty in your life, Dalton. You don’t deserve that from someone who loves you.”\u003c/p\u003e\n\u003cp\u003e“You really love me?”\u003c/p\u003e\n\u003cp\u003e“Really. Truly.” She fought tears. “Which is why this is so hard.”\u003c/p\u003e\n\u003cp\u003e“Aurora. Love makes everything easier,” he said softly.\u003c/p\u003e\n\u003cp\u003eSuch a vulnerability to this man. That just made her love him more. “But I’m not the only one who loves you. Your family loves you and they’ve got you back. You finally came clean with them about what had kept you away. You just lost your father and you’re dealing with some pretty mixed emotions about that. You’ve stopped running from your problems so it’s not fair to ask you to run away with me. Seems like we both have horrible timing with the run away with me thing, huh?”\u003c/p\u003e\n\u003cp\u003eThat startled him. “What are you talkin’ about?”\u003c/p\u003e\n\u003cp\u003e“Last week I got offered a permanent fulltime position with Cooperative Ecosystems Studies Unit in Missoula.”\u003c/p\u003e\n\u003cp\u003e“So you’re takin’ it?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“For sure.”\u003c/p\u003e\n\u003cp\u003e“For sure. I interviewed there in person last week and they offered me the job on the spot. I also interviewed with the BLM in Cody but didn’t make the final cut because they were looking for someone with more experience. Anyway, I gave notice at WNRC. Next week is my last week.” She stared into those compelling blue eyes. “So I’m leaving Sundance. But I don’t want this to end. I’m asking you to come with me to Missoula.”\u003c/p\u003e\n\u003cp\u003eStunned silence.\u003c/p\u003e\n\u003cp\u003e“I want to be with you. But I realize the timing for this couldn’t possibly come at a worse time for you.”\u003c/p\u003e\n\u003cp\u003e“Rory, that doesn’t—”\u003c/p\u003e\n\u003cp\u003eShe put her fingers over his mouth. “Don’t. Even if you’re convinced you’ve made up your mind and know what you want, I’m asking you to take a little time and really think it through. Talk to your brothers. Talk to your mom. Make a rational decision, not an emotional one.”\u003c/p\u003e\n\u003cp\u003eDalton was so shocked or deep in thought that he couldn’t speak.\u003c/p\u003e\n\u003cp\u003eRory shouldered her satchel and walked out.\u003c/p\u003e\n\u003cp\u003eShe made it to her Jeep before she heard the screen door slam. She whirled around and Dalton was in her face.\u003c/p\u003e\n\u003cp\u003e“Don’t make an emotional decision?” he demanded, crowding her against her car. “That’s the only kind of decision that’s worth anything.” He snapped the paper in her face. Then he crumpled it into a ball and threw it over his shoulder. “Deny me the elk farm permit. The only reason I applied for it is because I thought you’d be livin’ here and I’d need something to do.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t completely honest with you. I don’t have a burning desire to raise elk. I saw an opportunity, a reason to stay in Sundance. Yes, I have family here and I’ve dealt with some issues that will keep my brothers and their families part of my life. But Rory, I was here for you. I stayed for you. If you’re not here, there’s no reason for me to stay.” \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-68.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
