{"id":72237,"no":69,"title":"Page 69","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe blinked at him. Maybe the inability to speak was contagious because she couldn’t make her lips move.\u003c/p\u003e\n\u003cp\u003e“I love you. I thought I lost you once and that’s never happening again. Never. I don’t even need five seconds to make a decision. You go, I go. We belong together. Not just while you’re killin’ time waiting for a killer job, or I’m killin’ time hoping to heaven that you’ll fall in love with me. We are forever.” Dalton curled his hands around her face. “So yes, I’ll run away with you to Missoula. But when we go, you’ll be wearing my ring.”\u003c/p\u003e\n\u003cp\u003e“Are you asking me to marry you?”\u003c/p\u003e\n\u003cp\u003e“No. I’m telling you that we will be married. I’m willing to wait until you’re settled in your new job, but I want you as my wife, Rory. I want everyone to know that you’re mine. That we’re building a life together.”\u003c/p\u003e\n\u003cp\u003eOver the past few months when Dalton looked at her a certain way, or placed a kiss below her ear, or ran his finger down the inside of her arm, she sensed his satisfaction. His possession. She’d chalked it up to sex. Now she saw it for what it really was. Love that went beyond anything she’d ever thought any man could feel for her, let alone this man who owned her heart, body and soul.\u003c/p\u003e\n\u003cp\u003eIt was past time she let him know she felt the same.\u003c/p\u003e\n\u003cp\u003eShe ran her hands through his hair. “I love you.”\u003c/p\u003e\n\u003cp\u003eHe quit breathing entirely. Then he said, “Say it again.”\u003c/p\u003e\n\u003cp\u003e“I love you.” Before she could repeat it for a third time, because she knew that’s what he’d ask for, his mouth was on hers. Not consuming her with a fierce kiss, but leveling her with tenderness and gratitude. And hope. There was so much hope in him, in this kiss, that her eyes grew wet.\u003c/p\u003e\n\u003cp\u003eThe kiss went on and on. Gentle and hot, packed with the type of sweet need that caused her to cling to him tighter.\u003c/p\u003e\n\u003cp\u003eWhen he finally released her mouth, he murmured, “You really mean it?”\u003c/p\u003e\n\u003cp\u003e“Yes, I do. I love you, McKay.”\u003c/p\u003e\n\u003cp\u003e“This is the best day of my life. Right now, in this moment with you.”\u003c/p\u003e\n\u003cp\u003e“Mine too.”\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eSix months later\u003c/p\u003e\n\u003cp\u003e“Do you, Dalton Patrick McKay, take Aurora Rose Wetzler to be your lawfully wedded wife? To have and to hold, for better or for worse, for richer, for poorer, in sickness and in health, to love and to cherish, from this day forward, until death do you part?”\u003c/p\u003e\n\u003cp\u003eDalton froze.\u003c/p\u003e\n\u003cp\u003eThis was it. The next step would tie him to this woman permanently and the judge’s final words would pronounce them husband and wife.\u003c/p\u003e\n\u003cp\u003eDalton McKay, husband.\u003c/p\u003e\n\u003cp\u003eThat sounded…perfect. Really fucking perfect actually.\u003c/p\u003e\n\u003cp\u003e“I do.” He lifted Rory’s hand to his mouth for a kiss. “I do, I do, I do. I cannot wait for this woman to be my wife.”\u003c/p\u003e\n\u003cp\u003e“You sorta went off-script,” Rory whispered.\u003c/p\u003e\n\u003cp\u003e“I’m an off-script kinda guy.”\u003c/p\u003e\n\u003cp\u003eThe judge cleared his throat. “May I continue?”\u003c/p\u003e\n\u003cp\u003e“Ah, yeah, sure, go for it.”\u003c/p\u003e\n\u003cp\u003e“Do you, Aurora Rose Wetzler, take Dalton Patrick McKay to be your lawfully wedded husband? To have and to hold, for better or for worse, for richer, for poorer, in sickness and in health, to love and to cherish, from this day forward, until death do you part?”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003eThey exchanged rings.\u003c/p\u003e\n\u003cp\u003eThen the judge said the magic words. “By the power vested in me by the State of Wyoming, I now pronounce you husband and wife. Kiss your bride. Kiss your groom. This union is official.”\u003c/p\u003e\n\u003cp\u003eDalton curled his hands around her face, the beautiful face of this woman whose eyes were shining with love for him. “I love you.” He kissed her with sweetness and devotion. And he had to laugh softly when he finally pulled back. “Sugarplum lip gloss. Nice touch.”\u003c/p\u003e\n\u003cp\u003eLoud clapping behind them echoed through the trees.\u003c/p\u003e\n\u003cp\u003eThey turned together and faced their family.\u003c/p\u003e\n\u003cp\u003eHugs and claps on the back and even more hugs were exchanged. Then everyone backed off, giving them time alone.\u003c/p\u003e\n\u003cp\u003eThey’d kept the ceremony for immediate family only. His brothers had stood up for him. Rory’s mom and Sierra had stood up for her.\u003c/p\u003e\n\u003cp\u003eNow they stood before each other, husband and wife, in the exact same place where they’d met for the first time.\u003c/p\u003e\n\u003cp\u003e“What are you thinking about?” she asked.\u003c/p\u003e\n\u003cp\u003e“Us. How perfect this is. But also in all those years we hung out here and all the games we played, we never once played house.” He kissed her again. “Why?”\u003c/p\u003e\n\u003cp\u003e“Because playing house isn’t a game for us. It’s for real. For keeps.”\u003c/p\u003e\n\u003cp\u003eAnd she swore she didn’t have a romantic streak. The fact she’d insisted they get married here and she carried a bouquet of plum blossoms and her lip gloss spoke volumes to him.\u003c/p\u003e\n\u003cp\u003e“I recognize that look, McKay. You were thinking of a way to get me up onto that rock just so you could push me off.”\u003c/p\u003e\n\u003cp\u003e“No way. It wouldn’t be the same because the six-year-old Rory I remember wouldn’t be caught dead wearing a princess dress. She would’ve jumped into the creek before I could shove her off, just to save face.”\u003c/p\u003e\n\u003cp\u003eShe grinned at him. “You’re right.”\u003c/p\u003e\n\u003cp\u003e“But you look spectacular.” The white satin dress clung to her every curve from the waist down. From the waist up it was all fancy beading, lace and poufy stuff. Rory had let her hair hang loose rather than putting it up, knowing the second Dalton got her alone, all the pins would come out and he’d take it down anyway.\u003c/p\u003e\n\u003cp\u003e“Thank you. You look pretty spectacular yourself.”\u003c/p\u003e\n\u003cp\u003eHe’d chosen a western-cut black suit with a plaid vest and no tie. Not once during the brief ceremony had he felt like he was choking.\u003c/p\u003e\n\u003cp\u003e“Sweetheart,” Rielle said to Rory, “Gavin and I are heading up to the house to make sure everything is set for the party.”\u003c/p\u003e\n\u003cp\u003eRory kissed her mom’s cheeks. “Go on. We’ll be up in a minute.” As soon as her mother was out of earshot, Rory murmured, “I cannot believe she’s hosting the wedding reception at her house. I know it’s just a family reception, but that means all those McKays. And all their kids.”\u003c/p\u003e\n\u003cp\u003e“Hey, you’re one of them too now, Mrs. McKay.”\u003c/p\u003e\n\u003cp\u003eTell and Georgia’s little girl, Carly, started to fuss. As Dalton’s first niece she was the official flower girl even when she didn’t do anything but look cute as a button in her beribboned dress. Tucker had done better than expected as ring bearer, but he’d lit out for the creek with Landon, Wyatt and Jackson as soon as possible.\u003c/p\u003e\n\u003cp\u003eBrandt and Jessie’s baby girl, Bethany, let out a loud wail.\u003c/p\u003e\n\u003cp\u003e“I think we’ll grab the kids and head up to the house too,” Brandt said and yelled for the boys.\u003c/p\u003e\n\u003cp\u003eDalton’s mom gave him another hug. “I’ll ride up with the judge.”\u003c/p\u003e\n\u003cp\u003e“Well I’m not staying here by myself to watch the newlyweds suck face,” Sierra announced. Yanking up the skirt of her bridesmaid’s dress, she whistled for Jingle and shouted, “Hey Dad, wait up.”\u003c/p\u003e\n\u003cp\u003eAnd then they were alone.\u003c/p\u003e\n\u003cp\u003eDalton faced Rory with a grin. “You know, we could…”\u003c/p\u003e\n\u003cp\u003e“Absolutely not, Dalton McKay. I am not having sex with you on that rock… Omigod please, stop doing that. Right now. Seriously…”\u003c/p\u003e\n\u003cp\u003e“In a minute,” he murmured against her throat.\u003c/p\u003e\n\u003cp\u003eRory grabbed a handful of his hair and yanked so they were looking at each other. “Save it for the honeymoon.”\u003c/p\u003e\n\u003cp\u003e“You mean tonight, right? And not waiting to have my wicked way with my wife until we’re in Spain?” Having Rory to himself for two weeks in Europe was gonna be some fun.\u003c/p\u003e\n\u003cp\u003e“Of course I mean tonight. You do have a room reserved for us someplace?”\u003c/p\u003e\n\u003cp\u003e“Don’t need reservations in the great outdoors.”\u003c/p\u003e\n\u003cp\u003e“You are not expecting me to spend my freakin’ wedding night in a sleeping bag out in the woods, are you?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Nope. You get enough of the great outdoors in your job.” Their transition to living together in a new state, as a couple, had gone much smoother than they’d imagined. They’d bought a house, a small fixer-upper to give him something to do. He’d found a logging company that needed part-time seasonal help and he planned to serve as a hunting guide in the fall for Boden. But for the most part, he was content being in their home, taking care of Rory, supporting her in the career she loved.\u003c/p\u003e\n\u003cp\u003eShe swept his hair from his forehead. “I love you. Promise me we won’t get separated for too long at the reception?”\u003c/p\u003e\n\u003cp\u003e“I promise.” Then he kissed her. The kiss caught fire, like it always did between them. His mouth wandered, as did his hands. He’d just about had her talked into a quickie, when he heard motors gunning behind them and a series of annoying beeps.\u003c/p\u003e\n\u003cp\u003eDalton stepped in front of Rory so she could straighten the top of her dress.\u003c/p\u003e\n\u003cp\u003eKyler pulled into view in a side by side ATV that’d been decorated with white streamers and graffiti and had tin cans tied to the back end. A big sign said, Just Hitched.\u003c/p\u003e\n\u003cp\u003eMore loud beeps sounded and he saw Sierra riding another ATV. She pulled in behind Kyler.\u003c/p\u003e\n\u003cp\u003e“Please tell me she’s not wearing her bridesmaid’s dress on that muddy ATV.”\u003c/p\u003e\n\u003cp\u003eSierra waved at them with the bottle of champagne and yelled, “Wahoo! We started the party without you, suckas.”\u003c/p\u003e\n\u003cp\u003e“And…she’s drinking.”\u003c/p\u003e\n\u003cp\u003eDalton laughed.\u003c/p\u003e\n\u003cp\u003eKyler bounded over. “Your wedding party got back to the house and realized they hadn’t left you a way to get back.” He tossed Dalton the keys and pointed to the ATV. “Your chariot awaits.”\u003c/p\u003e\n\u003cp\u003e“Thanks Ky. Could you—”\u003c/p\u003e\n\u003cp\u003e“Drive Sierra back to the house? I’d planned on it.” He propped his hands on his hips. “Not sure an open bar was the best choice for the reception. Anyway, I’ll keep an eye on her tonight.”\u003c/p\u003e\n\u003cp\u003e“Thanks, I appreciate it,” Rory said.\u003c/p\u003e\n\u003cp\u003e“Don’t mention it. Seriously. Don’t say nothin’ to my parents.” He frowned. “If they think I’m havin’ any kind of fun they’ll make me stay with the little kids.” \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-69.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
