{"id":72176,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Rory?”\u003c/p\u003e\n\u003cp\u003eStartled, she glanced up at Dalton. “What?”\u003c/p\u003e\n\u003cp\u003eHe gestured with his spork. “You’re pulverizing them poor green beans.”\u003c/p\u003e\n\u003cp\u003eShe glanced down to see a smashed pile of green goo on her plate.\u003c/p\u003e\n\u003cp\u003e“What were you thinkin’ about that put you in a murderous mood?”\u003c/p\u003e\n\u003cp\u003eDo you really want to talk about this?\u003c/p\u003e\n\u003cp\u003eYes. They’d avoided this subject for far too long.\u003c/p\u003e\n\u003cp\u003eRory pinned him with a hard stare. “I was thinking about the summer after my senior year. Specifically that night you sweet-talked me into the cab of your pickup. The night you punched my V-card?”\u003c/p\u003e\n\u003cp\u003eDalton choked on his beer.\u003c/p\u003e\n\u003cp\u003e“You didn’t even call me the next day. Then I left for college two weeks later. Is that night ringing any bells for you? Or as a McKay male have you popped so many cherries that you don’t even fucking remember?”\u003c/p\u003e\n\u003cp\u003e“Of course I remember.” He took another long swallow of beer. “I was an ass, okay? I was also twenty, with big plans to get laid at every opportunity.”\u003c/p\u003e\n\u003cp\u003e“I was just another opportunity to get your rocks off?” she demanded.\u003c/p\u003e\n\u003cp\u003e“I was a horny twenty-year-old,” he repeated. “Getting my fair share of ass is all I cared about. Do I wish I could erase the shitty things I’ve done? Especially to you? Absolutely. You want me to apologize? Fine. I’m sorry. I should’ve called you. But if I had, I probably would’ve asked if you wanted to hook up again and fucked you against the pickup, just to mix it up.”\u003c/p\u003e\n\u003cp\u003e“That is not an apology, Dalton McKay.”\u003c/p\u003e\n\u003cp\u003eDalton stared at her thoughtfully.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Maybe you’re not lookin’ for an apology from me. Maybe you oughta forgive yourself for bein’ a starry-eyed eighteen-year-old girl who let a punk-ass cowboy you trusted sweet-talk you out of your virginity.”\u003c/p\u003e\n\u003cp\u003eHad that really been her issue? Was it still her issue?\u003c/p\u003e\n\u003cp\u003e“If I could go back and do it over, I’d give you more than some fevered groping in the cab of a truck.”\u003c/p\u003e\n\u003cp\u003eHe traced her hairline from her forehead to her ear.\u003c/p\u003e\n\u003cp\u003eHey, when had he moved so close? And why wasn’t she pulling away?\u003c/p\u003e\n\u003cp\u003e“I’d romance you underneath the starry sky. I’d take my time with every inch of you and try not to set the world speed record for how fast I could get off. You deserved better and I knew it. I knew how lucky I was to even get with you.”\u003c/p\u003e\n\u003cp\u003eHis smoky eyes and deep rumbling voice hypnotized her. She found herself leaning closer. “Why?”\u003c/p\u003e\n\u003cp\u003e“You had this way of scaring most of the boys off.”\u003c/p\u003e\n\u003cp\u003e“Except for you.”\u003c/p\u003e\n\u003cp\u003e“Except for me.”\u003c/p\u003e\n\u003cp\u003e“Why?” she asked again.\u003c/p\u003e\n\u003cp\u003e“I knew you. I’d seen your sweet side beneath that in-your-face persona you’d adopted the year you grew from a shrimp into a pinup dream.”\u003c/p\u003e\n\u003cp\u003eRory bit back a groan. In ten months she’d shot up eight inches, a complete transformation from a waifish girl into a clumsy amazon. She’d gone on the offensive to stave off anyone verbally attacking her and calling her a freak.\u003c/p\u003e\n\u003cp\u003e“Your height, your brain, your body—” big shocker that Dalton didn’t offer her a lascivious grin, “—were intimidating, even for me, and we were friends. I dreaded the day when you finally realized how gorgeous you were. So you were taking off for college and I wanted a piece of you for myself—a piece that no other guy would ever have.”\u003c/p\u003e\n\u003cp\u003eHe’d always been calculating; she hadn’t expected him to admit it. She didn’t know how to respond.\u003c/p\u003e\n\u003cp\u003e“But I promise you that’s not me anymore.”\u003c/p\u003e\n\u003cp\u003eShe snorted. “So you’ve changed?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“In all the ways I needed to. Getting away from here was the smartest thing I ever did. I got a chance to see the world outside of Crook County and the McKay ranch. I got to see who I was outside of bein’ part of the McKay family.”\u003c/p\u003e\n\u003cp\u003e“Why are you telling me this?”\u003c/p\u003e\n\u003cp\u003eDalton took her hand. “Because in order for you to trust me I have to prove to you I’ve changed. And I intend to do whatever it takes to do that.”\u003c/p\u003e\n\u003cp\u003eKeep it light. “Whatever. I don’t suppose you bought dessert.”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact, I did. Two of those fancy pudding cups from KFC with the whipped cream and chocolate shavings on the top.”\u003c/p\u003e\n\u003cp\u003eRory smiled. “I remember how jealous we were of the kids who got pudding cups in their lunches because we never did. Now I can buy them anytime I want and I never do.”\u003c/p\u003e\n\u003cp\u003eDalton said, “I buy ’em. Or I did when I lived here.”\u003c/p\u003e\n\u003cp\u003eThe way he kept saying that made her think he wouldn’t be here permanently.\u003c/p\u003e\n\u003cp\u003eRory cracked the foil on her cup and scooped out a tiny bite. And another.\u003c/p\u003e\n\u003cp\u003e“You still eat pudding like it’s a rare delicacy. It’s cute.”\u003c/p\u003e\n\u003cp\u003eShe stuck out her tongue. “How’d you end up renting this house on such short notice?”\u003c/p\u003e\n\u003cp\u003e“I know the owner. She’s been meaning to install updates before she decides to rent or sell. Since I’m not doin’ anything else, we’re swapping rent for my handyman skills.”\u003c/p\u003e\n\u003cp\u003eRory wanted to ask who owned the house. If the woman was a former lover he’d kept in touch with.\u003c/p\u003e\n\u003cp\u003eDalton kept talking. “But she’s getting the better end of the deal. A FedEx package was on the steps when I got here with a list of changes five pages long. I also have a packet of paint chips color-coordinated to each room.”\u003c/p\u003e\n\u003cp\u003e“So what are you doing first?”\u003c/p\u003e\n\u003cp\u003e“Be easier to show you.” She followed him out of the kitchen. He led her past the empty living room and cut down a hallway with five closed doors. He paused outside the last one. “Too bad you don’t have sunglasses on ’cause you’ll need them.\u003c/p\u003e\n\u003cp\u003eHe opened the door and Rory winced.\u003c/p\u003e\n\u003cp\u003e“Holy shit that’s hideous.” The room was neon yellow. Not a pretty yellow, but a cross between yellow and green so it looked like someone had pissed all over the walls. “How many coats will it take to cover this?”\u003c/p\u003e\n\u003cp\u003e“About ten thousand.” He flattened his palm against the wall. “Fortunately I’m texturing this room first, so that’ll cut some of the glare.”\u003c/p\u003e\n\u003cp\u003eSince she was by nature such a helpful person, it was on the tip of her tongue to offer to help him paint.\u003c/p\u003e\n\u003cp\u003eDon’t do it.\u003c/p\u003e\n\u003cp\u003e“It’s a small house so it’ll be a short tour.”\u003c/p\u003e\n\u003cp\u003e“This place isn’t as small as my cabin. Sometimes it makes me claustrophobic.”\u003c/p\u003e\n\u003cp\u003eDalton turned around so fast she ran into him. “Your cabin is great.”\u003c/p\u003e\n\u003cp\u003e“Great in that I don’t have to pay rent, but that’s about it.”\u003c/p\u003e\n\u003cp\u003eHe brushed a hair from her cheek. “And?”\u003c/p\u003e\n\u003cp\u003e“And living there makes it seem like I never left here.” Somehow the man had backed her against the wall. “Dalton, what are you doing?”\u003c/p\u003e\n\u003cp\u003e“You have chocolate pudding on your lip and I’m gonna lick it off. And then I’m gonna kiss you. Really kiss you like I’ve been dyin’ to since you showed up today.”\u003c/p\u003e\n\u003cp\u003eSince when did he… Oh God. A warm, wet tongue slid across her lower lip. He tugged her bottom lip between his teeth and sucked. He slowly released it and crushed his lips to hers.\u003c/p\u003e\n\u003cp\u003eDalton’s mouth demanded. Controlled. Teased. He clasped her hands in his, letting the kiss ebb and then building it back up. No body parts were touching beyond the clasp of their hands and their locked mouths.\u003c/p\u003e\n\u003cp\u003eRory never remembered him kissing her like this—with such single-minded absorption.\u003c/p\u003e\n\u003cp\u003eThat’s because he’s had lots and lots of practice.\u003c/p\u003e\n\u003cp\u003eHe ended the kiss before she pulled away. He murmured, “I had to do that out here. Because if I did it in my bedroom we might never come out.” He placed a kiss below her ear.\u003c/p\u003e\n\u003cp\u003eShe ignored how her body tingled just from his soft mouth on her skin. Annoyed, she gave him a tiny head-butt. “Wishful thinking, McKay.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Guess we’ll see.”\u003c/p\u003e\n\u003cp\u003eSmug man. “And I hate the beard anyway.”\u003c/p\u003e\n\u003cp\u003eHe stepped back and opened the door.\u003c/p\u003e\n\u003cp\u003eRory looked at the sleeping bag on the floor, then at him and poked him in the chest. “I’m beyond the age that doing it in a sleeping bag holds any appeal for me.”\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know. Two sleeping bags hooked together out in the middle of nowhere, beneath a big starry sky, will always hold appeal for me.”\u003c/p\u003e\n\u003cp\u003e“Who are you?” She poked him again. “It’s this damn beard that’s turned you into a mountain man, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“No.” He kissed her. “I’ve changed. But with you, proof is in the pudding—ha ha—so that’s what you’ll get.”\u003c/p\u003e\n\u003cp\u003e“More pudding?”\u003c/p\u003e\n\u003cp\u003eDalton looked at her—more like he looked through her. His blue eyes held something warm and dark that she’d never seen and her belly cartwheeled.\u003c/p\u003e\n\u003cp\u003eThat’s when she knew he’d honed that boyish charm into a sharper instrument. A much more dangerous tool.\u003c/p\u003e\n\u003cp\u003eThen the look vanished and he smiled. “Maybe we oughta go finish our pudding.”\u003c/p\u003e\n\u003cp\u003eThey returned to the kitchen. Dalton’s eyes were glued to her mouth as she licked every bite of chocolate from her spork.\u003c/p\u003e\n\u003cp\u003e“Besides handyman stuff, what are you doing to fill your days?”\u003c/p\u003e\n\u003cp\u003e“I’ll put in an appearance at the rehab hospital. Then at some point this week I gotta get furniture for this place and a TV. I need something else to fill the void while I’m stuck here.”\u003c/p\u003e\n\u003cp\u003eFill the void? Was that why he was being so cute and flirty with her? Because she was the void he intended to fill…in more ways than one?\u003c/p\u003e\n\u003cp\u003eEnough. You got what you needed, he explained why he left so walk away. Now.\u003c/p\u003e\n\u003cp\u003e“Well, good luck with that.” She tossed her empty pudding cup on her paper plate and stood to gather the trash.\u003c/p\u003e\n\u003cp\u003e“Rory. What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Nothing. I have to go.”\u003c/p\u003e\n\u003cp\u003e“Already? Stay.”\u003c/p\u003e\n\u003cp\u003eShe whirled around. “Why? So you can fill a void? I’m just another way to kill time while you’re stuck here?” \u003c/p\u003e","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-8.html","bookId":2697,"creation":"Oct 5, 2019 10:23:20 AM","modification":"Oct 5, 2019 10:23:20 AM"}
