{"id":91417,"no":78,"title":"Page 78","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“It was a dream.”\u003c/p\u003e\n\u003cp\u003e“Maybe. But when you were sick? I sat with you sometimes. You talked to Peter a lot, but you were more scared of him then. Now, you’re . . .” She paused. “Sad.”\u003c/p\u003e\n\u003cp\u003e“Oh.” All of a sudden, his eyes itched. “I guess I am.”\u003c/p\u003e\n\u003cp\u003e“Are you still mad at him?” Before he could answer, she turned her brimming eyes to his. “Because the last time my daddy went to Iraq? I was mad, and he came home in a box. I was pissed at Grandpa Jack, and then he died. The last morning I saw Tom and Alex, I’d gotten mad at them, too, the night before. We made up, but . . .” A tear dribbled down one cheek.\u003c/p\u003e\n\u003cp\u003e“You didn’t make any of that happen,” he said, part of him wishing that if evil thoughts could kill, his father would’ve keeled over five years before the Night of the Hammer. On the other hand, he couldn’t have wished that hard, because he’d also lied for the bastard when the chips were down. “Were you angry at Eli?” When she shook her head, he said, “See?”\u003c/p\u003e\n\u003cp\u003e“But I’m afraid.” Her lower lip shuddered. “I’m still mad at you. I understand why . . . but don’t lie to me again, Chris. It hurts too much, and I don’t want you to die, too.”\u003c/p\u003e\n\u003cp\u003eThe right thing to do would be to give her a hug, or touch her. But he didn’t want to make a mistake. “I’m not going to die,” he said, though he probably shouldn’t make promises he mightn’t keep. “I only want to try and do what’s right. I’m not into this to get myself killed.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s a relief,” Jayden said, stomping from the woods. He looked as Ellie stifled a watery laugh. “What? What’d I say?” But his mouth was turned in a grin. “Oohhh,” he said, reeling the little girl in for a knuckle rub. “You thought I meant that.”\u003c/p\u003e\n\u003cp\u003e“Nooo,” Ellie squealed, cracking up all over again.\u003c/p\u003e\n\u003cp\u003e“It is, however, an excellent question.” Jayden gave Ellie’s head a final tousle. “Lena or no Lena, what is the game plan once we get to Rule? People there you can trust?”\u003c/p\u003e\n\u003cp\u003e“A few.” Crouching over a sparse patch of unbroken snow, he made an X. “If Rule’s at the center of a clock, we’re coming in from up here.” He poked a finger at ten o’clock. “We have two choices: either loop clockwise to the hospice here”—he traced an arc to two o’clock—“or keep on this route and drop down to the southwest corner here.” An X at seven o’clock.\u003c/p\u003e\n\u003cp\u003e“Which is faster?” Ellie asked.\u003c/p\u003e\n\u003cp\u003e“Six of one, half dozen of the other. We can trust Kincaid, the doctor, I think, and some girls I know who lived with Alex: Sarah and Tori. Greg and Pru, from my squad, are good guys, but they’re all the way on the other side of town.” He pointed to four o’clock. “The only catch is Jess’s house, where Alex was? It’s not that far from the Zone.”\u003c/p\u003e\n\u003cp\u003e“Where the people-eaters are.” When Chris nodded, Ellie continued, “Can’t we go straight down and still end up where Alex lived?”\u003c/p\u003e\n\u003cp\u003e“Well, there are more houses and people, but . . . yeah, if we’re careful.”\u003c/p\u003e\n\u003cp\u003e“Sounds like those girls are the first stop then.” Jayden went to his horse, pulled open a saddlebag, and withdrew a camp pot and three enameled mugs as well as a Ziploc of tea and another of fish jerky. “What then?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’ve been gone two months,” Chris said, as Jayden carefully scooped handfuls of untrammeled snow into the pot. “It’s the middle of March now. A lot could’ve happened.” Given his many dreams, he was willing to bet on it.\u003c/p\u003e\n\u003cp\u003e“Okay.” Nesting the pot over flames, Jayden doled out cups. “So, we go to Sarah and Tori and . . . what? You make like Moses—let my people go—or are we just going to bust everyone out?”\u003c/p\u003e\n\u003cp\u003e“I honestly haven’t thought that far. Guess it depends on if I end up in the prison house.”\u003c/p\u003e\n\u003cp\u003e“We won’t let that happen,” Ellie said, promptly.\u003c/p\u003e\n\u003cp\u003eJayden only filled a tea ball with loose leaves. “How likely is that?”\u003c/p\u003e\n\u003cp\u003e“I’d be lying if I said it wasn’t a real strong possibility. What I’m hoping is that the Council will listen. I can’t believe that they’ll just shoot me,” he lied.\u003c/p\u003e\n\u003cp\u003e“They won’t,” Ellie said, fishing out a piece of jerky.\u003c/p\u003e\n\u003cp\u003e“Oh?” Jayden raised both eyebrows. “And you know this because—”\u003c/p\u003e\n\u003cp\u003e“Because,” she said, gnawing jerky that was the color of an old loafer, “they’d have to shoot through me first.”\u003c/p\u003e\n\u003cp\u003eHe and Jayden looked at each other, and then Chris said, “Come again?”\u003c/p\u003e\n\u003cp\u003e“I saved your life, Chris. So . . . I’m responsible for you from now on.”\u003c/p\u003e\n\u003cp\u003e“I think it goes the other way around,” Jayden said. “He owes you.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but then he saved me from the lake.”\u003c/p\u003e\n\u003cp\u003e“So we’re even,” Chris said. “I’m not letting you do anything dumb, Ellie.”\u003c/p\u003e\n\u003cp\u003e“Too late. I’m here,” she said. “Seriously, guys, you think they’ll shoot a cute kid and her little dog, Toto, too?”\u003c/p\u003e\n\u003cp\u003e“I—,” Chris started, then shut his mouth. He and Jayden traded another long look, and then they both began to laugh.\u003c/p\u003e\n\u003cp\u003e“See?” Ellie said, looking very pleased. She offered Chris the bag. “Jerky?”\u003c/p\u003e\n\u003cp\u003e98\u003c/p\u003e\n\u003cp\u003eBetween Jed’s maps and a thumbnail of the village’s layout, Zone, patrols, and approach routes Weller once drew, Tom would’ve found what he was looking for easily enough. As with the lake, however, the crows pointed the way, sketching lazy pinwheels above the woods southwest of Rule. Now that they were into March and the daytime temps were inching past freezing most days, the faintly gassy smell helped, too. So did his horse, who finally balked a half mile shy and refused to budge. That was all right. On foot, he had a better chance of slipping in unnoticed. So he offloaded his gear, then unharnessed and gave the horse a healthy slap to send it on its way.\u003c/p\u003e\n\u003cp\u003eIf you didn’t know better, Tom thought you could almost imagine that you’d dropped into some horror story where the village appeases the local gods by sending out the occasional sacrifice. He knew better. Rule’s story was written in the haphazard scatter of browning bones, scored by teeth and knives; the remnants of clothes and discarded backpacks; a hoary scraggle of wig so picked over there was nothing left but ripped lace and a few strands of too-red hair.\u003c/p\u003e\n\u003cp\u003eWhat almost troubled him more, however, was a wrecked pyramid of decaying human heads that lay at the end of a kind of processional way. This was marked by the skeletonized remains of animals heaped on thinning snow beneath gently swaying rib cages still dangling from paraline. From the shapes of the skulls and teeth, he thought these had been wolves. The whole setup was ritualistic, with a weird Blair Witch vibe. He wondered if this spot had been claimed by the Wolf Tribe, those Chuckies Cindi saw with Alex. If true, then Tom was now standing close to or in the same spot Alex once had. He didn’t know if that was an omen, good or bad.\u003c/p\u003e\n\u003cp\u003eEither way, no Chuckies have been here for a while. Tom studied the crows hopscotching over that jumble of human skulls and disarticulated lower jaws. Only the barest remnants of leathery skin and desiccated muscle dangled from bone. Something had happened at that pyramid, too. The skulls hadn’t simply fallen to the snow but been knocked off, some by several feet. One lay far to the right. From its position, he could almost imagine that someone had tried lobbing the skull like a stone. Nearby were two shredded, bloodstained bits of cloth: part of a parka and a flannel shirt. Torn off in a fight, maybe, but the edges weren’t as frayed as he would’ve expected from a rip. Probably one honking sharp knife.\u003c/p\u003e\n\u003cp\u003eBut where was the flood of Chuckies that was supposed to have born down on Rule? In the last four days, Tom had seen only a few and at a distance—and twice during the midafternoon, which was also very bad news.\u003c/p\u003e\n\u003cp\u003eTom held his breath and listened. So still. This close, he ought to hear something: the thock of an ax, the distant clatter of wagons or horses. Perhaps, even the occasional voice. In the dead silence of the Hindu Kush, he’d once patrolled a mountainside and caught snatches of evening prayers ten thousand feet above a Pashtun village he never saw. But here? Nothing.\u003c/p\u003e\n\u003cp\u003eWhere is everyone? He was certain he wasn’t too late. With all those men and their wagons, the horses—and now, the kids—he had to have beaten Mellie and that old commander in black. Probably by no more than half a day, but even a few hours was better than nothing.\u003c/p\u003e\n\u003cp\u003eSomething really wrong here. A slight movement to his right, and his gaze dropped in time to see a small field mouse squirm from an empty socket of that lone skull. The animal froze, only its whiskers trembling before it wheeled and scurried away. Something rotten in Denmark, Yorick.\u003c/p\u003e\n\u003cp\u003eTime to find out what. Time, Tom hoped, to save his kids. It must’ve been an old mercury switch from a defunct thermostat connected to a battery. Move the garbage, disturb the switch, the leads spark, and boom. An easy bomb.\u003c/p\u003e\n\u003cp\u003eOne second, he was shouting for Weller and dashing toward the church. The next, he was very cold and crumpled on his side, a lucky thing because there was old copper in his mouth, more blood drying under his nose and along his neck. If he’d been on his back, he might have choked to death on his own blood. His chest felt like someone had dropped a boulder on him. His ears hurt, and they whooshed: a good indicator that he still had eardrums to hear with. At first, he thought the sound was only from the blast wave, but when he rolled onto his back, gasping at jags of pain, he saw clots of black smoke chuffing over blue sky and realized that what he heard was the muted chugs of a fire that had yet to burn itself out.\u003c/p\u003e\n\u003cp\u003eSitting up was an exercise in slow torture. Everything hurt. He wasn’t coughing up any more of the red stuff, so his lungs might be okay. A blast could kill you a lot of different ways. Some—being vaporized or skewered by shrapnel or bleeding out because your leg was gone—were a lot faster than others. Have the bad luck of being too close to a blast wave, and the hollow organs—lungs, heart, guts— could burst, sometimes fast, sometimes slow. When he was finally up, he propped himself on his elbows, concentrated on moving air in and out of his aching lungs, studied what was left of the church—and realized just how lucky he’d been. \u003c/p\u003e","sourceLink":"https://allnovel.net/monsters-ashes-trilogy-3/page-78.html","bookId":2566,"creation":"Oct 5, 2019 5:50:03 PM","modification":"Oct 5, 2019 5:50:03 PM"}
