{"id":79631,"no":1,"title":"Page 1","content":"\u003cp\u003ePrologue\u003c/p\u003e\n\u003cp\u003e“Just breathe,” my mom would say. “Ten tiny breaths … Seize them. Feel them. Love them.” Every time I screamed and stomped my feet in anger, or bawled my eyes out in frustration, or turned green with anxiety, she’d calmly recite those same words. Every single time. Exactly the same. She should have tattooed the damn mantra to her forehead. “That makes no sense!” I’d yell. I never understood. What the hell does a tiny breath do? Why not a deep breath? Why ten? Why not three or five or twenty? I’d scream and she’d simply smile her little smile. I didn’t understand it then.\u003c/p\u003e\n\u003cp\u003eI do now.\u003c/p\u003e\n\u003cp\u003eStage One ~ Comfortably Numb\u003c/p\u003e\n\u003cp\u003eChapter One\u003c/p\u003e\n\u003cp\u003eA soft hiss ... my heart thumping in my ears. I hear nothing else. I’m sure my mouth is moving, calling out their names … Mom? ...Dad? ... but I can’t hear my voice. Worse, I can’t hear theirs. I turn to my right to see Jenny’s silhouette, but her limbs look awkward and unnatural and she’s pressed up against me. The car door opposite her is closer than it’s supposed to be. Jenny? I’m sure I say. She doesn’t respond. I turn to my left to see only black. Too dark to see Billy, but I know he’s there because I can feel his hand. It’s big and strong and it envelops my fingers. But it’s not moving … I try to squeeze it but I can’t will my muscles to flex. I can’t do anything except turn my head and listen to my heart pound like an anvil against my chest for what feels like an eternity.\u003c/p\u003e\n\u003cp\u003eDim lights … voices …\u003c/p\u003e\n\u003cp\u003eI see them. I hear them. They’re all around, closing in. I open my mouth to scream, but I can’t find the energy. The voices get louder, the lights brighter. A reedy gasp sets my hairs on end. Like a person struggling for their dying breath.\u003c/p\u003e\n\u003cp\u003eI hear a loud snap, snap, snap, like someone pulling stage light levers; light suddenly pours in from all angles, illuminating the car with blinding power.\u003c/p\u003e\n\u003cp\u003eThe smashed windshield.\u003c/p\u003e\n\u003cp\u003eThe twisted metal.\u003c/p\u003e\n\u003cp\u003eDark smears.\u003c/p\u003e\n\u003cp\u003eLiquid pools.\u003c/p\u003e\n\u003cp\u003eBlood. Everywhere.\u003c/p\u003e\n\u003cp\u003eIt all suddenly disappears and I’m falling backward, crashing into cold water, sinking further into the darkness, picking up speed as the weight of an ocean swallows me whole. I open my mouth to search for air. A lungs worth of cold water greets me in a rush, filling me inside. The pressure in my chest is unbearable. It’s ready to explode. I can’t breathe … I can’t breathe. Tiny breaths, I hear my mom instruct, but I can’t do it. I can’t get even one. My body’s shaking … shaking … shaking …\u003c/p\u003e\n\u003cp\u003e“Wake up, Dear.”\u003c/p\u003e\n\u003cp\u003eMy eyes fly open to find a faded headrest in front of me. It takes me a moment to find my bearings, to calm my hammering heart.\u003c/p\u003e\n\u003cp\u003e“You were gaspin’ for air somethin’ fierce,” the voice says.\u003c/p\u003e\n\u003cp\u003eI turn to find a lady stooped in the aisle, concern on her deeply wrinkled face, her twisted, old fingers on my shoulder. My body curls into itself before I can stop the knee-jerk response to her touch.\u003c/p\u003e\n\u003cp\u003eShe removes her hand with a gentle smile. “Sorry, Dear. Just thought you should be woken up.”\u003c/p\u003e\n\u003cp\u003eSwallowing, I manage to croak out, “thank you.”\u003c/p\u003e\n\u003cp\u003eShe nods and shifts back to take her seat on the bus. “Must have been some kind a nightmare.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I answer, my usual calm, vacant voice returning. “Can’t wait to wake up.”\u003c/p\u003e\n\u003cp\u003e“We’re here.” I give Livie’s arm a gentle shake. She grumbles and nuzzles her head against the window. I don’t know how she can sleep like that, but she’s managed to, snoring softly for the past six hours. A line of flaky, dry spit snakes down her chin. Super attractive. “Livie,” I call again with an impatient bite in my tone. I need off this tin can. Now.\u003c/p\u003e\n\u003cp\u003eI get a clumsy wave and pouty “don’t bug me, I’m sleeping” lip.\u003c/p\u003e\n\u003cp\u003e“Olivia Cleary!” I snap as passengers rustle through the overhead compartments and gather their belongings. “Come on. I’ve got to get out of here before I lose my shit!” I don’t mean to bark, but I can’t help it. I don’t do well in confined spaces. After twenty-two hours on this damn bus, pulling the emergency hatch and jumping through the window sounds appealing.\u003c/p\u003e\n\u003cp\u003eMy words finally sink in. Livie’s eyelids flutter open and half-dazed blue irises stare out at the Miami bus terminal for a moment. “We made it?” She asks through a yawn, sitting up to stretch and scope out the scenery. “Oh, look! A palm tree!”\u003c/p\u003e\n\u003cp\u003eI’m already standing in the aisle, readying our backpacks. “Yay, palm trees! Come on, let’s go. Unless you want to spend another day going back to Michigan.” That idea gets her body moving.\u003c/p\u003e\n\u003cp\u003eBy the time we step off the bus, the driver has unloaded the luggage from the undercarriage. I quickly spot our matching hot pink suitcases. Our lives, all of our belongings, have been reduced to one suitcase each. It’s all we managed to throw together in our rush out of Uncle Raymond and Aunt Darla’s house. No matter, I tell myself as I throw an arm over my sister’s shoulders in a side hug. We have each other. That’s all that matters.\u003c/p\u003e\n\u003cp\u003e“It’s hot as Hell,” Livie exclaims at the same time that I sense a trickle of sweat run down my back. It’s late morning and the sun already blazes down on us like a fireball in the sky. So different from the autumn chill we left in Grand Rapids. She pulls off her red hoody, earning a string of catcalls from a group of guys on skateboards, ignorant to the ‘do not enter’ sign in that part of the covered parking lot.\u003c/p\u003e\n\u003cp\u003e“Picking up already, Livie?” I tease.\u003c/p\u003e\n\u003cp\u003eHer cheeks explode with pink as she slinks over to hide behind a concrete pillar, out of view.\u003c/p\u003e\n\u003cp\u003e“You do realize you’re not a chameleon, right? ... Oh! The one in the red shirt is coming over here right now.” I stretch my neck expectantly toward the group.\u003c/p\u003e\n\u003cp\u003eLivie’s eyes flash wide with terror for a second before she realizes I’m only joking. “Shut up, Kacey!” she hisses, smacking my shoulder. Livie can’t handle being center stage to any guy. The fact that she’s turned into a raven haired knock-out over the last year hasn’t helped her avoid that.\u003c/p\u003e\n\u003cp\u003eI smirk as I watch her fumble with her sweater. She has no idea how striking she is, and I’m okay with that if I’m going to be her guardian. “Stay clueless, Livie. My life will be so much easier if you’re oblivious for the next, say, five years.”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes. “Okay, Miss Sports Illustrated.”\u003c/p\u003e\n\u003cp\u003e“Ha!” In truth, some of the attention from those asshats probably is directed at me. Two years of intense kick-boxing has given me a rock-hard body. That, topped with my deep auburn hair and watery blue eyes garners loads of unwanted attention.\u003c/p\u003e\n\u003cp\u003eLivie is a fifteen year old version of me. Same light blue eyes, same slender nose, same pale Irish skin. There’s only one big difference, and that’s the color of our hair. If you put towels over our hair, you’d think we were twins. She gets her shiny black color from our mother. She’s also two inches taller than at me, even though I’m five years older.\u003c/p\u003e\n\u003cp\u003eYup, to look at us, anyone with half a brain can tell we’re sisters. But that’s where our similarities end. Livie’s an angel. She tears up when children cry, she apologizes when someone bumps into her, she volunteers in soup kitchens and libraries. She makes excuses for people when they do stupid things. If she was old enough to drive, she’d slam on the brakes for crickets. I’m … I’m not Livie. I might have been more like her before. But not now. Where I’m a looming thundercloud, she’s the sunshine breaking through. \u003c/p\u003e","sourceLink":"https://allnovel.net/ten-tiny-breaths-ten-tiny-breaths-1/page-1.html","bookId":1854,"creation":"Oct 5, 2019 4:19:39 PM","modification":"Oct 5, 2019 4:19:39 PM"}
