{"id":79673,"no":43,"title":"Page 43","content":"\u003cp\u003eMy head falls back against his chest with a mixture of excitement and frustration—excited that Trent is allowing me close to him again after weeks of keeping me away, frustrated that this will end all too abruptly.\u003c/p\u003e\n\u003cp\u003eBut he shows no signs of ending this now as his hands continue up to slip over the contours of my br**sts, cupping their fullness. I hear the sharp intake of air in his lungs. Slowly, he turns me around and pins my arms behind my back.\u003c/p\u003e\n\u003cp\u003eI don’t know why, but I can’t bring myself to look at him, so I stare at the tiny scar line along his collar bone instead, and feel his chest rise and fall against mine, my ni**les hardening as they graze against his skin. My breath comes out in short pants as he leans down and whispers, “Look at me, Kacey.”\u003c/p\u003e\n\u003cp\u003eI do. I look up and let myself sink into those blue eyes, so full of worry and pain and desire.\u003c/p\u003e\n\u003cp\u003e“I’ll make you whole again, Kacey. I promise you, I will,” he whispers. And then his mouth covers mine.\u003c/p\u003e\n\u003cp\u003eI’m faintly aware of the wall now flattening against my back, of his boxers dropping to the ground, of strong arms lifting me up, of my legs wrapping around his hips, of feeling him against me.\u003c/p\u003e\n\u003cp\u003ePushing inside me.\u003c/p\u003e\n\u003cp\u003eMaking me whole.\u003c/p\u003e\n\u003cp\u003eIt’s still dark outside when I wake again. This time my head rests on Trent’s chest, my body entwined with his. His fingers doodling over my back tells me he’s awake. It’s not a nightmare that’s woken me up this time. It’s Storm and Dan’s raised voices through the wall.\u003c/p\u003e\n\u003cp\u003e“He could have killed you, Nora,” Dan yells. “Forget the money. You don’t need the money.”\u003c/p\u003e\n\u003cp\u003eStorm’s voice isn’t nearly as loud or booming, but I manage to hear it all the same.\u003c/p\u003e\n\u003cp\u003e“You think I spent all those years training with a place like Penny’s as my goal? I screwed up, Dan. I made bad choices and I have to live with them. For now. For Mia.”\u003c/p\u003e\n\u003cp\u003e“Mia is who I’m thinking about. What if that guy killed you tonight? Who would take care of her? Her father? From prison?” There’s a quiet moment and then Dan starts yelling again. “I don’t know if I can do this, Nora. I can’t be afraid you’re going to die every time you go to work.”\u003c/p\u003e\n\u003cp\u003eI snort. “Look who’s talking,” I mutter to myself, but then I bite my tongue. This is between them.\u003c/p\u003e\n\u003cp\u003e“Well, I’m not making decisions based on what some man wants because when you’re gone and I’m still here, I have to live with the outcome.” I hear her voice crack at the end and I know she’s crying. The yelling dies down and I’m glad. I don’t want to hear Dan and Storm break up.\u003c/p\u003e\n\u003cp\u003e“Can I ask you something without you getting angry, Kacey?” Trent asks into the darkness.\u003c/p\u003e\n\u003cp\u003e“Uh huh,” I agree without thinking.\u003c/p\u003e\n\u003cp\u003e“What do you know about the driver who hit your car?”\u003c/p\u003e\n\u003cp\u003eMy body instantly tenses. “He was drunk.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“And nothing.”\u003c/p\u003e\n\u003cp\u003e“Nothing at all? No name, face, anything?”\u003c/p\u003e\n\u003cp\u003eI pause, deciding if I want to answer. “Name. That’s it.”\u003c/p\u003e\n\u003cp\u003e“Do you remember it?”\u003c/p\u003e\n\u003cp\u003eI inhale sharply. I’ll never forget. “Sasha Daniels.”\u003c/p\u003e\n\u003cp\u003e“What happened to him?”\u003c/p\u003e\n\u003cp\u003e“He died.”\u003c/p\u003e\n\u003cp\u003eThere’s a long pause as Trent continues drawing swirls on my back and I start to believe the conversation is over. Stupid girl. “Was he alone?”\u003c/p\u003e\n\u003cp\u003eI hesitate but decide to answer. “He had two friends. Derek Maynard and Cole Reynolds. Derek and Sasha weren’t wearing seat belts. They were both thrown from their vehicle.”\u003c/p\u003e\n\u003cp\u003eMy head rises and lowers with Trent’s deep breath. “Has the survivor—this Cole guy—made contact with you?”\u003c/p\u003e\n\u003cp\u003eI close my eyes and enjoy the warmth of Trent’s chest, fighting the dread as he drags me back into the deep, dark place. “His family tried. I filed restraining orders and told the police that if any of them so much as approach me or Livie, I’d kill them all.” At the time, I was bound to a bed and unable to move, let alone murder. Still, the cops came through with passing the message along.\u003c/p\u003e\n\u003cp\u003eNow though, now I know I’m capable of anything.\u003c/p\u003e\n\u003cp\u003eOf murder.\u003c/p\u003e\n\u003cp\u003eTrent’s fingers stop drawing on my back and he hugs me protectively. “I’m going to suggest something, Kacey. Please don’t get mad.”\u003c/p\u003e\n\u003cp\u003eI don’t answer. I just listen to his heartbeat. I let it consume me. I feel it with every fiber of my body.\u003c/p\u003e\n\u003cp\u003e“I think you should meet this Cole guy. Maybe there’d be some sort of closure. You two are the only survivors of a horrific accident. You have something in common.”\u003c/p\u003e\n\u003cp\u003eNow I sit up. I sit up and stare at Trent. I stare at him like he’s grown five heads and set three of them on fire and the other two are eating the flaming heads. Pacing my racing heart and calming myself, I speak.\u003c/p\u003e\n\u003cp\u003e“I will say this once and never again.” My voice is even. I don’t yell, I don’t cry, I don’t shake. “I do not want to see, or talk to, or know Cole Reynolds.” The name twists my mouth with distain. “It was his car that plowed into ours. He handed his keys to his friend who then shattered my life to smithereens. I hope wherever he is, he is suffering. I hope everyone he loves has abandoned him. I hope he doesn’t have a dime and has to eat cat food and maggots. I hope he goes to sleep every night and wakes up reliving that terrible night. Reliving what he did to me. To Livie.” I let out a vacuous sigh and lie back down on Trent’s chest as if unloading that sheer magnitude of hatred is somehow liberating. “And then I hope his balls catch on fire.” My voice is cold and hard. I don’t bother to conceal the hatred of my words. I unleash full-heartedly. I revel in it. Hatred good. Forgiveness bad.\u003c/p\u003e\n\u003cp\u003eSilence takes over as Trent’s arms tighten around me, his chin resting on the top of my head. I feel a new tension in him and I’m not surprised. I stare at the wall and wonder just how screwed up Cole Reynolds’ life really is. I wonder if he’s resorted to working in a strip club to give his sister the life she deserves. I wonder if he had to abandon his dreams of college. I wonder if he winces in pain with every rain fall because his body is held together with metal.\u003c/p\u003e\n\u003cp\u003eBut most of all, I wonder what Trent thinks of his pretty little f**ked up redhead now.\u003c/p\u003e\n\u003cp\u003eI wake up to an empty room and a note on my pillow. Five words.\u003c/p\u003e\n\u003cp\u003eHad to go. I’m sorry.\u003c/p\u003e\n\u003cp\u003eI assume Trent has a new work contract. Still, I’m disappointed. I could use another dose of his body if he’s willing to administer. I roll out of bed and stretch, the horror of last night at Penny’s pushed aside in favor of my memories of a night with Trent. It’s been so long since I felt that. Scratch that. I never felt that. Sex was never like that with Billy. I cared deeply about him, but we were young and inexperienced. Trent’s not inexperienced. Trent knows exactly what he’s doing and he does it very well. And, something’s just different with Trent. He’s like ripe watermelon after a lifetime of thirst. He’s like air after years under water.\u003c/p\u003e\n\u003cp\u003eHe’s like life.\u003c/p\u003e\n\u003cp\u003eStage Six~ Withdrawal\u003c/p\u003e\n\u003cp\u003eChapter Fourteen\u003c/p\u003e\n\u003cp\u003eI walk into Storm’s apartment to find Mia waiting expectantly like a wide-mouth bass while Dan, in striped boxers no less, tosses Cheerios into her mouth. I guess Storm and Dan made up. Relief swells inside me. I like seeing Storm with him.\u003c/p\u003e\n\u003cp\u003eHe stops the game to take me in with a worried look. “How are you feeling today?” \u003c/p\u003e","sourceLink":"https://allnovel.net/ten-tiny-breaths-ten-tiny-breaths-1/page-43.html","bookId":1854,"creation":"Oct 5, 2019 4:19:39 PM","modification":"Oct 5, 2019 4:19:39 PM"}
