{"id":79685,"no":55,"title":"Page 55","content":"\u003cp\u003eWith a slow, cautious movement, he lifts a shaky hand and presses it against the glass. He holds it there.\u003c/p\u003e\n\u003cp\u003eAnd I can’t help myself.\u003c/p\u003e\n\u003cp\u003eI match my fingers perfectly to his, imagining what it would be like to feel his skin again, to have those fingers curl over mine, pull me into him, into his warmth. Into his life.\u003c/p\u003e\n\u003cp\u003eWe stay like that, hand against hand, tears rolling down my cheeks, for a long moment. Then his hand drops back to his lap and his voice turns soft.\u003c/p\u003e\n\u003cp\u003e“I wanted to tell you in person that, even though my intentions were wrong,” now he levels the glass with a gaze full of heat and emotion. One of his Trent stares that buckles my knees. “What I felt for you was real, Kacey. It still is real. I just can’t hold onto it anymore. We both need a chance to heal.”\u003c/p\u003e\n\u003cp\u003eMy heart leaps into my throat. “It is still real,” I confirm out loud, softly. It is real.\u003c/p\u003e\n\u003cp\u003eFresh tears spill down my cheeks as I realize what’s happening.\u003c/p\u003e\n\u003cp\u003eTrent is saying good-bye.\u003c/p\u003e\n\u003cp\u003e“I hope that one day you can heal from all of this, and someone can make you laugh. You have such a beautiful laugh, Kacey Cleary.”\u003c/p\u003e\n\u003cp\u003e“No,” I whisper suddenly, my brow furrowing. “No!’ Both of my hands fly to the glass to pound on it. I’m not ready for good-bye, I realize. Not like this. Not yet.\u003c/p\u003e\n\u003cp\u003eMaybe not ever.\u003c/p\u003e\n\u003cp\u003eI can’t explain it. I sure as hell don’t want to feel it. But I do.\u003c/p\u003e\n\u003cp\u003eI hold my breath as I watch Trent stand and walk out of the room, stiff-backed. The sight of the door closing—of Trent walking out of my life forever—unleashes a torrent of sobs and I tumble to the ground.\u003c/p\u003e\n\u003cp\u003eChapter Twenty\u003c/p\u003e\n\u003cp\u003eI study the titles in Dr. Stayner’s library, busying myself so I don’t have to look at the fat lip I gave him after yesterday’s group session. It complements the black eye I gave him in last week’s session. Since the day Trent said good-bye, I feel emptier than ever before. There can be no doubt—Trent or Cole, mistake or murderer—that man had a strong hold on my heart, and he’s taken a chunk of it with him.\u003c/p\u003e\n\u003cp\u003e“So, my sons have taken to calling Wednesday’s “Dad’s Ass Whooping Wednesdays,” Dr. Stayner announces.\u003c/p\u003e\n\u003cp\u003eWell, now that the moose is on the table, I can’t very well avoid it. “Sorry,” I mumble, hazarding a glance at his face and wincing.\u003c/p\u003e\n\u003cp\u003eHe smiles. “Don’t be. I know I pushed you a bit harder than I probably should have. Normally I ease my patients into talking about their trauma. I thought a more aggressive approach might work for you.”\u003c/p\u003e\n\u003cp\u003e“What gave you that brilliant idea?”\u003c/p\u003e\n\u003cp\u003e“Because you’ve compartmentalized your emotions and pain so tightly that we might need dy***ite to break through,” he jokes. “I mean, look at you. You’re a trained fighter. You could probably set my sons straight. In fact, I might have you over for dinner to beat the snot out of them soon.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes at my unconventional quack of a doctor. “I wouldn’t go that far.”\u003c/p\u003e\n\u003cp\u003e“I would. You’ve taken all that tragedy and channeled into one hell of a tough defense mechanism.” His voice turns softer. “But all defense mechanisms can be broken. I think you’ve already learned that.\u003c/p\u003e\n\u003cp\u003e“Trent—” His name drifts over my tongue.\u003c/p\u003e\n\u003cp\u003eHe nods. “We’re not going to talk about the accident today.” My shoulders slump with that news. That’s usually all Dr. Stayner wants to talk about. I wait as he makes himself comfortable in his chair. “We’re going to talk about coping. About all the ways that a person can cope. The good, the bad, the ugly.”\u003c/p\u003e\n\u003cp\u003eDr. Stayner goes through a laundry list of coping mechanisms, marking each one off on a finger, cycling through his hands several times. “Drugs, alcohol, sex, anorexia, violence—” I sit and listen, wondering where he’s going with it all. “An obsession with ‘saving’ or ‘fixing’ that which is broken.” I know who he’s talking about.\u003c/p\u003e\n\u003cp\u003eI was Trent’s coping mechanism.\u003c/p\u003e\n\u003cp\u003e“All these mechanisms seem like they help at the time, but in the end, they leave you weak and vulnerable. They’re not healthy. They’re not sustainable. No human can lead a healthy fulfilling life with lines of cocaine by their bedside. Make sense so far?”\u003c/p\u003e\n\u003cp\u003eI nod. I’m no good for Trent. That’s what Dr. Stayner is saying. That’s why Trent said good-bye. The wound inside is still raw from that day, but I don’t bury the pain. I’m done burying things. There’s no point. Dr. Stayner will drag it right back where it’s impossible to avoid, like a buffalo carcass sprawled out on a one lane highway.\u003c/p\u003e\n\u003cp\u003e“Good. Now, Kacey, we need to find you a coping method that works for you. Kick boxing is not it. It helps you channel your rage, yes. But let’s find a way to permanently extinguish that rage. I want you to brainstorm with me. What do you think are healthy coping mechanisms?”\u003c/p\u003e\n\u003cp\u003e“If I knew, I’d be doing them, wouldn’t I?”\u003c/p\u003e\n\u003cp\u003eI get an eye roll. An eye roll from a professional. “Come on now, you’re a smart girl. Think back to all the things you’ve heard. What other people have suggested. I’ll get you started. Talking to others about the trauma is one.”\u003c/p\u003e\n\u003cp\u003eNow it’s my turn to roll my eyes at him.\u003c/p\u003e\n\u003cp\u003eDr. Stayner waves his hands dismissively. “I know, I know. Believe me, you’ve made yourself clear. But talking about your pain and sharing it with others is one of the most powerful ways to cope. It helps you release the hurt, not bottle it up until you explode. Other ways to cope include painting, and reading, setting goals, journaling about your feelings.”\u003c/p\u003e\n\u003cp\u003eHmmm. I could do journaling. It’s still a private activity.\u003c/p\u003e\n\u003cp\u003e“Yoga’s fantastic too. It helps clear your mind, it makes you focus on your breathing.”\u003c/p\u003e\n\u003cp\u003eBreathing. “Ten tiny breaths,” I murmur more to myself, feeling my lips curl with the irony.\u003c/p\u003e\n\u003cp\u003e“What’s that?” Dr. Stayner leans forward, pushing his bifocals up with one finger.\u003c/p\u003e\n\u003cp\u003eI shake my head. “No, nothing. Something my mother used to say. Take ten tiny breaths.”\u003c/p\u003e\n\u003cp\u003e“When did she say that?”\u003c/p\u003e\n\u003cp\u003e“Whenever I was sad or upset or nervous.”\u003c/p\u003e\n\u003cp\u003eDr. Stayner’s fingers rub his chin. “I see, and did she say anything else? Do you remember?”\u003c/p\u003e\n\u003cp\u003eI smirk. Of course I remember. It’s firmly emblazoned in my head. “She would say, ‘Just breathe, Kacey. Ten tiny breaths. Seize them. Feel them. Love them.’”\u003c/p\u003e\n\u003cp\u003eThere’s a long pause. “And what do you think she meant by that?”\u003c/p\u003e\n\u003cp\u003eI frown irritably. “She was telling me to breathe.”\u003c/p\u003e\n\u003cp\u003e“Hmmm.” He rolls a pen over the surface of his desk as if in deep thought. “And how will tiny breaths help? Why tiny? Why not deep breaths?”\u003c/p\u003e\n\u003cp\u003eI slap my hands on his desk. “That’s what I always asked. Now you see.”\u003c/p\u003e\n\u003cp\u003eBut he doesn’t see. By the tiny crook of his lips, he sees something different. Something that I don’t see. “Do you think it matters if they’re tiny or deep?”\u003c/p\u003e\n\u003cp\u003eI scowl. I don’t like these kinds of games. “What do you think she meant by it?”\u003c/p\u003e\n\u003cp\u003e“What do you think she meant by it?”\u003c/p\u003e\n\u003cp\u003eI want to punch Dr. Stayner in the mouth again. I really, really want to punch him again.\u003c/p\u003e\n\u003cp\u003eJust breathe, Kacey. Ten tiny breaths. Seize them. Feel them. Love them. I play these words over and over in my head like I have a thousand times before to no avail, as I lie awake in my cell that’s not actually a cell. It’s a nice small room with a private bath and sunny yellow walls, but I feel confined all the same. \u003c/p\u003e","sourceLink":"https://allnovel.net/ten-tiny-breaths-ten-tiny-breaths-1/page-55.html","bookId":1854,"creation":"Oct 5, 2019 4:19:39 PM","modification":"Oct 5, 2019 4:19:39 PM"}
