{"id":69430,"no":10,"title":"Page 10","content":"\u003cp\u003eThe planet of Lockmania, inhabitated though it was by intelligent beings that looked like large wombats, had adopted the American legal system, and Ferdinand Feghoot had been sent there by the Earth Confederation to study the results.\u003c/p\u003e\n\u003cp\u003eFeghoot watched with interest as a husband and wife were brought in, charged with disturbing the peace. During a religious observation, when for twenty minutes the congregation was supposed to maintain silence, while concentrating on their sins and visualizing them as melting away, the woman had suddenly risen from her squatting position and screamed loudly. When someone rose to object, the man had pushed him forcefully.\u003c/p\u003e\n\u003cp\u003eThe judges listened solemnly, fined the woman a silver dollar, and the man a twenty-dollar gold piece.\u003c/p\u003e\n\u003cp\u003eAlmost immediately afterward, seventeen men and women were brought in. They had been ringleaders of a crowd that had demonstrated for better quality meat at a supermarket. They had torn the supermarket apart and inflicted various bruises and lacerations on eight of the employees of the establishment.\u003c/p\u003e\n\u003cp\u003eAgain the judges listened solemnly, and fined the seventeen a silver dollar apiece.\u003c/p\u003e\n\u003cp\u003eAfterward, Feghoot said to the chief judge. \"I approved of your handling of the man and woman who disturbed the peace.\"\u003c/p\u003e\n\u003cp\u003e\"It was a simple case,\" said the judge. \"We have a legal maxim that goes, \u0027Screech is silver, but violence is golden.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"In that case,\" said Feghoot, \"why did you fine the group of seventeen a silver dollar apiece when they had committed far worse violence?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, that\u0027s another legal maxim,\" said the judge. \"Every crowd has a silver fining.\"\u003c/p\u003e","sourceLink":"https://allnovel.net/gold-the-final-science-fiction-collection/page-10.html","bookId":1733,"creation":"Oct 5, 2019 10:13:11 AM","modification":"Oct 5, 2019 10:13:11 AM"}
