{"id":98743,"no":28,"title":"Page 28","content":"\u003cp\u003eThere is fear in the infinite, in the unlimited chaos of the unstructured. But this boundless \"place\" is the never-ending resource of that which you call talent, that ability which peels away the fear, exposing its structure and form, creating beauty. This is why the talented people among you are feared. And it is wise to fear the unknown, but only until you see the new-found fearlessness which identity beautifies.\u003c/p\u003e\n\u003cp\u003e- Kerro Panille, Translations from the Avata\u003c/p\u003e\n\u003cp\u003eFOR A concentrated surge of time, Hali Ekel stood at the inner ring of the throng and stared up at the three men so cruelly suspended. It was a nightmare scene - the blood, the dust, the orange light which threw grotesque shadows on the doomed men, the sense of latent violence in every movement around her.\u003c/p\u003e\n\u003cp\u003eI\u0027m an observer, observer, observe....\u003c/p\u003e\n\u003cp\u003eHer chest hurt when she breathed and she could smell the blood dripping from Yaisuah\u0027s nailed feet.\u003c/p\u003e\n\u003cp\u003eI could save him. She took one shuffling half-step forward.\u003c/p\u003e\n\u003cp\u003eDon\u0027t interfere. Ship\u0027s command stopped her. It was not in her to disobey that command. The conditioning of WorShip was too strong.\u003c/p\u003e\n\u003cp\u003eBut he\u0027ll die there and he\u0027s just like me!\u003c/p\u003e\n\u003cp\u003eHe is not just like you.\u003c/p\u003e\n\u003cp\u003eBut he\u0027....\u003c/p\u003e\n\u003cp\u003eNo, Ekel. When the time comes, he will remember who he is and he will go back just as you will go back. But you two are profoundly different.\u003c/p\u003e\n\u003cp\u003eWho is he?\u003c/p\u003e\n\u003cp\u003eHe is Yaisuah, the man who speaks to God.\u003c/p\u003e\n\u003cp\u003eBut h.... I mean, why are they doing this to him? What did he do?\u003c/p\u003e\n\u003cp\u003eHe reported his conversations. Now, they try to move God in this way. Observe. This is not the way.\u003c/p\u003e\n\u003cp\u003eGod? But God is Ship and Ship is God.\u003c/p\u003e\n\u003cp\u003eAnd the infinite is infinite.\u003c/p\u003e\n\u003cp\u003eWhy won\u0027t you let me save him?\u003c/p\u003e\n\u003cp\u003eYou could not save him.\u003c/p\u003e\n\u003cp\u003eI could try.\u003c/p\u003e\n\u003cp\u003eYou would only inflict pain on that old flesh which you have borrowed. That flesh has enough pains. Why would you want to make it suffer more?\u003c/p\u003e\n\u003cp\u003eIt occurred to her then that there might be another consciousness waiting somewhere to re-enter this body. Borrowed. She had not thought of it that way. The idea made her intensely aware of responsibility toward the body. She forced her attention away from the dangling figure of Yaisuah - those bleeding feet and palms.\u003c/p\u003e\n\u003cp\u003eThe other two men began struggling against their restraints. Hali saw the cruel reason behind this torture then. In time, they would smother. Their chest muscles would fail and respiration would stop. The roped men pushed their feet against the wooden uprights, trying for leverage, seeking another few blinks of life.\u003c/p\u003e\n\u003cp\u003eOne of the armored men saw this and laughed. \"Look at the thieves squirm!\"\u003c/p\u003e\n\u003cp\u003eSomeone in the crowd behind Hali jeered: \"They\u0027re trying to steal a little more time!\"\u003c/p\u003e\n\u003cp\u003eOne of the roped men looked down at his armored tormentor and groaned: \"You\u0027d hang your own mother.\" He gasped for another breath, and Hali saw the effort of it in his chest muscles. As he exhaled, he moved his head feebly toward Yaisuah. \"This man here did nothing illega....\"\u003c/p\u003e\n\u003cp\u003eThe armored man swung his spear butt and smashed the speaker\u0027s knees. The thief sagged and writhed in a final rattling agony. As he did this, Yaisuah stirred and turned toward him.\u003c/p\u003e\n\u003cp\u003e\"Today, you go home with me,\" Yaisuah said.\u003c/p\u003e\n\u003cp\u003eIt was said in a low tone, but most of the crowd heard him. The words were repeated for some few on the outskirts who had missed it.\u003c/p\u003e\n\u003cp\u003eThe armored man laughed, said: \"Bullshit!\" He swung his spear butt once more and broke the other thief\u0027s knees. This man, too, collapsed in a spasm of choking gasps.\u003c/p\u003e\n\u003cp\u003eYaisuah lifted his head, then called out: \"I\u0027m thirsty.\"\u003c/p\u003e\n\u003cp\u003eThe spear-swinger looked up at him. \"The poor boy\u0027s thirsty! We should give him something nice to drink.\"\u003c/p\u003e\n\u003cp\u003eHali wanted to turn away, but could not move. What had made these men into such beasts? She searched around her for something in which to give the dying man a drink.\u003c/p\u003e\n\u003cp\u003eOnce more, Ship warned her: Let this happen, Ekel! This is a necessary lesson. These people must learn how to live.\u003c/p\u003e\n\u003cp\u003eSome of the crowd began to leave. The show was over. Hali found herself alone on one side of the dying man, only a few women across from he.... and the armored guardians of this torment. A young boy came running up with a jug which he handed to the armored man who had smashed the knees of the thieves. Hali saw a coin passed to the boy. He bit it and turned away, not even looking at the condemned men.\u003c/p\u003e\n\u003cp\u003eThe armored man fastened a rag to the end of his spear, poured some of the jug\u0027s contents on it and pushed the rag up to the dying man\u0027s mouth.\u003c/p\u003e\n\u003cp\u003eHali detected the odor of acetic acid. Vinegar!\u003c/p\u003e\n\u003cp\u003eBut Yaisuah sucked at the rag hungrily. The moisture spread across his cracked and bloody mouth. As the rag was pulled away, he slumped forward, once more unconscious.\u003c/p\u003e\n\u003cp\u003eAn older man across from Hali called out: \"He\u0027d better die before sundown. We can\u0027t leave him up there for the Sabbath.\"\u003c/p\u003e\n\u003cp\u003e\"Easily done.\" The armored man had taken the rag from his spear. He turned, ready to swing it against Yaisuah\u0027s knees. In that instant, the light faded, darkness spread over the landscape. A moan spread through the crowd. Hali glanced up, saw a partial eclipse behind the clouds.\u003c/p\u003e\n\u003cp\u003eA young woman broke from the crowd opposite Hali and grabbed the soldier\u0027s spear.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t!\" she cried. \"Let him be. He\u0027s nearly gone.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s it worth to you?\"\u003c/p\u003e\n\u003cp\u003eThe young woman looked up at Yaisuah, who took this moment to twist in delirium. She looked back at the spearman. Her back was to her companions and she faced only Hali as she lifted the spearman\u0027s hand and placed it on her breast inside her robe. At that instant, Yaisuah arched his back against the wooden upright and called out: \"Father! Father, why have you forsaken me?\"\u003c/p\u003e\n\u003cp\u003eA great breath shuddered through him. His eyes opened, his gaze directly on Hali.\u003c/p\u003e\n\u003cp\u003e\"It is finished.\" he said. He fell forward, eyes still open, and did not take another breath.\u003c/p\u003e\n\u003cp\u003eThe abrupt hush was shattered by the wailing of a woman in the group across from Hali. Others joined in, tearing at their garments. The armored man took his hand away from the young woman\u0027s breast.\u003c/p\u003e\n\u003cp\u003eHali stood fixed in place, staring up at the dead man. As she looked, the sunlight returned. A wind picked up the hem of her robe; it chilled her. She could see the armored men moving off, one of them with an arm around the shoulder of the young woman who had stopped the spear blow. Hali turned away and headed down the hill, unable to watch more. She spoke to Ship as she moved.\u003c/p\u003e\n\u003cp\u003eShip?\u003c/p\u003e\n\u003cp\u003eYes, Ekel?\u003c/p\u003e\n\u003cp\u003eIs there a history of this event in the shipside records?\u003c/p\u003e\n\u003cp\u003eIt is there for the asking. You who were raised shipside have not had much reason to ask, especially those of you whose ancestors came from places where this was not common knowledge.\u003c/p\u003e\n\u003cp\u003eIs this real, him dying there just now?\u003c/p\u003e\n\u003cp\u003eAs real as your flesh waiting shipside.\u003c/p\u003e\n\u003cp\u003eShe felt the tug of that remembered flesh then. This tired old body was such a poor vehicle by comparison. She felt joints aching as she stumbled down the hillside.\u003c/p\u003e\n\u003cp\u003eI want to go back, Ship.\u003c/p\u003e\n\u003cp\u003eNot yet.\u003c/p\u003e\n\u003cp\u003eIf Yaisuah was a projection, why didn\u0027t his body disintegrate when he died?\u003c/p\u003e\n\u003cp\u003eActive imagination supports him. It is essential to such phenomena. If I were to forget about the you that is shipside or the you that is here, the forgotten flesh would disappear.\u003c/p\u003e\n\u003cp\u003eBut he\u0027s dead. What good is it to keep his flesh intact?\u003c/p\u003e\n\u003cp\u003eThe survivors require something to bury. They will return to his tomb one day and find it empty. It will be a marvel. They will say he returned to life and walked from his tomb.\u003c/p\u003e\n\u003cp\u003eWill he do that?\u003c/p\u003e\n\u003cp\u003eThat is not part of your lesson, Ekel.\u003c/p\u003e\n\u003cp\u003eIf this is a lesson, I want to know what happens to him!\u003c/p\u003e\n\u003cp\u003eAhhhh, Ekel, you want so much!\u003c/p\u003e\n\u003cp\u003eWon\u0027t You tell me?\u003c/p\u003e\n\u003cp\u003eI will tell you this: Those who remember him travel this world over teaching peace and love. For this they suffer murder and torture and they incite great wars in his name, many bloody events even worse than what you have just seen.\u003c/p\u003e\n\u003cp\u003eShe stopped. There were rude buildings just ahead and she felt that she would be more protected in among them. They were more lik.... corridors, like Ship\u0027s own passages. But she was filled with outrage. What kind of a lesson is this? What good is it?\u003c/p\u003e\n\u003cp\u003eEkel, your kind cannot learn peace until you are drenched in violence. You have to disgust yourselves beyond all anger and fear until you learn that neither extortion nor exhortation moves a god. Then you need something to which you can cling. All this takes a long time. It is a difficult lesson.\u003c/p\u003e\n\u003cp\u003eWhy?\u003c/p\u003e\n\u003cp\u003ePartly because of your doubts.\u003c/p\u003e\n\u003cp\u003eIs that why You brought me here? To settle my doubts?\u003c/p\u003e\n\u003cp\u003eThere was no response and she felt suddenly bereft, as though Ship had abandoned her. Would Ship do that?\u003c/p\u003e\n\u003cp\u003eShip?\u003c/p\u003e\n\u003cp\u003eWhat do you hear, Ekel?\u003c/p\u003e\n\u003cp\u003eShe bent her head, listening. Hurried footsteps. She turned. A group of people rushed past her down the hillside. A young man hurried behind this group. He stopped beside Hali.\u003c/p\u003e\n\u003cp\u003e\"You stayed the whole time and did not curse him. Did you love him, too?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. The young man\u0027s voice was rich and compelling. He took her hand.\u003c/p\u003e\n\u003cp\u003e\"I am called John. Will you pray with me in this hour of our sadness?\"\u003c/p\u003e\n\u003cp\u003eShe nodded and touched her lips pretending that she could not speak.\u003c/p\u003e\n\u003cp\u003e\"Oh, dear woman. If he had but said the word, your affliction would have passed from you. He was a great man. They mocked him as the son of God, but all he claimed was a kinship to Man. \u0027The Son of Man,\u0027 he said. That is the difference between gods and men - gods do not murder their children. They do not exterminate themselves.\"\u003c/p\u003e\n\u003cp\u003eShe sensed then in this young man\u0027s manner and his voice the power of that event on the hillside. It frightened her, but she realized that this encounter was an important part of what Ship wanted her to experience.\u003c/p\u003e\n\u003cp\u003eSome things break free of Time, she thought.\u003c/p\u003e\n\u003cp\u003eYou can come back to your own flesh now, Ekel, Ship said.\u003c/p\u003e\n\u003cp\u003eWait!\u003c/p\u003e\n\u003cp\u003eJohn was praying, his eyes closed, his grip firm on her hand. She felt it was vital to hear his words.\u003c/p\u003e\n\u003cp\u003e\"Lord,\" he said, \"we are gathered here in your name. One in the foolishness of youth and the other infirm with age, we ask that you remember us as we remember you. As long as there are eyes to read and ears to hear, you will not be forgotten....\"\u003c/p\u003e\n\u003cp\u003eShe listened to the earnestness of the prayer as it unraveled from his mind. The firm touch of his hand pleased her. There were faint veins on his eyelids which trembled as he spoke. She did not even mind the universal stink which came from him as it came from all of those she had encountered here. He was dark, like Kerro, but he had wild, wiry hair that framed his smooth face and accented his intensity.\u003c/p\u003e\n\u003cp\u003eI could love this man!\u003c/p\u003e\n\u003cp\u003eCareful, Ekel.\u003c/p\u003e\n\u003cp\u003eShip\u0027s warning amused her as much as her own thought had surprised her. But one look at the old, liver-spotted hand that John held reminded her she walked in another time. This was an old woman\u0027s body which enclosed her awareness.\u003c/p\u003e\n\u003cp\u003e\"...we ask this in Yaisuah\u0027s name,\" John concluded. He released her hand, patted her shoulder. \"It would not be good for you to be seen with us.\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e\"Soon we will meet again,\" he said, \"at this house or that, and we will talk more of the Master and the home to which he has returned.\"\u003c/p\u003e\n\u003cp\u003eShe thanked him with her eyes and watched him until he turned a corner and was gone among the houses below her.\u003c/p\u003e\n\u003cp\u003eI want to go home, Ship.\u003c/p\u003e\n\u003cp\u003eThere came a moment of blankness and, once more, the tunnel passage, then the lab\u0027s dazzling lights pained her eyes after the Earthside dusk.\u003c/p\u003e\n\u003cp\u003eBut those other eyes weren\u0027t the same as these eyes!\u003c/p\u003e\n\u003cp\u003eShe sat up, feeling the vital agility of this familiar flesh. It reassured her that Ship had kept the promise to return her to her own body.\u003c/p\u003e\n\u003cp\u003eShip?\u003c/p\u003e\n\u003cp\u003eAsk, Ekel.\u003c/p\u003e\n\u003cp\u003eYou said I would learn about interfering with Time. Did I interfere?\u003c/p\u003e\n\u003cp\u003eI interfered, Ekel. Do you understand the consequences?\u003c/p\u003e\n\u003cp\u003eShe thought about John\u0027s voice in prayer, the power in him - the terrible power which Yaisuah\u0027s death had released. It was unleashed power, capable of joy or agony. The sense of that power terrified her. Ship interfered and this power resulted. What good was such power?\u003c/p\u003e\n\u003cp\u003eWhat is your choice, Ekel?\u003c/p\u003e\n\u003cp\u003eJoy or agony - the choice is mine?\u003c/p\u003e\n\u003cp\u003eWhat choice, Ekel?\u003c/p\u003e\n\u003cp\u003eHow do I choose?\u003c/p\u003e\n\u003cp\u003eBy choosing, by learning.\u003c/p\u003e\n\u003cp\u003eI do not want that power!\u003c/p\u003e\n\u003cp\u003eBut now you have it.\u003c/p\u003e\n\u003cp\u003eWhy?\u003c/p\u003e\n\u003cp\u003eBecause you asked.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know.\u003c/p\u003e\n\u003cp\u003eThat is often the case when you ask.\u003c/p\u003e\n\u003cp\u003eI want joy but I don\u0027t know how to choose!\u003c/p\u003e\n\u003cp\u003eYou will learn.\u003c/p\u003e\n\u003cp\u003eShe swung her feet off the yellow couch, crossed to the screen and keyboard where this terrifying experience had begun. Her mind felt ancient suddenly, an old mind in a young body.\u003c/p\u003e\n\u003cp\u003eI did ask; I started i.... back in that ancient time when all I wanted was Kerro Panille.\u003c/p\u003e\n\u003cp\u003eShe sat down at the keyboard and stared into the screen. Her fingers strayed over the keys. They felt familiar, yet strange. Kerro\u0027s fingers had touched these keys. She saw this instrument suddenly as a container which held raw experiences at a distance. You did not have to go in person. This machine made terrible things acceptable. She took a deep breath and punched the keys: ANCIENT HISTORY RECORDS - YAISUAH/JESUS.\u003c/p\u003e\n\u003cp\u003eBut Ship was not through intruding.\u003c/p\u003e\n\u003cp\u003eIf there is any of it you wish to see in person, Ekel, you have but to ask.\u003c/p\u003e\n\u003cp\u003eThe very thought sent shudders through her body.\u003c/p\u003e\n\u003cp\u003eThis is my body and I\u0027m staying in it.\u003c/p\u003e\n\u003cp\u003eThat, Ekel, is a choice which you may have to share. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-28.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
