{"id":98747,"no":32,"title":"Page 32","content":"\u003cp\u003eHumans spend their lives in mazes. If they escape and cannot find another maze, they create one. What is this passion for testing?\u003c/p\u003e\n\u003cp\u003e- Kerro Panille, Questions from the Avata\u003c/p\u003e\n\u003cp\u003eRAJA THOMAS awoke in darkness and it was like that most recent time, awakening in hyb. He found himself disoriented in darkness, waiting for dangers he could not locate. Slowly, it came to him that he was in his groundside cubb.... night. He glanced at the luminous time display beside his pallet: two hours into the midnight watch.\u003c/p\u003e\n\u003cp\u003eWhat awakened me?\u003c/p\u003e\n\u003cp\u003eHis cubby was eight levels under the Pandoran surface, a choice location cushioned from surface noises and perils by numerous color-coded passages, locks, hatches, slide-tubes and seemingly endless branchings. The Ship-trained found no difficulty recording mental maps of such layouts, the more remote the address the better. Thomas resented being buried in these depths. Too much travel time to places which demanded his attention.\u003c/p\u003e\n\u003cp\u003eLab One.\u003c/p\u003e\n\u003cp\u003eHe had gone to sleep while wondering about that restricted place. The source of so many odd rumors.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re breeding people who\u0027re faster than the demons.\"\u003c/p\u003e\n\u003cp\u003eThat was the popular story.\u003c/p\u003e\n\u003cp\u003e\"Oakes and Lewis want nothing but servile zombies!\"\u003c/p\u003e\n\u003cp\u003eThomas had heard that story from one of the new militants, a fiery young woman associate of Rachel Demarest.\u003c/p\u003e\n\u003cp\u003eSlowly, he sat up and tried to probe the darkness around him.\u003c/p\u003e\n\u003cp\u003eOdd I should awaken at this hour.\u003c/p\u003e\n\u003cp\u003eHe touched the light plate on the wall beside his head and a dim glow replaced the dark. The cubby appeared boringly normal: his singlesuit draped over a slidesea.... sandals. Everything as it should be.\u003c/p\u003e\n\u003cp\u003e\"I feel like a damned Spinneret down here.\"\u003c/p\u003e\n\u003cp\u003eHe spoke it aloud while rubbing his face. Presently, he summoned a servo, then slipped into his clothing while waiting for it. The servo buzzed his hatch and he stepped out into an empty passage lighted by the widely spaced ceiling bulbs of nightside. Seating himself in the servo, he ordered it to take him topside. He felt oppressed by the travel time, the weight of construction overhead.\u003c/p\u003e\n\u003cp\u003eI never needed open spaces shipside. Maybe I\u0027m going native.\u003c/p\u003e\n\u003cp\u003eThe servo emitted an irritating hum full of subsonics.\u003c/p\u003e\n\u003cp\u003eAt the surface autosentry checkpoint, he keyed his code into the system. With the green go signal came the blinking yellow light for Condition 2. He swore under his breath, then turned to the lockers beside the topside hatch and took out a lasgun. He knew the hatch would not open unless he did this. The weapon felt clumsy in his hands and, when he holstered it, he was intensely conscious of the weight at his waist.\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t take much sense to know you shouldn\u0027t live in a place if you have to carry a gun.\" He muttered it, but his voice was loud enough that the blue acknowledge light winked at him from the sentry plate.\u003c/p\u003e\n\u003cp\u003eStill the hatch remained sealed to him. His hand was moving toward the override switch when he saw the little blinker at the bottom of the plate demanding: \"Purpose of movement?\"\u003c/p\u003e\n\u003cp\u003e\"Work inspection,\" he said.\u003c/p\u003e\n\u003cp\u003eThe system digested this, then opened the hatch.\u003c/p\u003e\n\u003cp\u003eThomas slipped off the servo and strode out into the topside corridors, sure now of why he had awakened at this hour.\u003c/p\u003e\n\u003cp\u003eLab One.\u003c/p\u003e\n\u003cp\u003eIt was a mystery of peculiar odor.\u003c/p\u003e\n\u003cp\u003eHe found himself presently in the darkened perimeter halls, passing an occasional worker and the well-spaced extrusions of sentry posts, each with its armed occupant paying attention only to the nightside landscape.\u003c/p\u003e\n\u003cp\u003ePlaz ports showed Thomas that it was moonlight out there, two moons quartering the southern horizon. Pandora\u0027s night was a buzz of shadows.\u003c/p\u003e\n\u003cp\u003eAfter a space, the ring passage ramped downward into a hatch-distribution dome about thirty meters in diameter. The passage to Lab One was indicated by an \"L-1\" sign on his right. He had taken only two steps toward it when it opened and a woman emerged, slamming the hatch behind her. It was dim in the dome, lighted only by the moonlight coming in through plaz ports on his left, but there was no mistaking the almost disjointed agitation in her movements.\u003c/p\u003e\n\u003cp\u003eThe woman darted toward him, grabbing his arm as he passed, dragging him along toward the external ports with a strength which astonished him.\u003c/p\u003e\n\u003cp\u003e\"Come here! I need you.\"\u003c/p\u003e\n\u003cp\u003eHer voice was husky and full of odd undertones. Her face and arms were a mass of scratches and he sensed the unmistakable odor of blood on her light singlesuit.\u003c/p\u003e\n\u003cp\u003e\"Wha....\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t question me!\"\u003c/p\u003e\n\u003cp\u003eThere was wildness, a touch of insanity, in her voice.\u003c/p\u003e\n\u003cp\u003eAnd she was beautiful.\u003c/p\u003e\n\u003cp\u003eShe released him when they reached the barrier wall, and he saw the dim outline of an emergency hatch to Pandora\u0027s perilous open air. Her hands were busy at the hatch controls, keying the override system in a way that did not set off the alarms. One of her hands reached out and grabbed his right wrist, guiding his hand to the lock mechanism. Such strength in her!\u003c/p\u003e\n\u003cp\u003e\"When I say so, open this hatch. Wait twenty-three minutes, then look for me. Let me in.\"\u003c/p\u003e\n\u003cp\u003eBefore he could find the words to protest, she slipped out of her singlesuit and thrust it at him. He caught it involuntarily with his free hand. She already was crouching to thong her feet and he saw that she had a magnificent body - smooth muscles, a supple perfection - but swatches of Celltape criss-crossed her skin.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happened to you?\"\u003c/p\u003e\n\u003cp\u003e\"I warned you once not to question.\" She spoke without looking up, and he sensed the wild power in her. Dangerous. Very dangerous. No inhibitions.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to run the P,\" he said. He glanced around, looking for someone, anyone, to call on for help. The circle of the distribution dome contained no other people.\u003c/p\u003e\n\u003cp\u003e\"Bet on me,\" she said, standing.\u003c/p\u003e\n\u003cp\u003e\"How will I tell the twenty-three minutes?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe crowded close to him and slapped a panel beside the emergency hatch. Immediately, he heard the sentry circuit\u0027s hum, then a deep male voice: \"Post Nine clear.\"\u003c/p\u003e\n\u003cp\u003eA tiny screen above the circuit speaker glowed with red numerals: 2:29.\u003c/p\u003e\n\u003cp\u003e\"The hatch,\" she said.\u003c/p\u003e\n\u003cp\u003eThere was no way to avoid it; he had felt her wild strength. He undogged the hatch and she thrust past him, swinging it wide as she dashed out into the open, turning right. Her body was a silver blur in the moonlight and he saw a dark shadow coming up behind her. His gun was in his hand without thinking about it and he cooked a Hooded Dasher that was only a step behind her. She did not turn.\u003c/p\u003e\n\u003cp\u003eHis hands were shaking as he resealed the hatch.\u003c/p\u003e\n\u003cp\u003eRunning the P!\u003c/p\u003e\n\u003cp\u003eHe glanced at the time signal: 2:29. She had said twenty-three minutes. That would put her back at the hatch by 2:52.\u003c/p\u003e\n\u003cp\u003eIt occurred to him then that the perimeter was just under ten kilometers.\u003c/p\u003e\n\u003cp\u003eIt can\u0027t be done! No one can run ten kilometers in twenty-three minutes!\u003c/p\u003e\n\u003cp\u003eBut she had come from the passage to Lab One. He unwadded her singlesuit. Blood on it, no doubt of that. Her name was stitched over the left breast: Legata.\u003c/p\u003e\n\u003cp\u003eHe wondered if it was a first or last name.\u003c/p\u003e\n\u003cp\u003eOr a title?\u003c/p\u003e\n\u003cp\u003eHe peered out of the plaz port, looking to the left where she would have to appear if she really did run the perimeter.\u003c/p\u003e\n\u003cp\u003eWhat would a Legata be?\u003c/p\u003e\n\u003cp\u003eA voice on the sentry circuit startled him: \"Someone\u0027s out there, pretty far out.\"\u003c/p\u003e\n\u003cp\u003eAnother voice answered: \"It\u0027s a woman running the P. She just rounded Post Thirty-Eight.\"\u003c/p\u003e\n\u003cp\u003e\"Who is it?\"\u003c/p\u003e\n\u003cp\u003e\"Too far out to identify.\"\u003c/p\u003e\n\u003cp\u003eThomas found himself praying for her to make it as he listened to each succeeding post report the runner. But he knew there was not much chance. Since learning about The Game from Waela, he had looked into the statistics. Fifty-fifty in dayside, yes. But nightside, fewer than one in fifty made it.\u003c/p\u003e\n\u003cp\u003eThe timer beside his head moved with an agonizing slowness: 2:48. It seemed to him that it took an hour shifting to 2:49. The sentries were silent now.\u003c/p\u003e\n\u003cp\u003eWhy didn\u0027t the sentries mark her passage?\u003c/p\u003e\n\u003cp\u003eAs though to answer him, a voice on the circuit said: \"She just rounded East Eighty-Nine!\"\u003c/p\u003e\n\u003cp\u003e\"Who the hell is that out there?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s still too far out to identify.\"\u003c/p\u003e\n\u003cp\u003eThomas drew his lasgun and put a hand on the hatchdog. The word was that the last minutes were the worst, Pandora\u0027s demons ganging up on the runner. He peered out into the moonshadows.\u003c/p\u003e\n\u003cp\u003e2:50.\u003c/p\u003e\n\u003cp\u003eHe spun the hatchdog, opened it a crack. No movement.... Nothing. Not even a demon. He found that he was swearing under his breath, muttering: \"Come on, Legata. Come on. You can do it. Don\u0027t blow the fucking run at the end!\"\u003c/p\u003e\n\u003cp\u003eSomething flickered in the shadows off to his left. He swung the hatch wide.\u003c/p\u003e\n\u003cp\u003eThere she was!\u003c/p\u003e\n\u003cp\u003eIt was like a dance - leaping, dodging. Something large and black swerved behind her. Thomas took careful aim and burned another Dasher as she sped past him without breaking her stride. There was a musky odor of perspiration from her. He slammed the hatch and dogged it. Something crashed into the barrier as he sealed it.\u003c/p\u003e\n\u003cp\u003eToo late, you fucker!\u003c/p\u003e\n\u003cp\u003eHe turned to see her slipping through the Lab One hatchway, her singlesuit in hand. She waved to him as the hatch hissed shut.\u003c/p\u003e\n\u003cp\u003eLegata, he thought. Then: Ten klicks in twenty-three minutes!\u003c/p\u003e\n\u003cp\u003eThere was a babble of conversation on the sentry circuit.\u003c/p\u003e\n\u003cp\u003e\"Anybody know who that was?\"\u003c/p\u003e\n\u003cp\u003e\"Negative. Where\u0027d she go?\"\u003c/p\u003e\n\u003cp\u003e\"Somewhere over near Lab One dome.\"\u003c/p\u003e\n\u003cp\u003e\"Sheee-it! That must\u0027ve been the fastest time ever.\"\u003c/p\u003e\n\u003cp\u003eThomas slapped the switch to shut them off, but not before a male voice said: \"I\u0027d sure like to have that little honey chasin....\"\u003c/p\u003e\n\u003cp\u003eThomas crossed over to the Lab One hatch, heaved on the dog. It refused to move, sealed.\u003c/p\u003e\n\u003cp\u003eAll that just to put a hashmark above her eyebrow?\u003c/p\u003e\n\u003cp\u003eN.... it had to be much more than the mark of success.\u003c/p\u003e\n\u003cp\u003eWhat were they doing down there in Lab One?\u003c/p\u003e\n\u003cp\u003eAgain, he tried the hatchdog. It refused to budge. He shook his head and walked slowly back to the autosentry gate where he picked up a servo and rode it to his quarters. All the way down he kept wondering:\u003c/p\u003e\n\u003cp\u003eWhat the hell\u0027s a Legata? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-32.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
