{"id":98748,"no":33,"title":"Page 33","content":"\u003cp\u003eThe clone of a clone does not necessarily stay closer to the original than a clone of the older original. It depends on cellular interference and other elements which may be introduced. Passage of time always introduces other elements.\u003c/p\u003e\n\u003cp\u003e- Jesus Lewis, The New Cloning Manual\u003c/p\u003e\n\u003cp\u003eOAKES SNAPPED off the holo and swiveled his chair around to stare at the design on the wall of his groundside cubby.\u003c/p\u003e\n\u003cp\u003eHe did not like this place. It was smaller than his quarters shipside. The air smelled strange. He did not like the casual way some of the Colonists treated him. He found himself constantly aware of Pandora\u0027s surfac.... right out there.\u003c/p\u003e\n\u003cp\u003eNever mind that it was many layers of Colony construction beyond his quarters, it was right out there.\u003c/p\u003e\n\u003cp\u003eDespite the few familiar furnishings he had brought groundside, this place would never feel as comfortable as his old shipside cubby.\u003c/p\u003e\n\u003cp\u003eExcept that the dangers of the ship - the dangers which only he knew - were more distant.\u003c/p\u003e\n\u003cp\u003eOakes sighed.\u003c/p\u003e\n\u003cp\u003eIt was late dayside and he still had many things to do, but what he had seen on the holo compelled his attention.\u003c/p\u003e\n\u003cp\u003eA most unsatisfactory performance.\u003c/p\u003e\n\u003cp\u003eHe chewed at his lower lip. N.... it was more than unsatisfactory. Disturbing.\u003c/p\u003e\n\u003cp\u003eOakes leaned back and tried to relax. The holo of Legata\u0027s visit to the Scream Room filled him with disquiet. He shook his head. In spite of the drug suppressing her cortical responses, she had resisted. Nothing in her Scream Room performance could be held against he.... excep.... no. She had done nothing.\u003c/p\u003e\n\u003cp\u003eNothing!\u003c/p\u003e\n\u003cp\u003eIf he had not seen it for himsel.... Would she ask to see this holo? He thought not, but nothing was certain. None of the others had asked to see their holos, although everyone knew such a record was made.\u003c/p\u003e\n\u003cp\u003eLegata had not performed according to pattern. Things were done to her and she resisted other things. The holo gave him no absolutely secure hold on her.\u003c/p\u003e\n\u003cp\u003eIf she sees that holo, she\u0027ll know.\u003c/p\u003e\n\u003cp\u003eHow could he keep the record of it from the best-known Search Technician?\u003c/p\u003e\n\u003cp\u003eWas it a mistak.... sending her into the Scream Room?\u003c/p\u003e\n\u003cp\u003eBut he thought he still knew her. Yes. She would not take action against him unless she were in great pain. And she might not ask for the holo. Migh.... not.\u003c/p\u003e\n\u003cp\u003eNot once in the Scream Room had Legata sought her own pleasure. She had acted only in reaction to the application of pain.\u003c/p\u003e\n\u003cp\u003ePain that I commanded.\u003c/p\u003e\n\u003cp\u003eThis made him uncomfortable.\u003c/p\u003e\n\u003cp\u003eIt was necessary!\u003c/p\u003e\n\u003cp\u003eGiven an adversary as potent as the ship, he had to take extreme measures. He had to explore the limits.\u003c/p\u003e\n\u003cp\u003eI\u0027m justified.\u003c/p\u003e\n\u003cp\u003eLegata had not even required sedation after emerging from the Scream Room.\u003c/p\u003e\n\u003cp\u003eWhere did she go, dashing off like that with only the minimal Celltape on her wounds?\u003c/p\u003e\n\u003cp\u003eShe had returned naked, carrying her singlesuit.\u003c/p\u003e\n\u003cp\u003eOakes had heard the rumors that someone had run the perimeter in that interval. Surely not Legata. A coincidence, no more. And the proof of it was that she wore no hashmark.\u003c/p\u003e\n\u003cp\u003eDamn fool! Running in the open at night like that!\u003c/p\u003e\n\u003cp\u003eHe would have liked to prohibit The Game, but Lewis had warned him off this, and his own good sense had agreed. There was no way to prevent The Game without wasting too much manpower policing all the hatches. Besides, The Game vented certain impulses of violence.\u003c/p\u003e\n\u003cp\u003eLegata running the perimeter?\u003c/p\u003e\n\u003cp\u003eCertainly not!\u003c/p\u003e\n\u003cp\u003eEfficient damned woman! She was expected back at work by evening, the physical marks of her Scream Room experience almost gone. He looked at the notes beside his left hand. Unconsciously, he had addressed them to her.\u003c/p\u003e\n\u003cp\u003e\"Check on possible relationship between waxing of Alki and growth of \u0027lectrokelp. Have Lab One begin two LH clones. Map new data on dissidents - special attention to those associated with Rachel Demarest.\"\u003c/p\u003e\n\u003cp\u003eWould Legata even take his orders now?\u003c/p\u003e\n\u003cp\u003eThe picture of Legata\u0027s face from the holorecord kept slipping back into his mind.\u003c/p\u003e\n\u003cp\u003eShe trusted me.\u003c/p\u003e\n\u003cp\u003eHad she really trusted him? Why else would she go back to Lab One when her misgivings about it were all that apparent? With anyone else, he would have laughed at such musings, but not with Legata. She was painfully different from the others and he had already taken her too far.\u003c/p\u003e\n\u003cp\u003eEntertainment time.\u003c/p\u003e\n\u003cp\u003eIt had not been as entertaining as he had expected. He recalled the first potent look of betrayal in her eyes when the sonics hit her. The sonics had driven away the clones; they already had taken their entertainment. But even heavy pain had not moved Legata. Despite sedation, she could hear Murdoch\u0027s commands. And the sedation had been designed to suppress her wil.... but she resisted. Murdoch\u0027s commands told her what to do, the clone was prepared, the equipment set - but even then, she had to be totally awash with pain before inflicting anything like her own agony on the clone. Most of the time, her gaze had sought out the holo scanner. She had stared directly into the scanner, and the dimming of her eyes gave him no pleasure, no pleasure at all.\u003c/p\u003e\n\u003cp\u003eShe won\u0027t remember. They never do.\u003c/p\u003e\n\u003cp\u003eMost of the subjects begged, offered anything for the pain to stop. Legata simply stared at the scanner, wide-eyed. Somewhere in her, he knew, there had been awareness that she was totally helpless, totally subject to his every whim. It was a conditioning process. He wanted her to be like the rest. He could deal with that.\u003c/p\u003e\n\u003cp\u003eBut he had been unprepared for the shock of her difference. Yes, she was different. What a shock, finally discovering this magnificent difference, to know that he had destroyed it. Whatever private trust they might have had was gone forever.\u003c/p\u003e\n\u003cp\u003eForever.\u003c/p\u003e\n\u003cp\u003eShe would never again trust him completely. Oh, she would obey - perhaps even more promptly now. But no trust.\u003c/p\u003e\n\u003cp\u003eHe felt himself shaking with this knowledge. Tense, distracted. He had to force himself to relax, to concentrate on something which comforted.\u003c/p\u003e\n\u003cp\u003eNothing is forever, he thought.\u003c/p\u003e\n\u003cp\u003ePresently, he drifted into his own peculiar arena of sleep, but it was a sleep haunted by the design on his cubby wall. The design took on distorted shapes from the holo of Legata in the Scream Room.\u003c/p\u003e\n\u003cp\u003eAnd Pandora was right out ther.... an.... and...tomorro.... \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-33.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
