{"id":98752,"no":37,"title":"Page 37","content":"\u003cp\u003eMan also knows not his time: as the fishes that are taken in an evil net, and as the birds that are caught in the snare; so are the sons of men snared in an evil time, when it falls suddenly upon them.\u003c/p\u003e\n\u003cp\u003e- Christian Book of the Dead, Shiprecords\u003c/p\u003e\n\u003cp\u003eFOR A long time after returning to Ship from the Hill of Skulls, Hali could not find the will to leave the room. She stared up and around at the softly illuminated space - this secret place where Kerro had spent so many hours communing with Ship. She remembered the borrowed flesh of the old woman, the painful and halting steps. The ache of aging shoulders. A feeling of profound sensitivity to her familiar body pervaded her awareness; each tiny movement became electric with immediacy.\u003c/p\u003e\n\u003cp\u003eShe remembered the man who had been nailed to the rigid cross-piece on the hill. Barbaric!\u003c/p\u003e\n\u003cp\u003eYaisuah.\u003c/p\u003e\n\u003cp\u003eShe whispered it: \"Yaisuah.\"\u003c/p\u003e\n\u003cp\u003eIt was understandable how this name had evolved into that of Jesu.... and even to the Hesoos of Jesus Lewis.\u003c/p\u003e\n\u003cp\u003eBut nowhere could she find understanding of why she had been taken to witness that agonizing scene. Nowhere. And she found it odd that she had never encountered historical records of that faraway event - not in Ship\u0027s teachings nor in the memories of Shipmen who came from Earth.\u003c/p\u003e\n\u003cp\u003eIn the first moments of her return, she had asked Ship why she had been shown that brutal incident, and had received an enigmatic response.\u003c/p\u003e\n\u003cp\u003eBecause there are things from the human past that no creature should forget.\u003c/p\u003e\n\u003cp\u003e\"But why me? Why now?\"\u003c/p\u003e\n\u003cp\u003eThe rest was silence. She assumed that the answers were her own to find.\u003c/p\u003e\n\u003cp\u003eShe stared at the com-console. The seat there at the instruction terminal was her seat now; she knew it. Kerro was gon.... groundside. Ship had introduced her to this place, had given it to her.\u003c/p\u003e\n\u003cp\u003eThe message was clear: No more Kerro Panille here.\u003c/p\u003e\n\u003cp\u003eA shuddering wave of loss shot through her, and she shook tears from her eyes. This was no place to stay now. She stood, took up her pribox and slipped out the way she had entered.\u003c/p\u003e\n\u003cp\u003eWhy me?\u003c/p\u003e\n\u003cp\u003eShe wound her way out of softwares and into D passage leading back to Medical, into the workings of Ship\u0027s body.\u003c/p\u003e\n\u003cp\u003eThe beep of her pribox startled her.\u003c/p\u003e\n\u003cp\u003e\"Ekel here,\" she said, surprised at the youthfulness of her own voice - not at all like the ancient quavering of that old woman\u0027s voice she had borrowed.\u003c/p\u003e\n\u003cp\u003eHer pribox crackled, then: \"Ekel, report to Dr. Ferry\u0027s office.\"\u003c/p\u003e\n\u003cp\u003eShe found a servo and, instead of walking, rode to Medical.\u003c/p\u003e\n\u003cp\u003eFerry, she thought. Could it mean reassignment? Could I be joining Kerro groundside?\u003c/p\u003e\n\u003cp\u003eThe thought excited her, but the idea of groundside duty remained fearful. So many nasty rumors. And lately, all groundside assignments seemed permanent. Except for the tight-knit political circle at Medical, no one made the return trip. Pressures of work had kept her from thinking much about this before, but suddenly it became vital.\u003c/p\u003e\n\u003cp\u003eWhat are they doing with all our people?\u003c/p\u003e\n\u003cp\u003eThe drain on equipment and food from Ship was a topic for constant anxious conversation; recurrent dayside orders exhorted greater production effort.... but few speculated about missing people.\u003c/p\u003e\n\u003cp\u003eWe\u0027ve been conditioned not to face the finality of absolute endings. Is that why Ship showed me Yaisuah?\u003c/p\u003e\n\u003cp\u003eThe thought stood there in her awareness, riding on the hum of the servo carrying her toward Medical and Ferry.\u003c/p\u003e\n\u003cp\u003eIt was clear to her that Yaisuah had ended, but his influence had not ended. Pandora was a place of endings. It gulped food and people and equipment. What influences were about to be sent reverberating from that place?\u003c/p\u003e\n\u003cp\u003eEndings.\u003c/p\u003e\n\u003cp\u003eThe servo fell silent, stopped. She looked up to see Medical\u0027s servo gate and, across the passage, the hatch to Ferry\u0027s offices. She did not want to go through that hatch. Her body still throbbed with sensitivities ignited by what Ship had shown her. She did not want Ferry touching her body. It was more than her dislike for him - the silly old fool! He drank too much of the alcohol which came up from Colony and he always reached out to put a hand on her somewhere.\u003c/p\u003e\n\u003cp\u003eEveryone knew the Demarest woman brought him his wine from groundside. He always had plenty of it after her visits.\u003c/p\u003e\n\u003cp\u003eHis food chits can\u0027t support that kind of drinking.\u003c/p\u003e\n\u003cp\u003eShe stared at the dogged hatch across the way. Something was definitely wrong - shipside and groundside. Why did Rachel Demarest bring wine up to Ferry?\u003c/p\u003e\n\u003cp\u003eIf she brings him wine, what does she get in return?\u003c/p\u003e\n\u003cp\u003eLove? Why not? Even neurotics like Ferry and Demarest needed love. O.... if not love, at least an occasional couch partner.\u003c/p\u003e\n\u003cp\u003eA remembered image of Foul-breath shuddered through her mind. She could almost feel the touch of his hand translated to her own young flesh. Involuntarily, she brushed her arm.\u003c/p\u003e\n\u003cp\u003eMaybe that\u0027s how they get so foul. No lov.... no lovers.\u003c/p\u003e\n\u003cp\u003eThere was no evading the summons, though. She slid off the servo and crossed to Ferry\u0027s hatch. It snicked open at her approach. Why was she reminded of a sword leaving its scabbard?\u003c/p\u003e\n\u003cp\u003e\"Ahhh, dear Hali.\" Ferry opened his palms to her as she entered.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Dr. Ferry.\"\u003c/p\u003e\n\u003cp\u003e\"Sit down wherever you like.\" His hand rested on the arm of a couch, inviting her to the place beside him. She chose a seat facing him, cleared off the mess of papers and computer discs that covered it. The whole office smelled sour in spite of Ship\u0027s air filtration. Ferry appeared to be drun.... at least happy.\u003c/p\u003e\n\u003cp\u003e\"Hali,\" he said, and recrossed his legs so one foot reached out to touch hers. \"You\u0027re being reassigned.\"\u003c/p\u003e\n\u003cp\u003eAgain, she nodded. Groundside?\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to the Natali,\" Ferry said.\u003c/p\u003e\n\u003cp\u003eIt was totally unexpected, and she blinked at him stupidly. To the Natali? The elite corps which handled all natural births had never been her ambition. Not even her hope. A dream, ye.... but she was not the type to hope for the impossible.\u003c/p\u003e\n\u003cp\u003e\"How do you feel about that?\" Ferry asked, moving her foot with his.\u003c/p\u003e\n\u003cp\u003eThe Natali! Working daily with the sacrament of WorShip!\u003c/p\u003e\n\u003cp\u003eShe nodded to herself as the reality of it seeped through her. She would join the elite who opened the hatchway to the mystery of lif.... she would help rear the children shipside until they were assigned to their own schools and quarters at the age of seven annos.\u003c/p\u003e\n\u003cp\u003eFerry smiled a red-stained smile. \"You look stunned. Don\u0027t you believe me?\"\u003c/p\u003e\n\u003cp\u003eShe spoke slowly. \"I believe you. I suspected that thi....\" She waved a hand at his office. \"...was for reassignment, bu....\"\u003c/p\u003e\n\u003cp\u003eFerry made no move to respond, so she went on.\u003c/p\u003e\n\u003cp\u003e\"I thought I\u0027d be going groundside. Everyone seems to be going there, lately.\"\u003c/p\u003e\n\u003cp\u003eHe steepled his fingers and rested his chin on them.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not happy with this assignment?\"\u003c/p\u003e\n\u003cp\u003e\"Ohhh, I\u0027m very happy with it. It\u0027s jus....\" She put a hand to her throat. \"I never though......mea.... Why me?\"\u003c/p\u003e\n\u003cp\u003e\"Because you deserve it, my dear.\" He chuckled. \"And there\u0027s talk of moving the Natali groundside. You may get the best of both worlds.\"\u003c/p\u003e\n\u003cp\u003e\"Groundside?\" She shook her head. Too many shocks were coming at her one after the other.\u003c/p\u003e\n\u003cp\u003e\"Yes, groundside.\" He spoke as though explaining something simple to an errant child.\u003c/p\u003e\n\u003cp\u003e\"But I though.... I mean, the foremost provision of WorShip is that we give our children to Ship until they\u0027re seven. Ship designated the Natali as the trustees of birt.... and their quarters are here, the estat....\"\u003c/p\u003e\n\u003cp\u003e\"Not Ship!\" Ferry\u0027s interruption was guttural. \"Some Ceepee did it. This is a matter for our determination.\"\u003c/p\u003e\n\u003cp\u003e\"But doesn\u0027t Shi....\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no record of Ship doing this. Now, our Ceepee has ruled that it is no violation of WorShip to move the Natali ground-side.\"\u003c/p\u003e\n\u003cp\u003e\"Ho.... how lon.... unti.... ?\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps a Pandoran anno. You know - quarters, supplies, politics.\" He waved it all off.\u003c/p\u003e\n\u003cp\u003e\"When do I go to the Natali?\"\u003c/p\u003e\n\u003cp\u003e\"Next diurn. Take a break. Get your things moved over. Talk tooo....\" He picked up a note from the jumble on his desk, squinted. \"...Usija. She\u0027ll take care of you from there.\"\u003c/p\u003e\n\u003cp\u003eHis foot brushed the back of her heel, then rubbed her instep.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Doctor.\" She pulled her foot back.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t feel your gratitude.\"\u003c/p\u003e\n\u003cp\u003e\"But I do thank you, especially for the time off. I have some notes to catch up on.\"\u003c/p\u003e\n\u003cp\u003eHe held up an empty glass. \"We could have a drin.... to celebrate.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head, but before she could say no, he leaned forward, grinning.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be neighbors, soon, Hali. We could celebrate that.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Groundside.\" He pushed the glass toward her. \"After the Natali go.\u003c/p\u003e\n\u003cp\u003e\"But who\u0027ll be left here?\"\u003c/p\u003e\n\u003cp\u003e\"Production facilities, mostly.\"\u003c/p\u003e\n\u003cp\u003e\"Ship? A factory?\" She felt her face blaze red.\u003c/p\u003e\n\u003cp\u003e\"Why not? What other use will we have for Ship when we\u0027re groundside?\"\u003c/p\u003e\n\u003cp\u003eShe jumped to her feet. \"You would lobotomize your own mother!\" Whirling from his startled gaze, she fled.\u003c/p\u003e\n\u003cp\u003eAll the way back to her quarters, she heard the drum of Yaisuah\u0027s voice in her ears: \"If they do these things in a green tree, what will they do in a dry?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-37.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
