{"id":98756,"no":41,"title":"Page 41","content":"\u003cp\u003eRemember that I have power; you believe yourself miserable, but I can make you so wretched that the light of day will be hateful to you. You are my creator, but I am your master.\u003c/p\u003e\n\u003cp\u003e- Frankenstein\u0027s Monster Speaks, Shiprecords\u003c/p\u003e\n\u003cp\u003eOAKES WOKE out of his first sound sleep groundside to muffled pounding outside his cubby.\u003c/p\u003e\n\u003cp\u003eHis fingers reached his com-console before he was even awake and the viewscreen showed complete madness up and down Colony\u0027s corridors.\u003c/p\u003e\n\u003cp\u003eEven outside his own locked hatchway!\u003c/p\u003e\n\u003cp\u003e\"I\u0027m hungry now! I\u0027m hungry now! I\u0027m hungry now!\"\u003c/p\u003e\n\u003cp\u003eThe chant was a snarl in the throat of the night.\u003c/p\u003e\n\u003cp\u003eThere were no guns in evidence, but plenty of rocks.\u003c/p\u003e\n\u003cp\u003eIn a matter of blinks, Lewis was on the line.\u003c/p\u003e\n\u003cp\u003e\"Morgan, we\u0027ve lost them for now. This thing will have to run its course unti....\"\u003c/p\u003e\n\u003cp\u003e\"What the hell is happening?\" Oakes did not like it that his voice cracked.\u003c/p\u003e\n\u003cp\u003e\"It started out as a round of The Game down in the \u0027ponicsways. Lots of drinking. Now it\u0027s a food riot. We can flood \u0027em out wit....\"\u003c/p\u003e\n\u003cp\u003e\"Wait a minute! Are the perimeters still secure?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. My people out there.\"\u003c/p\u003e\n\u003cp\u003e\"Then wh....?\"\u003c/p\u003e\n\u003cp\u003e\"Water in the passages will slow \u0027em down until w....\"\u003c/p\u003e\n\u003cp\u003e\"No!\" Oakes took a deep breath. \"You\u0027re out of your league, Jesus. What we\u0027ll do is let them go. If they seize food, then it\u0027ll be their responsibility when food gets even shorter. The supply does not change, you hear me? No extra food!\"\u003c/p\u003e\n\u003cp\u003e\"But they\u0027re running wild throug....\"\u003c/p\u003e\n\u003cp\u003e\"Let them rip things up. The repairs afterward will keep them busy. And a good riot will purge emotions for a time, wear them out physically. Then we turn it to our advantage, but only after well-reasoned consideration.\"\u003c/p\u003e\n\u003cp\u003eOakes listened for some response from Lewis, but the \u0027coder remained silent.\u003c/p\u003e\n\u003cp\u003e\"Jesus?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Morgan.\" Lewis sounded out of breath. \"I think that yo.... had better mov.... to the Redoubt immediately. We can\u0027t wait for dayside, but you\u0027l....\"\u003c/p\u003e\n\u003cp\u003e\"Where are you, Jesus?\"\u003c/p\u003e\n\u003cp\u003e\"Old Lab One complex. We were moving out the last o....\"\u003c/p\u003e\n\u003cp\u003e\"Why must I go to the Redoubt now?\" Oakes blinked and turned up the illumination in his cubby. \"The riots will pass. As long as the perimeter\u0027s secure we ca....\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not stamping their feet and whining, Morgan. They\u0027re killing people. We\u0027ve sealed off the gun lockers but some of the rioter....\"\u003c/p\u003e\n\u003cp\u003e\"The Redoubt cannot be ready yet! The damage there wa.... I mean, is it safe?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s ready enough. And the crew there is handpicked by Murdoch. They\u0027re the best. You can rely on them. And, Morga....\"\u003c/p\u003e\n\u003cp\u003eOakes tried to swallow, then: \"Yes?\"\u003c/p\u003e\n\u003cp\u003eAnother long pause, garbled snatches of conversation.\u003c/p\u003e\n\u003cp\u003e\"Morgan?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m still on.\"\u003c/p\u003e\n\u003cp\u003e\"You should go now. I\u0027ve arranged everything. We\u0027ll flood \u0027em out of the necessary passages. My people will be there within minutes: our usual signal. You should be at the shuttle hangar within fifteen minutes.\"\u003c/p\u003e\n\u003cp\u003e\"But my records here! I haven\u0027t finished th....\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll get that later. I\u0027ll leave a briefing disc for you with the shuttle crew. I\u0027ll expect to hear from you as soon as you get to the Redoubt.\"\u003c/p\u003e\n\u003cp\u003e\"Bu.... I mea.... what about Legata?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s safe shipside! Call her when you get to the Redoubt.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027.... that bad?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eThe connection went dead. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-41.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
