{"id":98767,"no":53,"title":"Page 53","content":"\u003cp\u003ePoet\u003c/p\u003e\n\u003cp\u003eYou see bones up ahead\u003c/p\u003e\n\u003cp\u003ewhere there are none.\u003c/p\u003e\n\u003cp\u003eBy the time we get there\u003c/p\u003e\n\u003cp\u003eso do they....\u003c/p\u003e\n\u003cp\u003e- Hali Ekel, Private Letters\u003c/p\u003e\n\u003cp\u003eHALI STUDIED the monitors on the reclining Waela with care. It was well into dayside, but Waela appeared to be asleep, her body quiet on the tightly stretched hammock which they had rigged in one of Ship\u0027s rim compartments. Her abdomen was a mounded hillock. There was no hatch to this cubicle, only a fabric curtain which rustled in faint stirrings from the agrarium to which this extrusion was attached.\u003c/p\u003e\n\u003cp\u003eThis is not normal sleep, Hali thought.\u003c/p\u003e\n\u003cp\u003eWaela\u0027s breathing was too shallow, the passivity of her body too profound. It was as though she had slipped back into something approaching hyb. What did that mean for the fetus?\u003c/p\u003e\n\u003cp\u003eThe compartment was slightly larger than a regular cubby, and Hali had brought in a small wheeled cart to support the monitor screen. The screen showed Waela\u0027s vital signs as visible undulating curves with synchronous time-blips. A secondary set of lines reported on the child developing in Waela\u0027s womb. A simple twist of a dial could superimpose one set of lines on the other.\u003c/p\u003e\n\u003cp\u003eHali had been checking the synchronous beat for almost an hour. Waela had come to this Natali retreat without protest, obeying every suggestion Hali made with a sleepwalker\u0027s passivity. She had appeared to gain some energy after feeding at a corridor shipti...process which still filled Hali with confusion. So few ever received elixir at the shiptits anymore that most Shipmen ignored them, taking this as a sign of Ship\u0027s deeper intents or displeasure. Attendance at WorShip had never been more punctual.\u003c/p\u003e\n\u003cp\u003eWhy was Ship feeding Waela?\u003c/p\u003e\n\u003cp\u003eWhile Waela drank from the shiptit container, Hali had tried to get a response from the same corridor station. No elixir.\u003c/p\u003e\n\u003cp\u003eWhy, Ship?\u003c/p\u003e\n\u003cp\u003eNo answer. Ship had not been easily responsive since sending her to see the crucifixion of Yaisuah.\u003c/p\u003e\n\u003cp\u003eThe lines on the monitor screen were merging once more - fetus and mother in synchronous beat. As the lines merged, Waela opened her eyes. There was no consciousness in the eyes, only an unmoving stare at the compartment ceiling.\u003c/p\u003e\n\u003cp\u003e\"Fly us back to Jesus.\"\u003c/p\u003e\n\u003cp\u003eAs she spoke, the synchronous lines separated and Waela closed her eyes to sink back into the geography of her mysterious sleep.\u003c/p\u003e\n\u003cp\u003eHali stood in astonished contemplation of the unconscious woman. Waela had said \"Jesus\" the way Ship pronounced the name. Not Yaisuah or Hesoos, but Geezuz.\u003c/p\u003e\n\u003cp\u003eHad Ship sent Waela, too, on that odd journey to the Hill of Skulls? Hali thought not. I would recognize the signs of that shared experience. Hali knew the marks on herself which came from that trip to Golgotha.\u003c/p\u003e\n\u003cp\u003eMy eyes are older.\u003c/p\u003e\n\u003cp\u003eAnd there was a new quietude in her manner, a wish to share this thing with someone. But she lived with the knowledge that no other person might understan.... except possibl.... just possibly, Kerro Panille.\u003c/p\u003e\n\u003cp\u003eHali stared at the pregnant mound of Waela\u0027s abdomen.\u003c/p\u003e\n\u003cp\u003eWhy had he bred with thi.... this older woman?\u003c/p\u003e\n\u003cp\u003eFly us back to Jesus?\u003c/p\u003e\n\u003cp\u003eCould that be just delirious muttering? Then why Geezuz?\u003c/p\u003e\n\u003cp\u003eA deep sense of uneasiness moved itself through Hali. She used her pribox to call down to Shipcore and arranged for a relief watch on the monitor. The relief showed up presently, a young Natali intern named Latina. Her official green pribox hung at her hip as she hurried into the compartment.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the rush?\" Hali asked.\u003c/p\u003e\n\u003cp\u003e\"Ferry sent word that he wants to see you right away down at WorShip Nine.\"\u003c/p\u003e\n\u003cp\u003e\"He could\u0027ve called me.\" Hali tapped her own pribox.\u003c/p\u003e\n\u003cp\u003e\"Ye.... well, he just said for me to tell you to hurry.\"\u003c/p\u003e\n\u003cp\u003eHali nodded and gathered her things. Her own pribox and recorder were beyond habit, a part of her physical self. She briefed Latina on the routine as she gathered her equipment, noting the log of synchronous beats, then ducked out through the curtain. The agrarium was a scene of intense dayside activity, a harvest in process. Hali wove her way through the dance of workers and found a servo going coreside. At Old Hull she took the slide to Central and dropped off at the Study passage which led to WorShip Nine.\u003c/p\u003e\n\u003cp\u003eThe red numeral winked at her as she found the hatch and slipped into the controlled blue gloom. She could not see Ferry anywhere, but there were perhaps thirty children in the five-to-seven age range sitting cross-legged around a holofocus at the center of the WorShip area. The focus showed a projection of a man in shipcloth white who was lying on bare ground and covering his eyes with both hands in great pain or fear.\u003c/p\u003e\n\u003cp\u003e\"What is the lesson, children?\"\u003c/p\u003e\n\u003cp\u003eThe question was asked in the flat and emotionless tone of Ship\u0027s ordinary instruction programs.\u003c/p\u003e\n\u003cp\u003eOne of the boys pointed to another boy beside him and said: \"He wants to know where the man\u0027s name came from.\"\u003c/p\u003e\n\u003cp\u003eThe projected figure stood, appearing dazed, and a hand reached from outside the focus to steady him. The hand became another man in a long beige robe as the focus widened. Beside this other man, skittish and wild-eyed, danced a large white horse.\u003c/p\u003e\n\u003cp\u003eThe children gasped as the horse stepped into, then out, then back into the holo. They clapped when the robed man got it under control.\u003c/p\u003e\n\u003cp\u003eHali moved across to a WorShip couch overlooking this performance and sank into the cushions. She glanced around once more for Ferry. No sign of him. Typical. Tell her to hurry, then he was not here.\u003c/p\u003e\n\u003cp\u003eNeither of the projected figures was speaking, but now a voice in a strange tongue boomed from the holofocus. How familiar that tongue sounded! Hali felt that she could almost understand it - as though she had learned it in a dream. She tapped the translate switch on the arm of the couch beside her and the voice boomed once more: \"Saul, Saul, why do you persecute me?\"\u003c/p\u003e\n\u003cp\u003eThat voice! Where had she heard that voice?\u003c/p\u003e\n\u003cp\u003eThe white-clad figure, still with hands over his eyes and concealing most of his face, rolled over and climbed to his feet with his back to Hali. She saw that he was not wearing a shipsuit after all, but a white robe which had clung to his long legs. The man stumbled back two steps now and fell once more. As he fell, he cried: \"Who are you?\"\u003c/p\u003e\n\u003cp\u003eThe booming voice said: \"I am Yaisuah, whom you persecute. It is hard for you to kick against the thorns.\"\u003c/p\u003e\n\u003cp\u003eHali sat in breathless quiet: Yaisua.... Hesoo.... Geezuz.\u003c/p\u003e\n\u003cp\u003eThe holofocus blipped out and the WorShip lights came up to a warm yellow. Hali saw that she was the only adult in the room - this had been a session for young children. Why had Ferry ordered her to meet him here?\u003c/p\u003e\n\u003cp\u003eOne of the children still seated on the floor spoke directly to Hali: \"Do you know where that man got his name?\"\u003c/p\u003e\n\u003cp\u003e\"It was a mixture from two ancient cultures Earthside,\" she said. \"Why were you watching that?\"\u003c/p\u003e\n\u003cp\u003e\"Ship said that was today\u0027s lesson. It started with the man on the horse. He rode very fast. Do we have horses in hyb?\"\u003c/p\u003e\n\u003cp\u003e\"The manifest says we have horses but we have no place for them yet.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to ride a horse sometime.\"\u003c/p\u003e\n\u003cp\u003e\"What did you learn from today\u0027s lesson?\" Hali asked.\u003c/p\u003e\n\u003cp\u003e\"Ship is everywhere, has been everywhere and has done and seen everything,\" the boy said. Other children nodded.\u003c/p\u003e\n\u003cp\u003eWas that why You showed me Yaisuah, Ship?\u003c/p\u003e\n\u003cp\u003eNo answer, but she had not expected one.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t learn my lesson. Whatever it was Ship wanted me to lear.... I failed.\u003c/p\u003e\n\u003cp\u003eDistraught, she stood and glanced at the boy who had addressed her. Why weren\u0027t there any adults here? It was children\u0027s WorShip, but not even a guide?\u003c/p\u003e\n\u003cp\u003e\"Has Doctor Ferry been here?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"He was here but someone called him away,\" a little girl in the background said. \"Is he supposed to leave WorShip?\"\u003c/p\u003e\n\u003cp\u003e\"When it\u0027s the business of Ship,\" Hali said. The apology sounded empty, but the girl accepted it.\u003c/p\u003e\n\u003cp\u003eAbruptly, Hali turned away and slipped out of the room. As she left, she heard the little girl call: \"But who\u0027s going to lead us in lesson study?\"\u003c/p\u003e\n\u003cp\u003eNot me, little girl. I have my own studying to do.\u003c/p\u003e\n\u003cp\u003eSomething was going very wrong shipside. Waela\u0027s odd pregnancy was merely one symptom among many. Hali ran down the side passage coreside from the WorShip area, found a service access plate and slipped it aside. She wormed her way down a dimly lighted tube to a cross-tube where she slipped out through another service plate into the main passage to Records. There was activity in Record...teener group learning how to handle the more sophisticated equipment, but she found her aisle between the storage racks unoccupied and no one at the console which concealed Kerro\u0027s small study lab.\u003c/p\u003e\n\u003cp\u003eHali opened the concealed hatch, saw pale pink light in the lab. She slid inside and sat at the control seat. The hatch snicked closed behind her. She was breathless from the rush of getting here, but wanted no delay. Where to begin? Vocoder? Projection?\u003c/p\u003e\n\u003cp\u003eHali chewed at her lip. Nothing could be hidden from Ship. The lesson for the children had been a true one. She knew this.\u003c/p\u003e\n\u003cp\u003eI don\u0027t even need this equipment to address Ship.\u003c/p\u003e\n\u003cp\u003eThen why did Ship use this place at all?\u003c/p\u003e\n\u003cp\u003e\"Most of you find it less disturbing than when I speak in your mind.\"\u003c/p\u003e\n\u003cp\u003eShip\u0027s intimate voice issued from the vocoder in front of her. For some reason, the calm and rational tone angered her.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re just pets! What happens when we become a nuisance?\"\u003c/p\u003e\n\u003cp\u003e\"How could you become a nuisance?\"\u003c/p\u003e\n\u003cp\u003eThe answer was there without considering it: \"By losing our respect for Ship.\"\u003c/p\u003e\n\u003cp\u003eThere was no reply.\u003c/p\u003e\n\u003cp\u003eThis cooled her anger. She sat in silent contemplation for a moment, then: \"Who are You, Ship?\"\u003c/p\u003e\n\u003cp\u003e\"Who? Not quite the proper term, Hali. I was alive in the minds of the first humans. It required time for the right events to occur, but only time.\"\u003c/p\u003e\n\u003cp\u003e\"What do You respect, Ship?\"\u003c/p\u003e\n\u003cp\u003e\"I respect the consciousness which brought Me into your awareness. My respect is made manifest by My decision to interfere as little as possible in that consciousness.\"\u003c/p\u003e\n\u003cp\u003e\"Is that how I\u0027m supposed to respect You, Ship?\"\u003c/p\u003e\n\u003cp\u003e\"Do you believe you can interfere with My consciousness, Hali?\"\u003c/p\u003e\n\u003cp\u003eShe let out a long breath.\u003c/p\u003e\n\u003cp\u003e\"I do interfere, don\u0027t I.\" It was a statement, not a question.\u003c/p\u003e\n\u003cp\u003eWith a sudden sensation of sinking, as though the realization occurred because she let it happen and not because she willed it, Hali saw the lesson of the Hill of Skulls.\u003c/p\u003e\n\u003cp\u003e\"The consequences of too much interference,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"You please Me, Hali. You please Me as much as Kerro Panille ever pleased Me.\"\u003c/p\u003e\n\u003cp\u003e\"Hali!\"\u003c/p\u003e\n\u003cp\u003eIt was Ferry\u0027s voice shouting at her over the pribox speaker at her hip. \"Get to Sickbay!\"\u003c/p\u003e\n\u003cp\u003eShe was out the concealed hatch and halfway down the storage aisle before she realized she had broken away from Ship in mid-conversation. Ship had spoken personally with very few people, and she had the impudence to jump up and leave. Even as this thought flashed through her mind, she laughed at herself. She couldn\u0027t leave Ship.\u003c/p\u003e\n\u003cp\u003eFerry met her at the main hatchway into Sickbay. He was wearing the heavier groundside blue and carried another suit of it under his arm. He thrust it at her and Hali saw then that the suits had been fitted for helmets of hazardous flight.\u003c/p\u003e\n\u003cp\u003eShe accepted the suit as Ferry thrust it at her. The old man appeared to be in the grip of deep agitation, his face flushed, hands trembling.\u003c/p\u003e\n\u003cp\u003eThe groundside fabric felt rough in her hands, so different from the shipcloth. The detachable slicker and hood were contrastingly slippery.\u003c/p\u003e\n\u003cp\u003e\"What\u0027.... what\u0027s happening?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"We have to get Waela offship. Murdoch\u0027s going to kill her.\"\u003c/p\u003e\n\u003cp\u003eShe was a blink accepting the import of his words. Then doubts filled her. Why would this fearful old man oppose Murdoch? And by implication oppose Oakes!\u003c/p\u003e\n\u003cp\u003e\"Why would you help?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re demoting me groundside, sending me to Lab One.\"\u003c/p\u003e\n\u003cp\u003eHali had heard the rumors of Lab One - clone experiments, some wild stories, but Ferry was visibly terrified. Did he know something definite about Lab One?\u003c/p\u003e\n\u003cp\u003e\"We have to hurry,\" he said.\u003c/p\u003e\n\u003cp\u003e\"But ho.... they\u0027ll catch us.\"\u003c/p\u003e\n\u003cp\u003e\"Please! Put on the groundsides and help me.\"\u003c/p\u003e\n\u003cp\u003eShe slipped the clothing over her shipsuit and noted how bulky it made her feel. Her fingers fumbled with the slicker\u0027s catches as Ferry hurried her into Sickbay.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be gone by the time they suspect,\" he said. \"There\u0027s a freighter leaving in four minutes from Docking Bay Eight. It\u0027s carrying hardware, no crew - everything on automatic.\"\u003c/p\u003e\n\u003cp\u003eThey were at a Sickbay alcove by now and, as he pulled aside the curtains, Hali suppressed a startled question. Waela lay on a gurney, already clad in groundside slicker with the hood pulled down over her brow. Her swollen abdomen was a blue mound under the slicker. How had Ferry brought her here?\u003c/p\u003e\n\u003cp\u003e\"Murdoch had her brought down here as soon as you were relieved,\" Ferry said, grunting as he wrestled the gurney out of its alcove. Hali moved to unhook the monitor connections.\u003c/p\u003e\n\u003cp\u003e\"Not yet!\" Ferry snapped. \"That\u0027s the signal to Bio that something\u0027s wrong.\"\u003c/p\u003e\n\u003cp\u003eHali drew back. Of course; she should\u0027ve thought of that.\u003c/p\u003e\n\u003cp\u003e\"Now, hook up your pribox,\" Ferry said. \"People will think we\u0027re moving her somewhere for more tests.\" Ferry folded the groundside hood under Waela\u0027s head and covered her with a gray blanket. She stirred sleepily as he lifted her head.\u003c/p\u003e\n\u003cp\u003e\"What did they give her?\" Hali asked.\u003c/p\u003e\n\u003cp\u003e\"A sedative, I think.\"\u003c/p\u003e\n\u003cp\u003eHali looked down at her groundsides, then at Ferry. \"People will take one look at our clothes and know something\u0027s wrong.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll just act as though we know what we\u0027re doing.\"\u003c/p\u003e\n\u003cp\u003eWaela jerked in her sleep, mumbled something, opened her eyes and said: \"Now. Now.\" Just as quickly she was back in her sedated sleep.\u003c/p\u003e\n\u003cp\u003e\"I hear you,\" Hali muttered.\u003c/p\u003e\n\u003cp\u003e\"Ready?\" Ferry asked. He gripped the head of the gurney.\u003c/p\u003e\n\u003cp\u003eHali nodded.\u003c/p\u003e\n\u003cp\u003e\"Unhook her.\"\u003c/p\u003e\n\u003cp\u003eHali removed the monitor connections and they wheeled Waela out into the passageway, moving as fast as they could.\u003c/p\u003e\n\u003cp\u003eDocking Bay Eight, Hali thought. Four minutes. They could make it if they were not delayed too long anywhere along the way.\u003c/p\u003e\n\u003cp\u003eShe saw that Ferry was guiding the gurney toward the tangent passage to the docking bays. Good choice.\u003c/p\u003e\n\u003cp\u003eThey had taken fewer than a dozen hurried steps when Hali was paged.\u003c/p\u003e\n\u003cp\u003e\"Ekel to Sickbay. Ekel to Sickbay.\"\u003c/p\u003e\n\u003cp\u003eHali estimated two hundred meters from Sickbay to their goal. They could not trust shiptransport internally. If Murdoch was a killer, if she had figured him for less than what he revealed himself, then placing themselves in a transit tube would be disaster. He could override the controls and have them delivered like salad to his hatchway.\u003c/p\u003e\n\u003cp\u003eThe gurney\u0027s wheels squeaked and Hali found this irritating. Ferry was panting with unaccustomed exertion. The few people they passed merely observed the obvious rush on medical business and squeezed aside to let them pass.\u003c/p\u003e\n\u003cp\u003eOnce more, she was paged: \"Ekel! Emergency in Sickbay!\"\u003c/p\u003e\n\u003cp\u003eThey skidded around the corner into the passage to the Docking Bay and nearly overturned the gurney. Ferry grabbed for it and prevented Waela from sliding off.\u003c/p\u003e\n\u003cp\u003eHali helped to settle Waela as they continued pushing toward Number Eight. They were passing Number Five and she could see the Eight down the passage ahead of them.\u003c/p\u003e\n\u003cp\u003eFerry, reaching under Waela\u0027s shoulder as they moved, pulled out something which had caught his eye.\u003c/p\u003e\n\u003cp\u003eHali saw him go pale. \"What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003eHe held it up for her to see.\u003c/p\u003e\n\u003cp\u003eThe thing looked insidiou...small pale tube of silver.\u003c/p\u003e\n\u003cp\u003e\"Tracer,\" Ferry gasped.\u003c/p\u003e\n\u003cp\u003e\"Where was it?\"\u003c/p\u003e\n\u003cp\u003e\"Murdoch must\u0027ve tried to feed it to her, but he didn\u0027t stick around long enough to be sure she swallowed it. She must\u0027ve spit it out.\"\u003c/p\u003e\n\u003cp\u003e\"Bu....\"\u003c/p\u003e\n\u003cp\u003e\"They know where we are. The biocomputer can track this through the body, yes, but it can also track it anywhere in Ship.\"\u003c/p\u003e\n\u003cp\u003eHali grabbed it out of his hand and threw it behind her as far as she could.\u003c/p\u003e\n\u003cp\u003e\"All we need\u0027s a little delay.\"\u003c/p\u003e\n\u003cp\u003e\"This is as far as you go, Ekel!\"\u003c/p\u003e\n\u003cp\u003eIt was Murdoch\u0027s shrill voice almost paralyzing her as he stepped out of the Number Eight hatch just ahead of Ferry. She glimpsed a laser scalpel in his hand, realizing he could use it as a weapon. That thing under full power could sever a leg at ten meters! \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-53.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
