{"id":98772,"no":58,"title":"Page 58","content":"\u003cp\u003eA horrible feeling came over m...terrible amusement, for I believed that humankind, through the filtering of Ship\u0027s manipulations and the great passage of time, had lost the very ability to engage in war. I thought war had been bred and conditioned out of them at the very moment when they needed this ability the most.\u003c/p\u003e\n\u003cp\u003e- The Thomas Diatribes, Shiprecords\u003c/p\u003e\n\u003cp\u003eWHILE HALI was making another examination of Waela\u0027s condition and well before the freighter reached atmosphere, Bitten\u0027s metallic voice barked at them from the overhead \u0027coder.\u003c/p\u003e\n\u003cp\u003e\"Do you know a Kerro Panille?\"\u003c/p\u003e\n\u003cp\u003eWaela stirred and mumbled at the sound, then rubbed both hands over her mounded abdomen.\u003c/p\u003e\n\u003cp\u003e\"Yes, we know Panille,\" Hali said. She closed and sealed her pribox. \"Why?\"\u003c/p\u003e\n\u003cp\u003e\"You wish to land at some place other than Colony,\" Bitten intoned. \"That now may be possible.\"\u003c/p\u003e\n\u003cp\u003eFerry glared up toward the \u0027coder. \"You said we had to land at Colony!\"\u003c/p\u003e\n\u003cp\u003e\"I have been in contact with Kerro Panille,\" Bitten said. \"He asserts that Colony has been destroyed.\"\u003c/p\u003e\n\u003cp\u003e\"Destroyed?\" Hali sat stiffly in her couch, dumb with shock.\u003c/p\u003e\n\u003cp\u003eFerry gripped the arms of his command couch, knuckles white. \"But we\u0027re programmed for landing at Colony.\"\u003c/p\u003e\n\u003cp\u003e\"I remind you that I am the emergency program,\" Bitten said. \"Present conditions fit the definition of emergency.\"\u003c/p\u003e\n\u003cp\u003e\"Then where can we land?\" Hali asked. And she felt the stirrings of hope. Contact with Kerro!\u003c/p\u003e\n\u003cp\u003e\"Panille asserts that I can make a sea landing near an occupied site called the Redoubt. He is prepared to guide us to that landing.\"\u003c/p\u003e\n\u003cp\u003eHali checked the fastenings which held Waela in the passenger couch, returned to her own seat and strapped in. The plaz directly in front of her framed a brilliant circle of cloud-covered planet.\u003c/p\u003e\n\u003cp\u003e\"They meant us to die,\" Ferry muttered. \"Damn them!\"\u003c/p\u003e\n\u003cp\u003e\"Do you desire to land at the alternate site?\" Bitten asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, land us there,\" Hali said.\u003c/p\u003e\n\u003cp\u003e\"There is risk,\" Bitten said.\u003c/p\u003e\n\u003cp\u003e\"Land us there!\" Ferry shouted.\u003c/p\u003e\n\u003cp\u003e\"A normal tone of voice suffices for conversational direction of this program,\" Bitten said.\u003c/p\u003e\n\u003cp\u003eFerry stared at Hali. \"They meant us to die.\"\u003c/p\u003e\n\u003cp\u003e\"I heard you. What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Murdoch said we would have to go to Colony.\"\u003c/p\u003e\n\u003cp\u003eHali looked at him, weighing his words. Was the man unaware of what he had just told her?\u003c/p\u003e\n\u003cp\u003e\"So it was a set-up,\" she said. \"You staged that fight.\"\u003c/p\u003e\n\u003cp\u003eFerry remained silent, blinking at her.\u003c/p\u003e\n\u003cp\u003e\"But you cut off one of Murdoch\u0027s ears,\" Hali said, remembering.\u003c/p\u003e\n\u003cp\u003eFerry bared his old teeth in a terrible grin. \"He did something to my Rachel. I know he did.\"\u003c/p\u003e\n\u003cp\u003eHali crossed her arms over her breast, hearing all the unspoken things in Ferry\u0027s words. Her gaze went to the laser scalpel clipped in a breast pocket of Ferry\u0027s singlesuit: a thin stylus with death or life in its mechanism.\u003c/p\u003e\n\u003cp\u003eHe was supposed to bring the scalpel in case he needed it against me!\u003c/p\u003e\n\u003cp\u003e\"I made it seem like an accident,\" Ferry said. \"But I knew they did something to my Rachel. And Murdoch\u0027s the one they get to do the nasty stuff.\" He nodded at Hali. \"In the Scream Room. That\u0027s where they do it.\"\u003c/p\u003e\n\u003cp\u003eAs he said Scream Room, he shuddered.\u003c/p\u003e\n\u003cp\u003e\"So we were supposed to go to Colony and it\u0027s destroyed,\" Ferry said. \"Demons, yes. Very neat. They didn\u0027t like my asking about Rachel.\"\u003c/p\u003e\n\u003cp\u003eHali wet her lips with her tongue. \"What\u0027.... what\u0027s the Scream Room?\"\u003c/p\u003e\n\u003cp\u003e\"In Lab One where they do the nasty stuff. It was because of Rachel, I know it was. And I drink too much. Lots of us do that after the Scream Room.\"\u003c/p\u003e\n\u003cp\u003eBitten\u0027s voice intruded: \"Correction noted.\"\u003c/p\u003e\n\u003cp\u003e\"What was that?\" Ferry demanded.\u003c/p\u003e\n\u003cp\u003e\"This is Bitten. I have acknowledged a course correction from Kerro Panille.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to land us in the sea?\" Hali asked, filled with sudden concern for her unconscious patient.\u003c/p\u003e\n\u003cp\u003e\"Near shore. Panille asserts there will be help where we land.\"\u003c/p\u003e\n\u003cp\u003e\"What about the demons?\" Ferry asked.\u003c/p\u003e\n\u003cp\u003e\"If that is a reference to native fauna, you can protect yourselves with the weapons in this freighter\u0027s cargo.\"\u003c/p\u003e\n\u003cp\u003e\"You carr.... weapons?\" Hali asked.\u003c/p\u003e\n\u003cp\u003e\"The cargo manifest lists food concentrates, building equipment and tools, medical supplies, groundsuits and weapons.\"\u003c/p\u003e\n\u003cp\u003eHali shook her head. \"I knew you needed weapons to survive groundside, but I didn\u0027t know they were being made shipside.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know what a weapon is?\" Ferry asked, looking directly at Hali.\u003c/p\u003e\n\u003cp\u003eShe thought of her history holos, and the soldiers at the Hill of Skulls. \"Oh, yes. I know about weapons.\"\u003c/p\u003e\n\u003cp\u003e\"This laser scalpel.\" Ferry touched the stylus shape at his breast. \"Acid concentrates, plasteel cutters for construction teams, knives, axe....\"\u003c/p\u003e\n\u003cp\u003eHali swallowed past a lump in her throat. Every bit of her med-tech training cried out against this. \"If we prepare t.... kill,\" the word was barely a sigh past her lips, \"then we will kill.\"\u003c/p\u003e\n\u003cp\u003e\"Down here, it\u0027s kill or be killed,\" Ferry said. \"That\u0027s the way The Boss wants it.\"\u003c/p\u003e\n\u003cp\u003eIn that instant, the freighter skipped into the first thin surface of Pandora\u0027s atmosphere. Vibration hummed all through the cabin, then smoothed.\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t we run away?\" Hali asked. Her voice was a low whisper.\u003c/p\u003e\n\u003cp\u003e\"Nowhere to run,\" Ferry said. \"You must know that. All Shipmen learn enough about groundside to know that.\"\u003c/p\u003e\n\u003cp\u003eFight or flee, Hali thought, and nowhere to flee. And it occurred to her that Pandora was a place where people were made into primitives.\u003c/p\u003e\n\u003cp\u003e\"Trust me,\" Ferry said, and the quavering in his old voice made the statement pathetic.\u003c/p\u003e\n\u003cp\u003e\"Yes, of course,\" Hali said.\u003c/p\u003e\n\u003cp\u003eShe felt the freighter\u0027s braking thrust then as it pressed her against the restraining harness, and she glanced back to reassure herself that Waela remained secure.\u003c/p\u003e\n\u003cp\u003e\"We will land in the cradle of the sea,\" Hali said. \"That\u0027s what Waela said. Remember?\"\u003c/p\u003e\n\u003cp\u003e\"What does she know?\" Ferry demanded, and it was his fearful, querulous tone, the one which had made her despise him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-58.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
