{"id":98773,"no":59,"title":"Page 59","content":"\u003cp\u003eThis the true human knows:\u003c/p\u003e\n\u003cp\u003ethe strings of all the ways\u003c/p\u003e\n\u003cp\u003emake up a cable of great strength\u003c/p\u003e\n\u003cp\u003eand great purpose....\u003c/p\u003e\n\u003cp\u003e- Kerro Panille, The Collected Poems\u003c/p\u003e\n\u003cp\u003eFOR A long time Panille sat in the shadows of the seaside cliff while he felt the approaching presence from space. The sea lay below him down a rugged path, the cliffs soared high behind. Avata had been the first to tell him about this problem and, for a few blinks, he had fallen back into Thomas\u0027 ways of thinking.\u003c/p\u003e\n\u003cp\u003eThe Redoubt will know about this freighter, will send its weapons against it.\u003c/p\u003e\n\u003cp\u003eBut Avata soothed him, told him that Avata would transmit false images to the Redoubt\u0027s systems, concealing the freighter\u0027s passage. Avata would continue to mask the nest\u0027s location with similar projections.\u003c/p\u003e\n\u003cp\u003eThe rock was cold against Panille\u0027s back. From time to time, he opened and closed his eyes. When his eyes were open he was vaguely aware of the amber glow from Double Dusk - the sky alight from two suns dodging just below Pandora\u0027s horizon.\u003c/p\u003e\n\u003cp\u003eShip would know he was here and what he was doing. Nothing escaped Ship. Did that omnipotent awareness work through phenomena similar to those of Avata? Was it awareness of even the most minute changes in electrical impulses? Or was it some other form of energy which Ship and Avata monitored?\u003c/p\u003e\n\u003cp\u003eThat presence from space was coming close.... closer. He felt it, then he saw it.\u003c/p\u003e\n\u003cp\u003eThe freighter skipped up the horizon, a great stone crossing the surface of a glassy sea. The fall into atmosphere was deceptive. The freighter had entered Pandora\u0027s pull at the lowest point on the horizon. It streaked a long upward arc as Panille felt it fill his awareness. It grew larger with its approach around the planet\u0027s curvature, and he saw it now falling white-hot toward him.\u003c/p\u003e\n\u003cp\u003eThe crunch of gravel told him of Thomas\u0027 approach, but Panille had only a single purpose now. The approaching freighter was himself and he was diving through the sky alight with amber.\u003c/p\u003e\n\u003cp\u003e\"Can you do it?\" Thomas asked.\u003c/p\u003e\n\u003cp\u003e\"I am doing it,\" Panille whispered. He begrudged the distraction of answering.\u003c/p\u003e\n\u003cp\u003eUntil he had seen the pinpoint of that first glow against the Pandoran dusk, Panille had not been sure he could master this thing.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m thinking them in,\" he whispered. There was awe and wonder in his voice.\u003c/p\u003e\n\u003cp\u003e\"Who is coming?\" Thomas asked.\u003c/p\u003e\n\u003cp\u003e\"Avata did not say.\"\u003c/p\u003e\n\u003cp\u003eThomas emitted a wry, jibing chuckle. \"It\u0027s a surprise package from Ship. Maybe more recruits for me.\"\u003c/p\u003e\n\u003cp\u003eHe moved around Panille and climbed down out of sight along the narrow path, his figure a mysterious movement in the half light.\u003c/p\u003e\n\u003cp\u003eGoing to the shore where the surf crashes. The surf will make this landing perilous.\u003c/p\u003e\n\u003cp\u003eAs the last sound of Thomas faded from Panille\u0027s awareness, darkness fell - the Double Dark in which Pandora\u0027s greatest mysteries blossomed.\u003c/p\u003e\n\u003cp\u003ePanille thought of himself now as a beacon. He was a signal transmitter in a known position. The freighter and its unknown passengers depended on his constancy. Avata wanted this freighter to land here. He trusted Avata.\u003c/p\u003e\n\u003cp\u003eCome to the sea, he thought. The se.... the se....\u003c/p\u003e\n\u003cp\u003eHylighters began whistling along a rock ledge ahead of him and he knew it was time to join Thomas on the shore. He got up stiffly. It had been a long wait on the observation ledge. Knowing this, he had scavenged a singlesuit of white shipcloth which Avata had stored in the nest.\u003c/p\u003e\n\u003cp\u003eA hylighter positioned itself above and behind him as he began the slow climb down to the shore. Panille sensed tentacles dangling near, ready to grasp him should he fall.\u003c/p\u003e\n\u003cp\u003eAvata, Brother, he thought.\u003c/p\u003e\n\u003cp\u003eIt fluted a brief reply.\u003c/p\u003e\n\u003cp\u003eThe sharp rocks and the difficulty of the dark cliff path were second nature to Panille\u0027s body. He did not have to think about the climb. And he found that he could maintain the beacon while his thoughts wandered. His mind strayed back to Thomas\u0027 unbelieving interrogation.\u003c/p\u003e\n\u003cp\u003eThomas demanded explanations and refused to believe almost everything he heard.\u003c/p\u003e\n\u003cp\u003eHe believes Avata projects strange images into his mind. He believes I have learned from Avata, that I am a master of hallucination. He believes only what he can touch, and then he doubts that.\u003c/p\u003e\n\u003cp\u003ePanille recalled his own words: \"Avata is not hallucinogenic. They are not even they. That\u0027s why I use the term Avata. That\u0027s why I call a hylighter Avata.\"\u003c/p\u003e\n\u003cp\u003e\"I know that word!\" Thomas was accusatory.\u003c/p\u003e\n\u003cp\u003e\"The Oneness which is present in the many. It\u0027s a word from one of the old languages of my mother\u0027s people.\"\u003c/p\u003e\n\u003cp\u003e\"Your mother?\" Thomas was astounded.\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t Ship tell you? I was womb-bred, womb-grown and nursed. I thought you said Ship told you everything.\"\u003c/p\u003e\n\u003cp\u003eThomas flashed him a dark scowl which showed that Panille was striking at sensitive areas. But nothing had stopped Thomas from forming his army - no warnings about Avata\u0027s nature, no jibes at Thomas\u0027 limited information. Half of the army waited above them no...mixed crew of E-clones and normals - all of them praying that the freighter from Ship was bringing weapons and other support. Some had descended earlier to wait among the rocks at the base of the cliff.\u003c/p\u003e\n\u003cp\u003eAbove Panille in the darkness, his Avatan guardian shared amusement and dismay at these thoughts.\u003c/p\u003e\n\u003cp\u003eCan that army save you? Panille asked.\u003c/p\u003e\n\u003cp\u003eAvata will die in only a few diurns. Then it may be that a rebirth can occur.\u003c/p\u003e\n\u003cp\u003eOakes hasn\u0027t beaten you yet, Panille said. Lewis with his poisons and his virus, none of them understand about power.\u003c/p\u003e\n\u003cp\u003eSoft flutings rippled from the hylighter, the nearest Avata came to betraying doubts. Panille wondered then: Was this futility aroused by Thomas\u0027 efforts, or by the imminent end of Avata - no more of \u0027lectrokelp/hylighters, no more of the individual cells, the great plural-singular unity?\u003c/p\u003e\n\u003cp\u003eThis thought disturbed him and he thought angrily as he worked his way down the steep trail to the shore: If you think you\u0027re done, then you are finished!\u003c/p\u003e\n\u003cp\u003eHe emerged from a gap between high rocks onto a wide, rock-mounded sandy beach. Thomas stood far down the sand near the surf - one dark shadow among the many rocks. The surf was high, long rollers crashing onto the shingle. The air was damp with salt spray. Panille felt the surf\u0027s heavy rhythm transmitted through skin and feet simultaneously. He put a hand against one of the gateway rocks through which he had entered this sea realm. The rock was cold and wet, and it also vibrated to the surf.\u003c/p\u003e\n\u003cp\u003eWithout the kelp to subdue the sea, the waves had become destructively wild - raging against the cliffs at high tide, throwing giant rocks in their surgings. Soon, very soon, all that Avata had built here would come crashing down into the wilderness of the sea.\u003c/p\u003e\n\u003cp\u003eThe Avatan guardian hovered near his shoulder. One tendril touched his cheek, transmitting remembered emotions.\u003c/p\u003e\n\u003cp\u003eYes, this is the place.\u003c/p\u003e\n\u003cp\u003eIt was here, Panille recalled, that he had learned to appreciate all the centuries of poetry celebrating rock and sand and sea, and the peculiar Avata life-of-Self illuminated by the regular passage of moons and suns. Here, the occasional monotony of wave against shore had been broken by the healthy slap of a nightborn hylighter breaking free of its motherplant and drifting off with its long umbilicus tentacles trailing in the sea. Though all Avata was one creature, Panille had felt his own private kinship with the nightborn hylighter-Avatan. Here, he had listened for them and greeted each birth with a song. A far-off slap would catch his attention and fill him with all the wonder of an answered prayer. Across the gently rolling sea, the tiny creature would rise into darkness.\u003c/p\u003e\n\u003cp\u003eNever again?\u003c/p\u003e\n\u003cp\u003ePanille whispered a chant to those lost cells of Avata, feeling his whole body transmit the chant as though he were, at last, truly one with Avata.\u003c/p\u003e\n\u003cp\u003eThe solitary blossom overpowers the bouquet.\u003c/p\u003e\n\u003cp\u003eEven remembering union, without embrace:\u003c/p\u003e\n\u003cp\u003ea transformation.\u003c/p\u003e\n\u003cp\u003eOh, the golden, night-blooming truth!\u003c/p\u003e\n\u003cp\u003eAs he chanted, the whole line of beach glowed with the moons-rise and the shimmering friendship of Avata. The glow illuminated the people of Thomas\u0027 ragtag army. Panille saw Thomas outlined against the dim light. Pushing himself away from the gateway rock, Panille went down the beach to stand near this mysterious \"friend of Ship.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re less than two minutes away,\" Panille said. He felt the beacon within him, a timed fire which linked him to that hot metal behemoth diving toward him.\u003c/p\u003e\n\u003cp\u003e\"Oakes will send probes,\" Thomas said.\u003c/p\u003e\n\u003cp\u003e\"Avata will help me jam their signals.\" Panille gave a smile to the dark. \"Would you care to join me in this?\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003eYou hold back too much, Raja Thomas.\u003c/p\u003e\n\u003cp\u003e\"But I need your help,\" Panille said. And he felt Thomas fuming, the tension mounting.\u003c/p\u003e\n\u003cp\u003e\"What do I do?\" Thomas forced the words out.\u003c/p\u003e\n\u003cp\u003e\"It may help you to touch an Avatan tentacle. Not necessary, but it helps at first.\"\u003c/p\u003e\n\u003cp\u003eA black tentacle came looping down to him then from the night sky. Reluctance apparent in every movement, Thomas reached out and placed a palm against the thrusting warmth.\u003c/p\u003e\n\u003cp\u003eImmediately, he felt his awareness joined to whoever guided that freighter toward them. He could see two hylighters hovering directly ahead of him and he felt his body standing on surf-drummed sand, a place to go. But the pulse of flight held him in thralldom.\u003c/p\u003e\n\u003cp\u003eIf anybody had told me back at Moonbase that one day I\u0027d land a freighter with my mind and a couple of plants that sing in the dar....\u003c/p\u003e\n\u003cp\u003eAnd think!\u003c/p\u003e\n\u003cp\u003eThe Avata intrusion could not be avoided. Avata would not accept that designation as plant. Thomas sensed more than the aural projection, something not quite pride, but not completely separated from pride.\u003c/p\u003e\n\u003cp\u003eAvata confuses me, he apologized.\u003c/p\u003e\n\u003cp\u003eYou confuse yourself. Why do you hide your true identity?\u003c/p\u003e\n\u003cp\u003eThomas jerked his hand away from the warm tentacle, but the Avata presence remained in his awareness.\u003c/p\u003e\n\u003cp\u003eYou\u0027re prying where you don\u0027t belong! Thomas accused.\u003c/p\u003e\n\u003cp\u003eAvata does not pry. There was no denying the hurt in this response.\u003c/p\u003e\n\u003cp\u003ePanille felt like an eavesdropper on a private argument. Thomas was smoldering with anger now, aware that he could not break off the Avata contact at will, aware that Avata wanted to pierce the wall behind which this private idea of himself lay hidden.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s get the freighter down,\" Panille said. \"Probes are coming from the Redoubt.\"\u003c/p\u003e\n\u003cp\u003ePanille released his part of the beacon system then, telling himself that he had to concentrate on the probes. Thomas would have to make his own mistakes.\u003c/p\u003e\n\u003cp\u003eThe first of the probes screamed down the beach, blazing toward them on a course which undoubtedly had been computed against a plot of the incoming freighter.\u003c/p\u003e\n\u003cp\u003eAs Avata had taught him, Panille set up a terrain image all around and transmitted it to the probe. He felt the projected illusion mesh with the probe\u0027s electronic functions. The probe almost shattered from the Gs it pulled, avoiding a sudden cliff which was not there.\u003c/p\u003e\n\u003cp\u003eThey\u0027re getting closer, he thought.\u003c/p\u003e\n\u003cp\u003eHe knew why. Each illusion of mistaken terrain formed a pattern of error from which the computer at Redoubt could derive significant results.\u003c/p\u003e\n\u003cp\u003eAvata numbers appeared in Panille\u0027s awareness, telling him that he was being monitored constantly now.\u003c/p\u003e\n\u003cp\u003eYes, he agreed. The patrols have increased.\u003c/p\u003e\n\u003cp\u003eTenfold in twelve hours, Avata insisted. Why does Thomas not understand his role in this?\u003c/p\u003e\n\u003cp\u003eIt is his nature, perhaps.\u003c/p\u003e\n\u003cp\u003eHave you identified your contact on the freighter?\u003c/p\u003e\n\u003cp\u003ePanille thought about this question, reviewed his own performance as a beacon, and experienced a sudden wash of insight. Knowing it was urgent, he reinsinuated himself into Thomas\u0027 performance, feeling the affirmation of contact with the freighter.\u003c/p\u003e\n\u003cp\u003eThomas, who have you contacted on the freighter? Panille asked.\u003c/p\u003e\n\u003cp\u003eThomas considered this. He could feel the approaching presence - almost palpable. If it was illusion, it was a most complete illusion.\u003c/p\u003e\n\u003cp\u003eWho? Panille insisted.\u003c/p\u003e\n\u003cp\u003eThomas knew he could not be in contact with a Shipman up there. Shipmen would panic when alien thoughts intruded. Who could it be then?\u003c/p\u003e\n\u003cp\u003eBitten.\u003c/p\u003e\n\u003cp\u003eThe freighter\u0027s identification signal came to him clear and unmistakable: a simple intense concentration without emotion.\u003c/p\u003e\n\u003cp\u003e\"Ahhhhhhh,\" Thomas said.\u003c/p\u003e\n\u003cp\u003eTo Panille, the startling thing was Thomas\u0027 emotional response: deep amusement. Bitten was a flight-system computer, and the realization that his mind was in contact with a computer should not have amused the man. This could only be more evidence of the mystery which so attracted Avata.\u003c/p\u003e\n\u003cp\u003eThey were both forced to concentrate on their mental linkage with Bitten then, but Panille could not explain why this aroused a deep fear reaction in him. He felt it, though, a fear which radiated from his own flesh and outward into every cell of Avata. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-59.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
