{"id":98774,"no":60,"title":"Page 60","content":"\u003cp\u003eSHIP: I have taught you about the classical Pandora and her box.\u003c/p\u003e\n\u003cp\u003ePANILLE: I know how this planet got its name.\u003c/p\u003e\n\u003cp\u003eSHIP: Where would you hide when the serpents and shadows oozed out of the box?\u003c/p\u003e\n\u003cp\u003ePANILLE: Under the lid, of course.\u003c/p\u003e\n\u003cp\u003e- Kerro Panille, Shiprecords\u003c/p\u003e\n\u003cp\u003eWAELA FELT that she lived only in a dream, unable to trust any reality. She held her eyes closed, a tight seal against the world beyond her flesh. This was not enough. Part of her awareness told her that she was controlling the landing approach of a freighter. Insane! Another part recorded the moments before the suns lifted in the shadow of Black Dragon. Panille was there, too, somewhere low in the shadow. I\u0027m hallucinating.\u003c/p\u003e\n\u003cp\u003eHalt!\u003c/p\u003e\n\u003cp\u003eWaela felt anxiety coming from Hal.... and Hali was nearby. It was an odd anxiety - tension overlain with a deliberate effort to remain calm.\u003c/p\u003e\n\u003cp\u003eHali is terribly afraid and even more afraid that she will show it. She wants someone to take charge.\u003c/p\u003e\n\u003cp\u003eOf course - Hali has never been off Ship before.\u003c/p\u003e\n\u003cp\u003eWaela tried to move her lips, tried to form reassuring words, but her mouth was too dry. Speech required enormous effort. She felt trapped, convinced that she lay strapped into a passenger couch in a freighter diving toward heavy surf.\u003c/p\u003e\n\u003cp\u003eA piece of Kerro\u0027s poem floated through Waela\u0027s awareness then, and she focused on it in both fascination and fear, having no memory of where she had heard this poem:\u003c/p\u003e\n\u003cp\u003eYour course will be true when you sight\u003c/p\u003e\n\u003cp\u003ethe blue line of sunrise, at night\u003c/p\u003e\n\u003cp\u003elow in the shadow of Black Dragon.\u003c/p\u003e\n\u003cp\u003eHali was there, too, listening to the fragment and rejecting it. A wave of emotion rushed over Waela, made her want to reach out and hold Hali close, to cry with her. She knew this emotion - love of the same man. But she saw Pandora very close no...raging white line of surf. Waela wanted to cringe away from it. She could feel the child in her womb, another awareness whose share of life reached out and out and out and ou....\u003c/p\u003e\n\u003cp\u003eA cry escaped her, but the sound was lost in the abrupt roaring, metal-straining protest as the freighter made its first contact with the sea. For a few blinks, the ride smoothed; there was a gliding sensation followed by a cushioned deceleration and lifting, then a grating, grinding cacophony which ended in a thumping and stillness.\u003c/p\u003e\n\u003cp\u003e\"Where are the people?\" That was Hali\u0027s voice.\u003c/p\u003e\n\u003cp\u003eWaela opened her eyes, looked upward at the ceiling of the freighter\u0027s sparse cabin - metal beams, soft illumination, a winking red light. Somewhere there was a sound of surf. The freighter creaked and popped. Abruptly, it tipped a full degree.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s someone.\" That was old Ferry.\u003c/p\u003e\n\u003cp\u003eWaela turned her head, saw Ferry and Hali releasing themselves from the command couches. The plaz beyond them framed a seamed barrier of black rock only a few meters away illuminated by wavering beams of artificial light.\u003c/p\u003e\n\u003cp\u003eFerry\u0027s hand moved to a control in front of him. There was a hiss near Waela\u0027s feet, then the sudden rush of cold sea wind through an open hatchway. It was night beyond those moving lights. The hatch was blocked for a moment by the entrance of two people. As though awakening from a dream, Waela recognized them - Panille and Thomas.\u003c/p\u003e\n\u003cp\u003e\"Waela!\" They spoke in unison, both appearing startled at the sight of her.\u003c/p\u003e\n\u003cp\u003eHali pushed herself away from the control console, intensely aware that Panille was focused on Waela\u0027s mounded abdomen. Neither Panille nor the man with him, she realized, had expected to see Waela, and certainly not in the full bloom of pregnancy.\u003c/p\u003e\n\u003cp\u003e\"Kerro,\" Hali said.\u003c/p\u003e\n\u003cp\u003eHe faced her, equally startled. \"Hali?\"\u003c/p\u003e\n\u003cp\u003eThomas threw his head back in sudden laughter. \"You see? A surprise package from Ship!\"\u003c/p\u003e\n\u003cp\u003eWaela fumbled with the straps holding her to the couch. Hali rushed to assist her, released the straps and helped her off the couch. The sound of the surf was loud and they could feel its pounding through their feet.\u003c/p\u003e\n\u003cp\u003e\"Hello,\" Waela said. She took three short steps up to Thomas, hugged him.\u003c/p\u003e\n\u003cp\u003eHali tried to identify the play of emotions across the man\u0027s face. Fear?\u003c/p\u003e\n\u003cp\u003ePanille touched Hali\u0027s arm. \"This is Raja Thomas, leader of the army and nemesis of Morgan Oakes.\"\u003c/p\u003e\n\u003cp\u003e\"Army?\" Hali looked from Panille to Thomas.\u003c/p\u003e\n\u003cp\u003eThomas gently released Waela\u0027s grip around his waist, steadied her while he directed a glare at Panille. \"You joke about this?\"\u003c/p\u003e\n\u003cp\u003e\"Never.\" Panille shook his head.\u003c/p\u003e\n\u003cp\u003eHali could not understand the exchange, she started to frame a question, but Thomas spoke first.\u003c/p\u003e\n\u003cp\u003e\"What else is in the freighter?\"\u003c/p\u003e\n\u003cp\u003eThe Bitten program responded, a crackling voice from the overhead \u0027coder, full of baps and bursts of static but the listing of the cargo manifest remained understandable.\u003c/p\u003e\n\u003cp\u003e\"Weapons!\" Thomas said. He ran to the open hatch, shouted something to people outside, whirled back. \"We have to unload this thing before the surf breaks it up or Oakes\u0027 people destroy it. Everybody out!\"\u003c/p\u003e\n\u003cp\u003eHali felt a touch on her shoulder, Ferry standing there. \"I think I\u0027m owed an explanation.\" Even his demands were shaded in whines.\u003c/p\u003e\n\u003cp\u003e\"Later,\" Thomas said. \"There\u0027s a guide right outside who\u0027ll take you to our camp. She\u0027ll tell you everything you need to know.\"\u003c/p\u003e\n\u003cp\u003e\"Demons?\" Ferry asked.\u003c/p\u003e\n\u003cp\u003e\"Nothing like that around here,\" Thomas said. \"Now hurry it up whil....\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t dismiss him just like that!\" Hali protested. \"If it weren\u0027t for him, Murdoch would hav.... We\u0027d be dead!\"\u003c/p\u003e\n\u003cp\u003ePanille directed a quizzical stare at Hali, then at Ferry. \"Hali, this old man works for Oake.... and for himself. He\u0027s an expert at the game of power politics and he knows that we\u0027re a highly negotiable commodity.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all past,\" Ferry sputtered. The veins in his nose stood out like worms.\u003c/p\u003e\n\u003cp\u003e\"Your guide\u0027s waiting,\" Thomas said.\u003c/p\u003e\n\u003cp\u003e\"Her name\u0027s Rue,\" Panille said. \"You might remember her better as Rachel Demarest\u0027s cubbymate.\"\u003c/p\u003e\n\u003cp\u003eFerry swallowed, started to speak, swallowed again, then: \"Rachel?\"\u003c/p\u003e\n\u003cp\u003ePanille shook his head slowly from side to side.\u003c/p\u003e\n\u003cp\u003eA single tear formed at the corner of Ferry\u0027s right eye, slid down his veined cheek. He took a deep, trembling breath, turned and shuffled toward the hatch. All the energy and urgency he had displayed earlier were drained from him.\u003c/p\u003e\n\u003cp\u003e\"He really did save us,\" Hali said. \"I know he\u0027s a spy bu....\"\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" Thomas asked.\u003c/p\u003e\n\u003cp\u003e\"This is Med-tech Hali Ekel,\" Panille said.\u003c/p\u003e\n\u003cp\u003eHali looked up at Thomas - so tall! His eyes held her. He appeared to be in some ageless ring of middle age, but when she took the hand he held out to her, it felt firm and youthful. A commanding hand, confident. She grew aware then that Waela and Kerro were touching. Kerro\u0027s arm was around Waela\u0027s shoulder, guiding her toward the hatchway.\u003c/p\u003e\n\u003cp\u003e\"Med-tech,\" Thomas said. \"You\u0027ll be a great help to us, Hali Ekel. Come this way.\"\u003c/p\u003e\n\u003cp\u003eHali resisted the pressure of his arm and watched Kerro reach out, inquisitive, to touch Waela\u0027s abdomen with one finger.\u003c/p\u003e\n\u003cp\u003eThomas saw the gesture and focused on Waela. \"Something\u0027s wrong with her. She should not be that bi....\"\u003c/p\u003e\n\u003cp\u003eThomas loves her, Hali thought. The sound of concern was plain in his voice.\u003c/p\u003e\n\u003cp\u003e\"My pribox says she\u0027s only a few diurns from parturition,\" Hali said.\u003c/p\u003e\n\u003cp\u003e\"That can\u0027t be!\"\u003c/p\u003e\n\u003cp\u003e\"But it is. Only a few diurns. Otherwis....\" Hali shrugged. \"...she appears to be healthy.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s impossible, I say. It takes much longer for a baby to develop int....\u003c/p\u003e\n\u003cp\u003e\"Lewis does it. You heard what the E-clones said.\" That was Kerro returned from the hatchway, not concealing a faint amusement at Thomas\u0027 confusion.\u003c/p\u003e\n\u003cp\u003e\"Yes, but. . .\" Thomas shook his head.\u003c/p\u003e\n\u003cp\u003e\"Can you climb down to the beach by yourself, Hali?\" Panille asked. \"The rear of the freighter is already breaking up. And I think Wael....\"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course.\" She moved past him - the familiar face and familiar voice, his body much thinner than she remembered, though. It struck her then: He\u0027s not the Kerro I knew! He\u0027s change.... so different.\u003c/p\u003e\n\u003cp\u003eBehind her, she heard Thomas muttering: \"I want to examine that woman myself.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-60.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
