{"id":98778,"no":64,"title":"Page 64","content":"\u003cp\u003eWhen humans act as spokesmen for the gods, mortality becomes more important than morality. Martyrdom corrects this discrepancy but only for a brief interval. The sorry thing about martyrs is that they are not around to explain what it all meant. Nor do they stay to see the terrible consequences of martyrdom.\u003c/p\u003e\n\u003cp\u003e- You Are Spokesmen for Martyrs, Raja Thomas, Shiprecords\u003c/p\u003e\n\u003cp\u003eLEGATA SWITCHED the big screen from sensor to sensor, trying to make sense of what the instruments reported. Images blurred, re-formed in different perspective. Cutter beams slashed across the plain, she could see bodies, odd movements. Alarm buzzers signaled damage to a section of the Redoubt\u0027s perimeter. She heard Lewis dispatch repair and defense teams. Defense cutters beamed into action, directed by key people in the Center. She kept her attention on the mystery in the screens. In the split-screen images an occasional blur slipped past - as though some outside force were confusing the instruments.\u003c/p\u003e\n\u003cp\u003eShe wiped a sleeve across her forehead. The two suns had climbed high while the confused battle went on, and the Redoubt\u0027s life-support had been reduced to minimum, shunting energy to weapons. It was hot in the Command Center and the nervous movements of Oakes at her elbow irritated her. In contrast, Lewis appeared unaccountably calm, even secretly amused.\u003c/p\u003e\n\u003cp\u003eIt was carnage on the plain, no doubt of that. The clones in the Command Center affected extreme diligence at their duties, obviously fearful that they might be sent outside into the battle.\u003c/p\u003e\n\u003cp\u003eLegata hit replay. Something blurred across the big screen.\u003c/p\u003e\n\u003cp\u003e\"What was that?\" Oakes demanded.\u003c/p\u003e\n\u003cp\u003eLegata hit fix, but the sensors failed to resolve an image. Once more, she hit replay and zoomed in close to the blur. Nothing sensible. She touched replay again and slowed the projection, asking the Redoubt\u0027s computer system for image enhancement. A slow shape writhed across the screen, vaguely humanoid. It moved between two rocks, struggled with some heavy object, then moved away.\u003c/p\u003e\n\u003cp\u003eA harsh blue beam snaked from somewhere within the blurred area, alarm signals were indicated by flashing blinkers at the corners of the screen. She ignored them - that was past, and Lewis had met the emergency. Something more important was indicated on the screen: a slow blossom of red-orange which had not revealed itself there before.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" Oakes demanded. \"What caused that?\"\u003c/p\u003e\n\u003cp\u003e\"I think they\u0027re influencing our sensor system,\" she said. And she heard the disbelief in her own voice.\u003c/p\u003e\n\u003cp\u003eOakes stared at the screen for several blinks, then: \"The ship! The damned ship\u0027s interfering.\"\u003c/p\u003e\n\u003cp\u003eSweat droplets glistened on his upper lip and jowls. She could smell him beginning to crack.\u003c/p\u003e\n\u003cp\u003e\"Why would the ship do that?\" Lewis asked.\u003c/p\u003e\n\u003cp\u003e\"Because of Thomas. You saw him out there.\" Oakes\u0027 voice was breaking.\u003c/p\u003e\n\u003cp\u003eLegata switched sensors, keyed for the broad view of the cliffside staging area where the attack had originated. The demons were gone, not visible anywhere. The poet no longer sat his perch atop the pinnacle. The arc of watching hylighters had diminished to a thin rim atop the cliffs. The whole scene stood out in the glare of double sunlight.\u003c/p\u003e\n\u003cp\u003e\"Where are the hylighters?\" she asked. \"I didn\u0027t see them go.\"\u003c/p\u003e\n\u003cp\u003e\"None in close,\" Lewis said. \"Maybe they\u0027ve gone off somewhere t....\" He broke off at a commotion near the open passage hatch.\u003c/p\u003e\n\u003cp\u003eLegata turned to see a dark-haired Natural, a crew supervisor, slip into the Command Center. Sweaty and nervous, he hurried across to Lewis. There was celltape covering a gory burn on the man\u0027s bare left shoulder and his eyes showed the glazing of a painkiller.\u003c/p\u003e\n\u003cp\u003eSo there are Naturals outside, too, she thought.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re getting lots of wounded clones, Jesus,\" the man said. His voice was hoarse, tense. \"What do we do with \u0027em?\"\u003c/p\u003e\n\u003cp\u003eLewis looked at Oakes, fielding the question.\u003c/p\u003e\n\u003cp\u003e\"Set up an infirmary,\" Oakes said. \"Clones\u0027 quarters. Let \u0027em treat their own.\"\u003c/p\u003e\n\u003cp\u003e\"Not many of them understand medical care,\" Lewis said. \"Some are pretty young, remember.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" Oakes said.\u003c/p\u003e\n\u003cp\u003eLewis nodded. \"I see.\" He glanced at the crew supervisor. \"You heard it. Get busy.\"\u003c/p\u003e\n\u003cp\u003eThe man glared at Oakes, then at Lewis, but obeyed.\u003c/p\u003e\n\u003cp\u003e\"The ship\u0027s interfering with us,\" Oakes said. \"We can\u0027t spare medical people or any others right now. We have to devise a plan fo....\"\u003c/p\u003e\n\u003cp\u003e\"What is going on out there?\" Legata asked.\u003c/p\u003e\n\u003cp\u003eOakes turned, saw that once more she was running through the sensors, showing several at once. He glanced up at the screen and, at first, did not see what had attracted her attention. Then he saw i...rectangle high up on the right showed a silvery something creeping over the Redoubt\u0027s walls. It moved like a slow-motion wave, blanking out sensors, creeping up and up. Legata compensated for the obscured sensors, moving back and back through new sensors. The wave was composed of countless glittering threads bright in the glare of the double suns.\u003c/p\u003e\n\u003cp\u003e\"Spinnerets,\" Lewis hissed.\u003c/p\u003e\n\u003cp\u003eThe entire room became so quiet that the air was brittle with listening.\u003c/p\u003e\n\u003cp\u003eLegata continued, busy at the console.\u003c/p\u003e\n\u003cp\u003eLewis turned to the Naturals guarding the Command Center. \"Harcourt, you and Javo take a \u0027burner and see what you can do to cut through that Spinneret mesh.\"\u003c/p\u003e\n\u003cp\u003eThe men did not respond.\u003c/p\u003e\n\u003cp\u003eLegata smiled to herself at the continued quiet in the room. She could feel the tensions building to the precise moment she desired. It had been right to wait.\u003c/p\u003e\n\u003cp\u003eThere was a heavy stirring in the room. She glanced back, saw more clones pressing into the center from the passage. Some of them were the more outre E-types. Most appeared to be wounded. They obviously were looking for someone. A guttural voice called out from amidst the newcomers: \"We need medics!\"\u003c/p\u003e\n\u003cp\u003eLewis faced the two Naturals he had ordered to meet the Spinneret attack. \"You refuse to obey my orders?\"\u003c/p\u003e\n\u003cp\u003eHarcourt, his face red, repeated his protest: \"Send some clones. That\u0027s what they\u0027re for.\"\u003c/p\u003e\n\u003cp\u003eFrom somewhere in the center of the room, a thin voice shouted: \"We\u0027re not going out there!\"\u003c/p\u003e\n\u003cp\u003e\"Why should they go?\" Legata asked.\u003c/p\u003e\n\u003cp\u003e\"You stay out of this, Legata!\" Oakes screamed.\u003c/p\u003e\n\u003cp\u003e\"Just tell them why clones should go,\" she said.\u003c/p\u003e\n\u003cp\u003e\"You know why!\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Because the first out on any dangerous mission are clones. Harcourt\u0027s right. Clones first. That\u0027s the way it\u0027s always been, and that\u0027s the way it\u0027ll be.\"\u003c/p\u003e\n\u003cp\u003eSo he\u0027s pitching for the loyalty of the Naturals.\u003c/p\u003e\n\u003cp\u003eLegata looked at Lewis, met his gaze head on. Was that amusement in his eyes? No matter. She depressed a key on the console controlling the big screen, watched the people in the room. They could not miss what was happening on the screen. She had set the program to fill it.\u003c/p\u003e\n\u003cp\u003eYe.... the room was becoming a tableau, all attention shifting to the screen, locking on it.\u003c/p\u003e\n\u003cp\u003ePuzzled, Oakes turned to look at the screen, saw his own likeness there. Below the image, a biographical printout was rolling. He stared at the heading: \"Morgan Lon Oakes. Ref. Original File, Morgan Hempstead, cell dono....\"\u003c/p\u003e\n\u003cp\u003eOakes found it difficult to breathe. It was a trick! He glanced at Legata and the cold stare he met there iced his backbone.\u003c/p\u003e\n\u003cp\u003e\"Morga....\" How sweet her voice sounded. \"...I found your records, Morgan. See Ship\u0027s imprimatur on the printout? Ship vouches for the truth of this record.\"\u003c/p\u003e\n\u003cp\u003eA tic twitched the corner of Oakes\u0027 left eyelid. He tried to swallow.\u003c/p\u003e\n\u003cp\u003eThis is not happening! Muttering drifted through the room. \"Oakes a clone? Ship\u0027s eyes!\"\u003c/p\u003e\n\u003cp\u003eLegata stepped away from the console, moved to within a meter of Oakes. \"Your nam.... that\u0027s the name of the woman who bore you - for a fee.\"\u003c/p\u003e\n\u003cp\u003eOakes found his voice: \"This is a lie! My parent.... our sun went nov....... .\"\u003c/p\u003e\n\u003cp\u003e\"Ship says not so.\" She waved at the screen. \"See?\"\u003c/p\u003e\n\u003cp\u003eThe data continued to roll: Date of cell implantation, address of pseudo-parents, name....\u003c/p\u003e\n\u003cp\u003eLewis came up to stand at Oakes\u0027 shoulder. \"Why, Legata?\" There was no denying the amusement in his voice.\u003c/p\u003e\n\u003cp\u003eShe refused to take her attention from the stricken look on Oakes\u0027 face. Why do I want to comfort him?\u003c/p\u003e\n\u003cp\u003e\"The Scream Room was a mistake,\" she whispered.\u003c/p\u003e\n\u003cp\u003eSomeone off toward the edge of the room shouted: \"Clones first! Send the clone out!\" It began as a chant, grew to a pounding rage: \"Send the clone out!\"\u003c/p\u003e\n\u003cp\u003eOakes screamed: \"No!\"\u003c/p\u003e\n\u003cp\u003eBut hands grabbed him and Legata was powerless to prevent it in the crush of people without using her great strength to kill. She found herself unable to do this. Oakes\u0027 voice screaming: \"No! Please, no!\" grew fainter across the room, out into the passage, was lost in the shouting of the mob.\u003c/p\u003e\n\u003cp\u003eLewis moved to the console, shut off the data, keyed a high sensor still free of the Spinneret webs. It showed the sudden gush of a \u0027burner opening a gap through the web where the wall had been breached by a cutter beam from outside. Presently, Oakes stumbled into view outside, running alone across Pandora\u0027s deadly plain. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-64.html","bookId":2170,"creation":"Oct 5, 2019 6:37:03 PM","modification":"Oct 5, 2019 6:37:03 PM"}
