{"id":92889,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“True.”\u003c/p\u003e\n\u003cp\u003eI swung my gaze back to Ronan. “Then why is he even here?”\u003c/p\u003e\n\u003cp\u003eThe question had been rhetorical. I hadn’t expected him to answer. But he surprised me, offering, “Perhaps the vampires believe he will be tractable.”\u003c/p\u003e\n\u003cp\u003eTractable. They’d bend this poor, dim boy to their will. And then they’d use his outsized physical strength against the rest of us.\u003c/p\u003e\n\u003cp\u003eEither I could do as I was assigned and kill Toby Engel now, while he was still an innocent, or I could kill him later, after he’d invariably gone bad, joining the other guys on this island who’d discovered just how fun it was to torment the girls.\u003c/p\u003e\n\u003cp\u003eMy vision wavered. I had to flee. That Ronan could see how upset I was made my urge to escape all the more intense. I needed to bus my dishes and get the hell out of there. “Gotta go,” I blurted, scooping up my tray and standing.\u003c/p\u003e\n\u003cp\u003eBut Ronan wasn’t going to let me go that easily. He snarfed down a last bite of his apple and hopped up to follow me to the dish cart, the majority of his dinner left untouched. “See you at wilderness workshop,” he said, mimicking my earlier words.\u003c/p\u003e\n\u003cp\u003eDamned if it didn’t bring a smile to my face.\u003c/p\u003e\n\u003cp\u003eIn my time on the island, I’d known varying degrees of trust for him, but I guessed he really was a friend. I guessed I needed that.\u003c/p\u003e\n\u003cp\u003eThe prospect of making my way through the sea of bodies back to the main entrance was too nightmarish to consider, so I headed to the service exit near the kitchens instead. I shoved open the metal door, leaving the cocoon of warmth and noise that was the dining hall, and was plunged into the cold, quiet air of the back hallway.\u003c/p\u003e\n\u003cp\u003eAlone again.\u003c/p\u003e\n\u003cp\u003eUntil I heard the clip of shoes behind me.\u003c/p\u003e\n\u003cp\u003eI sped up a little, fighting the urge to turn around. If my follower were friendly, they’d call ahead to me. But they didn’t speak. I told myself the person just happened to be using this same back exit at the same time as me, which meant I could speed up and their pace wouldn’t change at all. To test the theory, I walked just the teensiest bit faster.\u003c/p\u003e\n\u003cp\u003eTheir pace increased to match mine.\u003c/p\u003e\n\u003cp\u003eCrap. They were following. It was a menacing clip-clip, right behind me.\u003c/p\u003e\n\u003cp\u003eI burst into a little race walk, around the storage area, the outside door in sight. But they walked faster, and faster still until that clip-clipping burst into a jog. It definitely wasn’t a benign, let-me-catch-up-so-we-can-chat sound.\u003c/p\u003e\n\u003cp\u003eI felt the person at my back—sensed it was a guy—and I began to turn, but before I could get into position, he’d pinned me from behind, my throat trapped in the crook of his arm. My body instinctively exploded to action, wriggling and bucking. “Get…off.” My voice was a rasp as he choked the air from me.\u003c/p\u003e\n\u003cp\u003eI recognized the arm now. Long and leanly muscled, I’d seen it thousands of times, slung over the shoulders of my best friend. It was Yasuo. Yasuo was the person strangling me from behind. I clawed frantically at his forearm, but it was a steel band around my neck. “Enough,” I croaked. “Stop.”\u003c/p\u003e\n\u003cp\u003e“You didn’t stop,” he growled, and it was a feral sound, like he’d already made the full transformation from teenaged boy into something monstrous. He flexed his arm tighter. “Not when you fought her. This is for Emma.”\u003c/p\u003e\n\u003cp\u003eMy movements grew weaker, slower. I needed to think this through, but it was so hard. He’d choked off blood flow to my brain, and I was fading fast. If I didn’t stop him, he would kill me.\u003c/p\u003e\n\u003cp\u003eNo ! a voice shrieked in my head. My own panic would be the thing that killed me. The first order of business was to calm the hell down. I’d held my breath for far longer than this. I grew utterly still, envisioning a self that didn’t require oxygen to survive.\u003c/p\u003e\n\u003cp\u003eWe’d practiced choke holds in Priti’s class. I knew the move I had to do. Pictured the mechanics of my escape. I wasn’t strong enough to pry my way out, but I could use leverage against Yasuo. The right twist, the right flex and angle…It was all physics.\u003c/p\u003e\n\u003cp\u003ePower, not strength.\u003c/p\u003e\n\u003cp\u003eThe thing about grappling, it was counterintuitive. To get away, first you had to get closer.\u003c/p\u003e\n\u003cp\u003eI grabbed Yasuo’s wrist and wrenched myself even more snugly into the crook of his elbow. The move opened the tiniest gap for me to shift, and I twisted in to him. Hugged him tightly around the waist. I ducked, bowed, and then was free.\u003c/p\u003e\n\u003cp\u003eI shoved off him at once and began to jog back and away, under no illusions that I could beat him if the fight got ugly. “Don’t…say…” I coughed and clutched at my aching throat, catching my breath. “Don’t talk…about Emma.”\u003c/p\u003e\n\u003cp\u003eWhen he didn’t pounce on me, I slowed. Stopped. And then I stared.\u003c/p\u003e\n\u003cp\u003eHe was simply standing there, quaking, looking like a shell of the Yas he’d been. He was off his game. So much so, I wondered if I actually might have been able to beat him in a fight.\u003c/p\u003e\n\u003cp\u003eIt gave me the courage to risk saying more. “This is the last thing…” My throat spasmed, coughs racking me, but I managed to catch my breath and swallow. “She wouldn’t want this.”\u003c/p\u003e\n\u003cp\u003eI paused to give my words meaning beyond this one tussle in this particular hallway. She wouldn’t have wanted us to fight here, and more than that, she wouldn’t have wanted this distance between us. We were becoming exactly what the vampires wanted us to become: scared, estranged, suspicious—things that made us need them.\u003c/p\u003e\n\u003cp\u003e“We don’t have to do this,” I said. It was a simple statement, and yet to believe it stole just the tiniest bit of power from them. I’d find ways to steal even more.\u003c/p\u003e\n\u003cp\u003eI’d convince Yasuo that I wasn’t the enemy. Convince him that I wasn’t the one to attack. If he channeled his anger at the real culprits instead, if we sided together against the vampires, we’d be stronger. Power could be ours for the taking.\u003c/p\u003e\n\u003cp\u003ePower, not strength…my new motto.\u003c/p\u003e\n\u003cp\u003eCHAPTER NINE\u003c/p\u003e\n\u003cp\u003eI was shivering in the bitter January night, trembling, race-walking back to the dorm. Yas had profoundly freaked me out. He was increasingly unstable, and I worried he was losing it, like in a fundamental about-to-snap sort of way.\u003c/p\u003e\n\u003cp\u003eI understood his anguish. His anger. But his fury went beyond grief or blame to something deeper. He felt horror, and he blamed me. If I found out what happened to Emma, maybe I could convince him that her death wasn’t my fault. Maybe then he’d forgive me.\u003c/p\u003e\n\u003cp\u003eCarden had sensed my distress, and this time, he hadn’t waited. He came right to me, catching up with me on the way back from dinner—right after my tussle with Yasuo. Like, right after.\u003c/p\u003e\n\u003cp\u003eHe simply appeared beside me on the path, startling me. “Who hurt you?”\u003c/p\u003e\n\u003cp\u003eI put a hand to my chest, gasping a breathy half laugh. “Don’t do that.”\u003c/p\u003e\n\u003cp\u003e“I caught you unawares.” His eyes hardened. “You must always be on guard. It is a lesson you must learn if you are to survive.” He softened, putting a fingertip beneath my chin. “And I’d prefer it if you survived, aye?”\u003c/p\u003e\n\u003cp\u003e“My guard is just fine.” I couldn’t help it—the fight with Yas had been too disturbing—and there was an edge to my voice that didn’t usually come out when I was with Carden. “In case you haven’t noticed, you vampires are a little on the stealthy side.”\u003c/p\u003e\n\u003cp\u003eVampires, and Yasuo was becoming one of them. I put a hand to my throat, feeling the ghost of his arm constricting around my neck. It was like he was still choking me. All those fragile bones ready to snap. And even worse than the physical sensation was the betrayal. That was what strangled me now. My loneliness, suffocating me.\u003c/p\u003e\n\u003cp\u003e“Have you been hurt?” He sounded ready to throttle someone. “Are you unwell? Speak to me.”\u003c/p\u003e\n\u003cp\u003eI resumed walking, and Carden fell into step. “It’s just…” I reminded myself I wasn’t as alone as I felt. He’d sensed my distress and come to me at once. It should’ve been enough to improve my mood, and yet it was so hard to wrap my mind around. I still didn’t completely trust the feelings between Carden and me. I mean, the guy was a vampire. I dared not tell him my concerns about Yasuo. I still held out hope that Yas and I could mend our friendship, and I didn’t want him to be the one Carden throttled. “Let’s just say the suck factor is particularly high today.”\u003c/p\u003e\n\u003cp\u003eCarden was quiet for a moment, then said, “As you wish.” He knew I was holding something back, and to his credit, he didn’t push me on it.\u003c/p\u003e\n\u003cp\u003eThough…\u003c/p\u003e\n\u003cp\u003eWhy didn’t he push me on it? Only someone who had their own secrets wouldn’t demand the full story. As you wish. And didn’t that just sum him up? Carden did as he wished.\u003c/p\u003e\n\u003cp\u003eI gave a shake to my head. I couldn’t let myself spin out like this. What I needed was a refuge. A place where I could be safe, just for a little while. “Where do you stay?” I asked abruptly.\u003c/p\u003e\n\u003cp\u003e“Close by your side?” He raised a questioning brow, that jaunty grin of his firmly in place. Ever the smooth-talking flirt.\u003c/p\u003e\n\u003cp\u003eIt was a great way to avoid the question.\u003c/p\u003e\n\u003cp\u003eFor once, I didn’t take the bait. “No, I mean when you sleep.”\u003c/p\u003e\n\u003cp\u003e“I don’t sleep.”\u003c/p\u003e\n\u003cp\u003e“Okay, rest. Where do you stay at night?” Was it in the keep? Did he know the secret horrors of the island? Was he behind it, with the other vampires? The rapid-fire thoughts had me freaking out.\u003c/p\u003e\n\u003cp\u003e“It’s no secret, dove.” His features grew quiet, like he only now realized he was dealing with little miss crazypants. And how I hated the feeling that I was pulling the clichéd psycho girlfriend thing. But he tipped his head, looking off to the right, and gently said, “Northeast of here, there’s an old hunting bothy. I use it when I need to come in from the light.”\u003c/p\u003e\n\u003cp\u003e“Will you take me there?”\u003c/p\u003e\n\u003cp\u003eHe paused. “Not tonight. But soon. Soon I will show you.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you stay in the keep with the other vampires?”\u003c/p\u003e\n\u003cp\u003e“I avoid Hugo’s lair at all costs, and I’d have you do the same.”\u003c/p\u003e\n\u003cp\u003e“What goes on in there?” I needed to know the secret of that castle.\u003c/p\u003e\n\u003cp\u003e“Why the sudden interest?”\u003c/p\u003e\n\u003cp\u003eI couldn’t stop now. Carden and I were close. If he truly cared about me, he wouldn’t keep secrets. “If Emma was alive when they took her to the castle, what would’ve happened to her there?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-keep-the-watchers-4/page-11.html","bookId":2294,"creation":"Oct 5, 2019 5:58:59 PM","modification":"Oct 5, 2019 5:58:59 PM"}
