{"id":92895,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Why am I with you?” The words came out sounding amused and perplexed.\u003c/p\u003e\n\u003cp\u003eI mustered energy enough to pull clear of his embrace, though his fingers remained tangled in my hair. “I’m serious. I’m not the prettiest girl on the island. I’m smart, but hell, that Audra-Frost girl isn’t exactly a dummy. I’m…I don’t know…I’m just me.”\u003c/p\u003e\n\u003cp\u003eHe used a single finger to trace the hair from my brow. “That’s it precisely. You’re just you.” He let that sink in; then, growing quiet, he added, “Perhaps you help me to remember.” At my questioning look, he elaborated. “You are an innocent. You are so steadfast. So true.”\u003c/p\u003e\n\u003cp\u003e“An innocent, huh?” So how come I didn’t feel so innocent? I considered his other words—steadfast. True. Ronan had called me loyal once. I’d never really thought about it, but maybe they were right. After all, I felt ready to risk it all to discover what’d happened to Emma.\u003c/p\u003e\n\u003cp\u003eSo then why wasn’t Yasuo recognizing any of this steadfast trueness?\u003c/p\u003e\n\u003cp\u003eI zoned out, thinking all this, and he must’ve mistaken my silence for bewilderment because he went on. “You have a sort of nobility. And when we’re together…it’s as though I, too, reclaim some part of that.”\u003c/p\u003e\n\u003cp\u003eI angled away to get a better look at him. He was trying to explain, but he’d actually made it worse. “So the reason you like me is that I’m Miss Dependable? And because I’m innocent—a fragile and ennobled human?” Was that all? I shifted to let the moonlight hit him, peering for the truth on his face. “You were one of those guys who went for the broken birds, weren’t you?”\u003c/p\u003e\n\u003cp\u003e“Broken birds?”\u003c/p\u003e\n\u003cp\u003e“You know. The kind of guy who likes to save the ones with the broken wings.”\u003c/p\u003e\n\u003cp\u003e“You intentionally misunderstand.” He pinched my chin. “Aye, it’s true. I’ve spent long years seeking a wee dove to adore. But not because I wished for one to tend. I’ve wanted one with whom I could soar.”\u003c/p\u003e\n\u003cp\u003eI leaned back with a sigh. Was it Carden’s words or that amazing accent that made it sound so fantastic?\u003c/p\u003e\n\u003cp\u003eI couldn’t think anymore and snuggled close, suddenly so tired. The extra-intense feeding had finally gotten to me, like I’d consumed three consecutive Thanksgiving dinners. I must’ve fallen asleep because I felt his arms slide under my legs, under my shoulders, and I had the sensation of the ground rushing away from me as he lifted me up. I wrapped an arm around his neck, curling into him.\u003c/p\u003e\n\u003cp\u003eSomething happened as he slipped through the doors of the dorm. It was the middle of the night, but still, deep-seated instinct woke me. I tensed, suddenly on alert, aware of every creak and rustle.\u003c/p\u003e\n\u003cp\u003e“Quiet yourself,” he whispered in my ear. “Nobody will hear us.”\u003c/p\u003e\n\u003cp\u003eWe reached my room. Still holding me, he leaned down and turned the knob. Miraculously, the door opened without its usual moan.\u003c/p\u003e\n\u003cp\u003eMy eyes went to Frost, sound asleep in her bed. “Don’t wake her.”\u003c/p\u003e\n\u003cp\u003eHe paused, his breathing low and even. He looked like he was sending his consciousness into the universe, if that made any sense. “She will not wake,” he said with surety.\u003c/p\u003e\n\u003cp\u003e“Okayyy.” I slid from his arms. “Someday you’ll need to explain that.”\u003c/p\u003e\n\u003cp\u003eI stood, but was still woozy, and I lurched, grabbing one hand to his chest and one on my bureau to steady me.\u003c/p\u003e\n\u003cp\u003eHis laugh was a low rumble in the darkness. “You must rest.”\u003c/p\u003e\n\u003cp\u003eMy fingers curled on the top of the dresser, palm sliding instinctively along the front. “Wait,” I said, deciding there was one last thing I’d share. “I need to show you something. A picture.”\u003c/p\u003e\n\u003cp\u003eThe picture. The one of my mom that I’d treasured my whole life. Old and yellowed, the paper had begun to separate at one of the corners.\u003c/p\u003e\n\u003cp\u003eI went to my desk and retrieved the gift Carden had given me. Our eyes met as I pulled it from my bookshelf. He grinned at me, obviously pleased.\u003c/p\u003e\n\u003cp\u003eBut as I peeled back the false binding, I knew a flare of panic. I was showing Carden everything now. The photo. Its very existence could get me killed.\u003c/p\u003e\n\u003cp\u003eNot to mention Ronan—he’d risked much getting that picture back for me. We’d never discussed it again. If the vampires found out, he’d be dead meat.\u003c/p\u003e\n\u003cp\u003e“This is her. My mom.” I handed him the photo. It was the ultimate show of trust. But still, I couldn’t help but plead, “You can’t tell.”\u003c/p\u003e\n\u003cp\u003eThe look he gave me put me instantly at ease. “Your secrets follow me to the grave.”\u003c/p\u003e\n\u003cp\u003eI sighed, watching him as he studied it. I’d expected him to warm to it. Or maybe to look from her to me and back again, catching the resemblances. We had the same wide eyes. The same mouth. But instead his reaction was the last one I expected.\u003c/p\u003e\n\u003cp\u003eHis eyes dimmed. He was cold, handing it back to me. He gave me a sharp nod.\u003c/p\u003e\n\u003cp\u003eWhat the hell?\u003c/p\u003e\n\u003cp\u003eDid he realize how much of a leap of trust this was and decide we’d gotten too close? Did he know this was completely illegal for me to have? Or worse, had he guessed that Ronan was the one who’d stolen it back for me?\u003c/p\u003e\n\u003cp\u003eBut in an instant he was Carden again, leading me to my bed, tucking me in. “You must drink, my love.” He held his wrist before my lips.\u003c/p\u003e\n\u003cp\u003eSo I must’ve just imagined his reaction. It made sense—I was really out of it, like I’d been drugged. “Drink again?” I asked groggily.\u003c/p\u003e\n\u003cp\u003e“You must. Just a wee bit. Just once more.”\u003c/p\u003e\n\u003cp\u003eI fought to keep my eyes open. “I’m too tired.”\u003c/p\u003e\n\u003cp\u003eHe rubbed his skin against my lips, and instinctively I opened my mouth. Instinctively, I suckled. I couldn’t help it—as sated as I was, my body still longed for it. He was whispering odd things to me, mesmerizing me, things I only half heard in my stupor. About how strong I was. How strong I would be.\u003c/p\u003e\n\u003cp\u003eHow strong I’d need to be.\u003c/p\u003e\n\u003cp\u003eHe stroked a slow hand up and down my side, and I moaned with contentment. I wanted to open my eyes to get a last peek at him for the night, but I was so tired. So full.\u003c/p\u003e\n\u003cp\u003e“You must take care, my love. Do naught that is foolish.”\u003c/p\u003e\n\u003cp\u003e“I’m just going to bed, dumb-dumb. Do you think I even sleep recklessly?” I gave a muzzy chuckle. “Don’t go all Ronan on me, okay?”\u003c/p\u003e\n\u003cp\u003eHe was silent for a second, long enough for me to hold my breath and wonder if I’d made a misstep mentioning Ronan. But then he spoke again, his tone oddly pensive. “He looks out for you, Ronan does. You believe he has your interests at heart?”\u003c/p\u003e\n\u003cp\u003eI sighed, relieved at his soothing tone, and nestled deeper in my blankets, sleep beckoning me. It was an effort to parse his question, and I shrugged drowsily.\u003c/p\u003e\n\u003cp\u003e“Annelise? Ronan. He looks out for you?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Sure.” Part of my brain cried that I should be paying more attention, that something else was being asked here. But I was so very tired, the lure of sweet sleep pulling me down and down. “I remind him of his sister.”\u003c/p\u003e\n\u003cp\u003eI faded then and was drawn back to consciousness one last time as he tucked the sheets tightly around my shoulders. He leaned down and whispered in my ear, “Good-bye, sweet love.”\u003c/p\u003e\n\u003cp\u003eBe strong? Good-bye? Why was he sounding so intense?\u003c/p\u003e\n\u003cp\u003eI wanted to ask him. I meant to ask him, but before I could form the words, I slid into unconsciousness.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTEEN\u003c/p\u003e\n\u003cp\u003eIt didn’t surprise me that I didn’t see Carden the next day or even the day after that. He was always so quick to come when I felt alone or afraid, but since our night together, I’d felt awesome.\u003c/p\u003e\n\u003cp\u003eI felt empowered. Fierce. While extra doses of blood could be dangerous to some, to me it was like medicine. Like vitamins. Like pure…liquid…bliss. I breathed more deeply. My senses were more acute. My muscles were limber and taut. I felt like a machine. A Ferrari.\u003c/p\u003e\n\u003cp\u003eI was determined to use that strength. To hone it. To take advantage. I’d be the strongest girl on this island. I’d show Alcántara he couldn’t control me. I’d use everything this place had to offer; then I’d blow the roof off.\u003c/p\u003e\n\u003cp\u003eWhich meant I had to destroy all my weaknesses. Banish all my fears. And there was one nagging fear that lingered above all others: water.\u003c/p\u003e\n\u003cp\u003eI hadn’t known how to swim when I’d arrived, but Ronan had taken me under his wing. Taught me to float. Then to swim. Later, to surf. But I still hadn’t gotten past my fear of it, not completely. When Izzy and Aubrey had held my face in the surf, it’d all rushed back—that panic I felt underwater, feeling it whoosh up my nose and gurgle into my ears.\u003c/p\u003e\n\u003cp\u003eI was only as strong as my greatest shortcoming, and my lingering fear of water was one pretty ginormous shortcoming. I mean, we were on an island in the middle of the sea, right?\u003c/p\u003e\n\u003cp\u003eI needed to get past it once and for all.\u003c/p\u003e\n\u003cp\u003eI checked my watch as I jogged from the dining hall to the pool. I had a good hour till curfew forced me back to the room. The task I’d set for myself was simple—do some laps, then practice my breath-holding exercises. Ever since I’d learned that people could train themselves to hold their breath for fifteen minutes or longer, I’d been dying to work on it. But I’d also learned that immersion in water triggered something in the brain, meaning it did no good to practice unless you were actually underwater.\u003c/p\u003e\n\u003cp\u003eWith my increased feedings with Carden, I needed to discover what else my body might be capable of. So far, my underwater record was two minutes. It wasn’t much, but it sure beat my original fifteen-second attempts.\u003c/p\u003e\n\u003cp\u003eThe natatorium glowed from across the campus in the bitter darkness, its bright interior lights shooting from windows high overhead. It always amazed me to find people working out at this hour. I was never a gym rat myself, especially not after dinner. Yuck. Yawn. No thanks.\u003c/p\u003e\n\u003cp\u003eOn those rare times I had needed to venture to the gym outside of class, it was like how I imagined visiting a foreign country might be—you knew these people existed, knew they had different customs from you, but still, opening that door, walking from darkness into the bright hum of fluorescent lights and the chatter of sweating kids was always a shock. I tried to avoid it as much as possible.\u003c/p\u003e\n\u003cp\u003eHeading to the pool at this hour was no different. The natatorium was a large, hollow building, and with its Olympic-sized pool, mazes of locker rooms, showers, and hot tubs, its sole purpose was aquatics-related activities. I hadn’t even made it inside before I heard those unmistakable pool sounds and stopped to take it all in. The splashes. Distant voices calling to one another, reverberating in the cavernous space. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-keep-the-watchers-4/page-17.html","bookId":2294,"creation":"Oct 5, 2019 5:58:59 PM","modification":"Oct 5, 2019 5:58:59 PM"}
