{"id":111448,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe tops of the ruts were drier. She tiptoed across them and up through the trees, out of sight of the docks. The woods had never been a comfortable place for Briar: she was a city child born and bred, and the wide-trunked walls of bark and brush made her feel small and anxious, as if she were trapped in a fairy tale with wolves.\u003c/p\u003e\n\u003cp\u003eShe tripped up the way, trying hard to keep her heels from sticking in the thick, wet surface. As she scaled the rolling landscape the trail became wider and clearer, but she still saw no one else coming or going along it.\u003c/p\u003e\n\u003cp\u003e“But it’s early yet,” she said to herself.\u003c/p\u003e\n\u003cp\u003eThe trees were higher the farther back she wandered, and the forest was thicker the deeper she hiked into the heart of the island… which was why she didn’t realize she’d found another set of airship docks until she was nearly in their midst.\u003c/p\u003e\n\u003cp\u003eShe stopped herself fast and retreated back onto the trail only to realize that it had all but ended behind her. And she was no longer alone.\u003c/p\u003e\n\u003cp\u003eThree broad airmen stood smoking off to the side of a clearing. They all stopped smoking their pipes to stare at Briar, who was wholly uncertain of how to proceed but determined not to show it. She split a casual examination between the mottled airships and the three quiet, startled men.\u003c/p\u003e\n\u003cp\u003eMost of the ships were anchored to trees, tied like horses. The trees were fully stout enough to stand the weight, and they bore it with the odd creak or crack, but none of the ships sprung loose or failed. These ships were of a different sort, less glossy and less uniform than the ones at the main dock. They were not so much manufactured as cobbled together from bits and pieces of other, sturdier, larger vessels.\u003c/p\u003e\n\u003cp\u003eOver to the side of the airships, the smallest smoking man looked roughly like any given one of Briar’s coworkers, pale and a little dirty, in baggy clothes and a leather apron that had a pair of long leather goves sticking out of the pockets.\u003c/p\u003e\n\u003cp\u003eThe middle man was a mulatto with long hair braided into coiled ropes and pulled back in a scarf. He was wearing a fisherman’s sweater with a tall, folded neck that tucked up under his dense, dark beard. The remaining smoker was the best-dressed of the three, a coal-black Negro in a sharp blue jacket with bright brass buttons. A pink scar ran from the corner of his mouth nearly back to his ear, which was festooned with a row of small gold hoops that jangled when he started to laugh at the sight of her.\u003c/p\u003e\n\u003cp\u003eThe laugh began as a low, rumbling chortle and worked its way into a full-belly guffaw that his fellow smokers shortly joined him in.\u003c/p\u003e\n\u003cp\u003e“Hey there, lady,” the darkest man said, between hastily caught breaths. He had an accent that came from somewhere over the mountains, and to the south. “Are you lost?”\u003c/p\u003e\n\u003cp\u003eShe waited out the height of their shared hilarity, and when they were reduced to wheezes she said, “No.”\u003c/p\u003e\n\u003cp\u003e“Oh,” he said with a lift of his eyebrow. “So you’ve come to Canterfax-Mar on purpose, then, eh? I could not tell you the last time we had such a lady in our midst.”\u003c/p\u003e\n\u003cp\u003e“What’s that mean?” she asked.\u003c/p\u003e\n\u003cp\u003eHe shrugged and pursed his wide lips. “Only that you appear ready for business of a different sort. What is it you want from us here, at our lost little dock? Your mind is set on something firm, I can see that now.”\u003c/p\u003e\n\u003cp\u003e“I need a ride. I’m looking for my son. Can you help me?”\u003c/p\u003e\n\u003cp\u003e“Well, ma’am, that depends,” he said. He left his companions and came forward to meet her. She could not tell if he was trying to be intimidating, or if he only meant to see her closer; but he was more ominous than she’d expect for his size. He was no taller than her father had been, but his shoulders were wide and his arms were as thick as logs beneath the sleeves of the woolly blue jacket. His voice was low and loud, and it sounded almost wet inside his chest.\u003c/p\u003e\n\u003cp\u003eBriar did not back away or down. She did not move even to shuffle her feet. “What does it depend on?”\u003c/p\u003e\n\u003cp\u003e“Any number of things! For one, I must know where you wish to be, and how far you mean to go.”\u003c/p\u003e\n\u003cp\u003e“You do?”\u003c/p\u003e\n\u003cp\u003e“Of course I do. This ship over here is mine. You see her? The Free Crow, we call her, and she is a little bit stolen, a little bit bought, and a great bit made… but oh, she can fly.”\u003c/p\u003e\n\u003cp\u003e“She’s a very fine ship,” Briar said, because it seemed appropriate, and because the ship was indeed impressive. There was a mark on its side; she could see the edge of it and almost read it.\u003c/p\u003e\n\u003cp\u003eThe captain saved her the trouble of squinting. “It says CSA because that is where the body of the bird was first created, in the Confederate States. I might have intercepted her, and put her to a better use. In days like these, in this time of war and adventure, I say the initials mean, ‘Come See America,’ for that is what I intend to do.”\u003c/p\u003e\n\u003cp\u003e“This isn’t quite America, yet.”\u003c/p\u003e\n\u003cp\u003e“All of this is America in one way or another. Did you know the entire continent is called after an Italian mapmaker? And anyway, your corner of the map will make a fine state one day. It’ll happen,” he assured her. “With patience, when the war ends.”\u003c/p\u003e\n\u003cp\u003e“When the war ends,” she repeated.\u003c/p\u003e\n\u003cp\u003eHe was looking at her closely now, standing in front of her and peering hard at her hat, then at the badge that she’d stuck on the side of the belt. After a thorough appraisal, he said to her, “I don’t think you represent any rule or government. I never heard tale of a woman of the law, though that looks real.” He pointed at the badge. “And I know who it references. I know what that symbol means.”\u003c/p\u003e\n\u003cp\u003eHe pointed at the buckle with its large, ornate MW.\u003c/p\u003e\n\u003cp\u003e“I don’t know if ol’ Maynard is guarding your knickers or anything else, but you’re wearing the sign, plain as can be, so me and my men are forced to believe you’ve not come for trouble.”\u003c/p\u003e\n\u003cp\u003e“No,” she assured him. “I don’t want to find any trouble, and I don’t want to make any. I’m only trying to find my son, and I don’t have anyone to help me, so I came here.”\u003c/p\u003e\n\u003cp\u003eThe captain unfolded his arms and offered her a handshake. He said, “Then perhaps we can do business. But tell me first, since you haven’t told me yet, where is it you mean to go, that you need services from the island’s back side?”\u003c/p\u003e\n\u003cp\u003e“Seattle,” she said. “I need to go over the wall, into the city. That’s where my son went.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “Then your son is dead, or damned.”\u003c/p\u003e\n\u003cp\u003e“I don’t think he is. He got inside; he just can’t get out.”\u003c/p\u003e\n\u003cp\u003e“Got inside, did he? And how’d he do that? We’ve seen no boy come out this way.”\u003c/p\u003e\n\u003cp\u003e“He went under, through the old sewage runoff.”\u003c/p\u003e\n\u003cp\u003e“Then he can find his way back out the same direction!”\u003c/p\u003e\n\u003cp\u003eBriar was losing his attention. He was backing away. She tried not to sound too frantic when she said, “But he can’t! The earthquake last night—you must’ve felt. it. It collapsed the old tunnel, and there’s no way underneath anymore. I have to get inside and get him out. I have to, don’t you understand?”\u003c/p\u003e\n\u003cp\u003eHe threw his hands up and almost walked back to his fellows, who were whispering between themselves. Then he faced her again and said, “No, I don’t understand. There’s no breathing the air in there, you know that, don’t you? There’s nothing in there but death.”\u003c/p\u003e\n\u003cp\u003e“And people,” she interjected. “There are people in there too, living and working.”\u003c/p\u003e\n\u003cp\u003e“The scrappers and Doornails? Sure, but they’ve been there years, most of them, and they’ve learned how to keep from getting eaten or poisoned. How old’s your son?”\u003c/p\u003e\n\u003cp\u003e“Fifteen. But he’s smart, and stubborn.”\u003c/p\u003e\n\u003cp\u003e“Every mother swears it of every son,” he argued. “But even if you get inside, how you going to get him out? You going to climb? You going to dig?”\u003c/p\u003e\n\u003cp\u003eShe confessed, “I haven’t gotten that far in my planning yet, but I’ll think of something.”\u003c/p\u003e\n\u003cp\u003eThe mulatto man behind the captain put aside his pipe and said, “Next gas run’s going in less than a week. If she can live that long, she can catch a rope out.”\u003c/p\u003e\n\u003cp\u003eThe captain whirled around. “Now don’t you go encouraging her!”\u003c/p\u003e\n\u003cp\u003e“Why not? If she can pay, and if she wants to dip into the city, why won’t you take her?”\u003c/p\u003e\n\u003cp\u003eThe captain answered Briar, although she wasn’t the one who’d asked the question. “Because we aren’t equipped to do a gas run right now. Our two best nets got snagged on the tip of the tower last trip, and we’re still patching them up. And so far, I haven’t heard any mention of paying anything, so I’d hate to assume that our surprise guest is a wealthy widow.”\u003c/p\u003e\n\u003cp\u003e“I’m not,” she admitted. “But I have a little money—”\u003c/p\u003e\n\u003cp\u003e“To talk us into a gas run that doesn’t net us any gas, you’ll need a lot more than a little money. I’d love to help a lady, but business is business.”\u003c/p\u003e\n\u003cp\u003e“But…” she asked, “is there anyone else who might fly?”\u003c/p\u003e\n\u003cp\u003e“Anyone dumb enough to fly up to the walls? I don’t know.” He shoved his hands in the pockets of that Union-blue coat. “I couldn’t say.”\u003c/p\u003e\n\u003cp\u003eAgain the mulatto spoke. He said, “There’s Cly. He’s dumb for a pretty woman, and he respects the Maynard peace.”\u003c/p\u003e\n\u003cp\u003eBriar wasn’t sure whether to be flattered or offended, so she chose instead to be hopeful. “Cly? Who’s he? Can I talk to him?”\u003c/p\u003e\n\u003cp\u003e“You can talk to him.” The captain nodded. “And ma’am, I do wish you well in your search for your mad little son. But I ought to warn you, it’s a devilish place inside. It’s no place for a woman, or a boy.”\u003c/p\u003e\n\u003cp\u003e“Point me at this Cly,” she said coldly. “I don’t care if it’s no place for a dog or a rat, it’s going to have a woman in it before sundown, so help me God. Or Maynard,” she added, remembering what Rector had said.\u003c/p\u003e\n\u003cp\u003e“As you like.” He offered her his arm, and Briar wasn’t sure if she should take it, but she did so anyway. As long as everyone else was playing nice, she’d play nice, too. She didn’t know how much help she needed from these people, so it was worth her time to be pleasant even when it frightened her. \u003c/p\u003e","sourceLink":"https://allnovel.net/boneshaker-the-clockwork-century-1/page-12.html","bookId":2550,"creation":"Oct 6, 2019 12:25:52 AM","modification":"Oct 6, 2019 12:25:52 AM"}
