{"id":111474,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“That makes sense,” she observed.\u003c/p\u003e\n\u003cp\u003e“Yeah, but there are drawbacks to living that far off the beaten path; I mean, if you need anything, it’s a tough hike down here to the core. Hell, you know what I’m talking about. Just now we got a man killed going two short blocks. Try picking your way down eight or nine. But people do it.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “The accommodations are a lot nicer. See what I mean?” He leaned on a latch and opened a metal-banded door with a sealed-up window. “It’s not exactly clean, and not exactly comfortable, but it’s pretty much secure.”\u003c/p\u003e\n\u003cp\u003e“That’s what I thought about Maynard’s.”\u003c/p\u003e\n\u003cp\u003eSwakhammer made a dismissive flap with his hand and said, “Down here we’ve got those guys.” She assumed he meant the Chinamen. “They’ve got the situation under control. If there’s trouble, they know what to do. Anyway, here’s your room, Miss Wilkes.”\u003c/p\u003e\n\u003cp\u003eShe craned her head to look inside and saw exactly what he’d promised: a somewhat clean, somewhat comfortable-looking space with two beds, a table, a washbasin, and three steaming pipes that ran along the far wall.\u003c/p\u003e\n\u003cp\u003e“Look out for those pipes,” he added. “They keep the room warm, but you don’t want to touch them. They’ll burn your skin right off.”\u003c/p\u003e\n\u003cp\u003e“Thanks for the warning.”\u003c/p\u003e\n\u003cp\u003e“Briar, darling,” Lucy said as she maneuvered her way to the front of the line. “I don’t want to impose on your privacy, but I’m in a bit of a pickle here with this busted arm. Usually I don’t need much assistance, but I’d appreciate yours this evening.”\u003c/p\u003e\n\u003cp\u003e“That’s fine. We girls need to stick together, don’t we?” She understood a little too well why a woman might not want a man to be her extra hands, even if those men were the well-meaning sort with only the best of intentions.\u003c/p\u003e\n\u003cp\u003eBriar let Lucy go inside first, and as she settled her bottom on the edge of the bed, Swakhammer had one more set of useful instructions. “There are privies down at the end of the hallways, usually on the left. They don’t lock too good, and they don’t smell too great either, but there you go. Water can be found back towards the Chinamen. They keep it in barrels right outside the furnace-room doors. Anything else you need to know, Lucy can probably fill you in.”\u003c/p\u003e\n\u003cp\u003e“That’s fine,” she told him, and as he trooped away with the rest of the men tagging behind him like ducklings, she closed the door and went to sit on the other bed.\u003c/p\u003e\n\u003cp\u003eLucy had leaned herself over so that her head rested on the flat, musty pillow. “I don’t need so much help, really,” she said. “I just didn’t want to spend the night surrounded by those silly old boys. They want to help, but I don’t think I could stand it.”\u003c/p\u003e\n\u003cp\u003eBriar nodded. She picked at her bootlaces and wiggled her feet out of the shoes, then went to sit beside Lucy to help her do the same.\u003c/p\u003e\n\u003cp\u003e“Thank you dear, but don’t worry about it. I’d rather leave them on for now. It’s easier to let ’em stay than to get ’em back on tomorrow. And tomorrow I’m going to get this old thing tuned up.” She shifted her shoulder in an attempt to lift the arm.\u003c/p\u003e\n\u003cp\u003e“As you like,” Briar said. “Is there anything else I can do for you, then?”\u003c/p\u003e\n\u003cp\u003eLucy sat up and pushed the covers aside with her rear end. “I think I’m fine for now. By the way, I’m real glad about your hand. I’m glad you get to keep it. It’s a sad and aggravating thing to lose one.”\u003c/p\u003e\n\u003cp\u003eBriar said, “I’m glad too. That was awful fast, how Hank turned. What happened to make it go so much quicker?”\u003c/p\u003e\n\u003cp\u003eLucy rolled her head back and forth, settling down onto the pillow. “I couldn’t tell you for sure, but I could give you a guess. All the Blight down here, it gets thicker and thicker each year. You used to be able to see the stars at night—but not anymore, just the moon if it’s good and bright. You can’t see the Blight itself exactly, but you know it’s there, and you know it’s collecting up inside the walls. One of these days,” she said, scooting back in the bed so she could lean against the headboard and prop herself and the pillow up enough to talk, “you know what’s going to happen, don’t you?”\u003c/p\u003e\n\u003cp\u003e“No. What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I mean, these walls are just a bowl—and a bowl can only hold so much. The Blight is coming up from underground, ain’t it? Pouring more and more into this sealed-up shape. The gas is heavy, and for now, it stays down here like soup. But one day it’s going to be too much. One day, it’s going to overflow, right out there to the Outskirts. Maybe it’ll overflow and poison the whole world, if you give it enough time.”\u003c/p\u003e\n\u003cp\u003eBriar retreated to her own bed and unfastened her waist cinch. Her ribs burned without it, suddenly struck by its absence and almost missing the constriction of it. She rubbed at her stomach and said, “That’s a grim way to look at it. How long you think it’ll take before it comes to that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Another hundred years. Another thousand years. There’s no telling. But down here, we’re figuring out how to live with it. It isn’t perfect, but we do all right, don’t we? And one day maybe the rest of the world will need to know how we do it. Even if I’m thinking about it too big—even if it doesn’t come to that—I can promise you this: One day before long the Outskirts are going to be swimming in this mess too. And all those folks outside these walls are going to need to know how to survive.”\u003c/p\u003e\n\u003cp\u003eSeventeen\u003c/p\u003e\n\u003cp\u003eThe Clementine swooped away from the tower with all the grace of a chick learning to fly, and Zeke’s lurching stomach sent a mouthful of vomit up into his cheeks. He swallowed it back down with an eye-watering gulp and clung to the strap that did nothing except give him something from which to dangle.\u003c/p\u003e\n\u003cp\u003eHe stared at the strap, trying to concentrate on anything but the acid against his teeth and the whirlpool in his belly. It was a belt, he thought. Someone had buckled it and slung it over a brace beam to make a holding spot. The buckle was brass with a lead backing, and on the plate’s front it said CSA.\u003c/p\u003e\n\u003cp\u003eAs the ship dipped, bobbed, and fired off at top speed to a place above the Blight-fogged streets, Zeke thought of Rudy and wondered if he’d deserted from the Union army or not. He thought of a war back east and wondered what a Confederate belt was doing serving as a holding strap in a… and again, the word manifested in his brain… in a warship.\u003c/p\u003e\n\u003cp\u003eAnd that gave him something else to consider, apart from the lava-hot taste in his mouth.\u003c/p\u003e\n\u003cp\u003eAbove the console he saw storage panels with hooks that looked like they could hold weapons, and a square drawer that said MUNITIONS on it. Toward the back of the ship, there was a large door with a spinning vault wheel like one you’d see in a bank. Zeke presumed it must be the cargo hold, since a cargo door might have a sturdy lock on it as a matter of general principle, but a wheel like that? And he couldn’t help but notice the way the floors, walls, and seals around that giant door were reinforced.\u003c/p\u003e\n\u003cp\u003e“Oh God,” he whispered to himself. “Oh God.” He curled himself up as tightly as he could, into the smallest ball of Zeke he could fashion, lodged there in the curve of the ship’s wall.\u003c/p\u003e\n\u003cp\u003e“Incoming, starboard!” shouted Mr. Guise.\u003c/p\u003e\n\u003cp\u003e“Evasive maneuvers!” Parks either ordered or declared, though the captain was already on top of it.\u003c/p\u003e\n\u003cp\u003eBrink tugged violently on an overhead apparatus and a set of levers popped down from the ceiling. He tore at one trapezelike apparatus and the airship’s gas tanks hummed so loudly they nearly shrieked.\u003c/p\u003e\n\u003cp\u003e“We’re running too hot!” Parks advised.\u003c/p\u003e\n\u003cp\u003eCaptain Brink said, “Doesn’t matter!”\u003c/p\u003e\n\u003cp\u003eOut of the front windows that wrapped halfway around the oval interior, Zeke saw the horrifying specter of another ship—a smaller ship, but still plenty big—barreling down headlong against the Clementine.\u003c/p\u003e\n\u003cp\u003e“They’ll pull up,” Mr. Guise murmured. “They’ll have to pull up.” Parks yelled, “They aren’t pulling up!”\u003c/p\u003e\n\u003cp\u003e“We’re out of time!” the captain shouted.\u003c/p\u003e\n\u003cp\u003e“What about evasive maneuvers?” Parks asked with a note of mockery.\u003c/p\u003e\n\u003cp\u003e“I can’t get the goddamned thrusters to—” The captain quit explaining himself and slammed his elbow on a switch as big as his fists.\u003c/p\u003e\n\u003cp\u003eThe Clementine bolted upright like a nervous deer, pitching its contents and crew backward, and sideways, and up; but the impact wasn’t altogether averted. The second ship clipped it soundly, and there was a terrible squeal of metal and ripping fabric as the great machines grazed one another in midair. Zeke thought his teeth were going to vibrate out of his gums, but they miraculously stayed in place. And in a few seconds, the ship righted and seemed on the verge of escape.\u003c/p\u003e\n\u003cp\u003e“We’re up!” declared the captain. “Up—do you see them? Where’d they go?”\u003c/p\u003e\n\u003cp\u003eAll eyes were plastered on the windshield, scrying every corner for a sign of their attackers. Parks said, “I don’t see them.”\u003c/p\u003e\n\u003cp\u003eMr. Guise griped, “Well, we couldn’t have just lost them.”\u003c/p\u003e\n\u003cp\u003eParks breathed in slow, steady gulps and said, “It’s a smaller ship they’re chasing us with. Maybe they shouldn’t have hit us. Maybe their boat couldn’t take the damage.”\u003c/p\u003e\n\u003cp\u003eZeke’s ice-white knuckles refused to unlock from the belt, but he craned his head to see out the window, and he held his own breath because no amount of calming talk could keep it steady. He’d never been much of a praying kid, and his mother hadn’t been much of a churchgoing woman, but he prayed hard that wherever that other ship had gone, it wasn’t coming back.\u003c/p\u003e\n\u003cp\u003eBut the sound of Parks saying, “No, no, no, no, no!” did not reassure him.\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“Down!”\u003c/p\u003e\n\u003cp\u003e“Where? I don’t see them!” the captain argued.\u003c/p\u003e\n\u003cp\u003eAnd then another righteous crash rocked the ship and sent it teetering through the air. Zeke’s belt broke and his body dropped to the floor, then rolled to the wall and back down to the middle of the deck again. He scrambled and struggled to crawl forward. Given the inertia of the ship’s sway, the first thing he could snag was the vault-style wheel on the cargo hold door. He tangled himself in it as deeply as he could. \u003c/p\u003e","sourceLink":"https://allnovel.net/boneshaker-the-clockwork-century-1/page-42.html","bookId":2550,"creation":"Oct 6, 2019 12:25:52 AM","modification":"Oct 6, 2019 12:25:52 AM"}
