{"id":63941,"no":17,"title":"Page 17","content":"\u003cp\u003e“Sounds great. Isn’t that enough to settle things for the moment? If we’re done with each other in a week, this seems like an awful lot of unnecessary talk, doesn’t it? And if it lasts for two or three weeks, we’ll take that hurdle when we come to it.”\u003c/p\u003e\n\u003cp\u003eHis face hardened as I spoke. His own questions seemed harsh. “Is that what you think? That we’ll be done with each other in a week? Or two or three?”\u003c/p\u003e\n\u003cp\u003eI shrugged, closing my eyes as though I might drift off at any moment.\u003c/p\u003e\n\u003cp\u003e“I don’t want to think about it. However long it lasts, if you’re just honest with me when you’re done, and don’t just start seeing other people without telling me, that’s enough for me.”\u003c/p\u003e\n\u003cp\u003eHe went back to washing and stroking me, tenderly washing and conditioning my hair, silent for a time.\u003c/p\u003e\n\u003cp\u003e“I would give just about anything to know what’s behind that cool composure of yours. And I would kill to know what you’re thinking,” he whispered against my hair. “I’m so afraid I’ll offend you beyond all repair, and that you’ll never let me know how. You’ll just leave and never speak to me again. Would you do that?”\u003c/p\u003e\n\u003cp\u003eI never opened my eyes, just shrugging again. Though it was uncanny to me how he’d realized that about me with how little he knew me.\u003c/p\u003e\n\u003cp\u003e“It’s possible. It’s hard to say without specifics.”\u003c/p\u003e\n\u003cp\u003eHe cursed softly. “I need to feel more secure about this. You terrify me.”\u003c/p\u003e\n\u003cp\u003eI smiled wryly, eyes still closed.\u003c/p\u003e\n\u003cp\u003e“Wrong word, Mr. Beautiful. The term you’re looking for is more in-control, not more secure. But I like my life. I’m not making a lot of concessions there, so don’t even try. I’m usually in New York one full day a week. You live there, right?”\u003c/p\u003e\n\u003cp\u003e“Primarily, yes.”\u003c/p\u003e\n\u003cp\u003e“Okay, well, I’ll let you know when I’m in New York, and maybe we can meet up somewhere private.”\u003c/p\u003e\n\u003cp\u003eHis arms tightened around me. “This is what I’m talking about. Are you saying this because I’ve somehow offended you? Or are you really so indifferent?”\u003c/p\u003e\n\u003cp\u003eI suddenly wanted, badly, to leave. He wasn’t one to leave a subject alone until he was satisfied, and I was absolutely done talking about anything that involved my indifference or lack thereof. I felt an instant need to get away from him, away from this feeling of intimacy. It was suddenly unbearable to me.\u003c/p\u003e\n\u003cp\u003e“I need to get home. I work early.” I stood. I was relieved when he let me step out of the bath.\u003c/p\u003e\n\u003cp\u003e“Have you eaten dinner?” he asked me, his voice stiff and cool.\u003c/p\u003e\n\u003cp\u003eI thought about it, my mind going blank. When was the last time I’d eaten? I recalled scarfing down a protein bar as I painted, but that had been all since my yogurt on the plane.\u003c/p\u003e\n\u003cp\u003e“Um, I guess not,” I finally answered. “But I can grab something later.”\u003c/p\u003e\n\u003cp\u003eHis nostrils flared, his eyes getting a little wild.\u003c/p\u003e\n\u003cp\u003e“Please, at least stay to eat with me. I’ll feel like a complete bastard if you come here, we do all of that,” he waved a hand at the bedroom, “and you leave as though you can’t even stand to share a meal with me. I have some salmon prepped that only needs fifteen minutes to bake.”\u003c/p\u003e\n\u003cp\u003eI nodded. “Okay,” I agreed readily enough. I didn’t want to storm out like a drama queen. I would prefer to leave with some dignity after a civilized meal.\u003c/p\u003e\n\u003cp\u003eHe wrapped a towel around me, drying himself quickly and wrapping a towel low around his hips in a mouth-watering display. I looked away. He took off for the kitchen like he was afraid I would leave if it took him too long to get the salmon ready. He was uncanny at reading my intentions…\u003c/p\u003e\n\u003cp\u003eI slipped my dress back on, having nothing else. The lack of a bra and panties made it into a somewhat obscene outfit, but I didn’t think it mattered. I would be going from James’s house directly to my garage. I could probably get away with being naked, in a pinch.\u003c/p\u003e\n\u003cp\u003eI towel dried my hair a bit, used the restroom, which I found in it’s own room within the bathroom, and padded barefoot from his room.\u003c/p\u003e\n\u003cp\u003eI searched for and found the kitchen, but I stopped in the daunting dining room and sat there.\u003c/p\u003e\n\u003cp\u003eThe table was set in almost a romantic fashion, so I assumed this was where we were meant to eat. I’d rather wait in a room by myself than tempt James into trying to have another ‘talk’ with me.\u003c/p\u003e\n\u003cp\u003eHe joined me just a moment later, carrying two delicious looking salads. He set them down on the settings, darting back into the kitchen. He came back with two glasses of water with lemon.\u003c/p\u003e\n\u003cp\u003eI thought he might have actually forgotten that he was wearing nothing but a damp towel. It was impossible for me to forget such a thing. Looking that incredible should be illegal. He really was tan everywhere. It was a heady sight.\u003c/p\u003e\n\u003cp\u003eI waited politely for him to sit to my left before eating. It was mixed greens with feta cheese and pecans. I couldn’t put my finger on what the lightly flavored dressing was, but it was quite good.\u003c/p\u003e\n\u003cp\u003e“It’s delicious,” I told him after a few bites.\u003c/p\u003e\n\u003cp\u003eHe smiled at me. It was a careful smile. He was still in his ‘afraid to offend me’ mood.\u003c/p\u003e\n\u003cp\u003e“I actually cooked the whole meal tonight. I don’t get to do it often, but I wanted to for you. I can’t pretend, though, that this is a common occurrence. I have a great housekeeper here who usually does most of the cooking at this house.”\u003c/p\u003e\n\u003cp\u003eI nodded pleasantly, trying not to look uncomfortable with the casual reminder of his wealth.\u003c/p\u003e\n\u003cp\u003e“Do your parents live in Las Vegas, as well?” he asked me after he’d finished his salad.\u003c/p\u003e\n\u003cp\u003eI froze, but recovered quickly. “They’re dead,” I said, my face and voice blank.\u003c/p\u003e\n\u003cp\u003eHe looked startled. “I’m sorry. I didn’t know. What happened?”\u003c/p\u003e\n\u003cp\u003e“Where do your parents live?” I asked him pointedly, rather than answering.\u003c/p\u003e\n\u003cp\u003eHe looked uncomfortable. “They’re dead as well. They died when I was thirteen, in a car crash.”\u003c/p\u003e\n\u003cp\u003eI gave him an apologetic grimace. “Sorry. I don’t like to talk about my parents, but I didn’t mean to be insensitive about yours.”\u003c/p\u003e\n\u003cp\u003eHe reached across the table, putting his hand over mine. “Don’t be sorry. That wasn’t insensitive. You didn’t know, either.”\u003c/p\u003e\n\u003cp\u003eI gave him a wry smile. “I should have looked you up online. I could have saved us at least one awkward moment.”\u003c/p\u003e\n\u003cp\u003eHe gave me a wry smile back. “That wouldn’t help me learn about you, though.”\u003c/p\u003e\n\u003cp\u003eWe went back to eating for a minute, and the silence was awkward.\u003c/p\u003e\n\u003cp\u003e“When is your birthday?” he asked suddenly. I knew what he was doing. He was so afraid to offend me, to scare me off, that he was trying to find neutral things to talk about. He couldn’t have known that my birthday was another touchy subject.\u003c/p\u003e\n\u003cp\u003e“October.” I answered. “How about you?”\u003c/p\u003e\n\u003cp\u003e“June 5th. October what?”\u003c/p\u003e\n\u003cp\u003eI sighed. “24th.” I stifled the urge to say, Why do you care? You won’t even remember my name by then. That would be rude, I told myself. And he seemed to be oddly sensitive.\u003c/p\u003e\n\u003cp\u003eHe nodded, as though making a note of it.\u003c/p\u003e\n\u003cp\u003eYeah, right.\u003c/p\u003e\n\u003cp\u003eThe oven timer went off, and he walked into the kitchen, seemingly oblivious to the fact that that clingy towel looked in danger of falling off with every step.\u003c/p\u003e\n\u003cp\u003eI made myself look away.\u003c/p\u003e\n\u003cp\u003eHe brought in two impressive dishes a moment later. He had already dished the food onto the plates, arranging the meal with a chef’s flourish.\u003c/p\u003e\n\u003cp\u003eIt was an offering of asparagus, freshly baked salmon seasoned to perfection, and some type of grain I’d never seen before.\u003c/p\u003e\n\u003cp\u003eI tasted it, then pointed to it with my fork. “I don’t even know what that is, but it’s delicious. It’s all divine. Is there anything you’re bad at?”\u003c/p\u003e\n\u003cp\u003eHe smiled, the first self-deprecating smile I’d seen on him. It was disarming and all too charming.\u003c/p\u003e\n\u003cp\u003e“Learning about you. Getting you to spend the night with me. And that grain is quinoa.”\u003c/p\u003e\n\u003cp\u003eI just continued to eat, ignoring the first things he mentioned. I still felt that itching under my skin, that strong need to withdraw from the intimacy we’d shared.\u003c/p\u003e\n\u003cp\u003e“Oh, I got you a present,” he told me, smiling at me as we were finishing our meal. “Do you want desert before or after the gift?”\u003c/p\u003e\n\u003cp\u003eI waved him off. “Oh, I couldn’t. I’m so stuffed already.”\u003c/p\u003e\n\u003cp\u003eHe looked genuinely disappointed. “Just a bite? It’s just a light custard with some fresh fruit. We could share.”\u003c/p\u003e\n\u003cp\u003eI smiled, genuinely charmed by his boyish need to impress me with his cooking. “Okay, we can share.”\u003c/p\u003e\n\u003cp\u003eCHAPTER FIFTEEN\u003c/p\u003e\n\u003cp\u003eMr. Insatiable\u003c/p\u003e\n\u003cp\u003eHe was back quickly with the desert. It was served in a heavy glass goblet, and he held the spoon up to my mouth for a bite.\u003c/p\u003e\n\u003cp\u003e“Mmmm,” I said, smiling at him, my mouth still full.\u003c/p\u003e\n\u003cp\u003eUnexpectedly, he bent down and kissed me. It was so different from the tone of the meal we’d just shared that I almost pushed him away, startled. Instead, I made myself hold still, kissing him back tentatively.\u003c/p\u003e\n\u003cp\u003eThis was the part that was easy between us, I thought. None of the rest of it made any sense to me, but this part felt damned near too perfect.\u003c/p\u003e\n\u003cp\u003eHe was lifting me onto a clear spot on the massive black table before I could blink. His towel was gone, my dress pushed up in a flash.\u003c/p\u003e\n\u003cp\u003e“Are you too sore?” His voice was a rough murmur against my lips.\u003c/p\u003e\n\u003cp\u003e“I can’t imagine being too sore for this,” I told him, reaching down his body to grab his thick arousal. I stroked him with relish, and he thrust into my hand. I ran my hands up his torso, then along his muscular arms, then back up to his shoulders.\u003c/p\u003e\n\u003cp\u003e“You’re body is perfect. I can’t believe you really are tan everywhere.”\u003c/p\u003e\n\u003cp\u003eHe smiled, enjoying my appreciation of his body. “My mother was half-Italian and half-Cherokee, though she had no family left to speak of by the time she was eighteen. It was quite the scandal, to my father’s purely English family, when they married. My extended family all have the pasty white English skin you’d expect.”\u003c/p\u003e\n\u003cp\u003eI laughed. “Pasty? What about me? Am I pasty?”\u003c/p\u003e\n\u003cp\u003eHe bent down, nuzzling at my neck. “Your skin is creamy perfection.”\u003c/p\u003e\n\u003cp\u003eI finally got a chance to touch him, stroking his back, his stomach, studying his incredible body with awe while I ran my hands across it.\u003c/p\u003e\n\u003cp\u003eHe snagged one of my busy hands, pulling it up to his lips to kiss my wrist. He studied it intently, and I saw the imprint of rope marks there. The threads were a distinctive pattern, as though he’d marked me, temporarily, with his own special brand.\u003c/p\u003e\n\u003cp\u003e“I love seeing this on you,” he murmured thickly against my skin.\u003c/p\u003e\n\u003cp\u003eHe spread my legs wide, pushing me down flat against the table. He poised that overpowering erection at my entrance.\u003c/p\u003e\n\u003cp\u003eI shuddered as he paused, my eyes closed.\u003c/p\u003e\n\u003cp\u003e“Look at me,” he ordered, his dominant voice surfacing again. It had faded to something softer and more charming since immediately after the first time we’d had sex. I’d missed it. I obeyed him.\u003c/p\u003e\n\u003cp\u003e“Watch me. I’ll punish you every time you look away from me when I’m inside of you.”\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e“Ask me for it,” he ordered, his hand moving to stroke his impressive cock. \u003c/p\u003e","sourceLink":"https://allnovel.net/in-flight-up-in-the-air-1/page-17.html","bookId":1926,"creation":"Oct 5, 2019 9:52:58 AM","modification":"Oct 5, 2019 9:52:58 AM"}
