{"id":11366,"no":32,"title":"CHAPTER XXXII. AN ENVOY","content":"\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;What we love perfectly \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;For its own sake we love,...\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; ... That which is best for it is best for us.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Feel like gettin\u0027 up to breakfast, do you, sir?” said Joseph to his master a few days later. “Well, I am glad. Glad ain\u0027t quite the word, though!”\n\u003c/div\u003e \n\u003cdiv\u003e\n And he proceeded to perform the duties attendant on his master\u0027s wardrobe with a wise, deep-seated shake of the head. While setting the shaving necessaries in order on the dressing-table, he went further—he winked gravely at himself in the looking-glass.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027ve made wonderful progress the last few days, sir,” he remarked. “I always told Missis Marie that it would do you a lot of good to have Mr. Gordon to heart you up with his cheery ways—and Miss Gordon too, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but they would not have been much good without all your care before they came. I had turned the corner a week ago—I felt it myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joseph grinned—an honest, open grin of self-satisfaction. He was not one of those persons who like their praise bestowed with subtlety.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wonderful!” he repeated to himself as he went to the well in the garden for his master\u0027s bath-water. “Wonderful! but I don\u0027t understand things—not bein\u0027 a marryin\u0027 man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n During the last few days Jack\u0027s progress had been rapid enough even to satisfy Joseph. The doctor expressed himself fully reassured, and even spoke of returning no more. But he repeated his wish that Jack should leave for England without delay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is quite strong enough to be moved now,” he finished by saying. “There is no reason for further delay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered Jocelyn, to whom the order was spoken. “No—none. We will see that he goes by the next boat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor paused. He was a young man who took a strong—perhaps too strong—a personal interest in his patients. Jocelyn had walked with him as far as the gate, with only a parasol to protect her from the evening sun. They were old friends. The doctor\u0027s wife was one of Jocelyn\u0027s closest friends on the Coast.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know anything about Meredith\u0027s future movements?” he asked. “Does he intend to come out here again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I could not tell you. I do not think they have settled yet. But I think that when he gets home he will probably stay there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Best thing he can do—best thing he can do. It will never do for him to risk getting another taste of malaria—tell him so, will you? Good-bye.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I will tell him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And Jocelyn Gordon walked slowly back to tell the man she loved that he must go away from her and never come back. The last few days had been days of complete happiness. There is no doubt that women have the power of enjoying the present to a greater degree than men. They can live in the bliss of the present moment with eyes continually averted from the curtain of the near future which falls across that bliss and cuts it off. Men allow the presence of the curtain to mar the present brightness.\n\u003c/div\u003e \n\u003cdiv\u003e\n These days had been happier for Jocelyn than for Jack, because she was conscious of the fulness of every moment, while he was merely rejoicing in comfort after hardship, in pleasant society after loneliness. Even with the knowledge that it could not last, that beyond the near future lay a whole lifetime of complete solitude and that greatest of all miseries, the desire of an obvious impossibility—even with this she was happier than he; because she loved him and she saw him daily getting stronger; because their relative positions brought out the best and the least romantic part of a woman\u0027s love—the subtle maternity of it. There is a fine romance in carrying our lady\u0027s kerchief in an inner pocket, but there is something higher and greater and much more durable in the darning of a sock; for within the handkerchief there is chiefly gratified vanity, while within the sock there is one of those small infantile boots which have but little meaning for us.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jocelyn entered the drawing-room with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is very pleased,” she said. “He does not seem to want to see you any more, and he told me to be inhospitable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As how?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He told me to turn you out. You are to leave by the next steamer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt a sudden unaccountable pang of disappointment at her smiling eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is no joking matter,” he said half seriously. “Am I really as well as that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The worst of it is that you seem rather pleased.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am—at the thought that you are so much better.” She paused and turned quite away, busying herself with a pile of books and magazines. “The other,” she went on too indifferently, “was unfortunately to be foreseen. It is the necessary drawback.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He rose suddenly and walked to the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The grim old necessary drawback,” he said, without looking towards her.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a silence of some duration. Neither of them seemed to be able to find a method of breaking it without awkwardness. It was she who spoke at last.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He also said,” she observed in a practical way, “that you must not come out to Africa again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned as if he had been stung.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he make use of that particular word?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Which particular word?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Must.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jocelyn had not foreseen the possibility that the doctor was merely repeating to her what he had told Jack on a previous visit.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” she answered. “I think he said \u0027better not.\u0027”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you make it into \u0027must.\u0027”\n\u003c/div\u003e \n\u003cdiv\u003e\n She laughed, with a sudden light-heartedness which remained unexplained.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I know you both,” she answered. “For him \u0027better not\u0027 stands for \u0027must.\u0027 With you \u0027better not\u0027 means \u0027doesn\u0027t matter.\u0027”\n\u003c/div\u003e \n\u003cdiv\u003e\n “\u0027Better not\u0027 is so weak that if one pits duty against it it collapses. I cannot leave Oscard in the lurch, especially after his prompt action in coming to my relief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” she replied guardedly. “I like Mr. Oscard\u0027s way of doing things.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The matter of the telegram summoning Oscard had not yet been explained. She did not want to explain it at that moment; indeed, she hoped that the explanation would never be needed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “However,” she added, “you will see when you get home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The least pleasant part of it is,” he said, “your evident desire to see the last of me. Could you not disguise that a little—just for the sake of my feelings?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Book your passage by the next boat and I will promptly descend to the lowest depths of despair,” she replied lightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n He shrugged his shoulders with a short laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is hospitality indeed,” he said, moving towards the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then suddenly he turned and looked at her gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder,” he said slowly, “if you are doing this for a purpose. You said that you met my father—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your father is not the man to ask any one\u0027s assistance in his own domestic affairs, and anything I attempted to do could only be looked upon as the most unwarrantable interference.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Meredith seriously. “I beg your pardon. You are right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He went to his own room and summoned Joseph.\n\u003c/div\u003e \n\u003cdiv\u003e\n “When is the next boat home?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boat on Thursday, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Meredith nodded. After a little pause he pointed to a chair.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just sit down,” he said. “I want to talk over this Simiacine business with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joseph squared his shoulders, and sat down with a face indicative of the gravest attention. Sitting thus he was no longer a servant, but a partner in the Simiacine. He even indulged in a sidelong jerk of the head, as if requesting the attention of some absent friend in a humble sphere of life to this glorious state of affairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know,” said Meredith, “Mr. Durnovo is more or less a blackguard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joseph drew in his feet, having previously hitched his trousers up at the knees.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” he said, glancing up. “A blackguard—a damned blackguard,” he added unofficially under his breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He wants continual watching and a special treatment. He requires someone constantly at his heels.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” admitted Joseph, with some fervour.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now I am ordered home by the doctor,” went on Meredith. “I must go by the next boat, but I don\u0027t like to go and leave Mr. Oscard in the lurch, with no one to fall back upon but Durnovo—you understand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joseph\u0027s face had assumed the habitual look of servitude—he was no longer a partner, but a mere retainer, with a half-comic resignation in his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” scratching the back of his neck. “I am afraid I understand. You want me to go back to that Platter—that God-forsaken Platter, as I may say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Meredith. “That is about it. I would go myself—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “God bless you! I know you would!” burst in Joseph. “You\u0027d go like winkin\u0027. There\u0027s no one knows that better nor me, sir; and what I says is—like master, like man. Game, sir—game it is! I\u0027ll go. I\u0027m not the man to turn my back on a pal—a—a partner, sir, so to speak.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You see,” said Meredith, with the deep insight into men that made command so easy to him—“you see there is no one else. There is not another man in Africa who could do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s true, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I think that Mr. Oscard will be looking for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he won\u0027t need to look long, sir. But I should like to see you safe on board the boat. Then I\u0027m ready to go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Right. We can both leave by Thursday\u0027s boat, and we\u0027ll get the captain to drop you and your men at Lopez. We can get things ready by then, I think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Easy, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The question thus settled, there seemed to be no necessity to prolong the interview. But Joseph did not move. Meredith waited patiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll go up, sir, to the Platter,” said the servant at length, “and I\u0027ll place myself under Mr. Oscard\u0027s orders; but before I go I want to give you notice of resignation. I resigns my partnership in this \u0027ere Simiacine at six months from to-day. It\u0027s a bit too hot, sir, that\u0027s the truth. It\u0027s all very well for gentlemen like yourself and Mr. Oscard, with fortunes and fine houses, and, as sayin\u0027 goes, a wife apiece waiting for you at home—it\u0027s all very well for you to go about in this blamed country, with yer life in yer hand, and not a tight grip at that. But for a poor soldier-man like myself, what has smelt the regulation powder all \u0027is life and hasn\u0027t got nothing to love and no gal waiting for him at home—well, it isn\u0027t good enough. That\u0027s what I say, sir, with respects.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He added the last two words by way of apology for having banged a very solid fist on the table. Meredith smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you\u0027ve had enough of it?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Enough ain\u0027t quite the word, sir. Why, I\u0027m wore to a shadow with the trouble and anxiety of getting you down here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fairly substantial shadow,” commented Meredith.\n\u003c/div\u003e \n\u003cdiv\u003e\n “May be, sir. But I\u0027ve had enough of moneymakin\u0027. It\u0027s too dear at the price. And if you\u0027ll let an old servant speak his mind it ain\u0027t fit for you, this \u0027ere kind of work. It\u0027s good enough for black-scum and for chocolate-birds like Durnovo; but this country\u0027s not built for honest white men—least of all for born and bred gentlemen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—that\u0027s all very well in theory, Joseph, and I\u0027m much obliged to you for thinking of me. But you must remember that we live in an age where money sanctifies everything. Your hands can\u0027t get dirty if there is money inside them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joseph laughed aloud.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, that\u0027s your way of speaking, sir, that\u0027s all. And I\u0027m glad to hear it. You have not spoken like that for two months and more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No—it is only my experience of the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, sir, talkin\u0027 of experience, I\u0027ve had about enough, as I tell you, and I beg to place my resignation in your hands. I shall do the same by Mr. Oscard if I reach that Platter, God willin\u0027, as the sayin\u0027 is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, Joseph.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Still there was something left to say. Joseph paused and scratched the back of his neck pensively with one finger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you be writin\u0027 to Mr. Oscard, sir, for me to take?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I should be obliged if you would mention the fact that I would rather not be left alone with that blackguard Durnovo, either up at the Platter or travelling down. That man\u0027s got on my nerves, sir; and I\u0027m mortal afraid of doing him a injury. He\u0027s got a long neck—you\u0027ve noticed that, perhaps. There was a little Gourkha man up in Cabul taught me a trick—it\u0027s as easy as killing a chicken—but you want a man wi\u0027 a long neck—just such a neck as Durnovo\u0027s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But what harm has the man done you,” asked Meredith, “that you think so affectionately of his neck?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No harm, sir, but we\u0027re just like two cats on a wall, watchin\u0027 each other and hating each other like blue poison. There\u0027s more villainy at that man\u0027s back than you think for—mark my words.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joseph moved towards the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you KNOW anything about him—anything shady?” cried Meredith after him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir. I don\u0027t KNOW anything. But I suspects a whole box full. One of these days I\u0027ll find him out, and if I catch him fair there\u0027ll be a rough and tumble. It\u0027ll be a pretty fight, sir, for them that\u0027s sittin\u0027 in the front row.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joseph rubbed his hands slowly together and departed, leaving his master to begin a long letter to Guy Oscard.\n\u003c/div\u003e \n\u003cdiv\u003e\n And at the other end of the passage, in her room with the door locked, Jocelyn Gordon was sitting, hard-eyed, motionless. She had probably saved the life of Jack Meredith, and in doing so had only succeeded in sending him away from her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2775/76821.html","bookId":1327,"creation":"Aug 2, 2019 3:52:14 AM","modification":"Aug 2, 2019 3:52:14 AM"}
