{"id":68434,"no":10,"title":"Page 10","content":"\u003cp\u003eRachel giggled, and no doubt sounded like a schoolgirl. “Oh, yes, there’s a very special reason. My last appointment canceled and Jolene’s got basketball tryouts after school.”\u003c/p\u003e\n\u003cp\u003eBruce caught on right away. “You mean we would be alone?”\u003c/p\u003e\n\u003cp\u003e“That’s what I figured.” She giggled again.\u003c/p\u003e\n\u003cp\u003e“Give me ten minutes.”\u003c/p\u003e\n\u003cp\u003e“You got it.” Rachel closed the phone and held it against her heart, grinning wildly. She saw Joan watching her, eyebrows raised.\u003c/p\u003e\n\u003cp\u003e“I take it you don’t want me to schedule anything for the rest of the day?”\u003c/p\u003e\n\u003cp\u003e“Please.” Rachel hurried into the back room where she threw on her coat. She was a woman with a mission.\u003c/p\u003e\n\u003cp\u003eShe got home first and tore into the bedroom, where she closed the drapes, then pulled off her clothes and hopped into the shower. Her best friend, Teri Polgar, had bought her a sheer negligee as a wedding gift, which Rachel had yet to wear. She was finally going to initiate it.\u003c/p\u003e\n\u003cp\u003eThe front door opened and Bruce dashed inside. “Rachel?”\u003c/p\u003e\n\u003cp\u003e“In here,” she called back, hoping she sounded sultry and sexy. She climbed onto the bed and lay on her side, facing him, the provocative black negligee revealing far more than it concealed. Her chin was propped on one hand.\u003c/p\u003e\n\u003cp\u003eBruce came into the room and stopped dead in his tracks.\u003c/p\u003e\n\u003cp\u003e“Looking for someone?” Rachel purred.\u003c/p\u003e\n\u003cp\u003eHe swallowed visibly. It was a moment before he was able to move or speak. “I need a shower,” he croaked.\u003c/p\u003e\n\u003cp\u003eRachel rolled onto her back. “Hurry.”\u003c/p\u003e\n\u003cp\u003e“Oh, I’ll try.” He started throwing off his clothes as he trotted toward the bathroom. His shirt fell onto the carpet next to the bed. It was a testament to the quality of the garment that the buttons hadn’t been ripped off in his haste. His shoes were next; one was kicked under the bed and the other bounced against the wall and into the bathroom.\u003c/p\u003e\n\u003cp\u003e“We have all afternoon, you realize,” she said. “Shall I pour us a glass of champagne?”\u003c/p\u003e\n\u003cp\u003eThe shower door opened. “Champagne?”\u003c/p\u003e\n\u003cp\u003e“Another gift from Teri and Bobby.”\u003c/p\u003e\n\u003cp\u003e“Sure…” His gaze was riveted on her. “You are so beautiful.”\u003c/p\u003e\n\u003cp\u003e“That’s how you make me feel,” she whispered.\u003c/p\u003e\n\u003cp\u003eWhile Bruce showered, Rachel went into the kitchen. Although it was an odd contrast with the negligee, she wore her old terry-cloth robe, not wanting to risk being seen through the windows. She opened the refrigerator and sorted through the milk and yogurt and eggs to the farthest reaches of the bottom shelf, where she’d stored the champagne. Moët et Chandon, something she’d never expected to taste.\u003c/p\u003e\n\u003cp\u003eBy the time she heard Bruce, the flutes were out and ready. She’d lit several scented candles, too. The mood was set except for the music. She found an appropriate CD and put it on.\u003c/p\u003e\n\u003cp\u003eA minute or two later, Bruce met her in the kitchen. He was barefoot and naked with a towel around his waist. His dark hair fell in wet tendrils, dripping moisture onto his neck and shoulders. As far as Rachel was concerned, he’d never looked sexier.\u003c/p\u003e\n\u003cp\u003eRachel turned to greet him with a shy smile. She held the champagne bottle in her hand and removed the wire top. “Someone once told me that the correct way to open champagne is to twist the bottle and not the cork. When properly opened, it should sound like a contented woman.”\u003c/p\u003e\n\u003cp\u003eBruce pretended to leer. “I’m more than eager to hear the sound of a contented woman.”\u003c/p\u003e\n\u003cp\u003e“The champagne or me?” she asked.\u003c/p\u003e\n\u003cp\u003eHe grinned. “Both.”\u003c/p\u003e\n\u003cp\u003eRachel attempted to follow the opening directions for champagne, and the cork popped much more loudly than she’d expected.\u003c/p\u003e\n\u003cp\u003e“You can be as noisy as you want, too,” her husband joked, taking the bottle out of her hands. He filled both flutes and gave her one. Clutching his own, he leaned forward and pressed his mouth to hers. Their lips clung as the kiss deepened. Although only their mouths touched, an overwhelming physical response rippled through her.\u003c/p\u003e\n\u003cp\u003eBruce groaned and put down his champagne. “Maybe we could drink this later?” he asked, hardly sounding like himself.\u003c/p\u003e\n\u003cp\u003e“What do you have in mind?” she asked as he took the flute from her and set it on the kitchen counter.\u003c/p\u003e\n\u003cp\u003e“Don’t you think it’s a bit warm in here?”\u003c/p\u003e\n\u003cp\u003e“Hmm. I know what you mean.”\u003c/p\u003e\n\u003cp\u003e“You have too many clothes on.”\u003c/p\u003e\n\u003cp\u003eRachel smiled. “You could be right.” She glanced out the kitchen window, saw no one, then peeled off her robe.\u003c/p\u003e\n\u003cp\u003eBruce led her down the narrow hallway to the master bedroom, then lifted her into his arms.\u003c/p\u003e\n\u003cp\u003e“Bruce, I’m too heavy,” she protested but not too strenuously.\u003c/p\u003e\n\u003cp\u003e“Well…it’s not far from here to the bed.” He shoved the door with his foot, closing it partway.\u003c/p\u003e\n\u003cp\u003eLooping her arms around his neck, Rachel nibbled at his earlobe and felt his body shiver with excitement. She was excited, too. The freedom to make love without fear of waking or disturbing Jolene was heaven.\u003c/p\u003e\n\u003cp\u003eBruce reverently placed her on the bed, his eyes glowing with love and wonder. “These past few weeks…”\u003c/p\u003e\n\u003cp\u003e“I know, I know.” Reaching for her husband, she urged him down so that he was sprawled across her. They kissed until Rachel was breathless with desire. “Oh, Bruce,” she sighed. “I want you so much.”\u003c/p\u003e\n\u003cp\u003eNo sooner had the words left her lips than the front door opened and closed.\u003c/p\u003e\n\u003cp\u003eBruce froze.\u003c/p\u003e\n\u003cp\u003eRachel did, too.\u003c/p\u003e\n\u003cp\u003e“What’s Jolene doing home?” Bruce whispered fiercely.\u003c/p\u003e\n\u003cp\u003e“She’s supposed to be at basketball tryouts!”\u003c/p\u003e\n\u003cp\u003e“Rachel?” Jolene called out. “Are you home? Dad?”\u003c/p\u003e\n\u003cp\u003e“I’ll be out in a minute,” Rachel called back as Bruce scrambled off her. He’d just managed to grab the towel and cover himself when his daughter appeared in the doorway.\u003c/p\u003e\n\u003cp\u003eA look of sheer horror came over her. She scrunched up her face and cried, “Gross!”\u003c/p\u003e\n\u003cp\u003e“Jolene.” Rachel hurriedly hid her negligee with a pillow. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I live here, remember?” She knotted both hands into fists at her sides.\u003c/p\u003e\n\u003cp\u003eRachel could feel her cheeks burning with embarrassment.\u003c/p\u003e\n\u003cp\u003e“If you’d kindly give us a few minutes of privacy,” Bruce said from between clenched teeth. Keeping his hand clamped on the towel around his waist, he walked to the bedroom door and closed it completely.\u003c/p\u003e\n\u003cp\u003e“I knew this would happen,” Jolene cried from the other side. “It’s like I don’t even live here anymore. All you think about is…that.”\u003c/p\u003e\n\u003cp\u003eApparently that was a synonym for sex.\u003c/p\u003e\n\u003cp\u003eThe girl marched down the hallway to her room and slammed the door. The sound reverberated through the house.\u003c/p\u003e\n\u003cp\u003e“Jolene, that’s not true.” The kid had no idea of the restraint she and Bruce had employed since they’d been married.\u003c/p\u003e\n\u003cp\u003e“Leave her be,” Bruce said with a disgusted sigh. “This is getting ridiculous.”\u003c/p\u003e\n\u003cp\u003e“I know.” Rachel was disappointed, too. She stepped up behind him and slipped her arms around his waist. “She needs time to adjust.”\u003c/p\u003e\n\u003cp\u003e“She’s had time.”\u003c/p\u003e\n\u003cp\u003e“It’s been less than a month.”\u003c/p\u003e\n\u003cp\u003e“I thought she wanted us to marry,” Bruce argued.\u003c/p\u003e\n\u003cp\u003e“She did. Only she’s afraid of what it’s going to do to her relationship with you.”\u003c/p\u003e\n\u003cp\u003e“Nothing’s changed,” Bruce muttered. He broke away long enough to jerk on his pants.\u003c/p\u003e\n\u003cp\u003e“But, Bruce, it has. Don’t you see?”\u003c/p\u003e\n\u003cp\u003e“Frankly, no.” Every movement conveyed his frustration and anger. “We’re married, and I want to make love to my wife. It isn’t right for us to be sneaking around because we’re afraid Jolene might know what we’re doing. She should know. That’s what married couples do.”\u003c/p\u003e\n\u003cp\u003e“Listen, Bruce, I’m as frustrated as you are, but we need to be sensitive to Jolene’s feelings. We should never have rushed into this.”\u003c/p\u003e\n\u003cp\u003eBruce whirled around, his face contorted. “So now you regret marrying me?”\u003c/p\u003e\n\u003cp\u003e“No!” she insisted. “I love you and Jolene more than I could ever express. What I wish is that we’d given Jolene time to get used to the fact that I was going to be moving into the house.” Rachel didn’t want her husband to think for even an instant that she didn’t want to be married. “For seven years it was just the two of you and I was conveniently tucked away for whenever Jolene wanted to visit or chat. Now I’m here 24/7, and she feels threatened.”\u003c/p\u003e\n\u003cp\u003eBruce sat on the edge of the bed and rubbed his face. “This is torture.”\u003c/p\u003e\n\u003cp\u003eRachel sat next to him and leaned her shoulder against his. “It is for me, too. But remember, there’s always tonight.”\u003c/p\u003e\n\u003cp\u003e“What I want,” Bruce said, “is to be able to make love and not worry about the bed creaking.”\u003c/p\u003e\n\u003cp\u003eIt wasn’t funny but Rachel couldn’t help laughing. “We’ll find a way.”\u003c/p\u003e\n\u003cp\u003e“I just hope it’s soon.” Bruce left the bedroom, and a few minutes later Rachel heard the front door close. He must have gone back to the shop.\u003c/p\u003e\n\u003cp\u003eWondering how best to approach her stepdaughter, Rachel changed out of the negligee and into her clothes. She gently tapped on Jolene’s bedroom door.\u003c/p\u003e\n\u003cp\u003e“Jolene?”\u003c/p\u003e\n\u003cp\u003eNo response.\u003c/p\u003e\n\u003cp\u003e“Let’s talk about this.”\u003c/p\u003e\n\u003cp\u003e“Go away.”\u003c/p\u003e\n\u003cp\u003e“I thought you had basketball tryouts after school,” she said.\u003c/p\u003e\n\u003cp\u003e“That’s on Monday.”\u003c/p\u003e\n\u003cp\u003e“The notice said it was today.”\u003c/p\u003e\n\u003cp\u003e“Well, it isn’t. Tryouts got canceled because the coach is sick.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Go away.”\u003c/p\u003e\n\u003cp\u003e“Not until we talk.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to talk.”\u003c/p\u003e\n\u003cp\u003eRachel stood by her stepdaughter’s bedroom door for a long time and tried to cajole Jolene into coming out so they could discuss this.\u003c/p\u003e\n\u003cp\u003eAfter a while Jolene stopped answering her.\u003c/p\u003e\n\u003cp\u003eRachel turned the handle, figuring that if Jolene wouldn’t come to her, she’d go to Jolene.\u003c/p\u003e\n\u003cp\u003eOnly the bedroom door was locked.\u003c/p\u003e\n\u003cp\u003eEight\u003c/p\u003e\n\u003cp\u003eTroy was still in the parking lot outside city hall when Mayor Benson came charging toward him. He’d just returned from a speaking engagement at the local Rotary, but other than that, it hadn’t been a good day. Two of his deputies had phoned in sick. The flu bug had hit his department hard, and he was stretched to the limit. His conversation with the Seattle reporter, Kathleen Sadler, hadn’t improved his mood, either. The woman was demanding responses to questions he simply couldn’t answer. Judging by the angry look on the mayor’s face, Troy’s day was about to get even worse.\u003c/p\u003e\n\u003cp\u003e“What can I do for you, Louie?” Troy said.\u003c/p\u003e\n\u003cp\u003e“I just got off the phone with Kathleen Sadler.”\u003c/p\u003e\n\u003cp\u003eTroy wanted to close his eyes and groan. When he hadn’t supplied the information she was after, the reporter had obviously called Louie. No wonder the mayor was in such a state.\u003c/p\u003e\n\u003cp\u003e“Kathleen Sadler,” Mayor Benson repeated. “I thought you were going to take care of it. I already told you how important it is that we keep this story out of the public eye.”\u003c/p\u003e\n\u003cp\u003e“I did speak to her,” Troy said. “She refused to accept what I told her. She kept saying there has to be more to the story.” \u003c/p\u003e","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-10.html","bookId":1951,"creation":"Oct 5, 2019 10:09:11 AM","modification":"Oct 5, 2019 10:09:11 AM"}
