{"id":68444,"no":20,"title":"Page 20","content":"\u003cp\u003eRachel was willing to be patient and understanding, but she couldn’t allow a thirteen-year-old to dictate the terms of her marriage.\u003c/p\u003e\n\u003cp\u003e“I love your father, Jolene,” she said, looking directly into the girl’s eyes, “and if I want to talk to him alone for a few minutes that shouldn’t upset you.”\u003c/p\u003e\n\u003cp\u003eJolene nodded contritely. “I know.”\u003c/p\u003e\n\u003cp\u003e“Okay, then.”\u003c/p\u003e\n\u003cp\u003eThe evening passed, with everyone involved in various tasks—laundry, homework, bill paying—and other than Bruce making exaggerated yawning noises and darting glances at the master bedroom, everything went smoothly.\u003c/p\u003e\n\u003cp\u003e“Isn’t it your bedtime?” he asked Jolene when the clock chimed nine-thirty. He and Rachel were watching TV by then.\u003c/p\u003e\n\u003cp\u003eShe closed her textbook and kissed them both on the cheek. “Night.”\u003c/p\u003e\n\u003cp\u003e“I’m going to watch the news,” Rachel announced. She wanted Jolene to understand that they weren’t going to jump into bed the minute she was out of sight.\u003c/p\u003e\n\u003cp\u003e“I guess I will, too,” Bruce muttered.\u003c/p\u003e\n\u003cp\u003eJolene walked past Rachel and rolled her eyes. The kid wasn’t fooled.\u003c/p\u003e\n\u003cp\u003eWhen their daughter’s bedroom door shut, Bruce shifted closer to Rachel. “Okay, talk to me.”\u003c/p\u003e\n\u003cp\u003eRachel had been waiting for this moment all evening. “Jolene and I had a good discussion today while I cut her hair. She talked about you and me and her place in this family.” Rachel wouldn’t tell him everything Jolene had shared.\u003c/p\u003e\n\u003cp\u003e“You’re my wife!”\u003c/p\u003e\n\u003cp\u003e“Yes, but—”\u003c/p\u003e\n\u003cp\u003eBruce grimaced, unwilling to listen. “You know, I’m getting sick of this. I’ve done my best to be sensitive to Jolene’s feelings. I’ve spent more time with her in the past two months than at any—”\u003c/p\u003e\n\u003cp\u003e“Yes, it’s just that—”\u003c/p\u003e\n\u003cp\u003e“The frustration is killing me, Rachel. I want to make love to my wife. I’m sick and tired of tiptoeing around my daughter and her insecurities. The longer we kowtow to her, the more complicated and difficult this becomes.”\u003c/p\u003e\n\u003cp\u003e“But, Bruce—”\u003c/p\u003e\n\u003cp\u003eAgain he cut her off. “What we need is time away, just the two of us.”\u003c/p\u003e\n\u003cp\u003e“No,” she countered swiftly. She couldn’t disagree more. “That’ll make every insecurity Jolene already has that much worse. She’s feeling excluded as it is. Sharing me, sharing you…If we abandon her for even a weekend, it’ll feel like a betrayal.”\u003c/p\u003e\n\u003cp\u003eBruce stared at her for several seconds before throwing his head back, eyes closed. “I don’t believe this.”\u003c/p\u003e\n\u003cp\u003e“We haven’t been married very long. Give Jolene a chance. The two of us made progress today.”\u003c/p\u003e\n\u003cp\u003eBruce exhaled and finally nodded.\u003c/p\u003e\n\u003cp\u003eThe ten o’clock news came on, and they cuddled together on the sofa. They held hands, and every now and then he’d lean forward to kiss the side of her face. Rachel’s eyes drifted shut as a river of awareness flowed through her.\u003c/p\u003e\n\u003cp\u003e“Do you think she’s asleep yet?” Bruce whispered after the last news segment.\u003c/p\u003e\n\u003cp\u003e“I certainly hope so.”\u003c/p\u003e\n\u003cp\u003e“Not as much as I do…”\u003c/p\u003e\n\u003cp\u003eTurning out the lights as they went, Bruce led Rachel down the hallway to their bedroom. He didn’t bother with the light. Rachel heard him slip out of his clothes. She did, as well.\u003c/p\u003e\n\u003cp\u003eThey got into bed, and Bruce reached for her. Rachel moved into his arms. They kissed passionately, caressing each other, until she was weak with longing.\u003c/p\u003e\n\u003cp\u003e“So far, so good,” Bruce whispered.\u003c/p\u003e\n\u003cp\u003e“So far very good,” she whispered back and the kissing continued.\u003c/p\u003e\n\u003cp\u003eThe bed creaked, and it seemed to reverberate through the room. They both froze.\u003c/p\u003e\n\u003cp\u003eThere was a long hesitation, in which they held themselves suspended, afraid to move or even breathe.\u003c/p\u003e\n\u003cp\u003eThen they heard Jolene’s bedroom door open.\u003c/p\u003e\n\u003cp\u003eThe sound of the door was followed by the patter of feet going down the hallway to the bathroom.\u003c/p\u003e\n\u003cp\u003e“What if she comes in here?” Rachel whispered.\u003c/p\u003e\n\u003cp\u003e“She wouldn’t dare,” Bruce muttered fiercely.\u003c/p\u003e\n\u003cp\u003eRachel ran her hands tenderly down her husband’s back. “Do we risk it? Remember what happened last time.”\u003c/p\u003e\n\u003cp\u003eGroaning, Bruce rolled away from her. Without a word, he marched into the master bathroom and a moment later she heard the shower.\u003c/p\u003e\n\u003cp\u003eRachel didn’t need him to tell her he’d turned on the cold water.\u003c/p\u003e\n\u003cp\u003eFifteen\u003c/p\u003e\n\u003cp\u003e“Dad, you’ve got to do something,” Megan wailed.\u003c/p\u003e\n\u003cp\u003eTroy Davis had just walked into his house when the kitchen phone rang. He picked up, not surprised to hear his daughter’s voice; she’d left a message at the office but he’d forgotten to call her back. Troy’s day had been interesting and he was eager for an opportunity to analyze what he’d learned that afternoon. The coroner’s office had finally sent him the complete report on the remains discovered in the cave, and the information had given him pause, to say the least. He needed an opportunity to digest what had been revealed and decide how to proceed. His one hope was that media interest had died down sufficiently to let this latest development pass without attention.\u003c/p\u003e\n\u003cp\u003e“Dad, are you listening to me?” Megan asked impatiently.\u003c/p\u003e\n\u003cp\u003e“What is it you want me to do something about?” Troy asked, just so she’d know he’d heard her the first time.\u003c/p\u003e\n\u003cp\u003e“You didn’t return my call,” she said.\u003c/p\u003e\n\u003cp\u003e“I was in a meeting.”\u003c/p\u003e\n\u003cp\u003e“I know, that’s what Cody said, but I asked him to explain that this was important.”\u003c/p\u003e\n\u003cp\u003eTroy’s assistant had mentioned the phone call and that Megan had sounded upset. “I’m sorry, sweetheart, I had every intention of phoning you back, but time got away from me.” He didn’t want Megan to feel he didn’t consider her calls important; however, since she’d gotten pregnant, his daughter seemed to be in a perpetual state of crisis. “Tell me what’s wrong,” he said, setting the mail on the kitchen counter. The microwave clock told him it was ten to seven, which explained why his stomach was growling. He hadn’t even had a chance to remove his coat. A light rain had begun and tapped against the kitchen window.\u003c/p\u003e\n\u003cp\u003e“It’s about Faith,” Megan began.\u003c/p\u003e\n\u003cp\u003eTroy stiffened. “What’s happened now? Has there been another disturbance?” He’d been worried about the prowler and wondered if she’d taken his advice and installed an alarm. He hoped she’d asked Grace and Cliff about a motion sensor light, too. He’d recently checked with his deputies about the neighborhood; according to Deputy Weaver, things had been quiet on Rosewood Lane. If anyone was pestering Faith, she hadn’t reported it, nor had she contacted Troy.\u003c/p\u003e\n\u003cp\u003e“Nothing’s happened at the house that I know of—not that Faith’s said, anyway.”\u003c/p\u003e\n\u003cp\u003e“Then what’s the problem?”\u003c/p\u003e\n\u003cp\u003eMegan sighed and he was afraid she might break into tears, an occurrence that had become commonplace in the past few months. It’d been the same with Sandy, Troy recalled. His wife’s emotions had been volatile during her pregnancy.\u003c/p\u003e\n\u003cp\u003e“Faith’s moving,” Megan said, her voice low.\u003c/p\u003e\n\u003cp\u003eFrankly, Troy didn’t blame her. In fact, he approved.\u003c/p\u003e\n\u003cp\u003e“Well?” Megan demanded.\u003c/p\u003e\n\u003cp\u003e“Well, what? Actually, I think it’s a good idea.”\u003c/p\u003e\n\u003cp\u003e“You can’t mean that,” Megan said with a gasp. “What’s the matter with you? You can’t let Faith move away! You just can’t.”\u003c/p\u003e\n\u003cp\u003eClearly Troy was missing something. “Okay, let’s go over this again. Start from the beginning.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Megan said impatiently. “I met her for lunch. We do that every so often, you know.”\u003c/p\u003e\n\u003cp\u003eTroy did, and was grateful for any information his daughter could provide regarding Faith.\u003c/p\u003e\n\u003cp\u003e“She’s helping me with the blanket I’m knitting for the baby. I’m practically finished and it’s really nice.”\u003c/p\u003e\n\u003cp\u003eTroy smiled, excited all over again at the prospect of becoming a grandfather. He knew one thing for sure—his grandchild was going to be a very spoiled baby.\u003c/p\u003e\n\u003cp\u003e“She almost didn’t tell me. In fact, I had the distinct feeling Faith wasn’t going to mention it.”\u003c/p\u003e\n\u003cp\u003e“She realized you’d eventually pass it on to me.”\u003c/p\u003e\n\u003cp\u003e“Probably,” Megan agreed. “At any rate, just as we were leaving and Faith was putting on her coat, she said she’d decided to move. She said that coming back to Cedar Cove had been a mistake. Her home in Seattle sold so quickly, she hadn’t thought everything through. Now she thinks it might be better if she left the area entirely.”\u003c/p\u003e\n\u003cp\u003eShock rippled through Troy.\u003c/p\u003e\n\u003cp\u003e“Aren’t you going to say anything?” Megan asked.\u003c/p\u003e\n\u003cp\u003eTroy couldn’t speak for a moment. Faith wasn’t moving from one house to another; she’d be moving to another town. Troy knew why. She wanted to get away from him.\u003c/p\u003e\n\u003cp\u003e“I…see,” he finally managed.\u003c/p\u003e\n\u003cp\u003e“You aren’t going to let her leave, are you?” Megan asked, sounding like a little girl who wasn’t happy with the answer she’d been given.\u003c/p\u003e\n\u003cp\u003e“There’s nothing I can do to stop her.”\u003c/p\u003e\n\u003cp\u003e“Dad!”\u003c/p\u003e\n\u003cp\u003eThe shock was still fresh and he hadn’t absorbed this new information. So Faith was leaving town. He wanted to protest, demand she reconsider, but he had no right to ask. All he could do was stand back and keep his opinions to himself.\u003c/p\u003e\n\u003cp\u003e“I’m not seeing Faith anymore,” he reminded Megan.\u003c/p\u003e\n\u003cp\u003e“But you love her.”\u003c/p\u003e\n\u003cp\u003eTroy didn’t deny it. He did love Faith. Her plan to leave Cedar Cove cut him to the quick, but he couldn’t think of a single thing he could do to change her mind.\u003c/p\u003e\n\u003cp\u003e“How do Scott and his family feel about this?” Troy asked. One reason Faith had moved to town was to be closer to her son and grandchildren.\u003c/p\u003e\n\u003cp\u003e“I asked her that,” Megan told him. “And she pointed out that her daughter, Jay Lynn, lives in north Seattle. Jay Lynn said that after all the problems Faith’s had in Cedar Cove, she should consider leaving.”\u003c/p\u003e\n\u003cp\u003eHe doubted Jay Lynn was referring only to the prowler. He felt she was insinuating that the disappointment he’d brought into Faith’s life was a problem, too—a good reason to leave. Troy couldn’t blame her family. They were concerned about their mother’s physical and emotional welfare.\u003c/p\u003e\n\u003cp\u003e“Daddy, you have to do something,” Megan said again.\u003c/p\u003e\n\u003cp\u003eTroy leaned against the kitchen counter. “I’ll do whatever I can.” Although he had no idea what that would be…\u003c/p\u003e\n\u003cp\u003e“I like Faith so much.”\u003c/p\u003e\n\u003cp\u003e“I know.” He liked Faith, too—more than liked her—and he wished he could persuade her to stay in Cedar Cove.\u003c/p\u003e\n\u003cp\u003e“Thank you, Daddy. You’ll find a way. I’m sure you will.”\u003c/p\u003e\n\u003cp\u003eA couple of minutes later, the conversation ended with Megan inviting him to dinner the following weekend, and Troy replaced the receiver.\u003c/p\u003e\n\u003cp\u003eThe day just seemed to get more complicated. Needing a distraction, he walked into the living room and switched on the evening news, wondering if the Seattle TV stations had gotten wind of the coroner’s report. Thankfully there was nothing.\u003c/p\u003e\n\u003cp\u003eAfter half an hour or so, he decided it was time to eat. Searching through the cupboards, he found a can of chili. Opening it, he dumped the contents into a bowl, which he set in the microwave. While his meal warmed, he sorted through the mail, his thoughts still on Faith. \u003c/p\u003e","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-20.html","bookId":1951,"creation":"Oct 5, 2019 10:09:11 AM","modification":"Oct 5, 2019 10:09:11 AM"}
