{"id":68450,"no":26,"title":"Page 26","content":"\u003cp\u003eFor a while, Christie believed she’d found that same kind of happiness with James Wilbur, but as was so often the case, she’d been wrong. He was like every other man she’d ever cared about—only it’d taken him a bit longer to reveal his true nature.\u003c/p\u003e\n\u003cp\u003eAs if her sister had been reading her thoughts, Teri glanced speculatively at Christie. “James—”\u003c/p\u003e\n\u003cp\u003e“Don’t even start,” Christie warned. Teri seemed convinced that Christie could be as fortunate, as contented, as she was; Christie knew better. She poured the herbal tea, and handed Teri a cup.\u003c/p\u003e\n\u003cp\u003eHer sister gratefully accepted it. “You can’t ignore James forever.”\u003c/p\u003e\n\u003cp\u003e“Who says I can’t?” She crossed one leg over the other and swung her foot to hide her nervousness.\u003c/p\u003e\n\u003cp\u003eTeri’s eyes grew sad. “You love him and you know it. I had no idea you could be so stubborn.”\u003c/p\u003e\n\u003cp\u003e“Sure you did,” Christie returned, remembering their youth. Her sister was more familiar with her character flaws than anyone. “You want to defend James and that’s your choice, but I’ve made my decision.”\u003c/p\u003e\n\u003cp\u003e“James loves you!”\u003c/p\u003e\n\u003cp\u003e“Sure he does. That’s why he walked out on me.”\u003c/p\u003e\n\u003cp\u003e“He panicked,” Teri said, defending him. “It had nothing to do with you.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” That just proved her point; when he was in trouble, when he’d needed help, it hadn’t occurred to him to confide in her—the woman he supposedly loved.\u003c/p\u003e\n\u003cp\u003eBut Christie didn’t want to argue with her sister. They’d done enough of that through the years. “Would you mind if we didn’t discuss James?” she asked instead.\u003c/p\u003e\n\u003cp\u003eOne look told her how disappointed Teri was.\u003c/p\u003e\n\u003cp\u003e“Let me tell you about my classes,” Christie said. To her own surprise she liked her courses. The photography was an interesting challenge, and she’d mastered the basics. She’d been working with a camera provided by the school but planned to buy her own. She’d met Jon Bowman, Grace Sherman’s son-in-law, once or twice; maybe he’d be willing to recommend a digital camera. And since she was starting her own business, she knew she needed some accounting skills. To her delight, she’d discovered that she thoroughly enjoyed the classes and had no problem with the homework.\u003c/p\u003e\n\u003cp\u003eEven as a kid Christie had always had a head for math. She never had difficulty remembering phone numbers after hearing them only once or twice. Her skill with figures was one of the reasons she’d made cashier at Wal-Mart. Balancing her bank account had never been a problem, either—especially since her balance generally hovered around zero.\u003c/p\u003e\n\u003cp\u003e“You sent back his Valentine gift.” She paused. “The flowers were gorgeous—I know because he ended up giving them to me.”\u003c/p\u003e\n\u003cp\u003eChristie forcefully expelled her breath. “Are you back to James again?”\u003c/p\u003e\n\u003cp\u003eTeri’s gaze pleaded with hers. “Explain it to me.”\u003c/p\u003e\n\u003cp\u003e“Explain what?”\u003c/p\u003e\n\u003cp\u003e“Why you’re so unforgiving. Why can’t you accept the fact that once the news story broke, James felt he had no option but to run. Surely you can put yourself in his position.”\u003c/p\u003e\n\u003cp\u003e“No,” she snapped. “I can’t.”\u003c/p\u003e\n\u003cp\u003e“I don’t believe that,” Teri said. “Poor James, he—”\u003c/p\u003e\n\u003cp\u003e“He walked out on you and Bobby, and he walked out on me, just like every other man I’ve ever loved.”\u003c/p\u003e\n\u003cp\u003e“Christie, you’ve got to know James isn’t like anyone else. He’s James. His childhood was hell. His parents drove him to mental collapse, to the point that he ended up in a psych ward. Once it was obvious that he couldn’t play chess anymore, they turned their backs on him—their own son! If it wasn’t for Bobby, I don’t know what would’ve happened to him.”\u003c/p\u003e\n\u003cp\u003e“He doesn’t seem all that grateful to Bobby—or at least that’s how it looks from where I’m sitting,” Christie said. “When Bobby needed him, James left.”\u003c/p\u003e\n\u003cp\u003e“You mean when you needed him, James left.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she flared. “I thought James was different. I thought I could trust him. What an idiot I was.”\u003c/p\u003e\n\u003cp\u003e“He came back because of you,” Teri said quietly.\u003c/p\u003e\n\u003cp\u003e“Too bad. I’m not interested.”\u003c/p\u003e\n\u003cp\u003eTeri pretended not to hear. “James realized it didn’t matter what kind of ugly sensationalism that reporter put out there. He decided to stop hiding.”\u003c/p\u003e\n\u003cp\u003eShe paused as though she expected Christie to appreciate how hard it’d been for James to confront his past. Okay, Christie could understand his fears; still, that didn’t justify the way he’d abandoned her.\u003c/p\u003e\n\u003cp\u003e“Can’t you imagine what it must have been like for him?” Teri asked rhetorically. “He’s stayed in the shadows all these years and then to be thrust into the limelight without his knowledge or consent. It was his worst nightmare. Instinct took over, and he ran. Who’s to say what either of us would’ve done in the same situation? But once his head cleared, he came back, and the first person he asked to see was you.”\u003c/p\u003e\n\u003cp\u003eChristie’s resolve remained unchanged. “I learned something important about myself through all of this,” she said. “I don’t need a man.” It’d been a liberating insight. After each breakup, she’d instantly gone in search of a new relationship, afraid to be alone. Afraid that on her own she hadn’t been enough. All those associations had been with a certain type—drunks, drug addicts, assorted losers. Men she felt she could rescue with sufficient love, sympathy and understanding. Not to mention money…\u003c/p\u003e\n\u003cp\u003eIn the dark, lonely hours after James’s defection, Christie had arrived at some conclusions. First, she was good enough—and no man would ever make her feel whole or complete. That had to come from within herself. Second, she had an excessive need to be needed. She recognized that about herself now and wasn’t about to fall back into the same patterns.\u003c/p\u003e\n\u003cp\u003eWhile she enjoyed her job, she wanted more. With her photography and business classes, Christie was going to establish a career. Initially, she’d take photographic assignments on her off-hours, while she still had the protection of a steady paycheck. No matter how long it took, she wasn’t about to let a man, any man, ruin her chances or stand in her way.\u003c/p\u003e\n\u003cp\u003e“I know you’re feeling hurt,” Teri said, “but I wish you’d give James another chance.”\u003c/p\u003e\n\u003cp\u003eUnwilling to bend, Christie shook her head.\u003c/p\u003e\n\u003cp\u003eOnce she succeeded in steering the conversation away from James, she enjoyed the visit with her sister. Although Teri was positive and uncomplaining—other than in humorous asides—Christie knew this pregnancy had taken a toll on her. Teri was an active, social person, and she found being confined to the house extremely difficult.\u003c/p\u003e\n\u003cp\u003eEven though Christie preferred to avoid any possible contact with James, Teri needed her. She promised she’d stop by again in a day or two.\u003c/p\u003e\n\u003cp\u003eBobby walked her to the front door, which was unusual. She figured he wanted to tell her something out of earshot of his wife. He glanced furtively at the family room, where Teri was still sitting.\u003c/p\u003e\n\u003cp\u003e“She’s doing well,” Christie said reassuringly.\u003c/p\u003e\n\u003cp\u003e“All three are boys,” Bobby announced without preamble.\u003c/p\u003e\n\u003cp\u003e“You know already?”\u003c/p\u003e\n\u003cp\u003eBobby nodded. “I saw the picture. Teri wouldn’t look but I did.”\u003c/p\u003e\n\u003cp\u003e“Three sons,” Christie repeated, smiling widely.\u003c/p\u003e\n\u003cp\u003e“Teri wants a girl,” he said with a frown.\u003c/p\u003e\n\u003cp\u003e“Trust me, my sister won’t be disappointed,” Christie told him.\u003c/p\u003e\n\u003cp\u003e“She’ll want to get pregnant again—until she has her girl. I’m just not sure she should.”\u003c/p\u003e\n\u003cp\u003eChristie knew he was concerned about Teri’s health and the physical demands of this pregnancy. But she also knew the power Teri had over him.\u003c/p\u003e\n\u003cp\u003e“What you mean is that if my sister wants something and you can make it happen, you will. Right?”\u003c/p\u003e\n\u003cp\u003eBobby lowered his eyes.\u003c/p\u003e\n\u003cp\u003eChristie had to struggle not to laugh. He adored Teri so much, he could refuse her nothing. Oh, to have a man who loved her that intensely. Christie hoped Teri knew how lucky she was.\u003c/p\u003e\n\u003cp\u003e“Trust me,” she said again. “Once these babies are born, the last thing Teri will think about is getting pregnant again.”\u003c/p\u003e\n\u003cp\u003eAlarm crossed his face. “She’ll still…you know…” The rest of his words fell away as though he assumed she’d grasp his meaning.\u003c/p\u003e\n\u003cp\u003eChristie did. Only Bobby would ask something like this. “Oh, I imagine she’ll be as warm and loving as always, probably even more so.”\u003c/p\u003e\n\u003cp\u003eBobby’s shoulders sagged with relief.\u003c/p\u003e\n\u003cp\u003eLeaning forward, Christie kissed his cheek, then walked out the front door.\u003c/p\u003e\n\u003cp\u003eWhen she got to her car and opened the driver’s side, she gasped. There, on the seat, lay a single, perfectly shaped, long-stemmed red rose.\u003c/p\u003e\n\u003cp\u003eAnger rushed through her. She snatched up the rose and marched across the driveway to the garage. James used to live in the apartment above; presumably—obviously—he was back. Christie charged up the steps, breathless when she reached the landing.\u003c/p\u003e\n\u003cp\u003ePounding on the door with her fist, she suddenly realized what she’d done but didn’t have time to retreat. James was there, standing in the doorway. Seeing her, he smiled, his eyes warm…and loving.\u003c/p\u003e\n\u003cp\u003eEverything she’d intended to say disappeared. Confronting him had been a mistake. A big one.\u003c/p\u003e\n\u003cp\u003eThe urge to cry nearly overwhelmed her, but thankfully that passed quickly, replaced with a fresh surge of anger. This rose nonsense was a trick he’d played on her before. Every time Teri had sent him to pick her up or drive her home, there’d been a rose on her seat. In the beginning, Christie had thought the flowers were put there by her sister. Not until much later did she learn they were from James.\u003c/p\u003e\n\u003cp\u003e“Christie?” His voice was soft, almost a whisper.\u003c/p\u003e\n\u003cp\u003eShe continued to stare at him but suspected she only looked foolish. Hurling the rose at his feet, she whirled around and stormed back down the stairs, practically stumbling in her haste.\u003c/p\u003e\n\u003cp\u003eJames followed at a more sedate pace.\u003c/p\u003e\n\u003cp\u003eShe ran ahead, intent on climbing into her car and speeding away. However, when she went to open the door, she discovered she must have inadvertently locked it. Furious when the door refused to open, she staggered clumsily backward, straight into James’s chest. He caught her by the shoulders.\u003c/p\u003e\n\u003cp\u003eShe broke away from him, shouting, “Don’t touch me!”\u003c/p\u003e\n\u003cp\u003e“Actually,” he said, as calm as she was annoyed, “I think about touching you quite a bit.”\u003c/p\u003e\n\u003cp\u003e“Well, don’t.” Shaking the hair out of her face, she fumbled with her car keys and in her frustration dropped them on the pavement.\u003c/p\u003e\n\u003cp\u003e“Allow me,” James said politely and bent down to retrieve them.\u003c/p\u003e\n\u003cp\u003e“Don’t ever bring me another rose. Understand?”\u003c/p\u003e\n\u003cp\u003eHe handed back her keys. “I do understand. Unfortunately I can’t guarantee that I’ll stop.”\u003c/p\u003e\n\u003cp\u003e“Well, force yourself.” Turning away from him, she inserted the key in the lock.\u003c/p\u003e\n\u003cp\u003e“I love you.” His words were gentle. Sincere.\u003c/p\u003e\n\u003cp\u003e“I don’t care!”\u003c/p\u003e\n\u003cp\u003eThis was not supposed to be happening! Her plan was to react to him with cool indifference; instead, he’d flustered her so badly that she was on the verge of weeping, intelligible speech beyond her. Gulping for air, choking, she couldn’t manage a single word. \u003c/p\u003e","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-26.html","bookId":1951,"creation":"Oct 5, 2019 10:09:11 AM","modification":"Oct 5, 2019 10:09:11 AM"}
