{"id":68453,"no":29,"title":"Page 29","content":"\u003cp\u003eShe sighed. “Linc doesn’t understand why I feel he’s suffocating me. He seems to assume that the minute I’m out of his sight, some terrible fate will befall me.”\u003c/p\u003e\n\u003cp\u003eMack didn’t bother to remind Mary Jo that she’d met David Rhodes while living with her three brothers. He wondered where Linc had been then. He suspected she hadn’t told her brothers about David until she was already pregnant.\u003c/p\u003e\n\u003cp\u003e“Anyway, I don’t want to talk about Linc,” Mary Jo said. “Not when there’s so much else to discuss.”\u003c/p\u003e\n\u003cp\u003e“Fine with me.” Mack struck a relaxed pose, leaning back in the chair and stretching out his legs.\u003c/p\u003e\n\u003cp\u003e“Did I tell you the attorney is Allan Harris?”\u003c/p\u003e\n\u003cp\u003e“You did.” He frowned as he tried to remember where he’d heard the name. “Of course! His assistant’s the one who was arrested just before Christmas.”\u003c/p\u003e\n\u003cp\u003e“What?” Mary Jo’s hand flew to her throat. “Mr. Harris didn’t say anything about that.”\u003c/p\u003e\n\u003cp\u003e“He wouldn’t. His legal assistant stole jewelry from one of Harris’s clients. Apparently, Geoff—that was his name, Geoff Duncan—tried to frame Pastor Flemming for the theft.”\u003c/p\u003e\n\u003cp\u003e“Oh!” Mary Jo looked thoughtful. “That explains a lot.”\u003c/p\u003e\n\u003cp\u003e“In what way?” he asked.\u003c/p\u003e\n\u003cp\u003e“I almost didn’t apply for the job because I don’t have any paralegal background. But Mr. Harris said he wanted to hire someone who was willing to do on-the-job training. I think this is how he plans to keep a close eye on his employee. I’m just grateful he’s willing to give me a chance. He said he’d interviewed quite a few candidates and felt I’d work out the best.” There was a sparkle of excitement in her eyes. “I interrupted your story,” she said. “Sorry.”\u003c/p\u003e\n\u003cp\u003eMesmerized as he was by her, Mack couldn’t recall what he’d been talking about.\u003c/p\u003e\n\u003cp\u003e“Mr. Harris’s assistant,” Mary Jo said.\u003c/p\u003e\n\u003cp\u003e“Oh, yeah. Geoff Duncan. Fortunately, Sheriff Davis saw through his ploy. According to my dad, Allan Harris was pretty shocked. He didn’t have a clue Geoff would do anything like this. The crime was bad enough. Implicating an innocent man makes it that much worse.”\u003c/p\u003e\n\u003cp\u003e“But why would his assistant do something so stupid? He was bound to get caught sooner or later, don’t you think?”\u003c/p\u003e\n\u003cp\u003eMack shrugged. “I can’t say for sure. The gossip is that he was trying to impress his fiancée.”\u003c/p\u003e\n\u003cp\u003e“How would stealing stuff impress her?”\u003c/p\u003e\n\u003cp\u003e“Well, Lori Bellamy’s from a wealthy family. The Bellamys own quite a bit of property on the Kitsap Peninsula. Geoff must’ve got in a credit crunch and didn’t want to tell Lori he couldn’t afford the things she wanted and then panicked. I guess he wanted to act as if he had the same kind of money she did. Maybe he was afraid that if he couldn’t keep her in the lifestyle she was used to, she’d leave him. I heard that he pawned the jewelry for cash—and now he’s behind bars.” Mack had discussed the case with his older sister, Gloria, who worked for the sheriff’s office. He’d only learned of Gloria’s existence a few years ago and had been making an effort to develop a relationship with her. Since he and Gloria both lived in town now, they managed to have dinner or drinks at least once a month. Despite that, he still felt a reserve in her. A hesitation that was difficult to explain. He hadn’t said anything to his parents but couldn’t help wondering if they’d noticed it, too.\u003c/p\u003e\n\u003cp\u003e“So when do you start work?” he asked Mary Jo.\u003c/p\u003e\n\u003cp\u003e“Monday.”\u003c/p\u003e\n\u003cp\u003eThat gave her less than a week to get all her arrangements in order. “Not a lot of time,” he murmured.\u003c/p\u003e\n\u003cp\u003eShe nodded. “The next thing I need to do is find somewhere to live.”\u003c/p\u003e\n\u003cp\u003eMack wondered if she remembered the suggestion he’d made that February afternoon at the library, and suspected she didn’t.\u003c/p\u003e\n\u003cp\u003e“I can always commute from Seattle with Noelle if I have to,” she was saying, “but that would make for a very long day.”\u003c/p\u003e\n\u003cp\u003eMary Jo had just handed him the perfect intro. His one fear was that if she knew he owned the duplex she might be leery of renting from him. A landlord-tenant relationship could complicate things.\u003c/p\u003e\n\u003cp\u003eHe decided to gauge the situation with a comment. “I, uh, might have mentioned it, but I recently moved into a duplex and the second half is empty.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003eHe forged ahead. “The rent’s reasonable, too.”\u003c/p\u003e\n\u003cp\u003e“How…reasonable?”\u003c/p\u003e\n\u003cp\u003eHe named a figure that was about half the going rate, which was what he speculated she’d be able to afford.\u003c/p\u003e\n\u003cp\u003e“How much?” Mary Jo sat up straight. “There must be something wrong with the place.”\u003c/p\u003e\n\u003cp\u003e“Not really. Oh, it could use a bit of paint and cleaning, but basically that’s about it.” Then, pressing his luck, he added, “The owner’s a nice guy. He’s currently…out of town, but you can meet him later if you like. I’m acting as his manager.” That was an inspired idea, he thought, and not a lie. He was the manager. And this conveniently “out-of-town” owner would appear sometime in the future. Mack had no intention of misleading her for long; his objective was to get her moved to Cedar Cove. Once she’d made the transition he’d find a good opportunity to tell her about the “owner.” In the meantime, he’d have her write the rent checks to his accountant, Zachary Cox.\u003c/p\u003e\n\u003cp\u003eNibbling on her lower lip, Mary Jo mulled this over. “Would it be a problem…you know, having me and Noelle next door?”\u003c/p\u003e\n\u003cp\u003e“A problem?” he repeated. “Not for me. What about you?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I think it’d be great. But I wouldn’t want to be a bother.”\u003c/p\u003e\n\u003cp\u003e“I can’t see that happening.” In fact, he had to work at not showing how thrilled he’d be to have Mary Jo and Noelle as his next-door neighbors.\u003c/p\u003e\n\u003cp\u003eMary Jo continued to look speculative as if her instincts were telling her this wasn’t a wise decision.\u003c/p\u003e\n\u003cp\u003e“Would you like to see the duplex?” he asked, hoping to distract her.\u003c/p\u003e\n\u003cp\u003e“Oh…sure.”\u003c/p\u003e\n\u003cp\u003e“I was painting before my shift at the fire station, so it’s pretty messy.”\u003c/p\u003e\n\u003cp\u003e“Why were you painting?” she asked. “Isn’t that the landlord’s responsibility?”\u003c/p\u003e\n\u003cp\u003e“Normally it would be,” Mack said, trying to sound nonchalant. “I offered to do it in exchange for a reduction in rent. He, uh, wants first and last months’ upfront.”\u003c/p\u003e\n\u003cp\u003e“I have that in savings, so I’m not concerned.”\u003c/p\u003e\n\u003cp\u003eThey finished their drinks and Mack drove Mary Jo past the Senior Center to 1022 Evergreen Place.\u003c/p\u003e\n\u003cp\u003eMary Jo’s eyes darted up and down the street. “This is a nice neighborhood,” she said appreciatively.\u003c/p\u003e\n\u003cp\u003eMack had thought so, too, which was one reason he’d made an offer. This was a good place to raise a family.\u003c/p\u003e\n\u003cp\u003e“Now I really don’t understand why the rent’s so low,” Mary Jo said, frowning.\u003c/p\u003e\n\u003cp\u003e“Like you said earlier,” he rushed to explain, “the cost of living is less on this side of Puget Sound.”\u003c/p\u003e\n\u003cp\u003e“I had no idea it would be this much less.”\u003c/p\u003e\n\u003cp\u003eMack was beginning to think he might have overdone it. “You can always check out other rentals.”\u003c/p\u003e\n\u003cp\u003e“I could,” she agreed, “but I like this one.”\u003c/p\u003e\n\u003cp\u003eMack relaxed. “I understand there’s an eligible bachelor in close proximity, too.” The instant the words were out of his mouth, Mack regretted them. Mary Jo was emotionally fragile, and he didn’t want to frighten her off by appearing to pursue anything but friendship. He ignored the reproach that nagged at him—that he was being manipulative.\u003c/p\u003e\n\u003cp\u003eIn any case, his joke didn’t elicit a response. Instead, Mary Jo stared out the window. After a moment, she said, “I’m not going to be dating anyone for a long while.”\u003c/p\u003e\n\u003cp\u003eIt was a veiled warning, a signal. He considered offering reassurances, but that would have led to more lies, or half-truths, anyway. So he asked, “Would you like to take a look inside?”\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003eHe wanted to give her an opportunity to get to know him—and trust him. Living side by side as neighbors and friends was the way to do that. Her brothers weren’t going to appreciate his efforts, but that was their problem.\u003c/p\u003e\n\u003cp\u003eMack helped her down from the truck. “I have the key,” he told her. “You’d be in Unit B.” He opened the door and gestured her inside. A sheet lay across the living room floor with a bucket of paint, a roller and brushes resting next to it. The fresh, clean smell of recently painted walls greeted them. On his mother’s advice, he’d chosen a pale, buttery yellow, which worked with the small rooms yet had a subtle warmth.\u003c/p\u003e\n\u003cp\u003e“I only have a few pieces of furniture,” Mary Jo said as she moved from one room to the next. The kitchen was compact but adequate. The two bedrooms were across the hall from each other.\u003c/p\u003e\n\u003cp\u003e“There’s one bath?”\u003c/p\u003e\n\u003cp\u003eMack nodded. “And a laundry room.”\u003c/p\u003e\n\u003cp\u003e“I don’t have a washer and dryer.”\u003c/p\u003e\n\u003cp\u003e“They come with the place.”\u003c/p\u003e\n\u003cp\u003eOr they would by the time she moved in.\u003c/p\u003e\n\u003cp\u003e“I have my bedroom set, of course, and there’s the crib for Noelle and her changing table.” She paused as if calculating what else she could bring. “I have a rocking chair, too, but that’s it in the way of living room furniture.”\u003c/p\u003e\n\u003cp\u003e“What about a television?”\u003c/p\u003e\n\u003cp\u003eMary Jo shook her head. “I had an old TV in my room, but it’s not worth taking.”\u003c/p\u003e\n\u003cp\u003e“I’ve got an extra one you can use.”\u003c/p\u003e\n\u003cp\u003eAgain Mack saw her hesitate.\u003c/p\u003e\n\u003cp\u003e“Thanks for the offer, but I’d rather not do that.”\u003c/p\u003e\n\u003cp\u003e“I could sell it to you cheap,” he said impulsively.\u003c/p\u003e\n\u003cp\u003eThis appeared to interest her. “How cheap?”\u003c/p\u003e\n\u003cp\u003e“Cheap.” He came up with a price he felt she could probably afford. “Fifty bucks.”\u003c/p\u003e\n\u003cp\u003eMary Jo laughed. “Sold.”\u003c/p\u003e\n\u003cp\u003e“Great! I’ve been wanting to get rid of that piece of junk.”\u003c/p\u003e\n\u003cp\u003e“Mack!”\u003c/p\u003e\n\u003cp\u003eHe held up both hands. “Just kidding.”\u003c/p\u003e\n\u003cp\u003e“Good thing you are, buddy.”\u003c/p\u003e\n\u003cp\u003eWith the easy banter between them, Mack relaxed. “Would you like me to contact the owner and tell him he’s got his second renter?”\u003c/p\u003e\n\u003cp\u003eMary Jo smiled over at him. “Okay, it’s a deal.”\u003c/p\u003e\n\u003cp\u003e“And listen, don’t worry about me pestering you.” He wanted to make sure Mary Jo understood that.\u003c/p\u003e\n\u003cp\u003e“I’m more worried about pestering you.”\u003c/p\u003e\n\u003cp\u003eOn the contrary, he figured that having Mary Jo and Noelle this close might be the best thing to happen to him in a long, long time.\u003c/p\u003e\n\u003cp\u003eTwenty-Two\u003c/p\u003e\n\u003cp\u003eWhen Troy finished shaving on Friday morning, he did something he didn’t usually do—he splashed on a citrus-scented aftershave, hoping the scent would last long enough for Faith to notice later that evening.\u003c/p\u003e\n\u003cp\u003eIf anyone in the office caught a whiff, he might be teased, but any teasing would be worth the possible return. After several short phone conversations, Faith had finally agreed to have dinner with him and Troy could hardly wait. They had a lot to discuss, but the item at the very top of his list was this purported move. He didn’t want her walking out of his life again, so he had to let her know how he felt in no uncertain terms. \u003c/p\u003e","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-29.html","bookId":1951,"creation":"Oct 5, 2019 10:09:11 AM","modification":"Oct 5, 2019 10:09:11 AM"}
