{"id":68457,"no":33,"title":"Page 33","content":"\u003cp\u003eThey might’ve stayed longer if he hadn’t noticed obvious signs that the place was closing. Linc hated to see the evening end. Unlike most women, Lori made him feel relaxed and comfortable. Their conversation interested him. Apparently neither of them was skilled at small talk, and when he mentioned that, she’d said, “So what? We’ll talk about big things, then.” And they had.\u003c/p\u003e\n\u003cp\u003eEverything changed once they were in the truck again and he was taking her back to retrieve her car. The silence seemed strained when it hadn’t been before. Linc didn’t understand why and wondered what he might’ve said to upset her. He decided to find out, but didn’t know how to broach the subject, how to ask what was bothering her.\u003c/p\u003e\n\u003cp\u003e“Linc?” She put her hand on his arm. “Do you mind if we just sit here for a moment?” He’d parked on the roadside, a few yards from her car.\u003c/p\u003e\n\u003cp\u003e“No…I mean—no, of course I don’t mind.”\u003c/p\u003e\n\u003cp\u003eShe turned and stared at him with the biggest, darkest brown eyes he’d ever seen. “You have trouble with relationships, right?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“I do, too. But I feel different with you.”\u003c/p\u003e\n\u003cp\u003eHe nodded again, unsure how to explain his feelings in words.\u003c/p\u003e\n\u003cp\u003e“You’re a good person. You stopped to help me when everyone else drove past.” She gestured at her car. “No one cared except you.”\u003c/p\u003e\n\u003cp\u003eHe wanted to brush aside her gratitude, but she seemed so intent that he didn’t speak for fear of destroying the mood.\u003c/p\u003e\n\u003cp\u003e“You care about your family, too, and you’ve kept your dad’s business going. I admire that.” She closed her eyes, then opened them. “I’m sick of it all.”\u003c/p\u003e\n\u003cp\u003e“Sick of what?” he asked, puzzled by the abrupt leap.\u003c/p\u003e\n\u003cp\u003e“Dating.”\u003c/p\u003e\n\u003cp\u003e“Does that mean you won’t go out with me again?” He couldn’t keep the disappointment from his voice.\u003c/p\u003e\n\u003cp\u003e“No…listen, don’t say anything yet, but I’d like to suggest something so far out in left field you’ll probably jump out of your truck and head for the hills.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eShe chewed on her lip, then shook her head. “No, it’s too crazy. Never mind.”\u003c/p\u003e\n\u003cp\u003eLinc couldn’t imagine what she was about to suggest and wished she’d blurt it out, damn the consequences.\u003c/p\u003e\n\u003cp\u003e“I’m an old-fashioned kind of woman.” She paused. “Just like you’re an old-fashioned kind of guy.”\u003c/p\u003e\n\u003cp\u003eLinc agreed; he liked that about her.\u003c/p\u003e\n\u003cp\u003e“You seem to have problems with relationships and it’s the same way with me.”\u003c/p\u003e\n\u003cp\u003eAgain, he agreed.\u003c/p\u003e\n\u003cp\u003e“You’re as sick of the whole dating game as I am, right?”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003eLori drew in a deep breath. “You want to skip all that?”\u003c/p\u003e\n\u003cp\u003e“I…beg your pardon?” He was missing some step in her logic.\u003c/p\u003e\n\u003cp\u003eShe kept her gaze fixed squarely on something ahead, although he couldn’t tell what. “Would you be interested in skipping all the stuff that leads up to…marriage?”\u003c/p\u003e\n\u003cp\u003eThe silence seemed to echo. “Lori,” he said cautiously. “I might be wrong about this, and if I am, if I’m being presumptuous, forgive me.” He swallowed. “Are you asking me to marry you?”\u003c/p\u003e\n\u003cp\u003eShe cleared her throat. “I know this is probably the most bizarre, impulsive thing you’ve ever heard, but I have to ask.”\u003c/p\u003e\n\u003cp\u003e“You’re serious?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said solemnly. “We both want to get married, right?”\u003c/p\u003e\n\u003cp\u003eThat was true. Linc could feel his pulse speed up.\u003c/p\u003e\n\u003cp\u003eLori continued. “You’ve been burned. I’ve been burned. Let’s do away with all the nonsense. Let’s just go for broke and do it. Would you be willing?”\u003c/p\u003e\n\u003cp\u003e“I never expected a woman to propose to me, but seeing that you have…”\u003c/p\u003e\n\u003cp\u003e“Did I completely throw you?” she asked.\u003c/p\u003e\n\u003cp\u003eShe had, although Linc wouldn’t admit it. “Do you want an answer now?”\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003eHe took a quick breath. “Okay. I’m willing to give it a try if you are.”\u003c/p\u003e\n\u003cp\u003eLori’s smile lit up her whole face as she grabbed his arm. “I can’t believe we’re doing this! It’s crazy!”\u003c/p\u003e\n\u003cp\u003e“I guess it is.”\u003c/p\u003e\n\u003cp\u003eShe rested her head against his shoulder and expelled her breath, as if some great weight had been lifted from her.\u003c/p\u003e\n\u003cp\u003e“Then we’re getting married,” he said.\u003c/p\u003e\n\u003cp\u003e“We’re getting married,” she repeated.\u003c/p\u003e\n\u003cp\u003e“Soon?” he asked.\u003c/p\u003e\n\u003cp\u003e“Soon.”\u003c/p\u003e\n\u003cp\u003eTwenty-Four\u003c/p\u003e\n\u003cp\u003eBen was feeling—and acting—more like his old self lately, which greatly relieved Charlotte. She knew he’d spoken with David twice in the past few weeks. While the first call had disturbed him, he’d been less agitated after the second one. In the days that followed, his mood had lightened considerably.\u003c/p\u003e\n\u003cp\u003eBen hadn’t shared any of that conversation with her but Charlotte knew he’d contacted Roy McAfee shortly afterward. At first Charlotte was disappointed that Ben hadn’t confided in her. Since then, she’d worked it out in her mind. Thoughtful man that he was, Ben didn’t want to involve her in this latest mess with his son.\u003c/p\u003e\n\u003cp\u003e“Ben,” she called, fussing with her hat in front of the mirror. She so seldom wore a hat these days, but this was a celebration and nothing said that better than a nice hat. In their last conversation, Olivia had told her she’d decided on a hat, too—for different reasons, obviously—but this was also why Charlotte was wearing hers. To make sure her daughter didn’t feel self-conscious. Olivia had a lovely wig, but found it hot and uncomfortable, so her family and friends urged her to go without.\u003c/p\u003e\n\u003cp\u003e“Are you ready to leave?” she asked Ben.\u003c/p\u003e\n\u003cp\u003e“The grand opening’s not for almost an hour,” he called back.\u003c/p\u003e\n\u003cp\u003eCharlotte secured the fedora with a fancy pin that had belonged to her mother. “Ben, darling, I don’t want to be late.”\u003c/p\u003e\n\u003cp\u003e“Charlotte,” he said, joining her in their bedroom. “It’ll only take five minutes to get to the tearoom.”\u003c/p\u003e\n\u003cp\u003e“But there might be a crowd.”\u003c/p\u003e\n\u003cp\u003eBen hugged her around the waist. “Very well, my dear, if it’ll reassure you, we can leave now.”\u003c/p\u003e\n\u003cp\u003e“Thank you, sweetheart.”\u003c/p\u003e\n\u003cp\u003eAfter months of construction, her granddaughter’s Victorian Tea Room was about to open. The pink building with the lavender trim was the talk of the town, and that wasn’t surprising. There’d never been a place in Cedar Cove like it.\u003c/p\u003e\n\u003cp\u003eIn preparation for her granddaughter’s venture, Charlotte had collected her most cherished recipes. Ben had helped her type them. Then, with no small amount of fanfare, they’d delivered the binder to Justine. Charlotte was delighted to see that a number of her recipes had been included in the tearoom menu.\u003c/p\u003e\n\u003cp\u003eCharlotte sprayed on some cologne—Evening in Paris, her lifelong favorite. Just as she’d finished, she heard the doorbell. What terrible timing!\u003c/p\u003e\n\u003cp\u003eWhen she walked into the living room, she saw Roy McAfee, coat still on, briefcase in hand, talking to Ben.\u003c/p\u003e\n\u003cp\u003e“Roy, how nice to see you,” she said politely.\u003c/p\u003e\n\u003cp\u003eShe waited for Ben to announce that they were leaving for the tearoom. Family and close friends were gathering there before it opened for a blessing ceremony. Pastor Flemming would invoke God’s blessings on this enterprise, and Charlotte didn’t want to miss a second of it. But instead of deferring Roy’s visit, her husband invited him to take a seat.\u003c/p\u003e\n\u003cp\u003e“We won’t be long,” Ben said, apparently guessing her thoughts.\u003c/p\u003e\n\u003cp\u003e“Would you like me to make coffee?” she asked the two men.\u003c/p\u003e\n\u003cp\u003e“No, thanks,” Roy said. “I just need to give Ben a report.”\u003c/p\u003e\n\u003cp\u003eIt was clear that Ben had hired Roy to check up on something and that something undoubtedly concerned David.\u003c/p\u003e\n\u003cp\u003eBen gestured to the empty space on the sofa. “Join us, please.”\u003c/p\u003e\n\u003cp\u003eCharlotte sat down beside him. He reached for her hand, holding it tight. She could feel how tense he was, how weary of dealing with David and his problems, and gave his fingers a reassuring squeeze.\u003c/p\u003e\n\u003cp\u003e“As you’re probably aware,” Roy said, seated across from them, “Ben asked me to look into David’s story.”\u003c/p\u003e\n\u003cp\u003eBen turned to Charlotte and said, “When David and I last spoke, he’d told Mary Jo he wanted a paternity test. She was against it, but because I asked her to comply, she did. Test results prove that Noelle is his daughter. There can be no doubt of that now.”\u003c/p\u003e\n\u003cp\u003e“Is David going to step up and accept responsibility?”\u003c/p\u003e\n\u003cp\u003e“He said he is,” Ben answered. “He came to me and explained that he’d left his job with the insurance company and is now working for a bank. He told me he’s trying to make positive changes in his life and asked for my help.”\u003c/p\u003e\n\u003cp\u003e“Financial help?” Charlotte asked.\u003c/p\u003e\n\u003cp\u003e“No, and that encouraged me. I felt for the first time in years that perhaps my son had learned his lesson and was willing to become the man I’ve always believed he could be.”\u003c/p\u003e\n\u003cp\u003eCharlotte’s gaze flew to Roy, unsure why Ben had involved him.\u003c/p\u003e\n\u003cp\u003e“The thing is, I’ve been led down the garden path with David before,” Ben continued. “It’s difficult for me to judge his sincerity because, as his father, I naturally lean toward trusting him. But rather than blindly accept his word this time, I asked Roy to check out David’s story.”\u003c/p\u003e\n\u003cp\u003eRoy bent down to open his briefcase. “I have a full written report for you here,” the investigator told them, getting up to pass Ben a file folder.\u003c/p\u003e\n\u003cp\u003e“Because we’re a little tight for time,” Ben said, “would you be kind enough to summarize it for us?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eCharlotte noticed the way Roy’s back stiffened—as though he dreaded what he was about to tell them. “When David said he’d left his job, he was telling the truth, although the termination wasn’t his choice. The company fired him with cause. Apparently there’s been a sexual harassment charge filed against him. He didn’t receive a severance package.”\u003c/p\u003e\n\u003cp\u003eCharlotte wasn’t surprised David had been let go from his job.\u003c/p\u003e\n\u003cp\u003e“But he has this new position, correct?” The question came from Ben.\u003c/p\u003e\n\u003cp\u003e“No, I’m afraid that’s another fabrication,” Roy said. “He’s been unemployed for three months.”\u003c/p\u003e\n\u003cp\u003eKnowing how close to the edge David was financially, Charlotte felt she had to ask, “How is he living, then?”\u003c/p\u003e\n\u003cp\u003eRoy looked to Ben as if to ask the older man’s permission to respond. Ben gave a slight nod.\u003c/p\u003e\n\u003cp\u003e“David’s moved in with a…friend.”\u003c/p\u003e\n\u003cp\u003e“Male or female?” Ben inquired, frowning.\u003c/p\u003e\n\u003cp\u003e“Female.”\u003c/p\u003e\n\u003cp\u003eCharlotte sensed his disappointment in his son—his even greater disappointment, she amended.\u003c/p\u003e\n\u003cp\u003e“In other words,” Ben said, betraying none of the emotion Charlotte had recognized in him, “my son is letting a woman support him.”\u003c/p\u003e\n\u003cp\u003eRoy nodded. “That appears to be the case.”\u003c/p\u003e\n\u003cp\u003e“What about all this talk of being a father to Noelle, supporting her financially and bringing her into his life?” Charlotte looked at Ben. \u003c/p\u003e","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-33.html","bookId":1951,"creation":"Oct 5, 2019 10:09:11 AM","modification":"Oct 5, 2019 10:09:11 AM"}
