{"id":68461,"no":37,"title":"Page 37","content":"\u003cp\u003eTroy nodded. “Would you like to go down to the station?” he asked the mayor.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eLouie was pale, and sweat had broken out on his forehead.\u003c/p\u003e\n\u003cp\u003e“I want to talk to you,” Louie said. “Privately.”\u003c/p\u003e\n\u003cp\u003eTroy hesitated. “We’ve known each other a long time. If you’re asking me to—”\u003c/p\u003e\n\u003cp\u003e“My brother hasn’t admitted to any wrongdoing.”\u003c/p\u003e\n\u003cp\u003e“Otto,” Louie barked. “Just let me tell him. If he needs to arrest me, then so be it. I’m not asking for any personal favors.” He looked directly at Troy. “I’d prefer to talk here, if that’s all right. If you want me to repeat what I tell you over at the station, then I will.”\u003c/p\u003e\n\u003cp\u003e“Agreed.” Troy showed them into the chilly house, switched on the lights and turned up the heat, then gestured for the two men to sit down.\u003c/p\u003e\n\u003cp\u003eLouie perched on the edge of the sofa; Otto sat next to him, his back straight, his expression guarded.\u003c/p\u003e\n\u003cp\u003e“I’m not sure where to start,” the mayor said, glancing up at Troy. His hands dangled between his parted knees.\u003c/p\u003e\n\u003cp\u003e“You saw Charlotte Rhodes stop by my office earlier this afternoon, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“No,” Louie said starkly. “She came to see me afterward and suggested I speak to you.” He gave a long sigh. “I figured it was either come to you and tell my story or wait for you to seek me out. I’d rather clear this up once and for all. I don’t want it hanging over my head anymore.”\u003c/p\u003e\n\u003cp\u003e“My brother can’t be held responsible—”\u003c/p\u003e\n\u003cp\u003eLouie raised a hand to silence his brother. “I’ll do the talking. I appreciate that you’re here, Otto, but I’m going to do it my own way.”\u003c/p\u003e\n\u003cp\u003e“I—”\u003c/p\u003e\n\u003cp\u003eAgain Louie silenced his brother, this time with a look.\u003c/p\u003e\n\u003cp\u003eTroy settled back and waited.\u003c/p\u003e\n\u003cp\u003e“I married my first wife while I was in college,” Louie said.\u003c/p\u003e\n\u003cp\u003eTroy didn’t know the mayor had been married more than once. Donna had been Louie’s wife for as long as he could recall.\u003c/p\u003e\n\u003cp\u003e“My marriage to Beverly wasn’t good,” Louie told him. “My wife had…medical problems.”\u003c/p\u003e\n\u003cp\u003e“What my brother’s trying to say,” Otto cut in, “is that Beverly had emotional problems. Or, more accurately, psychiatric ones.”\u003c/p\u003e\n\u003cp\u003e“She was agoraphobic,” Louie said as if his brother hadn’t spoken. “In the beginning, everything seemed fine. Beverly was shy and she didn’t like being around a lot of people but that didn’t bother me. After we were married I realized this tendency of hers was more than simple aversion. To be fair, we had a few good months together.” Louie paused, sighing, before he went on. “I was about to graduate from college and we decided it was time to start our family.”\u003c/p\u003e\n\u003cp\u003e“That’s when the trouble began,” Otto said. “And—”\u003c/p\u003e\n\u003cp\u003eLouie cast his brother another quelling look and Otto didn’t complete the sentence.\u003c/p\u003e\n\u003cp\u003e“As I was saying,” Louie continued, “Beverly got pregnant easily enough but miscarried in the third month. Losing the pregnancy devastated her.”\u003c/p\u003e\n\u003cp\u003eTroy remembered how hard Sandy’s miscarriage had been on both of them, and more recently, how painful the loss of Megan’s baby had been. He nodded sympathetically.\u003c/p\u003e\n\u003cp\u003e“Afterward she withdrew completely. I couldn’t get her to leave the house.”\u003c/p\u003e\n\u003cp\u003eOtto leaned forward and added, “Louie did everything he could for her—to no avail. He couldn’t persuade her to see a psychiatrist, and the problem got worse and worse.”\u003c/p\u003e\n\u003cp\u003e“By then Beverly and I had no relationship to speak of. Some days she didn’t get out of bed.” Louie rubbed his palms together as if to warm his hands. “It didn’t help that her younger sister—who wasn’t married—got pregnant. The father was some sailor she met during Seafair in Seattle. Here today and gone tomorrow. Apparently Amber didn’t bother to ask his name. She didn’t want the baby, but Beverly did. She told her we’d raise the child. I was willing to adopt Amber’s child,” Louie said, “hoping that a baby would give me back the woman I married.”\u003c/p\u003e\n\u003cp\u003e“Did you legally adopt the baby?”\u003c/p\u003e\n\u003cp\u003e“No,” he said, sighing once more. “That meant Beverly would have to leave the house—go to court, for one thing—and she refused to do that.”\u003c/p\u003e\n\u003cp\u003eTroy nodded, indicating that his friend should go on.\u003c/p\u003e\n\u003cp\u003e“When the child was born with Down syndrome, it made no difference to Beverly. She mothered him, gave him all her love and attention.”\u003c/p\u003e\n\u003cp\u003e“But nothing changed,” Otto said. “Beverly was still a recluse.”\u003c/p\u003e\n\u003cp\u003e“Her only joy was her sister’s son,” Louie said. “She doted on him, loved and pampered him and then—”\u003c/p\u003e\n\u003cp\u003eTroy interrupted with a question. “You stayed in the marriage?”\u003c/p\u003e\n\u003cp\u003eLouie looked away, then finally shook his head. “Eventually we divorced.”\u003c/p\u003e\n\u003cp\u003e“My brother did everything he could to save the marriage,” Otto insisted.\u003c/p\u003e\n\u003cp\u003eLouie raised his hand. “None of that’s important now. Beverly didn’t seem to care that we were no longer married. Timmy was her entire world.”\u003c/p\u003e\n\u003cp\u003eSensing there was more to this story, Troy turned to Otto, who—strangely—remained quiet.\u003c/p\u003e\n\u003cp\u003e“A few years after the divorce, I met Donna,” Louie said, lowering his voice. “I was living in Seattle then. We got engaged. She knew I was divorced but I didn’t mention Timmy.”\u003c/p\u003e\n\u003cp\u003e“Louie kept in touch with Beverly and Timmy and saw to their needs.”\u003c/p\u003e\n\u003cp\u003e“I brought her groceries once a week, made sure her bills were paid and checked up on her,” Louie elaborated. “Otherwise, I don’t know what would’ve become of them. Although we were divorced I still felt some responsibility for her and Timmy. I was often tempted to call Child Protective Services but they would, most likely, have taken Timmy away, which would’ve destroyed Beverly completely. I guess he was a kid who slipped through the cracks. No one from any official agency knew about him—and I didn’t tell them.”\u003c/p\u003e\n\u003cp\u003e“What happened to Beverly?” Troy asked.\u003c/p\u003e\n\u003cp\u003e“I’m getting to that. When Timmy was in his early teens, I noticed that she’d started to lose weight. Soon I realized it was something physical. She became gaunt and spent practically all her time in bed. I begged her to see a doctor but no matter how much I pleaded she refused.”\u003c/p\u003e\n\u003cp\u003eOtto did speak up then. “Louie phoned to ask for my help. I had a good friend who was a medical student. He went to the house to examine her—over her protests—and diagnosed her with cancer. Stomach cancer.”\u003c/p\u003e\n\u003cp\u003e“It became apparent that unless she got immediate medical treatment she’d die, and frankly I think that’s what she wanted. Life had become too painful for her.”\u003c/p\u003e\n\u003cp\u003eLouie’s expression was tormented. “I did everything I could to convince her to seek medical help. For Timmy’s sake, I pleaded with her to go to a hospital.”\u003c/p\u003e\n\u003cp\u003eTroy gave a slight nod. He believed Louie. He knew nothing about any of this because he’d been in the service at that time.\u003c/p\u003e\n\u003cp\u003e“She kept refusing,” Otto inserted. “I was with him on more than one occasion and what he’s saying is the truth. The thought of leaving the security of her house was more than she could bear. It was a sad, difficult situation.” He shook his head. “Eventually, when she was too weak to resist, we had her taken to Seattle by ambulance. She didn’t last much longer.”\u003c/p\u003e\n\u003cp\u003e“What about the boy?” Troy asked.\u003c/p\u003e\n\u003cp\u003e“I stopped by to visit a couple of weeks before that—and Timmy was gone.” He leaned forward, bracing his elbows on his knees.\u003c/p\u003e\n\u003cp\u003e“Did Beverly tell you where he was?”\u003c/p\u003e\n\u003cp\u003eLouie nodded. “She said her sister had come and taken him away.” He swallowed visibly. “Beverly knew she was dying and couldn’t look after him anymore.”\u003c/p\u003e\n\u003cp\u003e“You checked this out?”\u003c/p\u003e\n\u003cp\u003e“No. I…I know I should have. I can’t tell you how many sleepless nights I’ve spent wondering. Beverly said Amber had promised to take the boy to an aunt of theirs who lived near Cedar Cove. This aunt, whom I never met, apparently used to visit once in a while.”\u003c/p\u003e\n\u003cp\u003eTroy let that information settle before he asked, “Did you ever hear from Amber again?”\u003c/p\u003e\n\u003cp\u003e“Never.”\u003c/p\u003e\n\u003cp\u003eOtto said, “She died a year after Beverly in an automobile accident.”\u003c/p\u003e\n\u003cp\u003e“I didn’t find out about it until several years later,” Louie clarified. “By then, Donna and I were married and we’d moved back to Cedar Cove and started our family.”\u003c/p\u003e\n\u003cp\u003e“So you believe the body in the cave is Timmy,” Troy said.\u003c/p\u003e\n\u003cp\u003eLouie stared down at the floor. “I strongly suspect it is. The…skeleton was wearing the baseball cap I gave him. He loved that thing and wore it constantly.”\u003c/p\u003e\n\u003cp\u003e“We’d need dental records to confirm his identity,” Troy said. He paused. “I assume there are dental records?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Louie told him. “He’d been to the dentist two or three times. He broke a tooth when he was eight, and I took him to Dr. Hudson myself.”\u003c/p\u003e\n\u003cp\u003e“Fine. I’ll get the chart from Hudson and send it to the pathologist.”\u003c/p\u003e\n\u003cp\u003e“It’s Timmy,” Louie insisted. “You can compare dental records if you want, but in my heart of hearts, I know it’s Timmy.”\u003c/p\u003e\n\u003cp\u003eThis brought up something else. “Charlotte Jefferson knew about Timmy. She met the aunt—Amber and Beverly’s aunt—in the park.”\u003c/p\u003e\n\u003cp\u003eClosing his eyes, Louie nodded.\u003c/p\u003e\n\u003cp\u003e“So you believe the aunt is responsible for Timmy’s death?” Troy asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know what to believe,” Louie said, his voice ragged. “If I were to speculate, I’d guess Amber did take the boy to live with her mother’s sister. But you have to remember that Timmy had only been away from Beverly for the briefest periods of time. He couldn’t possibly have understood what had happened and why he had to leave the only home he’d ever known.”\u003c/p\u003e\n\u003cp\u003e“My assumption is that he ran away,” Otto said. “Somehow he found the cave and hid out there….”\u003c/p\u003e\n\u003cp\u003e“Wouldn’t his aunt have looked for him or reported him missing? Is she still alive?” Troy asked urgently.\u003c/p\u003e\n\u003cp\u003eLouie shook his head. “I learned a few years later that she died of a sudden heart attack about two weeks after Beverly. I figured the boy had gone to a group home or something. I…I suppose that’s what I wanted to believe.”\u003c/p\u003e\n\u003cp\u003e“Timmy died due to a tragic series of events.” Otto stood. “My brother hasn’t done anything culpable.”\u003c/p\u003e\n\u003cp\u003e“Maybe not, but I should’ve made sure Timmy was okay, that he was settled and happy. The truth is, I was young and selfish and relieved not to be responsible for the boy anymore. I feel wretched now to realize my self-centeredness might have contributed to his death. The night I was arrested for drunk driving was the night I could no longer deny what I’d suspected from the beginning—it was Timmy in that cave.”\u003c/p\u003e\n\u003cp\u003eTroy knew that no one would be harder on the mayor than he’d been on himself. \u003c/p\u003e","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-37.html","bookId":1951,"creation":"Oct 5, 2019 10:09:11 AM","modification":"Oct 5, 2019 10:09:11 AM"}
