{"id":68467,"no":43,"title":"Page 43","content":"\u003cp\u003eTentative as the situation between him and Mary Jo was, Mack didn’t feel he could involve his parents. He slouched against the kitchen counter and rested his elbows there. “I have my reasons.”\u003c/p\u003e\n\u003cp\u003e“When do you plan to tell them?”\u003c/p\u003e\n\u003cp\u003e“I haven’t figured that out yet.”\u003c/p\u003e\n\u003cp\u003e“Mack, if Mom finds out from someone else, she’ll be devastated.”\u003c/p\u003e\n\u003cp\u003e“I know.” Although that wasn’t likely to happen.\u003c/p\u003e\n\u003cp\u003e“So will Dad.”\u003c/p\u003e\n\u003cp\u003eMack knew that, too. In hindsight, he wished he’d already mentioned the engagement to his parents.\u003c/p\u003e\n\u003cp\u003e“Okay, I understand why you want to keep it a secret,” Linnette surprised him by saying.\u003c/p\u003e\n\u003cp\u003e“You do?”\u003c/p\u003e\n\u003cp\u003e“Of course. You want to wait until you’re certain she wants to go through with the wedding. The way things stand right now, you’re feeling hesitant—”\u003c/p\u003e\n\u003cp\u003e“It’s not me who’s hesitant. It’s Mary Jo.”\u003c/p\u003e\n\u003cp\u003e“Are you sure about that?”\u003c/p\u003e\n\u003cp\u003eNo question. “Very sure.”\u003c/p\u003e\n\u003cp\u003eAfter a moment, Linnette asked, “Can I trust you with a secret, too?”\u003c/p\u003e\n\u003cp\u003e“Of course.” His sister, however, had never really kept secrets. She’d always been the model student and the good daughter, whereas Mack and his father often fought. It worried him that keeping his engagement from his parents threatened the truce he’d established with his father. He’d risked a great deal for Mary Jo and his biggest fear was that it was all for nothing.\u003c/p\u003e\n\u003cp\u003eWhen Linnette wasn’t immediately forthcoming, Mack said, “So what’s your big secret?”\u003c/p\u003e\n\u003cp\u003eHis sister’s voice dropped so low he couldn’t hear.\u003c/p\u003e\n\u003cp\u003e“Say that again,” he said.\u003c/p\u003e\n\u003cp\u003e“Okay, fine, I will. I’m married.”\u003c/p\u003e\n\u003cp\u003e“You’re what?”\u003c/p\u003e\n\u003cp\u003e“Married.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“December twenty-ninth. On the drive back from Cedar Cove to North Dakota after Christmas, Pete and I took a detour to Las Vegas. Neither of us had ever been before and it was sheer craziness.\u003c/p\u003e\n\u003cp\u003e“At first, we couldn’t find even one hotel room, let alone two, and when we finally managed to locate a room—there was just the one. That’s when Pete said he didn’t care what the advertisements said—what happens in Vegas doesn’t necessarily stay there, so we got a wedding license and got married the same day.”\u003c/p\u003e\n\u003cp\u003e“You married Pete?” His sister barely knew the farmer, although it was obvious he’d fallen for her, and fallen hard. Anyone with eyes in his head couldn’t possibly miss that. Linnette had been more circumspect, especially around their parents, but she must’ve felt the same way. “You married him because you could only find one hotel room?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Linnette, that’s insane!”\u003c/p\u003e\n\u003cp\u003e“Now just a minute, little brother. If that’s not calling the kettle black, I don’t know what is.”\u003c/p\u003e\n\u003cp\u003eShe had him there. Mack wanted to argue and tell her she hadn’t known Pete nearly long enough. He wanted to say she had better sense than this. Besides, less than a year ago she’d been crazy in love with Cal Washburn.\u003c/p\u003e\n\u003cp\u003e“You’ve been married a lot longer than Mary Jo and I have been engaged. Why keep it a secret?”\u003c/p\u003e\n\u003cp\u003e“Well…” Linnette exhaled slowly. “I figured Mom and Dad would be disappointed that I hadn’t gone for the big wedding, so Pete and I decided there was no reason to say anything right away. I promised Mom I’d be home this summer, and I thought we could have a second wedding there.”\u003c/p\u003e\n\u003cp\u003e“Why not tell them now? They like Pete. It isn’t like they’re going to be upset about who you married.”\u003c/p\u003e\n\u003cp\u003e“I know,” Linnette agreed. “But I was afraid they’d think I married Pete on the rebound. I didn’t. I genuinely love him and, living so far away, it’s not hard to keep it a secret.”\u003c/p\u003e\n\u003cp\u003e“So that’s what you plan to do? Say nothing and just go ahead with a second wedding?”\u003c/p\u003e\n\u003cp\u003eLinnette sighed deeply. “I haven’t got that part worked out yet. Getting married on the spur of the moment isn’t as simple as it seems.”\u003c/p\u003e\n\u003cp\u003eMack could sympathize.\u003c/p\u003e\n\u003cp\u003e“We’ve been married for almost four months, and Pete keeps asking when I’m going to tell my family. It was so easy to delay it and now…now it’s been so long. Mack, I’m not sure what to do.”\u003c/p\u003e\n\u003cp\u003eMack didn’t have any advice to give her, considering that he’d phoned her with his own troubles, looking for help. “I don’t know, either.”\u003c/p\u003e\n\u003cp\u003e“You’re not upset with us, are you?”\u003c/p\u003e\n\u003cp\u003e“Of course not! I couldn’t be happier for you both.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Mack.”\u003c/p\u003e\n\u003cp\u003e“I’d suggest you tell Mom and Dad soon, though.”\u003c/p\u003e\n\u003cp\u003e“I will…”\u003c/p\u003e\n\u003cp\u003eThey spoke for another ten minutes, and his sister updated him on the medical clinic in the small town where she lived. She told him Pete had moved out of the farmhouse and into Buffalo Valley to be with her. Linnette seemed content, happy with her marriage, her work and her life, and that pleased Mack. In the past few years, she’d changed from an insecure, dissatisfied woman to someone who’d become confident in herself and her choices.\u003c/p\u003e\n\u003cp\u003eAfter the conversation with his sister, Mack went outside, determined to work on his garden. He chose the south side of the house for exposure to the afternoon sun. He started digging, shoveling up lawn and dirt to create new flower beds.\u003c/p\u003e\n\u003cp\u003eThe area would need a load of topsoil and plenty of fertilizer. Mack had big plans for this garden. Although the mid-April weather was still cool, he soon broke out in a sweat. Pausing to take off his shirt, he worked steadily until Mary Jo parked in their shared driveway.\u003c/p\u003e\n\u003cp\u003eMack checked his watch and saw that it was after five. The afternoon, his last afternoon off this week, had sped by. His next shift started at eight tomorrow morning and would last until Saturday. He liked the extended periods of time off this job gave him.\u003c/p\u003e\n\u003cp\u003eAfter removing Noelle from her car seat, Mary Jo walked directly past him as she had every day that week. To his surprise she stopped abruptly and stared at him. Mack waited for her to say something. She didn’t, so he continued digging as tenaciously as if he were inches from a vein of gold.\u003c/p\u003e\n\u003cp\u003e“Hi,” Mary Jo said shyly.\u003c/p\u003e\n\u003cp\u003eMack raised his head and leaned against the shovel, trying to suggest that he’d only just noticed her. “Oh, hi. I didn’t see you there.”\u003c/p\u003e\n\u003cp\u003eShe seemed to be studying him closely. “Something wrong?” he asked. Maybe he had on two different shoes. He generally didn’t care that much about what he wore.\u003c/p\u003e\n\u003cp\u003eMary Jo looked away. “No, sorry, I didn’t mean to stare.”\u003c/p\u003e\n\u003cp\u003e“Have I got mud smeared on my face?”\u003c/p\u003e\n\u003cp\u003e“No.” Her neck had gone a warm shade of pink.\u003c/p\u003e\n\u003cp\u003e“Tell me.”\u003c/p\u003e\n\u003cp\u003eShe appeared even more uneasy. “You look…good. All muscular and tan.”\u003c/p\u003e\n\u003cp\u003eHey, that was promising. “I do?”\u003c/p\u003e\n\u003cp\u003e“I’ve never seen you without a shirt before.”\u003c/p\u003e\n\u003cp\u003e“I am a firefighter, you know. There’s a reason we’re the preferred candidates for those hunk calendars.” He resisted the urge to pump his arm muscles in order to impress her with his prowess—or, more likely, make her laugh.\u003c/p\u003e\n\u003cp\u003eMary Jo smiled at his comment. “Would you like some iced tea?” she asked.\u003c/p\u003e\n\u003cp\u003eThis was definite progress. “I’d love it.”\u003c/p\u003e\n\u003cp\u003e“Okay if I leave Noelle here? I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eMack gazed down at the sleeping infant in her carrier, then watched as Mary Jo headed for her half of the duplex. Still leaning against the shovel handle, he studied her from behind and cursed himself for ever agreeing to this six-month engagement. He wanted to marry her.\u003c/p\u003e\n\u003cp\u003eFive minutes later, she reappeared with a glass of iced tea. Mack gratefully accepted it and drank the whole glass in one extended swallow.\u003c/p\u003e\n\u003cp\u003e“You were thirsty.”\u003c/p\u003e\n\u003cp\u003e“I was,” he said and noticed once again that she had a hard time keeping her eyes off him. Good. He wanted her to feel this sense of deprivation as strongly as he did. Mack decided then and there to see if he could get her to reconsider. “Could we talk?”\u003c/p\u003e\n\u003cp\u003e“Sure,” she said, backing away from him. “About anything in particular?”\u003c/p\u003e\n\u003cp\u003eOh, yes, but Mack thought he’d approach the subject carefully. “Maybe we should discuss this inside.”\u003c/p\u003e\n\u003cp\u003e“Fine.” She picked up the baby carrier and led the way into her duplex.\u003c/p\u003e\n\u003cp\u003eMack followed dutifully. He pulled out a chair at the small kitchen table and waited as she brought Noelle to her room. When she returned, she rinsed his glass and poured him another one.\u003c/p\u003e\n\u003cp\u003e“About our engagement,” he finally said.\u003c/p\u003e\n\u003cp\u003eMary Jo whirled around, her back against the kitchen counter and her hands behind her. “Yes—what about it?”\u003c/p\u003e\n\u003cp\u003e“I feel we might want to rethink—”\u003c/p\u003e\n\u003cp\u003eShe bristled. “If you want to back out, I understand, really I do. You’re under no obligation to marry me. I haven’t heard from David in two weeks now, so maybe he’s given up. But I appreciate how much you care about Noelle and—”\u003c/p\u003e\n\u003cp\u003e“Who said anything about backing out?” he asked, letting his irritation show.\u003c/p\u003e\n\u003cp\u003eShe frowned. “I thought—you know…”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I don’t know.”\u003c/p\u003e\n\u003cp\u003e“That…” she said, moistening her lips. “That you’d had a change of heart.”\u003c/p\u003e\n\u003cp\u003e“I didn’t.”\u003c/p\u003e\n\u003cp\u003e“But you want to talk about the engagement?”\u003c/p\u003e\n\u003cp\u003e“Well, yes.” The only thing Mack felt he could do was be honest. “Frankly, ever since we got engaged you’ve been avoiding me.” Some engagement, he wanted to say.\u003c/p\u003e\n\u003cp\u003e“No, I haven’t,” she said swiftly. “You were the one who didn’t want anything to do with me. You stopped coming over as soon as we got engaged!”\u003c/p\u003e\n\u003cp\u003eThey could argue about it all night and it wouldn’t settle anything. “If I gave you that impression, then I apologize,” Mack said.\u003c/p\u003e\n\u003cp\u003eShe offered him the merest hint of a smile. “I guess we’ve both been silly, haven’t we?”\u003c/p\u003e\n\u003cp\u003eThat was an understatement if he’d ever heard one.\u003c/p\u003e\n\u003cp\u003e“I know you weren’t happy when I insisted on a six-month engagement.”\u003c/p\u003e\n\u003cp\u003e“I can live with that,” Mack said. “It was the fact that you didn’t want me to touch you at all during that time.”\u003c/p\u003e\n\u003cp\u003eDoubt flickered in her eyes. “I didn’t say you couldn’t touch me…. I just don’t feel it’s wise for us to be…intimate.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Mack wondered if he’d misread the situation. But if she was interested in, say, a kiss or a hug, she might have given him some indication earlier.\u003c/p\u003e\n\u003cp\u003eThe shyness was back. Mary Jo started to turn away and he caught her hand, stopping her. His fingers curled around hers. When she turned toward him, Mary Jo slid effortlessly into his embrace as if she’d been waiting her entire life for exactly this moment.\u003c/p\u003e\n\u003cp\u003eThey kissed—two or three lengthy kisses. Not until they’d exchanged another heated kiss did he find the strength to ease his mouth from hers.\u003c/p\u003e\n\u003cp\u003eMary Jo looked up at him, eyes wide. Slowly, ever so slowly, she smiled. “That was very nice.” \u003c/p\u003e","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-43.html","bookId":1951,"creation":"Oct 5, 2019 10:09:11 AM","modification":"Oct 5, 2019 10:09:11 AM"}
