{"id":68430,"no":6,"title":"Page 6","content":"\u003cp\u003eChristie didn’t have an explanation for that. All right, so maybe she wasn’t as strong as she thought.\u003c/p\u003e\n\u003cp\u003e“You’re drinking?”\u003c/p\u003e\n\u003cp\u003e“A few beers. Don’t worry, I didn’t get drunk.” Although she’d downed enough alcohol to leave her with a killer headache. She figured the booze had affected her like this because she hadn’t been drinking much lately.\u003c/p\u003e\n\u003cp\u003e“You were too drunk to drive.”\u003c/p\u003e\n\u003cp\u003eChristie denied that. She wasn’t stupid; she knew her limit.\u003c/p\u003e\n\u003cp\u003eTeri didn’t seem to believe her. “Then why is your car at the Pink Poodle?”\u003c/p\u003e\n\u003cp\u003e“It wouldn’t start.” Christie didn’t want to think about that piece of junk. Every day the engine fired to life was a day to be grateful for.\u003c/p\u003e\n\u003cp\u003eA few months ago, James had managed to jury-rig it into running again but there were too many things wrong with her sad excuse for a car.\u003c/p\u003e\n\u003cp\u003e“How’d you get home?”\u003c/p\u003e\n\u003cp\u003e“Someone gave me a ride.”\u003c/p\u003e\n\u003cp\u003eTeri’s gaze shot toward the bedroom.\u003c/p\u003e\n\u003cp\u003e“No one spent the night, if that’s what you’re wondering.”\u003c/p\u003e\n\u003cp\u003eTeri had the good grace to look a little embarrassed. “But it wouldn’t be the first time if someone did,” she muttered.\u003c/p\u003e\n\u003cp\u003eChristie couldn’t argue with that. When it came to men she was batting zero. As Teri had once said, Christie attracted losers the way an ice cream truck attracts children. Not that Teri should talk; she’d been fortunate enough to break the pattern of harmful and unfulfilling relationships when she met Bobby. Christie had been so sure that James was her Bobby…. He wasn’t.\u003c/p\u003e\n\u003cp\u003eTeri drank some of her tea and sent Christie a smile. “I’m glad you weren’t alone over Christmas.”\u003c/p\u003e\n\u003cp\u003e“I am, too. It helped, you know?” Christie took a tentative sip of coffee.\u003c/p\u003e\n\u003cp\u003e“I know,” Teri said.\u003c/p\u003e\n\u003cp\u003e“Instead of sitting home and feeling sorry for myself, I took the initiative and did something for someone else.”\u003c/p\u003e\n\u003cp\u003eTeri didn’t appear to be completely mollified. “You could’ve spent the day with Bobby and me. Johnny was there, and Mom came by. I wish you’d been there, too,” she added plaintively.\u003c/p\u003e\n\u003cp\u003eIn retrospect it probably wouldn’t have hurt to make a token appearance. “How is Mom?” she asked, hoping to distract her sister.\u003c/p\u003e\n\u003cp\u003e“She’s filed for divorce.”\u003c/p\u003e\n\u003cp\u003e“Again?”\u003c/p\u003e\n\u003cp\u003eChristie had lost count of how many stepdads and “uncles” she’d accumulated through the years. “I don’t understand why she marries these guys.” She had to be on her fifth or sixth husband. Christie had stopped making an effort to remember their names; they never seemed to last long enough to bother. The fact was, she hadn’t seen her mother in more than a year.\u003c/p\u003e\n\u003cp\u003e“I don’t know why she marries them, either,” Teri said. “At least she didn’t get bombed this time. Maybe because what’s-his-name wasn’t there.”\u003c/p\u003e\n\u003cp\u003e“Did Bobby put her purse by the front door again?”\u003c/p\u003e\n\u003cp\u003eTeri grinned at the memory. As Christie recalled, her mother had vowed never to return. That vow, like every other one she’d made through the years, had turned out to be meaningless.\u003c/p\u003e\n\u003cp\u003e“I think Bobby was tempted to show Mom the door, but for my sake he restrained himself.”\u003c/p\u003e\n\u003cp\u003e“He’s a good man.”\u003c/p\u003e\n\u003cp\u003eHer sister’s eyes softened. “He is,” she agreed.\u003c/p\u003e\n\u003cp\u003e“How’s Johnny doing?” Their little brother held a special place in Christie’s heart. Between them, the two sisters had practically raised him.\u003c/p\u003e\n\u003cp\u003eChristie was as proud as any mother when Johnny was accepted into the University of Washington. Having Bobby Polgar as a brother-in-law hadn’t hurt. Teri had never said as much, but it didn’t take a college degree to add two and two. Johnny never could have afforded the tuition and other expenses on his own, and there hadn’t been any scholarships.\u003c/p\u003e\n\u003cp\u003e“He made the dean’s list.”\u003c/p\u003e\n\u003cp\u003e“I’m thrilled for him!” She’d have to call Johnny soon, congratulate him.\u003c/p\u003e\n\u003cp\u003e“Me, too.” Teri sipped her tea. “I’ve been worried about you.”\u003c/p\u003e\n\u003cp\u003e“I know.” Christie’s declarations of strength and independence were a lot of bravado. Spending Friday night at the Pink Poodle was testament to that. Waking up with a hangover wasn’t the way she wanted to live the rest of her life. It wasn’t the way she intended to live it, either.\u003c/p\u003e\n\u003cp\u003e“You know what I was thinking?” Christie said a bit sheepishly, half afraid Teri would laugh.\u003c/p\u003e\n\u003cp\u003e“No, tell me.”\u003c/p\u003e\n\u003cp\u003eShe gave a self-conscious shrug. “I handed out charity baskets with that group from the Methodist church at Christmas.”\u003c/p\u003e\n\u003cp\u003e“Yes, you mentioned that.”\u003c/p\u003e\n\u003cp\u003e“They were nice people.”\u003c/p\u003e\n\u003cp\u003eTeri laughed. “Don’t sound so surprised.”\u003c/p\u003e\n\u003cp\u003eActually, she was. Christie had expected those church people to make some comment about her lifestyle. Instead, everyone was friendly and welcoming. She hadn’t been back, although she wasn’t sure why.\u003c/p\u003e\n\u003cp\u003e“I’m going to go to church.” Having said as much, Christie held her breath and waited for Teri’s reaction.\u003c/p\u003e\n\u003cp\u003e“Why do you say it like that?” Teri asked in a puzzled voice.\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Like you’re standing up at an AA meeting and making a confession. Lots of people attend church, you know.”\u003c/p\u003e\n\u003cp\u003e“What about you?”\u003c/p\u003e\n\u003cp\u003e“I go every now and then, and I always feel good afterward. I don’t have anything against going to church and you shouldn’t, either.”\u003c/p\u003e\n\u003cp\u003e“I want to live a better life,” Christie said, remembering how she’d felt when she was delivering the charity baskets. Instead of being so self-absorbed, so consumed by her own loss, she’d reached out to help others less fortunate.\u003c/p\u003e\n\u003cp\u003e“That’s what I want, too,” Teri echoed. “A better life than our mother’s, a better life for my child…er, children.” Teri grinned as she said it.\u003c/p\u003e\n\u003cp\u003e“Pastor Flemming wrote a note to thank me for volunteering,” Christie said. The letter sat on the kitchen counter and she picked it up. When it first arrived, she’d been feeling depressed and had given it a cursory glance. The only thing she remembered was something about a backpack program sponsored by the church. She decided to find out what that was.\u003c/p\u003e\n\u003cp\u003e“Will you come to church with me on Sunday?” Christie asked.\u003c/p\u003e\n\u003cp\u003eTeri didn’t even hesitate. “Of course.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“I’d get up and hug you,” Teri said, “but I’m too comfortable where I am.”\u003c/p\u003e\n\u003cp\u003eChristie laughed and stretched out a hand to clasp her sister’s.\u003c/p\u003e\n\u003cp\u003eFive\u003c/p\u003e\n\u003cp\u003eSheriff Troy Davis closed the file concerning the break-in at Faith’s home. Unfortunately, there’d been no progress, and he felt he should deliver the disappointing news in person. As he drove his patrol car toward Rosewood Lane, he reviewed the little he knew about the situation.\u003c/p\u003e\n\u003cp\u003eHe’d spoken to his lead detective regarding the break and enter. Detective Hildebrand had assured Troy that his staff had done everything that could be done—the neighbors had been interviewed, and comparisons made with similar crimes in Cedar Cove and in nearby jurisdictions.\u003c/p\u003e\n\u003cp\u003eInstead of letting Hildebrand or his assistant call or visit Faith, he’d stepped in and volunteered to do it. She was, after all, his friend. Or at least, she had been. Mostly this visit was prompted by Troy’s need to see how Faith was faring after the break-in.\u003c/p\u003e\n\u003cp\u003eWhen he’d parked in front of the house, he didn’t leave the car immediately, mentally preparing himself for the meeting. He knew that seeing her would be hard. Faith had made it clear that she didn’t want any further contact and he’d respected her wishes. This, however, was official business—even if it didn’t have to be his business.\u003c/p\u003e\n\u003cp\u003eHe marched up the steps leading to her front door, rang the bell and waited, hat in his hand.\u003c/p\u003e\n\u003cp\u003eShe answered the door cautiously, and her eyes brightened when she saw him. That spark was quickly gone, however, replaced by a faraway look, flat and emotionless. In that moment, it demanded all his discipline not to pull her into his arms and beg for another chance. He needed Faith, loved her, wanted to marry her—and had destroyed any possibility of that happening.\u003c/p\u003e\n\u003cp\u003e“I have the report from the investigating officer,” Troy said briskly, conveying that this was police business and not a social call.\u003c/p\u003e\n\u003cp\u003e“Oh, good.” She unlocked the screen door and held it open for him to come inside.\u003c/p\u003e\n\u003cp\u003eTroy paused to examine the lock and was relieved to see that Faith had taken his advice and installed a dead bolt. Or rather, Grace and Cliff Harding, the owners, had arranged for it. Not surprisingly, Grace had been horrified by what she’d seen. This had been her home for decades—and Faith was her friend. Megan had told him that both Grace and Cliff had helped with the cleanup.\u003c/p\u003e\n\u003cp\u003eThe house was tidy once again and back to normal. That couldn’t have been an easy task. The aroma of baking reminded him that he’d worked through his lunch hour.\u003c/p\u003e\n\u003cp\u003e“I just took some bran muffins out of the oven. Would you like one?” Faith asked.\u003c/p\u003e\n\u003cp\u003eIt’d been a long time since Troy had tasted anything home-baked. He wondered if she offered because she’d heard his stomach growl or if she’d noticed that he’d nearly swooned when he entered the house. Or maybe she was simply being polite. Whatever the reason, he wasn’t about to turn her down. “That’d be great,” he said, hoping he sounded casual.\u003c/p\u003e\n\u003cp\u003e“I have coffee on, too. Can I get you a cup?”\u003c/p\u003e\n\u003cp\u003e“Please.” He followed her into the kitchen and watched as she poured the coffee and took a muffin out of the pan, setting it on a small plate. He waited until she was seated before he pulled out the chair across from her. It seemed to take her an inordinate amount of time to look at him. One quick glance in his direction, and then she lowered her eyes again.\u003c/p\u003e\n\u003cp\u003e“What did you find out?” she asked, folding her hands neatly in her lap.\u003c/p\u003e\n\u003cp\u003eTroy wished he had something positive to share with her. “Unfortunately, the news is…inconclusive.”\u003c/p\u003e\n\u003cp\u003e“What do you mean? Your people were here for hours, dusting for fingerprints. They wouldn’t let me straighten a thing until they’d finished. The deputy said they managed to lift a number of solid prints.” Her eyes pleaded with him to explain this nightmare. Troy wished he could; he wanted to prove to Faith that he was her hero…and that she could trust him.\u003c/p\u003e\n\u003cp\u003e“You’re right. The crime-scene technician was able to lift a number of fingerprints.”\u003c/p\u003e\n\u003cp\u003e“But they were all mine?”\u003c/p\u003e\n\u003cp\u003e“No,” he said. “Not all of them. But the clear ones weren’t out of the ordinary. That’s why we took the elimination prints.” He shrugged. “We suspect the intruder wore rubber gloves.”\u003c/p\u003e\n\u003cp\u003eShe looked confused. “A professional, then.”\u003c/p\u003e\n\u003cp\u003e“At this point, we can’t say. My guess is this isn’t the first home this person has broken into.”\u003c/p\u003e\n\u003cp\u003eHer shoulders sagged. “I’d hoped—I was sure with so many prints…there’d be at least one that would identify whoever did this.” \u003c/p\u003e","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-6.html","bookId":1951,"creation":"Oct 5, 2019 10:09:11 AM","modification":"Oct 5, 2019 10:09:11 AM"}
