{"id":110526,"no":2,"title":"Page 2","content":"\u003cp\u003eVI\u003c/p\u003e\n\u003cp\u003eMortimer awoke naked and shivering. The girl lay on the pallet ten feet away, her legs in the air, dress up past her waist. She whimpered, her head back, glassy eyes fixed on the ceiling. A big man, maybe a full foot taller than Mortimer, grunted and heaved on top of her, thrusting mercilessly and without grace. His jeans bunched around his ankles. He wore some kind of coarse, black fur coat that made him appear like a prehistoric beast.\u003c/p\u003e\n\u003cp\u003eMortimer twisted. His head swam. He was bound at the wrists and ankles with thin twine. He writhed, strained against his bonds. No good. The beast continued to thrust. Mortimer tried to sort out what had happened. He\u0027d been hit from behind. He\u0027d been too stupid and eager, let his guard down.\u003c/p\u003e\n\u003cp\u003eThe Beast shuddered and howled, then pulled out of the girl with a nasty wet sound. He was flushed and sweating, rolled off her and reached for something. It was one of Mortimer\u0027s bottles, Johnnie Walker, half full. The Beast took a swig, wiped and smacked his lips. His black shaggy hair and beard matched his coat except for the gray at his temples and the corners of his mouth.\u003c/p\u003e\n\u003cp\u003eThe Beast saw Mortimer, grinned, slugged back another hit of Johnnie Walker. \"Well, well. Santa Claus is awake.\" He toasted Mortimer with the bottle. \"Thanks for the goodies, Santa.\" Another thick gulp.\u003c/p\u003e\n\u003cp\u003eThe girl was already curling into the corner, smoothing the dress back over her thighs. Her face was as blank and white and distant as the moon.\u003c/p\u003e\n\u003cp\u003eThe Beast lurched to his feet, reaching for his jeans, his rapidly deflating pecker and balls swinging in a salt-and-pepper thatch. \"I\u0027m glad you\u0027re awake. Got some questions for you.\" He fastened his pants, drank more whiskey and nudged the girl\u0027s ass with his boot heel. \"Sheila.\"\u003c/p\u003e\n\u003cp\u003eShe turned her head toward him. Her eyes remained unfocused.\u003c/p\u003e\n\u003cp\u003e\"Food.\"\u003c/p\u003e\n\u003cp\u003eShe nodded once, got to her feet and went away.\u003c/p\u003e\n\u003cp\u003eThe Beast turned his mad grin back at Mortimer. \"Now we have a chat.\" He stepped forward, stood directly over Mortimer. The reek off of the Beast was formidable, a yeasty, pungent cologne of sweat and grease and sex. He shook the bottle of Johnnie Walker in Mortimer\u0027s face. \"Any more where this came from?\" His eyes gleamed like wet, black river stones.\u003c/p\u003e\n\u003cp\u003eMortimer said nothing, eyes wide and round and waiting.\u003c/p\u003e\n\u003cp\u003eThe Beast chuckled from deep in his throat and drank the rest of the Johnnie Walker, hiccupped and belched. He squatted next to Mortimer, sniffed. \"You smell like soap, and you look clean.\"\u003c/p\u003e\n\u003cp\u003eYou smell like a turd covered in feta. Mortimer tried twisting out of his bonds again.\u003c/p\u003e\n\u003cp\u003e\"You down from Knoxville? I hear they got power on in Knoxville, but I thought it was just talk.\"\u003c/p\u003e\n\u003cp\u003eMortimer now recognized the Beast\u0027s black coat as a bear skin. Mortimer remained silent. This was not defiance. Don\u0027t provoke the scary man.\u003c/p\u003e\n\u003cp\u003eThe Beast tossed the bottle over his shoulder, and it clinked and tumbled without breaking. \"Cat got your tongue, huh?\" He unzipped his pants, fished inside and came out with his pecker. He leaned, grunted and squirted, the piss splashing against Mortimer\u0027s face.\u003c/p\u003e\n\u003cp\u003eMortimer sputtered and coughed. The piss was warm. An ammonia taste. It stung his eyes. He gagged, stopped short of vomiting.\u003c/p\u003e\n\u003cp\u003eThe Beast laughed. \"Drink up, beautiful.\" He shook off his pecker, zipped up and left the room.\u003c/p\u003e\n\u003cp\u003eOnce the piss cooled on his skin, Mortimer shivered.\u003c/p\u003e\n\u003cp\u003eThe Beast returned and squatted next to him. He held the bubble wrap that Mortimer had used to protect the whiskey. He held it close to Mortimer\u0027s face, turned it over. Mortimer didn\u0027t understand what he was supposed to see.\u003c/p\u003e\n\u003cp\u003e\"You taped this,\" the Beast said.\u003c/p\u003e\n\u003cp\u003eMortimer frowned. \"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"You fucking taped it?\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003eThe Beast\u0027s hammy hand swatted Mortimer\u0027s cheek, the slap loud and sharp. A thousand hot needles in Mortimer\u0027s skin.\u003c/p\u003e\n\u003cp\u003e\"Where the fuck did you get Scotch tape, dipshit?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eAnother quick slap from the Beast, and Mortimer yelled. Ringing in his ears.\u003c/p\u003e\n\u003cp\u003e\"You gonna tell me you just went down to the Walgreens and picked up some goddamn Scotch tape?\"\u003c/p\u003e\n\u003cp\u003eIt clicked in Mortimer\u0027s head, a realization sliding into place, the slow understanding. Where the hell did you get Scotch tape after the apocalypse? Something so commonplace, but who would make more? Scotch tape and underarm deodorant and hairspray and antacid and toothpaste and aluminum foil and dishwashing liquid and roach spray and all of civilization\u0027s bright conveniences. Would anyone ever make those things again?\u003c/p\u003e\n\u003cp\u003e\"I found the tape in an old house,\" Mortimer said. \"I was scavenging, and I found it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, ain\u0027t you just the luckiest goddamn scavenger ever.\" The Beast made a noise in his throat, then spit in Mortimer\u0027s face. \"You found tape and ammunition for both your guns and food and whiskey and...and fucking bubble wrap?\" He stood, kicked Mortimer hard in the gut.\u003c/p\u003e\n\u003cp\u003eThis time Mortimer did vomit. He rolled his face toward the floor and heaved once, twice. The third time brought up bile.\u003c/p\u003e\n\u003cp\u003e\"Tell me where you got this stuff,\" the Beast said.\u003c/p\u003e\n\u003cp\u003e\"I...I found it.\"\u003c/p\u003e\n\u003cp\u003e\"You found it, huh?\"\u003c/p\u003e\n\u003cp\u003eThe Beast stomped the heel of his boot into Mortimer\u0027s forehead. Mortimer grunted.\u003c/p\u003e\n\u003cp\u003e\"I know you fucking found it, cocksucker. Now tell me where.\"\u003c/p\u003e\n\u003cp\u003eMortimer shook his head. \"A long way from here. I\u0027ve been gathering it up, saving it.\"\u003c/p\u003e\n\u003cp\u003e\"Bullshit.\" The Beast lifted him a foot off the floor by a fistful of hair. \"Nobody carries that much food and booze and doesn\u0027t eat and drink it. What? You just like lugging it around?\" He brought his other fist down hard, knocked Mortimer\u0027s head around.\u003c/p\u003e\n\u003cp\u003eMortimer blinked, colored lights dancing in front of his eyes and a hot buzz in his ears. He tried to curl into a ball, but the Beast still held him fast.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027d you get it? Someplace close, right?\"\u003c/p\u003e\n\u003cp\u003eMortimer shook his head.\u003c/p\u003e\n\u003cp\u003eThe Beast punched again, and Mortimer felt his lips flatten against his teeth, skin ripping. He spit blood, coughed.\u003c/p\u003e\n\u003cp\u003e\"Shit.\" The Beast let go, and Mortimer\u0027s head knocked against the floor. The Beast left the room again.\u003c/p\u003e\n\u003cp\u003eMortimer lay on the cold floor, reeking of piss, face throbbing. This had been a mistake, coming down the mountain, trying to reconnect with whatever remained below. He\u0027d been safe, comfortable. There had been no need to leave his sanctuary, only the imagined necessity of human companionship, only the vain notion that he must know what had become of the world.\u003c/p\u003e\n\u003cp\u003eThe world had broken, and there was nothing left of humanity but the dregs, dumb sons of bitches in bear skin.\u003c/p\u003e\n\u003cp\u003eMortimer opened a swollen eye, saw the girl standing over him, her face expressionless.\u003c/p\u003e\n\u003cp\u003e\"Help me,\" Mortimer pleaded.\u003c/p\u003e\n\u003cp\u003eShe stood frozen.\u003c/p\u003e\n\u003cp\u003e\"Untie me,\" he croaked. \"I\u0027ll go away. I won\u0027t do anything, I promise. I\u0027ll just go.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t say a word, didn\u0027t blink. A few moments later she started at the Beast\u0027s return and slunk away.\u003c/p\u003e\n\u003cp\u003eThe Beast knelt next to Mortimer, held up a gleaming bowie knife. \"Like it? It ain\u0027t quite as sharp as I\u0027d like, so the cut won\u0027t be clean. I\u0027ll have to saw a bit.\" He grabbed Mortimer\u0027s bound hands, pulled them close to his thick body.\u003c/p\u003e\n\u003cp\u003eMortimer gasped, tried to jerk away.\u003c/p\u003e\n\u003cp\u003eThe Beast shifted, pinned Mortimer\u0027s wrists under his arm. Mortimer tried to squirm away. The Beast selected the pinkie finger on Mortimer\u0027s left hand, stretched it out. Mortimer tried to make a fist and pull away, but the Beast was too strong.\u003c/p\u003e\n\u003cp\u003e\"P-please.\" Saliva flew from Mortimer\u0027s lips. He shook so badly he couldn\u0027t talk.\u003c/p\u003e\n\u003cp\u003e\"I think we\u0027re gonna have a more productive conversation after this.\" The Beast put the blade against the finger. Mortimer renewed his struggles, but the Beast held him.\u003c/p\u003e\n\u003cp\u003e\"Here we go.\" The blade bit deep, dark blood flowing over the metal.\u003c/p\u003e\n\u003cp\u003eMortimer howled, kicked, screamed. The Beast sawed the blade back and forth. So much blood. Within ten seconds he was down to bone. The Beast leaned his weight into it, sawed bone. The finger came off, blood squirting over both of them.\u003c/p\u003e\n\u003cp\u003eMortimer lay covered in sweat, limp in the Beast\u0027s lap, like a spent lover deep in swoon. The Beast splashed water on Mortimer\u0027s face, shook him until he woke.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" the Beast said. \"Let\u0027s take it from the top.\"\u003c/p\u003e\n\u003cp\u003eVII\u003c/p\u003e\n\u003cp\u003eThe Beast led Mortimer on an eight-foot length of thin rope back down the road toward the entrance of the pocket wilderness. The girl walked silently behind them like the dead, wagless tail of an old dog.\u003c/p\u003e\n\u003cp\u003eMortimer had lain on the office floor of the dilapidated firehouse and told the Beast all, his secret cabin and the cavern and his storehouse of old-world commodities. The Beast demanded to be taken there. Mortimer had agreed, lying there bleeding and weak.\u003c/p\u003e\n\u003cp\u003eBut now, treading the frozen road, Mortimer burned with hate and humiliation and plotted the Beast\u0027s demise. The wind tore at his eyes, face and ankles. A six-foot length of hickory lay across his neck, his wrists tied to the wood in crucifixion fashion. He wore his boots and his pants and shirt. The Beast had taken his parka and socks, marched in front of him holding the rope in one hand, the police special in the other.\u003c/p\u003e\n\u003cp\u003eThe Beast wore his bear skin over the parka, and walking along the road, Mortimer on the leash, they looked the grotesque reverse of some old-west traveling carnival act, the dancing bear leading his trainer. Mortimer desperately looked for his opening but did not expect one. He\u0027d have to make some kind of move before they reached the cavern. The Beast would not want to keep and feed Mortimer after he\u0027d been led to the stash.\u003c/p\u003e\n\u003cp\u003eEven in the worst throes of torture, Mortimer had kept his weapons stash a secret. Somehow he\u0027d make a break for it or maybe fake needing to take a shit. If Mortimer could just get his hands on the Uzi, he\u0027d chop the Beast in half with a spray of nine millimeter.\u003c/p\u003e\n\u003cp\u003eThey had taken Mortimer\u0027s medical kit too, the iodine and hydrogen peroxide and bandages. They\u0027d used none of it to bind Mortimer\u0027s mangled hand. The girl had splashed the wound with dirty water, wrapped the finger stump in a tattered pink rag. His hand throbbed but bothered him less than the biting cold. He staggered and shook and lurched forward at the Beast\u0027s insistent yank on the rope.\u003c/p\u003e\n\u003cp\u003eMortimer took another fifty steps, shivered and collapsed.\u003c/p\u003e\n\u003cp\u003e\"Get up.\" The Beast yanked the leash.\u003c/p\u003e\n\u003cp\u003eMortimer shook his head, panted. He didn\u0027t have the energy to form words.\u003c/p\u003e\n\u003cp\u003eThe Beast took two quick steps toward Mortimer, then kicked hard, caught Mortimer in the ribs. Mortimer wheezed and heaved dry.\u003c/p\u003e\n\u003cp\u003e\"I said get up.\" The Beast drew his leg back for another kick.\u003c/p\u003e\n\u003cp\u003e\"Stop.\"\u003c/p\u003e\n\u003cp\u003eThe Beast froze, looked for the source of the new voice, which had echoed along the mountain road. Mortimer looked up too. What now?\u003c/p\u003e\n\u003cp\u003e\"Show yourself!\" the Beast yelled.\u003c/p\u003e\n\u003cp\u003eForty yards up the road, a man stepped out of the bushes, planted himself in the center of the road, legs apart. Mortimer blinked, not sure if he was seeing right. The newcomer wore a black cowboy hat, long leather coat swept back to reveal a pair of pistols hanging on his hips. A blue bandana pulled loose around his neck. A forked beard yellow as the sun, long hair the same color, hands hovering dangerously over the pistols.\u003c/p\u003e\n\u003cp\u003eThe Beast squinted. \"What the fuck are you?\"\u003c/p\u003e\n\u003cp\u003e\"Cut that man loose,\" ordered the cowboy.\u003c/p\u003e\n\u003cp\u003e\"Kiss my ass.\" But the Beast\u0027s eyes flicked to the man\u0027s twin six-shooters.\u003c/p\u003e\n\u003cp\u003e\"Mister, I\u0027m gonna tell you just one more time.\" He eased forward as he spoke, one deliberate step at a time. \"Let that man go and piss off. That\u0027s your only chance to live.\"\u003c/p\u003e\n\u003cp\u003eThe Beast dropped to the ground, rolled, came up behind Mortimer in a kneeling position. He grabbed Mortimer\u0027s face and pulled him close until the two were cheek to cheek. He pulled the police special, put it against Mortimer\u0027s head. \"I don\u0027t know what your interest is in this guy, but I\u0027ll splatter his brains all over the mountain if you don\u0027t stop right there.\" With his arms spread along the length of hickory, Mortimer provided good cover. Only half the Beast\u0027s face and a bit of shoulder showed.\u003c/p\u003e\n\u003cp\u003eThe cowboy froze. He squeezed his fists so tight, Mortimer heard the knuckles crack. They all waited for something to happen.\u003c/p\u003e\n\u003cp\u003eA split second later it did.\u003c/p\u003e\n\u003cp\u003eThe cowboy dropped into a kneeling position, one six-shooter flashing from its holster. His arm shot out straight, and he sighted along the barrel, one eye mashed closed, biting his lip in concentration. It all happened in a heartbeat.\u003c/p\u003e\n\u003cp\u003eBang.\u003c/p\u003e\n\u003cp\u003eThe Beast screamed, a high-pitched mix of surprise and pain. He stood, staggered, blood trailing from his shoulder. He swung the police special to return fire.\u003c/p\u003e\n\u003cp\u003eThe cowboy was already on his feet. He fanned the six-shooter\u0027s hammer twice, and the Beast fell dead in front of Mortimer. Blood pooled in the Beast\u0027s empty eye sockets.\u003c/p\u003e\n\u003cp\u003eThe girl, Sheila, who\u0027d been twenty paces behind the whole encounter, turned and screamed back up the road and out of sight.\u003c/p\u003e\n\u003cp\u003eThe cowboy trotted to Mortimer and knelt next to him, began to untie his wrists. \"Hold on, mister. We\u0027ll get you free shortly.\" He had a yellow handlebar moustache to go with the forked beard.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" Mortimer said. \"Who are you?\"\u003c/p\u003e\n\u003cp\u003eA smile across the young face, under thirty years old. \"Who do I look like?\"\u003c/p\u003e\n\u003cp\u003e\"George Custer.\"\u003c/p\u003e\n\u003cp\u003eThe smile fell. \"Damn. I was going for Buffalo Bill.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/go-go-girls-of-the-apocalypse/page-2.html","bookId":1578,"creation":"Oct 6, 2019 12:01:17 AM","modification":"Oct 6, 2019 12:01:17 AM"}
