{"id":110547,"no":23,"title":"Page 23","content":"\u003cp\u003eTyler didn\u0027t slow down, aimed the Cooper at a narrow opening between a brick house and a wooden fence.\u003c/p\u003e\n\u003cp\u003eMortimer tensed. \"We won\u0027t fit. Turn it around. We won\u0027t fit.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll fit, God damn it!\" Tyler\u0027s grip on the wheel was iron, her whole face clenched and covered with sweat.\u003c/p\u003e\n\u003cp\u003eThey flew up the driveway, across the yard and through the gap, each side clearing by less than an inch. Mortimer looked back, expecting the much wider Mustang to slam on the brakes.\u003c/p\u003e\n\u003cp\u003eThe muscle car exploded through the fence, splintered planks sailing in every direction.\u003c/p\u003e\n\u003cp\u003eThe Cooper scooted across the backyard, the Mustang gunning its engines behind, plowing jagged grooves into the soft lawn, kicking up dirt. The Cooper crossed over an already-down chain-link fence into the neighboring yard, dodging debris. The Mustang collided with patio furniture behind them, disintegrated ceramic pots, scattered pieces of a plastic swing set.\u003c/p\u003e\n\u003cp\u003eMortimer emerged from the moonroof long enough to blaze half a magazine at the pursuer, bullets ricocheting in a shower of sparks. Tyler drove through a side yard, raced down another driveway and into a different cul-de-sac. Tyler stomped the gas.\u003c/p\u003e\n\u003cp\u003eA machine-gun burst from the Mustang shredded the Cooper\u0027s back right tire. The car skidded into a drainage ditch at full speed; the front end smashed into a telephone pole with a pop-crunch. This time Mortimer did fly, headfirst, forward and at an angle over the passenger side. He tried to roll with it, landing on grass and ending in a tangle of shrubbery.\u003c/p\u003e\n\u003cp\u003eHe looked back, saw the Mustang rolling slowly, coming to a stop forty feet from the Cooper\u0027s rear bumper. It sputtered and conked out. There was a long moment of silence. Then the Mustang tried to crank the engine. It wouldn\u0027t turn over. It cranked again. Nothing.\u003c/p\u003e\n\u003cp\u003eMortimer spotted where he\u0027d dropped the H \u0026amp;K five feet away. He belly-crawled toward it through the grass, wincing at his sprained knee. He had minor cuts and bruises along his whole body. Forget it. Go for the gun.\u003c/p\u003e\n\u003cp\u003eThe muscle car tried to crank one more time, and when it didn\u0027t, both Red Stripes climbed out, leveled their guns just as Mortimer reached the H \u0026amp;K. He pointed it with one hand, squeezed the trigger, let off two small bursts. He missed high, but sent the Red Stripes ducking behind the open car doors. Mortimer fired one more burst before the gun clicked empty. He felt at his belt for a fresh magazine, couldn\u0027t find one.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eSheila rose through the moonroof, hair disheveled, bright blood streaming from her nose. She lifted her.45 automatic, fired five times fast.\u003c/p\u003e\n\u003cp\u003eThey all heard the high-pitched revving of another car at the end of the street, accelerating, approaching fast. Machine-gun fire. The two Red Stripes looked at each other, turned and abandoned the Mustang, running full speed back among the houses. A second later, another MINI Cooper screeched to a stop next to the Mustang. A familiar face and a familiar blue Union officer\u0027s hat stuck through the moonroof.\u003c/p\u003e\n\u003cp\u003e\"Over here.\" Mortimer stood and waved.\u003c/p\u003e\n\u003cp\u003e\"You okay?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Mortimer limped to the other Cooper. The knee sprain was minor. He bent to look into the driver\u0027s-side window. The kid behind the wheel was eighteen, twenty at most, red hair, freckles, buckteeth and leather driving gloves. \"You Jimmy?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir. What happened?\"\u003c/p\u003e\n\u003cp\u003eMortimer shook his head. \"They just stopped. Maybe they threw a rod.\" Mortimer didn\u0027t exactly know what that meant, but he\u0027d heard gearheads say it.\u003c/p\u003e\n\u003cp\u003eHe limped to the Mustang, slid in behind the wheel. The interior smelled like beer and cigarettes. Mortimer turned the key in the ignition. The engine wheezed and strained but wouldn\u0027t turn over. He checked the gas gauge. The needle was square on the E.\u003c/p\u003e\n\u003cp\u003eHe limped back to Jimmy\u0027s Cooper. \"Can you get the rest of the battle on the radio?\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t do it,\" Jimmy said. \"I\u0027m only rigged to hear the boss and the rest of the cars in my group. Group leaders get all the frequencies. You\u0027ll have to use Tyler\u0027s radio.\"\u003c/p\u003e\n\u003cp\u003eMortimer went back to the wrecked Cooper, opened the driver\u0027s-side door.\u003c/p\u003e\n\u003cp\u003e\"Oh, no. Damn.\" He sighed. \"Damn.\"\u003c/p\u003e\n\u003cp\u003eTyler was hunched over the steering wheel, half out of her seat, forehead smashed against the windshield. Mortimer eased her back into the seat. Her eyes were vacant, dark blood down both sides of her face. Mortimer felt for a pulse even though he knew there wouldn\u0027t be one.\u003c/p\u003e\n\u003cp\u003e\"She hit so quick I don\u0027t think she felt a thing,\" Sheila said from the backseat.\u003c/p\u003e\n\u003cp\u003eMortimer reached past Tyler\u0027s corpse, flipped the switch for the radio. He put on Tyler\u0027s headset. The confused chatter of battle assaulted him. He blocked it out and, into the microphone, said, \"Malcolm, this is Mortimer Tate. You still out there?\"\u003c/p\u003e\n\u003cp\u003eConfused static. Then:\u003c/p\u003e\n\u003cp\u003e¨C \"I don\u0027t have time for you, Tate. I\u0027m in the middle of a battle.\"\u003c/p\u003e\n\u003cp\u003eExplosions and gunfire in the background had almost drowned out Malcolm\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re short on gas, Malcolm. You hear me? All that armor and those big V-8 engines. They\u0027re sucking gas fast. Are you getting this?\"\u003c/p\u003e\n\u003cp\u003eA long pause.\u003c/p\u003e\n\u003cp\u003e¨C \"Okay, you heard the man,\" Malcolm said. \"We\u0027ll do a dog-and-rabbit on them. Let\u0027s run them dry, people. Engage only enough to get them to chase you.\"\u003c/p\u003e\n\u003cp\u003e\"Good luck.\" Mortimer took off the headset.\u003c/p\u003e\n\u003cp\u003eHe went back to the other Cooper. \"Jimmy, I need a lift. There\u0027s something I have to do.\"\u003c/p\u003e\n\u003cp\u003e\"No way, man,\" Jimmy said. \"I\u0027ve got to get back to the fight. Those are my people.\"\u003c/p\u003e\n\u003cp\u003eMortimer started to protest, then stopped himself. It was the kid\u0027s right to get himself killed if he wanted. He looked at the wrecked MINI up against the telephone pole. \"You think we can get that thing running?\"\u003c/p\u003e\n\u003cp\u003eLII\u003c/p\u003e\n\u003cp\u003eChanging the tire had been the hard part. They pulled the battered Cooper out of the ditch. It started. It sounded bad, an arrhythmic clank coming from under the hood, but it would take them where Mortimer wanted to go.\u003c/p\u003e\n\u003cp\u003eThey bade farewell to Jimmy, who took Tyler\u0027s body with him when he left.\u003c/p\u003e\n\u003cp\u003eThe Cooper wouldn\u0027t go over thirty-five m.p.h. without the clanking getting bad, so they kept it slow, sticking to surface streets and avoiding the interstate. It took Mortimer, Bill and Sheila nearly two hours to reach the CNN Center.\u003c/p\u003e\n\u003cp\u003eThey parked in front, sat in the car a moment and surveyed the scene.\u003c/p\u003e\n\u003cp\u003eBill whistled. \"What do you suppose happened?\"\u003c/p\u003e\n\u003cp\u003eMortimer shook his head. \"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eBodies. Wreckage. Flames. So much to take in all at once.\u003c/p\u003e\n\u003cp\u003eA large six-wheeled truck with an open-air bed was parked at an odd angle, one tire up on the curb, the driver\u0027s door open. The driver\u0027s legs were still in the truck, the rest of him on the ground, a pool of blood spreading out from his head. Forty feet away, a big Oldsmobile burned, the flames popping and snapping, a column of thick black smoke twisting into the air. A few dozen more bodies were scattered about, most in mismatched clothing, with the red armband the only thing they wore in common.\u003c/p\u003e\n\u003cp\u003eThe stink of charred flesh made Mortimer\u0027s eyes water.\u003c/p\u003e\n\u003cp\u003eThe front doors to the CNN Center stood wide open, hanging askew on bent hinges. A jam of bodies clogging the doorway.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to have a look.\" Mortimer stepped out of the Cooper, drew the.38 revolver.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll come with you,\" Bill said.\u003c/p\u003e\n\u003cp\u003e\"Sheila, wait here and stay on the radio. If the battle shifts this way, honk the horn, give us some kind of warning.\"\u003c/p\u003e\n\u003cp\u003eSheila looked at the dead. \"Okay.\"\u003c/p\u003e\n\u003cp\u003eThey had to climb over a pile of bodies three deep to get inside. Among the bodies were two men clad in the black suits of the Czar\u0027s secret police. One had a knife through his throat.\u003c/p\u003e\n\u003cp\u003eThey entered the lobby, looked around. More bodies, many locked in the final throes of hand-to-hand combat.\u003c/p\u003e\n\u003cp\u003e\"It looks like they were fighting each other,\" Bill said.\u003c/p\u003e\n\u003cp\u003eThey walked toward the elevator for the other tower on the other side of the lobby, pressed the Up button.\u003c/p\u003e\n\u003cp\u003eThe elevator door opened and a young man inside screamed, saw Mortimer\u0027s revolver and backed away, dropping a half-dozen cans of food and a head of cabbage. He wore jeans and a white T-shirt and a bloody apron.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t shoot, man. I\u0027m just the cook.\"\u003c/p\u003e\n\u003cp\u003eMortimer lowered the pistol. \"What happened here?\"\u003c/p\u003e\n\u003cp\u003eThe cook knelt, began scooping the cans into his apron. \"I don\u0027t know, man. A bunch of those underground saboteurs hit while everyone was still asleep, really fucked everything up. Next thing I know all our own guys are killing each other. They\u0027re swarming into the kitchen and grabbing everything, cleaned the place out like fucking locusts, a bunch of them saying how they\u0027ll be damned if they\u0027re going to stick around here and get killed.\"\u003c/p\u003e\n\u003cp\u003eBill snorted. \"Looks like the proletariat bit the Czar in the ass.\"\u003c/p\u003e\n\u003cp\u003e\"This stuff\u0027s mine.\" The cook clutched the cans and the cabbage to his chest. \"I fought for it fair and square.\"\u003c/p\u003e\n\u003cp\u003eMortimer waved his pistol toward the exit. \"Get out of here.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t need to be told twice, ran away and didn\u0027t look back.\u003c/p\u003e\n\u003cp\u003eMortimer and Bill took the elevator to the top. The door opened and they leapt out, ready for action. They saw and heard no one at all. Another corpse sat crumpled in the corner with his head bashed to mush. They walked past him, opening doors and finding nothing.\u003c/p\u003e\n\u003cp\u003eMortimer tried the last door at the very end of the hall. Locked. He jiggled the handle, thought he heard voices on the other side. He angled the revolver down, shot the lock with a single blast and kicked the door open.\u003c/p\u003e\n\u003cp\u003eA dozen women gasped at his sudden entrance, one screaming. They all wore lingerie or string bikinis. Velvet sofas and plush chairs. Soft music played from a DVD player. The Czar\u0027s harem. Mortimer was just thinking how cool it was to rescue a roomful of half-naked women when something smacked the back of his head.\u003c/p\u003e\n\u003cp\u003eThe room whirled past his face in a blur and suddenly he was facedown in the shag carpeting. He felt a small hand grab a fistful of his hair, yank his head back. A cold knife blade against his throat.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" shouted a familiar voice. \"That\u0027s my husband.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" Anne said after they\u0027d moved him to one of the velvet couches. \"We\u0027ve been stuck up here for hours since all the shooting started, and we don\u0027t know what the hell\u0027s going on. We\u0027ve been waiting for somebody to open that door so we could make a break for it.\"\u003c/p\u003e\n\u003cp\u003eMortimer briefly related the pertinent details of the car battle and the apparent revolt among the Czar\u0027s men.\u003c/p\u003e\n\u003cp\u003e\"But we don\u0027t know anything for sure,\" Bill said.\u003c/p\u003e\n\u003cp\u003eThey headed out to the elevator, the scantily clad women with Bill and Mortimer in the lead.\u003c/p\u003e\n\u003cp\u003eWhen they reached the lobby, Anne saw the dead bodies and said, \"Gather weapons and ammo, ladies. We may need them. For Pete\u0027s sake, Brandi, get rid of those high heels. We might have to run for it.\"\u003c/p\u003e\n\u003cp\u003eA stunning redhead in green panties and a matching bra kicked off her shoes. They picked through the dead, finding pistols and rifles. Anne found a Glock, checked the load and looked at Mortimer. \"We\u0027re ready.\"\u003c/p\u003e\n\u003cp\u003eThey ran out the door and were immediately set upon by a half-dozen Red Stripes.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the women,\" yelled one of the Red Stripes. \"Get them! We can have our way with them, then trade them for rat jerky.\"\u003c/p\u003e\n\u003cp\u003eAnne shot him in the face with the Glock.\u003c/p\u003e\n\u003cp\u003eThe other women leapt into the action. An Asian girl in black stockings and garters kicked a Red Stripe in the balls. He went to his knees, and the girl stuck her gun in his mouth and pulled the trigger, the back of his head exploding in a spray of red gunk. Blonde twins in matching teddies had a Red Stripe on the ground, kicking him and smashing his skull in with the butt of a rifle.\u003c/p\u003e\n\u003cp\u003eIn five seconds flat, the girls had disposed of the attackers.\u003c/p\u003e\n\u003cp\u003e\"Holy shit,\" Mortimer said.\u003c/p\u003e\n\u003cp\u003eAnne barked orders. \"Lisa, I want you on the street, shout if anything comes from either direction. Brandi, that truck looks big enough for all of us. Check it out.\"\u003c/p\u003e\n\u003cp\u003eThe redhead who\u0027d kicked the high heels away jogged to the truck, hauled the dead body the rest of the way out of the cab without thinking twice. She reached in, popped the hood, went around front and stood on the bumper so she could look down at the engine.\u003c/p\u003e\n\u003cp\u003eThe rest of the girls climbed into the back of the truck.\u003c/p\u003e\n\u003cp\u003eAnne turned to Mortimer. \"I was wrong. I\u0027m glad you came to get me. We\u0027re square now, right?\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"The engine checks out and the keys are in the ignition,\" called Brandi.\u003c/p\u003e\n\u003cp\u003e\"Good,\" Anne said. \"Lisa?\"\u003c/p\u003e\n\u003cp\u003e\"All clear,\" said the girl from the road.\u003c/p\u003e\n\u003cp\u003eAnne patted Mortimer\u0027s cheek. \"Thanks again. Really. Maybe we\u0027ll cross paths again sometime.\" She skipped toward the truck.\u003c/p\u003e\n\u003cp\u003e\"Wait,\" Mortimer called after her. \"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"Back to Joey Armageddon\u0027s,\" she said. \"That\u0027s were I belong. And I told you before, I\u0027m responsible for these girls. I need to make sure they get back safely.\" She climbed behind the wheel and started the truck, backed it off the curb. Lisa came in from the street and jumped in the back.\u003c/p\u003e\n\u003cp\u003eThe redhead-Brandi-hopped in the back too.\u003c/p\u003e\n\u003cp\u003eBrandi had found a pair of combat boots among the dead, stood tall and strong and straight in her green panties and bra, the butt of her AK-47 assault rifle resting against a cocked hip. The wind tugged at her red hair. A long streak of somebody else\u0027s blood down one leg. Her head was up, eyes bright. She looked like she owned the world.\u003c/p\u003e\n\u003cp\u003eThere she goes, Mortimer thought. The icon for a new age. She could have been on the recruitment poster for the swingingest army in the world.\u003c/p\u003e\n\u003cp\u003eShe met Mortimer\u0027s gaze and winked as Anne shifted the big truck into gear and kept going.\u003c/p\u003e\n\u003cp\u003eBill said, \"So that was your wife, huh?\"\u003c/p\u003e\n\u003cp\u003e\"Ex-wife.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/go-go-girls-of-the-apocalypse/page-23.html","bookId":1578,"creation":"Oct 6, 2019 12:01:17 AM","modification":"Oct 6, 2019 12:01:17 AM"}
