{"id":95782,"no":43,"title":"Page 43","content":"\u003cp\u003e“Vividly.”\u003c/p\u003e\n\u003cp\u003e“Natural causes,” he prompted.\u003c/p\u003e\n\u003cp\u003e“Well, what could be more natural? You live too long, you got a mind that’s starting to turn to pablum, you become erratic and unreliable, what’s the natural thing for someone to do?”\u003c/p\u003e\n\u003cp\u003e“It was that bad, huh?”\u003c/p\u003e\n\u003cp\u003e“Keller,” she said, “three weeks ago this reporter showed up. A kid barely old enough to shave, working his first job on the local paper. I’ll tell you, I thought he was there to sell me a subscription, but no, he came to interview the old man.”\u003c/p\u003e\n\u003cp\u003e“You’d think the editor would have sent somebody more experienced.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t the editor’s idea,” she said, “or the kid’s either, God help him. And who does that leave?”\u003c/p\u003e\n\u003cp\u003e“You mean… ”\u003c/p\u003e\n\u003cp\u003e“He’d decided it was time to write his memoirs. Time to tell all the untold stories, time to tell where the bodies were buried. And I do mean bodies, Keller, and I do mean buried.”\u003c/p\u003e\n\u003cp\u003e“Jesus.”\u003c/p\u003e\n\u003cp\u003e“He saw this kid’s byline on some high school basketball roundup and decided he was the perfect person to collaborate with.”\u003c/p\u003e\n\u003cp\u003e“For God’s sake.”\u003c/p\u003e\n\u003cp\u003e“Need I say more? I’d already reached the point where I made sure all incoming calls got routed downstairs. Now I had to worry about the calls he made on his own. Keller, it’s the hardest decision I ever had to make in my life.”\u003c/p\u003e\n\u003cp\u003e“I can imagine.”\u003c/p\u003e\n\u003cp\u003e“But what choice did I have? It had to be done.”\u003c/p\u003e\n\u003cp\u003e“Sounds that way.” He picked up his tea, put it down untasted. “Who’d you get for it, Dot?”\u003c/p\u003e\n\u003cp\u003e“Who do you think, Keller? You know the story about the little red hen?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Well, I’m not about to tell it to you, but she couldn’t find anyone to help her, so she did it all herself.”\u003c/p\u003e\n\u003cp\u003e“You…”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Dot, for God’s sake. I would have done it.”\u003c/p\u003e\n\u003cp\u003e“I didn’t even want you within five hundred miles, Keller. I wanted you to have an alibi that nobody could crack. Just in case somebody knew about the connection and decided to shake the box and see what fell out.”\u003c/p\u003e\n\u003cp\u003e“I understand,” he said, “but under the circumstances… ”\u003c/p\u003e\n\u003cp\u003e“No,” she said. “And I have to say it was easy for me, Keller. The hardest decision, but the easiest thing in the world. Something in his cocoa to make him sleep, and a pillow over his face to keep him from waking up.”\u003c/p\u003e\n\u003cp\u003e“That’s the kind of thing that shows up in an autopsy.”\u003c/p\u003e\n\u003cp\u003e“Only if they hold one,” she said. “His age, and then his regular doctor came over and signed the death certificate, and that’s all you need. I had him cremated. It was his last wish.”\u003c/p\u003e\n\u003cp\u003e“It was?”\u003c/p\u003e\n\u003cp\u003e“How do I know? I said it was, and they gave me the ashes in a tin can, and if some joker wants to do an autopsy now I’d say he’s got his work cut out for him. I don’t know what the hell to do with the ashes. Well, I’m sure I’ll think of something. There’s no hurry.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“It was something I never thought I’d have to do, something I never even figured I’d be capable of doing. Well, you never know, do you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“It’s on my mind a lot, but I guess I’ll get over that. This too shall pass, right?”\u003c/p\u003e\n\u003cp\u003e“You’ll be fine,” he said.\u003c/p\u003e\n\u003cp\u003e“I know. I’m fine now, as far as that goes. Now all I have to do is figure out what I’m going to do with the rest of my life.”\u003c/p\u003e\n\u003cp\u003e“I was going to ask you about that.”\u003c/p\u003e\n\u003cp\u003eShe frowned. “What I suppose I’ll do,” she said, “is retire. I can afford it. I’ve put money aside myself, and he left me the house. I can sell it.”\u003c/p\u003e\n\u003cp\u003e“Probably bring a good price.”\u003c/p\u003e\n\u003cp\u003e“You would think so. And there’s the cash on hand, which he didn’t specifically leave me, but since I’m the only one who knows about it… ”\u003c/p\u003e\n\u003cp\u003e“That makes it yours.”\u003c/p\u003e\n\u003cp\u003e“You bet. So it’s enough to live on. I can even afford to travel some. Go on cruises, put my feet up, see the world from the deck of a ship.”\u003c/p\u003e\n\u003cp\u003e“You don’t actually sound that enthusiastic, Dot.”\u003c/p\u003e\n\u003cp\u003e“Well,” she said, “it’s probably because I’m not. What I’d rather do is keep on keeping on.”\u003c/p\u003e\n\u003cp\u003e“Stay here, you mean?”\u003c/p\u003e\n\u003cp\u003e“Why not? And stay in the business. You know, I’m the one who’s been pretty much running things lately.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“But with you deciding to pack it in, it would mean finding other people to work with, and the ones I have access to are not people I’m crazy about. So I don’t know.”\u003c/p\u003e\n\u003cp\u003e“You can’t work with people unless you feel a hundred percent about them.”\u003c/p\u003e\n\u003cp\u003e“I know it. Look, I’m better off hanging it up. All I have to do is follow the same advice I gave you.”\u003c/p\u003e\n\u003cp\u003e“And get a hobby.”\u003c/p\u003e\n\u003cp\u003e“There you go. It really worked for you, didn’t it?You’re a full-fledged philatelist, and don’t ask me to say that three times.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t dream of it. But that’s me, all right.”\u003c/p\u003e\n\u003cp\u003e“I’ll bet you even found a stamp dealer in Kansas City. To pass the time while you were there.”\u003c/p\u003e\n\u003cp\u003e“Actually,” he said, “that’s how I picked Kansas City.” And he told her a little about the auction. “It’s pretty amazing,” he said. “You’ll be sitting next to some rube in baggy pants and a dirty T-shirt, and he’ll raise his index finger a few times and spend fifty or a hundred thousand dollars on postmasters’ provisionals.”\u003c/p\u003e\n\u003cp\u003e“Whatever they are,” she said. “No, don’t tell me. I have a feeling stamp collecting’s not going to be my hobby, Keller, but I think it’s great that it’s yours. I guess we can say you’re retired, can’t we? And fully prepared to enjoy the Golden Years.”\u003c/p\u003e\n\u003cp\u003e“Well,” he said.\u003c/p\u003e\n\u003cp\u003e“Well what?”\u003c/p\u003e\n\u003cp\u003e“Well, not exactly.”\u003c/p\u003e\n\u003cp\u003e“What’s the matter?”\u003c/p\u003e\n\u003cp\u003e“Well, it’s an expensive hobby,” he said. “It doesn’t have to be, you can buy thousands of stamps for two and three cents apiece, but if you really get serious about it… ”\u003c/p\u003e\n\u003cp\u003e“It runs into money.”\u003c/p\u003e\n\u003cp\u003e“It does,” he agreed. “I’m afraid I’ve been dipping into my retirement fund the last month or so. I’ve spent more money than I expected to.”\u003c/p\u003e\n\u003cp\u003e“No kidding.”\u003c/p\u003e\n\u003cp\u003e“And the thing is I’m really enjoying it,” he said, “and learning more and more about it as I go along. I’d like to keep on spending serious money on stamps.”\u003c/p\u003e\n\u003cp\u003eShe gave him a thoughtful look. “It doesn’t sound as though you’re quite ready to retire after all.”\u003c/p\u003e\n\u003cp\u003e“I’m not in a position to,” he said. “Not anymore. And I don’t really want to, either. In fact I’d like to get as much work as I can, because I can use the money.”\u003c/p\u003e\n\u003cp\u003e“To buy stamps.”\u003c/p\u003e\n\u003cp\u003e“It sounds silly, I know, but… ”\u003c/p\u003e\n\u003cp\u003e“No it doesn’t,” she said. “It sounds like the answer to a maiden’s prayer. We always worked well together, didn’t we, Keller?”\u003c/p\u003e\n\u003cp\u003e“Always.”\u003c/p\u003e\n\u003cp\u003e“Some of the other jokers I was considering, I think they might have a hard time coming to terms with the idea of working for a woman. But I don’t see that as a problem for you and me.”\u003c/p\u003e\n\u003cp\u003e“Certainly not.”\u003c/p\u003e\n\u003cp\u003e“Well,” she said. “Thank God for stamp collecting is all that I can say. How about another glass of iced tea, Keller? And you can even tell me about postmasters’ promotionals, if it makes you happy.”\u003c/p\u003e\n\u003cp\u003e“Provisionals,” he said. “And you don’t have to hear about them. I’m happy already.” \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-man-keller-1/page-43.html","bookId":2312,"creation":"Oct 5, 2019 6:17:25 PM","modification":"Oct 5, 2019 6:17:25 PM"}
