{"id":1913,"no":5,"title":"Chapter 5","content":"\u0026nbsp;The doorway darkened again as Harkway came in, followed by Nick. Nick gestured toward the rear of the shop, and Harkway advanced, smiling. His lower lip was stained by a purple substance with a glossy surface. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Cudyk greeted him and offered him a chair. \"It was good of you to come over,\" he said. \"I hope I didn\u0027t interrupt your work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harkway grinned stiffly. \"No. I was just finishing lunch when your boy found me. I have nothing more to do until this evening.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Cudyk looked at him. \"You got to the hospital after all, I see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Dr. Moskowitz fixed me up nicely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Cudyk had been asking himself why the M.P.L. man looked so cheerful. Now he thought he understood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And Miss Burgess?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Harkway, looking embarrassed. He paused. \"She\u0027s—an exquisite person, Mr. Cudyk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Cudyk clasped his square hands together, elbows on the arms of his chair. He said, \"Forgive me, I\u0027m going to be personal. Am I right in saying that you now feel more than casually interested in Miss Burgess?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He added, \"Please. I have a reason for asking.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harkway\u0027s expression was guarded. \"Yes; that\u0027s true.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think she may feel similarly towards you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harkway paused. \"I think so. I hope so. Why, Mr. Cudyk?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Harkway, I will be very blunt. Miss Burgess has already lost one lover through no fault of her own, and the experience has not been good for her. She is, as you say, exquisite—she has a beautiful, but not a strong personality. Do you think it is fair for you to give her another such experience, even if the attachment is not fully formed, by allowing yourself to be killed this evening?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harkway leaned back in his chair. \"Oh,\" he said, \"that\u0027s it.\" He grinned. \"I thought you were going to point out that her father broke off the last affair because of the man\u0027s politics. If you had, I was going to tell you that Mr. Burgess looked me up this morning and apologized for his attitude yesterday, and breaking down and so on. He\u0027s very decent, you know. We\u0027re getting along very well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He paused. \"About this other matter,\" he said seriously, \"I\u0027m grateful for your interest, but—I\u0027m afraid I can\u0027t concede the validity of your argument.\" He made an impatient gesture. \"I\u0027m not trying to sound noble, but this business is more important than my personal life. That\u0027s all, I\u0027m afraid. I\u0027m sorry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Another fanatic, Cudyk thought. A liberal fanatic. I have seen all kinds, now. He said, \"I have one more argument to try. Has Seu explained to you how precarious our position is here on Palumbar?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He spoke of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The Niori accepted this one small colony with grave misgivings. Every act of violence that occurs here weakens our position, because it furnishes ammunition for a group which already wants to expel us. Do you understand?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was pain in Harkway\u0027s eyes. \"Mr. Cudyk, it\u0027s the same all over the galaxy, wherever these pitifully tiny outgroups exist. My group is trying to attack that problem on a galaxy-wide scale. I don\u0027t say we\u0027ll succeed, and I grant you the right to doubt that our program is the right one. But we\u0027ve got to try. Among other things, we\u0027ve got to clean out the activists, for just the reason you mention. And—pardon me for stressing the obvious—but it\u0027s Captain Rack who will be responsible for this particular act of violence if it occurs, not myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you think that your death at his hands would be a stronger argument than a peaceful meeting, is that it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harkway shook his head ruefully. \"I don\u0027t know that I have that much courage, Mr. Cudyk. I\u0027m hoping that nothing will happen to me. But I know that the League\u0027s prestige here would be enormously hurt if I let Rack bluff me down.\" He stood up. \"You\u0027ll be at the meeting?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m afraid so.\" Cudyk stood and offered his hand. \"The best of luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He watched the young man go, feeling very old and tired. He had known it would be this way; he had only tried for Seu\u0027s sake. Now he was involved; he had allowed himself to feel the tug of love and pity toward still another lost soul. Such bonds were destructive—they turned the heart brittle and weathered it away, bit by bit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/2922/80387.html","bookId":71,"creation":"Aug 1, 2019 3:27:04 AM","modification":"Aug 1, 2019 3:27:04 AM"}
