{"id":70479,"no":23,"title":"Page 23","content":"\u003cp\u003e“She told me she was your fiancée.”\u003c/p\u003e\n\u003cp\u003eIt was all starting to make sense to Vaughn, a sick kind of sense. Natalie’s declaration certainly explained that “shame me twice” stuff. “She spoke to your mother this morning,” Carrie went on. “Your mother said if you weren’t over at the bank to check here with Hassie. Only it was me she found.”\u003c/p\u003e\n\u003cp\u003e“I can explain,” he began.\u003c/p\u003e\n\u003cp\u003e“I’m sure you can, but frankly I’m not interested in listening.” With that, she returned to the pharmaceutical counter and resumed her work as if he was no longer there.\u003c/p\u003e\n\u003cp\u003eVaughn waited uncertainly for a moment, but she didn’t look anywhere except at her task, at the pills she was counting out.\u003c/p\u003e\n\u003cp\u003eIt was too late for explanations. Too late to regain her trust. Too late for him.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eVaughn didn’t think anything could happen to make this day any worse, but he was wrong.\u003c/p\u003e\n\u003cp\u003eAs soon as he pulled into the driveway at his parents’ home, he saw the unfamiliar car. Even before he’d climbed out of his own vehicle, he knew who’d come to visit.\u003c/p\u003e\n\u003cp\u003eNatalie.\u003c/p\u003e\n\u003cp\u003eSure enough, the instant he walked into the house, his father cast him a sympathetic glance.\u003c/p\u003e\n\u003cp\u003e“You’re back,” his mother said, her voice strained and unnaturally high.\u003c/p\u003e\n\u003cp\u003e“Hello, Vaughn,” Natalie said from the living room. She held a cup of coffee balanced on her knee. She looked out of place—and decidedly irritated.\u003c/p\u003e\n\u003cp\u003eHe nodded in her direction.\u003c/p\u003e\n\u003cp\u003e“I think we’ll leave the two of you to talk,” his mother announced, and exited the room with the speed of someone who’s relieved to escape. His father was directly behind her.\u003c/p\u003e\n\u003cp\u003eWith a silent groan, Vaughn turned toward Natalie.\u003c/p\u003e\n\u003cp\u003e“You didn’t answer my phone messages.” She set aside her coffee, glaring at him. “When I couldn’t find you, I drove straight to Buffalo Valley, where I spent the night at some hole-in-the-wall. Merry Christmas, Natalie,” she said bitterly.\u003c/p\u003e\n\u003cp\u003eShe didn’t appear to expect a comment, so he sat down across from her and waited. When she didn’t immediately continue, he figured he’d better take his stand.\u003c/p\u003e\n\u003cp\u003e“I’m finished with Value-X.” Nothing she could say or offer him would influence his decision. “You aren’t going to change my mind.”\u003c/p\u003e\n\u003cp\u003e“I’ll say you’re finished. I’ll be fortunate to have a job myself after this.”\u003c/p\u003e\n\u003cp\u003eVaughn doubted that. Natalie was the type who’d always land on her feet. Yes, she’d recommended Vaughn to the company, but they couldn’t hold that against her.\u003c/p\u003e\n\u003cp\u003e“You intend to go through with this…this craziness, don’t you?”\u003c/p\u003e\n\u003cp\u003eNo use hedging. “Yes, I do. I’ve resigned, and since I hadn’t officially started work yet, I didn’t bother to give any notice.”\u003c/p\u003e\n\u003cp\u003eShe sighed and stared down at her coffee. “I wonder if I ever knew you.”\u003c/p\u003e\n\u003cp\u003eVaughn said nothing. He’d let her say what she wanted, denounce him, threaten him, whatever. She had cause; he wasn’t exactly blameless in all this.\u003c/p\u003e\n\u003cp\u003e“You think I don’t know what this is about?” she challenged. She stood, crossing her arms. “It all has to do with you and me.”\u003c/p\u003e\n\u003cp\u003eVaughn didn’t know a kind way to tell her there wasn’t any “you and me.” There’d probably never been a “you and me.” Not with Natalie. Looking at her, Vaughn wondered how he could ever have believed he was in love with her. The very traits that had once attracted him now repulsed him. Her ambition blinded her to everything that was unique and special about Buffalo Valley.\u003c/p\u003e\n\u003cp\u003e“Say something!” she shrilled.\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“That’s a good start.” Her stance relaxed somewhat.\u003c/p\u003e\n\u003cp\u003e“It doesn’t change anything, though.” He wasn’t being purposely cruel, only frank. “I’m going to do everything I can to keep Value-X out of Buffalo Valley.”\u003c/p\u003e\n\u003cp\u003e“You’re mad at me,” she insisted. “All this craziness about moving to some backwoods town is a form of punishment. You’re trying to make me regret what I said. Vaughn, you simply don’t understand how important Value-X is to me and to our future.”\u003c/p\u003e\n\u003cp\u003e“Natalie—”\u003c/p\u003e\n\u003cp\u003eShe ignored him and started pacing. “We’ve always been good together, Vaughn, you know that.”\u003c/p\u003e\n\u003cp\u003e“Have we, Natalie?” he asked, hoping she was capable of admitting the truth.\u003c/p\u003e\n\u003cp\u003e“I can’t let you do this,” she said, clenching her fists.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “It’s done.”\u003c/p\u003e\n\u003cp\u003e“But you’re destroying your career!”\u003c/p\u003e\n\u003cp\u003e“I don’t want to work for a company like Value-X. Not now and not in the future.”\u003c/p\u003e\n\u003cp\u003e“What are you going to do, then?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” he told her, and it was true. He’d fight the big retailer for as long as his money held out, but after that…he didn’t have any answers.\u003c/p\u003e\n\u003cp\u003e“I can help you,” she said. “You’re this rough-and-ready Airborne Ranger, trying to be a hero. But you’ve got to face reality. No one goes against Value-X and walks away a winner. This will cost you more than you can afford to lose.”\u003c/p\u003e\n\u003cp\u003eHe ignored her threat. “Thanks but no thanks,” he muttered.\u003c/p\u003e\n\u003cp\u003eShe looked crestfallen.\u003c/p\u003e\n\u003cp\u003eVaughn had a few questions of his own. “Why did you tell Carrie we’re engaged?”\u003c/p\u003e\n\u003cp\u003e“Because we are!” she cried. “Did we or did we not discuss marriage?”\u003c/p\u003e\n\u003cp\u003eHe didn’t respond. She already had her answer.\u003c/p\u003e\n\u003cp\u003e“Oh, I get it,” Natalie raged, her eyes spitting fire. “You found yourself a little side dish while you were away visiting Mom and Dad. You forgot all about me. Is that it?”\u003c/p\u003e\n\u003cp\u003e“We aren’t engaged and we aren’t getting married.” She couldn’t seriously believe he intended to continue this relationship when it was obviously a dead end for both of them.\u003c/p\u003e\n\u003cp\u003e“But we did discuss marriage on more than one occasion, and I never said I wouldn’t marry you. We both understood we’d get married someday.”\u003c/p\u003e\n\u003cp\u003e“I didn’t see it that way. Yes, we talked about marriage, but there was no commitment—and very little interest on your part.”\u003c/p\u003e\n\u003cp\u003e“Now you’re lying, too.”\u003c/p\u003e\n\u003cp\u003eHe bristled, but bit his tongue before he said something he’d regret.\u003c/p\u003e\n\u003cp\u003e“Well…it’s sort of a lie.” Natalie lowered her head. “I made a mistake, but not once did I say anything about breaking off our relationship.”\u003c/p\u003e\n\u003cp\u003e“It’s over.” He didn’t know how much plainer he could be.\u003c/p\u003e\n\u003cp\u003e“I know.” She sighed. “Well, if you insist on this lunacy, you’re on your own.”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“We could’ve been very good together,” she whispered.\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“I know, and you’ll be a whole lot sorrier once Value-X is through with this town.” She rallied then, jerking her head up, chin tilted. “If you want to freeze your butt off in this horrible place, then go right ahead.” She reached for her coat and yanked it toward her.\u003c/p\u003e\n\u003cp\u003eThe sound of several car doors closing distracted Vaughn. He glanced out the window to see all four of Carrie’s brothers standing in the driveway. He could only surmise that they’d come en masse to finish him off.\u003c/p\u003e\n\u003cp\u003e“Who’s here?” Natalie asked.\u003c/p\u003e\n\u003cp\u003e“The firing squad,” Vaughn answered.\u003c/p\u003e\n\u003cp\u003e“Terrific. Can I fire the first shot?”\u003c/p\u003e\n\u003cp\u003eVaughn didn’t respond to her sarcasm. He headed toward the front door, opening it for the four men who marched, single file, into the house. Soon Carrie’s brothers stood in the middle of the room, looking from Vaughn to Natalie and then back.\u003c/p\u003e\n\u003cp\u003e“What happened?” Chuck demanded. “You left town without saying a word.”\u003c/p\u003e\n\u003cp\u003e“I didn’t meet with Heath,” Vaughn started to explain, but wasn’t given the opportunity before another question was hurled at him.\u003c/p\u003e\n\u003cp\u003e“Aren’t you going to introduce us to your sister?”\u003c/p\u003e\n\u003cp\u003e“I’m Natalie Nichols.” She introduced herself, stepping forward and offering each of the Hendrickson brothers her hand. “And I’m not Vaughn’s sister.”\u003c/p\u003e\n\u003cp\u003e“Then who are you?” Ken asked, frowning.\u003c/p\u003e\n\u003cp\u003e“His fiancée. Or I was,” she said, “until recently, but now Vaughn’s met someone else. He just told me that he no longer wishes to marry me.” She appeared to be making a brave effort to hold her chin high and keep her lower lip from trembling. He’d never realized what a good actress Natalie was.\u003c/p\u003e\n\u003cp\u003eVaughn resisted rolling his eyes. He remained silent, preferring not to get drawn into a theatrical scene in which he was identified as the villain.\u003c/p\u003e\n\u003cp\u003e“Someone will need to give me directions back to my hotel.” She pulled a tissue from her pocket and dabbed at her eyes, being careful not to smear her mascara.\u003c/p\u003e\n\u003cp\u003e“I can get you there.” Ken stepped forward. “I’ll be happy to help.”\u003c/p\u003e\n\u003cp\u003eTom’s gaze narrowed on Vaughn. “Did she have something to do with the fact that you didn’t see Heath?”\u003c/p\u003e\n\u003cp\u003eVaughn shook his head, surprised the Hendrickson brothers hadn’t already heard. “The land sold.”\u003c/p\u003e\n\u003cp\u003e“What the hell?”\u003c/p\u003e\n\u003cp\u003eAll four brothers started speaking at once. As luck would have it, Vaughn’s parents chose that precise moment to reappear.\u003c/p\u003e\n\u003cp\u003e“I thought I heard voices,” his mother said as she came into the living room.\u003c/p\u003e\n\u003cp\u003eTom motioned with his head toward Natalie. “You’d better have a good explanation,” he muttered. “You’d better not be engaged to her and seeing Carrie.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Pete agreed. “This is all some kind of misunderstanding, isn’t it? Didn’t I tell you I’d make you pay if you hurt my sister?”\u003c/p\u003e\n\u003cp\u003e“He was never actually engaged,” his mother said, hurrying to defend Vaughn. “What he told us is—”\u003c/p\u003e\n\u003cp\u003eThat was when his father stepped into the fray. “Barbara, let Vaughn answer for himself, would you?”\u003c/p\u003e\n\u003cp\u003eThis was impossible. Everyone talked at once. Part of the conversation had to do with the land; everyone was clearly upset about that. Then Pete and his mother got involved in a debate about whether Vaughn should be dating Carrie. In the meantime, Ken and Natalie had apparently struck up a friendly conversation. They sat next to each other on the sofa, so close that their knees touched. Vaughn could only guess what she was saying, but frankly, he couldn’t care less.\u003c/p\u003e\n\u003cp\u003eBefore everything blew up in his face, Vaughn walked through the kitchen, grabbed his coat and stepped out the back door. He got into his car, which fortunately hadn’t been blocked by the other vehicles. Glancing toward the house, he saw everyone gathered in front of the big window in the living room, staring at him. They must have been dumbfounded, because no one seemed to be speaking.\u003c/p\u003e\n\u003cp\u003eWhen he reached the end of the long driveway, Vaughn had to make a decision. He could go searching for solitude, a quiet place to recover his dignity. Or he could drive back to Buffalo Valley.\u003c/p\u003e\n\u003cp\u003eHe chose Buffalo Valley. When he’d finished breaking Hassie’s heart, he’d do what he could to mend Carrie’s. \u003c/p\u003e","sourceLink":"https://allnovel.net/buffalo-valley/page-23.html","bookId":1965,"creation":"Oct 5, 2019 10:17:01 AM","modification":"Oct 5, 2019 10:17:01 AM"}
