{"id":70465,"no":9,"title":"Page 9","content":"\u003cp\u003e“They weren’t interested in listening, were they?” Heath’s disheartened look was answer enough. “It’s progress, right?”\u003c/p\u003e\n\u003cp\u003e“Right,” Heath muttered. “Listen, I’ve got a meeting in ten minutes. I’m sorry, Carrie. I know what this will mean for your father’s business and Knight’s Pharmacy, too. I’m doing the best I can.”\u003c/p\u003e\n\u003cp\u003e“Can’t you buy the property yourself?”\u003c/p\u003e\n\u003cp\u003e“I approached Kohn about that, but...\"\u003c/p\u003e\n\u003cp\u003e“He won’t sell it to you?” Carrie asked in an outraged voice.\u003c/p\u003e\n\u003cp\u003e“Let’s say he’d love a bidding war—one I’d be sure to lose.” Heath stood and retrieved his overcoat from a closet.\u003c/p\u003e\n\u003cp\u003eHer gaze pleaded with his. “You’ve got to find a way to keep Value-X out of Buffalo Valley.”\u003c/p\u003e\n\u003cp\u003e“Kohn hasn’t heard the last of this,” Heath promised as he escorted her out of the bank.\u003c/p\u003e\n\u003cp\u003eCarrie accompanied him to his four-wheel-drive vehicle.\u003c/p\u003e\n\u003cp\u003e“Is there anything I can do?” she asked, feeling the need to act.\u003c/p\u003e\n\u003cp\u003eHeath shook his head as he opened his car door. “Don’t worry, Carrie, this isn’t over yet. Not by a long shot.”\u003c/p\u003e\n\u003cp\u003eAll Carrie could do was trust that, somehow or other, he’d convince Ambrose Kohn to be reasonable.\u003c/p\u003e\n\u003cp\u003eThe drive into Grand Forks passed in a fog. Burdened by the news, Carrie was surprised when the two lanes widened to four as she reached the outskirts of the big city.\u003c/p\u003e\n\u003cp\u003eVaughn was waiting for her inside the mall at a coffee shop they’d designated as their meeting place. He stood as she approached. She was struck again by what an attractive man he was. Her ex-husband had been attractive, too, but Alec’s good looks had belied his selfish, arrogant nature. She’d learned, the hard way, that a handsome face proved nothing about the inner man. No, handsome is as handsome does, her grandma always said. Which made Vaughn Kyle very handsome, indeed.\u003c/p\u003e\n\u003cp\u003eHe’d been so gentle and caring with Hassie. He’d spent time with her, listened to her talk about her son. Carrie marveled at his patience and his good humor and the respect he seemed to genuinely feel for Hassie and for the town. When he’d asked her to meet him in Grand Forks to help him finish his shopping, she’d agreed. It’d been a long, long time since a man had impressed her as much as Vaughn Kyle.\u003c/p\u003e\n\u003cp\u003e“Thanks for coming,” he said now.\u003c/p\u003e\n\u003cp\u003eAlthough it was relatively early, the mall was already frantic. With exactly a week left before Christmas, the entire population of Grand Forks had apparently decided to cram itself inside.\u003c/p\u003e\n\u003cp\u003e“The only person I still need to buy for is my mother,” he told her, looking around as though he already regretted this.\u003c/p\u003e\n\u003cp\u003e“What about perfume?” Carrie wasn’t feeling too inspired, either.\u003c/p\u003e\n\u003cp\u003e“She’s allergic to a lot of those scents.”\u003c/p\u003e\n\u003cp\u003e“Okay, how about…” Carrie proceeded to rattle off several other suggestions, all of which he categorically dismissed for one reason or another.\u003c/p\u003e\n\u003cp\u003e“Do you have any more ideas?” he asked, looking desperate.\u003c/p\u003e\n\u003cp\u003e“Not yet, but we might stumble across something while we’re here.”\u003c/p\u003e\n\u003cp\u003eVaughn sighed. “That doesn’t sound promising.” He glanced around. “How about if we find a quiet restaurant and discuss it over lunch?”\u003c/p\u003e\n\u003cp\u003eHe didn’t need to ask twice. She was as anxious to get away from the crowds as he was. They found an Italian place Joanie and Brandon Wyatt had once recommended and were seated almost immediately. Sitting at their table with its red-and-white-checkered tablecloth, Carrie could see why her friends liked it here. The casual atmosphere was perfect. If the food was half as good as the smells wafting from the kitchen, she was in for a treat.\u003c/p\u003e\n\u003cp\u003eCarrie quickly made her decision and closed the menu. Lowering her gaze, she pushed thoughts of Value-X from her mind for the umpteenth time. Her worries kept intruding on the pleasant day she was hoping to have.\u003c/p\u003e\n\u003cp\u003e“You’d better tell me,” Vaughn said. His hand reached for hers and he gently squeezed it. “Something’s wrong.”\u003c/p\u003e\n\u003cp\u003eApparently she hadn’t done a very good job of hiding her concerns. Rather than blurt everything out, she stared down at the tablecloth for a long moment.\u003c/p\u003e\n\u003cp\u003e“We learned this morning that Value-X is considering Buffalo Valley as a possible site,” she finally said. “Apparently they’ve already negotiated for a piece of land. I don’t need to tell you what that’ll do to our community.”\u003c/p\u003e\n\u003cp\u003e“It might be a good thing,” he said slowly. “Try to think positive.”\u003c/p\u003e\n\u003cp\u003e“If this is progress, we don’t want anything to do with it,” she muttered. Vaughn couldn’t possibly understand. She was sorry she’d brought up the subject. “We happen to like our town just the way it is.”\u003c/p\u003e\n\u003cp\u003e“It isn’t that—”\u003c/p\u003e\n\u003cp\u003e“We’re going to fight it,” she said confidently.\u003c/p\u003e\n\u003cp\u003e“How?” Vaughn asked. “Isn’t that a little like David fighting Goliath?”\u003c/p\u003e\n\u003cp\u003e“Perhaps, but like David, you can bet we aren’t going to idly sit by and do nothing.” Already plans had started to form in her mind. “Other communities have succeeded. We can, too.”\u003c/p\u003e\n\u003cp\u003e“You’re serious about this?”\u003c/p\u003e\n\u003cp\u003e“Damn straight I am.”\u003c/p\u003e\n\u003cp\u003e“Don’t you think you’re overlooking the positive aspects of a company like Value-X opening a store in Buffalo Valley? They have a lot to offer.”\u003c/p\u003e\n\u003cp\u003eCarrie glared at him. “You don’t get it, do you?”\u003c/p\u003e\n\u003cp\u003e“I guess not. Help me understand.” Vaughn leaned back in his chair, his expression serious.\u003c/p\u003e\n\u003cp\u003e“Value-X will ruin everything. We don’t want it, we don’t need it.” Carrie struggled to keep her voice even.\u003c/p\u003e\n\u003cp\u003eVaughn studied her. “I imagine you’re a formidable opponent when you put your mind to something.”\u003c/p\u003e\n\u003cp\u003e“It isn’t only me,” she told him. “The entire town is up in arms. We haven’t come this far to let some heartless enterprise wipe out all our efforts.”\u003c/p\u003e\n\u003cp\u003eVaughn frowned. “Value-X will mean the end of Knight’s Pharmacy, won’t it?”\u003c/p\u003e\n\u003cp\u003eThat was only the beginning as far as Carrie could tell. “And AceMan Hardware.” She ran one finger across the tines of the fork. “The only business I can’t see it affecting is the Buffalo Valley Quilting Company.” Carrie shot him a look and wondered why she hadn’t thought of this earlier. “That’s it!”\u003c/p\u003e\n\u003cp\u003e“What is?”\u003c/p\u003e\n\u003cp\u003e“A quilt. It’s the perfect Christmas gift for your mother.”\u003c/p\u003e\n\u003cp\u003eVaughn didn’t appear convinced. “A quilt?”\u003c/p\u003e\n\u003cp\u003e“They’re special. Hand-sewn, and you could go traditional or innovative.”\u003c/p\u003e\n\u003cp\u003e“How much are they?”\u003c/p\u003e\n\u003cp\u003e“I don’t know the full range of prices,” she said, “but if the quilt is more than you want to spend, there’re table runners and place mats and lap robes.”\u003c/p\u003e\n\u003cp\u003e“Hmm.” The idea seemed to take hold. “That does sound like a gift she’d enjoy.”\u003c/p\u003e\n\u003cp\u003e“I’m sure she would,” Carrie said. “I can’t believe I didn’t think of it earlier.”\u003c/p\u003e\n\u003cp\u003e“So how do I go about this?”\u003c/p\u003e\n\u003cp\u003e“If you don’t want to drive back to Buffalo Valley so soon, I could choose one for you,” she offered.\u003c/p\u003e\n\u003cp\u003e“Perhaps Mom should pick it out herself.”\u003c/p\u003e\n\u003cp\u003e“Great idea—and I know Hassie would love to see her.”\u003c/p\u003e\n\u003cp\u003e“I think it would do my mother a world of good to renew her friendship with Hassie.”\u003c/p\u003e\n\u003cp\u003eThe waitress arrived and took their orders. Seafood linguine for her, lasagna for him. And a glass of red wine for each. “Hey, it’s Christmas,” Vaughn said with a grin.\u003c/p\u003e\n\u003cp\u003eHe took his cell phone from his jacket and flipped it open. Within seconds, he had his mother on the line.\u003c/p\u003e\n\u003cp\u003e“What about tomorrow?” he asked, looking at Carrie.\u003c/p\u003e\n\u003cp\u003e“I’m sure that’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“Hassie will be there, won’t she?”\u003c/p\u003e\n\u003cp\u003eCarrie nodded. “She’s scheduled to work in the morning, but she has the afternoon free. I’ll cover for her, if need be.”\u003c/p\u003e\n\u003cp\u003eHe relayed the information to his mother, then ended the conversation and slid the phone back inside his jacket. Smiling at her, he said, “Thanks, Carrie.”\u003c/p\u003e\n\u003cp\u003eA warm feeling came over her, and once again she lowered her gaze. Vaughn Kyle—kind to old women and a thoughtful son. He was exciting and he was interesting and he made her heart beat furiously. She could only regret that he was heading back to Seattle so soon after Christmas.\u003c/p\u003e\n\u003cp\u003eChapter 4\u003c/p\u003e\n\u003cp\u003e“I suppose you heard,” Hassie said when Leta Betts came bustling into the pharmacy late in the afternoon. The word about Value-X had filtered through Buffalo Valley, and the town was rife with speculation. Nearly everyone she knew had stopped by to talk it over with her, as though she had a solution to this perplexing problem.\u003c/p\u003e\n\u003cp\u003e“I don’t like it,” Leta muttered, walking behind the counter of the soda fountain and pulling out a well-used teapot. “Want me to make you a cup?”\u003c/p\u003e\n\u003cp\u003e“Please.” Hassie had filled prescriptions all afternoon, between interruptions, and she was ready for a break. She’d known that Leta would come by at some point; fortunately, there was a lull just now, which made it a good time to talk to her dearest friend.\u003c/p\u003e\n\u003cp\u003e“Where’s Carrie?” Leta found two mugs and set them on the counter.\u003c/p\u003e\n\u003cp\u003e“It’s her day off.”\u003c/p\u003e\n\u003cp\u003e“I heard she went to see Heath.”\u003c/p\u003e\n\u003cp\u003eHassie had heard about that, as well. Carrie had a good heart and cared about this community with the same intensity as Hassie did. Once Carrie received her Pharm.D., Hassie had planned to turn the business over to her. That was before the threat of Value-X, however. If that threat became a reality, Hassie couldn’t sell the pharmacy, not in good conscience. In all likelihood the place would be out of business within a year after the big retailer moved in.\u003c/p\u003e\n\u003cp\u003e“It’s a shame, you know,” Leta murmured. She dragged a chair closer to the counter and perched on the seat. Leaning forward, she braced her elbows on the edge, sighing deeply. “Who’d have thought something like this would ever happen?”\u003c/p\u003e\n\u003cp\u003eHassie shook her head helplessly. She’d worked so hard to save this town. And now, even if oblivion wasn’t to be its fate, a corporation like Value-X could make Buffalo Valley unrecognizable, could turn it into something that bore no resemblance to the place it had been. The place it should be.\u003c/p\u003e\n\u003cp\u003e“What are we going to do?” Leta asked.\u003c/p\u003e\n\u003cp\u003eHassie sat next to her and assumed the same slouched pose. Leta was her friend and employee, and there wasn’t anything Hassie couldn’t tell her. But this situation with the conglomerate had her poleaxed. She was at her wit’s end. “I don’t know,” she admitted.\u003c/p\u003e\n\u003cp\u003e“We’ll think of something,” Leta insisted, and poured tea into the mugs. She set one in front of Hassie and then added a teaspoon of sugar to her own.\u003c/p\u003e\n\u003cp\u003e“Not this time,” Hassie said as she reached for the mug, letting it warm her hands. She was too old and too tired. A few years back she’d fought for her town with determination and ingenuity, but this new war would have to be waged by someone else. She’d done her part. \u003c/p\u003e","sourceLink":"https://allnovel.net/buffalo-valley/page-9.html","bookId":1965,"creation":"Oct 5, 2019 10:17:01 AM","modification":"Oct 5, 2019 10:17:01 AM"}
