{"id":111853,"no":102,"title":"Page 102","content":"\u003cp\u003eRacing along the hallway, Romy hung on Patrick\u0027s arm and stared at the baby. She couldn\u0027t take her eyes off that pink, perfect little face.\u003c/p\u003e\n\u003cp\u003e\"You weren\u0027t exaggerating, Patrick,\" Romy told him. \"She is truly beautiful.\"\u003c/p\u003e\n\u003cp\u003eBehind her, she heard Betsy say, \"Skip the elevators and take that stairway at the far end of the hall.\" Then in a lower voice to Zero: \"I need to talk to you about that baby.\"\u003c/p\u003e\n\u003cp\u003eThe two of them fell behind as Romy and Patrick entered the stairwell and started down. On the ground floor they exited and found themselves at the doctor\u0027s entrance. Joanna and Madhuri were already there with what looked like an oversized clear-topped bread box on wheels.\u003c/p\u003e\n\u003cp\u003e\"We took the elevator,\" Joanna said, eyes wide, \"and we saw a SWAT guy in the lobby. He had \u0027FBI\u0027 on his back,\" Joanna said. \"Are we in trouble?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not FBI,\" Romy told them, trying to keep the dread out of her voice. They mustnot get this baby. \"They\u0027re dressed-up thugs.\"\u003c/p\u003e\n\u003cp\u003ePatrick passed the baby to Madhuri who kept her wrapped in her arms as they made the frigid pre-dawn dash across the near empty parking lot to Joanna\u0027s minivan. Patrick loaded the isolette into the rear while Romy helped Madhuri and the baby into the front seat.\u003c/p\u003e\n\u003cp\u003eAs Joanna started the engine, Romy spotted Betsy hurrying their way. Behind her she saw Zero leaning against the brick wall outside the doctor\u0027s entrance. Her heart twisted. His posture was strange, as if he was sick.\u003c/p\u003e\n\u003cp\u003e\"Is something wrong with Zero?\" she asked Betsy as she arrived.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a little upset. I don\u0027t have time to explain now. He can tell you. If you need us we\u0027ll be at - \"\u003c/p\u003e\n\u003cp\u003eRomy raised a hand. \"Don\u0027t say it. Better if we don\u0027t know. That way they can\u0027t make us tell.\"\u003c/p\u003e\n\u003cp\u003eBetsy\u0027s face blanched. She nodded, then hugged Romy. \"Get the hell out of here before they find you.\"\u003c/p\u003e\n\u003cp\u003eThe three women and the baby roared off.\u003c/p\u003e\n\u003cp\u003eRomy watched for a few heartbeats, praying for the baby\u0027s survival, then Patrick was tugging on the sleeve of her scrubs.\u003c/p\u003e\n\u003cp\u003e\"Romy. Let\u0027s move.\"\u003c/p\u003e\n\u003cp\u003eZero reached the van a few seconds before they did. He pulled off his ski mask as he climbed into the rear seat, moving like an arthritic old man.\u003c/p\u003e\n\u003cp\u003e\"Will you drive, Patrick?\" he said in a voice barely above a whisper.\u003c/p\u003e\n\u003cp\u003eAs they got moving, Romy turned in the passenger seat and looked back. Kek was in the far rear; Tome sat next to Zero who was staring at the floor in silence.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong, Zero?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" he said, blinking and looking up at her. \"What\u0027s wrong? Everything\u0027s wrong.\"\u003c/p\u003e\n\u003cp\u003e\"Meaning?\"\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t ask me about it.\" The lost look in his yellow eyes constricted Romy\u0027s throat. \"Not yet.\"\u003c/p\u003e\n\u003cp\u003e\"Where are we going?\" Patrick said as they shot out of the parking lot.\u003c/p\u003e\n\u003cp\u003e\"To pay a visit to someone who has answers I need.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Ellis Sinclair.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-102.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
