{"id":111857,"no":106,"title":"Page 106","content":"\u003cp\u003eSUSSEX COUNTY, NJ\u003c/p\u003e\n\u003cp\u003eDarryl Lister had been waiting twenty minutes in Portero\u0027s undersized backwoods shack. How did he stand this crummy, uncomfortable furniture? The guy lived like a refugee.\u003c/p\u003e\n\u003cp\u003eBut not for too much longer.\u003c/p\u003e\n\u003cp\u003eHe heard a car pull up outside and gestured to Venisi, one of the two men he\u0027d brought with him, to check the window. He looked out and nodded.\u003c/p\u003e\n\u003cp\u003eOkay. Portero was here. Darryl took a deep breath. He\u0027d been steeling himself for this moment since the word had come down a few hours ago. Now that it was here he wanted to get it over with. They\u0027d been through a lot, Portero and he, but the time had come to put the past aside and deal with the present.\u003c/p\u003e\n\u003cp\u003eDarryl pointed to either side of the front door; Venisi and Markham nodded, drew their pistols, and moved into position.\u003c/p\u003e\n\u003cp\u003eHe\u0027s seen my car, he thought. He\u0027ll be expecting me, but not them.\u003c/p\u003e\n\u003cp\u003eA few seconds later Portero stepped through, dressed in black BDU shirt and pants, his face tight, obviously ready for a confrontation. He immediately spotted his two extra guests and his hand darted toward his sidearm, but stopped halfway.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s not do anything precipitous, Portero,\" Darryl said.\u003c/p\u003e\n\u003cp\u003ePortero glanced around the room. \"Maria?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s in the bedroom. She didn\u0027t feel a thing.\"\u003c/p\u003e\n\u003cp\u003ePortero squeezed his eyes shut. \"You didn\u0027t have to - \"\u003c/p\u003e\n\u003cp\u003e\"Yes, I did.\" Markham had held her down while Venisi put a bullet through her brain. She\u0027d looked very peaceful when Darryl had looked in on her. \"And it\u0027s your fault. If you\u0027d dumped her when I told you, she\u0027d still be alive now, but you\u0027re bigger than the rules, aren\u0027t you, Portero. Now hold still while these two gentlemen search you.\"\u003c/p\u003e\n\u003cp\u003eDarryl had warned his two men about Portero. He\u0027d seen the guy in action - tough, fast, vicious - and didn\u0027t want any slipups. Venisi covered him while Markham removed Portero\u0027s pistol from his holster and did the pat down.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this all about?\"\u003c/p\u003e\n\u003cp\u003e\"Clean-up time. The time when you tie up the loose ends, mop up the floor, close the door, and walk away.\"\u003c/p\u003e\n\u003cp\u003eWhen Markham was done, he nodded.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re telling me I\u0027m a loose end?\"\u003c/p\u003e\n\u003cp\u003e\"Eminently so.\"\u003c/p\u003e\n\u003cp\u003ePortero looked at the ceiling. \"I see.\"\u003c/p\u003e\n\u003cp\u003eDarryl had to admire his composure. No breakdown, no begging. But he\u0027d expected no less. If he kept this up, the next five minutes would be bearable.\u003c/p\u003e\n\u003cp\u003e\"The Old Man found out about Snyder and Grimes,\" Darryl told him. \"I had to say you hid their deaths from me as well.\"\u003c/p\u003e\n\u003cp\u003eThat had been one hairy meeting. The Old Man had just received word that the DoD had reversed its approval for Operation Guillotine - soon as the Pentagon heard about the sim\u0027s baby, it decided it wanted nothing to do with monkey commandos - and he was in a frothing rage. For a few bladder- clenching moments there Darryl had thought he might be scheduled for a one-way ride into the woods, but he\u0027d managed to shift all the blame to Portero.\u003c/p\u003e\n\u003cp\u003e\"Snyder and Grimes brought your loss total to six men - five KIA and one Section Eight. But that\u0027s only part of the reason I\u0027m here.\" He gestured toward the door. \"Let\u0027s step outside.\"\u003c/p\u003e\n\u003cp\u003ePortero led the way, followed by Venisi and Markham. Darryl brought up the rear.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all falling apart,\" he said as he ejected the clip from the pistol that had been used on Maria. \"The sweetest arrangement ever - ever - is tumbling down around us. All because you didn\u0027t do your job. So now we have to fall back. Covering our tracks isn\u0027t going to be enough. We have to erase them.\"\u003c/p\u003e\n\u003cp\u003eOne by one he began removing the .45 caliber rounds from the clip.\u003c/p\u003e\n\u003cp\u003e\"For instance, as we speak, there\u0027s an inferno raging in the middle of an Idaho nowhere, roasting a lot of monkey meat. When the arson squad, or whoever eventually gets the job, starts to sift through the ashes, they\u0027re going to have a lot of questions, but no answers.\"\u003c/p\u003e\n\u003cp\u003eWhen he got down to the last round, he left it in the clip and pocketed the others.\u003c/p\u003e\n\u003cp\u003e\"Since no clean-up can be guaranteed perfect, another aspect of the process is to provide plausible deniability for the high-ups should the dogs come sniffing their way. That means removing the weak or the too-visible links in the chain. You, unfortunately, fall into both those categories.\"\u003c/p\u003e\n\u003cp\u003e\"I thought we were friends.\"\u003c/p\u003e\n\u003cp\u003e\"We were. But this goes beyond friendship. It\u0027s not like I have a choice, so don\u0027t make this harder than it already is. You botched a number of crucial ops and, worse, made a spectacle of yourself at that hospital this morning.\"\u003c/p\u003e\n\u003cp\u003eDarryl watched him bristle at this, but Portero said nothing. Couldn\u0027t blame him. Why talk? Nothing he said would change anything.\u003c/p\u003e\n\u003cp\u003e\"And because I brought you in, it falls to me to usher you out.\"\u003c/p\u003e\n\u003cp\u003eDarryl checked the pistol to make sure the chamber was empty, then wiped it and the clip clean with a handkerchief. He handed both to Portero.\u003c/p\u003e\n\u003cp\u003e\"So...it\u0027s time. After all we\u0027ve been through, I feel it\u0027s only fair to offer you a chance to do the right thing.\"\u003c/p\u003e\n\u003cp\u003ePortero took a deep breath, then nodded and accepted the weapon.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to do it alone.\"\u003c/p\u003e\n\u003cp\u003e\"I think we\u0027d all prefer that.\" Darryl gestured to the trees. \"Do it in the woods.\" That was where Darryl had planned to leave the body anyway. It might be months before anyone found it, if ever. \"But don\u0027t try anything cute, Portero. Stay in sight. I\u0027m giving you the option to go out like a man. Try to run and we\u0027ll hunt you down like a dog.\"\u003c/p\u003e\n\u003cp\u003eAnother nod from Portero as he stared at the pistol and the clip in his hands, then he turned and walked into the trees.\u003c/p\u003e\n\u003cp\u003e\"Spread out,\" Darryl told Venisi and Markham in a low voice. \"Triangulate on him. Keep him in sight. He starts to run, take him down.\"\u003c/p\u003e\n\u003cp\u003eBut Portero acted the good soldier. He walked about a hundred feet along a path into the trees, stopped beside a big oak. He faced them and raised the pistol to the side of his head.\u003c/p\u003e\n\u003cp\u003eJesus, he\u0027s looking right at us.\u003c/p\u003e\n\u003cp\u003eDarryl\u0027s instinct was to turn away, but he forced himself to watch.\u003c/p\u003e\n\u003cp\u003eThe shotcracked through the chill air, Portero\u0027s head jerked to the left, and his body collapsed into the brush.\u003c/p\u003e\n\u003cp\u003eDarryl let out a breath. Done. Clean and neat.\u003c/p\u003e\n\u003cp\u003eHe gestured to Venisi and Markham. \"Check him out. If he\u0027s still breathing, finish him.\"\u003c/p\u003e\n\u003cp\u003eHe\u0027d heard of people surviving some outrageous head wounds. And with the way things had been going for Portero lately, who knew? He might have botched this too. \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-106.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
