{"id":111797,"no":40,"title":"Page 40","content":"\u003cp\u003eHICKSVILLE, LONG ISLAND\u003c/p\u003e\n\u003cp\u003eDECEMBER 3\u003c/p\u003e\n\u003cp\u003eShortly after 8:00A .M. Romy stepped through the front door of the small two-story office building and made a show of looking at the directory. The vestibule was clean but showing some wear around the edges. Just like the building, which was typical of the boxy, clapboard style popular back in the seventies. The tenants listed - a dentist, a real estate office, an insurance agent - were typical of any suburban office building; all except the lessee of the small corner office on the second floor: a venture capital company she knew was worth billions.\u003c/p\u003e\n\u003cp\u003eRomy hurried up to the second floor and found the door to Suite 2-C. A strictly no-frills black plastic plaque spelled outMANASSAS VENTURES ,INCin small white letters. She waited outside the door until she heard someone climbing the steps, then she started knocking. A woman in a colorful smock appeared, heading for the dental office, and Romy turned to her.\u003c/p\u003e\n\u003cp\u003e\"When does the Manassas Ventures staff usually arrive?\"\u003c/p\u003e\n\u003cp\u003eThe woman looked dumbfounded. \"You know, I don\u0027t think I\u0027ve ever seen anybody coming or going from that office.\"\u003c/p\u003e\n\u003cp\u003eThat\u0027s because no one does, Romy thought. Zero had had the place under observation for weeks.\u003c/p\u003e\n\u003cp\u003e\"Really?\" Romy said, putting her hand on the doorknob and rattling it. \"I\u0027ve been trying to reach them by phone but no one returns my messages, so I thought I\u0027d come over in person and - \"\u003c/p\u003e\n\u003cp\u003eThe door swung inward.\u003c/p\u003e\n\u003cp\u003e\"Now isn\u0027t that something,\" the dental assistant said as she stepped forward for a peek at the interior. \"They must\u0027ve forgot to lock it.\"\u003c/p\u003e\n\u003cp\u003eMorning sunlight streamed through the sheer curtains behind an empty receptionist\u0027s desk and flared the dust motes dancing through the air. No shortage of dust here - the desktop sported a good eighth of an inch.\u003c/p\u003e\n\u003cp\u003e\"Hello?\" Romy said, stepping inside. The air smelled stale, musty. No one had opened a window for a long, long time. \"Anybody home?\"\u003c/p\u003e\n\u003cp\u003e\"Good luck,\" the woman told Romy and started back toward her office.\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003eRomy had to act quickly. She glanced up, searching for the strand of monofilament she\u0027d been told she\u0027d find hanging from the central light fixture. There it was, a length of fine fishing line, barely visible.\u003c/p\u003e\n\u003cp\u003eTwo of Zero\u0027s people had broken in over the weekend. They\u0027d unlatched the door and rigged the fixture to drop when the fishing line was pulled.\u003c/p\u003e\n\u003cp\u003eThe original plan had been to loosen the hinges on the door so that it would fall outward when Romy tugged on it. She would let it knock her down and claim a terrible back injury. But Patrick had vetoed the idea. An injury caused by the door might leave the landlord as the liable party rather than the tenant. And it was the tenant they were after.\u003c/p\u003e\n\u003cp\u003eThe most open-and-shut scenario - he\u0027d called itres ipso loquitor\u0026nbsp;\u0026nbsp;- was to arrange for Romy to be \"injured\" by a tenant-installed fixture. After some reconnoitering, the fluorescent box in the ceiling over the reception area had received the nod.\u003c/p\u003e\n\u003cp\u003eRomy was supposed to pull the string and let it crash to the floor, then stagger out and collapse in the hall, pretending it had landed on her.\u003c/p\u003e\n\u003cp\u003ePretend...she\u0027d never been good at pretending. How was she supposed to slump to the floor out there and moan and groan about being hurt and have anyone buy it? And the Manassas people, when they heard about it they\u0027d know that what had happened here was all a sham, a set-up designed to drag them into the legal system and expose their corporate innards. They\u0027d respond with lawyers using every possible legal ploy to keep their secrets.\u003c/p\u003e\n\u003cp\u003eThey\u0027ll play hide, we\u0027ll play seek. A game.\u003c/p\u003e\n\u003cp\u003eBut this was no game to her. Romy was serious. She\u0027d show them just how serious.\u003c/p\u003e\n\u003cp\u003eActing quickly, before the dental assistant could unlock her office across the hall, Romy stepped under the fixture and yanked on the line.\u003c/p\u003e\n\u003cp\u003eHer cry of pain was real. \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-40.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
