{"id":111799,"no":42,"title":"Page 42","content":"\u003cp\u003ePatrick parted the curtains that separated Romy\u0027s treatment area from the rest of the bustling emergency room. She sat on the edge of a gurney, her head swathed in fresh gauze - but no seepage this time. She looked pale and tired, but even so, to Patrick she was a vision.\u003c/p\u003e\n\u003cp\u003e\"How are you feeling?\"\u003c/p\u003e\n\u003cp\u003eA wan smile. \"I\u0027ve got a killer headache but I\u0027ll survive.\"\u003c/p\u003e\n\u003cp\u003eHe leaned close. \"How\u0027d you get hurt?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve heard the expression, \u0027Shit happens\u0027? Well - \"\u003c/p\u003e\n\u003cp\u003ePatrick clapped his hands over his ears. \"The \u0027S\u0027 word! Saints preserve us!\" He wanted to throw his arms around her but made do with seating himself next to her on the gurney. \"Seriously. What happened?\"\u003c/p\u003e\n\u003cp\u003e\"This lighting fixture fell from the ceiling and clocked me on the noggin; things get a little fuzzy after that. Took the ER doc hours to get to me, then after she stitched up my scalp there were x-rays and - \"\u003c/p\u003e\n\u003cp\u003e\"How many stitches?\"\u003c/p\u003e\n\u003cp\u003e\"The doctor said seventeen.\"\u003c/p\u003e\n\u003cp\u003e\"Seventeen!\" The number horrified him.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not as bad as it sounds. She said she placed them close together to keep the scar thin.\"\u003c/p\u003e\n\u003cp\u003eScar?\"Jesus, Romy - \"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"Not like I\u0027m going to look like the bride of Frankenstein, or anything. It cut my scalp, way up above the hairline. Once the hair grows back where they shaved it, no one will know, not even me.\"\u003c/p\u003e\n\u003cp\u003eRelief seeped through Patrick. The lighting fixture had been his idea. If it had left Romy disfigured...\u003c/p\u003e\n\u003cp\u003e\"Why, Romy?\"\u003c/p\u003e\n\u003cp\u003e\"Relax, will you. I got a tetanus shot out of it, and a free ride in a stoplight-running ambulance. It\u0027s no biggie, Patrick. Really.\"\u003c/p\u003e\n\u003cp\u003e\"Is to me. Zero too.\" Patrick had driven him to the garage, then rushed back here. \"He wants me to call him as soon as - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll call him.\"\u003c/p\u003e\n\u003cp\u003e\"How many days are they going to keep you?\"\u003c/p\u003e\n\u003cp\u003e\"Days? More like minutes. They\u0027re finishing up my paperwork now.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re kidding!\" Patrick realized his knowledge of medicine was just this side of nothing, but wasn\u0027t it standard procedure to admit a head-trauma patient for observation, at least overnight? \"They\u0027re letting you go?\"\u003c/p\u003e\n\u003cp\u003e\"Be real, will you. It\u0027s just a cut on my head. I can - \"\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" said a male voice.\u003c/p\u003e\n\u003cp\u003ePatrick looked up and saw a dark-haired man in a gray suit standing between the parted curtains.\u003c/p\u003e\n\u003cp\u003e\"Are you her doctor?\" Patrick said. If so he was going to warn him about the malpractice risks of releasing Romy too early.\u003c/p\u003e\n\u003cp\u003eThe man flashed a collector\u0027s edition set of pearlies. \"Not a chance. I\u0027m an attorney and I\u0027m looking for the woman who was injured in the Manassas Ventures offices this morning.\"\u003c/p\u003e\n\u003cp\u003ePatrick stared at him. He\u0027d met his share of ambulance chasers, but this guy really lived up to the name.\u003c/p\u003e\n\u003cp\u003e\"That would be me.\" Romy shook her head. \"But I don\u0027t need a lawyer. I\u0027ve - \"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re absolutely right. And that\u0027s precisely why I\u0027m here.\" He handed Romy a card. \"Harold Rudner. I represent Manassas Ventures.\" He set his briefcase on the gurney and popped its latches. \"The company called me the instant its landlord informed it of this unfortunate incident. I was instructed to find you and compensate you immediately for the pain and inconvenience you have suffered.\"\u003c/p\u003e\n\u003cp\u003e\"Compensate me?\"\u003c/p\u003e\n\u003cp\u003eHe lifted the briefcase lid, removed a slip of paper, and extended it toward Romy.\u003c/p\u003e\n\u003cp\u003e\"Exactly. Although your injury resulted from shoddy work by remodeling contractors, Manassas is taking full responsibility and offering you this to ease your distress.\"\u003c/p\u003e\n\u003cp\u003eRomy took the slip and stared at it. \"A check? For a hundred thousand dollars?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" He pulled a sheaf of papers from the briefcase. \"And all you need do to have your name written on the pay-to-the-order-of line is sign this release absolving Manassas Ventures of all liability and refrain from any future - \"\u003c/p\u003e\n\u003cp\u003e\"Wow!\" Patrick said, impressed. \"Hit her while she\u0027s still dazed from the terrible concussive impact of her life-threatening head injury, then shove a check under her nose and tell her all those zeroes can be hers if she\u0027ll just sign away her legal rights to just compensation for an injury that might affect her quality of life for years, maybe decades, perhaps permanently. Youare a smoothy.\"\u003c/p\u003e\n\u003cp\u003eRomy and Rudner were staring at him.\u003c/p\u003e\n\u003cp\u003eFinally Rudner spoke. \"Are you her lawyer?\"\u003c/p\u003e\n\u003cp\u003e\"I am a very close personal friend who just happens to be an attorney.\"\u003c/p\u003e\n\u003cp\u003eRudner turned to Romy. \"I am offering you far more than you could hope to receive from any jury.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see about that,\" Patrick said. \"One hundred thousand dollars barely scratches the surface of the amount this unfortunate woman deserves for her pain and suffering.\"\u003c/p\u003e\n\u003cp\u003eRomy smiled and handed back the check. Rudner took it with a sad shake of his head.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re making a big mistake,\" he told her. \"One you\u0027ll regret when a jury offers you only a fraction of this - one third of which will go to your attorney. This could be all yours, every cent of it.\"\u003c/p\u003e\n\u003cp\u003eRomy\u0027s hands flew to her mouth as she gave Patrick a wide-eyed stare. \"Oh, Patrick! Am I making a terrible mistake? You know how I depend on your wisdom. Tell me. I don\u0027t know what to do!\"\u003c/p\u003e\n\u003cp\u003ePatrick had to look away. It took all his will to keep a straight face. When he had control, he turned back, took both her hands in his, and lowered his voice an octave. \"Trust me, my dear. I am well versed in these matters. You deserve much, much more.\"\u003c/p\u003e\n\u003cp\u003e\"All...all right,\" she said, her voice faltering. \"If you say so.\"\u003c/p\u003e\n\u003cp\u003eRudner shook his head again and closed his briefcase. As he lifted it off the gurney he turned to Patrick.\u003c/p\u003e\n\u003cp\u003e\"And you calledme a smoothy?\"\u003c/p\u003e\n\u003cp\u003eAs soon as he was gone they both doubled over in silent laughter.\u003c/p\u003e\n\u003cp\u003e\"Life-threatening head injury?\" Romy gasped, red-faced.\u003c/p\u003e\n\u003cp\u003ePatrick countered with, \"\u0027You know how I depend on your wisdom\u0027? I thought I was going to get a hernia!\"\u003c/p\u003e\n\u003cp\u003eShe pressed her hands against her temples. \"Oh, I shouldn\u0027t laugh! It makes my headache worse!\"\u003c/p\u003e\n\u003cp\u003ePatrick looked at her. \"I know this is serious business, but I couldn\u0027t resist. That was fun.\"\u003c/p\u003e\n\u003cp\u003eShe frowned. \"Do you think he knew who we were?\"\u003c/p\u003e\n\u003cp\u003e\"Not a clue. He\u0027s a hired gun.\" Patrick shook his head, still amazed at how quickly the company had responded. \"A hundred grand for a cut head offered to someone they might just as easily have charged with trespassing. If this is any indication of how badly Manassas wants to avoid the legal system, I think we\u0027re onto something.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-42.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
