{"id":111815,"no":59,"title":"Page 59","content":"\u003cp\u003eMANHATTAN\u003c/p\u003e\n\u003cp\u003e\"Really,\" Romy said as their cab climbed the on-ramp to the Brooklyn Bridge, \"this is unnecessary. I\u0027m more than capable of finding my own way home.\"\u003c/p\u003e\n\u003cp\u003e\"You heard what our friend said this afternoon,\" Patrick replied. \"\u0027Be careful.\u0027 And that\u0027s what we\u0027re doing.\"\u003c/p\u003e\n\u003cp\u003eBeside him, in the darkness of the rear seat, he saw her shake her head. \"An awfully long trip.\"\u003c/p\u003e\n\u003cp\u003e\"Not if I\u0027m with you.\"\u003c/p\u003e\n\u003cp\u003eLight from a passing car reflected off her smile. \"What a nice thing to say. But perhaps I should have phrased it a little differently: This is going to be an awfully longround trip.\"\u003c/p\u003e\n\u003cp\u003eAs the bejeweled towers of Lower Manhattan dwindled behind them, Patrick thought about the day. A good day. Any day with more ups than downs was a good day. After the shock of learning who was behind the SLA and the globulin farm murders had worn off, and Patrick had settled down from his initial elation over the news of the pregnant sim, they\u0027d brainstormed ways to find Meerm. Reverend Eckert\u0027s exhortation to his followers to track her down for him instead of for SimGen - a message he\u0027d be hammering into his viewers day after day - would help, but they still hadn\u0027t figured out a way to fit Tome into the equation.\u003c/p\u003e\n\u003cp\u003eAs darkness fell they\u0027d called it a day, Zero taking off in the van, and Romy accepting Patrick\u0027s invitation to dinner. They\u0027d walked downtown and found a bistro in Chelsea that looked inviting. A pair of Rob Roys before and a shared bottle of pinot noir during a meal of various pastas and sauces had left Patrick in a genial mood. He figured Romy, who\u0027d matched his Rob Roys with Cosmopolitans, had to be feeling mellow herself.\u003c/p\u003e\n\u003cp\u003e\"Am I that bad?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she said. \"Not bad at all.\" He felt her take his hand, interlace her fingers with his, and give it a little squeeze. \"In fact, you\u0027re good. Taking Tome in like you did is, well, I don\u0027t think I\u0027ve ever heard of anyone doing that for a sim.\"\u003c/p\u003e\n\u003cp\u003eShe rested her head on his shoulder. The scent of her hair and the wave of warmth seeping up from where their hands coupled enveloped Patrick, making him feel as if he were riding a cloud.\u003c/p\u003e\n\u003cp\u003eWhat is it with this woman? he wondered. We\u0027re only holding hands but it feels like we\u0027re having sex.\u003c/p\u003e\n\u003cp\u003eHe rode that cloud all the way to Brooklyn, and too soon they were stopped in front of a neat, four- story brick-faced building.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll walk you to your door,\" he said.\u003c/p\u003e\n\u003cp\u003eRomy shook her head. \"No, you won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to be careful, Romy...\"\u003c/p\u003e\n\u003cp\u003eShe leaned forward and kissed him lightly on the lips. \"You\u0027re not walking me to my door. You\u0027re coming up.\"\u003c/p\u003e\n\u003cp\u003e\"For a nightcap?\"\u003c/p\u003e\n\u003cp\u003e\"A drink, coffee, anything you want.\"\u003c/p\u003e\n\u003cp\u003ePatrick couldn\u0027t see Romy\u0027s face in the dimness, couldn\u0027t read her eyes. His first impulse was to ask her to repeat her last statement, but he feared she might take it as a wisecrack. Some sort of spell had been woven here tonight and he wasn\u0027t about to risk breaking it.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go,\" he said, and fumbled his wallet out of his pocket to pay the cabby.\u003c/p\u003e\n\u003cp\u003eThe stairway within was too narrow to ascend abreast so he had to follow Romy, which positioned her hips at eye level before him. Their rhythmic sway within her cleathre coat only exacerbated the electric ache in his groin.\u003c/p\u003e\n\u003cp\u003eThey stopped climbing at the third floor. Romy keyed open a door marked 3A. She stepped through, turned, and pulled Patrick inside. Without turning on the lights she slammed the door and slipped her arms around his neck. Patrick responded instinctively, pulling her close. His lips found hers, he felt her left leg sliding up the outside of his thigh as he slipped his right hand along her ribs toward her left breast -\u0026nbsp;\u0026nbsp; - and then the lights came on.\u003c/p\u003e\n\u003cp\u003eRomy spun, ending up beside him, hands out, ready to fight.\u003c/p\u003e\n\u003cp\u003eBut the blond-haired guy with one hand on the lamp switch held a silenced automatic in the other. A second man, his dark hair tied back in a neat little ponytail, sat in an easy chair and held an identical silenced pistol. Both wore dark suits and white shirts buttoned to the top.\u003c/p\u003e\n\u003cp\u003eThe seated man smiled as he spoke. \"Well, well. Look at this, won\u0027t you. A two-for-one special.\" He had a faint Texas accent.\u003c/p\u003e\n\u003cp\u003eAmazing how fast lust can fade - Patrick\u0027s insides had already turned to ice.\u003c/p\u003e\n\u003cp\u003e\"What do you want?\" Romy said.\u003c/p\u003e\n\u003cp\u003e\"You, Ms. Cadman,\" Ponytail said. \"Not for anything carnal, I\u0027m sorry to say, although I\u0027m sure that would prove to be a mutual pleasure. We simply wish to ask you some questions. And as long as your lawyer friend is here, we have questions for him as well.\"\u003c/p\u003e\n\u003cp\u003e\"Forget about it,\" she said, turning and reaching for the doorknob.\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t,\" Ponytail said. \"These silencers aren\u0027t in place for show. Wewill shoot if necessary. Not a killshot - a knee, a thigh, just to get across the point that we have questions that we intend to have answered. We can do this friendly, where no one gets hurt and you both walk away wound-free, or we can do it messy. I prefer the friendly path, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Friendly sounds good, Romy,\" Patrick whispered, nudging her with his elbow. \"Especially when we\u0027re outgunned two to zip.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t look at him. All he heard was a soft, \"Shit!\"\u003c/p\u003e\n\u003cp\u003ePatrick raised his hands, hearing the words to that old blues song about being a lover, not a fighter. \"Let\u0027s do friendly.\"\u003c/p\u003e\n\u003cp\u003e\"A practical man,\" said Ponytail. He rose and moved toward two ladder-back chairs sitting side by side on the carpet. \"We took the liberty of moving these in from the kitchen.\" He did a mocking, maitre d\u0027- type flourish. \"Both of you remove your coats and be seated, s\u0027il vous plait.\" It sounded weird with that Texas accent.\u003c/p\u003e\n\u003cp\u003ePatrick tossed his herringbone overcoat onto the couch and guided Romy to one of the chairs.\u003c/p\u003e\n\u003cp\u003e\"Portero sent you, didn\u0027t he?\" she said as he helped her out of her coat.\u003c/p\u003e\n\u003cp\u003e\"Portero...Portero...,\" Ponytail said slowly. \"No, I don\u0027t believe we\u0027ve met. Is she as pretty as you?\"\u003c/p\u003e\n\u003cp\u003eBlondy guffawed.\u003c/p\u003e\n\u003cp\u003eThat laugh says it all, Patrick thought as he seated Romy, threw her coat on the couch, then dropped into the other chair. He tried to relax but quailed as he felt the muzzle of Ponytail\u0027s silencer suddenly press against his temple.\u003c/p\u003e\n\u003cp\u003e\"Ms. Cadman,\" the man said, \"my associate will put down his weapon while he affixes you to the chair. You will allow him to do so without resistance. If you resist you will end up with a very messy carpet and we will be faced with the unfortunate circumstance of having only one person to interrogate.\"\u003c/p\u003e\n\u003cp\u003ePatrick\u0027s bladder clenched. He wasn\u0027t cut out for this. He\u0027d been trained to pose logical arguments based on law and precedent in an arena overseen by a supposedly impartial magistrate. If he won, great; if he lost, at least he could walk away knowing - hopefully - that he\u0027d acquitted himself well in the contest. But this...the loser here didn\u0027t walk anywhere.\u003c/p\u003e\n\u003cp\u003eThe blond guy laid his pistol on the carpet far from Romy. He produced a roll of aluminum duct tape and began taping her arms and legs to the chair. When he finished he bent over her and cupped one of her breasts in his hand.\u003c/p\u003e\n\u003cp\u003e\"Nice,\" he said, grinning.\u003c/p\u003e\n\u003cp\u003eRomy jerked her head forward, ramming it into his face. He staggered back, clutching his nose. When he recovered he bared his teeth, cocked his fist, and started toward her.\u003c/p\u003e\n\u003cp\u003e\"Uh-uh-uh!\" said Ponytail in a schoolmarm tone. \"Mustn\u0027t mar the merchandise. Tape up Mr. Sullivan, please.\"\u003c/p\u003e\n\u003cp\u003eScowling, Blondy taped Patrick to his chair, winding it blood-stoppingly tight. When he finished, he retrieved his weapon from the floor and holstered it inside his jacket.\u003c/p\u003e\n\u003cp\u003eBut he wasn\u0027t quite finished. He stepped over to Romy and grabbed the tip of her breast through her sweater. He gave the nipple a vicious twist and said, \"Thatwon\u0027t mar the merchandise.\"\u003c/p\u003e\n\u003cp\u003eRomy winced but didn\u0027t give him an iota more.\u003c/p\u003e\n\u003cp\u003ePatrick twisted against his bonds. \"You shit!\" He didn\u0027t kid himself about being a tough guy but the way he felt at that moment left no doubt he could kill the bastard.\u003c/p\u003e\n\u003cp\u003e\"All right now,\" Ponytail said, holstering his own weapon under his left arm and pulling a leather case from under his right. \"Enough fun and games. Let\u0027s playWho Wants To Spill The Beans? \"\u003c/p\u003e\n\u003cp\u003eHe snapped open the case, revealing an inoculator and two vials of amber fluid. He loaded one of the vials into the chamber of the inoculator, then pulled a recorder out of his pocket and set it on the coffee table.\u003c/p\u003e\n\u003cp\u003e\"Now,\" he said, smiling. \"Who wants to be first? Let\u0027s see...eenie, meenie - \"\u003c/p\u003e\n\u003cp\u003eA softthump sounded from an adjoining room.\u003c/p\u003e\n\u003cp\u003e\"What was that?\" Ponytail said.\u003c/p\u003e\n\u003cp\u003eBlondy shook his head. \"Don\u0027t know. I checked it out when we got here. It was empty.\"\u003c/p\u003e\n\u003cp\u003e\"Probably just my cat,\" Romy said.\u003c/p\u003e\n\u003cp\u003ePonytail snarled, \"You don\u0027thave a cat!\" He jerked his head toward the doorway and told Blondy, \"That could have been the window. Check again.\"\u003c/p\u003e\n\u003cp\u003eBlondy pulled his gun and edged into the dark doorway. He poked his head inside, looked around, then reached his free hand inside for the light switch.\u003c/p\u003e\n\u003cp\u003eAnd then - Patrick couldn\u0027t be sure - it looked like he either tripped and fell into the room or something pulled him in. Whatever the cause, one second Blondy was there, leaning through the doorway, the next he wasn\u0027t. A faint sound, something like a strangled grunt came from within, followed by a thump - it didn\u0027t sound heavy enough for a falling-body thump; maybe just a dropped- gun thump.\u003c/p\u003e\n\u003cp\u003e\"Duke?\" Ponytail said. He placed the inoculator kit on the coffee table next to the recorder and retrieved the pistol from under his suit coat. \"Duke, are you okay?\"\u003c/p\u003e\n\u003cp\u003eNo answer from the bedroom.\u003c/p\u003e\n\u003cp\u003ePonytail edged toward the doorway, pointing his pistol at Romy\u0027s head. \"I don\u0027t know what kind of shit\u0027s going down here, but if anything untoward happens, you go first.\"\u003c/p\u003e\n\u003cp\u003eThe first thought that ran though Patrick\u0027s mind was,Untoward ? Did he really sayuntoward ?\u003c/p\u003e\n\u003cp\u003ePonytail reached the doorway. He peeked around the molding and suddenly cried out, reeling back as Duke\u0027s limp body came flying out of the room to crash against him. He grunted as he tumbled to the floor, his pistol discharging and sending a bullet over Romy\u0027s head to punch a fist-size chunk of plaster out of the wall above one of the windows.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t get a chance for a second shot because Duke\u0027s body wasn\u0027t the only thing flying through the doorway. Something else followed directly behind - a snarling, barrel-chested apparition in a sleeveless black coverall, its furry, black-eyed head split open to reveal yellow teeth and a pair of huge fangs in the upper jaw. But even more frightening was the scarlet coloring that blazed along its upper snout as it flew through the air, long arms outstretched, fingers curved into claws.\u003c/p\u003e\n\u003cp\u003ePonytail let out a panicked bleat at the sight of it, and Patrick caught an odd light in the man\u0027s eyes; shock and terror, yes, but something else: recognition.\u003c/p\u003e\n\u003cp\u003eHe tried to bring his pistol around but it was knocked from his grasp and sent skittering across the floor.\u003c/p\u003e\n\u003cp\u003eHe wailed, \"Kree - !\" but whatever he intended to say was choked off as long fingers wrapped around his throat and squeezed.\u003c/p\u003e\n\u003cp\u003ePatrick was just registering that they might be in worse trouble now than a moment ago, when Romy started talking to the thing.\u003c/p\u003e\n\u003cp\u003e\"Kek! Don\u0027t kill him, Kek! We need him alive!\"\u003c/p\u003e\n\u003cp\u003e\"Youknow this thing?\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t respond but stayed focused on the creature that continued to throttle Ponytail. The man\u0027s mouth worked spasmodically as his eyes bulged and his face purpled.\u003c/p\u003e\n\u003cp\u003e\"Kek! Let go! Let go now!\"\u003c/p\u003e\n\u003cp\u003eFinally her words seemed to get through to the thing. It released its stranglehold and leaped up, but it didn\u0027t stay still, didn\u0027t seem able to. It wandered back and forth, growling, flailing at the air, as if working off a rage. On the floor, Ponytail coughed and retched, sucking in air, but it was purely reflexive. He was out cold.\u003c/p\u003e\n\u003cp\u003eAs for Duke, he wasn\u0027t breathing at all. And the unnatural angle of his head on his shoulders made it clear that he would never breathe again.\u003c/p\u003e\n\u003cp\u003eNipple-twisting bastard, Patrick thought. Good riddance.\u003c/p\u003e\n\u003cp\u003e\"Good, Kek,\" Romy was saying in a soothing voice. \"You did good, very good. Zero will be so proud of you.\"\u003c/p\u003e\n\u003cp\u003eThat seemed to calm the beast. It stopped its agitated pacing and cocked its head as its dark eyes peered at Romy from beneath a prominent brow. The crimson coloring atop its snout was fading. Still staring at Romy it made a chirping sound.\u003c/p\u003e\n\u003cp\u003ePatrick didn\u0027t know what to think. It looked like some bizarre sort of gorilla, but nothing like Patrick had ever seen in any zoo he\u0027d visited. More like a mutant sim who\u0027d overdosed on steroids. The creature seemed to be on their side, but just barely. Patrick had never sensed so much aggression packed into a single being.\u003c/p\u003e\n\u003cp\u003e\"Whatis that thing, Romy?\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"Just be calm,\" she said, nodding and smiling at the creature. \"He\u0027s been told you\u0027re on our side but he doesn\u0027t know you, so he\u0027s not sure of you. Whatever you do, don\u0027t make any sudden moves.\"\u003c/p\u003e\n\u003cp\u003eHe glanced down at his duct-taped legs and arms. \"As if I have a choice.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m about to remedy that.\" She looked at the creature. \"Kek, you\u0027ve got to cut me free,\" she said softly, as if talking to a child. \"So I can call Zero. Use your knife to cut me free.\"\u003c/p\u003e\n\u003cp\u003eKek unsnapped a safety strap from a scabbard attached to the belt around its waist - Patrick hadn\u0027t noticed the belt till now - and whipped out one of those huge, saw-toothed Special Forces knives.\u003c/p\u003e\n\u003cp\u003ePatrick\u0027s gut clenched. \"Oh, Christ! Someone gave that thing a knife?\"\u003c/p\u003e\n\u003cp\u003e\"Quiet!\" Romy hissed. \"Kek\u0027s a \u0027he,\u0027 and you owe him.\"\u003c/p\u003e\n\u003cp\u003e\"I know, but - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not talking about tonight. Now be quiet and I\u0027ll explain later.\" She turned back to Kek and dipped her head toward the tape around her right arm. \"Could you cut that, Kek? I can\u0027t call Zero and tell him what a good job you did until you cut that tape.\"\u003c/p\u003e\n\u003cp\u003eKek loped over and Patrick gasped as the creature raised the knife and, in a move so casual in manner yet so blindingly fast in execution, slashed the duct tape with a single thrust. He expected blood to gush from Romy\u0027s wrist, but only the tape parted, leaving her without a scratch.\u003c/p\u003e\n\u003cp\u003e\"Good job!\" she said as she wriggled that arm free and began the laborious task of unwinding the tape trapping her left wrist.\u003c/p\u003e\n\u003cp\u003e\"Ask him if you can borrow his knife,\" Patrick said. \"To speed things up.\" Being trapped in this chair was making him claustrophobic.\u003c/p\u003e\n\u003cp\u003eShe gave him a rueful smile. \"I wouldn\u0027t advise you or anyone else to try to take Kek\u0027s knife away from him. Even if you say, \u0027Pretty please.\u0027\"\u003c/p\u003e\n\u003cp\u003eShe freed her left and, then began to work on her legs. As she did, Kek retreated to a corner where he squatted and watched.\u003c/p\u003e\n\u003cp\u003eWhen she was finally free she rose and walked away.\u003c/p\u003e\n\u003cp\u003e\"Hey!\" Patrick said. \"What about me?\"\u003c/p\u003e\n\u003cp\u003eShe stepped through an alcove and Patrick heard the rattle of cutlery from within. A moment later she emerged holding a wicked looking carving knife.\u003c/p\u003e\n\u003cp\u003e\"Ginsu,\" she said. \"Cuts through tin cans.\"\u003c/p\u003e\n\u003cp\u003e\"But will it cut duct tape?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003eIt did, of course, and seconds later Patrick was free. He started to rise, then sat back down. He looked at the two men on the floor, one dead, the other halfway there, then at the creature squatting against the wall, watching them, and felt weak, as if someone had pulled a drainage plug from his ankle and all his energy had run out.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on, Romy? What have we got ourselves into?\"\u003c/p\u003e\n\u003cp\u003e\"Life!\" she said, turning, bending at the waist, and leaning toward him. \"Don\u0027t you feel alive, more alive than you\u0027ve ever felt in your life?\" She held the Ginsu blade before her face. \"This is it! This is the cutting edge! This is where your vote is counted! This is where you make a difference!\"\u003c/p\u003e\n\u003cp\u003eShe\u0027s high, he thought. Stoked on adrenaline. And me? A total wreck.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re very scary right now,\" he told her.\u003c/p\u003e\n\u003cp\u003e\"Am I?\" She straightened. \"Sorry. That was someone else talking.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Never mind.\" She pointed to the unconscious man. \"Can you believe it? We\u0027ve finally got one of them!\"\u003c/p\u003e\n\u003cp\u003e\"One of who?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re from Manassas, or whoever\u0027s behind Manassas. And the people behind Manassas are behind SimGen. This blows the lid off, breaks everything wide open. We\u0027re finally going to get some answers.\"\u003c/p\u003e\n\u003cp\u003e\"What if he doesn\u0027t want to talk?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, he\u0027ll talk.\" She turned and lifted the inoculator from the kit on the coffee table. \"Do unto others what they were about to do to you, right?\"\u003c/p\u003e\n\u003cp\u003ePatrick stared at the amber liquid in the vial. They\u0027d been about to inject some of that into Romy and him.\u003c/p\u003e\n\u003cp\u003e\"You think that\u0027s the truth drug we heard about? The one they found in the dead globulin farmers?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Totuus. I\u0027d bet my soul.\"\u003c/p\u003e\n\u003cp\u003e\"And then what?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" She gestured to the dead man. \"Maybe we\u0027d have ended up like him.\"\u003c/p\u003e\n\u003cp\u003e\"Speaking of him, how do we explain a dead body to the police?\"\u003c/p\u003e\n\u003cp\u003e\"We won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t very well say he broke his own neck.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure Zero will have a way to handle it.\"\u003c/p\u003e\n\u003cp\u003eRomy picked up her coat from the floor. \"Kek, you did good,\" she said soothingly to the creature as she rummaged in a pocket.\u003c/p\u003e\n\u003cp\u003ePatrick noticed that the red coloration had faded completely from its snout, replaced now by a bright blue.\u003c/p\u003e\n\u003cp\u003e\"Can I ask again: Whatis he?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027m sorry,\" she said as she pulled a phone from the coat pocket. \"I\u0027ll introduce you.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003eShe motioned to the creature. \"Come over here, Kek. I want you to meet Mister Sullivan.\"\u003c/p\u003e\n\u003cp\u003e\"Really,\" Patrick said out of the corner of his mouth as Kek rose and started toward them. Something about this creature stirred a primal fear in him. And the way its gaze veered to Patrick\u0027s left and right, never making eye contact, didn\u0027t help. \"That\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003e\"Kek,\" Romy said, \"shake hands with our new friend, Patrick Sullivan. And Patrick, meet the fellow who saved your life back in October.\"\u003c/p\u003e\n\u003cp\u003e\"My life? You mean, when we were knocked off the Saw Mill?\"\u003c/p\u003e\n\u003cp\u003eAs Romy nodded Patrick relived the moment in the inky grove as the massive arms of the man named Ricker wrapped around his head and shoulders, felt them tense as he prepared to snap Patrick\u0027s neck, and then the sudden release. Moments later, Ricker and his friend were dead.\u003c/p\u003e\n\u003cp\u003eHe considered Kek\u0027s muscular arms, sensed the power in the thick shoulders bulging through the sleeveless coverall. Yes, power to spare, more than enough to take out two hardened pros, especially if they didn\u0027t see him coming.\u003c/p\u003e\n\u003cp\u003e\"I guess I owe you big time, Kek,\" Patrick said, thrusting out his hand. He still didn\u0027t know what kind of mutant monkey thing stood before him, but he most definitely wanted Kek on his side. \"It\u0027s a pleasure to meet you. Thank you for saving my life. Thank you very much.\"\u003c/p\u003e\n\u003cp\u003eKek pulled back his shoulders and puffed out his chest. Finally he made eye contact. His hand was warm and dry as his long fingers wrapped around Patrick\u0027s. He bared his teeth, revealing those fangs. An attempt at a smile?\u003c/p\u003e\n\u003cp\u003e\"Does he speak?\" Patrick said.\u003c/p\u003e\n\u003cp\u003e\"Not more than a few syllables - one of them being \u0027Kek.\u0027 But he understands speech and he signs.\"\u003c/p\u003e\n\u003cp\u003eKek released Patrick\u0027s hand and turned to the two men on the floor. Ponytail groaned and stirred. Kek bent, grabbed the man\u0027s hair, and slammed his head against the floor.\u003c/p\u003e\n\u003cp\u003e\"Easy, Kek,\" Romy said. \"We don\u0027t want to scramble his brains.\"\u003c/p\u003e\n\u003cp\u003e\"Whatdo we want to do?\" Patrick said.\u003c/p\u003e\n\u003cp\u003eRomy said, \"Zero,\" to her PCA, then smiled. \"That\u0027s what I\u0027m about to find out.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-59.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
