{"id":111817,"no":61,"title":"Page 61","content":"\u003cp\u003e\"You know,\" Patrick told Zero after they\u0027d pulled into the West Side garage and the door had closed behind their van, \"I could get used to this. And that worries me.\"\u003c/p\u003e\n\u003cp\u003eThe cascade of emotions from the threats and the violence had faded now, leaving him oddly exhilarated. But it had been harrowing.\u003c/p\u003e\n\u003cp\u003eWhen Romy had called Zero they\u0027d learned that he had an escape route all worked out. Following his instructions, they\u0027d taken the stairs to the roof - Romy in the lead, Patrick bringing up the rear, Kek in the middle carrying their two attackers, one over each shoulder. Romy\u0027s was the second of four joined buildings. They\u0027d walked across two neighboring roofs to a ledge where a fire escape led down to an alley. After a short but nerve-wracking wait, Zero\u0027s battered Econoline pulled up and they\u0027d all climbed aboard.\u003c/p\u003e\n\u003cp\u003ePatrick had handled the driving on the way back, with Zero in the passenger seat, and Romy in the middle. That was when his mood had begun to change. They\u0027d done it! They\u0027d faced murderous opposition and - with no little help from Kek - overcome it. They were wheeling away with no one in pursuit, no one even aware that they\u0027d turned the tables.\u003c/p\u003e\n\u003cp\u003eAs soon as they\u0027d reached Manhattan they found a deserted spot under the FDR Drive where they leaned Duke\u0027s corpse against a steel support. Throughout the night anyone who saw him would think he was passed out drunk; in the morning light they\u0027d think differently. Patrick then piloted the van across town with Duke\u0027s unconscious partner.\u003c/p\u003e\n\u003cp\u003eMasked as usual, Zero stepped out of the passenger door and regarded Patrick through his dark glasses. \"Yes. It\u0027s the high of victory. Not a good thing to get too used to. You can\u0027t expect to win all the time.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" Patrick opened his door and hopped out. \"But after all the bad news, after being pushed around and running into wall after wall, this feels very, very good. It\u0027ll feel even better if it turns out that one of these two poisoned my clients.\u003c/p\u003e\n\u003cp\u003e\"And maybe,\" Romy said, taking the hand he offered to help her out of the van, \"he\u0027s one of the SLA creeps who butchered the globulin farm sims as well.\"\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t that be sweet.\"\u003c/p\u003e\n\u003cp\u003eZero leaned back inside and spoke toward the darkened rear section. \"Kek. Tape the man into the chair by the wall.\"\u003c/p\u003e\n\u003cp\u003eThey\u0027d brought everything along - the tape, the inoculator kit, the silenced pistols. Neither man had carried any identification.\u003c/p\u003e\n\u003cp\u003ePoetic justice, Patrick thought as he watched Kek get to work. Bound with his own tape, injected with his own truth drug.\u003c/p\u003e\n\u003cp\u003eHe looked around, noticing how his senses felt heightened. Despite the low light in the garage, he seemed to see everything with day-bright clarity. The tang of gasoline and the heavier odor of DW-40 were sharp in the air; the ticking of the van\u0027s cooling engine was like a ball-peen hammer rapping an anvil.\u003c/p\u003e\n\u003cp\u003eZero was away from the van now, moving to the darker shadows of a corner. Why wouldn\u0027t he let anyone see his face? What was he afraid of?\u003c/p\u003e\n\u003cp\u003ePatrick followed him, but not too closely. \"What is he and where did you find him?\" he said, pointing to Kek.\u003c/p\u003e\n\u003cp\u003e\"In Idaho. Last year.\"\u003c/p\u003e\n\u003cp\u003e\"Idaho?\" Romy said. \"You never told me that. I thought you\u0027d found him around SimGen.\"\u003c/p\u003e\n\u003cp\u003eZero shrugged. \"Sorry. It never came up. And it didn\u0027t seem to matter until you saw that Idaho license plate on the SimGen campus.\"\u003c/p\u003e\n\u003cp\u003e\"I wondered why you were so psyched about that.\"\u003c/p\u003e\n\u003cp\u003e\"How do you just happen to \u0027find\u0027 something like him in Idaho?\" Patrick asked.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you remember hearing reports of people claiming they\u0027d spotted Bigfoot in Idaho last winter?\"\u003c/p\u003e\n\u003cp\u003e\"Vaguely. I try not to devote too many memory cells to that sort of thing.\"\u003c/p\u003e\n\u003cp\u003e\"I do...if it sounds furry like a sim. I sent a couple of volunteers out there to track down the sightings, and they returned with Kek, suffering from starvation, frostbite, and half dead from exposure. Dr. Cannon and I nursed him back to health and - \"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s Dr. Cannon?\"\u003c/p\u003e\n\u003cp\u003e\"You met her at Beacon Ridge,\" Romy said. \"She was the woman doctor who tried to save the poisoned sims.\"\u003c/p\u003e\n\u003cp\u003e\"Right,\" Patrick said. \"I remember her. But whatis Kek? Where did he come from?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Zero replied, watching as the creature taped the still unconscious Ponytail into the chair. \"But he\u0027s obviously the product of a recombinant lab, an advanced one. He looks to be part mandrill and part gorilla, and I\u0027d be very surprised if he didn\u0027t have a fair amount of human DNA spliced into his genome as well.\"\u003c/p\u003e\n\u003cp\u003ePatrick shook his head in wonder. \"He\u0027s scary looking.\"\u003c/p\u003e\n\u003cp\u003e\"I doubt that\u0027s by accident. Nor his aggressiveness.\"\u003c/p\u003e\n\u003cp\u003e\"But why?\" Kek had finished his task and now squatted by the prisoner, his eyes fixed on Zero as he awaited further instructions. \"Who\u0027d want to create something like that?\"\u003c/p\u003e\n\u003cp\u003eZero walked back to the cab of the van and reached through the window. \"I\u0027ll show you.\" He withdrew one of the silenced pistols and held it up. \"A .45 caliber HK SOCOM. Ever seen one before?\"\u003c/p\u003e\n\u003cp\u003e\"Never,\" Patrick said. \"What\u0027s \u0027HK\u0027 mean? Hong Kong?\"\u003c/p\u003e\n\u003cp\u003eZero laughed. \"Hardly.\" He swiveled the pistol toward Romy. \"Romy? Know it?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Heckler and Koch, but beyond that...sorry, no.\"\u003c/p\u003e\n\u003cp\u003e\"Heckler and Koch Mk 23 Special Operations Command model. Its barrel comes threaded and suppresser ready.\" Zero held it out to Kek. \"Kek? Would you break this down for me please?\"\u003c/p\u003e\n\u003cp\u003e\"Are you nuts?\" Patrick whispered as Kek loped forward. \"That\u0027s a loaded weapon!\"\u003c/p\u003e\n\u003cp\u003eZero didn\u0027t respond. He placed the pistol in Kek\u0027s outstretched hand and said, \"You can use that workbench over there.\"\u003c/p\u003e\n\u003cp\u003eKek took the pistol and inspected it, turning it over in his hands a few times before he ejected the clip and then worked the slide to remove the chambered round.\u003c/p\u003e\n\u003cp\u003e\"He knows guns!\" Patrick said, his voice hushed in awe.\u003c/p\u003e\n\u003cp\u003e\"You ain\u0027t seen nuthin yet,\" Romy told him.\u003c/p\u003e\n\u003cp\u003eKek stepped over to the workbench and Patrick watched in amazement as his long, nimble fingers removed the silencer and disassembled the gun with practiced speed, then arranged its innards for inspection, all in less than thirty seconds. When finished he took one step back and stood with his hands behind his back, awaiting approval.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s military!\" Patrick said.\u003c/p\u003e\n\u003cp\u003e\"Or paramilitary. Or perhaps intended as some sort of semi-human mercenary. Who can say? But he can break down just about any weapon you hand him, and he knows no fear.\"\u003c/p\u003e\n\u003cp\u003e\"A perfect soldier.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe not perfect, but damn near.\"\u003c/p\u003e\n\u003cp\u003e\"What happened to his left hand?\" Patrick said as he noticed that Kek\u0027s ring and pinkie fingers were missing a joint or two.\u003c/p\u003e\n\u003cp\u003e\"Frostbite,\" Zero replied.\u003c/p\u003e\n\u003cp\u003e\"So he owes his life to you?\"\u003c/p\u003e\n\u003cp\u003e\"And Kek knows it,\" Romy said. \"He\u0027s totally devoted to Zero.\"\u003c/p\u003e\n\u003cp\u003e\"An overstatement, I assure you,\" Zero said.\u003c/p\u003e\n\u003cp\u003ePatrick didn\u0027t think so. He\u0027d noticed that Kek\u0027s eyes had stayed focused on Zero since his arrival. Even now, as he awaited approval of his breakdown of the pistol, his eyes never left Zero.\u003c/p\u003e\n\u003cp\u003e\"I believe he\u0027s waiting for your okay,\" Patrick said.\u003c/p\u003e\n\u003cp\u003e\"Oh, sorry,\" Zero replied. He saluted Kek and said, \"Excellent job, my friend. Please reassemble it.\"\u003c/p\u003e\n\u003cp\u003ePatrick had no way to gauge this creature\u0027s emotions, but he sensed a burst of pride and pleasure in response to Zero\u0027s approval. Oh, yes, Kek might be hell on wheels when it came to confronting an enemy, but he was Zero\u0027s kitty cat.\u003c/p\u003e\n\u003cp\u003e\"Who made him?\" Patrick said as Kek\u0027s flying fingers clicked the pieces back into place. \"SimGen?\"\u003c/p\u003e\n\u003cp\u003e\"The most likely suspect,\" Zero said.\u003c/p\u003e\n\u003cp\u003e\"But if so, how did he get from New Jersey to Idaho?\"\u003c/p\u003e\n\u003cp\u003e\"Our guess is he was put aboard a truck from the SimGen basic research facility; the truck was driven aboard a plane at the SimGen airstrip and flown to Idaho.\"\u003c/p\u003e\n\u003cp\u003e\"Why Idaho?\"\u003c/p\u003e\n\u003cp\u003e\"Because it\u0027s largely empty. Because you can buy big parcels of land that allow you to operate in near absolute privacy.\"\u003c/p\u003e\n\u003cp\u003e\"But who?\" Patrick said. \"Who wants to operate in secrecy? Who wants to stockpile a bunch of Keks?\"\u003c/p\u003e\n\u003cp\u003e\"Kek might be just one of many new species quartered in the hinterlands.\"\u003c/p\u003e\n\u003cp\u003eThe possibilities made Patrick more than a little queasy. \"There\u0027s a thought to take to bed with you.\"\u003c/p\u003e\n\u003cp\u003eJust then Ponytail stirred, groaned, and lifted his head.\u003c/p\u003e\n\u003cp\u003eZero glanced his way and said, \"A font of information on these very subjects is about to become available to us. I hope.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you have to hope,\" Patrick said. \"I\u0027d swear he recognized Kek when he jumped him. He even tried to say something. It sounded like, \u0027Kree - \u0027 but he never got to finish it.\"\u003c/p\u003e\n\u003cp\u003ePonytail\u0027s eyes were glazed and it was obvious to Patrick he had no idea where he was or why he was tied up or what was going on. Tell him he\u0027s at an S \u0026amp; M beerfest in Sydney and he\u0027d buy it. After ten seconds or so his chin dropped back onto his chest.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have to ask him about that,\" Zero said. \"He should be ready to talk soon.\" He turned to Kek. \"Take your position upstairs at the window now.\"\u003c/p\u003e\n\u003cp\u003eKek turned and scrambled up a metal ladder affixed to the rear wall.\u003c/p\u003e\n\u003cp\u003e\"The garage comes with a loft,\" Zero said. \"The window up there affords an excellent view of the street. It also serves as Kek\u0027s home.\"\u003c/p\u003e\n\u003cp\u003e\"So it was him I saw peeking down on us that day,\" Patrick said.\u003c/p\u003e\n\u003cp\u003eZero nodded. \"Kek has a curious nature.\" He turned to Romy. \"Where did we put that inoculator kit?\"\u003c/p\u003e\n\u003cp\u003e\"Right here,\" Romy said, and handed it to him.\u003c/p\u003e\n\u003cp\u003e\"The moment of truth, as it were,\" Zero said, opening the kit as he approached the captive. \"Now we find out if Luca Portero is as involved as we think he is.\"\u003c/p\u003e\n\u003cp\u003e\"How safe is that stuff?\" said Patrick, eyeing the amber fluid in the inoculator\u0027s chamber.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never used it,\" Zero said. \"But they were willing to dose you up with it. Any objections to returning the favor?\"\u003c/p\u003e\n\u003cp\u003e\"None at all,\" Patrick said.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t think so.\" He handed the inoculator to Romy. \"Would you do the honors?\"\u003c/p\u003e\n\u003cp\u003e\"My pleasure,\" she said.\u003c/p\u003e\n\u003cp\u003eShe tilted Ponytail\u0027s head to the side, exposing his neck.\u003c/p\u003e\n\u003cp\u003e\"You know what you\u0027re doing?\" Patrick said.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Used to work research. Injected a lot of animals before I decided I\u0027d rather work the other side of the street.\"\u003c/p\u003e\n\u003cp\u003eShe placed the business end of the inoculator gun against the side of Ponytail\u0027s neck. She look as if she were about to execute him.\u003c/p\u003e\n\u003cp\u003e\"What about the dose?\" Patrick said. \"How do you know how much to give?\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t the faintest. But this is the dose he was planning to put into us, so that\u0027s what goes into him.\"\u003c/p\u003e\n\u003cp\u003e\"And if it\u0027s too much?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"That\u0027ll be his problem, won\u0027t it.\"\u003c/p\u003e\n\u003cp\u003ePatrick realized he was seeing another side of Romy, a new persona, cold, efficient, almost ruthless in simmering fury. Was this the \"someone else\" she\u0027d mentioned before? Not that he could blame her: This man had invaded her home, bound her, watched as his partner had mistreated her, and had been about to invade the very core of her privacy - her mind. Add to all that the possibility that he might have had a hand in the deaths of dozens of sims and the guy was lucky she wasn\u0027t jabbing the inoculator into his eye.\u003c/p\u003e\n\u003cp\u003ePatrick felt his shoulders bunch as the Romy pressed the trigger and injected the liquid through the skin of Ponytail\u0027s neck with a softpop .\u003c/p\u003e\n\u003cp\u003eThe man flinched, his eyes fluttered open. He raised his head and looked around, dazed. Patrick saw the purpling welts on his throat, mementos of Kek\u0027s fingers. He blinked. Patrick watched a look of utter horror flow through his features when he saw the inoculator in Romy\u0027s hand.\u003c/p\u003e\n\u003cp\u003e\"No!\" he rasped, his voice barely audible through his bruised larynx. \"You didn\u0027t! Please tell me you didn\u0027t!\"\u003c/p\u003e\n\u003cp\u003eRomy bounced the inoculator in her hand. \"Shoot you up with your own junk? You bet we did.\"\u003c/p\u003e\n\u003cp\u003e\"Not Totuus!\"\u003c/p\u003e\n\u003cp\u003e\"If that\u0027s what\u0027s in your vial, then, yes, Totuus.\"\u003c/p\u003e\n\u003cp\u003eAnd then Ponytail did something that took Patrick completely by surprise: His face screwed up and he began to sob. Romy took a step back and regarded him with mute shock.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t have to do that!\" he squeaked in his laryngitis voice. \"I would have told you! I would have told you anything you wanted to know!\"\u003c/p\u003e\n\u003cp\u003e\"Sure, you would have,\" Romy said. \"And we would have been able to take every word to the bank, right?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong with him?\" Patrick said, turning to Zero. The man\u0027s genuine terror was getting to him. \"What don\u0027t we know about this drug?\"\u003c/p\u003e\n\u003cp\u003eZero\u0027s expression was unreadable behind his ski mask, but his tone was puzzled. \"I researched it after hearing that it had been found in the globulin farmers\u0027 bodies. Its main side effect is a headache for about a day afterwards.\"\u003c/p\u003e\n\u003cp\u003eRomy seemed unfazed by the man\u0027s abject terror. She pressed the redRECORD button on his own recorder and held it before his face.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s your name?\" she said.\u003c/p\u003e\n\u003cp\u003ePonytail squeezed his eyes shut and gritted his teeth, fighting the drug and the question.\u003c/p\u003e\n\u003cp\u003e\"Come on,\" Romy cooed. \"This is a simple one. Your name...what is your name?\"\u003c/p\u003e\n\u003cp\u003eThe man\u0027s face reddened with effort, then the words broke free in a hoarse rush: \"David Daniel Palmer!\"\u003c/p\u003e\n\u003cp\u003e\"Excellent. Now, Mr. David Daniel Palmer, who sent you?\"\u003c/p\u003e\n\u003cp\u003eHe began to blubber again. \"Please don\u0027t ask me that! Please!\"\u003c/p\u003e\n\u003cp\u003e\"And if I\u0027d begged you not to shoot me up with this stuff an hour ago, you would have spared me, right?\"\u003c/p\u003e\n\u003cp\u003e\"Please!\"\u003c/p\u003e\n\u003cp\u003eRomy\u0027s voice hardened. \"Stop stalling! Tell me now: Who do you work for?\"\u003c/p\u003e\n\u003cp\u003eParker screwed up his face, chewed on his lips, then blurted through a sob, \"SIRG - \"\u003c/p\u003e\n\u003cp\u003eBut as soon as the word escaped him, his eyes rolled back in his head. He stiffened, bared his teeth, and began to shake, violently enough to start his chair walking across the floor.\u003c/p\u003e\n\u003cp\u003e\"Ohmigod!\" Romy cried. \"What\u0027s happening?\"\u003c/p\u003e\n\u003cp\u003eZero leaped forward. \"He\u0027s having some sort of seizure! If he swallows his tongue he\u0027ll choke to death!\"\u003c/p\u003e\n\u003cp\u003ePatrick watched in horror as Zero\u0027s gloved hands worked past Palmer\u0027s foam-flecked lips, trying to pry open his jaws.\u003c/p\u003e\n\u003cp\u003eAnd then as suddenly as the attack had started, it stopped. Palmer drooped in his chair, breathing raggedly, his eyes glazed.\u003c/p\u003e\n\u003cp\u003e\"Daniel Palmer,\" Zero said, leaning close, all but shouting. \"Are you all right?\"\u003c/p\u003e\n\u003cp\u003ePalmer mumbled something.\u003c/p\u003e\n\u003cp\u003eZero shook his shoulder. \"I said, are you all right?\"\u003c/p\u003e\n\u003cp\u003ePalmer stared at him as if he were speaking a foreign language, then said, \"Crash want rag lay hedge knock two.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Zero said.\u003c/p\u003e\n\u003cp\u003e\"Numb bag five sense peel drawer another stop see.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s lost his mind!\" Romy said, her hand over her mouth. The cold bitch goddess with the inoculator and the tape recorder was gone, and she was back to the Romy Patrick knew...or thought he did. \"Did I do this? Is this my fault?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Zero said. \"I\u0027ve never seen or heard of anything like it.\" He glanced at Romy and Patrick. \"There\u0027s also the possibility he\u0027s faking.\"\u003c/p\u003e\n\u003cp\u003e\"He gets an Oscar if he is,\" Patrick said.\u003c/p\u003e\n\u003cp\u003eZero leaned close again: \"What\u0027s your name?\"\u003c/p\u003e\n\u003cp\u003e\"Realize game attached.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God!\" Romy whispered.\u003c/p\u003e\n\u003cp\u003eZero pulled out a phone. \"I think we need help.\"\u003c/p\u003e\n\u003cp\u003e\"Who are you calling?\" Patrick asked.\u003c/p\u003e\n\u003cp\u003e\"A doctor.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-61.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
