{"id":111823,"no":67,"title":"Page 67","content":"\u003cp\u003eSUFFOLK COUNTY, NY\u003c/p\u003e\n\u003cp\u003eZero stepped into the small, two-story farmhouse in the middle of a fallow potato field, one of many that dotted eastern Long Island.\u003c/p\u003e\n\u003cp\u003eGood to be home, even if he had no one to share the place.\u003c/p\u003e\n\u003cp\u003eHe unwrapped the scarf from his lower face and removed the hat with the pulled-down brim. Masking his features was relatively easy in the colder weather, especially at night. Summer was a problem, forcing him into a wig, a fake beard and nose, oversized sunglasses, and a floppy boonie cap.\u003c/p\u003e\n\u003cp\u003eHe shrugged out of his coat and turned on the three computers arranged around the sparsely furnished living room. A couch, a recliner, a TV, three folding chairs before the card tables holding the computers. Not exactly the lap of luxury, but it served his purposes.\u003c/p\u003e\n\u003cp\u003eAs the computers booted up he stepped to the mantle of the cold fireplace where an eight-by-ten black- and-white photo of Romy Cadman leaned against the wall. He loved this close-up, taken with a telefoto lens shortly after a letter to the editor of theTimes had brought her to his attention. He felt a familiar ache as he stared at her face.\u003c/p\u003e\n\u003cp\u003eRomy...were there other women in the world like her? If so, he\u0027d never met one. But then, really, how many women had he met? Nowhere near enough for a fair comparison.\u003c/p\u003e\n\u003cp\u003eHe ran a fingertip along her cheek, wishing he could do so in the flesh.\u003c/p\u003e\n\u003cp\u003eAnd what did others matter, anyway? Romy was Romy, his Romy. He knew he shouldn\u0027t think of her as his, for she never would be, never could be. That would require removing his mask for her, letting her see his face. And then she\u0027d reject him, turn away in loathing.\u003c/p\u003e\n\u003cp\u003eWell...he didn\u0027t actuallyknow that, but he couldn\u0027t risk it. Better this way. At least he could see her often, be near her, talk to her, hear her voice. But once she rejected him, all that would be lost. And even if by some miracle she, superior woman though she might be, didn\u0027t reject him, the whole relationship would change, and not for the better.\u003c/p\u003e\n\u003cp\u003eTonight\u0027s Romy ritual ended with a knock on the front door. Even though he was expecting it, Zero jumped at the sound. A visitor here was an occasion. Only one person knew where he lived, and his visits were rare.\u003c/p\u003e\n\u003cp\u003eHe laid the photo face down on the mantle and went to the door. When he opened it he embraced his oldest and dearest friend, the man who was like a father to him.\u003c/p\u003e\n\u003cp\u003e\"How are you?\"\u003c/p\u003e\n\u003cp\u003e\"Good, Ellis. Very good. How are you?\"\u003c/p\u003e\n\u003cp\u003e\"Getting better every day, thanks to what you and your group have been doing.\"\u003c/p\u003e\n\u003cp\u003eEllis Sinclair did look better. Maybe a little grayer, but less gaunt. Perhaps he was eating better.\u003c/p\u003e\n\u003cp\u003e\"Come in,\" Zero said, shutting the door and taking Ellis\u0027s coat.\u003c/p\u003e\n\u003cp\u003eHe felt a little awkward. He was unpracticed at being a host.\u003c/p\u003e\n\u003cp\u003eEllis did a slow turn, taking in the small living room. \"Are you comfortable here?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, thanks to you.\"\u003c/p\u003e\n\u003cp\u003eHe pulled a bottle of Scotch from the cabinet under the TV. He\u0027d never developed a taste for liquor himself, but he knew his guest was something of a hard drinker. But Ellis surprised him by waving it off.\u003c/p\u003e\n\u003cp\u003e\"Thanks, but I\u0027m taking a breather from the booze.\"\u003c/p\u003e\n\u003cp\u003eZero almost said, Glad to hear it, but reconsidered. Wouldn\u0027t be appropriate.\u003c/p\u003e\n\u003cp\u003e\"Coffee, then?\"\u003c/p\u003e\n\u003cp\u003eEllis shook his head. \"I can\u0027t stay long. As I told you, the reason I\u0027m here is because I didn\u0027t want to discuss this over the phone. May I sit?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eHow strange to acquiesce to a request for a seat from the owner of the house. Since the purchase of real estate would be - to put it mildly - awkward for Zero, Ellis Sinclair had bought the place for him years ago.\u003c/p\u003e\n\u003cp\u003e\"I gather this is fairly important then,\" Zero said as they seated themselves, Ellis on the couch, and Zero in the recliner.\u003c/p\u003e\n\u003cp\u003eA vague anxiety had been nibbling at him since Ellis\u0027s call late this afternoon. What was too sensitive to discuss over an encrypted phone?\u003c/p\u003e\n\u003cp\u003e\"More than fairly. In fact I was followed tonight - by Portero himself, I believe.\"\u003c/p\u003e\n\u003cp\u003e\"But you lost him.\" It was a statement. He knew Ellis would have aborted his visit if he thought he was being followed.\u003c/p\u003e\n\u003cp\u003e\"Yes. Took a subway to Forest Hills and rented a car there.\" He shifted in his chair. \"But let me cut to the chase here: Someone asked a very disturbing question at the stockholders\u0027 meeting today.\"\u003c/p\u003e\n\u003cp\u003eZero nodded. \"You mean about \u0027surge\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly. One of your people, I presume?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Ms. Cadman. It was her idea. We heard the word from a man who tried to assault her, and she thought that would be a way to see if it meant anything.\"\u003c/p\u003e\n\u003cp\u003e\"Just the word?\" Ellis said, his eyebrows lifting. \"That\u0027s all you have?\"\u003c/p\u003e\n\u003cp\u003eToo much had been happening lately to allow Zero time to give Ellis one of his irregular briefings, so he filled him in now on the invasion of Romy\u0027s apartment, the Totuus, and Palmer\u0027s resultant aphasia.\u003c/p\u003e\n\u003cp\u003e\"So you have no idea what this Palmer fellow was referring to,\" Ellis said.\u003c/p\u003e\n\u003cp\u003e\"Not yet. But we know it means something. And I figure you\u0027re the man who can tell us just what.\"\u003c/p\u003e\n\u003cp\u003eEllis tapped his fingers on the armrest of the recliner. This went on for an agonizing minute. Then, \"No, I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Zero couldn\u0027t hide his shock. \"You\u0027re a founder of SimGen! This goes back to Manassas Ventures. They gave you start-up capital. You\u0027vegot to know!\"\u003c/p\u003e\n\u003cp\u003e\"I do know,\" Ellis said. \"But I can\u0027t tell you.\"\u003c/p\u003e\n\u003cp\u003e\"Anotherthing you can\u0027t tell me?\" He could feel his blood rising. \"When I found Kek you said you couldn\u0027t tell me anything about him or about what was going on in Idaho. \u0027Too sensitive,\u0027 you said. Now two men attempt a chemical rape on the minds of Romy Cadman and Patrick Sullivan; we ask one of them who sent him and he tells us \u0027surge.\u0027 You know who that is and won\u0027t tell me? Why on earth not? \u0027Too sensitive\u0027 again?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Ellis said, his gaze boring into Zero. \"Too dangerous.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s already dangerous.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027ve sampled only a taste of what\u0027s waiting for you if you push this further.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re telling me to back off?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027mbegging you to back off.\"\u003c/p\u003e\n\u003cp\u003eZero couldn\u0027t believe what he was hearing. But the emotion in Ellis\u0027s voice - fear, desperation - were real.\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t this what you set me up to do?\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s not. Your goal - our goal - is to turn the public against SimGen and the idea of sims as laborers.Stop further cloning of sims\u0026nbsp;\u0026nbsp;- that was the goal, remember?\"\u003c/p\u003e\n\u003cp\u003e\"Of course. And how better to turn the public against SimGen than to find its dirty laundry and wave it in the air for all to see?\"\u003c/p\u003e\n\u003cp\u003e\"You have no idea what you\u0027re getting into, the forces you\u0027ll be setting in motion...they\u0027ll crush you.\"\u003c/p\u003e\n\u003cp\u003e\"They have to find us first.\"\u003c/p\u003e\n\u003cp\u003e\"Zero, leave it alone, I beg you. You\u0027re making progress on so many other fronts. You don\u0027t need - \"\u003c/p\u003e\n\u003cp\u003e\"Progress? What progress? SimGen is opening more natal centers all the time!\"\u003c/p\u003e\n\u003cp\u003e\"We may soon have to rethink that with the tide of public opinion turning. Manufacturers, one or two of them major, are starting to advertise their products, their clothes, toys, appliances, and so on, as \u0027sim-free.\u0027 Mutual funds specializing in sim-free companies are springing up. The Beacon Ridge poisoning - it\u0027s awful to look at it as anything but an atrocity, but something good did come out of it because it\u0027s accelerated the process.\" Ellis leaned forward, his expression intense, alive with hope. \"We\u0027rewinning , Zero. Leave Manassas Ventures and the rest alone.\"\u003c/p\u003e\n\u003cp\u003eWe\u0027renot winning, damn it, Zero thought, his frustration a fire in his gut.\u003c/p\u003e\n\u003cp\u003e\"What we\u0027ve been doing until now is like trying to tame a killer carnivore by removing its food supply. Can\u0027t be done. Or if it can, it\u0027ll take a lifetime. But that was all we had, the only way we knew to deal with it. Until now. Now we may have found a weapon, one that can strike at the heart of the beast. And that changes everything.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027re forgetting that there\u0027s a pregnant sim somewhere out there. Find her and prove that the father of her child is human and our war is won!\"\u003c/p\u003e\n\u003cp\u003e\"Ifwe find her. That\u0027s a very, very big \u0027if,\u0027 Ellis. And if we don\u0027t, and if we neglect this \u0027surge\u0027 lead while we hunt for her, then we may miss a crucial opportunity.\"\u003c/p\u003e\n\u003cp\u003e\"I know you\u0027re chafing to end this crusade, but you have no idea what you\u0027re getting into.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve already tried to kill Romy and Patrick. What can be worse?\u003c/p\u003e\n\u003cp\u003e\"They cansucceed . And they will. Keep pushing this and some of your people will die.\"\u003c/p\u003e\n\u003cp\u003eThe words jolted Zero. He\u0027d realized that when Romy and Patrick had been run off the highway, but hearing it said aloud...\u003c/p\u003e\n\u003cp\u003eEllis leaned back and closed his eyes. \"You want to strike at the beast. I understand that. But I\u0027ve been living in the belly of that beast for decades and believe me, Zero, it\u0027s dark in there. It\u0027s full of things that should never see the light of day.\"\u003c/p\u003e\n\u003cp\u003e\"What sort of things?\"\u003c/p\u003e\n\u003cp\u003e\"Painful things. Things that will hurt me personally, and devastate other, more innocent, parties. Things that no one will want to hear. And don\u0027t think you\u0027ll come through unscathed, either.\"\u003c/p\u003e\n\u003cp\u003eZero swallowed. \"What do you mean?\" He couldn\u0027t suppress a mocking tone. \"Or is it \u0027too sensitive\u0027 again?\"\u003c/p\u003e\n\u003cp\u003eEllis looked away and shook his head. \"Some of it is sensitive. And some of it is...unspeakable.\"\u003c/p\u003e\n\u003cp\u003eThe last word lingered in the air between them. Zero\u0027s mouth felt dry, his tongue like old leather. He couldn\u0027t bear the thought of one of the most decent, moral men he had ever known connected to something unspeakable.\u003c/p\u003e\n\u003cp\u003eWhat had Ellis got himself into?\u003c/p\u003e\n\u003cp\u003e\"So,\" Ellis said finally. \"Do we understand each other? Will you concentrate on finding Meerm and back away from Manassas?\"\u003c/p\u003e\n\u003cp\u003eShaking his head was the hardest thing Zero had ever done in his life.\u003c/p\u003e\n\u003cp\u003eHow could he turn down this man who\u0027d been so good to him? But he didn\u0027t see any other choice.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do that. Even if I wanted to, I doubt I could call off Romy and Patrick.\"\u003c/p\u003e\n\u003cp\u003e\"Of course you can. You\u0027re they\u0027re leader.\"\u003c/p\u003e\n\u003cp\u003e\"Causes take on a life of their own. Romy and Patrick are off and running like hounds who\u0027ve caught a scent. There\u0027s no whistling them back.\"\u003c/p\u003e\n\u003cp\u003eEllis rubbed a hand across his eyes, then dragged it down his face. He looked ten years older than when he\u0027d arrived.\u003c/p\u003e\n\u003cp\u003eZero said, \"But I will do this. I will push the search for Meerm as best as I can. If that pans out, then Manassas and \u0027surge\u0027 will be moot.\"\u003c/p\u003e\n\u003cp\u003e\"I pray so.\"\u003c/p\u003e\n\u003cp\u003eLooking exhausted, Ellis rose slowly from the recliner and shrugged into his coat.\u003c/p\u003e\n\u003cp\u003e\"Is there nothing I can say to make you change your mind?\"\u003c/p\u003e\n\u003cp\u003e\"I wish there were, Ellis. You don\u0027t know how much it hurts me to go against you.\"\u003c/p\u003e\n\u003cp\u003e\"Hurt? You don\u0027t know hurt, Zero. Keep on this road, and it will come to a very bad end. A terrible end. And you...you may end up the sorriest of all.\"\u003c/p\u003e\n\u003cp\u003eWithout another word, Ellis Sinclair opened the door, stepped outside, and walked to his car, leaving Zero wondering if he\u0027d just made the worst mistake of his life. \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-67.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
