{"id":111767,"no":8,"title":"Page 8","content":"\u003cp\u003eIt was a little after nine when Patrick arrived at his office at Payes \u0026amp; Hecht, but he felt as if he\u0027d already put in a full day.\u003c/p\u003e\n\u003cp\u003eThe fire trucks had arrived on the heels of the first patrol car and doused his flaming lawn. It looked like the vandals had tried to burn some sort of message into the grass but whatever it said had been turned to steaming mud by the time the fire hoses finished their work. The cops took his statement, bagged the Fruitopia bottle and note, and promised to have the patrols make extra swings by his place.\u003c/p\u003e\n\u003cp\u003eAll fine and good, but it had left him with a sick, sour stomach and an adrenaline hangover. At least he was in better shape than Pamela who seemed totally freaked by the incident. He\u0027d tried to explain that the threat had been against him, not her, but still she\u0027d been afraid to leave the house.\u003c/p\u003e\n\u003cp\u003eFinally he\u0027d put her on a train to the city, then made it to White Plains where he was surrounded as soon as he stepped into the Payes \u0026amp; Hecht reception area. News of the attack had been all over the TV and radio; the firm was medium size, consisting of twenty-two attorneys, and everyone knew everyone. The associates and staff were shocked and concerned and wanted to know all the details. But before he could get into it, Alton Kraft, the managing senior partner, pulled him aside for a one-on-one in his office.\u003c/p\u003e\n\u003cp\u003e\"You all right?\" Kraft said.\u003c/p\u003e\n\u003cp\u003eHis blue eyes looked out from under thick eyebrows that matched his salt-and-pepper hair. He had a lined face and looked grandfatherly, but he could be a buzzsaw with any associate who strayed off the beaten path. Patrick was up for partnership next year and Kraft was one of his main supporters.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine. Really.\"\u003c/p\u003e\n\u003cp\u003eThe two of them had hit it off from the first brief Patrick had prepared for one of Kraft\u0027s cases. He\u0027d said it was the best he\u0027d seen in years, and had taken Patrick under his wing.\u003c/p\u003e\n\u003cp\u003e\"Good. I want to talk to you about this sim union thing. I\u0027m not sure it\u0027s consistent with the image of the firm.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s pro bono,\" Patrick said. \"Aren\u0027t we always being encouraged to take some pro bono cases? This is one of mine.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all fine and good, but I don\u0027t like seeing the firm\u0027s name mentioned in connection with fire bombings.\"\u003c/p\u003e\n\u003cp\u003ePatrick stiffened. He was well aware that when Alton Kraft said \"I\" he was speaking for the senior partners.\u003c/p\u003e\n\u003cp\u003e\"Alton, believe me,\" Patrick said, smiling in the hope of lightening things up, \"I like it even less when it\u0027s my own name mentioned in connection with a fire bombing.\"\u003c/p\u003e\n\u003cp\u003eKraft grinned. \"I can imagine. But Patrick...\" The grin faded. \"You\u0027re an excellent attorney and you\u0027ve got a big future with this firm. I admire your tenacity - when you\u0027re handed a problem, you stick with it until it\u0027s solved.\"\u003c/p\u003e\n\u003cp\u003eTenacity, Patrick thought. Better than \"stubborn as a mule,\" which was how his mother used to characterize him.\u003c/p\u003e\n\u003cp\u003e\"But that same tenacity cancause problems too. When a situation looks like trouble for you or the firm, you have to know when to back away and cut your losses.\"\u003c/p\u003e\n\u003cp\u003e\"I hear you, Alton. Loud and clear. But I\u0027m sort of stuck with the sims for now.\"\u003c/p\u003e\n\u003cp\u003e\"Not for long, fortunately.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I guess you haven\u0027t had time to sift through your messages yet. Judge Boughton has been assigned to decide on the declaratory judgment.\"\u003c/p\u003e\n\u003cp\u003e\"Henry Boughton?\"\u003c/p\u003e\n\u003cp\u003e\"The one and only.\"\u003c/p\u003e\n\u003cp\u003ePatrick felt as if he\u0027d been punched. Shit. What else could go wrong today?\u003c/p\u003e\n\u003cp\u003e\"I think I\u0027d better go talk to my clients.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-8.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
