{"id":111838,"no":86,"title":"Page 86","content":"\u003cp\u003eMINEOLA, NY\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not going to last much longer,\" Betsy Cannon said as she angled the doppler wand this way and that against Meerm\u0027s swollen, gel-coated belly.\u003c/p\u003e\n\u003cp\u003eRomy, Zero, Betsy, and Meerm were crowded into the tiny, white-walled, windowless procedure room in Betsy\u0027s home office. Meerm lay on the table, Betsy working over her, Romy and Zero watching from the other side.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" Romy said, watching in rapt fascination as the 3-D shape of the fetus within Meerm\u0027s belly formed on the monitor screen.\u003c/p\u003e\n\u003cp\u003e\"Her uterus has taken just about all it can. It\u0027s too small for this baby. Andyet...the baby could use more gestation time.\"\u003c/p\u003e\n\u003cp\u003eAt least Zero had his ski mask back on. They\u0027d all agreed on the way here that no one else needed to know Zero\u0027s history. When it was all over - and with Meerm\u0027s baby, that could be very soon - he promised to go public.\u003c/p\u003e\n\u003cp\u003eThe mask made it easier now for Romy, but she wished Zero had waited outside with Patrick and Tome; she was still uncomfortable with him, especially standing next to him like this. And she didn\u0027t want to feel uncomfortable, hated herself for it.\u003c/p\u003e\n\u003cp\u003eBut...how elsecould she feel? She was fighting her way through an emotional maelstrom and still hadn\u0027t regained her bearings. She\u0027d admired Zero so; he\u0027d become a hero in her eyes and in her heart, and that was fine, but she\u0027d also been sexually attracted to him, had fantasized about him, and now...\u003c/p\u003e\n\u003cp\u003enow to learn that he\u0027s not human.\u003c/p\u003e\n\u003cp\u003eSo what?said the ghost of Raging Romy, ever ready to shoutUp yours! to the world. It\u0027s not as if he\u0027s a squid or a plant - he\u0027s a fellow primate.\u003c/p\u003e\n\u003cp\u003eThat was true and real and forward thinking, but another more primitive part of her was repulsed and kept damning her, whispering that in another time, or in a SimGen-less world, Zero would have been born a chimpanzee, destined to spend his days sitting in a jungle sucking ants off a stick.\u003c/p\u003e\n\u003cp\u003eSicko evil girl! Wanting to make love with a monkey! Sick! Sick! Sick!\u003c/p\u003e\n\u003cp\u003eRomy did her best to shut out that voice, but it wouldn\u0027t go away, couldn\u0027t because it was part of her, and that was what so dismayed her. She\u0027d always thought she was better than that.\u003c/p\u003e\n\u003cp\u003e\"How much longer?\" Zero asked.\u003c/p\u003e\n\u003cp\u003eBetsy Cannon brushed back strands of graying hair from her face. \"Hard to say. If this were a sim baby I\u0027d say she\u0027s almost due. If human I\u0027d say premature. But this baby...I don\u0027t know. And there\u0027s another problem: Meerm\u0027s uterus is small, smaller even than a breeder sim\u0027s. That baby is packed tight in there, so tight I can\u0027t determine its sex.\"\u003c/p\u003e\n\u003cp\u003e\"We could lose the baby?\" Romy said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a real possibility.\"\u003c/p\u003e\n\u003cp\u003eRomy stared at the color image on the monitor, watched the rapid filling and emptying of the chambers of its little heart, saw the baby move, squirming for comfort in the confines of the too-small womb.\u003c/p\u003e\n\u003cp\u003eWe can\u0027t lose you, she told it. Youmust live. We\u0027re so close now and...the salvation of an entire species rests on you.\u003c/p\u003e\n\u003cp\u003e\"We could lose the mother as well,\" Betsy added. \"The baby is going to be premature, and I can tell you right now that a vaginal delivery is out of the question. This baby is coming out by section.\"\u003c/p\u003e\n\u003cp\u003e\"Cesarean?\" Romy said, looking at Meerm\u0027s distended belly. \"How...where...?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" Betsy\u0027s expression was grim. \"Not here, that\u0027s for certain. It\u0027s major surgery and I\u0027m not equipped for that, not unless we intend to sacrifice the mother.\"\u003c/p\u003e\n\u003cp\u003eRomy\u0027s gaze darted to Meerm\u0027s face. The poor sim didn\u0027t have a clue as to who or what they were talking about.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not an option,\" Zero said. The finality in his tone stabbed Romy with a reminder of why she\u0027d been so attracted to him. \"Tell me what you need and I\u0027ll arrange it.\"\u003c/p\u003e\n\u003cp\u003e\"A sterile operating room and a skilled surgical team,\" Betsy said. \"Can you manage that?\"\u003c/p\u003e\n\u003cp\u003e\"Tall order,\" Zero said. His voice had lost some of its confidence.\u003c/p\u003e\n\u003cp\u003eAnd then another voice spoke.\u003c/p\u003e\n\u003cp\u003e\"Why Meerm sick?\"\u003c/p\u003e\n\u003cp\u003eThey all stared at her a moment, then Betsy spoke.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not sick, Meerm. You\u0027re going to have a baby.\"\u003c/p\u003e\n\u003cp\u003eHer sloping brow furrowed. \"Baby? What is baby?\"\u003c/p\u003e\n\u003cp\u003e\"You know babies,\" Betsy said. \"You must have seen many babies on television.\"\u003c/p\u003e\n\u003cp\u003eThe brow furrows deepened. \"Baby?\"\u003c/p\u003e\n\u003cp\u003e\"Only this won\u0027t be like the human babies you\u0027ve seen. This will be asim baby.\" She gave a little shrug as she glanced at Zero and Romy, signifying that she was simplifying the situation as best she could for Meerm.\u003c/p\u003e\n\u003cp\u003e\"Where baby?\"\u003c/p\u003e\n\u003cp\u003eBetsy tapped the sim\u0027s abdomen. \"Right in here. And the baby will come out soon.\"\u003c/p\u003e\n\u003cp\u003e\"Baby here?\" Meerm said, a slow smile of wonder spreading across her face as she gently rubbed her hands across her belly. \"Baby inside? Baby kick-kick-kick?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes!\" Betsy laughed. \"I\u0027ll bet that baby\u0027s been kick-kick-kicking like crazy!\"\u003c/p\u003e\n\u003cp\u003eAs they all watched Meerm gaze at her belly, a question occurred to Romy.\u003c/p\u003e\n\u003cp\u003e\"Will she be able to care for a baby?\" she said softly.\u003c/p\u003e\n\u003cp\u003e\"She won\u0027t have to worry a bit,\" Betsy said. \"That baby will getgreat care. As a one-of-a-kind species, it will belong to the world.\"\u003c/p\u003e\n\u003cp\u003e\"No, it will belong to Meerm. It will beher baby. We\u0027re not going to forget that, are we?\"\u003c/p\u003e\n\u003cp\u003e\"Ah, Romy,\" Zero said through a sigh. \"That\u0027s why we need you: to ask the tough questions.\"\u003c/p\u003e\n\u003cp\u003eSomething in his voice struck her...did Zero...could Zero feel about her the way she...?\u003c/p\u003e\n\u003cp\u003eNo. Out of the question. He couldn\u0027t. He simply couldn\u0027t. \u003c/p\u003e","sourceLink":"https://allnovel.net/sims/page-86.html","bookId":2553,"creation":"Oct 6, 2019 12:37:47 AM","modification":"Oct 6, 2019 12:37:47 AM"}
