{"id":112179,"no":36,"title":"Page 36","content":"\u003cp\u003eSteven slowly opened his eyes. It was like something out of a dream and he wondered for a moment if he really was awake - he could feel nothing. With considerable effort, he lifted his tired, burnt head from where it had rested next to Samantha\u0027s. Despite his confusion and fear, he knew that she lay dead in his arms. He would not look down at her charred body, preferring instead to picture her in his mind, untouched, unscarred and beautiful.\u003c/p\u003e\n\u003cp\u003eThe brilliant light that had been so fierce moments ago had quickly faded away and, although he was unable to focus his damaged eyes properly, Steven was sure that raging fires burned all around him. His face was badly burned but he was still able to make out a powerful and sickening smell - the stench of the world dying.\u003c/p\u003e\n\u003cp\u003eEvery movement he made drew heavily from the last reserves of energy that he could find. He tried to look out over the ocean but, through a combination of exhaustion, the effort, his injuries and the mist which hissed as it hung over the water, he was able to see nothing in detail. He thought that he saw the sky beginning to change colour once more, but he could not be sure.\u003c/p\u003e\n\u003cp\u003eHe cradled the heavy, lifeless body of Samantha in his arms and, as a brutal gust of wind blew against him, he took a deep breath, closed his eyes and buried his head next to hers. With the final ounce of strength that he could summon from his tired, dying body, he fought to keep hold of her as the red-hot wind threatened to tear them apart. Although his eyes were closed and he could feel little, Steven knew that the heat and light had returned.\u003c/p\u003e\n\u003cp\u003eFor the final time, the fire descended on the world. \u003c/p\u003e","sourceLink":"https://allnovel.net/straight-to-you/page-36.html","bookId":2560,"creation":"Oct 6, 2019 12:56:24 AM","modification":"Oct 6, 2019 12:56:24 AM"}
