{"id":110684,"no":7,"title":"Page 7","content":"\u003cp\u003eSEVEN\u003c/p\u003e\n\u003cp\u003eWHEN THE FIRST WARNING for curfew came around, the Moroi packed their things up. Adrian took off right away, but Lissa and Christian took their time walking back to the dorm. They held hands and kept their heads close together, whispering about something that I could have \"spied\" on if I\u0027d gone inside Lissa\u0027s head. They were still outraged over the Victor news.\u003c/p\u003e\n\u003cp\u003eI gave them their privacy and kept my distance, scouting while Eddie walked off to their side. Since there were more Moroi than dhampirs on campus, the Moroi actually had two side-by-side dorms. Lissa and Christian lived in different ones. The two of them stopped when they came to the spot outside the buildings where the path through the quad split. They kissed goodbye, and I did my best to do the guardian seeing-without-actually-seeing thing. Lissa called goodbye to me and then headed off to her dorm with Eddie. I followed Christian to his.\u003c/p\u003e\n\u003cp\u003eIf I\u0027d been guarding Adrian or someone like him, I would probably have had to put up with sexual jokes about us sleeping near each other for the next six weeks. But Christian treated me in the casual, brusque way one might a sister. He cleared a spot on the floor for me, and by the time he returned from brushing his teeth, I\u0027d made myself a cozy bed out of blankets. He flipped off the lights and climbed into his own bed.\u003c/p\u003e\n\u003cp\u003eAfter several quiet moments, I asked, \"Christian?\"\u003c/p\u003e\n\u003cp\u003e\"This is the time when we sleep, Rose.\"\u003c/p\u003e\n\u003cp\u003eI yawned. \"Believe me, I want that too. But I have a question.\"\u003c/p\u003e\n\u003cp\u003e\"Is it about Victor? Because I need to sleep, and that\u0027s just going to piss me off again.\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s about something else.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, shoot.\"\u003c/p\u003e\n\u003cp\u003e\"Why didn\u0027t you make fun of me over what happened with Stan? Everyone else is trying to figure out if I messed up or did it on purpose. Lissa gave me a hard time. Adrian did a little. And the guardians ... well, never mind about them. But you didn\u0027t say anything. I figured you\u0027d be the first one with a snappy comment.\"\u003c/p\u003e\n\u003cp\u003eMore silence fell, and I hoped he was thinking about his answer and not falling asleep.\u003c/p\u003e\n\u003cp\u003e\"There was no point in giving you a hard time,\" he said at last. \"I know you didn\u0027t do it on purpose.\"\u003c/p\u003e\n\u003cp\u003e\"Why not? I mean, not that I\u0027m contradicting you -\u0026nbsp;\u0026nbsp;because I didn\u0027t do it on purpose - but why are you so sure?\"\u003c/p\u003e\n\u003cp\u003e\"Because of our conversation in culinary science. And because of the way you are. I saw you in Spokane. Anyone who did what you did to save us ... well, you wouldn\u0027t do something childish like this.\"\u003c/p\u003e\n\u003cp\u003e\"Wow. Thanks. I ... well, that means a lot.\" Christian believed me when no one else did. \"You\u0027re like the first person who actually believes I just messed up without any ulterior motives.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" he said, \"I don\u0027t believe that either.\"\u003c/p\u003e\n\u003cp\u003e\"Believe what? That I messed up? Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Weren\u0027t you just listening? I saw you in Spokane. Someone like you doesn\u0027t mess up or freeze.\" I started to give him the same line I\u0027d given the guardians, that killing Strigoi didn\u0027t make me invincible, but he cut me off: \"Plus, I saw your face out there.\"\u003c/p\u003e\n\u003cp\u003e\"Out... on the quad?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Several more quiet moments passed. \"I don\u0027t know what happened, but the way you looked ... that wasn\u0027t the look of someone trying to get back at a person. It wasn\u0027t the look of someone blanking out at Alto\u0027s attack either. It was something different.... I don\u0027t know. But you were completely consumed by something else - and honestly? Your expression? Kind of scary.\"\u003c/p\u003e\n\u003cp\u003e\"Yet...you aren\u0027t giving me a hard time over that either.\"\u003c/p\u003e\n\u003cp\u003e\"Not my business. If it was big enough to take you over like that, then it must be serious. But if push comes to shove, I feel safe with you, Rose. I know you\u0027d protect me if there was really a Strigoi there.\" He yawned. \"Okay. Now that I\u0027ve bared my soul, can we please go to bed? Maybe you don\u0027t need beauty sleep, but some of us aren\u0027t that lucky.\"\u003c/p\u003e\n\u003cp\u003eI let him sleep and soon gave into exhaustion myself. I\u0027d had a long day and was still short on rest from the previous night. Once heavily asleep, I began to dream. As I did, I felt the telltale signs of one of Adrian\u0027s contrived dreams.\u003c/p\u003e\n\u003cp\u003e\"Oh no,\" I groaned.\u003c/p\u003e\n\u003cp\u003eI stood in a garden in the middle of summer. The air was heavy and humid, and sunshine beat down on me in golden waves. Flowers of every color bloomed around me, and the air was heavy with the scent of lilacs and roses. Bees and butterflies danced from blossom to blossom. I wore jeans and a linen tank top. My nazar, a small blue eye made of glass that allegedly warded off evil, hung around my neck. I also wore a beaded bracelet with a cross, called a chotki, on my wrist. It was a Dragomir heirloom Lissa had given me. I rarely wore jewelry in my daily duties, but it always showed up in these dreams.\u003c/p\u003e\n\u003cp\u003e\"Where are you?\" I called. \"I know you\u0027re here.\"\u003c/p\u003e\n\u003cp\u003eAdrian stepped around from behind an apple tree that was thick with pink and white flowers. He wore jeans - something I\u0027d never seen him in before. They looked good and were undoubtedly a designer brand. A dark green cotton T-shirt -\u0026nbsp;\u0026nbsp;also very simple - covered his upper body, and the sunlight brought out highlights of gold and chestnut in his brown hair.\u003c/p\u003e\n\u003cp\u003e\"I told you to stay out of my dreams,\" I said, putting my hands on my hips.\u003c/p\u003e\n\u003cp\u003eHe gave me his lazy smile. \"But how else are we supposed to talk? You didn\u0027t seem very friendly earlier.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe if you didn\u0027t use compulsion on people, you\u0027d have more friends.\"\u003c/p\u003e\n\u003cp\u003e\"I had to save you from yourself. Your aura was like a storm cloud.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, for once, can we please not talk about auras and my impending doom?\"\u003c/p\u003e\n\u003cp\u003eThe look in his eyes told me he was actually really interested in that, but he let it go. \"Okay. We can talk about other things.\"\u003c/p\u003e\n\u003cp\u003e\"But I don\u0027t want to talk at all! I want to sleep.\"\u003c/p\u003e\n\u003cp\u003e\"You are sleeping.\" Adrian smiled and walked over to study a flowering vine that was winding up a post. It had orange and yellow flowers shaped like trumpets. He gently ran his fingers over one of the flowers\u0027 edges. \"This was my grandmother\u0027s garden.\"\u003c/p\u003e\n\u003cp\u003e\"Great,\" I said, making myself comfortable against the apple tree. It looked like we could be here for a while. \"Now I get to hear your family history.\"\u003c/p\u003e\n\u003cp\u003e\"Hey she was a cool lady.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure she was. Can I go yet?\"\u003c/p\u003e\n\u003cp\u003eHis eyes were still on the vine\u0027s blossoms. \"You shouldn\u0027t knock Moroi family trees. You don\u0027t know anything about your father. For all you know, we could be related.\"\u003c/p\u003e\n\u003cp\u003e\"Would that mean you\u0027d leave me alone?\"\u003c/p\u003e\n\u003cp\u003eStrolling back over to me, he switched subjects as though there\u0027d been no interruption. \"Nah, don\u0027t worry. I think we come from different trees. Isn\u0027t your dad some Turkish guy anyway?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, according to my -\u0026nbsp;\u0026nbsp;Hey, are you staring at my chest?\"\u003c/p\u003e\n\u003cp\u003eHe was studying me closely, but his eyes were no longer on my face. I crossed my arms over my chest and glared.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m staring at your shirt,\" he said. \"The color is all wrong.\"\u003c/p\u003e\n\u003cp\u003eReaching out, he touched the strap. Like ink spreading across paper, the ivory fabric turned the same shade of rich indigo as the vine\u0027s blossoms. He narrowed his eyes like an expert artist studying his work.\u003c/p\u003e\n\u003cp\u003e\"How\u0027d you do that?\" I exclaimed.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my dream. Hmm. You\u0027re not a blue person. Well, at least not in the color sense. Let\u0027s try this.\" The blue lit up into a brilliant crimson. \"Yes, that\u0027s it. Red\u0027s your color. Red like a rose, like a sweet, sweet Rose.\"\u003c/p\u003e\n\u003cp\u003e\"Oh man,\" I said. \"I didn\u0027t know you could kick into crazy mode even in dreams.\" He never got as dark and depressed as Lissa had last year, but spirit definitely made him weird sometimes.\u003c/p\u003e\n\u003cp\u003eHe stepped back and threw his arms out. \"I\u0027m always crazy around you, Rose. Here, I\u0027m going to write an impromptu poem for you.\" He tipped his head back and shouted to the sky:\u003c/p\u003e\n\u003cp\u003e\"Rose is in red\u003c/p\u003e\n\u003cp\u003eBut never in blue\u003c/p\u003e\n\u003cp\u003eSharp as a thorn\u003c/p\u003e\n\u003cp\u003eFights like one too.\"\u003c/p\u003e\n\u003cp\u003eAdrian dropped his arms and looked at me expectantly.\u003c/p\u003e\n\u003cp\u003e\"How can a thorn fight?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Art doesn\u0027t have to make sense, little dhampir. Besides, I\u0027m supposed to be crazy, right?\"\u003c/p\u003e\n\u003cp\u003e\"Not the craziest I\u0027ve ever seen.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" he said, pacing over to study some hydrangeas, \"I\u0027ll work on that.\"\u003c/p\u003e\n\u003cp\u003eI started to ask again about when I could go \"back\" to sleep, but our exchange brought something to my mind.\u003c/p\u003e\n\u003cp\u003e\"Adrian ... how do you know if you\u0027re crazy or not?\"\u003c/p\u003e\n\u003cp\u003eHe turned from the flowers, a smile on his face. I could tell he was about to make a joke, but then he looked at me more closely. The smile faded, and he turned unusually serious.\u003c/p\u003e\n\u003cp\u003e\"Do you think you\u0027re crazy?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" I said, looking down at the ground. I was barefoot, and sharp blades of grass tickled my feet. \"I\u0027ve been ... seeing things.\"\u003c/p\u003e\n\u003cp\u003e\"People who are crazy rarely question whether they\u0027re crazy,\" he said wisely.\u003c/p\u003e\n\u003cp\u003eI sighed and looked back up at him. \"That doesn\u0027t really help me.\"\u003c/p\u003e\n\u003cp\u003eHe walked back over to me and rested a hand on my shoulder. \"I don\u0027t think you\u0027re crazy, Rose. I think you\u0027ve been through a lot, though.\"\u003c/p\u003e\n\u003cp\u003eI frowned. \"What\u0027s that mean?\"\u003c/p\u003e\n\u003cp\u003e\"It means I don\u0027t think you\u0027re crazy.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks. That clears things up. You know, these dreams are really starting to bug me.\"\u003c/p\u003e\n\u003cp\u003e\"Lissa doesn\u0027t mind them,\" he said.\u003c/p\u003e\n\u003cp\u003e\"You visit hers too? Do you seriously have no boundaries?\"\u003c/p\u003e\n\u003cp\u003e\"Nah, hers are instructional. She wants to learn how to do this.\"\u003c/p\u003e\n\u003cp\u003e\"Great. So I\u0027m just the lucky one who gets to put up with your sexual harassment.\"\u003c/p\u003e\n\u003cp\u003eHe actually looked hurt. \"I really wish you wouldn\u0027t act like I\u0027m evil incarnate.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry. I just haven\u0027t had much reason to believe you can do anything useful.\"\u003c/p\u003e\n\u003cp\u003e\"Right. As opposed to your cradle-robbing mentor. I don\u0027t really see you making much progress with him.\"\u003c/p\u003e\n\u003cp\u003eI took a step back and narrowed my eyes. \"Leave Dimitri out of this.\"\u003c/p\u003e\n\u003cp\u003e\"I will when you stop acting like he\u0027s perfect. Correct me if I\u0027m wrong, but he\u0027s one of the people who hid the trial from you, right?\"\u003c/p\u003e\n\u003cp\u003eI looked away. \"That\u0027s not important right now. Besides, he had his reasons.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, which apparently didn\u0027t involve being open with you or fighting to get you there. Whereas me...\" He shrugged. \"I could get you into the trial.\"\u003c/p\u003e\n\u003cp\u003e\"You?\" I asked with a harsh laugh. \"How are you going to pull that off? Have a smoke break with the judge? Use compulsion on the queen and half the royals at court?\"\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t be so quick to slam people who can help you. Just wait.\" He placed a light kiss on my forehead that I tried to wiggle away from. \"But for now, go get some rest.\"\u003c/p\u003e\n\u003cp\u003eThe garden faded, and I fell back into the normal blackness of sleep. \u003c/p\u003e","sourceLink":"https://allnovel.net/shadow-kiss-vampire-academy-3/page-7.html","bookId":2062,"creation":"Oct 6, 2019 12:04:24 AM","modification":"Oct 6, 2019 12:04:24 AM"}
