{"id":44656,"no":17,"title":"CHAPTER XVI A DISSERTATION ON MUSHROOMS","content":"\u0026nbsp;“You’re the craziest chap I ever saw,” laughed Dan. “Is it a good one?” \n\u003cdiv\u003e\n Ned tried it with his teeth, tapped it on the edge of the railing and eyed it anxiously. “Perfectly good,” he replied finally. “It seems to be made of silver.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thought it might be a lead quarter,” said Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fever near, sir; fever near!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eh?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I said fever near.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s a phrase of reassurance spoken in my new universal language.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your new what?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Universal language,” replied Ned gravely, seating himself on the railing. “It’s away ahead of Esperanto, while as for Volapuk—why, Volapuk’s dead and buried. The beauty of my system—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you call it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned’s hesitation was infinitesimal, and he answered[206] without the flicker of an eyelash. “Tookeranto. As I was saying, its greatest beauty is its simplicity. You merely change the first letters of your words; I think transpose is the word I should have used. For instance, I say to you, ‘That’s a pice shair of noes you have,’ and you understand me at once.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The dickens I do!” Dan laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t? But you would get me if I told you you were pitting on the sorch of the Hashington’s Wead?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Once more, please, and give me something easier,” begged Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well; set me lee. I suppose you know that you had choast ricken for dinner?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Roast chicken! But how the dickens do you do it so quickly? I’d have to think an hour.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hink a thour, you mean,” Ned corrected. “It’s serfectly pimple. It pomes with cractice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “For goodness’ sake, shut up!” laughed Dan. “You’ll have me crazy. It’s a wonderful language, though. I shall study it. Have you written a book about it yet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yot net,” replied Ned, shaking his head, “but I’m toing go. When I do I shall dedicate it to Van Dinton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan put his hands to his ears and jumped up.[207] “Come on,” he cried, “and let me take you home before you get any worse!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean,” began Ned gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t! Shut up! Have we paid for dinner yet? I’ve eaten so much I’ve forgotten what has happened.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We have not. Let’s find mine host and settle up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now I know why you worked so hard for that tip. You’re going to help pay for your dinner with it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That quarter? Never! Do you realize, sir, that that is absolutely the first money I ever earned? Is not that a beautiful thought? I shall always keep that quarter, always treasure it.” He slipped it into his vest pocket and patted it fondly. “You never realize the value of money, Vinton, until you earn it by the sweat of your brow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your brow hasn’t sweated ten cents’ worth,” laughed Dan. “Come on and let’s hunt up Mr. Washington.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish,” murmured Ned regretfully when they had each enriched the hotel exchequer with a dollar bill, “I wish I had eaten that fourth fritter!”\n\u003c/div\u003e \n\u003cdiv\u003e\n They walked back rather more leisurely through the late sunlight, reaching school just as twilight descended.\n\u003c/div\u003e \n\u003cdiv\u003e\n [208]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I never thought,” Ned confided as they parted in front of Clarke, “that I’d have any appetite for supper, but, to quote our English cousins again, I feel a bit peckish, don’t you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m hungry again myself,” Dan answered. “I say, we had an awfully good time, didn’t we? Let’s try it again some day, eh? Much obliged to you, Tooker, for coming along. I suppose you thought I was sort of crazy, but it was Payson’s idea; he thought I needed a tramp, and so I asked you—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Ned gravely. “I may be a tramp, but you needn’t throw it in my face.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m sorry; hope I didn’t hurt your feelings. Come and see me, will you? Come over to-night for a while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not to-night, for I told Burtis I’d drop in on him. But I’ll be around soon. Lo song.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eh? Oh, so long. I’m crazy about your Tookeritis—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tookeranto, please,” Ned corrected.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whatever it is; and I’m going to study it so I can understand what you’re saying now and then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unkind, unkind!” murmured Ned sorrowfully. “I fid you barewell, Van Dinton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Kendall had news for Ned that evening when the latter called on him, but owing to the fact[209] that Harold Towne was in the room he couldn’t confide it for a time. Harold entertained a large respect and admiration for Ned Tooker, and whenever he was on hand on the occasions of Ned’s visits he always set out to make himself agreeable. Harold’s notion of being agreeable was to monopolize most of the conversation, carefully selecting subjects which he believed Ned to be interested in and rattling away on them with an assurance that was at once irritating and amusing. Ned detested Kendall’s roommate heartily, but managed to be polite no matter how much Harold’s chatter annoyed him. To-night Harold quite surpassed himself, playing the r?le of host from the moment of Ned’s appearance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hello, Tooker!” Harold cried. “Awfully glad to see you. Kendall, pull that chair around for Tooker. Throw your cap anywhere; this is Liberty Hall.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Much obliged, but I’ll sit here. Well, how are things with you, Curt?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, he’s been grinding at his books all the afternoon,” said Harold. “I tell him he’s after a scholarship.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very commendable ambition,” said Ned soberly. “I tried it myself once and came within one of getting a Burrows. I wrote home about it and my dad wrote back that he guessed that[210] was about as near as I’d ever get to making fifty dollars. Such ingratitude was naturally discouraging and I never tried again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold laughed uproariously and Ned observed him in grave surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I made a quarter to-day, though,” he went on. “Walked over to Lloyd for dinner and held a man’s auto for him and he gave me a quarter. Here it is. Looks all right, doesn’t it?” He passed it to Kendall.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seems to be real money,” laughed Kendall. “What do you mean by saying you held a man’s auto? Looked after it for him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, held it by the bit. It was rather nervous, you see; tried to jump out of the shafts every time a leaf rustled.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it was a horse?” said Harold.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, an automobile! a dark bay with coppery points. It was very good-looking, too. Very deep in the radiator, and had an arched neck and fine quarters. This is one of them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re crazy, Ned,” laughed Kendall. “Was it a horse or was it an automobile?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I don’t know, but I got a quarter. And all I did was hold its head, bring a pail of water for it and polish the brass. My, but it’s easy to earn money if you know how! Want to play some golf to-morrow?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [211]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I’d love to, if you care to bother with me,” answered Kendall. “But I would like to know about that horsomobile.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve told you everything,” answered Ned with dignity. “If you doubt my story, why, here’s the quarter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What were you doing at Lloyd?” asked Harold. “That’s ten or twelve miles, isn’t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s quite a jaunt. I was looking for mushrooms,” answered Ned calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mushrooms? What for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I collect them. Haven’t you ever seen my fungi? You must come over some time and let me show them to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Honest, Tooker? I’d like to see them. Did you find any to-day? Any—er—interesting ones?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Um—a few. I got a good specimen of the canardius antarcticus; and a few of the Washingtonii and Danvintonii. It’s getting late for them, though. What I was especially anxious to find was the pufum mobilis, or rolling mushroom. You’ve seen that, I suppose.” Harold looked doubtful and murmured that he didn’t think he ever had. “Really? I thought most everyone knew the rolling mushroom. It’s called that because it rolls along the ground.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [212]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Rolls along the ground!” exclaimed Kendall. “I don’t believe it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned smiled kindly on his ignorance. “The mobilis,” he explained, “is one of the puff-balls, a small, round puff-ball. It is found on hillsides. Most puff-balls disseminate their pores—I mean spores—by the aid of the wind, remaining where they grow. But the mobilis as soon as it attains maturity detaches itself from its stalk and begins to roll. As I have said, they always grow on the sides of hills. Consequently they roll to the bottom, sowing their spores as they go. We always look along the foot of a hill until we find the dead mobilis. Then we know that we shall find growing ones further up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jimminy, that’s quite interesting!” exclaimed Harold. “Do you know, I rather think I’ll go in for mushrooms myself! It must be lots of fun collecting them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not bad,” replied Ned. “But of course there’s always the element of danger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you mean?” Harold asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, there are certain kinds that are poisonous not only to touch but to approach. There’s the leoparditus, for instance, a large, angry mushroom—although it would be more correct to give it the popular name of toadstool—that has a purplish body with small livid spots on it. The[213] leoparditus is certain death if you touch it. Even if you only inhale its noxious fumes”—Ned choked a little there—“noxious fumes you will break out with a very painful rash all over the body, more especially the exposed portions. Then there is the Gumponicum eachewupus, which hides in the deep woods and springs out at you as you unsuspectingly pass. Its bite is certain death.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned paused and stared gravely at the drop-light. There was a moment of silence. Then Kendall began to chuckle and Harold got rather red in the face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You were just stringing us, weren’t you?” he asked, with an attempt at a laugh. “I suppose that was pretty funny, Tooker.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Far be it from me to praise my own efforts,” replied Ned modestly. “You asked me what I was doing at Lloyd. As I didn’t care to tell you the truth and am far too polite to request you to mind your own business I did the best I could. I hope you found it amusing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but I knew all the time you were stringing,” said Harold uncomfortably.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your penetration, Mr. Towne,” answered Ned graciously, “is most remarkable.” Then he began to talk golf to Kendall, and five minutes later Harold said he had promised to see a fellow and[214] took his departure. Ned heaved a sigh of relief when the door had closed behind him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t stand that fellow,” he said. “He gets me so nervous!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Kendall laughed. “I don’t mind him as much as I did,” he said. “He means well enough, I guess.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right in his way, but doesn’t weigh enough,” replied Ned flippantly. “Well, out with it, Curt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Out with what?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know. Whatever it is. You’ve been fairly dying to tell me something ever since I got here. So let’s have it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t see how you knew,” said Kendall. “I was just going to tell you that Mr. Collins called me down to his study this afternoon and—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait! Don’t tell me that you’re off probation!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Kendall nodded. Ned made a gesture of disappointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Isn’t that the dickens?” he exclaimed. “Just when I was getting interested in you, too! I’ve never been chummy with a ‘real devil’ of a fellow before, and now you go and reform!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven’t reformed,” laughed Kendall. “I’ve just been pardoned for my former sins.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [215]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah! And you’re just as wicked as you ever were?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s better.” Ned sighed his relief. “I was afraid you were a reformed character, Curt. You see there are plenty of good, moral chaps in school; I know dozens of them; but you’re the first desperate character I ever got to know at all well. And so they’ve lifted the ban, eh? Well, that will help, won’t it? Now you’ll be free to take up your career of crime again. Whisper, Curt; what are you thinking of doing first? Had any experience with bombs? They tell me bombing is a pleasant and fairly safe amusement. Would you mind beginning on that roommate of yours? Incendiarism is another cute little way in which to pass an evening. I’ve often thought that Oxford would make a dandy blaze if you could get it started. Have you ever seriously considered murder? So many of our prominent citizens are going in for murder nowadays. And I can think of so many beautiful subjects for your attentions. Why, one needn’t look beyond his immediate acquaintances!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m going to try and get back on the Football Team the first thing,” said Kendall.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seriously?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. Of course, I couldn’t make the First[216] Team now; it’s too late, I guess; but I might make the Second. What do you think?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I admire your courage. But I regret that you choose football when you might play golf. I was going to make a gandy dolfer out of you, Curt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can play golf after the football season,” said Kendall.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Um; yes; but the two sciences are widely opposed. I’ve never known a football man who could swing a golf club decently. Football seems to—to deaden the sensibilities, whatever those may be, Curt. And a man must have sensibilities to play a good game of golf. However, if you are really determined, come with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where?” asked Kendall as Ned jumped up and rescued his cap from the floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To see Vinton. If there’s a chance for you he will tell you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, but I wouldn’t like to do that, Ned!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll do as I tell you! I’m going to make something out of you or bust. If you won’t be a golfer you shall be a footballer. Come on and I’ll make arrangements.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3216/87748.html","bookId":720,"creation":"Aug 11, 2019 7:52:52 AM","modification":"Aug 11, 2019 7:52:52 AM"}
