{"id":80057,"no":33,"title":"Page 33","content":"\u003cp\u003e\"You know there\u0027s no phone at Hazelhurst\u0027s Horror.\" She shuddered. \"I wish you wouldn\u0027t call it that.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the one who said it was an appropriate label.\" \"Okay, okay, we\u0027ll argue over that later. Who are we going to call?\"\u003c/p\u003e\n\u003cp\u003e\"Caitlin Evanger.\" Jonas\u0027s mouth curved in satisfaction as Verity shot him a startled glance.\u003c/p\u003e\n\u003cp\u003e\"Caitlin? Why on earth are we going to call her?\" she demanded.\u003c/p\u003e\n\u003cp\u003e\"I told you—research. Evanger is the one person I know who might have the answers to a few questions I\u0027ve got. Besides, she owes us.\"\u003c/p\u003e\n\u003cp\u003eVerity looked at him. \"How can she help us?\" \"She\u0027s the one who inherited all the records left by the Department of Paranormal Research when the wise, far-sighted trustees of Vincent College finally came to their senses and closed down the lab. She claimed she was Elihu Wright\u0027s one and only heir, remember?\"\u003c/p\u003e\n\u003cp\u003e\"How could I forget?\" Verity muttered.\u003c/p\u003e\n\u003cp\u003eElihu Wright had been the wealthy eccentric who originally endowed the Department of Paranormal Research at Vincent College. It was in the department\u0027s lab that Jonas had developed his psychic powers to the point where they had almost turned him into a killer. He had fled the lab, running from the unknown potential of his talent. It wasn\u0027t until he had met Verity that he had begun to learn how to control his unique affinity with the past.\u003c/p\u003e\n\u003cp\u003e\"There have never been very many places in the country where someone who thought he had psychic powers could get himself tested,\" Jonas continued. \"Vincent College had one of the few legitimate labs on the West Coast. I want to know if any of that crowd back at the villa was ever tested, and if so, what the report was.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you want to investigate Yarwood, Elyssa, and the others? What have they got to do with this job?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure yet. I just want to find out everything I can before I go any further. There\u0027s murder involved. Murder and treasure. That\u0027s a potent combination, I just want to check out a few things.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s assuming Caitlin can still find the old records.\"\u003c/p\u003e\n\u003cp\u003e\"She had mine, didn\u0027t she?\" Jonas\u0027s expression was grim.\u003c/p\u003e\n\u003cp\u003eVerity cleared her throat. \"Well, yes, but she had a, uh, special reason to save yours.\"\u003c/p\u003e\n\u003cp\u003e\"She sure as hell did.\" Jonas swung the duffel over his other shoulder. \"As soon as we find a phone, we\u0027ll see if she had the sense to save any others. First, we\u0027d better find a place to spend the night.\" He stopped at the top of the pier and scanned the picturesque Victorian buildings that lined the waterfront street. \"Not a Hilton in sight.\"\u003c/p\u003e\n\u003cp\u003eVerity smiled happily. \"Thank goodness. Let\u0027s try one of those quaint little bed-and-breakfast places I\u0027ve been reading about. These island towns are famous for them.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know?\"\u003c/p\u003e\n\u003cp\u003e\"I brought along a handbook. It\u0027s in the duffel bag.\"\u003c/p\u003e\n\u003cp\u003e\"A-ha!\" Jonas set down the bulky bag and unzipped it. \"I knew there was more than a nightgown and a blow dryer in here.\" He crouched beside the canvas bag and peered inside. The expression of shock on his face as he perused Verity\u0027s last-minute packing job turned thunderous. \"Dammit to hell, Verity!\"\u003c/p\u003e\n\u003cp\u003e\"Now, Jonas… \"\u003c/p\u003e\n\u003cp\u003e\"You went crazy! What did you think we were going to do—set out on an expedition to the Arctic?\"\u003c/p\u003e\n\u003cp\u003e\"Jonas, be reasonable. This is winter, remember? It\u0027s cold, and it\u0027s liable to rain at any moment. I decided to be safe rather than sorry.\"\u003c/p\u003e\n\u003cp\u003e\"So you brought along an umbrella, rain boots, a slicker, what appears to be a year\u0027s supply of makeup, two pairs of pantyhose, two changes of jeans, a couple of pairs of shoes, and a dress?\" He looked up. \"I know this is going to sound silly, but why did you bring the dress?\"\u003c/p\u003e\n\u003cp\u003eShe gazed down at the handful of shimmering green silk. She wouldn\u0027t be able to get into it much longer.\u003c/p\u003e\n\u003cp\u003eSoon her body would be growing round and heavy. \"I thought we might go out to dinner at a nice place,\"\u003c/p\u003e\n\u003cp\u003eshe mumbled. \"I put in a tie for you.\"\u003c/p\u003e\n\u003cp\u003eJonas started to say something about the tie that would have been scathing, but for some reason he changed his mind. Without a word he fished around inside the duffel bag until he found the guidebook.\u003c/p\u003e\n\u003cp\u003eHe zipped up the bag, slung it back over his shoulder, and handed the book to Verity.\u003c/p\u003e\n\u003cp\u003e\"Here,\" he said gruffly. \"Pick a place. Preferably something that isn\u0027t too far away. I didn\u0027t bring the pack llama.\"\u003c/p\u003e\n\u003cp\u003eVerity opened the guidebook, scanning the listings for bed-and-breakfast inns on the island. \"How does the Harbor Watch Inn sound? \u0027Bedrooms are furnished with charming nineteenth-century antiques, including four-poster beds. Lobby has lots of rustic charm, with a comfortable stone fireplace and view of the harbor. Breakfast is ample, featuring eggs, scones, fresh juices, and plenty of good coffee.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Well,\" said Jonas, his golden eyes gleaming in the cold sunlight, \"I like the sound of the four-poster bed.\u003c/p\u003e\n\u003cp\u003eAs long as I have you, a four-poster, and my trusty belt, I can make do.\"\u003c/p\u003e\n\u003cp\u003eVerity felt herself turning pink. \"Just remember that one of these days I\u0027ll be getting even for that little bondage number you pulled last night.\"\u003c/p\u003e\n\u003cp\u003eJonas showed his teeth in a wicked smile. \"All I ever get are promises,\" he taunted softly.\u003c/p\u003e\n\u003cp\u003eVerity shook back her mane of copper curls and stuffed the guidebook into her purse. \"You\u0027ll see. Let\u0027s get going. The Harbor Watch Inn is only a couple of blocks from here, according to the guidebook.\"\u003c/p\u003e\n\u003cp\u003eThe walk to the quaint Victorian inn turned out to be a little farther than Verity estimated, but Jonas kept his grumbling to a minimum. Verity refused to give him the satisfaction of complaining, but she was vastly relieved when they reached their destination. She was feeling a little guilty about having stuffed the duffel bag with her things.\u003c/p\u003e\n\u003cp\u003eIt was cold, and there was a damp wind blowing. Verity decided that the island town probably looked bright and colorful during the warm summer months, but in the dead of winter everything appeared uniformly gray.\u003c/p\u003e\n\u003cp\u003e\"You know, Jonas, you may have been right when you said this trip to the Northwest wasn\u0027t going to be quite the same as a jaunt to Hawaii.\"\u003c/p\u003e\n\u003cp\u003e\"One of these days you\u0027ll start listening to me, little tyrant.\"\u003c/p\u003e\n\u003cp\u003e\"I always listen to you.\" She batted her lashes outrageously.\u003c/p\u003e\n\u003cp\u003eJonas chuckled. \"Like hell.\"\u003c/p\u003e\n\u003cp\u003e\"I just don\u0027t always pay attention. But that makes us even.\"\u003c/p\u003e\n\u003cp\u003eThe Harbor Watch Inn was warm and cozy. It was run by a middle-aged couple who welcomed their new guests with a smile and a drop of sherry. Verity turned down the sherry, and Jonas drank her share as well as his own. \u003c/p\u003e","sourceLink":"https://allnovel.net/gift-of-fire-gift-2/page-33.html","bookId":1796,"creation":"Oct 5, 2019 4:23:39 PM","modification":"Oct 5, 2019 4:23:39 PM"}
