{"id":80058,"no":34,"title":"Page 34","content":"\u003cp\u003e\"Sure you don\u0027t want it?\" he asked as he set down the tiny glass.\u003c/p\u003e\n\u003cp\u003e\"No, thanks.\" She\u0027d read somewhere that pregnant women weren\u0027t supposed to drink, and decided she\u0027d verify that snippet of information when she finally went to a doctor.\u003c/p\u003e\n\u003cp\u003eThey were shown to a room that overlooked the harbor. As soon as the door closed behind the manager\u0027s wife, Verity began eagerly to explore the small bedroom.\u003c/p\u003e\n\u003cp\u003eThere was, as promised, a four-poster bed. A charming nineteenth-century ceramic pitcher and bowl sat on the old dresser, and sailing memorabilia adorned the walls.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all so charming,\" Verity said in delight. \"So quaint. So terribly cute.\"\u003c/p\u003e\n\u003cp\u003e\"And it\u0027s all made in Taiwan.\" Jonas casually touched the pitcher on the dresser. \"So much for that bit about the rooms being furnished with antiques. I wonder what other surprises are in store for us. Maybe they\u0027ll accidentally run out of scones at breakfast.\"\u003c/p\u003e\n\u003cp\u003e\"Details. Don\u0027t be so negative.\" Verity unzipped the duffel bag and shook out her green silk dress. She carried it to the closet and was about to hang the garment inside when she glanced around and realized something was missing. \"Jonas, there\u0027s no bathroom!\" she exclaimed.\u003c/p\u003e\n\u003cp\u003e\"Sure there is. Just down the hall.\"\u003c/p\u003e\n\u003cp\u003e\"Down the hall!\" Verity was horrified. \"For the price we\u0027re paying?\"\u003c/p\u003e\n\u003cp\u003e\"The price of unbearable cuteness and quaintness, I\u0027m afraid.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, damn. I should have realized. But that stupid guidebook didn\u0027t warn me.\"\u003c/p\u003e\n\u003cp\u003e\"So what\u0027s the big deal? A little minor inconvenience, that\u0027s all.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not all. I hate places where the bathroom is down the hall,\" Verity insisted stubbornly.\u003c/p\u003e\n\u003cp\u003e\"Why?\" Jonas was genuinely surprised by her vehemence.\u003c/p\u003e\n\u003cp\u003eVerity bit her lip, aware that she was overreacting. She didn\u0027t want to spoil the evening. Turning back to the closet to finish hanging her clothes, she tried to explain. \"It goes back to my childhood, I suppose.\u003c/p\u003e\n\u003cp\u003eWhen I was growing up, Dad and I lived in places like this a lot. Tahiti, Mexico, the Caribbean, you name it. They\u0027ve all got places like this where the bathroom is down the hall.\"\u003c/p\u003e\n\u003cp\u003e\"This is hardly in the same category as a flophouse on some backwater island,\" Jonas said reasonably.\u003c/p\u003e\n\u003cp\u003e\"I know, I know. Those places were all cheap, dirty, and in a bad part of town. But I guess for me the bathroom-down-the-hall bit became symbolic of all those crummy joints. Dad never seemed to mind, but then, he wasn\u0027t the one who volunteered to clean the damn bathroom in exchange for a few bucks off the rent.\"\u003c/p\u003e\n\u003cp\u003eJonas studied her face, fascinated. \"Why in hell did you volunteer?\"\u003c/p\u003e\n\u003cp\u003e\"Because no one else would have cleaned it if I didn\u0027t, and I had to use it along with all the other drunks, whores, and assorted riffraff who lived in the place,\" she exploded.\u003c/p\u003e\n\u003cp\u003e\"Hey, take it easy, honey.\" Jonas gathered her into his arms and gently stroked her hair. \"If it bothers you that much, we can find another place.\"\u003c/p\u003e\n\u003cp\u003eVerity sniffed back tears, shocked by her emotional reaction. The smallest things seemed to get to her these days. \"I\u0027m sorry,\" she mumbled into Jonas\u0027s shirt. \"This is stupid. I don\u0027t know what got into me.\u003c/p\u003e\n\u003cp\u003eThis is a lovely place—beautiful view, clean sheets.\" She surreptitiously wiped away a tear from her cheek. \"The guidebook raved about it.\"\u003c/p\u003e\n\u003cp\u003e\"Guidebooks have been known to give false information.\"\u003c/p\u003e\n\u003cp\u003e\"But it is a nice place.\" Verity lifted her head and glanced around again. \"Really it is. I was just a little thrown there for a minute when I realized where the bathroom was. I\u0027m fine now. Pay no attention to me.\"\u003c/p\u003e\n\u003cp\u003eJonas eyed her closely. She gave him a reassuring smile and blinked away the last of her tears. \"Are you sure you\u0027ll be comfortable staying here tonight?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll think of it as a travel experience,\" she said wryly.\u003c/p\u003e\n\u003cp\u003eJonas nodded. \"If you\u0027re sure.\"\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003e\"Nice bed,\" he remarked thoughtfully.\u003c/p\u003e\n\u003cp\u003eVerity beetled her brows at him. \"Don\u0027t you dare look at it, or me, like that.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happened to your sense of adventure, sweetheart?\"\u003c/p\u003e\n\u003cp\u003e\"This trip is turning out to be adventurous enough without having to put up with your kinky ways,\" she retorted loftily. \"When are you going to call Caitlin?\"\u003c/p\u003e\n\u003cp\u003e\"Now is as good a time as any.\" He picked up the bedside phone.\u003c/p\u003e\n\u003cp\u003e\"Let me talk to her first,\" Verity said quickly.\u003c/p\u003e\n\u003cp\u003e\"Be my guest. I\u0027m not exactly looking forward to the conversation. The woman still gives me the creeps.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re just biased. You never did like her very much.\"\u003c/p\u003e\n\u003cp\u003eVerity dug the number out of her well-worn address book, the same book that had countless entries crossed out under her father\u0027s name. She wondered fleetingly if the little book would be filling up with similar crossed-out entries under Jonas\u0027s name in the years ahead. Pushing aside the depressing thought, she dialed the number. She listened to the ringing on the other end and wondered if Caitlin or her companion, Tavi, would answer.\u003c/p\u003e\n\u003cp\u003eIt had been over a month since she had last spoken to either of them. Jonas wasn\u0027t aware that Verity had called the Evanger house a few times since the events of last fall. He probably wouldn\u0027t have approved of it, but something within her had needed to make certain that the brilliant, moody artist had survived the emotional trauma.\u003c/p\u003e\n\u003cp\u003eThe phone was picked up on the other end and a quiet, gentle voice answered.\u003c/p\u003e\n\u003cp\u003e\"Tavi? It\u0027s Verity. How is everything?\"\u003c/p\u003e\n\u003cp\u003e\"Verity, I\u0027m so glad you called. Everything is going well here. Caitlin is painting again. Isn\u0027t it wonderful?\"\u003c/p\u003e\n\u003cp\u003eVerity smiled. \"Is she pleased with what she\u0027s doing?\"\u003c/p\u003e\n\u003cp\u003e\"I think so. You know her, she demands so much of herself. But the gallery owner who handles her work in San Francisco is certainly happy enough. He says it\u0027s the best work she\u0027s ever done. Something about a new emotional maturity coupled with a brilliant sensitivity and awareness. Caitlin gets a kick out of that. You know her attitude toward art critics—she considers them all parasites.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"But I think that deep down she\u0027s relieved that she didn\u0027t lose whatever it was that gave her work so much power. For a while she thought that if that terrible business from the past was settled once and for all, she would no longer fee! so compelled to paint. But her desire seems to be as strong as ever. Here, let me call her.\"\u003c/p\u003e\n\u003cp\u003eA few moments later Caitlin picked up the phone. \"Verity? I\u0027m glad you called. How are you?\"\u003c/p\u003e\n\u003cp\u003e\"Hobbling around on a sprained ankle, but otherwise fine. I understand you\u0027re painting again?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/gift-of-fire-gift-2/page-34.html","bookId":1796,"creation":"Oct 5, 2019 4:23:39 PM","modification":"Oct 5, 2019 4:23:39 PM"}
