{"id":80102,"no":81,"title":"Page 81","content":"\u003cp\u003ePerhaps he needed to go through some sort of mourning period, she told herself. The psychic talent had been the bane of much of his adult life, but it had been an integral part of him. Losing it must have been like losing a hand, or an arm, or one of the five senses. Verity forced herself to be understanding and undemanding. She took great pains to be good-natured and sweet.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t nag him to finish the report for the Warwicks. She didn\u0027t urge him to write any more articles for the academic journals. She temporarily shelved her big plans to have him do a piece on Renaissance weapons for National Geographic. And she didn\u0027t bring up the subject of another consulting assignment.\u003c/p\u003e\n\u003cp\u003eBut the more understanding she became, the more Jonas withdrew. It was a frustrating spiral, and as she got more and more enmeshed in it all her old fears were revived. She was convinced that Jonas would leave again. And this time, she thought, he might go away for good.\u003c/p\u003e\n\u003cp\u003eThe bottom line here, she thought grimly, was that Jonas didn\u0027t need her the way he once had. She was no longer his psychic anchor. She was merely his lover and the mother of his child—a child he had never planned to have.\u003c/p\u003e\n\u003cp\u003eIt was unfortunate that in the dead of winter, business was light at the No Bull Cafe. Verity had too much time to think.\u003c/p\u003e\n\u003cp\u003e\"When\u0027s the wedding?\" Laura Griswald asked at the end of the week. The two women were sharing a spa pool after hours. Crystal-clear water bubbled and steamed around them.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure there\u0027s going to be one,\" Verity said quietly.\u003c/p\u003e\n\u003cp\u003e\"You mean you two haven\u0027t talked marriage yet?\" Laura\u0027s brows arched in disbelief. \"I thought for sure that when you came back from the vacation up north it would all be settled.\"\u003c/p\u003e\n\u003cp\u003e\"I thought it was.\"\u003c/p\u003e\n\u003cp\u003eLaura leaned forward, her expression one of deep concern. \"Verity, are you telling me that Jonas doesn\u0027t want to marry you? He doesn\u0027t want the baby?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what Jonas wants,\" Verity said as she stood up and reached for her towel. \"I\u0027m not sure he knows, either.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe this. I was so sure everything would work out between you two.\"\u003c/p\u003e\n\u003cp\u003e\"Men are a little more complicated than I once gave them credit for,\" Verity said curtly. \"At least Jonas is.\" She turned around quickly before Laura could see the tears in her eyes, and hurried toward the changing booth.\u003c/p\u003e\n\u003cp\u003eShe dressed in her jeans and a yellow cotton shirt and headed for the resort\u0027s lounge. Jonas would be waiting. He still insisted on accompanying her when she wanted a late-night soak. He refused to let her walk back alone along the icy path to the cottage.\u003c/p\u003e\n\u003cp\u003eVerity saw him as she entered the lounge. He sat slouching with casual grace on a bar stool, his boots hooked over the brass foot railing. He was draining the last of his scotch. And he was not alone.\u003c/p\u003e\n\u003cp\u003e\"Dad! You\u0027re back!\" Verity ran toward her father. \"When did you get in?\"\u003c/p\u003e\n\u003cp\u003eHer father swung around on the bar stool and folded his daughter in a bear-sized embrace. \"Got in about an hour ago. Found Jonas holding down the bar all by himself and thought I\u0027d keep him company until you showed up.\"\u003c/p\u003e\n\u003cp\u003eVerity ignored Jonas, who was giving his full attention to his drink. She smiled brilliantly at her father.\u003c/p\u003e\n\u003cp\u003e\"Did Jonas tell you the news?\"\u003c/p\u003e\n\u003cp\u003e\"What news?\"\u003c/p\u003e\n\u003cp\u003eJonas froze. He shot Verity a glowering look over his shoulder. She paid him no attention.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m pregnant,\" Verity said demurely and watched with delight as her father leaped to his feet.\u003c/p\u003e\n\u003cp\u003eEmerson Ames let out a whoop of joy, grabbed his daughter by the waist, and swung her around in a wide arc. Two people sitting at a nearby table ducked quickly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re pregnant? I\u0027m going to get a grandkid? Bless you, my darling red-haired daughter! What the devil took you so long? Yahoo and pour me another drink, Clement. A big one. Hell, pour everyone in the joint another drink.\" Emerson turned expansively to address the small crowd. \"This round\u0027s on me, folks. Drink up. I\u0027m gonna be a granddaddy.\" There was a smattering of applause and appreciative laughter. Emerson draped a burly arm around his daughter\u0027s shoulders and hugged her while he grinned widely at Jonas. \"So when\u0027s the wedding? I gotta get me a new suit for this.\"\u003c/p\u003e\n\u003cp\u003eJonas swiveled halfway around on the stool, one arm resting along the edge of the bar. He gazed at Verity through narrowed lids. \"Who said anything about marriage?\"\u003c/p\u003e\n\u003cp\u003eEmerson\u0027s euphoric expression turned thunderous in the wink of an eye. He released Verity. \"What the hell are you talking about? Verity says she\u0027s pregnant. Haven\u0027t you gotten around to asking my daughter to marry you yet, you son of a bitch?\"\u003c/p\u003e\n\u003cp\u003eThe bar fell silent. Clement, the bartender, groaned. Verity held her breath.\u003c/p\u003e\n\u003cp\u003eJonas stood up with insulting slowness. He hooked his thumbs into his belt and scowled at Emerson.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re barking up the wrong tree, Ames. I did ask your daughter to marry me. Had a hell of a time talking her into it, too. But after I did, things changed. Important things. You want to know when the wedding will be? Ask Verity. I\u0027ve been getting the impression she\u0027s had a few second thoughts.\"\u003c/p\u003e\n\u003cp\u003eVerity\u0027s mouth fell open in amazement. \" Jonas. How could you think that?\"\u003c/p\u003e\n\u003cp\u003eJonas turned on her. \"That\u0027s a damn fool question. What else was I supposed to think this past week?\u003c/p\u003e\n\u003cp\u003eYou\u0027ve been acting damn weird again. You\u0027re harder to figure out now than you were when you were moping around wondering whether or not to tell me about the baby.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been acting weird? What a nasty thing to say. You\u0027re deliberately reversing the situation. You\u0027re the one who\u0027s been acting strange. I got the distinct impression that you were no longer interested in marriage yourself.\"\u003c/p\u003e\n\u003cp\u003eEmerson took a threatening step forward. \"What\u0027s going on around here? What is it with you two?\"\u003c/p\u003e\n\u003cp\u003e\"Stay out of this, Emerson.\" Jonas shot the big man a warning glance. \"This is between Verity and me.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you picked a fine place to settle a private matter,\" Emerson roared back.\u003c/p\u003e\n\u003cp\u003e\"Yeah, you\u0027ve got a point. Come on, Verity. Let\u0027s get the hell out of here.\" Jonas caught her wrist and headed for the door.\u003c/p\u003e\n\u003cp\u003e\"Ouch. Let go of me, dammit. I don\u0027t have to put up with your caveman tactics. I\u0027m pregnant. I deserve a little consideration.\"\u003c/p\u003e\n\u003cp\u003e\"I deserve a little honesty,\" he snarled, hauling her through the doorway. \"I\u0027m sick of all the sweetness and light I\u0027ve been getting lately. If you\u0027ve got something to tell me, you can tell me straight out. You don\u0027t need to pu**yfoot around me just because I\u0027m not… \"\u003c/p\u003e\n\u003cp\u003e\"Just because you\u0027re not what?\" Verity goaded as he yanked her through the rustic lobby and out into the cold night air. \u003c/p\u003e","sourceLink":"https://allnovel.net/gift-of-fire-gift-2/page-81.html","bookId":1796,"creation":"Oct 5, 2019 4:23:39 PM","modification":"Oct 5, 2019 4:23:39 PM"}
