{"id":80104,"no":83,"title":"Page 83","content":"\u003cp\u003e\"I was afraid to bring up the subject because I couldn\u0027t tell how you would react.\" He slid a hand down to the curve of her thigh. \"I\u0027ve explained that. I was terrified of giving you an excuse to talk about our relationship.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong with that? We should discuss our relationship more. We need to talk about it.\"\u003c/p\u003e\n\u003cp\u003eJonas raised his head, his eyes glinting in the darkness. \"Relationship discussions make me nervous. I\u0027d rather go to bed with you than talk about our relationship.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you can see where that attitude has gotten us this past week,\" she admonished roundly. \"We had plenty of sex, but our relationship was falling apart because you wouldn\u0027t open up and tell me how you really felt.\"\u003c/p\u003e\n\u003cp\u003eJonas decided to see if a quick, abject assumption of all the blame would close her luscious mouth. \"It was all my fault. I should have talked to you about the whole thing. I really screwed up, honey. I\u0027m sorry.\" He tangled his fingers in the soft nest of hair above her thighs and inhaled the unique fragrance of her.\u003c/p\u003e\n\u003cp\u003e\"Oh, Jonas, it wasn\u0027t really your fault,\" Verity said graciously. She smiled gently in the shadows, her eyes full of love. \"I understand how traumatic it must have been. You had so much to adjust to it\u0027s a wonder you didn\u0027t sink into a deep depression or something.\"\u003c/p\u003e\n\u003cp\u003e\"Or something,\" he repeated absently, his attention on how soft and warm she felt. Right now he wanted nothing more than to sink into Verity\u0027s welcoming warmth. He wanted the reassurance of her physical response and the peace of mind that always came afterward.\u003c/p\u003e\n\u003cp\u003e\"But now that it\u0027s all out in the open we can really talk about it.\" _\u003c/p\u003e\n\u003cp\u003e\"Yeah. We\u0027ll have to do that sometime.\" He lowered his head and kissed the tight red curls that concealed her feminine secrets.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t we do it now, Jonas?\"\u003c/p\u003e\n\u003cp\u003e\"Now? I don\u0027t think that\u0027s such a good idea, honey.\" He slipped his fingers between her thighs and drew in his breath as his already aroused manhood grew harder and heavier.\u003c/p\u003e\n\u003cp\u003e\"But this is the perfect time, Jonas.\"\u003c/p\u003e\n\u003cp\u003e\"No, sweetheart, it\u0027s not the perfect time. I\u0027ve got other things on my mind.\"\u003c/p\u003e\n\u003cp\u003e\"What other things?\" she asked with wonderful innocence.\u003c/p\u003e\n\u003cp\u003eJonas stifled a groan as he let the pad of his thumb glide across the sensitive nub hidden in the curls.\u003c/p\u003e\n\u003cp\u003e\"Guess.\"\u003c/p\u003e\n\u003cp\u003eVerity flinched in reaction to the provocative caress. Her brows snapped together. \"You mean sex.\"\u003c/p\u003e\n\u003cp\u003e\"Now you\u0027re catching on.\" He parted the soft petals between her legs and circled her gently with one finger. She was already damp. The spicy scent of her grew stronger in his nostrils, inflaming him.\u003c/p\u003e\n\u003cp\u003e\"Jonas, sex is not a substitute for good communication.\" .She gasped softly as his caress became more intimate.\u003c/p\u003e\n\u003cp\u003e\"Think of it as another form of communication—nonverbal communication.\" He lowered his head and touched his tongue to her moist flesh. Then he eased a finger inside the softening sheath.\u003c/p\u003e\n\u003cp\u003e\"I think we\u0027ve already mastered this form of communication,\" Verity whispered. \"We really should talk.\u003c/p\u003e\n\u003cp\u003eI\u0027m serious, Jonas. Stop that. We need to get in the habit of talking things out when we run into problems.\"\u003c/p\u003e\n\u003cp\u003e\"Verity,\" he began, trying to warn her gently that his patience was dissolving rapidly. \"There\u0027s a time for talk and a time for screwing. Trust me. This is not the time for talk.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, Jonas, if we\u0027re going to get married, I insist we practice verbal communication.\" Her fingers clenched on his shoulder.\u003c/p\u003e\n\u003cp\u003eJonas sat up slowly and regarded the woman he was going to marry. \"You want to use your mouth to communicate?\"\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s for the best, Jonas,\" she said very seriously. \"At least at the moment. It\u0027s not that I don\u0027t want to make love with you, but I just feel we need to learn to relate better on a verbal level.\"\u003c/p\u003e\n\u003cp\u003eJonas nodded with sudden decision. \"Right. You want to use your mouth, so go ahead and use your mouth.\" He leaned back against the pillows and reached out to cup the nape of her neck in his palm. He pushed her head gently but firmly down to where his manhood throbbed heavily.\u003c/p\u003e\n\u003cp\u003e\"Jonas, this is not what I meant, and you know it!\"\u003c/p\u003e\n\u003cp\u003e\"Open your mouth, honey, and show me how well you can communicate that way.\"\u003c/p\u003e\n\u003cp\u003e\"You rat! I\u0027m trying to carry on an important, meaningful discussion here, in case you didn\u0027t notice.\" Her breath fanned the full, rounded tip of his shaft, and Jonas thought he would explode then and there.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t wait to receive the pearls of feminine wisdom that roll off your sweet tongue, my love.\" He thrust upward just as she parted her lips to tell him again about the importance of verbal discussion. \"Ah, that\u0027s better.\" He sighed blissfully as her warm mouth closed around him. \"Much better. You communicate beautifully with your mouth, honey.\"\u003c/p\u003e\n\u003cp\u003eHis last coherent thought was that he could live without the part of him that tuned him in to the past. But he would go out of his mind if he ever lost Verity.\u003c/p\u003e\n\u003cp\u003eShe was his future.\u003c/p\u003e\n\u003cp\u003e\"Verity?\"\u003c/p\u003e\n\u003cp\u003eShe stirred, drowsy and sated. \"Yes, Jonas?\" \"I was scared for a while. Really scared. It was like a part of me had vanished. Like I\u0027d lost a leg or an arm.\"\u003c/p\u003e\n\u003cp\u003eVerity came fully awake, listening to his stark confession of fear. \"I know, Jonas. I knew it must be like that for you, but you didn\u0027t say anything. I didn\u0027t know how to get you to talk about it.\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t talk about it. In my mind I linked losing my talent with the possibility of losing you. I couldn\u0027t deal with both losses. But everything is okay now.\"\u003c/p\u003e\n\u003cp\u003eShe smiled with quiet relief and leaned over to kiss him gently. \"Everything\u0027s going to be fine now. Jonas, I would love you no matter what you were missing.\"\u003c/p\u003e\n\u003cp\u003e\"You know what my biggest fear was? Losing you to someone like Oliver Crump.\"\u003c/p\u003e\n\u003cp\u003e\"There was never any need to be afraid I\u0027d run off with Oliver. I like him very much, but I don\u0027t love him.\"\u003c/p\u003e\n\u003cp\u003eHe turned his head on the pillow and looked at her, his golden eyes sober and intent. \"You found something with him. Something similar to what you found with me.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she said firmly. \"What I found with Oliver was nothing at all like what I\u0027ve found with you. Oliver and I became friends. Nothing more.\"\u003c/p\u003e\n\u003cp\u003e\"What about your ability with the crystals?\"\u003c/p\u003e\n\u003cp\u003eVerity smiled. \"Whatever ability I had with the crystals didn\u0027t lead me to feel anything more than friendship for Oliver. The link, or whatever it was we shared, wasn\u0027t… seductive the way it is with you.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t personal. There was no sense of being emotionally linked to him. It\u0027s hard to explain, Jonas. But it was different, trust me. Besides, that\u0027s all gone now.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/gift-of-fire-gift-2/page-83.html","bookId":1796,"creation":"Oct 5, 2019 4:23:39 PM","modification":"Oct 5, 2019 4:23:39 PM"}
