{"id":24939,"no":2,"title":"PREFACE","content":"\u0026nbsp;THE introduction of Dr. Jacobi has saved the author from the onerous task, ofttimes a graceless one, of writing extended prefatory remarks. It was in the course of some researches into the origin of the Child Protection movement in this country that I discovered how little attention had been paid to the historical aspect of this important question. This book represents really a process of elimination, behind which were many fascinating byways, alluring blind alleys, and seeming countless beckoning theories. Toward the last, for a person with human instinct writing on a humane subject, it was hard not to tilt. In the main, however, the author believes that he has hewed to the line. \n\u003cdiv\u003e\n The author is indebted for many courtesies to the officials of the New York Public Library, likewise to the Congressional Library at Washington, the British Museum at London, and the Bibliothèque Nationale at Paris. His thanks are due also to Dr. C. C. Williamson, formerly Chief of the Economics Division of the New York Public Library, who took a deep and serious interest in the work; to Professor Richard Gottheil of Columbia,viii for many helpful suggestions in connection with the Semitics studies; to Professor Hiram Bingham of Yale, for some helpful notes on the Incas; to Mr. A. S. Freidus, Chief of the Jewish Division of the New York Public Library; to Professor Adolf Deissmann, of the University of Berlin; to Mr. Elbridge T. Gerry, whose library provided a wealth of material; to the late Thomas D. Walsh, Superintendent of the New York S. P. C. C., a humanitarian of the first water; to Mr. Jesse B. Jackson, Mr. W. J. Yerby, Mr. Charles H. Allbrecht, and Mr. E. A. Wakefield, all of the American Consular Service; to Mr. J. William Davis, for supervision of the Bibliography; to Mr. Gabriel Schlesinger, for assistance in reading the proofs; and, above all, to Mr. Robert E. MacAlarney, of Columbia University, to whose sustaining criticism and deep personal interest the author owes more than can be here set down.\n\u003c/div\u003e \n\u003cdiv\u003e\n George Henry Payne.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kingsbridge, New York\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; January, 1916\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2792/77265.html","bookId":1291,"creation":"Aug 3, 2019 3:49:36 PM","modification":"Aug 3, 2019 3:49:36 PM"}
