{"id":64858,"no":28,"title":"Page 28","content":"\u003cp\u003e“I never said there was. If I thought for a minute there was a possible connection—”\u003c/p\u003e\n\u003cp\u003e“You must have, or you wouldn’t have raised the issue. You had enough of a feeling about the guy to call me, and I spent the better part of an hour on it, so where do you get off holding out?”\u003c/p\u003e\n\u003cp\u003e“You’re right,” I said, “but I haven’t got anything to give you. His name is David Thompson, except that may not be his name. Now you know everything I know.”\u003c/p\u003e\n\u003cp\u003e“Not everything. Who’s your client?”\u003c/p\u003e\n\u003cp\u003e“No,” I said. “Privilege or no, I’m not giving you that. I’ll talk to her, and if it’s okay with her I’ll give you the name. But do you really want to send the investigation in this direction? If you want to start checking out every guy who may have lied to a woman…”\u003c/p\u003e\n\u003cp\u003e“Let’s leave it that you’ll talk to her.”\u003c/p\u003e\n\u003cp\u003eThat’s where we left it, but as soon as I’d rung off I remembered something that had been sticking in the back of my mind. I called him right back. “The 911 call,” I said. “You said middle of the night?”\u003c/p\u003e\n\u003cp\u003e“Well, not quite. Four in the morning. Close enough to the middle of the night, although I guess it would have been ten or eleven in the morning in Prague.”\u003c/p\u003e\n\u003cp\u003e“The call came from Prague?”\u003c/p\u003e\n\u003cp\u003e“It might as well have. Didn’t show up on Caller ID, and when we checked the LUDS we got an unregistered cell phone.”\u003c/p\u003e\n\u003cp\u003e“They record the 911 calls, don’t they?”\u003c/p\u003e\n\u003cp\u003e“Oh, absolutely, and it’s all on tape. Or digital, I guess. Everything’s digital nowadays.”\u003c/p\u003e\n\u003cp\u003eEven fingers and toes. “Somebody called in at four in the morning. You said ‘he.’ The caller was male?”\u003c/p\u003e\n\u003cp\u003e“Probably. It’s hard to tell too much from a whisper.”\u003c/p\u003e\n\u003cp\u003e“He whispered? Unless they refined the technology, that means no voiceprint ID.”\u003c/p\u003e\n\u003cp\u003e“That’s true, as far as I know.”\u003c/p\u003e\n\u003cp\u003e“So it was him. He phoned it in himself.”\u003c/p\u003e\n\u003cp\u003e“That’s the working assumption,” he said. “Whispered to prevent identification. Or he just didn’t want to wake his wife by talking loud, but somehow I don’t think that was it.”\u003c/p\u003e\n\u003cp\u003e“What did he say?”\u003c/p\u003e\n\u003cp\u003e“ ‘There’s a woman who’s been murdered,’ plus the address and apartment number. Operator tried to keep him on the line but he slipped the hook and swam away. Calls like that, it’s usually mischief, some drunk wants to send a cop on a wild goose chase, or he’s looking to wake up some schmuck he’s got a beef with. But you got to check it out, so the two uniforms went and got the doorman to ring the apartment, and got a key from him when there was no answer. And walked in on more than they expected to find.”\u003c/p\u003e\n\u003cp\u003e“He wanted the body found,” I said.\u003c/p\u003e\n\u003cp\u003e“It does look that way, doesn’t it?”\u003c/p\u003e\n\u003cp\u003e“He wanted it found right away. He knocked himself out to get rid of the evidence, he ran the vacuum cleaner. If you were him, wouldn’t you want her to lie there undiscovered for as long as possible?”\u003c/p\u003e\n\u003cp\u003e“If I were him I’d do the world a favor and cut my fucking throat. But I had the same thought myself. The guy’s not all of a piece. He’s inconsistent.”\u003c/p\u003e\n\u003cp\u003e“Like a Magritte painting,” I remembered.\u003c/p\u003e\n\u003cp\u003e“Well, kind of. This part wouldn’t show up in a painting, it’s not visual, but it’s the same kind of inconsistency. It clashes.”\u003c/p\u003e\n\u003cp\u003eElaine had called it dissonance.\u003c/p\u003e\n\u003cp\u003e“I don’t know, maybe you can’t expect consistency from a crazy man, but this guy’s off the chart. It’s somewhere between Magritte and a turd in a punch bowl, which was an image I thought of yesterday and decided to keep to myself.”\u003c/p\u003e\n\u003cp\u003e“Thanks for sharing.”\u003c/p\u003e\n\u003cp\u003e“Yeah, right. I don’t know why he called it in. Unless he was proud of his work and didn’t want it to go unnoticed.”\u003c/p\u003e\n\u003cp\u003e“And four in the morning, well, he can’t sleep, he’s got nothing else to do…”\u003c/p\u003e\n\u003cp\u003e“It may be a mistake trying to figure him out. Still, how can you keep from trying? I don’t know if it’s enough to call it a pattern, but you could almost say the bastard’s consistently inconsistent. Like with the murder weapon.”\u003c/p\u003e\n\u003cp\u003e“I don’t follow you.”\u003c/p\u003e\n\u003cp\u003e“Taking everything else,” he said, “and leaving behind the one thing most killers would take along. Didn’t I tell you? He left the knife sticking in her chest. He stabbed her in the heart and left it there.”\u003c/p\u003e\n\u003cp\u003e“Jesus. No, you didn’t mention this yesterday.”\u003c/p\u003e\n\u003cp\u003e“Again, probably out of deference to your wife. You don’t want to be too graphic. It’s something, though, wouldn’t you say?”\u003c/p\u003e\n\u003cp\u003e“It seems completely out of character. Any chance you’ll be able to trace it?”\u003c/p\u003e\n\u003cp\u003e“Well, I think that’s why he didn’t mind leaving it. We can trace it all we want and all it’s going to lead is right back to her apartment. I called it a knife just now, but it’s more along the lines of a dagger, and probably a ceremonial one. It’s decorative, and to look at it you wouldn’t think of it as a weapon, not until you saw what he did with it. I guess he must have liked the looks of it. Either he forgot to bring a weapon or he figured he’d pick something out of her knife drawer, and he saw this on the desk or coffee table, wherever she kept it. It’s nice looking, if you owned it you’d leave it out where people could see it. And he certainly did that. He left it sticking straight up in the air with the tip in her heart.”\u003c/p\u003e\n\u003cp\u003e19\u003c/p\u003e\n\u003cp\u003e“I guess you’ll want to get upstairs,” I said. “Don’t you have to see how your stocks are doing?”\u003c/p\u003e\n\u003cp\u003e“Got no stocks.”\u003c/p\u003e\n\u003cp\u003e“You got wiped out?”\u003c/p\u003e\n\u003cp\u003e“Wiped myself out,” he said. “Do that once a day. Way the game is played.”\u003c/p\u003e\n\u003cp\u003eHe explained it for me. Ideally, a day trader started and ended the day with nothing in his account but cash. Whatever he bought during the day’s trading, he sold before the closing bell. Whatever stocks he’d shorted, he covered. Win or lose, plus or minus, he faced a fresh slate each morning. I told him it’s a shame the rest of life’s not like that.\u003c/p\u003e\n\u003cp\u003e“There’s stocks I keep an eye on,” he said. “Charts I study. Make a dollar here, lose a dollar there. Commission be the same on each transaction, whether you a high roller or playing with nickels and dimes. Ten ninety-nine a trade. You betting basketball games, they never give you that good a line.”\u003c/p\u003e\n\u003cp\u003e“And you do okay?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “What’s that thing you like to say? Woman falls off the Empire State Building, passes the thirty-fourth floor, what’s she holler out?”\u003c/p\u003e\n\u003cp\u003e“ ‘So far, so good.’ ”\u003c/p\u003e\n\u003cp\u003e“Only the last half-inch you got to worry about.”\u003c/p\u003e\n\u003cp\u003e“That’s it,” I agreed.\u003c/p\u003e\n\u003cp\u003e“So far so good. I got more’n I started with, and time to time I been drawing some cash for expenses.”\u003c/p\u003e\n\u003cp\u003e“It must be nerve-racking.”\u003c/p\u003e\n\u003cp\u003e“Not too. Worst that happens, day’s a minus ’stead of a plus. You guess wrong on Lucent Technology, guy who guessed right don’t show up with a nine and start bustin’ caps at you. Lose a few dollars, is all.”\u003c/p\u003e\n\u003cp\u003e“You’re saying it beats selling product.”\u003c/p\u003e\n\u003cp\u003e“No comparison, Harrison.” He grinned, enjoying the rhyme. “Plus you’re not out on the street corner on rainy days. Big difference right there.” He called the waiter over, said he guessed he’d have another bagel. To me he said, “This David Thompson. Cops likely to find him?”\u003c/p\u003e\n\u003cp\u003e“I don’t think they’re going to make much of an effort. Sussman didn’t spell it out, but in his position I’d run a computer check of yellow sheets. I’d sort all the David Thompsons, screen for age and color, toss the ones that are currently locked up, and save the rest for some night when there’s nothing on TV.”\u003c/p\u003e\n\u003cp\u003e“You gonna give him Louise?”\u003c/p\u003e\n\u003cp\u003e“My guess is he’ll forget to ask. And what am I holding out? We know damn well they’re two different guys.”\u003c/p\u003e\n\u003cp\u003e“Ever since Monica got killed,” he said, “it don’t seem all that important finding out about David Thompson. Like is he married or not.”\u003c/p\u003e\n\u003cp\u003e“I know. What do we care?”\u003c/p\u003e\n\u003cp\u003e“But ain’t nothing changed far as Louise is concerned.”\u003c/p\u003e\n\u003cp\u003e“No,” I said, “and if he’s running a game, she ought to know about it. And if he’s kosher she ought to know that, too, so she can relax and enjoy herself. I don’t want to give up on Thompson, but I can’t think of much we can do besides wait. Next time Louise sees him, we can take another shot at shadowing him. Or the mailbox lady could call me and give me a name.”\u003c/p\u003e\n\u003cp\u003e“I was thinking ’bout that last part. Seems like we ought to be able to hurry the process some.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“Say we sent him a letter, with the suite number on it and all. Soon as it gets there, she’s gonna call you.”\u003c/p\u003e\n\u003cp\u003e“If she remembers.”\u003c/p\u003e\n\u003cp\u003e“If she don’t, maybe you give her a call to remind her. Even run up there and remind her in person.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“And she looks at the letter, and—” He broke off, closed his eyes, put his head in his hands. “And nothing,” he said. “ ’Cause only way she gets the name is off the envelope, an’ we’d need to know it ourselves to put it down there. Good thing I ain’t in front of my computer, way my mind’s working today.”\u003c/p\u003e\n\u003cp\u003eThe day trader grabbed the check, insisting he’d saved money by lingering in the Morning Star. I told him what he’d proposed wasn’t so bad. It showed he was thinking, if not very clearly. “And it would work fine,” I added, “if all we wanted to do was send him a letter bomb.”\u003c/p\u003e\n\u003cp\u003e“Solve our problems that way,” he said. “Until Louise goes and pulls another nicotine addict off of Craig’s List.”\u003c/p\u003e\n\u003cp\u003eI went across the street. Elaine wasn’t there, but I found her gym clothes in the hamper and deduced that she’d come home to shower and change. It was the sharpest detection work I’d done in a while and I was proud of myself. I called her at the shop and the machine answered. I didn’t leave a message, and while I was trying to decide whether to try her again in ten minutes or walk over there myself, the door opened and she came in.\u003c/p\u003e\n\u003cp\u003e“I opened up,” she said, “and I looked around, and I said the hell with it. I locked up again and came home.”\u003c/p\u003e\n\u003cp\u003e“And here you are.”\u003c/p\u003e\n\u003cp\u003e“And here I am.” She caught me looking at her and said, “I look like hell, don’t I? Tell the truth.”\u003c/p\u003e\n\u003cp\u003e“In all the years I’ve known you, you’ve never looked like hell. Not once.”\u003c/p\u003e\n\u003cp\u003e“Until now.”\u003c/p\u003e\n\u003cp\u003e“And not now, either.”\u003c/p\u003e\n\u003cp\u003e“You want to try telling me I’ve never looked better? I didn’t think so.”\u003c/p\u003e\n\u003cp\u003e“You look fine.”\u003c/p\u003e\n\u003cp\u003eI followed her as she walked to the mirror in the foyer and put her forefingers high on her cheeks. She pressed upward, then let go. “Fucking gravity,” she said. “Who the hell asked for it? God damn it, I was going to be the one woman who never aged. Guess what? I’m the same as everybody else.” She turned to face me. “My God, will you listen to me? The only thing worse than the little lines around my mouth are the words coming out of it. Me me me, all the fucking time. Who cares if I show my age, and why the hell shouldn’t I, anyway? Just because I don’t act it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/all-the-flowers-are-dying-matthew-scudder-16/page-28.html","bookId":2334,"creation":"Oct 5, 2019 9:55:53 AM","modification":"Oct 5, 2019 9:55:53 AM"}
