{"id":65491,"no":25,"title":"Page 25","content":"\u003cp\u003eEliza examined the two disparate plants, now connected at the stem. It made her think of her relationship with Jasper. “Beautiful. I can see why you’re so pleased.”\u003c/p\u003e\n\u003cp\u003e“Normally these plants grow best in a tropical climate, so I am doubly pleased by the success.” He beamed with pride, then noted the letters she carried. His smile faded, and he held out his hand with a sigh.\u003c/p\u003e\n\u003cp\u003eShe handed the post to him. “Are you making any progress with responding to those who write to you?”\u003c/p\u003e\n\u003cp\u003eHis wince was answer enough.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Do you never miss the company of others, my lord?”\u003c/p\u003e\n\u003cp\u003e“I have all I need right here.” He set the mail atop potting soil scattered on the table.\u003c/p\u003e\n\u003cp\u003e“Perhaps others need you. Clearly they continue to extend their friendship to you, even though you don’t reply.”\u003c/p\u003e\n\u003cp\u003eMelville’s well-being was a growing concern to her. What would happen to him when they no longer shared a roof? She was his sole human connection to the world at large. Would he soon become completely estranged from Society, reliant upon the gazettes for news? It broke her heart to think of it.\u003c/p\u003e\n\u003cp\u003eHe returned his attention to watering his plants. “Were you not determined to live a solitary life until a short time ago? Content with quiet walks, good books, and uninterrupted time with your ledgers?”\u003c/p\u003e\n\u003cp\u003e“I have you.”\u003c/p\u003e\n\u003cp\u003e“For how long? Eventually, I will move on to my reward.”\u003c/p\u003e\n\u003cp\u003eEliza drew swirls in the soil with her fingertip. “The time you speak of is still far away.”\u003c/p\u003e\n\u003cp\u003eMelville glanced at her, but blessedly did not continue to speak of his demise. Instead he said, “Regardless, I am relieved to see you out of your mother’s shadow. It does my old heart good to know you’ve found someone with whom to share your life.”\u003c/p\u003e\n\u003cp\u003e“My mother’s shadow,” she repeated softly. “Have I moved out of it? I resemble her, and I’ve chosen a man similar to my father. Perhaps I have assumed her shadow and made it my own?”\u003c/p\u003e\n\u003cp\u003e“You have her beauty,” Melville agreed. “But also a steadfastness she lacked. Your footing is solid. Georgina’s was often unsteady.”\u003c/p\u003e\n\u003cp\u003e“You mean to say she was irresponsible.”\u003c/p\u003e\n\u003cp\u003e“I mean to say she was unstable. She could not maintain an even keel. She listed from one side to the other.” He flicked a small bug off a plant leaf. “Georgina is the reason I acquired an interest in horticulture. My hope was to find some combination of herbal elements to tame the mercurial quality of her moods.”\u003c/p\u003e\n\u003cp\u003eEliza remembered those fluctuations all too well. Georgina would be giddy with happiness one week, then unable to rise from bed the next. “You think her ailment was physical? I have always believed she simply had poor judgment.”\u003c/p\u003e\n\u003cp\u003e“I was willing to consider any possibility. I would’ve searched the world for the key to her happiness, just as I would do for you.”\u003c/p\u003e\n\u003cp\u003e“Mr. Bond makes me happy. The only worry I have now is for you.”\u003c/p\u003e\n\u003cp\u003eHe reached over and patted the back of her hand. “I’ll be well, so long as you are.”\u003c/p\u003e\n\u003cp\u003eTurning her hand over, she squeezed his. “Shall we retire to your study for tea?”\u003c/p\u003e\n\u003cp\u003e“Is it time already?” As if cued, Melville’s stomach grumbled with hunger. He set the watering pot down and dusted off his hands. Then, he proffered his forearm to her.\u003c/p\u003e\n\u003cp\u003e“Don’t forget the mail I brought you.”\u003c/p\u003e\n\u003cp\u003eHe groaned, but gathered up the post. “You are certainly stubborn like your mother.”\u003c/p\u003e\n\u003cp\u003eThey exited the conservatory and strolled the distance to his study in companionable silence. When they stepped into his private domain, Eliza took in the space where her uncle spent the majority of his day and knew she would miss these moments with him. For all his idiosyncrasies and foibles, she loved him dearly. She wondered how much time she might have to visit with him once she lived with Jasper. When Melville retreated to the country, would he be alone for months at a time? Now that she thought of it, she suspected Jasper spent all of the year in London due to his trade.\u003c/p\u003e\n\u003cp\u003eMelville set the latest post atop the leaning pile of mail in the basket by the door. Unable to bear the additional weight, the mass shifted to the side and dozens of letters tumbled to the floor. “Bloody nuisance,” he muttered, squatting to pick up the wayward missives.\u003c/p\u003e\n\u003cp\u003eEliza joined him, raking letters toward her with widespread fingers.\u003c/p\u003e\n\u003cp\u003e“How odd,” he said to himself.\u003c/p\u003e\n\u003cp\u003e“What’s odd?” she queried.\u003c/p\u003e\n\u003cp\u003e“This seal.”\u003c/p\u003e\n\u003cp\u003eShe focused on the black wax seal gracing the letter he held out to her. “It looks to be a sword crossing over…something.”\u003c/p\u003e\n\u003cp\u003e“An hourglass.”\u003c/p\u003e\n\u003cp\u003e“Interesting. To whom does that seal belong?”\u003c/p\u003e\n\u003cp\u003e“I’ve no notion. But there is another one…” He dug into the pile at his feet and withdrew a second letter bearing the same image in black wax. “See here.”\u003c/p\u003e\n\u003cp\u003eHe opened the letter, dropping the others to the floor in the process. As he read, he frowned. Then, he grew very pale.\u003c/p\u003e\n\u003cp\u003e“What is it?” she asked, alarmed.\u003c/p\u003e\n\u003cp\u003e“It appears to be a threat of violence”—Melville held the letter out to her—“against you.”\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eStanding, Jasper set both palms flat on Eliza’s desk and surveyed the five open letters spread out before him. They were obviously all penned by the same female hand. The delicate swirls and flowing script were clearly the handiwork of a woman.\u003c/p\u003e\n\u003cp\u003eHe glanced up at Melville and Eliza, both of whom sat in chairs facing him. “Are there more?”\u003c/p\u003e\n\u003cp\u003e“Those were all we could find,” Eliza said, looking remarkably composed.\u003c/p\u003e\n\u003cp\u003e“Do you have any notion of when the first of these arrived? Or the last?”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003eJasper’s fingertips drummed on the desktop. “This changes everything.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she murmured. “It certainly does.”\u003c/p\u003e\n\u003cp\u003eEach missive warned Melville to retire with Eliza to the country or she would pay the consequences, completely contradicting Eliza’s original assumption that she was being pushed toward matrimony.\u003c/p\u003e\n\u003cp\u003eHe looked at the earl. “Would you, perchance, be able to assist with the procurement of a Special License?”\u003c/p\u003e\n\u003cp\u003eEliza jolted visibly. “Beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“Special License?” the earl asked, frowning and scratching his head. “Who’s getting married?”\u003c/p\u003e\n\u003cp\u003e“I will take that as a ‘no.’” Jasper was certain Melville’s hair was even more of a fright today than it had been the previous times he’d seen it. “Perhaps Westfield can be useful in that regard.”\u003c/p\u003e\n\u003cp\u003e“Jasper.” Eliza no longer looked placid. “What are you about?”\u003c/p\u003e\n\u003cp\u003eStraightening, he set his hands on his hips. “It appears there’s a woman out there who perceives you to be a threat. It’s likely she has an interest in one of your suitors.”\u003c/p\u003e\n\u003cp\u003e“An unhealthy interest.”\u003c/p\u003e\n\u003cp\u003e“One can only hope that it’s Montague who has enamored her to the point of violence.”\u003c/p\u003e\n\u003cp\u003eShe shot him an arch look.\u003c/p\u003e\n\u003cp\u003eHis smile was unapologetic. “Regardless, taking you out of competition could likely remove you from danger straightaway.”\u003c/p\u003e\n\u003cp\u003e“Perhaps the news of my engagement will suffice, if we give it a chance to spread?”\u003c/p\u003e\n\u003cp\u003e“I would rest easier if you and I resided under the same roof.” In truth, he doubted he would rest at all if they shared a bed, but that was a topic for another discussion.\u003c/p\u003e\n\u003cp\u003eMelville nodded. “Quite right. I’ve proven to be unsuitable for the task of protecting you.”\u003c/p\u003e\n\u003cp\u003eEliza’s gaze dropped to her lap.\u003c/p\u003e\n\u003cp\u003e“Eliza.” Jasper made every effort to keep his voice modulated. “I should like to hear your thoughts on the matter.”\u003c/p\u003e\n\u003cp\u003eShe took a deep breath. “I’m not prepared to leave Melville at this time.”\u003c/p\u003e\n\u003cp\u003e“Is he your only concern?”\u003c/p\u003e\n\u003cp\u003eHer head lifted. “Am I overlooking something else?”\u003c/p\u003e\n\u003cp\u003e“No.” He relaxed. “I could take up residence here with you until the end of the Season. As your husband.”\u003c/p\u003e\n\u003cp\u003eThe softness that stole into her eyes when she looked at him was worth far more than the concession deserved, but he wouldn’t complain about that.\u003c/p\u003e\n\u003cp\u003e“Would you?”\u003c/p\u003e\n\u003cp\u003e“I will do whatever you need.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” Her smile lit up the room.\u003c/p\u003e\n\u003cp\u003eA surge of adrenaline pushed through him. Eliza would be his within the week. “Make whatever arrangements you need, but please avoid leaving the house whenever possible.”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“I will see to my end of things.” He cast one last glance at the letters laid out before him. Fury resurfaced with biting swiftness. He would find the author of the threats and ensure that the culprit never posed a hazard to Eliza again.\u003c/p\u003e\n\u003cp\u003eMarriage would not be the end of his hunt.\u003c/p\u003e\n\u003cp\u003eJasper urged his horse away from Lambeth Palace. He cast a final look at the brick gatehouse and Lollard’s Tower, then set his hand lightly over the Special License tucked into his coat’s inner pocket.\u003c/p\u003e\n\u003cp\u003eDrawing abreast of him, Westfield said, “You have yet to tell me precisely what the letters said. Since their contents incited our mad rush to the archbishop, you have to know I’m overset with curiosity.”\u003c/p\u003e\n\u003cp\u003e“The missives were brief. A few lines each, almost in rhyme, with the same admonishment to retire from the city. Two made indirect references to sidesaddles and the Serpentine, both of which relate to accidents Miss Martin experienced.”\u003c/p\u003e\n\u003cp\u003e“Nothing about the falling statue at the Royal Academy? Perhaps it was an accident.”\u003c/p\u003e\n\u003cp\u003e“Perhaps. I’m at a disadvantage in many respects. I don’t know if the letters arrived before the events, which might suggest violence was not the culprit’s first choice. Or if the letters arrived after the fact and served as taunts.”\u003c/p\u003e\n\u003cp\u003e“Written by a woman, you say?” Westfield whistled. “There is some sense in that. A man who wished to prevent her from marrying could simply compromise Miss Martin.”\u003c/p\u003e\n\u003cp\u003e“I doubt she would have conceded, despite the damage to her reputation. She has an aversion to being managed and a limited appreciation for Society’s mores.”\u003c/p\u003e\n\u003cp\u003e“Truly?” The earl tugged the brim of his hat down as a shield against the late afternoon sun. “The more I learn of her, the more I like. Who would have thought a spinster’s sixth Season would cultivate such drama and intrigue?”\u003c/p\u003e\n\u003cp\u003e“Which begs the question: why now? Melville’s correspondence has been accumulating for years. His housekeeper was able to present a small trunk of past letters, and there were no threats prior to this Season.”\u003c/p\u003e\n\u003cp\u003e“I assume you won’t be abandoning your work in favor of a honeymoon?”\u003c/p\u003e\n\u003cp\u003eThe mention of a honeymoon was all it took to fill Jasper’s mind with lascivious thoughts. “If only I were so fortunate.”\u003c/p\u003e\n\u003cp\u003e“You are extremely fortunate.”\u003c/p\u003e\n\u003cp\u003eJasper’s brows rose. “Oh?”\u003c/p\u003e\n\u003cp\u003e“You knew precisely what you wanted, and made certain you attained it.”\u003c/p\u003e\n\u003cp\u003eDirecting his gaze forward, Jasper pondered the somber note in the earl’s normally droll tone. “Is all well with you, my lord?”\u003c/p\u003e\n\u003cp\u003e“Of course. Nothing is ever wrong in my world, Bond. There are no surprises. No challenges. Equanimity rules the day.”\u003c/p\u003e\n\u003cp\u003e“There is something to be said for that.”\u003c/p\u003e\n\u003cp\u003e“Yes, it’s boring.”\u003c/p\u003e\n\u003cp\u003eLaughing, Jasper urged his mount into a canter, leaving the Thames behind. There was a great deal to be done before he could end the day. “You are welcome to stay in my world for a while longer, if you prefer. Never a dull moment.”\u003c/p\u003e\n\u003cp\u003e“Wait until you’re married,” Westfield drawled.\u003c/p\u003e\n\u003cp\u003eJasper entered his house to the sound of raucous laughter floating out of the downstairs parlor. Behind him, Westfield barely stepped onto the marble floor of the visitor’s foyer when Herbert Crouch caught sight of them.\u003c/p\u003e\n\u003cp\u003eHerbert, who’d been leaning against the parlor doorjamb as if awaiting them, pulled his hands out of his pants’ pockets and straightened. He was one of Jasper’s most seasoned employees; old enough that his two grown sons also worked for Jasper. He lumbered over with a broad grin that peeked out from the frame of a bushy, unkempt beard.\u003c/p\u003e\n\u003cp\u003eThe Crouches were an odd-looking lot as a whole. Herbert was of a height with Jasper, but considerably broader. Many of his progeny were near giants; the top of their sire’s head barely reached their shoulders.\u003c/p\u003e\n\u003cp\u003eHerbert mussed his wheat-colored hair with a meaty hand, disrupting the perfectly molded shape of his hat’s interior. “I ’ave news that might be interesting.”\u003c/p\u003e\n\u003cp\u003eGesturing toward his study, Jasper passed his hat and gloves to his butler, but kept his coat on. The Special License in his pocket wasn’t something he was willing to allow out of his immediate reach.\u003c/p\u003e\n\u003cp\u003eHe settled behind his desk. Westfield moved over to the console to help himself to the Armagnac. Herbert sank heavily onto one of the settees.\u003c/p\u003e\n\u003cp\u003eWith libation in hand, Westfield faced the center of the room and leaned back against the console with his hip. He crossed his legs at the ankle and enjoyed a deep swallow of brandy. “How fare you, Crouch?”\u003c/p\u003e\n\u003cp\u003eJasper studied him. The earl seemed to be imbibing more of late. If he continued along the same vein, Jasper intended to bring the matter up for discussion. It was not a subject he looked forward to broaching, but the health of his friend warranted his concern.\u003c/p\u003e\n\u003cp\u003e“As well as can be expected, mi’lord.” Herbert didn’t smile, which was unusual for him. Jasper knew the commoner was ill-at-ease conversing socially with an earl.\u003c/p\u003e\n\u003cp\u003e“How are Mrs. Crouch and your brood?”\u003c/p\u003e\n\u003cp\u003e“All are well. The missus is increasin’ again.”\u003c/p\u003e\n\u003cp\u003e“Again? Dear God.” Westfield took another drink. “How many children do you have now?”\u003c/p\u003e\n\u003cp\u003e“Eighteen. Until the birthin’.”\u003c/p\u003e\n\u003cp\u003e“You are a stronger man than I, Crouch.”\u003c/p\u003e\n\u003cp\u003eHerbert gave an awkward pull on his beard and looked at Jasper almost pleadingly. \u003c/p\u003e","sourceLink":"https://allnovel.net/pride-and-pleasure-historical-3/page-25.html","bookId":2665,"creation":"Oct 5, 2019 9:57:46 AM","modification":"Oct 5, 2019 9:57:46 AM"}
