{"id":65494,"no":28,"title":"Page 28","content":"\u003cp\u003eShe—a reasonable woman who prized her equanimity to the point of excessive caution—was faced with the realization that the only avenue she could bear taking was the most hazardous and unreasonable one.\u003c/p\u003e\n\u003cp\u003eShe’d given Jasper her trust, and she would not take it back. She couldn’t. She loved him too much.\u003c/p\u003e\n\u003cp\u003e“I brought this for you.”\u003c/p\u003e\n\u003cp\u003eJasper turned away from his bed, where several garments were laid out for his selection. He smiled at Lynd, who entered through the sitting room door. His mentor held a folded square of white cloth in his hand. When Jasper accepted it, he saw the letter L embroidered in the corner.\u003c/p\u003e\n\u003cp\u003e“It was my grandfather’s,” Lynd explained, shoving his hands into the pockets of his overly elaborate coat of fine wool. He rocked back on his heels in an uncustomary nervous gesture. “It was passed to my father, then to me. I want you to have it on your wedding day.”\u003c/p\u003e\n\u003cp\u003eThe monogram distorted as Jasper’s eyes stung. Lynd was the closest thing to a father he’d ever had. It meant a great deal to him that Lynd regarded him as a son. “Thank you.”\u003c/p\u003e\n\u003cp\u003eLynd waved the gratitude away with a shaky hand.\u003c/p\u003e\n\u003cp\u003eThat telltale sign of deep emotion goaded Jasper to step forward and embrace his old friend. There was a moment of crushing, then back slapping.\u003c/p\u003e\n\u003cp\u003e“Who would have thought you would marry an heiress?” Lynd said in a gruff voice. “And an earl’s niece in the bargain!”\u003c/p\u003e\n\u003cp\u003eJasper set the kerchief carefully on his bed. “I’m not certain I will believe it until the vows are said and the deed done.”\u003c/p\u003e\n\u003cp\u003e“The chit is fortunate to have you. If she has a brain in her head, she knows it.”\u003c/p\u003e\n\u003cp\u003e“She’s the most intelligent person I know. Oddly humorous. Lacking all guile.” Glancing around the room, Jasper remembered Eliza in the space. “And passionate in ways one would not expect.”\u003c/p\u003e\n\u003cp\u003e“I certainly would not expect it,” Lynd muttered. To which Jasper laughed.\u003c/p\u003e\n\u003cp\u003eLynd studied him with an odd half-smile. “She has changed you. I didn’t realize until this moment that this is a love match.”\u003c/p\u003e\n\u003cp\u003eJasper breathed deeply. He hadn’t named his feelings for Eliza. Perhaps he’d been afraid to. He wanted and needed her, and he could have her. He’d been content with that.\u003c/p\u003e\n\u003cp\u003eTurning away, he gestured at an ensemble of light gray breeches, a silver-threaded waistcoat, and a charcoal gray coat. “What do you think of this?”\u003c/p\u003e\n\u003cp\u003eLynd drew abreast of him and set his hands on his hips. “Have you nothing less plain?”\u003c/p\u003e\n\u003cp\u003eRemembering Eliza’s commentary on Lynd’s need for a proper tailor, Jasper hid a smile and shook his head. “I’m afraid not. This is for you, you see. I cannot have you better dressed than me at my own wedding, can I?”\u003c/p\u003e\n\u003cp\u003eWide-eyed, Lynd looked at him. “You would have me at your wedding?”\u003c/p\u003e\n\u003cp\u003e“I would not have the wedding without you. Who will stand beside me, if not for you, my old friend?”\u003c/p\u003e\n\u003cp\u003eLynd’s nose reddened, swiftly followed by his eyes.\u003c/p\u003e\n\u003cp\u003eA knock came from the open doorway. Jasper looked over his shoulder. Patrick Crouch stood on the threshold with the top of his head nearly touching the lintel. “There is a woman ’ere to see you. I told ’er you weren’t seeing anyone today, but she mentioned Lord Montague and I thought I should tell you.”\u003c/p\u003e\n\u003cp\u003e“Is she still here?”\u003c/p\u003e\n\u003cp\u003e“Aye.”\u003c/p\u003e\n\u003cp\u003eJasper moved to the chair by the door where he’d tossed his coat earlier.\u003c/p\u003e\n\u003cp\u003eLynd cleared his throat. “I’ll come down with you.”\u003c/p\u003e\n\u003cp\u003eThey descended to the ground floor and took up positions in Jasper’s study—Jasper leaned into the front of his desk, while Lynd settled into a wingback with one ankle set atop the opposite knee. In short order, a petite brunette entered the room. She was lovely, with sable-dark hair and cornflower blue eyes. Her back was ramrod straight and her head held high. She declined to pass her fur-lined cape and muff to the butler, and spent a long moment sweeping the room from one end to the other with an examining glance.\u003c/p\u003e\n\u003cp\u003eFinally, she returned her attention to Jasper and said, “Mr. Bond, I presume.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Mrs. Francesca Maybourne.” She brushed off the immaculate damask of his settee with a gloved hand before perching delicately on the edge. She fluffed her rain-dampened skirts with little regard for Jasper’s rug.\u003c/p\u003e\n\u003cp\u003eLynd rolled his eyes.\u003c/p\u003e\n\u003cp\u003eJasper crossed his arms. “This is my associate, Mr. Lynd. How can we help you, Mrs. Maybourne?”\u003c/p\u003e\n\u003cp\u003e“I trust I have your discretion,” she said in a clipped tone.\u003c/p\u003e\n\u003cp\u003e“I would not be successful in my profession if I weren’t discreet.”\u003c/p\u003e\n\u003cp\u003eShe weighed his assurance for a second, then nodded. “My sister is in trouble, Mr. Bond. I’m at my wits’ end trying to help her.”\u003c/p\u003e\n\u003cp\u003e“Can you elaborate?”\u003c/p\u003e\n\u003cp\u003eShe met his gaze directly. “Eloisa is young and impetuous. She has yet to learn how to deny herself anything. Recently, she began a flirtation with the Earl of Montague. I thought it was ridiculous, but relatively harmless. After all, my sister is a married woman.”\u003c/p\u003e\n\u003cp\u003eJasper’s brows rose.\u003c/p\u003e\n\u003cp\u003e“However, it has come to my attention that Lord Montague is a scoundrel of the worst sort.” Mrs. Maybourne’s nose wrinkled, which softened her sharpness somewhat. “My sister came to me this morning in tears. It seems Lord Montague asked her for a token of her affection. I was horrified when she told me this! To give irrefutable evidence of an indiscretion…I cannot imagine what she was thinking.”\u003c/p\u003e\n\u003cp\u003e“What was this trinket?”\u003c/p\u003e\n\u003cp\u003e“A sapphire and diamond necklace, sir. One of great value. And if that were not bad enough, it’s a family heirloom on her husband’s side. There is no doubt he will notice its loss.”\u003c/p\u003e\n\u003cp\u003e“Has she asked for the necklace back?”\u003c/p\u003e\n\u003cp\u003e“Many times. Prior to today, Lord Montague said he would return it. Then, this morning, he said he intended to sell it. He gave her the name of the jeweler and said she could contact the proprietor any time after three o’clock this afternoon to repurchase it.” Mrs. Maybourne sighed and wrung her hands. “The necklace is worth a small fortune, sir. There is no way for her to obtain the funds necessary to reclaim it without her husband becoming aware.”\u003c/p\u003e\n\u003cp\u003eJasper’s lips pursed. He glanced at Lynd. Montague had devised a way to obtain the funds needed to buy back his marker. Yet by some twist of fate, the knowledge had been brought to Jasper. It seemed he was destined to destroy Montague.\u003c/p\u003e\n\u003cp\u003eHe looked back at Mrs. Maybourne. “You want me to retrieve the necklace before he pawns it.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Perhaps he already has.”\u003c/p\u003e\n\u003cp\u003eShe shook her head, causing thick glossy curls to sway around her piquant face and long, slender neck. “I pray that’s not the case. I approached a Runner, but because a peer is involved, he refused the commission. Mr. Bell recommended you, sir. In the interim, he ascertained that the necklace had not yet been brought into the store as of an hour ago. He agreed to watch the premises until you make an appearance. Perhaps you will arrive too late. I won’t hold anyone but my sister responsible for such a lamentable end. But if God is kind, you will precede Montague and find a way to bring this debacle to a successful resolution.”\u003c/p\u003e\n\u003cp\u003e“This is no easy task you set,” Jasper warned.\u003c/p\u003e\n\u003cp\u003e“My sister cannot afford to buy the necklace, Mr. Bond. But she and I are capable of affording you.”\u003c/p\u003e\n\u003cp\u003e“Bond.” Lynd uncrossed his legs and leaned forward. “May I have a word with you?”\u003c/p\u003e\n\u003cp\u003e“Time is of the essence!” she cried.\u003c/p\u003e\n\u003cp\u003eLynd managed a ghost of a smile. “It won’t take but a moment.”\u003c/p\u003e\n\u003cp\u003eJasper followed Lynd out to the foyer. “What are the odds that this should fall in my lap?”\u003c/p\u003e\n\u003cp\u003e“Tony Bell is a good man. Certainly an excellent source of new business.” Lynd stopped in the center of the circular rug and turned around. “Let me manage this task for you. You cannot take this on today, yet the opportunity isn’t one you can allow to slip through your fingers.”\u003c/p\u003e\n\u003cp\u003eGrowling, Jasper ran a hand through his hair and damned the timing of this unexpected boon. “I cannot send you out to accost a peer. If things go awry, the penalty could be your life.”\u003c/p\u003e\n\u003cp\u003e“That’s what masks are for, my boy.” Lynd grinned. “I’ll put on that suit you have for me, and add a wig. If Montague attempts to identify me later, he’ll describe a very different fellow. With any luck, I will even arrive at the wedding on time.”\u003c/p\u003e\n\u003cp\u003e“Montague is my cross to bear.”\u003c/p\u003e\n\u003cp\u003e“Bloody hell.” Lynd shook his head. “You know how I feel about this vendetta you wage—it cannot help your mother now. That said, you are so close to achieving your final aim, and I would rest easier knowing you’ve put the past behind you. But I’m not certain you can do so until you see this matter of Montague’s property through to the end.”\u003c/p\u003e\n\u003cp\u003eJasper’s head fell forward. For all of his life, the one thing he’d needed was justice for his mother. And now, with the end in sight after years of planning, he could no longer deny he wanted Eliza more. He wanted her so badly that when faced with the choice of foiling Montague or getting married, the latter was the event he couldn’t bear to miss. Even while the thought of Montague slipping through his fingers caused his gut to knot and sweat to mist his skin, the response was only a shadow of what he felt when contemplating the loss of Eliza.\u003c/p\u003e\n\u003cp\u003eTorn, he spoke gruffly. “I’m certain I will not rest easy until I’ve seen my plan through to the end. Montague’s ruination is all I have lived for, for so long. How can I abandon the cause in the final hour? How could I face my reflection in the mirror every morning, knowing I deserted my life’s goal only days before fruition?”\u003c/p\u003e\n\u003cp\u003e“By having something else in your life more fulfilling,” Lynd posited. “You are young yet. There is a world out there to be explored. I know that’s what your mother would have wished for you.”\u003c/p\u003e\n\u003cp\u003eA thought that had eluded Jasper previously came to him in that moment. Was it possible that the tutoring she’d secured for him had not been for his father’s benefit at all? Perhaps a secure and brighter future for her son had been the true aim.\u003c/p\u003e\n\u003cp\u003eRegardless, it wasn’t his mother’s wishes—whatever they may have been—that decided him. He made his choice based on the instincts that had saved his life so many times before.\u003c/p\u003e\n\u003cp\u003e“I cannot lose Eliza,” Jasper said with total, unequivocal conviction. With her, he had no sordid past. There was only the future, one he looked forward to and…needed. “If you can see to Montague, I’d be eternally grateful. As for myself, I have a wedding to attend.”\u003c/p\u003e\n\u003cp\u003e“Right, then.” Gesturing toward the study, Lynd said, “You deal with the matter of the retainer and collect the necessary information. I’ll change my garments.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” Jasper clasped him on the shoulder.\u003c/p\u003e\n\u003cp\u003eLynd flushed. “Consider it a wedding gift. Now off with you. There is work to be done and vows to be spoken.”\u003c/p\u003e\n\u003cp\u003eJasper arrived at the Melville house precisely at three o’clock. Eliza delayed the donning of her wedding gown for his arrival and rushed to the lower floor to meet him. She came to a halt partway down the last flight of stairs, arrested by the sight of him. He’d dressed in the same garments he wore on the day they’d met, and the sentimentality of the gesture touched her so deeply her chest ached with it. His dark hair was slightly windblown and his cheekbones burnished by the cold. He was beautiful in every way. Flawless to her eyes.\u003c/p\u003e\n\u003cp\u003eSmitten, she sighed. Jasper heard. His gaze lifted to find her, and she watched his expression change, becoming fiercely focused.\u003c/p\u003e\n\u003cp\u003e“Eliza.”\u003c/p\u003e\n\u003cp\u003eShe barely heard her name, but she felt it. She rushed down the remaining steps and stopped a few feet away from him. “How are you?”\u003c/p\u003e\n\u003cp\u003e“Better, now that I’m with you.”\u003c/p\u003e\n\u003cp\u003eEliza gestured toward the parlor, then led the way. As always, she knew he followed even though he moved silently. She sat, and he took a seat beside her on the settee.\u003c/p\u003e\n\u003cp\u003eThey were to be married in an hour. She felt more joy than apprehension about that.\u003c/p\u003e\n\u003cp\u003e“I am so glad you came early.” She fought the urge to reach for his hand. “I’ve been worried about you since we parted last night.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Montague is very much like his father. The manner in which he spoke was difficult to tolerate.”\u003c/p\u003e\n\u003cp\u003e“His father…?”\u003c/p\u003e\n\u003cp\u003e“I’ve come to you now because we have something to discuss before the wedding, something you must know before we say our vows to one another. I can only pray you’ll still have me, once the truth is out.”\u003c/p\u003e\n\u003cp\u003eEliza was made wary by his tone and her own lingering anxiety from Reynolds’ visit. “You can tell me anything. I want to support you, Jasper. You no longer have to carry your burdens alone.”\u003c/p\u003e\n\u003cp\u003eHis dark eyes were contemplative and somber. “It’s my goal to commit myself to you unencumbered. I am working diligently in that regard.”\u003c/p\u003e\n\u003cp\u003eShe was waiting patiently for him to continue when a violent pounding came to the front door. The sound echoed through the lower floor and brought them both to their feet.\u003c/p\u003e\n\u003cp\u003eSomehow, without appearing to run, Robbins reached the entrance before they did. The butler opened the door and revealed one of Jasper’s crew, the handsome young man who’d escorted her to Jasper’s home the night she shared his bed. Aaron yanked off his hat when he saw Eliza. His wild eyes caused her alarm.\u003c/p\u003e\n\u003cp\u003eJasper quickly outdistanced her with his longer stride. “What is it?”\u003c/p\u003e\n\u003cp\u003e“The store. It’s ablaze.”\u003c/p\u003e\n\u003cp\u003e“Pennington’s?”\u003c/p\u003e\n\u003cp\u003eEliza’s heart lodged in her throat. “What is ablaze? What’s happening?”\u003c/p\u003e\n\u003cp\u003e“Stay with her,” Jasper ordered, running down the front steps to where a footman held the reins to Aaron’s mount. Catching the pommel with both hands, he vaulted into the saddle and galloped away. \u003c/p\u003e","sourceLink":"https://allnovel.net/pride-and-pleasure-historical-3/page-28.html","bookId":2665,"creation":"Oct 5, 2019 9:57:46 AM","modification":"Oct 5, 2019 9:57:46 AM"}
