{"id":66290,"no":4,"title":"Page 4","content":"\u003cp\u003eTelemakos was rather proud to be named for Odysseus’s son, though it was not lost on him that his name was his patient mother’s subtle reprimand to his wayward father. Medraut had been in Britain when Telemakos was born, and had not known of his son’s existence for the first six years of Telemakos’s life. Having Medraut as a father was much like having Odysseus as a father, Telemakos thought, and he sympathized deeply with his namesake. There seemed only a slender difference between not knowing if your father was alive and never hearing his voice. The best part of The Odyssey, Telemakos thought, was the contest at the end, where Odysseus reveals himself by stringing his own bow, which no one else can do, although Telemakos nearly manages it; and then together they destroy the men who have been laying waste to their estate and plotting Telemakos’s murder. How wonderful to be in league with your father like that, after nearly twenty years of hoping he was not already dead.\u003c/p\u003e\n\u003cp\u003eTelemakos climbed out of his own bed and felt his way through the sleeping house, as sure-footed and confident as if he were blind and always found his way by touch and smell and echo. As he had guessed, his mother was not alone in her bed. Telemakos wriggled in between his parents and pulled the blankets over him.\u003c/p\u003e\n\u003cp\u003e“Oh, not you, boy,” said Turunesh sleepily, because she was as jealous of his father’s attention as Telemakos, and had him to herself even less. She made room for Telemakos.\u003c/p\u003e\n\u003cp\u003eTelemakos lay still between his mother and father, savoring this moment when they were all three together and content, complete.\u003c/p\u003e\n\u003cp\u003eHe dreamed that the lions were pretending to eat him. He was not afraid of them; he knew they were only playing. They took turns biting the top of his head. Their teeth closed tightly enough to sting his scalp, but not enough to break the skin. They were persistent, and Telemakos was beginning to be annoyed with the game, but he did not know how to get away from their teeth without hurting himself.\u003c/p\u003e\n\u003cp\u003eHe woke, then; it was still dark. His parents were asleep. His scalp prickled. Telemakos reached up to touch his head and found his father’s hand tangled in his hair.\u003c/p\u003e\n\u003cp\u003eHe tried to unthread the taut, strong fingers, but his hair was nearly as thick as his mother’s, and matted easily. It was a trial to Turunesh to keep it free of snarls. She liked it long, because it was so bright and so unusual and so like Medraut’s. Medraut had a firm handful, and his grip was like iron. When Telemakos tried to free himself, Medraut sighed in his sleep and tightened his hold so fiercely that Telemakos could not move his head.\u003c/p\u003e\n\u003cp\u003e“Ah, little bright one,” said Medraut in Latin, speaking low and clear. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003eTelemakos lay frozen, his head trapped, so startled he was almost alarmed. Except for the shouted warning, Telemakos had never heard his father speak.\u003c/p\u003e\n\u003cp\u003e“Ras Meder?” he whispered, but he knew that Medraut was asleep, or he would not be talking. Telemakos spoke aloud. “Sir?”\u003c/p\u003e\n\u003cp\u003eIs he talking to me? Telemakos wondered, torn between delight and dread. Little one, he said, he must mean me. It did not strike Telemakos strange that Medraut spoke Latin, for it was still spoken throughout Britain, he knew, and Turunesh encouraged her half-British son to use it himself.\u003c/p\u003e\n\u003cp\u003eMedraut sighed again, his fingers still wound tight in Telemakos’s hair. Then he uttered a string of syllables in no language Telemakos had ever heard.\u003c/p\u003e\n\u003cp\u003eIt was like being brushed across the back of the neck: it made his arms break out in gooseflesh. Telemakos was tempted to wake Medraut, only to have his familiar silent self back, and not this gibberish-spouting night creature. But Telemakos wanted to hear the voice again. When Medraut had shouted his son’s name, it had been a terrible sound of fear and warning. This was his real voice, low and deep and gentle, full of music.\u003c/p\u003e\n\u003cp\u003eTelemakos reached up once more to touch his father’s hand. Medraut spoke the same string of nonsense, the same sequence. Telemakos listened with all his being, trying to hold the shape of the sound in his mind. He mouthed the syllables over to himself so that he would remember them, as he had done with the words of the salt traders. Telemakos felt sure that whatever language his father spoke in his sleep, his aunt could interpret.\u003c/p\u003e\n\u003cp\u003eHe lay awake and tense for a long time after that, his head imprisoned, repeating the impossible sentence and straining to hear anything else. But Medraut did not speak again. Telemakos did fall asleep at last, because when next he tried to move his head it was free, and the bright dawn was sneaking into the room, and he and his mother were alone in her bed.\u003c/p\u003e\n\u003cp\u003eTelemakos found Goewin packing her ambassador’s satchel. It was still early morning.\u003c/p\u003e\n\u003cp\u003e“Have you got anything exciting in there today?” Telemakos asked. She had once brought home a live cricket in a tiny house of carven ivory.\u003c/p\u003e\n\u003cp\u003e“Here are little amole,” Goewin said, and gave him a handful of miniature tablets of salt. “Pretty, aren’t they?”\u003c/p\u003e\n\u003cp\u003e“What are they for?”\u003c/p\u003e\n\u003cp\u003e“Money. Or soup.”\u003c/p\u003e\n\u003cp\u003eTelemakos laughed. “‘A rich man eats salt,’” he said, quoting his grandfather. He gave the tablets back to Goewin. “What does this mean?” he asked, and repeated what he had heard Medraut say.\u003c/p\u003e\n\u003cp\u003eGoewin packed the salt back in her bag and put it down. Then she stared at Telemakos. She did not answer, so he said it again.\u003c/p\u003e\n\u003cp\u003e“Where did you hear that?”\u003c/p\u003e\n\u003cp\u003e“Ras Meder said it in his sleep.”\u003c/p\u003e\n\u003cp\u003eGoewin had been startled when Telemakos repeated Medraut’s strange words, but she did not seem surprised when he told her his source. “Medraut has always talked in his sleep,” she said. “It’s why he usually spends the night in a hermit’s hole halfway up the cliff wall at Abba Pantelewon. He doesn’t like anyone to hear him. He would give away state secrets in his sleep, if he had any.”\u003c/p\u003e\n\u003cp\u003e“But what does it mean, what he said?”\u003c/p\u003e\n\u003cp\u003e“In my native dialect it means, ‘Little brother, go back to bed.’” With bluff, sharp movements, Goewin stuffed maps and a stylus into her satchel.\u003c/p\u003e\n\u003cp\u003eTelemakos was perplexed. He frowned, and said, “What did he mean, little brother? Did he mean me?”\u003c/p\u003e\n\u003cp\u003e“Of course not,” Goewin said shortly. “Did you go back to bed?”\u003c/p\u003e\n\u003cp\u003e“I didn’t…. But I didn’t understand.”\u003c/p\u003e\n\u003cp\u003e“He wasn’t talking to you,” said Goewin, and flicked shut the brass clasps on her bag. “He thought you were someone else. He thought I was someone else once, too, and smacked me in the face. He’s monstrous in his sleep. I don’t know how your mother endures him.”\u003c/p\u003e\n\u003cp\u003e“Who is Ras Meder’s little brother?”\u003c/p\u003e\n\u003cp\u003e“He was my twin brother. His name was Lleu, the Bright One, the young lion. Lleu son of Artos. He was the prince of Britain; he should have been high king of Britain instead of Constantine, but he died in the battle of Camlan, just before I came here to Aksum. Goodness, Telemakos, you were there during all that fuss about making my cousin Constantine the new high king, you must have heard us speaking of Lleu. I thought you heard everything.”\u003c/p\u003e\n\u003cp\u003eHe did hear everything. He did know who Lleu was. Only he had never considered that the lost prince of Britain had been anyone’s small brother: a young person not unlike himself, who might suddenly need affection when everyone else was asleep, and be lightly scolded for waking people.\u003c/p\u003e\n\u003cp\u003e“Why does Ras Meder still talk to Lleu in his sleep?”\u003c/p\u003e\n\u003cp\u003e“He loved Lleu more than anything. Lleu’s death broke Medraut into pieces. I think it’s why he won’t talk to anyone.\u003c/p\u003e\n\u003cp\u003e“Coming with me this morning?” Goewin finished abruptly, shouldering her satchel. “Or is your father going to take you hunting?”\u003c/p\u003e\n\u003cp\u003e“He is,” Telemakos answered forcefully, although this had not been established, or even hinted at, in his odd paternal encounter in the middle of the night. But it was the chief reason Medraut made his sudden appearances in Kidane’s house, and it was what Telemakos lived for.\u003c/p\u003e\n\u003cp\u003eMedraut took Telemakos well out of the city when they hunted together. They might be gone for as long as a fortnight, often staying at Kidane’s country estate at Adwa, so that Telemakos could be left in safe hands when Medraut sometimes went out on his own. On more than one occasion they had departed for Adwa without telling anyone where they were going or how long they would be gone, Telemakos because he did not know, and Medraut because he never told anyone anything; it did not occur to either one of them that Turunesh might want to know when her son was about to disappear for over a week. On this day Telemakos thought to warn her, and Turunesh gave him her blessing after a fashion:\u003c/p\u003e\n\u003cp\u003e“Oh, get gone. You are safer in the bush with Ras Meder than you are in the lion pit with Sheba and Solomon.”\u003c/p\u003e\n\u003cp\u003eThis was literally true, for Telemakos had once come home from the lion pit with a finger ripped through to the bone, while Medraut never brought him back with any hurt more serious than carefully tended briar scratches.\u003c/p\u003e\n\u003cp\u003eTheir hunting together chiefly consisted of creeping noiselessly through savanna and slough, lying silent in long grass, waiting and watching. Medraut could come close enough to an unwary gazelle that he could snatch hold of it by its horns and the back of its neck, like a lion, while it rolled its eyes and tried to twist its head free. Medraut shot and threw with fearful accuracy, but Telemakos did not doubt that if Medraut wanted for meat he would need no tool other than his hands.\u003c/p\u003e\n\u003cp\u003eTelemakos was Medraut’s equal as a tracker, and would soon be his better. His legs were not as long as his father’s, so he was not as fast; but he was much smaller and even quieter, and he could smell things that Medraut could not.\u003c/p\u003e\n\u003cp\u003eNo one had taught him this skill. It had come through long, long, silent hours of waiting and watching and listening. Telemakos knew lions so well that he could sometimes scent what they had eaten the day before. He could tell with fair accuracy, without looking, how long an animal had been dead. He could often tell what kind of antelope he was following before he saw it. He knew, at least a mile before they came to it, that today there was some wounded thing traveling ahead of them.\u003c/p\u003e\n\u003cp\u003e“Something’s bleeding on the road,” Telemakos said, to alert his father. “I don’t know what. Everything stinks of baboon along here.” Medraut nodded.\u003c/p\u003e\n\u003cp\u003eThey did not necessarily expect to solve the mystery, since they were behind it. But after a time they came to a roadside well, shaded by giant sycamores, with a band of travelers crowded underneath the trees. Some were drinking at the well. At the edge of the band, a boy was being whipped. His bare back was scored with weals, raised though not bloody; he uttered a plaintive cry with each stroke. Medraut let his breath out sharply through his nostrils, a sound of disgust. Telemakos glanced up at his face. His father’s dark blue eyes were narrowed in disapproval, hard and glittering as basalt.\u003c/p\u003e\n\u003cp\u003e“I still smell blood,” Telemakos said, puzzled, though not as disturbed as his father.\u003c/p\u003e\n\u003cp\u003eSuddenly Medraut pulled Telemakos close against him with one arm like an iron band across his chest and the other hand clamped over his eyes like a blindfold.\u003c/p\u003e\n\u003cp\u003e“Hey!”\u003c/p\u003e\n\u003cp\u003eTelemakos struggled, pulling at the hand that was blinding him with both of his own, trying to pry it from his eyes. Medraut shifted his grip on his son and pulled one of Telemakos’s arms behind his back. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sunbird-the-lion-hunters-3/page-4.html","bookId":2671,"creation":"Oct 5, 2019 10:00:39 AM","modification":"Oct 5, 2019 10:00:39 AM"}
