{"id":66291,"no":5,"title":"Page 5","content":"\u003cp\u003eTelemakos was outraged. “Let go! I have seen servants beaten before, I’m not a baby!”\u003c/p\u003e\n\u003cp\u003eMedraut gave a sharp, warning twist to Telemakos’s imprisoned arm. Never before had he deliberately hurt his child. Telemakos went limp in his father’s hold, shocked and betrayed. The heavy hand over his eyes held him blind.\u003c/p\u003e\n\u003cp\u003eThe other child’s pathetic, bleating cries carried on, and Telemakos could still smell blood, and something else out of the ordinary for a band of travelers: the sour reek of cat, which he had not been able to pick out on the road because of the baboons.\u003c/p\u003e\n\u003cp\u003e“Let me see,” Telemakos begged. He did not mean that he wanted to watch; he only wanted not to be held blind like this. It was a violation. But Medraut held him close, gently while he did not move, more fiercely when he tried to break free. Medraut held Telemakos for as long as the wailing continued, and for a few more moments after it stopped. Then, keeping a heavy, guiding hand on the boy’s shoulder, still warning, Medraut freed Telemakos’s eyes and approached the knot of men who were grouped around the unfortunate servant child.\u003c/p\u003e\n\u003cp\u003eThey were giving him a drink now, and pulling his shirt back over his head, a thing he could not do himself. Telemakos saw now that both the boy’s hands had been cut off above the wrists. It could not have happened more than a day ago; one of the stumps still bled. That was the blood Telemakos had smelled. He suddenly understood why Medraut had not wanted him to witness the beating: not that it had itself been horrific, but that it was vile injustice inflicted on someone who was already enduring an incomprehensible suffering.\u003c/p\u003e\n\u003cp\u003eMedraut walked forward, Telemakos at his side. Telemakos glanced up at his father again, apprehensive. Medraut’s narrowed eyes still burned coldly with disgust and disdain. He let go of his son’s shoulder and held up his hand to the travelers, his open palm facing them as though in greeting. He stood so, impassive but for his accusing eyes, until two of them noticed him and came forward a little.\u003c/p\u003e\n\u003cp\u003e“What is that?” one asked.\u003c/p\u003e\n\u003cp\u003e“The staff of Asclepius. He is a physician.”\u003c/p\u003e\n\u003cp\u003eMedraut held his open hand to Telemakos briefly, so that he could see what the others had seen. There was a blue tattoo on the palm of Medraut’s left hand, a snake entwined about a branch.\u003c/p\u003e\n\u003cp\u003eMedraut was obviously foreign; his skin was so white you could pick him out in a crowd across the Cathedral Square. But merchants bargained wordlessly all the time, and because Medraut had approached with a gesture and not a word, the travelers assumed he could not speak, or did not speak their language. They talked between themselves as though they thought he could not hear, either. Telemakos marveled at their bland stupidity.\u003c/p\u003e\n\u003cp\u003e“What spleen, to think he will find work here!”\u003c/p\u003e\n\u003cp\u003e“Well, Butala does need that stump seen to.”\u003c/p\u003e\n\u003cp\u003e“The master won’t put out much for the doctoring of a faithless bond servant. See what the man will take as payment.”\u003c/p\u003e\n\u003cp\u003e“I’m not paying him!”\u003c/p\u003e\n\u003cp\u003eThe other rolled his eyes. “Mother of God. Only find out what he’ll cost.”\u003c/p\u003e\n\u003cp\u003eMedraut spat in the dust at their feet.\u003c/p\u003e\n\u003cp\u003eTelemakos said sharply, “He’s not asking for payment, only for permission.”\u003c/p\u003e\n\u003cp\u003eThey looked at Telemakos in surprise, and then one of them waved Medraut forward. “Please, do your worst.”\u003c/p\u003e\n\u003cp\u003eMedraut turned to Telemakos and held up the blue serpent again. Then he pointed to the well in the center of the grove. He unslung his bow and quiver from his back and handed them to Telemakos.\u003c/p\u003e\n\u003cp\u003e“Could I help, though?” Telemakos offered.\u003c/p\u003e\n\u003cp\u003eMedraut pointed him away again, seriously, then turned his back on him. Telemakos went to sit by the well to wait for him.\u003c/p\u003e\n\u003cp\u003eThere were three others on a stone bench there, two hunched tensely together in conversation, and one patently miserable with his head on his knees and his hands held tightly over his ears. At his feet lay a huge black cat with curling tufts of hair springing from its ears. Telemakos suddenly recognized them all, as though the trick to a puzzle box had just dawned on him and all the interlocking pieces made sense and fit together cleverly. This band was that of Anako, the archon from Deire, on his way home.\u003c/p\u003e\n\u003cp\u003eTelemakos said to the cowering boy, “Has the cat a name?”\u003c/p\u003e\n\u003cp\u003eIt was the boy he had seen in the New Palace, with the thin moustache. He looked up at Telemakos without taking his hands from his ears. “What are you?” he asked disdainfully. “Why should I answer idle questions of someone else’s servant?”\u003c/p\u003e\n\u003cp\u003e“I don’t mind whether or not you speak to me,” Telemakos said truthfully, not caring what they took him for. “I only wanted to look at the cat.”\u003c/p\u003e\n\u003cp\u003eThe boy let go of one of his ears so that he could reach down to scratch the cat between its own fantastic ones.\u003c/p\u003e\n\u003cp\u003e“She’s called Chariclea,” the boy said. The cat was still muzzled. “Go ahead and touch her. She can’t hurt you; she doesn’t have any claws.”\u003c/p\u003e\n\u003cp\u003eTelemakos knelt next to the cat. It looked as though it weighed nearly as much as he did; it was as big as a hunting dog. Telemakos ran both hands down its back. Its fur was sable silk.\u003c/p\u003e\n\u003cp\u003e“Is it a caracal? I thought only their ears were black.”\u003c/p\u003e\n\u003cp\u003e“She’s a black caracal. She’s a freak, like you.”\u003c/p\u003e\n\u003cp\u003e“I’m not a freak,” said Telemakos mildly. He was so accustomed to this kind of jibe that he expected it. “I’m half-breed.”\u003c/p\u003e\n\u003cp\u003e“You’ve the hair of an albino.”\u003c/p\u003e\n\u003cp\u003e“I’m not albino. It’s just light-colored. My father’s hair looks like this.”\u003c/p\u003e\n\u003cp\u003e“What’s your father?”\u003c/p\u003e\n\u003cp\u003e“The doctor.”\u003c/p\u003e\n\u003cp\u003eTelemakos glanced over his shoulder. Medraut had built a small fire and was kneeling over it, busy with something. Telemakos quickly looked away again. It would be bad enough having to listen, he knew, they all knew, without watching as well. He crouched low over the big cat’s neck, raking gentle fingers through its exquisite fur. “Oh, you beauty, you lovely, you treasure!” he whispered to it.\u003c/p\u003e\n\u003cp\u003eThe caracal stretched out its front legs blissfully, kneading at the ground. Its feet were toeless stumps, like hands with the fingers lopped off.\u003c/p\u003e\n\u003cp\u003e“Poor paws,” said Telemakos.\u003c/p\u003e\n\u003cp\u003e“She doesn’t care. She was never hurt, not much; they drugged her for the operation. Lucky old Chariclea. They didn’t bother putting Butala to sleep.”\u003c/p\u003e\n\u003cp\u003e“Ras Meder won’t hurt him more than he has to,” Telemakos said, an empty reassurance. He was fairly certain that Medraut was going to have to sear the boy’s wounds to seal them, and that he did not have the time nor the herbs nor the equipment he needed to do it painlessly.\u003c/p\u003e\n\u003cp\u003eTelemakos and his sullen companion bore the worst of Butala’s screaming each in his own way, the cat boy bent over with his head wrapped in his arms again, and Telemakos with his face buried against the caracal’s side and his arms locked around its neck. When it was quiet again Telemakos raised his head, somewhat chastened to remember how he had struggled against Medraut’s hand over his eyes, when here he was covering them anyway.\u003c/p\u003e\n\u003cp\u003e“What did he do?” Telemakos asked. “What did he do that your master had to cut off his hands as punishment?”\u003c/p\u003e\n\u003cp\u003e“He didn’t do anything,” the boy said, his voice savage. “He heard something. Now no one else will hear it.”\u003c/p\u003e\n\u003cp\u003e“How did he hear it? Why was he there?”\u003c/p\u003e\n\u003cp\u003e“We all heard it, whatever it was,” the boy said. “Anako was speaking Greek, was he not, as he always does when he doesn’t want us to know what he’s talking about, only afterward his secretary happened to remember that Butala understands Greek. So Butala had his tongue cut out.”\u003c/p\u003e\n\u003cp\u003e“But why his hands?”\u003c/p\u003e\n\u003cp\u003e“You called your father ras, are you a prince, then? Is royalty all so stupid? So that he can’t write, or gesture.”\u003c/p\u003e\n\u003cp\u003e“Well, your master won’t get much use of him with no hands, will he?” Telemakos said darkly.\u003c/p\u003e\n\u003cp\u003eThe cat boy stared at him witheringly. “Butala wasn’t ever used for his hands.” He let that fall between them like lead through water. Then he added, “He’s just a porter.”\u003c/p\u003e\n\u003cp\u003e“Why did they have to whip him?”\u003c/p\u003e\n\u003cp\u003e“He keeps dropping things. He can’t adjust his straps. The best part of the story is that he probably didn’t hear anything anyway, because none of us were paying any attention to the master and his secretary, we were all too busy watching the salt merchant’s little monkeys fighting one another. Who knows, who cares what the master said?”\u003c/p\u003e\n\u003cp\u003ePlague will raise the price of salt.\u003c/p\u003e\n\u003cp\u003eThe dizzy rush of blood to his head made Telemakos feel as though his face was on fire. The rest of him went cold.\u003c/p\u003e\n\u003cp\u003eThe cat boy said, “For God’s sake, go pester someone else with your horrible questions, you ghoulish little mongrel.”\u003c/p\u003e\n\u003cp\u003eThere was another long, wordless shriek from the maimed porter, and Telemakos and the boy with the moustache both buried their faces again. Telemakos pressed his flaming cheeks against the fur of the beautiful mutilated cat.\u003c/p\u003e\n\u003cp\u003ePlague will raise the price of salt.\u003c/p\u003e\n\u003cp\u003eHe could not find the strength to lift his head. He sat trembling in the dust at the other boy’s feet, wishing desperately that he was alone in the highland savanna with his father and a herd of bushbuck, instead of waiting among these wretched people while Medraut tortured a hapless servant who was less guilty than Telemakos himself.\u003c/p\u003e\n\u003cp\u003e“Go on, go away,” snapped the cat boy. “This isn’t a circus.”\u003c/p\u003e\n\u003cp\u003eTelemakos gathered himself and stood up. He took a deep breath.\u003c/p\u003e\n\u003cp\u003e“All right,” he said. “I’m sorry about your friend.”\u003c/p\u003e\n\u003cp\u003e“He’s just a porter,” the boy repeated bitterly, and looked away.\u003c/p\u003e\n\u003cp\u003eAlone at last again with Medraut, much later, Telemakos walked in silence. Of course, Medraut never said anything anyway, but Telemakos often spoke to him, and sometimes for him, as he had done that morning. Now he could not bring himself to speak a single word, appalled to possess knowledge worth as much as his tongue, or his hands. After a time Telemakos remembered, with renewed horror: I told the bala heg I’d been listening with Anako’s porters. One of them might have said something about it to Anako. It might be my fault they noticed that boy. It might be my fault they—\u003c/p\u003e\n\u003cp\u003eHe shot badly. He hit a gazelle in the rump, and it took him five more arrows to kill it. He could feel Medraut wince with each failed attempt; it always bewildered Medraut that his son could be so inaccurate an archer. After the fifth botched shot, Medraut pulled back the arrow that was notched to his own bowstring. Telemakos spoke then for the first time since they had left the roadside well, snarling at his father, “I don’t need your help!”\u003c/p\u003e\n\u003cp\u003eIt was late evening when they arrived at Grandfather’s country estate, and Telemakos noticed that Medraut gave him much closer attention than he usually did: helped Telemakos with his bath, saw him to his room there, brought him supper of injera bread and wat made from the meat of the gazelle they had caught on their way. Medraut sat with Telemakos while he ate, sharing his food. Then before Medraut left Telemakos alone for the night, he took the boy’s head between his hands, and smoothed his son’s thick white hair back gently from his forehead. He peered into Telemakos’s face, his expression worried and sorrowful. Telemakos lowered his eyes respectfully to avoid meeting his father’s unreadable dark blue gaze, and Medraut took his hands away and nodded a wordless good night. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sunbird-the-lion-hunters-3/page-5.html","bookId":2671,"creation":"Oct 5, 2019 10:00:39 AM","modification":"Oct 5, 2019 10:00:39 AM"}
