{"id":106891,"no":141,"title":"Page 141","content":"\u003cp\u003eDasie had warned him. Even without Dasie, Olikea’s story of her mother’s snatching should have been enough to make him see the danger. He had not only permitted Kinrove to send this summoning against his own kin group, he had encouraged, no, demanded it. He looked around at the other feeders who were only now rising from the ground. Soldier’s Boy knew them by name. Four were gone: Eldi, Hurstan, Nofore, and Ebt. How many others had been stolen from our kin-clan? How many others mourned as Olikea mourned now? As he mourned now?\u003c/p\u003e\n\u003cp\u003eOlikea had collapsed against her bonds. She had used a long wrap to tie herself, something that she had snatched up as she left the lodge that morning. It was woven of very soft yarn, and she had pulled and strained against it until the knot had become a single solid ball of fiber. Soldier’s Boy could not get it undone any more than she could.\u003c/p\u003e\n\u003cp\u003e“Someone bring a knife!” he shouted over my shoulder, unreasonably angered that no one had already done so. He tried to care that the other feeders were probably as disoriented and perhaps devastated as we were. He couldn’t. Likari was gone and it was his own fault. “I’ll follow him. I’ll bring him back,” Soldier’s Boy promised her limp form. Olikea had sagged down as far as the ties permitted her to, and now was staring off into the distance, her face slack. “Olikea. Listen to me. I’ll go after him, I’ll bring him back. It will be all right. By tonight, he’ll be back at the hearth with us.”\u003c/p\u003e\n\u003cp\u003eSempayli came and with a bronze blade sawed through the stubborn fabric. Soldier’s Boy was glad to see this feeder remained to him. When the fabric parted, Olikea’s weight carried her down to sprawl on the ground. She didn’t move. “Carry her back into the lodge,” he commanded Sempayli, and the man scooped her up as if she weighed nothing. Soldier’s Boy followed them in and watched as Sempayli put her on my bed. “Sempayli, food and water,” he commanded his man tersely and then sat down beside Olikea’s still form.\u003c/p\u003e\n\u003cp\u003e“Olikea. Did you hear what I said?”\u003c/p\u003e\n\u003cp\u003eOnly her mouth moved. It was as if the rest of her face were dead. “You can’t bring him back. He went to the dance. He ran to it, he wanted to go. You can’t get him back. He’ll dance himself to death before the winter is out. Didn’t you see his face, didn’t you see the magic burning inside him like a torch? It will consume him from within. Likari. Likari.”\u003c/p\u003e\n\u003cp\u003eSoldier’s Boy said the stupid words, the same ones I would have said in his place. “But I didn’t think you even cared for him that much.”\u003c/p\u003e\n\u003cp\u003eShe suddenly became even more still. I thought for a moment that his words had killed her. Then her face hardened. She pushed against the bed, sitting up. “What good is it to love anything?” she asked me harshly. “It just goes away.”\u003c/p\u003e\n\u003cp\u003eHe stared at her. Soldier’s Boy was as thunderstruck as I was. Always, I had thought her cold toward her son. We had shared the knowledge that her fondness was only an attraction to the power of a Great Man. She’d seemed a heartless woman, one Soldier’s Boy could deal with only by being as detached as she was. Now she was revealed as broken; she had been broken for a long time. The brokenness was what had made her prickly and harsh.\u003c/p\u003e\n\u003cp\u003eSoldier’s Boy stood up and spoke sharply to his other feeders. “Bring me food to eat now. And warm clothes and sturdy boots. I’m going after Likari.”\u003c/p\u003e\n\u003cp\u003eNone of them moved. Their eyes shifted, each to another, but no one spoke or sprang to their tasks. “What is it?” Soldier’s Boy demanded sharply.\u003c/p\u003e\n\u003cp\u003eSempayli was stirring a pot over the fire. Even he did not turn at Soldier’s Boy’s command.\u003c/p\u003e\n\u003cp\u003e“They know it is useless. Just as I do. You say you are one of us, you have even marked yourself as one of us, but on these deep things you still think like a Jhernian. You still talk like a Jhernian.”\u003c/p\u003e\n\u003cp\u003eIt was the last thing Soldier’s Boy wanted to hear right now. I felt the rage rise in him that Olikea could insult him so. Then, with admirable control, he forced the rage down and in a controlled voice asked, “Then tell me clearly what it is that I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“He won’t want to come back.”\u003c/p\u003e\n\u003cp\u003e“I’ll talk to him.”\u003c/p\u003e\n\u003cp\u003e“He won’t hear you. You were there, when Dasie came to Kinrove’s encampment. Why do you think she came with warriors and cold iron? Don’t you understand that until she broke Kinrove’s dance, none of the dancers would have wanted to leave? Even after she had broken it and the dancers had come to their senses, even then some preferred to stay. Didn’t you feel the entrancement of the dance? If I had not shouted to you, if you had given in to it, you would still feel the dance running through you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-141.html","bookId":2015,"creation":"Oct 5, 2019 11:03:26 PM","modification":"Oct 5, 2019 11:03:26 PM"}
