{"id":107002,"no":255,"title":"Page 255","content":"\u003cp\u003e“Then they’ll stand by us if we go to Captain Thayer tonight and—”\u003c/p\u003e\n\u003cp\u003e“They won’t stand by us. They won’t confront Thayer. A man capable of hanging a woman and flogging himself is certainly capable of punishing any underling who questions his authority. No. But they’d certainly be greatly relieved if something happened so that the woman didn’t hang.”\u003c/p\u003e\n\u003cp\u003eEpiny smiled. “So, for example, if she vanished from her cell, no one would search for her very diligently.”\u003c/p\u003e\n\u003cp\u003e“Epiny.” Spink looked at her levelly. “It’s very complicated. Everyone knows how Amzil feels about her children. They know she wouldn’t leave town without them.”\u003c/p\u003e\n\u003cp\u003e“She might. For a short time, because she knows they are safe with us.”\u003c/p\u003e\n\u003cp\u003e“Epiny, we’d still have to get her out of the cell.”\u003c/p\u003e\n\u003cp\u003e“We have some explosives left from the last time!” Epiny exclaimed brightly.\u003c/p\u003e\n\u003cp\u003e“No. Blowing up the cell wall with black powder would most likely kill the occupant,” Spink pointed out. “Those cells are tightly built with thick stone walls, not wood. Any explosion we set off that was powerful enough to break the wall would definitely harm Amzil. Nevare was very fortunate that you and Amzil blew up the wrong prison wall the last time. No. No explosions.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s no good, then.” She thought for a moment. “What is the door made of? If we get rid of the guards, can we force it?”\u003c/p\u003e\n\u003cp\u003eI spoke up. “I doubt it. My door was of very thick wood, reinforced with metal strapping and a heavy lock.” I hesitated, then added, “It didn’t look as if the place where I broke out of my cell had been repaired very well. I might be able to break a hole in the wall with a pry bar and a sledge. But it wouldn’t be a quiet operation. And I might find myself back in my old cell, with the door still locked, and Amzil locked in another cell.”\u003c/p\u003e\n\u003cp\u003eBlithely ignoring this, Epiny was relentless. “Who would have the keys?”\u003c/p\u003e\n\u003cp\u003e“Captain Thayer, most likely.”\u003c/p\u003e\n\u003cp\u003e“Then we have to get them somehow. Spink, we’ll have to invent a reason for you to visit him tonight and—”\u003c/p\u003e\n\u003cp\u003e“Not a chance of that.” Spink sighed. “I went there before I came home, determined to make the man see some sort of reason. I couldn’t get past the sergeant on the desk. The man tried to be polite, but finally admitted that he’d been given a direct order not to admit me on any grounds.”\u003c/p\u003e\n\u003cp\u003e“Then I’ll go,” Epiny said decisively.\u003c/p\u003e\n\u003cp\u003e“That would be useless, and you know it,” Spink told her firmly. “His sergeant has had orders to refuse you admission for weeks.”\u003c/p\u003e\n\u003cp\u003e“I could raise enough of a fuss in that outer office that he’d have to come out.”\u003c/p\u003e\n\u003cp\u003e“No, my dear. I won’t risk you. The good god knows what Thayer would decide was a just punishment for a shrew in his office. Possibly the stocks.”\u003c/p\u003e\n\u003cp\u003eKara came to the door of the parlor. “Sir, your meal is on the table. I wouldn’t interrupt, but we wouldn’t want it to get cold, would we?”\u003c/p\u003e\n\u003cp\u003e“No, we wouldn’t,” Spink replied so meekly to her motherly tone that Epiny had to smile. Spink rose. “Come with me, both of you, and have a cup of tea. Our discussion might have to wait for a time, but—”\u003c/p\u003e\n\u003cp\u003e“I’ll go,” I said suddenly. They both looked at me, confused.\u003c/p\u003e\n\u003cp\u003e“What could be more natural? I’ve come all this way to see if I’d like a career with this regiment. If we can make me presentable, it would only be natural that I’d immediately call on the commanding officer. In fact, it’s only courteous. And unless he has completely lost touch with reality, he can’t politely turn me away.”\u003c/p\u003e\n\u003cp\u003e“And?” Spink asked.\u003c/p\u003e\n\u003cp\u003e“And once I’m inside, with the door shut, I’ll do whatever I must to get the keys. And after that, whatever I must to have her out of there.”\u003c/p\u003e\n\u003cp\u003eSpink looked aghast. Epiny replied only, “There, you see? Flee or hide. I told you that was what had to be decided immediately.”\u003c/p\u003e\n\u003cp\u003e“I am not stealing a horse,” Spink announced and then, as Epiny opened her mouth to speak, he said more loudly, “And neither are you. Or Nevare. Come, now. Let’s have a cup of tea together. And let us remember that the children are listening.”\u003c/p\u003e\n\u003cp\u003eAnd indeed, as we entered the dining room where Kara had laboriously set out Spink’s food, Kara observed severely, “Stealing is wrong.”\u003c/p\u003e\n\u003cp\u003eAll the adults exchanged glances, wondering how much else she had overheard, but as she did not seem overly distressed, we let the topic go. Epiny went to the kitchen with Kara, promising to return soon with a pot of hot tea and cups for the rest of us. \u003c/p\u003e","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-255.html","bookId":2015,"creation":"Oct 5, 2019 11:03:26 PM","modification":"Oct 5, 2019 11:03:26 PM"}
