{"id":106841,"no":86,"title":"Page 86","content":"\u003cp\u003eBut Soldier’s Boy stared at it with a mixture of resentment and hostility. When the bird’s gaze met his, I felt a shiver go through him. Something more than a carrion bird looked at him out of those eyes. “Go away,” Soldier’s Boy said in a low voice. “You have no call upon me. I owe you nothing.”\u003c/p\u003e\n\u003cp\u003eCan a bird smile? This one bobbed his head, reminding me of a man convulsed with laughter. He opened his beak wide. Perhaps he just tasted the air, but perhaps he mocked Soldier’s Boy. The bright red interior of his mouth flashed like a beacon.\u003c/p\u003e\n\u003cp\u003e“Nothing, Nevare? You owe me a death. Or a life. However you prefer to see it.” He lifted a clawed foot and swiped at his beak. “Which do you think is the better offering to a god you have offended? A death? Or a life?”\u003c/p\u003e\n\u003cp\u003eOrandula’s voice, deep and rich with an undercurrent of mockery, rang clear inside my head. I heard it. I knew that Soldier’s Boy heard it, too. This, at least, was a dread we shared. Fear drove his defiance more than courage.\u003c/p\u003e\n\u003cp\u003e“I don’t serve you. You are not my god. And I owe you nothing.”\u003c/p\u003e\n\u003cp\u003eThe bird hopped closer, just two hops, in that effortless way of moving that only birds can do. He cocked his head and regarded me closely. “An amusing concept, that. The idea that men can choose which gods have power over them. Do you think that if you choose not to believe in me, I have no power over you? Do you think you can choose to have debts or not to have them?”\u003c/p\u003e\n\u003cp\u003eSoldier’s Boy strode suddenly forward. He picked up one of Likari’s fish and held it out to the bird. “Here. This is dead, and it’s much bigger than the bird that was freed from your sacrifice. Take it and be gone.” He flung it disdainfully at the god-bird’s feet. The croaker bird fluffed his feathers and hopped back from the dead thing. Soldier’s Boy stood, his body stiff with fear and anger. The bird looked at the dead fish. Hop, hop. Turned his head to point an eye down at it. Then darted his beak down to rip a shred of it free.\u003c/p\u003e\n\u003cp\u003e“Fresh. But still good. I’ll take it. But you know, it does not discharge your debt. This is not a death or a life. It’s only a fish. And you have not yet answered my question.” He stabbed his beak down again, tore off another scrap of flesh and, with a quick jerk-toss of his head, caught it in his mouth and swallowed it. “Which would you rather owe me, little Great Man? A life or a death?”\u003c/p\u003e\n\u003cp\u003e“I owe you nothing!” Soldier’s Boy repeated angrily. “I took nothing from you.”\u003c/p\u003e\n\u003cp\u003e“You were there. The bird was released from me.”\u003c/p\u003e\n\u003cp\u003e“That wasn’t me!” Soldier’s Boy exploded. I do not think he was even aware of how Likari was regarding him. At the edge of Soldier’s Boy’s field of vision, the boy crouched in the door and regarded him with wide eyes as the Great Man continued his debate with a carrion bird. The boy stepped back inside the door, as if frightened.\u003c/p\u003e\n\u003cp\u003eThe bird didn’t even seem to be looking at Soldier’s Boy as he bent his head and busily tore another strip of flesh from the fish. He’d bared the gut sack. He plunged his beak in and probed busily before coming up with a dark string of gut. He snapped it up with relish. “Not you, eh? Then who, Great Man? Who freed the sacrifice?”\u003c/p\u003e\n\u003cp\u003e“Nevare did it! Nevare Burvelle.”\u003c/p\u003e\n\u003cp\u003eThe bird opened his beak, and squawked a wild laughter from his wide red mouth. His wings stuck out to the side and he bounced as he squawked. Perhaps, to someone else, it would have sounded only like a croaker bird croaking. When he finally finished, he stabbed and tore another piece of fish free. Then he looked at Soldier’s Boy with one bright eye and asked, “Aren’t you Nevare Burvelle?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eThe bird cocked his head the other way.\u003c/p\u003e\n\u003cp\u003e“Nevare. Speak up for yourself. Don’t you owe me a sacrifice, to replace the one you took?”\u003c/p\u003e\n\u003cp\u003eMiraculously and suddenly, the body and the voice were mine. Shock tingled all through my skin. I swallowed and drew a deep, freeing breath.\u003c/p\u003e\n\u003cp\u003e“Answer me, Nevare,” the bird-god commanded.\u003c/p\u003e\n\u003cp\u003e“I serve the good god. Not you. And I didn’t mean to have anything to do with you. All I did was free a bird,” I said. My heart soared. Despite the threat to me, I had the body again. I clenched and unclenched my hands, marveling that I could.\u003c/p\u003e\n\u003cp\u003e“Serve who you like,” the bird replied callously. “It does nothing about the debt you owe me. Do you really think that serving one god will protect you from the demands of another? Do you honestly believe that we derive our powers because you believe in us? What sort of an impotent god would that be? ‘Believe in me so I can be a god!’ Is that what gods should say to men? How about, ‘Believe it or not, I can control your world’?” He turned his head and looked at me out of the other eye. \u003c/p\u003e","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-86.html","bookId":2015,"creation":"Oct 5, 2019 11:03:26 PM","modification":"Oct 5, 2019 11:03:26 PM"}
