{"id":106846,"no":91,"title":"Page 91","content":"\u003cp\u003e“You will not really need them until the snow falls.” She dismissed his concern. “Well?” She turned her attention to me. “Get dressed so we can go to trade. Only beggars come to the trading fair ungarbed as if it were summer. A Great One should be wearing furs and necklaces. But at least you shall not look as if you are completely unrespected.”\u003c/p\u003e\n\u003cp\u003eSoldier’s Boy shook out the garment. It was made of wool or something very like it, with alternating stripes of blue, brown, and red. There was little shape to it; when he held it up, it looked like a large rectangle of fabric, with a hole for my head and two more for my arms. “Put it on, put it on!” Olikea urged me, and then impatiently helped pull it over my head. It was large and came all the way to my feet. It left my arms bare. I had not realized how chill the day was until my flesh was shielded from it. “The stripes make you look very fat,” Olikea said with great approval. “And see, it is loose. Plenty of room for you to grow big again. When it is tight on your belly, you will look magnificent. But for now it makes you look like a man of substance.”\u003c/p\u003e\n\u003cp\u003eLikari had vanished into her shelter again. He emerged with two wide-brimmed hats woven from bark strips and a fat pot of something greasy and dark red. It wasn’t food. As Soldier’s Boy watched, the lad dipped two fingers into the pot, scooping up some of the stuff and then busily smeared it down one of his arms. It went on thick and brownish-red, like a good coat of paint. “This will keep the sun from scorching me,” he said with relief.\u003c/p\u003e\n\u003cp\u003e“Do not forget to coat the tops of your feet,” Olikea warned us.\u003c/p\u003e\n\u003cp\u003eSoldier’s Boy was expecting to put on his own paint, but Olikea motioned impatiently for him to sit down. She stripped off her gloves, pushed back her lacy cuffs, and then applied the paint to me with a practiced hand. She did not merely smear it on as Likari had. She worked carefully and skillfully, swiftly marking swirls and stars into the thickly applied pigment. When she was finished, the decorative markings went from my shoulders to my wrist. “There,” she said, obviously pleased with her work. “Now you are fit to be seen. I have spoken of you, as you bade me. I said I would bring you soon to trade, so folk will be watching for you to come. A pity that you have nothing of worth to trade. You shall be little better than a beggar at the Place.”\u003c/p\u003e\n\u003cp\u003e“But he is rich!” Likari exclaimed. “He has brought the wealth of three kin-clans rolled up in the blanket. Beads and jewels and ornaments such as I have never seen!”\u003c/p\u003e\n\u003cp\u003e“What! Let me see!” Astonishment and avarice warred in her eyes.\u003c/p\u003e\n\u003cp\u003eHe had not planned to unveil his wealth until he was at the Trading Place. Soldier’s Boy had thought that a sudden show of it would stun my beholders. As he slowly unrolled the blanket to display row after row of dazzling treasure, Olikea nearly fainted with ecstasy. “Where did you get it?” she demanded to know.\u003c/p\u003e\n\u003cp\u003e“From my mentor. Lisana taught me in the other place. She made me her heir. This is her wealth, rightfully come to me.”\u003c/p\u003e\n\u003cp\u003e“Lisana’s hoard!” Olikea exclaimed. “I’d heard tales of it. Some said that she never had it, others that she found a way to take it into death with her. Most believe it was stolen from her lodge by an honorless one, and that the thief took it to her death with her when she drowned trying to cross a river to escape the bad luck such treasure brings.”\u003c/p\u003e\n\u003cp\u003e“I told you it was bad luck!” Likari shrilled excitedly.\u003c/p\u003e\n\u003cp\u003e“Not if it is truly his. Oh, this, this piece is beyond value. You must not trade this; you will never get the likes of it again. And this, no, this is not for trade. I will wear this, and all will envy that I am your feeder. And these, oh, such ivory! These you must wear yourself.”\u003c/p\u003e\n\u003cp\u003eSoldier’s Boy felt a sudden pang of something. Jealousy from Lisana’s shade? Anger that Olikea would flaunt what Lisana could no longer wear? He held my face slack against it, pondering, and did not resist as Olikea lifted his hand, and slid heavy bangles of gold, ivory, silver, and inscribed horn over my wrist. The weight felt peculiar to me: no Gernian man would have adorned himself this way.\u003c/p\u003e\n\u003cp\u003eShe was not finished. She exclaimed in dismay that so many of the necklaces had come unstrung. “We shall not even show these things. People will try to trade for them a bead, two beads at a time, giving up nothing but trinkets in return. No, these we will save for another time, when they will fetch what they are truly worth. This winter, I will restring them for you.”\u003c/p\u003e\n\u003cp\u003eWhen she came to the fertility figurine, she gave a gasp. She touched the ivory baby with one fingertip, as if expecting it to stir to sudden life. After a long moment, she took a deep shuddering breath. “This is the stuff of legend. With this, I think, we will make you a Great One to stand among the greatest of Great Ones.” Her voice shook and her face had paled around her markings. She took the scarf she had been wearing around her neck and carefully wrapped the baby in it as if it were a bunting and set it aside. She looked up at Soldier’s Boy, gave him a smile like the sun rising, and then went back to her sorting.\u003c/p\u003e","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-91.html","bookId":2015,"creation":"Oct 5, 2019 11:03:26 PM","modification":"Oct 5, 2019 11:03:26 PM"}
