{"id":20165,"no":28,"title":"CHAPTER XXVIII. A STRUGGLE AGAINST ODDS.","content":"\u0026nbsp;The position in which Clif found himself was so startlingly unexpected and so full of peril that for a brief instant it almost unnerved him. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Had he suspected the possibility of the boat being manned by Spaniards, he would have given up the thought as soon as he recognized it as one belonging to the flagship. It seemed natural that a boat should be sent to look for them after their protracted absence, and it was a decided shock to find that he had fallen, alone and unarmed, in the way of his enemies.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But his surprise affected him but for an instant. He did not propose to be shot down if he could help it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The report of the pistol that met Clif\u0027s gaze rang out upon the air, but the bullet did not reach its intended mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Like a flash Clif had released his hold upon the boat, and dropped beneath the water, just in the nick of time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Spaniard peered over the side of the boat in the darkness, expecting to see Clif\u0027s form appear on the surface, and hoping to see his life\u0027s blood staining the waters, a testimony to his marksmanship.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How could he have failed to send that bullet crashing through the American\u0027s brain? thought he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But nothing of the sort happened. Clif not only was not wounded, but was chipper as a lark. When he disappeared, he dove under the boat and rose again on the opposite side. The Spaniard would look in vain in that spot for his intended victim.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the Spaniard in the bow discovered Clif\u0027s head as it appeared for an instant above the water. With an imprecation of wrath he called his companion\u0027s attention to the spot. But one of them was armed, it seemed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The other rushed to that side, but when he looked in the direction indicated, revolver in hand, Clif had again disappeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The American lad was as lively as a cricket, and busy thoughts surged through his brain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the first place, he did not propose being a target for a Spanish bullet. But, above all, he wanted that boat, and, like the cowboy when he wants a revolver, wanted it \"bad.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How can I get it?\" he thought, as his dive brought him up near the bow of the boat. Help came from an unexpected source, for a few moments after, he was driven by a new peril to attempt the only plan that could accomplish it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The agency that led to his delivery was a shark. That was not the every-day business of his shark-ship—that of saving an imperiled life for those inhabitating those waters are especially hungry and voracious.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But it happened this way: As Clif was quietly keeping himself afloat at the bow of the boat, confident that in that position he ran little risk of immediate discovery by his enemies, the plans and schemes revolving in his mind were brought to a sudden standstill by a sight that filled him with horror. A sharp triangular fin cutting the water like a knife, flashed past him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Merciful Heaven!\" he muttered under his breath. \"A shark!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Death faced him on every side. To be sure he might frighten the shark by churning the surface of the water, but that very act would betray him to a no less certain death at the hands of his enemies.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His resolve, a desperate one that caused him to shudder as he formed it, was reached on the instant. The broad back of his enemy, who sat in the stern, was within easy reach, and inspired his action.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Quick as a flash Clif grasped the stern of the boat with one hand and with one mighty effort raised himself high out of the water. Before the Spaniard could divine what was happening, Clif\u0027s free arm was thrown around the fellow\u0027s neck, and he was drawn back into the water behind him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n An instant after Clif clambered over the stern into the boat. With a shudder at the thought of the fate that awaited the luckless Spaniard, he addressed himself to the work that lay before him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And there was plenty of it, and lively, too, while it lasted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The other Spaniard, who had been peering into the water ahead, turned sharply around when he heard the noise made by the splash of his companion, and in the act involuntarily dropped the revolver.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What must have been his feelings upon beholding the lithe and dripping form of the plucky young American emerging from the sea, may well be imagined.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Clif did not pause to study the effects. He seized an oar and sprang toward his remaining foe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Surrender, you villain!\" he cried in Spanish as he advanced.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Spaniard seized an oar and with an oath sprang toward the American.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And there, on the quiet bosom of the water in the dim light of night, ensued a stubbornly contested duel, in which oars took the place of broadsword and sabre.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clif fought savagely and desperately. His blood was up, and he knew that now, if ever, he was, fighting for his life.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But in the end it was fortune that favored him. A chance blow upon his antagonist\u0027s head rendered the latter unconscious, and victory again perched upon the young American\u0027s banner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no time for exultation, even if he had felt that way. The work had been too serious, and necessity for action was too imperative.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Satisfied that he had nothing to fear from his enemy, now lying helpless in the bottom of the Boat, Clif seized the oars and turned the boat toward shore.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was trying work for one man to row that boat even the short distance that lay between him and shore—especially after the ordeal through which he had passed. But excitement buoyed him up and he made good progress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His companions in the shade of the bushes where he had left them had witnessed his exciting duel and were wrought up to tense excitement. How they bemoaned the fact that they were not there to help him!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It became evident that there were other spectators, too; for no sooner had Clif seized the oars and began to row for the shore than a volley of bullets rattled out across the water from the hill that had witnessed such thrilling scenes earlier in the night. The Spanish soldiers had discovered Clif!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the face of this, Clif redoubled his efforts to reach the beach and rescue his companions, who might any moment be attacked by the soldiers in their rear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the enemy\u0027s attention was concentrated upon Clif and his boat, and he shot through the waters in a perfect hail of missiles. They spattered into the waters all around him, but wide of their mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He reached the shore, and as he sprang upon the ground his faithful little band could not repress a cheer at his bravery and pluck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But he urged them on. Not a moment could now be lost. The enemy, shut off temporarily by the overhanging hill, might be down upon them any second.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clif gathered up his clothing and at a word they all sprang to their places and the boat leaped through the water with a bound, and was away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To the flagship!\" Clif cried, and then uttered an exclamation of alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The dispatches!\" he cried, as he felt among his clothes. \"They have been left behind!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At a word the boat was turned round and shot swiftly toward the beach.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yelling Spaniards could be heard racing down the hillside. They had discovered the landing-place, and bullets began again to rain about the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed sure death to return in the face of that fire, but the intrepid crew sped on. The dispatches must not fall into Spanish hands!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boat grated on the sands, and Clif sprang out. One instant brought him to the spot where his clothes had lain. Fortune favored him. As he felt along the ground, his hand touched a package of papers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The dispatches!\" he cried, as he sprang to his place in the stern of the boat, which had been turned ready for the start. He gave the word and away they sped, this time with the flagship as the goal. Spanish bullets flew after them, but they were safe. It was only when they were for a moment brought out into bold relief by the searchlight that again began to play from the flagship that the bullets of the enemy came near their mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And then the firing ceased and the boat sped on. An enthusiastic and jubilant crew it was. Only Clif seemed in a dissatisfied mood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gorry!\" he suddenly exclaimed, \"I came off without that shell after all!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You seem to lay great store by that, sir,\" said one of the men.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do,\" said Clif. \"But will not return for it just now. To the flagship!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not many minutes later they were safe aboard, the captured Spaniard in proper custody, and, best of all, the dispatches were personally delivered by Clif to the rear admiral.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But still Clif was not entirely satisfied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3248/89024.html","bookId":606,"creation":"Aug 2, 2019 11:32:18 AM","modification":"Aug 2, 2019 11:32:18 AM"}
