{"id":20169,"no":32,"title":"CHAPTER XXXI. CAPTURED.","content":"\u0026nbsp;Clif had elected to imperil his own existence rather than allow one of the enemy\u0027s boats to pass that blockade without warning to the American ships. But he had no intention of lying idly by in the path of the hostile craft. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He waited but a moment after the glare of the last rocket had died out in the air, and then bent to the oars, and urged the boat toward the open sea beyond.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And then he had every confidence that he had little to fear from the enemy\u0027s boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027ll have all they can do to look out for their own safety now,\" he thought, \"without paying any attention to me. The New York has seen the signal, and will not be slow in making out the cause. Then look out, Mr. Spaniard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But there was more taking place upon those waters than Clif was cognizant of, and peril came from an unlooked-for source.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His decision to send up the warning signal had been quickly formed after his first discovery of the strange vessel. He had seen at a glance that it was not a warship, but a merchant steamer. It was moving slowly, and apparently seeking, as much as possible, the concealment afforded by the shadow of the coast. Every feature about it showed that it was trying to quietly steal out past the blockading vessels.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clif had not delayed, but on the impulse of the moment had sent up the signal rockets while he was yet between the ship and the shore. But a few steady strokes would carry him beyond the enemy and toward the flagship, he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But to his surprise he noticed, on glancing over his shoulder as he drew nearer the vessel, that the latter was moving slower than before and in fact had just stopped.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was puzzling to him, for now, if at any time, the boat should be showing its utmost speed. Those on board must surely know from the signals that they had been discovered and that pursuit would instantly follow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A few words will explain the situation to the reader. The vessel was, as Clif suspected, endeavoring to steal out past the American ships, which were known to be in the vicinity. But a short time before Clif had left the shore for the second time, the blockade runner had slowed down, and a boat, manned by half a dozen sailors, had been sent ashore. An officer in the Spanish army, with important dispatches, was to be taken aboard at a point not far from where Clif had landed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The work of the Spanish boat\u0027s crew had been expeditiously performed, and when Clif sent up his signal, they were returning to the ship. Unnoticed by Clif in his excitement at the time, they were close to one side of his boat at that fateful moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A pistol shot suddenly ringing out in the air and a bullet flying not far from his head apprised the cadet of danger from that quarter. The Spaniards, as was natural for them to be, were aroused to a high pitch of excitement against the youth whose vigilance promised to set all their plans at naught.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With a hoarse yell of rage they tugged at the oars and their boat fairly leaped through the water after the intrepid young cadet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clif saw the movement, and redoubled his efforts at the oars. It was a race for his life—one against seven!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With frantic energy he tugged at the oars, and his boat shot forward with encouraging speed. At that moment the searchlight on the flagship sent its rays across the waters in answer to the signal, and a dazzling stream of light played upon the scene.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It brought in clear relief the form of the waiting steamer, and the two boats racing so desperately near at hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What a thrilling scene it must have been to the officers on the bridge of the flagship as with glass in hand they watched the exciting race. But it was not given to them long to note the cadet\u0027s desperate struggle for freedom, or to marvel at his great endurance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The race was a short one, and the result a foregone conclusion. There was no hope of Clif\u0027s escaping from the pursuing boat, with its crew of fresh and eager oarsmen. The latter closed in upon him with a leap and a bound, and soon were within oar\u0027s length of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He recognized the uselessness of trying to escape from them, but was determined not to surrender without a struggle even in the face of great numbers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He dropped his oars and sprang to his feet, facing his enemies. He drew his revolver, but before he could use it one of the Spanish sailors, who had risen in the boat, knocked it from his grasp with his oar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boats were now side by side, almost touching, and the dark hulk of the steamer was not many feet away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n From the latter arose aloud cheer as they saw that Clif had been disarmed, and above the noise Clif could hear a few words of command from the Spanish army officer who sat in the stern of the boat at his side. It was to the sailor who had sprung up to attack Clif.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t shoot!\" he said. \"Take him alive!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clif had seized an oar when his revolver fell with a splash into the water, and there was no doubt that he intended using it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But two can play at that game, and the Spanish sailor, forbidden to shoot, attacked Clif furiously with the oar, which he still held in his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clif dodged, but as he did so another sailor aimed a blow at his head. The aim was good.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A sharp pain shot through the young cadet\u0027s head, he reeled and all became dark before him. With a faint moan he fell senseless into the bottom of his boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The contest had been short, and well it was for the Spaniards that such was the case. Already the flickering of the searchlight told that the flagship was hurrying to the scene.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Spaniards realized the importance of quick action. They had, on the impulse of the moment, retaliated upon Clif because it could take but a few minutes and because they felt that the chase would end not far from their waiting vessel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They congratulated themselves that it had, indeed, brought them almost to the ship\u0027s side, and now they lost no time in getting themselves and their prisoner aboard. Willing hands assisted from above.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A couple of strokes of the oars had brought them to the ship\u0027s side, with Clif\u0027s boat in tow. In obedience to a command, Clif\u0027s boat with its unconscious burden was raised bodily to the deck. The captain thought he could use it in his business.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A moment later the Spaniards with the army officer reached the deck, and the ship\u0027s captain signaled to go ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All now was excitement on board the Spaniard. Beyond securely fastening the arms and legs of their unconscious captive where he lay, they paid but little attention to Clif. They were all too wrapped up in thoughts of escape from the cruiser whose piercing searchlight was streaming upon them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Among the crew there was, here and there, a murmur against the delay that had been caused by stopping to take on the army officer, and with this was coupled a note of resentment against the young cadet whose appearance on the scene promised to spoil all their plans.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the captain\u0027s orders were carried out promptly, the more so as their own safety depended upon it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were not without hope of making good their escape in the end, for they knew what speed their craft was capable of. It was a fast boat, and the throbbing of the engines told that she was being urged to her full speed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Amid intense excitement of crew and officers, the wild dash for freedom and safety had begun.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Through all this confusion and flurry the cadet whose prompt signaling had occasioned it lay helpless and unconscious. The steady thump of the machinery below, which was steadily carrying him further and further from his friends, made no impression upon his ears, nor was his mind aroused by the excitement of the chase or the hope of rescue.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the race had not been long under way before he began to show signs of returning consciousness. He stirred uneasily in the bottom of the boat where he lay, attempting to move his pinioned limbs; then a long-drawn breath, and he opened his eyes slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The noise from shipboard fell upon his ears, and the sounds confused him. His surroundings puzzled him and his mind at first could not grasp the situation. Where was he?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then with a rush of recollection came the remembrance of the attack upon him in the open boat. His enemies had triumphed, he thought, and left him a helpless victim to drift about upon the open sea. But whence those sounds?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He painfully raised himself to a sitting posture and looked out. To his astonishment, he found himself and boat upon the deck of a swiftly moving steamer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he saw it all, and realized what had happened. He caught a glimpse of the rays of the searchlight that still streamed across the water, and a moment after heard the boom of a cannon out at sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The New York!\" he exclaimed. \"She is in pursuit! But she\u0027s too far away, and can never catch this fast boat. The only chance of her stopping it is with one of her big guns.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And then, involuntarily, he shuddered as he thought that, bound and helpless, he would share the fate of the Spanish crew if a shot from the flagship should penetrate the ship\u0027s side and send it to the bottom!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He moved a little toward the stern of his boat, as best he could, to get a better view of the light that showed the approaching flagship. As he did so he struck a round, hard object that lay behind him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The unexploded shell!\" he exclaimed, as he recognized what it was. \"I still have that with me, at any rate!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And then he began to tug at the ropes that bound his arms in a frantic effort to loosen them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The rapid throb of the engines below and another boom of cannon from out to sea told that the chase was becoming a hot one.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3248/89028.html","bookId":606,"creation":"Aug 2, 2019 11:32:18 AM","modification":"Aug 2, 2019 11:32:18 AM"}
