{"id":66926,"no":9,"title":"Page 9","content":"\u003cp\u003eDAY 7: MUKENKO\u003c/p\u003e\n\u003cp\u003eJune 19, 1979\u003c/p\u003e\n\u003cp\u003e1. Kiboko\u003c/p\u003e\n\u003cp\u003eMUNRO\u0027S INTENTION IN CONTINUING THROUGH the night was two-fold. First, he hoped to make up precious time, for. all the computer projections assumed that they would stop each night. But it took no effort to ride the river in the moonlight; most of the party could sleep, and they would advance themselves another fifty or sixty miles by dawn.\u003c/p\u003e\n\u003cp\u003eBut more important, he hoped to avoid the Ragora hippos, which could easily destroy their flimsy rubber boats. During the day, the hippos were found in pools beside the riverbanks, and the bulls would certainly attack any passing boat. At night, when the animals went ashore to forage, the expedition could slip down the river and avoid a confrontation entirely.\u003c/p\u003e\n\u003cp\u003eIt was a clever plan, but it ran into trouble for an unexpected reason - their progress on the Ragora was too rapid. It was only nine o\u0027clock at night when they reached the first hippo areas, too early for the animals to be eating. The hippos would attack the boats - but they would attack in the dark.\u003c/p\u003e\n\u003cp\u003eThe river twisted and turned in a series of curves. At each curve there was a still pool, which Kahega pointed out as the kind of quiet water that hippos liked to inhabit. And he pointed to the grass on the banks, cut short as if the banks had been mown.\u003c/p\u003e\n\u003cp\u003e\"Soon now,\" Kahega said.\u003c/p\u003e\n\u003cp\u003eThey heard a low grunting, \"Raw-huh-huh-huh.\" It sounded like an old man trying to clear his throat of phlegm. Munro tensed in the lead boat. They drifted around another curve, carried smoothly in the flow of current. The two boats were now about ten yards apart. Munro held his loaded shotgun ready.\u003c/p\u003e\n\u003cp\u003eThe sound came again, this time in a chorus: \"Haw-huh?-huh-huh.\"\u003c/p\u003e\n\u003cp\u003eKahega plunged his paddle into the water. It struck bottom quickly. He pulled it out; only three feet of it was wet. \"Not deep,\" he said, shaking his head.\u003c/p\u003e\n\u003cp\u003e\"Is that bad?\" Ross said.\u003c/p\u003e\n\u003cp\u003e\"Yes, I think it is bad.\"\u003c/p\u003e\n\u003cp\u003eThey came around the next bend, and Elliot saw a half-dozen partially submerged black rocks near the shore, gleaming in the moonlight. Then one of the \"rocks\" crashed upward and he saw an enormous creature lift entirely out of the shallow water so that he could see the four stubby legs, and the hippo churned forward toward Munro\u0027s boat.\u003c/p\u003e\n\u003cp\u003eMunro fired a low magnesium flare as the animal charged; in the harsh white light Elliot saw a gigantic mouth, four huge glistening blunted teeth, the head lifted upward as the animal roared. And then the hippo was engulfed in a cloud of pale yellow gas. The gas drifted back, and stung their eyes.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s using tear gas,\" Ross said.\u003c/p\u003e\n\u003cp\u003eMunro\u0027s boat had already moved on. With a roar of pain the male hippo had plunged down into the water and disappeared from sight. In the second boat, they blinked back tears and watched for him as they approached the pool. Overhead, the magnesium flare sizzled and descended, lengthening sharp shadows, glaring off the water.\u003c/p\u003e\n\u003cp\u003e\"Perhaps he\u0027s given up,\" Elliot said. They could not see the hippo anywhere. They drifted in silence.\u003c/p\u003e\n\u003cp\u003eAnd suddenly the front of the boat bucked up, and the hippo roared and Ross screamed. Kahega toppled backward, discharging his gun into the air. The boat slapped down with a wrenching crash and a spray of water over the sides, and Elliot scrambled to his feet to check Amy and found himself staring into a huge pink cavernous mouth and hot breath. The mouth came down with a lateral slash on the side of the rubber boat, and the air began to hiss and sizzle in the water.\u003c/p\u003e\n\u003cp\u003eThe mouth opened again, and the hippo grunted, but by then Kahega had got to his feet and flied a stinging cloud of gas. The hippo backed off and splashed down, rocking the boat and propelling them onward, down the river. The whole right side of the boat was collapsing swiftly as the air leaked out of the huge cuts in the rubber. Elliot tried to pull them shut with his hands; the hissing continued unabated. They would sink within a minute.\u003c/p\u003e\n\u003cp\u003eBehind them, the bull hippo charged, racing down the shallow river like a powerboat, churning water in a wake from both sides of his body, bellowing in anger.\u003c/p\u003e\n\u003cp\u003e\"Hold on, bold on!\" Kahega shouted, and fired again. The hippo disappeared behind a cloud of gas, and the boat drifted around another curve. When the gas cleared the animal was gone. The magnesium flare sputtered into the water and they were plunged into darkness again. Elliot grabbed Amy as the boat sank, and they found themselves standing knee-deep in the muddy water.\u003c/p\u003e\n\u003cp\u003eThey managed to beach the Zodiac on the dark riverbank. In the lead boat, Munro paddled over, surveyed the damage, and announced that they would inflate another boat and go on. He called for a rest, and they all lay in the moonlight on the river\u0027s edge swatting mosquitoes away.\u003c/p\u003e\n\u003cp\u003eTheir reverie was interrupted by the screaming whine of ground-to-air rockets, blossoming explosions in the sky overhead. With each explosion, the riverbank glowed bright red, casting long shadows, then fading black once more.\u003c/p\u003e\n\u003cp\u003e\"Muguru\u0027s men firing from the ground,\" Munro said, reaching for his field glasses.\u003c/p\u003e\n\u003cp\u003e\"What\u0027re they shooting at?\" Elliot said, staring up into the sky.\u003c/p\u003e\n\u003cp\u003e\"Beats me,\" Munro said.\u003c/p\u003e\n\u003cp\u003eAmy touched Munro\u0027s arm, and signed, Bird come. But they heard no sound of an aircraft, only the bursting of rockets in the sky.\u003c/p\u003e\n\u003cp\u003eMunro said, \"You think she hears something?\"\u003c/p\u003e\n\u003cp\u003e\"Her hearing is very acute.\"\u003c/p\u003e\n\u003cp\u003eAnd then they heard the drone of a distant aircraft, approaching from the south. As it came into view, they saw it twist, maneuvering among the brilliant yellow-red explosions that burst in the moonlight and glinted off the metal body of the aircraft.\u003c/p\u003e\n\u003cp\u003e\"Those poor bastards are trying to make time,\" Munro said, scanning the plane through field glasses. \"That\u0027s a C-130 transport with Japanese markings on the tail. Supply plane for the consortium base camp - if it makes it through.\"\u003c/p\u003e\n\u003cp\u003eAs they watched, the transport twisted left and right, running a zigzag course through the bursting fireballs of exploding missiles.\u003c/p\u003e\n\u003cp\u003e\"Breaking a snake\u0027s back,\" Munro said. \"The crew must be terrified; they didn\u0027t buy into this.\"\u003c/p\u003e\n\u003cp\u003eElliot felt a sudden sympathy for the crew; he imagined them staring out the windows as the fireballs exploded with brilliant light, illuminating the interior of the plane. Were they chattering in Japanese? Wishing they had never come?\u003c/p\u003e\n\u003cp\u003eA moment later, the aircraft droned onward to the north, out of sight, a final missile with a red-hot tail chasing after it, but it was gone over the jungle trees, and he listened to the distant explosion of the missile.\u003c/p\u003e\n\u003cp\u003e\"Probably got through,\" Munro said, standing. \"We\u0027d\u003c/p\u003e\n\u003cp\u003ebetter move on.\" And he shouted in Swahili for Kahega to put the men on the river once more.\u003c/p\u003e\n\u003cp\u003e2.Mukenko\u003c/p\u003e\n\u003cp\u003eELLIOT SHIVERED, ZIPPED HIS PARKA TIGHTER, AND waited for the hailstorm to stop. They were huddled beneath a stand of evergreen trees above 8,000 feet on the alpine slopes of Mount Mukenko. It was ten o\u0027clock in the morning, and the air temperature was 38 degrees. Five hours before, they had left the river behind and begun their pre-dawn climb in 100-degree steaming jungle.\u003c/p\u003e\n\u003cp\u003eAlongside him, Amy watched the golf ball-sized white pellets bounce on the grass and slap the branches of the tree over their heads. She had never seen hail before.\u003c/p\u003e\n\u003cp\u003eShe signed, What name?\u003c/p\u003e\n\u003cp\u003e\"Hail,\" he told her.\u003c/p\u003e\n\u003cp\u003ePeter make stop.\u003c/p\u003e\n\u003cp\u003e\"I wish I could, Amy.\"\u003c/p\u003e\n\u003cp\u003eShe watched the hail for a moment, then signed, Amy want go home.\u003c/p\u003e\n\u003cp\u003eShe had begun talking about going home the night before. Although the Thoralen had worn off, she remained depressed and withdrawn. Elliot had offered her some food to cheer her up. She signed that she wanted milk. When he told her they -had none (which she knew. perfectly well), she signed that she wanted a banana. Kahega had produced a bunch of small, slightly sour jungle bananas. Amy had eaten them without objection on previous days. but she now threw them into the water contemptuously, signing she wanted \"real bananas.\"\u003c/p\u003e\n\u003cp\u003eWhen Elliot told her that they had no real bananas, she signed, Amy want go home.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t go home now, Amy.\"\u003c/p\u003e\n\u003cp\u003eAmy good gorilla Peter take Amy home.\u003c/p\u003e\n\u003cp\u003eShe had only known him as the person in charge, the final arbiter of her daily life in the experimental setting of Project Amy. He could think of no way to make clear to her that he was no longer in charge, and \u0027that he was not punishing her by keeping her here.\u003c/p\u003e\n\u003cp\u003eIn fact, they were all discouraged. Each of the expedition members had looked forward to escaping the oppressive heat of the rain forest, but now that they were climbing Mukenko, their enthusiasm had quickly faded. \"Christ,\" Ross said. \"From hippos to hail.\"\u003c/p\u003e\n\u003cp\u003eAs if on cue, the hail stopped. \"All right,\" Munro said, \"let\u0027s get moving.\"\u003c/p\u003e\n\u003cp\u003eMukenko had never been climbed until 1933. In 1908, a German party under von Ranke ran into storms and had to descend; a Belgian team in 1913 reached 10,000 feet but could not find a route to the summit; and another German team was forced to quit in 1919 when two team members fell and died, about 12,000 feet. Nevertheless Mukenko was classified as a fairly easy (non-technical) climb by most mountaineers, who generally devoted a day to the ascent; after 1943, a new route up the southeast was found which was frustratingly slow but not dangerous, and it was this mute that most climbers followed.\u003c/p\u003e\n\u003cp\u003eAbove 9,000 feet, the pine forest disappeared and they crossed weak grassy fields cloaked in chilly mist; the air was thinner, and they called frequently for a rest. Munro had no patience with the complaints of his charges. \"What did you expect?\" he demanded. \"It\u0027s a mountain. Mountains are high.\" He was especially merciless with Ross, who seemed the most easily fatigued. \"What about your timetable?\" he would ask her. \"We\u0027re not even to the difficult part. It\u0027s not even interesting until eleven thousand feet. You quit now and we\u0027ll never make it to the summit before nightfall, and that means we lose a full day.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care,\" Ross said finally, dropping to the ground, gasping for breath.\u003c/p\u003e\n\u003cp\u003e\"Just like a woman,\" Munro said scornfully, and smiled when Ross glared at him. Munro humiliated them, chided them, encouraged them - and somehow kept them moving.\u003c/p\u003e\n\u003cp\u003eAbove 10,000 feet, the grass disappeared and there was only mossy ground cover; they came upon the solitary peculiar fat-leafed lobelia trees, emerging suddenly from the cold gray mist. There was no real cover between 10,000 feet and the summit, which was why Munro pushed them; he did not want to get caught in a storm on the barren upper slopes.\u003c/p\u003e\n\u003cp\u003eThe sun broke out at 11,000 feet, and they stopped to position the second of the directional lasers for the ERTS laser-fix system. Ross had already set the first laser several miles to the south that morning, and it had taken thirty minutes.\u003c/p\u003e\n\u003cp\u003eThe second laser was more critical, since it had to be matched to the first. Despite the electronic jamming, the transmitting equipment had to be connected with Houston, in order that the little laser - it was the size of a pencil eraser, mounted on a tiny steel tripod - could be accurately aimed. The two lasers on the volcano were positioned so that their beams crossed many miles away, above the jungle. And if Ross\u0027s calculations were correct, that intersection point was directly over the city of Zinj.\u003c/p\u003e\n\u003cp\u003eElliot wondered if they were inadvertently assisting the consortium, but Ross said no. \"Only at night,\" she said, \"when they aren\u0027t moving. During the day, they won\u0027t be able to lock on our beacons - that\u0027s the beauty of the system.\"\u003c/p\u003e\n\u003cp\u003eSoon they smelled sulfurous volcanic fumes drifting down from the summit, now 1,500 feet above them. Up here there was no. vegetation at all, only bare hard rock and scattered patches of snow tinged yellow from the sulfur. The sky was clear dark blue, and they had spectacular views of the south Virunga range - the great cone of Nyiragongo, rising steeply from the deep green of the Congo forests, and, beyond that, Mukenko, shrouded in fog.\u003c/p\u003e\n\u003cp\u003eThe last thousand feet were the most difficult, particularly for Amy, who had to pick her way barefoot among the sharp lava rocks. Above 12,000 feet, the ground was loose volcanic scree. They reached the summit at five in the afternoon, and gazed over the eight-mile-wide lava lake and smoking crater of the volcano. Elliot was disappointed in the landscape of black rock and gray steam clouds. \"Wait until night,\" Munro said.\u003c/p\u003e\n\u003cp\u003eThat night the lava glowed in a network of hot red through the broken dark crust; hissing red steam slowly lost its color as it rose into the sky. On the crater rim, their little tents reflected the red glow of the lava. lb the west scattered clouds were silver in the moonlight, and beneath them the Congo Jungle stretched away for miles. They could see the straight green laser beams, intersecting over the black forest. With any luck they would reach that intersection tomorrow.\u003c/p\u003e\n\u003cp\u003eRoss connected her transmitting equipment to make the nightly report to Houston. After the regular six-minute delay, the signal linked directly through to Houston, without interstitial encoding or other evasive techniques.\u003c/p\u003e\n\u003cp\u003e\"Hell,\" Munro said.\u003c/p\u003e\n\u003cp\u003e\"But what does it mean?\" Elliot asked.\u003c/p\u003e\n\u003cp\u003e\"It means,\" Munro said gloomily. \"the consortium has stopped jamming us.\"\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t that good?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Ross said. \"It\u0027s bad. They must already be on the site, and they\u0027ve found the diamonds.\" She shook her head, and adjusted the video screen:\u003c/p\u003e\n\u003cp\u003eHUSTN CONFRMS CONSRTUM ONSITE ZINJ PROBABILITY 1.000. TAK NO FURTHR RSKS. SITUTN HOPELSS.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe it,\" Ross said. \"It\u0027s all over.\"\u003c/p\u003e\n\u003cp\u003eElliot sighed. \"My feet hurt,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m tired,\" Munro said.\u003c/p\u003e\n\u003cp\u003e\"The hell with it,\" Ross said.\u003c/p\u003e\n\u003cp\u003eUtterly exhausted, they all went to bed. \u003c/p\u003e","sourceLink":"https://allnovel.net/congo/page-9.html","bookId":1712,"creation":"Oct 5, 2019 10:02:52 AM","modification":"Oct 5, 2019 10:02:52 AM"}
