{"id":108629,"no":15,"title":"Page 15","content":"\u003cp\u003eAs soon as he left Elena at her house, Stefan went to the woods.\u003c/p\u003e\n\u003cp\u003eHe took Old Creek Road, driving under the sullen clouds-through which no patch of sky could be seen, to the place where he had parked on the first day of school.\u003c/p\u003e\n\u003cp\u003eLeaving the car, he tried to retrace his steps exactly to the clearing where he had seen the crow. His hunter\u0027s instincts helped him, recalling the shape of this bush and that knotted root, until he stood in the open place ringed with ancient oak trees.\u003c/p\u003e\n\u003cp\u003eHere. Under this blanket of dingy-brown leaves, some of the rabbit\u0027s bones might even remain. Taking a long breath to still himself, to gather his Powers, he cast out a probing, demanding thought.\u003c/p\u003e\n\u003cp\u003eAnd for the first time since he\u0027d come to Fell\u0027s Church, he felt the flicker of a reply. But it seemed faint and wavering, and he could not locate it in space.\u003c/p\u003e\n\u003cp\u003eHe sighed and turned around-and stopped dead.\u003c/p\u003e\n\u003cp\u003eDamon stood before him, arms crossed over his chest, lounging against the largest oak tree. He looked as if he might have been there for hours.\u003c/p\u003e\n\u003cp\u003e\"So,\" said Stefan heavily, \"it is true. It\u0027s been a long time, brother.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Not as long as you think, brother .\" Stefan remembered that voice, that velvety, ironical voice. \"I\u0027ve kept track of you over the years,\" Damon said calmly. He flicked a bit of bark from the sleeve of his leather jacket as casually as he had once arranged his brocade cuffs. \"But then, you wouldn\u0027t know that, would you? Ah, no, your Powers are as weak as ever.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Be careful, Damon,\" Stefan said softly, dangerously. \"Be very careful tonight. I\u0027m not in a tolerant mood.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"St. Stefan in a pique? Imagine. You\u0027re distressed, I suppose, because of my little excursions into your territory. I only did it because I wanted to be close to you. Brothers should be close.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Youkilled tonight. And you tried to make me think I\u0027d done it.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Are you quite sure you didn\u0027t? Perhaps we did it together. Careful!\" he said as Stefan stepped toward him. \"My mood is not the most tolerant tonight, either. I only had a wizened little history teacher; you had a pretty girl.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe fury inside Stefan coalesced, seeming to focus in one bright burning spot, like a sun inside him. \"Keep away from Elena,\" he whispered with such menace that Damon actually tilted his head back slightly. \"Keep away from her, Damon. I know you\u0027ve been spying on her, watching her. But no more. Go near her again and you\u0027ll regret it.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"You always were selfish. Your one fault. Not willing to share anything, are you?\" Suddenly, Damon\u0027s lips curved in a singularly beautiful smile. \"But fortunately the lovely Elena is more generous. Didn\u0027t she tell you about our little liaisons? Why, the first time we met she almost gave herself to me on the spot.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a lie!\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Oh, no, dear brother. I never lie about anything important. Or do I mean unimportant? Anyway, your beauteous damsel nearly swooned into my arms. I think she likes men in black.\" As Stefan stared at him, trying to control his breathing, Damon added, almost gently, \"You\u0027re wrong about her, you know. You think she\u0027s sweet and docile, like Katherine. She isn\u0027t. She\u0027s not your type at all, my saintly brother. She has a spirit and a fire in her that you wouldn\u0027t know what to do with.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"And you would, I suppose.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eDamon uncrossed his arms and slowly smiled again. \"Oh, yes.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eStefan wanted to leap for him, to smash that beautiful, arrogant smile, to tear Damon\u0027s throat out. He said, in a barely controlled voice, \"You\u0027re right about one thing. She\u0027s strong. Strong enough to fight you off. And now that she knows what you really are, she will. All she feels for you now is disgust.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eDamon\u0027s eyebrows lifted. \"Does she, now? We\u0027ll see about that. Perhaps she\u0027ll find that real darkness is more to her taste than feeble twilight. I, at least, can admit the truth about my nature. But I worry about you, little brother. You\u0027re looking weak and ill-fed. She\u0027s a tease, is she?\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eKill him, something in Stefan\u0027s mind demanded. Kill him, snap his neck, rip his throat to bloody shreds. But he knew Damon had fed very well tonight. His brother\u0027s dark aura was swollen, pulsing, almost shining with the life essence he had taken.\u003c/p\u003e\n\u003cp\u003e\"Yes, I drank deeply,\" Damon said pleasantly, as if he knew what was in Stefan\u0027s mind. He sighed and ran his tongue over his lips in satisfied remembrance. \"He was small, but there was a surprising amount of juice in him. Not pretty like Elena, and he certainly didn\u0027t smell as good. But it\u0027s always exhilarating to feel the new blood singing inside you.\" Damon breathed expansively, stepping away from the tree and looking around. Stefan remembered those graceful movements, too, each gesture controlled and precise. The centuries had only refined Damon\u0027s natural poise.\u003c/p\u003e\n\u003cp\u003e\"It makes me feel like doing this,\" said Damon, moving to a sapling a few yards away. It was half again as tall as he was, and when he grasped it his fingers did not meet around the trunk. But Stefan saw the quick breath and the ripple of muscles under Damon\u0027s thin black shirt, and then the tree tore loose from the ground, its roots dangling. Stefan could smell the pungent dampness of disturbed earth.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t like it there anyway,\" said Damon, and heaved it as far away as the still-entangled roots would allow. Then he smiled engagingly. \"It also makes me feel like doingthis .\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThere was a shimmer of motion, and then Damon was gone. Stefan looked around but could see no sign of him.\u003c/p\u003e\n\u003cp\u003e\"Up here, brother.\" The voice came from overhead, and when Stefan looked up he saw Damon perching among the spreading branches of the oak tree. There was a rustle of tawny brown leaves, and he disappeared again.\u003c/p\u003e\n\u003cp\u003e\"Back here, brother.\" Stefan spun at the tap on his shoulder, only to see nothing behind him. \"Right here, brother.\" He spun again. \"No, try here.\" Furious, Stefan whipped the other way, trying to catch hold of Damon. But his fingers grasped only air.\u003c/p\u003e\n\u003cp\u003eHere, Stefan . This time the voice was in his mind, and the Power of it shook him to the core. It took enormous strength to project thoughts that clearly. Slowly, he turned around once more, to see Damon back in his original position, leaning against the big oak tree.\u003c/p\u003e\n\u003cp\u003eBut this time the humor in those dark eyes had faded. They were black and fathomless, and Damon\u0027s lips were set in a straight line.\u003c/p\u003e\n\u003cp\u003eWhat more proof do you need, Stefan? I\u0027m as much stronger than you as you are stronger than these pitiful humans. I\u0027m faster than you, too, and I have other Powers you\u0027ve scarcely heard of. The Old Powers, Stefan. And I\u0027m not afraid to use them. If you fight me, I\u0027ll use them against you.\u003c/p\u003e\n\u003cp\u003e\"Is that what you came here for? To torture me?\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI\u0027ve been merciful with you, brother. Many times you\u0027ve been mine for the killing, but I\u0027ve always spared your life. But this time is different. Damon stepped away from the tree again and spoke aloud. \"I am warning you, Stefan, don\u0027t oppose me. It doesn\u0027t matter what I came here for. What I want now is Elena. And if you try to stop me from taking her, I will kill you.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"You can try,\" said Stefan. The hot pinpoint of fury inside him burned brighter than ever, pouring forth its brilliance like a whole galaxy of stars. He knew, somehow, that it threatened Damon\u0027s darkness.\u003c/p\u003e\n\u003cp\u003e\"You think I can\u0027t do it? You never learn, do you, little brother?\" Stefan had just enough time to note Damon\u0027s weary shake of the head when there was another blur of motion and he felt strong hands seize him. He was fighting instantly, violently, trying with all his strength to throw them off. But they were like hands of steel.\u003c/p\u003e\n\u003cp\u003eHe lashed out savagely, trying to strike at the vulnerable area under Damon\u0027s jaw. It did no good; his arms were pinioned behind him, his body immobilized. He was as helpless as a bird under the claws of a lean and expert cat.\u003c/p\u003e\n\u003cp\u003eHe went limp for an instant, making himself a deadweight, and then he suddenly surged with all his muscles, trying to break free, trying to get a blow in. The cruel hands only tightened on him, making his struggles useless. Pathetic.\u003c/p\u003e\n\u003cp\u003eYou always were stubborn. Perhaps this will convince you . Stefan looked into his brother\u0027s face, pale as the frosted-glass windows at the boarding house, and at those black bottomless eyes. Then he felt fingers grasp his hair, jerk his head back, exposing his throat.\u003c/p\u003e\n\u003cp\u003eHis struggles redoubled, became frantic. Don\u0027t bother , came the voice in his head, and then he felt the sharp rending pain of teeth. He felt the humiliation and helplessness of the hunter\u0027s victim, of the hunted, of the prey. And then the pain of blood being drawn out against his will.\u003c/p\u003e\n\u003cp\u003eHe refused to give in to it, and the pain grew worse, a feeling as if his soul was tearing loose like the sapling. It stabbed through him like spears of fire, concentrating on the punctures in his flesh where Damon\u0027s teeth had sunk in. Agony flamed up his jaw and cheek and down his chest and shoulder. He felt a wave of vertigo and realized he was losing consciousness.\u003c/p\u003e\n\u003cp\u003eThen, abruptly, the hands released him and he fell to the ground, onto a bed of damp and moldering oak leaves. Gasping for breath, he painfully got to his hands and knees.\u003c/p\u003e\n\u003cp\u003e\"You see, little brother, I\u0027m stronger than you. Strong enough to take you, take your blood and your life if I wish it. Leave Elena to me, or I will.\"\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eStefan looked up. Damon was standing with head thrown back, legs slightly apart, like a conqueror putting his foot on the neck of the conquered. Those night-black eyes were hot with triumph, and Stefan\u0027s blood was on his lips.\u003c/p\u003e\n\u003cp\u003eHatred filled Stefan, such hatred as he had never known before. It was as if all his earlier hatred of Damon had been a drop of water to this crashing, foaming ocean. Many times in the last long centuries he had regretted what he had done to his brother, when he\u0027d wished with all his soul to change it. Now he only wanted to do it again.\u003c/p\u003e\n\u003cp\u003e\"Elena is not yours,\" he ground out, getting to his feet, trying not to show what an effort it cost him. \"And she never will be.\" Concentrating on each step, putting one foot in front of the other, he began walking away. His entire body hurt, and the shame he felt was even greater than the physical ache. There were bits of wet leaves and crumbs of earth adhering to his clothes, but he did not brush them off. He fought to keep moving, to hold out against the weakness that lapped at his limbs.\u003c/p\u003e\n\u003cp\u003eYou never learn, brother.\u003c/p\u003e\n\u003cp\u003eStefan did not look back or try to reply. He gritted his teeth and kept his legs moving. Another step. And another step. And another step.\u003c/p\u003e\n\u003cp\u003eIf he could just sit down for a moment, rest...\u003c/p\u003e\n\u003cp\u003eAnother step, and another step. The car couldn\u0027t be far now. Leaves crackled under his feet, and then he heard leaves crackle behind him.\u003c/p\u003e\n\u003cp\u003eHe tried to turn quickly, but his reflexes were almost gone. And the sharp motion was too much for him. Darkness filled him, filled his body and his mind, and he was falling. He fell forever into the black of absolute night. And then, mercifully, he knew no more. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vampire-diaries-the-awakening-the-vampire-diaries-1/page-15.html","bookId":2031,"creation":"Oct 5, 2019 11:23:54 PM","modification":"Oct 5, 2019 11:23:54 PM"}
