{"id":84128,"no":16,"title":"Page 16","content":"\u003cp\u003eKate approves. “Your hair looks great, Erin.”\u003c/p\u003e\n\u003cp\u003eShe fingers her tresses. “Thanks. I had it done yesterday. I’m pulling out all the stops—this is my weekend to meet Mr. Right. New York men are hopelessly defective. I think Nevada will offer more suitable options.”\u003c/p\u003e\n\u003cp\u003eErin dates a lot, but as far as I know, she’s never been in a serious relationship. Las Vegas isn’t exactly the smartest place to find a stellar boyfriend, however. Might as well try your luck at AA or Gamblers Anonymous.\u003c/p\u003e\n\u003cp\u003eSex-addict meetings are always a safe bet.\u003c/p\u003e\n\u003cp\u003eSteven wanders over. “Take my advice, Erin—stay single. Life is less complicated that way.”\u003c/p\u003e\n\u003cp\u003eAlexandra flinches. Even though he’s one of my oldest, dearest friends, I have the urge to reach into his mouth and rip out his tongue. That’s not wrong, is it?\u003c/p\u003e\n\u003cp\u003eI let it go. For now.\u003c/p\u003e\n\u003cp\u003eMatthew offers sagely, “Keep your head up, Erin—it’ll happen. When the time is right, when you least expect it.”\u003c/p\u003e\n\u003cp\u003e“Yeah—I’m staying optimistic. You have to kiss a lot of frogs before you find a prince.”\u003c/p\u003e\n\u003cp\u003eAlexandra responds, “They’re all frogs, Erin. Just try and find one with the least amount of warts.”\u003c/p\u003e\n\u003cp\u003eI elbow Jack. “If we’re talking about the genital variety, you should talk to O’Shay. You’re kind of the in-house expert on those, right man?”\u003c/p\u003e\n\u003cp\u003eHe flips me the bird.\u003c/p\u003e\n\u003cp\u003eThen the last member of our traveling circus arrives. Care to hazard a guess?\u003c/p\u003e\n\u003cp\u003e“Yo, party people in the house! Who’s ready to rock?!”\u003c/p\u003e\n\u003cp\u003eYep—it’s the douche bag. For Kate’s sake, I try not to hate him as much as I used to—but some things just can’t be helped. It’s like when you have the tail end of a cold and one loogie hangs on to back of your throat. You cough, you hawk, but no matter what you do, you just can’t f**king get rid of it.\u003c/p\u003e\n\u003cp\u003eThat’s Billy Warren. My personal, annoying ball of phlegm.\u003c/p\u003e\n\u003cp\u003eKate and Dee-Dee squeal and hug the dumbass.\u003c/p\u003e\n\u003cp\u003eHe hugs them back. “I’ve missed you guys.”\u003c/p\u003e\n\u003cp\u003eKate says, “But you didn’t have to fly all the way out here. You could have just met us in Vegas.”\u003c/p\u003e\n\u003cp\u003e“And miss the preparty? No way.”\u003c/p\u003e\n\u003cp\u003eI was hoping his plane would get hijacked by bloodthirsty terrorists. The kind that like to cut off body parts and FedEx them back to the family, one by one. Oh, well. There’s always the return flight. It’s important to stay positive about these things.\u003c/p\u003e\n\u003cp\u003eHis attention turns toward me. His eyes look me up and down stiffly. “Evans.”\u003c/p\u003e\n\u003cp\u003eI raise my chin. “Warren.”\u003c/p\u003e\n\u003cp\u003eHe turns around and zeroes in on James. Warren scoops him up and exclaims, “What are you feeding this kid, Kate? He’s so much bigger than the last time I saw him.”\u003c/p\u003e\n\u003cp\u003eYeah. Shocking. ’Cause babies don’t usually grow or anything.\u003c/p\u003e\n\u003cp\u003eMoron.\u003c/p\u003e\n\u003cp\u003e“I brought you presents, tadpole. A shiny, noisy set of drums. You’re gonna freak when you see it.”\u003c/p\u003e\n\u003cp\u003eJames giggles. To the casual observer, it might seem that my son is actually fond of the f**kface. But I know better. Animals can sense when a person’s a few cards shy of a full deck. When they’re on the lower end of the bell curve. Kids can do that too. James doesn’t like Warren—he pities him. Because he knows that, even at two years old, he’s smarter than Jackass can ever hope to be.\u003c/p\u003e\n\u003cp\u003eAs the small talk builds to a crescendo, Kate and I look over the seating chart one more time. I put my arm around her just because she’s mine. Her eyes are soft and her voice is velvet as she sighs, “Seven more days. About this time next week, I’ll be putting my dress on.”\u003c/p\u003e\n\u003cp\u003eIt’s the one thing that’s been kept confidential. Strictly off-limits. “Can’t I have a hint? Will there be cle**age? Is it satin? Lace?” I wiggle my eyebrows. “Latex?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head.\u003c/p\u003e\n\u003cp\u003e“Just tell me you didn’t pick some old-fashioned, frilly getup that makes you look like a yeti.”\u003c/p\u003e\n\u003cp\u003eShe chuckles. “I’ll never tell. But . . . feel free to try and torture the information out of me. By any means necessary.”\u003c/p\u003e\n\u003cp\u003eSeveral ideas come to mind. Each with the potential of earning me a front-row seat in hell. Possibly a jail cell. “God, I love the way you think.”\u003c/p\u003e\n\u003cp\u003eMy sister’s voice drags me from my sinful musings. “Oh—I’ve been meaning to tell you two—we have a problem with table forty-five. A guest hasn’t responded yet.”\u003c/p\u003e\n\u003cp\u003eShe picks up her trusty clipboard. “He’s . . . Brandon Mitchell . . . Delores’s stepbrother. He may or may not be bringing a plus one.”\u003c/p\u003e\n\u003cp\u003eDelores’s mother got married last summer to some cop from their hometown. It figures that only a man professionally trained in firearms and self-defense would be brave enough to tie the knot with Amelia Warren.\u003c/p\u003e\n\u003cp\u003eI turn on Delores. “Again with your f**king family. What is it with you people? You’re like King Midas in reverse—everything you touch turns to shit.”\u003c/p\u003e\n\u003cp\u003eShe argues, “Brandon is not my family.”\u003c/p\u003e\n\u003cp\u003eFor once my sister and I are on the same page. She waves her finger in Dee-Dee’s face. “Oh, yes, he is. His father married your mother—that makes him yours. If we have to claim Great-Aunt Clara, you have to own up to this Mitchell clown.”\u003c/p\u003e\n\u003cp\u003eGreat-Aunt Clara is my grandmother’s stepsister, on my mother’s side. She’s like a thousand years old. The kind of relative we only wheel out of the nursing home once or twice a year for big events. Clara loves to dance, and even for an ancient she can move pretty well.\u003c/p\u003e\n\u003cp\u003eThe things is—since she was born a century ago, when women couldn’t vote or show ankle skin—Clara’s a big fan of women’s liberation. So she refuses to wear a bra.\u003c/p\u003e\n\u003cp\u003eEver.\u003c/p\u003e\n\u003cp\u003eAnd her br**sts are massively huge. Heavy—like dry-cement-stuffed balloons. They should be classified as deadly weapons.\u003c/p\u003e\n\u003cp\u003eAt James’s christening? Clara was getting down on the dance floor to the latest Rihanna song. She lifts her arms, spins around . . . and nails my best client’s teenage son in the head with her left tit.\u003c/p\u003e\n\u003cp\u003eThe kid was out cold for ten minutes. Thankfully, his parents chose not to sue.\u003c/p\u003e\n\u003cp\u003eKate steps between us, hands up, into the line of fire. “Okay, everyone, let’s just all take a step back. Dee, call your mom and have her lean on Brandon.”\u003c/p\u003e\n\u003cp\u003eDelores does as she’s told. But I go on, “Yeah—lean on him hard. Or he’ll be eating dinner in the parking lot with the valets.”\u003c/p\u003e\n\u003cp\u003eKate’s hand snakes around my back, tracing soothing lines under my T-shirt. “Relax, Drew. It’s not that big a deal.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tied-tangled-4/page-16.html","bookId":1810,"creation":"Oct 5, 2019 4:57:39 PM","modification":"Oct 5, 2019 4:57:39 PM"}
