{"id":84129,"no":17,"title":"Page 17","content":"\u003cp\u003eHer touch is soft—skin on skin. It feels like a double dose of Valium: instantly calming. My voice holds considerably less heat as I tell her, “This day is going to be goddamn magical. No way I’m letting an honorary Warren mess with it—even if it’s just the seating arrangement.”\u003c/p\u003e\n\u003cp\u003eShe turns into me, and her arms climb up around my neck. “Are you going to show up at the church?”\u003c/p\u003e\n\u003cp\u003eI tilt my head back so I can look in her eyes. “Wild lions couldn’t keep me away.”\u003c/p\u003e\n\u003cp\u003e“And . . . at some point . . . will we become husband and wife?”\u003c/p\u003e\n\u003cp\u003e“That’s the plan.”\u003c/p\u003e\n\u003cp\u003eShe reaches up on her toes and brushes her lips with mine. Once. Twice. “Then it’ll be perfect.”\u003c/p\u003e\n\u003cp\u003eDee-Dee closes her cell and announces, “My mother says Brandon’s coming, but he’s not bringing a date.”\u003c/p\u003e\n\u003cp\u003eAlexandra amends her list and removes the question-mark chair from the model. Then she beams. “There. Crisis averted. I just need to adjust the number of favors and we’re good to go.”\u003c/p\u003e\n\u003cp\u003eDee’s eyes go wide. “Oh, I almost forgot!” She rummages around in her shiny metallic shoulder bag, then raises her arms in victory. “Party favors!”\u003c/p\u003e\n\u003cp\u003eFisted in Delores’s hands are a dozen lollipops. Each about ten inches long.\u003c/p\u003e\n\u003cp\u003eIn the shape of a dick.\u003c/p\u003e\n\u003cp\u003eShe hands a few to my mother. “Here you go, Anne. Just because you’re not partaking in the festivities doesn’t mean you can’t enjoy a treat.” Then she adds with a wink, “Vanilla and chocolate. Yum.”\u003c/p\u003e\n\u003cp\u003eMy mother turns the confection around with a mischievous smile and playful glint in her eyes. Then she puts it on the counter. “Thank you, Dee-Dee. I’ll save these for after dinner.”\u003c/p\u003e\n\u003cp\u003eMy father grins. Broadly.\u003c/p\u003e\n\u003cp\u003eGreat. Now I’m stuck with the image of my sweet, saintly mother sucking down a cock-pop while my old man watches. There’s an excellent chance I’ll never get a boner again.\u003c/p\u003e\n\u003cp\u003eFucking Delores.\u003c/p\u003e\n\u003cp\u003eOkay, the boner thing is an exaggeration, but still—do you see why I can’t stand her? Her and her whole demon family tree. My best friend couldn’t marry a normal girl, could he? No—he had to fall for the Bride of Chucky incarnate.\u003c/p\u003e\n\u003cp\u003eThe phone rings. It’s the doorman letting us know the limo’s here. Everyone files out the door as my parents spread around the hugs and well-wishing.\u003c/p\u003e\n\u003cp\u003eI snatch James back from Warren for a final farewell.\u003c/p\u003e\n\u003cp\u003eWe’re lucky—James is not one of those clingy, whiny little bastards who lose their mind when Mommy walks out the door. Even so—good-byes are never fun.\u003c/p\u003e\n\u003cp\u003eKate kisses his cheek and pushes his hair back from his eyes. “We love you, baby. We’ll be home soon.”\u003c/p\u003e\n\u003cp\u003eI kiss his head. Then I ask the stupidest question ever. “Are you gonna be good for Grandma and Pop?”\u003c/p\u003e\n\u003cp\u003eHe looks at me sideways. And grins. “No.”\u003c/p\u003e\n\u003cp\u003eI shrug toward Kate. “Well, at least he’s honest.”\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eI’m not a big fan of air travel. For several reasons. First, there’s the pilot. You can never be sure he knows what the hell he’s doing. Maybe he got his license from a Cracker Jack box. Maybe his daddy made a generous donation to his flight school.\u003c/p\u003e\n\u003cp\u003eIf I want to put my life in jeopardy? I’ll ask my sister if she’s gained weight.\u003c/p\u003e\n\u003cp\u003eThen there’s the charade of it. No matter how many people those security agents feel up, no matter how many bags those former McDonald’s employees search? If somebody really wants to do some damage? Eventually, he will. The airlines should be up-front about it. Like those SWIM AT YOUR OWN RISK signs at the beach. When the desk agent hands you the boarding pass, he or she should say, “Hold on, pray your ass doesn’t get blown up, have a nice flight.”\u003c/p\u003e\n\u003cp\u003eWould that really be so bad?\u003c/p\u003e\n\u003cp\u003eFinally, there’s the doom-and-gloom certainty that if something—even accidentally—does go wrong? You’re toast. I know what the statistics say—that you’re more likely to get into a car accident, blah, blah¸ blah. But here’s the thing—lots of people who’ve had auto collisions have walked away without a scratch. Now tell me how many people you know who’ve gotten out of a plane wreck unscathed?\u003c/p\u003e\n\u003cp\u003eExactly.\u003c/p\u003e\n\u003cp\u003eStill—I don’t let those worries interfere with my life. They don’t get in the way. At all. Because fear doesn’t make a coward—actions do. I’m a lot of things, but a chickenshit isn’t one of them. And I have to admit, even though it’s not my favorite thing to do, there used to be benefits to flying.\u003c/p\u003e\n\u003cp\u003eMeaning the veritable smorgasbord of available women that can be found in airports and planes. There’s the oh-so-lonely housewife, the overworked businesswoman, the carefree graduate student looking to let loose . . . the flight attendant.\u003c/p\u003e\n\u003cp\u003eIn recent years, quality control on that last one has gone majorly downhill. Once upon a time, sex appeal was in the job description. That’s no longer the case. But I find the airlines tend to schedule at least one screwable female on every flight. Back in my free-man days, they were the easiest pickings. Always so eager to be of service.\u003c/p\u003e\n\u003cp\u003eOne time, on a business trip to Singapore, three stunning flight attendants were ready, willing, and able to show me the all sights worth seeing—inside their hotel room. We had quite the layover. That’s what I call some friendly skies.\u003c/p\u003e\n\u003cp\u003eSpeaking of which, one’s headed our way now. She’s attractive—slim, tall, long dark hair pulled back at the sides, and deep blue eyes with an exotic slant. Her hands are manicured—delicate—the perfect size for a decent jerking-off.\u003c/p\u003e\n\u003cp\u003eYes—guys notice things like that.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, sir, you’ll have to keep your seat belt buckled until the captain turns the sign off.”\u003c/p\u003e\n\u003cp\u003eI look down at the belt in question, then back up. “Right. ’Cause if we nose-dive from twenty thousand feet, this little piece of fabric is gonna stand between me and certain death?”\u003c/p\u003e\n\u003cp\u003eLike I said—hypocrites.\u003c/p\u003e\n\u003cp\u003eShe laughs. And the yellow seat-belt sign goes out with a ding.\u003c/p\u003e\n\u003cp\u003eI grin. “Guess he heard me.”\u003c/p\u003e\n\u003cp\u003eFull, pink lips smile. “Guess so.”\u003c/p\u003e\n\u003cp\u003eBlue eyes glance around the first-class cabin. “A little birdie told me you’re all headed to Vegas for a prewedding party—and you’re the groom.”\u003c/p\u003e\n\u003cp\u003e“That I am.”\u003c/p\u003e\n\u003cp\u003eShe hands me a mimosa. “Congratulations.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eShe hands Kate a glass as well, then her attention reverts back to me. “So . . . where are you staying?” \u003c/p\u003e","sourceLink":"https://allnovel.net/tied-tangled-4/page-17.html","bookId":1810,"creation":"Oct 5, 2019 4:57:39 PM","modification":"Oct 5, 2019 4:57:39 PM"}
