{"id":84138,"no":26,"title":"Page 26","content":"\u003cp\u003eMatthew’s head rolls back with a groan. “Dude—you’re still hung up on that? Let it go, man.”\u003c/p\u003e\n\u003cp\u003e“Did you not hear the same song I did?”\u003c/p\u003e\n\u003cp\u003eHis voice rises with exasperation. “So f**king what? It was a song. Kate is marrying you—you have a son together.” He cups his hands around his mouth like a megaphone. “Get over it.”\u003c/p\u003e\n\u003cp\u003eI rub the back of my neck. “I am. I am over it. But . . . when I see him . . . when I see them together—it drives me nuts.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because I still think he has feelings for Kate.”\u003c/p\u003e\n\u003cp\u003e“Again—why?”\u003c/p\u003e\n\u003cp\u003eI grind my teeth. And clench my hands. When I open my mouth, the God’s honest truth comes tumbling out. “Because I would never let her go, Matthew. Ever. No matter what happened—no matter what I did, I’d keep hoping, trying, until she came back to me.”\u003c/p\u003e\n\u003cp\u003eMatthew nods compassionately. “And that is why you are marrying Kate, and Warren is not. Because he was able to let her go. It wasn’t the forever kind of relationship, it was the for-right-now kind. And he did get over her. It’s the same way for Kate. So stop torturing yourself—and the rest of us—and just f**king enjoy it. You won. She’s yours.”\u003c/p\u003e\n\u003cp\u003eI think about his words for a moment. And then I shrug. “Either way, no harm, no foul. I get peace of mind, Warren gets his pickup skills upgraded, and Kate will be pleasantly surprised that I’m not jumping at the chance to put him in a shallow grave. Everybody wins, right?”\u003c/p\u003e\n\u003cp\u003eMatthew nods thoughtfully and finishes his drink.\u003c/p\u003e\n\u003cp\u003eOver the speaker system, the lifeguard calls our team number, and we get ready to nail the game.\u003c/p\u003e\n\u003cp\u003eChapter 8\u003c/p\u003e\n\u003cp\u003eBy the time we head back to the villa—as the returning water-volleyball champions we are—afternoon has slipped into dusk. It’s my favorite time of day. The sun is setting and the air smells like summer—a mix of earth and chlorine and freshly cut grass. I swipe my card through the security gate surrounding the house and walk toward the front door.\u003c/p\u003e\n\u003cp\u003eSomething in the window catches Jack’s eye, and he freezes. “What the hell . . .”\u003c/p\u003e\n\u003cp\u003eI follow his gaze through the window. I see the girls in the library, sitting in a circular formation on chairs dragged in from the dining room. They’re wearing long, pink, satiny robes and open-back, fuzzy, black heels. In the center of the circle stands a tall, fiftyish blonde in full black-leather dominatrix attire. She’s sort of hot—in an aging-hooker, been-around-the-block, her-pussy-is-probably-as-wide-as-the-Lincoln-Tunnel kind of way.\u003c/p\u003e\n\u003cp\u003eI whisper excitedly, “Goddess party.”\u003c/p\u003e\n\u003cp\u003eSee? Dreams really do come true.\u003c/p\u003e\n\u003cp\u003eMatthew fist-pumps. “Yes!”\u003c/p\u003e\n\u003cp\u003eLike SEAL Team Six, we stealthily invade the villa single-file. Once inside, we line up—totem-pole style—in front of the library’s mahogany double doors. Without making a sound, I crack the door—just a little. Just enough to watch and listen. In one hand, dominatrix lady holds a mini, purple vibrator—in the other, a matching remote control.\u003c/p\u003e\n\u003cp\u003e“We call this the Master. You insert the vibrator into your panties, and your gentleman takes possession of the controller. It’s noiseless and discreet, but powerful. With the remote, he can alternate speed and pressure at his discretion. . . .”\u003c/p\u003e\n\u003cp\u003eMatthew whispers, “I have got to get me one of those.”\u003c/p\u003e\n\u003cp\u003eI murmur, “I’m gonna get five.” I envision our weekly staff meetings in the conference room taking on a whole new meaning.\u003c/p\u003e\n\u003cp\u003eDominatrix lady goes on, “And now, ladies, let’s continue our oral instruction. Your bananas, please.”\u003c/p\u003e\n\u003cp\u003eInstantly and without shame, each of the girls picks up the large banana that has been resting on her lap. And puts it in her mouth.\u003c/p\u003e\n\u003cp\u003eHoly Mary, mother of God.\u003c/p\u003e\n\u003cp\u003e“Remember to relax your jaw . . . breathe on the outtake. Watch your teeth . . .”\u003c/p\u003e\n\u003cp\u003eMy eyes are glued to Kate as the banana slides smoothly in and out from between her perfect pink lips. I’m so turned on, I could hammer nails into a two-by-four with my cock. I mean, I’ve been where that banana is going many times before, but something about watching Kate give head from this point of view is crazy erotic. It’s like . . . live- p**n\u0026nbsp; dinner theater.\u003c/p\u003e\n\u003cp\u003e“Use your other hand, ladies. The testes are the neglected stepchild of the male genitalia. Knead them, massage them, caress them—they need your love too.”\u003c/p\u003e\n\u003cp\u003eYes. Yes, they do.\u003c/p\u003e\n\u003cp\u003eIn a hushed voice, Jack puts into words what all of us are thinking. “Anyone else about to jizz in their swim trunks? This is . . . this is like every fantasy I’ve ever had all rolled into one.”\u003c/p\u003e\n\u003cp\u003eI can’t help but agree. “Me too—except the part about my sister being there. And Delores.”\u003c/p\u003e\n\u003cp\u003eMatthew is insulted. “Hey, my wife is magnificent.”\u003c/p\u003e\n\u003cp\u003eYou wanna know what else is magnificent? A black panther, streaking across a valley, going in for the kill. Doesn’t mean I want to mount one.\u003c/p\u003e\n\u003cp\u003eI tear my eyes away from the fruit-blowing fest and look down at Matthew. “Your wife’s a psychopath. I wouldn’t f**k her with your dick. She’d probably pull some kind of booby-trap shit and shove razor blades up her twat to try and slice my c**k off.”\u003c/p\u003e\n\u003cp\u003eWas that too crude?\u003c/p\u003e\n\u003cp\u003e“That’s a f**ked-up thing to say.”\u003c/p\u003e\n\u003cp\u003ePick a conspiracy, any conspiracy—the JFK assassination, Area 51 . . .\u003c/p\u003e\n\u003cp\u003e“The truth usually is.”\u003c/p\u003e\n\u003cp\u003eThe guy code restricts how much you can mock a friend’s significant other. There’s an imaginary line. And if Matthew’s reaction is any indication? I just crossed it.\u003c/p\u003e\n\u003cp\u003eHe lands an angry punch to my right leg. In the spot above my knee—the charley-horse region—that makes pain echo up and down my femur.\u003c/p\u003e\n\u003cp\u003e“Ow! God damn it!”\u003c/p\u003e\n\u003cp\u003eI shift my weight to my other leg to keep from falling over, but I step on Warren’s hand and set off a not-so-quiet domino effect.\u003c/p\u003e\n\u003cp\u003e“Hey! Those are my fingers, ass**le!”\u003c/p\u003e\n\u003cp\u003e“Dude, stop pushing!”\u003c/p\u003e\n\u003cp\u003e“Shut the hell up, I can’t hear!”\u003c/p\u003e\n\u003cp\u003e“You’re ruining it!”\u003c/p\u003e\n\u003cp\u003e“Stop f**king punching me!”\u003c/p\u003e\n\u003cp\u003eYou know what’s going to happen next, don’t you? Yep—the doors open. And the five of us tumble into the room in a heap—like a pileup after a fumble.\u003c/p\u003e\n\u003cp\u003eOf course.\u003c/p\u003e\n\u003cp\u003eThere’s a collective gasp at our intrusion—the kind of sound a sunbather would make after getting doused with a bucket of ice water. Meanwhile, the man-pile does its best to untangle.\u003c/p\u003e\n\u003cp\u003e“Ompf . . .” \u003c/p\u003e","sourceLink":"https://allnovel.net/tied-tangled-4/page-26.html","bookId":1810,"creation":"Oct 5, 2019 4:57:39 PM","modification":"Oct 5, 2019 4:57:39 PM"}
