{"id":84153,"no":41,"title":"Page 41","content":"\u003cp\u003eWith her back to me, she rips off the cap and throws it to the crowd, revealing a cascade of shiny, brown hair. She takes a few more spins on the pole, then turns toward me and stalks forward.\u003c/p\u003e\n\u003cp\u003eFor a moment, I’d swear on my kid that it was Kate. The face and body dimensions are that similar.\u003c/p\u003e\n\u003cp\u003eUpon closer inspection, I notice the differences, however. Besides the fact that Kate Brooks would never be up on a stage shaking her tits and ass in the faces of strangers—unless she actually wanted me to stick ice picks through the eyeballs of every ass**le in the place.\u003c/p\u003e\n\u003cp\u003eAnd, yes, that would include the ass**les I came with.\u003c/p\u003e\n\u003cp\u003eBut also, this girl’s skin is paler than my fiancée’s, her nose thinner, her hair lighter—not quite the same mahogany shade. Other than that, the resemblance is pretty f**king frightening.\u003c/p\u003e\n\u003cp\u003eShe spins and leans against me, her back pressed up against my chest. Her hair falls across my face and tickles my nose. She smells . . . great. Like honeysuckle and jasmine. It’s a musky incense, like the aroma of a closed room after hours of fantastic f**king. She doesn’t smell nearly as incredible as Kate—but her bouquet is what I would’ve probably defined as incredible if I’d never had the pleasure of Kate’s sublime scent.\u003c/p\u003e\n\u003cp\u003eHer arms snake around my neck and her ass nestles perfectly against my dick. Then she slides down between my open legs and arches forward elegantly, raising her ass tantalizingly toward my face. She plants her feet on the floor and straightens her legs, while still bent over at the waist. Then she slides the thong down her legs and smacks her right butt cheek hard—in the way I’m sure every guy in the place is chomping at the bit to do.\u003c/p\u003e\n\u003cp\u003eShe stands up and turns to face me again. She kicks one leg slowly up around my head—giving me an unobstructed, detailed display of her bare slit.\u003c/p\u003e\n\u003cp\u003eI swear I try not to look. Really.\u003c/p\u003e\n\u003cp\u003eBut I do.\u003c/p\u003e\n\u003cp\u003eGive me a motherfucking break—I’m engaged, not dead.\u003c/p\u003e\n\u003cp\u003eShe climbs onto my lap, facing me. Then she shoves the thong she’d been wearing in my mouth. The crowd roars to a deafening crescendo.\u003c/p\u003e\n\u003cp\u003eI think the crazy train just jumped the track. I’d like to get off now—and not in the happy way. It’s all fun and games until you have another woman’s bodily fluids on your tongue. Kate would never be okay with this. Remind me to guzzle some Listerine when we get back to the room.\u003c/p\u003e\n\u003cp\u003eHer red lips smile as she snatches the tie off my neck, and I manage to spit out the thong. Unperturbed, she drapes the open tie around my shoulders and holds each side like a horse’s reins. She wraps the ends around her hands and uses them for leverage. Her h*ps sway and swivel expertly, the way only an experienced dancer—or expensive hooker—knows how.\u003c/p\u003e\n\u003cp\u003eTo my utter horror—my c**k gets hard. He moves quickly into position—rigid and ready.\u003c/p\u003e\n\u003cp\u003eSince the day Kate let me f**k her, I, and my dick, haven’t given any other women a second glance. No matter how attractive or available, we haven’t been interested. Or aroused.\u003c/p\u003e\n\u003cp\u003eNot one frigging time.\u003c/p\u003e\n\u003cp\u003eIt feels completely wrong. To use Kate’s words—it’s like a compass pointing south. If that were to happen, it would mean the universe was off-kilter. The end of the world as we know it. That’s almost what this seems like.\u003c/p\u003e\n\u003cp\u003eLike a betrayal.\u003c/p\u003e\n\u003cp\u003eMaybe the priests were right, after all. Maybe penises are evil.\u003c/p\u003e\n\u003cp\u003eI glare down at my lap.\u003c/p\u003e\n\u003cp\u003eTraitor.\u003c/p\u003e\n\u003cp\u003eChapter 13\u003c/p\u003e\n\u003cp\u003eAfter the stage lights go dark and I’m untied from the chair, I can’t get off the stage quickly enough. I make a beeline for my happy place, also known as the bar.\u003c/p\u003e\n\u003cp\u003eThe guys surround me, backslapping and laughing like chimpanzees at the zoo. “That was awesome!”\u003c/p\u003e\n\u003cp\u003e“I’m rethinking this whole marriage thing. If it gets me a f**king show like that, I just might do it.”\u003c/p\u003e\n\u003cp\u003e“I’ll take those seconds any day. . . . Wasn’t anything sloppy about that brunette!”\u003c/p\u003e\n\u003cp\u003eA thousand frazzled thoughts race through my head at once, but I put up a solid front.\u003c/p\u003e\n\u003cp\u003e“It was great.” Talk quickly turns to joining the poker game in the back room. As the others make their way over, Matthew turns back to me, where I’m still sitting at the bar.\u003c/p\u003e\n\u003cp\u003e“You okay, man?”\u003c/p\u003e\n\u003cp\u003eI lick my dry lips. “Yeah, I’m good. Just going to finish my drink.”\u003c/p\u003e\n\u003cp\u003eHe nods understandingly and leaves me on my own. Have to admit, I’m a little bit shaky. What was that hard-on all about? Did it happen because the woman grinding on me looked so much like Kate? And most important, do I have to tell Kate about it?\u003c/p\u003e\n\u003cp\u003eJesus.\u003c/p\u003e\n\u003cp\u003eI go from looking at my drink to swallowing it in .5 seconds. There’s no way I’m telling Kate.\u003c/p\u003e\n\u003cp\u003eDon’t look at me like that. Whoever said honesty was the best policy never lived with a frigging chick. Sometimes, it’s best to keep your mouth shut. Certain things women don’t want to know—things, like this, that will accomplish nothing but upsetting them.\u003c/p\u003e\n\u003cp\u003eI’m comfortable with my decision . . . until someone taps me on the shoulder.\u003c/p\u003e\n\u003cp\u003eI turn around to find a pair of big, beautiful brown eyes smiling at me. If my c**k had an elbow, he’d nudge me with it.\u003c/p\u003e\n\u003cp\u003eShe’s changed since the stage show. Or, should I say, covered up. She’s wearing a red, lace, knee-length nightie, with matching high heels. It’s actually pretty conservative for a place like this. Close up, I note that her skin is creamy white and clear—with almost no makeup. Her hair is still down, straight and shiny, and soft looking.\u003c/p\u003e\n\u003cp\u003eShe greets me with a cheery “Hi.”\u003c/p\u003e\n\u003cp\u003e“Hey.”\u003c/p\u003e\n\u003cp\u003e“I’m Lily.”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“Are you having fun tonight?”\u003c/p\u003e\n\u003cp\u003eI motion to the bartender for another. “Sure, it’s . . . super.”\u003c/p\u003e\n\u003cp\u003eLily sits—uninvited—on the stool next to mine. “I’m glad. I wanted to make sure you enjoyed the show, because I’m new here. I only started a few weeks ago.”\u003c/p\u003e\n\u003cp\u003eThe revelation surprises me. “Never would’ve guessed. You’re a natural.”\u003c/p\u003e\n\u003cp\u003eHer smile gets wider. “Wow, you’re so sweet.” Her voice drops to a whisper, as if she were about to spill top-secret information. “But I’m not really a stripper, you know.”\u003c/p\u003e\n\u003cp\u003eI look around the room. Then I look her up and down. “Is it some elaborate game of make-believe?”\u003c/p\u003e\n\u003cp\u003eShe laughs. “I’m a student, actually. This is my last year at the University of Nevada.”\u003c/p\u003e\n\u003cp\u003eI remark drily, “A student stripping her way through college? How very stereotypical of you.”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes. Not unlike the way Kate does frequently. “I waitressed at Hooters for a year. But with the economy the way it is, they had cutbacks. And I got let go last month.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tied-tangled-4/page-41.html","bookId":1810,"creation":"Oct 5, 2019 4:57:39 PM","modification":"Oct 5, 2019 4:57:39 PM"}
