{"id":84117,"no":5,"title":"Page 5","content":"\u003cp\u003eStrippers in Las Vegas are like corn in Iowa. They’re kind of what the city is known for.\u003c/p\u003e\n\u003cp\u003eKate squirms. Then she sighs. “Because everyone was so excited about going to Las Vegas. I didn’t want to be the downer. Bachelor and bachelorette parties in Vegas are like . . . tradition, right?”\u003c/p\u003e\n\u003cp\u003eNot too long ago, sacrificing goats was a tradition too. Doesn’t make it a good idea.\u003c/p\u003e\n\u003cp\u003e“Not all traditions have to be followed. If you’re really that uncomfortable about it, I’ll tell the guys no. We’ll stick to gambling, cigars, and alcohol.”\u003c/p\u003e\n\u003cp\u003eShe pauses a moment—thinking. “You would do that for me?”\u003c/p\u003e\n\u003cp\u003eI chuckle. Because by now, how can she not know? “Of course I would.”\u003c/p\u003e\n\u003cp\u003eKate tucks her hands under her cheek. It makes her look young, vulnerable. My chest tightens with the desire to protect her. From anything—everything—that could cause her pain.\u003c/p\u003e\n\u003cp\u003eIncluding my own tongue.\u003c/p\u003e\n\u003cp\u003e“I don’t really care about the strippers, Drew.”\u003c/p\u003e\n\u003cp\u003eNow I’m confused. “Are you saying that because you really don’t care—or because you think that’s what I want you to say?”\u003c/p\u003e\n\u003cp\u003eI have to ask, because in my experience, women will tell you to do something and then slit your f**king throat when you actually do it. Since you were supposed to know they didn’t really want you to do it. That they don’t really mean what they say.\u003c/p\u003e\n\u003cp\u003eExcept for the times when they do.\u003c/p\u003e\n\u003cp\u003eIt’s like an undiscovered form of schizophrenia. God gave you a mouth for a reason, ladies. Well . . . several reasons actually.\u003c/p\u003e\n\u003cp\u003eBut the point is—use it. Be up-front. It’ll save us all a lot of time and energy.\u003c/p\u003e\n\u003cp\u003e“No—I’m being honest. Now that I know you don’t want to go to a strip club, it doesn’t bother me so much if you do.”\u003c/p\u003e\n\u003cp\u003e“Then why were you upset?”\u003c/p\u003e\n\u003cp\u003e“I think, deep down, I’m just . . . afraid.”\u003c/p\u003e\n\u003cp\u003e“Of what?”\u003c/p\u003e\n\u003cp\u003e“You.”\u003c/p\u003e\n\u003cp\u003eOuch. Gotta say, that one kind of hurts. Like an old knee injury that acts up so infrequently, you almost forget it’s there. Until it reminds you. And you’re bedridden for a week.\u003c/p\u003e\n\u003cp\u003eKate sees my expression and elaborates. “I’m afraid you’re going to do something . . . that you’re going to see something, or hear something, and that you’ll take it the wrong way. That there’ll be a misunderstanding, and you’ll react . . . badly.”\u003c/p\u003e\n\u003cp\u003eI rub my eyes. And sigh. “I thought we were past all that, Kate.”\u003c/p\u003e\n\u003cp\u003eShe grabs my hand and squeezes. “We are past it. We forgave each other, and we’re so good now. But . . . you have to admit . . . there’s a pattern.”\u003c/p\u003e\n\u003cp\u003eRose Kennedy once declared, “It has been said, ‘Time heals all wounds.’ I do not agree. The wounds remain. In time, the mind, protecting its sanity, covers them with scar tissue and the pain lessens. But it is never gone.”\u003c/p\u003e\n\u003cp\u003ePreaching to the choir, Rosie. Preaching to the choir . . .\u003c/p\u003e\n\u003cp\u003eMy hand trails out and cups Kate’s cheek to reassure her. “I’m not that guy anymore, Kate.”\u003c/p\u003e\n\u003cp\u003eOkay, you’re right: deep down I am still that guy. But I’m smarter now. More. I’m a father. In a week, I’ll be a husband. And I would cut my dick off before I would ever hurt Kate like that again.\u003c/p\u003e\n\u003cp\u003eI’ve grown, God damn it.\u003c/p\u003e\n\u003cp\u003e“I love you, Kate. And I trust you. I trust us. We talk about things—I don’t just react now. So I’m not gonna screw this up. Not this weekend; not ever again.”\u003c/p\u003e\n\u003cp\u003eOh, irony. You ugly bitch.\u003c/p\u003e\n\u003cp\u003eKate’s hand covers mine. She stares into my eyes, looking for truth or sincerity or I don’t know what. Whatever it is, she finds it. Because she smiles. And kisses me softly. “I believe you.”\u003c/p\u003e\n\u003cp\u003eThen she pulls back and asks, “Would you feel better if I tell Dee to cancel any stripper plans she may have made for us?”\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHell yes.\u003c/p\u003e\n\u003cp\u003e“Well . . . maybe.”\u003c/p\u003e\n\u003cp\u003eYes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes, yes.\u003c/p\u003e\n\u003cp\u003e“No. No. I want you to have fun with the girls. You know, do what ganders do.”\u003c/p\u003e\n\u003cp\u003eSee? If that’s not evidence of f**king growth, I don’t know what the hell is. Besides, male strippers aren’t that big a deal. Because most of them are aspiring dancers. And we all know what that means. . . .\u003c/p\u003e\n\u003cp\u003eAnyway, no girl wants to bang a guy in a banana hammock. I don’t care if you’re built like a brick shithouse and hung like a freaking horse—if you’re wearing a man-thong? You look like a tool.\u003c/p\u003e\n\u003cp\u003eAs we sit up, Kate tells me, “Watching a greased-up guy shaking his ass is not really my idea of fun, Drew.” She wiggles her eyebrows my way. “Now, you greased up and dancing, on the other hand, that sounds like a good time.”\u003c/p\u003e\n\u003cp\u003eThis is why I love her.\u003c/p\u003e\n\u003cp\u003e“You’re the perfect woman.”\u003c/p\u003e\n\u003cp\u003eI pull her in for a kiss—longer than the last one. But just as our tongues come out to play, a small voice chirps out from the monitor.\u003c/p\u003e\n\u003cp\u003e“Mummy? Daaaddy? Up-o. Up-o.”\u003c/p\u003e\n\u003cp\u003eI pull back. “The beast has risen. You shower first, I’ll get him.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eI slide on a pair of sweats as Kate pulls some clothes from the drawer.\u003c/p\u003e\n\u003cp\u003e“Daaddy! Mummy! Up-o. Up-o. Up-o!”\u003c/p\u003e\n\u003cp\u003eMy son is not a big fan of patience. Wonder where he gets that from?\u003c/p\u003e\n\u003cp\u003e“Oh, and Drew?”\u003c/p\u003e\n\u003cp\u003eI turn toward Kate. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“My grandmother used to say, ‘Look with your eyes, not with your hands.’ When you’re at that strip bar? Make sure you do that.”\u003c/p\u003e\n\u003cp\u003eI nod. “Got it, boss.” I stride forward and grab her chin, freeing her lip from her teeth’s grip. Then I kiss it better—making her just a little dazed and confused. “Stop f**king worrying. We’re gonna have a great time with our friends this weekend. Nothing bad is gonna happen. I promise.”\u003c/p\u003e\n\u003cp\u003eFamous last words, right? How’s that for a jinx? Idiot.\u003c/p\u003e\n\u003cp\u003eI spin her back around and slap both cheeks with one hand. “Now get that ass in the shower before I decide to tap it again.”\u003c/p\u003e\n\u003cp\u003eKate laughs, ’cause she thinks I’m kidding. Only—\u003c/p\u003e\n\u003cp\u003e“Daaadddyyy! Up-o! Up-o!”\u003c/p\u003e\n\u003cp\u003eRight. Duty calls. Kate heads for the bathroom, and I go to spring James from his cage.\u003c/p\u003e\n\u003cp\u003eSo that’s how it started. Everything was awesome. We were talking. Laughing. Communicating.\u003c/p\u003e\n\u003cp\u003eFucking.\u003c/p\u003e\n\u003cp\u003eIt was like a fairy tale, for Christ’s sake.\u003c/p\u003e\n\u003cp\u003eDid you ever notice how fairy tales all start off great? The beautiful princess, the happy kingdom? Then it all turns to shit. One minute Hansel’s feeling no pain, chomping on a window made of sugar, and the next minute some old hag is trying to shove his ass in an oven. \u003c/p\u003e","sourceLink":"https://allnovel.net/tied-tangled-4/page-5.html","bookId":1810,"creation":"Oct 5, 2019 4:57:39 PM","modification":"Oct 5, 2019 4:57:39 PM"}
