{"id":84121,"no":9,"title":"Page 9","content":"\u003cp\u003eAnd then we’re kissing—tongues dancing and tasting. I fall back on the couch, taking her with me—keeping her on top.\u003c/p\u003e\n\u003cp\u003eHer lips tease their way to my ear. “I love you,” Kate breathes, before licking around the shell. Heated lust gathers in my gut, then furrows out to my thighs and arms—and my dick.\u003c/p\u003e\n\u003cp\u003eI return the sentiment. “I love you.”\u003c/p\u003e\n\u003cp\u003eKate’s mouth lowers to my neck, torturous in its feather-light brushes against my skin. “And I love our life.”\u003c/p\u003e\n\u003cp\u003eMy hand tangles in her hair, loosening the bun, making it fall. “Me too.”\u003c/p\u003e\n\u003cp\u003eShe drops to her knees on the floor and I sit up, legs spread so she can nestle between my thighs. She looks up at me with hungry, dark eyes and a naughty-girl smile—my favorite combination.\u003c/p\u003e\n\u003cp\u003eKate unbuckles my pants and I lift up to accommodate her as she yanks them off. More slowly, she peels my boxers down and my impatient dick bounces up to greet her.\u003c/p\u003e\n\u003cp\u003e“And I love your cock.” She drives the point home by running her wet tongue up and down it, then swirling around the head.\u003c/p\u003e\n\u003cp\u003eI look at her beautiful face and grin. “I love my c**k in your mouth.”\u003c/p\u003e\n\u003cp\u003eHer lips vibrate against me as she chuckles—and the sensation make my legs tremble. Then she suctions with her lips from base to tip—tauntingly—without actually taking me inside. When I’m on the brink of losing my f**king mind, she opens up and slides my dick into the tight, hot wetness of her mouth.\u003c/p\u003e\n\u003cp\u003eMy head lolls back and I groan.\u003c/p\u003e\n\u003cp\u003eShe swallows me slowly, inch by inch. It’s maddening and feels eye-crossingly fantastic at the same time. I can’t decide if I want her to suck me hard and fast or to draw out the blissful torture for hours. Maybe days.\u003c/p\u003e\n\u003cp\u003eWhen I’m nestled in Kate’s throat, she pauses, breathing softly.\u003c/p\u003e\n\u003cp\u003eAnd I hiss, “Fuck . . .”\u003c/p\u003e\n\u003cp\u003eKate was always skillful at giving head—a real natural. But in these last years, her talents have reached epic proportions. She’s a maestro and I’m her well-endowed instrument. She practically trained the gag reflex right out of herself, and she actually enjoys deep throating—and swallowing.\u003c/p\u003e\n\u003cp\u003eShe once told me it made her feel powerful. Watching my face as she works me over. Seeing the signs of pleasure she’s controlling—letting me revel in. It’s a pretty accurate take on the situation, because at the moment I’m at Kate’s complete and total mercy.\u003c/p\u003e\n\u003cp\u003eAnd that, kiddies, is the best f**king seat in the house.\u003c/p\u003e\n\u003cp\u003eShe sucks me hard as her head glides up, so just the tip remains between her beautiful lips. She swirls with her tongue again—this time with more pressure, less teasing. Then she bobs up and down quickly—meaning business—all tongue, decadent sloppy wetness, and rough brushes of teeth. Her cheeks hollow out and her hand massages my balls, giving them a gentle, erotic tug.\u003c/p\u003e\n\u003cp\u003eI moan and curse and chant her name.\u003c/p\u003e\n\u003cp\u003eI grip her hair and guide her up and down on my dick with just enough force to make her hum in appreciation.\u003c/p\u003e\n\u003cp\u003e“Yeah, baby, just like that. So f**king good.” I gasp.\u003c/p\u003e\n\u003cp\u003eKate’s lips tighten and her head moves faster.\u003c/p\u003e\n\u003cp\u003e“Jesus, Kate, I’m gonna come.”\u003c/p\u003e\n\u003cp\u003eMy hand clenches and I hold her in place, and every muscle in my body contracts in screaming, unanimous pleasure. My teeth grind and my h*ps thrust, and with moans of her own, Kate swallows enthusiastically until I have nothing left.\u003c/p\u003e\n\u003cp\u003eMy breathing is harsh as she gifts me with one last flick of her tongue. Then she comes up smiling and climbs onto my lap. And I’m boneless—totally, sublimely relaxed. Screw wine: a b**w j*b is the best way to unwind after a long day at work.\u003c/p\u003e\n\u003cp\u003eThe only thing that would make it better is if I could return the favor.\u003c/p\u003e\n\u003cp\u003eAs I enclose Kate in my arms, I add another tick to the running total of orgasms I owe her. This makes . . . fifteen. And I plan on settling up all in one night—the night Roberta says Kate’s good to go. Don’t worry—as long I keep her hydrated, there’s no physical danger from too many orgasms. I asked.\u003c/p\u003e\n\u003cp\u003e“I think I’m going to go take that bath you mentioned,” she purrs. “Want to join me?”\u003c/p\u003e\n\u003cp\u003eI run my knuckles along her jaw. “Joining you is just one of the things I’m dying to do right now.”\u003c/p\u003e\n\u003cp\u003e“Things like washing my back?”\u003c/p\u003e\n\u003cp\u003eI brush my lips against hers. “I want to wash lots of places—every nook and cranny.”\u003c/p\u003e\n\u003cp\u003eUnfortunately, washing her back and rubbing her shoulders are all I’ll be able to do tonight. But it’ll be enough for now.\u003c/p\u003e\n\u003cp\u003eI keep her legs wrapped around me as I stand up, bare assed, and walk us to the bathroom.\u003c/p\u003e\n\u003cp\u003eHaving two working parents in the house isn’t always perfect—schedule conflicts and work-related stress can get in the way. But it works for us.\u003c/p\u003e\n\u003cp\u003eNow, where were we again? Before we cut to the gratuitous blow-job scene?\u003c/p\u003e\n\u003cp\u003eThat’s right—elbow deep in the massacre that is James’s diaper. Try mouth-breathing—it helps with the stench.\u003c/p\u003e\n\u003cp\u003e“Good God, kid . . . what’d you do last night? Sneak out of the crib and eat a T-bone steak?”\u003c/p\u003e\n\u003cp\u003eWhich brings me to the greatest invention of our time. Nope—it’s not the Internet. Or the automobile. It’s not female birth control—though that’s a good one too. The best innovation of the last century is the Diaper Genie. It’s a lifesaver.\u003c/p\u003e\n\u003cp\u003eI drop the toxic ball into the holy can and quickly close the lid. Then I get him cleaned up with the heated wipes and sprinkle on baby powder. Next I head over to the closet to pick out his clothes. A black, collared shirt, jeans, and Nike sneakers. Clothes make the man—and it works the same way with boys. It’s all about first impressions. If you actually want your kid getting knocked on his ass in the sandbox? Put him in one of those pansy sweater vests. That’ll pretty much guarantee it. James is a cool kid—and I make damn sure he dresses like one.\u003c/p\u003e\n\u003cp\u003eAfter I gel James’s hair and brush his teeth—with some helpful suggestions on his spitting technique—I carry him to the kitchen airplane style. Zoom. And strap him in his high chair so he can’t escape.\u003c/p\u003e\n\u003cp\u003eNext up? Breakfast. You remember how I love cereal, right? That hasn’t changed. It’s Lucky Charms for me—with extra marshmallows.\u003c/p\u003e\n\u003cp\u003eBut for my son? No Lucky Charms.\u003c/p\u003e\n\u003cp\u003eThose Breakfast Club kids actually knew what they were talking about. And we really do turn into our frigging parents. And phrases like We’ll see and Because I said so just pop into your head and fly out of your mouth. It’s disturbing. Like Exorcist-possession kind of shit.\u003c/p\u003e\n\u003cp\u003eAnyway, for James’s breakfast? Organic-apple slices and whole-grain Cheerios—without sugar. \u003c/p\u003e","sourceLink":"https://allnovel.net/tied-tangled-4/page-9.html","bookId":1810,"creation":"Oct 5, 2019 4:57:39 PM","modification":"Oct 5, 2019 4:57:39 PM"}
