{"id":91218,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I haven’t given this number to many people,” Malachi explained.\u003c/p\u003e\n\u003cp\u003e“Oh, yeah? Well, thanks. Look, I’m sorry to wake you. I know what time it is but...you said to call. I’m down on the riverfront, right near city hall. Dumb, I know. But I couldn’t stand it. I couldn’t stand doing nothing. And I realize there are cops out here, too—I believe someone is on this 24/7—but I think I can see something out on the water. I think it’s a rowboat. There’s nothing else out there, but can you get here?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Give me two minutes. I’m up and I’m close. I’ll be right there.” A rowboat. He thought of what Blue had said.\u003c/p\u003e\n\u003cp\u003eRoger turned; Malachi didn’t know how, but he seemed to home right in on his location.\u003c/p\u003e\n\u003cp\u003eHe walked toward him. “Malachi?” he asked.\u003c/p\u003e\n\u003cp\u003eMalachi walked toward Roger at the same time. “You said it. People are watching the river.”\u003c/p\u003e\n\u003cp\u003e“Have you seen anything?” Roger asked.\u003c/p\u003e\n\u003cp\u003eWill and Abby came out of the shadows, coming over to join them. “Everybody’s watching the river?” Roger asked. Malachi wasn’t sure if he felt reassured, stalked or just mystified.\u003c/p\u003e\n\u003cp\u003e“What is it you saw?” Malachi asked.\u003c/p\u003e\n\u003cp\u003e“Come here. Come straight to the edge and you’ll see. It’s moving with the current,” Roger said.\u003c/p\u003e\n\u003cp\u003e“I’ll get Jackson.” Will stepped aside to make the call.\u003c/p\u003e\n\u003cp\u003e“Do you see it?” Roger demanded.\u003c/p\u003e\n\u003cp\u003eMalachi did; it was dark out on the water and the current was moving, but every few seconds, the moonlight touched down on something. He understood why Roger had stared out at the water for so long. It was there, and then it seemed to disappear in the darkness.\u003c/p\u003e\n\u003cp\u003e“We need to go out there and get it,” Roger said.\u003c/p\u003e\n\u003cp\u003eAbby put a hand on his arm. “Will’s calling for a boat to tow it in, to find out what’s going on. Maybe you should—”\u003c/p\u003e\n\u003cp\u003e“Should what?” Roger shouted. “Go home? I can’t, Abby. Come on—you know I can’t do that!”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Roger. You’re right. We’ll just stay here and wait.” She came to him as a friend and slipped an arm around him, standing by his side.\u003c/p\u003e\n\u003cp\u003eOnly seconds later, they saw a marine patrol boat with lights flashing streak along the river. They saw it slow down and circle the object. The moon went behind a cloud and as it reappeared, they saw an officer tossing out a towrope.\u003c/p\u003e\n\u003cp\u003eMalachi’s phone rang. He answered immediately.\u003c/p\u003e\n\u003cp\u003eRoger stared at him.\u003c/p\u003e\n\u003cp\u003e“It’s a rowboat and there’s nothing in it,” he told Roger. “Possibly, it just broke away from a dock. They’ll tow it in. It might have no connection to the case.”\u003c/p\u003e\n\u003cp\u003e“Empty,” Roger repeated dully. Then he grew animated again. “That could mean that...she’s in the river. Tell them...tell them they have to search the water. They have to search the water until they find her! Like when Abby saw Helen. What if he threw her out of that rowboat? If he did, she’s in the water somewhere!”\u003c/p\u003e\n\u003cp\u003e“Roger,” Malachi said, placing his hands on the man’s shoulders and focusing on his eyes. “There had to be someone in the rowboat to throw someone else in the water. There was no one in the boat.”\u003c/p\u003e\n\u003cp\u003eRoger seemed to deflate. His shoulders slumped. “Yeah, you’re right. I guess you’re right. But...but she could be out there.”\u003c/p\u003e\n\u003cp\u003e“So is the patrol,” Malachi said.\u003c/p\u003e\n\u003cp\u003e“Yeah, I know,” Roger said. “I’ve got other people running my tours for me. I’m available if there’s anything I can do. I mean, hell, I’m here whether you want anything from me or not. I’ll be walking around. I’ll be looking. I can’t give up.”\u003c/p\u003e\n\u003cp\u003e“Rog, how well did you know Bianca?” Abby asked. “I mean, everyone’s on the lookout because of what’s been happening, but she could have lost her phone or decided not to...pursue the relationship.”\u003c/p\u003e\n\u003cp\u003e“I might’ve just met her,” Roger said, “but there was something there, Abby. I don’t believe Bianca blew me off and disappeared.”\u003c/p\u003e\n\u003cp\u003e“Okay, I’m sorry,” Abby murmured.\u003c/p\u003e\n\u003cp\u003eMollified, Roger looked back at the river. “I guess...I guess I’ll go home for a while. Sleep.”\u003c/p\u003e\n\u003cp\u003e“Come on. Let’s all walk back,” Malachi said.\u003c/p\u003e\n\u003cp\u003e“You guys don’t need to babysit me,” Roger protested. “You sure don’t need to go out of your way.”\u003c/p\u003e\n\u003cp\u003e“I’m staying at Abby’s house on Chippewa,” Will told him. “I’ll walk back with you, Roger.”\u003c/p\u003e\n\u003cp\u003e“My place is just past Abby’s.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” Will said. “Then we’re going the same way.”\u003c/p\u003e\n\u003cp\u003eThe two of them started walking ahead, but Roger stopped and turned back. “I thought you all were watching the river?”\u003c/p\u003e\n\u003cp\u003e“Shift is over. New crew coming on,” Malachi said to him.\u003c/p\u003e\n\u003cp\u003eRoger nodded and then saw Abby. He came back and threw his arms around her in a warm hug. “Thank you,” he said.\u003c/p\u003e\n\u003cp\u003e“Love ya, Rog.”\u003c/p\u003e\n\u003cp\u003e“You, too.” He nodded, then turned, hurrying to catch up with Will. Malachi’s phone vibrated; he grabbed it quickly and heard Jackson’s voice. “When you get back in the Dragonslayer, take a look at the footage on the computer screens.”\u003c/p\u003e\n\u003cp\u003e“Anything wrong? Anything I should worry about?” Malachi asked.\u003c/p\u003e\n\u003cp\u003e“No, nothing wrong. But a little bizarre. Interesting. Have a look, then get some sleep.”\u003c/p\u003e\n\u003cp\u003e“What?” Abby asked as Malachi slipped his phone into his pocket.\u003c/p\u003e\n\u003cp\u003e“Nothing. Jackson’s just checking in,” he said.\u003c/p\u003e\n\u003cp\u003eHe and Abby walked slowly behind Will and Roger, coming along the riverfront and then hiking over to Bay and down toward the Dragonslayer.\u003c/p\u003e\n\u003cp\u003eWhen the other two split off, heading to the center of the old town, Abby waved. “I feel like such a jerk,” she said. “Roger and I went to school together from the time we were kids.”\u003c/p\u003e\n\u003cp\u003e“And you’re being a good friend. Remember, part of shadowing people is to clear them,” Malachi reminded her.\u003c/p\u003e\n\u003cp\u003eAs they returned to the Dragonslayer, he noticed that the sun was just coming up.\u003c/p\u003e\n\u003cp\u003e“Let’s get a few hours’ sleep,” he said huskily.\u003c/p\u003e\n\u003cp\u003eAbby nodded. “Good idea.”\u003c/p\u003e\n\u003cp\u003eThe morning crew had yet to arrive. Abby unlocked the door and they trudged up to the second-floor apartment. She started for the bedroom; he wanted to follow.\u003c/p\u003e\n\u003cp\u003e“I’m just going to check the screens. I’ll be right there,” he told her.\u003c/p\u003e\n\u003cp\u003eHe sat down and looked at the various views of the Dragonslayer. Nothing. He ran the footage back, quickly at first. Then he reran it, closely studying the screen that showed the front of the Dragonslayer.\u003c/p\u003e\n\u003cp\u003eHe saw himself and Abby leaving. They went out of view.\u003c/p\u003e\n\u003cp\u003eHe glanced to see the time; they were gone about ten minutes when someone else approached the Dragonslayer.\u003c/p\u003e\n\u003cp\u003eHead down.\u003c/p\u003e\n\u003cp\u003eMost of the time when a person or persons couldn’t be identified on video, it was because of a sweatshirt with a hoodie.\u003c/p\u003e\n\u003cp\u003eBut this person wasn’t in a hoodie. He wore a sweeping hat and a cloak. A long black cloak.\u003c/p\u003e\n\u003cp\u003eBut the figure reached the Dragonslayer and seemed about to try the door, then abruptly stepped back. The hat still blocked any view of the face. “Look up, you bastard!” Malachi muttered.\u003c/p\u003e\n\u003cp\u003eBut the person didn’t look up. Apparently, something at the Dragonslayer had spooked him.\u003c/p\u003e\n\u003cp\u003eMalachi went through the footage of the bar area and saw a shadow appear just inside the front door.\u003c/p\u003e\n\u003cp\u003e“Blue,” Malachi whispered. “Blue, you are watching over this place.”\u003c/p\u003e\n\u003cp\u003eHe typed a message to Jackson. Maybe Will could enhance the footage in the morning; maybe there was some information they could get.\u003c/p\u003e\n\u003cp\u003eJackson was still at the computer in Abby’s house.\u003c/p\u003e\n\u003cp\u003ePolice closest to the area were dispatched. They were there in minutes but the person was gone, and out of camera range almost immediately.\u003c/p\u003e\n\u003cp\u003eWhile we were by the river.\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eDo you think the cameras scared him off?\u003c/p\u003e\n\u003cp\u003eDon’t know. Camera would be pretty obvious if it was someone who knew the Dragonslayer.\u003c/p\u003e\n\u003cp\u003eAny hope of enhancing the footage?\u003c/p\u003e\n\u003cp\u003eI’ll get Will on it later in the morning. Rowboat taken to the forensic lab. I’ll report as soon as we learn anything.\u003c/p\u003e\n\u003cp\u003eOK. Grabbing a few hours sleep.\u003c/p\u003e\n\u003cp\u003eI’m on for the next few hours here. Angela spells me at eight. Police know to call at any time. I’ll keep you posted.\u003c/p\u003e\n\u003cp\u003eMalachi signed off and walked down the hallway to Abby’s room. He went in and tiptoed over to the bed.\u003c/p\u003e\n\u003cp\u003eAbby was sound asleep. She’d set her gun on the dresser—hadn’t even taken off her clothes. He pulled a blanket over her, stripped and lay down himself. He stayed awake for a few minutes, once again wondering about the mysterious noise Helen had reported.\u003c/p\u003e\n\u003cp\u003eTap, tap, tap. He knew it meant something. But what?\u003c/p\u003e\n\u003cp\u003eAbby woke up with a jolt. It felt very late, and although the drapes were drawn, she could feel the warmth of the sun pouring in.\u003c/p\u003e\n\u003cp\u003eShe dashed out of the room and found Malachi sitting at the computers.\u003c/p\u003e\n\u003cp\u003e“Good morning,” he said.\u003c/p\u003e\n\u003cp\u003e“What time is it?” she asked.\u003c/p\u003e\n\u003cp\u003e“Ten.”\u003c/p\u003e\n\u003cp\u003e“Ten! We should be up and doing something.”\u003c/p\u003e\n\u003cp\u003e“You’ll notice that I am,” he said with a laugh. “But when you’re ready, we’ll go back to the area around the cemetery and the Wulf and Whistle.”\u003c/p\u003e\n\u003cp\u003e“All right. I just have to send a few emails before we go.”\u003c/p\u003e\n\u003cp\u003e“Okay, take your time.”\u003c/p\u003e\n\u003cp\u003e“Take my time?” Abby echoed. “No, no, I slept a lot. We have to get started! If this guy is following his usual timelines, Bianca doesn’t have much longer. But if we’re going back to the cemetery today, I have to live up to my promise about having that tombstone repaired.”\u003c/p\u003e\n\u003cp\u003e“Do you know who to contact?” Malachi asked.\u003c/p\u003e\n\u003cp\u003e“I know a few people on the city council. I’ll write the emails to get things started.” She walked over to the desk near the balcony, where she’d left her laptop, and then paused, looking at him. “So, how am I going to explain why I know all this? We don’t really have an opportunity to research it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-alive-krewe-of-hunters-10/page-38.html","bookId":2284,"creation":"Oct 5, 2019 5:48:37 PM","modification":"Oct 5, 2019 5:48:37 PM"}
