{"id":91220,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Yes, but an entry from the tavern might have been sealed off. That doesn’t mean there aren’t more tunnels beneath us.”\u003c/p\u003e\n\u003cp\u003e“And how are we going to find one? And if it’s all blocked off, how’s a killer using it?”\u003c/p\u003e\n\u003cp\u003e“The killer, obviously, knows where it is,” Malachi said. “And, somehow or other, he’s opened it.”\u003c/p\u003e\n\u003cp\u003eAbby turned around in the little space. Behind the Wulf and Whistle was a wooden portico and a gate that sectioned off an area. She realized that was where the tavern kept their garbage.\u003c/p\u003e\n\u003cp\u003e“Hey!” she said.\u003c/p\u003e\n\u003cp\u003eShe went to the gate and opened it. She saw a bin there and threw it open. Inside it was another bin that could be removed to dump the garbage.\u003c/p\u003e\n\u003cp\u003e“Malachi!” she called.\u003c/p\u003e\n\u003cp\u003eHe hurried over to her. “They’d never need to move this,” she said. “They obviously always lift out the inner bin when they have to empty it. Steve must have some of his employees take it to the end of the alley for garbage pickup.”\u003c/p\u003e\n\u003cp\u003eMalachi walked around behind the giant bin. Planked grating supported the bin and stretched about two feet behind it. He bent down and raised the wooden planks.\u003c/p\u003e\n\u003cp\u003e“There’s a hole,” he said. “A big black hole. Shall we?”\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eThe hole went straight down. At some point, Malachi thought, the tunnel must have been dug as part of a sewage system. Maybe those dealing with the yellow fever outbreak used it, and for the Underground Railroad any route was better than no route. It was good to think that there’d been those willing to risk everything to help others, just as it was chilling to think about the fear escaping slaves must have felt when they slipped into the tunnels. He could imagine them praying that they’d reach a ship, and that the ship would take them north without being stopped and searched.\u003c/p\u003e\n\u003cp\u003eThe tunnel smelled dank. Malachi thought about death and disease and human misery as he crawled down the treacherous earth ladder that led to the floor below. Hitting the ground, he dug in his pocket for his flashlight, then shone the light over the length of the tunnel. Like the others, this one appeared to head straight for the river.\u003c/p\u003e\n\u003cp\u003e“Careful,” he told Abby. “The grips are old and weak.” He set his flashlight on the ground and reached up to help her make her way down.\u003c/p\u003e\n\u003cp\u003e“Plus wet and nasty,” Abby murmured.\u003c/p\u003e\n\u003cp\u003e“Yeah. But let’s see where this goes.”\u003c/p\u003e\n\u003cp\u003e“Should we have called it in?” Abby asked.\u003c/p\u003e\n\u003cp\u003e“No. The killer could well have seen all the commotion going on at the Wulf and Whistle. He might be amused now, assuming we had it completely wrong. I don’t want him to know we’ve found this place. If he doesn’t know, he might try to make use of it again.”\u003c/p\u003e\n\u003cp\u003eAbby nodded. She had a small flashlight herself and she waved it before them, letting the light fall over the earth walls.\u003c/p\u003e\n\u003cp\u003eAs they moved along the length of the tunnel, it began to narrow. Halfway down, they came across a break in one of the walls.\u003c/p\u003e\n\u003cp\u003eThe fork and the main tunnel stretched ahead, both stygian in their darkness. They looked at each other in the eerie glow of the flashlights. “No splitting up,” Malachi said.\u003c/p\u003e\n\u003cp\u003e“I wasn’t about to suggest it. Good agents trust in their partners and their backup.”\u003c/p\u003e\n\u003cp\u003e“Then I say we go right.”\u003c/p\u003e\n\u003cp\u003eAbby considered where she was for a moment. “I’m trying to figure out where we are—where we’d be if we were on street level. We’d be heading back to the Dragonslayer.”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eThe tunnel was narrow; in places, dirt was falling in. They walked for what Abby estimated was at least a block.\u003c/p\u003e\n\u003cp\u003eAfter that, they walked for the equivalent of another block. As they did, she heard their feet scraping on the rough ground. Malachi stopped and touched the walls.\u003c/p\u003e\n\u003cp\u003e“Are these tunnels solid?” she asked.\u003c/p\u003e\n\u003cp\u003e“They seem to be. They were dug properly, support beams were set in...we’re safe. They seem to be in better shape than half the new housing you’ll see,” Malachi remarked.\u003c/p\u003e\n\u003cp\u003eThey kept walking, their flashlights illuminating the way. And then they came to a solid wall of earth.\u003c/p\u003e\n\u003cp\u003e“Well, this is great,” Abby complained.\u003c/p\u003e\n\u003cp\u003e“Actually, it is,” Malachi said, stepping back.\u003c/p\u003e\n\u003cp\u003e“Why do you say that?”\u003c/p\u003e\n\u003cp\u003e“You know about where we are?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” she said slowly. “We’re almost at the Dragonslayer.”\u003c/p\u003e\n\u003cp\u003e“Start at the very end, then back up. Feel the walls. Feel them, tap them...tell me when you feel something different. Let’s put the lights down and shine them on the walls.”\u003c/p\u003e\n\u003cp\u003eThey did so, one light facing left, the other pointed toward the right.\u003c/p\u003e\n\u003cp\u003eAbby moved along the walls, testing them. They seemed to be earth, but the long-gone architects of the tunnels had given them support beams and arches. Dampness had damaged some of the wood that shored up the walls, but she assumed they would have used a hardwood that didn’t easily decompose. After all, they’d lasted this long.\u003c/p\u003e\n\u003cp\u003eShe was so intent on her work that she was startled when she heard Malachi shout, “Aha!”\u003c/p\u003e\n\u003cp\u003eShe turned around. At first, all she saw was darkness and the glare of the light—but then she realized that the light was creating shades of darkness. Malachi had found another fork in the tunnel.\u003c/p\u003e\n\u003cp\u003e“How... There was wall there before!” Abby said.\u003c/p\u003e\n\u003cp\u003e“That mud patch with the vine attached is like something I have at my house in Virginia. In the house, it’s called a pocket door. The wall slides into a pocket in the rest of the wall.”\u003c/p\u003e\n\u003cp\u003eAbby picked up her flashlight and stood by his side. She gasped. “Malachi—that’s the end of the tunnel that leads from the Dragonslayer!”\u003c/p\u003e\n\u003cp\u003e“That’s what I figured,” he said. “So, our killer’s been able to access the Dragonslayer from the Wulf and Whistle, the Wulf and Whistle from the Dragonslayer and the river from either of them.”\u003c/p\u003e\n\u003cp\u003e“We can shut off the bastard, cement him in,” Abby said bitterly.\u003c/p\u003e\n\u003cp\u003eMalachi shook his head. “Not if we want to find him while Bianca is still living.”\u003c/p\u003e\n\u003cp\u003e“So what do we do?”\u003c/p\u003e\n\u003cp\u003e“Right now, we go back. We pretend we’ve never been here—and we get Will to bring in some cameras. We need to follow this killer wherever he’s going. That’s how we’ll rescue Bianca.”\u003c/p\u003e\n\u003cp\u003eMalachi stepped through the hole he’d created in the tunnel wall. He inspected the pocket into which he’d slid the wooden door that had originally seemed to be just more earth-and-hardwood tunnel wall. “At my house,” he told Abby, “this kind of door was used to turn the place into a tavern by night—a way stop for travelers—and then back into separate rooms for working and sleeping. Thomas Jefferson’s family had apparently been involved with the building of my house. I really have one of those places where you get to say ‘Washington slept here.’ But I believe this technique must’ve been common during colonial days.”\u003c/p\u003e\n\u003cp\u003e“I guess these tunnels were used at various times, for various reasons,” she mused.\u003c/p\u003e\n\u003cp\u003eMalachi nodded. “City planners might have started them, pirates might have continued to use them—to shanghai others or to effect their own escapes. And then they became important to the Underground Railroad during the Civil War. At other times, the city or property owners sealed up entrances, as well as these secret doorways from one tunnel to another. Remember, governments—federal, state and municipal—usually do whatever is cheapest. You don’t need a tunnel, then seal up the entrance. If you know the city and you’ve heard about its history all your life—and studied it—you might realize where to look for these entrances.”\u003c/p\u003e\n\u003cp\u003e“I know the city!” Abby said.\u003c/p\u003e\n\u003cp\u003e“Yep, and you knew about the tunnel under the Dragonslayer because it was your tunnel. You knew about the hospital tunnels because their existence and the history of what went on during the yellow fever epidemic was recorded—sketchily, yes, but there were records,” Malachi said. He offered her a dry smile. “Since you were never looking for a way to kidnap people and take them out on the river, you probably never tried to explore underground Savannah as thoroughly as our killer did. Come on, let’s go back to where we came in. I don’t want to use the Dragonslayer tunnel and the tavern stairs. The dining room will be full right now, and I don’t want to be seen.”\u003c/p\u003e\n\u003cp\u003e“Let’s hope nobody sees us crawling through the garbage,” Abby said.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Malachi agreed. “I’m going to give Jackson a call so he can arrange for someone to watch the entrance here. Someone in plain clothes who won’t be noticed. Jackson will have to talk to David Caswell, get someone he trusts implicitly.” He had his phone out, tried to call, then made a face at her.\u003c/p\u003e\n\u003cp\u003e“Well, that was dumb. No signals down here. Come on. Let’s go back up as smoothly as we can and get someone down here.” He grinned at her. “After that, we need to shower again. Another reason I’d rather not go to the Dragonslayer—I don’t want to be seen like this. We’ll go to your house on Chippewa, okay?”\u003c/p\u003e\n\u003cp\u003eAbby nodded. Malachi closed the pocket door, and they made their way back through the tunnel.\u003c/p\u003e\n\u003cp\u003eAbby’s flashlight reflected off something on the floor. She instinctively started to pick it up and then didn’t. She hunkered down and took a closer look; Malachi hunkered down next to her. “Gum wrapper,” he said. “Or part of a gum wrapper.”\u003c/p\u003e\n\u003cp\u003e“Fingerprints?”\u003c/p\u003e\n\u003cp\u003e“Possible, yes,” Malachi said. He glanced at her. Even in the eerie light, there was a beauty, a strength, in his face. Not only that, she couldn’t remember being able to communicate with anyone as she could with him.\u003c/p\u003e\n\u003cp\u003eIt was the ghost thing.\u003c/p\u003e\n\u003cp\u003eIt was the sex.\u003c/p\u003e\n\u003cp\u003eIt was whatever made him unique.\u003c/p\u003e\n\u003cp\u003e“Certainly not an eighteenth-or nineteenth-century object,” he said. He was prepared; he reached into his pocket and she saw that he had a little envelope. He turned it inside out to pick up the ripped gum wrapper, secured it without touching it and slid it into his pocket. He took her arm, drawing her up. “Okay, let’s get out of here now.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-alive-krewe-of-hunters-10/page-40.html","bookId":2284,"creation":"Oct 5, 2019 5:48:37 PM","modification":"Oct 5, 2019 5:48:37 PM"}
