{"id":91227,"no":47,"title":"Page 47","content":"\u003cp\u003e“Love!” Bootsie scoffed. “Love? Who are you in love with, young lady?”\u003c/p\u003e\n\u003cp\u003e“Tall, dark, handsome and somewhat mysterious—seems to almost read minds,” Grant said, teasing Abby.\u003c/p\u003e\n\u003cp\u003e“Love! Bah. Abby and that fed, they’re both cops,” Bootsie muttered.\u003c/p\u003e\n\u003cp\u003e“Cops fall in love,” Macy said.\u003c/p\u003e\n\u003cp\u003eDirk winked. “And everyone falls in lust from time to time.”\u003c/p\u003e\n\u003cp\u003e“Come on, Abby,” Grant said. “What’s the deal with the tall, dark and handsome G-man?”\u003c/p\u003e\n\u003cp\u003e“You mean Malachi?” she asked innocently.\u003c/p\u003e\n\u003cp\u003e“Let’s hope—or else our girl’s become a home wrecker,” Dirk said. “I get the impression that the cute little blonde G-woman is with tall, dark, exotic actor G-man. And the pretty blondish one is with tall, dark, handsome and Native American G-man. That leaves intriguing G-man who’s staying up in the apartment.”\u003c/p\u003e\n\u003cp\u003e“Now, why would you be worried about my love life, anyway, huh?” Abby asked Dirk, avoiding the question.\u003c/p\u003e\n\u003cp\u003e“We’ll always worry about you, Abs,” Bootsie said.\u003c/p\u003e\n\u003cp\u003e“We’re like the great-uncles you’re really glad you never had,” Dirk told her, which made Abby laugh.\u003c/p\u003e\n\u003cp\u003e“Hey, I’m just the bartender,” Sullivan said lightly.\u003c/p\u003e\n\u003cp\u003e“You guys know I dreamed about working for the federal government, that all my life I wanted to be an agent,” Abby said. “You know I’ll go back to work with a unit, wherever I’m assigned.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but I looked this unit up,” Grant said sagely. “They’re the Krewe of Hunters.”\u003c/p\u003e\n\u003cp\u003e“What does that mean?” Bootsie asked.\u003c/p\u003e\n\u003cp\u003e“They ask the dead questions—and the dead help them find the killers,” Grant explained.\u003c/p\u003e\n\u003cp\u003eMacy giggled at that. “Seriously? Come on, Grant. The one woman is a medical examiner. If they could talk to the dead, she’d just ask the corpses who...who turned them into corpses. Oh, I sound terrible—I’m concerned, really. I’m grateful you found Helen, Abby, and praying that Roger’s girlfriend will be found, as well. But it’s not looking good for her, is it?”\u003c/p\u003e\n\u003cp\u003e“We don’t have any real answers,” Abby said.\u003c/p\u003e\n\u003cp\u003eBootsie made a sound of derision. “All those feds and cops—and nothing. You people, all that schooling—and a pirate’s walking all over you.” He raised his beer. “Ask the dead questions, my ass!”\u003c/p\u003e\n\u003cp\u003e“Bootsie,” Dirk remonstrated quietly.\u003c/p\u003e\n\u003cp\u003e“It’s just us here,” he said. He looked around. “Hey, where’s our third? I haven’t seen Aldous all day.”\u003c/p\u003e\n\u003cp\u003e“I’m sure he’ll be around,” Sullivan said, pushing away from the bar to get a drink order from one of the waitresses.\u003c/p\u003e\n\u003cp\u003e“Yes, I’m sure he will,” Macy agreed.\u003c/p\u003e\n\u003cp\u003e“Hey, you make a great wench, Abby,” Grant told her.\u003c/p\u003e\n\u003cp\u003e“Gee, thanks. Which reminds me, I want to go and get out of this now.” Abby turned but then paused, looking back. “Do me a favor, will you, Macy? Why don’t you and Dirk go out on a date instead of staring at each other all the time? It’s not like you just met or anything.”\u003c/p\u003e\n\u003cp\u003eMacy’s face went bright red. “Abby!”\u003c/p\u003e\n\u003cp\u003eDirk was silent.\u003c/p\u003e\n\u003cp\u003e“Now there’s a sensible question,” Bootsie said. He gave Dirk a nudge. “Here’s your chance, boy. Ask her out.”\u003c/p\u003e\n\u003cp\u003e“Um...” Dirk said.\u003c/p\u003e\n\u003cp\u003eMacy found her voice. “Dirk, I don’t know what these people are doing, but don’t you dare feel obliged to ask me anything.”\u003c/p\u003e\n\u003cp\u003e“I don’t feel obliged, Macy.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003e“But...we should go out sometime. To a restaurant. We’re in a restaurant. I mean, a different restaurant. One where you’re not working. Or we could go dancing. Or...”\u003c/p\u003e\n\u003cp\u003e“Dirk Johansen, are you asking me out?” Macy demanded.\u003c/p\u003e\n\u003cp\u003e“I guess I am. Except you don’t have to feel obligated or anything. I’m not trying to put you in a bad position—”\u003c/p\u003e\n\u003cp\u003e“I would love to go out with you, Dirk!” Macy said.\u003c/p\u003e\n\u003cp\u003e“Thank God! That’s settled,” Bootsie said. “Now, can we get back to sitting around the bar and bitching about everyone we see? Macy, shoo! Go back to work.”\u003c/p\u003e\n\u003cp\u003eMacy smiled and walked back to the host stand. Grant took a seat at the bar.\u003c/p\u003e\n\u003cp\u003e“That,” he announced, “was really cool. Good work, Abby!”\u003c/p\u003e\n\u003cp\u003e“Thank you, thank you. Now, I’m finally going to get out of this ridiculous outfit!”\u003c/p\u003e\n\u003cp\u003eLeaving them at last, she ran up the stairs as quickly as she could, encumbered by the skirts that had defined her as Missy Tweed for a few hours.\u003c/p\u003e\n\u003cp\u003eHelen was doing much better.\u003c/p\u003e\n\u003cp\u003eWhen Malachi arrived, her police guard was seated in the hallway, reading the newspaper.\u003c/p\u003e\n\u003cp\u003eAngela Hawkins was in the room with Helen, as were her coworkers, Jack and Blake. They were still in their pirate attire from the morning sail of the Black Swan; Malachi assumed that, like Dirk, they usually took the two hours between sailings of the “pirate” vessel to either have lunch or get their errands done.\u003c/p\u003e\n\u003cp\u003eHelen seemed to be beaming; she was, he thought, maybe a year or two older than Blake—the one who was so obviously—and awkwardly—in love with her.\u003c/p\u003e\n\u003cp\u003eBut that afternoon, she was thrilled by his attention.\u003c/p\u003e\n\u003cp\u003e“Malachi!” she said, greeting him with a warm smile.\u003c/p\u003e\n\u003cp\u003eHe bent down to kiss her cheek. “Helen, you look wonderful.”\u003c/p\u003e\n\u003cp\u003e“I’m feeling good,” she said. “And the doctor said I’m doing well, right, Angela?”\u003c/p\u003e\n\u003cp\u003e“He said you’re almost ready to go home.”\u003c/p\u003e\n\u003cp\u003eHelen frowned. “You need to talk to me again, don’t you, Malachi?”\u003c/p\u003e\n\u003cp\u003e“If you don’t mind,” Malachi said. “When you’re ready.”\u003c/p\u003e\n\u003cp\u003e“I think that’s a hint to the two of us, Jack, but that’s okay,” Blake said. He’d been sitting by her on the other side of the bed. “Jack and I have to get back for the afternoon sail of the old Black Swan. We’ll be back, Helen.”\u003c/p\u003e\n\u003cp\u003e“I may not be. Hot date tonight.” Jack grinned. “With a pretty, pretty—and I do mean pretty!—redhead who sailed this morning. She agreed to do me the honor of joining me for dinner this evening. So, my beloved colleagues, it might be tomorrow before I stop by. But I’ll bring you delicious details!”\u003c/p\u003e\n\u003cp\u003e“Get out of here! If she’s smart, there won’t be that many details!” Helen joked.\u003c/p\u003e\n\u003cp\u003e“I’ll be here tonight,” Blake promised.\u003c/p\u003e\n\u003cp\u003e“Thanks. You really help the time pass,” Helen said softly.\u003c/p\u003e\n\u003cp\u003eBlake beamed. He and Jack left, waving as they walked out the door.\u003c/p\u003e\n\u003cp\u003eMalachi sat next to Helen. Angela sat on her other side, taking her hand. “You’re very strong, Helen.” Angela smiled, encouraging her. She looked over at Malachi. “A therapist was in to see her. She’s doing brilliantly, he says.”\u003c/p\u003e\n\u003cp\u003e“He also said I’ll never forget,” Helen told him. “And he said...he said I’ll be able to go forward again, have a good time, even have a relationship again.”\u003c/p\u003e\n\u003cp\u003e“Of course you will. We’ll get him, and you’ll know we did it because of you. You’ll know you saved others. He had you, but you beat him, Helen,” Malachi said.\u003c/p\u003e\n\u003cp\u003eShe gave him a weak smile. “It’s strange. I always thought I was so liberal. But if I had a gun and he was in front of me, I’d want to shoot him. I want him strung up, I want his skin flayed from his body...” Her voice broke.\u003c/p\u003e\n\u003cp\u003e“That’s human nature, Helen.” Malachi spoke as reassuringly as he could.\u003c/p\u003e\n\u003cp\u003e“Is it? I hope so.”\u003c/p\u003e\n\u003cp\u003e“Helen, I’m not a hypnotist or any kind of therapist. But I want you to try to relax when we talk,” Malachi said. “Angela is here. We’re both here. You’re protected. I know it hurts, that it’s painful, but I really need you to try to remember every detail.”\u003c/p\u003e\n\u003cp\u003e“I wish I could remember more,” she said. “I went into the church...and I remember the searing pain in my head—and then nothing.”\u003c/p\u003e\n\u003cp\u003e“And then, the lapping of water against a cabin. You were in a ship’s cabin.”\u003c/p\u003e\n\u003cp\u003e“I think so,” Helen said.\u003c/p\u003e\n\u003cp\u003e“What made you think it was a ship’s cabin?” Malachi asked.\u003c/p\u003e\n\u003cp\u003e“There was a lot of wood. Paneling. I was in a bunk.”\u003c/p\u003e\n\u003cp\u003e“Big cabin or little cabin?”\u003c/p\u003e\n\u003cp\u003e“Tight...it was a tight cabin. When he was in it, I could feel him as soon as he came in.” She kept her eyes closed.\u003c/p\u003e\n\u003cp\u003e“And you remember a sound?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Tap, tap, tap?”\u003c/p\u003e\n\u003cp\u003eShe frowned. “Yes, it was an odd sound.”\u003c/p\u003e\n\u003cp\u003e“Was he with you all the time when you heard it?”\u003c/p\u003e\n\u003cp\u003e“No...sometimes, he wasn’t.” She thought for a moment. “But...when I heard it, I was so afraid.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“It meant he was coming for me.”\u003c/p\u003e\n\u003cp\u003eUp in the apartment, Abby turned on the television in the living area for company while she ran down the little hall to her room and changed out of her pirate clothing. She chose jeans, a T-shirt and finally a denim jacket—a perfect way to hide the Glock she didn’t intend to leave behind.\u003c/p\u003e\n\u003cp\u003eShe was anxious to call Malachi and see what was going on. Had they found something that proved Aldous could be the killer?\u003c/p\u003e\n\u003cp\u003eHad Aldous confessed?\u003c/p\u003e\n\u003cp\u003eShe felt shaky and weak considering the possibility. Aldous seemed like a good man, as well as a powerful one. He was rich, but he’d always spent a lot of time working for various causes. How could a good man, who was willing to donate his money and his labor when needed, prove to be such a heinous criminal?\u003c/p\u003e\n\u003cp\u003eBut it made her shake, too—thinking that it could be someone she’d known most of her life. That she might have gone to school with someone who’d grown up to be a killer.\u003c/p\u003e\n\u003cp\u003eAs she came down the hallway and went back into the living room area, she heard the television. She suddenly stopped; a newscaster, a sleek, attractive blonde, was speaking from an anchor desk while an insert on the screen showed a scene at the police station. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-alive-krewe-of-hunters-10/page-47.html","bookId":2284,"creation":"Oct 5, 2019 5:48:37 PM","modification":"Oct 5, 2019 5:48:37 PM"}
