{"id":91187,"no":6,"title":"Page 6","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe held the folded American flag that had draped his coffin, since he’d seen military service in two wars, and a single rose. She was supposed to drop the rose on the coffin, allow others to do the same thing and officially end the burial of a man who had become an icon.\u003c/p\u003e\n\u003cp\u003eIt seemed that half of Savannah had come out for the occasion. They needed to get back to their lives.\u003c/p\u003e\n\u003cp\u003eShe needed to figure out how to organize hers.\u003c/p\u003e\n\u003cp\u003eShe walked over to the coffin, which still sat above the ground; they wouldn’t lower it into the earth until she and the rest of the mourners were gone.\u003c/p\u003e\n\u003cp\u003eThe soprano from Gus’s church was singing “Amazing Grace” as they finished and Abby was aware that Macy—and several other people—were sniffing and trying to hold back sobs.\u003c/p\u003e\n\u003cp\u003eAbby didn’t cry; she’d cried herself out over the past week. She stood and touched the coffin and spoke to him within her own mind.\u003c/p\u003e\n\u003cp\u003eThank you, Gus. Love you, Gus. Thank you for loving me the way you did. You will always be a part of me, with me. I will never forget you....\u003c/p\u003e\n\u003cp\u003eShe set her rose on the coffin and stepped back, gazing into the crowd. As she’d expected, Blue Anderson was there, across from the coffin, a little to the left, behind Gus’s old cronies—Bootsie, Dirk and Aldous. The men had dressed in their best suits for the occasion. But even in their tailored and proper attire, they looked like pirates. Bootsie had his peg leg, of course, and Aldous was still bald, still wore his earring.\u003c/p\u003e\n\u003cp\u003eMaybe the pirate resemblance came from the fact that Blue Anderson, in his splendid frock coat and sweeping pirate hat, stood behind them.\u003c/p\u003e\n\u003cp\u003eShe stared gravely at Blue. He nodded to her, a gesture of consolation that somehow seemed reassuring.\u003c/p\u003e\n\u003cp\u003eFather McFey took her arm and led her from the burial site. A uniformed chauffeur waited to open the door to the black limo that would take her back to the Dragonslayer. Those who could join them would be there for a repast in honor of Gus.\u003c/p\u003e\n\u003cp\u003eIt was what he’d wanted; he had let his wishes be known in his will. He’d wanted to lie next to his wife and his son, Abby’s father, and he’d wanted “Amazing Grace” and Father McFey. He’d left explicit instructions. And then bring our friends back to the Dragonslayer. Please laugh with them and remember the wonderful events in my life. Celebrate for me, for I was blessed, and life comes to an end for us all.\u003c/p\u003e\n\u003cp\u003eShe turned before getting into the car. A very tall man she didn’t know leaned against another car, a silver SUV. He hadn’t come to the grave site, she thought. But he’d been watching—he’d watched the burial rites, just as he watched her now.\u003c/p\u003e\n\u003cp\u003eHe was interesting-looking, certainly. He appeared to be six-three or -four. He was appropriately dressed for a funeral in a dark suede jacket, white shirt and a dark vest. Black hair was neatly clipped, with one swatch that sat slightly low over his forehead. She couldn’t see his eyes because he was wearing sunglasses but she knew he was watching her.\u003c/p\u003e\n\u003cp\u003eAn old friend of Gus’s? Or a new one? Definitely someone she hadn’t met.\u003c/p\u003e\n\u003cp\u003eBut he hadn’t really taken part in the service. He’d stood at a distance, as if he had needed to watch—and still meant to be respectful. Odd, to say the least.\u003c/p\u003e\n\u003cp\u003e“Ms. Anderson?”\u003c/p\u003e\n\u003cp\u003eShe realized she’d been staring at him when the driver suggested that she enter the car.\u003c/p\u003e\n\u003cp\u003eShe was alone on the short drive back to the Dragonslayer. Macy had gone on ahead to see that they were set up for the reception to follow the service. Reception? No, party. Gus had insisted they celebrate his life, not the passing of it.\u003c/p\u003e\n\u003cp\u003eShe thought about the week since his death and the funeral. Many people considered that a long time, but there’d been an autopsy and she’d wanted to arrange for those who’d loved Gus—some of them from out of town—to show up for the service.\u003c/p\u003e\n\u003cp\u003eThe parking lot was half-full when the limo drove up to let Abby out. She wasn’t sure why she felt she needed more fortitude for Gus’s party than she had for the church or the graveside service. She knew a lot of people were going to cry—party or no—but she felt drained of tears, numb. Gus’s death was the end of her world as she’d known it.\u003c/p\u003e\n\u003cp\u003e“Hey!”\u003c/p\u003e\n\u003cp\u003eWhen she walked in, she almost smiled. The first people she saw were Gus’s old cohorts already at the bar. Bootsie, Dirk and Aldous.\u003c/p\u003e\n\u003cp\u003eThey had teacups in front of them but she knew the tea had been spiked with whiskey—Gus’s favorite drink and cure-all.\u003c/p\u003e\n\u003cp\u003eThey swung their stools around to greet her, all raising their cups. “Abby!”\u003c/p\u003e\n\u003cp\u003eShe felt oddly as if they were saluting a monarch. Maybe they were afraid she’d oust them from their seats at the bar.\u003c/p\u003e\n\u003cp\u003e“Hey, guys,” she said.\u003c/p\u003e\n\u003cp\u003eAldous reached for something and came over to her. She noted the way his bald head shimmered in the tavern’s lights. His blue eyes seemed gray, sad, solemn.\u003c/p\u003e\n\u003cp\u003eHe’d collected another cup from the bar. “We had it ready for you,” he said. “We thought we’d have a private toast before you got caught up in all the craziness. Gus was one of a kind. A lot of people loved him. But I think we’re going to miss him the most, the four of us.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Aldous,” she said, taking the cup from him. She lifted it. “To Gus!”\u003c/p\u003e\n\u003cp\u003e“To Gus! Long may his legend live!” Bootsie said.\u003c/p\u003e\n\u003cp\u003eShe gave Aldous a kiss on the cheek and walked over to do the same with Bootsie and Dirk. “You guys all okay, workwise?” She looked specifically at Dirk. His “pirate” ship went out every day. Dirk loved to play the pirate master of ceremonies and he was very good at it.\u003c/p\u003e\n\u003cp\u003e“It’s handled. I have the crew taking care of everything. No way I wouldn’t honor Gus,” Dirk told her.\u003c/p\u003e\n\u003cp\u003eMacy came striding over to her. “Abby, the mayor wants to convey his condolences and the chief of police is here.” She glanced at the men. “If I can steal you away for a minute.”\u003c/p\u003e\n\u003cp\u003e“See you in a bit, guys,” she said as she accompanied Macy.\u003c/p\u003e\n\u003cp\u003eAnd so continued what already felt like a long day.\u003c/p\u003e\n\u003cp\u003eShe was cordial to the chief, despite the fact that she wasn’t feeling especially fond of the local police at the moment. She supposed she couldn’t blame them. Her insistence that something was wrong with the circumstances of an old man’s death couldn’t compare with some of the very real and obvious crimes they were facing.\u003c/p\u003e\n\u003cp\u003eAnd the autopsy did conclude that Gus had died of a heart attack, not surprising for someone of his age who wanted to crawl around in historic tunnels as if he were a young man.\u003c/p\u003e\n\u003cp\u003eBut that was the point they weren’t getting. Gus didn’t crawl around in tunnels!\u003c/p\u003e\n\u003cp\u003eFine. There was very little she could do about their lack of interest in the tunnels. She’d contacted the officer in charge of her assignment at Quantico, who didn’t seem to have much understanding of her situation. An old man had died. It happened; that was life. But, of course, she should take whatever time she needed and report in as soon as possible, let them know when she’d be returning.\u003c/p\u003e\n\u003cp\u003eAnd she’d probably be in a boatload of trouble when she did return for an assignment. Because she’d gone over her supervisor’s head to contact another FBI unit leader.\u003c/p\u003e\n\u003cp\u003eJackson Crow.\u003c/p\u003e\n\u003cp\u003eCrow was in charge of a special section of the agency; he and his people were based in a field office of their own in Arlington, Virginia. From there, they were sent across the country.\u003c/p\u003e\n\u003cp\u003eAt the regular offices, they were referred to as the “ghost busters.” Despite that reference, they were held in awe by most of the other agents. They had a spectacular record of solving cases. She knew about Jackson Crow because he was a legend at the agency; he’d solved cases with various units before being asked to form a special one dedicated to situations that were...out of the ordinary.\u003c/p\u003e\n\u003cp\u003eThey were officially known as the Krewe of Hunters. She assumed that was because the first assignment as a new unit had been in New Orleans, when the wife of a U.S. senator had mysteriously died.\u003c/p\u003e\n\u003cp\u003eAbby didn’t want any ghosts “busted.” She wanted someone to believe that her grandfather had been onto something, that he’d needed to speak with her for a very real reason. And from what she understood, while there were rumors about the Krewe agents having “special” abilities, they worked with evidence and cold hard facts. Even so, Jackson’s units had often been called in when cases involved historic properties that were supposedly haunted.\u003c/p\u003e\n\u003cp\u003eHeart attack or not, she was convinced Gus had been murdered. His heart had stopped because he’d been startled or come upon some sight so horrible that he’d died of shock. She hoped that her email to Jackson Crow, filled with information on the history of Savannah and the Dragonslayer, would bring him out to investigate. She wasn’t sure how she could make a federal case out of the death of a Georgian in Georgia, but she couldn’t let it rest. She owed Gus way more than that.\u003c/p\u003e\n\u003cp\u003eSo, as she greeted the local law and government personnel who’d turned out in respect for Gus, she was polite and circumspect. She moved from one to another, thanking them all.\u003c/p\u003e\n\u003cp\u003eShe didn’t mention again her belief that he’d been murdered. She didn’t need more pitying stares from those who thought she was a little crazy with grief—or suspected that, fresh from the academy, she’d try to create problems between federal and local law enforcement.\u003c/p\u003e\n\u003cp\u003eLuckily, the people she didn’t know didn’t stay long. An hour and a half later, she found herself at a table near the life-size image of Blue Anderson, still sipping the spiked tea Aldous had handed her, with Grant Green, the night manager, and a couple of her old friends, Roger English and Paul Westermark. She’d seen Roger and Paul portraying Blue Anderson and Scurvy Pete Martin when she’d arrived a week ago.\u003c/p\u003e\n\u003cp\u003e“I thought he was immortal,” Roger said, sighing. “Lord, I loved that man. He knew how to keep the fun and magic in history. When we were kids, remember, he’d let us dress up? Sometimes we’d pretend to be captives that Blue had taken. Or mates running around, trying to shanghai other men down to the ships.”\u003c/p\u003e\n\u003cp\u003e“Never, ever paid us late.” Paul smiled. “I remember during one of the storms that hit Savannah a few years back, Gus had us go and do a whole pirate day for a bunch of kids at one of the shelters. He just did it out of the goodness of his heart.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-alive-krewe-of-hunters-10/page-6.html","bookId":2284,"creation":"Oct 5, 2019 5:48:37 PM","modification":"Oct 5, 2019 5:48:37 PM"}
