{"id":89123,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“So how do you two know each other?” Sarah asked, looking from Tim to Cary.\u003c/p\u003e\n\u003cp\u003e“Mr. Griffin had a bit of a weak spell one day when we were out walking…. I was trying to flag someone down for help when Tim came by. Nothing better than being helped by an officer of the law,” Cary said with a smile.\u003c/p\u003e\n\u003cp\u003e“Tell us about yourself, Cary,” Sarah suggested.\u003c/p\u003e\n\u003cp\u003eCary explained that she was from North Dakota and had gone to school in Chicago, but she loathed the winters. She’d started looking for nursing positions in warmer places, and when she’d gotten the offer to come to Florida, she’d jumped on it. She’d only been living there for a little over a year.\u003c/p\u003e\n\u003cp\u003eDrinks kept coming, then eventually food, and the talk was casual. Then Renee yawned and said she needed some sleep. Barry didn’t move until she stood and tapped him on the shoulder. Then he started and rose to join her, setting down money for his part of the bill. The two of them said goodbye and left, but Caleb caught Barry glancing back for one last look at Cary as he was heading for the door.\u003c/p\u003e\n\u003cp\u003e“I’ve got to go, too. I need a good night’s sleep,” Sarah said, rising.\u003c/p\u003e\n\u003cp\u003eCaleb rose, as well. “I’ll walk you,” he said.\u003c/p\u003e\n\u003cp\u003eShe tensed slightly, and for a moment he thought she was going to argue with him, but she seemed to think better of it and simply said, “Thanks.”\u003c/p\u003e\n\u003cp\u003eTim leaned back in his chair, staring up at Caleb. “Before you go…how was your day? Find out anything?” he asked.\u003c/p\u003e\n\u003cp\u003e“I’ll call you first,” Caleb assured him, thinking that Tim looked like the perfect image of the overworked and weary cop at that moment.\u003c/p\u003e\n\u003cp\u003e“Yeah. Come see me. I’d just like a rundown of everything you’re doing.”\u003c/p\u003e\n\u003cp\u003e“Sure,” Caleb agreed.\u003c/p\u003e\n\u003cp\u003e“Well, good night, all,” Sarah said. She added money for the bill, and Caleb did the same.\u003c/p\u003e\n\u003cp\u003e“Good night,” Caroline said, grinning—no doubt pleased with her matchmaking efforts and relieved that he wasn’t staying to hang out with the perfect blond newcomer.\u003c/p\u003e\n\u003cp\u003eShe moved closer to Will.\u003c/p\u003e\n\u003cp\u003eThey waved and left, and Caleb noticed that Tim Jamison didn’t return the gesture or even look up. He was too busy staring morosely into his beer.\u003c/p\u003e\n\u003cp\u003e“Where am I walking you?” Caleb asked Sarah as they reached the street.\u003c/p\u003e\n\u003cp\u003eShe smiled. “You’re not going to tell me that I shouldn’t go and stay in my own carriage house, are you?” she asked.\u003c/p\u003e\n\u003cp\u003e“I could, but it wouldn’t do any good, would it?”\u003c/p\u003e\n\u003cp\u003eWalking at his side, she grinned wryly. “No,” she admitted. “I’d just get more adamant about it being my house.”\u003c/p\u003e\n\u003cp\u003e“You have good locks on your doors, and you won’t make the mistake of leaving a door unlocked again, will you?” he asked.\u003c/p\u003e\n\u003cp\u003e“No,” she said seriously, and added a quiet, “I was lucky today.”\u003c/p\u003e\n\u003cp\u003eThey walked in silence for a few minutes, and then she suddenly said, “You did learn something today, didn’t you?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Very insightful. Okay, yes, I’m pretty sure my missing girl was here. And that the same person or persons snatched her and Winona Hart. Now it’s your turn to answer me. What freaked you out so much about Mr. Griffin’s visit?”\u003c/p\u003e\n\u003cp\u003eShe thought hard for a minute.\u003c/p\u003e\n\u003cp\u003e“His whole bit about the house being evil…I really don’t believe that a house can be evil, but bad things did happen there, and there was just something so…so creepy about the way he talked about it.”\u003c/p\u003e\n\u003cp\u003eShe still wasn’t telling him everything, he thought. But he wasn’t going to press her for the moment. They were actually beginning to make a connection, and he didn’t want her closing any doors in his face.\u003c/p\u003e\n\u003cp\u003eThey reached her walkway. The house looked old and, yes, spooky in the moonlit darkness. There seemed to be a lot of trash around the yard now, too, which was unusual for the area. Then again, a lot of people had come by to ogle the place today, and they were probably responsible for all the trash.\u003c/p\u003e\n\u003cp\u003eThey bypassed the main house and headed for the carriage house, where Sarah took out her keys. “You can check the place out for me, if you want,” she said lightly, but he could read the need for reassurance in her tone.\u003c/p\u003e\n\u003cp\u003e“Certainly,” he assured her.\u003c/p\u003e\n\u003cp\u003eThe carriage-house-turned-apartment was definitely impressive, Caleb thought. There was still a slight feel of decaying grandeur about it, but there was fresh paint on the walls and a huge four-poster in the center of the single large room. She’d put in a wide screen TV, a sofa sat between it and the foot of the bed, and a small kitchenette had been built into one corner.\u003c/p\u003e\n\u003cp\u003e“Very nice,” he told her.\u003c/p\u003e\n\u003cp\u003e“Thanks. There are two smaller rooms upstairs. Once I get the place going as a B and B, I can rent it out to couples and families.”\u003c/p\u003e\n\u003cp\u003eHe opened the bathroom door, revealing both a claw-foot tub and a new glass-enclosed shower stall.\u003c/p\u003e\n\u003cp\u003eThere was obviously no one lurking in the bathroom.\u003c/p\u003e\n\u003cp\u003eHe checked the closet and looked under the bed, then went upstairs to make sure everything there was secure. When he came back down, he checked the lock on the single window, which had been added when the carriage doors had been removed. “Everything looks good to me. Bolt your door and keep your cell phone close, and you’ll be fine,” he advised.\u003c/p\u003e\n\u003cp\u003e“I will. I don’t see Mr. Griffin trying to break down my door, though,” she said with a hint of a smile echoed in the dazzling silver of her eyes.\u003c/p\u003e\n\u003cp\u003eHe walked past her to the door, careful to keep his distance from her. “Good night. You can call me any time, you know.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“I’m not a mass murderer in investigator’s clothing, you know. I work for Adam Harrison. Trust me, his background checks would do any intelligence agency proud.”\u003c/p\u003e\n\u003cp\u003e“I’m sure that’s true,” she said, ready to close the door behind him.\u003c/p\u003e\n\u003cp\u003eThe thing was, he could tell that she did trust Adam. She just didn’t trust him. Not yet.\u003c/p\u003e\n\u003cp\u003eThe carriage house was like her own little castle. She had kept the historical tone of the house, but with just one nicely updated room, no one could sneak up on her, not with only one window and one door, both of them well-secured.\u003c/p\u003e\n\u003cp\u003eSarah wanted to sleep, but she felt wound up. She didn’t want to admit that Mr. Griffin had managed to send a few chills down her spine. She wanted to blame his bizarre behavior on dementia, then realized what a cruel thought that was. She found herself hoping instead that it was the pain that never went away that made him so certain there were ghosts in the house—and that they would talk to her.\u003c/p\u003e\n\u003cp\u003eAlso, she reminded herself, this was the carriage house. She was certain that no equine ghosts were going to come back to life and haunt her.\u003c/p\u003e\n\u003cp\u003eShe scrubbed her face, showered, washed her hair and, as it dried, gave herself a pedicure and manicure. To make sure she didn’t catch the news, she turned to a cable channel that showed nothing but old movies. The African Queen came on and seemed like a good choice.\u003c/p\u003e\n\u003cp\u003eFinally she turned off everything but the bathroom light, determined to get some sleep. It didn’t help. Her mind continued to race. She kept recalling the arrival of Terrence Griffin III and everything he had said to her, and when she wasn’t thinking about him, she found herself thinking about Caleb. She hadn’t even considered a relationship since Clay’s death, and she certainly wasn’t envisioning a deathless romance with the man, but she was only human, and she was imagining sex. She groaned, determined not to imagine the man naked or think about his hands touching her, and she would absolutely not hear the deep, rich tone of his voice in her dreams.\u003c/p\u003e\n\u003cp\u003eShe slept, and woke, and slept again, tossing and turning until she woke herself up again. She sat up at last, ready to punch her pillow into a more comfortable lump.\u003c/p\u003e\n\u003cp\u003eInstead she went dead still, a scream frozen in her throat. This had to be a nightmare, she told herself. The kind where danger came, and there was nothing you could do about it, because panic had seized you and deprived you of the ability to move.\u003c/p\u003e\n\u003cp\u003eThere was a man standing at the foot of her bed.\u003c/p\u003e\n\u003cp\u003eOr was there?\u003c/p\u003e\n\u003cp\u003eWas she dreaming? She had to be, because he was dressed in the kind of outfit Barry wore at work. Except…\u003c/p\u003e\n\u003cp\u003eHe didn’t look like someone wearing a costume, the way Barry always did. There was something authentic about him. Maybe he wore the vest and frock coat with more comfort. Maybe it was the tilt of his sweeping hat. Maybe it was his face, his eyes, haunted, distant and oddly familiar.\u003c/p\u003e\n\u003cp\u003eShe let out a croak, desperately trying to scream. Because dream or reality, he was standing at the foot of her bed and she was scared.\u003c/p\u003e\n\u003cp\u003eBut she never had a chance to scream, because he spoke then, his tone full of pain.\u003c/p\u003e\n\u003cp\u003e“I didn’t do it. I loved her,” he said.\u003c/p\u003e\n\u003cp\u003eShe continued to stare, still caught in a twilight world between life and dreams. He looked different and yet…so familiar. He had long sideburns, a goatee and moustache, and long tawny hair, but she couldn’t escape the sense that she should recognize him.\u003c/p\u003e\n\u003cp\u003e“I loved her. Do you understand?” He sounded so agitated. “But I had to leave.”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes, clenched them shut, and furiously commanded herself to awaken.\u003c/p\u003e\n\u003cp\u003eWhen she opened her eyes, he was gone.\u003c/p\u003e\n\u003cp\u003eShe glanced at her bedside clock. It was 5:00 a.m. It must have been a dream, brought on by a combination of all that had been happening and Mr. Griffin’s insistence that her house was haunted.\u003c/p\u003e\n\u003cp\u003eShe lay back down and closed her eyes, then opened them again and looked toward the foot of her bed. There was nothing there. Of course not. She had imagined the man there, imagined his claim that he hadn’t done it.\u003c/p\u003e\n\u003cp\u003eHadn’t done what?\u003c/p\u003e\n\u003cp\u003ePut the bones in her walls?\u003c/p\u003e\n\u003cp\u003eShe groaned and closed her eyes.\u003c/p\u003e\n\u003cp\u003eWorthless. She looked at the clock again. It was 5:03 a.m.\u003c/p\u003e\n\u003cp\u003eIt didn’t matter. She wasn’t going to get back to sleep. She threw off her covers and, swearing at herself, Caleb and Mr. Griffin, she headed into the shower. It bothered her that her memory of the man at the foot of her bed was so perfectly clear. She could remember exactly what he had looked like.\u003c/p\u003e\n\u003cp\u003eSo familiar, and yet… \u003c/p\u003e","sourceLink":"https://allnovel.net/unhallowed-ground-harrison-investigation-7/page-19.html","bookId":2273,"creation":"Oct 5, 2019 5:33:47 PM","modification":"Oct 5, 2019 5:33:47 PM"}
