{"id":89132,"no":29,"title":"Page 29","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Point taken,” he assured her, then shook his head sadly.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid this means you’re not going to barge in on me again.”\u003c/p\u003e\n\u003cp\u003e“I upset Bertie. I think I’d better behave from now on,” she said, turning away. “I need to explain things to her, and apologize.”\u003c/p\u003e\n\u003cp\u003e“Show her the picture. She’ll understand,” he said.\u003c/p\u003e\n\u003cp\u003eShe smiled and started walking. He stayed by her side, shoving his hands into his pockets to keep himself from reaching for her, determined not to act like a jackass and ruin this tenuous connection between them. The night was warm, but with a sea breeze that stirred her hair as they walked and carried a tantalizing whiff of her perfume to him. He found himself noticing everything about her. The silky sheen of her hair and the way that it swayed on her shoulders as she walked.\u003c/p\u003e\n\u003cp\u003eThe way she walked.\u003c/p\u003e\n\u003cp\u003eThe way she was built.\u003c/p\u003e\n\u003cp\u003eHer skin was smooth, and she was wearing a sleeveless knit dress that revealed a lot of that skin, and molded her curves so tightly that he had to swallow. Hard.\u003c/p\u003e\n\u003cp\u003eShe had a great mouth, generous and well-defined. Beautiful lips. Perfect nose. He remembered how it had felt to have her underneath him that morning, the feel of her flesh against his.\u003c/p\u003e\n\u003cp\u003eHe almost tripped over a cobblestone as they moved down Avila, ready to make the right that would lead them to St. George.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes, just clumsy,” he assured her.\u003c/p\u003e\n\u003cp\u003e“It was strange that day, when I saw you just staring at the house,” she said.\u003c/p\u003e\n\u003cp\u003e“It’s a beautiful old house,” he said.\u003c/p\u003e\n\u003cp\u003e“But it seemed as if you were drawn to it.”\u003c/p\u003e\n\u003cp\u003eI’m drawn to its owner.\u003c/p\u003e\n\u003cp\u003e“I like historic architecture,” he said lamely. They had reached her house, and stood staring up at it. The mansion had been magnificently constructed. That night, however, he felt as if the darkened windows were eyes, staring back at them. It was as if something brooding was living inside the house. He gave himself a mental shake; he wasn’t prone to whimsy or flights of fantasy. It was a house.\u003c/p\u003e\n\u003cp\u003eA house and nothing more. But history happened in houses. Events occurred. The good, the bad and the very ugly.\u003c/p\u003e\n\u003cp\u003eAdam said there were two kinds of hauntings. Residual, the events of the past happening over and over again. And active, or intelligent, when spirits remained behind, chained by the trauma of their deaths. They could even learn to move objects and travel from place to place, which was why Abe Lincoln could be seen both striding the halls of the White House, or sitting in the seat where he’d been shot at Ford’s Theatre.\u003c/p\u003e\n\u003cp\u003eHe couldn’t communicate with ghosts himself, but he worked with a number of intelligent and completely sane people who did speak with those long gone.\u003c/p\u003e\n\u003cp\u003eBut this house…\u003c/p\u003e\n\u003cp\u003eIt was as if the house itself wanted to tell him something.\u003c/p\u003e\n\u003cp\u003eHe was suddenly anxious to get back inside.\u003c/p\u003e\n\u003cp\u003eBut not tonight.\u003c/p\u003e\n\u003cp\u003e“Caleb?” Sarah said softly, studying him.\u003c/p\u003e\n\u003cp\u003eHe turned to her. Her eyes were so wide and concerned.\u003c/p\u003e\n\u003cp\u003eSilver and beautiful.\u003c/p\u003e\n\u003cp\u003e“Let’s get you safely inside, okay?” he suggested.\u003c/p\u003e\n\u003cp\u003eAnd maybe, just maybe, I can stay awhile, he thought.\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eS he walked ahead of him to the carriage house, taking her keys from her purse. She opened the door, and he followed her inside, where she turned on a light. The room was neat and clean. He walked over to the bathroom and went inside, came back out and, shrugging sheepishly, ducked down and looked under the bed.\u003c/p\u003e\n\u003cp\u003eShe turned on the television. She wanted the noise, the illusion of company, he realized.\u003c/p\u003e\n\u003cp\u003e“Great movie, From Here to Eternity,” she commented.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eHe was still standing next to the bed.\u003c/p\u003e\n\u003cp\u003e“Would you like something to drink? I don’t have a lot here—beer or white wine. Soda, coffee, tea.”\u003c/p\u003e\n\u003cp\u003eHe could tell that she didn’t want him to leave. She was afraid, but she didn’t want to admit it. “Sure. I’m not much for wine, so I’ll have a beer.”\u003c/p\u003e\n\u003cp\u003e“Have a seat. The sofa is comfortable,” she told him, heading for the refrigerator and looking relieved.\u003c/p\u003e\n\u003cp\u003eHe sat, and she brought over two beers and sat on the opposite end of the couch, facing him. Then she took a swig of her beer, smiling shyly.\u003c/p\u003e\n\u003cp\u003eWas it possible to envy a beer bottle because those lips had been around it? he wondered.\u003c/p\u003e\n\u003cp\u003e“So…how did you end up working with Adam Harrison?” she asked.\u003c/p\u003e\n\u003cp\u003e“Adam found me,” Caleb said, then turned the subject to her. “How did you meet Adam? And by the way, I’m glad you did—you wouldn’t trust me as far as you could throw me if it weren’t for Adam.”\u003c/p\u003e\n\u003cp\u003eShe flushed and looked down for a moment. “Southerners,” she said. “We’re very hospitable, but that doesn’t mean we actually trust outsiders. ”\u003c/p\u003e\n\u003cp\u003e“I’m a Southerner, too,” he reminded her. “Born and bred in Virginia.”\u003c/p\u003e\n\u003cp\u003e“That’s awfully far north,” she said. “That’s where I met Adam, though. In Virginia. There was some trouble at a dig outside Fredericksburg—I was there taking notes and sketching finds. I met Adam when he came to see the director. Harrison Investigations had been hired to stop the weird things that were happening—tools disappearing, then reappearing, strange lights in the middle of the night, stuff like that. Even the newspapers had picked up on it and were joking that maybe the dig was haunted or cursed or something. Adam and his staff caught some college kids who had been creating all the trouble—no curses going on, just pranks. But my boss told me then that Harrison Investigations even gets called in by the government—quietly—to…look into weird events.”\u003c/p\u003e\n\u003cp\u003eCaleb admitted, “It’s true. He has an amazing network of people located all over the country. He brings the right person in on the right case every time.”\u003c/p\u003e\n\u003cp\u003e“Does he ever find that…the rumors are true? That something…unreal is going on?”\u003c/p\u003e\n\u003cp\u003e“Some of the people who work for him seem to have an affinity for…I don’t know, communicating with the…other side, I guess you’d call it. And yes, some of them do have what you might call ESP, but that just stands for extrasensory perception. Seeing is perception, touching…but scientists know the brain has much more capacity than the average person utilizes, and I think that’s what ESP is, just utilizing those parts of the brain.”\u003c/p\u003e\n\u003cp\u003e“What about you?”\u003c/p\u003e\n\u003cp\u003e“Me? I have a way of mentally rebuilding a crime scene. I’m not sure it’s ESP, more just a different way to use logic by relying on my subconscious.”\u003c/p\u003e\n\u003cp\u003e“Logic. I like logic. And the fact that we don’t utilize all our mental capacities, that makes sense to me. The brain can take us by surprise, like my dream last night.”\u003c/p\u003e\n\u003cp\u003eShe was looking at him, smiling. Her lips were damp, her eyes soft and bright. And she was standing so close.\u003c/p\u003e\n\u003cp\u003eIn the end, it must have been the perfume.\u003c/p\u003e\n\u003cp\u003eA sound escaped his lips, a groan, and he plucked the beer bottle out of her hand, set it on the side table alongside his own and pulled her into his arms. He met her eyes again. “I didn’t exactly barge in,” he said huskily, “but this bedroom will do just fine.”\u003c/p\u003e\n\u003cp\u003eHe waited, a heartbeat, a pulse, giving her the chance to pull away.\u003c/p\u003e\n\u003cp\u003eThere were things he could say. Inane assurances that he wouldn’t leave if she was afraid to be alone, even if they just sat and talked or watched TV, or just passed the time in silence.\u003c/p\u003e\n\u003cp\u003ePeople came together for lots of reasons, not all of them emotional. A lot of the time it was just basic biology, the laws of attraction. Whatever this was had begun to simmer the first time he had seen her, the first time he had heard her speak, the first time her eyes met his.\u003c/p\u003e\n\u003cp\u003eShe reached up, her fingers molding his jaw, her eyes filled with curiosity and fascination. The stroke of her fingers against his flesh felt like flickers of fire, and her eyes went smoke-gray with pure sensuality, and he leaned forward, into her, hesitated, his mouth just a breath away. He watched her lips curve into a half smile as she waited. At last he kissed her and found her lips everything he’d imagined they would be. Holding her in his arms was like holding the essence of life and heat, and every drop of blood in him began to steam, slowly and mercilessly. Sensation rioted through him as their mouths met, the touch igniting an eruption of hunger and desire. He pulled her more firmly into his arms as their mouths parted, then met again, as her lips surrendered fully to his and their tongues began to parry in exquisite exploration. He felt the flesh of her neck and shoulders beneath his fingers, the teasing touch of her hair against his flesh. Her arms curled around his neck, and she seemed almost a part of him, as if she could never be close enough.\u003c/p\u003e\n\u003cp\u003eShe pulled away and stood, looked at him for a long moment, then walked away to turn off the light.\u003c/p\u003e\n\u003cp\u003eThe faint glow from the television bathed the room in a soft, velvet glow as she walked over to the bed and let her dress fall to the floor.\u003c/p\u003e\n\u003cp\u003eHe stood, too, stripping his shirt over his head as he strode over to her, then took her back into his arms. The naked flesh of her breasts, firm against his chest, sent an infusion of fire streaking through him like lightning, straight to his loins. The scent of her perfume, the way it seemed to steam from her skin, was almost unbearable. He buried his face against her neck, kissed the delicate flesh, and fought for control. Their mouths met once again in a passionate kiss that went deep, that intimated all kinds of other things, and aroused and stoked the fire that was burning so high and fast between them. He trailed his fingers down her spine, cupped and cradled her buttocks, drew her closer still. Her fingers scratched a path down his back, pressing, teasing, arousing. Still fused together at the lips, they fell onto the bed, and, breathlessly, he rose above her.\u003c/p\u003e\n\u003cp\u003eThere were a million things he could have said, but nothing rose to his lips.\u003c/p\u003e\n\u003cp\u003eHer words were all in her eyes. Silver smoke caught in shadow. Open, wide, inviting.\u003c/p\u003e\n\u003cp\u003eHe wasn’t prone to flights of fantasy, especially where romance was concerned, but…suddenly it seemed as if he had known her forever, loved her forever. Not just wanted her. Wanting was basic biology. Wanting could be eased by a stranger who would never be seen or even thought of again. This was something different—he almost pulled back to give himself time to understand this feeling of intense connection, of suddenly, unbelievably, realizing that he loved someone he barely knew, that he needed to be with her and protect her against all dangers…. \u003c/p\u003e","sourceLink":"https://allnovel.net/unhallowed-ground-harrison-investigation-7/page-29.html","bookId":2273,"creation":"Oct 5, 2019 5:33:47 PM","modification":"Oct 5, 2019 5:33:47 PM"}
