{"id":28285,"no":39,"title":"XIV. SOMETHING ELSE.","content":"\u0026nbsp;What is restriction?\" \n\u003cdiv\u003e\n \"It is partial prohibition.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is prohibition?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Absolute restriction.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So that what holds true of the one, holds true of the other?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; the difference is only one of degree. There is between them the same relation as there is between a circle and the arc of a circle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, if prohibition is bad, restriction cannot be good?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No more than the arc can be correct if the circle is irregular.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is the name which is common to restriction and prohibition?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Protection.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is the definitive effect of protection?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To exact from men a greater amount of labour for the same result.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why are men attached to the system of protection?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because as liberty enables us to obtain the same result with less labour, this apparent diminution of employment frightens them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why do you say apparent?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because all labour saved can be applied to something else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That I cannot specify, nor is there any need to specify it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because if the sum of satisfactions which the country at present enjoys could be obtained with one-tenth less labour, no one can enumerate the new enjoyments which men would desire to obtain from the labour left disposable. One man would desire to be better clothed, another better fed, another better educated, another better amused.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Explain to me the mechanism and the effects of protection.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is not an easy matter. Before entering on consideration of the more complicated cases, we must study it in a very simple one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take as simple a case as you choose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You remember how Robinson Crusoe managed to make a plank when he had no saw.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; he felled a tree, and then, cutting the trunk right and left with his hatchet, he reduced it to the thickness of a board.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And that cost him much labour?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fifteen whole days\u0027 work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what did he live on during that time?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He had provisions.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What happened to the hatchet?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was blunted by the work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but you perhaps do not know this: that at the moment when Robinson was beginning the work he perceived a plank thrown by the tide upon the seashore.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Happy accident! he of course ran to appropriate it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That was his first impulse; but he stopped short, and began to reason thus with himself:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027If I appropriate this plank, it will cost me only the trouble of carrying it, and the time needed to descend and remount the cliff.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027But if I form a plank with my hatchet, first of all, it will procure me fifteen days\u0027 employment; then my hatchet will get blunt, which will furnish me with the additional employment of sharpening it; then I shall consume my stock of provisions, which will be a third source of employment in replacing them. Now, labour is wealth. It is clear that I should ruin myself by appropriating the shipwrecked plank. I must protect my personal labour; and, now that I think of it, I can even increase that labour by throwing back the other plank into the sea.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But this reasoning was absurd.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt. It is nevertheless the reasoning of every nation which protects itself by prohibition. It throws back the plank which is offered it in exchange for a small amount of labour in order to exert a greater amount of labour. It is not in the labour of the Customhouse officials that it discovers a gain. That gain is represented by the pains which Robinson takes to render back to the waves the gift which they had offered him. Consider the nation as a collective being, and you will not find between its reasoning and that of Robinson an atom of difference.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did Robinson not see that he could devote the time saved to something else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As long as a man has wants to satisfy and time at his disposal, there is always something to be done. I am not bound to specify the kind of labour he would in such a case undertake.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see clearly what labour he could have escaped.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I maintain that Robinson, with incredible blindness, confounded the labour with its result, the end with the means, and I am going to prove to you...\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is no need. Here we have the system of restriction or prohibition in its simplest form. If it appear to you absurd when so put, it is because the two capacities of producer and consumer are in this case mixed up in the same individual.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let us pass on, therefore, to a more complicated example.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With all my heart. Some time afterwards, Robinson having met with Friday, they united their labour in a common work. In the morning they hunted for six hours, and brought home four baskets of game. In the evening they worked in the garden for six hours, and obtained four baskets of vegetables.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One day a canoe touched at the island. A good-looking foreigner landed, and was admitted to the table of our two recluses. He tasted and commended very much the produce of the garden, and before taking leave of his entertainers, spoke as follows:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Generous islanders, I inhabit a country where game is much more plentiful than here, but where horticulture is quite unknown. It would be an easy matter to bring you every evening four baskets of game, if you would give me in exchange two baskets of vegetables.\u0027\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At these words Robinson and Friday retired to consult, and the argument that passed is too interesting not to be reported in extenso.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Friday: What do you think of it?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Robinson: If we close with the proposal, we are ruined.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: Are you sure of that? Let us consider.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: The case is clear. Crushed by competition, our hunting as a branch of industry is annihilated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: What matters it, if we have the game?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Theory! it will no longer be the product of our labour.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: I beg your pardon, sir; for in order to have game we must part with vegetables.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Then, what shall we gain?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.:. The four baskets of game cost us six hours\u0027 work. The foreigner gives us them in exchange for two baskets of vegetables, which cost us only three hours\u0027 work. This places three hours at our disposal.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Say, rather, which are substracted from our exertions. In this will consist our loss. Labour is wealth, and if we lose a fourth part of our time, we shall be less rich by a fourth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: You are greatly mistaken, my good friend. We shall have as much game, and the same quantity of vegetables, and three hours at our disposal into the bargain. This is progress, or there is no such thing in-the world.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: You lose yourself in generalities! What should we make of these three hours?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: We would do something else.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Ah! I understand you. You cannot come to particulars. Something else, something else—this is easily said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: We can fish, we can ornament our cottage, we can read the Bible.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Utopia! Is there any certainty that we should do either the one or the other?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: Very well, if we have no wants to satisfy we can rest. Is repose nothing?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: But while we repose we may die of hunger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: My dear friend, you have got into a vicious circle. I speak of a repose which will subtract nothing from our supply of game and vegetables. You always forget that by means of our foreign trade nine hours\u0027 labour will give us the same quantity of provisions that we obtain at present with twelve.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R: It is very evident, Friday, that you have not been educated in Europe, and that you have never read the Moniteur Industriel. If you had, it would have taught you this: that all time saved is sheer loss. The important thing is not to eat or consume, but to work. All that we consume, if it is not the direct produce of our labour, goes for nothing. Do you want to know whether you are rich? Never consider the satisfactions you enjoy, but the labour you undergo. This is what the Moniteur Industriel would teach you. For myself, who have no pretensions to be a theorist, the only thing I look at is the loss of our hunting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: What a strange conglomeration of ideas! but...\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: I will have no buts. Moreover, there are political reasons for rejecting the interested offers of the perfidious foreigner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: Political reasons!\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Yes, he only makes us these offers because they are advantageous to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: So much the better, since they are for our advantage likewise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Then by this traffic we should place ourselves in a situation of dependence upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: And he would place himself in dependence on us. We should have need of his game, and he of our vegetables, and we should live on terms of friendship.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: System! Do you want me to shut your mouth?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: We shall see about that. I have as yet heard no good reason.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Suppose the foreigner learns to cultivate a garden, and that his island should prove more fertile than ours. Do you see the consequence?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: Yes; our relations with the foreigner would cease. He would send us no more vegetables, since he could have them at home with less labour. He would take no more game from us, since we should have nothing to give him in exchange, and we should then be in precisely the situation that you wish us in now.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R.: Improvident savage! You don\u0027t see that after having annihilated our hunting by inundating us with game, he would annihilate our gardening by inundating us with vegetables.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"F.: But this would only last till we were in a situation to give him something else; that is to say, until we found something else which we could produce with economy of labour for ourselves.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"R. Something else, something else! You always come back to that. You are at sea, my good friend Friday; there is nothing practical in your views.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The debate was long prolonged, and, as often happens, each remained wedded to his own opinion. But Robinson possessing a great ascendant over Friday, his opinion prevailed, and when the foreigner arrived to demand a reply, Robinson said to him—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027 Stranger, in order to induce us to accept your proposal, we must be assured of two things:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027 The first is, that your island is no better stocked with game than ours, for we want to fight only with equal weapons.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027 The second is, that you will lose by the bargain. For, as in every exchange there is necessarily a gaining and a losing party, we should be dupes, if you were not the loser. What have you got to say?\u0027\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027 Nothing,\u0027 replied the foreigner; and, bursting out a-laugh-ing, he regained his canoe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The story would not be amiss, if Robinson were not made to argue so very absurdly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He does not argue more absurdly than the committee of the Rue Hauteville.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh! the case is very different. Sometimes you suppose one man, and sometimes (which comes to the same thing) two men working in company. That does not tally with the actual state of things. The division of labour and the intervention of merchants and money change the state of the question very much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That may complicate transactions, but does not change their nature.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! you want to compare modern commerce with a system of barter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Trade is nothing but a multiplicity of barters. Barter is in its own nature identical with commerce, just as labour on a small scale is identical with labour on a great scale, or as the law of gravitation which moves an atom is identical with that same law of gravitation which moves a world.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So, according to you, these arguments, which are so untenable in the mouth of Robinson, are equally untenable when urged by our protectionists.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; only the error is better concealed under a complication of circumstances.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, pray, let us have an example taken from the present order of things.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With pleasure. In France, owing to the exigencies of climate and habits, cloth is a useful thing. Is the essential thing to make it, or to get it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A very sensible question, truly! In order to have it, you must make it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not necessarily. To have it, some one must make it, that is certain; but it is not at all necessary that the same person or the same country which consumes it should also produce it. You have not made that stuff which clothes you so well. France does not produce the coffee on which our citizens breakfast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I buy my cloth, and France her coffee.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Exactly so; and with what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But neither you nor France produce the material of money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We buy it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With our products, which are sent to Peru.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is then, in fact, your labour which you exchange for cloth, and French labour which is exchanged for coffee.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Undoubtedly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not absolutely necessary, therefore, to manufacture what you consume.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; if we manufacture something else which we give in exchange.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In other words, France has two means of procuring a given quantity of cloth. The first is to make it; the second is to make something else, and to exchange this something else with the foreigner for cloth. Of these two means, which is the best?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t very well know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it not that which, for a determinate amount of labour, obtains the greater quantity of cloth?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And which is best for a nation, to have the choice between these two means, or that the law should prohibit one of them, on the chance of stumbling on the better of the two?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It appears to me that it is better for the nation to have the choice, inasmuch as in such matters it invariably chooses right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The law, which prohibits the importation of foreign cloth, decides, then, that if France wishes to have cloth, she must make it in kind, and that she is prohibited from making the something else with which she could purchase foreign cloth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And as the law obliges us to make the cloth, and forbids our making the something else, precisely because that something else would exact less labour (but for which reason the law would not interfere with it) the law virtually decrees that for a determinate amount of labour, France shall only have one yard of cloth, when for the same amount of labour she might have two yards, by applying that labour to something else!\" \"But the question recurs, \u0027What else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And my question recurs, \u0027What does it signify?\u0027 Having the choice, she will only make the something else to such an extent as there may be a demand for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is possible; but I cannot divest myself of the idea that the foreigner will send us his cloth, and not take from us the something else, in which case we would be entrapped. At all events, this is the objection even from your own point of view. You allow that France could make this something else to exchange for cloth, with a less expenditure of labour than if she had made the cloth itself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Undoubtedly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There would, then, be a certain amount of her labour rendered inert?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but without her being less well provided with clothes, a little circumstance which makes all the difference. Robinson lost sight of this, and our protectionists either do not see it, or pretend not to see it. The shipwrecked plank rendered fifteen days of Robinson\u0027s labour inert, in as far as that labour was applied to making a plank, but it did not deprive him of it. Discriminate, then, between these two kinds of diminished labour—the diminution which has for effect privation, and that which has for its cause satisfaction. These two things are very different, and if you mix them up, you reason as Robinson did. In the most complicated, as in the most simple cases, the sophism consists in this: Judging of the utility of labour by its duration and intensity, and not by its results; which gives rise to this economic policy: To reduce the results of labour for the purpose of augmenting its duration and intensity.\" *\n\u003c/div\u003e \n\u003cdiv\u003e\n * See ch. ii. and iii. of Sophimes, first series; and\n\u003c/div\u003e \n\u003cdiv\u003e\n Harmonies économiques, ch. vi.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2879/79704.html","bookId":1159,"creation":"Aug 4, 2019 11:21:06 PM","modification":"Aug 4, 2019 11:21:06 PM"}
