{"id":95218,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWe still fit together—two mirrored halves.\u003c/p\u003e\n\u003cp\u003eI close my eyes against the twisted joy and pain and try to control my breathing and swallow my sobs but I can tell that she’s shaking too. I can feel her tears trailing over my skin.\u003c/p\u003e\n\u003cp\u003eFinally, she pulls away, her fingers tight around mine. She’s staring at my hands and she traces a thumb over my scars. I stay utterly still and hold my breath, waiting for her to say something. She finally looks up at me, her eyes following the fissures across my face. “Elias never mentioned …” She trails off and I look back at our hands. At how smooth and perfect her skin is. Especially against mine that’s so marred.\u003c/p\u003e\n\u003cp\u003eIt’s strange to hear her say Elias’s name. To think about them talking about me. For so long it’s felt like he’s belonged only to me—a desire so intense and hot burns inside me to know what they said. To know how Elias spoke about me.\u003c/p\u003e\n\u003cp\u003eI want to know why he didn’t mention my scars. Is he just so used to them that he doesn’t see them anymore? Or is he ashamed? Suddenly I’m hyperaware of each line along my face and down my neck, trailing over my arms, hip and thigh. Twisting around my knee and ankle.\u003c/p\u003e\n\u003cp\u003e“What happened?” she asks softly. It’s a question I’ve gotten so many times before and I always brush it away. But with my sister, I don’t hear the horror in her voice. I hear only the sadness that something so painful could have happened to her twin.\u003c/p\u003e\n\u003cp\u003eI swallow a few times—I’m not used to anyone but Elias caring about me like that. Not sure how to handle it.\u003c/p\u003e\n\u003cp\u003eAnd then I tell her about Elias and me. About where we went after we left her on the path—how we got lost and couldn’t find our way back to the village and eventually discovered a way out of the Forest and to the Dark City. How I fell into a patch of barbed wire when I was exploring the tunnels for artifacts and how Elias refused to let me go down into them ever again.\u003c/p\u003e\n\u003cp\u003eBut I don’t tell her why he left me. I don’t mention the night he made me feel so beautiful and so ugly at once. Because I feel like to voice those words is to make them belong to someone other than me. Is to let them go into the world and never have the chance to get them back again.\u003c/p\u003e\n\u003cp\u003eMy sister’s eyes glisten as I talk, and sometimes she can’t hold back the tears. And when I’m done she’s silent and finally she says, “I’m so sorry. It’s my fault. If I hadn’t been so scared when we went on the path …” And then her face crumples and I pull her to me.\u003c/p\u003e\n\u003cp\u003e“We were children,” I tell her. “We were barely even five.” But I’m not trying to give her absolution, I’m trying to give it to myself. Because I’m the one who left her behind to almost die.\u003c/p\u003e\n\u003cp\u003eShe shakes her head, pushing closer to me. “It’s my fault, Annah,” she says. “I forgot about all of it. I wandered for so long that I was almost dead and I forgot about it. I grew up never remembering—never knowing. Even when something did spark a memory my mother—Mary—she’d tell me it must have been a dream. I didn’t even know about you until I met Elias. All this time and I never knew.”\u003c/p\u003e\n\u003cp\u003e“It’s all right,” I tell her, testing the words in my mouth to feel if they’re true. I pull back and place my palms on her cheeks, staring at her face. At what mine would look like if I weren’t so scarred. I can’t help but wonder what it was like for Elias to see her for the first time.\u003c/p\u003e\n\u003cp\u003eTo wonder if he saw me. And I wonder if that’s why he didn’t come home to me. Because he found something better.\u003c/p\u003e\n\u003cp\u003eChapter XVII\u003c/p\u003e\n\u003cp\u003eThe Unconsecrated moans and reaches for us, stumbling around and around in his little caged wheel. I stare at his legs that will never stop so long as he senses human flesh.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” I ask my sister, dreading the answer. “I saw them take you on the bridge. I was afraid they’d hurt you.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “No, I’m fine. They just threw me in a room to …” She doesn’t add that she was the bait for Catcher, and I don’t press her.\u003c/p\u003e\n\u003cp\u003e“So, you and Elias, huh?” I try not to let the strain I’m feeling fill my voice.\u003c/p\u003e\n\u003cp\u003eThe smile that stretches over her face is brighter than the lights lining the darkness. “I’m in love with him, Annah,” she says.\u003c/p\u003e\n\u003cp\u003eI smile. Inside I feel ill. Sick at the memory of them together and sick at my own selfishness. I shouldn’t have asked her about him. It was like sticking my fist into a wasps’ nest: I knew what the result would be.\u003c/p\u003e\n\u003cp\u003e“And you grew up with Catcher?” I ask. I think about him standing in the middle of the Unconsecrated as if he were one of them. I think about the heat of him burning against my chest and thighs as he carried me through the dark tunnel.\u003c/p\u003e\n\u003cp\u003eI want to know more about him. I want to understand him.\u003c/p\u003e\n\u003cp\u003eShe nods. “He was …” Her eyes lose focus for a moment and then she blinks fast. “He was my best friend’s older brother.” She walks closer to the Unconsecrated man. She’s staring at him as if trying to figure something out, trying to see the person he’d once been.\u003c/p\u003e\n\u003cp\u003e“He changed after he was bitten.” She laughs a little self-consciously. “I mean, of course he changed—he was infected and thought he’d die, but …”\u003c/p\u003e\n\u003cp\u003eI remember the moment I thought I’d been bitten when we were running from the horde in the Neverlands. The dread that all those years of fighting and struggling were suddenly worthless.\u003c/p\u003e\n\u003cp\u003e“How?” My voice comes out raw and I swallow before I continue. “How did he change? What was he like before?” It’s cold in the darkness and I cross my arms tightly over my chest, trying to keep in the heat.\u003c/p\u003e\n\u003cp\u003eMy sister reaches out a finger, pressing it to the metal wheel containing the Unconsecrated, letting its dull rim turn under her flesh. “He was happy before.” She says it with such finality, as if his happiness existed in a past that is lost forever.\u003c/p\u003e\n\u003cp\u003eI frown. Hearing this makes me sad—more than sad, angry. Suddenly I realize how important his happiness is to me, which throws me off balance. “You don’t think he can be happy again?”\u003c/p\u003e\n\u003cp\u003eShe presses her hand harder against the metal wheel, causing it to jerk and stop, the lights around us dimming. I want to grab her arm and pull her away but she seems so focused that I don’t move.\u003c/p\u003e\n\u003cp\u003e“I’m not sure anyone can,” she finally says. “Not anymore.”\u003c/p\u003e\n\u003cp\u003eI let out a strained laugh. “I saw you and Elias just now. You can’t tell me that’s not happiness.”\u003c/p\u003e\n\u003cp\u003eThe Unconsecrated man moans and reaches for my sister, the chains holding him in the wheel rattling. I can almost smell the metal burning away the flesh of her palm, and I’m just starting to reach for her when she steps away and the wheel jerks forward, the Unconsecrated stumbling and falling.\u003c/p\u003e\n\u003cp\u003eThe lights go out and we’re dipped into pure darkness for a moment. “I’m the one who woke the horde,” my sister says softly. She takes a deep shuddering breath and I don’t know what to say, what to tell her.\u003c/p\u003e\n\u003cp\u003eSlowly, the wheel starts to move again as the Unconsecrated finds his footing. There’s wheezing and creaking before the lights hum and begin to burn again with a low buzz. My sister holds one hand in the other, the palm red and smooth. In the dull light she turns to me, her eyes appearing hollow. “It’s my fault they’re coming to the City. I brought them here. I’m the reason the entire island across the river is gone. Dead.”\u003c/p\u003e\n\u003cp\u003eI frown. What she’s saying doesn’t make sense and I shake my head, wishing I knew how to respond but unable to stop staring at her red palm.\u003c/p\u003e\n\u003cp\u003eIt’s as if she needs to confess. “Catcher and I were trying to escape and we crossed a bridge and the horde was in the valley and it was my blood …” She pauses and swallows. Turning back to the Unconsecrated, she says, “If I hadn’t been there—if we hadn’t escaped, they couldn’t have followed us out.”\u003c/p\u003e\n\u003cp\u003eIn my mind I see the bridge she’s talking about. I remember crossing it with Elias during the storm, the bodies littering the ground so far below. “It doesn’t matter,” I finally tell her. I wish I could say something better, something she wants to hear. “They would have come eventually.”\u003c/p\u003e\n\u003cp\u003e“All those people.” Her face is white, lips colorless. “They’re all dying because of me.” She looks at me, almost desperate. “How can I be happy finally being with Elias again when I’ve killed so many people?”\u003c/p\u003e\n\u003cp\u003eI stare at the dead man, who will always keep walking. So long as there are living he can sense, he’ll be struggling for us. They’ll push and push and drive us in retreat to the smallest places left in the world.\u003c/p\u003e\n\u003cp\u003eMy sister trembles, tears trailing down her perfect cheeks. “We’re all dying,” I whisper. “Whether the Unconsecrated are in this world or not—we’ll still be dying.”\u003c/p\u003e\n\u003cp\u003eShe looks at the ground, the flickering lights along the wall making the water dripping from her jaw glisten and sparkle.\u003c/p\u003e\n\u003cp\u003eTentatively, I reach a hand out and grab her fingertips. I think of what I’ve had to do to get to this moment: the struggles as I figured out how to live alone in the Dark City without Elias. How I’d decided to fight rather than cower in the face of so much that frightened me.\u003c/p\u003e\n\u003cp\u003e“What matters is what we do with the life we have,” I tell her. “We can’t spend our days in fear.”\u003c/p\u003e\n\u003cp\u003e“What if the Mudo take the Sanctuary?” Her voice warbles.\u003c/p\u003e\n\u003cp\u003e“Then we have to be thankful for the days we’ve had,” I hesitate and smile, trying to make her think I believe my own words. “And then we run,” I add, grinning wider.\u003c/p\u003e\n\u003cp\u003eShe laughs then, and it’s like a bright spark of joy spiraling around us. She’s still laughing when the door opens and Catcher strides in. He glances between us, his steps uncertain.\u003c/p\u003e\n\u003cp\u003e“I was worried when you ran off and didn’t come back.” I can’t tell which one of us he’s talking to. I tug on the ragged ends of my hair, pulling it over my face like a curtain.\u003c/p\u003e\n\u003cp\u003eHe seems rattled at seeing the two of us standing next to each other. My sister strides forward and places her hand on his arm. The light barely extends that far and I wonder if I imagine him flinching at her touch.\u003c/p\u003e\n\u003cp\u003e“You okay, Catch?” She sounds so familiar that it’s easy to tell they’ve been friends for a long time.\u003c/p\u003e\n\u003cp\u003eCatcher glances over her shoulder at me and then steps away, gripping the back of his neck with his hand. She bats at his elbow. “You remind me of Elias when you do that,” she says playfully, and his face seems to blanch a bit as he drops his arm to his side.\u003c/p\u003e\n\u003cp\u003e“He’s looking for you,” Catcher says.\u003c/p\u003e\n\u003cp\u003eEven though I can’t see her face, I know it lights up. I can tell by the sway of her body and tilt of her head. “Where?” she asks.\u003c/p\u003e\n\u003cp\u003e“Back in the commander’s office in the main building,” he says. “They’re finalizing details about where you’ll be living.”\u003c/p\u003e\n\u003cp\u003eMy sister takes a step toward the door and then turns back to me as if remembering I’m still here. She parts her lips to say something but I cut her off. “Go on,” I tell her, and she smiles, pushing out into the snowy afternoon and leaving Catcher and me alone.\u003c/p\u003e\n\u003cp\u003eI’m awkward around him. The last time we were alone together I had my legs wrapped around his waist, my face pressed between his shoulder blades. I blush, remembering the warmth of those moments. The way his muscles slid under my hands as he carried me through the flooded tunnel.\u003c/p\u003e\n\u003cp\u003eI clear my throat, trying not to shiver at the memory.\u003c/p\u003e\n\u003cp\u003e“I can try to get you another coat when I’m back in the City,” Catcher says. He’s standing at the edge of the darkness, the Unconsecrated man still walking in his wheel and the lights still flickering with a constant buzz.\u003c/p\u003e\n\u003cp\u003e“This is the only one I own,” I tell him, picking at the worn fabric.\u003c/p\u003e\n\u003cp\u003e“I can get a new one,” he says, and I try not to think about what that statement means. He’d skin for it—take it off some Unconsecrated. Which is probably where this one came from and why it was so cheap when I traded for it years ago.\u003c/p\u003e\n\u003cp\u003e“So they’re sending you back over the river?” I ask. The thought of voluntarily going into the Dark City makes my skin itch. All those Unconsecrated. All the panic and hopelessness.\u003c/p\u003e\n\u003cp\u003eCatcher nods.\u003c/p\u003e\n\u003cp\u003e“Are you okay?”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “Like I said, we do what we have to in order to survive.”\u003c/p\u003e\n\u003cp\u003eThe flatness of his voice irritates me. Even though we haven’t known each other for long, I thought we were at the point where we could be honest about the situation we’re in together.\u003c/p\u003e\n\u003cp\u003e“Right,” I say. “It’s just about survival.” I want him to contradict me. To say something—anything—but he simply nods again as if we’re back to being complete strangers.\u003c/p\u003e\n\u003cp\u003eHe’s completely cut me off and it hurts, which makes me angry for caring in the first place. I stare at him a moment longer, the Unconsecrated moaning as he walks endlessly. Catcher says nothing more, his gaze shuttered, and so I stride to the door.\u003c/p\u003e\n\u003cp\u003e“Good luck,” I say, and as I pass him he shifts ever so slightly so that the knuckles of my hand brush against his. My step falters as I try to figure out if he did it on purpose. Unable to know, I push forward out into the freezing afternoon, letting the snow cool the heat of my face.\u003c/p\u003e\n\u003cp\u003eChapter XVIII\u003c/p\u003e\n\u003cp\u003eOnce outside I pause, trying to get my bearings. I have no idea where I’m supposed to be—where I’m allowed—and so I go back to the one place I know: the map room.\u003c/p\u003e\n\u003cp\u003eIt’s empty, the lanterns Ox lit still burning, and I stare at the walls. Black pin after black pin of hopelessness. Places that used to be. My head pounds and I realize my stomach’s empty—I’m exhausted.\u003c/p\u003e\n\u003cp\u003eI lean against the wall and slide until I’m sitting on the floor surrounded by a world that once was. Ox’s warning that we’re all that’s left circles my head, but I’m not sure I’m ready to believe that yet. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-and-hollow-places-the-forest-of-hands-and-teeth-3/page-16.html","bookId":2587,"creation":"Oct 5, 2019 6:13:39 PM","modification":"Oct 5, 2019 6:13:39 PM"}
