{"id":95234,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSome of the Recruiters look up at us as Conall leads me down the stairs. Their eyes are blurry and I realize they’ve probably been awake all night. “Save her for later,” one of them calls out, waving a hand limply in the air. “It’s time for bed. This one’s getting boring.” He and a few others stumble up the stairs, leaving.\u003c/p\u003e\n\u003cp\u003eI bite my bottom lip, trying to keep from screaming in helpless rage. I knew there was a chance that if I was caught stealing, I’d end up dead. But it was a risk I was willing to take because if I die, Elias and my sister have to live for the Recruiters to keep Catcher under control.\u003c/p\u003e\n\u003cp\u003eConall marches me down the steps and toward the side of the room where there are three tiny cages, more like kennels for holding a dog than anything else. He opens the door of one of them and forces me to my knees so that I have to crawl inside as he kicks at me.\u003c/p\u003e\n\u003cp\u003eBefore I can even turn around I hear the click of metal on metal. He’s locked me in.\u003c/p\u003e\n\u003cp\u003eChapter XXXVI\u003c/p\u003e\n\u003cp\u003eI jam my fingers through the thin metal bars. “Please,” I shout at him. “You don’t understand. If you do this to me you have to go make sure my sister and Elias are okay. If you don’t—if all of us die—Catcher won’t ever come back. You’ll starve to death. You have to go find my sister and take care of her.”\u003c/p\u003e\n\u003cp\u003eI’m desperate. This can’t have been for nothing—I can’t stay stuck down here while my sister and Elias die. “Please!” I scream after him, tearing my throat raw. “You can’t do this!”\u003c/p\u003e\n\u003cp\u003eHe turns to walk away and I crash my fist into the cage door as hard as I can. “You have to make sure they live or else all of you are going to die!”\u003c/p\u003e\n\u003cp\u003eBut it’s as if he doesn’t hear me. I watch him walk across the room and confer with a few of the Recruiters still there, pointing down at me once or twice, and then they all leave. He doesn’t even glance at me as he closes the door to the auditorium behind him. My heart’s pounding so furiously that I don’t know if it will ever calm down again.\u003c/p\u003e\n\u003cp\u003eMy cage is tiny, so small I’m forced to stay on my hands and knees. The walls close in tight around me, making it impossible to breathe, and I start to hyperventilate and gag. I try to retch but nothing comes up and I realize I haven’t eaten since Elias got sick.\u003c/p\u003e\n\u003cp\u003eI slam my hands against the door, twisting to angle my fingers through the narrow slats to work on the lock, but I can’t reach it. All I can do is bang on the cage walls, pulling and pushing and hoping that maybe the tired old metal will give way. My arm jams into one of the rusty hinges and I hiss at the pain as blood begins to well.\u003c/p\u003e\n\u003cp\u003eAnd then a tired voice says, “It’s not going to budge.” I look up and see the woman in the large cage dominating the center of the room. She’s standing there, one hand hooked through the links, blood crusted around her fingers. “I tried for over a week.”\u003c/p\u003e\n\u003cp\u003eBehind her, one of the Unconsecrated—a skinny bald man in a ratty white tunic—lunges for her but she easily dodges him, backing away to the center of the cage. The Unconsecrated man raises his face to the air, black eyes searching for the scent of my uninfected blood and then he moans, trying to reach through the cage for me and breaking his index finger back as he does.\u003c/p\u003e\n\u003cp\u003eThe other Unconsecrated shambles around to join him and I gasp when I see his face. It’s the boy from before. The one from the Neverlands; the one on the shore who wouldn’t let me take him away.\u003c/p\u003e\n\u003cp\u003eI shudder looking at him, wishing I’d tried harder to convince him to come with me that night. Knowing I had a chance to save him and I didn’t.\u003c/p\u003e\n\u003cp\u003eThe woman limps to the far side of the cage, and when it looks like the Unconsecrated are more focused on me, slowly slides down until she’s sitting, pulls her tunic over her knees and wraps her arms tight around her legs. She looks small and helpless, sweat dripping from her close-cropped hair. “What’s your name?” she asks me. She sounds exhausted. So ready for all of this to be over.\u003c/p\u003e\n\u003cp\u003e“Annah,” I tell her softly.\u003c/p\u003e\n\u003cp\u003eShe nods. “I’m Dove.” She raises a limp finger and points to the two Unconsecrated. “And that’s Noell and Jonah. They’re …” She passes a hand over her face, leaving a streak of blood along her cheek. “They were …” She pauses, looking for the right word. “Friends.” Her voice cracks.\u003c/p\u003e\n\u003cp\u003eI look away from her, not able to handle the expression of loss on her face. “I’m sorry,” I say but it’s not enough. I don’t think there could ever be words for this moment. The two Unconsecrated rattle the large cage, trying to find a way through it to me, to the uninfected blood slowly dripping from my elbow.\u003c/p\u003e\n\u003cp\u003eShe sniffs and wipes at her eyes. “They wanted this, I think.” She leans her head back so that she’s staring out through the top of the cage, as if she could see the sky if she just tried hard enough. “They’re Soulers. Well, I was a Souler too, I guess.” She sighs and then coughs and I notice a red smear around her lips. I wonder how much time’s left before she either bleeds out or her weakened body gives in to the infection.\u003c/p\u003e\n\u003cp\u003e“They thought this would be eternal life. Resurrection.” She closes her eyes. “How stupid is that?”\u003c/p\u003e\n\u003cp\u003e“It’s not stupid,” I tell her. She glances at me, clearly not believing me. “I mean, I’ve wondered about that before. If there’s something more to them.”\u003c/p\u003e\n\u003cp\u003e“There’s not,” she says matter-of-factly. “Noell was my husband. He’s the one who really believed in all of this. There’s nothing left inside him anymore. I’d know if there were.” Her voice sounds so flat, so lifeless. As if everything she’s ever believed has died.\u003c/p\u003e\n\u003cp\u003eI want to say something to give her comfort. “There could still be something …” I struggle for words and end up lamely offering, “More.”\u003c/p\u003e\n\u003cp\u003eShe shrugs again but doesn’t protest.\u003c/p\u003e\n\u003cp\u003e“How long have you been here?” I ask, not sure I want to know the answer.\u003c/p\u003e\n\u003cp\u003e“Weeks? I don’t know. Doesn’t really matter. Noell and I were down in Vista when the town revolted. They wouldn’t let us keep our dead and the Recruiters promised to protect us.” She laughs softly. “They brought us here. Caged us and have slowly been killing us off since. Not enough resources to feed us all—not enough entertainment for them.” She waits a moment before adding, “I guess I’m lucky that they just threw me in here and didn’t do anything else to me.”\u003c/p\u003e\n\u003cp\u003eWeeks. I press my forehead to the bottom of my cage. I knew about the fights and what the Recruiters were capable of. I knew about the Soulers being used as Sweepers. How many people suffered because I didn’t do anything?\u003c/p\u003e\n\u003cp\u003eI was too selfish. “I’m sorry,” I tell her again.\u003c/p\u003e\n\u003cp\u003eShe watches the way her husband moans, the way his teeth clack together. “Doesn’t really matter, it’ll be over soon. If there’s something to their belief in Resurrection, then I guess I get to be with them after all. And if there isn’t …” She closes her eyes again and I see that her fingers are trembling as she wipes a tear from her cheek.\u003c/p\u003e\n\u003cp\u003eFor a while we sit in silence.\u003c/p\u003e\n\u003cp\u003eEventually, she says, “Do you think people were this cruel before the Return?”\u003c/p\u003e\n\u003cp\u003eHer question surprises me. “I don’t know.”\u003c/p\u003e\n\u003cp\u003e“They take so much pleasure in suffering. I don’t understand it.”\u003c/p\u003e\n\u003cp\u003eI swallow, stare down at my hands. “I don’t either. Maybe they don’t understand.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” she says. “I just wonder sometimes if that’s why all this happened. If there wasn’t enough good in the world and that’s what caused the Return. People got greedy and selfish with their lives and were unwilling to let it go in the end when it was time.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what caused the Return,” I say. “If what they wanted was eternal life, they didn’t do a good job of it. Who wants to live like them?” I wave my hands at Noell and Jonah. “And who wants to live like us?”\u003c/p\u003e\n\u003cp\u003eShe coughs again, loud and vicious. Noell wanders back over to her. “And to think,” she says, hauling herself to her feet so that she can evade him. “All the times in my life when I pushed my husband away and fought with him over something petty, I should have been pulling him tighter. I should have been thankful each day to have him healthy and by my side.”\u003c/p\u003e\n\u003cp\u003eI close my eyes, unable to watch what’s happening in the cage. Yet I can still hear her quiet whimpering. Hear the sound of her husband’s moans and the tangled shuffle of their feet. How much longer can she go on like this? Because he’ll go on forever.\u003c/p\u003e\n\u003cp\u003eI hear a crunch and snap and I look back up at her.\u003c/p\u003e\n\u003cp\u003eShe’s in the middle of the cage standing over Noell. One of his knees is bent at a wrong angle, crooked out to the side with the lower part twisted and dangling. She’s openly sobbing now. “I’m so sorry, honey, I’m so sorry.” She brings her foot down against the back of his neck, screaming in agony as she does it.\u003c/p\u003e\n\u003cp\u003eIt takes a few times but eventually, with a snap, his neck breaks and he goes silent and still. She limps to the other Unconsecrated, who’s still pawing at the cage for me, and brutally, efficiently, she snaps his knee and when he falls she breaks his neck as well.\u003c/p\u003e\n\u003cp\u003eI’m barely breathing, my hand covering my mouth as if I can hold inside the sound of bones cracking.\u003c/p\u003e\n\u003cp\u003eShe falls to her knees, laces her fingers through the cage. She’s not that far away from me now and I can see the tracks of tears cutting through the dirt and blood on her face. I can even see some of the bite marks along her arm.\u003c/p\u003e\n\u003cp\u003e“I couldn’t leave them like that,” she says, as if seeking absolution from me. “I couldn’t see them like that any longer.”\u003c/p\u003e\n\u003cp\u003e“It’s okay,” I tell her, because I know they’re the words she needs to hear.\u003c/p\u003e\n\u003cp\u003eShe nods, but whether it’s at what I said or a conversation taking place in her own head, I don’t know. “They wanted to be like that. All Soulers do eventually. But I couldn’t watch it. I couldn’t let them hurt anyone else. They were both so …” She leans her head on her arm as if she doesn’t have the strength to hold it up anymore. “Gentle,” she finishes.\u003c/p\u003e\n\u003cp\u003eWith her other hand she grabs the fence and shakes it, the sound echoing around the empty auditorium. “They were good men,” she shouts. “You have to remember that, Annah. They were decent and loving.”\u003c/p\u003e\n\u003cp\u003e“I will,” I tell her, my voice seeming so small against her tempest. “I’ll remember them.” There are so many people to remember, I think.\u003c/p\u003e\n\u003cp\u003eShe says nothing else. Just continues to kneel there, letting the cage hold her up as she stares at what used to be the man she loved.\u003c/p\u003e\n\u003cp\u003eChapter XXXVII\u003c/p\u003e\n\u003cp\u003eI’m not really sure how one should spend the final moments of one’s life. I don’t know if I should pray or reflect back, if I should weep or catalog my various failures and accomplishments. Should I be sad that I never got to tell my sister, Elias or Catcher good-bye? Should I be relieved that I no longer have to worry about surviving?\u003c/p\u003e\n\u003cp\u003eI lie on my side in the kennel, knees tucked to my chest, and I stare up at Dove in her own cage. She sits in the middle, legs crossed, her lips moving but not with any sound or words that I can hear. Every now and again she’ll crawl toward Noell and grasp his limp hand in hers.\u003c/p\u003e\n\u003cp\u003eEventually, she lies down with her back against his chest, tucking her head under his chin and pulling his arm across her.\u003c/p\u003e\n\u003cp\u003eI have to look away. I can’t watch that, the way his broken neck hangs crooked. I wonder how long she survived in there with the Unconsecrated. I wonder how long I’ll survive. How much fight I have left in me.\u003c/p\u003e\n\u003cp\u003eI’d like to think that I won’t beg, but I’m worried that in the end I’ll scream for mercy just like everyone else.\u003c/p\u003e\n\u003cp\u003eThere’s no ceremony to the whole thing. Conall strolls into the auditorium, the side of his face creased as if he’s just woken up from a nap. He stands at the edge of the large cage in the center of the room and stares at Dove for a while.\u003c/p\u003e\n\u003cp\u003e“She still alive?” he asks, and I guess he’s directing the question at me.\u003c/p\u003e\n\u003cp\u003eI don’t answer. I don’t want to give him the satisfaction.\u003c/p\u003e\n\u003cp\u003eAnother Recruiter comes walking down the steps. “Looks like she killed the plague rats,” he says, standing next to Conall.\u003c/p\u003e\n\u003cp\u003e“You were supposed to leave someone here to make sure that didn’t happen,” Conall growls.\u003c/p\u003e\n\u003cp\u003eThe other one shrugs. “If she isn’t turned yet, she will be soon enough. Might be interesting to see the two girls duking it out.” The hint of leering suggestion in his voice disgusts me.\u003c/p\u003e\n\u003cp\u003eEven from here I can tell that Conall’s angry and then finally he just throws up a hand. “Whatever,” he says. “We still have those other three from before. We can bring them out when we get tired of watching these two run around each other.”\u003c/p\u003e\n\u003cp\u003eI’m shocked at how calmly they’re discussing my fate. And the inconvenience they face because Dove defended herself.\u003c/p\u003e\n\u003cp\u003eConall comes over to my kennel and kneels. “How’s it going in there?” he asks.\u003c/p\u003e\n\u003cp\u003eI glare at him. “My sister—have you gone to make sure she’s okay?”\u003c/p\u003e\n\u003cp\u003e“I’ll take care of it,” he says, but of course I can’t trust him.\u003c/p\u003e\n\u003cp\u003e“Catcher won’t come back if they’re dead,” I remind him. “If you want to survive, you have to make sure they’re okay.”\u003c/p\u003e\n\u003cp\u003eHe stops fiddling with the lock on my cage and stares at me for a moment. “I’m not sure it’s their survival you should be worried about,” he says. “And if you’re not going to put up a decent fight up there, then I’ll find someone who will. Even if I have to go get your friends.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-and-hollow-places-the-forest-of-hands-and-teeth-3/page-32.html","bookId":2587,"creation":"Oct 5, 2019 6:13:39 PM","modification":"Oct 5, 2019 6:13:39 PM"}
