{"id":96971,"no":12,"title":"Page 12","content":"\u003cp\u003eShe weighed these words, her hand remaining on the haft of her knife. A tricky answer, but there was sincerity in the voice.\u003c/p\u003e\n\u003cp\u003e\"Then why such a gift?\" she probed.\u003c/p\u003e\n\u003cp\u003e\"It may have amused the Tleilaxu. And, it is true, that the Guild asked for me as a gift.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Same answer.\"\u003c/p\u003e\n\u003cp\u003e\"How am I careless of my powers?\"\u003c/p\u003e\n\u003cp\u003e\"How are you employing them?\" he countered.\u003c/p\u003e\n\u003cp\u003eHis question slashed through to her own misgivings. She took her hand away from the knife, asked: \"Why do you say my brother was destroying himself?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, come now, child! Where are these vaunted powers? Have you no ability to reason?\"\u003c/p\u003e\n\u003cp\u003eControlling anger, she said: \"Reason for me, mentat.\"\u003c/p\u003e\n\u003cp\u003e\"Very well.\" He glanced around at their escort, returned his attention to their course. The plain of Arrakeen was beginning to show beyond the northern rim of the Shield Wall. The pattern of the pan and graben villages remained indistinct beneath a dust pall, but the distant gleam of Arrakeen could be discerned.\u003c/p\u003e\n\u003cp\u003e\"Symptoms,\" he said. \"Your brother keeps an official Panegyrist who - \"\u003c/p\u003e\n\u003cp\u003e\"Who was a gift of the Fremen Naibs!\"\u003c/p\u003e\n\u003cp\u003e\"An odd gift from friends,\" he said. \"Why would they surround him with flattery and servility? Have you really listened to this Panegyrist? \u0027The people are illuminated by Muad\u0027dib. The Umma Regent, our Emperor, came out of darkness to shine resplendently upon all men. He is our Sire. He is precious water from an endless fountain. He spills joy for all the universe to drink,\u0027 Pah!\"\u003c/p\u003e\n\u003cp\u003eSpeaking softly, Alia said: \"If I but repeated your words for our Fremen escort, they\u0027d hack you into bird feed.\"\u003c/p\u003e\n\u003cp\u003e\"Then tell them.\"\u003c/p\u003e\n\u003cp\u003e\"My brother rules by the natural law of heaven!\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t believe that, so why say it?\"\u003c/p\u003e\n\u003cp\u003e\"How do you know what I believe?\" She experienced trembling that no Bene Gesserit powers could control. This ghola was having an effect she hadn\u0027t anticipated.\u003c/p\u003e\n\u003cp\u003e\"You commanded me to reason as a mentat,\" he reminded her.\u003c/p\u003e\n\u003cp\u003e\"No mentat knows what I believe!\" She took two deep, shuddering breaths. \"How dare you judge us?\"\u003c/p\u003e\n\u003cp\u003e\"Judge you? I don\u0027t judge.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve no idea how we were taught!\"\u003c/p\u003e\n\u003cp\u003e\"Both of you were taught to govern,\" he said. \"You were conditioned to an overweening thirst for power. You were imbued with a shrewd grasp of politics and a deep understanding for the uses of war and ritual. Natural law? What natural law? That myth haunts human history. Haunts! It\u0027s a ghost. It\u0027s insubstantial, unreal. Is your Jihad a natural law?\"\u003c/p\u003e\n\u003cp\u003e\"Mentat jabber,\" she sneered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a servant of the Atreides and I speak with candor,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Servant? We\u0027ve no servants; only disciples.\"\u003c/p\u003e\n\u003cp\u003e\"And I am a disciple of awareness,\" he said. \"Understand that, child, and you - \"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t call me child!\" she snapped. She slipped her crysknife half out of its sheath.\u003c/p\u003e\n\u003cp\u003e\"I stand corrected.\" He glanced at her, smiled, returned his attention to piloting the \u0027thopter. The cliffsided structure of the Atreides Keep could be made out now, dominating the northern suburbs of Arrakeen. \"You are something ancient in flesh that is little more than a child,\" he said. \"And the flesh is disturbed by its new womanhood.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know why I listen to you,\" she growled, but she let the crysknife fall back into its sheath, wiped her palm on her robe. The palm, wet with perspiration, disturbed her sense of Fremen frugality. Such a waste of the body\u0027s moisture!\u003c/p\u003e\n\u003cp\u003e\"You listen because you know I\u0027m devoted to your brother,\" he said. \"My actions are clear and easily understood.\"\u003c/p\u003e\n\u003cp\u003e\"Nothing about you is clear and easily understood. You\u0027re the most complex creature I\u0027ve ever seen. How do I know what the Tleilaxu built into you?\"\u003c/p\u003e\n\u003cp\u003e\"By mistake or intent,\" he said, \"they gave me freedom to mold myself.\"\u003c/p\u003e\n\u003cp\u003e\"You retreat into Zensunni parables,\" she accused. \"The wise man molds himself - the fool lives only to die.\" Her voice was heavy with mimicry. \"Disciple of awareness!\"\u003c/p\u003e\n\u003cp\u003e\"Men cannot separate means and enlightenment,\" he said.\u003c/p\u003e\n\u003cp\u003e\"You speak riddles!\"\u003c/p\u003e\n\u003cp\u003e\"I speak to the opening mind.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to repeat all this to Paul.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s heard most of it already.\"\u003c/p\u003e\n\u003cp\u003eShe found herself overwhelmed by curiosity. \"How is it you\u0027re still alive... and free? What did he say?\"\u003c/p\u003e\n\u003cp\u003e\"He laughed. And he said, \u0027People don\u0027t want a bookkeeper for an Emperor; they want a master, someone who\u0027ll protect them from change.\u0027 But he agreed that destruction of his Empire arises from himself.\"\u003c/p\u003e\n\u003cp\u003e\"Why would he say such things?\"\u003c/p\u003e\n\u003cp\u003e\"Because I convinced him I understand his problem and will help him.\"\u003c/p\u003e\n\u003cp\u003e\"What could you possibly have said to do that?\"\u003c/p\u003e\n\u003cp\u003eHe remained silent, banking the \u0027thopter into the downwind leg for a landing at the guard complex on the roof of the Keep.\u003c/p\u003e\n\u003cp\u003e\"I demand you tell me what you said!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure you could take it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be the judge of that! I command you to speak at once!\"\u003c/p\u003e\n\u003cp\u003e\"Permit me to land us first,\" he said. And not waiting for her permission, he turned onto the base leg, brought the wings into optimum lift, settled gently onto the bright orange pad atop the roof.\u003c/p\u003e\n\u003cp\u003e\"Now,\" Alia said. \"Speak.\"\u003c/p\u003e\n\u003cp\u003e\"I told him that to endure oneself may be the hardest task in the universe.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"That\u0027s... that\u0027s... \"\u003c/p\u003e\n\u003cp\u003e\"A bitter pill,\" he said, watching the guards run toward them across the roof, taking up their escort positions.\u003c/p\u003e\n\u003cp\u003e\"Bitter nonsense!\"\u003c/p\u003e\n\u003cp\u003e\"The greatest palatinate earl and the lowliest stipendiary serf share the same problem. You cannot hire a mentat or any other intellect to solve it for you. There\u0027s no writ of inquest or calling of witnesses to provide answers. No servant - or disciple - can dress the wound. You dress it yourself or continue bleeding for all to see.\"\u003c/p\u003e\n\u003cp\u003eShe whirled away from him, realizing in the instant of action what this betrayed about her own feelings. Without wile of voice or witch-wrought trickery, he had reached into her psyche once more. How did he do this?\u003c/p\u003e\n\u003cp\u003e\"What have you told him to do?\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"I told him to judge, to impose order.\"\u003c/p\u003e\n\u003cp\u003eAlia stared out at the guard, marking how patiently they waited - how orderly. \"To dispense justice,\" she murmured.\u003c/p\u003e\n\u003cp\u003e\"Not that!\" he snapped. \"I suggested that he judge, no more, guided by one principle, perhaps...\"\u003c/p\u003e\n\u003cp\u003e\"And that?\"\u003c/p\u003e\n\u003cp\u003e\"To keep his friends and destroy his enemies.\"\u003c/p\u003e\n\u003cp\u003e\"To judge unjustly, then.\"\u003c/p\u003e\n\u003cp\u003e\"What is justice? Two forces collide. Each may have the right in his own sphere. And here\u0027s where an Emperor commands orderly solutions. Those collisions he cannot prevent - he solves.\"\u003c/p\u003e\n\u003cp\u003e\"How?\"\u003c/p\u003e\n\u003cp\u003e\"In the simplest way: he decides.\"\u003c/p\u003e\n\u003cp\u003e\"Keeping his friends and destroying his enemies.\"\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t that stability? People want order, this kind or some other. They sit in the prison of their hungers and see that war has become the sport of the rich. That\u0027s a dangerous form of sophistication. It\u0027s disorderly.\"\u003c/p\u003e\n\u003cp\u003e\"I will suggest to my brother that you are much too dangerous and must be destroyed,\" she said, turning to face him.\u003c/p\u003e\n\u003cp\u003e\"A solution I\u0027ve already suggested,\" he said.\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s why you are dangerous,\" she said, measuring out her words. \"You\u0027ve mastered your passions.\"\u003c/p\u003e\n\u003cp\u003e\"That is not why I\u0027m dangerous.\" Before she could move, he leaned across, gripped her chin in one hand, planted his lips on hers.\u003c/p\u003e\n\u003cp\u003eIt was a gentle kiss, brief. He pulled away and she stared at him with a shock leavened by glimpses of spasmodic grins on the faces of her guardsmen still standing at orderly attention outside.\u003c/p\u003e\n\u003cp\u003eAlia put a finger to her lips. There\u0027d been such a sense of familiarity about that kiss. His lips had been flesh of a future she\u0027d seen in some prescient byway. Breast heaving, she said: \"I should have you flayed.\"\u003c/p\u003e\n\u003cp\u003e\"Because I\u0027m dangerous?\"\u003c/p\u003e\n\u003cp\u003e\"Because you presume too much!\"\u003c/p\u003e\n\u003cp\u003e\"I presume nothing. I take nothing which is not first offered to me. Be glad I did not take all that was offered.\" He opened his door, slid out. \"Come along. We\u0027ve dallied too long on a fool\u0027s errand.\" He strode toward the entrance dome beyond the pad.\u003c/p\u003e\n\u003cp\u003eAlia leaped out, ran to match his stride. \"I\u0027ll tell him everything you\u0027ve said and everything you did,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Good.\" He held the door for her.\u003c/p\u003e\n\u003cp\u003e\"He will order you executed,\" she said, slipping into the dome.\u003c/p\u003e\n\u003cp\u003e\"Why? Because I took the kiss I wanted?\" He followed her, his movement forcing her back. The door slid closed behind him.\u003c/p\u003e\n\u003cp\u003e\"The kiss you wanted!\" Outrage filled her.\u003c/p\u003e\n\u003cp\u003e\"All right, Alia. The kiss you wanted, then.\" He started to move around her toward the drop field.\u003c/p\u003e\n\u003cp\u003eAs though his movement had propelled her into heightened awareness, she realized his candor - the utter truthfulness of him. The kiss I wanted, she told herself. True.\u003c/p\u003e\n\u003cp\u003e\"Your truthfulness, that\u0027s what\u0027s dangerous,\" she said, following him.\u003c/p\u003e\n\u003cp\u003e\"You return to the ways of wisdom,\" he said, not breaking his stride. \"A mentat could not\u0027ve stated the matter more directly. Now: what is it you saw in the desert?\"\u003c/p\u003e\n\u003cp\u003eShe grabbed his arm, forcing him to a halt. He\u0027d done it again: shocked her mind into sharpened awareness.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t explain it,\" she said, \"but I keep thinking of the Face Dancers. Why is that?\"\u003c/p\u003e\n\u003cp\u003e\"That is why your brother sent you to the desert,\" he said, nodding. \"Tell him of this persistent thought.\"\u003c/p\u003e\n\u003cp\u003e\"But why?\" She shook her head. \"Why Face Dancers?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a young woman dead out there,\" he said. \"Perhaps no young woman is reported missing among the Fremen.\"\u003c/p\u003e\n\u003cp\u003eI think what a joy it is to be alive, and I wonder if I\u0027ll ever leap inward to the root of this flesh and know myself as once I was. The root is there. Whether any act of mine can find it, that remains tangled in the future. But all things a man can do are mine. Any act of mine may do it. -The Ghola Speaks Alia\u0027s Commentary\u003c/p\u003e\n\u003cp\u003eAs he lay immersed in the screaming odor of the spice, staring inward through the oracular trance, Paul saw the moon become an elongated sphere. It rolled and twisted, hissing - the terrible hissing of a star being quenched in an infinite sea - down... down... down... like a ball thrown by a child.\u003c/p\u003e\n\u003cp\u003eIt was gone.\u003c/p\u003e\n\u003cp\u003eThis moon had not set. Realization engulfed him. It was gone: no moon. The earth quaked like an animal shaking its skin. Terror swept over him.\u003c/p\u003e\n\u003cp\u003ePaul jerked upright on his pallet, eyes wide open, staring. Part of him looked outward, part inward. Outwardly, he saw the plasmeld grillwork which vented his private room, and he knew he lay beside a stone-like abyss of his Keep. Inwardly, he continued to see the moon fall.\u003c/p\u003e\n\u003cp\u003eOut! Out!\u003c/p\u003e\n\u003cp\u003eHis grillwork of plasmeld looked onto the blazing light of noon across Arrakeen. Inward - there lay blackest night. A shower of sweet odors from a garden roof nibbled at his senses, but no floral perfume could roll back that fallen moon.\u003c/p\u003e\n\u003cp\u003ePaul swung his feet to the cold surface of the floor, peered through the grillwork. He could see directly across to the gentle arc of a footbridge constructed of crystal-stabilized gold and platinum. Fire jewels from far Cedon decorated the bridge. It led to the galleries of the inner city across a pool and fountain filled with waterflowers. If he stood, Paul knew, he could look down into petals as clean and red as fresh blood whirling, turning there - disks of ambient color tossed on an emerald freshet.\u003c/p\u003e\n\u003cp\u003eHis eyes absorbed the scene without pulling him from spice thralldom.\u003c/p\u003e\n\u003cp\u003eThat terrible vision of a lost moon.\u003c/p\u003e\n\u003cp\u003eThe vision suggested a monstrous loss of individual security. Perhaps he\u0027d seen his civilization fall, toppled by its own pretensions.\u003c/p\u003e\n\u003cp\u003eA moon... a moon... a falling moon.\u003c/p\u003e\n\u003cp\u003eIt had taken a massive dose of the spice essence to penetrate the mud thrown up by the tarot. All it had shown him was a falling moon and the hateful way he\u0027d known from the beginning. To buy an end for the Jihad, to silence the volcano of butchery, he must discredit himself.\u003c/p\u003e\n\u003cp\u003eDisengage... disengage... disengage...\u003c/p\u003e\n\u003cp\u003eFloral perfume from the garden roof reminded him of Chani. He longed for her arms now, for the clinging arms of love and forgetfulness. But even Chani could not exorcise this vision. What would Chani say if he went to her with the statement that he had a particular death in mind? Knowing it to be inevitable, why not choose an aristocrat\u0027s death, ending life on a secret flourish, squandering any years that might have been? To die before coming to the end of willpower, was that not an aristocrat\u0027s choice?\u003c/p\u003e\n\u003cp\u003eHe stood, crossed to the lapped opening in the grillwork, went out onto a balcony which looked upward to flowers and vines trailing from the garden. His mouth held the dryness of a desert march.\u003c/p\u003e\n\u003cp\u003eMoon... moon - where is that moon?\u003c/p\u003e\n\u003cp\u003eHe thought of Alia\u0027s description, the young woman\u0027s body found in the dunes. A Fremen addicted to semuta! Everything fitted the hateful pattern.\u003c/p\u003e\n\u003cp\u003eYou do not take from this universe, he thought. It grants what it will.\u003c/p\u003e\n\u003cp\u003eThe remains of a conch shell from the seas of Mother Earth lay on a low table beside the balcony rail. He took its lustrous smoothness into his hands, tried to feel backward in Time. The pearl surface reflected glittering moons of light. He tore his gaze from it, peered upward past the garden to a sky become a conflagration - trails of rainbow dust shining in the silver sun.\u003c/p\u003e\n\u003cp\u003eMy Fremen call themselves \"Children of the Moon,\" he thought.\u003c/p\u003e\n\u003cp\u003eHe put down the conch, strode along the balcony. Did that terrifying moon hold out hope of escape? He probed for meaning in the region of mystic communion. He felt weak, shaken, still gripped by the spice.\u003c/p\u003e\n\u003cp\u003eAt the north end of his plasmeld chasm, he came in sight of the lower buildings of the government warren. Foot traffic thronged the roof walks. He felt that the people moved there like a frieze against a background of doors, walls, tile designs. The people were tiles! When he blinked, he could hold them frozen in his mind. A frieze.\u003c/p\u003e\n\u003cp\u003eA moon falls and is gone.\u003c/p\u003e\n\u003cp\u003eA feeling came over him that the city out there had been translated into an odd symbol for his universe. The buildings he could see had been erected on the plain where his Fremen had obliterated the Sardaukar legions. Ground once trampled by battles rang now to the rushing clamor of business.\u003c/p\u003e\n\u003cp\u003eKeeping to the balcony\u0027s outer edge, Paul strode around the corner. Now, his vista was a suburb where city structures lost themselves in rocks and the blowing sand of the desert. Alia\u0027s temple dominated the foreground; green and black hangings along its two-thousand-meter sides displayed the moon symbol of Muad\u0027dib.\u003c/p\u003e\n\u003cp\u003eA falling moon.\u003c/p\u003e\n\u003cp\u003ePaul passed a hand across his forehead and eyes. The symbol-metropolis oppressed him. He despised his own thoughts. Such vacillation in another would have aroused his anger. \u003c/p\u003e","sourceLink":"https://allnovel.net/dune-messiah-dune-chronicles-2/page-12.html","bookId":2154,"creation":"Oct 5, 2019 6:24:19 PM","modification":"Oct 5, 2019 6:24:19 PM"}
