{"id":96972,"no":13,"title":"Page 13","content":"\u003cp\u003eHe loathed his city!\u003c/p\u003e\n\u003cp\u003eRage rooted in boredom flickered and simmered deep within him, nurtured by decisions that couldn\u0027t be avoided. He knew which path his feet must follow. He\u0027d seen it enough times, hadn\u0027t he? Seen it! Once... long ago, he\u0027d thought of himself as an inventor of government. But the invention had fallen into old patterns. It was like some hideous contrivance with plastic memory. Shape it any way you wanted, but relax for a moment, and it snapped into the ancient forms. Forces at work beyond his reach in human breasts eluded and defied him.\u003c/p\u003e\n\u003cp\u003ePaul stared out across the rooftops. What treasures of untrammeled life lay beneath those roofs? He glimpsed leaf-green places, open plantings amidst the chalk-red and gold of the roofs. Green, the gift of Muad\u0027dib and his water. Orchards and groves lay within his view - open plantings to rival those of fabled Lebanon.\u003c/p\u003e\n\u003cp\u003e\"Muad\u0027dib spends water like a madman,\" Fremen said.\u003c/p\u003e\n\u003cp\u003ePaul put his hands over his eyes.\u003c/p\u003e\n\u003cp\u003eThe moon fell.\u003c/p\u003e\n\u003cp\u003eHe dropped his hands, stared at his metropolis with clarified vision. Buildings took on an aura of monstrous imperial barbarity. They stood enormous and bright beneath the northern sun. Colossi! Every extravagance of architecture a demented history could produce lay within his view: terraces of mesa proportion, squares as large as some cities, parks, premises, bits of cultured wilderness.\u003c/p\u003e\n\u003cp\u003eSuperb artistry abutted inexplicable prodigies of dismal tastelessness. Details impressed themselves upon him: a postern out of most ancient Baghdad... a dome dreamed in mythical Damascus... an arch from the low gravity of Atar... harmonious elevations and queer depths. All created an effect of unrivaled magnificence.\u003c/p\u003e\n\u003cp\u003eA moon! A moon! A moon!\u003c/p\u003e\n\u003cp\u003eFrustration tangled him. He felt the pressure of mass-unconscious, that burgeoning sweep of humankind across his universe. They rushed upon him with a force like a gigantic tidal bore. He sensed the vast migrations at work in human affairs: eddies, currents, gene flows. No dams of abstinence, no seizures of impotence nor maledictions could stop it.\u003c/p\u003e\n\u003cp\u003eMuad\u0027dib\u0027s Jihad was less than an eye-blink in this larger movement. The Bene Gesserit swimming in this tide, that corporate entity trading in genes, was trapped in the torrent as he was. Visions of a falling moon must be measured against other legends, other visions in a universe where even the seemingly eternal stars waned, flickered, died...\u003c/p\u003e\n\u003cp\u003eWhat mattered a single moon in such a universe?\u003c/p\u003e\n\u003cp\u003eFar within his fortress citadel, so deep within that the sound sometimes lost itself in the flow of city noises, a ten-string rebaba tinkled with a song of the Jihad, a lament for a woman left behind on Arrakis:\u003c/p\u003e\n\u003cp\u003eHer hips are dunes curved by the wind,\u003c/p\u003e\n\u003cp\u003eHer eyes shine like summer heat.\u003c/p\u003e\n\u003cp\u003eTwo braids of hair hang down her back -\u003c/p\u003e\n\u003cp\u003eRich with water rings, her hair!\u003c/p\u003e\n\u003cp\u003eMy hands remember her skin,\u003c/p\u003e\n\u003cp\u003eFragrant as amber, flower-scented.\u003c/p\u003e\n\u003cp\u003eEyelids tremble with memories...\u003c/p\u003e\n\u003cp\u003eI am stricken by love\u0027s white flame!\u003c/p\u003e\n\u003cp\u003eThe song sickened him. A tune for stupid creatures lost in sentimentality! As well sing to the dune-impregnated corpse Alia had seen.\u003c/p\u003e\n\u003cp\u003eA figure moved in shadows of the balcony\u0027s grillwork. Paul whirled.\u003c/p\u003e\n\u003cp\u003eThe ghola emerged into the sun\u0027s full glare. His metal eyes glittered.\u003c/p\u003e\n\u003cp\u003e\"Is it Duncan Idaho or the man called Hayt?\" Paul asked.\u003c/p\u003e\n\u003cp\u003eThe ghola came to a stop two paces from him. \"Which would my Lord prefer?\"\u003c/p\u003e\n\u003cp\u003eThe voice carried a soft ring of caution.\u003c/p\u003e\n\u003cp\u003e\"Play the Zensunni,\" Paul said bitterly. Meanings within meanings! What could a Zensunni philosopher say or do to change one jot of the reality unrolling before them at this instant?\u003c/p\u003e\n\u003cp\u003e\"My Lord is troubled.\"\u003c/p\u003e\n\u003cp\u003ePaul turned away, stared at the Shield Wall\u0027s distant scarp, saw wind-carved arches and buttresses, terrible mimicry of his city. Nature playing a joke on him! See what I can build! He recognized a slash in the distant massif, a place where sand spilled from a crevasse, and thought: There! Right there, we fought Sardaukar!\u003c/p\u003e\n\u003cp\u003e\"What troubles my lord?\" the ghola asked.\u003c/p\u003e\n\u003cp\u003e\"A vision,\" Paul whispered.\u003c/p\u003e\n\u003cp\u003e\"Ahhhhh, when the Tleilaxu first awakened me, I had visions. I was restless, lonely... not really knowing I was lonely. Not then. My visions revealed nothing! The Tleilaxu told me it was an intrusion of the flesh which men and gholas all suffer, a sickness, no more.\"\u003c/p\u003e\n\u003cp\u003ePaul turned, studied the ghola\u0027s eyes, those pitted, steely balls without expression. What visions did those eyes see?\u003c/p\u003e\n\u003cp\u003e\"Duncan... Duncan...\" Paul whispered.\u003c/p\u003e\n\u003cp\u003e\"I am called Hayt.\"\u003c/p\u003e\n\u003cp\u003e\"I saw a moon fall,\" Paul said. \"It was gone, destroyed. I heard a great hissing. The earth shook.\"\u003c/p\u003e\n\u003cp\u003e\"You are drunk on too much time,\" the ghola said.\u003c/p\u003e\n\u003cp\u003e\"I ask for the Zensunni and get the mentat!\" Paul said. \"Very well! Play my vision through your logic, mentat. Analyze it and reduce it to mere words laid out for burial.\"\u003c/p\u003e\n\u003cp\u003e\"Burial, indeed,\" the ghola said. \"You run from death. You strain at the next instant, refuse to live here and now. Augury! What a crutch for an Emperor!\"\u003c/p\u003e\n\u003cp\u003ePaul found himself fascinated by a well-remembered mole on the ghola\u0027s chin.\u003c/p\u003e\n\u003cp\u003e\"Trying to live in this future,\" the ghola said, \"do you give substance to such a future? Do you make it real?\"\u003c/p\u003e\n\u003cp\u003e\"If I go the way of my vision-future, I\u0027ll be alive then,\" Paul muttered. \"What makes you think I want to live there?\"\u003c/p\u003e\n\u003cp\u003eThe ghola shrugged. \"You asked me for a substantial answer.\"\u003c/p\u003e\n\u003cp\u003e\"Where is there substance in a universe composed of events?\" Paul asked. \"Is there a final answer? Doesn\u0027t each solution produce new questions?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve digested so much time you have delusions of immortality,\" the ghola said. \"Even your Empire, my lord, must live its time and die.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t parade smoke-blackened altars before me,\" Paul growled. \"I\u0027ve heard enough sad histories of gods and messiahs. Why should I need special powers to forecast ruins of my own like all those others? The lowliest servant of my kitchens could do this.\" He shook his head. \"The moon fell!\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve not brought your mind to rest at its beginning,\" the ghola said.\u003c/p\u003e\n\u003cp\u003e\"Is that how you destroy me?\" Paul demanded. \"Prevent me from collecting my thoughts?\"\u003c/p\u003e\n\u003cp\u003e\"Can you collect chaos?\" the ghola asked. \"We Zensunni say: \u0027Not collecting, that is the ultimate gathering.\u0027 What can you gather without gathering yourself?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m deviled by a vision and you spew nonsense!\" Paul raged. \"What do you know of prescience?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve seen the oracle at work,\" the ghola said. \"I\u0027ve seen those who seek signs and omens for their individual destiny. They fear what they seek.\"\u003c/p\u003e\n\u003cp\u003e\"My falling moon is real,\" Paul whispered. He took a trembling breath. \"It moves. It moves.\"\u003c/p\u003e\n\u003cp\u003e\"Men always fear things which move by themselves,\" the ghola said. \"You fear your own powers. Things fall into your head from nowhere. When they fall out, where do they go?\"\u003c/p\u003e\n\u003cp\u003e\"You comfort me with thorns,\" Paul growled.\u003c/p\u003e\n\u003cp\u003eAn inner illumination came over the ghola\u0027s face. For a moment, he became pure Duncan Idaho. \"I give you what comfort I can,\" he said.\u003c/p\u003e\n\u003cp\u003ePaul wondered at that momentary spasm. Had the ghola felt grief which his mind rejected? Had Hayt put down a vision of his own?\u003c/p\u003e\n\u003cp\u003e\"My moon has a name,\" Paul whispered.\u003c/p\u003e\n\u003cp\u003eHe let the vision flow over him then. Though his whole being shrieked, no sound escaped him. He was afraid to speak, fearful that his voice might betray him. The air of this terrifying future was thick with Chani\u0027s absence. Flesh that had cried in ecstasy, eyes that had burned him with their desire, the voice that had charmed him because it played no tricks of subtle control - all gone, back into the water and the sand.\u003c/p\u003e\n\u003cp\u003eSlowly, Paul turned away, looked out at the present and the plaza before Alia\u0027s temple. Three shaven-headed pilgrims entered from the processional avenue. They wore grimy yellow robes and hurried with their heads bent against the afternoon\u0027s wind. One walked with a limp, dragging his left foot. They beat their way against the wind, rounded a corner and were gone from his sight.\u003c/p\u003e\n\u003cp\u003eJust as his moon would go, they were gone. Still, his vision lay before him. Its terrible purpose gave him no choice.\u003c/p\u003e\n\u003cp\u003eThe flesh surrenders itself, he thought. Eternity takes back its own. Our bodies stirred these waters briefly, danced with a certain intoxication before the love of life and self, dealt with a few strange ideas, then submitted to the instruments of Time. What can we say of this? I occurred. I am not... yet, I occurred.\u003c/p\u003e\n\u003cp\u003e\"You do not beg the sun for mercy.\" -Maud\u0027dib\u0027s Travail from The Stilgar Commentary\u003c/p\u003e\n\u003cp\u003eOne moment of incompetence can be fatal, the Reverend Mother Gaius Helen Mohiam reminded herself.\u003c/p\u003e\n\u003cp\u003eShe hobbled along, apparently unconcerned, within a ring of Fremen guards. One of those behind her, she knew, was a deaf-mute immune to any wiles of Voice. No doubt he\u0027d been charged to kill her at the slightest provocation.\u003c/p\u003e\n\u003cp\u003eWhy had Paul summoned her? she wondered. Was he about to pass sentence? She remembered the day long ago when she\u0027d tested him... the child kwisatz haderach. He was a deep one.\u003c/p\u003e\n\u003cp\u003eDamn his mother for all eternity! It was her fault the Bene Gesserit had lost their hold on this gene line.\u003c/p\u003e\n\u003cp\u003eSilence surged along the vaulted passages ahead of her entourage. She sensed the word being passed. Paul would hear the silence. He\u0027d know of her coming before it was announced. She didn\u0027t delude herself with ideas that her powers exceeded his.\u003c/p\u003e\n\u003cp\u003eDamn him!\u003c/p\u003e\n\u003cp\u003eShe begrudged the burdens age had imposed on her: the aching joints, responses not as quick as once they\u0027d been, muscles not as elastic as the whipcords of her youth. A long day lay behind her and a long life. She\u0027d spent this day with the Dune Tarot in a fruitless search for some clue to her own fate. But the cards were sluggish.\u003c/p\u003e\n\u003cp\u003eThe guards herded her around a corner into another of the seemingly endless vaulted passages. Triangular meta-glass windows on her left gave a view upward to trellised vines and indigo flowers in deep shadows cast by the afternoon sun. Tiles lay underfoot - figures of water creatures from exotic planets. Water reminders everywhere. Wealth... riches.\u003c/p\u003e\n\u003cp\u003eRobed figures passed across another hall in front of her, cast covert glances at the Reverend Mother. Recognition was obvious in their manner - and tension.\u003c/p\u003e\n\u003cp\u003eShe kept her attention on the sharp hairline of the guard immediately in front: young flesh, pink creases at the uniform collar.\u003c/p\u003e\n\u003cp\u003eThe immensity of this ighir citadel began to impress her. Passages... passages... They passed an open doorway from which emerged the sound of timbur and flute playing soft, elder music. A glance showed her blue-in-blue Fremen eyes staring from the room. She sensed in them the ferment of legendary revolts stirring in wild genes.\u003c/p\u003e\n\u003cp\u003eThere lay the measure of her personal burden, she knew. A Bene Gesserit could not escape awareness of the genes and their possibilities. She was touched by a feeling of loss: that stubborn fool of an Atreides! How could he deny the jewels of posterity within his loins? A kwisatz haderach! Born out of this time, true, but real - as real as his abomination of a sister... and there lay a dangerous unknown. A wild Reverend Mother spawned without Bene Gesserit inhibitions, holding no loyalty to orderly development of the genes. She shared her brother\u0027s powers, no doubt - and more.\u003c/p\u003e\n\u003cp\u003eThe size of the citadel began to oppress her. Would the passages never end? The place reeked of terrifying physical power. No planet, no civilization in all human history had ever before seen such man-made immensity. A dozen ancient cities could be hidden in its walls!\u003c/p\u003e\n\u003cp\u003eThey passed oval doors with winking lights. She recognized them for Ixian handiwork: pneumatic transport orifices. Why was she being marched all this distance, then? The answer began to shape itself in her mind: to oppress her in preparation for this audience with the Emperor.\u003c/p\u003e\n\u003cp\u003eA small clue, but it joined other subtle indications - the relative suppression and selection of words by her escort, the traces of primitive shyness in their eyes when they called her Reverend Mother, the cold and bland, essentially odorless nature of these halls - all combined to reveal much that a Bene Gesserit could interpret.\u003c/p\u003e\n\u003cp\u003ePaul wanted something from her!\u003c/p\u003e\n\u003cp\u003eShe concealed a feeling of elation. A bargaining lever existed. It remained only to find the nature of that lever and test its strength. Some levers had moved things greater than this citadel. A finger\u0027s touch had been known to topple civilizations.\u003c/p\u003e\n\u003cp\u003eThe Reverend Mother reminded herself then of Scytale\u0027s assessment: When a creature has developed into one thing, he will choose death rather than change into his opposite.\u003c/p\u003e\n\u003cp\u003eThe passages through which she was being escorted grew larger by subtle stages - tricks of arching, graduated amplification of pillared supports, displacement of the triangular windows by larger, oblong shapes. Ahead of her, finally, loomed double doors centered in the far wall of a tall antechamber. She sensed that the doors were very large, and was forced to suppress a gasp as her trained awareness measured out the true proportions. The doorway stood at least eighty meters high, half that in width.\u003c/p\u003e\n\u003cp\u003eAs she approached with her escort, the doors swung inward - an immense and silent movement of hidden machinery. She recognized more Ixian handiwork. Through that towering doorway she marched with her guards into the Grand Reception Hall of the Emperor Paul Atreides - \"Muad\u0027dib, before whom all people are dwarfed.\" Now, she saw the effect of that popular saying at work.\u003c/p\u003e\n\u003cp\u003eAs she advanced toward Paul on the distant throne, the Reverend Mother found herself more impressed by the architectural subtleties of her surroundings than she was by the immensities. The space was large: it could\u0027ve housed the entire citadel of any ruler in human history. The open sweep of the room said much about hidden structural forces balanced with nicety. Trusses and supporting beams behind these walls and the faraway domed ceiling must surpass anything ever before attempted. Everything spoke of engineering genius.\u003c/p\u003e\n\u003cp\u003eWithout seeming to do so, the hall grew smaller at its far end, refusing to dwarf Paul on his throne centered on a dais. An untrained awareness, shocked by surrounding proportions, would see him at first as many times larger than his actual size. Colors played upon the unprotected psyche: Paul\u0027s green throne had been cut from a single Hagar emerald. It suggested growing things and, out of the Fremen mythos, reflected the mourning color. It whispered that here sat he who could make you mourn - life and death in one symbol, a clever stress of opposites. Behind the throne, draperies cascaded in burnt orange, curried gold of Dune earth, and cinnamon flecks of melange. To a trained eye, the symbolism was obvious, but it contained hammer blows to beat down the uninitiated.\u003c/p\u003e\n\u003cp\u003eTime played its role here.\u003c/p\u003e\n\u003cp\u003eThe Reverend Mother measured the minutes required to approach the Imperial Presence at her hobbling pace. You had time to be cowed. Any tendency toward resentment would be squeezed out of you by the unbridled power which focused down upon your person. You might start the long march toward that throne as a human of dignity, but you ended the march as a gnat.\u003c/p\u003e\n\u003cp\u003eAides and attendants stood around the Emperor in a curiously ordered sequence - attentive household guardsmen along the draped back wall, that abomination, Alia, two steps below Paul and on his left hand; Stilgar, the Imperial lackey, on the step directly below Alia; and on the right, one step up from the floor of the hall, a solitary figure: the fleshly revenant of Duncan Idaho, the ghola. She marked older Fremen among the guardsmen, bearded Naibs with stillsuit scars on their noses, sheathed crysknives at their waists, a few maula pistols, even some lasguns. Those most be trusted men, she thought, to carry lasguns in Paul\u0027s presence when he obviously wore a shield generator. She could see the shimmering of its field around him. One burst of a lasgun into that field and the entire citadel would be a hole in the ground.\u003c/p\u003e\n\u003cp\u003eHer guard stopped ten paces from the foot of the dais, parted to open an unobstructed view of the Emperor. She noted now the absence of Chani and Irulan, wondered at it. He held no important audience without them, so it was said.\u003c/p\u003e\n\u003cp\u003ePaul nodded to her, silent, measuring.\u003c/p\u003e\n\u003cp\u003eImmediately, she decided to take the offensive, said: \"So, the great Paul Atreides deigns to see the one he banished.\"\u003c/p\u003e\n\u003cp\u003ePaul smiled wryly, thinking: She knows I want something from her. That knowledge had been inevitable, she being who she was. He recognized her powers. The Bene Gesserit didn\u0027t become Reverend Mothers by chance.\u003c/p\u003e\n\u003cp\u003e\"Shall we dispense with fencing?\" he asked.\u003c/p\u003e\n\u003cp\u003eWould it be this easy? she wondered. And she said: \"Name the thing you want.\"\u003c/p\u003e\n\u003cp\u003eStilgar stirred, cast a sharp glance at Paul. The Imperial lackey didn\u0027t like her tone.\u003c/p\u003e\n\u003cp\u003e\"Stilgar wants me to send you away,\" Paul said.\u003c/p\u003e\n\u003cp\u003e\"Not kill me?\" she asked. \"I would\u0027ve expected something more direct from a Fremen Naib.\"\u003c/p\u003e\n\u003cp\u003eStilgar scowled, said: \"Often, I must speak otherwise than I think. That is called diplomacy.\"\u003c/p\u003e\n\u003cp\u003e\"Then let us dispense with diplomacy as well,\" she said. \"Was it necessary to have me walk all that distance. I am an old woman.\"\u003c/p\u003e\n\u003cp\u003e\"You had to be shown how callous I can be,\" Paul said. \"That way, you\u0027ll appreciate magnanimity.\"\u003c/p\u003e\n\u003cp\u003e\"You dare such gaucheries with a Bene Gesserit?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Gross actions carry their own messages,\" Paul said.\u003c/p\u003e\n\u003cp\u003eShe hesitated, weighed his words. So - he might yet dispense with her... grossly, obviously, if she... if she what?\u003c/p\u003e\n\u003cp\u003e\"Say what it is you want from me,\" she muttered.\u003c/p\u003e\n\u003cp\u003eAlia glanced at her brother, nodded toward the draperies behind the throne. She knew Paul\u0027s reasoning in this, but disliked it all the same. Call it wild prophecy: She felt pregnant with reluctance to take part in this bargaining.\u003c/p\u003e\n\u003cp\u003e\"You must be careful how you speak to me, old woman,\" Paul said.\u003c/p\u003e\n\u003cp\u003eHe called me old woman when he was a stripling, the Reverend Mother thought. Does he remind me now of my hand in his past? The decision I made then, must I remake it here? She felt the weight of decision, a physical thing that set her knees to trembling. Muscles cried their fatigue.\u003c/p\u003e\n\u003cp\u003e\"It was a long walk,\" Paul said, \"and I can see that you\u0027re tired. We will retire to my private chamber behind the throne. You may sit there.\" He gave a hand-signal to Stilgar, arose.\u003c/p\u003e\n\u003cp\u003eStilgar and the ghola converged on her, helped her up the steps, followed Paul through a passage concealed by the draperies. She realized then why he had greeted her in the hall: a dumb-show for the guards and Naibs. He feared them, then. And now - now, he displayed kindly benevolence, daring such wiles on a Bene Gesserit. Or was it daring? She sensed another presence behind, glanced back to see Alia following. The younger woman\u0027s eyes held a brooding, baleful cast. The Reverend Mother shuddered.\u003c/p\u003e\n\u003cp\u003eThe private chamber at the end of the passage was a twenty-meter cube of plasmeld, yellow glowglobes for light, the deep orange hangings of a desert stilltent around the walls. It contained divans, soft cushions, a faint odor of melange, crystal water flagons on a low table. It felt cramped, tiny after the outer hall.\u003c/p\u003e\n\u003cp\u003ePaul seated her on a divan, stood over her, studying the ancient face - steely teeth, eyes that hid more than they revealed, deeply wrinkled skin. He indicated a water flagon. She shook her head, dislodging a wisp of gray hair.\u003c/p\u003e\n\u003cp\u003eIn a low voice, Paul said: \"I wish to bargain with you for the life of my beloved.\"\u003c/p\u003e\n\u003cp\u003eStilgar cleared his throat.\u003c/p\u003e\n\u003cp\u003eAlia fingered the handle of the crysknife sheathed at her neck.\u003c/p\u003e\n\u003cp\u003eThe ghola remained at the door, face impassive, metal eyes pointed at the air above the Reverend Mother\u0027s head.\u003c/p\u003e\n\u003cp\u003e\"Have you had a vision of my hand in her death?\" the Reverend Mother asked. She kept her attention on the ghola, oddly disturbed by him. Why should she feel threatened by the ghola? He was a tool of the conspiracy.\u003c/p\u003e\n\u003cp\u003e\"I know what it is you want from me,\" Paul said, avoiding her question.\u003c/p\u003e\n\u003cp\u003eThen he only suspects, she thought. The Reverend Mother looked down at the tips of her shoes exposed by a fold of her robe. Black... black... shoes and robe showed marks of her confinement: stains, wrinkles. She lifted her chin, met an angry glare in Paul\u0027s eyes. Elation surged through her, but she hid the emotion behind pursed lips, slitted eyelids.\u003c/p\u003e\n\u003cp\u003e\"What coin do you offer?\" she asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/dune-messiah-dune-chronicles-2/page-13.html","bookId":2154,"creation":"Oct 5, 2019 6:24:19 PM","modification":"Oct 5, 2019 6:24:19 PM"}
