{"id":102005,"no":31,"title":"Page 31","content":"\u003cp\u003e“But what?” Mercy cried.\u003c/p\u003e\n\u003cp\u003e“Think,” Shirley ordered. “There’s a way. There’s always a way.”\u003c/p\u003e\n\u003cp\u003eDefeated and depressed, Goodness walked into the darkened kitchen and threw open the refrigerator door. For a long moment, she studied the contents. It was easy to understand why so many humans turned to food for comfort. A pan of something dipped in chocolate was bound to improve any situation.\u003c/p\u003e\n\u003cp\u003e“I had hope until Roy threw out her letter,” Mercy said. “Without reading it.”\u003c/p\u003e\n\u003cp\u003e“How could he?” Shirley asked, although the question was rhetorical. “I thought humans were curious about things.” That was a characteristic they shared with angels.\u003c/p\u003e\n\u003cp\u003e“I’m sure he was tempted,” Shirley said, sadness weighting her words. “However, his fear was even stronger.”\u003c/p\u003e\n\u003cp\u003e“He was afraid?” Goodness was unable to decipher human reasoning. “Of what?”\u003c/p\u003e\n\u003cp\u003e“Of changing his mind,” Shirley explained. “He knew if he read Julie’s letter, he might be swayed. He couldn’t let that happen. He couldn’t hold on to his anger if he allowed himself to feel her love.”\u003c/p\u003e\n\u003cp\u003e“But love is what he needs!”\u003c/p\u003e\n\u003cp\u003eGoodness wanted to weep with frustration. Shirley was right. Roy had closed himself off from love, even though he needed it, even though he wanted it. He equated love with pain. Opening his heart made him vulnerable, and he couldn’t risk that after what his father and Aimee had done.\u003c/p\u003e\n\u003cp\u003e“I’d so hoped for a better outcome,” Shirley murmured forlornly, “especially for Anne’s sake.”\u003c/p\u003e\n\u003cp\u003e“Anne,” Goodness repeated, remembering Shirley’s previous connection to Roy’s mother. She studied the former Guardian Angel and detected a suspicious smile in her eyes. Quickly Shirley looked away.\u003c/p\u003e\n\u003cp\u003e“Shirley,” Goodness pressed, certain now that her friend was up to something, “you’re holding out on us.”\u003c/p\u003e\n\u003cp\u003e“Shirley?” Mercy joined in. “What did you do?”\u003c/p\u003e\n\u003cp\u003eA giggle escaped, followed by another. “I made a quick trip to New York, and…well, you’ll see soon enough.”\u003c/p\u003e\n\u003cp\u003e“Tell us!”\u003c/p\u003e\n\u003cp\u003e“And ruin the surprise?”\u003c/p\u003e\n\u003cp\u003e“Does it have to do with Roy and Julie?”\u003c/p\u003e\n\u003cp\u003eThe laughter in Shirley’s eyes faded. “Sorry, no.”\u003c/p\u003e\n\u003cp\u003e“With Anne?”\u003c/p\u003e\n\u003cp\u003eThe humor was back and she nodded. “All in good time, my friends, all in good time.”\u003c/p\u003e\n\u003cp\u003e“But what are we going to do about Roy and Julie?” Even with the clock ticking away the last hours, Goodness refused to give up. Somehow or other, they had to accomplish their goal.\u003c/p\u003e\n\u003cp\u003e“That letter could always find its way back into his life,” Goodness suggested. Of course, that might entail a bit of detective work…\u003c/p\u003e\n\u003cp\u003e“I will serve the Lord with my whole heart,” Mercy said, “but I am not digging around in someone’s garbage. That just isn’t me.”\u003c/p\u003e\n\u003cp\u003e“You would if it meant we could answer this prayer request, wouldn’t you?”\u003c/p\u003e\n\u003cp\u003eMercy looked uncertain. With her arms crossed, she cocked her head to one side and shrugged. “Well…maybe.”\u003c/p\u003e\n\u003cp\u003e“Then let’s get to it,” Goodness said with renewed hope. “We’ll find the letter, and we’ll make sure he reads it.”\u003c/p\u003e\n\u003cp\u003e“How are we going to do that?” Shirley asked.\u003c/p\u003e\n\u003cp\u003e“We’ll figure it out when the time comes,” Mercy assured her. “You can’t expect us to have all the answers, can you?”\u003c/p\u003e\n\u003cp\u003e“I don’t expect all the answers,” Goodness said, “but one answer would be nice.”\u003c/p\u003e\n\u003cp\u003e“Why make things easy?” Mercy asked pertly.\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003eWith renewed purpose the three hurried to Roy’s condo. This was their last chance, and they had to make it work.\u003c/p\u003e\n\u003cp\u003eRoy picked up the remote control and automatically flipped through the channels. He didn’t stay on any one for more than a few seconds. His patience was nonexistent, and his irritation mounted by the minute. Roy didn’t understand why he felt like this. He should be thrilled. His company had just had its best year to date. When any number of dot-com businesses were fast becoming dot-gone businesses, his own was thriving. Money and happiness, however, didn’t seem to be connected.\u003c/p\u003e\n\u003cp\u003eRoy had dreaded spending Christmas with his mother. Being continually reminded of everything she’d lost in the divorce was too much for him, especially during the holiday season. Pretending was beyond him. Now she was in New York with her college friend and he could do as he pleased.\u003c/p\u003e\n\u003cp\u003eOnly nothing pleased him.\u003c/p\u003e\n\u003cp\u003e“What did you do in other years?” he asked himself out loud.\u003c/p\u003e\n\u003cp\u003eWork had dominated his life for so long that he had no idea how to relax. Christmas Eve should be special in some way, except it wasn’t. If he was with Julie, it would be…He refused to think about Julie. She was out of his life and he was out of hers. Good. That was exactly how he wanted it.\u003c/p\u003e\n\u003cp\u003eWith nothing on television to intrigue him, Roy sat down at his computer. Because he felt he should know what was going on in the world, he left the local news channel playing in the background. He decided to surf the Internet. Maybe he’d get so absorbed investigating Web sites that the evening would vanish without his realizing where all those hours had gone; it had happened often enough before. Then he could forget that it was Christmas Eve, forget he was alone.\u003c/p\u003e\n\u003cp\u003eThat didn’t seem to work, either.\u003c/p\u003e\n\u003cp\u003eNo Web site interested him for more than a few minutes.\u003c/p\u003e\n\u003cp\u003e“A Christmas story of generosity that’s guaranteed to touch everyone’s heart,” the newscaster said from behind him. “Details after a word from our sponsors.”\u003c/p\u003e\n\u003cp\u003eRoy was in no mood to be cheered by anyone’s generosity. He turned around to reach for the remote so he could switch off the TV. Love and goodwill were not in keeping with his current mood.\u003c/p\u003e\n\u003cp\u003eThe remote was missing.\u003c/p\u003e\n\u003cp\u003eIt had been on the coffee table just a moment ago and now it was nowhere in sight. He started lifting papers and cushions in his search, but he always kept it in the same place on the coffee table. It was gone.\u003c/p\u003e\n\u003cp\u003eA sentimental commercial about a college student arriving home on Christmas Eve began to play. It was a sappy ad, meant to tug at the heartstrings. Roy had never liked it. He groaned and renewed his search for the remote.\u003c/p\u003e\n\u003cp\u003eThen the female newscaster was back. “Tonight we have the story of a single gift of twenty-five thousand dollars donated anonymously at a Salvation Army bell station.”\u003c/p\u003e\n\u003cp\u003eThe scene changed to one outside a local shopping mall. Cars whizzed past as the camera zoomed toward a lone figure standing in front of a big red pot. Dressed in his overcoat and muffler, a scarf tied around his neck, the volunteer diligently rang his bell, reminding everyone that there were others less fortunate this Christmas.\u003c/p\u003e\n\u003cp\u003eRoy continued his search with one eye on the television screen. He knew he should simply lean over and hit the power switch, but for some reason, he didn’t.\u003c/p\u003e\n\u003cp\u003e“An anonymous donor came up to Gary Wilson yesterday afternoon and slipped a cashier’s check for twenty-five thousand dollars into his collection canister. This is the largest single donation a Salvation Army bell ringer has ever received in our area.”\u003c/p\u003e\n\u003cp\u003eRoy froze, rooted to the spot, his quest for the TV remote forgotten.\u003c/p\u003e\n\u003cp\u003e“Gary, can you tell us anything about the person who gave you that check?” the reporter asked, shoving a microphone in front of the volunteer’s face.\u003c/p\u003e\n\u003cp\u003eThe poor man looked like a deer caught on the freeway, lights coming at him from every direction. “No,” he finally blurted. “I didn’t notice anyone who seemed rich enough to give away that kind of money.”\u003c/p\u003e\n\u003cp\u003eThe reporter spoke into the microphone again. “That money will go a long way toward making this Christmas a happy one for a lot of community families, won’t it?” Once more she thrust the microphone at the Salvation Army volunteer.\u003c/p\u003e\n\u003cp\u003e“I think it was a woman,” Gary Wilson said. “It was about the middle of my shift, I’d say. Things were moving pretty briskly and then this tall gal came up.” He paused. “She said Merry Christmas, and she smiled. But I don’t know if it was her or not. It could’ve been.” He punctuated his comments with a shrug. “Or maybe not. Could’ve been that short fellow who wouldn’t look me in the eye. Real short, he was.”\u003c/p\u003e\n\u003cp\u003e“Elf-size?” the reporter asked with a grin.\u003c/p\u003e\n\u003cp\u003eGary nodded. “Yup, elf-size.”\u003c/p\u003e\n\u003cp\u003e“Well, it looks like Santa won’t have to work nearly as hard in the Seattle area this year. Back to you, Jean.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Tracy,” the female announcer said.\u003c/p\u003e\n\u003cp\u003eRoy sank onto the edge of his plush leather sofa. It was Julie; she had to be the “tall gal” the volunteer had mentioned. This was a calculated move on her part. She’d…\u003c/p\u003e\n\u003cp\u003eHis thoughts ground to a halt. Julie hadn’t done it for the publicity. With a cashier’s check, she wasn’t expecting to be honored for the donation. The truth was, Roy couldn’t prove it’d been her. But it seemed more than a coincidence that the donation was the same amount as the check he’d given her.\u003c/p\u003e\n\u003cp\u003eLeaning back, he rubbed his face, then glanced at the coffee table. To his utter astonishment, there sat the remote control. He looked again, harder. Nah, couldn’t be. He leaned forward again. It hadn’t been there a moment ago. That wasn’t the only thing on the coffee table, either.\u003c/p\u003e\n\u003cp\u003eJulie’s letter lay there, right in front of him.\u003c/p\u003e\n\u003cp\u003eThis was the envelope he’d recently discarded. The envelope with his name carefully written on the front in Julie’s smooth and even cursive hand.\u003c/p\u003e\n\u003cp\u003eRoy gasped, leaped up and quickly looked around. Something very strange was happening.\u003c/p\u003e\n\u003cp\u003eHe’d been working too hard, he decided, brushing the hair away from his forehead. He left his hand there as he tried to reason this out in his troubled mind.\u003c/p\u003e\n\u003cp\u003eThe pressure had become too much for him. That was it. What hadn’t made sense a few minutes ago now seemed perfectly logical.\u003c/p\u003e\n\u003cp\u003eThe envelope almost glowed, daring him to open it. When he’d originally received the letter, the temptation to read it had been almost overwhelming. But instead, Roy had tossed it in the garbage as soon as he got home. Then, because he couldn’t get it out of his mind, he’d carried the garbage from his kitchen to the chute in the utility room. The chute deposited all garbage in a Dumpster in the basement.\u003c/p\u003e\n\u003cp\u003eYet here was the letter, back in his possession.\u003c/p\u003e\n\u003cp\u003e“Obviously I should read it,” he muttered to himself, wondering if he should look for the phone number of a psychiatrist first. This couldn’t be happening. But it was.\u003c/p\u003e\n\u003cp\u003eSinking back onto the couch, he picked up the letter. He didn’t want to read it, yet from the first word on, he felt compelled to continue. His cynicism gradually eroded as he recognized her sincerity with every sentence. He understood her exasperation with him and respected the honesty and integrity that underlined her actions, her beliefs. The most powerful of all the emotions that flowed through him as he read her letter was love. Her love.\u003c/p\u003e\n\u003cp\u003eEarlier, she’d told him she hadn’t written that she loved him, but he felt it in every word.\u003c/p\u003e\n\u003cp\u003eAfter reading the letter once, he set it aside and tried to take in everything she’d said. Then he read it again, more slowly this time, sometimes rereading a sentence twice. \u003c/p\u003e","sourceLink":"https://allnovel.net/those-christmas-angels-angels-everywhere-5/page-31.html","bookId":2629,"creation":"Oct 5, 2019 10:11:08 PM","modification":"Oct 5, 2019 10:11:08 PM"}
