{"id":102026,"no":54,"title":"Page 54","content":"\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“But under normal conditions, it wouldn’t be difficult, would it?”\u003c/p\u003e\n\u003cp\u003eShirley lifted one shoulder in a halfhearted shrug. “Not really. The thing that troubles me most is this dog. He doesn’t seem…ordinary. And he simply won’t leave. I think that problem’s finally been solved, though. He’s at the animal shelter and he’ll probably be adopted soon.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eShirley wore a sad frown. “Well, there’s nothing I can do right now, so I’ve put the matter out of my mind. I’m here to help you two.”\u003c/p\u003e\n\u003cp\u003eMercy looked crestfallen. “My assignment’s also failing.”\u003c/p\u003e\n\u003cp\u003e“You don’t happen to need a SWAT team, do you?” Goodness asked excitedly. It seemed a shame not to call out the big guns when they might be able to help her friends, too.\u003c/p\u003e\n\u003cp\u003eMercy’s expression was horrified. “Goodness, what are you thinking?”\u003c/p\u003e\n\u003cp\u003eShe held up her hands. “Imagine this: helicopters descending, ropes dropping to the ground and men—young, handsome men—sliding down to the rooftops.”\u003c/p\u003e\n\u003cp\u003e“To do what?” Mercy cried. “You’ll ruin everything. I’ve got enough troubles with Harry and Rosalie as it is. I don’t need that kind of help. Just the sound of those helicopters would send him into cardiac arrest.”\u003c/p\u003e\n\u003cp\u003e“So what can we do?” Goodness asked. “We’ve got three unfinished assignments on our hands.”\u003c/p\u003e\n\u003cp\u003e“At this point,” Mercy suggested, “maybe we should let these situations play out and see what happens.”\u003c/p\u003e\n\u003cp\u003eIt seemed so little. But perhaps Mercy and Shirley were right. She’d done her best to bring Peter and Beth together, and her efforts, such as they were, had resulted in shock and confusion. Perhaps she should step aside and see what these humans could figure out for themselves.\u003c/p\u003e\n\u003cp\u003eStill, she was disappointed.\u003c/p\u003e\n\u003cp\u003eSeventeen\u003c/p\u003e\n\u003cp\u003eCarter had been weepy and sad ever since his father had driven him to the animal shelter where they’d left Rusty. All night long, he’d lain awake, thinking about his dog. He knew how bad his parents felt, so Carter tried not to show how miserable he was.\u003c/p\u003e\n\u003cp\u003eHe realized his parents didn’t have any extra money, and even the allowance he’d saved up wasn’t enough.\u003c/p\u003e\n\u003cp\u003e“Carter,” his mother called from the living room. “Come and see what your father brought home.”\u003c/p\u003e\n\u003cp\u003eHoping against hope that it was Rusty, Carter ran into the room. It wasn’t. Instead, his mother stood in front of an artificial Christmas tree. The tree they had was dinky. So small, in fact, that it sat on the coffee table. It was in a flower pot and it was decorated with tiny glass balls. This one was real. Well, not exactly real because he could tell that the branches weren’t like those of a live tree and it didn’t have that nice Christmas smell. But it was real in size. And it came complete with strings of lights.\u003c/p\u003e\n\u003cp\u003e“A Christmas tree,” his sister squealed with delight as she joined him in the living room. “Where did you get it?”\u003c/p\u003e\n\u003cp\u003e“Your father found it,” his mother said. “On his way to work this morning, he caught a glimpse of something in an alley. He stopped, and there was the tree. Someone must’ve gotten a new tree because this one was propped up against a Dumpster. So your father brought it home for us.”\u003c/p\u003e\n\u003cp\u003eThat explained why Carter had heard his father return to the house shortly after he’d left for work.\u003c/p\u003e\n\u003cp\u003eBailey clapped her hands. Even Carter smiled. It was an old Christmas tree, a little worn and raggedy, but a whole lot better than the miniature one they had now. That one was more like a plant than a tree.\u003c/p\u003e\n\u003cp\u003eHis first thought was that he wanted to show it to Rusty, except he couldn’t because Rusty wasn’t with him anymore. It hurt to remember his dog, but Carter couldn’t think about anything else. He hoped Rusty would go to a good home and that someone in his new family would love him as much as Carter did.\u003c/p\u003e\n\u003cp\u003e“Do the lights work?” Bailey asked.\u003c/p\u003e\n\u003cp\u003e“We’ll have to see,” his mother said. She got down on the floor, crawled behind the tree and plugged in the cord. The lights flickered for a moment and then went out.\u003c/p\u003e\n\u003cp\u003e“That’s probably why it was in the garbage,” Carter told his mother.\u003c/p\u003e\n\u003cp\u003e“It’s just a pretend tree,” Bailey whined.\u003c/p\u003e\n\u003cp\u003e“It’s pathetic-looking,” Carter muttered. “But…it’s okay.” He tried to pretend he was happy about the Christmas tree, and he was, only…only it was old and the lights didn’t work and no one else wanted it. That made him think of Rusty again. No one else had wanted him, either, but Carter did, in the worst way.\u003c/p\u003e\n\u003cp\u003e“We can make it look pretty,” Bailey said, rebounding from her disappointment. “I have some colored paper from school and I could make an angel for the top,” she said excitedly.\u003c/p\u003e\n\u003cp\u003e“We could string popcorn and cranberries, too,” their mother suggested.\u003c/p\u003e\n\u003cp\u003eCarter didn’t say anything for a long time. “I know how to cut out snowflakes,” he finally told her.\u003c/p\u003e\n\u003cp\u003e“Thank you, Carter.” As if recognizing how much effort it had taken him to offer, his mother hugged him tightly.\u003c/p\u003e\n\u003cp\u003eCarter tried to squirm out of her embrace. He was too big to have his mother hug him, but at the same time he kind of liked it. He didn’t want his friends to know about it, though.\u003c/p\u003e\n\u003cp\u003e“We’ll have the tree decorated when your father gets home from work,” his mother said.\u003c/p\u003e\n\u003cp\u003e“Okay.” Carter was willing to do his share.\u003c/p\u003e\n\u003cp\u003eSoon the aroma of popping corn filled the house. Carter sat at the kitchen table and patiently pierced the kernels with one of his mother’s big sewing needles. He strung twenty-five kernels, then added a cranberry. Bailey decided to string her own and followed his pattern.\u003c/p\u003e\n\u003cp\u003e“Make it your own way,” he snapped at his sister. “You don’t have to do everything like me, you know.”\u003c/p\u003e\n\u003cp\u003e“Carter,” his mother said. “She just wants her string to match yours.”\u003c/p\u003e\n\u003cp\u003e“Why can’t she do her own design?”\u003c/p\u003e\n\u003cp\u003e“Because you’re her big brother and she looks up to you.”\u003c/p\u003e\n\u003cp\u003eCarter wanted to be angry, but he wasn’t. His sister had helped him with Rusty and had loved the stray, too.\u003c/p\u003e\n\u003cp\u003e“What do you think Rusty’s doing right now?” he asked his mother. “Will he remember me?”\u003c/p\u003e\n\u003cp\u003e“Of course he will,” his mother said. “Rusty will always remember the boy who brought him food and washed the mud off his fur.”\u003c/p\u003e\n\u003cp\u003e“And played catch with him.”\u003c/p\u003e\n\u003cp\u003eCarter thought he might cry, but instead he smiled. Thinking about all the things he’d done with Rusty seemed to ease the ache in his heart.\u003c/p\u003e\n\u003cp\u003eThe phone rang and his mother answered it quickly. “Hi, honey.”\u003c/p\u003e\n\u003cp\u003eThat meant it was his father.\u003c/p\u003e\n\u003cp\u003e“We’re decorating the tree,” his mother continued.\u003c/p\u003e\n\u003cp\u003eHis father must’ve said something else because his mother went quiet.\u003c/p\u003e\n\u003cp\u003eThen she said, “Of course. He’s right here.” Placing her hand over the mouthpiece, she turned to Carter. “Your dad said he’d like to talk to you.”\u003c/p\u003e\n\u003cp\u003e“Okay.” Scooting off the chair, Carter took the phone. “Hi, Dad.”\u003c/p\u003e\n\u003cp\u003e“How’s it going?”\u003c/p\u003e\n\u003cp\u003eCarter shrugged. “All right, I guess.”\u003c/p\u003e\n\u003cp\u003e“What do you think of the Christmas tree I found?”\u003c/p\u003e\n\u003cp\u003e“The lights don’t work,” he murmured.\u003c/p\u003e\n\u003cp\u003e“I’ll take a look at those when I get home.”\u003c/p\u003e\n\u003cp\u003eIt was unusual for his father to work on Sundays. But he must’ve been putting in overtime at the restaurant. Christmas was a busy season and his father said they could use the money, so he worked as many overtime hours as he could get.\u003c/p\u003e\n\u003cp\u003eCarter wished his father was home the way he was almost every Sunday. Usually they watched football together. If he’d been able to keep Rusty, then his dog would’ve joined them. Carter was sure Rusty would enjoy football as much as he did.\u003c/p\u003e\n\u003cp\u003e“You still feel bad about Rusty?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“So do I,” his father admitted.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“He’s going to a good family and they’ll love Rusty, too.”\u003c/p\u003e\n\u003cp\u003eBut Carter didn’t want any other family to love Rusty. He wanted Rusty to be his. He hung his head. “When will you be home?” he asked, his voice cracking.\u003c/p\u003e\n\u003cp\u003e“I’ll get there as soon as I can.”\u003c/p\u003e\n\u003cp\u003e“Bye, Dad.”\u003c/p\u003e\n\u003cp\u003e“Bye, son.”\u003c/p\u003e\n\u003cp\u003eCarter handed the phone back to his mother; before she hung up, their father spoke to Bailey, too.\u003c/p\u003e\n\u003cp\u003eThen he heard it.\u003c/p\u003e\n\u003cp\u003eA dog barking.\u003c/p\u003e\n\u003cp\u003eIt sounded as if Rusty was right outside the door. That wasn’t possible, but it sure sounded like his dog.\u003c/p\u003e\n\u003cp\u003e“What’s that noise?” his mother asked, frowning in his direction. She walked to the back door and opened it.\u003c/p\u003e\n\u003cp\u003eAs Carter held his breath, he heard his mother cry out.\u003c/p\u003e\n\u003cp\u003e“Rusty!” Bailey shrieked.\u003c/p\u003e\n\u003cp\u003e“Rusty.” Carter flew out of his chair so fast it went crashing backward onto the kitchen floor.\u003c/p\u003e\n\u003cp\u003eHis mother opened the screen door and Rusty ran in, leaping up on his hind legs and dashing around in a circle and then jumping straight up in the air.\u003c/p\u003e\n\u003cp\u003eA moment later Rusty was licking Carter’s face, yelping with joy. He flopped down on his belly, right in front of Carter, tail waving madly.\u003c/p\u003e\n\u003cp\u003eWhen Carter looked up at his mother, he saw that she had tears in her eyes. Soon she was down on the floor with him, hugging Rusty, too, along with Bailey. Even his sister was crying.\u003c/p\u003e\n\u003cp\u003e“How did he ever get here?” His mother stared at Carter.\u003c/p\u003e\n\u003cp\u003eHe didn’t have an answer for her. All he knew was that the animal shelter wasn’t close by. It was miles and miles away.\u003c/p\u003e\n\u003cp\u003eCarter got a dish and filled it with water. Rusty lapped that up and ate every bit of popcorn on the floor.\u003c/p\u003e\n\u003cp\u003e“I’m not sure if popcorn’s good for him or not,” his mother warned.\u003c/p\u003e\n\u003cp\u003eCarter went to the cupboard for the cereal he’d fed him the day before. He prepared another large bowlful, with plenty of milk. His dog certainly wasn’t a picky eater.\u003c/p\u003e\n\u003cp\u003e“Oh, Carter.” His mother sighed deeply. “I don’t know what your father’s going to say about this.”\u003c/p\u003e\n\u003cp\u003e“Don’t call him at work,” Carter pleaded. He was afraid his father would come home and take Rusty back to the shelter that very minute. He didn’t want that to happen. Not yet. Not ever. Still, he realized his father wouldn’t let Rusty stay, and he wanted to keep his dog with him as long as he could.\u003c/p\u003e\n\u003cp\u003eThey finished stringing the popcorn and draping the strands on the tree. When Carter crawled underneath, Rusty came with him. With the dog at his side, Carter plugged the electrical cord in the socket again. This time the lights went on—and stayed on.\u003c/p\u003e\n\u003cp\u003e“Cool,” his sister cried and clapped her hands.\u003c/p\u003e\n\u003cp\u003e“It’s magic,” Carter said. “Rusty brought it with him.”\u003c/p\u003e\n\u003cp\u003eWhen they crawled out from under the tree, Rusty lay down on the carpet and rested his head on his paws. He looked about as tired as Carter felt, and he wondered if Rusty had stayed awake all night, thinking about Carter, the way Carter had about him. Unable to stop himself, Carter yawned.\u003c/p\u003e\n\u003cp\u003e“Why don’t we all lie down for a bit,” his mother suggested, eyeing him. It was almost as if she knew he’d hardly slept the night before. \u003c/p\u003e","sourceLink":"https://allnovel.net/those-christmas-angels-angels-everywhere-5/page-54.html","bookId":2629,"creation":"Oct 5, 2019 10:11:08 PM","modification":"Oct 5, 2019 10:11:08 PM"}
