{"id":102027,"no":55,"title":"Page 55","content":"\u003cp\u003e“I don’t take naps,” Carter said indignantly. Bailey sometimes did. When she got cranky, their mother would send her into their bedroom. Bailey always fell asleep.\u003c/p\u003e\n\u003cp\u003e“It looks like Rusty’s tired,” his mother suggested. “I just thought you might want to keep him company.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eRusty followed Carter into his bedroom and lay on the rug beside his bed. Instead of climbing onto the mattress, Carter got down on the floor next to his dog. He flung his arm over Rusty and drifted off.\u003c/p\u003e\n\u003cp\u003eThe next thing Carter heard was the sound of his father’s voice.\u003c/p\u003e\n\u003cp\u003e“How is this possible?” his father was asking.\u003c/p\u003e\n\u003cp\u003e“Dad!” Carter leaped to his feet and tore into the kitchen, Rusty at his heels. “Did you hear?”\u003c/p\u003e\n\u003cp\u003e“Yes,” his father said. “What I don’t understand is how he found the house.”\u003c/p\u003e\n\u003cp\u003e“But he did.”\u003c/p\u003e\n\u003cp\u003eRusty approached his father and gazed up at him.\u003c/p\u003e\n\u003cp\u003eHis father bent down to pet Rusty’s thick fur. “Well, my son said you were a special dog.”\u003c/p\u003e\n\u003cp\u003e“Not only that,” Carter rushed to tell his father, “when we first plugged in the tree, the lights only flickered and then they went out.”\u003c/p\u003e\n\u003cp\u003e“And after Rusty got here, Carter plugged in the lights and they worked,” Bailey said, so happy and excited that her words ran together.\u003c/p\u003e\n\u003cp\u003eCarter frowned at his sister. “I wanted to tell Dad that.”\u003c/p\u003e\n\u003cp\u003e“Can he stay?” Ignoring him, Bailey turned to her father, eyes wide.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, kids, we’ve already been through this.”\u003c/p\u003e\n\u003cp\u003e“David, here’s the number for the shelter,” his mother said as she came into the room.\u003c/p\u003e\n\u003cp\u003e“I’m going to call and find out what happened.” His father took the slip of paper and reached for the telephone. Carter stood by his side. He wanted to learn what had happened, too.\u003c/p\u003e\n\u003cp\u003eHis father seemed to wait for a long time. Carter could hear the phone ringing. Holding the receiver away from his mouth, his dad muttered, “The shelter must be closed for the night.”\u003c/p\u003e\n\u003cp\u003eHope flared to life inside Carter. Maybe they’d have to keep Rusty overnight. Maybe—\u003c/p\u003e\n\u003cp\u003e“Hello,” his father said, dashing Carter’s hopes. “Yes, I understand the shelter’s closed.” He seemed to be listening. “We’re the family who brought Rusty. He’s the reddish stray that showed up in the schoolyard and followed my son home. I dropped Rusty off at the shelter yesterday afternoon. Well, Rusty’s now here.”\u003c/p\u003e\n\u003cp\u003eThis announcement was followed by a short silence. Carter’s father was shaking his head, as if the person on the other end of the line was arguing with him.\u003c/p\u003e\n\u003cp\u003e“I assure you he’s here.”\u003c/p\u003e\n\u003cp\u003eAnother silence.\u003c/p\u003e\n\u003cp\u003e“Well, you might want to go and check his cage.”\u003c/p\u003e\n\u003cp\u003eThe person from the shelter must’ve said something else, because his father grew quiet once more. “He’s going to check the cage where Rusty was put earlier,” he told Carter.\u003c/p\u003e\n\u003cp\u003eThe shelter employee was obviously back on the phone.\u003c/p\u003e\n\u003cp\u003e“Yes, he’s here,” his father explained for the third time. “I don’t have a clue how he escaped or how he managed to get back to this house, but somehow or other, he did.”\u003c/p\u003e\n\u003cp\u003e“Can he stay the night?” Carter pleaded. “Just one more night. Please, Dad, please.”\u003c/p\u003e\n\u003cp\u003e“Yes, I’ll bring him back in the morning,” his father was saying.\u003c/p\u003e\n\u003cp\u003eCarter wrapped his arms around Rusty’s neck. He had no idea how the dog had found his way across miles and miles of snow-covered roads to their house—but he’d always known Rusty possessed special powers.\u003c/p\u003e\n\u003cp\u003eHis father hung up the phone. “He can only stay until morning, Carter.”\u003c/p\u003e\n\u003cp\u003eCarter nodded. It wasn’t long enough, but for this one last night, Rusty was his.\u003c/p\u003e\n\u003cp\u003eEighteen\u003c/p\u003e\n\u003cp\u003e“They’re here!” Rosalie shouted from the living room. Her voice rose with excitement. She’d gone to look out the window every few minutes, waiting for their daughter and her husband.\u003c/p\u003e\n\u003cp\u003e“Is it Donna?” Harry asked. He was no less excited than his wife.\u003c/p\u003e\n\u003cp\u003e“Yes,” Rosalie said, letting the curtain fall back into place.\u003c/p\u003e\n\u003cp\u003eHarry struggled to get to his feet, and instantly Rosalie was at his side. She brought him the walker he hated and then slid her arm around his waist, guiding him into the hall.\u003c/p\u003e\n\u003cp\u003e“How do I look?” she asked.\u003c/p\u003e\n\u003cp\u003eHarry pretended to study her, noting her carefully combed hair, a soft lovely gray, and the antique cameo she wore with her dark green dress. “You couldn’t be more beautiful if you’d tried.”\u003c/p\u003e\n\u003cp\u003e“Oh, Harry.”\u003c/p\u003e\n\u003cp\u003eAt his words, Harry could see the blush of pleasure that crept across her cheeks.\u003c/p\u003e\n\u003cp\u003eThe door opened and in breezed his daughter, with Richard, their son-in-law, both of them laden with parcels and bags. Soon everyone was kissing and hugging. Rosalie had tears in her eyes and, for that matter, so did Harry. Seeing his daughter renewed his waning strength.\u003c/p\u003e\n\u003cp\u003eAll their married life, Rosalie had been a gracious hostess, and as soon as Donna and Richard had taken their coats off, she led them to the formal living room and brought out a tray of coffee and cookies.\u003c/p\u003e\n\u003cp\u003eDonna helped serve, and before long they were all sitting together, chatting and catching up. Harry watched his daughter’s animated gestures, and his heart swelled with love. In appearance, Donna resembled Rosalie’s family, with her dark brown hair and eyes. Her personality, though, was all his. She was practical but enjoyed taking a risk now and then.\u003c/p\u003e\n\u003cp\u003eDonna was a teacher and had taught kindergarten and first grade for nearly thirty years. She was close to retirement, as was Richard. They’d met in college and married soon after. They’d presented him with two wonderful grandsons, two years apart.\u003c/p\u003e\n\u003cp\u003e“Tell me about Scotty,” Rosalie said, eager for news of their youngest grandson. In a recent conversation, Donna had hinted that she had something special to share.\u003c/p\u003e\n\u003cp\u003eDonna and Richard smiled at each other, and Richard reached for his wife’s hand.\u003c/p\u003e\n\u003cp\u003e“Scott’s engaged!” Donna said happily.\u003c/p\u003e\n\u003cp\u003e“Is it Lana?” Harry asked. Their grandson had stopped by to visit in September and had brought a young woman to meet them. Harry recognized the look in his eyes. The boy was in love.\u003c/p\u003e\n\u003cp\u003e“Yes. Everyone likes Lana,” Donna said. “We’re all so pleased. Rich and I recently met her parents, and they’re just as thrilled as we are.”\u003c/p\u003e\n\u003cp\u003e“When’s the wedding?” Rosalie asked.\u003c/p\u003e\n\u003cp\u003e“February,” Donna told her mother.\u003c/p\u003e\n\u003cp\u003e“So soon!” his wife trilled, her eyes glowing. “Oh, I’m so glad.”\u003c/p\u003e\n\u003cp\u003e“Lana wanted to wait for June,” Donna said, “but Scott said a Valentine wedding was more romantic.”\u003c/p\u003e\n\u003cp\u003e“Who would’ve guessed that about Scott?” Richard asked.\u003c/p\u003e\n\u003cp\u003eRosalie glanced at Harry and they exchanged a smile. “He gets his romantic heart from his grandfather.”\u003c/p\u003e\n\u003cp\u003e“Dad?” Donna did an exaggerated double take.\u003c/p\u003e\n\u003cp\u003e“Your father’s sent me flowers every Valentine’s Day since the year we met. Even during the war.” Her eyes filled with tears as she looked at him. Pulling her lace-edged handkerchief from her sleeve, she dabbed her cheeks. “This is such good news, isn’t it, dear?”\u003c/p\u003e\n\u003cp\u003eHarry nodded. All his grandchildren would be married now. Although Harry had only met Lana that one time, he believed the young woman was a good match for his youngest grandson.\u003c/p\u003e\n\u003cp\u003e“That’s not our only news,” Donna said. Once again she smiled at Richard. “Phillip called last week and Tiffany’s pregnant.”\u003c/p\u003e\n\u003cp\u003eRosalie squealed with delight.\u003c/p\u003e\n\u003cp\u003e“Rich and I are going to be grandparents.”\u003c/p\u003e\n\u003cp\u003e“Oh, my goodness,” Rosalie said, clasping her hands. “That means Harry and I will be great-grandparents.”\u003c/p\u003e\n\u003cp\u003e“You’re much too young to be a great-grandmother,” Harry teased, just so he could watch Rosalie blush once more.\u003c/p\u003e\n\u003cp\u003e“Nonsense,” his wife countered. “Some of our friends are great-grandparents several times over.”\u003c/p\u003e\n\u003cp\u003eThat was true, and Harry didn’t bother to comment. He’d hoped to live long enough to meet his first great-grandchild but that wasn’t to be.\u003c/p\u003e\n\u003cp\u003eRichard helped himself to another cookie. Rosalie had picked them up at the bakery on Saturday, and although he wouldn’t tell her this, Harry thought they were as good as any she might have baked. Actually, he wouldn’t mind a second one himself. As soon as he stretched out his arm, Rosalie immediately lifted the platter and offered it to him.\u003c/p\u003e\n\u003cp\u003eDonna was still talking about the baby. She’d be the perfect grandmother, Harry knew. She’d been an excellent mother, and after all those years spent teaching six- and seven-year-olds, she had a real way with kids. Donna’s students loved her; it wasn’t unusual for teenagers and adults to come and see her—people, who at one time, had been in her class.\u003c/p\u003e\n\u003cp\u003e“When’s Tiffany due?” Rosalie asked.\u003c/p\u003e\n\u003cp\u003e“July,” Donna said. “We don’t know if it’s a boy or a girl, although I don’t think anyone really cares. The timing is certainly good.”\u003c/p\u003e\n\u003cp\u003eRichard smiled. “Phillip’s out of graduate school now and the job he got with Microsoft seems secure. Or as secure as any corporate job is these days.” He turned to Harry, who nodded. Over the years, they’d often discussed the economy and related issues.\u003c/p\u003e\n\u003cp\u003e“Phillip does a bit more traveling than either of them would like,” Donna added, “but he’s in training, so that goes with the territory.”\u003c/p\u003e\n\u003cp\u003eRichard sipped his coffee. “I understand the two of you are planning to sell the house,” he said.\u003c/p\u003e\n\u003cp\u003eRosalie sighed and aimed a sad smile at Harry.\u003c/p\u003e\n\u003cp\u003e“Unfortunately we had some bad news regarding Liberty Orchard,” Harry told him. In retrospect he’d give just about anything to have handed the administrator a check for the deposit the day they’d toured the facility. “Apparently the only available unit has already been taken.”\u003c/p\u003e\n\u003cp\u003eDonna leaned forward. “That’s what Mom said, so I phoned Liberty Orchard and talked to Elizabeth Goldsmith myself.”\u003c/p\u003e\n\u003cp\u003e“She can’t wave a magic wand and make another unit appear.” Harry didn’t want to admit how much the news depressed him. This was to be his last gift to Rosalie before he died, and now it wasn’t going to happen.\u003c/p\u003e\n\u003cp\u003e“When I phoned,” Donna went on to say, “Ms. Goldsmith said she was just about to contact you.”\u003c/p\u003e\n\u003cp\u003e“The unit’s available?” Harry felt a surge of hope.\u003c/p\u003e\n\u003cp\u003e“Not the one you originally saw, but another one.”\u003c/p\u003e\n\u003cp\u003e“Did someone die?” Rosalie asked, frowning.\u003c/p\u003e\n\u003cp\u003e“No, it belonged to a couple. Perhaps you met them. Ralph and Daisy—I can’t remember their last name.”\u003c/p\u003e\n\u003cp\u003e“McDonald,” Harry supplied. He remembered talking with the two and had quite liked them. Their children both lived in Chicago. “Are they moving closer to their son and daughter?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“When?” Rosalie asked.\u003c/p\u003e\n\u003cp\u003e“They hope to be out by the fifth of January. It’ll take a couple of days to give the unit a thorough cleaning and then it’ll be ready for you and Dad by the tenth.” \u003c/p\u003e","sourceLink":"https://allnovel.net/those-christmas-angels-angels-everywhere-5/page-55.html","bookId":2629,"creation":"Oct 5, 2019 10:11:08 PM","modification":"Oct 5, 2019 10:11:08 PM"}
