{"id":98251,"no":13,"title":"Page 13","content":"\u003cp\u003e“Dozer.” My voice sounds rough, so I clear my throat.\u003c/p\u003e\n\u003cp\u003e“I kept a check on his heart rate on the way here.”\u003c/p\u003e\n\u003cp\u003eI turn at the sound of Mia’s voice. I didn’t even realize she was still behind me.\u003c/p\u003e\n\u003cp\u003eShe keeps her focus on Dr. Callie as she speaks, “It stayed steady at sixty bpm. About five minutes ago, his breathing became a little labored. He has a chest contusion, not severe from what I could tell upon examination. And his front right leg is broken – possibly a mild fracture. I strapped it up the best I could with what I had.”\u003c/p\u003e\n\u003cp\u003eAnd I’ll say it again – who the fuck is this girl?\u003c/p\u003e\n\u003cp\u003eShe sounds confident, a little mechanical—just like she did back at the woods when she was checking Dozer over. Nothing like the quiet, sweet, nervous girl who came into the hotel last night.\u003c/p\u003e\n\u003cp\u003eDr. Callie looks up, removing the stethoscope from Dozer’s chest. He takes it from his ears and hangs it around his neck. “Vet or doctor?” he asks Mia.\u003c/p\u003e\n\u003cp\u003eI wait, suddenly very interested to hear her answer.\u003c/p\u003e\n\u003cp\u003e“Med student,” she answers quietly. “Second year.”\u003c/p\u003e\n\u003cp\u003eAnd just when I thought she couldn’t possibly get any hotter…\u003c/p\u003e\n\u003cp\u003eDr. Mia Monroe.\u003c/p\u003e\n\u003cp\u003eYep, she just went up a million notches on the hottie counter.\u003c/p\u003e\n\u003cp\u003eI’ve got doctor (Mia), patient (me), sex scenarios running through my mind on warp speed right now. All of them awesome.\u003c/p\u003e\n\u003cp\u003eDr. Callie turns from us and walks over to a metal trolley. He picks up a syringe.\u003c/p\u003e\n\u003cp\u003eI shudder. I fucking hate needles.\u003c/p\u003e\n\u003cp\u003eMy mom was constantly being stuck with needles while she was going through treatment.\u003c/p\u003e\n\u003cp\u003eThe treatment that didn’t save her.\u003c/p\u003e\n\u003cp\u003eDr. Callie walks back toward Dozer, syringe in hand. “Great job on the leg.” He directs his words to Mia, then looks at us both. “I’m going to need you both to wait outside now.”\u003c/p\u003e\n\u003cp\u003e“Are you going to stick that in Dozer?” I nod at the needle in his hand.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, it’s just to sedate Dozer. It won’t hurt him.”\u003c/p\u003e\n\u003cp\u003eLiar. Needles fucking hurt.\u003c/p\u003e\n\u003cp\u003eI take a step closer. “Look, I just need to know … is he going to be okay?” My voice suddenly sounds small. I’m reminded of how I sounded in the hospital when we found out the treatment hadn’t worked. That mom was going to die.\u003c/p\u003e\n\u003cp\u003eA lump forms in my throat. And my eyes start to water. A dog. I’m getting emotional over a fucking dog.\u003c/p\u003e\n\u003cp\u003eI clear my throat.\u003c/p\u003e\n\u003cp\u003e“He’s going to be fine.” Dr. Callie smiles kindly.\u003c/p\u003e\n\u003cp\u003eThe receptionist holds the door open for us. For the first time, I notice the name badge on her uniform – Penny.\u003c/p\u003e\n\u003cp\u003e“If you want to wait up front in the reception area, I’ll come and let you know how Dozer is doing as soon as I can,” Penny says.\u003c/p\u003e\n\u003cp\u003eI follow Mia to the door. Stopping, I turn back to Dr. Callie. “Take good care of him.”\u003c/p\u003e\n\u003cp\u003eHe nods.\u003c/p\u003e\n\u003cp\u003ePenny closes the door behind us, staying in the room.\u003c/p\u003e\n\u003cp\u003eI stare at the door. My eyes start to water again.\u003c/p\u003e\n\u003cp\u003eStop acting like a pussy, Matthews.\u003c/p\u003e\n\u003cp\u003e“Shall we sit?” Mia says from behind me.\u003c/p\u003e\n\u003cp\u003ePulling in a deep breath, I blink my eyes clear and turn around.\u003c/p\u003e\n\u003cp\u003eThe first thing my lowered eyes make contact with is Mia’s bare stomach.\u003c/p\u003e\n\u003cp\u003eFlat, soft creamy skin that is just begging to be licked. I lift my eyes, and of course, I have to check her tits out.\u003c/p\u003e\n\u003cp\u003eIf she just raised her hands above her head, I’d totally get a view…\u003c/p\u003e\n\u003cp\u003eJesus Christ. What the fuck is wrong with me?\u003c/p\u003e\n\u003cp\u003eShe ripped her t-shirt to help Dozer, who is currently being treated by a vet because he was hit by a car, and here I am checking her out like a sex-crazed idiot.\u003c/p\u003e\n\u003cp\u003e“I owe you a t-shirt.” I point to the bare skin I was just staring at.\u003c/p\u003e\n\u003cp\u003eShe glances down. Her cheeks flush red, and she wraps her hands around her mid-section, covering herself. “Don’t worry about it. It was just a cheap Walmart shirt.”\u003c/p\u003e\n\u003cp\u003eShe drives a Mercedes and wears Walmart? This girl makes no sense at all.\u003c/p\u003e\n\u003cp\u003e“You sure?”\u003c/p\u003e\n\u003cp\u003e“I’m sure.”\u003c/p\u003e\n\u003cp\u003eWith a brisk nod, I turn and walk past her toward the reception area.\u003c/p\u003e\n\u003cp\u003eI know she’s behind me, so when I reach the seats I step aside and allow her to sit first before taking the seat beside her.\u003c/p\u003e\n\u003cp\u003eSee, I’m not a total douche. I can be a gentleman.\u003c/p\u003e\n\u003cp\u003eI lean forward, resting my arms on my thighs. They’re still aching from carrying Dozer. This move puts me real close to Mia. She smells just like she did last night—vanilla.\u003c/p\u003e\n\u003cp\u003eNo one should smell this good. It makes functioning difficult. Or not functioning, if you catch my drift.\u003c/p\u003e\n\u003cp\u003eI can’t remember ever being this hot for a girl before. Just my fucking luck that I can’t touch her.\u003c/p\u003e\n\u003cp\u003e“Thank you … for what you did for Dozer,” I say. I don’t look at her. If I want to keep my thoughts clean, then it’s a good idea to avoid as much visual contact as possible.\u003c/p\u003e\n\u003cp\u003e“No problem.”\u003c/p\u003e\n\u003cp\u003eHer voice is so soft, just as I imagine her skin feels. Soft and warm, and I bet she’s really tight…\u003c/p\u003e\n\u003cp\u003e“I like dogs,” she adds. “All animals, in fact. They’re a whole lot nicer than people.”\u003c/p\u003e\n\u003cp\u003eThere’s a sudden sadness to her voice, and I can’t help but look at her.\u003c/p\u003e\n\u003cp\u003eHer lips are downturn, and I notice she’s still wearing those god-awful sunglasses.\u003c/p\u003e\n\u003cp\u003e“You can take the sunglasses off, you know. There’s only us here, and I’ve already seen what you’re hiding behind them.”\u003c/p\u003e\n\u003cp\u003eHer whole body stiffens.\u003c/p\u003e\n\u003cp\u003eThere’s a long pause where she does absolutely nothing. I’m not actually sure that she’s still breathing. I wonder if I’ve said the wrong thing. Gone about this the wrong way?\u003c/p\u003e\n\u003cp\u003eI don’t want to upset her.\u003c/p\u003e\n\u003cp\u003eWhy? I’m not actually sure. It’s not like I’m usually concerned with a woman’s emotional goings on. But with her, something is just … different.\u003c/p\u003e\n\u003cp\u003eShe lifts her hand to her face and slowly slides the sunglasses off.\u003c/p\u003e\n\u003cp\u003eI watch her slender fingers tremble as she turns the arms of the sunglasses in and sets them on her lap, hands covering them.\u003c/p\u003e\n\u003cp\u003eThen I notice that she has these sore looking calluses on the knuckle of her right hand. I notice them because they look out of place with the rest of her soft, flawless skin.\u003c/p\u003e\n\u003cp\u003eMaybe she has eczema or something.\u003c/p\u003e\n\u003cp\u003eI lift my eyes to her face.\u003c/p\u003e\n\u003cp\u003eHer eyes are closed. The bruise so very evident.\u003c/p\u003e\n\u003cp\u003eAnger pulses inside me again, so fucking fierce that I could punch a hole in the wall and still not feel clear.\u003c/p\u003e\n\u003cp\u003eI clench my hands in my lap. “The asshole that did that to you…?”\u003c/p\u003e\n\u003cp\u003eShe bites her lip and looks away.\u003c/p\u003e\n\u003cp\u003eThe caveman inside me is beating his chest right now, ready to beat the shit out of the asshole that did this to her. No woman should ever go through that. Especially not her. Definitely not her.\u003c/p\u003e\n\u003cp\u003e“I can hurt him, Mia. Just say the word and it’s done.”\u003c/p\u003e\n\u003cp\u003eI hear her sharp intake of breath. Wide, blue eyes meet mine.\u003c/p\u003e\n\u003cp\u003eJesus, she’s breathtaking. Even with the black eye.\u003c/p\u003e\n\u003cp\u003eHer eyes are as stunning as I knew they would be. They’re the color of the water of a caldera.\u003c/p\u003e\n\u003cp\u003eAfter high school, I went traveling with some buddies—it was before my mom got sick, and I had to come back home. We were in Lombok, an island in Indonesia, and we had trekked out to Mount Rinjani. There was a caldera there. The water stays hot permanently, due to the volcanic activity, and is so purely blue. All filtering shades rippling together to make the most amazing shade of blue you will ever see.\u003c/p\u003e\n\u003cp\u003eMia’s eyes are the exact shade of blue as that water.\u003c/p\u003e\n\u003cp\u003eBreaking our stare, she begins examining the sunglasses in hand with her eyes and fingers as if her life depends on it.\u003c/p\u003e\n\u003cp\u003eI don’t think she’s going to say anything, and I have no clue what else to say.\u003c/p\u003e\n\u003cp\u003e“No one did this to me. It was just an accident.”\u003c/p\u003e\n\u003cp\u003eHer words are softly spoken, but I feel like they’ve just punched me in my chest.\u003c/p\u003e\n\u003cp\u003eI shake my head. “People don’t hide accidents like you’re hiding that black eye. And the very fact you said it was an accident just confirms to me that someone did this to you.”\u003c/p\u003e\n\u003cp\u003eHer eyes snap up to mine. There’s an unexpected fire in them. I like it. Means there is some fight in her.\u003c/p\u003e\n\u003cp\u003e“So what if someone hurt me. What business is it of yours?”\u003c/p\u003e\n\u003cp\u003eWow, that stung. Why did that sting?\u003c/p\u003e\n\u003cp\u003eI grit my teeth and lean back in my seat. “You’re right. It’s not my business.”\u003c/p\u003e\n\u003cp\u003eHer anger instantly disappears. So quick, it surprises me.\u003c/p\u003e\n\u003cp\u003e“God, I’m so sorry. That sounded—I don’t—” She shifts in her seat, her fingers pulling on that plump lower lip. “I don’t mean to come off like a bitch. I really appreciate your offer, but hurting … him … it’s not necessary.”\u003c/p\u003e\n\u003cp\u003eI turn my head and stare her straight in the eyes. “It looks necessary from where I’m sitting.”\u003c/p\u003e\n\u003cp\u003eHer hand drops back to her lap. “Violence never solves violence.”\u003c/p\u003e\n\u003cp\u003eThis asshole blacks her eye, yet she thinks that way. She’s either a fucking angel, or really stupid. From what I’ve already seen of her, I’m going with angel. I hope she doesn’t prove me wrong on this.\u003c/p\u003e\n\u003cp\u003e“Maybe not.” I notice her eyes are on my mouth, so I swipe my lower lip with my tongue. “But trust me, it’s the only language that scum, like the bastard who did that to you, understand. And it’d make me feel a whole lot better knowing that me teaching him some manners would mean he’d keep his fuckin’ hands off you.”\u003c/p\u003e\n\u003cp\u003eSeriously, once I was done with him, he wouldn’t even breathe in her direction again. I want to hurt this asshole badly. About as badly as I want to be situated between her thighs.\u003c/p\u003e\n\u003cp\u003eWhy? I barely know this girl. Is it because I want to fuck her more than I’ve ever wanted to fuck anyone before.\u003c/p\u003e\n\u003cp\u003eNo, it’s not that. So what the hell is it?\u003c/p\u003e\n\u003cp\u003eI glance at her, and see that her eyes have filled with tears.\u003c/p\u003e\n\u003cp\u003eShit, don’t cry. I don’t do crying chicks.\u003c/p\u003e\n\u003cp\u003e“Look,” I start to speak quickly to stave off her tears, “I’m just saying that if you want me to hurt him, I will. Call it my way of paying you back for taking care of Dozer. If you don’t, you don’t. No big deal.”\u003c/p\u003e\n\u003cp\u003eBiting her lip, she nods. A tear falls from her long lashes, splashing onto her jeans.\u003c/p\u003e\n\u003cp\u003eMy chest starts to feel tight. What the fuck is that?\u003c/p\u003e\n\u003cp\u003eI look away, giving her privacy as she swipes her fingers under her eyes to dry them.\u003c/p\u003e\n\u003cp\u003eAnd also so I can rub this fucking ache out of my chest.\u003c/p\u003e\n\u003cp\u003e“Mia, I just want you to know that not all men are assholes.”\u003c/p\u003e\n\u003cp\u003eWhat. The. Fuck?\u003c/p\u003e\n\u003cp\u003eNot all men are assholes? Jesus Christ, Matthews. Yes, we are. There are just varying degrees of male assholeness.\u003c/p\u003e\n\u003cp\u003eI’m an asshole. One who would never raise his hand to a woman, and I fucking abhor men that do. But I have absolutely no problem in hooking up with a chick, then walking away from her the second my cock is out of her.\u003c/p\u003e\n\u003cp\u003eCase in point – whatsername from yesterday. See, I can’t even remember her name. That’s how big an asshole I am.\u003c/p\u003e\n\u003cp\u003eWeird thing is … I don’t want Mia to think I’m an asshole. I want her to like me.\u003c/p\u003e\n\u003cp\u003eIt’s the whole damsel in distress thing. Has to be. And the way she took care of Dozer before, so gentle with him. Frigging amazing. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-13.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
