{"id":98252,"no":14,"title":"Page 14","content":"\u003cp\u003eIt’s doing fucked up things to me.\u003c/p\u003e\n\u003cp\u003eI risk a glance and her wide, glistening, bright blue eyes are blinking back at me. Long lashes bat against her cheekbones.\u003c/p\u003e\n\u003cp\u003eJesus, she’s beautiful.\u003c/p\u003e\n\u003cp\u003eShe licks her lips and presses them together. My eyes fall to them.\u003c/p\u003e\n\u003cp\u003eI want to kiss them.\u003c/p\u003e\n\u003cp\u003eHer.\u003c/p\u003e\n\u003cp\u003eEverywhere.\u003c/p\u003e\n\u003cp\u003eRun my tongue over every inch of her silky soft skin.\u003c/p\u003e\n\u003cp\u003eI bet she tastes like vanilla. Tastes exactly like she smells.\u003c/p\u003e\n\u003cp\u003eI want to spread her legs and bury my head between her thighs. Lick her until she screams my name. Then push my cock deep inside and fuck her until we both lose our goddamn minds from the pleasure.\u003c/p\u003e\n\u003cp\u003eI might not have test driven her yet, but I just know that sex with Mia Monroe would be that good. I have a sense for these things.\u003c/p\u003e\n\u003cp\u003eYes, I know it’s totally inappropriate for me to want this at this exact moment, but people look for comfort in difficult situations, right?\u003c/p\u003e\n\u003cp\u003eAnd Dozer would understand. That dog is as horny as I am. He’s just about dry humped every piece of furniture we own. I once caught him going at it with the wooden table in the garden. Poor bastard was so desperate to get off that he risked splinters. I really should get him laid.\u003c/p\u003e\n\u003cp\u003eHoly shit. Dozer’s a virgin.\u003c/p\u003e\n\u003cp\u003eNow that’s just not right.\u003c/p\u003e\n\u003cp\u003eI swear to God right here and now – get Dozer through this and I promise the first thing I’ll do is hook him up with the hottest dog I can find. Not that I know anything about hot dogs … yeah, I caught that, I’m as funny as I am good-looking. But I think a fancy dog like a poodle or something would work for Dozer.\u003c/p\u003e\n\u003cp\u003e“So, Jordan…” I seriously dig the way she says my name. “Dozer is an unusual name for a dog. Where did that come from? He sleep a lot?” Her lips work on a smile, and my dick pulses in response.\u003c/p\u003e\n\u003cp\u003eShe’s after a subject change, and I can go with that. I let out a laugh and look away before I do something stupid like pull a Dozer and try to dry hump her leg.\u003c/p\u003e\n\u003cp\u003e“Yeah, he sleeps tons, but that’s not where it came from. Dozer was a stray. Found him at our door one night when he was a puppy. He was starving, so we took him in and fed him. We put out fliers, but no one claimed him, so we kept him. In the first week he stayed with us, he broke a shit load of stuff—ornaments, plates, glasses, even a window.”\u003c/p\u003e\n\u003cp\u003eI laugh again, remembering how pissed my dad was when Dozer jumped head first at the living room window trying to get at a bird on the porch. Shattered the window.\u003c/p\u003e\n\u003cp\u003e“Basically, Dozer broke everything he touched, and my dad said he was like a bulldozer taking down everything in his path, and it just kinda stuck. Ended up being shortened to Dozer, because he can be a little dozy at times.” I smile, then I glance in the direction of the hall. “I’ve just always thought of him as invincible, you know.”\u003c/p\u003e\n\u003cp\u003e“He’s going to be fine, Jordan. It’s just a broken leg—well, not just a broken leg, because broken legs are incredibly painful, I just meant—”\u003c/p\u003e\n\u003cp\u003eHer face has gone red. She’s flustered. Cute.\u003c/p\u003e\n\u003cp\u003e“I know what you meant.” I smile.\u003c/p\u003e\n\u003cp\u003eA small smile touches her lips. “Aside from his leg, I really don’t think there is anything else to worry about.” She touches my arm with her fingers. It’s a gentle touch, almost imperceptible. But even still, my blood turns to molten fucking lava at the contact.\u003c/p\u003e\n\u003cp\u003eShe withdraws her hand. A look of surprise on her face.\u003c/p\u003e\n\u003cp\u003eYou’re surprised, sweetheart? Well, you’re not the only one.\u003c/p\u003e\n\u003cp\u003eWith the hot lava flooding straight to the main man, I talk to distract myself from my impending boner. “So you’re a doctor,” I say, just remembering that. How the fuck did I forget that?\u003c/p\u003e\n\u003cp\u003eHell, she’s a living, breathing wet dream.\u003c/p\u003e\n\u003cp\u003e“Training to be,” she says quietly.\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003eShe slides me a glance. “Harvard.”\u003c/p\u003e\n\u003cp\u003eHarvard. She’s beautiful and incredibly smart.\u003c/p\u003e\n\u003cp\u003eThere’s isn’t anything that’s less than perfect about her. Except for the douchehole of an ex.\u003c/p\u003e\n\u003cp\u003e“Ivy League – nice.” I nod, impressed.\u003c/p\u003e\n\u003cp\u003eShe shrugs her shoulders in response and looks to the floor, kicking her sneakers together.\u003c/p\u003e\n\u003cp\u003eSo, she’s from Boston. Interesting. I don’t remember seeing that on the form she filled out last night, but then I was too busy eye-fucking her to notice where she was from.\u003c/p\u003e\n\u003cp\u003eWhat’s she doing way out here then? I’d say vacation, but women rarely vacation alone, and they always take pre-planned trips. Turning up at Golden Oaks like she did … this was an unplanned trip. And I’m guessing it had something to do with the asshole who marred that perfect face.\u003c/p\u003e\n\u003cp\u003e“So, are you originally from Boston?”\u003c/p\u003e\n\u003cp\u003eI see her hesitation. Her whole body has stiffened again.\u003c/p\u003e\n\u003cp\u003e“Yes,” she says on a breath. “Lived there my whole life.”\u003c/p\u003e\n\u003cp\u003e“What you doing way out here in Colorado?”\u003c/p\u003e\n\u003cp\u003eShe shifts in her seat, tilting her body away from me. “I’m trying to, um…” She clears her throat. “I’m here to find my mother.”\u003c/p\u003e\n\u003cp\u003eDidn’t expect that.\u003c/p\u003e\n\u003cp\u003e“You adopted?”\u003c/p\u003e\n\u003cp\u003eDid I mention I have no filter?\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “No, my father—I lived with my father. My mother left when I was a baby.”\u003c/p\u003e\n\u003cp\u003e“Shit,” I say. “So your dad … he’s okay about you been out here alone searching for your mom?” And why hasn’t he kicked the cocksucker’s ass who hurt her?\u003c/p\u003e\n\u003cp\u003e“My father is dead.”\u003c/p\u003e\n\u003cp\u003eShit. Guess that answers my questions. But what surprises me is the lack of emotion in her voice about her dad being dead.\u003c/p\u003e\n\u003cp\u003eLosing my mom was horrendous—beyond horrendous. I adored my mom. If I lost my dad … well, my world would implode.\u003c/p\u003e\n\u003cp\u003e“Sorry to hear that.” It’s a crap thing to say, but really what else is there to say.\u003c/p\u003e\n\u003cp\u003e“Thank you.” Emotionless again. Weird.\u003c/p\u003e\n\u003cp\u003eI twist in my seat to her. “So your mom lives here?”\u003c/p\u003e\n\u003cp\u003eShe brushes her golden hair from her eyes. “Apparently so. I have an address, but it was from over twenty years ago. Whether she still lives there or not, I’m not sure.”\u003c/p\u003e\n\u003cp\u003eI nod in agreement. “What’s your mom’s name? I’ve lived here my whole life. If she’s still here, I might know her. If not, my dad will. He used to be a cop. He knows everyone.”\u003c/p\u003e\n\u003cp\u003eShe sucks her top lip into her mouth. An image of me doing exactly the same plays a scene in my head.\u003c/p\u003e\n\u003cp\u003e“Anna Monroe. Well, that was her married name. I don’t know her maiden name.”\u003c/p\u003e\n\u003cp\u003eI rake through my brain for an Anna. The only person I can think of is Annie Parker, and she’s only a few years older than me. Has a mouth like a vacuum cleaner. Good memories.\u003c/p\u003e\n\u003cp\u003e“Sorry.” I shake my head.\u003c/p\u003e\n\u003cp\u003e“It’s okay.” Her smile is sad.\u003c/p\u003e\n\u003cp\u003e“Hey, how about I look up the address on my phone? See if she still lives there?”\u003c/p\u003e\n\u003cp\u003e“Would you? I never thought to do that. Thank you.” She reaches into her bag and pulls out a ratty piece of paper, then hands it to me.\u003c/p\u003e\n\u003cp\u003eI get my cell from my pocket and type the address and the name Anna Monroe into the search engine.\u003c/p\u003e\n\u003cp\u003eWhat comes up makes my heart drop for Mia. I almost don’t want to tell her.\u003c/p\u003e\n\u003cp\u003e“Anything?” God, she sounds so hopeful.\u003c/p\u003e\n\u003cp\u003eI glance up at her. “The address you have for your mom is now home to a grocery store.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eJesus, I can literally feel her disappointment like it’s my own.\u003c/p\u003e\n\u003cp\u003eMy chest feels tight again. Seriously, what the fuck is that? I rub at my sternum with my fingers.\u003c/p\u003e\n\u003cp\u003e“The houses must have been leveled for the store to be built,” I say. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Don’t be. It’s not your fault.” She takes the piece of paper from me and holds it in her hand.\u003c/p\u003e\n\u003cp\u003eShe smiles, but it’s forced.\u003c/p\u003e\n\u003cp\u003eShe looks so lost. So sad. It’s painful to see.\u003c/p\u003e\n\u003cp\u003e“I can help you find your mom, if you want?”\u003c/p\u003e\n\u003cp\u003eWhat the fuck! Have I lost my mind?\u003c/p\u003e\n\u003cp\u003eI don’t spend time with girls outside the bedroom. Apart from Beth, and that’s only because she plays for the same team as I do.\u003c/p\u003e\n\u003cp\u003eIf I spend time with Mia, I know what will happen. And I can’t get balls deep with her.\u003c/p\u003e\n\u003cp\u003eYes, I might have spent the last five minutes imagining her flat on her back, and me pounding into her like a jackhammer, but I’m not a complete bastard.\u003c/p\u003e\n\u003cp\u003eI may not know the full story, but it’s clear this girl has been through the wringer with the asshole who gave her the black eye, and now she’s searching for her mother. The mother who abandoned her when she was a baby.\u003c/p\u003e\n\u003cp\u003eMia might be the hottest girl I have ever seen … okay, she is the hottest girl I have ever seen in life, and the sweetest. And I’m so horny for her that my dick actually hurts. It motherfucking hurts.\u003c/p\u003e\n\u003cp\u003eBut the girl’s got enough to deal with.\u003c/p\u003e\n\u003cp\u003eAnd me spending an invariable amount of time around a hot girl that I cannot put my dick inside … it’s just not possible.\u003c/p\u003e\n\u003cp\u003eI might as well be in prison.\u003c/p\u003e\n\u003cp\u003eOr hell.\u003c/p\u003e\n\u003cp\u003eThat’s it, I’m in hell.\u003c/p\u003e\n\u003cp\u003eThis is payback for the chick I banged who was married.\u003c/p\u003e\n\u003cp\u003eOkay, I lied before. I totally knew she was married when I tapped that.\u003c/p\u003e\n\u003cp\u003e“Would you?” She sounds hopeful. “I mean, I wouldn’t know where to start, and you know the people in this town, so you’d know who to speak to.”\u003c/p\u003e\n\u003cp\u003e“Sure I will.” That’s it. Keep talking dickhead. Keep digging that hole deeper. “Like I said, I owe you for what you did for Dozer.”\u003c/p\u003e\n\u003cp\u003e“You don’t owe me anything, Jordan. I wanted to help you.”\u003c/p\u003e\n\u003cp\u003eShe said my name again. I’m toast.\u003c/p\u003e\n\u003cp\u003e“And I want to help you.”\u003c/p\u003e\n\u003cp\u003eAnd I want to help you. Jesus, I’m such a lame ass pussy.\u003c/p\u003e\n\u003cp\u003eIt’s official. I’ve lost my fucking mind.\u003c/p\u003e\n\u003cp\u003eThen she smiles. It’s wide and bright and dazzling, and like a sucker punch to the chest. And ball sack.\u003c/p\u003e\n\u003cp\u003eMy life has just got seriously hard.\u003c/p\u003e\n\u003cp\u003eKind of like the permanent state of my cock while around Mia Monroe.\u003c/p\u003e\n\u003cp\u003eChapter Eight\u003c/p\u003e\n\u003cp\u003eMia\u003c/p\u003e\n\u003cp\u003eI can’t believe what has just happened.\u003c/p\u003e\n\u003cp\u003eI just admitted to Jordan—a guy who I barely know—that Forbes hit me. And I also told him about my mother. The mother who abandoned me. The mother who I drove across seven states to try and find and she doesn’t even live at the address I have anymore.\u003c/p\u003e\n\u003cp\u003eI’m so stupid.\u003c/p\u003e\n\u003cp\u003eWhy didn’t I check this before I drove across the country in a lame attempt to find her?\u003c/p\u003e\n\u003cp\u003eBut what was I going to do? Go back to my apartment and make threesome with Forbes?\u003c/p\u003e\n\u003cp\u003eI don’t think so.\u003c/p\u003e\n\u003cp\u003eJordan must think I’m a real mess. And an idiot.\u003c/p\u003e\n\u003cp\u003eHe’d be right on both counts.\u003c/p\u003e\n\u003cp\u003eI think it’s best if I just get out of here. I’ll go back to the hotel, grab my things and go … where?\u003c/p\u003e\n\u003cp\u003eI’ll just find another hotel, and then I can figure out my next move.\u003c/p\u003e\n\u003cp\u003eI just hope he doesn’t tell anyone what he already knows about Forbes hitting me. Why would he? He doesn’t exactly seem like the gossipy type. But then he did say his dad used to be a cop. What if…?\u003c/p\u003e\n\u003cp\u003eNo, I would have to report it myself, and I don’t really think the local police force are going to be concerned with a stranger in town who happens to have a black eye. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-14.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
