{"id":98260,"no":23,"title":"Page 23","content":"\u003cp\u003eHe turns his head to Donnie. “Don’t fuckin’ talk to her again, or I’ll—”\u003c/p\u003e\n\u003cp\u003e“You’ll what?” Donnie tilts his head to the side. “What ya gonna do, Jordan? Set your daddy on me?”\u003c/p\u003e\n\u003cp\u003eJordan’s jaw sets rigid. “Your issue is with me,” he grinds out. “So say whatever the fuck it is you need to say, then fuck off back to your cave, you sorry piece of shit. Just leave her out of it.”\u003c/p\u003e\n\u003cp\u003eDonnie lets out another laugh. “Jeez! Easy now. You must actually like this chick. Never thought I’d see the day. Isn’t your motto ‘fuck ’em slow, leave ’em fast’? Gotta say though, can’t blame you with this one … she is fuck hot.”\u003c/p\u003e\n\u003cp\u003e“Like your girlfriend was,” Jordan bites out.\u003c/p\u003e\n\u003cp\u003eDonnie’s face goes hard like granite, and for a moment I think he’s going to hit Jordan.\u003c/p\u003e\n\u003cp\u003eInstead, his eyes slide back to me. He gives my body a full perverse perusal. It makes my stomach turn. “Bitch, when he’s done with you, you pay me a visit, and I’ll show you a good time.”\u003c/p\u003e\n\u003cp\u003eJordan jerks out of his chair, causing it to bang to the floor, bringing mine, and every eye in this place, to him.\u003c/p\u003e\n\u003cp\u003e“I said, leave her the fuck out of it!” Jordan is bristling anger.\u003c/p\u003e\n\u003cp\u003eDonnie slowly gets to his feet, shifting his chair aside.\u003c/p\u003e\n\u003cp\u003eA glance to his friends tells me they’re standing too. The situation feels dangerous. My insides start to tremble with the possibility of what’s going to happen.\u003c/p\u003e\n\u003cp\u003e“Let’s go.” Jordan’s harsh voice comes my way as he jerks out a hand for me to take.\u003c/p\u003e\n\u003cp\u003eI look at Donnie who is staring hard at Jordan. I slip my hand into Jordan’s, allowing him to pull me to my feet.\u003c/p\u003e\n\u003cp\u003eThe instant my skin makes contact with his, I feel the true level of Jordan’s anger. It’s rolling off him in waves and seeping straight into me.\u003c/p\u003e\n\u003cp\u003eSurprisingly, I don’t feel afraid. I don’t worry as to what will happen when we leave here, and I’m alone with him. What I actually feel right now is something I’ve never felt before.\u003c/p\u003e\n\u003cp\u003eI feel safe in his hands.\u003c/p\u003e\n\u003cp\u003eI know without a doubt that Jordan won’t hurt me. And I know unequivocally that he won’t let anything happen to me.\u003c/p\u003e\n\u003cp\u003eJordan pulls on my hand, leading me through the coffee shop, away from Donnie, and toward the exit.\u003c/p\u003e\n\u003cp\u003e“How’s your dad doing nowadays?” Donnie calls out.\u003c/p\u003e\n\u003cp\u003eJordan stops abruptly. I crash into his back. His hand tightens around mine gripping it to the point of almost pain.\u003c/p\u003e\n\u003cp\u003e“Heard he lost his badge. Real shame that, quality fuckin’ pig that he was.”\u003c/p\u003e\n\u003cp\u003eJordan turns, putting me behind him.\u003c/p\u003e\n\u003cp\u003eDonnie and his buddies are in the middle of the coffee shop now. Only a few tables parting them from us. I can tell from their stances and body language that they are itching for a fight. And by the way Jordan is bristling beside me, it seems like he’s going to give them one.\u003c/p\u003e\n\u003cp\u003e“I bet you really wanna hit me right now, don’t ya?” Donnie smirks. “How does this sound – I’ll let you have the first hit. Just you and me, one on one. Whaddya say? Winner gets your girl.”\u003c/p\u003e\n\u003cp\u003eDonnie tilts his head my way, the look in his eyes repulsive.\u003c/p\u003e\n\u003cp\u003eHe thinks he’s affecting me. He’s wrong. I was raised by worse. But he is affecting Jordan. I can feel how tightly wound he is.\u003c/p\u003e\n\u003cp\u003eJordan pushes his hand into his jean pocket, then presses what feels like car keys into my palm.\u003c/p\u003e\n\u003cp\u003eI look up at him, confused.\u003c/p\u003e\n\u003cp\u003e“Go to my car,” he says with a low voice. “Get in and lock all the doors. If I’m not out in five minutes, drive straight back to Durango. Don’t go to the hotel. Go to the diner, to Beth.”\u003c/p\u003e\n\u003cp\u003eI curl my hand around the keys. “And then what?”\u003c/p\u003e\n\u003cp\u003e“And then…” He shakes his head slowly.\u003c/p\u003e\n\u003cp\u003eSelf-preservation is telling me to do what he’s saying and leave this coffee shop, but I’ve never been very good at listening to my self-preservation.\u003c/p\u003e\n\u003cp\u003e“I’m not leaving here without you.” I lift my chin and put my hand on his arm.\u003c/p\u003e\n\u003cp\u003eI’m purposely and willingly touching a man filled with anger. That’s a really big thing for me. Huge, in fact.\u003c/p\u003e\n\u003cp\u003eJordan’s eyes flare, but it doesn’t deter me. “Don’t give him what he wants. You don’t have to fight this guy.”\u003c/p\u003e\n\u003cp\u003eHis eyes close as if he’s in pain. “You don’t understand.”\u003c/p\u003e\n\u003cp\u003e“Are you gonna stop whispering sweet nothings to the hot piece of ass, and let us get this over with?” Donnie cracks his knuckles.\u003c/p\u003e\n\u003cp\u003eJordan’s eyes leave me, and go straight to Donnie, hardening on him.\u003c/p\u003e\n\u003cp\u003eI see the other patrons heading out the back door.\u003c/p\u003e\n\u003cp\u003e“Leave now or I’m calling the police!” a shaky female voice, assumedly the waitress, says from behind us.\u003c/p\u003e\n\u003cp\u003e“You do that, sweet cheeks,” Donnie laughs. “I’ll be done with him before they even arrive.”\u003c/p\u003e\n\u003cp\u003eIgnoring everyone else, I keep my focus on Jordan. “Jordan.” He looks back to me. “I might not understand, but I don’t need to because I know that violence never solves anything. It won’t solve whatever this is.”\u003c/p\u003e\n\u003cp\u003eHe stares down at me. I can see a war raging in his eyes.\u003c/p\u003e\n\u003cp\u003eAfter what feels like forever, he exhales. “Okay.”\u003c/p\u003e\n\u003cp\u003eI nearly cry out with relief when he takes my hand and shifts the car keys back to his.\u003c/p\u003e\n\u003cp\u003e“Not today, Donnie.” He turns, walking away, taking me with him.\u003c/p\u003e\n\u003cp\u003e“What? You’re leaving! You’re a fuckin’ pussy, Matthews! A motherfucking pussy!”\u003c/p\u003e\n\u003cp\u003eMy heart is beating so hard, afraid that Donnie won’t simply let Jordan walk away from this and that he’ll come after him.\u003c/p\u003e\n\u003cp\u003eJordan pulls some bills from his pocket and drops them down on the counter as we pass by the wide-eyed waitress. “I’m real sorry for the trouble, ma’am.”\u003c/p\u003e\n\u003cp\u003eThen we are of out of there.\u003c/p\u003e\n\u003cp\u003eI glance over my shoulder to see if Donnie is following us. He’s not.\u003c/p\u003e\n\u003cp\u003eJordan squeezes my hand, pulling my attention back. “He won’t follow us. Despite his bravado, he’s a fuckin’ pussy. He challenged me in there because he wants an audience. He wants me to hit him first so he can get what he thinks is his revenge.”\u003c/p\u003e\n\u003cp\u003eI don’t question what that revenge is. Jordan will tell me if he wants to.\u003c/p\u003e\n\u003cp\u003eWe’re back at the Mustang in record time. He unlocks it, letting me in.\u003c/p\u003e\n\u003cp\u003eI’ve just clipped my seatbelt when I hear the sound of Jordan yelling. Seatbelt off, I’m back out of the car just in time to see Jordan’s fist connecting with the wooden fence by the parking space. “FUCK! Motherfucking fuck!”\u003c/p\u003e\n\u003cp\u003eNormally, in a situation like this I would be paralyzed by fear, but not with him. My feet carry me toward Jordan without a second thought.\u003c/p\u003e\n\u003cp\u003eHe’s standing with his forehead pressed to the fence he just beat on and his hand clutched to his heaving chest.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” I ask softly.\u003c/p\u003e\n\u003cp\u003e“I’m fine.”\u003c/p\u003e\n\u003cp\u003e“You don’t look it.”\u003c/p\u003e\n\u003cp\u003e“Well I am.”\u003c/p\u003e\n\u003cp\u003e“Can I take a look at your hand?”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because you just punched a fence and the med student in me wants to make sure it’s okay.”\u003c/p\u003e\n\u003cp\u003eHe tilts his face in my direction. The look on his face is hard. His eyes cold. The warmth I’m used to gone.\u003c/p\u003e\n\u003cp\u003e“I don’t need you to fix me, Mia.”\u003c/p\u003e\n\u003cp\u003eI feel my face flush under the harsh sting of his words.\u003c/p\u003e\n\u003cp\u003eClearing my suddenly full throat, I say, “I’m not trying to fix you. I just want to make sure you haven’t broken any bones. Nothing more.”\u003c/p\u003e\n\u003cp\u003eHis eyes close on a long blink.\u003c/p\u003e\n\u003cp\u003eStepping away from the fence, he moves toward me and holds his injured hand out.\u003c/p\u003e\n\u003cp\u003eI take it in my own, ignoring the rush of sensation I feel, and begin checking his hand, making sure he hasn’t broken anything.\u003c/p\u003e\n\u003cp\u003e“All fine.” I look up at him a few moments later. “It’s just going to be swollen and bruised for a few days. Could do with some ice on it, and we need to clean that out.” I run my fingertip over the small graze on his knuckle.\u003c/p\u003e\n\u003cp\u003eI lift my eyes to his, finding Jordan already staring down at me with dark eyes. The air instantly shifts. My pulse quickens. Fireflies swarm my stomach, setting my insides on fire.\u003c/p\u003e\n\u003cp\u003eAnd what do I do?\u003c/p\u003e\n\u003cp\u003eI release his hand and step back, putting space between us.\u003c/p\u003e\n\u003cp\u003eI might not be afraid of Jordan, but I know what anger and sex combined can mean to a man.\u003c/p\u003e\n\u003cp\u003eNot that Jordan and I will be having sex. I just don’t want to confuse an already confusing situation.\u003c/p\u003e\n\u003cp\u003eHe flexes his fingers out. “All you seem to do is fix us Matthew men up.” I notice his voice sounds gruff.\u003c/p\u003e\n\u003cp\u003e“I don’t mind.” I shrug.\u003c/p\u003e\n\u003cp\u003e“Mia…” He rubs his good hand over his hair, exhaling heavily. “I’m sorry I lost it just then. There’s just a real big ugly history with me and Donnie. It’s no excuse, but it was either that fence or his face. And better the fence, right?”\u003c/p\u003e\n\u003cp\u003e“Right.” I smile. “But I don’t think the fence would agree with you.” I poke my index finger through the hole his anger has left in it.\u003c/p\u003e\n\u003cp\u003eJordan’s body starts to shake with silent laughter. His eyes smile at me.\u003c/p\u003e\n\u003cp\u003eI let out a little laugh. “Do you want to talk about it?”\u003c/p\u003e\n\u003cp\u003eHis humor quickly dissipates. He stares at the ground for a long moment. “No,” he says, lifting his head. “Right now, I just wanna get drunk.”\u003c/p\u003e\n\u003cp\u003eIt’s pretty early to be drinking … but what the hell. I can call day drinking part of the new me.\u003c/p\u003e\n\u003cp\u003e“I could go for that.” I smile.\u003c/p\u003e\n\u003cp\u003e“That’s my girl.” He grins.\u003c/p\u003e\n\u003cp\u003eHis girl?\u003c/p\u003e\n\u003cp\u003eHis girl.\u003c/p\u003e\n\u003cp\u003eWe drive back to Durango and head straight into town where the bars are. Jordan says he’ll leave his car there and pick it up in the morning, so we’ll be getting a cab back to the hotel when we’re done.\u003c/p\u003e\n\u003cp\u003eI’ve never done anything like this before – going to a bar in the afternoon with the intention of getting drunk.\u003c/p\u003e\n\u003cp\u003eI’m kind of excited. Okay, I’m freaking thrilled. I feel like a rebel.\u003c/p\u003e\n\u003cp\u003eSad, but true.\u003c/p\u003e\n\u003cp\u003eJordan has brought me to a bar aptly called ‘The Bar’. I’m sitting at a table in the back. Jordan’s gone to get us some drinks. This round is his.\u003c/p\u003e\n\u003cp\u003eThe next is definitely mine.\u003c/p\u003e\n\u003cp\u003eHe comes back with four shots in his hands, two beer bottle under his arm. I guess we’re starting big.\u003c/p\u003e\n\u003cp\u003e“Tequila,” he says, putting two of the shots down in front of me.\u003c/p\u003e\n\u003cp\u003eI’ve never tried tequila, but what the hell. This is the new Mia. The new Mia could be a tequila drinker.\u003c/p\u003e\n\u003cp\u003eI pick up one of the shot glasses, but his voice stops me. “Salt first.”\u003c/p\u003e\n\u003cp\u003eTaking the seat across from me, Jordan picks up the salt shaker from the table.\u003c/p\u003e\n\u003cp\u003e“Hand,” he says.\u003c/p\u003e\n\u003cp\u003eI hold my right hand out to him.\u003c/p\u003e\n\u003cp\u003eWhen he takes hold, my body instantly fires on all cylinders, the traction heading straight to the right parts of my anatomy.\u003c/p\u003e\n\u003cp\u003eHe pours a line of salt on the side of my hand and says, “Lick.”\u003c/p\u003e\n\u003cp\u003eJesus Christ. That sounded really hot.\u003c/p\u003e\n\u003cp\u003eI could really get into this tequila drinking. Especially if I get to hear Jordan talk to me like that.\u003c/p\u003e\n\u003cp\u003eDoing as told, I lean my mouth down to my hand and lick the salt off. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-23.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
