{"id":98262,"no":25,"title":"Page 25","content":"\u003cp\u003eI can feel him withdrawing from me. I don’t like the way it feels.\u003c/p\u003e\n\u003cp\u003e“You’ve been good to me,” I press.\u003c/p\u003e\n\u003cp\u003eHe lets out a hollow laugh. “You’re probably the only person on this planet who can say that.” His eyes fix me with a stare. “And I haven’t really done that much for you, Mia. Not really.” He looks away from me. “There’s nothing good about me, believe me.”\u003c/p\u003e\n\u003cp\u003e“I think there is a lot that’s good about you,” I push back.\u003c/p\u003e\n\u003cp\u003eSo much. Too much.\u003c/p\u003e\n\u003cp\u003eHis eyes come back to me. Dark and angry. “Did you not hear what I said before? I completely screwed everything up. I fucked up my dad’s life.”\u003c/p\u003e\n\u003cp\u003e“No. Everything your dad did was his choice.”\u003c/p\u003e\n\u003cp\u003e“As a result of my actions.” I can see his anger rising.\u003c/p\u003e\n\u003cp\u003eThis is normally the point where I back down, give in, and agree – not that I would have ever argued this far. But with Jordan I know I can, and I’m not backing down. Not this time.\u003c/p\u003e\n\u003cp\u003e“Everyone is responsible for their own actions.”\u003c/p\u003e\n\u003cp\u003e“I fuck random women all the time. I use them for sex, then discard them like trash.”\u003c/p\u003e\n\u003cp\u003eMy breath catches in my throat, and a jealousy I shouldn’t feel hits me with a harsh wallop.\u003c/p\u003e\n\u003cp\u003eJordan grabs his beer and takes a long drink. His eyes don’t leave mine for a moment, almost like he’s daring me to look away, but I don’t … I can’t.\u003c/p\u003e\n\u003cp\u003eHis confession just doesn’t fit with the Jordan I’ve gotten to know. But then when do you really ever know anyone?\u003c/p\u003e\n\u003cp\u003eI, better than anyone, know that.\u003c/p\u003e\n\u003cp\u003eBut the thing annoying me most is the stupid little voice on repeat in my head. The voice that wonders why, if Jordan does what he says he does, hasn’t he hit on me?\u003c/p\u003e\n\u003cp\u003eI hate that I think this. I shouldn’t want him to hit on me, but I did … do.\u003c/p\u003e\n\u003cp\u003eI can feel my skin prickling.\u003c/p\u003e\n\u003cp\u003eTapping my fingertips on the table, I swallow down my feelings. “And your point is?”\u003c/p\u003e\n\u003cp\u003eMy response surprises him. I see it in the widening of his eyes.\u003c/p\u003e\n\u003cp\u003eTrying to hide his surprise, he straightens his back like he’s gearing up for round two.\u003c/p\u003e\n\u003cp\u003e“My point is … I’m responsible for those actions. They’re not the actions of a good person.”\u003c/p\u003e\n\u003cp\u003eHe wants me to dislike him. Why?\u003c/p\u003e\n\u003cp\u003eI shrug, forcing a casual I don’t feel. Then using his earlier words against him, I simply say, “Depends on how you look at it.”\u003c/p\u003e\n\u003cp\u003eHis eyebrows lift.\u003c/p\u003e\n\u003cp\u003eI’ve got his attention now.\u003c/p\u003e\n\u003cp\u003eHe leans close, arms perched on the table. “And how are you looking at it, Mia?”\u003c/p\u003e\n\u003cp\u003eGod, I totally love how he says my name.\u003c/p\u003e\n\u003cp\u003e“Well … the way I see it, you’re a lose/win. I’ve known men who do far worse things than just sleep around with lots of different women.”\u003c/p\u003e\n\u003cp\u003eOkay, so Forbes did that too – but that’s not going to help make my point, so I’ll just eclipse the fact.\u003c/p\u003e\n\u003cp\u003eHis brow furrows. “Your ex?”\u003c/p\u003e\n\u003cp\u003eI take a deep breath. “The black eye wasn’t the first time he hit me.” I rub the instant chills from my arms.\u003c/p\u003e\n\u003cp\u003eI see Jordan’s jaw tighten. “How often?” His words come out punchy.\u003c/p\u003e\n\u003cp\u003e“Um…” I lift my suddenly heavy shoulders, my confidence slipping. Memories slam into my mind. A blur of memories, mixed with two faces.\u003c/p\u003e\n\u003cp\u003eOliver…\u003c/p\u003e\n\u003cp\u003eForbes…\u003c/p\u003e\n\u003cp\u003eSlammed up against a wall.\u003c/p\u003e\n\u003cp\u003eThrown to a floor.\u003c/p\u003e\n\u003cp\u003ePinned to a bed.\u003c/p\u003e\n\u003cp\u003eThrown down the stairs.\u003c/p\u003e\n\u003cp\u003eHit.\u003c/p\u003e\n\u003cp\u003eSlapped.\u003c/p\u003e\n\u003cp\u003eKicked.\u003c/p\u003e\n\u003cp\u003ePunched.\u003c/p\u003e\n\u003cp\u003eBeaten.\u003c/p\u003e\n\u003cp\u003eBroken ribs, wrist, fingers…\u003c/p\u003e\n\u003cp\u003eHeart–broken – irreparable.\u003c/p\u003e\n\u003cp\u003eWorthless.\u003c/p\u003e\n\u003cp\u003eIn pain.\u003c/p\u003e\n\u003cp\u003eAll the time.\u003c/p\u003e\n\u003cp\u003eIt never stopped.\u003c/p\u003e\n\u003cp\u003eNo one ever saved me…\u003c/p\u003e\n\u003cp\u003e“Mia.” I feel Jordan squeezing my hand.\u003c/p\u003e\n\u003cp\u003eI blink my eyes clear.\u003c/p\u003e\n\u003cp\u003e“Jesus, are you okay?” His voice is soft, but his jaw is tight.\u003c/p\u003e\n\u003cp\u003e“Yeah, I … uh.” I touch a hand to my face, wanting to cover any emotion showing on it.\u003c/p\u003e\n\u003cp\u003e“I lost you again. Where did you go?” he asks gently.\u003c/p\u003e\n\u003cp\u003eClosing my eyes on a long blink, I shake my head and slide my hand from his.\u003c/p\u003e\n\u003cp\u003eI hear the grind in his teeth as he speaks, “How often did he hurt you?”\u003c/p\u003e\n\u003cp\u003eSwallowing down my shame, I answer, quietly, “More often than not.”\u003c/p\u003e\n\u003cp\u003eHis face freezes. He looks like he’s in pain. “Why did you stay?” It sounds more like a plea than a question.\u003c/p\u003e\n\u003cp\u003e“It’s a long story.”\u003c/p\u003e\n\u003cp\u003e“I’ve got all night … week … year.”\u003c/p\u003e\n\u003cp\u003e“It’s not worth going into.”\u003c/p\u003e\n\u003cp\u003eHe drives his hand into his hair. “But you left. Came here. What gave you the push?”\u003c/p\u003e\n\u003cp\u003e“He tried to rape me.”\u003c/p\u003e\n\u003cp\u003eI see my words hit him like a physical blow. He recoils, hands white-knuckle around the edge of the table.\u003c/p\u003e\n\u003cp\u003eThere’s this horrible strained pause between us.\u003c/p\u003e\n\u003cp\u003eI feel sick.\u003c/p\u003e\n\u003cp\u003eMy body has broken out in a cold sweat. Tremors running all over, settling into my stomach, a pit of fear and self-loathing.\u003c/p\u003e\n\u003cp\u003eI need food. And privacy.\u003c/p\u003e\n\u003cp\u003eNow.\u003c/p\u003e\n\u003cp\u003eI curl my fingernails into the bed of my hand, trying to control my urge to leap from my chair and run to the nearest convenience store.\u003c/p\u003e\n\u003cp\u003eJordan’s eyes have not left my face. A myriad of emotions scrolling through them. I don’t want to look at him right now, but I can’t seem to bring myself to look away.\u003c/p\u003e\n\u003cp\u003e“He did what?” I don’t know if he actually says the words, or mouths them because my ears are ringing with the truth.\u003c/p\u003e\n\u003cp\u003eI pull my top lip into my mouth, biting it.\u003c/p\u003e\n\u003cp\u003eI blink once. Twice. “He tried to … rape me.”\u003c/p\u003e\n\u003cp\u003e“Jesus fuckin’ Christ,” Jordan whispers angrily. Elbows on the table, he drops his head in his hands.\u003c/p\u003e\n\u003cp\u003eI shouldn’t have told him. Why did I tell him?\u003c/p\u003e\n\u003cp\u003eI shrink back into my seat, wishing to be invisible. Wanting to rewind time.\u003c/p\u003e\n\u003cp\u003eThe atmosphere is awful. The silence painful.\u003c/p\u003e\n\u003cp\u003eWhen I reach the point where I can’t take it anymore, which isn’t long, I push my chair out.\u003c/p\u003e\n\u003cp\u003eJordan’s head snaps up at the sound of wood scraping wood. “Where are you going?”\u003c/p\u003e\n\u003cp\u003e“I, uh…” I glance in the direction of the exit.\u003c/p\u003e\n\u003cp\u003eHis eyes follow mine, then flicker back. “Don’t go.” He blows out a breath, pressing at his temples with his fingers. “I’m sorry, I’m not handling this right … I just—” He shakes his head, leaning close to me. “Jesus, Mia, I just can’t handle the thought of anyone hurting you – not like that – not at all.”\u003c/p\u003e\n\u003cp\u003eHis words make it hard to breath. They matter to me more than I care to admit right now.\u003c/p\u003e\n\u003cp\u003eWhen his eyes rest on my face, they soften. “What can I do … to help you?”\u003c/p\u003e\n\u003cp\u003eAnd those squeeze my heart.\u003c/p\u003e\n\u003cp\u003e“Nothing.” I swallow past the huge lump in my throat. “I’m fine.”\u003c/p\u003e\n\u003cp\u003e“I don’t buy it. I can see it in your eyes that you’re far from fine.” A storm rolls in over his features. “Tell me where he lives.”\u003c/p\u003e\n\u003cp\u003e“W-what? Why?”\u003c/p\u003e\n\u003cp\u003e“Why do you think?”\u003c/p\u003e\n\u003cp\u003eI tense. “Jordan, I didn’t tell you so you’d go beat him up.” Why did I tell him? “I told you because…” I shake my head. “I don’t want you to beat Forbes up.”\u003c/p\u003e\n\u003cp\u003eHe frowns. “That’s his name – Forbes?”\u003c/p\u003e\n\u003cp\u003eI realize this is the first time I’ve spoken his name in almost a week. And I wonder if Jordan knowing his name is a mistake on my part.\u003c/p\u003e\n\u003cp\u003eI say nothing.\u003c/p\u003e\n\u003cp\u003eHe breaks my gaze and rests his elbows on the table, putting his head in his hands again. Tension is pouring off him in waves.\u003c/p\u003e\n\u003cp\u003eTilting his head back slightly, his eyes lift to mine. There’s a vulnerability in them that surprises me. “I need to do something, Mia.”\u003c/p\u003e\n\u003cp\u003e“Why?” My words are quiet.\u003c/p\u003e\n\u003cp\u003e“Because … I just do.” His are soft.\u003c/p\u003e\n\u003cp\u003e“You are doing something. You’re being my friend. That counts for a lot.”\u003c/p\u003e\n\u003cp\u003e“I need to do more.”\u003c/p\u003e\n\u003cp\u003e“No.” I shake my head, edging off my seat. “I don’t need more. I shouldn’t have told you. It was a mistake.”\u003c/p\u003e\n\u003cp\u003eThe skin around his eyes tightens. “You’re wrong. The only mistake was not telling me sooner.” He reaches over and grabs my hand, keeping me from leaving.\u003c/p\u003e\n\u003cp\u003eI try to ignore the way his touch makes me feel. The ache in my chest of longing for something I never knew I wanted until now.\u003c/p\u003e\n\u003cp\u003e“I wish you’d told me before now,” he adds quietly.\u003c/p\u003e\n\u003cp\u003eHe rubs his thumb gently over the back of my hand. It’s an unconscious move on his part but means so much to me.\u003c/p\u003e\n\u003cp\u003eMen don’t touch me gently. Not like this. Not ever.\u003c/p\u003e\n\u003cp\u003eAnd he’s done it twice in the matter of minutes.\u003c/p\u003e\n\u003cp\u003e“Have you told anyone else, aside from me, what he did to you?”\u003c/p\u003e\n\u003cp\u003eMy eyes widen in horror at the thought. I’m still in shock that I told him and trying to figure out what that means, let alone tell anyone else.\u003c/p\u003e\n\u003cp\u003e“I’ll take that as a no.” He shakes his head sadly. “You need to report this to the police. He can’t get away with what he did to you.”\u003c/p\u003e\n\u003cp\u003e“What? No.” Panic squeezes my stomach like a vice.\u003c/p\u003e\n\u003cp\u003e“Mia…”\u003c/p\u003e\n\u003cp\u003e“No!” My voice is harsher than I knew I had in me. I rear back, taking my hand with me.\u003c/p\u003e\n\u003cp\u003eWhatever Jordan sees on my face has him placating, “Okay. No police.” He lays his palms on the table between us. “Just do one thing for me…?” When I don’t respond, he continues. “Don’t keep anything else locked up inside you. You need someone to talk to, someone to trust – that person is me. I won’t ever judge you. I will never hurt you. And I won’t let you down. I might have done some shit things in my past, I might have treated people badly … people who didn’t deserve it, but I won’t do that to you – ever. I promise.”\u003c/p\u003e\n\u003cp\u003eHis words are impassioned, his face earnest. “You have me at my word. I won’t break it.” His mouth lifts into a gentle smile.\u003c/p\u003e\n\u003cp\u003eI want to believe him. I do.\u003c/p\u003e\n\u003cp\u003eBut it’s just not in me to be able to trust. The ability is not something I’m gifted with.\u003c/p\u003e\n\u003cp\u003eI don’t know what to say. So I do what I do best, and avoid. Smiling, I nod and ask, “So, what now?”\u003c/p\u003e\n\u003cp\u003eJordan’s dark eyes are curious on my face. For a moment, I wonder if he’s going to push it further.\u003c/p\u003e\n\u003cp\u003eHe doesn’t.\u003c/p\u003e\n\u003cp\u003e“Now…” he says, rising from his seat, “we drink more tequila.”\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003eJordan\u003c/p\u003e\n\u003cp\u003eI never thought I would want to be close to a woman as I do Mia.\u003c/p\u003e\n\u003cp\u003eBut I do. I’m just not entirely sure why.\u003c/p\u003e\n\u003cp\u003eAnd even though I am close to her, possibly closer than anyone has ever had the privilege to be, I want more.\u003c/p\u003e\n\u003cp\u003eI want all of her. In every way possible.\u003c/p\u003e\n\u003cp\u003eThe morning after the tequila had worn off, I was worried things would be weird between us.\u003c/p\u003e\n\u003cp\u003eNot because of what Mia told me had happened to her … fuck, no.\u003c/p\u003e\n\u003cp\u003eThat changed nothing in the way I see her, the way I want her.\u003c/p\u003e\n\u003cp\u003eThe only thing that has changed is how deeply I want to bury my fist into that asshole’s face.\u003c/p\u003e\n\u003cp\u003eI thought I was pissed when I knew he’d hit her. But knowing what I know now, my anger has gone so beyond pissed there isn’t even a word for it. All I know is I want to kill a man I’ve never met, and I’d do it with absolute fucking pleasure. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-25.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
