{"id":98263,"no":26,"title":"Page 26","content":"\u003cp\u003eThe look on Mia’s face when she told me what he did and how he hurt her … it was shame. Like somehow what happened was her fault.\u003c/p\u003e\n\u003cp\u003eIt made me hurt for her … for me. It’s hard to distinguish between the two now. Her pain has somehow entwined with mine.\u003c/p\u003e\n\u003cp\u003eBut that’s Mia. She’s not a person you meet, then just simply walk away from.\u003c/p\u003e\n\u003cp\u003eShe embeds herself so deep within you, without even meaning to, that you have no choice but to feel her. That’s what she’s done to me.\u003c/p\u003e\n\u003cp\u003eAnd I’m so fucking happy for it.\u003c/p\u003e\n\u003cp\u003eWhen I’m around her, I actually feel alive in a way I haven’t for a long time. And I’m going to spend every moment I have with her, making her see that none of what happened to her was her fault.\u003c/p\u003e\n\u003cp\u003eI’m going to make her see herself the way I see her.\u003c/p\u003e\n\u003cp\u003eIncredible. Strong. Beautiful.\u003c/p\u003e\n\u003cp\u003eSo fucking beautiful.\u003c/p\u003e\n\u003cp\u003eIt hurts to want her in the way I do and not be able to have her. After my brain connected with what I’d told her in that bar about myself, I was worried shitless that I might have lost her.\u003c/p\u003e\n\u003cp\u003eI couldn’t have been more wrong.\u003c/p\u003e\n\u003cp\u003eMia doesn’t care about any of it – the mistakes I’ve made. She doesn’t look at me different. She doesn’t judge me.\u003c/p\u003e\n\u003cp\u003eShe sees more in me.\u003c/p\u003e\n\u003cp\u003eShe sees the real me. The Jordan I had long forgotten existed.\u003c/p\u003e\n\u003cp\u003eThe me before the gambling, and the women … before the epic fuck-ups.\u003c/p\u003e\n\u003cp\u003eI’d spent so long believing I was a bad person. And I couldn’t see beyond that, until her.\u003c/p\u003e\n\u003cp\u003eSometimes that’s all it takes. Just one person to turn everything on its head. Remind you of the person you were.\u003c/p\u003e\n\u003cp\u003eMia makes me want to be the person I was before all the shit.\u003c/p\u003e\n\u003cp\u003eI know I sound like a pussy, but I don’t care.\u003c/p\u003e\n\u003cp\u003eI just want to be around Mia, and continue feeling the way I do when I’m with her.\u003c/p\u003e\n\u003cp\u003eAnd I’m finding that I want to be around her more often than not.\u003c/p\u003e\n\u003cp\u003eYesterday, Mia and I went into town shopping so she could get some things she needed. This was new territory for me. I’ve never shopped with a girl. Not even Beth.\u003c/p\u003e\n\u003cp\u003eIt might sound like nothing to you, but trust me, shopping with a girl was a big step for me – huge, in fact.\u003c/p\u003e\n\u003cp\u003eWhen she was all shopped out, we had lunch at the diner again. I could see Beth’s raised brow and curious looks the whole time we were there, but I didn’t leave her with an opportunity to quiz me.\u003c/p\u003e\n\u003cp\u003eI’m just not ready to discuss this … whatever this is.\u003c/p\u003e\n\u003cp\u003eOur day together was good, considering the big revelations of the night before. We had fun, and the subject of our pasts never came up. Mia didn’t mention anything about wanting to go and check out another potential mother from the list, and I wasn’t about to push her.\u003c/p\u003e\n\u003cp\u003eI was just happy to have her there with me.\u003c/p\u003e\n\u003cp\u003eI told crappy jokes. She laughed a lot. And yes, I might have been trying to win her over with my sparkling personality. I know that my face and body won’t simply be enough to win her affection. Mia’s going to need more from me, and I want to give that to her. Give her all of me.\u003c/p\u003e\n\u003cp\u003eWhen we got back to the hotel, I had chores to do, but Mia insisted on helping me. We worked together with ease.\u003c/p\u003e\n\u003cp\u003eI cooked her dinner. Granted it was only mac and cheese, but she said it was the best she’d ever tasted. After dinner, we watched a movie in the main living room with Dozer positioned as a chaperone between us.\u003c/p\u003e\n\u003cp\u003eIt was hard being that close to her in the dark and not being able to do a thing. I wanted to kiss her so very fucking badly, but it just never seemed to be the right time to make a move.\u003c/p\u003e\n\u003cp\u003eI find myself looking for clues in her words and actions, but the instant I get a hint it’s gone, and I’m left wondering if I’m just looking so hard that I’m making myself see things that don’t actually exist.\u003c/p\u003e\n\u003cp\u003eI know I’m acting like a chick, analyzing shit – I’m turning into a fucking pussy. And yes, I’m fully aware of how fucking annoying I sound, but this is what she does to me. She has me tied up in all kinds of knots.\u003c/p\u003e\n\u003cp\u003eMia is not like any girl I have ever known, and knowing what happened to her makes pursuing her all the more difficult. So I’m left with only one option – if we’re meant to happen, we will. Let nature take its course. No taking the bull by the horns for me.\u003c/p\u003e\n\u003cp\u003eI’m just hoping nature hurries the fuck up because I can feel the clock ticking with Mia.\u003c/p\u003e\n\u003cp\u003eOf course, I’m still flirting with her. That hasn’t stopped. This is me we’re talking about. I couldn’t stop if I tried. It’d be like asking Dozer not to sniff another dog’s ass.\u003c/p\u003e\n\u003cp\u003eFlirting comes as natural to me as ass sniffing does to Dozer.\u003c/p\u003e\n\u003cp\u003eAnd Mia doesn’t seem opposed to it—my flirting, I mean. I like the reaction I get from her when I do it. The blush in her cheeks gives me hope for more.\u003c/p\u003e\n\u003cp\u003eGod, I want more.\u003c/p\u003e\n\u003cp\u003eAnd right now, I’m desperately trying not to stare at her legs. It’s the first time I’ve seen them.\u003c/p\u003e\n\u003cp\u003eThank you hot sun is all I can say.\u003c/p\u003e\n\u003cp\u003eShe’s stretched out on a blanket on the walkway over the lake reading a book. Dozer is, of course, with her. Dog’s got it bad.\u003c/p\u003e\n\u003cp\u003eShe’s wearing a tank and the cut-off shorts she bought yesterday. They sit an inch or so above her knee.\u003c/p\u003e\n\u003cp\u003eThe chicks I know usually wear their cuts-offs so short their ass cheeks show, but not Mia. She keeps tugging them down, like she’s uncomfortable to be showing so much skin.\u003c/p\u003e\n\u003cp\u003eBut you know, I find her cut-offs way more sexy than the ass showing ones. They leave more to the imagination, and I know the day I do get to see underneath them, it will have been totally worth the wait because the partial leg I am getting to see is turning me on big time.\u003c/p\u003e\n\u003cp\u003eShe has great fucking legs.\u003c/p\u003e\n\u003cp\u003eMy cock twitches, so I drag my eyes from Mia and focus on steering the riding mower so I can get this damn grass cut.\u003c/p\u003e\n\u003cp\u003eMy cell starts to vibrate in my pocket. “Beth,” I answer, tucking the phone between my ear and shoulder.\u003c/p\u003e\n\u003cp\u003e“Hey … okay, so I have a date tonight.” She sounds panicked.\u003c/p\u003e\n\u003cp\u003e“And this is a good thing or a bad thing?”\u003c/p\u003e\n\u003cp\u003e“Both.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because my date is with Toni Stryder.”\u003c/p\u003e\n\u003cp\u003e“Ah, right.”\u003c/p\u003e\n\u003cp\u003eToni is a chick Beth has a huge thing for. She’s a cool girl who works as a DJ. Very hot. And sadly for all men, she’s a lesbian, just like my best buddy.\u003c/p\u003e\n\u003cp\u003eI’m well aware of how hot Beth is—I’m not fucking blind—but even if Beth didn’t play for the other team, it wouldn’t make a difference. She’s my best friend and the closest thing to a sister I have.\u003c/p\u003e\n\u003cp\u003e“I ran into her at the grocery store,” Beth says, still sounding anxious. “She’s got a gig tonight over in Grand Junction, and she asked me to go.”\u003c/p\u003e\n\u003cp\u003e“Are you sure she actually asked you out on a date, and wasn’t just asking you to go to her gig?” Beth’s been known to misread signals in the past. She’s been hurt before – badly. I won’t let it happen again.\u003c/p\u003e\n\u003cp\u003e“Yes, Dad. I’m not a complete fucktard. I know when a chick is asking me out on a date. You know, when she says, ‘Hey Beth, I was wondering, if after my set, do you want to hang out?’ So I ask, ‘What, you mean like a date?’ And she says, ‘Yeah, I mean a date.’.”\u003c/p\u003e\n\u003cp\u003e“Okay, I get it. It’s a date,” I laugh. “I’m over the fucking moon for you.”\u003c/p\u003e\n\u003cp\u003e“Good, because I need you to come with.”\u003c/p\u003e\n\u003cp\u003e“What? Aw, come on, Beth. You know I dig a threesome with two hot chicks as much as the next guy, but seriously, I’m not having a threesome with you.”\u003c/p\u003e\n\u003cp\u003e“In your fucking dreams, Matthews!” she screeches down the line.\u003c/p\u003e\n\u003cp\u003eLaughing, I hold my cell away to prevent an ear bleed. Beth has a real set of lungs on her, but I can’t help winding her up. She’s too easy.\u003c/p\u003e\n\u003cp\u003eI put the phone back to my ear. “Seriously though, screechy, what do you need me there for?”\u003c/p\u003e\n\u003cp\u003e“Because Toni’s set lasts for an hour and a half, and I don’t want to sit in the club on my own.”\u003c/p\u003e\n\u003cp\u003e“So just go after her set is finished.”\u003c/p\u003e\n\u003cp\u003e“I can’t. I said I’d watch her play. Please, Jordan. I’m really nervous about it. Toni is the hottest chick I’ve ever met. And she’s cool. I’m not cool.”\u003c/p\u003e\n\u003cp\u003e“You’re cool, Beth.”\u003c/p\u003e\n\u003cp\u003eShe makes a scoffing sound.\u003c/p\u003e\n\u003cp\u003e“Seriously, we need to work on your confidence.”\u003c/p\u003e\n\u003cp\u003e“Okay, so let’s work on it tonight. You can give me pointers on how to act around Toni. This is what you’re awesome at—talking to hot girls and being cool. You can make me awesome at it too. And if I start to act like … well … me, you can give me a nudge … and I know there will be plenty of hot girls for you to hook up with after you’ve finished coaching me.”\u003c/p\u003e\n\u003cp\u003eShe thinks she’s coaxing me by adding that, but I don’t want to be that guy anymore. I don’t want to be out in a club picking up chicks. I want to be with Mia.\u003c/p\u003e\n\u003cp\u003ePressing on the breaks, I stop and look over at her. She’s lost in her book. She looks so fucking beautiful. She looks like everything I never knew I wanted.\u003c/p\u003e\n\u003cp\u003eI cut the engine, taking the phone into my hand.\u003c/p\u003e\n\u003cp\u003e“Does your silence mean you’re considering?” Beth asks, sounding hopeful.\u003c/p\u003e\n\u003cp\u003eI don’t want to let Beth down. And if I go out, it doesn’t mean I have to end the night with a girl in my bed. I could just go, then leave after Beth’s feeling okay with Toni.\u003c/p\u003e\n\u003cp\u003eI exhale. “I’m considering. Keep talking.”\u003c/p\u003e\n\u003cp\u003e“Okay … so it’s free entry, courtesy of Toni. And I’ll buy your drinks all night. Also, it’s a paint party, something different.”\u003c/p\u003e\n\u003cp\u003e“What the fuck’s a paint party?”\u003c/p\u003e\n\u003cp\u003e“From what Toni said, paint is sprayed all over the clubbers.”\u003c/p\u003e\n\u003cp\u003e“Sounds awesome.”\u003c/p\u003e\n\u003cp\u003e“Don’t be snarky. So will you come? Please.”\u003c/p\u003e\n\u003cp\u003eMy eyes wander to Mia again, and a thought starts to form … I could ask Mia to come with me.\u003c/p\u003e\n\u003cp\u003eMia and me together in a club … dancing … hot and sweaty … our bodies close together…\u003c/p\u003e\n\u003cp\u003eThis could make things happen. Or at the very least, move things on a little bit.\u003c/p\u003e\n\u003cp\u003e“Okay, I’ll come. But I’m bringing someone.”\u003c/p\u003e\n\u003cp\u003e“Yay! Jordan, you are the best effin friend ever!”\u003c/p\u003e\n\u003cp\u003e“I know,” I deadpan. “So what time is this thing?”\u003c/p\u003e\n\u003cp\u003eIgnoring my question, she asks, “So, who are you bringing? Anyone I know?”\u003c/p\u003e\n\u003cp\u003e“What time, Beth?”\u003c/p\u003e\n\u003cp\u003eShe sighs at my blatant dismissal. “Toni’s set starts at nine. One other thing … can you drive? My car is in the shop.”\u003c/p\u003e\n\u003cp\u003e“Fuckin’ hell! So the drinks you planned on buying me all night …?”\u003c/p\u003e\n\u003cp\u003e“Soda.”\u003c/p\u003e\n\u003cp\u003eI can’t help but laugh at her audacity.\u003c/p\u003e\n\u003cp\u003e“I’ll owe you.”\u003c/p\u003e\n\u003cp\u003e“You will. Big time.”\u003c/p\u003e\n\u003cp\u003e“What am I gonna end up doing? Your laundry or something equally gross?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” I switch the phone to my other ear. “But I’m sure I can come up with something good.”\u003c/p\u003e\n\u003cp\u003e“Whatever it is, it’ll be worth it for a date with Toni,” she says in a dreamy voice. “So come on, tell me who you’re bringing tonight? It’s not like you to play coy. Am I missing something here?” \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-26.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
