{"id":98265,"no":28,"title":"Page 28","content":"\u003cp\u003eMy heart takes flight, buzzing around my chest.\u003c/p\u003e\n\u003cp\u003eHe leans down to my ear. “Is this okay?” His warm breath whispers over my skin.\u003c/p\u003e\n\u003cp\u003eShivering, I turn my head resting my chin against my shoulder, I stare into his eyes. “It’s more than okay.”\u003c/p\u003e\n\u003cp\u003eHe lifts my hand, bringing me close to his side, and brushes a kiss over my knuckles.\u003c/p\u003e\n\u003cp\u003eI can hardly take my eyes off him. He becomes more beautiful and more precious to me with each passing second, and it terrifies me.\u003c/p\u003e\n\u003cp\u003eHe’s too good for someone like me. Forbes was right when he said I was nothing. I’m not meant for someone as good as Jordan.\u003c/p\u003e\n\u003cp\u003eThe happiness I was feeling disappears. My stomach drops. I look ahead and find Beth looking over her shoulder at us, smiling.\u003c/p\u003e\n\u003cp\u003eThen she catches my eye, and her smile vanishes. I quickly look away, and paste on a fake smile, relieved when the club comes into view.\u003c/p\u003e\n\u003cp\u003eWe follow Beth over to the doorman, and thanks to Toni putting us on the guest list, we don’t have to wait in the huge line.\u003c/p\u003e\n\u003cp\u003eI’ve only ever been in a club one time before. It was with Forbes and his rich douchey friends. That club was a bit nicer than this place, but I actually prefer this club. It looks how a club should look. All dark and grungy. Floor sticky from spilt drinks.\u003c/p\u003e\n\u003cp\u003eIt feels real.\u003c/p\u003e\n\u003cp\u003eThe bass is pumping loud, vibrating up through my feet, and I feel a tremor of excitement at being here; doing something out of my ordinary.\u003c/p\u003e\n\u003cp\u003eThe club is packed; a sea of people. I notice most of the girls are dressed in fewer clothes than me, wearing shorts and cut-off t-shirts. I wish I could wear shorts as short as they are, but the scars on the back of my thighs prevent me from doing so as does my severe lack of confidence.\u003c/p\u003e\n\u003cp\u003eMy good feeling instantly disappears, leaving me feeling dowdy and out of place, and wondering just why the hell Jordan is here with me. A sudden urge to leave so I can hide away and comfort eat myself until I’m sick compels me.\u003c/p\u003e\n\u003cp\u003eI curl my fingers into my hand, pressing my nails into my skin, trying to expel the urge.\u003c/p\u003e\n\u003cp\u003eAs if hearing my pain, Jordan squeezes my hand. I glance up at him. “Hey, you okay?” he mouths over the music.\u003c/p\u003e\n\u003cp\u003eWith a fake smile, I nod.\u003c/p\u003e\n\u003cp\u003eHe looks at me for too long, suspicion curving his mouth. It feels like he’s trying to see deep inside me, and it makes me fidgety, so I look away.\u003c/p\u003e\n\u003cp\u003eHe moves closer. I know he’s going to question me further. I feel his body press against my side, and my body goes to war with my mind. I want him close, yet I want him to go away.\u003c/p\u003e\n\u003cp\u003eI’m saved by Beth, when she comes bounding over.\u003c/p\u003e\n\u003cp\u003e“Toni’s coming out in ten, so let’s get a drink first, then we can go see her,” she yells over the music.\u003c/p\u003e\n\u003cp\u003eJordan steps back giving me space. I almost exhale in relief. I can feel his eyes burning into me, but I can’t bring myself to meet his stare.\u003c/p\u003e\n\u003cp\u003eSmiling at Beth, I say, “Sure. Sounds good.”\u003c/p\u003e\n\u003cp\u003eBeth leads the way to the bar. Jordan is close behind me. When we reach the bar, I stand beside Beth. Jordan comes up behind, hands either side of me, placing them on the bar and caging me in.\u003c/p\u003e\n\u003cp\u003eMy body is fully aware of how close he is and wants him closer. My hands are itching to reach back and pull him to me.\u003c/p\u003e\n\u003cp\u003e“Drinks are on me, so what do you both want?” Beth says.\u003c/p\u003e\n\u003cp\u003e“I’ll get the drinks,” Jordan’s deep voice comes between us.\u003c/p\u003e\n\u003cp\u003eBeth’s eyes flicker to him. “No way! Deal was that I’d buy your drinks tonight for coming with me.”\u003c/p\u003e\n\u003cp\u003e“Deal’s off. Now tell me what you want?” There’s an air of authority in his voice, which I surprisingly like. It has my skin tingling, and other parts of me.\u003c/p\u003e\n\u003cp\u003eBeth, seemingly unaffected by him, says, “Fine. I’m not gonna argue with you. Saves me a few dollars. I’ll have a whiskey and soda – make it a Fireball.”\u003c/p\u003e\n\u003cp\u003e“Mia … what do you want?” he speaks in my ear, his voice deep and breathy. It makes my toes curl.\u003c/p\u003e\n\u003cp\u003eI feel like he’s not asking me about choice of drinks right now. And I know exactly what I want – him.\u003c/p\u003e\n\u003cp\u003eI turn my head, only to find my mouth now dangerously close to his. And by dangerously, I mean dangerous because of my insistent need to kiss him right now. If that’s going to happen tonight, then here at the bar is most definitely not the place.\u003c/p\u003e\n\u003cp\u003eMy eyes meet his, just in time to see them darken. He feels it too … wants this … me.\u003c/p\u003e\n\u003cp\u003eMy body goes into overdrive.\u003c/p\u003e\n\u003cp\u003eQuickly gathering myself, I say, “Beer. Bottled. Please.” And I face forward.\u003c/p\u003e\n\u003cp\u003eCasting a sideways glance, I see Beth smiling happily at us. I’m kind of getting the feeling she likes me with Jordan.\u003c/p\u003e\n\u003cp\u003eJordan’s hands come from around me. He moves to the side and leans up against the bar to get served. I feel a tap my shoulder, and turn to a smiling Beth. She moves back a little away from Jordan, so I follow.\u003c/p\u003e\n\u003cp\u003e“How are you finding Durango?” she asks.\u003c/p\u003e\n\u003cp\u003eI smile, thinking of Jordan—the one thing that I really like about this town. “I like it.”\u003c/p\u003e\n\u003cp\u003e“Yeah, it’s not so bad. But when you’ve lived here your whole life, like I have, it becomes a bit boring.”\u003c/p\u003e\n\u003cp\u003eI get that, knowing how it felt to be trapped in Boston my whole life.\u003c/p\u003e\n\u003cp\u003e“You’ve never been anyway else?” I ask.\u003c/p\u003e\n\u003cp\u003e“Sure, I’ve been away on vacation, but nowhere exciting. I’d love to go to traveling.”\u003c/p\u003e\n\u003cp\u003e“You should.”\u003c/p\u003e\n\u003cp\u003e“Jordan’s been traveling.”\u003c/p\u003e\n\u003cp\u003e“Yeah, he told me. South East Asia, right?”\u003c/p\u003e\n\u003cp\u003eBeth looks a little surprised at my knowing this, which quickly morphs into a smile.\u003c/p\u003e\n\u003cp\u003eBefore I get a chance to consider her reaction, a high-pitched female voice grabs my attention. Mainly, because she’s screeching Jordan’s name.\u003c/p\u003e\n\u003cp\u003eI turn to see a very pretty bartender with long dark hair and legs even longer. She seemingly knows Jordan very well if the look on her face is anything to go by as she leans over the bar and throws her arms around his neck.\u003c/p\u003e\n\u003cp\u003eMy stomach tightens into a knot of jealous ire. Stupid, I know, but still there nonetheless.\u003c/p\u003e\n\u003cp\u003eHe awkwardly pats her back, then quickly pulls her arms from around him. She grabs hold of his forearm, keeping him with her, but I watch him remove her hand. She leans in and says something. He shakes his head, which she clearly doesn’t like if the pissed off look on her face is any indication.\u003c/p\u003e\n\u003cp\u003eShe stares at him for a long moment, then without another word turns away and starts making our drinks.\u003c/p\u003e\n\u003cp\u003eJordan turns in our direction. I quickly look away so he doesn’t see I’m watching.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t worry about it,” Beth says close to my ear. “All women behave like that around him.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but more so the ones he’s already slept with.” The words are out of my mouth before I can stop them. I clamp my mouth shut.\u003c/p\u003e\n\u003cp\u003eI can’t believe I just said that.\u003c/p\u003e\n\u003cp\u003eBeth will, without doubt, be aware of Jordan’s past when it comes to women, but it’s not my place to pass comment.\u003c/p\u003e\n\u003cp\u003eShe lifts her eyebrow. “He has been talking to you. I’m glad, but surprised he told you that stuff. Still, I’ll take it as a good sign considering you’re here on a date with him. You must really like him.” Then she smiles wide. “And he must really like you.”\u003c/p\u003e\n\u003cp\u003eI can’t say her words don’t affect me because they do. I want Jordan to like me.\u003c/p\u003e\n\u003cp\u003e“What makes you think that?” I ask.\u003c/p\u003e\n\u003cp\u003e“Because he’s never been that honest with a girl before. Hell, he’s never been on an actual date before. And if he’s telling you all his shit up front, then you must really mean something to him. He must think a lot of you. He wants you to know the truth, and that’s a big step for him.”\u003c/p\u003e\n\u003cp\u003eI honestly don’t know what to say, so I say nothing.\u003c/p\u003e\n\u003cp\u003e“Look, I don’t know how long you’re here for, Mia, and I know Jordan might come off as being a bad ass, but he’s not. Not really. When he cares about someone, he cares about them with everything. And he takes, losing someone he cares about, badly.”\u003c/p\u003e\n\u003cp\u003e“His mom?”\u003c/p\u003e\n\u003cp\u003e“Holy crap! He told you about his mom? Shit, he does like you.” She grins and wraps an arm around my waist. The contact surprises me and locks every muscle in my body. It does every time a new person touches me. “Just don’t break his heart now that he’s finally got it working, please.” She laughs lightly.\u003c/p\u003e\n\u003cp\u003eMy insides coil. “I don’t think I have the power to do that.”\u003c/p\u003e\n\u003cp\u003e“Oh, you’d be surprised,” she says, lowering her voice.\u003c/p\u003e\n\u003cp\u003eI lift my eyes to see a smiling, but curious Jordan walking toward us, hands laden with our drinks.\u003c/p\u003e\n\u003cp\u003eHe hands me my beer.\u003c/p\u003e\n\u003cp\u003e“Thanks.” I smile. His eyes hold mine for a moment before moving to Beth.\u003c/p\u003e\n\u003cp\u003e“You wanna go see Toni now?” He hands Beth her drink.\u003c/p\u003e\n\u003cp\u003e“You know what?” Her eyes dart to me, then back to Jordan, a smile creeping across her face. “I’m good. I got this with Toni.”\u003c/p\u003e\n\u003cp\u003eJordan’s brow creases in confusion. “You sure?”\u003c/p\u003e\n\u003cp\u003e“I’m sure,” she says, walking backwards and away from us into the crowd. “You two go have fun.” Before turning away, she gives me a conspiratory wink.\u003c/p\u003e\n\u003cp\u003eSubtle much? I have to hold back a laugh.\u003c/p\u003e\n\u003cp\u003e“If you need me, call my cell,” Jordan calls after her.\u003c/p\u003e\n\u003cp\u003eBeth waves a hand in acknowledgement before disappearing into the crowd.\u003c/p\u003e\n\u003cp\u003eJordan turns to me. “So … it’s just you and me.”\u003c/p\u003e\n\u003cp\u003eShivers and a whole bunch of nerves swarm me. “It is.”\u003c/p\u003e\n\u003cp\u003e“You wanna try and find somewhere to sit?”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eI follow Jordan upstairs where he says it’ll be quieter and we’ll be more likely to find a seat. He’s right. We find an empty sofa overlooking the dance floor below.\u003c/p\u003e\n\u003cp\u003eI sit down first. Jordan sits beside me. My nerves have ratcheted up a couple of thousand notches now because it’s just him and me. No Beth as a buffer. I can’t think of a single thing to say to him, so I cover it up by continuously sipping on my drink and pretending to be fascinated by all the people in the club.\u003c/p\u003e\n\u003cp\u003e“You’re still nervous.” His hand comes up, pulling mine from my mouth. I was playing with my lip without even realizing.\u003c/p\u003e\n\u003cp\u003eJordan slides his fingers through mine, holding my hand. My stomach scatters.\u003c/p\u003e\n\u003cp\u003eI turn my face to him, not realizing how close he is, bringing me almost nose to nose with him. My cheeks heat. I shuffle across the sofa, putting myself up against the arm rest, and I don’t deny the nerves. There’s no point. Not when he can read me so well.\u003c/p\u003e\n\u003cp\u003e“Is it me who’s making you nervous? Something I’m doing, or just the whole being on a date with me thing?”\u003c/p\u003e\n\u003cp\u003eI turn my body to him. My knees touch his thigh. “It’s not you. It’s just being on a date. I’ve only dated one guy before, and that didn’t work out so well for me.” Without thought, I touch the healing cut on my brow.\u003c/p\u003e\n\u003cp\u003eHis eyes follow my hand, and they stayed trained on the remnant of my relationship with Forbes long after I’ve moved my hand away.\u003c/p\u003e\n\u003cp\u003eHis face is impassive, but I know his mind is working. I can see it in his eyes. I’m wondering if all I’ve done is remind him of the mess I came from … the mess I am … what Forbes did to me … that I carry too much baggage. Have I turned him off me? \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-28.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
