{"id":101082,"no":3,"title":"Page 3","content":"\u003cp\u003eThen degrade and beat senseless the moment the doors to our house slammed shut.\u003c/p\u003e\n\u003cp\u003eForbes has never asked about my past. Never questioned the scars that mar those secret parts of my body.\u003c/p\u003e\n\u003cp\u003eI remember being so afraid the first time we made love. Afraid he would ask about them, but he never did. Part of me was relieved but disappointed.\u003c/p\u003e\n\u003cp\u003eI encouraged myself to believe that he hadn’t asked because he didn’t want to make me feel uncomfortable, or upset me by highlighting them.\u003c/p\u003e\n\u003cp\u003eTruth is, he didn’t ask because he didn’t care. My scars probably validated that I was exactly the right girl for him.\u003c/p\u003e\n\u003cp\u003eMaybe he saw it in me the second our eyes met in that bar that night.\u003c/p\u003e\n\u003cp\u003eLike knows like, right?\u003c/p\u003e\n\u003cp\u003eReaching into the fridge, I start pulling out food, setting it on the counter.\u003c/p\u003e\n\u003cp\u003eLeaving the door open for light, I turn to the cabinet to get more food. When I’m sure I have enough to see me through, I tear off the foil from yesterday’s saved chicken. And I start eating.\u003c/p\u003e\n\u003cp\u003eI’m sitting on the floor, sweat dampening my skin, my hands sticky from food. My stomach full and aching, my back pressed up against the door. Surrounding me are empty food containers and wrappers.\u003c/p\u003e\n\u003cp\u003eKnowing I can’t sit here all night, I get to my feet. My stomach aches under the pressure of gravity.\u003c/p\u003e\n\u003cp\u003eI’m uncomfortable. I feel sick.\u003c/p\u003e\n\u003cp\u003eI relish the feeling.\u003c/p\u003e\n\u003cp\u003eI tidy the mess. Containers in the dishwasher. Wrappers pushed to the bottom of the trash can, so Forbes won’t see them. Not that he’d question it, but better to be safe. I try never to leave a reason to set his anger off.\u003c/p\u003e\n\u003cp\u003eI wash my hands clean. Then go to the bathroom and lock the door.\u003c/p\u003e\n\u003cp\u003eI leave the light off. I don’t want to risk catching a glimpse of myself in the mirror in this moment.\u003c/p\u003e\n\u003cp\u003eKneeling before the toilet, I lift the seat.\u003c/p\u003e\n\u003cp\u003eFingers poised by my lips, I push back, and make all the hurt go away.\u003c/p\u003e\n\u003cp\u003eChapter Two\u003c/p\u003e\n\u003cp\u003eMia\u003c/p\u003e\n\u003cp\u003eI’m back at Oliver’s house to finish packing. My last day here. After today, I will never again have to come to this house.\u003c/p\u003e\n\u003cp\u003eThe knowledge is like clean air in my lungs.\u003c/p\u003e\n\u003cp\u003eAll that’s left to empty is his office.\u003c/p\u003e\n\u003cp\u003eI left this room until last because I despise this room.\u003c/p\u003e\n\u003cp\u003eOliver always beat me in his office, as though he thought that if he kept it to one room, he could leave this room and lock the door on it when he was done.\u003c/p\u003e\n\u003cp\u003eThat’s never been the case for me, but being in here does bring things back full throttle.\u003c/p\u003e\n\u003cp\u003eBad memories start to scream out in the silence.\u003c/p\u003e\n\u003cp\u003eI sit down on the floor and get my iPhone out. Setting the music to play, I place it up on Oliver’s desk.\u003c/p\u003e\n\u003cp\u003eHe loved this desk. It belonged to his grandfather.\u003c/p\u003e\n\u003cp\u003eI should burn it. Just like I should have burned Oliver’s body. Cremated him to dust. Make sure he was gone for good.\u003c/p\u003e\n\u003cp\u003eUnfortunately for me, Oliver had it set in his will that he was to be buried.\u003c/p\u003e\n\u003cp\u003eHe’d already purchased a plot. I also discovered he had bought one for me too.\u003c/p\u003e\n\u003cp\u003eThe plot next to his.\u003c/p\u003e\n\u003cp\u003eI’d rather burn in Hell than spend an eternity trapped beside him. I’ve served my time. I’m done.\u003c/p\u003e\n\u003cp\u003eReaching for the last flat pack box, I stretch too far, and my ribs ache. I’m sporting a nice black bruise on them courtesy of Forbes outburst last night.\u003c/p\u003e\n\u003cp\u003eI check my bag for Advil and remember that I took the last of them first thing this morning.\u003c/p\u003e\n\u003cp\u003eKnowing everything is packed, I start to search through Oliver’s drawers in the hope there may be something in here.\u003c/p\u003e\n\u003cp\u003eI tug on the bottom drawer, but it’s locked.\u003c/p\u003e\n\u003cp\u003eI search the other drawers for a key but find nothing.\u003c/p\u003e\n\u003cp\u003eThen a thought crosses my mind. Oliver’s keys, the ones I was given with his things at the hospital, have a few keys on it that I hadn’t found a use for.\u003c/p\u003e\n\u003cp\u003eI retrieve the keys from my bag, and start trying the three keys. The second one fits, so I turn it, and the lock opens with a click. I pull the draw open, and there’s nothing in it, but a manila folder. I take the folder from the drawer and sit down in the chair, placing the folder on the desk.\u003c/p\u003e\n\u003cp\u003eIn the top right hand corner, it has one word – Anna.\u003c/p\u003e\n\u003cp\u003eSeeing my mother’s name on it has me opening the folder.\u003c/p\u003e\n\u003cp\u003eThere are two pieces of paper inside. Both are titled: ‘Sawyer, Davis and Smith. Family Lawyers.’ Dated: October 12th 1990.\u003c/p\u003e\n\u003cp\u003eI was born 1990. January 10th is my birthday.\u003c/p\u003e\n\u003cp\u003eThe first letter is addressed to Oliver. I start to read.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eThis … this can’t be right.\u003c/p\u003e\n\u003cp\u003eBlood starts to pound in my ears.\u003c/p\u003e\n\u003cp\u003eWith trembling fingers, I turn to the second piece of paper and read quickly through the lawyer jargon. I’m getting the basics of what this letter is about.\u003c/p\u003e\n\u003cp\u003eIt’s not a letter. It’s a contract.\u003c/p\u003e\n\u003cp\u003eI, Anna Monroe, do decree to cease all parental rights of my daughter, Mia Monroe, giving sole custody to her father, Dr. Oliver Monroe.\u003c/p\u003e\n\u003cp\u003eI don’t read anymore. I don’t need to.\u003c/p\u003e\n\u003cp\u003eMy mother didn’t die in a car accident. She signed me over to Oliver.\u003c/p\u003e\n\u003cp\u003eShe left me with him. She gave me to him.\u003c/p\u003e\n\u003cp\u003eEverything starts to fracture around me.\u003c/p\u003e\n\u003cp\u003eMy eyes blur, and my heart starts to hurt in chest.\u003c/p\u003e\n\u003cp\u003eThe letters flutter from my hands, dropping to the desk. I grab the folder, searching it, scrambling to find anything else.\u003c/p\u003e\n\u003cp\u003eI find one scrap piece of paper at the bottom.\u003c/p\u003e\n\u003cp\u003eIt has my mother’s name on it, and an address for a place called Durango in Colorado.\u003c/p\u003e\n\u003cp\u003eGrabbing the papers and address, I shove them in my bag.\u003c/p\u003e\n\u003cp\u003eI need to get out of here. I need to talk to someone.\u003c/p\u003e\n\u003cp\u003eSo I head to the only person I have in this world – Forbes.\u003c/p\u003e\n\u003cp\u003eWhen I reach his house, I don’t bother knocking as I know it’ll be unlocked. There’s always someone here.\u003c/p\u003e\n\u003cp\u003eThe urge to talk to him about what I’ve discovered has increased on the drive over here. I just need to air this out. Figure it out. He’ll be able to help me do that. Yes, Forbes is an asshole, but he’s smart. He’s almost a lawyer.\u003c/p\u003e\n\u003cp\u003eHe’ll know what these papers mean.\u003c/p\u003e\n\u003cp\u003eHe’ll know what to do.\u003c/p\u003e\n\u003cp\u003eAs I walk through the foyer, I see the living room is deserted.\u003c/p\u003e\n\u003cp\u003eIf he’s not in, I’ll just wait in his room until he gets home.\u003c/p\u003e\n\u003cp\u003eI run up the stairs to the first floor. Forbes’ room is at the far end of the hall. I walk quickly, clutching my bag to my side. The papers inside feel as if they’re burning through the leather and onto my skin.\u003c/p\u003e\n\u003cp\u003eReaching Forbes’ door, I grab the handle and push down, opening it.\u003c/p\u003e\n\u003cp\u003eAnd I’m greeted by the sight of Forbes in bed, having sex with a girl – who isn’t me, obviously.\u003c/p\u003e\n\u003cp\u003eI can’t really say what I feel in this moment. There’s such a myriad of emotions streaming through me, but I do know the one emotion I feel with absolute certainty is relief. In what context I’m just not sure.\u003c/p\u003e\n\u003cp\u003eFunny.\u003c/p\u003e\n\u003cp\u003eOliver dies, I feel relief.\u003c/p\u003e\n\u003cp\u003eForbes cheats, I feel relief.\u003c/p\u003e\n\u003cp\u003eNot really the natural feeling one should have in these kind of situations.\u003c/p\u003e\n\u003cp\u003eDoes this mean I’m free of Forbes?\u003c/p\u003e\n\u003cp\u003eThe words are right there on the tip of my tongue. Of all the things I could say to him at this moment in time, that is the one thing I want to ask most.\u003c/p\u003e\n\u003cp\u003eIt takes Forbes a moment to see me standing here in his doorway as he’s too busy getting his rocks off. The surprise is evident on his face, but it quickly morphs into the cold, blank expression I’m familiar with.\u003c/p\u003e\n\u003cp\u003eThe girl is facing away from me. All I can see is a mass of brown hair curtaining her face as she is on her hands and knees being screwed from behind by my boyfriend.\u003c/p\u003e\n\u003cp\u003eShe has no clue I’m here, watching, feeling utterly emotionless by the whole thing\u003c/p\u003e\n\u003cp\u003eAnd Forbes says nothing. Just holds my eye as he continues to have sex with her.\u003c/p\u003e\n\u003cp\u003e“Yes, God! Forbes!” she screams out, making me jump. Forbes actually smiles.\u003c/p\u003e\n\u003cp\u003e“Harder! Fuck me harder!”\u003c/p\u003e\n\u003cp\u003eShe really does seem to be enjoying herself. More than I ever have with him. Maybe that’s why he hits me. Maybe I don’t do sex right. He was my first. Has been my only.\u003c/p\u003e\n\u003cp\u003e“Yes! Right there!” she continues to scream.\u003c/p\u003e\n\u003cp\u003eYou’d think he’d stop and try some lame attempt of It’s not what you think, Mia.\u003c/p\u003e\n\u003cp\u003eBut he doesn’t say a thing.\u003c/p\u003e\n\u003cp\u003eThen again, you’d think I’d say something; any normal girl would if she caught her boyfriend cheating on her. She’d probably be the one screaming right now.\u003c/p\u003e\n\u003cp\u003eBut then Forbes and I don’t exactly do normal.\u003c/p\u003e\n\u003cp\u003eHe has all the power, and I’m just dragged along for the ride.\u003c/p\u003e\n\u003cp\u003eContinuing to have sex with this girl, and keeping his eyes on me, his smile changes to a smirk. Then a fire ignites in his eyes. It’s new. I’ve never seen this look on him before, but then I’ve never seen him having sex with someone else before either.\u003c/p\u003e\n\u003cp\u003eBut there’s something in the way he’s looking at me right now that terrifies me. He looks empowered, like he’s finally got me exactly where he wants me.\u003c/p\u003e\n\u003cp\u003eChills creep down my spine like spiders.\u003c/p\u003e\n\u003cp\u003e“Oh god, I’m coming! I’m coming!” the girl screams, totally unaware of what is transpiring right now between Forbes and I.\u003c/p\u003e\n\u003cp\u003eLeave Mia, now. Go!\u003c/p\u003e\n\u003cp\u003eTearing my gaze from his. I take one step back. Two. And then I’m gone, fleeing down the stairs and out of there.\u003c/p\u003e\n\u003cp\u003eI toss my bag into the foot-well and I’m back in my car, driving away.\u003c/p\u003e\n\u003cp\u003eVision blurred, I wipe my eyes and realize that I’m crying.\u003c/p\u003e\n\u003cp\u003eWhy? I’m not entirely sure.\u003c/p\u003e\n\u003cp\u003eI drive to a convenience store, park my car way in the back, go in and buy as much food as I can carry in my arms. Potato chips, candy, cookies, ice-cream – anything I can lay my hands on.\u003c/p\u003e\n\u003cp\u003eI get back in my car, open up the food and start eating like I always do. Eating is probably too nice a word for what I’m doing – I’m gorging.\u003c/p\u003e\n\u003cp\u003eWhen I’m done, the feeling of my stomach tight and bursting, relief momentarily fills me. Then I look around at the empty wrappers and containers and the sick, dirty, guilt feeling washes over me.\u003c/p\u003e\n\u003cp\u003eI stuff the wrappers in the bag and look around at the lot. There’s no one around, so I walk toward the trash can and dump the bag in it. Then I skirt quickly to the cluster of trees by the edge of the store and hide myself from view as I brace my hand against one of them. I push my fingers down my throat, emptying my stomach.\u003c/p\u003e\n\u003cp\u003eI get back in my car, clean my hands on a wipe, and put a breath mint in my mouth.\u003c/p\u003e\n\u003cp\u003eFinally feeling in control of my emotions, I start my car and head for home.\u003c/p\u003e\n\u003cp\u003eI don’t know Forbes is there waiting as his car isn’t parked up front—maybe that was the point; he always likes to have the upper hand. When I see him under the alcove by my door, I try to run, but he grabs my arm, dragging me back. “Oh no, you don’t.”\u003c/p\u003e\n\u003cp\u003eI can smell perfume on him.\u003c/p\u003e\n\u003cp\u003eAnd sex.\u003c/p\u003e\n\u003cp\u003eThe sex I just saw him having.\u003c/p\u003e\n\u003cp\u003eHe didn’t even shower.\u003c/p\u003e\n\u003cp\u003eJust finished screwing his bit on the side and came over here. Or maybe I’m his bit on the side. Maybe she’s his girlfriend.\u003c/p\u003e\n\u003cp\u003eForbes yanks my keys from my hand and unlocks the door. He pushes me into my apartment.\u003c/p\u003e\n\u003cp\u003eI stumble, but quickly correct my footing. For some reason, in this moment, it’s important to me that I don’t fall in front of him.\u003c/p\u003e\n\u003cp\u003eMoving back, I press up against the back of the sofa and grip the top of it with my hands.\u003c/p\u003e\n\u003cp\u003eI’m not really sure what I expect of him in this moment, but I need to prepare myself for the worst. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-3.html","bookId":2000,"creation":"Oct 5, 2019 9:57:15 PM","modification":"Oct 5, 2019 9:57:15 PM"}
