{"id":98272,"no":35,"title":"Page 35","content":"\u003cp\u003eI yank the sheet from my body, exposing myself. I turn my back to him. I’m feeling insane levels of pain, and have absolutely no sense of anything right now. I don’t know what I’m doing or where my mind is at. I’m just doing…\u003c/p\u003e\n\u003cp\u003e“If I’d been particularly bad, as he put it, which wouldn’t take much … just leaving the cap off the milk. Or the especially bad crimes I could commit … being a minute late when returning home from school – then he’d use the metal buckle end of his belt. You know, to cause more pain and damage. Helped make his point.”\u003c/p\u003e\n\u003cp\u003eHot tears are dripping down my face. I leave them burning my skin so that I can feel something. Because I need to feel something. Anything.\u003c/p\u003e\n\u003cp\u003e“He taunted me with knives and guns. All part of his sick games – letting me know where I stood in the food chain. I’ve lost count of the number of cracked ribs and broken bones I’ve had. Broken fingers that I’ve reset myself. Dislocated shoulders. Popped out knees from his boots stamping on them.” I pull in a hard, painful breath. “So that was my life, and now you know all of it, and I’m leaving.”\u003c/p\u003e\n\u003cp\u003eI grab the sheet, covering myself, my self-loathing possessing me like a disease. All I want is to get out of here, but Jordan is quick.\u003c/p\u003e\n\u003cp\u003eHis arms come around me from behind, caging me to him. I don’t fight to leave because part of me doesn’t want to. I want his care, more than anything.\u003c/p\u003e\n\u003cp\u003eI don’t want to be alone anymore.\u003c/p\u003e\n\u003cp\u003eI feel the tremble in his body. He presses his cheek to mine. My eyes close on the pain that’s burning me from the inside out.\u003c/p\u003e\n\u003cp\u003e“No, Mia,” he whispers. “No.”\u003c/p\u003e\n\u003cp\u003eThe feel of his arms, his hands … his safe hands that I know would never hurt me…\u003c/p\u003e\n\u003cp\u003eI break.\u003c/p\u003e\n\u003cp\u003eLike glass shattering, I go. My legs give out, but Jordan is there, holding me. Lifting me into his arms, he carries me to the bed.\u003c/p\u003e\n\u003cp\u003eI wrap myself around him, burying my face in his chest as I cling to him and cry out years and years of deeply buried pain.\u003c/p\u003e\n\u003cp\u003e“I’m here … I’ve got you … always. I’ll never let anyone hurt you ever again, Mia. I swear.”\u003c/p\u003e\n\u003cp\u003eAt some point, I fall asleep. The sheer exhaustion from crying, and reliving my past pain with Jordan had taken its toll.\u003c/p\u003e\n\u003cp\u003eWhen I wake, my eyes are swollen, and my head is sore and heavy.\u003c/p\u003e\n\u003cp\u003eI lift my head from Jordan’s chest, blinking my blurry eyes into focus. His are closed, but his arms immediately tighten around me.\u003c/p\u003e\n\u003cp\u003e“Don’t leave.” He opens his eyes.\u003c/p\u003e\n\u003cp\u003e“I wasn’t,” I whisper, my voice hoarse.\u003c/p\u003e\n\u003cp\u003eHis hand rubs circles on my back. “How are you feeling?”\u003c/p\u003e\n\u003cp\u003eRubbing my eyes, I rest my chin on his chest. “I’ve felt worse.”\u003c/p\u003e\n\u003cp\u003eHe nods in understanding.\u003c/p\u003e\n\u003cp\u003e“Thank you … for being here, for listening.”\u003c/p\u003e\n\u003cp\u003e“I’m always here for you.” He touches my face. “Do you need to talk some more, now you’re feeling a little clearer?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “I feel okay at the moment. I want to keep feeling okay.” I lie my head back on his chest and listen to the gentle drum of his heart.\u003c/p\u003e\n\u003cp\u003eMy eyes graze over his tattoo, which covers his right pectoral, goes up over his shoulder, and down his arm, ending at his wrist. It’s tribal, with quotes woven through it.\u003c/p\u003e\n\u003cp\u003eI run my fingertip down his arm, reading the quotes I’ve seen before, but paying attention now…\u003c/p\u003e\n\u003cp\u003eNot all who wander are lost.\u003c/p\u003e\n\u003cp\u003eThat’s on his bicep.\u003c/p\u003e\n\u003cp\u003e“I had this tattoo done in three parts,” he explains. “That was done while I was traveling. I had it done in Indonesia.”\u003c/p\u003e\n\u003cp\u003eMy fingers move down to his forearm…\u003c/p\u003e\n\u003cp\u003eIf you can’t live longer, live deeper.\u003c/p\u003e\n\u003cp\u003e“I got that done after my mom died.”\u003c/p\u003e\n\u003cp\u003eI give a sad smile, then press my lips to the words, kissing them. I sit up, shifting my body so that I’m straddling his waist. His hands go to my thighs.\u003c/p\u003e\n\u003cp\u003e“You finished checking me out?” He grins.\u003c/p\u003e\n\u003cp\u003e“I’m checking out your tattoo, and no, I’m not done.” I smile, then lean close to read the words on his chest…\u003c/p\u003e\n\u003cp\u003eI don\u0027t go looking for trouble.\u003c/p\u003e\n\u003cp\u003eTrouble usually finds me.\u003c/p\u003e\n\u003cp\u003eI let out a laugh. That is such a Jordan thing to say. But why do I know that saying…\u003c/p\u003e\n\u003cp\u003e“Harry Potter.” I jab my finger at the tattoo.\u003c/p\u003e\n\u003cp\u003e“Ow!” he complains, rubbing his chest.\u003c/p\u003e\n\u003cp\u003e“Sorry.” I smile sheepishly. “That’s a quote from Harry Potter, right?”\u003c/p\u003e\n\u003cp\u003eHe gives me a suspicious look. “Yeah, it is. Why?”\u003c/p\u003e\n\u003cp\u003eI shrug. “No reason … geek,” I cough, covering my mouth with my hand.\u003c/p\u003e\n\u003cp\u003eHis eyes narrow, then he’s moving like lightening, tackling me back and pinning me to the bed with his body.\u003c/p\u003e\n\u003cp\u003e“Arrggghh!” I let out a squeal of laughter.\u003c/p\u003e\n\u003cp\u003e“Did you just call me a geek?” He hovers his face above mine. His face is serious, but I can see the mirth in his eyes.\u003c/p\u003e\n\u003cp\u003e“Nope.” I press my grinning lips together.\u003c/p\u003e\n\u003cp\u003e“No? I’m pretty sure you did just call me a geek.”\u003c/p\u003e\n\u003cp\u003e“Noooo.” I give a gasp of shock. “I mean as if getting a Harry Potter quote tattooed on your chest would, in any way, make me think you’re a geek. I’d say it’s the coolest thing ever.”\u003c/p\u003e\n\u003cp\u003e“Smart-ass,” he quips. “And seriously, babe, Harry Potter is fuckin’ cool. The kid’s a wizard for fuck’s sake!”\u003c/p\u003e\n\u003cp\u003eI start laughing. I love seeing this side of him. The one I don’t think anyone else ever sees, the stripped down version of him. The real him. The one he hides away, deep inside.\u003c/p\u003e\n\u003cp\u003eHe starts laughing with me, then runs his hand down the side of my face, his thumb pressing against my lips, sending fire shooting through me. The laughter is gone quickly, his lips replacing his thumb.\u003c/p\u003e\n\u003cp\u003e“I love to see you laughing,” he says against my mouth.\u003c/p\u003e\n\u003cp\u003eMy hands slide down his back. “I love that you make me laugh.”\u003c/p\u003e\n\u003cp\u003eSmiling against my mouth, he gives me one last kiss, then lays his head on my chest.\u003c/p\u003e\n\u003cp\u003eI start playing with his hair. He makes a sound of appreciation, so I figure he must like it.\u003c/p\u003e\n\u003cp\u003e“I am a geek,” he mutters after a while.\u003c/p\u003e\n\u003cp\u003eI stop playing with his hair. “Yeah, you are.” I smile. “But you know what? It makes me like you even more.”\u003c/p\u003e\n\u003cp\u003eHe squeezes my hip, pressing a kiss against the peak of my breast.\u003c/p\u003e\n\u003cp\u003eI start playing with his hair again. “So … what now?” I ask the question which has been hovering in my mind since we first had sex.\u003c/p\u003e\n\u003cp\u003eI know we’ve had two dates, a freak out from me when things first got heavy between us, and now we’ve had sex followed by an emotional breakdown from me.\u003c/p\u003e\n\u003cp\u003eTruthfully, I just don’t know what’s actually happening between us.\u003c/p\u003e\n\u003cp\u003eI know what I want, but the problem is, I don’t know what Jordan wants from me.\u003c/p\u003e\n\u003cp\u003eHis chest lifts on a breath, his hand stroking the skin on my shoulder. “Well, I was thinking that I would leave you in bed, get up and feed Dozer ’cause he’ll be wanting his breakfast, and he needs his meds. Then I would make pancakes for my woman, and bring them to her in bed. Afterward, once she’s happily fed, I thought we could spend the rest of the day in bed … only if she wants to, of course?”\u003c/p\u003e\n\u003cp\u003eHis woman. I’ll take that as a good thing.\u003c/p\u003e\n\u003cp\u003eHe lifts his head, resting his chin on my chest. His warm eyes stare at me, filled with feeling, feeling he has for me.\u003c/p\u003e\n\u003cp\u003eI lift my head, placing my arms behind for support, and bring my face closer to his. “She wants,” I murmur.\u003c/p\u003e\n\u003cp\u003eHis pupils dilate, eyes darkening with lust.\u003c/p\u003e\n\u003cp\u003e“Actually, Dozer can wait a bit longer to be fed.” His hand moves down my body. Lifting slightly, he puts it between us, slipping his finger inside me.\u003c/p\u003e\n\u003cp\u003e“Oh, my god,” I breathe. I feel him grow hard against my thigh.\u003c/p\u003e\n\u003cp\u003e“Babe, so wet … already,” he groans.\u003c/p\u003e\n\u003cp\u003e“It’s you … what you do to me.”\u003c/p\u003e\n\u003cp\u003e“And I plan on doing a whole lot more,” he promises before sealing his mouth over mine.\u003c/p\u003e\n\u003cp\u003eAfter making love to me, Jordan finally relents and goes to feed Dozer.\u003c/p\u003e\n\u003cp\u003eI retrieve my panties, and put on one of Jordan’s t-shirts that I nab from his closet. It’s huge on me, nearly reaching my knees.\u003c/p\u003e\n\u003cp\u003eI’m wandering around his bedroom, looking at a map of the world he has tacked to the wall. There are pins in it with a drawn line under the pins, marking the route of all the places he has traveled. The last pin is in Thailand, but the drawn line goes onto India, through Nepal, then across China to Hong Kong, up to Shanghai, finally ending in Japan. I’m guessing that’s where he would have gone if his trip hadn’t ended early.\u003c/p\u003e\n\u003cp\u003eI look at the photos pinned up around the map, pictures of a slightly younger Jordan in different locations with his friends.\u003c/p\u003e\n\u003cp\u003eHe looks happy; bright eyed.\u003c/p\u003e\n\u003cp\u003eLooking at these pictures, seeing the fun and adventure in his face when he didn’t know what was to come, makes my heart hurt for him.\u003c/p\u003e\n\u003cp\u003eBeneath the map is his desk. There are a few framed photos sitting on top of it.\u003c/p\u003e\n\u003cp\u003eOne is of a dark haired woman, smiling happily into the camera. She must be Jordan’s mom. I pick it up, examining it. She looks quite young in the photo, maybe my age, and she’s really pretty. She has the same eye color as Jordan.\u003c/p\u003e\n\u003cp\u003ePutting it down, I pick up the next picture. It’s of a young Jordan, maybe four or five, held in the arms of a man whom I’m guessing is his dad as he looks exactly like Jordan does now. Beside his dad, tucked into his side, is a petite blonde haired lady. She’s really beautiful. Oh right, she must be Jordan’s mother. Maybe the other woman is an aunt or something.\u003c/p\u003e\n\u003cp\u003eI’m just putting the picture down, when Jordan comes in with a tray containing pancakes and two cups of coffee.\u003c/p\u003e\n\u003cp\u003eCould he be any more perfect? I keep expecting to wake up and find out this is all a dream and I’m still in that motel bed back near Boston.\u003c/p\u003e\n\u003cp\u003eHe puts the tray down on the desk, and his arms come around my waist from behind, resting his chin on the top of my head. “That’s my mom and dad.” He points to the picture I was just looking at.\u003c/p\u003e\n\u003cp\u003e“Your mom was beautiful, Jordan.”\u003c/p\u003e\n\u003cp\u003e“Yeah, she really was. You remind me of her a bit, you know.”\u003c/p\u003e\n\u003cp\u003e“I do?” I smile.\u003c/p\u003e\n\u003cp\u003e“Yeah, she always used to speak without thinking like you do.”\u003c/p\u003e\n\u003cp\u003e“Hey!” I exclaim, giving his side a pinch.\u003c/p\u003e\n\u003cp\u003e“Hey! Knock it off!” He laughs, wriggling behind me. “I’m really fuckin’ ticklish!”\u003c/p\u003e\n\u003cp\u003eI tilt my head back, looking up at him. “Hmm … I didn’t know that.”\u003c/p\u003e\n\u003cp\u003eHe stares down at me, narrowing his gaze. “Yeah, and I didn’t tell you for the very reason that’s going through that gorgeous head of yours right now. So don’t go getting any ideas about tickling me again.”\u003c/p\u003e\n\u003cp\u003e“As if I would.” I smile sweetly.\u003c/p\u003e\n\u003cp\u003eHe shakes his head, giving me a quick kiss on the lips.\u003c/p\u003e\n\u003cp\u003eI pick up the photo again and examine it. “You look exactly like your dad.”\u003c/p\u003e\n\u003cp\u003e“Well, yeah, he was a handsome fucker when he was younger.”\u003c/p\u003e\n\u003cp\u003eShaking my head, I laugh as I put the picture down.\u003c/p\u003e\n\u003cp\u003e“Who’s this?” I point to the picture of the dark haired woman. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-35.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
