{"id":98280,"no":43,"title":"Page 43","content":"\u003cp\u003eI shake my head slowly.\u003c/p\u003e\n\u003cp\u003e“Ah … right. Okay … so you really meant it before when you said I’d lost you.” He sounds in pain, hurt, and it’s awful.\u003c/p\u003e\n\u003cp\u003eBut I am doing the right thing – I know I am.\u003c/p\u003e\n\u003cp\u003eThe resentment I feel isn’t going anywhere. And eventually it would eat at me … us, and in the end there’d be nothing left but hate and hurt.\u003c/p\u003e\n\u003cp\u003eI’ve had enough hurt to last a lifetime. Better to end things now, than later.\u003c/p\u003e\n\u003cp\u003eI feel the bed shift as he stands. “Will you do one thing for me?”\u003c/p\u003e\n\u003cp\u003eI lift my eyes to him, but I’m unprepared for the pain than slices through me when I see the pure look of it on his face.\u003c/p\u003e\n\u003cp\u003e“Don’t shut out the next person who tries to get close to you. Tell them everything. Don’t worry that they won’t love you because they will. It’s impossible not to love you, Mia.” He lets out a resigned sigh. “I know that better than anyone.”\u003c/p\u003e\n\u003cp\u003eI slide my hand across my chest, gripping at the place where my aching heart is. And in this moment, I crumble, changing my mind, ready to tell him that I love him. That I’ll find a way to get beyond how I feel.\u003c/p\u003e\n\u003cp\u003eBut before I get a chance to part my dry lips, he’s gone, the door banging closed in his wake.\u003c/p\u003e\n\u003cp\u003ePanic claws at my chest. I want to run after him. Tell him I was wrong.\u003c/p\u003e\n\u003cp\u003eBut my legs don’t move. And I know why.\u003c/p\u003e\n\u003cp\u003eBecause deep down I know letting him go is the right thing.\u003c/p\u003e\n\u003cp\u003eI slide down the bed, turning on my side as I pull my knees to my chest, hugging them.\u003c/p\u003e\n\u003cp\u003eI’m wiping at my tears when I hear the door open.\u003c/p\u003e\n\u003cp\u003eJordan.\u003c/p\u003e\n\u003cp\u003eMy heart leaps.\u003c/p\u003e\n\u003cp\u003eI turn around.\u003c/p\u003e\n\u003cp\u003eForbes.\u003c/p\u003e\n\u003cp\u003eOh god no.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eI can feel my body turning in on itself. Like a snail, retreating into its shell.\u003c/p\u003e\n\u003cp\u003eWhat is he doing here? How did he know I was here? What happened to his face?\u003c/p\u003e\n\u003cp\u003eHis nose is taped up. His face cut and bloody.\u003c/p\u003e\n\u003cp\u003eHe shuts the door behind him, and my blood turns cold.\u003c/p\u003e\n\u003cp\u003eMy eyes start scanning the room looking for an escape, but my only current escape is the door he’s standing in front of. I could always make a dash for the bathroom and lock myself inside.\u003c/p\u003e\n\u003cp\u003e“F-Forbes,” I finally manage.\u003c/p\u003e\n\u003cp\u003e“How are you feeling?” he asks perfectly normal, as if the last time I saw him didn’t involve him beating and attempting to rape me.\u003c/p\u003e\n\u003cp\u003e“H-how did you know you know I was here?”\u003c/p\u003e\n\u003cp\u003eHe smiles, and it makes my blood run cold. “I’m your emergency contact on your medical insurance, remember? The minute they brought you in, I got a call. I came straight away. I was worried about you, baby. I’ve been worried about you for the last two weeks. Not knowing where you were … it’s been torture.” He takes a step closer to me.\u003c/p\u003e\n\u003cp\u003eI scrabble back in bed, covering my legs with the hospital gown I’m wearing. It’s my natural reaction.\u003c/p\u003e\n\u003cp\u003eAnd I hate that it is.\u003c/p\u003e\n\u003cp\u003eHe holds his hands in a placating manner. “I’m not going to hurt you, Mia. That’s not why I’m here.”\u003c/p\u003e\n\u003cp\u003eI don’t believe him. I’ve heard that from him so many times before.\u003c/p\u003e\n\u003cp\u003eI slide my hand behind my back, searching for the emergency buzzer.\u003c/p\u003e\n\u003cp\u003e“I just want to talk to you.” He sits down in the chair by the bed. I stop moving my hand, shifting my body a little to hide what I’m reaching for.\u003c/p\u003e\n\u003cp\u003e“W-what do you want?” I try to hold my voice steady.\u003c/p\u003e\n\u003cp\u003e“I want you to come home.”\u003c/p\u003e\n\u003cp\u003eI can feel my head shaking before I even have a chance to think through what I’m doing. I know it’s the wrong thing, and even more so when I see the flare of anger in his eyes.\u003c/p\u003e\n\u003cp\u003eI swallow past the dry in my throat as I creep my fingers outward, trying to find the buzzer.\u003c/p\u003e\n\u003cp\u003e“Mia…” He sighs, rubbing his temple, shaking his head. “That’s not the answer I want to hear.”\u003c/p\u003e\n\u003cp\u003e“What happened to your face?” I ask. A diversion tactic until I can figure a way out of this.\u003c/p\u003e\n\u003cp\u003eHis face darkens. “It’s irrelevant.”\u003c/p\u003e\n\u003cp\u003eI bind my hands together.\u003c/p\u003e\n\u003cp\u003e“Mia, I came all this way, and I’m not leaving without you. And really, what do you have here? Nothing. You’re all alone. You need me. You can’t survive without me.”\u003c/p\u003e\n\u003cp\u003eI wrap my hands around my cold body.\u003c/p\u003e\n\u003cp\u003eHe’s right. I am alone, but alone is better than with him.\u003c/p\u003e\n\u003cp\u003eForbes stands. “Where are your things?”\u003c/p\u003e\n\u003cp\u003e“I don’t have anything here with me.”\u003c/p\u003e\n\u003cp\u003e“Good. That makes it easier.” He picks my folded up, dirty clothes from the side. “What the fuck are these?”\u003c/p\u003e\n\u003cp\u003e“My clothes.”\u003c/p\u003e\n\u003cp\u003eThe look of disgust on his face is so familiar to me.\u003c/p\u003e\n\u003cp\u003eHe’s so familiar to me.\u003c/p\u003e\n\u003cp\u003e“We’ll pick you some clothes up at the airport, but for now, get dressed.” He throws the clothes on the bed in front of me.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eHe looks at me. Anger is dominating him now. “Because we’re leaving this fuckin’ hick of a town and going home. So get your ass fuckin’ dressed!” he hisses.\u003c/p\u003e\n\u003cp\u003eThis is the Forbes I know so well.\u003c/p\u003e\n\u003cp\u003eFear controlling me, and unsure what else to do, I obediently climb off the bed and pick the clothes up to change in the bathroom.\u003c/p\u003e\n\u003cp\u003e“Where the fuck are you going?” he snaps.\u003c/p\u003e\n\u003cp\u003e“To change,” I answer in a small voice.\u003c/p\u003e\n\u003cp\u003e“Change here.” He moves across the room toward me, predatory in his step.\u003c/p\u003e\n\u003cp\u003eMy heart stops. I hold still to the spot, fear still controlling me like a sickness.\u003c/p\u003e\n\u003cp\u003eRunning his finger down my bare arm, he leans close to my mouth. “I’ve missed you, baby … I want to see you.”\u003c/p\u003e\n\u003cp\u003eHis touch ignites painful memories of all the times he hit me, kicked me, punched me … violated me. His hand feels like a disease of the worst kind. A sick, awful disease I want off me, and away from. Now.\u003c/p\u003e\n\u003cp\u003eMy heart kickstarts, and begins pumping hard in my chest.\u003c/p\u003e\n\u003cp\u003eI won’t leave here with him.\u003c/p\u003e\n\u003cp\u003eI can’t.\u003c/p\u003e\n\u003cp\u003eHolding the clothes to my chest, I lift my chin. “I’m not going back to Boston with you.”\u003c/p\u003e\n\u003cp\u003eThere’s no hesitation. He grabs me by the throat. Pushing me down onto the bed. “You will do as I fuckin’ tell you! You will get dressed. Then you will leave this hospital, and get on a plane home with me.”\u003c/p\u003e\n\u003cp\u003e“No,” I croak out.\u003c/p\u003e\n\u003cp\u003eHis hand grabs at my gown, lifting it. He grabs the fabric of my panties and tears them off my body. His knee comes between my thighs. I press my legs together, trying to keep him out, but he’s too strong, and he pries them apart.\u003c/p\u003e\n\u003cp\u003eWith his knee pressed painfully up against the most intimate part of me, he leans into my face. “Do I need to teach you another lesson, Mia?”\u003c/p\u003e\n\u003cp\u003eFear and memories start to take hold.\u003c/p\u003e\n\u003cp\u003eAnd I stop them as soon as they start. I will not be controlled.\u003c/p\u003e\n\u003cp\u003eNot by him.\u003c/p\u003e\n\u003cp\u003eNot by anyone.\u003c/p\u003e\n\u003cp\u003eEver again.\u003c/p\u003e\n\u003cp\u003eI hate Forbes more in this moment than I ever have. And it gives me strength. Strength I need.\u003c/p\u003e\n\u003cp\u003eSlowly, I shake my head.\u003c/p\u003e\n\u003cp\u003eHe smiles, a winners smile. “Good girl.” Then he pulls my gown aside, revealing my naked breast. “So fucking beautiful,” he says, pressing his hand to my chest, moving his disgusting fingers over my nipple. He squeezes.\u003c/p\u003e\n\u003cp\u003eI close my eyes on the pain. Tears press from the corners of my eyes.\u003c/p\u003e\n\u003cp\u003eJordan. It’s a silent scream in my mind. A plea for him to come back. To make right on his promise when he said that he would never let anyone hurt me, ever again.\u003c/p\u003e\n\u003cp\u003eBut Jordan’s not coming because I sent him away.\u003c/p\u003e\n\u003cp\u003eThis is for me to do. And I can do it.\u003c/p\u003e\n\u003cp\u003eSlowly, I lift my hand to Forbes’ face. His eyes fire with triumph, and I know I have him.\u003c/p\u003e\n\u003cp\u003eTilting my chin, I offer my mouth to him.\u003c/p\u003e\n\u003cp\u003eHis eyes flare. “Tell me you want me, Mia. Say, ‘Fuck me, Forbes. Please.’ I want to hear you beg, baby.”\u003c/p\u003e\n\u003cp\u003eI swallow down all the words I want to say, and do as he says, “Fuck me, Forbes. Please,” I say in a steady voice.\u003c/p\u003e\n\u003cp\u003e“There’s my, girl.” He smirks, lowering his face to mine.\u003c/p\u003e\n\u003cp\u003eThe instant his lips touch mine, I moan, knowing it will turn him on to deepen the kiss. And that’s the moment when I go back to the tactic I used the last time, and bite down on his lower lip. But this time, I bite like I mean it.\u003c/p\u003e\n\u003cp\u003eHis blood floods my mouth, along with his yell of pain.\u003c/p\u003e\n\u003cp\u003e“You fuckin’ bitch!” He hits me hard.\u003c/p\u003e\n\u003cp\u003ePain explodes in my head. His grip on my throat tightens. Breathing quickly gets hard.\u003c/p\u003e\n\u003cp\u003eI need to get out of this, but I can’t move my body, so my hands slap him, scratching, pushing, just trying anything I can to get him off me, but he’s unmoving.\u003c/p\u003e\n\u003cp\u003eIt’s when he’s rearing back to hit me again, fist clenched, that I turn my head away.\u003c/p\u003e\n\u003cp\u003eAnd that’s when I see my escape, on the table by the bed.\u003c/p\u003e\n\u003cp\u003eWithout another thought, I grab the glass water jug and using all the strength I have, I hit him with it.\u003c/p\u003e\n\u003cp\u003eI make contact with the side of his head. I feel and hear the dull thud of the glass as it strikes his skull.\u003c/p\u003e\n\u003cp\u003eWater spills out, soaking my face and hair.\u003c/p\u003e\n\u003cp\u003eForbes looks stunned. Like he can’t believe I really just hit him with it.\u003c/p\u003e\n\u003cp\u003eHe wobbles, but he’s still upright, and I need him down.\u003c/p\u003e\n\u003cp\u003eSo I pull back and hit him again. Harder this time. And that’s when he goes down, falling right on top of me.\u003c/p\u003e\n\u003cp\u003eThe jug drops from my hand and hits the floor with a loud shatter.\u003c/p\u003e\n\u003cp\u003eI’m panicking, coughing up his blood mixed in with my own, just needing him off me. Terrified that he’s going to wake up and then it’s game over for me.\u003c/p\u003e\n\u003cp\u003eWith unknown strength, I manage to struggle out from underneath him. Sliding off the bed, my eyes trained on his unmoving body, my bare feet hit the floor.\u003c/p\u003e\n\u003cp\u003eGlass shards cut straight through the soles of my feet, I bite my lip on the cry of pain I want to make.\u003c/p\u003e\n\u003cp\u003eNot taking my eyes off Forbes, I grab the emergency buzzer by the bed, pressing it multiple times. Then as quietly as I can, I move across the floor, stifling my urges to cry out as the glass continues to cut mercilessly, into my feet.\u003c/p\u003e\n\u003cp\u003eI’m steps from the door, when I hear running footsteps down the hall. Then the door bursts open. It’s Dr. Packard with a security guard flanking her.\u003c/p\u003e\n\u003cp\u003eThank god.\u003c/p\u003e\n\u003cp\u003e“Mia, what on earth has happened? Are you okay? We heard glass breaking, then your buzzer was going off frantic!” Her eyes sweep the room taking in the state of me and Forbes out on the bed. “Oh, my god, are you okay?”\u003c/p\u003e\n\u003cp\u003eI take a few steps toward her, stumbling, I collapse, relief taking me down.\u003c/p\u003e\n\u003cp\u003eDr. Packard catches me, holding me in her arms. “It’s okay, Mia,” she soothes, holding me to her. “You’re going to be okay.”\u003c/p\u003e\n\u003cp\u003eBut in this moment, her words aren’t so easy to believe. And all I can think is how much I wish it were Jordan’s arms around me right now.\u003c/p\u003e\n\u003cp\u003eBut they never will be again.\u003c/p\u003e\n\u003cp\u003eAnd I only have myself to blame for that.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Five\u003c/p\u003e\n\u003cp\u003eJordan\u003c/p\u003e\n\u003cp\u003eDay two: post-Mia…\u003c/p\u003e\n\u003cp\u003e“Jordan.”\u003c/p\u003e\n\u003cp\u003eDad knocks on my door.\u003c/p\u003e\n\u003cp\u003eI ignore him. I’m not in the mood to talk to anyone right now.\u003c/p\u003e\n\u003cp\u003eThe only one I want to keep company with is the one who understands my pain best – Dozer. He’s missing Mia as much as I am.\u003c/p\u003e\n\u003cp\u003eI hear the door open.\u003c/p\u003e\n\u003cp\u003e“Go away,” I mumble into my pillow. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-43.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
