{"id":98246,"no":8,"title":"Page 8","content":"\u003cp\u003e“Time for a lesson, Mia.”\u003c/p\u003e\n\u003cp\u003eMy eyes search tattoo Adonis’ jeans. He’s not wearing a belt.\u003c/p\u003e\n\u003cp\u003eWhat difference does that make? He wouldn’t need a belt to hurt me. There are other ways to hurt someone. Many other ways.\u003c/p\u003e\n\u003cp\u003eWhy did he go in the room?\u003c/p\u003e\n\u003cp\u003eTo put your bags in your room. To do his job.\u003c/p\u003e\n\u003cp\u003eThis guy isn’t Oliver or Forbes. He’s just some guy who works at a hotel. He’s not going to hurt me. Not all men all cruel.\u003c/p\u003e\n\u003cp\u003eI’m safe here. This is a hotel. There are other people staying here.\u003c/p\u003e\n\u003cp\u003eActually, come to think of it, I haven’t seen another soul since I arrived. Only him. And there was only one other car parked up outside when I arrived. The Mustang – the penis enhancer – which could be his car.\u003c/p\u003e\n\u003cp\u003eOh god, is that his car? Am I alone in this hotel with him?\u003c/p\u003e\n\u003cp\u003eThat’s his car, and I’m alone in this hotel with him.\u003c/p\u003e\n\u003cp\u003eChills shiver down my spine. I try to take in a deep breath, but my lungs won’t allow it. Panic is gripping my chest like a vice.\u003c/p\u003e\n\u003cp\u003eIt’s okay, Mia. Calm down. There could be people in the other rooms. It’s evening. They could be settled in for the night. Or out and returning later. Just because there isn’t another car parked outside, doesn’t mean a thing.\u003c/p\u003e\n\u003cp\u003eTattooed Adonis turns around. He tilts his head to the side, giving me a questioning look.\u003c/p\u003e\n\u003cp\u003eCan’t blame him. I am standing in the hall, acting like a complete weirdo, on the verge of a panic attack.\u003c/p\u003e\n\u003cp\u003eHis eyes move down my body. Why is looking at me like that?\u003c/p\u003e\n\u003cp\u003eAll my senses kick into high-alert.\u003c/p\u003e\n\u003cp\u003eI wrap my arms around my chest and straighten my back, trying to look taller and more confident than I could ever hope to be.\u003c/p\u003e\n\u003cp\u003eI can take care of myself now. I’m stronger than I used to be. I kneed Forbes in the balls and got away, didn’t I?\u003c/p\u003e\n\u003cp\u003eTattooed Adonis walks toward me. My urge to bolt becomes compelling.\u003c/p\u003e\n\u003cp\u003eI am not weak. I am not weak.\u003c/p\u003e\n\u003cp\u003eI’m a strong woman.\u003c/p\u003e\n\u003cp\u003eI force myself to keep steady, and step back to give him space to pass by.\u003c/p\u003e\n\u003cp\u003eTattooed Adonis towers over me. I knew he was a lot taller than me—not that it’s hard being that I’m pocket sized—but it’s so much more noticeable now he’s closer to me, and surprisingly, his closeness isn’t freaking me out as much as it should.\u003c/p\u003e\n\u003cp\u003e“Your key,” he offers.\u003c/p\u003e\n\u003cp\u003eI take it from him.\u003c/p\u003e\n\u003cp\u003e“Breakfast is served between seven and eight-thirty,” he states before walking away. Stopping, he adds, “And we don’t do evening meals, but there are plenty of restaurants nearby.”\u003c/p\u003e\n\u003cp\u003e“Are there any other guests staying here?” I have to ask.\u003c/p\u003e\n\u003cp\u003eHe stops and turns back. “No. Not until next week. Until then, it’s just you and me.”\u003c/p\u003e\n\u003cp\u003eI’m pretty sure my heart just died in my chest.\u003c/p\u003e\n\u003cp\u003eMe. Alone. Here.\u003c/p\u003e\n\u003cp\u003eWith him.\u003c/p\u003e\n\u003cp\u003eNo. No. No.\u003c/p\u003e\n\u003cp\u003eI can’t do that. I am stronger than I was, but that’s pushing myself to far too soon.\u003c/p\u003e\n\u003cp\u003e“Don’t worry it’s totally safe out here,” he says. I’m guessing it’s the look on utter panic on my face prompting this. “We have a great alarm system, and I have a shotgun. You know, just in case.”\u003c/p\u003e\n\u003cp\u003eA gun.\u003c/p\u003e\n\u003cp\u003eGod, no.\u003c/p\u003e\n\u003cp\u003e“What would happen if I pulled this trigger, Mia?”\u003c/p\u003e\n\u003cp\u003eI squeezed my eyes shut as I felt the cold metal press against my forehead. I could feel my body begin to sweat.\u003c/p\u003e\n\u003cp\u003eBut I held myself together. Made sure not to cry. If I did, it only made him angry.\u003c/p\u003e\n\u003cp\u003e“I would die, Oliver.”\u003c/p\u003e\n\u003cp\u003eThe gun pushed harder against my head. “Oliver!” he yelled. “You know to address me only as sir or daddy! How many times do I have to tell you this? How many lessons will it take?”\u003c/p\u003e\n\u003cp\u003eShit. Shit. Shit.\u003c/p\u003e\n\u003cp\u003eI’m so stupid.\u003c/p\u003e\n\u003cp\u003eThe gun retracted.\u003c/p\u003e\n\u003cp\u003e“I’m s-sorry, s-sir—d-daddy.” My voice was shaking as hard as my body because I knew what would come next.\u003c/p\u003e\n\u003cp\u003eAnd my fear was confirmed when I heard the familiar snap of his belt.\u003c/p\u003e\n\u003cp\u003e“I’m totally kidding. I don’t have a gun here.” The sound of Tattooed Adonis’ voice brings me to the now.\u003c/p\u003e\n\u003cp\u003eI need to be sick. Fear and bad memories are creeping across my skin, standing every hair on end.\u003c/p\u003e\n\u003cp\u003eI’m trying to stay calm. Stay normal. I don’t want to freak out in front of this guy, but it’s getting increasingly hard.\u003c/p\u003e\n\u003cp\u003eHe lifts his hands in a gentle gesture. “No guns. I promise. No need for them, like I said, it’s a safe place.”\u003c/p\u003e\n\u003cp\u003eBreathing in through my nose, I pull on my lip and tuck my short hair behind my ear.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” he asks, taking a step forward.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eBe strong. Stay here. You can do this, Mia.\u003c/p\u003e\n\u003cp\u003e“Yes. I’m fine.”\u003c/p\u003e\n\u003cp\u003eHis stare on me is curious. Can’t blame him. I am acting like a nutball.\u003c/p\u003e\n\u003cp\u003e“Okay, well if you need anything, just press reception on the phone in your room and it’ll bring you straight through to me.” He turns to leave. “Goodnight, Mia.”\u003c/p\u003e\n\u003cp\u003e“How do you know my name?”\u003c/p\u003e\n\u003cp\u003eLooking back, his eyebrow lifts. “I got it from your details when you filled the booking form in.”\u003c/p\u003e\n\u003cp\u003eHe smiles. It’s a really nice smile. Warm. Friendly. It eases me some.\u003c/p\u003e\n\u003cp\u003e“Oh, right. Yes.” I laugh, feeling a little stupid. “What should I call you?”\u003c/p\u003e\n\u003cp\u003eHe smiles again. “Jordan.”\u003c/p\u003e\n\u003cp\u003eI turn to face him. “Is this your hotel, Jordan?”\u003c/p\u003e\n\u003cp\u003eHe laughs. It’s a deep, manly sound that makes my stomach do somersaults. “No. My dad’s. He’s away taking care of my Grandpa at the moment, so I’m holding the fort.”\u003c/p\u003e\n\u003cp\u003e“Oh, nothing serious I hope?”\u003c/p\u003e\n\u003cp\u003e“No, just a minor op, but he’s off his feet for a few weeks, so Dad’s gone to take care of him.”\u003c/p\u003e\n\u003cp\u003eI nod. “Well, thank you. Again.” I smile at him as I back up and quickly retreat into my room.\u003c/p\u003e\n\u003cp\u003eI lock the door behind me and fall against it.\u003c/p\u003e\n\u003cp\u003eDeep breaths, Mia.\u003c/p\u003e\n\u003cp\u003eThis is going to be okay. And apart from his snippiness before, Jordan does seem like a good guy.\u003c/p\u003e\n\u003cp\u003eYeah, but so did Forbes.\u003c/p\u003e\n\u003cp\u003eI grab the chair I just spotted by the dressing table, drag it over to the door, and push it up under the handle.\u003c/p\u003e\n\u003cp\u003eDoesn’t hurt to be safe.\u003c/p\u003e\n\u003cp\u003eTurning, I take the room in for the first time. Really pretty. A four poster bed dressed in soft beige linens rests against the back wall. A large window is situated to the side, and on the far wall there are double glass doors. I go over to the doors and push the drapes back to peer out. I can’t see much; just the porch and the moonlight pouring over trees in the distance. I’ll check it out in the morning.\u003c/p\u003e\n\u003cp\u003eI double check that the doors are locked, then close the drapes, including the ones on the windows.\u003c/p\u003e\n\u003cp\u003eI stand in the middle of the room. The silence chills me, and my mind starts to overwork again.\u003c/p\u003e\n\u003cp\u003eFear curdles inside and poisons me.\u003c/p\u003e\n\u003cp\u003eAnd I can’t stop myself from walking straight to the bathroom, kneeling down in front of the toilet, lifting the lid, and purging.\u003c/p\u003e\n\u003cp\u003eChapter Five\u003c/p\u003e\n\u003cp\u003eJordan\u003c/p\u003e\n\u003cp\u003eA few hours earlier…\u003c/p\u003e\n\u003cp\u003eI climb out of bed. Removing the condom, I tie a knot in the end and toss it in the trashcan. Grabbing my jeans from the floor, I start to pull them on.\u003c/p\u003e\n\u003cp\u003e“Stay in bed with me.” Shawna’s hand sneaks out from under the cover and grabs hold of my hand, tugging on it.\u003c/p\u003e\n\u003cp\u003eI pull it free. “Can’t. I’ve got work to do. And I need to get this bed made up.”\u003c/p\u003e\n\u003cp\u003eThat’s a lie. There’s not a lot to do here at the moment. We need guests to create work, and currently there aren’t any, so the world won’t end if this bed stays unmade for a while longer. I just don’t want to stay in bed with her and cuddle.\u003c/p\u003e\n\u003cp\u003eBecause that’s what she’s asking. She doesn’t have to say the exact words. I just know when it reaches this point with a woman.\u003c/p\u003e\n\u003cp\u003eAnd that’s when I’m done.\u003c/p\u003e\n\u003cp\u003eI’m not a cuddler.\u003c/p\u003e\n\u003cp\u003eI fuck.\u003c/p\u003e\n\u003cp\u003eThe end.\u003c/p\u003e\n\u003cp\u003eShe knows this. I told her right before we started having sex how it was. Like I tell them all. It’s just a shame they don’t bother to listen, regardless of how heavily I highlight the fact.\u003c/p\u003e\n\u003cp\u003eGuess it’s time to put the brakes on this little thing we’ve had going. Shame. She was pretty good in the sack.\u003c/p\u003e\n\u003cp\u003eI’m just pulling my t-shirt on when she climbs out of bed.\u003c/p\u003e\n\u003cp\u003eI watch her walk toward me. I might be about to call time on her, but that doesn’t mean I can’t appreciate her fine body – legs that go on forever, and tits that are definitely not real. Still, I wasn’t complaining when I had them in my mouth ten minutes ago.\u003c/p\u003e\n\u003cp\u003eShe presses herself up against me. Arms snaking around my waist, she starts to kiss my neck. “I want to fuck again,” she murmurs against my skin.\u003c/p\u003e\n\u003cp\u003eTempting as that is, just knowing what’s going on inside her head—the words ‘Jordan’ and ‘boyfriend’—keeps my boy at bay.\u003c/p\u003e\n\u003cp\u003eYou might think I’m a bastard for just having sex with her and then calling time, and really that wasn’t my intention when I crawled into bed with her an hour ago. I’d thought there were a few more times to be had.\u003c/p\u003e\n\u003cp\u003eUntil she wanted to get cozy with me.\u003c/p\u003e\n\u003cp\u003eI usually end these things in a much nicer way, but trust me, it’s crueler to let her leave here thinking I’m going to call her again when I’m not.\u003c/p\u003e\n\u003cp\u003eI’m always honest, if nothing else.\u003c/p\u003e\n\u003cp\u003eReaching behind me I take hold of her hands. Pulling her free from around my waist, I squeeze her hands, then let go.\u003c/p\u003e\n\u003cp\u003eI step back from her. “Look, Shawna, it’s been great an’ all … but I’d say we’re done here.”\u003c/p\u003e\n\u003cp\u003eShe pauses. Frowns. Then gets this crazy look in her eyes that some chicks get when they realize you’re ending things with them.\u003c/p\u003e\n\u003cp\u003eThe stage five clinger look.\u003c/p\u003e\n\u003cp\u003e“Done?” Her voice has gone screechy.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eI really didn’t have her pegged as stage five clinger material when I met her. Guess I got that plenty fucking wrong.\u003c/p\u003e\n\u003cp\u003eI could really do without a crazy chick moment right now.\u003c/p\u003e\n\u003cp\u003eHere we go…\u003c/p\u003e\n\u003cp\u003e“Shawna…” I rub my forehead, and drive my fingers into my hair, pushing it back. “We both knew what this was from the beginning. I was clear on that. It was never gonna last longer than a few weeks, and we’re already well past that.”\u003c/p\u003e\n\u003cp\u003e“It’s been a week, Jordan.”\u003c/p\u003e\n\u003cp\u003eFuck, is that all? Feels way longer. Definitely time to get rid of her.\u003c/p\u003e\n\u003cp\u003e“Look…” I put on my best ‘sensitive, but I’m still ditching your ass’ voice. “It’s been fun, Shawna. You’re fun. But it’s time to move on.”\u003c/p\u003e\n\u003cp\u003eWith a look straight from the devil, she grabs her clothes from the floor and starts yanking them on.\u003c/p\u003e\n\u003cp\u003e“Fun? FUN!” Her screeching is actually hurting my ears. “I thought we had something really great here! I thought you really liked me!”\u003c/p\u003e\n\u003cp\u003eSee what I mean?\u003c/p\u003e\n\u003cp\u003eNever.\u003c/p\u003e\n\u003cp\u003eFucking.\u003c/p\u003e\n\u003cp\u003eListen.\u003c/p\u003e\n\u003cp\u003e“When did I say that? Oh yeah, never. I thought you were hot, and I definitely wanted to have sex with you – multiple times. But feelings never came into it. Not once. And no fuckin’ way do I want a relationship.”\u003c/p\u003e\n\u003cp\u003eOuch. That was probably a bit harsh.\u003c/p\u003e\n\u003cp\u003eShe steps close and pokes me in the chest with her fingernail. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-8.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
