{"id":98247,"no":9,"title":"Page 9","content":"\u003cp\u003eFuck, that hurt. Her nails are sharp. They felt good when they were raking down my back, but now, not so much.\u003c/p\u003e\n\u003cp\u003e“You’re a fucking bastard!” she yells in my face. “And you’re going to spend your whole life lonely and miserable!”\u003c/p\u003e\n\u003cp\u003eWow, so original – like I haven’t heard that line before. Why do all women say that exact same thing when you’re blowing them off?\u003c/p\u003e\n\u003cp\u003eTrust me, I’m not miserable. Far from it.\u003c/p\u003e\n\u003cp\u003eSeeing what my dad’s gone through … loving Mom, then having to watch her die … seeing how my dad is now … an empty shell of the man he was…\u003c/p\u003e\n\u003cp\u003eThat’s misery.\u003c/p\u003e\n\u003cp\u003eI’m never putting myself through that. I’ll stay as I am, thanks.\u003c/p\u003e\n\u003cp\u003eWhen it comes to women, I put my dick in and keep my heart out. It’s the easiest way.\u003c/p\u003e\n\u003cp\u003eI lean down, close to her face. “Shawna, you knew from the beginning I wasn’t in for anything more than a fuck, so don’t act all shocked and shit on now. You knew exactly who you were getting into bed with.”\u003c/p\u003e\n\u003cp\u003eWhy do all women think they can change me? I’m unchangeable. When will they get this?\u003c/p\u003e\n\u003cp\u003e“Fuck you!” she screams. She actually screams at me.\u003c/p\u003e\n\u003cp\u003eJesus Christ, I cannot stand dramatic women. Nothing turns me off quicker … well, apart from cuddling.\u003c/p\u003e\n\u003cp\u003e“Isn’t that the point?” I smirk, stepping back. “You want to fuck, and I don’t.” I sweep my arm out in the direction of the door. “Don’t let the door hit your ass on the way out, sweetheart.”\u003c/p\u003e\n\u003cp\u003eI’m not usually this much of a dick, but honestly, she’s getting on my last fucking nerve.\u003c/p\u003e\n\u003cp\u003eShawna looks as if she’s ready to pummel me to death. Bending down, she grabs her heels, shoves her feet in them, and grabs her purse from the nightstand.\u003c/p\u003e\n\u003cp\u003e“You’re going to regret this,” she hisses.\u003c/p\u003e\n\u003cp\u003e“Not likely.”\u003c/p\u003e\n\u003cp\u003e“Asshole!” She pushes her way past me, and stomps out the room, slamming the door behind her.\u003c/p\u003e\n\u003cp\u003eI hear her heels clattering down the hall, then the main door slams shut. A minute later, her car engines revs loudly, and spinning tires kick up against the gravel.\u003c/p\u003e\n\u003cp\u003eWell, that went well.\u003c/p\u003e\n\u003cp\u003eI run my hands through my hair, then go and grab some clean sheets from the linen closet.\u003c/p\u003e\n\u003cp\u003eI strip the bed and have it remade in two minutes flat.\u003c/p\u003e\n\u003cp\u003eCan you tell this isn’t my first rodeo?\u003c/p\u003e\n\u003cp\u003eI have sex in the hotel rooms because I don’t like to share my bed. I want to go to sleep without the scent of sex lingering from the last girl I hooked up with. And for some reason, the girls I hook up with seem to think it’s romantic to have sex in a hotel room.\u003c/p\u003e\n\u003cp\u003eCouldn’t be less so in my opinion.\u003c/p\u003e\n\u003cp\u003eBut they think that, so it works well for me. This is when living at a hotel comes in handy.\u003c/p\u003e\n\u003cp\u003eI bundle the dirty sheets up in my arms to take to the laundry room.\u003c/p\u003e\n\u003cp\u003eGuess it’s time to find a new fuck buddy. First things first, though. Shower, then food.\u003c/p\u003e\n\u003cp\u003eI’m starving.\u003c/p\u003e\n\u003cp\u003eI’m just biting into my sandwich when the phone rings. Putting it back down on the plate, I grab the phone off the wall, quickly chewing and swallowing down my bite. God, that’s good. I make a great fucking sandwich.\u003c/p\u003e\n\u003cp\u003e“Golden Oaks,” I say, cleaning sandwich off my teeth with my tongue.\u003c/p\u003e\n\u003cp\u003e“Jordan, it’s Beth.”\u003c/p\u003e\n\u003cp\u003eI sit back down in my seat. “Beth, I know it’s you. I’ve known you my whole life, so it’s safe to say I recognize your voice on the phone.”\u003c/p\u003e\n\u003cp\u003eShe laughs. “Fair enough. Anyway, I’m just calling to let you know I’ve sent a tourist up your way.”\u003c/p\u003e\n\u003cp\u003e“Ah, great thanks. You’re good to me.”\u003c/p\u003e\n\u003cp\u003e“I know I am. Too good. And Jordan, the tourist is a girl. And she’s pretty, real pretty. So just try to keep it in your pants, okay? Your dad needs the business, and screwing the guests, then screwing them over, just doesn’t bode well with that.”\u003c/p\u003e\n\u003cp\u003e“Jesus, Beth! One time. One fuckin’ time it happened! And she never told me she was married.”\u003c/p\u003e\n\u003cp\u003e“One!” She laughs. “Angry husband’s aside, I can count off the top of my head at least ten women you’ve had hissing at you this past year, and it’s only July.”\u003c/p\u003e\n\u003cp\u003e“Ten? Come on that’s a bit of an exaggeration.”\u003c/p\u003e\n\u003cp\u003eShe laughs, once. “I was being kind with that figure.”\u003c/p\u003e\n\u003cp\u003eI do quick math in my head.\u003c/p\u003e\n\u003cp\u003eOkay, maybe she’s right.\u003c/p\u003e\n\u003cp\u003e“Whatever,” I mutter. “I’m actually a little insulted you think women leave here with not one good word to say after a ride from Jordan Matthews.”\u003c/p\u003e\n\u003cp\u003e“Don’t talk about yourself in the third person, it freaks me out when you do that. And yes, once you stick your dick in a woman it doesn’t end in a song of happiness. You’re awesome at the wooing. Just not the ending.”\u003c/p\u003e\n\u003cp\u003e“I don’t woo. We’re not in the nineteenth century. I fuck. And I’m awesome at it. Hence why women keep coming back for more. And can you stop talking about my dick? You’re actually starting to turn me on, and that’s freaking me out.”\u003c/p\u003e\n\u003cp\u003e“Ugh, god! Okay, we’ll end the conversation here. Just leave the pretty tourist alone.”\u003c/p\u003e\n\u003cp\u003e“You seem overly pushy on this one. Are you warning me off for another reason? Maybe because you want her for yourself?”\u003c/p\u003e\n\u003cp\u003e“Jordan Matthews!” she scolds, making me laugh. “One, she’s not into girls. I could tell. And two, she’s too pretty if you know what I mean.”\u003c/p\u003e\n\u003cp\u003e“No. I really don’t,” I deadpan. “There’s no such thing as too pretty.”\u003c/p\u003e\n\u003cp\u003e“Yes, there is. There’s the kind of pretty that comes with a warning label. This girl is trouble. Look, I have to go. The diner’s busy, and Mom is shooting me daggers from up front. Just be good, for me. And if not for me, your dad. He could really do without the hassle after everything that’s happened.”\u003c/p\u003e\n\u003cp\u003eMy back stiffens.\u003c/p\u003e\n\u003cp\u003eHer stark reminder is like a sharp slap in the face. Probably one I needed.\u003c/p\u003e\n\u003cp\u003e“You’re not saying anything … did I overstep the mark?” she says softly.\u003c/p\u003e\n\u003cp\u003e“No.” I sigh. “You said what I needed to hear. I’ll be good, I promise.”\u003c/p\u003e\n\u003cp\u003e“I’m only looking out for you because I love you, you know that.”\u003c/p\u003e\n\u003cp\u003e“I know. And you’re the only woman who can say that to me without sending me running.”\u003c/p\u003e\n\u003cp\u003e“That’s because I haven’t slept with you.”\u003c/p\u003e\n\u003cp\u003e“And that is because you, Beth Turner, are one smart girl.”\u003c/p\u003e\n\u003cp\u003e“Yeah. That, and the fact I’m a lesbian.”\u003c/p\u003e\n\u003cp\u003eI chuckle. “Well, yeah. That too.”\u003c/p\u003e\n\u003cp\u003eFifteen minutes later, I hear a car pulling up the drive. It’ll be the hot tourist.\u003c/p\u003e\n\u003cp\u003eI’m going to show Beth that I’m completely capable of keeping myself in check around a pretty girl.\u003c/p\u003e\n\u003cp\u003eI am not ruled by my dick.\u003c/p\u003e\n\u003cp\u003eAnd anyway, just because Beth thinks she’s pretty doesn’t mean I will.\u003c/p\u003e\n\u003cp\u003eShe could be fuck ugly. Or at the very least, a butter face.\u003c/p\u003e\n\u003cp\u003eNah. Who am I kidding? If Beth thinks she’s pretty, then I definitely will. We have the same taste in women.\u003c/p\u003e\n\u003cp\u003eA few minutes later, I hear the bell ring on the main door.\u003c/p\u003e\n\u003cp\u003eShowtime.\u003c/p\u003e\n\u003cp\u003eI haul my ass out of the chair and start to make my way upstairs. As I’m climbing, I hear her voice call out.\u003c/p\u003e\n\u003cp\u003e“Hello? Is anyone there?”\u003c/p\u003e\n\u003cp\u003e“Jeez, give me a minute,” I mutter.\u003c/p\u003e\n\u003cp\u003eI take the rest of the stairs two at a time, quickly moving through the office, out to the reception desk, and…\u003c/p\u003e\n\u003cp\u003eFuck me.\u003c/p\u003e\n\u003cp\u003eFucking. Fuck. Fuck.\u003c/p\u003e\n\u003cp\u003eThe hottest chick I have ever seen in my life is standing before me.\u003c/p\u003e\n\u003cp\u003eThe.\u003c/p\u003e\n\u003cp\u003eHottest.\u003c/p\u003e\n\u003cp\u003eEver.\u003c/p\u003e\n\u003cp\u003eBeth calling her pretty was an understatement. A massive understatement.\u003c/p\u003e\n\u003cp\u003eShe’s stunning.\u003c/p\u003e\n\u003cp\u003eAnd I’m so completely screwed.\u003c/p\u003e\n\u003cp\u003eIt’s weird though because I usually go for tall girls. I like long legs, but this girl is tiny. I’d give her five-three max. At six-two, I’m almost a whole foot taller than her. And her tits are smaller than I usually prefer.\u003c/p\u003e\n\u003cp\u003eHer hair is blonde and short. Pixie cut. She kind of looks like Tinker Bell. I usually dig long hair on chicks; something to wrap my hand around while I fuck them.\u003c/p\u003e\n\u003cp\u003eBut this girl, who is pretty much the opposite of everything I usually go for, has made my dick as hard as stone just by looking at her.\u003c/p\u003e\n\u003cp\u003eNever. Happened. Before.\u003c/p\u003e\n\u003cp\u003eI usually need them to be naked, or to at least have a little hands on action first.\u003c/p\u003e\n\u003cp\u003eShe’s like the world’s best visual hand job.\u003c/p\u003e\n\u003cp\u003eSeriously, I think if she just lays a finger on me I’ll jizz my pants, and that hasn’t happened since seventh grade when I was with Katie Harris in the sports closet. Two tugs and I was done. Not one of my finer moments, but in my defense, Katie was the first girl to touch my cock.\u003c/p\u003e\n\u003cp\u003eI’m just thanking my good luck right now that this reception desk is high enough to hide the massive boner I’m sporting.\u003c/p\u003e\n\u003cp\u003e“Hello,” she says. Her tongue darts out to moisten her lips.\u003c/p\u003e\n\u003cp\u003eJesus, she has the sweetest looking mouth. The kind of cherry red lips you want to suck on. The kind of lips I want to see sucking me off.\u003c/p\u003e\n\u003cp\u003eI only wish I could see her eyes. Eyes are my other thing aside from legs. I like them big, but she’s wearing huge ass sunglasses. I hate it when women do that. It’s sunny, you wear sunglasses. Not at eight in the goddamn evening.\u003c/p\u003e\n\u003cp\u003eRealizing I haven’t spoken a word in reply, and have done nothing but stare at this girl for an insane amount of time, I find my voice and ask, “How can I help?”\u003c/p\u003e\n\u003cp\u003eThere are a few different ways she could answer that question. One involves her telling me to bend her over this reception desk and…\u003c/p\u003e\n\u003cp\u003e“I, uh, need a room.”\u003c/p\u003e\n\u003cp\u003eJesus, her voice is as sweet as light molasses.\u003c/p\u003e\n\u003cp\u003eMy dick twitches, pulsing hard against my, now, incredibly tight jeans.\u003c/p\u003e\n\u003cp\u003eI need this hard on to disappear.\u003c/p\u003e\n\u003cp\u003eI can do this. My dick does not rule me. I’m in control here.\u003c/p\u003e\n\u003cp\u003eThink of being some chick’s boyfriend, Matthews. The stage five clinger from earlier…\u003c/p\u003e\n\u003cp\u003eAnd there you go. Down boy.\u003c/p\u003e\n\u003cp\u003eHot girl steps close to the counter and sets her bags to the floor.\u003c/p\u003e\n\u003cp\u003eShe smells good. Like a mixture of vanilla and expensive perfume.\u003c/p\u003e\n\u003cp\u003eI want to lean in close and inhale.\u003c/p\u003e\n\u003cp\u003eAnd possibly lick her.\u003c/p\u003e\n\u003cp\u003eShe moistens her lips again before speaking. It’s really distracting. “Beth, the girl at the diner in town? She sent me here. Said you’d have a room available.”\u003c/p\u003e\n\u003cp\u003eI pull my eyes from her lips and stare into those ugly ass sunglasses. All I get is my own reflection back. Which is not a bad thing, I just really want to see her without them on.\u003c/p\u003e\n\u003cp\u003eI wonder if she’d be offended if I reached over and pulled them off?\u003c/p\u003e\n\u003cp\u003eClearing my head and throat, I say, “We do. How long do want to stay for?”\u003c/p\u003e\n\u003cp\u003e“Um.” She tilts her chin down and shifts on her feet. “I’m not sure … two weeks?”\u003c/p\u003e\n\u003cp\u003eTwo weeks. This is just the kind of money we could do with right now. If I can keep my hands off her that is.\u003c/p\u003e\n\u003cp\u003e“Are you asking or telling me?”\u003c/p\u003e\n\u003cp\u003eWow, I sounded like a complete asshole then.\u003c/p\u003e\n\u003cp\u003eShe looks uncomfortable.\u003c/p\u003e\n\u003cp\u003eAnd I feel like shit.\u003c/p\u003e\n\u003cp\u003eWhat the hell is wrong with me?\u003c/p\u003e\n\u003cp\u003eHer hand reaches up and starts to pull on her lower lip – it’s actually kind of hot watching her tug on that lip. It’s definitely turning me on again. Okay, so again is probably the wrong word since I haven’t been ‘off’ since I laid eyes on her. \u003c/p\u003e","sourceLink":"https://allnovel.net/trouble/page-9.html","bookId":2000,"creation":"Oct 5, 2019 6:33:29 PM","modification":"Oct 5, 2019 6:33:29 PM"}
