{"id":65527,"no":28,"title":"Page 28","content":"\u003cp\u003ePICARD MET US IN HIS DOUR LOBBY AND TOOK US OFF INTO a side room. We ran through what we knew. He nodded and his eyes gleamed. He was looking at a big case.\u003c/p\u003e\n\u003cp\u003e\"Excellent work, my friends,\" he said. \"But who are we dealing with now? I think we got to say all these little Hispanic guys are outsiders. They\u0027re the hired help. They\u0027re not concealed. But locally, we still got five out of the original ten hidden away. We haven\u0027t identified them. That could make things very tricky for us. We know about Morrison, Teale, Baker and the two Kliners, right? But who are the other five? Could be anybody down there, right?\"\u003c/p\u003e\n\u003cp\u003eI shook my head at him.\u003c/p\u003e\n\u003cp\u003e\"We only need to ID one more,\" I said. \"I sniffed out four more last night. There\u0027s only the tenth guy we don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003ePicard and Finlay both sat up.\u003c/p\u003e\n\u003cp\u003e\"Who are they?\" Picard said.\u003c/p\u003e\n\u003cp\u003e\"The two gatemen from the warehouse,\" I said. \"And two more cops. The backup crew from last Friday.\"\u003c/p\u003e\n\u003cp\u003e\"More cops?\" Finlay said. \"Shit.\"\u003c/p\u003e\n\u003cp\u003ePicard nodded. Laid his giant hands palm down on the table.\u003c/p\u003e\n\u003cp\u003e\"OK,\" he said. \"You guys head back to Margrave right now. Try to stay out of trouble, but if you can\u0027t, then make the arrests. But be very careful of this tenth guy. Could be anybody at all. I\u0027ll be right behind you. Give me twenty minutes to go get Roscoe back, and I\u0027ll see you down there.\"\u003c/p\u003e\n\u003cp\u003eWe all stood up. Shook hands all round. Picard headed upstairs and Finlay and I headed back out to the Bentley.\u003c/p\u003e\n\u003cp\u003e\"How?\" he asked me.\u003c/p\u003e\n\u003cp\u003e\"Baker,\" I said. \"He bumped into me last night. I spun him a yarn about going up to Hubble\u0027s place looking for some documentation, then I went up there and waited to see what would happen. Along came the Kliner kid and four of his pals. They came to nail me to Hubble\u0027s bedroom wall.\"\u003c/p\u003e\n\u003cp\u003e\"Christ,\" he said. \"So what happened?\"\u003c/p\u003e\n\u003cp\u003e\"I took them out,\" I said.\u003c/p\u003e\n\u003cp\u003eHe did his thing of staring sideways at me at ninety miles an hour.\u003c/p\u003e\n\u003cp\u003e\"You took them out?\" he said. \"You took the Kliner kid out?\"\u003c/p\u003e\n\u003cp\u003eI nodded. He was quiet for a while. Slowed to eighty-five.\u003c/p\u003e\n\u003cp\u003e\"How did it go down?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I ambushed them,\" I said. \"Three of them, I hit on the head. One of them, I cut his throat. The Kliner kid, I drowned in the swimming pool. That\u0027s how Joe\u0027s list got soaked. Washed all the writing off.\"\u003c/p\u003e\n\u003cp\u003e\"Christ,\" he said again. \"You killed five men. That\u0027s a hell of a thing, Reacher. How do you feel about that?\"\u003c/p\u003e\n\u003cp\u003eI shrugged. Thought about my brother Joe. Thought about him as a tall gawky eighteen-year-old, just off to West Point. Thought about Molly Beth Gordon, holding up her heavy burgundy leather briefcase, smiling at me. I glanced across at Finlay and answered his question with one of my own.\u003c/p\u003e\n\u003cp\u003e\"How do you feel when you put roach powder down?\" I asked him.\u003c/p\u003e\n\u003cp\u003eHe shook his head in a spasm like a dog clearing its coat of cold water.\u003c/p\u003e\n\u003cp\u003e\"Only four left,\" he said.\u003c/p\u003e\n\u003cp\u003eHe started kneading the old car\u0027s steering wheel like he was a baker making a pastry twist. He looked through the windshield and blew a huge sigh.\u003c/p\u003e\n\u003cp\u003e\"Any feeling for this tenth guy?\" he said.\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t really matter who it is,\" I said. \"Right now he\u0027s up at the warehouse with the other three. They\u0027re short of staff now, right? They\u0027ll all be on guard duty overnight. Loading duty tomorrow. All four of them.\"\u003c/p\u003e\n\u003cp\u003eI flicked on the Bentley\u0027s radio. Some big chrome thing. Some kind of a twenty-year-old English make. But it worked. It pulled in a decent station. I sat listening to the music, trying not to fall asleep.\u003c/p\u003e\n\u003cp\u003e\"Unbelievable,\" Finlay said. \"How the hell did a place like Margrave start up with a thing like this?\"\u003c/p\u003e\n\u003cp\u003e\"How did it start?\" I said. \"It started with Eisenhower. It\u0027s his fault.\"\u003c/p\u003e\n\u003cp\u003e\"Eisenhower?\" he said. \"What\u0027s he got to do with it?\"\u003c/p\u003e\n\u003cp\u003e\"He built the interstates,\" I said. \"He killed Margrave. Way back, that old county road was the only road. Everybody and everything had to pass through Margrave. The place was full of rooming houses and bars, people were passing through, spending money. Then the highways got built, and air travel got cheap, and suddenly the town died. It withered away to a dot on the map because the highway missed it by fourteen miles.\"\u003c/p\u003e\n\u003cp\u003e\"So it\u0027s the highway\u0027s fault?\" he said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Mayor Teale\u0027s fault,\" I said. \"The town sold the land for the warehouses to earn itself some new money, right? Old Teale brokered the deal. But he didn\u0027t have the courage to say no when the new money turned out to be bad money. Kliner was fixing to use it for the scam he was setting up, and old Teale jumped straight into bed with him.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a politician,\" Finlay said. \"They never say no to money. And it was a hell of a lot of money. Teale rebuilt the whole town with it.\"\u003c/p\u003e\n\u003cp\u003e\"He drowned the whole town with it,\" I said. \"The place is a cesspool. They\u0027re all floating around in it. From the mayor right down to the guy who polishes the cherry trees.\"\u003c/p\u003e\n\u003cp\u003eWe stopped talking again. I fiddled with the radio dial and heard Albert King tell me if it wasn\u0027t for bad luck, he wouldn\u0027t have no luck at all.\u003c/p\u003e\n\u003cp\u003e\"But why Margrave?\" Finlay said again.\u003c/p\u003e\n\u003cp\u003eOld Albert told me bad luck and trouble\u0027s been his only friend.\u003c/p\u003e\n\u003cp\u003e\"Geography and opportunity,\" I said. \"It\u0027s in the right place. All kinds of highways meet down here and it\u0027s a straight run on down to the boatyards in Florida. It\u0027s a quiet place and the people who ran the town were greedy scumbags who\u0027d do what they were told.\"\u003c/p\u003e\n\u003cp\u003eHe went quiet. Thinking about the torrent of dollar bills rushing south and east. Like a storm drain after a flood. A little tidal wave. A small and harassed workforce in Margrave keeping it rolling on. The slightest hitch and tens of thousands of dollars would back up and jam. Like a sewer. Enough money to drown a whole town in. He drummed his long fingers on the wheel. Drove the rest of the way in silence.\u003c/p\u003e\n\u003cp\u003eWE PARKED UP IN THE SLOT NEAREST THE STATION HOUSE door. The car was reflected in the plate glass. An antique black Bentley, worth a hundred grand on its own. With another hundred grand in the trunk. The most valuable vehicle in the State of Georgia. I popped the trunk lid. Laid my jacket on top of the air conditioner box. Waited for Finlay and walked up to the door.\u003c/p\u003e\n\u003cp\u003eThe place was deserted apart from the desk sergeant. He nodded to us. We skirted the reception counter. Walked through the big quiet squad room to the rosewood office in back. Stepped in and closed the door. Finlay looked uneasy.\u003c/p\u003e\n\u003cp\u003e\"I want to know who the tenth guy is,\" he said. \"It could be anybody. Could be the desk sergeant. There\u0027s been four cops in this already.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not him,\" I said. \"He never does anything. Just parks his fat ass on that stool. Could be Stevenson, though. He was connected to Hubble.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said. \"Teale pulled him in off the road when he took over. He wanted him where he could see him. So it\u0027s not Stevenson. I guess it could be anybody. Could be Eno. Up at the diner? He\u0027s a bad-tempered type of a guy.\"\u003c/p\u003e\n\u003cp\u003eI looked at him.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a bad-tempered type of a guy, Finlay,\" I said. \"Bad temper never made anybody a criminal.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. Ignored the jibe.\u003c/p\u003e\n\u003cp\u003e\"So what do we do?\" he said.\u003c/p\u003e\n\u003cp\u003e\"We wait for Roscoe and Picard,\" I said. \"We take it from there.\"\u003c/p\u003e\n\u003cp\u003eI sat on the edge of the big rosewood desk, swinging my leg. Finlay paced up and down on the expensive carpet. We waited like that for about twenty minutes and then the door opened. Picard stood there. He was so big, he filled the whole doorway. I saw Finlay staring at him, like there was something wrong with him. I followed his gaze.\u003c/p\u003e\n\u003cp\u003eThere were two things wrong with Picard. First, he didn\u0027t have Roscoe with him. Second, he was holding a government-issue.38 in his giant hand. He was holding it rock steady, and he was pointing it straight at Finlay. \u003c/p\u003e","sourceLink":"https://allnovel.net/killing-floor-jack-reacher-1/page-28.html","bookId":2339,"creation":"Oct 5, 2019 9:58:04 AM","modification":"Oct 5, 2019 9:58:04 AM"}
