{"id":85727,"no":25,"title":"Page 25","content":"\u003cp\u003e‘So? I’m being polite.’\u003c/p\u003e\n\u003cp\u003e‘I’m just saying …’ Ronan eyed me carefully. ‘Yesterday you were in a terrible mood and today you’re on some kind of natural high.’\u003c/p\u003e\n\u003cp\u003eBlowing them off, I turned away and rested my chin on my palm. ‘I had a bit of a falling-out with a friend Monday night,’ I lied, but attempted to keep my story as close to the truth as possible. ‘We sorted out our misunderstanding. Now I’m in a good mood.’\u003c/p\u003e\n\u003cp\u003e‘Well, what a bloody boring explanation that was,’ Angus said teasingly. ‘You’re a librarian, Liv. You’re surrounded by books and material for a good yarn. And you stick to the truth.’ He tutted. ‘Have I taught you nothing?’\u003c/p\u003e\n\u003cp\u003eI smiled sweetly. ‘I’m quickly learning how to become a drama queen.’\u003c/p\u003e\n\u003cp\u003e‘Well, that’s something, I suppose. I’ll be in my office, then, where in five minutes a dashing stranger who looks an awful lot like Ryan Gosling will shackle me to my desk and do completely inappropriate and naughty things to me for the next two hours.’ Angus arched an eyebrow at me. ‘Now didn’t that sound better than “I’ll be writing this month’s rota.” ’\u003c/p\u003e\n\u003cp\u003eI laughed. ‘Point taken.’ I heaved a contrite sigh. ‘Well, if you must know, Monday night I had wild, amazing sex with this hot guy but shit got weird and I was in a really bad mood about it but he surprised me by appearing in my apartment last night where we had more hot wild monkey sex before we snuggled up and watched a movie. Hence my good mood today.’\u003c/p\u003e\n\u003cp\u003eAll three of them looked at me incredulously and then Angus made a face. ‘My Ryan Gosling story was far better.’\u003c/p\u003e\n\u003cp\u003eI grinned and turned to serve the student approaching my desk, Nate and my secret still … well, a delicious secret.\u003c/p\u003e\n\u003cp\u003eLater that day I was still in a fantastic mood and more than happy to see my dad standing outside my building with a shopping bag in hand. As soon as I reached him, he bent his massive frame so he could press a kiss to my cheek.\u003c/p\u003e\n\u003cp\u003e‘Hi, baby girl. Hope you don’t mind’ – he lifted the bag – ‘I brought some food over. Thought I could cook you dinner.’\u003c/p\u003e\n\u003cp\u003eI unlocked the building door and let us in. ‘Of course I don’t mind. It’s great to see you.’\u003c/p\u003e\n\u003cp\u003eOnce we were inside, Dad immediately set about cooking and soon my apartment smelled like home. Like old times, we chopped vegetables together and I stirred the sauce while Dad boiled the pasta. You wouldn’t think there was an art to boiling pasta, but there was. Apparently. Just ask my dad.\u003c/p\u003e\n\u003cp\u003eOur conversation as we cooked was light. Dad told me about this new contract he’d just signed to work with Braden’s company again, while I told him about the sock I’d found in a returned book last week only to come upon the matching sock in the reserve section on Monday. They were dirty socks. I was all for weird. But there was weird, and then there was just weird. Angus had this theory that we had a crackpot Harry Potter fan in our midst and this person had somehow confused library assistants with enslaved house elves and by giving us socks thought he was doing a humanitarian act.\u003c/p\u003e\n\u003cp\u003eI thought it was a pretty good theory.\u003c/p\u003e\n\u003cp\u003eBetter than my theory that some immature freshman was stashing his dirty socks everywhere, laughing his ass off while he filmed me finding them and then put the video up on YouTube.\u003c/p\u003e\n\u003cp\u003eWe ate sitting on stools at my counter, and I was having a great time just chilling with my dad when our conversation took a more serious turn.\u003c/p\u003e\n\u003cp\u003e‘So you’ve been quiet lately?’ He eyed me, his eyes sharp, searching.\u003c/p\u003e\n\u003cp\u003eI shrugged, feeling guilty as hell about keeping my shenanigans with Nate from Dad. ‘I’ve just been busy.’\u003c/p\u003e\n\u003cp\u003e‘Did you know Joss and Braden are back from their honeymoon?’\u003c/p\u003e\n\u003cp\u003eAnother pang of guilt. Wonderful. ‘No, I didn’t know that.’ I swirled a piece of pasta around my fork. I didn’t know that because I was too lost in my selfish sexual world with Nate Sawyer to give a shit what was going on outside of it. That would have to stop. ‘I should call Joss.’\u003c/p\u003e\n\u003cp\u003e‘This … absence … Is it because of Dee?’ Dad looked deep into my eyes for answers. ‘Because I think we should talk about that. About me and Dee, I mean.’\u003c/p\u003e\n\u003cp\u003eMy breath caught at his expression, at his words, and I felt my pulse speed up. Sweat coated my palms as I shakily exhaled. ‘Are you … are you going to ask her to marry you?’\u003c/p\u003e\n\u003cp\u003eDad frowned and gave a slight shake of his head. ‘No, baby girl. No. Though I’m going to take all the color draining from your face at the mere thought of it as a bad sign.’\u003c/p\u003e\n\u003cp\u003e‘No.’ I hurried to assure him. ‘Dad, I like Dee. I don’t know her as well as you do, but I like what I do know.’\u003c/p\u003e\n\u003cp\u003eHe studied me, not convinced. ‘Then why do you look ill at the thought of me marrying her?’\u003c/p\u003e\n\u003cp\u003ePushing my food around my plate, I shrugged. ‘It’s silly. Immature. I just … still think of you as Mom’s.’\u003c/p\u003e\n\u003cp\u003eDad’s fork clattered against the plate and his huge hand covered mine, drawing my gaze back to him. His eyes were bright with emotion as he told me in a low, thick voice, ‘A huge part of me will always be your mother’s. I was from the moment I met her. What I have with Dee won’t ever change that.’\u003c/p\u003e\n\u003cp\u003e‘Is that fair to Dee?’ I asked, trying desperately not to cry.\u003c/p\u003e\n\u003cp\u003eHe squeezed my hand. ‘I’m a different man now, Olivia. Life changes us, second by second. Who I was before Yvonne passed was a man who was right for her. Who I am now is someone I hope is right for Dee. But the most important person in my life is, and always will be, you. I need to know that you’re okay with me moving on with Dee. And I’d especially like it if you got to know her better.’\u003c/p\u003e\n\u003cp\u003eI smiled teasingly through the shimmer of tears in my eyes. ‘Dad, I’m a grown woman. You don’t need to be worrying about what I think.’\u003c/p\u003e\n\u003cp\u003e‘See’ – he shook his head with a grin – ‘to the world you’re a grown woman, but to me you’re still my kid. You’ll understand that when you’ve got your own.’\u003c/p\u003e\n\u003cp\u003e‘Then if it makes you feel better, I want you to know that I’m glad for you. Dee makes you laugh. She makes you happy. That’s all I care about.’\u003c/p\u003e\n\u003cp\u003e‘Will you meet with her? Spend some time just you two? I know she’d like that.’\u003c/p\u003e\n\u003cp\u003eHonestly, it’s something I should have thought of doing without having to be asked, and I realized that I really had been locked up in my own insecurities and problems for so long now that I hadn’t been a very good daughter lately. ‘Of course, Dad.’\u003c/p\u003e\n\u003cp\u003eSatisfied, Dad changed the subject again, talking about Cole and how Dad and Jo were thinking of getting him a dog if he passed his exams at the end of the school year. Cole had made a comment about how he’d always wanted a puppy and Jo had felt bad that she hadn’t known that, and now she and Cam were discussing it with the landlord.\u003c/p\u003e\n\u003cp\u003eIt was funny, but Jo’s behavior with Cole reminded me of how Dad was with me. Smiling lovingly at my father, I was feeling all mushy and happy for Cole that he’d been blessed to have Johanna Walker as a makeshift mom.\u003c/p\u003e\n\u003cp\u003eAnd it was in that moment of perfect contentment that Nate used his key and walked into my apartment.\u003c/p\u003e\n\u003cp\u003eThe sexy grin on his face froze when my dad slowly turned his head and raised an unimpressed eyebrow at Nate’s appearance. They stared at each other for a moment, and then my dad slowly turned his head back to me. He was not happy. ‘He has a key?’\u003c/p\u003e\n\u003cp\u003eWhen I closed the door behind my dad I finally let go of all the oxygen I’d been holding inside me and turned to Nate, my eyes bugging out half in horror, half in amusement. He was sitting on my couch, drinking a cold beer and laughing.\u003c/p\u003e\n\u003cp\u003e‘That wasn’t funny.’\u003c/p\u003e\n\u003cp\u003eOkay, so maybe it kind of was. But it also kind of wasn’t. We’d just spent the most uncomfortable half hour with my dad as he not very subtly cross-examined us about our friendship. The funny part was watching him try to make Nate squirm. The not-so-funny part was the part where I lied my ass off to my dad about the nature of my relationship with Nate.\u003c/p\u003e\n\u003cp\u003eNate put his beer down on the table and stood up, kicking off his shoes. ‘Your dad is bloody scary,’ he commented, still amused. I watched, questioning him with my eyes as he began to undress. ‘Are you sure he’s not the reason you haven’t had a man in seven years?’\u003c/p\u003e\n\u003cp\u003eI laughed, my eyebrows rising as he stood before me in nothing but his boxer briefs and a raging erection. ‘Why? You’re clearly not scared of him.’\u003c/p\u003e\n\u003cp\u003e‘I’m made of sterner stuff than most men.’ He strode toward me and grabbed my hand, pulling me toward the bathroom.\u003c/p\u003e\n\u003cp\u003e‘Tonight’s lesson?’ I asked, since he’d just gone into it without so much as a word.\u003c/p\u003e\n\u003cp\u003eNate shut the bathroom door behind us and took the hem of my shirt in his hands to tug it up and off. ‘Spontaneity. Nothing hotter than a woman who wants to fuck you all the time, no matter where you are or what you’re doing.’\u003c/p\u003e\n\u003cp\u003eI unclipped my bra as Nate worked on my jeans. ‘I’m beginning to think these lessons are personalized lessons on how to please Nate Sawyer.’\u003c/p\u003e\n\u003cp\u003e‘You don’t realize that all men think that way?’ he teased, removing my jeans and panties.\u003c/p\u003e\n\u003cp\u003e‘I don’t know.’ My heart was racing now as he reached into my shower and switched it on.\u003c/p\u003e\n\u003cp\u003e‘Well, most men I know think that way. So … tonight? Shower sex. I didn’t manage to have one after my class, so I thought we’d share one together.’ He grinned and dropped his boxers.\u003c/p\u003e\n\u003cp\u003eI licked my lips and eagerly followed him into the shower. ‘You know I have a feeling that women like men who want to have sex with them all the time no matter where, too.’\u003c/p\u003e\n\u003cp\u003eNate’s smile was heated as he pushed me under the spray of water and up against the tiles. ‘It’s good to know the shower does so much for you, babe. In the grand scheme of things, shower sex is pretty vanilla. I can’t wait to see how you react to me fucking you in the university library.’\u003c/p\u003e\n\u003cp\u003eMy eyes widened. ‘You can’t do that,’ I breathed, growing hot and wet just at the thought of it. ‘I throw kids out for that.’\u003c/p\u003e\n\u003cp\u003e‘But you like the idea …’ He grazed his lips over mine and lifted my leg. ‘Admit it.’\u003c/p\u003e\n\u003cp\u003eBefore I could answer he thrust into me hard and I would have smacked my head against the wall if he hadn’t curled his hand around it to cushion it in expectation of me arching back in pleasure.\u003c/p\u003e\n\u003cp\u003e‘Never mind,’ he purred in my ear. ‘I’ll take how wet you are as admission.’\u003c/p\u003e\n\u003cp\u003e‘Are you sure you don’t mind me crashing here?’ Nate asked, skimming a finger down my naked spine as I lay on my stomach beside him on the bed.\u003c/p\u003e\n\u003cp\u003eAfter the delicious shower sex I’d dried my hair while Nate reheated some of the pasta for himself. By the time I wandered out of the bedroom, he had finished eating and was ready for our lessons to continue. I knew this because I walked out of the bedroom only to have him maneuver me back inside immediately. Three orgasms later, I was thoroughly sated, it was late, and there was really no point in Nate heading home when I had a comfy bed big enough for the both of us.\u003c/p\u003e\n\u003cp\u003eWith my head resting on my arms, I’d been staring at my headboard, my body so relaxed that I was almost purring like a kitten. I turned my head to answer him, my hair rustling across the pillow. ‘At this point you can have anything you want.’\u003c/p\u003e\n\u003cp\u003eI watched his dimples appear and decided that one day I was really going to have to kiss those sexy little indentations. ‘Do you really want to make my ego bigger than it already is?’\u003c/p\u003e\n\u003cp\u003e‘Hmm, good point.’\u003c/p\u003e\n\u003cp\u003eWe smiled at each other before my eyes drifted closed.\u003c/p\u003e\n\u003cp\u003eI was dozing when I felt the touch of his lips against my bare shoulder. ‘Liv?’\u003c/p\u003e\n\u003cp\u003eThere was something in his tone, something solemn that made me instantly alert. Opening my eyes, I searched his face and found his expression equally grave. My stomach flipped with uncertainty as the blood rushed in my ears with the sudden pounding of my heart. ‘Yeah?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/before-jamaica-lane-on-dublin-street-3/page-25.html","bookId":1895,"creation":"Oct 5, 2019 5:08:56 PM","modification":"Oct 5, 2019 5:08:56 PM"}
