{"id":85730,"no":28,"title":"Page 28","content":"\u003cp\u003e‘You’re right, you’re right, I know you’re right,’ Ellie grumbled, and pouted at me as Joss let us in at her flat.\u003c/p\u003e\n\u003cp\u003eI rubbed Ellie’s arm in reassurance. ‘You’ll find a place.’\u003c/p\u003e\n\u003cp\u003eBraden was working at his nightclub, Fire, so we had the flat to ourselves. In preparation for us coming, Joss had already made up little snacks and bought a cocktail mix. We laughed and joked in the kitchen as we sipped mojitos and ate tiny sandwiches.\u003c/p\u003e\n\u003cp\u003e‘So will you treat us to details about the honeymoon?’ I asked, grinning cheekily at Joss.\u003c/p\u003e\n\u003cp\u003eJoss smirked at me. ‘With Braden’s little sister in the room? No. All I will say is that a delicious time was had by all. And Braden only growled at one guy.’\u003c/p\u003e\n\u003cp\u003eI laughed. ‘Growled?’\u003c/p\u003e\n\u003cp\u003e‘He was staring at my boobs, and I mean staring, while Braden was right there.’ She wrinkled her nose and shook her head. ‘I thought Braden was going to pop a vein.’\u003c/p\u003e\n\u003cp\u003eWe laughed, but my amusement froze up under anxiety when Joss suddenly threw me a mischievous grin. ‘So, Ellie said you went all Lady Sass at Club 39 while I was gone. Got some guy’s number?’\u003c/p\u003e\n\u003cp\u003eI snorted, trying to cover up the fact that my heart was pounding hard and I was starting to sweat. Lying was horrible, shitty, and excusing it by telling myself that I wasn’t lying, I was merely withholding, was just a crock of crap. I was lying to my friends and I didn’t like it. ‘Lady Sass? It was just a number.’\u003c/p\u003e\n\u003cp\u003e‘I’ve never seen you so interested before.’ Ellie turned her wide eyes on Joss. ‘You should have seen her flirting her arse off. Speaking of’ – she looked back at me questioningly – ‘how would you feel about going on a date with a guy Adam knows?’\u003c/p\u003e\n\u003cp\u003eThe heart pounding became more of a sickly fluttering. ‘You’ve been talking about me?’\u003c/p\u003e\n\u003cp\u003e‘Only since that night at the bar. We thought maybe you were taking time to get settled before you started dating, so we never said anything before. But then on Saturday you seemed to show interest. And Dougie is lovely.’\u003c/p\u003e\n\u003cp\u003e‘Doogie?’\u003c/p\u003e\n\u003cp\u003e‘Douglas. Dougie.’\u003c/p\u003e\n\u003cp\u003eI snorted. ‘He sounds charming.’\u003c/p\u003e\n\u003cp\u003eJoss laughed. ‘I’m picturing Doogie Howser.’\u003c/p\u003e\n\u003cp\u003e‘Right.’ I giggled immaturely.\u003c/p\u003e\n\u003cp\u003eEllie frowned at us both. ‘Um. Who?’\u003c/p\u003e\n\u003cp\u003e‘It was an American TV show.’\u003c/p\u003e\n\u003cp\u003e‘About what?’\u003c/p\u003e\n\u003cp\u003e‘A kid genius doctor.’\u003c/p\u003e\n\u003cp\u003eEllie gave us a long-suffering look. ‘Dougie is not a kid. He’s a very nice and very good-looking architect.’\u003c/p\u003e\n\u003cp\u003e‘Don’t let Adam hear you say that.’\u003c/p\u003e\n\u003cp\u003e‘Liv, I’m serious. Please consider going out with him.’\u003c/p\u003e\n\u003cp\u003e‘I don’t do blind dates.’\u003c/p\u003e\n\u003cp\u003eShe eyed me carefully. ‘Did you call the guy whose number you got?’\u003c/p\u003e\n\u003cp\u003eUh-oh. How did I tell her I didn’t want to date this Doogie guy because I was too busy screwing Nate? I racked my brain for an excuse that sounded plausible, becoming increasingly nervous as the silence stretched thin between us. My eyes sought Joss for help since she was the queen of not doing anything she didn’t want to do and not giving a rat’s ass if you didn’t like her explanation. Instead of help, I watched as her face turned a sickly color.\u003c/p\u003e\n\u003cp\u003e‘Joss, are you okay?’ I leaned forward, touching her arm.\u003c/p\u003e\n\u003cp\u003eShe pressed her lips together and turned toward the sink. Ellie was watching her sister-in-law in concern.\u003c/p\u003e\n\u003cp\u003eAfter a moment Joss sucked in a breath. ‘Do these mojitos taste okay to you guys?’ she asked weakly.\u003c/p\u003e\n\u003cp\u003e‘Fine.’\u003c/p\u003e\n\u003cp\u003eJoss shuddered, taking another breath.\u003c/p\u003e\n\u003cp\u003e‘Uh –’ I backed off warily now. ‘Are you going to upchuck?’\u003c/p\u003e\n\u003cp\u003eShe grimaced at me. ‘No, I’m not going to upchuck.’\u003c/p\u003e\n\u003cp\u003e‘Here.’ Ellie shoved a plate of sandwiches toward her. ‘You’ve barely eaten anything this morning.’\u003c/p\u003e\n\u003cp\u003e‘Ellie, if you don’t get that plate out of my face I will eat you.’\u003c/p\u003e\n\u003cp\u003e‘I think she’s going to upchuck,’ I murmured, pulling Ellie back.\u003c/p\u003e\n\u003cp\u003e‘Stop saying “upchuck,” ’ Joss snapped.\u003c/p\u003e\n\u003cp\u003eI raised my eyebrow at Ellie. ‘Someone’s crabby when she’s sick.’\u003c/p\u003e\n\u003cp\u003e‘Yup,’ Els agreed. ‘She got the stomach flu last year and hissed at anyone that came near her.’\u003c/p\u003e\n\u003cp\u003e‘I’m standing right here,’ Joss huffed, slanting a dangerous look our way. With her tip-tilted gray eyes she really knew how to give good glare.\u003c/p\u003e\n\u003cp\u003e‘And we’d like you to remain there if you’re going to be sick.’\u003c/p\u003e\n\u003cp\u003eEllie giggled at me. Joss did not.\u003c/p\u003e\n\u003cp\u003e‘You’re lucky I like you, Olivia Holloway.’\u003c/p\u003e\n\u003cp\u003eI grinned at her and replied meaningfully, ‘Don’t I know it.’\u003c/p\u003e\n\u003cp\u003eShe flicked her gaze up at me. ‘I can’t be crabby when you’re being cute.’\u003c/p\u003e\n\u003cp\u003e‘And my genius plan works.’\u003c/p\u003e\n\u003cp\u003eJoss snorted and then immediately clamped a hand over her mouth.\u003c/p\u003e\n\u003cp\u003eWe waited as she took deep breaths until finally she turned to us. ‘I’m fine.’ She moved over to the table in the corner and settled into a chair. ‘Those mojitos are definitely not working for me.’\u003c/p\u003e\n\u003cp\u003eWithout having to be asked, Ellie poured Joss a glass of water and we joined her at the table. To my chagrin, the first thing Ellie said was, ‘So? Dougie. Yes?’\u003c/p\u003e\n\u003cp\u003e‘No. I’m …’ I shrugged, deciding to give them a little of the truth. ‘There’s a guy at the library. I like him.’\u003c/p\u003e\n\u003cp\u003eEllie grinned, curiosity sparking bright in her pale eyes. ‘Fair enough. Do you work with him?’\u003c/p\u003e\n\u003cp\u003e‘He’s a student. Postgrad.’ My tone said, ‘I don’t want to talk about it’ and, surprisingly, Ellie let it go.\u003c/p\u003e\n\u003cp\u003eInstead of giving me the Spanish inquisition on him, she asked, ‘How is work?’\u003c/p\u003e\n\u003cp\u003e‘Good. It’ll be hard to get promoted but, you know, it’s a good atmosphere and I like my colleagues. I don’t think I’ll be leaving anytime soon. What about you?’\u003c/p\u003e\n\u003cp\u003e‘I’ve almost finished my PhD and the university is discussing giving me a year contract with them as a course lecturer. They’re impressed with me and my thesis, so they pulled me aside yesterday to let me know that they’re considering me.’\u003c/p\u003e\n\u003cp\u003eEllie was a scholar in art history. I didn’t know much about it, but I did know that she’d dreamed of a career in academia just like her stepdad, Clark, so this was huge news.\u003c/p\u003e\n\u003cp\u003e‘You didn’t tell me that,’ Joss said softly, delicately picking at a sandwich.\u003c/p\u003e\n\u003cp\u003eEllie shrugged modestly. ‘I wasn’t sure whether to mention it or not in case it falls through.’\u003c/p\u003e\n\u003cp\u003e‘It won’t, Els,’ Joss replied firmly. ‘I’m proud of you.’\u003c/p\u003e\n\u003cp\u003e‘Me too.’\u003c/p\u003e\n\u003cp\u003eShe smiled gratefully at us. ‘Thanks.’\u003c/p\u003e\n\u003cp\u003e‘It means I’ll probably be consulting with you on research materials for the library.’\u003c/p\u003e\n\u003cp\u003e‘Yup. Maybe you can point out Library Guy while I’m there.’\u003c/p\u003e\n\u003cp\u003eI nodded, then took a large gulp of my mojito. Why, when I thought of Benjamin, did I no longer feel butterflies and a rush of possibility?\u003c/p\u003e\n\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eI was happy.\u003c/p\u003e\n\u003cp\u003eTruly, peacefully, happy.\u003c/p\u003e\n\u003cp\u003eAnd I had no intention of analyzing it.\u003c/p\u003e\n\u003cp\u003eAnalyzing it was sure to kill all the happy.\u003c/p\u003e\n\u003cp\u003eLying with my head on a cushion, my legs stretched out across Nate’s lap, I looked at him out of the corner of my eye as he watched the movie and absentmindedly stroked my ankle.\u003c/p\u003e\n\u003cp\u003eOur sexual relationship had only escalated over the last two weeks, until nearly all of my inhibitions were gone. Sex with Nate was easy. I didn’t feel self-conscious. I wasn’t constantly worrying if I was doing it wrong.\u003c/p\u003e\n\u003cp\u003eMy confidence had grown, yet still I was avoiding Benjamin. Instead I was lost in this world of sex and laughter and fun with Nate. We still hung out, but now it was intermingled with sexy time.\u003c/p\u003e\n\u003cp\u003eFreakin’ awesome sexy time.\u003c/p\u003e\n\u003cp\u003eWe never hung out at Nate’s – I’d never even seen his place – because he said he preferred my apartment, so he often used the key I had given him. Today I was especially pleased to come home and find him on my couch, eating my potato chips and watching TV. I’d just had ‘the dinner’ with Dee that Dad had suggested a few weeks ago, and up until I saw Nate in my space I’d been feeling a little raw.\u003c/p\u003e\n\u003cp\u003eI bent to kiss his temple to let him know I was happy to see him and then I got changed into a silky nightdress Nate had bought me. When I came back into the room he took one look at my face and patted the couch beside him. I sat down and let him enfold me in a hug.\u003c/p\u003e\n\u003cp\u003e‘You okay?’ he asked, pressing a kiss to my hair.\u003c/p\u003e\n\u003cp\u003e‘It was just … It’s fine. We just talked about Mom. It always takes it out of me.’\u003c/p\u003e\n\u003cp\u003eIn response he cuddled me for a while. It felt wonderful.\u003c/p\u003e\n\u003cp\u003eNate’s phone buzzed on the table and I pulled my legs off his lap so he could reach it. He flicked the screen, his eyebrows drawing together as he read the text message he’d just received.\u003c/p\u003e\n\u003cp\u003e‘Everything okay?’\u003c/p\u003e\n\u003cp\u003e‘It’s Cam,’ he murmured. ‘I think he’s getting suspicious. Wondering why I’m busy all the time.’\u003c/p\u003e\n\u003cp\u003e‘Just tell him you’re busy getting busy. He doesn’t need to know who with.’\u003c/p\u003e\n\u003cp\u003e‘I’ve been getting busy so much lately, he’s bound to know it must be with just one woman and he’ll want to know who. Even I can’t find a new sexual partner every day.’\u003c/p\u003e\n\u003cp\u003e‘We’re not having sex every day.’\u003c/p\u003e\n\u003cp\u003e‘Almost.’\u003c/p\u003e\n\u003cp\u003eI shrugged, acquiescing to the truth. ‘Fine. But we’re trying to cram years of experience into a few weeks here.’\u003c/p\u003e\n\u003cp\u003eNate grinned and suddenly grabbed my ankles, pulling me down the couch before crawling over me. ‘I know, it’s so exhausting,’ he teased. ‘I’m utterly sick of it.’\u003c/p\u003e\n\u003cp\u003eHe was so sick of it he yanked my nightie off and sat back to pull his shirt off and unbuckle his jeans. My thighs were already quivering with excitement as he pulled my panties off and threw them over his shoulder.\u003c/p\u003e\n\u003cp\u003eThe apartment was soon filled with my pleading whimpers as he buried his head between my legs and brought me to climax with his tongue. I was barely coherent when he suddenly gripped the backs of my calves to lift my legs over his shoulders.\u003c/p\u003e\n\u003cp\u003eThis was new.\u003c/p\u003e\n\u003cp\u003eHis lips grazed mine. ‘You’ll feel me so deep this way, baby. Hold on.’\u003c/p\u003e\n\u003cp\u003e‘Nate!’ I cried out, feeling every inch of him as he pumped in and out of me.\u003c/p\u003e\n\u003cp\u003eHe was right. His cock thrust in at the most beautiful angle and the pressure inside me was building, building, building –\u003c/p\u003e\n\u003cp\u003e‘Ahh!’ I yelled, clamping a hand around my thigh and gritting my teeth in pain.\u003c/p\u003e\n\u003cp\u003e‘What? What?!’ Nate stopped, panic in his voice. ‘Liv?’\u003c/p\u003e\n\u003cp\u003e‘I’ve got a leg cramp,’ I whimpered.\u003c/p\u003e\n\u003cp\u003eNate immediately pulled out of me, his panting sounding really loud in the small room. ‘Which one?’\u003c/p\u003e\n\u003cp\u003e‘My left,’ I managed to answer through the ugly discomfort.\u003c/p\u003e\n\u003cp\u003eNate coasted his hand up my leg and found the cramping muscle in the back of my thigh. My fingers bit into the couch as he began to massage it for me.\u003c/p\u003e\n\u003cp\u003eAfter a while the cramp began to ease, and as Nate felt the tension start to drain out of me the couch started to shake a little with his laughter.\u003c/p\u003e\n\u003cp\u003eMortification instantly hit me.\u003c/p\u003e\n\u003cp\u003eI got a leg cramp during hot sex.\u003c/p\u003e\n\u003cp\u003eThat was not cool. That was not sexy.\u003c/p\u003e\n\u003cp\u003eBlushing furiously, I slapped my hands over my face. ‘Oh, God.’\u003c/p\u003e\n\u003cp\u003eNate laughed harder.\u003c/p\u003e\n\u003cp\u003eI was so embarrassed that I was on the verge of tears. I sat up, ducked my head, and pushed him off me.\u003c/p\u003e\n\u003cp\u003e‘Liv.’ No longer laughing, Nate grabbed for me, but I pushed harder, trying to crawl past him. ‘Olivia.’\u003c/p\u003e\n\u003cp\u003e‘Get. Off.’ I shoved an elbow in his stomach, but that just made him fight harder. And he was stronger than me. In a tangle of shoving limbs I ended up flat on my stomach, the left side of my face pressed into the couch and my hands held captive above my head. \u003c/p\u003e","sourceLink":"https://allnovel.net/before-jamaica-lane-on-dublin-street-3/page-28.html","bookId":1895,"creation":"Oct 5, 2019 5:08:56 PM","modification":"Oct 5, 2019 5:08:56 PM"}
