{"id":85735,"no":33,"title":"Page 33","content":"\u003cp\u003eNot liking this side of him one bit, I glared at him, crossing my arms over my chest as I leaned back on the hood of the car. ‘I’d say I’m ready. You’ve got me all trained up. Lessons learned. I’m pretty fuckable now, right? I think he’ll enjoy it.’\u003c/p\u003e\n\u003cp\u003eI only had a moment to see the anger flare in his eyes before he rushed me. I found myself gripped by the nape of the neck as he hauled me up against him and started kissing me. It was rough, bruising, nipping, biting, and I gave as good as I got.\u003c/p\u003e\n\u003cp\u003eBreathing harshly, Nate pushed me back on the hood, insinuating himself between my legs. Shoving my dress up, he leaned over me, eyes black as the night around us, and I arched into his mouth as he pulled the straps of my dress, and the bra underneath, down to allow his lips access to my naked breasts. His hand slid along my inner thigh, his fingers dipping under my panties and pushing inside me.\u003c/p\u003e\n\u003cp\u003eI cried out as he cursed hoarsely at finding me wet and ready.\u003c/p\u003e\n\u003cp\u003eAnd then it was all about desperation.\u003c/p\u003e\n\u003cp\u003eMy panties were gone. His zip yanked down. My hips in his hard grasp as he pulled me down the hood of the car to meet his cock. He pumped into me, feeding my frenzy, and our surroundings no longer mattered. I didn’t care that we were outside. I didn’t care that I was on the hood of a car. All I cared about was that he wanted me. I took that, my inner muscles squeezing around his hard thrusts, extorting his release from him.\u003c/p\u003e\n\u003cp\u003eHe relaxed against me, both of us lying across the hood, his warm breath on my neck, my legs wrapped around his waist. I could feel his heart thudding against mine. The skin of his back clammy and warm beneath my hands. I took it all.\u003c/p\u003e\n\u003cp\u003eI took it all and held on to it for a while.\u003c/p\u003e\n\u003cp\u003eAnd he let me.\u003c/p\u003e\n\u003cp\u003eBecause I think he knew that it wouldn’t be long before he yanked it all away from me.\u003c/p\u003e\n\u003cp\u003e20\u003c/p\u003e\n\u003cp\u003eNate was tender, almost apologetic after the wild sex on the rental car. It was only later that I realized he hadn’t said a word during the sex. It wasn’t like him. He usually said something hot, dirty, to spur us on. That he hadn’t made me feel like he was as angry and as confused as I was. Too caught up in pushing that confusion away – just needing to connect, not to think, let alone speak. At least that’s what I let myself believe.\u003c/p\u003e\n\u003cp\u003eWe drove in silence back to the rental house, but I could feel his gaze on me every now and then. Searching. As soon as we arrived at the house, I left him to mingle with our friends while I headed for bed. Jo followed me upstairs. Concerned. I convinced her I was okay. Not so much my pillow. I think it was the tears that soaked it through the night that gave me away.\u003c/p\u003e\n\u003cp\u003eThe next morning I almost gave up my spot in the front passenger seat on the ride home, but I knew that would raise suspicion since I’d been loud about getting it in the first place. However, I was quiet and Jo noticed. She sent me a text from the back of the car telling me she was worried about me.\u003c/p\u003e\n\u003cp\u003eI was breaking.\u003c/p\u003e\n\u003cp\u003eI so wanted to tell her everything.\u003c/p\u003e\n\u003cp\u003eBut I held my silence and was grateful when Nate dropped me at my door so I could hurry inside away from all of their questioning looks.\u003c/p\u003e\n\u003cp\u003eThere was no word from Nate for the rest of the day, and no word all day Monday. I left work, going over everything in my mind, trying to make sense of it all. To understand how I could have let myself fall.\u003c/p\u003e\n\u003cp\u003eWhen I couldn’t do that, I sought distraction …\u003c/p\u003e\n\u003cp\u003e‘Liv?’ Joss stood in her doorway, surprise slackening her features.\u003c/p\u003e\n\u003cp\u003eMy brow furrowed at her appearance. She had dark circles under her eyes, her olive skin had a sickly pallor to it, and altogether she did not look like a healthy pregnant woman.\u003c/p\u003e\n\u003cp\u003eBefore she could come up with an excuse to keep me out, I barged into her flat. ‘Is Braden here?’ I threw over my shoulder as I marched toward the kitchen.\u003c/p\u003e\n\u003cp\u003e‘No, he’s at work.’\u003c/p\u003e\n\u003cp\u003eShe appeared in the doorway as I set about making coffee. My eyes washed over her. ‘You need to take better care of yourself.’\u003c/p\u003e\n\u003cp\u003eJoss smoothed a strand of hair back into her ponytail. ‘I’ve been busy. A literary agent in New York now represents me.’\u003c/p\u003e\n\u003cp\u003eA teaspoon of sugar froze over my mug. ‘She loved your book?’\u003c/p\u003e\n\u003cp\u003e‘She loved my book.’\u003c/p\u003e\n\u003cp\u003eI grinned excitedly. ‘Joss, that’s amazing.’\u003c/p\u003e\n\u003cp\u003eHer smile was bright, but it didn’t quite reach her eyes. ‘Yeah.’\u003c/p\u003e\n\u003cp\u003eMy gaze dropped to her stomach. ‘So what’s –’\u003c/p\u003e\n\u003cp\u003e‘She thinks I should start working on another.’ She interrupted me, almost frantically.\u003c/p\u003e\n\u003cp\u003eI knew deflection when I saw it. I let her get away with it. Just for a little while. Coffee made, biscuits on a plate, I carried them into the sitting room for us and settled back on her couch while she curled up in an armchair. Her words were hurried, breathless, so lacking in her usual composure that I could feel the unease growing in my gut. It was clear she was willing to talk to me about her books until she was blue in the face if it meant I wouldn’t ask about the pregnancy.\u003c/p\u003e\n\u003cp\u003eFinally, just when I was about to stop her and cut to the chase, we heard the sound of the front door opening. I watched Joss tense, as if she was a fragile pane of unsupported glass, bracing against a harsh wind.\u003c/p\u003e\n\u003cp\u003eMy heart pitter-pattered on her behalf as she chewed on her lower lip, her eyes on the sitting room door as heavy footsteps made their way toward it. Braden’s large frame filled the doorway. His eyes were tired and the corners of his mouth were turned down. ‘Liv.’ He gave me a chin lift in greeting before his gaze moved to Joss. They narrowed at the sight of her. ‘Did you sleep today?’\u003c/p\u003e\n\u003cp\u003eJoss shook her head. ‘I couldn’t.’\u003c/p\u003e\n\u003cp\u003eAnnoyed, he said, ‘You need to get some sleep.’ Without another word he turned on his heel, tugging at his tie as he wandered out of sight.\u003c/p\u003e\n\u003cp\u003eThe tension between them was obvious. The apartment was thick with it. ‘Joss,’ I whispered. ‘Girl, what are you doing?’\u003c/p\u003e\n\u003cp\u003e‘Don’t.’\u003c/p\u003e\n\u003cp\u003eSo I shut up, not sure what to say, or how to help. A few minutes later Braden walked past the door, calling out, ‘I’ve got a late meeting with Adam.’ The front door shut behind him.\u003c/p\u003e\n\u003cp\u003eJoss flinched and I saw her throat working as she tried not to cry.\u003c/p\u003e\n\u003cp\u003e‘Oh, honey.’ I moved to get up to hug her, but she held up a hand, warding me off.\u003c/p\u003e\n\u003cp\u003eTears glimmered in her eyes. ‘You hug me and I won’t stop crying. And I need to not cry.’\u003c/p\u003e\n\u003cp\u003eI stayed where I was.\u003c/p\u003e\n\u003cp\u003e‘It’s not me,’ she promised. ‘I haven’t shut him out. I’m just having a really hard time right now and I ruined it. I ruined this for him.’\u003c/p\u003e\n\u003cp\u003e‘He’s the one not talking to you?’\u003c/p\u003e\n\u003cp\u003e‘He talks,’ she answered dryly. ‘But it’s … it’s like he can barely stand to be in the same room as me. He hasn’t asked me how I feel about it now that the shock has worn off. He doesn’t want to know. He doesn’t want me to touch him …’\u003c/p\u003e\n\u003cp\u003e‘I’m sorry, Joss.’\u003c/p\u003e\n\u003cp\u003e‘He’s never been like that. I think I’ve fucked up.’ She laughed hysterically and immediately burst into hard, shaking sobs.\u003c/p\u003e\n\u003cp\u003eThere was no way I wasn’t hugging her.\u003c/p\u003e\n\u003cp\u003eCradling her against me, I held her until she cried herself out.\u003c/p\u003e\n\u003cp\u003eWhen her body stopped shuddering, I heard the soft whimper of her breathing and realized that she’d fallen asleep on me. I couldn’t move. I daren’t.\u003c/p\u003e\n\u003cp\u003eFifteen minutes later, the front door opened and Braden came striding back into the sitting room, looking like a man who meant business. Clearly, he’d decided not to meet Adam. I don’t know what his purpose was in coming back – whether it was to shout at Joss or try to bridge the distance between them – but I instantly glared him into silence.\u003c/p\u003e\n\u003cp\u003e‘She cried herself to sleep,’ I whispered.\u003c/p\u003e\n\u003cp\u003eThe muscle in his jaw ticked as he looked down at her. ‘She doesn’t cry a lot,’ he answered me quietly.\u003c/p\u003e\n\u003cp\u003eFor some reason that made me want to cry. The pain my friend was feeling seemed to seep from her into me. ‘You have to forgive her.’\u003c/p\u003e\n\u003cp\u003e‘It’s not about that,’ he replied hoarsely, his eyes trained on her sleeping face. ‘I’m not angry. I’m just disappointed.’\u003c/p\u003e\n\u003cp\u003e‘That’s worse.’\u003c/p\u003e\n\u003cp\u003eHe ran a hand through his hair. ‘This is our kid, Liv. Problems with us I can handle. But this is our kid. She should be happy.’\u003c/p\u003e\n\u003cp\u003e‘You know it’s not that easy. You also don’t know what’s going on in her head, because you won’t give her the time of day,’ I hissed, knowing I shouldn’t get angry at him but still shaken from Joss’s meltdown.\u003c/p\u003e\n\u003cp\u003eBraden gave me a look that would have cowed a lesser woman. Okay, who was I kidding? I was cowed. ‘Are you done?’\u003c/p\u003e\n\u003cp\u003eI didn’t answer, thinking a smart-ass comment wouldn’t go over so well right now.\u003c/p\u003e\n\u003cp\u003eWithout another word, Braden approached me and I tensed, wondering what he was going to do. Carefully he leaned down and scooped Joss up into his arms as if she weighed nothing. Joss roused long enough to wrap her arms around his neck and snuggle into his chest.\u003c/p\u003e\n\u003cp\u003eMy throat closed as I looked up at them. They had to work this out. They were that couple. If they couldn’t work out their problems, what chance did the rest of us have?\u003c/p\u003e\n\u003cp\u003eI got up quickly, giving Braden’s arm a squeeze of affection before I left. I hoped to God when Joss woke up the two of them would start communicating.\u003c/p\u003e\n\u003cp\u003eBeing around them had done nothing to lessen my own heartache, and so, not wanting to be alone, I went to my dad’s. Like old times, he cooked me dinner and we hung out, watching TV, just keeping each other company. He knew something was wrong, but for once he didn’t ask questions. He was just there for me, like always.\u003c/p\u003e\n\u003cp\u003eI didn’t go home. If Nate used my key I wouldn’t know about it.\u003c/p\u003e\n\u003cp\u003eAvoiding Benjamin had become a challenge these last few weeks. I locked myself in the staff toilets the first time, I hid behind book stacks – moving from one to the other as Benjamin moved around them – the second time, and I’d even hidden in a coat stand. There was a coat stand behind the help desk and it was the first hiding place I seized upon when Benjamin came through the front entrance of the library.\u003c/p\u003e\n\u003cp\u003ePraying that the coast was clear, I’d stepped out of the coats to four curious gazes.\u003c/p\u003e\n\u003cp\u003e‘What the hell was that?’ Angus had asked.\u003c/p\u003e\n\u003cp\u003eI’d blinked, not sure there was any explanation on earth that would work. ‘Bee?’\u003c/p\u003e\n\u003cp\u003eHe had stared at me for a moment and then abruptly strode off into the back office without another word.\u003c/p\u003e\n\u003cp\u003eThe day after my visit to Joss and Braden’s, my pattern of avoiding Benjamin changed. Whether it changed out of circumstance or because of the weirdness between me and Nate, I wasn’t sure.\u003c/p\u003e\n\u003cp\u003eI was standing at the help desk, flicking through a book in between assisting customers, when a shadow fell over me. I looked up to find Ellie smiling at me.\u003c/p\u003e\n\u003cp\u003e‘Did you have a nice weekend away?’ she asked brightly.\u003c/p\u003e\n\u003cp\u003e‘Hey.’ I grinned and then turned to Jill. ‘Can I take five?’\u003c/p\u003e\n\u003cp\u003e‘Sure.’ She smiled at me and then at Ellie. ‘Hey, Miss Carmichael. I heard it’ll be Dr Carmichael soon.’\u003c/p\u003e\n\u003cp\u003eEllie flushed as I walked around the counter toward her. ‘Soon, yes. It’ll be strange, though.’\u003c/p\u003e\n\u003cp\u003e‘It’s awesome.’ I pulled her into a hug before leading her toward an empty couch near the main staircase. ‘What are you doing here?’\u003c/p\u003e\n\u003cp\u003e‘I came to thank you.’ She turned to me, her eyes bright. ‘I heard you popped around Joss and Braden’s last night.’\u003c/p\u003e\n\u003cp\u003e‘Yeah?’\u003c/p\u003e\n\u003cp\u003eEllie shook her head. ‘The last few days have been awful. I couldn’t bear to be in the same room with them and I didn’t know which one of them to be angry at, so I just decided to be sad for the both of them, which was really no help.’ She smiled sheepishly. ‘I’ll stop babbling and get to the point. I don’t know what you did or what you said, but it helped. Adam just called me to tell me Braden is in a much better mood. I called Joss and she sounds good too. I’m heading to see her next.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/before-jamaica-lane-on-dublin-street-3/page-33.html","bookId":1895,"creation":"Oct 5, 2019 5:08:56 PM","modification":"Oct 5, 2019 5:08:56 PM"}
