{"id":85739,"no":37,"title":"Page 37","content":"\u003cp\u003eBen was wearing a purple shirt and dress pants and he looked very handsome. It occurred to me that I’d never seen him wear black – and that only occurred to me because it was Nate’s favorite color. Black or dark red. Nate had looked good in both.\u003c/p\u003e\n\u003cp\u003e‘I have to admit,’ Ben said as the waiter walked away, ‘I’ve wanted to ask you out for months.’\u003c/p\u003e\n\u003cp\u003e‘Really?’ I asked incredulously, and then immediately scolded myself as I heard Nate’s voice tutting at me for my lack of confidence. ‘I mean … really?’ I asked again, going for nonchalant this time.\u003c/p\u003e\n\u003cp\u003eIt made Ben smile. ‘Really. But … you didn’t seem that interested before …’\u003c/p\u003e\n\u003cp\u003e‘I’m very focused at work,’ I lied. ‘Sometimes I don’t even realize someone is flirting with me because my head is somewhere else.’\u003c/p\u003e\n\u003cp\u003eHe nodded as if that made sense. ‘True. You were different when we met here.’\u003c/p\u003e\n\u003cp\u003eI smiled in answer, my eyes dropping to my plate because I couldn’t think of anything to say to that.\u003c/p\u003e\n\u003cp\u003e‘You seem distracted.’\u003c/p\u003e\n\u003cp\u003e‘I’m not,’ I lied again.\u003c/p\u003e\n\u003cp\u003e‘I thought maybe the other reason you were resistant was because there was someone else?’\u003c/p\u003e\n\u003cp\u003eTensing, I lifted my eyes to meet his. ‘There was.’\u003c/p\u003e\n\u003cp\u003e‘How recently?’\u003c/p\u003e\n\u003cp\u003eI gave him a wry, unhappy smile. ‘This is not how I wanted to start this date, but you’re right … I’m distracted. I just got out of something. Something really serious, and I don’t know if I’m ready to … I mean I know I should be. And you should know that I like you, I do, I just –’\u003c/p\u003e\n\u003cp\u003e‘Olivia.’ He leaned across the table and took my trembling hand into his, his beautiful green eyes sincere. ‘I get it. I’ve been there.’ He sat back, his smile patient. ‘Let’s just enjoy our meal together. Forget about this being a date. This is just two people enjoying a good meal and conversation.’\u003c/p\u003e\n\u003cp\u003eAnd so that’s what we did, and afterward, once we’d split the bill (I insisted, since it wasn’t a date), Ben walked me around the corner to my apartment. On the sidewalk he pressed a kiss to my cheek and said, ‘I like you, Olivia. So when you’re ready … give me a call.’\u003c/p\u003e\n\u003cp\u003e23\u003c/p\u003e\n\u003cp\u003eStaring at the rolling credits, I sat in the now-lit-up movie theater as my fellow moviegoers got up and shuffled out of the screening.\u003c/p\u003e\n\u003cp\u003eI’d chosen a comedy because fake laughing at fake stuff helped a little.\u003c/p\u003e\n\u003cp\u003eIt had been three weeks since I’d last seen Nate, and I still hadn’t heard from him. He’d definitely taken it to heart when I told him to never come back. My friends, with the exception of Jo, did a good job of not mentioning him, although his absence when we went out for drinks was felt by all. It made me feel terrible. Nate was Cam, Adam, and Braden’s friend, and now whenever I was around they couldn’t hang out with him. Not that Nate was up to it apparently. According to Jo, anyway. She would casually let information slip into our conversations every now and then. Cam was worried about Nate. He hadn’t seen much of him lately with the exception of judo class. At their last session Nate had been so intense, bordering on outright aggressive, that their teacher had thrown him out of the class by suggesting he walk off whatever was bothering him.\u003c/p\u003e\n\u003cp\u003eI didn’t want to know this. It would be much easier for me to pretend that Nate had no feelings about the dissolution of our relationship. Jo wanted me to know, though. She thought it meant something. She thought there was still possibility.\u003c/p\u003e\n\u003cp\u003eShe just didn’t get it.\u003c/p\u003e\n\u003cp\u003e‘Oi, movie’s over,’ a belligerent voice said.\u003c/p\u003e\n\u003cp\u003eI glanced up at the young cinema worker. ‘Yeah, so?’\u003c/p\u003e\n\u003cp\u003e‘So … you have to leave now,’ he replied irritably.\u003c/p\u003e\n\u003cp\u003eSlowly I got up. ‘You just love your job, don’t you?’\u003c/p\u003e\n\u003cp\u003eHis look would have quelled Death. I grabbed my bag and got out of there.\u003c/p\u003e\n\u003cp\u003eI pushed my hair back off my face as I entered the lobby of the Cineworld. I’d come to the Omni Centre at the top of Leith Walk on a Friday night because sitting home, remembering how many Friday nights I spent watching movies with Nate, was not a good way to get over him.\u003c/p\u003e\n\u003cp\u003e‘Liv!’\u003c/p\u003e\n\u003cp\u003eI glanced back over my shoulder before I hit the stairs and saw Cole standing at the concession stand with a group of friends. Being so tall, he was easy to spot. He smiled at me, murmured something to a friend, and strolled over. I had to tilt my head back to look up into his face. ‘Hey.’ I smiled at him. ‘You okay?’\u003c/p\u003e\n\u003cp\u003eHe shrugged. ‘Just going to see a film with some friends.’ His eyes searched my face. ‘You okay?’\u003c/p\u003e\n\u003cp\u003e‘I’m fine. Just heading home.’\u003c/p\u003e\n\u003cp\u003e‘You were here alone?’\u003c/p\u003e\n\u003cp\u003e‘A person can go to the movies alone, you know.’\u003c/p\u003e\n\u003cp\u003eCole’s eyes narrowed. ‘Right.’ He glanced over his shoulder before returning his focus to me. ‘Let’s go back to the flat. Jo and Cam are just hanging out tonight. We can all watch a movie together.’\u003c/p\u003e\n\u003cp\u003e‘Cole, no, go be with your friends.’\u003c/p\u003e\n\u003cp\u003e‘Nah, it’s cool. They’re going to see a film I’ve already seen. Jo bought those little chocolate cupcake thingies you like …’\u003c/p\u003e\n\u003cp\u003eI groaned. ‘You know me too well.’\u003c/p\u003e\n\u003cp\u003eHe grinned. ‘Come on, then.’\u003c/p\u003e\n\u003cp\u003eMaybe it would be nice not to go home to an empty apartment just yet.\u003c/p\u003e\n\u003cp\u003e‘Okay.’\u003c/p\u003e\n\u003cp\u003eWe turned toward the stairs. ‘Hey, Cole!’ Looking back over our shoulders we saw a pretty blonde step away from the group, her large eyes questioning. ‘Where are you going?’\u003c/p\u003e\n\u003cp\u003e‘She’s pretty,’ I murmured under my breath. ‘Sure you want to leave?’\u003c/p\u003e\n\u003cp\u003eCole shrugged. ‘She’s not really my type,’ he murmured back.\u003c/p\u003e\n\u003cp\u003e‘Pretty’s not your type?’\u003c/p\u003e\n\u003cp\u003e‘She’s kind of annoying.’\u003c/p\u003e\n\u003cp\u003e‘Coh-ul?’ the blonde whined, and the sound was incredibly irritating.\u003c/p\u003e\n\u003cp\u003e‘Oh, yeah, I get you now.’\u003c/p\u003e\n\u003cp\u003eHe snorted and looked back at his friends. ‘I’ll catch you guys later, all right?’\u003c/p\u003e\n\u003cp\u003eOne of the boys glanced over at that, his eyes flying to me and widening instantly. ‘Fuck, Cole, are you tapping that?’\u003c/p\u003e\n\u003cp\u003eCole glared at the kid. ‘Del, why don’t you turn around and start talking through your arse? That way we’ll forgive the shit you come away with.’\u003c/p\u003e\n\u003cp\u003eWhile their friends laughed, shoving and teasing this ‘Del’ person, Cole gripped my elbow and started walking me down the stairs.\u003c/p\u003e\n\u003cp\u003eI was choking on laughter. ‘I know I’m supposed to admonish you for cursing, but … you are getting so like Cam, it’s too funny.’\u003c/p\u003e\n\u003cp\u003eCole was pleased with my assessment. He tried to hide it, but I saw the flush of pleasure on his neck and the little twitch to his mouth. I understood why. Cam was this hero who had swept in and saved him and his sister from a crappy life. Cam was everything Cole wanted to be.\u003c/p\u003e\n\u003cp\u003eWe were silent for a while as we strolled down Leith Walk side by side until the thought of the pretty blonde who’d stared at Cole with open fascination came to mind. ‘So, if you’re not into the whiny blonde girl, is there someone else you like?’\u003c/p\u003e\n\u003cp\u003eIn answer Cole flushed but surprised me by saying, while gazing at the ground, ‘There’s someone, but I’m too young for her. And I think she likes someone else anyway.’\u003c/p\u003e\n\u003cp\u003eA pang of deep affection echoed in my chest. ‘Dude, you really know how to boost a woman’s self-esteem.’\u003c/p\u003e\n\u003cp\u003eHe smirked, but his eyes were searching when he finally gathered the courage to look at me. ‘I overheard Jo and Cam talking. I know about you and Nate and what he did. I told him I don’t hang out with idiots or assholes, and seeing as he’s both, I was done.’\u003c/p\u003e\n\u003cp\u003eFor some insane reason I felt bad for Nate. ‘Cole, while I appreciate your loyalty, and I really do, Nate is your friend. He cares about you. Don’t shut him out because of me.’\u003c/p\u003e\n\u003cp\u003e‘But he hurt you.’\u003c/p\u003e\n\u003cp\u003e‘Yes. And I’m angry at him. But he didn’t hurt you. So please don’t you be angry at him.’\u003c/p\u003e\n\u003cp\u003eCole was quiet for a moment and then he said, ‘I think he feels bad. He’s been looking like shit lately.’\u003c/p\u003e\n\u003cp\u003eI pretended not to hear that. ‘That’s the third time you’ve cursed – you realize that, right?’\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003e‘Okay, I’ll leave the admonishing to Jo. Let’s talk about something less depressing. How’s school?’\u003c/p\u003e\n\u003cp\u003e‘You think that’s less depressing?’\u003c/p\u003e\n\u003cp\u003e‘It can’t be that bad.’\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003e‘Okay, how about art?’\u003c/p\u003e\n\u003cp\u003eThat topic immediately opened him up. ‘I’m getting a tattoo on my eighteenth birthday. I’ve been drawing loads of different ideas.’\u003c/p\u003e\n\u003cp\u003e‘Oh? So, are you still thinking about becoming a tattoo artist?’\u003c/p\u003e\n\u003cp\u003e‘Aye, didn’t Jo tell you?’\u003c/p\u003e\n\u003cp\u003e‘Tell me what?’\u003c/p\u003e\n\u003cp\u003e‘Adam’s friend’s cousin owns a tattoo parlor down in Leith. He’s going to let me spend a couple of days a week there over the summer. After high school there might be a possibility of an apprenticeship with him. If he likes me, that is. He told me to keep all my drawings. Create, like, a portfolio.’\u003c/p\u003e\n\u003cp\u003e‘That’s brilliant. Wow, you are way more organized about life than I was at fifteen.’\u003c/p\u003e\n\u003cp\u003eHe grunted. ‘Tell that to Jo. She wants me to go to college first.’\u003c/p\u003e\n\u003cp\u003e‘Maybe you should.’\u003c/p\u003e\n\u003cp\u003e‘We’ll see. Despite what she thinks, I have still got time.’\u003c/p\u003e\n\u003cp\u003e‘She just wants you to have choices in life, Cole.’\u003c/p\u003e\n\u003cp\u003e‘Aye,’ he said, his eyes softening. ‘I know that.’\u003c/p\u003e\n\u003cp\u003eThe walk passed quickly as we talked about school and movies and books. He was a kid who was kind of taciturn with most people, and it was nice to be counted among the circle of friends and family he was willing to open up to.\u003c/p\u003e\n\u003cp\u003eArriving at Jo and Cam’s flat, Cole shoved the door open. ‘I’m home!’\u003c/p\u003e\n\u003cp\u003e‘We’re in the kitchen!’ Jo called back.\u003c/p\u003e\n\u003cp\u003eCole grimaced. ‘I’m not going in there,’ he whispered. ‘Sometimes when they think they’re alone they’re all … affectionate.’\u003c/p\u003e\n\u003cp\u003eI chuckled under my breath and followed him into the sitting room. He stopped abruptly and I had to sidestep his tall frame to see past him.\u003c/p\u003e\n\u003cp\u003eIf a bus had driven through the wall and slammed into me, it wouldn’t have had any less of an impact than when I saw Nate sitting there. Our eyes collided and Nate slowly stood up from the couch. After a moment of helpless staring, my gaze drifted over him. Sporting a short beard and dark circles under his eyes, he looked exhausted and unkempt. It was so not like him.\u003c/p\u003e\n\u003cp\u003e‘Sorry, Liv,’ Cole apologized quietly. ‘I didn’t know he’d be here.’\u003c/p\u003e\n\u003cp\u003e‘It’s okay.’\u003c/p\u003e\n\u003cp\u003e‘How?’ Nate took a step toward me and I automatically took a step back. He stopped, swallowing hard as his eyes took me in, almost hungrily. ‘How are you?’\u003c/p\u003e\n\u003cp\u003eBefore I could muster up some kind of reply to that stupid-ass question, the loud clack of heels in the hall grew in crescendo as they came toward us, and I turned, my eyes narrowing, as a tall redhead in a low-cut tank top and skinny jeans sashayed into the room in five-inch sandals. ‘That bathroom is gorgeous.’ She smiled politely at me before sidling up to Nate. Her toned arm slid around his waist and she pressed her breasts against him. ‘Your friends have a really nice flat.’\u003c/p\u003e\n\u003cp\u003eHeat unlike anything I’d ever felt before flooded me. A fire blazed in my chest, the flames licking my throat and forestalling any words. Instead I just stood there glaring at them in impotent jealousy and heartbreak.\u003c/p\u003e\n\u003cp\u003e‘Liv?’ I turned at Jo’s voice and found her standing in the doorway, her features slack with surprise. ‘What are you –’ \u003c/p\u003e","sourceLink":"https://allnovel.net/before-jamaica-lane-on-dublin-street-3/page-37.html","bookId":1895,"creation":"Oct 5, 2019 5:08:56 PM","modification":"Oct 5, 2019 5:08:56 PM"}
