{"id":85745,"no":43,"title":"Page 43","content":"\u003cp\u003eThe sob burst forth before I could stop it and Nate caught me, leaning his forehead against mine as he rubbed his hands soothingly down my arms.\u003c/p\u003e\n\u003cp\u003e‘Please, Liv. Please tell me what I need to do to make sure you believe that.’\u003c/p\u003e\n\u003cp\u003eI swallowed, trying to calm the ache in my chest that was causing the sobs. Sucking in a deep breath, I gazed down at his chest and gently touched the new tattoo.\u003c/p\u003e\n\u003cp\u003eAfter\u003c/p\u003e\n\u003cp\u003eI tilted my head back to give him a watery smile. ‘You’ve already done it.’\u003c/p\u003e\n\u003cp\u003eNate’s arms slid around me, his head dipping so he could growl against my lips, ‘I love you so fucking much.’\u003c/p\u003e\n\u003cp\u003eMy heart jumped and I closed my eyes in pure relief. ‘I love you, too.’\u003c/p\u003e\n\u003cp\u003eHe kissed me.\u003c/p\u003e\n\u003cp\u003eHard.\u003c/p\u003e\n\u003cp\u003eAnd I clung on for dear life.\u003c/p\u003e\n\u003cp\u003eWe stumbled back against the table as we kissed each other as if it were the last time we’d get the chance. Turning us, Nate lifted me onto the table without breaking our connection and I immediately wrapped my legs around him, urging him closer. My hands pressed deep into the muscles in his back as he gripped my hips. I sucked on his tongue and felt his answering hard-on nudge insistently between my legs.\u003c/p\u003e\n\u003cp\u003eA loud burst of laughter from outside managed to force its way between us, and I jerked back, shaking my head dazedly. ‘We can’t,’ I panted breathlessly. ‘Not here. Do you know how many students have gotten up to no good on this table?’\u003c/p\u003e\n\u003cp\u003eHis eyes bright with lust, color high on his cheeks, Nate looked a little nonplussed at first as he gazed past me to said table. Finally, he lifted his hopeful gaze. ‘My place is a five-minute walk from here.’\u003c/p\u003e\n\u003cp\u003eSurprise shot through me and I smiled slowly. ‘I’ve never seen your place.’\u003c/p\u003e\n\u003cp\u003eTenderness softened Nate’s expression as he tucked a strand of hair behind my ear. ‘I’d really like you to see it now, babe.’\u003c/p\u003e\n\u003cp\u003eI bit my lip, musing over it. I didn’t muse long. ‘Angus does owe me some vacation time. I’m sure he won’t mind me taking a half day.’\u003c/p\u003e\n\u003cp\u003eNate’s hand was warm and strong in mine, and since his strides were eating concrete I had no choice but to hurry along with him or have my arm pulled out of the socket.\u003c/p\u003e\n\u003cp\u003eAfter Angus grinned knowingly at my half-day request and then quickly granted it, Nate had grabbed my hand and hauled ass out of the library. Without saying one word he pulled me along with him over the Meadows and into Marchmont.\u003c/p\u003e\n\u003cp\u003eI was now being ushered up the stairs in his building at super speed. On the second floor, without letting go of my hand, I might add, Nate dug his keys out of his pocket, opened the shiny black door one-handed and dragged me inside.\u003c/p\u003e\n\u003cp\u003eBefore I could take anything in, Nate was blocking my view, slamming the door shut over my shoulder a second before crushing his mouth down on mine and pushing me up against the wall.\u003c/p\u003e\n\u003cp\u003eI caught on fire pretty fast.\u003c/p\u003e\n\u003cp\u003eI salivated over the feel of his bristly stubble against my cheek, his tongue teasing mine, his soft hair drifting over my fingers as I clenched them in it in an effort to fuse myself to him. Nate pulled back to rip his shirt off and then he reached for mine.\u003c/p\u003e\n\u003cp\u003eHelpfully I lifted my arms and I was soon divested of my T-shirt.\u003c/p\u003e\n\u003cp\u003eMy bra was gone seconds later.\u003c/p\u003e\n\u003cp\u003eA pleasured whimper fell from my lips when Nate wrapped his mouth around one nipple, laving and sucking it with his tongue while he pinched the other between his finger and thumb. I closed my eyes, arching against his mouth, clutching his head to my chest in sheer sexual delight.\u003c/p\u003e\n\u003cp\u003e‘I’ve missed you so much,’ I gasped as arousal coursed between my legs.\u003c/p\u003e\n\u003cp\u003eMy words brought Nate’s head up and he was kissing my mouth again before trailing hot, openmouthed kisses down my neck. I jerked in delighted surprise at the touch of his fingertips on my sex. He rubbed me through the fabric of my pants and I moaned his name, pushing my hips into the contact.\u003c/p\u003e\n\u003cp\u003e‘I almost came out of my skin,’ Nate suddenly said, his voice cracking with sexual anticipation, ‘when you first asked me to teach you … when you asked me to fuck you.’ He groaned and dropped his head against the crook of my neck as he continued to rub me torturously. ‘It took every ounce of willpower I had not to grab your hand, haul you up to your flat, and fuck you until we both died of exhaustion.’\u003c/p\u003e\n\u003cp\u003e‘Seriously?’ I panted, my hands sliding down his warm, naked back to clutch his hips, to draw him closer.\u003c/p\u003e\n\u003cp\u003e‘Seriously.’ He lifted his head to stare into my eyes and I almost climaxed at the expression on his face. Nate wanted me. Like, seriously, seriously wanted me. ‘It was the excuse I’d been waiting for, for nine months.’\u003c/p\u003e\n\u003cp\u003eOur heavy breathing mingled for a highly charged moment, and then I reached up and kissed him. I kissed him with every ounce of love I had in me. Pulling back, we both panted a little as I cupped his face with my hands and let down every single defense I had. My soul was in my eyes, and I knew the moment Nate felt it because his grip on my waist tightened. ‘No one,’ I whispered, my lips trembling with the emotion, ‘has ever made me feel like the person I’ve always wanted to be until you. You make me feel beautiful, Nate. All the way through. No one else has ever given me that. No one.’\u003c/p\u003e\n\u003cp\u003e‘I’m glad,’ he murmured against my mouth. ‘Not just because you deserve to feel that way … but because it makes you mine.’\u003c/p\u003e\n\u003cp\u003e‘Nate …’ I shivered at the possessive purr in his voice.\u003c/p\u003e\n\u003cp\u003e‘You’re going to scream that for me tonight.’ He brushed his lips gently over my mouth as his fingers worked the zipper on my pants. ‘You’re going to scream that you’re mine.’ His hand slipped inside, his fingers pressing beneath my panties and pushing gently in.\u003c/p\u003e\n\u003cp\u003eI arched into his touch, sighing. ‘Come inside me,’ I begged. ‘I’ve missed you inside me.’\u003c/p\u003e\n\u003cp\u003e‘I am inside you,’ he answered, teasing me as he added another finger.\u003c/p\u003e\n\u003cp\u003eI groaned at the fullness but despite the pleasure, it wasn’t enough. ‘Not … I want your cock. I want your cock inside me. And I want it deep. So deep, Nate.’\u003c/p\u003e\n\u003cp\u003eHe crushed my mouth beneath his, his kiss as uncontrolled as his movements as he pushed my pants down until they fell to the floor. We broke apart just long enough for me to toe off my shoes, divest myself of the pants and my panties. I felt an indecent ripple of arousal wash over me at Nate’s reaction to the sight of me naked and trembling with anticipation against his wall.\u003c/p\u003e\n\u003cp\u003e‘Fuck.’ He stopped, his hands on the zipper of his jeans as his eyes washed over me. ‘Do you know how insanely sexy you look right now?’\u003c/p\u003e\n\u003cp\u003eHis expression was hot, and it turned me on to the point of combustion, so suffice it to say I was done being stared at. I wanted to be taken. ‘Nate, hurry.’\u003c/p\u003e\n\u003cp\u003eBurning eyes drinking me in, Nate slowly unbuttoned his jeans as his chest rose and fell rapidly. ‘Say it again. Say it standing there with your legs spread, waiting for me.’\u003c/p\u003e\n\u003cp\u003eThe flush of self-consciousness I felt under his perusal was more than eaten up by how excited I was. I was soaked. ‘Say what?’\u003c/p\u003e\n\u003cp\u003eHis lip curled at the corner. ‘You know what, babe.’\u003c/p\u003e\n\u003cp\u003eDirty. Nate liked it dirty.\u003c/p\u003e\n\u003cp\u003eWho was I kidding? We both loved it dirty.\u003c/p\u003e\n\u003cp\u003eShoulder blades pressed against the wall, my breasts heaving with breathlessness, I widened my stance, causing Nate’s nostrils to flare. ‘I want your thick, hard cock inside of me now and I want you to fuck me against this wall until we can’t breathe.’\u003c/p\u003e\n\u003cp\u003eI barely got a chance to see the way his lower abs jerked at my words before he was on me. His kisses were bruising as he slammed into me, pushing his jeans down to free his dick, seconds before he wrapped his hands around my legs, sliding me up the wall, angling my body just right.\u003c/p\u003e\n\u003cp\u003eHe thrust into me.\u003c/p\u003e\n\u003cp\u003eHard.\u003c/p\u003e\n\u003cp\u003eDeep.\u003c/p\u003e\n\u003cp\u003eWe both cried out as my sex clenched around his invasion. I wrapped my arms around his shoulders, my legs around his waist, hanging on for dear life as he pounded into me.\u003c/p\u003e\n\u003cp\u003e‘You’re drenched,’ he said on a harsh breath. ‘So wet for me, babe. I love how hot and wet you are.’\u003c/p\u003e\n\u003cp\u003e‘Just for you,’ I promised on a pant and that made him pump into me harder, faster.\u003c/p\u003e\n\u003cp\u003eI yelled out to God and the heavens as the delicious, rough friction quickly created the right pressure inside me.\u003c/p\u003e\n\u003cp\u003eAnd then suddenly I was moving through the air, falling against Nate as he took us to the floor. With him still inside me, he flipped us, now with my back on the floor. He lifted my right leg higher, pushing my left leg gently, spreading me wider. His eyes burned into mine as he moved above me, this new position allowing him to thrust deeper.\u003c/p\u003e\n\u003cp\u003eThe pressure in me built and built.\u003c/p\u003e\n\u003cp\u003e‘Nate!’ I cried, unable to move against him since he held me so tight. It only made the tension coil, my climax nearing …\u003c/p\u003e\n\u003cp\u003e‘That’s it,’ he panted, his eyes never leaving mine. ‘Let me take you there, baby.’\u003c/p\u003e\n\u003cp\u003e‘I’m coming.’ I scraped my nails into his hardwood floor. ‘I’m coming.’\u003c/p\u003e\n\u003cp\u003eThen suddenly his movements slowed and the pressure stabilized.\u003c/p\u003e\n\u003cp\u003e‘No!’ I gasped frantically, reaching for him. ‘Don’t stop.’\u003c/p\u003e\n\u003cp\u003eHis eyes glittered at me. ‘Say you’re mine.’\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003e‘Tell me you’re mine.’\u003c/p\u003e\n\u003cp\u003eWhat the hell was he doing?\u003c/p\u003e\n\u003cp\u003e‘Nate, don’t stop, I’m so close.’\u003c/p\u003e\n\u003cp\u003eHe circled his hips against me, teasing me. ‘Tell me you’re mine.’\u003c/p\u003e\n\u003cp\u003e‘Of course I’m yours,’ I snapped. ‘Now bloody well fuck me!’\u003c/p\u003e\n\u003cp\u003eNate’s grin was quick, melting hurriedly beneath his own growing need as he began to pump into me again, his movements gaining speed as my breathing stuttered.\u003c/p\u003e\n\u003cp\u003e‘Oh God!’ I slapped my palms against the floor. ‘Oh God, oh God! Nate!’\u003c/p\u003e\n\u003cp\u003eThe pressure blew and the orgasm that tore through me was so epic my eyes actually rolled to the back of my head. My lower body shuddered against Nate’s thrusts, my inner muscles clamping hard around him. Nate came with a shout of release rather than his usual groan. His hips jerked in hard shudders against me as the orgasm rolled through him, setting off little aftershocks in my body.\u003c/p\u003e\n\u003cp\u003eHe braced over me, his eyes wide as we stared at each other in blissed-out shock.\u003c/p\u003e\n\u003cp\u003eIt was safe to say … best sex ever. Ever!\u003c/p\u003e\n\u003cp\u003eGently releasing his hold on my legs, Nate fell to the floor beside me, and we lay with our heads together, panting hard, slick with sweat, staring up at his white ceiling.\u003c/p\u003e\n\u003cp\u003e‘So,’ Nate said once he had his breathing under control, ‘this is my place.’\u003c/p\u003e\n\u003cp\u003eSmiling, I said, ‘I like the wall. And that’s a good ceiling.’\u003c/p\u003e\n\u003cp\u003eWe turned our heads to look at each other and instantly burst out laughing.\u003c/p\u003e\n\u003cp\u003eI was still giggling as Nate rolled into me, his hands shifting through my hair as I wrapped my hands lightly around his back. ‘Want to see the rest of it?’\u003c/p\u003e\n\u003cp\u003eI pretended to contemplate this for a moment and then asked, ‘Do you have a slatted headboard?’\u003c/p\u003e\n\u003cp\u003eHis answering grin was slow and wicked. ‘Are you asking me to tie you down?’\u003c/p\u003e\n\u003cp\u003eI nodded my affirmative. ‘In every way you possibly can.’\u003c/p\u003e\n\u003cp\u003eNate’s expression softened to absolute tenderness and he leaned down to press a soft kiss to my mouth. ‘That,’ he whispered, ‘I can definitely do.’\u003c/p\u003e\n\u003cp\u003e28\u003c/p\u003e\n\u003cp\u003eIt was a warm spring evening, a slight breeze whispering over my bared arms as I stalked toward Club 39 in my stilettos. Two guys passed me and I felt their eyes drift over me. Glancing up at them out of the corner of my own, I found them staring appreciatively at my legs.\u003c/p\u003e\n\u003cp\u003eA few months ago I would have somehow managed to convince myself that they weren’t staring appreciatively – that they were staring in bemusement at the fat girl who had dared to wear a dress. I knew that wasn’t true anymore. I had good legs. I was showing them off.\u003c/p\u003e\n\u003cp\u003eBut not for these guys.\u003c/p\u003e\n\u003cp\u003eNo, my pins were out on display for Nate Sawyer and Nate Sawyer only. \u003c/p\u003e","sourceLink":"https://allnovel.net/before-jamaica-lane-on-dublin-street-3/page-43.html","bookId":1895,"creation":"Oct 5, 2019 5:08:56 PM","modification":"Oct 5, 2019 5:08:56 PM"}
