{"id":64656,"no":28,"title":"Page 28","content":"\u003cp\u003eNot that they\u0027re looking around, not that they suspect a thing. He could probably stand right next to them without arousing suspicion.\u003c/p\u003e\n\u003cp\u003eHe considers it, thinking it might be interesting to know what they are saying.\u003c/p\u003e\n\u003cp\u003eIf it were just the one man, the older man, and if there were fewer people on the platform- well, that sort of thing happens all the time, doesn\u0027t it? You stand close, waiting, timing the approach of the oncoming train, then give a sudden lurch, a shove, and, if you are clever about it, you can even make it appear to anyone watching as though you are trying to save the person, trying to grab hold of the fellow you\u0027ve just sent hurtling into the train\u0027s path.\u003c/p\u003e\n\u003cp\u003eRidiculous even to think about it. But he has to acknowledge that his hands are tingling, as if anticipating their role.\u003c/p\u003e\n\u003cp\u003eInteresting, what you learned about yourself…\u003c/p\u003e\n\u003cp\u003eAn express train comes. They board it and so does he, entering the same car by a different door. They stand, their hands a foot apart on the overhead rail. He sits, watching them without being watched in return.\u003c/p\u003e\n\u003cp\u003eOne stop to Ninety-sixth Street. The doors open. They get out, talking, paying no attention, and he follows. Again he plants himself ten or a dozen yards away, and follows them onto the Broadway local when it arrives.\u003c/p\u003e\n\u003cp\u003eTWENTY-THREE\u003c/p\u003e\n\u003cp\u003eOn the street I said, \"I hope I was right.\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Bout her not needin\u0027 a will?\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. She\u0027s sitting on what, nine or ten million dollars? This may be hard to believe, but there are cases on record where people have killed for less than that.\"\u003c/p\u003e\n\u003cp\u003e\"Some for as little as twenty thousand.\"\u003c/p\u003e\n\u003cp\u003e\"Just what I was thinking.\"\u003c/p\u003e\n\u003cp\u003e\"She didn\u0027t know about it, though. Lia.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s according to Kristin. No way of telling what Aunt Susan might have let slip, along with the combination for the keypad.\"\u003c/p\u003e\n\u003cp\u003e\"Coulda known about it,\" he allowed. \"Coulda thought it\u0027d be more. Can\u0027t quite see her as the Third Man, though.\"\u003c/p\u003e\n\u003cp\u003e\"Does she have a boyfriend?\"\u003c/p\u003e\n\u003cp\u003e\"Never mentioned one. Don\u0027t mean she don\u0027t have one.\" We were walking as we talked, and as we neared the corner he said, \"Here\u0027s what don\u0027t make sense. If she\u0027s involved, what she wants is what happens- the cops wrap it up an\u0027 close the case. Otherwise why stage it that way?\"\u003c/p\u003e\n\u003cp\u003e\"So why does she say anything to you? Why let on she\u0027s suspicious of Kristin?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"That\u0027s what don\u0027t make sense.\"\u003c/p\u003e\n\u003cp\u003e\"Twenty thousand\u0027s not really all that much,\" I said. \"Not as a payoff for an operation like this. Maybe she was expecting more.\"\u003c/p\u003e\n\u003cp\u003e\"Like how much?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, pick a number. A hundred thousand? She sees how the Hollanders live and they look to her like they\u0027ve got more money than God, and Aunt Susan says she\u0027s made a provision for her to see her through college, and who knows what kind of dollar-sign sugarplums start dancing in her head? Then she finds out it\u0027s twenty thousand dollars and that seems like nothing. On the other hand, if Kristin\u0027s implicated, she can\u0027t profit from her parents\u0027 death. And the whole pie gets chopped up among the surviving relatives.\"\u003c/p\u003e\n\u003cp\u003e\"So what\u0027s she get?\"\u003c/p\u003e\n\u003cp\u003e\"How many relatives did she name before, eight or ten? Say there are more she didn\u0027t mention, say a total of twenty, and say they all get equal shares. What is that, half a million dollars?\"\u003c/p\u003e\n\u003cp\u003e\"More\u0027n twenty thousand.\"\u003c/p\u003e\n\u003cp\u003e\"A lot more,\" I said, and pictured the ash-blond waif, the see-through skin, the big soulful eyes. \"But I can\u0027t believe she was involved. Not knowingly.\"\u003c/p\u003e\n\u003cp\u003e\"What you lookin\u0027 for?\"\u003c/p\u003e\n\u003cp\u003e\"A pay phone,\" I said. \"Do you see one anywhere?\"\u003c/p\u003e\n\u003cp\u003e\"Got a free one,\" he said, and took his cell phone from his pocket. I said I didn\u0027t suppose he remembered Lia Parkman\u0027s number, and he rolled his eyes. \"Don\u0027t need to remember it,\" he said. \"Got her on my speed dial.\" He punched some numbers, flicked a lever, and held the contraption to his ear. After a moment he said, \"Lia? T J. Hold on a second.\"\u003c/p\u003e\n\u003cp\u003eHe covered the mouthpiece with his hand. \"You really oughta get one of these,\" he said, and handed me the phone.\u003c/p\u003e\n\u003cp\u003eWe rode up on the subway, meeting her at the Salonika, the same place as last time. She was waiting for us in a booth, an iced tea half finished in front of her. I said I\u0027d have the same, and T J ordered a Coke. The waitress didn\u0027t seem to mind that no one was having any food. It was an off-hour, and if we weren\u0027t there the booth would be empty.\u003c/p\u003e\n\u003cp\u003eLia had been surprised to hear from me. I\u0027d done such a good job of setting her mind to rest that she\u0027d never have guessed I was following up on the inquiry she\u0027d set in motion. Her first reaction was one of alarm. She didn\u0027t want to make trouble for Kristin, that was the last thing she wanted, and now that the initial shock had worn off she couldn\u0027t imagine what had ever led her to have such a crazy idea in the first place. She\u0027d seen Kristin since then, and Kristin was completely rocked by the death of her parents, and…\u003c/p\u003e\n\u003cp\u003eI assured her that Kristin wasn\u0027t a suspect. But, I said, there were some unanswered questions in the case, some possibility that the burglary had been arranged, that the killers had had inside help.\u003c/p\u003e\n\u003cp\u003e\"The burglar alarm,\" she said.\u003c/p\u003e\n\u003cp\u003e\"The burglar alarm code, the front door key, the Hollanders\u0027 schedule. I was just wondering if someone could have wormed any pertinent information out of you.\"\u003c/p\u003e\n\u003cp\u003e\"Out of me?\"\u003c/p\u003e\n\u003cp\u003e\"Well, you or your boyfriend.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I don\u0027t have a boyfriend,\" she said, \"so that\u0027s not it. And nobody even knew about my aunt and uncle or where they lived or anything. So I can\u0027t think how anybody could have gotten any information from me.\"\u003c/p\u003e\n\u003cp\u003eThere was something she wasn\u0027t telling me. I could feel its presence there, parked on the edge of thought. I tried a few approaches, and then I said, \"How about the key? Did anybody borrow it?\"\u003c/p\u003e\n\u003cp\u003e\"No, of course not.\"\u003c/p\u003e\n\u003cp\u003e\"But you did have a key, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Aunt Susan gave it to me.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t mention it before,\" I said. \"You and your aunt came home one day, and she had her arms full of packages, so she gave you the key and had you open the door. Then she told you the keypad code so you could turn off the alarm.\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t meant to scare her, but I did. She looked like a waif caught in the headlights.\u003c/p\u003e\n\u003cp\u003eGently I said, \"Isn\u0027t that what you said?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. That\u0027s what happened, but the way you said it just now- \"\u003c/p\u003e\n\u003cp\u003e\"If you had your own key, why did your aunt hand you hers?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t have a key then. Later on she gave me one. In case I needed to get in when nobody was home, she said. And she reminded me I already knew how to deactivate the alarm. Just be sure to set it again before I left, she said.\"\u003c/p\u003e\n\u003cp\u003e\"And did you have much occasion to use your key?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think I ever used it,\" she said. \"Until you mentioned it just now, I more or less forgot I had it. And nobody else knew I had it, and I certainly never let anybody borrow it.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have it with you now?\"\u003c/p\u003e\n\u003cp\u003eShe fished in her purse, brought out a ring of keys, identified one as being the key to the Hollander house. \"So even if somebody took it when I wasn\u0027t looking,\" she said, \"which wouldn\u0027t make sense because nobody even knew I had it, but if somebody did, and he took it, well, he couldn\u0027t have, because here it is.\"\u003c/p\u003e\n\u003cp\u003e\"That just means he gave it back.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you think I would remember? Especially after what happened, don\u0027t you think it would get my attention if someone gave back a key to the house where my aunt and uncle were murdered?\"\u003c/p\u003e\n\u003cp\u003eT J pointed out that he could have returned the key the same way he took it, without her knowledge. \"And it wouldn\u0027t have had to be after the break-in,\" I added. \"He wouldn\u0027t have kept the key for long, wouldn\u0027t have wanted to chance your missing it. He\u0027d just need it long enough to have a copy made. It\u0027s not a hard key to duplicate. Any neighborhood locksmith could do it in five minutes.\"\u003c/p\u003e\n\u003cp\u003eShe was silent for a long moment, then announced she had to go to the bathroom. She took a step away from the table, then came back for her purse.\u003c/p\u003e\n\u003cp\u003e\"She \u0027fraid we might look through it,\" T J said.\u003c/p\u003e\n\u003cp\u003e\"And didn\u0027t want to let us know she was thinking that, but didn\u0027t want to leave the purse, either.\"\u003c/p\u003e\n\u003cp\u003e\"Hidin\u0027 something.\"\u003c/p\u003e\n\u003cp\u003e\"Feels that way to me, too.\"\u003c/p\u003e\n\u003cp\u003eWhen she came back to the table I fed her a few easy questions, ones it wouldn\u0027t disturb her to answer. They were designed to make our relationship feel a little less adversarial. Then I asked her if there was anything else she could think of, something she might feel reluctant to mention. I could feel her wrestling with the question, deciding whether or not to give it up.\u003c/p\u003e\n\u003cp\u003e\"No,\" she said at length. \"I\u0027m sorry, but there\u0027s nothing.\"\u003c/p\u003e\n\u003cp\u003eBack on Broadway, T J said he didn\u0027t suppose I felt like walking all the way home again. I didn\u0027t, and we headed for the subway.\u003c/p\u003e\n\u003cp\u003e\"Thought you\u0027d keep at her,\" he said as we walked. \"Thought you\u0027d get her to open up.\"\u003c/p\u003e\n\u003cp\u003e\"I thought about it.\"\u003c/p\u003e\n\u003cp\u003e\"Just handed her a card. \u0027Call me if you think of anything, however far-fetched or unimportant it might seem.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"When you go fishing,\" I said, \"and you get a bite, you have to know when to give line and when to reel in.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know you liked to go fishing.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t,\" I said. \"It bores me to death.\"\u003c/p\u003e\n\u003cp\u003e\"So you gave Lia some line.\"\u003c/p\u003e\n\u003cp\u003e\"I gave her an easy way to change her mind,\" I said. \"She knows something, or thinks she does, or is afraid she does. Now she\u0027ll go home and think about it, and she\u0027ll feel guilty, because she lied to me and I acted as though I believed her. And maybe she\u0027ll pick up the phone.\" I was silent for a moment, and then I added, \"But it\u0027s all guesswork, you know. If she makes the call, then I guessed right.\"\u003c/p\u003e\n\u003cp\u003eNot exactly, as it turned out. She made the call, but that didn\u0027t mean I\u0027d played it right.\u003c/p\u003e\n\u003cp\u003eTWENTY-FOUR\u003c/p\u003e\n\u003cp\u003eLia!\u003c/p\u003e\n\u003cp\u003eHe is on the street in front of the coffee shop, squinting through the plate glass window, and they are in a booth with their backs to him. He wouldn\u0027t be able to pick out either of them, just seeing the backs of their heads from this distance, but the combination, black and white, makes it easy to spot them. And, across from them, a blond girl sits, and she is instantly recognizable.\u003c/p\u003e\n\u003cp\u003eAnd what business do these two have with Lia Parkman? How do they even know she exists?\u003c/p\u003e\n\u003cp\u003eKristin Hollander, of course. They went to Kristin Hollander\u0027s house, she let them in, they stayed for the better part of an hour, and they left, made a phone call, and here they are, sitting across a table from Lia Parkman, Kristin\u0027s cousin.\u003c/p\u003e\n\u003cp\u003eWhat are they talking about?\u003c/p\u003e\n\u003cp\u003eWhat is she telling them?\u003c/p\u003e\n\u003cp\u003eShe can\u0027t tell them too much. She doesn\u0027t really know anything. But she knows him, and she could conceivably put them on his track.\u003c/p\u003e\n\u003cp\u003eHe doesn\u0027t want that. Whoever they are, whatever they\u0027re after, he doesn\u0027t want that.\u003c/p\u003e\n\u003cp\u003eHis hand goes to his throat. He\u0027s not wearing a tie today, nor a jacket, just a blue shirt with the collar open and the sleeves rolled up for comfort. He lifts out the rhodochrosite disc, feels its smoothness, tucks it away beneath his shirt.\u003c/p\u003e\n\u003cp\u003eHis own fault. He knew she was a loose end, dangling invitingly, waiting for someone to grab hold and give a tug. But, because everything went so smoothly, he let himself believe it was all right to leave a loose end. \u003c/p\u003e","sourceLink":"https://allnovel.net/hope-to-die-matthew-scudder-15/page-28.html","bookId":2333,"creation":"Oct 5, 2019 9:55:14 AM","modification":"Oct 5, 2019 9:55:14 AM"}
