{"id":64663,"no":35,"title":"Page 35","content":"\u003cp\u003eHe checks his e-mail, hurrying through it, deleting the garbage, the junk mail, answering one message that needs to be answered, keeping the rest for later. Pulls down the Favorite Places menu, selects Newsgroups: ACSK.\u003c/p\u003e\n\u003cp\u003eAnd his newsgroup comes on-screen, alt.crime.serialkillers. He scrolls down the list of new messages. There are four in the Jason Bierman thread, and he reads them, and there\u0027s nothing very interesting. He\u0027s seen this happen time and time again in a thread. After a few days the whole point of the topic gets lost, as people post responses to someone else\u0027s off-topic meandering, and as others, the Johnny One-Note element, ride their individual hobby horses- for/against capital punishment, say, or warning of government intrusion and the New World Order. There is a way to screen out messages from the most obnoxious members, you add their names to your killfile and their messages never appear on your screen, but he hasn\u0027t done that yet. Soon, perhaps.\u003c/p\u003e\n\u003cp\u003eThere\u0027s nothing about Lia Parkman.\u003c/p\u003e\n\u003cp\u003eWell, how could there be? If all has gone well, they think the little darling had too much to drink and forgot you needed gills to breathe underwater. That may not hold up, it depends how good the medical examiner is and what kind of a day he\u0027s having. If they\u0027re good, if they look closely, they may well guess that she had help.\u003c/p\u003e\n\u003cp\u003eEyes staring up through the water…\u003c/p\u003e\n\u003cp\u003eBut even if they work it out, he realizes, they won\u0027t know who did it. That\u0027s fine, that\u0027s the way he wants it, and yet, well, there is a slight downside.\u003c/p\u003e\n\u003cp\u003eBierman\u0027s not getting credit.\u003c/p\u003e\n\u003cp\u003eBierman\u0027s going to drop off the edge of the newsgroup\u0027s consciousness. He doesn\u0027t really belong there, he\u0027s barely a mass murderer and by no means a serial killer. He has three victims, all killed the same day, one miles apart from the others, to be sure, but all slain as part of a single extended episode.\u003c/p\u003e\n\u003cp\u003eSo it\u0027s quite proper that he fade and be forgotten.\u003c/p\u003e\n\u003cp\u003eBut there\u0027s a real serial killer involved, and nobody even knows. Nobody has a clue!\u003c/p\u003e\n\u003cp\u003eCall him- well, just for now, call him Arden Brill. It was an error, borrowing a name from that musty old Freudian, but let it go. Unless the investigating officer has a side interest in discredited psychoanalytic claptrap, the name will set off no alarms. So why not use it, if only in the privacy of one\u0027s own mind?\u003c/p\u003e\n\u003cp\u003eArden Brill has killed not three people but five. He killed twice on West Seventy-fourth Street, twice on Coney Island Avenue (at intervals several hours apart, making them, really, two separate incidents), and now he can claim a fifth victim, on Claremont Avenue.\u003c/p\u003e\n\u003cp\u003eAnd no one knows!\u003c/p\u003e\n\u003cp\u003eHe scans the computer screen. At the bottom of the newsgroup window is a button that reads New Message. He clicks on it, and there\u0027s a new screen, all set up to receive a message for alt.crime.serialkillers.\u003c/p\u003e\n\u003cp\u003eOn the subject line he types: BIERMAN INNOCENT VICTIM.\u003c/p\u003e\n\u003cp\u003eNo, only the worst idiots use all caps like that. It\u0027s the newsgroup equivalent of shouting. He deletes it, tries again: Bierman innocent victim.\u003c/p\u003e\n\u003cp\u003eBetter.\u003c/p\u003e\n\u003cp\u003eHe looks at the screen, then begins to type:\u003c/p\u003e\n\u003cp\u003eJason Bierman never killed anybody. He was artfully set up to take the rap for a killer none of you know anything about. That man\u0027s name is Arden Brill.\u003c/p\u003e\n\u003cp\u003eHe deletes the last sentence and goes on:\u003c/p\u003e\n\u003cp\u003e… I am that man, and you may call me Arden Brill. I have killed five times. Bierman was my first victim, the Hollanders numbers two and three. Carl Ivanko was fourth. You have credited Jason Bierman with all of these killings, and he never even met or heard of a single one of his purported victims!\u003c/p\u003e\n\u003cp\u003eMy fifth victim is Lia Parkman, and you have never heard of her, but you will. I drowned her in a tub of water, held her by her tits and watched her fight for life.\u003c/p\u003e\n\u003cp\u003eBut she hadn\u0027t struggled. In fact he was not altogether sure she ever regained consciousness. Her eyes were open, but did that necessarily mean she knew what was going on? Maybe he should change that last sentence:\u003c/p\u003e\n\u003cp\u003e… I drowned her in a tub of water, held her by her sweet little tits and watched the bubbles rise to the surface as the life went out of her.\u003c/p\u003e\n\u003cp\u003eThat was better. That, in fact, was exactly how it had happened. Calling her tits sweet and little was not exactly clinical, but no one could fault him for veracity.\u003c/p\u003e\n\u003cp\u003e… I do not kill for the thrill of it. I have a motive, and it is perfectly logical. I shall profit enormously from my crimes.\u003c/p\u003e\n\u003cp\u003eNo, not crimes. He deleted \"crimes,\" resumed:\u003c/p\u003e\n\u003cp\u003e… profit enormously from my actions, which may disqualify me as a serial killer. Still, for all that my work is undertaken for profit. I cannot deny that the act of killing is satisfying to me in ways I would never have anticipated. I enjoy it before the act, during the act, and after the act has been completed.\u003c/p\u003e\n\u003cp\u003eHe pauses, forming his thoughts:\u003c/p\u003e\n\u003cp\u003eI have killed both men and women. Killing men, I would say, provides me with more of a sense of accomplishment. On the other hand, for sheer pleasure, there\u0027s nothing like killing a woman.\u003c/p\u003e\n\u003cp\u003eNo, amend that slightly:\u003c/p\u003e\n\u003cp\u003e… nothing like killing an attractive woman.\u003c/p\u003e\n\u003cp\u003eHe sits there, looking at what he has written, nodding his approval. His watch beeps, signaling that it is ten minutes before the hour.\u003c/p\u003e\n\u003cp\u003eHe moves the mouse, poises the cursor over the Post button.\u003c/p\u003e\n\u003cp\u003eOh, no. No, I don\u0027t think so.\u003c/p\u003e\n\u003cp\u003eHe shifts the mouse, clicks on Cancel. The message, unsent, vanishes from the screen. A few more clicks and he\u0027s off-line, and his screensaver is back in place, lights winking on and off, on and off…\u003c/p\u003e\n\u003cp\u003eTWENTY-NINE\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go over it again,\" Wentworth said. \"Doc\u0027s name is Nadler?\"\u003c/p\u003e\n\u003cp\u003e\"Seymour Nadler.\"\u003c/p\u003e\n\u003cp\u003e\"And he\u0027s a psychiatrist, is that right?\"\u003c/p\u003e\n\u003cp\u003e\"Board-certified,\" I said.\u003c/p\u003e\n\u003cp\u003e\"A disciple of Sigmund Freud.\"\u003c/p\u003e\n\u003cp\u003e\"That I wouldn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"And maybe of Brill,\" he said. \"A. A. Brill. Studied with him, maybe.\"\u003c/p\u003e\n\u003cp\u003e\"The dates are wrong,\" I said. \"Brill died in 1948.\"\u003c/p\u003e\n\u003cp\u003e\"Was Nadler even born then?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"He\u0027s around forty.\"\u003c/p\u003e\n\u003cp\u003e\"And the gun was his, the murder weapon.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Registered, and he had a permit for it.\"\u003c/p\u003e\n\u003cp\u003e\"For his office and residence. He didn\u0027t have a carry permit.\"\u003c/p\u003e\n\u003cp\u003e\"He bought it when, sometime last year? Did he give a reason?\"\u003c/p\u003e\n\u003cp\u003e\"According to him,\" I said, \"he had a patient he was worried about.\"\u003c/p\u003e\n\u003cp\u003e\"Makes sense,\" Wentworth said. \"I got a patient worries me, I want a gun so I can shoot him. Why dick around with medication? I don\u0027t suppose he ever had occasion to shoot this patient.\"\u003c/p\u003e\n\u003cp\u003e\"He said the man committed suicide.\"\u003c/p\u003e\n\u003cp\u003e\"Shot himself?\"\u003c/p\u003e\n\u003cp\u003e\"Went out a window, or maybe it was off a roof.\"\u003c/p\u003e\n\u003cp\u003e\"Story check out?\"\u003c/p\u003e\n\u003cp\u003e\"About the patient? I have no idea. He didn\u0027t furnish the name, and I didn\u0027t see any reason to ask it.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t suspect him.\"\u003c/p\u003e\n\u003cp\u003e\"No, not at all. Of what, killing three people with a registered weapon and leaving it at the scene? The man had diplomas on the wall, I figured he had an IQ at least as high as his body temperature.\"\u003c/p\u003e\n\u003cp\u003eHe started to say something, then stopped. At the corner, a vendor of soft ice cream had parked his truck, and the Mister Softee music was playing relentlessly. Wentworth said, \"Excuse me,\" and got to his feet, striding off toward the ice cream truck.\u003c/p\u003e\n\u003cp\u003e\"Man hears that music,\" T J said, \"he just got to have it. What it is, he was conditioned as a child.\" He glanced across the street, raised his eyes about ten floors. \"You got any trouble with the concept, Dr. Nadler be glad to explain it all for you.\"\u003c/p\u003e\n\u003cp\u003eWe were on a bench on the east side of Central Park West, directly across the street from Seymour Nadler\u0027s building. There was a five-foot stone wall behind us, and on the other side of it was the park. I\u0027d left word for Wentworth at the precinct, and he\u0027d called me right after he left Kristin\u0027s house. He\u0027d interviewed her at length, and had reinforced the advice I\u0027d given her- don\u0027t take any calls, don\u0027t open the door for anyone. He hadn\u0027t been able to arrange police protection yet, but he had a request in, and expected it would be approved before long.\u003c/p\u003e\n\u003cp\u003eI looked over and saw Wentworth in conversation with the Mister Softee man. After a few moments the truck pulled away from the curb, crossed the intersection, and kept going for another block. Wentworth returned empty-handed, but with a look of triumph on his square-jawed face.\u003c/p\u003e\n\u003cp\u003e\"Told him to take it down the road,\" he said. \"What\u0027s the point of having a gold shield if you can\u0027t kick Mister Softee\u0027s ass off your block?\"\u003c/p\u003e\n\u003cp\u003e\"Who I wanted to be,\" T J said. \"When I grew up.\"\u003c/p\u003e\n\u003cp\u003e\"Who, Mister Softee? Or a guy with a gold shield?\"\u003c/p\u003e\n\u003cp\u003e\"Mister Softee. You like the Pied Piper, ring that little bell an\u0027 all the boys an\u0027 girls come runnin\u0027.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d like that, would you?\"\u003c/p\u003e\n\u003cp\u003e\"Thought so, when I was young. Everywhere you go, they be happy to see you.\"\u003c/p\u003e\n\u003cp\u003e\"Not their parents,\" Wentworth said. \"Not anybody who\u0027s trying to concentrate. Imagine sitting in the truck all day, listening to that music for hours on end.\" He shook his head. \"Guy didn\u0027t want to move. \u0027But this is my spot,\u0027 he kept whining. Like nobody\u0027ll be able to find him a block away. \u0027This is my spot,\u0027 I said. He got the point.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a small victory,\" I said, \"but at least it goes in the win column.\"\u003c/p\u003e\n\u003cp\u003e\"Damn right,\" he said. \"Look at me, I put the fear of God into Mister Softee. You figure that\u0027s his wife\u0027s pet name for his thing? Jesus, let\u0027s hope not.\"\u003c/p\u003e\n\u003cp\u003eOn the sidewalk in front of us, a girl in her early teens whizzed by on Rollerblades. \"They\u0027re not supposed to skate on the sidewalk,\" he said, \"but I\u0027ll let her go this time. I already filled my quota with Mister Softee. You want to get back to your boy Nadler?\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\"\u003c/p\u003e\n\u003cp\u003e\"He bought the gun last year, kept it locked away in his desk drawer. March, he and his wife are out, he comes home and there\u0027s been a burglary. He makes a report, files a claim with his insurance company. Right so far?\"\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e\"Then two, three days later he opens the drawer and the gun\u0027s gone. Did he say what made him look?\"\u003c/p\u003e\n\u003cp\u003e\"Not that I remember.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a stretch. He\u0027s at his desk, he\u0027s thinking about the burglary, thinks, Jesus, suppose I was here, what would I do, would I go for my gun? So he looks for the gun and it\u0027s missing. And he reported it, right?\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"But didn\u0027t add it to his insurance claim.\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t want the aggravation of amending the claim,\" I said. \"And he wasn\u0027t sure it would be covered, as he\u0027d never included it on the schedule. It didn\u0027t seem unreasonable.\"\u003c/p\u003e\n\u003cp\u003e\"No, and it still doesn\u0027t. Plus there\u0027s the embarrassment factor. \u0027I bought a gun to protect myself and my family and the burglars took it away with them.\u0027 The law requires him to inform the police, but nobody says he has to put in a claim. That\u0027s up to him.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"So we fast-forward a few months,\" he said, \"and it\u0027s the end of July, beginning of August, and the Hollanders are killed, and the two in Brooklyn.\"\u003c/p\u003e\n\u003cp\u003e\"Bierman and Ivanko.\"\u003c/p\u003e\n\u003cp\u003e\"And the gun\u0027s left at the scene, as it more or less has to be if it\u0027s going to look like suicide, and a ballistics check reveals the gun is the very same twenty-two-caliber pistol stolen from the good Dr. Nadler. Was it a twenty-two? Did I get that part right?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/hope-to-die-matthew-scudder-15/page-35.html","bookId":2333,"creation":"Oct 5, 2019 9:55:14 AM","modification":"Oct 5, 2019 9:55:14 AM"}
