{"id":39429,"no":1,"title":"INTRODUCTION.","content":"Most of the following chapters were written some time since, at the request of the publisher, whose intention it was to present the readers of Irish history with a portable volume, which, while removing the necessity of wading through many tomes, would give an authentic account of the two leading events of a very important period,—the battles of the Boyne and Aughrim.\n\u003cbr\u003e \n\u003cbr\u003e Having undertaken the task, and performed it to the extent of his information, it appeared to the writer that, without some allusion to antecedent causes and intermediate events, the book, though it should be acceptable to some, would be quite unsatisfactory to others; and it was concluded to make such interpolation as, without overburdening, would render the offering more clear and comprehensive.\n\u003cbr\u003e \n\u003cbr\u003e After collecting much matter bearing on the subject, and finding it impossible to compress it methodically within the limits assigned, such selections were made, from historians of every shade of opinion, as would suffice, without distorting the parts already arranged, to give a consecutive view of the Jacobite war in Ireland, from its inception to its close.\n\u003cbr\u003e \n\u003cbr\u003e As it was almost exclusively a war for religious ascendency on the one side, and for complete civil and religious liberty on the other, continually presenting a politico-religious aspect, it was chosen to leave the ethological bearing to other mediums, and confine this principally to the leading military events of the time. Hence, no allusion whatever is made to the interior merits of either faith dependent on the issue; nor to its exterior action, only so far as to preserve the order of an unbroken narrative.\n\u003cbr\u003e \n\u003cbr\u003e Having followed the war down to the battle of Aughrim, inclusive, and reached the limit prescribed, the writer stops short of the final event—the last siege of Limerick; and he does so as well from motive as necessity, for he thinks that event could be more appropriately connected with a history of \"The Brigade.\" But whether the subject is ever resumed by him or not, will greatly depend on the reception of this little volume, which is now submitted to the public.\n\u003cbr\u003e \n\u003cdiv style\u003d\"text-align: right;\"\u003e\n THE AUTHOR.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1776/51772.html","bookId":1109,"creation":"Aug 5, 2019 11:22:30 AM","modification":"Aug 5, 2019 11:22:30 AM"}
