{"id":39880,"no":13,"title":"Chapter XII Ruin","content":"\u0026nbsp;\"Il ne faut regarder dans ses amis que la seule vertu qui nous attache à eux.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If the Baron Giraud was unable in the nature of human affairs to take his wealth with him, it accompanied him, at all events, to the grave, where feathers made a fine show of grief, where priests growled consolatory words, and cherub-faced boys swung themselves and censers nonchalantly along. Some who owed their wealth to Giraud sent their empty carriages to mourn his decease; others, with a singular sense of fitness, despatched wreaths of tin flowers to be laid upon his grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte had been early astir that morning; indeed, I heard him moving before daylight in the room where the coffin was. I was glad when that same morning dawned, for my kind old patron seemed unhinged by these events, and could not keep away from the apartment where the Baron lay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was, of course, no keeping him from the funeral, which ceremony I also attended, and if ever earth was laid to earth it was when we con[131]signed the great financier to his last resting-place. Alphonse Giraud, in his absurd French way, embraced me when the last carriage drove away from the gates of Père la Chaise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And now, mon ami,\" he said, with a sigh of relief, \"let us go and lunch at the club.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He meant no disrespect towards his departed sire. It was merely that his elastic nature could not always be at a tension. His quick bright face was made for smiles, and naturally relaxed to that happy state. He clapped me on the back.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are my best friend,\" he cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And I had, indeed, arranged the funeral for him. Those who had honoured the ceremony with their presence showed much sympathy for Alphonse. They pressed his hand; some of them embraced him. A few—elderly men with daughters—told him that they felt like fathers towards him. All this Alphonse received with a bland innocence which his Parisian education had no doubt taught him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When they were gone, rattling away in their new carriages, he looked after them with a laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And now,\" he said, \"for ruin. I wonder what it will be like—new at all events. And we all live for novelty nowadays. There is the price of a luncheon at the club, however. Come, my friend, let us go there.\"[132]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One change you must, at all events, be prepared for,\" I said, as we stepped into his carriage. \"A change of friends.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alphonse understood and laughed. Cynicism is an arid growth, found to perfection on the pavement, and this little Frenchman wore his boots out thereon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n During luncheon my host recovered his spirits; although, to do him justice, he was melancholy enough when he remembered his recent loss. Once or twice he threw down his knife and fork, and for quite three minutes all food and drink were nauseous to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah!\" he cried, \"that poor old man. It tears the heart to think of him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He sat for a few moments with his chin in the palm of his hand, and then slowly took up again the things of this life, wielding them heartily enough.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder,\" he went on in a reflective voice, \"if I did my duty towards him. It was not difficult, only to make a splash and spend money, and I did that—beautifully!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Coffee and chartreuse,\" he said to the waiter, when we had finished. \"And leave the bottle on the table. You know,\" he added, addressing me, his face beaming with conscious pride, his hand laid impressively on my arm—\"you know this club[133] drinks chartreuse in claret glasses. It is our great distinguishing feature.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n While religiously observing this law we fell to discussing the future.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One cannot,\" observed my companion, philosophically, \"bring on the thunder-storm, however heavy the air may be. One can only gasp and wait. I suppose the crash will come soon enough. But tell me how I stand; I have not had time to think the last few days.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had, indeed, thought only of others.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We have,\" answered I, \"done all that is possible to stop the payment of these cheques; but a clever villain might succeed in realising them one by one in different parts of the world, and thus outwit us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder how it is,\" said my companion, afloat on a side issue like any woman, \"that a fool like myself—an incompetent ass with no brains, eh?—always finds such a friend as you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He leant forward and tapped me on the chest in his impulsive way, as if sounding that part of me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A solid man,\" he added, apparently satisfied with the investigation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not know,\" answered I, truthfully enough; \"unless it be that solid men are fools enough to place themselves in such a position.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How have you placed yourself in such a posi[134]tion? When you have finished that cup of coffee—you have no sugar, by the way—you have but to take your hat and—\u0027Bon jour.\u0027 You leave me still in your debt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With a few quick gestures he illustrated his argument, so that I saw myself—somewhat stiff and British, with my hat upon my head—quit the room, having wished him good day, and leaving him overwhelmed in my debt in a chair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I told your father that I would share the responsibility as regarded the safety of his money,\" I replied. \"It was said only half in earnest, but he took it seriously.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah! the poor, dear man! He always took money matters seriously,\" put in Alphonse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am, at all events, going to try to recover your wealth for you. Besides, I have a singular desire to twist the neck of Monsieur Charles Miste. I ought to have known that the Vicomte was too old to be trusted with the arrangement of affairs such as that. Your father knew it, but thought that I was taking an active part in the matter. I was a fool.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah!\" said Alphonse Giraud. \"We are all fools, mon cher, or knaves.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And long afterwards, remembering the words, I recognised that truth often bubbles to the lips of irresponsible people.[135]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I told him of my plans, which were simple enough, for I had called in the aid of men whose profession it was to deal with scoundrels. It is only until we know vice that we think it complicated or interesting. There is really no man so simple as your thorough scoundrel. A picture all shade is less difficult to comprehend than one where light and shade are mingled. I had only asked to be put on the track of Charles Miste, for evil men, like water, run in one channel and one direction only. I wished to deal with him myself, law or no law. Indeed, there had been a sufficiency of law and lawyers in my affairs already.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I will help you,\" exclaimed Alphonse Giraud, when he had heard, not without interruption, my proposed plan of campaign. \"I will go with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; you cannot do that. You may be sure that Miste has accomplices who will, of course, watch you, and warn him the moment they suspect you of being on the right scent. Whereas I am nobody. Miste does not even know me. I wish I knew him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And I remembered with regret how ignorant I was.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Besides,\" I added, \"you surely have other calls. The Vicomte requires some one near him—the ladies will be glad of your advice and assistance.\"[136]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was scarcely the man to whom I should have applied for either, but one can never tell with women. Some of them look up to us when we know in our hearts that we are no better than asses.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We talked of details which may well be omitted here, for the majority of them were based upon assumptions subsequently to be proved erroneous. It seemed that Alphonse Giraud had almost given up hope of recovering his lost wealth, and as I raised this anew in his breast so his face grew graver. A great hope makes a grave face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must not,\" he said, \"make me believe that, unless you have a good foundation for your own faith.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no!\" I answered, and instinctively changed the subject. His gravity disturbed me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But he returned to his thought again and again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not the money,\" he said at length, when I, who knew what was coming, could no longer hold him. \"It is—\" he paused, his face suddenly red as he looked hard into his coffee-cup. \"It is Lucille.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I made no answer, and it was Alphonse who spoke again, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a hard face you have, mon ami!\" he said. \"I never noticed it before. I pity that poor Miste, you know—if you catch him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The same evening I spoke to my old patron,[137] whom I found in the morning-room, where he sat alone and in meditation. The doors of his own study were still locked, and no one was allowed to enter there. His manner was so feverish and unnatural that I almost abandoned my project of leaving the Rue des Palmiers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah!\" he said, \"what a terrible day—and that poor Alphonse! How did you leave him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I thought of Alphonse as I had left him, smiling under his mourning hat-band, waving a black glove gaily to me in farewell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh,\" I answered, \"Alphonse will soon be himself again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah, my friend,\" exclaimed the Vicomte, after a sorrowful pause. \"The surprises of life are all unpleasant. Pfuit!\" he spread out his hands suddenly as if indicating a quick flight, \"and I lose a friend and four hundred thousand francs in the twinkling of an eye. To think that a mere shock can kill a man as it killed the poor Baron.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He had no neck, and systematically ate too much,\" I said. \"I am now going to see if we cannot repair some of the harm that has been done.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How?\" asked the old man, with all the suspicion that had recently come into his character.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to look for Miste.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very quixotic, but quite useless,\" said he;[138] and then set himself to dissuade me from my quest with every argument that he could bring to bear upon me. Some of these, indeed, I thought he might well have omitted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We cannot spare you at this time, when the political world is so disturbed, and internal affairs are on the brink of catastrophe. We cannot spare you, I, the Vicomtesse—Lucille. It was only last night that she was rejoicing at your presence with us in our time of trouble. I shall tell her that you wish to leave us, and she will, I am sure, dissuade you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Which threat he carried out, as will be recorded later. I was, however, fixed in my determination, and only gave way in so far as to promise to return as soon as possible. These details are recorded thus at length, as they are all links of a chain which pieced itself together later in my life. Such links there are in the story of every human existence, and no incident seems to stand quite alone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After dinner that evening I went to my own study, leaving the Vicomte to join the ladies in the drawing-room without me. So far as I was able I had arranged during the last few days the affairs which had been confidingly placed in my care, and desired to leave books and papers in such a condition that a successor could at once take up the thread of management.[139]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte was so disturbed at the mention of my departure that the topic had been carefully avoided during dinner, though I make no doubt that he knew my purpose in refusing to go to the drawing-room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I was at work in my room—between the two tall candles—when the rustle of a woman\u0027s dress in the open doorway made me look up. Lucille had come into the room—her eyes bright, her cheeks flushed. And I knew, or thought I knew, her thoughts.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father tells me that you are going to leave us,\" she said in her impetuous way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Mademoiselle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have come to ask you not to do so. You may—think what you like.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I did not look at her, but guessed the expression of her determined lips.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you are too proud,\" I said, \"to explain. You think that I, like a schoolboy, am going off in a fit of wounded vanity—pleased to cause a little inconvenience, and thus prove my own importance. You think that it is yourself who sends me away, and your father cannot afford to lose my services at this time. You consider it your duty to suppress your own feelings, and tread under foot your own pride—to serve the Vicomte. Your pride further[140] prompts you to give me permission to think what I like of you. Thank you, Mademoiselle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I was making pretence, in a shallow way no doubt, to study the papers on the table, and Lucille standing before my desk was looking down at my bent head, noting perhaps the grey hairs there. Thus we remained for a minute in silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then turning, she slowly left the room, and I would have given five years of my life to see the expression of her face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2820/78363.html","bookId":1258,"creation":"Aug 5, 2019 11:44:49 AM","modification":"Aug 5, 2019 11:44:49 AM"}
