{"id":39890,"no":23,"title":"Chapter XXII Home","content":"\u0026nbsp;\"Les plus généreux sont toujours ceux qui n\u0027ont rien.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The events in France, stupendous in themselves, seemed to have shaken the nerves of nations. That great sleeping Bear of the North roused itself, and in its clumsy awakening put a heavy paw through the Treaty of Paris. The Americans—our brothers in thought, speech and energetic purpose—raised a great cry against us in that we had allowed the ill-fated Alabama to leave our shores equipped for destruction. There was a spirit of strife and contention in the atmosphere of the world. Friendly nations nursed an imaginary grievance against their neighbours, and those that had one brought it out, as a skeleton from a cupboard, and inspected it in public.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In a school playground the rumour of a fight stirs latent passions, and doubles many a peaceful fist. France and Prussia, grasping each other by the throat, seemed to have caused such an electric disturbance in the atmosphere of Europe, and many[246] Englishmen were for fighting some one—they did not care whom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n During this disturbed spring of 1871, Madame de Clericy and Lucille returned to Hopton, where a warm and pleasant April made them admit that the English climate was not wholly bad. For my own part, it is in the autumn that I like Hopton best, when the old cock pheasants call defiance to each other in the spinneys, and the hedgerows rustle with life.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The ladies were kind enough to make known to me their amended opinion of England when I went down to my home, soon after Easter; and indeed I thought the old place looking wonderfully homelike and beautiful, with the young green about its gray walls and the sense of spring in the breeze that blew across the table-land.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I arrived unexpectedly; for some instinct told me that it would be better to give Isabella no notice of my coming into her neighbourhood. As I rode up the avenue I saw Lucille, herself the incarnation of spring, moving among the flowers. She turned at the sound of the horse\u0027s tread, and changed colour when she recognised me. A flush—I suppose of anger—spread over her face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have come, Mademoiselle,\" I said, \"with good news for you. You may soon return home now, and turn your back forever on Hopton.\"[247]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not so ungrateful as you persist in considering me,\" she said, with vivacity, \"and I like Hopton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The gardener came forward to take my horse, and we walked towards the house together.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am grateful to you, Monsieur Howard,\" said Lucille, in a softer voice than I had yet heard her use towards me—and in truth I knew every tone of it—\"for all that you have done for mother—for us, I mean. You have been a friend in need.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This sudden change of manner was rather bewildering, and I made no doubt that the victim of it was dumb and stupid enough to arouse any woman\u0027s anger. But Lucille was always too quick for me, and by the time I began to understand her humour it changed and left me far behind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where have you been all these months?\" she asked, almost as if the matter interested her. \"And why have you not written?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have been chasing a chimera, Mademoiselle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Which you will never catch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Which I shall never abandon,\" answered I, quite failing to emulate her lightness of tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When we went indoors and found Madame with her lace-work in the morning-room upstairs, with the windows overlooking the sea—the room, by the way, where I now sit and write—Lucille\u0027s manner as abruptly changed again.[248]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother,\" she said, \"here is Monsieur Howard, our benefactor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad, mon ami, that you have come,\" were Madame\u0027s words of welcome. And after the manner of good housewives she then inquired when and where I had last eaten.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I had brought a number of the illustrated journals of the day, and with the aid of these convinced even Lucille that the flight from Paris had not been an unnecessary precaution. Upon the heels of the horror of the long siege had followed the greater disorder of the Commune, when brave men were shot down by the insurgent National Guard, and all Paris was at the mercy of the rabble. Indeed, this Reign of Terror must ever remain a blot on the civilisation of the century and the history of the French people.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was apparent to me that while Madame de Clericy, who was of a more philosophic nature, accepted exile and dependence on myself without great reluctance, Lucille chafed under the knowledge that they were for the moment beholden to me. I had, as a matter of fact, come at Madame\u0027s request, who could make but little of the English newspapers, and thirsted for tidings from Paris. The respectable Paris newspapers had one after the other been seized and stopped by the Commune, while the postal service had itself collapsed.[249]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomtesse also wished for details of her own affairs, and had written to me respecting a sale of some property in order to raise ready money and pay off her debt towards myself. It was with a view of discussing these questions that I had journeyed down to Hopton. So at least I persuaded myself to believe, and knew, at the sight of Lucille among the gnarled old trees, that the self-deception was a thin one. Alphonse had gone to France, being now released from his parole, so I was spared the sight of Lucille and him together.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Madame, however, would not allow me to make my report until we had dined, and we spent the intervening hour in talk of Paris, and the extraordinary events passing there. The ladies, as indeed ladies mostly are, were staunch Royalists, and while evincing but little sympathy for the fallen Buonapartes, learnt with horror of the rise of Anarchy and Republicanism in Paris.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My poor country,\" exclaimed Madame. \"It will be impossible to live in France again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Lucille\u0027s eyes lighted up with anger when I told her of the plots to assassinate the Duc D\u0027Aumale—that brave soldier and worthiest member of his family—merely because he was of the Royal race.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All Europe awaited at this time the fall of the desperate Communards, who held Paris and defied[250] the government of Versailles, while experts vowed that the end could not be far off. It seemed impossible that a rabble under the command of first one and then another adventurer could hold the capital against disciplined troops, and I, like the majority of onlookers, underestimated the possible duration of this second siege. However, my listeners were consoled with the prospect of returning to their beloved France before the summer passed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Madame, as I remember, made a great feast in honour of my coming, and the old butler, who had served my father and still called me Master Dick, with an admonishing shake of the head, brought from the cellar some great vintage of claret which Madame said could not have been bettered from the cave at La Pauline.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Again at dinner I thought there was a change in Lucille, who deferred to me on more than one occasion, and listened to my opinion almost as if it deserved respect. After dinner she offered to sing, which she had rarely done since the last sad days in Paris, and once more I heard those old songs of Provence that melt the heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was when Lucille was tired that Madame asked me to make my report, and I produced the books. I had made a rough account showing Madame\u0027s liability to myself, and can only repeat now the confession made long ago that it was an[251] infamous swindle. Madame had no head for figures, as she had, indeed, a hundred times informed me, and I knew well that she had no money to pay me. I had lived in this lady\u0027s house a paid dependant only in name and treated as an honoured guest. A time of trouble and distress having come to them, what could I do but help such friends to the best of my power, seeking to avoid any hurt to their pride?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I explained the figures to Madame de Clericy, whose bright quick eyes seemed to watch my face rather than the paper as my pen travelled down it. I began to feel conscious, as I often did in her presence, that I was but a clumsy oaf; and, furthermore, suspected that Lucille was watching me over the book she pretended to read.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And this,\" said the Vicomtesse, when I had finished, \"is how we stand towards each other?\"—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Madame.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And I dared not raise my eyes from the books before me. The Vicomtesse rose and moved towards the fireplace, where the logs burned brightly, for the spring evenings are cold on the East Coast, and we are glad enough to burn fires. She held my dishonest account in her hand and quietly dropped it into the fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right, mon ami,\" she said, with a smile. \"What we owe you cannot be set down on paper—but it was kind of you to try.\"[252]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucille had risen to her feet. Her glance flashed from one to the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother,\" she said coldly, \"what have you done? How can we now pay Mr. Howard?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Madame made no reply, reserving her defence—as the lawyers have it—until a fitter occasion. This presented itself later in the evening when mother and daughter were alone. Indeed, the Vicomtesse went to Lucille\u0027s room for the purpose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lucille,\" she said, \"I wish you would trust Mr. Howard as entirely as I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But no one trusts him,\" answered Lucille, and her slipper tapped the floor. \"Alphonse does not believe that he is looking for the money at all. It was for his own ends that he dismissed Mr. Devar, who was so hurt that he has never appeared since. And you do not know how he treated Isabella.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did he treat Isabella?\" asked Madame quietly, and seemed to attach some importance to the question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He—well, he ought to have married her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why?\" asked Madame.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh—it is a long story, and Isabella has only told me parts of it. She dislikes him, and with good cause.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Madame stood with one arm resting on the mantelpiece, the firelight glowing on her black dress. Her clever speculative eyes were fixed on[253] the smouldering logs of driftwood. Lucille was moving about the room, exhibiting by her manner that impatience which the mention of my name seemed ever to arouse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do not be hasty in judging,\" said the elder woman with a tolerance that few possess. \"Isabella may have cause for complaint against him, or she may be suffering from wounded vanity. A woman\u0027s vanity is the rudder that shapes her course through life. If it be injured, the course will be a crooked one. Isabella is a disappointed woman—one sees it in her face. Of the two I prefer to trust Dick Howard, and wish that you could do the same. We know nothing of what may have passed between them, and can therefore form no opinion. One person alone knows, and that is John Turner. He is coming to stay here with Dick in a fortnight. Ask him to judge.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Madame continued thus to plead my cause, while I, no doubt, slept peacefully enough under the same roof, for I have never known what it is to lie awake with my troubles. One damning fact the Vicomtesse could not disguise, namely, that she was for the moment dependent upon me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would rather,\" said Lucille, \"that it had been Alphonse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To which Madame made no reply. She was a wise woman in that she never asked a confidence of[254] her daughter, in whose happiness, I know, the interest of her life was centred. It is a great love that discriminates between curiosity and anxiety.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucille, however, wanted no help in the management of her life or the guidance of her heart, and made this clear to Madame. Indeed, she had of late begun to exercise somewhat of a sway over her mother, and appeared to be the ruling spirit; for youth is a force in itself. For my own part, however, I have always inclined to the belief that it is the quiet member of the family who manages and guides the household from the dim background of social obscurity. And although Madame de Clericy appeared to be mastered by her quick-witted, quick-spoken daughter, it was usually her will and not Lucille\u0027s that gained the victory in the end.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucille defended her absent friend with much spirit, and fought that lady\u0027s battles for her, protesting that Isabella had been ill used, and the victim of an unscrupulous adventurer. She doubtless said hard things of me, which have now been forgotten, for the lady who took my heart so quickly, and never lost her hold of it, was at this time spontaneous in thought and word, and quick to blame or praise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n WHEN MADAME WAS AT HER PRAYERS, A SWIFT, WHITE FORM\n\u003c/div\u003e \n\u003cdiv\u003e\n HURRIED INTO THE ROOM, AND HELD HER FOR A MOMENT IN A QUICK EMBRACE. WHEN MADAME WAS AT HER PRAYERS, A SWIFT, WHITE FORM HURRIED INTO THE ROOM, AND HELD HER FOR A MOMENT IN A QUICK EMBRACE.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mother and daughter parted for the night with a colder kiss than usual, and half an hour later, [255]when Madame was at her prayers, a swift white form hurried into the room, held her for a moment in a quick embrace, and was gone before Madame could rise from her knees.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the following afternoon, some hours after my departure, Isabella came to Hopton; and the dear friends, between whom there had never been a difference, had, as it appeared, a quarrel which sent Isabella home with close-pressed lips, and hurried Lucille to her room, her eyes angry and tearful. But the subject of the disagreement was not myself—nor, indeed, was any definite explanation ever given as to why the two fell out.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2820/78373.html","bookId":1258,"creation":"Aug 5, 2019 11:44:49 AM","modification":"Aug 5, 2019 11:44:49 AM"}
