{"id":93419,"no":21,"title":"Page 21","content":"\u003cp\u003eMadame Rosa took her last bow and left the stage. It had been a good night. The crowd had been with her; the volunteers from the audience had been willing to go along with her. She sensed their skepticism, their unbelief, yet, by the end of the show, she had made believers out of all of them. Of course, with her powers, it was easy to read their minds, to call up incidents from their past, to tell them (in a hushed whisper) the dark secrets they were hiding.\u003c/p\u003e\n\u003cp\u003eShe loved the crowds, the applause. In days gone by, she had been an actress, a singer, a magician. And before that, the confidante of kings, a spy for worried queens.\u003c/p\u003e\n\u003cp\u003eAh, she mused, such good times they had been.\u003c/p\u003e\n\u003cp\u003eShe shivered as she stepped out of the theater and felt a brush of preternatural power sweep over her.\u003c/p\u003e\n\u003cp\u003eKhira!\u003c/p\u003e\n\u003cp\u003eThe area reeked of the older vampire\u0027s malevolent presence.\u003c/p\u003e\n\u003cp\u003eFor a moment, Rosa stood rooted to the spot. It had been years since she felt fear, centuries since she had been in the presence of a vampire whose powers were stronger than her own. What to do, what to do? And then it was too late to do anything.\u003c/p\u003e\n\u003cp\u003eKhira materialized before her. \"Rosa.\"\u003c/p\u003e\n\u003cp\u003eRosa bowed her head slightly. \"Khira. I had heard you were in the city, but I didn\u0027t believe it. What brings you here?\"\u003c/p\u003e\n\u003cp\u003e\"Boredom,\" Khira replied. She smiled, displaying her fangs. \"Such an interesting spectacle you put on this evening.\" Her eyes glinted like blue ice - cold, impenetrable.\u003c/p\u003e\n\u003cp\u003e\"You were there?\" Rosa exclaimed, her eyes widening. \"At my performance?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. How gullible these mortals are.\"\u003c/p\u003e\n\u003cp\u003eRosa smiled in agreement, her mind racing. Khira was not one to visit or make small talk. Why was she here? The answer came with blinding clarity.\u003c/p\u003e\n\u003cp\u003eWith a shake of her head, Rosa took a step backward. \"There\u0027s no need for violence between us. I\u0027ll leave the city tomorrow night.\"\u003c/p\u003e\n\u003cp\u003eKhira smiled. It was a predatory smile - cold, merciless. \"There are too many vampires in this part of the world.\" Her voice was flat, devoid of feeling.\u003c/p\u003e\n\u003cp\u003eRosa stared at the other vampire, and then, dissolving into mist, she fled.\u003c/p\u003e\n\u003cp\u003eThe sound of Khira\u0027s laughter chased her down the street. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-sundown-vampire-trilogy-2/page-21.html","bookId":2297,"creation":"Oct 5, 2019 6:02:06 PM","modification":"Oct 5, 2019 6:02:06 PM"}
