{"id":93427,"no":29,"title":"Page 29","content":"\u003cp\u003eKhira stirred as she felt Grigori\u0027s anger flow over her. Snuggling deeper into the blankets, she smiled into the darkness. You will not find her, she thought. Unless you do as I say, you will never see her again.\u003c/p\u003e\n\u003cp\u003eFeeling pleased and a trifle smug, she closed her eyes and fell back into the thick velvety blackness of the Dark Sleep.\u003c/p\u003e\n\u003cp\u003eRamsey moaned softly, his rest disturbed by the rush of power that flowed over him, painful in its intensity. Beside him, Kelly slept soundly, her body unmoving, barely breathing. In the brief time before the Dark Sleep laid hold on him once more, he wondered again if he had done the right thing in bringing her across.\u003c/p\u003e\n\u003cp\u003eGrigori woke the moment the sun began its descent. He dressed quickly in a pair of jeans and a black sweatshirt, jammed his feet into his boots, put on a pair of sunglasses, and left the house. The sun, though not at its zenith, felt like spiders crawling over his skin as he left the shade of the front porch.\u003c/p\u003e\n\u003cp\u003eMarisa!\u003c/p\u003e\n\u003cp\u003eTry as he might, he could not sense her presence.\u003c/p\u003e\n\u003cp\u003eSwearing softly, he willed himself across town to the mansion that had once belonged to Kyle LaSalle. He wondered if LaSalle had put up a fight or simply moved out at Khira\u0027s whim.\u003c/p\u003e\n\u003cp\u003eShe was waiting for him at the door, a tall, slender figure clad in a gown of flowing crimson silk. Her silver-blond hair shimmered with red in the light of the setting sun.\u003c/p\u003e\n\u003cp\u003e\"Where is she?\"\u003c/p\u003e\n\u003cp\u003e\"Quite safe. For now.\"\u003c/p\u003e\n\u003cp\u003e\"Damn it, Khira, where is she?\"\u003c/p\u003e\n\u003cp\u003eA lazy smile curved her pale pink lips. Taking a step backward, she beckoned him to enter.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have time for this,\" Grigori said curtly.\u003c/p\u003e\n\u003cp\u003e\"On the contrary, you have nothing but time. Come in, mi amour.\"\u003c/p\u003e\n\u003cp\u003eKnowing it was useless to argue with her, Grigori entered the house. A long hallway done in black-and-white tile led to a large square drawing room dominated by a floor-to-ceiling fireplace. The walls and carpet were white. A fire burned in the hearth, adding a note of cheerfulness to the room. Dark furniture. Dark drapes at the windows. A dark painting on the wall depicted a stag in full flight from a pack of wolves. On the mantel, a vase held a single bloodred rose.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here,\" he said. He removed his sunglasses and slipped them into the pocket of his jeans. \"What do you want?\"\u003c/p\u003e\n\u003cp\u003e\"What I have always wanted. You.\"\u003c/p\u003e\n\u003cp\u003eHe almost laughed, and then he realized she wasn\u0027t making a joke. \"Why? Why now, after all this time?\"\u003c/p\u003e\n\u003cp\u003eShe flowed toward him, the red silk of her gown trailing behind her like a river of blood. \"I have missed you, my handsome one. Last night was like old times. Do you not remember the fun we had, in the beginning?\"\u003c/p\u003e\n\u003cp\u003e\"I remember.\"\u003c/p\u003e\n\u003cp\u003e\"I want it again.\" Eyes burning, she ran her finger over his cheek, down his neck, splayed her fingers over his heart \"You owe me your life, Grigori. I wish to share a part of it, for a time.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Khira, what you want is impossible. I love Marisa. She\u0027s my wife.\" He took a deep breath in an effort to calm his anger, his fear. \"Where is she?\"\u003c/p\u003e\n\u003cp\u003e\"As I said, she is well - for now.\"\u003c/p\u003e\n\u003cp\u003e\"This reeks of blackmail. What is it you want of me?\"\u003c/p\u003e\n\u003cp\u003e\"I want a year of your life, Grigori. I want you to come back to Italy with me.\"\u003c/p\u003e\n\u003cp\u003e\"And do what? Be your gigolo?\"\u003c/p\u003e\n\u003cp\u003e\"My companion, mi amour. Only a year. Such a little bit of time. It seems a fair exchange, does it not, for the life of your woman?\"\u003c/p\u003e\n\u003cp\u003e\"And where will Marisa be during this year?\"\u003c/p\u003e\n\u003cp\u003e\"Asleep, I think, like the princess in a fairy tale.\" She laughed softly. \"You can awake her with love\u0027s first kiss when you return.\"\u003c/p\u003e\n\u003cp\u003e\"I want to see her. Now.\"\u003c/p\u003e\n\u003cp\u003e\"Not until we have an agreement.\" She smiled, then moved across the room and sat down on the sofa. Her skirt had a long slit up one side. It parted now to reveal the smooth length of a shapely leg.\u003c/p\u003e\n\u003cp\u003eHe stared at her, his hands clenching and unclenching at his sides. \"I can\u0027t believe you mean this, that you think I\u0027d even consider it.\"\u003c/p\u003e\n\u003cp\u003e\"You can refuse, of course.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t have to ask what the consequences for Marisa would be. Khira was a killer, quick and efficient and without remorse. He took a step toward her. He could kill, too, if need be.\u003c/p\u003e\n\u003cp\u003eHe took another step forward and her power slammed into him, driving the breath from his body. Twin flames burned in her eyes, flowed across the space between them, poured over him like liquid fire. Though she hadn\u0027t moved, he could feel her hand at his throat, slowly choking off his breath.\u003c/p\u003e\n\u003cp\u003e\"All right.\" He forced the word through clenched teeth. \"You made your point.\"\u003c/p\u003e\n\u003cp\u003eShe held him in her grasp another minute, then let him go.\u003c/p\u003e\n\u003cp\u003eHe felt suddenly limp. Had he been alone, he would have dropped to his hands and knees, but he refused to give her the satisfaction.\u003c/p\u003e\n\u003cp\u003e\"You always were stubborn,\" she mused. \"And strong. Though, in time, I think Ramsey will be stronger, even stronger than he is now.\" She gazed into the distance, considering what she had said. \"Perhaps when our year is over, mi cara, I will persuade him to be my companion for a time...\"\u003c/p\u003e\n\u003cp\u003e\"Ramsey can fend for himself. Where is Marisa? I want to see her. Now.\"\u003c/p\u003e\n\u003cp\u003eKhira shook her head. \"You can be quite wearisome at times, did you know that?\"\u003c/p\u003e\n\u003cp\u003e\"Damn it!\"\u003c/p\u003e\n\u003cp\u003eKhira laughed softly. \"Very well, you may see her.\" She stood up. \"Follow me.\"\u003c/p\u003e\n\u003cp\u003eHe paid little attention to the rooms they passed through, save to note that all the windows were covered with heavy black cloth.\u003c/p\u003e\n\u003cp\u003eKhira paused when they reached a narrow door off the kitchen. \"She is down there. You will not be able to awake her.\"\u003c/p\u003e\n\u003cp\u003e\"What have you done?\"\u003c/p\u003e\n\u003cp\u003e\"She is unharmed, only deeply asleep.\"\u003c/p\u003e\n\u003cp\u003eBrushing past Khira, he opened the door. A long flight of stairs led him into what had once been a wine cellar. Dozens of dusty cobwebs festooned the ceiling and corners of the room. He could hear the sound of mice scurrying away, smell the decay of rotting wood.\u003c/p\u003e\n\u003cp\u003eHe sensed a presence in the room. Not Marisa. Though he detected her scent, he had no sense of her being there. Two heartbeats. One very faint. One heavy and dull.\u003c/p\u003e\n\u003cp\u003eHe made his way through the darkness to another door. Taking a deep breath, afraid of what he might see, he opened the door and stepped into the room.\u003c/p\u003e\n\u003cp\u003eIt was small and square. A man, or what had once been a man, sat in a chair in the corner, his eyes vacant, his expression empty. He stood up as Grigori entered the room, but Grigori paid him no mind. His attention was focused on the narrow cot pushed against the far wall, and the woman lying on the cot. Marisa. Her face was pale, her lips slightly parted. Her breathing was slow and shallow. A thick chain made of pure silver shackled her left ankle to the frame of the cot.\u003c/p\u003e\n\u003cp\u003eHe thought briefly of picking her up, cot and all, and making a run for it. But there was only one way out of the cellar, and Khira stood there, waiting. He could hear her breathing, hear the slow, steady beat of her heart.\u003c/p\u003e\n\u003cp\u003eHe crossed the floor. Sitting on the edge of the thin mattress, he drew Marisa into his arms. She was limp, almost lifeless. No dreams played in her mind.\u003c/p\u003e\n\u003cp\u003e\"Marisa.\" He whispered her name. \"Marisa.\"\u003c/p\u003e\n\u003cp\u003eThere was no response. He tried to speak to her mind, but it was closed against him. He held her for a long while, rocking her gently as he would a child, his fingers delving into the silk of her hair, sliding over the curve of her cheek. Marisa. He remembered the night he had first seen her at the carnival. She had asked him if he had come to see the vampire, and he had replied yes, and then asked her if she believed in the undead. She hadn\u0027t believed, not then. Had he stayed out of her life, she would not be here now. Even as the thought crossed his mind, he knew that, had he not followed her home that night, she would have been dead, or worse, at Kristov\u0027s hands months ago. He gazed down at her, a finger tracing the line of her bottom lip. She didn\u0027t stir, barely breathed. She was so young, so innocent still - he could not let Khira take her life. Perhaps it was time to give her up. Perhaps a year without him would give her the time she needed to decide whether or not she had made a mistake in marrying him.\u003c/p\u003e\n\u003cp\u003eLowering his head, he kissed her gently, then laid her back on the cot. If she left him, he would have no reason to go on.\u003c/p\u003e\n\u003cp\u003eA last glance, a last touch, and he left the room.\u003c/p\u003e\n\u003cp\u003eKhira was waiting for him at the top of the stairs. \"Well?\"\u003c/p\u003e\n\u003cp\u003e\"Release her.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t keep her trapped like that for a year!\"\u003c/p\u003e\n\u003cp\u003e\"I can.\" She held up her hand, cutting off his protest. \"But I will release her, Grigori, if you will give me your word of honor that you will come with me to Italy for one year. That you will not contact her during that time; that you will do whatever I wish.\"\u003c/p\u003e\n\u003cp\u003eInteresting, he thought, that she would ask for his word of honor when she had none herself. \"I\u0027ll give you a year, but not in Italy.\"\u003c/p\u003e\n\u003cp\u003e\"And if I insist?\"\u003c/p\u003e\n\u003cp\u003eHe glanced at Marisa. \"Then I will do what you want.\u0027\u0027 He looked up at her and forced a smile. \"But I think you will be better...\" He took a step forward, his fingertips stroking her cheek, sliding down her neck.\u003c/p\u003e\n\u003cp\u003e\"... satisfied, shall we say, if you give in on this one small point.\"\u003c/p\u003e\n\u003cp\u003eShe regarded him for several heartbeats and then nodded. \"Very well. But you are not to contact her in any way. I will know if you do.\"\u003c/p\u003e\n\u003cp\u003e\"Agreed.\"\u003c/p\u003e\n\u003cp\u003e\"I suppose you will want to say good-bye?\"\u003c/p\u003e\n\u003cp\u003e\"I want this night with her.\"\u003c/p\u003e\n\u003cp\u003eShe nodded, a queen granting a boon to a peasant. \"Very well. I shall expect you back here tomorrow at dusk.\" Her eyes grew hard and cold. \"Do not keep me waiting,\" she warned. \"You will not like what happens to her if I have to come after you.\"\u003c/p\u003e\n\u003cp\u003eWith a curt nod, he turned away. He wanted to run down the stairs to Marisa; instead, he forced himself to walk.\u003c/p\u003e\n\u003cp\u003eShe was as he had left her: deeply asleep, pale, barely breathing. He looked at the man. \"Release her.\"\u003c/p\u003e\n\u003cp\u003eThe revenant moved with the jerky movements peculiar to his kind as he reached into his pocket, withdrew a key, and unlocked the shackle from Marisa\u0027s ankle.\u003c/p\u003e\n\u003cp\u003eLifting her into his arms, Grigori carried her up the stairs and into the drawing room. Khira stood in front of a large marble fireplace. She turned as he entered the room.\u003c/p\u003e\n\u003cp\u003e\"Wake her.\"\u003c/p\u003e\n\u003cp\u003e\"That sounds very much like a demand on your part. I don\u0027t like demands.\"\u003c/p\u003e\n\u003cp\u003eHe choked back his anger. \"Khira, I beg of you, please awaken her.\"\u003c/p\u003e\n\u003cp\u003eA rush of power swirled around him. Marisa stirred in his arms, sighed heavily. The color returned to her cheeks.\u003c/p\u003e\n\u003cp\u003e\"She will awake when you reach home.\"\u003c/p\u003e\n\u003cp\u003eWith a nod, Grigori left the mansion. Moments later, he was at home. A look roused a fire in the hearth. Pulling a chair up in front of the fireplace, he sat down with Marisa cradled against his chest.\u003c/p\u003e\n\u003cp\u003eShe yawned, stretched, looked up at him through eyes cloudy with sleep, and then, noticing her surroundings, she sat up.\u003c/p\u003e\n\u003cp\u003e\"What are we doing down here? Why didn\u0027\u0027t you come to bed last night?\" She looked at the window, frowning when she saw that it was dark outside. She glanced down at her clothing, recognizing the jeans and sweatshirt she had put on earlier that day. \"What happened today? What happened to today?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a long story, cara.\"\u003c/p\u003e\n\u003cp\u003eShe looked at him, troubled by his tone, by the somber expression on his face. \"It\u0027s bad, isn\u0027t it? I don\u0027t think I want to hear it, after all.\"\u003c/p\u003e\n\u003cp\u003e\"Marisa, why don\u0027t you go take a bath, and then get something to eat? I have an errand to run, but I won\u0027t be gone long.\"\u003c/p\u003e\n\u003cp\u003eShe wrapped her arms around his neck. \"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"I need to go out.\"\u003c/p\u003e\n\u003cp\u003eHer gaze moved over him.\u0027 \u0027You\u0027ve already fed. Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"All in good time, cara. I won\u0027t be gone long.\"\u003c/p\u003e\n\u003cp\u003eRising, he placed her on her feet. Tipping her head up, he kissed her. She leaned into him, softly yielding, her warmth, her scent, enfolding him. How could he leave her?\u003c/p\u003e\n\u003cp\u003eShe was breathless when he released her. \"I love you,\" she murmured. \"Hurry back.\"\u003c/p\u003e\n\u003cp\u003eIt was Kelly who answered the door. She looked much the same as when he had seen her last, and yet his vampyre eyes saw the changes in her, subtle though they might be. The Dark Gift had worked its magic. Her beauty was subtly enhanced; she moved with the smooth, easy grace so common to his kind.\u003c/p\u003e\n\u003cp\u003e\"I need to see Ramsey,\" Grigori said. \"Now.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s in the living room. Is something wrong?\"\u003c/p\u003e\n\u003cp\u003eHe nodded curtly.\u003c/p\u003e\n\u003cp\u003e\"Come on in,\" she said, and stepped back so he could enter the house. \"Ramsey!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here. You don\u0027t have to shout.\" Ramsey frowned when he saw the rage burning in the other vampire\u0027s eyes. \"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"In a word, Khira. I have agreed to go spend a year with her. In return, she has agreed to let Marisa live.\"\u003c/p\u003e\n\u003cp\u003e\"Are you out of your mind?\" Ramsey asked incredulously. \"She\u0027s already destroyed all the other vampires.\"\u003c/p\u003e\n\u003cp\u003e\"Not all. Rosa had a fledgling. Lisa. She is weak, still new. Khira will destroy her, too, if I don\u0027t do as she says.\"\u003c/p\u003e\n\u003cp\u003eRamsey observed Chiavari through hooded eyes. \"She\u0027s going too far. She\u0027s got to be stopped. And you know it.\"\u003c/p\u003e\n\u003cp\u003e\"Spoken like a true vampyre hunter,\" Chiavari said bitterly. \"I felt her power again today. I fear she is too strong for me. Too strong for you, no matter what happened the other night. It might interest you to know that she may have plans for you after my year is done.\"\u003c/p\u003e\n\u003cp\u003e\"Alexi was strong, too,\" Ramsey said. \"Too strong for either of us. But together we destroyed him.\" He smiled wryly. \"And I was not half the man I am today, thanks to you.\"\u003c/p\u003e\n\u003cp\u003e\"You do not understand! Marisa\u0027s life is at risk!\"\u003c/p\u003e\n\u003cp\u003e\"And you think Khira will keep her word to you?\" Ramsey shook his head. \"You\u0027re not thinking clearly.\"\u003c/p\u003e\n\u003cp\u003eGrigori smiled sadly. \"It is you who are not thinking clearly. I have no choice but to do as Khira says.\"\u003c/p\u003e\n\u003cp\u003e\"Like hell! We could...\"\u003c/p\u003e\n\u003cp\u003e\"She is probably listening to our conversation, even now,\" Grigori interjected quickly.\u003c/p\u003e\n\u003cp\u003eRamsey shrugged. \"Then she would be like the condemned man in his cell, knowing the appointed hour of his doom but unable to do anything about it.\"\u003c/p\u003e\n\u003cp\u003eChiavari looked at Ramsey as if he had never seen him before. \"Being Vampyre has given you a certain arrogance...\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps I always had it,\" Ramsey said. \"It but needed the Dark Gift to bring it out.\"\u003c/p\u003e\n\u003cp\u003e\"This is foolish talk,\" Chiavari insisted. \"I came here to ask a favor of you.\"\u003c/p\u003e\n\u003cp\u003eRamsey laughed. \"What better favor than to destroy your nemesis?\"\u003c/p\u003e\n\u003cp\u003e\"I want you to protect Marisa.\"\u003c/p\u003e\n\u003cp\u003e\"What do you think I\u0027m trying to do, you fool?\" Ramsey swore. \"Marisa will never be safe as long as Khira walks. Don\u0027t you understand that?\"\u003c/p\u003e\n\u003cp\u003e\"You are out of your depth, Ramsey. Just protect Marisa, while I do what I must. I won\u0027t be allowed to contact Marisa, so I\u0027m depending on you to be there if she needs help with anything. Understand?\"\u003c/p\u003e\n\u003cp\u003eRamsey nodded. \"I understand you\u0027re a damn fool. Don\u0027t worry about Marisa. I\u0027ll look after her. But think, Chiavari; think very carefully. Think of Lisa, who will certainly die. Think of...\" He paused. \"Think of Kelly. Not to mention all the innocents that Khira will slaughter. Damn it, use your head! You are letting your affection from years past cloud your thinking. None of us will be safe so long as Khira exists.\"\u003c/p\u003e\n\u003cp\u003eChiavari nodded. \"For once, you are right. I will go with Khira and keep her occupied until we can think of a way to destroy her, together. I am trusting you to protect Marisa until then.\"\u003c/p\u003e\n\u003cp\u003eRamsey nodded, looking pleased.\u003c/p\u003e\n\u003cp\u003e\"Know this, Ramsey. If anything happens to Marisa while I am playing house with Khira, I will give you the death you once came looking for.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/after-sundown-vampire-trilogy-2/page-29.html","bookId":2297,"creation":"Oct 5, 2019 6:02:06 PM","modification":"Oct 5, 2019 6:02:06 PM"}
