{"id":100249,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJeff swatted her pointing finger away. “Uh, my concentrating look.”\u003c/p\u003e\n\u003cp\u003e“No, that’s his ‘oh, we’re fucked’ look.”\u003c/p\u003e\n\u003cp\u003e“Bench, you’re not helping,” Jeff said irritably. He found the passage he was looking for and started to read it.\u003c/p\u003e\n\u003cp\u003e“Lemme see,” Samantha said, lunging for the book.\u003c/p\u003e\n\u003cp\u003eJeff caught her hand and gave her his sternest look. He really, really liked her, but no one messed with his stuff. “Samantha, let me do this. Give me a sec. Okay?”\u003c/p\u003e\n\u003cp\u003eWith a frown, tears still in her eyes, Samantha gave him a curt nod.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Jeff said, then returned his gaze to the elegant scrawl of his deceased father’s handwriting. The sick feeling inside worsened. Rubbing his brow, he glanced toward Samantha. Her green eyes were fearful and she was chewing on her bottom lip nervously. “Okay, there may be a problem.”\u003c/p\u003e\n\u003cp\u003eSamantha fell back against the wall, clutching her stomach, close to hyperventilating. “Tell me.”\u003c/p\u003e\n\u003cp\u003e“Apparently, when a vampire gives a human their blood, it can have a variety of side effects.”\u003c/p\u003e\n\u003cp\u003e“It is her fault!”\u003c/p\u003e\n\u003cp\u003e“Samantha, listen to me!”\u003c/p\u003e\n\u003cp\u003e“Okay, okay. Listening.”\u003c/p\u003e\n\u003cp\u003e“When a vampire gives a human their blood it can imbue the human with vampiric abilities in a greatly diminished capacity. Only if the vampire has some sort of unusual ability. My father documented that the mortal servant of a vampire he encountered could toss balls of fire. The vampire master was a pyromancer. Another vampire hunter reported a mortal servant that could control animals.” Jeff paused, waiting for Samantha to say something. Her eyes had widened to the point that there was white all around her irises. “Sam?”\u003c/p\u003e\n\u003cp\u003eTurning on her heel, she stalked toward the front of the store.\u003c/p\u003e\n\u003cp\u003e“Sam?” Jeff hurried after her, slightly limping much to his consternation.\u003c/p\u003e\n\u003cp\u003eSamantha whipped about, breathing heavily, gripping her cellphone in one hand.\u003c/p\u003e\n\u003cp\u003e“Say something?” Jeff winced.\u003c/p\u003e\n\u003cp\u003e“Sam, you’re kinda scaring us,” Benchley added coming up behind Jeff.\u003c/p\u003e\n\u003cp\u003ePointing at Jeff, Samantha fumed in silence. At last, she let out a cry of frustration.\u003c/p\u003e\n\u003cp\u003e“Samantha, let me look into it further. Maybe it will fade away.” He lightly took her by the shoulders. Her skin felt soft and warm under his touch.\u003c/p\u003e\n\u003cp\u003e“That whore!” Samantha screamed. “Oh, my gawd! She did this to me! As if she hasn’t fucked up my life enough!”\u003c/p\u003e\n\u003cp\u003eJeff gently brushed her hair back from her face and guided her over to a couch to sit down. “Sam, sit down. Your face is so red.”\u003c/p\u003e\n\u003cp\u003e“I’m so fuckin’ pissed off!” Samantha cried out. “I don’t want to see...” she paused “Will they all bug me if they know I can see them? Like in that movie?”\u003c/p\u003e\n\u003cp\u003e“Possibly,” Jeff said.\u003c/p\u003e\n\u003cp\u003e“Probably,” Benchley said at the same time.\u003c/p\u003e\n\u003cp\u003eFlopping back on the couch, Samantha stared at the ceiling, her phone cradled against her breasts. “Fuck. My. Life!”\u003c/p\u003e\n\u003cp\u003e“Let me do some digging, okay, Samantha?” Jeff was worried she was about to blow a blood vessel.\u003c/p\u003e\n\u003cp\u003eWith a soft sob, Samantha threw herself into his arms, her wet face pressed against his neck.\u003c/p\u003e\n\u003cp\u003eRocking her gently, Jeff said softly, meaning every word, “I will help you with this. I promise.”\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eThe sky was a magnificent panorama of purple and pink as the sun set beyond the tall green pine trees enclosing the campground. Pete sat in his old Mustang staring at the big black truck attached to the camper, pensively stroking his black goatee. Glancing down at the card the mysterious stranger had given him earlier in the day, he pondered once again if he was doing the right thing.\u003c/p\u003e\n\u003cp\u003eThe comments from the man named Ethan Logan had made Pete very uneasy. For weeks after he suffered from what the doctor had finally labeled a stroke, he’d experienced difficulty remembering the night he had collapsed in the Dixie Motel. He didn’t even remember why he’d been in the motel room, let alone naked. It was suggested by a few of his friends that Pete had been slipped a drug by a woman in a bar. There had been no drugs in his system and no one had seen him at his regular bar, so that theory was shot. It bothered him that there wasn’t a real explanation for his loss of memory. It had been embarrassing to be questioned by the police. Even more embarrassing that it was evident he had sex with someone he couldn’t even remember. Without being able to recall the event, he wasn’t even sure if a crime had been committed against him.\u003c/p\u003e\n\u003cp\u003eThat whole night had been a blur until he had started to dream. Each time he dreamed, he’d wake with a hearty erection and tears on his face. At first the visions had been hazy with no real discernible details. It was disconcerting to lie alone in his bed sobbing like a baby, but not know why. Then as the weeks turned into months, the dreams began to gradually become clearer. That was when he saw the face of the woman he had loved most of his life emerge out of the murk. He had even started to wake crying out her name.\u003c/p\u003e\n\u003cp\u003eAmaliya.\u003c/p\u003e\n\u003cp\u003eEver since Easter weekend the Vezoraks had all been acting oddly. At first he thought it was because Amaliya had died and her body had not been recovered. But as his dreams continued to gain coherency, he started to wonder.\u003c/p\u003e\n\u003cp\u003eTapping his fingers against the steering wheel, he exhaled sharply. “What the hell am I doing?”\u003c/p\u003e\n\u003cp\u003eMaybe he was being a fool, but he was seriously beginning to wonder if Amaliya was still alive. Maybe Ethan Logan knew more than he was letting on. Pete had mourned her with the rest of her family, but if there was a chance she was out there in hiding, he wanted to find her. Maybe she needed him.\u003c/p\u003e\n\u003cp\u003eSo many maybes.\u003c/p\u003e\n\u003cp\u003e“Pete, you’re a damn fool,” he uttered, shoving his car door open and climbing out. Pocketing the card, he kicked the door shut and sauntered toward the camper.\u003c/p\u003e\n\u003cp\u003eEthan Logan must have been watching him, because the side door of the trailer opened and the tall man stepped out. The cowboy hat and duster was gone, but the man was still imposing. He had strong features and broad shoulders that made Pete believe that Ethan could deliver a crippling punch in a fight.\u003c/p\u003e\n\u003cp\u003eThere was an old grill, a folding table, and a cooler set out on the patio. The coals in the grill were bright red. Ethan’s shirt sleeves were rolled up and his hands appeared damp and freshly washed, so Pete guessed he had arrived at dinner time.\u003c/p\u003e\n\u003cp\u003e“You found me,” Ethan said in a somber voice.\u003c/p\u003e\n\u003cp\u003e“Only camping ground around here. I figured you’d be here or parked at Wal-Mart. You weren’t at Wal-Mart, so...”\u003c/p\u003e\n\u003cp\u003eThe corner of the investigator’s mouth quirked up in one corner. “Not bad detective work.”\u003c/p\u003e\n\u003cp\u003e“Is that what you are? Truly?” Pete asked stepping onto the cement slab the trailer was parked next to.\u003c/p\u003e\n\u003cp\u003e“Sure am,” Ethan said, slightly shrugging.\u003c/p\u003e\n\u003cp\u003e“That a Georgia accent?”\u003c/p\u003e\n\u003cp\u003eEthan gave him an even bigger smile. “Who’s investigating who?”\u003c/p\u003e\n\u003cp\u003e“Plates are Georgia,” Pete confessed.\u003c/p\u003e\n\u003cp\u003eEthan glanced briefly at the license plates on his truck, folding his arms over his chest. “So they are.”\u003c/p\u003e\n\u003cp\u003eThere was an uncomfortable silence between the two men. Pete fidgeted as he listened to the sound of the insects buzzing in the trees. Shoving his hands into his jean pockets, he said, “Do you really think Amaliya is alive?”\u003c/p\u003e\n\u003cp\u003e“Do you?”\u003c/p\u003e\n\u003cp\u003eThe man’s keen brown eyes had a way of Pete feeling like he was somehow guilty of something. They were piercing and intense.\u003c/p\u003e\n\u003cp\u003e“Uh, not sure.”\u003c/p\u003e\n\u003cp\u003e“But you think she might be. That’s why you’re here, right?” Ethan reached inside the camper and dragged out two folding camping chairs.\u003c/p\u003e\n\u003cp\u003ePete shifted on his feet, his gaze darting around the nearly empty campsite. He was vastly uncomfortable, yet he couldn’t say why. “Yeah. That’s why I’m here.”\u003c/p\u003e\n\u003cp\u003e“Have a seat.” Ethan patted the back of one of the chairs he had set up and vanished back into the camper.\u003c/p\u003e\n\u003cp\u003eSlumping into one of the blue cloth chairs, Pete leaned forward, rubbing his hands together anxiously. His dreams felt closer than ever, more vivid, now that he was actually entertaining the thought that maybe they were somehow grounded in reality.\u003c/p\u003e\n\u003cp\u003eEthan reappeared with a plate loaded with slices of onion, a few hotdogs and two hamburger patties. “You hungry?”\u003c/p\u003e\n\u003cp\u003ePete shook his head.\u003c/p\u003e\n\u003cp\u003e“Well, there will be enough if you want some. I’ve had a full day. I’m starving.” Ethan flashed a disarming smile at Pete before placing the food on the grill.\u003c/p\u003e\n\u003cp\u003e“Why do you think she’s alive?” Pete asked.\u003c/p\u003e\n\u003cp\u003eEthan rolled one shoulder. “No corpse.”\u003c/p\u003e\n\u003cp\u003e“That’s it?”\u003c/p\u003e\n\u003cp\u003e“Do I need more?”\u003c/p\u003e\n\u003cp\u003e“So you think she didn’t die?”\u003c/p\u003e\n\u003cp\u003e“I didn’t say that,” Ethan answered.\u003c/p\u003e\n\u003cp\u003e“That don’t make no sense if you think she’s alive.”\u003c/p\u003e\n\u003cp\u003e“There are all types of being alive, Pete.”\u003c/p\u003e\n\u003cp\u003e“You know my name?”\u003c/p\u003e\n\u003cp\u003e“Yep. I did a little research on you.”\u003c/p\u003e\n\u003cp\u003ePete frowned, uncomfortable with the thought of being part of any investigation. He watched Ethan finish laying the food over the hot coals. The smell of cooking meat and the grilling onions filled the air. The investigator flipped open the lid of a cooler set next to the grill and tossed Pete a beer before claiming one for himself. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-when-she-kills-pretty-when-she-dies-2/page-14.html","bookId":2617,"creation":"Oct 5, 2019 6:51:32 PM","modification":"Oct 5, 2019 6:51:32 PM"}
