{"id":100256,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAt the end of the bed stood a young woman with white-blond hair and incandescent white eyes. Dressed in a white lace dress, she glowed in the blackness that surrounded her.\u003c/p\u003e\n\u003cp\u003e“What the hell?” Sergio gasped, his big hand reaching out for his whimpering grandmother.\u003c/p\u003e\n\u003cp\u003eThe girl slightly tilted her chin, her terrifying eyes appearing to gaze at him.\u003c/p\u003e\n\u003cp\u003e“Grandmama,” Sergio hissed. “Wake up! She’s here.”\u003c/p\u003e\n\u003cp\u003eThe bedroom door banged open and the overhead lamp sprang to life. Cynthia stood in the doorway clutching a shotgun. “I heard a big crash!”\u003c/p\u003e\n\u003cp\u003eOne look at the end of the bed informed Sergio that the apparition was gone. Yet, his grandmother remained asleep, clutching her pillow.\u003c/p\u003e\n\u003cp\u003e“I tripped,” Sergio answered. He gripped his grandmother’s hand. It was terrifyingly cold.\u003c/p\u003e\n\u003cp\u003e“It’s freezing in here,” Cynthia exclaimed, her breath a mist.\u003c/p\u003e\n\u003cp\u003e“It was here. I saw the ghost.” His heart was beating so fast in his chest it almost hurt. He bundled his grandmother into his arms, gently shaking her. “Grandmama, wake up. C’mon. Wake up.”\u003c/p\u003e\n\u003cp\u003eCynthia set the shotgun aside, quickly slid onto the edge of the bed, and reached out to touch the older woman. “She’s so cold!”\u003c/p\u003e\n\u003cp\u003e“C’mon, Grandmama. C’mon, wake up.” The old woman lay limp in his arms as he continued to shake her. Her lips were slightly moving, but there was no sound coming from them.\u003c/p\u003e\n\u003cp\u003eWith tender motions, Cynthia rubbed Innocente’s hands and arms, trying to warm them. “Wake up, Innocente. Please wake up.”\u003c/p\u003e\n\u003cp\u003eEyelashes fluttering, Innocente muttered, “Bianca...”\u003c/p\u003e\n\u003cp\u003e“Yes, she was here again. I saw her,” Sergio said.\u003c/p\u003e\n\u003cp\u003e“...she’s...” Innocente struggled to open her eyes. “...she’s what Amaliya is...” The old woman sank back into unconsciousness.\u003c/p\u003e\n\u003cp\u003e“What does she mean?” Cynthia asked, her dark eyes seeking solace in Sergio’s.\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Fearful, Sergio shook the older woman with a little more vigor. “Grandmama, wake up!”\u003c/p\u003e\n\u003cp\u003eInnocente’s eyes gradually opened. “Stop shaking me...”\u003c/p\u003e\n\u003cp\u003e“Then wake up!”\u003c/p\u003e\n\u003cp\u003eHer tiny, veiny hand slapped his arm. “I’m awake...”\u003c/p\u003e\n\u003cp\u003e“Sit her up, Sergio,” Cynthia ordered. She grabbed some decorative pillows from the chair in front of the small vanity where Innocente set them before crawling into bed. In the morning she always made her bed and arranged the colorful pillows against the headboard.\u003c/p\u003e\n\u003cp\u003eSergio helped Innocente sit up as Cynthia propped the embroidered pillows behind her. “Go get her something to drink, honey.”\u003c/p\u003e\n\u003cp\u003eCynthia hurried out of the room.\u003c/p\u003e\n\u003cp\u003e“Grandmama, talk to me.” Sergio shook her again as her amber eyes closed.\u003c/p\u003e\n\u003cp\u003eVisibly forcing her eyes open, Innocente focused on her grandson’s face. “I saw Bianca in my dreams again.”\u003c/p\u003e\n\u003cp\u003e“I saw her standing at the end of your bed.”\u003c/p\u003e\n\u003cp\u003e“Her eyes were white like Amaliya’s when she calls the dead,” Innocente continued.\u003c/p\u003e\n\u003cp\u003e“I saw that.”\u003c/p\u003e\n\u003cp\u003e“She’s what Amaliya is.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand. What do you mean by that?”\u003c/p\u003e\n\u003cp\u003eCynthia returned with a glass of water and Innocente took it gratefully. After several small sips, Innocente nestled back on the pillows. She looked a little more lucid, but also very troubled. “Bianca is like Amaliya. She can call the dead.”\u003c/p\u003e\n\u003cp\u003e“Even though she’s dead?” Sergio asked, confused by her words.\u003c/p\u003e\n\u003cp\u003e“No, no. She’s not dead. I was wrong.” Innocente rubbed her brow. “She’s a vampire, too.”\u003c/p\u003e\n\u003cp\u003eCynthia inhaled sharply as Sergio squinted in confusion.\u003c/p\u003e\n\u003cp\u003e“You’re not making sense. I saw her standing in this room. Vampires can’t get in the house, Grandmama. We had the house blessed by the priest.”\u003c/p\u003e\n\u003cp\u003e“She’s astral projecting,” Innocente explained.\u003c/p\u003e\n\u003cp\u003e“Spirit walking?” Cynthia asked.\u003c/p\u003e\n\u003cp\u003eInnocente nodded. “Yes. She’s somewhere else. Trapped. She’s seeking help because the woman who captured her is very evil and wants to kill Amaliya.”\u003c/p\u003e\n\u003cp\u003e“So this vampire girl can astral project to you? How does she even know about you?” Sergio didn’t like what he was hearing in the least. It sounded wrong to him.\u003c/p\u003e\n\u003cp\u003e“She heard her captor talking about Amaliya and about me. Bianca is stronger than her captor realizes. Since she can communicate with the dead, she was able to finally find her way to me.” Innocente smiled sadly. “The dead do talk to each other.”\u003c/p\u003e\n\u003cp\u003e“We have to call Amaliya and warn her, Sergio.” Sergio hated the way Cynthia’s lips were pale and slightly trembling. She was afraid, but trying to be strong. He was very proud of her.\u003c/p\u003e\n\u003cp\u003eTaking her hand, he gave it a gentle squeeze. “I’ll call her now.”\u003c/p\u003e\n\u003cp\u003e“Please, hurry,” Grandmama urged him.\u003c/p\u003e\n\u003cp\u003eTenderly, Sergio laid the quilt around his wife’s shoulders. It was slowly warming up in the bedroom, but she was shivering. Sergio snatched his phone off the armrest of the chair he had been sitting in and tried to turn it on. To his relief, the loading screen flashed brightly as it booted back up.\u003c/p\u003e\n\u003cp\u003e“Should we have the priest come and bless the house again?” Cynthia wondered aloud.\u003c/p\u003e\n\u003cp\u003e“No, no. She can only come here in spirit. I need her to talk to me, to tell me what this evil woman with the red eyes is planning against my Amaliya,” Innocente answered.\u003c/p\u003e\n\u003cp\u003e“Why is she trying to help Amaliya?” Sergio watched the cellphone screen, waiting for it to finish the startup process.\u003c/p\u003e\n\u003cp\u003e“I think because they were in a class together when they were mortal. Bianca knows that puto killed Amaliya, too.” Innocente rubbed her head again. “I have such a bad headache now. I was trying too hard to hold on to what she told me.”\u003c/p\u003e\n\u003cp\u003eCynthia dug around in the drawer of the bed stand until she came up with a bottle of aspirin. She carefully doled out a few pills and hurried to refresh Innocente’s glass of water. Sergio watched her depart to the kitchen clutching the glass, a sad pang in his heart. He hated seeing his wife stressed and afraid. None of them had asked to be a part of the world of the supernaturals, but they were not the type of people to turn their backs on family. Sergio knew that Innocente would not back down from trying to protect Amaliya.\u003c/p\u003e\n\u003cp\u003eFinally, the phone finished rebooting and Sergio dialed Amaliya’s number. She answered almost immediately.\u003c/p\u003e\n\u003cp\u003e“Bianca came again tonight,” Sergio said.\u003c/p\u003e\n\u003cp\u003e“And?” Amaliya sounded testy, but also anxious.\u003c/p\u003e\n\u003cp\u003e“I’ll let Grandmama tell you.” Sergio handed over the phone and settled on the bed next to his grandmother. In silence, he listened to her explain to Amaliya what she had told him and Cynthia. When she finished, she handed the phone back to Sergio.\u003c/p\u003e\n\u003cp\u003e“What are you going to do, Amal?” Sergio asked.\u003c/p\u003e\n\u003cp\u003eThere was a beat of silence, then Amaliya said, “I don’t know. I have no fucking clue. I have to talk to Cian.”\u003c/p\u003e\n\u003cp\u003e“Keep us in the loop, okay?” Sergio tucked his arm around his grandmother’s shoulders and she leaned her head against him.\u003c/p\u003e\n\u003cp\u003eAmaliya sighed. “I will, but you guys keep safe.”\u003c/p\u003e\n\u003cp\u003e“We’ll do our best.” Sergio clicked off and snuggled his grandmother. “There, we warned her.”\u003c/p\u003e\n\u003cp\u003e“We should go to Austin,” Innocente decided.\u003c/p\u003e\n\u003cp\u003eCynthia returned with a fresh glass of water. Her eyes were red and it was clear she had been crying. “You already helped kill one vampire. Don’t go picking fights with more.”\u003c/p\u003e\n\u003cp\u003eInnocente frowned as she took the glass and swallowed her pills.\u003c/p\u003e\n\u003cp\u003e“Listen to my wife, Grandmama. She’s right. We need to stay out of it. Let Cian and Amaliya deal with it.”\u003c/p\u003e\n\u003cp\u003e“They might need us,” Innocente protested.\u003c/p\u003e\n\u003cp\u003e“If they do, they’ll call,” Sergio assured her.\u003c/p\u003e\n\u003cp\u003eWith an exhausted sigh, Innocente nodded, relenting. Maybe she was more afraid than she was letting on. In all truthfulness, Sergio hoped that they would never get a call from Amaliya asking for them to go to Austin. After what Sergio had seen the last time they had fought the powerful undead, he wasn’t sure he would survive another encounter.\u003c/p\u003e\n\u003cp\u003eAmaliya shoved her cellphone into her pocket before stalking through the apartment seeking Cian. Frustrated and unnerved by all her grandmother had told her, Amaliya was ready to resume her argument with Cian. She heard him moving about on the second floor of their apartment, so she started opening doors. She rarely ventured into the smaller guest bedrooms. They were tastefully decorated, but rarely used. Her grandmother and Sergio had stayed with them only a few times, but otherwise the rooms remained empty. The maid service that came twice a week changed the bedding, dusted, and swept, but Amaliya didn’t really see the need for even that.\u003c/p\u003e\n\u003cp\u003eOpening the fourth door, she found Cian standing in the center of the room. The mattress was off the platform bed and leaning against the far wall. Cian was leaning over the base of the bed, which was basically a big flat box made out of polished wood. A secret panel revealed an array of weapons, some appearing quite ancient, tucked into foam inside. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-when-she-kills-pretty-when-she-dies-2/page-21.html","bookId":2617,"creation":"Oct 5, 2019 6:51:32 PM","modification":"Oct 5, 2019 6:51:32 PM"}
