{"id":100287,"no":52,"title":"Page 52","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Does this sound like a horror movie in the making or what?” Eduardo joked.\u003c/p\u003e\n\u003cp\u003e“Does it ever,” Cass grumbled.\u003c/p\u003e\n\u003cp\u003eBenchley chewed on his thumbnail. “Totally Exorcist material.”\u003c/p\u003e\n\u003cp\u003e“So what happened to the rings, Jeff?” Amaliya\u0027s blue-gray eyes were demanding and a little cold.\u003c/p\u003e\n\u003cp\u003e“Well, they made the wearer go crazy. And realizing what was happening, the Jesuits collected the rings, dividing them up among thirteen devout priests and sent them out all over the world to hide the rings,” Jeff explained.\u003c/p\u003e\n\u003cp\u003e“And somehow the vampires found out about them,” Rachon added.\u003c/p\u003e\n\u003cp\u003e“Yeah. About a hundred years ago they became a hot commodity among the vampires,” Jeff agreed.\u003c/p\u003e\n\u003cp\u003e“About the time that The Summoner was holed up in some Mayan temples in the Yucatán Peninsula,” Cian sighed.\u003c/p\u003e\n\u003cp\u003eRachon looked down at her hands, her face pensive. “That was when he kidnapped Etzli.”\u003c/p\u003e\n\u003cp\u003e“She\u0027s been in on it all along,” Cian agreed.\u003c/p\u003e\n\u003cp\u003eJeff fidgeted in his chair, not sure how to impart the last of his information. “So, uh, well, lots of different hunter groups have been tracking down the individual rings over the years, but no one knew they were all connected. Not until now. The rings all ended up with different names and different legends, but when Cass and Aimee stole the ring from the Master of Dallas and then connected it to The Summoner, it all became clear.”\u003c/p\u003e\n\u003cp\u003e“He wants the rings. All of them,” Amaliya exclaimed, shaking her head.\u003c/p\u003e\n\u003cp\u003eRachon sat back in her chair and tapped her chin with one finger. “The Master of Chicago just went missing a week ago.”\u003c/p\u003e\n\u003cp\u003e“We need to find out if he had a ring.” Cian drummed his fingers on the table. “Have any more gone missing?”\u003c/p\u003e\n\u003cp\u003e“But why now?” Samantha asked. “Why would he make his move now if he knew about the rings a hundred years ago?”\u003c/p\u003e\n\u003cp\u003e“The end of the Mayan calendar,” Benchley said in a low voice.\u003c/p\u003e\n\u003cp\u003e“Oh, shit,” Alexia whimpered, covering her face with her hoodie.\u003c/p\u003e\n\u003cp\u003e“Oh, c\u0027mon. That\u0027s a bunch of bullshit,” Sergio griped.\u003c/p\u003e\n\u003cp\u003eBenchley snorted. “It makes sense! What if that date is significant for another reason? What if it has to do with these rings that used to be a sword?” Benchley stared intently at each person at the table in turn. “Think about it. What if the Mayans figured out that on that date if the sword is used properly, it could bring destruction down on us?”\u003c/p\u003e\n\u003cp\u003e“But why destroy the world? What does The Summoner get out of that?” Amaliya protested. “He seems real intent on living.”\u003c/p\u003e\n\u003cp\u003e“He has always been thwarted by the sun,” Cian spoke up. “Always. From the beginning of his existence as a vampire, he has always been confined to the night. Maybe he wants to eliminate his ultimate enemy. The sun.”\u003c/p\u003e\n\u003cp\u003e“Rip open the veil to the abyss and darkness consumes the earth,” Rachon whispered in a fearful voice.\u003c/p\u003e\n\u003cp\u003e“But he\u0027ll let out all the demons, the monsters of the pit...” Alexia\u0027s voice faded. “Of course, he\u0027d love that.”\u003c/p\u003e\n\u003cp\u003e“So he wants to destroy the world,” Cassandra said, slightly shrugging. “Great.”\u003c/p\u003e\n\u003cp\u003eAimee looked several shades paler and her hand clutched Cassandra\u0027s tightly. “So we stop him.”\u003c/p\u003e\n\u003cp\u003e“But how?” Sergio asked. “We\u0027re just a bunch of...uh...”\u003c/p\u003e\n\u003cp\u003e“Fuck ups? Rejects?” Amaliya offered.\u003c/p\u003e\n\u003cp\u003e“Speak for yourself. I\u0027m pretty awesome,” Eduardo retorted.\u003c/p\u003e\n\u003cp\u003e“Some vampires will help him, you know,” Rachon said grimly.\u003c/p\u003e\n\u003cp\u003e“And you?” Cian stared into her eyes.\u003c/p\u003e\n\u003cp\u003eRachon shook her head. “I love my family. He was right about that. And some members of my family aren\u0027t vampires. I don\u0027t want them to die.”\u003c/p\u003e\n\u003cp\u003e“What about you?” Sergio asked Cian. “Do you want an eternal night?”\u003c/p\u003e\n\u003cp\u003eCian said simply, “No.”\u003c/p\u003e\n\u003cp\u003e“I say we send out what we know to the hunters and get a coalition going. We need to track down these rings and keep them from him,” Cassandra said, thumping the table with her fist.\u003c/p\u003e\n\u003cp\u003e“If we do that he\u0027ll know that we figured it what he\u0027s up to,” Amaliya said, her hands nervously combing through her long hair. “He\u0027ll come for us.”\u003c/p\u003e\n\u003cp\u003e“He\u0027s going to come for you anyway,” Samantha said, resting her hand lightly on Amaliya\u0027s shoulder. “At some point, he\u0027ll come for you, because it\u0027s obvious he tried to make you and Bianca for a reason. Now that he\u0027s in her body, he\u0027s going to be coming for you.”\u003c/p\u003e\n\u003cp\u003eAmaliya looked at Samantha worriedly. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“He must need another necromancer to help him pull off whatever he means to do,” Samantha answered.\u003c/p\u003e\n\u003cp\u003e“She\u0027s right. Why else would he have tried to make you and Bianca?” Jeff closed the book gently and sighed. “It makes perfect sense that he needs you.”\u003c/p\u003e\n\u003cp\u003e“So we have pieces of his puzzle that he will come for,” Cian said.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Jeff answered.\u003c/p\u003e\n\u003cp\u003e“Then we\u0027ll be ready for him,” Cian said firmly.\u003c/p\u003e\n\u003cp\u003e“We create a coalition then.” Rachon’s jaw set with determination. “And we stop him.”\u003c/p\u003e\n\u003cp\u003e“We have no other choice,” Cian agreed.\u003c/p\u003e\n\u003cp\u003e“We fight,” Cassandra said firmly.\u003c/p\u003e\n\u003cp\u003e“Until we die,” Eduardo said with a flash of teeth.\u003c/p\u003e\n\u003cp\u003e“Or win,” Aimee amended.\u003c/p\u003e\n\u003cp\u003e“Like Buffy and the Scoobies,” Samantha said in a perky voice.\u003c/p\u003e\n\u003cp\u003eJeff gave her an amused smile and she grinned at him.\u003c/p\u003e\n\u003cp\u003eTaking Amaliya\u0027s hand, Cian gazed into her eyes. “Nothing will take you from me.”\u003c/p\u003e\n\u003cp\u003ePressing her lips to his fingers, Amaliya nodded. “I won\u0027t let him take me.”\u003c/p\u003e\n\u003cp\u003e“So let\u0027s get to planning...” Jeff said, and ignored his own wildly beating heart.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eAmaliya stared across the treetops toward the sparkling Austin skyline. Safely ensconced in their new home in the Bouldin Creek area south of downtown, Cian and Amaliya were adjusting to their new digs. Amaliya rather liked the modern-style three-story home with its blocky exterior. The flat roof doubled as a deck that allowed her to gaze toward the building that had been her home for a brief, but lovely time.\u003c/p\u003e\n\u003cp\u003eSmoking a cigarette, she glanced down into the dark street below. Eduardo was somewhere down there patrolling. The streets were much quieter and darker than the busy downtown area and she was still adapting to the stillness.\u003c/p\u003e\n\u003cp\u003eVoices drifted up from downstairs. Aimee and Cassandra were doing dishes after their dinner. Amaliya hadn\u0027t been surprised when Cian had taken them in. The couple occupied one of the bedrooms on the second floor. Though the women seemed wary of the vampires at times, things were slowly warming between all of them. Amaliya had been amused to find Cassandra and Cian playing pool in their new game room earlier in the evening. They were both competitive, but their playful jibs had made her smile.\u003c/p\u003e\n\u003cp\u003eShe heard the door open behind her and smelled Cian’s cologne. He had been on the phone for the last hour. Cian had attempted to warn Santos in hopes of recruiting him eventually to their cause, but the vampire master of San Antonio would not listen. Amaliya really didn’t care if Etzli ended up killing the jerk.\u003c/p\u003e\n\u003cp\u003eCian slipped up behind her and wrapped an arm around her waist. She rested against him, relishing his touch. His soft kisses on her cheek made her smile.\u003c/p\u003e\n\u003cp\u003e“You\u0027re always so beautiful in the moonlight,” Cian said, his voice husky in her ear.\u003c/p\u003e\n\u003cp\u003ePutting out her cigarette, Amaliya nuzzled his cheek. “Stop trying to seduce me.”\u003c/p\u003e\n\u003cp\u003eTheir new bedroom didn\u0027t have the retractable walls of their former home, but it did have reinforced doors and heavy metal shutters that covered the wide windows. Amaliya rather enjoyed having an actual bedroom to sleep in, even if her clothes were strewn all over the floor. It was a habit that drove Cian crazy.\u003c/p\u003e\n\u003cp\u003e“I can\u0027t help myself.” Cian kissed her cheek again and then rested his chin on her shoulder. “How are you tonight?”\u003c/p\u003e\n\u003cp\u003eIn the aftermath of her grandmother and Pete\u0027s deaths, Amaliya had fallen into a deep funk. It was hard to fathom how two people who loved her so deeply could die when she remained alive. She still struggled with accepting that reality. Pete\u0027s final words through Samantha still haunted her. His sentiment had been lovely, but he spoke of a dream she could have never shared with him. He had died because he had believed that he could create a life with her. Pete had never known that she wanted to be a vampire and that she loved Cian.\u003c/p\u003e\n\u003cp\u003eThat truth ate at her.\u003c/p\u003e\n\u003cp\u003e“Better,” she said, wondering if it was a lie or not.\u003c/p\u003e\n\u003cp\u003e“Pete did what I would have done.” Cian brushed his lips against her shoulder.\u003c/p\u003e\n\u003cp\u003eAmaliya wondered again if he could actually read her mind. “It doesn’t make it any easier to know he died trying to save me and make me mortal when that’s the last thing I want.”\u003c/p\u003e\n\u003cp\u003e“We choose to do incredibly brave and sometimes stupid things out of love.”\u003c/p\u003e\n\u003cp\u003e“The life he imagined for me never would have happened, even if I hadn\u0027t been changed into a vampire.”\u003c/p\u003e\n\u003cp\u003e“Sometimes, when a man loves a woman, he dreams foolishly.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-when-she-kills-pretty-when-she-dies-2/page-52.html","bookId":2617,"creation":"Oct 5, 2019 6:51:32 PM","modification":"Oct 5, 2019 6:51:32 PM"}
