{"id":66234,"no":16,"title":"Page 16","content":"\u003cp\u003eI tilted back my head and closed my eyes in an effort to remember. Then it came to me. Mark. His name was Mark Lancaster.\u003c/p\u003e\n\u003cp\u003eI set my salad aside, scooping up a kalamata olive and popping it in my mouth. The online telephone listing held dozens of Lancasters, but not a single one with the first name Mark.\u003c/p\u003e\n\u003cp\u003eI had no way of getting in touch with Leanne, unless I contacted the oncology center at the hospital. That, however, I was reluctant to do, perhaps because of all the memories associated with calling that number. Then again, I didn\u0027t have any other option.\u003c/p\u003e\n\u003cp\u003eI decided to make the call before I lost my nerve.\u003c/p\u003e\n\u003cp\u003eThe receptionist answered in a cool professionalsounding voice that I didn\u0027t recognize. I asked to speak to Leanne, giving my name only as Michael, hoping that would alert Leanne to the fact that I\u0027d followed through on our discussion.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t have to wait long. \"This is Leanne,\" she said after picking up.\u003c/p\u003e\n\u003cp\u003eWhile I\u0027d made a point of placing the call quickly, I\u0027d neglected to consider what I wanted to say.\u003c/p\u003e\n\u003cp\u003e\"I...didn\u0027t get your phone number,\" I blurted out. \"Your home number,\" I added.\u003c/p\u003e\n\u003cp\u003e\"Is this Michael Everett?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. If there\u0027s a restriction on personal calls, I apologize.\"\u003c/p\u003e\n\u003cp\u003e\"No...no, it\u0027s fine. I\u0027m taking a late lunch.\"\u003c/p\u003e\n\u003cp\u003eI glanced at the clock and saw that it was past one. I had patients waiting. Any moment now, Linda would be knocking on the door to remind me.\u003c/p\u003e\n\u003cp\u003e\"I thought Saturday went well,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Thanks, but I had lots of help.\"\u003c/p\u003e\n\u003cp\u003eLeanne assumed I was referring to the picnic when I was actually talking about our conversation. I can be oblivious, as Hannah frequently--and often laughingly--used to point out. Leanne had done an impressive job of organizing the volunteers and deserved the credit. I\u0027d completely forgotten.\u003c/p\u003e\n\u003cp\u003e\"We discussed getting together,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yes...\" She sounded almost as hesitant as I did.\u003c/p\u003e\n\u003cp\u003e\"Do you have any particular time in mind?\" I realized as soon as I\u0027d asked what a ridiculous question that was. \"I mean, is one day better than another for you?\" \"Not really. What about you?\"\u003c/p\u003e\n\u003cp\u003e\"Ah...anytime, really. Well, other than work hours, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Me, too.\"\u003c/p\u003e\n\u003cp\u003eLinda knocked at the closed office door. \"I need to go.\" I got to my feet.\u003c/p\u003e\n\u003cp\u003e\"I should, too.\"\u003c/p\u003e\n\u003cp\u003e\"Tonight?\" I said. \"I could do dinner tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Dinner?\"\u003c/p\u003e\n\u003cp\u003e\"So we can talk?\" Feeling like a bumbling fool, I pressed my hand to the top of my head. I wasn\u0027t sure why, other than to keep my head from exploding before I embarrassed myself further.\u003c/p\u003e\n\u003cp\u003e\"I could meet you after work,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Sure. Thanks, Leanne.\" I was about to hang up when she stopped me.\u003c/p\u003e\n\u003cp\u003e\"What time?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. Is seven too late for you?\"\u003c/p\u003e\n\u003cp\u003e\"No, seven\u0027s good. I suppose we should choose a restaurant while we\u0027re at it.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have a preference?\"\u003c/p\u003e\n\u003cp\u003e\"No, do you?\"\u003c/p\u003e\n\u003cp\u003e\"Not really.\" My mind whirled with possible suggestions.\u003c/p\u003e\n\u003cp\u003e\"We could always meet at Ivar\u0027s on the waterfront.\"\u003c/p\u003e\n\u003cp\u003e\"Fine. See you there.\" My office and the hospital were both in downtown Seattle, so we could walk to the waterfront without the bother of moving our cars. The fish-andchip place was a well-known northwest institution and served great food. Dining was casual. We could order at the counter and then sit at one of the picnic-style tables that lined the pier. We wouldn\u0027t have a waiter fussing over us and could come and go as we pleased.\u003c/p\u003e\n\u003cp\u003eLinda knocked a second time, reminding me once again that I had patients waiting. \"I\u0027ll see you at seven,\" I said. I started to hang up when I heard Leanne call my name.\u003c/p\u003e\n\u003cp\u003e\"Yes?\" I said, eager now to get off the line.\u003c/p\u003e\n\u003cp\u003e\"I just wanted to thank you for taking the initiative and contacting me. I wasn\u0027t sure I\u0027d hear from you and...I guess I wanted you to know I\u0027m happy you called.\"\u003c/p\u003e\n\u003cp\u003e\"Oh... Me, too,\" I mumbled.\u003c/p\u003e\n\u003cp\u003eThe rest of the afternoon passed in a flash. I refused to let myself dwell on the awkward conversation with Leanne. We\u0027d make quite the couple, both of us out of practice when it came to establishing a relationship. But friendship would be enough, I told myself. Friendship was all I really wanted for now.\u003c/p\u003e\n\u003cp\u003eMy staff had left the office by five-thirty. Since I generally stayed later to finish up paperwork and read over lab results, I sat in my office and made a genuine attempt to concentrate. Yet all I could think about was my dinner date with Leanne.\u003c/p\u003e\n\u003cp\u003eI\u0027d made a mistake earlier when I\u0027d called and hadn\u0027t figured out what to say. This time I was determined that wouldn\u0027t happen. Retrieving a pad from my desk drawer, I planned to write out a list of topics we might discuss. I thought of this as a cheat sheet--and frankly I needed one.\u003c/p\u003e\n\u003cp\u003eNaturally, we\u0027d talk about Hannah. Well, I\u0027d want to talk about her at any rate and I\u0027d be a willing listener if Leanne chose to enlighten me about her divorce. There\u0027d be any number of medical professionals we both knew, including Patrick, and I wrote down several colleagues\u0027 names.\u003c/p\u003e\n\u003cp\u003eSo far, my list contained three items. It was a start; I hoped Leanne wouldn\u0027t rely on me to carry the conversation. I wasn\u0027t good at that. Winter, Hannah\u0027s cousin, had made our brief meeting relatively painless. I hoped that would be the case with this evening, too.\u003c/p\u003e\n\u003cp\u003eI gave myself fifteen minutes to make the short trek down the hill from Fifth to the waterfront. Summer was fast approaching, and in a few weeks the Seattle waterfront would be crowded with tourists, many of whom come here a day or two in advance of boarding cruise ships that would sail up the Inside Passage to Alaska.\u003c/p\u003e\n\u003cp\u003eHannah and I had always dreamed of taking that cruise. Medical-school bills and the cost of joining an established practice had prohibited such luxuries. After that, our schedules interfered and then Hannah\u0027s illness....\u003c/p\u003e\n\u003cp\u003eI approached the ferry terminal and had to wait while a line of cars disembarked. Ivar\u0027s was just down the street and I saw that Leanne had arrived before me. She noticed me at the same time and waved.\u003c/p\u003e\n\u003cp\u003eI waved back and my stomach tightened. A surge of panic went through me until I felt the wadded-up list in my pocket.\u003c/p\u003e\n\u003cp\u003eOnce the sidewalk was clear, I walked over. \"Thanks for agreeing to meet me,\" I said. Smiling at her, I suddenly realized what an attractive woman she was.\u003c/p\u003e\n\u003cp\u003e\"Thank you for asking me,\" she said.\u003c/p\u003e\n\u003cp\u003eI\u0027d already lost my train of thought. We stood, uncomfortably silent, until Leanne said, \"Should we order?\"\u003c/p\u003e\n\u003cp\u003eI wished now that I\u0027d suggested a restaurant with a bar. A glass of wine would\u0027ve helped us both relax.\u003c/p\u003e\n\u003cp\u003e\"Okay.\" This wasn\u0027t a hopeful beginning. We lined up and I studied the menu, listed on a board above the counter. \"What would you like?\" Thankfully I had the presence of mind to ask.\u003c/p\u003e\n\u003cp\u003e\"I love Ivar\u0027s clam chowder,\" she said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all you want?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have it in a bread bowl.\"\u003c/p\u003e\n\u003cp\u003eThat sounded good to me, too. The thick chowder was ladled into large sourdough buns, which then served as part of the meal. I doubted I\u0027d eat much, considering how unsettled I was. I felt the same way I had the first time I\u0027d asked a girl out on a date. I\u0027d been fifteen.\u003c/p\u003e\n\u003cp\u003eI paid for our order, then carried the tray to the adjacent area where picnic tables were set up. We sat for a moment and neither of us seemed inclined to eat or speak. We did a fairly good job of not looking at each other.\u003c/p\u003e\n\u003cp\u003eLeanne reached for her spoon and I reached for mine. She took her first bite and I did, too. Then she set the plastic spoon down on her paper napkin.\u003c/p\u003e\n\u003cp\u003eShe finally looked at me. \"I suppose you want to know about Mark.\"\u003c/p\u003e\n\u003cp\u003eI met her gaze head-on, unsure why she\u0027d introduced the subject of her husband so soon. At some point in the evening I\u0027d expected her to mention him, but leading off with Mark as the main topic was disconcerting.\u003c/p\u003e\n\u003cp\u003e\"Everyone wants to know,\" she elaborated. \"It\u0027s probably best to get it out of the way.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I said and gestured toward her. \"If that\u0027s what you want.\"\u003c/p\u003e\n\u003cp\u003e\"It isn\u0027t, but it\u0027s only fair to tell you that he\u0027s done his time in prison and...and moved on with his life.\"\u003c/p\u003e\n\u003cp\u003eI nodded, encouraging her to continue.\u003c/p\u003e\n\u003cp\u003eLeanne lowered her eyes. \"As I said, he\u0027s gotten on with his life. I...I guess I should, too.\"\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003e\"Mark\u0027s stealing from the hospital was the worst shock of my life,\" Leanne said. She\u0027d stopped eating. \"I knew something wasn\u0027t right just from the way he behaved after the charity event, but he wouldn\u0027t talk about it. I assumed it had to do with his job, but I wish I\u0027d...asked more questions.\"\u003c/p\u003e\n\u003cp\u003eI understood that better than she realized. \"I\u0027m a physician. Although I couldn\u0027t have\u003c/p\u003e\n\u003cp\u003eknown Hannah had cancer, I feel I should\u0027ve at least suspected she wasn\u0027t well.\" I saw the sympathy in Leanne\u0027s eyes. \"You can\u0027t blame yourself any more than I can take responsibility for what Mark did.\"\u003c/p\u003e\n\u003cp\u003eI knew that; nevertheless I did blame myself. I\u0027d been so wrapped up in my own career, in my own needs and wants, in our shared comforts and routines, it never occurred to me that anything might be wrong with my wife. As a husband and a doctor, I couldn\u0027t help feeling that I\u0027d failed Hannah.\u003c/p\u003e\n\u003cp\u003eConsequently I\u0027d failed myself, too. I wasn\u0027t sure I could ever get over the guilt of that, irrational though it undoubtedly was. Hannah would be the first to reassure me. Again and again she\u0027d reminded me that ovarian cancer is difficult to detect and there are few, if any, symptoms. There was no reason--no unusual fatigue, no pain or nausea, no family history, nothing--to suggest she might have this disease.\u003c/p\u003e\n\u003cp\u003e\"You must\u0027ve been surprised when Mark was arrested,\" I said, preferring not to discuss Hannah, even though I\u0027d assumed we would.\u003c/p\u003e\n\u003cp\u003e\"I was speechless.\" Leanne shook her head. \"His parents, too. I think what confused me the most was the fact that Mark\u0027s one of the most honorable people I know. He has...had more integrity than any other man I\u0027d met.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re still in love with him?\" I asked, although the answer was obvious.\u003c/p\u003e\n\u003cp\u003eReluctantly, Leanne nodded. \"Although I don\u0027t really want to be... As you can imagine, I was outraged and embarrassed. Mark refused to explain himself, so I felt I had no option other than to file for divorce. I...I wish I\u0027d waited--knowing what I do now.\" She paused, closing her eyes. \"Still, after recent...revelations, perhaps I made the right decision, after all.\"\u003c/p\u003e\n\u003cp\u003e\"Was Mark involved with someone else?\" It was a painful question and I could see from the way she flinched that I\u0027d touched the emotional equivalent of a bruise.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m positive he wasn\u0027t. Mark might\u0027ve been able to deceive me when it came to embezzlement, but not...our marriage.\" She sent me an agonized look.\u003c/p\u003e\n\u003cp\u003eI leaned over to lightly clasp her hand, releasing it after a few seconds.\u003c/p\u003e\n\u003cp\u003e\"In my heart of hearts I have to believe he was faithful during our marriage...but I don\u0027t know about now. He might be seeing someone else, although I don\u0027t really think so. If he was dating again, I\u0027m sure his mother would\u0027ve told me. We\u0027re still in touch.\"\u003c/p\u003e\n\u003cp\u003e\"Did Mark want the divorce?\" To me, it didn\u0027t make sense that he\u0027d throw away his marriage, along with his freedom and his career.\u003c/p\u003e\n\u003cp\u003e\"Apparently. He certainly didn\u0027t resist when I told him that was what I wanted. He signed the final papers without a second\u0027s hesitation.\"\u003c/p\u003e\n\u003cp\u003eThat must\u0027ve been devastating to Leanne. \"He probably didn\u0027t want you involved in his legal troubles,\" I offered as a possible explanation. \u003c/p\u003e","sourceLink":"https://allnovel.net/hannah-s-list-blossom-street-7/page-16.html","bookId":1939,"creation":"Oct 5, 2019 10:00:23 AM","modification":"Oct 5, 2019 10:00:23 AM"}
