{"id":66221,"no":3,"title":"Page 3","content":"\u003cp\u003eI liked Winter, but I wasn\u0027t interested. Despite Hannah\u0027s confidence in her cousin as a potential wife, I had no intention of remarrying. Besides, all Winter and I had in common was our memories of Hannah.\u003c/p\u003e\n\u003cp\u003eThe second woman I want you to consider is Leanne Lancaster. The name was somewhat familiar, but I couldn\u0027t immediately figure out why. She wasn\u0027t a friend of Hannah\u0027s that I could remember.\u003c/p\u003e\n\u003cp\u003eLeanne was my oncology nurse. She was always kind to me and so caring. As a nurse she\u0027d have a special understanding of the stresses you face as a physician. Leanne and I talked quite a bit and if I\u0027d...if I\u0027d had the chance, I feel Leanne and I would\u0027ve become good friends. I admire her emotional strength. She\u0027s divorced and had a rough time of it. I don\u0027t know her as well as I do Winter, but my heart tells me she\u0027d suit you. Meet with her, Michael, get to know her. That\u0027s all I ask. Meet with Leanne...get to know her. I doubt Hannah had an inkling of what she was really asking. I had no interest whatsoever in seeking out this woman. As I thought about it, I realized I did remember the oncology nurse. And Hannah was right. Leanne was a kind and caring person--but that didn\u0027t mean I had any desire to know her better!\u003c/p\u003e\n\u003cp\u003eThe third person on my list is Macy Roth. I don\u0027t think you\u0027ve met her. She\u0027s a part-time model I became friends with while I was still able to work. We met because of some fashion shows I was involved in and some catalog work she did for the store. When Macy learned I was in the hospital she sent me notes of encouragement--cards she made herself with adorable sketches of her cats. Remember? And she knit me socks and a shawl I wore during my chemo. She\u0027s funny and clever and multitalented; she models and paints murals and has two or three other jobs. As I was thinking over this list, her name came to me because I know she\u0027ll make you smile. She\u0027ll bring balance to your life, Michael. I\u0027m afraid that when I\u0027m gone, you\u0027ll become far too serious. I want you to laugh and enjoy life. The same unrestrained way Macy does. Once again, Hannah was right; I hadn\u0027t laughed much in the past two years. The fact is, I couldn\u0027t remember the last good belly laugh I\u0027d had. Life\u003c/p\u003e\n\u003cp\u003ewas serious. I\u0027d lost my wife and, frankly, I didn\u0027t have much reason to smile, let alone laugh. I didn\u0027t remember this Macy, although no doubt she\u0027d featured in some of Hannah\u0027s stories. As for those gifts-- the sketches and socks--they\u0027d be among Hannah\u0027s things, the stuff I\u0027d brought home from the hospital. I\u0027d thrown everything into a box and shoved it in the back of a closet. And I\u0027d never looked at it again.\u003c/p\u003e\n\u003cp\u003eI\u0027ve given you three names, Michael. Each is someone I know and trust. Any of them would make you a good wife and companion; with any one you could have the children you were meant to father.\u003c/p\u003e\n\u003cp\u003eI\u0027ll be watching and waiting from heaven\u0027s gate, looking down at you. Choose well.\u003c/p\u003e\n\u003cp\u003eYour loving wife,\u003c/p\u003e\n\u003cp\u003eHannah I folded the sheets and set them on the coffee table while I tried to absorb what I\u0027d read. That Hannah had written this letter when she did was shocking enough. Then for her to suggest I remarry--and go so far as to name three women--was almost more than I could take in.\u003c/p\u003e\n\u003cp\u003eIf she was watching over me, then she had to know what hell this first year without her had been.\u003c/p\u003e\n\u003cp\u003eI\u0027m not much of a drinking man. A few beers with the guys at a sporting event is generally my limit. All at once I felt a need for something stronger.\u003c/p\u003e\n\u003cp\u003eI remembered a bottle of Scotch stashed in a cupboard somewhere in the kitchen. My father gave it to me when I graduated, claiming it was for \"medicinal\" purposes. If ever there was an occasion for a medicinal drink, it was now.\u003c/p\u003e\n\u003cp\u003eI spent nearly fifteen minutes searching for it. Hannah had stored it in the pantry, the last place I thought to look. Not surprisingly, it turned out to be single malt, since that was what my father drank. His favorite brand, too-- The Glenlivet.\u003c/p\u003e\n\u003cp\u003eReading the label, I saw that it had been aged eighteen years and I\u0027d had it for at least a decade. None of that tenyear stuff for dear ol\u0027 Dad.\u003c/p\u003e\n\u003cp\u003eI got a clean glass out of the dishwasher, added ice cubes and poured two fingers of my twenty-eight-yearold Scotch before I settled back down on the sofa. Kicking off my shoes, I rested my feet on the coffee table and reached for Hannah\u0027s letter. I would read it again with an open mind and see if I could possibly respond to her last request. I didn\u0027t think so. Hannah was all the woman I\u0027d ever need. The only woman I\u0027d ever love. I already knew I\u0027d find anyone else sadly lacking--even the three women my wife had so carefully selected for me.\u003c/p\u003e\n\u003cp\u003eChapter Three\u003c/p\u003e\n\u003cp\u003eW\u003c/p\u003e\n\u003cp\u003eednesday morning I was at the gym by six. Ritchie was on the treadmill, his iPod plugged into his ears, when I stepped onto the machine beside his. He looked over, saw it was me and stared expectantly. I knew I was in for an inquisition as soon as we entered the locker room. I hadn\u0027t shown up on Monday morning and ignored his phone calls for the past two days. I wasn\u0027t ready to talk about Hannah\u0027s letter, not even to my best friend.\u003c/p\u003e\n\u003cp\u003eRitchie finished his routine first. Just as I\u0027d suspected, he was waiting for me in the locker room, sitting on the bench with a towel draped around his neck. He leaned forward, elbows braced on his knees. When I appeared, he glanced up.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t return my phone calls,\" he said, as if I needed to be reminded.\u003c/p\u003e\n\u003cp\u003e\"I was busy.\"\u003c/p\u003e\n\u003cp\u003e\"Doing what?\"\u003c/p\u003e\n\u003cp\u003eI was reluctant to tell him, although I knew that he of all people would understand. \"I got drunk on Sunday after I got home,\" I admitted. The hangover on Monday had been a killer. From this point forward I was sticking to beer. Maybe my father could handle the strong stuff, but not me.\u003c/p\u003e\n\u003cp\u003e\"Because of Hannah\u0027s letter?\"\u003c/p\u003e\n\u003cp\u003eI nodded and lowered myself onto the bench. I leaned forward, sitting in the same position as my brother-in-law. \"Hannah wants me to remarry.\"\u003c/p\u003e\n\u003cp\u003eRitchie\u0027s eyes widened. \"Get outta here.\"\u003c/p\u003e\n\u003cp\u003eMy sentiments exactly. \"She went so far as to give me a list.\"\u003c/p\u003e\n\u003cp\u003eRitchie\u0027s mouth sagged open. \"A list? You mean of women?\"\u003c/p\u003e\n\u003cp\u003eI nodded again.\u003c/p\u003e\n\u003cp\u003e\"Why would she do that?\"\u003c/p\u003e\n\u003cp\u003eExplaining Hannah\u0027s reason was beyond me. I didn\u0027t understand it, although I\u0027d read the letter a dozen times.\u003c/p\u003e\n\u003cp\u003e\"Hannah seems to think I won\u0027t do well on my own and that I need a wife.\" I avoided mentioning that she wanted me to be a father, too.\u003c/p\u003e\n\u003cp\u003e\"She actually gave you a list?\" He seemed as shocked as I\u0027d been when I first read the letter.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t respond.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s on it? Anyone I know?\"\u003c/p\u003e\n\u003cp\u003eI looked away. \"Your cousin, Winter.\"\u003c/p\u003e\n\u003cp\u003e\"My cousin?\" he repeated.\u003c/p\u003e\n\u003cp\u003e\"Do you know someone else named Winter?\" I snapped, sorry now that I\u0027d said anything.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said sheepishly. \"Who else?\"\u003c/p\u003e\n\u003cp\u003e\"Leanne Lancaster. She was Hannah\u0027s oncology nurse.\" \"Don\u0027t remember her. What\u0027s she like?\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t sure what to tell him. \"Quiet. Gentle. A good nurse. Hannah really liked her.\"\u003c/p\u003e\n\u003cp\u003e\"No kidding.\"\u003c/p\u003e\n\u003cp\u003eI ignored that.\u003c/p\u003e\n\u003cp\u003e\"Anyone else?\"\u003c/p\u003e\n\u003cp\u003e\"Someone I\u0027ve never met. A model she worked with by the name of Macy Roth.\"\u003c/p\u003e\n\u003cp\u003eRitchie released a low whistle. \"A model, you say?\"\u003c/p\u003e\n\u003cp\u003e\"Hannah says Macy will give me a reason to laugh again,\" I told him, unable to disguise my sarcasm. \"And that\u0027s practically a quote.\"\u003c/p\u003e\n\u003cp\u003eMy brother-in-law chuckled. \"I bet Steph wouldn\u0027t tell me to marry a model if anything happened to her.\"\u003c/p\u003e\n\u003cp\u003eI knew Ritchie was joking; still, I couldn\u0027t let the comment pass. \"Just pray to God nothing does.\"\u003c/p\u003e\n\u003cp\u003eMy brother-in-law frowned. \"It was a joke, Michael. Lighten up, would you?\"\u003c/p\u003e\n\u003cp\u003eHe was right; I didn\u0027t need to take every little comment so seriously. \"Sorry,\" I muttered.\u003c/p\u003e\n\u003cp\u003eRitchie nudged me. \"You going to do it?\"\u003c/p\u003e\n\u003cp\u003eI shook my head. \"I doubt it.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003eThe answer should\u0027ve been obvious. \"I\u0027m not ready.\"\u003c/p\u003e\n\u003cp\u003e\"Will you ever be?\"\u003c/p\u003e\n\u003cp\u003eGood question. \"Probably not,\" I said honestly. I\u0027d lost my wife, my soul mate. I couldn\u0027t ever forget that or blithely \"move on\" with my life, as various friends and acquaintances were so fond of telling me I should.\u003c/p\u003e\n\u003cp\u003e\"I thought you\u0027d say that,\" Ritchie said. \"Hannah knew you\u0027d hibernate for the rest of your life, which is why she forced the issue. My sister loved you and--\"\u003c/p\u003e\n\u003cp\u003e\"Listen, Ritchie, I don\u0027t need a lecture.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t intend to give you one. Answer one simple question and then I\u0027ll shut up.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, fine. Ask away,\" I said, resigned to the fact that he wouldn\u0027t leave me alone until he\u0027d said what he wanted to say.\u003c/p\u003e\n\u003cp\u003eHe stared at me for a long intense moment. \"Do you suppose it was easy for her to write that letter?\"\u003c/p\u003e\n\u003cp\u003eI sat up straighter.\u003c/p\u003e\n\u003cp\u003e\"What woman wants to think of her husband with someone else?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s two questions,\" I said.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re one and the same,\" he argued.\u003c/p\u003e\n\u003cp\u003eI closed my eyes. Insensitive jerk that I was, I hadn\u0027t given a single thought to what Hannah must\u0027ve been feeling when she wrote the letter.\u003c/p\u003e\n\u003cp\u003e\"If the situation had been reversed, could you have offered up the names of men you\u0027d trust to be her husband?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t need any time to think about that one. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"Me, neither,\" Ritchie confessed. \"That said, the least you can do is take her letter to heart and get in touch with these women.\" He chuckled. \"If it was me, I\u0027d start with the model.\"\u003c/p\u003e\n\u003cp\u003eVery funny. It\u0027d been years since I\u0027d asked a woman out. I wouldn\u0027t even know how to go about it. \"Dating...me?\"\u003c/p\u003e\n\u003cp\u003e\"Dating--you. Sure, why not? You\u0027re young and you\u0027ve got a lot of years left.\"\u003c/p\u003e\n\u003cp\u003eHannah had said almost the same thing.\u003c/p\u003e\n\u003cp\u003e\"You already know Winter. If you\u0027re more comfortable with her, then give her a call.\"\u003c/p\u003e\n\u003cp\u003e\"And say what?\" I asked. My fear was that the only subject we had in common was Hannah. If we went to dinner, Hannah was all we\u0027d have to discuss, and we\u0027d both be crying in our soup before the main course was served.\u003c/p\u003e\n\u003cp\u003e\"Hell, I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d want to talk about Hannah.\"\u003c/p\u003e\n\u003cp\u003eRitchie didn\u0027t seem to think that was so terrible. \"So would Winter. They were good friends, even as kids, trading clothes, spending the night at each other\u0027s houses.\" He smiled. \"Once when we were all in our early teens, our two families went camping. The restroom was clear on the other side of the campground.\u003c/p\u003e\n\u003cp\u003e\"In the middle of the night, I could hear Hannah and Winter whispering that they had to go to the bathroom really bad.\" Ritchie\u0027s eyes gleamed with a look of remembered mischief. \"Neither of them wanted to make the long trek across the campground so they decided to walk into the woods close to our campsite.\"\u003c/p\u003e\n\u003cp\u003eI knew what was coming.\u003c/p\u003e\n\u003cp\u003e\"I waited until they had their drawers down, then turned my flashlight on them.\"\u003c/p\u003e\n\u003cp\u003eI grinned. Ritchie had always been a practical joker.\u003c/p\u003e\n\u003cp\u003e\"You wouldn\u0027t believe how loud they screamed,\" he said, laughing. \"I swear they woke up half the campground. People thought there was a black bear on the loose. Those two girls single-handedly caused a panic.\"\u003c/p\u003e\n\u003cp\u003eYears earlier, when we were first dating, Hannah had told me the story. I had to admit it was funny. But the most I could manage now was a weak smile. Maybe she had a point; maybe it was time I found a reason to laugh again.\u003c/p\u003e\n\u003cp\u003e\"Call Winter,\" Ritchie urged.\u003c/p\u003e\n\u003cp\u003eHe made it sound easy, but it wouldn\u0027t be. I had no idea what to say, how to approach her. \"Do you see her often?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/hannah-s-list-blossom-street-7/page-3.html","bookId":1939,"creation":"Oct 5, 2019 10:00:23 AM","modification":"Oct 5, 2019 10:00:23 AM"}
