{"id":66249,"no":31,"title":"Page 31","content":"\u003cp\u003eLinda was right; I hadn\u0027t noticed.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s like watching you with the kids. They take to Macy immediately.\"\u003c/p\u003e\n\u003cp\u003eThat made sense now that she\u0027d mentioned it. As I\u0027d observed before, Macy was like a child in her whimsies and enthusiasms. \"What does she talk to them about?\"\u003c/p\u003e\n\u003cp\u003e\"All sorts of things. With the Branson boy, she showed him the lion hiding in the grass, and with the Farinelli girl she chatted about hair clips. She and Ellen Roche discussed dogs at great length. The children relax and laugh, and it makes their visits here less stressful. I haven\u0027t figured Macy out, but I like her.\"\u003c/p\u003e\n\u003cp\u003eI liked her, too, and it was starting to concern me.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s funny. And generous.\" Apparently, Linda wasn\u0027t finished singing Macy\u0027s praises. \"The other morning she brought in homemade granola bars for everyone. Did you try one?\" When I shook my head, she went on. \"Too bad. Anyway, Macy said the recipe began as a treat for her bird feeder and she just kept throwing stuff in. It tasted so good, she turned it into granola bars and bought birdseed for the feeder.\"\u003c/p\u003e\n\u003cp\u003eI grinned, although I was determined not to let Linda-- or anyone else--know what was happening between Macy and me. Not that anything was happening. But I\u0027d actually kissed a woman I professed to dislike. To complicate the situation, I hadn\u0027t stopped thinking about that kiss. Correction, I couldn\u0027t stop thinking about it. An even bigger mystery was the fact that it had felt so...I\u0027ll admit it-- kissing Macy felt right. Everything about the two of us together was so wrong, it simply hadn\u0027t occurred to me that I\u0027d enjoy holding her in my arms. Kissing her...\u003c/p\u003e\n\u003cp\u003eThe rest of the day I felt a sense of expectation. No one needed to spell out what caused this feeling. I was waiting for Macy, and that just plain annoyed me.\u003c/p\u003e\n\u003cp\u003eShe never did show up.\u003c/p\u003e\n\u003cp\u003eFriday morning I arrived at the gym in a bad mood. It didn\u0027t take Ritchie long to comment.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s with you, man?\"\u003c/p\u003e\n\u003cp\u003eI mumbled something noncommittal about lack of sleep, which was true enough. I did my regular three-mile jog on the treadmill, speeding up the pace so I finished a minute earlier than usual.\u003c/p\u003e\n\u003cp\u003eI was in the shower by the time Ritchie appeared in the change room. He made some remark I didn\u0027t catch and I ignored him. To my surprise he was smiling when we met at the lockers. I\u0027d assumed he\u0027d give me a wide berth, which was what I wanted. Instead, he was chortling away, acting as if he knew something I didn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve seen that look before,\" Ritchie said.\u003c/p\u003e\n\u003cp\u003e\"What look?\" I asked, letting my impatience show.\u003c/p\u003e\n\u003cp\u003e\"The one you\u0027re wearing. You\u0027ve got a woman on your mind, and I\u0027ll bet I know who it is.\"\u003c/p\u003e\n\u003cp\u003eI could see there was no use trying to keep this to myself, so I blurted it out. \"I kissed Macy.\"\u003c/p\u003e\n\u003cp\u003eMy brother-in-law hooted. \"I knew it.\" He aimed his index finger at me. \"Didn\u0027t I say so? Didn\u0027t I tell you that you\u0027ve got a thing for her? Would you admit it? Oh, no, not you. Not the great Dr. E.\"\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t even met her,\" I reminded him.\u003c/p\u003e\n\u003cp\u003e\"True.\"\u003c/p\u003e\n\u003cp\u003e\"Then how can you claim you\u0027ve known all along that I have this so-called thing for her?\"\u003c/p\u003e\n\u003cp\u003e\"Easy,\" Ritchie said, opening his locker door and turning his back to me. \"You talk about her constantly.\"\u003c/p\u003e\n\u003cp\u003e\"Because she irritates me.\"\u003c/p\u003e\n\u003cp\u003eRitchie threw me a knowing look over his shoulder. \"Irritates you enough to kiss her.\"\u003c/p\u003e\n\u003cp\u003eTrue. But I\u0027d rather not discuss it anymore.\u003c/p\u003e\n\u003cp\u003e\"So, you kissed her,\" Ritchie went on. \"Why is that such a big deal?\"\u003c/p\u003e\n\u003cp\u003e\"This was a real kiss,\" I muttered. \"Not a friendly little peck on the cheek.\"\u003c/p\u003e\n\u003cp\u003e\"In other words, you sucked face.\"\u003c/p\u003e\n\u003cp\u003eI cast him a pained look. \"How old are you? Fourteen?\"\u003c/p\u003e\n\u003cp\u003eRitchie shrugged off my censure. \"Why are you so shaken up? You kissed her. You\u0027ve kissed other women since Hannah died. Right?\"\u003c/p\u003e\n\u003cp\u003eI sat down on the bench and leaned forward, resting my elbows on my knees. \"Those weren\u0027t real kisses. That kiss with Macy was hot.\" I paused for a moment, trying to explain. \"I always thought I\u0027d feel guilty if I ever kissed another woman. Really kissed her, I mean.\"\u003c/p\u003e\n\u003cp\u003e\"And you didn\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"No, and that bothers me.\" There was a whole lot that bothered me about that kiss. The fact that I wasn\u0027t consumed by guilt was merely the first of a long list.\u003c/p\u003e\n\u003cp\u003e\"You want to feel guilty?\" Ritchie demanded. \"Do you think Hannah\u0027s looking down on you in disapproval? Is that it?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" I shook my head for emphasis. \"I don\u0027t know what I feel.\" That was a big part of the problem. What I\u0027d expected to feel was regret and it hadn\u0027t happened.\u003c/p\u003e\n\u003cp\u003e\"I guessed all along that Macy was the one,\" he crowed again.\u003c/p\u003e\n\u003cp\u003e\"She isn\u0027t.\" I stood and reached for my jacket. I was sorry I\u0027d said anything because Ritchie just wouldn\u0027t drop it.\u003c/p\u003e\n\u003cp\u003e\"You enjoyed kissing her, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eI could feel it coming. I decided then and there not to answer.\u003c/p\u003e\n\u003cp\u003e\"Kissing her has you all twisted up inside and now you\u0027re confused.\"\u003c/p\u003e\n\u003cp\u003eHe got that right. I was more than confused, I was completely bewildered by what had taken place between Macy and me. \"I\u0027m not even sure I like her,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Oh, you like her,\" Ritchie insisted in that annoying way of his.\u003c/p\u003e\n\u003cp\u003eI refuse to believe I\u0027m that easily read. Ritchie\u0027s my closest friend, but there are times he can be a real pain in the butt.\u003c/p\u003e\n\u003cp\u003e\"Do you have plans for tonight?\" Ritchie asked as we left the gym.\u003c/p\u003e\n\u003cp\u003eToday was Friday, when I used to volunteer at the free medical clinic until the incident with Shamika and her abuser. A replacement had been found and in some ways that was probably best.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to call Leanne,\" I said, and instantly felt relieved at having made a decision. No, at having made that decision. We were supposed to talk about seeing a movie this weekend, anyway.\u003c/p\u003e\n\u003cp\u003eRitchie scratched his chin. \"Leanne?\" he repeated. \"Not Macy.\"\u003c/p\u003e\n\u003cp\u003e\"Definitely not Macy.\" I needed time to clear my head and half hoped she wouldn\u0027t be at the office today, either.\u003c/p\u003e\n\u003cp\u003eUncharacteristically, Ritchie refrained from launching into another series of questions and comments.\u003c/p\u003e\n\u003cp\u003e\"See you Monday,\" he said once we were outside. He began walking toward his office.\u003c/p\u003e\n\u003cp\u003e\"Catch up with you then.\" I took off in the opposite direction.\u003c/p\u003e\n\u003cp\u003eI hoofed it the few blocks to my office building and glared at Larry the security guard as I went in. I wanted him to know I didn\u0027t appreciate the fact that he\u0027d let Macy into the clinic before office hours. With everyone else Larry was inflexible; with Macy he\u0027d been prepared to bend the rules. As far as I was concerned, Macy got her own way far too often. She wouldn\u0027t with me again.\u003c/p\u003e\n\u003cp\u003eJust as I\u0027d feared, she was at the clinic when I got there. She had her earphones plugged in and if she noticed my arrival she gave no indication. That suited me; the less contact I had with her the better.\u003c/p\u003e\n\u003cp\u003e\"What time did Macy deign to show up?\" I asked Linda.\u003c/p\u003e\n\u003cp\u003e\"About ten minutes ago. What makes you ask?\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t accustomed to having Linda question my questions. \"Nothing,\" I murmured and hurried toward my office where I put on my white jacket and slipped the stethoscope around my neck before going to the first exam room.\u003c/p\u003e\n\u003cp\u003eBy noon it was apparent that Macy had made substantial progress on the mural. The sketch was completely finished now and she\u0027d started painting. The colors she\u0027d chosen were bright and bold, acrylics rather than oils. The entire office seemed enthralled with her work, judging by all the chatter about what a wonderful job she was doing.\u003c/p\u003e\n\u003cp\u003eI should\u0027ve been pleased but in my present frame of mind, I was only interested in finding fault with her. She was impeding me, not physically, but emotionally. Having her so close made me uncomfortable.\u003c/p\u003e\n\u003cp\u003eI wanted her out of my proximity and, even more, out of my head. What troubled me most was how much I thought about that kiss and the way it\u0027d made me feel alive again. I couldn\u0027t get past the idea that, regardless of what Hannah had said in her letter, I didn\u0027t have any right to feel like that. Alive, when Hannah wasn\u0027t.\u003c/p\u003e\n\u003cp\u003eEvery time I fantasized about kissing Macy again, I felt as if I was losing control of who I was. I hated that sensation and I wanted to shake it off.\u003c/p\u003e\n\u003cp\u003eAt lunchtime, I left my office door open and reached for the phone. I knew Macy was within earshot because she was sitting with Linda. The other staff members had gathered around her like those jungle creatures she\u0027d painted converging at a water hole. I could hear their banter and high spirits.\u003c/p\u003e\n\u003cp\u003eI usually close my office door during our lunch break. I value the peace and use that hour to make phone calls, many of which have to be done in private. However, I wanted, needed, Macy to hear me talking to Leanne.\u003c/p\u003e\n\u003cp\u003eI got hold of Leanne on her cell phone.\u003c/p\u003e\n\u003cp\u003e\"Hello, Michael,\" she said, and the welcome in her voice felt like a soothing balm.\u003c/p\u003e\n\u003cp\u003e\"How have you been?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m doing well, and you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine,\" I said, wondering how long we\u0027d carry on this mundane conversation.\u003c/p\u003e\n\u003cp\u003e\"I was going to call you,\" she said. \"About the movie. Sorry I haven\u0027t gotten around to it. But I do want to go. Would you rather we went on Saturday or Sunday?\"\u003c/p\u003e\n\u003cp\u003e\"What about this evening? Are you free?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" Leanne said. \"Do you still want to see an action film? There\u0027s that new Tarantino. I\u0027ll cover my eyes during the violent parts.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like it\u0027s not the kind of movie you\u0027re fond of.\"\u003c/p\u003e\n\u003cp\u003eShe hesitated. \"The truth is, I don\u0027t think I\u0027d be good company at any movie. I\u0027ve been depressed for the past couple of days. I told you Mark\u0027s in Afghanistan? He just got there. His mother gave me his e-mail address and I wrote to him. He...blocked my name so anything I send him will be automatically returned.\"\u003c/p\u003e\n\u003cp\u003e\"Ouch.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, that\u0027s exactly the way I felt.\"\u003c/p\u003e\n\u003cp\u003e\"Did you find out what he\u0027s doing there?\"\u003c/p\u003e\n\u003cp\u003e\"He...he\u0027s working as a helicopter mechanic for one of the big contractors there. A friend of his got him on.\"\u003c/p\u003e\n\u003cp\u003e\"A helicopter mechanic?\" That seemed odd, since Mark was an accountant.\u003c/p\u003e\n\u003cp\u003e\"He worked on helicopters when he was in the army. Then, later, after he finished his tour of duty, he went into accounting and became a CPA. We met while he was taking classes and got married a year later.\"\u003c/p\u003e\n\u003cp\u003eOf course, it made sense that he couldn\u0027t continue as a CPA with embezzling charges against him.\u003c/p\u003e\n\u003cp\u003e\"Muriel--that\u0027s his mother--said he took the job because it\u0027s so lucrative and he\u0027ll be able to pay off the hospital and the fine--but this is a war zone. I\u0027m worried about him. Maybe I shouldn\u0027t be...but I can\u0027t help it.\"\u003c/p\u003e\n\u003cp\u003eIn similar circumstances, I\u0027d be worried, too. \"I\u0027m sorry, Leanne.\"\u003c/p\u003e\n\u003cp\u003e\"I probably shouldn\u0027t have said anything.\"\u003c/p\u003e\n\u003cp\u003e\"Let me take your mind off Mark,\" I said. \"Let\u0027s go out for dinner,\" I suggested. \"I owe you a meal.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Michael, you don\u0027t owe me anything.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to take you to dinner,\" I said. \"How about if we meet after work, have dinner and look over the movies? We\u0027ll make a decision together.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Thank you.\"\u003c/p\u003e\n\u003cp\u003eI appreciated her willingness. Partly because I figured Macy, not to mention Linda, was listening, I went on to talk about the meal she\u0027d prepared for me. \"I really enjoyed having an honest-to-goodness home-cooked dinner,\" I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/hannah-s-list-blossom-street-7/page-31.html","bookId":1939,"creation":"Oct 5, 2019 10:00:23 AM","modification":"Oct 5, 2019 10:00:23 AM"}
