{"id":66255,"no":37,"title":"Page 37","content":"\u003cp\u003e\"Maybe you should just ask Macy,\" Linda advised.\u003c/p\u003e\n\u003cp\u003e\"Ask her what?\" I said. \"Ask her about being here one minute and gone the next?\" I despaired of ever understanding Macy. Give me a cranky four-year-old any day.\u003c/p\u003e\n\u003cp\u003eLinda patted my arm sympathetically, then clapped a file in my outstretched hands. \"Talk to her and you\u0027ll both feel better.\"\u003c/p\u003e\n\u003cp\u003eAn hour later, I tried Macy\u0027s home phone. She didn\u0027t answer. Nor did she pick up thirty minutes after that. When I was done for the day, I decided to stop by her house and find out what was going on. I hoped Linda\u0027s advice worked. Maybe I\u0027d invite Macy to dinner....\u003c/p\u003e\n\u003cp\u003eBy the time I parked in front of her house, I was happily anticipating an evening in her company. As Hannah had promised, when Macy wasn\u0027t frustrating me, she did make me smile.\u003c/p\u003e\n\u003cp\u003eI let myself through her gate and walked up the sidewalk to her front door. I rang the bell and waited. A cat, Peace, I believe, leaped onto the living room windowsill. Peering into the house, I saw the other two cats asleep on the sofa. Macy was nowhere in sight.\u003c/p\u003e\n\u003cp\u003e\"You looking for Macy?\" Harvey called from his porch. Sammy stood at his side, tail wagging furiously. \"In case you\u0027re too dumb to figure it out, she isn\u0027t home.\"\u003c/p\u003e\n\u003cp\u003e\"Where is she?\" I asked, choosing to overlook the insult.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t answer. \"I wondered if you\u0027d come by,\" he said in the gruff tone I\u0027d come to expect from him. \"If I was twenty years younger I\u0027d punch your lights out.\"\u003c/p\u003e\n\u003cp\u003eI bounded down Macy\u0027s steps and hurried around to his porch.\u003c/p\u003e\n\u003cp\u003e\"Okay, forty years younger,\" he amended. \"What did you say to Macy, anyway? I\u0027ve never seen her this upset, outside of losing her grandmother, that is.\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t spilling my guts to this old coot. \"I didn\u0027t say anything.\"\u003c/p\u003e\n\u003cp\u003e\"In case you don\u0027t know it, young man, Macy is mighty special. I can\u0027t understand why she cares about you, but then I don\u0027t know why she pesters me with all this attention, either.\"\u003c/p\u003e\n\u003cp\u003e\"Did she say when she\u0027d be back?\" I asked, more eager to learn what she was upset about than to discuss his theories about her emotional attachments.\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"You want to come inside for a beer?\" he asked abruptly.\u003c/p\u003e\n\u003cp\u003e\"Okay. As a matter of fact, I\u0027d love one.\" I had nothing more pressing to do and Macy would return eventually; I might as well stay here.\u003c/p\u003e\n\u003cp\u003e\"Good.\" When he held open the screen door, Sammy and I trotted into the house. Lowering himself onto his recliner, Harvey told me to retrieve the beers. When I joined him, he turned off the evening news. I sat down across from him on the couch, while Sammy lay on the rug, next to Harvey\u0027s chair.\u003c/p\u003e\n\u003cp\u003e\"You had dinner?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t have much of an appetite these days.\"\u003c/p\u003e\n\u003cp\u003e\"How about a pizza?\"\u003c/p\u003e\n\u003cp\u003eHe considered the suggestion, then shrugged. \"Sounds as good as anything else.\"\u003c/p\u003e\n\u003cp\u003eI took out my cell. After more than a year of fending for myself, I had my favorite pizza delivery service on speed dial. I ordered the usual, then sat back and relaxed, gulping down a refreshing mouthful of beer.\u003c/p\u003e\n\u003cp\u003e\"She has a private place she\u0027ll go for a few hours when she\u0027s upset,\" Harvey said. \"Don\u0027t know where it is. She\u0027s never told me, but my guess is she likes to walk along the Hood Canal. I\u0027m sure she\u0027ll be back soon--those cats want feeding.\"\u003c/p\u003e\n\u003cp\u003eI put down my beer. \"You love her, don\u0027t you?\" Most of the time, the old man pretended otherwise.\u003c/p\u003e\n\u003cp\u003eHe snorted and looked me in the eye. \"So do you.\"\u003c/p\u003e\n\u003cp\u003eI began to argue and realized I was no different than Harvey. I hid my feelings, too, dodged emotions and their uncertainty, their messiness. Hannah had been the keeper of our emotional life. Now I was finding my way through this strange new existence.\u003c/p\u003e\n\u003cp\u003eHarvey\u0027s eyes pierced straight through me. \"Admit it. You love her.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I guess I do,\" I said reluctantly.\u003c/p\u003e\n\u003cp\u003eThe old man shook his head. \"Damn shame,\" he muttered.\u003c/p\u003e\n\u003cp\u003e\"What is?\"\u003c/p\u003e\n\u003cp\u003e\"She loves you, too. I\u0027d always sort of hoped she\u0027d marry me,\" he said. His serious expression shocked me until I realized he was joking. Harvey joking? That was a switch.\u003c/p\u003e\n\u003cp\u003eHe grinned and it seemed as though his facial muscles were stiff, unaccustomed to smiling. What I\u0027d done to deserve his smile I couldn\u0027t begin to guess.\u003c/p\u003e\n\u003cp\u003eI sat on the couch with my beer as we waited for our promised thirty-minutes-or-it\u0027s-free pizza delivery. \"Before she died, my wife wrote me a letter,\" I said, unsure what had prompted this sudden confidence.\u003c/p\u003e\n\u003cp\u003eThen, before I could decide whether I should, I told Harvey everything. After having read Hannah\u0027s letter countless times, I repeated it to him almost verbatim.\u003c/p\u003e\n\u003cp\u003eHarvey listened, not interrupting even once to ask questions.\u003c/p\u003e\n\u003cp\u003e\"It took me a long time to understand why Hannah included Macy,\" I finished.\u003c/p\u003e\n\u003cp\u003eHe arched his brows as if to say that was the stupidest remark he\u0027d ever heard. \"You\u0027ll figure it out soon enough. You\u0027re still young. In another thirty years, you might wise up.\"\u003c/p\u003e\n\u003cp\u003eI laughed. He meant it as an insult, but I didn\u0027t take offense.\u003c/p\u003e\n\u003cp\u003e\"You married a wise woman,\" he said next.\u003c/p\u003e\n\u003cp\u003e\"I did.\" When people mentioned Hannah, I used to feel overwhelmed by grief and sadness. All I could think about was what I\u0027d lost. Now I was starting to understand what I\u0027d been given in the years we\u0027d had. That time together had been a priceless gift.\u003c/p\u003e\n\u003cp\u003eAnother thought struck me and it was like being prodded out of sleep into wakefulness. A moment later I was on my feet.\u003c/p\u003e\n\u003cp\u003e\"You going somewhere?\" Harvey asked.\u003c/p\u003e\n\u003cp\u003e\"No...I was thinking.\" My mind was still spinning. I\u0027d been given another chance. Macy was that chance. Through Hannah\u0027s wisdom and the grace of God, I\u0027d found Macy.\u003c/p\u003e\n\u003cp\u003eA car door closing caught my attention and I reached for my wallet to pay for the pizza.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Macy,\" Harvey announced, looking out the window.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t need him to say another word. Opening the door, I ran down the steps.\u003c/p\u003e\n\u003cp\u003eMacy stopped when she saw me. She seemed to brace herself, as if she felt apprehensive about what I\u0027d say.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t hesitate. I ran down the walk and straight toward her. Not giving her a second to protest, I slid my arms around her waist and lifted her from the sidewalk. Then I buried my face in her shoulder and breathed in the scent of lavender and paint and Macy....\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry I left,\" she whispered. \"I had to get away.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I was...afraid.\"\u003c/p\u003e\n\u003cp\u003e\"Of me?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Yes. No. I\u0027m afraid of falling in love with you.\"\u003c/p\u003e\n\u003cp\u003eI set her on the ground and held her face in my hands. \"Am I so terrible?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, no! You\u0027re wonderful. Too wonderful.\" \"Oh, Macy...\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll get tired of me and angry because...I\u0027m different.\" \"You\u0027re beautiful.\"\u003c/p\u003e\n\u003cp\u003e\"But--\"\u003c/p\u003e\n\u003cp\u003e\"Would you please stop talking so I can kiss you?\"\u003c/p\u003e\n\u003cp\u003eShe smiled, and before she could say anything else, I lowered my mouth to hers.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Nine\u003c/p\u003e\n\u003cp\u003eM onday afternoon Leanne\u0027s cell phone rang while she was on her lunch break. After a bowl of chicken soup in the hospital cafeteria, she\u0027d gone for a walk. The last week of June was cool and a little blustery; according to the calendar summer had begun the previous week, but it didn\u0027t really arrive in the Pacific Northwest until the latter part of July. Still, she needed the exercise, so she\u0027d brought a heavy sweater to wear outside.\u003c/p\u003e\n\u003cp\u003eShe\u0027d made her way from the hospital and strolled through the shopping complex at Pacific Place. She didn\u0027t need anything, nor could she afford much, but browsing through the stores gave her a chance to think.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t heard from Michael Everett in a couple of weeks and realized the attraction just wasn\u0027t there. Thankfully, they both recognized it.\u003c/p\u003e\n\u003cp\u003eWhen her phone rang, Leanne fumbled in her purse to retrieve it. She didn\u0027t take the time to check her small display screen, afraid the caller might hang up.\u003c/p\u003e\n\u003cp\u003e\"Hello,\" she said breathlessly.\u003c/p\u003e\n\u003cp\u003e\"Leanne, this is Muriel. I apologize for disturbing you.\" Her mother-in-law didn\u0027t sound like herself. Her voice quavered as if she\u0027d been crying.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you phoned,\" Leanne assured her as she con\u003c/p\u003e\n\u003cp\u003etinued walking.\u003c/p\u003e\n\u003cp\u003e\"How are you?\"\u003c/p\u003e\n\u003cp\u003eLeanne left the shopping complex and stood on the street,\u003c/p\u003e\n\u003cp\u003ewhere telephone reception was better. \"Okay, and you?\" Muriel didn\u0027t respond.\u003c/p\u003e\n\u003cp\u003e\"Is everything all right?\" Leanne asked during the\u003c/p\u003e\n\u003cp\u003eawkward pause that followed.\u003c/p\u003e\n\u003cp\u003eMuriel still didn\u0027t answer and Leanne wondered if the\u003c/p\u003e\n\u003cp\u003ecall had been disconnected. \"Muriel? Are you there?\" \"Yes, I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"Is it Brian?\" Her father-in-law was in good health as far\u003c/p\u003e\n\u003cp\u003eas Leanne knew, but she hadn\u0027t seen him in nearly two years. \"No,\" Muriel said in the same odd tone she\u0027d used earlier. \"Is...is it...\"\u003c/p\u003e\n\u003cp\u003eIt suddenly came to her that Muriel would phone in the\u003c/p\u003e\n\u003cp\u003emiddle of a workday only if something had happened to\u003c/p\u003e\n\u003cp\u003eMark. She clenched her cell phone more tightly. The street\u003c/p\u003e\n\u003cp\u003enoise made it almost impossible to hear.\u003c/p\u003e\n\u003cp\u003e\"We...got some news this afternoon--about Mark--\u003c/p\u003e\n\u003cp\u003eand I thought you\u0027d want to know,\" she said in a leaden\u003c/p\u003e\n\u003cp\u003evoice.\u003c/p\u003e\n\u003cp\u003eLeanne\u0027s legs felt weak. Fortunately, there was a bus stop nearby; she staggered toward the bench and\u003c/p\u003e\n\u003cp\u003eslumped onto it.\u003c/p\u003e\n\u003cp\u003e\"Tell me,\" Leanne pleaded.\u003c/p\u003e\n\u003cp\u003e\"McPherson, the company that employs Mark, contacted us an hour ago. Mark did warn us before he left that\u003c/p\u003e\n\u003cp\u003ethere\u0027d be risks, but...but we assumed, the way everyone\u003c/p\u003e\n\u003cp\u003edoes, I suppose, that he\u0027d be safe inside the army compound. It should be safe there, don\u0027t you think?\" \"Yes, of course.\" Why in heaven\u0027s name was Muriel dragging this out? Tell me! It was all Leanne could do not to\u003c/p\u003e\n\u003cp\u003escream at her.\u003c/p\u003e\n\u003cp\u003eSome of the expression had returned to Muriel\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"Mark knew several of the military men in Afghanistan\u003c/p\u003e\n\u003cp\u003efrom when he was in the service. One of them is a helicopter pilot. About the same age as Mark, married and a\u003c/p\u003e\n\u003cp\u003efather. I believe Mark told us he has two little girls. I don\u0027t\u003c/p\u003e\n\u003cp\u003erecall how old they are. Then again, Mark might not have\u003c/p\u003e\n\u003cp\u003esaid. I don\u0027t remember now.\"\u003c/p\u003e\n\u003cp\u003eLeanne\u0027s hand flew to her mouth and she closed her eyes. \"His name was Alan,\" Muriel said. Her voice shook. \" Wa s ? Alan\u0027s dead?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eLeanne swallowed painfully. \"Alan...wasn\u0027t alone, was\u003c/p\u003e\n\u003cp\u003ehe?\"\u003c/p\u003e\n\u003cp\u003e\"No...\"\u003c/p\u003e\n\u003cp\u003eThe grip she had on her cell phone threatened to crush\u003c/p\u003e\n\u003cp\u003eit. \"Was...Mark with him?\"\u003c/p\u003e\n\u003cp\u003eMuriel\u0027s answer came in the form of a sob. \"Yes!\" Leanne could hardly breathe. Her mother-in-law was crying. Finally, when she couldn\u0027t bear it any longer, Leanne blurted out the question. \"Is he dead? Just tell me if Mark\u0027s\u003c/p\u003e\n\u003cp\u003edead.\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t know.... Apparently, Mark went out with\u003c/p\u003e\n\u003cp\u003eAlan and another mechanic because Alan was having\u003c/p\u003e\n\u003cp\u003eengine problems and Mark couldn\u0027t figure out what was\u003c/p\u003e\n\u003cp\u003ewrong. He thought if he heard the engine in flight, he\u0027d\u003c/p\u003e\n\u003cp\u003eknow where to look--only, when they left the compound,\u003c/p\u003e\n\u003cp\u003ethey came under immediate fire and went down.\u003c/p\u003e\n\u003cp\u003eThen...when the second chopper got to the one Mark and\u003c/p\u003e\n\u003cp\u003eAlan were in, they found Alan had died in the crash.\" \"And Mark?\" she asked. \"What about Mark?\" \"He wasn\u0027t there. Neither was the other man.\" \"Mark was captured?\" That scenario was truly terrifying. \u003c/p\u003e","sourceLink":"https://allnovel.net/hannah-s-list-blossom-street-7/page-37.html","bookId":1939,"creation":"Oct 5, 2019 10:00:23 AM","modification":"Oct 5, 2019 10:00:23 AM"}
