{"id":1939,"title":"Hannah\u0027s List (Blossom Street #7)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eHannah\u0027s List (Blossom Street #7) \u003c/p\u003e\n \u003cp\u003eMy darling Michael, I know this letter will come as a shock to you\u0026amp;hellip;. \u003c/p\u003e\n \u003cp\u003eOn the anniversary of his beloved wife\u0027s death, Dr. Michael Everett receives a letter Hannah had written him. \u003c/p\u003e\n \u003cp\u003eIn it she reminds him of her love and makes one final request. An impossible request\u0026amp;mdash;I want you to marry again. She tells him he shouldn\u0027t spend the years he has left grieving her. And to that end she\u0027s chosen three women she asks him to consider. \u003c/p\u003e\n \u003cp\u003eFirst on Hannah\u0027s list is her cousin, Winter Adams, a trained chef who owns a caf\u0026amp;#233; on Seattle\u0027s Blossom Street. The second is Leanne Lancaster, Hannah\u0027s oncology nurse. Michael knows them both. But the third name is one he\u0027s not familiar with\u0026amp;mdash;Macy Roth. \u003c/p\u003e\n \u003cp\u003eEach of these three women has her own heartache, her own private grief. More than a year earlier, Winter broke off her relationship with another chef. Leanne is divorced from a man who defrauded the hospital for which she works. And Macy lacks family of her own, the family she craves, but she\u0027s a rescuer of strays, human and animal. Macy is energetic, artistic, eccentric\u0026amp;mdash;and couldn\u0027t be more different from Michael. \u003c/p\u003e\n \u003cp\u003eDuring the months that follow, he spends time with Winter, Leanne and Macy, learning more about each of them\u0026amp;hellip;and about himself. Learning what Hannah already knew. He\u0027s a man who needs the completeness only love can offer. And Hannah\u0027s list leads him to the woman who can help him find it.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/hannah-s-list-blossom-street-7.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/hannah-s-list-blossom-street-7.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 9:59:46 AM"}
