{"id":29969,"no":16,"title":"Chapter 16. For a Game of Chess","content":"The day was wearing into evening when Conrad gave a last look in the little polished mirror hanging on the tapestried walls of his tent, and prepared to set out on a tour of inspection, including a visit to Carrara, who in this moment’s interval, he thought could not have gone astray.\n\u003cbr\u003e \n\u003cbr\u003e Della Scala had been gone four hours or more, but to the light-hearted German it seemed he had only an instant ago turned from his tent.\n\u003cbr\u003e \n\u003cbr\u003e He had employed the time in writing some verses (in imitation of the fashionable Petrarch, a production with which he was perfectly satisfied, and put aside to be fair copied by someone, a better adept in spelling than himself), in teaching Vittore to dance, and in changing his doublet.\n\u003cbr\u003e \n\u003cbr\u003e Count Conrad was very careful of his doublets. He had a great many, and kept them carefully locked in the large coffer that stood at the head of his tent bed.\n\u003cbr\u003e \n\u003cbr\u003e The one he donned today was elegant in the extreme; peacock purple over a under-garment of rose, curiously slashed with cream. Vittore, who had become his page, was silent at the magnificence.\n\u003cbr\u003e \n\u003cbr\u003e Conrad sighed as he smoothed the ruffles at his wrists to think that it might not be the latest mode. He felt far from civilization, though only. twice seven miles outside Milan, and secretly regretted that Valentine Visconti had ever dazzled him into the imprudence of losing her brother’s favour and with it the joys of a splendid court. Still he had exquisite leathern shoes with points a yard long, caught up and fastened by a chain to his knee; also a cap, garnished with a ruby and a curling feather, and, taking it from Vittore, he stepped out to begin his espionage of Carrara.\n\u003cbr\u003e \n\u003cbr\u003e ‘Vittore, follow me,’ he said. ‘I have it in trust to see this black-browed duke gets into no mischief. Also,’ he continued, ”tis in my mind to find Vincenzo. Della Scala was severe this noon. I fear me the boy has gone to practise sword-play.’\n\u003cbr\u003e \n\u003cbr\u003e The camp was quiet and tranquil. It struck Conrad, however, that many of Carrara’s men were engaged with their horses and in packing the wagons; but carried on so openly, in broad daylight, it aroused no suspicions on the part of the easy von Schulembourg, who made toward Carrara’s tent, singing gaily.\n\u003cbr\u003e \n\u003cbr\u003e The air was heavy, the sky black about the horizon.\n\u003cbr\u003e \n\u003cbr\u003e ‘There will be a storm tonight, Vittore. Let me see, art thou afraid of thunder?’ and as he spoke the Count passed without ceremony into Carrara’s tent.\n\u003cbr\u003e \n\u003cbr\u003e The Duke was there, but not expecting Conrad, and as he raised his eyes at his sudden entrance, his look would have struck any save the light-hearted fop as strained and anxious; but the German had personally no doubt of Carrara, and the Duke’s ready smile deceived him utterly.\n\u003cbr\u003e \n\u003cbr\u003e ‘So your men move tonight, my lord?’ he said. ‘The Prince never mentioned it to me.’\n\u003cbr\u003e \n\u003cbr\u003e ‘It was a final resolve,’ answered Carrara. ‘I have my orders here,’ and he tapped a parchment beside him.\n\u003cbr\u003e \n\u003cbr\u003e ‘Ah!’ Conrad never even took the parchment up, but glanced through the opening of the tent at the threatening sky. ‘You move nearer Milan, of course?’\n\u003cbr\u003e \n\u003cbr\u003e Giacomo kept his black eyes on the floor.\n\u003cbr\u003e \n\u003cbr\u003e ‘Nearer Milan,’ he replied. ‘Yes; but we do not break camp until the morning, Count. You and the rest remain here to join the Prince.’ Carrara looked also out into the thunder-laden air, but not at the sky — at the castle, frowning black above the encampment.\n\u003cbr\u003e \n\u003cbr\u003e ‘An officer of mine,’ said Conrad carelessly, ‘said something to me of some prisoners.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Yonder at the castle, Count. Will you question them with me?’ asked Giacomo smoothly.\n\u003cbr\u003e \n\u003cbr\u003e ‘Question them!’ laughed the Count. ‘You may have that task, my lord! — and I shall know then where you are,’ he added under his breath.\n\u003cbr\u003e \n\u003cbr\u003e Carrara kept his eyes down, lest even Conrad should see the excitement in them.\n\u003cbr\u003e \n\u003cbr\u003e ‘Possibly even I may not question them tonight, Count,’ he returned with a smile. ‘I intend to rest now, as we march at dawn.’\n\u003cbr\u003e \n\u003cbr\u003e Conrad rose, with a pleasant feeling of having done his duty, though in his heart a little annoyed that della Scala had not trusted him with the movement of the army.\n\u003cbr\u003e \n\u003cbr\u003e ‘The thought of his wife has made him crazy,’ he said to himself. ‘Giving Giacomo credit for treachery, still he entrusts him with orders he withholds even the knowledge of from me.’ And leaving Carrara, he went in search of Vincenzo.\n\u003cbr\u003e \n\u003cbr\u003e Giacomo sat silent till the Count’s laughter had died away in the distance, then rose with a passionate exclamation at his own luck and Mastino’s blindness.\n\u003cbr\u003e \n\u003cbr\u003e Without a question the Count (left in trust, Carrara knew as plainly as if he had been told) had swallowed his lies, and left him to do as he pleased while he revelled with Vincenzo d’Este. Seeking the entrance once more, Carrara looked out into the heavy evening.\n\u003cbr\u003e \n\u003cbr\u003e In that great castle Visconti was a prisoner.\n\u003cbr\u003e \n\u003cbr\u003e Though with his own eyes he had seen Gian Visconti bound between the soldiers, he could not rest for his impatience to see him again and have it confirmed before any other eyes should recognize this rare prize.\n\u003cbr\u003e \n\u003cbr\u003e Tonight Carrara’s army was to desert to Milan. That had been already arranged with Visconti’s disguised messenger. It should still desert, but Visconti was now a prisoner, his life in Carrara’s hands — there must be slightly other terms between them.\n\u003cbr\u003e \n\u003cbr\u003e To be in a position’ to dictate to such a man! Giacomo stood in the gathering dusk, waiting for the dark, his eyes on the castle that held Gian Galeazzo Maria Visconti, Duke of Milan — a prisoner.\n\u003cbr\u003e \n\u003cbr\u003e ‘The storm nears: how hot, good St Hubert, how hot!’ And Conrad tossed the damp curls back from his forehead. The entrance of his tent was flung open to admit what little air there might be, showing to the soldiers without Conrad and Vincenzo bending over a game of chess; on a table near were flasks of wine and elegant glasses; along the floor Vittore lay, half in a heavy sleep.\n\u003cbr\u003e \n\u003cbr\u003e The tent was lit by jewelled lamps, and by their dull light Vincenzo’s beauty shone with an almost unearthly brilliancy. He was clothed in white, his thick black hair falling about his shoulders.\n\u003cbr\u003e \n\u003cbr\u003e Evidently Mastino’s reproof was already forgotten. He leaned forward with flushed cheeks and parted lips, eager and intent on a victory at chess; war and the price of it far from thoughts.\n\u003cbr\u003e \n\u003cbr\u003e ‘Hark!’ said Conrad. ‘Thunder!’\n\u003cbr\u003e \n\u003cbr\u003e A low rumble filled the tent; d’Este took no heed.\n\u003cbr\u003e \n\u003cbr\u003e ‘I take thy knight,’ he said, ‘it ruins thee.’\n\u003cbr\u003e \n\u003cbr\u003e Conrad laughed, he did not take the game so seriously. ‘I will visit Carrara,’ he said, rising, ‘and go the rounds.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Thou wilt finish the game,’ said Vincenzo angrily. ‘Does it pall the moment thou failest to win?’\n\u003cbr\u003e \n\u003cbr\u003e ‘My faith, I fail when it palls. But doubtless thou wilt win yet, if thou does not grow too hot,’ and Conrad fanned the boy with the points of his sleeves.\n\u003cbr\u003e \n\u003cbr\u003e Vincenzo’s lustrous eyes flashed.\n\u003cbr\u003e \n\u003cbr\u003e Doubtless I shall, Count,’ he drew from his finger an emerald ring, ‘and I will stake this on it.’\n\u003cbr\u003e \n\u003cbr\u003e He dropped it on the table with a rattle, and Conrad was animated at once.\n\u003cbr\u003e \n\u003cbr\u003e ‘And I this,’ he cried, ‘my forfeit if the game is not mine in four moves!’\n\u003cbr\u003e \n\u003cbr\u003e He placed his pearl thumb-ring beside Vincenzo’s emerald. ‘Four moves!’ cried Vincenzo scornfully, and leaned back with shining eyes. Conrad reached for the glasses with a glance of good humour at the dozing page.\n\u003cbr\u003e \n\u003cbr\u003e ‘A night from the infernal regions!’ he said, as he poured out the wine. ‘How does Visconti feel tonight? Methinks some kinsfolk of his from below are abroad.’\n\u003cbr\u003e \n\u003cbr\u003e Vincenzo emptied his glass and moved.\n\u003cbr\u003e \n\u003cbr\u003e Conrad emptied his and counter-moved. ‘I hope thy emerald was not a lady’s gift,’ he laughed.\n\u003cbr\u003e \n\u003cbr\u003e Vincenzo bit his lip, reflected long, and moved again.\n\u003cbr\u003e \n\u003cbr\u003e Conrad turned to the slender flasks and lifted them, one after the other; empty all.\n\u003cbr\u003e \n\u003cbr\u003e ‘Vittore!’ he called. ‘Vittore!’\n\u003cbr\u003e \n\u003cbr\u003e The boy rose, rubbing his eyes, half-dazed.\n\u003cbr\u003e \n\u003cbr\u003e ‘Bring us more wine, Vittore.’ Conrad turned to the board again and laughed at Vincenzo’s intent face. ‘My move,’ he said; his plump hand hesitated scarcely a breath, ‘Check, Messer Vincenzo.’\n\u003cbr\u003e \n\u003cbr\u003e ‘This is no light to play by,’ cried Vincenzo, and in annoyance he moved with too little thought.\n\u003cbr\u003e \n\u003cbr\u003e Conrad waited provokingly till fresh wine had been brought and drunk, patted Vittore’s head, and turned to the game again.\n\u003cbr\u003e \n\u003cbr\u003e ‘Mate, Messer Vincenzo, in three moves.’ And he leaned back with the calm air of a conqueror.\n\u003cbr\u003e \n\u003cbr\u003e Vincenzo rose in a passion, dashing his glass to the ground. ‘I question thy fair play,’ he cried.\n\u003cbr\u003e \n\u003cbr\u003e ‘And I thy discretion,’ returned the Count, and his eyes were suddenly wrathful. ‘Thou art a child, and canst not play; and so like a child cry out: “You cheat.”’\n\u003cbr\u003e \n\u003cbr\u003e ‘I said no word of cheating,’ returned Vincenzo. ‘Is the accusation one you are accustomed to, Count Conrad?’\n\u003cbr\u003e \n\u003cbr\u003e Conrad crimsoned. ‘Play another time with thy equals, boy, and take better care not to insult thy betters!’\n\u003cbr\u003e \n\u003cbr\u003e ‘Betters!’ And Vincenzo laughed in reckless scorn, his hand on his toy-like dagger. ‘A d’Este demeans himself to play with thee — thou German upstart!’\n\u003cbr\u003e \n\u003cbr\u003e But Conrad was to be moved no more. With a smile more provoking than any reply he picked up the rings and slipped them on his finger.\n\u003cbr\u003e \n\u003cbr\u003e But Vincenzo, hot-tempered and passionate, sprang forward with boyish passion.\n\u003cbr\u003e \n\u003cbr\u003e ‘Thou shalt not have the emerald,’ he cried.\n\u003cbr\u003e \n\u003cbr\u003e ‘Must I fight for it?’ smiled Conrad, and glanced at Vincenzo’s little dagger. ‘The emerald seems worth it — only I should be afraid of hurting thee.’ And as he spoke he poured out more wine, drinking it gracefully.\n\u003cbr\u003e \n\u003cbr\u003e ‘I will fight only with an equal,’ said Vincenzo.\n\u003cbr\u003e \n\u003cbr\u003e Conrad turned on him, and for all his smile, his blue eyes were dark. ‘Thou reckless boy!’ he said. ‘The Germans are the lords of Italy. What is thy family but a fief to the Emperor?’\n\u003cbr\u003e \n\u003cbr\u003e Vittore had watched the scene in terror. Tomaso had let him know della Scala had left von Schulembourg in trust, and he felt his master was hardly acting as the Duke had meant. In child-like fashion, eager to stop the quarrel, he spoke his thoughts.\n\u003cbr\u003e \n\u003cbr\u003e ‘My lord,’ he said, ‘shall I not accompany you to the Duke of Padua’s tent, as the Prince commanded?’\n\u003cbr\u003e \n\u003cbr\u003e ‘Commanded!’ cried Vincenzo, catching at the words. ‘Aye, Count Conrad, remember my brother’s commands!’\n\u003cbr\u003e \n\u003cbr\u003e ‘I remember none,’ returned the Count haughtily. ‘What dost thou mean, boy?’\n\u003cbr\u003e \n\u003cbr\u003e But Vittore lost his courage under the angry glance.\n\u003cbr\u003e \n\u003cbr\u003e ‘Only, my lord, what you said,’ he stammered, ‘about keeping watch upon the Duke of Padua.’\n\u003cbr\u003e \n\u003cbr\u003e ‘So you were left as a spy?’ sneered Vincenzo, ‘is that it? Make haste, Count Conrad, hurry to Carrara’s tent as you were told, and see what he is doing.’\n\u003cbr\u003e \n\u003cbr\u003e Conrad, flushed with wine, allowed the boyish sneer to goad him into fury.\n\u003cbr\u003e \n\u003cbr\u003e ‘I play the spy at no one’s bidding,’ he said. ‘I do not leave my tent tonight.’ And he flung himself on the couch.\n\u003cbr\u003e \n\u003cbr\u003e ‘But what did the Duke order? It will go ill with you when he hears of disobedience,’ sneered Vincenzo.\n\u003cbr\u003e \n\u003cbr\u003e ‘Let it go well or ill, I will not leave my tent tonight on any errand, save I choose.’ And Count Conrad’s words were heard by another than Vincenzo and Vittore, Giacomo Carrara, who listened outside.\n\u003cbr\u003e \n\u003cbr\u003e The storm-wind was beginning to howl and the rain to fall in heavy drops, but the Duke of Padua only thanked his good fortune for such propitious weather, as he turned away and made rapidly toward the castle to question the prisoners.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1403/42028.html","bookId":1407,"creation":"Aug 5, 2019 1:59:10 AM","modification":"Aug 5, 2019 1:59:10 AM"}
