{"id":29972,"no":19,"title":"Chapter 19. A Sign from Heaven","content":"The day had dawned fair and clear after the storm, and the early sunlight struck across the dark chamber that had held Visconti.\n\u003cbr\u003e \n\u003cbr\u003e The stamped leather hung before the high window had been torn away and lay along the ground, but the room was unchanged save that the inner door was open, and near it, stuck into a crevice of the stone, a parchment hung.\n\u003cbr\u003e \n\u003cbr\u003e Before this stood Count Conrad, with a face dazed.\n\u003cbr\u003e \n\u003cbr\u003e Vincenzo, when he learned the news, had flown like a madman along the road to Milan, in a fury of rage, with some half-frenzied project of overtaking the traitor.\n\u003cbr\u003e \n\u003cbr\u003e Outside the door was a group of soldiers, who peeped through with curiosity at the motionless figure within.\n\u003cbr\u003e \n\u003cbr\u003e At last he moved dizzily to a seat. ‘St Hubert, when the Duke returns!’ he gasped, and wiped the perspiration from his forehead with a groan of woe.\n\u003cbr\u003e \n\u003cbr\u003e He looked a somewhat sorry figure, his peacock doublet crumpled, his hair uncurled, his hands shaking.\n\u003cbr\u003e \n\u003cbr\u003e Last night, only last night, Visconti had been in this very room, a prisoner in his power, and he had revelled with a boy and quarrelled over a game! One of the soldiers pushed the door open softly and entered.\n\u003cbr\u003e \n\u003cbr\u003e ‘The Prince has returned, my lord,’ he said.\n\u003cbr\u003e \n\u003cbr\u003e ‘So soon!’ gasped Conrad. ‘So soon!’\n\u003cbr\u003e \n\u003cbr\u003e ‘The army is moving from Brescia; the intention is to march on Milan —’\n\u003cbr\u003e \n\u003cbr\u003e ‘With the men who are not here!’ groaned Conrad.\n\u003cbr\u003e \n\u003cbr\u003e ‘The Duke met my lord d’Este. He knows,’ said the soldier gruffly, and left the room. It would have pleased him to strangle the foppish foreigner who had well-nigh ruined them.\n\u003cbr\u003e \n\u003cbr\u003e Conrad felt half relieved, half sorry; whether Vincenzo’s relation had been as kind to him as his own would have been he doubted — he felt a wild desire to hide himself till della Scala’s rage had blown a little over.\n\u003cbr\u003e \n\u003cbr\u003e As he stood there, miserable, undecided, he heard the salutations of the soldiers and a heavy tread outside.\n\u003cbr\u003e \n\u003cbr\u003e He remembered that Mastino was a giant — he had once found it to his advantage, he might now find it to his peril; but it was not fear, but bitter shame, that brought Conrad almost to his knees.\n\u003cbr\u003e \n\u003cbr\u003e He knew that della Scala was there, though he did not raise his head.\n\u003cbr\u003e \n\u003cbr\u003e ‘Conrad,’ said Mastino, and his voice was strangely altered. ‘Conrad.’\n\u003cbr\u003e \n\u003cbr\u003e The Count, with an effort, looked at Mastino, who stood in front of the door he had closed, with a face from which all colour had been struck.\n\u003cbr\u003e \n\u003cbr\u003e When did you discover — this?’ continued della Scala, and pointed to the parchment. All elaborate excuses and appeals for pardon Conrad had prepared died away on his tongue. ‘An hour ago,’ he replied lamely.\n\u003cbr\u003e \n\u003cbr\u003e ‘An hour ago!’ Mastino walked across to the parchment hanging on the wall.\n\u003cbr\u003e \n\u003cbr\u003e Conrad’s eyes followed him; he could find no words to break the silence.\n\u003cbr\u003e \n\u003cbr\u003e Della Scala first read, then tore the writing down, and crushed it in his hand; then he looked at the door, standing ajar.\n\u003cbr\u003e \n\u003cbr\u003e ‘How many have deserted?’ he asked in a hard voice. ‘Vincenzo said half the army.’\n\u003cbr\u003e \n\u003cbr\u003e Conrad could not answer the truth.\n\u003cbr\u003e \n\u003cbr\u003e ‘How many?’ and Mastino turned toward him.\n\u003cbr\u003e \n\u003cbr\u003e ‘Carrara has taken all his force,’ faltered the wretched man. Mastino crushed the parchment yet tighter in his hand, and walked up to Conrad, who shrank before his face.\n\u003cbr\u003e \n\u003cbr\u003e ‘Your sword, Count,’ he said. Conrad hesitated, bewildered. ‘You are no longer in my service; as my officer you wear that sword; as what you are, I demand it from you.’\n\u003cbr\u003e \n\u003cbr\u003e And he held out his hand.\n\u003cbr\u003e \n\u003cbr\u003e In silence Conrad drew the weapon.\n\u003cbr\u003e \n\u003cbr\u003e Mastino took it, broke it, threw it on the floor.\n\u003cbr\u003e \n\u003cbr\u003e ‘And now go,’ he said.\n\u003cbr\u003e \n\u003cbr\u003e At last Conrad found his voice.\n\u003cbr\u003e \n\u003cbr\u003e ‘Lord!’ he cried, ‘let me stay.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Go,’ said Mastino.\n\u003cbr\u003e \n\u003cbr\u003e ‘I will stay,’ faltered Conrad, ‘and amend my fault.’ But della Scala turned his back on him.\n\u003cbr\u003e \n\u003cbr\u003e ‘Go to Visconti,’ he flashed. ‘Tisio plays chess almost as well as Vincenzo.’\n\u003cbr\u003e \n\u003cbr\u003e The taunt made speech come more easily. ‘No man can ask more than another’s humiliation, that other suing humbly for pardon —’\n\u003cbr\u003e \n\u003cbr\u003e ‘I did not ask so much,’ said Mastino, his back still to him. ‘You are unhurt.’\n\u003cbr\u003e \n\u003cbr\u003e And the Count glanced at della Scala’s face, and saw a little of what he had done; that speech was useless.\n\u003cbr\u003e \n\u003cbr\u003e He moved to go, murmuring something with bent head; at the door he turned again. ‘Della Scala,’ he began, ‘I—’\n\u003cbr\u003e \n\u003cbr\u003e ‘I will never willingly see your face again,’ interrupted Mastino. ‘Go and join my other allies — in Milan.’\n\u003cbr\u003e \n\u003cbr\u003e Conrad drew himself up.\n\u003cbr\u003e \n\u003cbr\u003e ‘God helping me, I will go to Milan,’ he said. ‘I will further your cause in Milan itself — even though I leave with you my sword.’\n\u003cbr\u003e \n\u003cbr\u003e Still Mastino stood motionless, and slowly Conrad passed through the door, and down the stairs, through the soldiery that turned their backs — cast out. As the door clashed to behind the Count, Mastino turned passionately and strode into the inner room, not knowing what he did, so great the agony of his helpless fury and despair.\n\u003cbr\u003e \n\u003cbr\u003e A gloomy window gave a view upon the open country.\n\u003cbr\u003e \n\u003cbr\u003e Della Scala strode to it; little he heeded the gloomy couch and the stained floor. He saw only the green plain of Lombardy, and his own diminished tents, lessened by the better half. He struck his hand against the window-frame violently — Visconti had triumphed!\n\u003cbr\u003e \n\u003cbr\u003e This evening had he meant to seize Milan — the evening of this very day; and, behold, now it was all to be done again, the weary, weary waiting, the watching, the planning, the soothing his allies, the making good Carrara’s treachery; and meanwhile — Isotta!\n\u003cbr\u003e \n\u003cbr\u003e Della Scala dropped his head into his hands with a cry wrung from his heart. ‘Isotta! Isotta!’\n\u003cbr\u003e \n\u003cbr\u003e The sunlight fell too on the crumpled parchment on the floor, and Mastino, raising his head, saw it lying there and ground it beneath his heel.\n\u003cbr\u003e \n\u003cbr\u003e ‘Am I to be for ever laughed at and betrayed?’ he cried. ‘Ever served by traitors and leagued with fools? Shall I never learn I trust too much?’ He looked around the chamber, and thought, with a bitterness beyond expression, that only a few hours before Visconti had passed through it.\n\u003cbr\u003e \n\u003cbr\u003e Della Scala leaned against the wall; the very sunlight seemed black, the very sky hopeless. Yet his spirit rose against his fate.\n\u003cbr\u003e \n\u003cbr\u003e He drew out and kissed the little locket he wore around his neck, the pearl locket that always hung there. Then suddenly rousing himself and walking blindly forward, opening one door in mistake for another, he found himself at the top of two steps, looking down into a chapel. For a moment, his brain reeling and sick, he stepped back, bewildered, doubting what he saw.\n\u003cbr\u003e \n\u003cbr\u003e The place was high and dome-shaped, with plain stone walls, lit by two windows facing each other, but shrouded in dark hangings that admitted only a faint, cold light.\n\u003cbr\u003e \n\u003cbr\u003e The air was damp and vault-like, and the room itself bare of any furniture or adornment save a purple hassock, and two lamps of rusty gold that hung by long, blackened chains from the ceiling. Opposite the entrance hung against the stone wall a purple curtain, and before it a large crucifix, crudely painted. The dim light just struck its dismal colouring, and to Mastino’s fevered fancy the dead Christ seemed to twist and writhe along His contorted body.\n\u003cbr\u003e \n\u003cbr\u003e The lamps were out, and the trace of incense in the air faint. Della Scala entered softly, catching his breath painfully, the terror of religion strong within him.\n\u003cbr\u003e \n\u003cbr\u003e On the purple hassock he knelt, with clasped hands, before the disfigured Christ, his heart rising to his lips in passionate prayer.\n\u003cbr\u003e \n\u003cbr\u003e ‘Lord, thou understandest! Because I cannot deck thy altars with the gold of victory, thou wilt not forsake me, thou wilt have mercy on me and on her!’\n\u003cbr\u003e \n\u003cbr\u003e And he stretched out his arms to the figure in an exaltation of trust and hope. ‘Even as I spare those who betray, so wilt thou spare her, O Christ!’ He flung himself from his knees, face downward on the stones, in a tumult of hope and trust. Around the folds of Mastino’s cloak lay the leaves of some dead roses that had fluttered at his movement, from forgotten wreaths, hanging brown against the wall.\n\u003cbr\u003e \n\u003cbr\u003e Mastino rose, eager for some answer — some assent. But the dead Christ was silent. Mastino could see the cracking paint on the ribs, the tawdry gold of the halo, and he came still nearer in a strange desperation.\n\u003cbr\u003e \n\u003cbr\u003e Half-hidden in shadow, two faces looked down on him — expressionless, stone, the angels on the wall.\n\u003cbr\u003e \n\u003cbr\u003e Mastino looked from them to the crucifix, and his fervent faith sank, chilled.\n\u003cbr\u003e \n\u003cbr\u003e ‘Stone,’ he murmured in his heart. ‘Stone and paint,’ and he noticed the empty lamps that should be blazing with eternal fire, and he cried aloud in bitterness. ‘Men keep those alight, and without them the eternal fire dies! Stone angels and a painted God! What help in them?’ And he dropped again upon the floor. ‘The lamps burn bright on Visconti’s altars, and his saints smile — for the painter limned them so.’\n\u003cbr\u003e \n\u003cbr\u003e He turned from the dismantled chapel and rushed up the two steps, half distraught.\n\u003cbr\u003e \n\u003cbr\u003e In the outer chamber the sunlight dropped strong and golden, and Mastino shut the door of the dark and gloomy chapel behind him with a shudder.\n\u003cbr\u003e \n\u003cbr\u003e ‘Lord!’ cried an eager voice. ‘Lord!’\n\u003cbr\u003e \n\u003cbr\u003e It was Tomaso and his father.\n\u003cbr\u003e \n\u003cbr\u003e ‘Did ye fear for me, Ligozzi?’ said della Scala kindly. ‘I have been praying for a patient heart.’ And the two who loved him looked at him awhile and could say nothing.\n\u003cbr\u003e \n\u003cbr\u003e ‘My lord,’ began Tomaso again with a timid eagerness, ‘there is news —’\n\u003cbr\u003e \n\u003cbr\u003e Tomaso,’ said his father, ‘thy news can wait.’\n\u003cbr\u003e \n\u003cbr\u003e Mastino picked up his gauntlet from the deep window-seat where he laid it down, and fastening it on, looked at Ligozzi.\n\u003cbr\u003e \n\u003cbr\u003e ‘What hast thou to say, Ligozzi? Have any of the men returned?’\n\u003cbr\u003e \n\u003cbr\u003e Ligozzi stood fidgeting with his cap, looking uneasily at the ground.\n\u003cbr\u003e \n\u003cbr\u003e ‘Come,’ and Mastino smiled sadly, ‘I am used to bad news, Ligozzi.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Some few men have indeed returned from Giacomo’s army, my lord, some four score —’\n\u003cbr\u003e \n\u003cbr\u003e ‘Some four score!’ repeated della Scala. ‘Are there so many as four score that will not serve Visconti?’\n\u003cbr\u003e \n\u003cbr\u003e ‘They have strange tales, my lord. They say Carrara himself is dead.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Carrara dead!’ cried Mastino with a sudden fierceness, savage as a bite. ‘Now, I had promised myself to kill Carrara. Who has forestalled me?’\n\u003cbr\u003e \n\u003cbr\u003e ‘It is said — Visconti himself — they do not know.’\n\u003cbr\u003e \n\u003cbr\u003e ‘And the traitor dead,’ broke in della Scala, ‘was there not one — not one to lead the men back to me again? Visconti, single-handed and unarmed, was allowed to take an army into Milan?’\n\u003cbr\u003e \n\u003cbr\u003e ‘Alas, my lord, not only Carrara, his captains too, as it appears have all been bought’\n\u003cbr\u003e \n\u003cbr\u003e ‘Tell me no more,’ cried Mastino. ‘I am alone to blame. I cannot learn to deal with traitors.’\n\u003cbr\u003e \n\u003cbr\u003e ‘As for Count von Schulembourg, the wretched German,’ continued Ligozzi, ‘he has left the camp.’ As he spoke, Ligozzi glanced through the window at the tents. ‘He took no one with him, but, ordering his Germans to fight as one man to the death for you, he rode along the road to Milan.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Oh cried Mastino, with a great cry wrung from his soul. He rested his hand a moment on Ligozzi’s shoulder. ‘I am well-nigh sick, Ligozzi,’ he said. ‘The empty-headed and the villain prosper, and I— and mine — go to the wall.’\n\u003cbr\u003e \n\u003cbr\u003e Tomaso stole forward. Della Scala noticed him and turned kindly.\n\u003cbr\u003e \n\u003cbr\u003e ‘Something to tell me, sayest thou?’ he asked.\n\u003cbr\u003e \n\u003cbr\u003e Tomaso’s eyes were full of tears. For some moments he could not find his voice.\n\u003cbr\u003e \n\u003cbr\u003e ‘He hath discovered some secret passage; useless, I fear me,’ said his father.\n\u003cbr\u003e \n\u003cbr\u003e ‘Nay, Father, I tell thee it leadeth to the city! Today, lord, as I explored it, I found stored there some rolls of silk, new and clean; together with some earths such as I have heard say painters use.’\n\u003cbr\u003e \n\u003cbr\u003e Della Scala started. He found the news not so unimportant as Ligozzi had.\n\u003cbr\u003e \n\u003cbr\u003e ‘Go on, Tomaso,’ he said, and kept his half-closed eyes upon the ground.\n\u003cbr\u003e \n\u003cbr\u003e ‘Indeed, my lord, it must be some old subway into Milan. ’Tis wide enough to admit six abreast, and recently used, as it opens some mile and a half outside the city. I have not yet penetrated to the extremity. Lord, think of it — it must open into Milan!’\n\u003cbr\u003e \n\u003cbr\u003e Della Scala’s worn face flushed involuntarily, his eyes turned to the closed door of the chapel. Had he belied the stone angels — the extinguished lamps?\n\u003cbr\u003e \n\u003cbr\u003e ‘This seems great news, Tomaso,’ he said slowly. ‘I will see into it.’ He moved as he spoke. ‘My other gauntlet, Ligozzi?’\n\u003cbr\u003e \n\u003cbr\u003e ‘I cannot see it, lord.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Ah!’ said Mastino suddenly. ‘I left it in the chapel!’\n\u003cbr\u003e \n\u003cbr\u003e Tomaso had already departed for the gauntlet, Mastino, following to the door, saw him stoop and lift it from the ground. Tomaso handed him the ponderous glove, and, as Mastino took it, he stifled the cry on his lips, and turned away to clasp it to his heart.\n\u003cbr\u003e \n\u003cbr\u003e For inside his glove, almost hidden in the velvet lining, lay a soft white rose: a sign from heaven.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1403/42031.html","bookId":1407,"creation":"Aug 5, 2019 1:59:10 AM","modification":"Aug 5, 2019 1:59:10 AM"}
