{"id":86444,"no":1,"title":"Page 1","content":"\u003cp\u003eChapter One\u003c/p\u003e\n\u003cp\u003eIan studied his alpha, Marco, his mind turning to the recent attack on the alpha and his nephew, Rory, by the Hunters. They’d both been wounded in the attack, but luckily they’d sustained only flesh wounds. The silver bullets had missed all the vital organs, and wolves healed with a supernatural quickness. One of the Hunters had been captured and was in a basement cell, recovering from his injuries and being interrogated.\u003c/p\u003e\n\u003cp\u003eMarco glanced at Ian, his beta. Ian knew he relied on him for advice and a cool head. This was a dangerous time for the Dark Hollow Pack. Members of The Hunters, a shadowy, mysterious group of monster hunters at war with the wolves for more than a hundred years, had been spotted again in the woods the day before by scouts. The council, made up of Marco, Ian, various gamma leaders and Casey, their newly named battle leader, had called an emergency session.\u003c/p\u003e\n\u003cp\u003e“We’re going to have to put everything else off and concentrate on this. The mines can work themselves with the supervisors, so I don’t have to make any more trips for a while.” He sighed before getting into it. “Our friends in the valley have reported a great increase in Hunters in Brevard, in the valley, walking around the streets of town. They’re not trying to hide their presence there in the least, and the word is they’re gathering, maybe for a concerted attack.”\u003c/p\u003e\n\u003cp\u003e“Let ’em come,” said one of the younger gamma leaders. “We’re ready for them.” The a lpha thinned his lips. “I don’t think there’s any doubt they’ll come. The question is when and in what force? They have an advantage over us in that they don’t have mates and pets to protect, as we do.”\u003c/p\u003e\n\u003cp\u003eCasey spoke up. He was in the process of settling his Sapphire Pack, or the Ridge Pack as the mountain clan usually called them, at the stronghold, Mountainwood, foregoing his position as their alpha to take over as battle leader for the combined group. Marco had suggested the merger after Casey mated with Rory. Casey had agreed, recognizing the safety in numbers, and the extra strength the merger gave both groups.\u003c/p\u003e\n\u003cp\u003e“We have a plan for that, Alpha. If The Hunters attack, the pets and mates will all be taken to the safe rooms downstairs. We picked the rooms up from the manufacturer and brought them back here two days ago. The safe rooms are fireproof and have an armor-hard plate for resistance against both low and high caliber projectiles. We’ll have trained gammas inside with the pets to provide extra protection. In the case of total destruction of our forces, the wolves have their orders. No one will be taken alive for experimentation or torture.”\u003c/p\u003e\n\u003cp\u003eA tense silence fell over the room, and the a lpha nodded shortly. “Good. We can’t be worried about them while we’re fighting.”\u003c/p\u003e\n\u003cp\u003e“Right,” Casey replied. “That’s why Rory will be one of those gammas inside with the pets.”\u003c/p\u003e\n\u003cp\u003eMarco nodded. Rory, Casey’s mate, another wolf, had provided them with an unusual situation they were all still adjusting to. Wolves mating wolves had never happened before in any of their lifetimes. After a rough start, the mating was settling nicely, and Rory seemed to be happy with the relationship.\u003c/p\u003e\n\u003cp\u003e“Any reports of the leaders being in town?” Ian was worried about the unusual escalation of tensions. The Hunters had been attacking with increasing regularity. Though the group remained mysterious and shadowy, the wolves had managed to glean a little intelligence over the years. They knew, for instance, the names of several of the top leaders and had a description circulated to all their sources and humans friends of the pack. If the leaders were in town, the threat was even more serious, and an attack could be imminent.\u003c/p\u003e\n\u003cp\u003e“Yes, I’m afraid so,” replied Casey. “Elias Winters, their equivalent of alpha leader, arrived a week ago and was seen three nights ago in Brevard at a restaurant downtown. He was in the company of several young Hunters, probably bodyguards. He’s not hiding his presence in the least.”\u003c/p\u003e\n\u003cp\u003eThe alpha nodded thoughtfully. “So he wants us to know he’s around. Why is that, I wonder,” he said with a frown, deep in thought for a moment before he continued.“How’s the interrogation of the prisoner going?”\u003c/p\u003e\n\u003cp\u003e“He’s not talking. He’s well trained to resist any methods we use. He might break under torture.”\u003c/p\u003e\n\u003cp\u003e“Which we won’t use. We’re not the monsters they believe us to be. Any ideas on other waysto break him?”\u003c/p\u003e\n\u003cp\u003eCasey smiled. “One. We choose a wolf to change him to Werekin.”\u003c/p\u003e\n\u003cp\u003eIan spoke up for the first time. “I’d only be comfortable with that as an absolute last resort. Until now our laws only permit turning humans into Werekin if they’re blood matches.”\u003c/p\u003e\n\u003cp\u003e“I agree,” Marco said.\u003c/p\u003e\n\u003cp\u003e“What about using him as a bargaining chip?” one of the gammas asked.\u003c/p\u003e\n\u003cp\u003eCasey shook his head. “We’ve sent word and been ignored. The Hunters have never bargained with wolves before. We could keep trying, but the way I see it, we have three options. We can release him,kill him, or change him.”\u003c/p\u003e\n\u003cp\u003eMarco nodded. “Unless they would agree to a truce in trade for him, no release. He’s seen too much and can identify too many of our leaders now.”\u003c/p\u003e\n\u003cp\u003eCasey frowned and clenched his fists. “Besides that, he shot my mate and almost killed him. Not to mention shooting you, Marco.That alone is punishable by death.”\u003c/p\u003e\n\u003cp\u003eIan shifted in his seat. “We don’t know for sure which of them did the actual shooting. We’re at war, after all. He’s no more than a soldier following orders.”\u003c/p\u003e\n\u003cp\u003eMarco looked thoughtful. “If it comes to a choice between killing him and changing him, I think we’d have to change him, even though he wouldn’t thank us. With the mindset he’s in now, he’d probably prefer death than beingWerekin if we asked.”\u003c/p\u003e\n\u003cp\u003e“That’s only because he doesn’t know the truth,” Ian insisted in frustration.\u003c/p\u003e\n\u003cp\u003e“It’s not his choice, anyway. We have to protect our people. Like you said, we’re at war.” Casey slapped a hand on the table. “I say go for it. Once he’s turned, he’ll be more pliable and might be able togive us some valuable information.” He looked around the table slowly. “The question is,who do we get to do it?”\u003c/p\u003e\n\u003cp\u003eMarco seemed puzzled. “Well, any of us could.”\u003c/p\u003e\n\u003cp\u003e“You’re a braver wolf than I am,” Casey said with a laugh. “Rory would kill both me and the Hunter and take great pleasure in doing it. I don’t even like to think about what Nicky would do if you took another mate.”\u003c/p\u003e\n\u003cp\u003eMarco got a blank look on his face. “Mate? No, I could change him, but I can’t mate with anyone else. My mate is Nicky.”\u003c/p\u003e\n\u003cp\u003e“Exactly,” Ian said. “Once you change the Hunter, he’ll be in heat. You, better than anyone else, know how a human can get when they’re in heat.That’s why we’ve never changed any but blood matches before and always followed immediately with a mating. You know how Nicky was until you got to him after Rory had to bite him to save his life. He had to have sex and only with his blood mate.They’re insatiable at first. We’d have to keep the Hunter locked up without a mating,and then we don’t know what could happen if he weren’t able to satisfy the urges until they passed. The only way we know to get them through it without adverse reactions is a complete mating with frequent sex until they come out of it. We know in the old days it was done without mating, but we have no experience at it, and nothing in the old books I could find gave us any more information on why they did it, or how.”\u003c/p\u003e\n\u003cp\u003eCasey added, “Somehow, I don’t see Nicky going along with it—even for the good of the pack. No, whoever changes him would have to mate with him.”\u003c/p\u003e\n\u003cp\u003eThe look on Marco’s face as he pictured Nicky’s reaction was priceless, and though Ian contained his mirth with a smile, Casey convulsed in laughter. Everyone knew Nicky, Marco’s gorgeous human male pet, totally ran Marco, no matter how much Marco thought he was in charge.\u003c/p\u003e\n\u003cp\u003eIan tried to bring the subject back to their primary focus. “Very funny, Casey, but that doesn’t solve the problem. We also don’t know, for certain, if once he’s changed, even with the mating bond, he won’t still hate us and everything we stand for, putting him in constant conflict with the compulsions the bond creates. It could drive him mad.”\u003c/p\u003e\n\u003cp\u003e“No, but at least, a mating would have the most chance of turning his beliefs around,” Marco said.“It would have to be someone who isn’t already mated or likely to be. If we mate a wolf to the Hunter andthe wolf’s blood match comes along later, he’d want to be released to be with the blood mate, which would be a situation unfair to both wolf and Hunter, especially if they develop a love match.”\u003c/p\u003e\n\u003cp\u003eCasey snorted over the last statement as if no wolf could ever love a Hunter. Ian could see another problem developing if they did succeed in turning the Hunter, an undying animosity in some of the wolves, who would have difficulty accepting a Hunter among them.\u003c/p\u003e\n\u003cp\u003e“Yes, but who would that be? Who has no mate or is not likely to have one?” one of the gammas asked.\u003c/p\u003e\n\u003cp\u003eTwo sets of eyes swung toward the beta. “No!” Ian held up his hands to ward Marco and Caseyoff. “Absolutely not!”\u003c/p\u003e\n\u003cp\u003e“Well, Ian, it does make sense. Maybe it’s time you took one for the team.” Casey laughed heartily at his own joke, while everyone else smiled at Ian in sympathy.\u003c/p\u003e\n\u003cp\u003e“I don’t want another mate. My mate is dead.” Ian folded his arms across his chest. He still grieved for his wife and always would. Still, what they said made sense, even if in talking them out of changing the Hunter, he’d talked himself into a corner.\u003c/p\u003e\n\u003cp\u003eThe alpha spoke up quietly. “Ian, I can certainly sympathize. I thought I lost Nicky last year, and the idea doesn’t even bear thinking about. You’ve been so strong, and we all admire you for that, but you’re too young to climb into the grave. Your blood match passed away, so there won’t be another for you, and you haven’t expressed interest in anyone else for all this time. Perhaps you should think seriously about this. I’d never order you to, of course, but it would help us. Think about it. If we can’t find any wolf willing to mate with him, we’ll have to execute him. We can’t just let him go or keep him locked in a cell forever.” \u003c/p\u003e","sourceLink":"https://allnovel.net/logan-s-choice-dark-hollow-wolf-pack-3/page-1.html","bookId":2255,"creation":"Oct 5, 2019 5:15:16 PM","modification":"Oct 5, 2019 5:15:16 PM"}
