{"id":86451,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAfterward, Ian took Logan to a tattoo artist, who’d inscribedIan’s name on his backside, something else he rebelled against, deep inside, but couldn’t bring it to the surface. Being permanentlybranded as Ian’s property was demeaning and painful. Yet it gave him an erection when Ian told him about it, and he reached for Ian’s hand like a damn kid, wanting him to make the pain of the needles stop. Ridiculous, when he was the one who ordered it done in the first place, but still he craved Ian’s closeness. Soon his humiliation was complete, and he was dressed like a male whore in nothing more than tight black leather pants, collared, and tattooed, too apathetic to be angry.\u003c/p\u003e\n\u003cp\u003eIan took him by the arm and led him to the council room. Outside the door, he’d whispered to him. “Don’t be nervous. Just tell them the truth and let me handle any problems that come up.”\u003c/p\u003e\n\u003cp\u003eProblems? What the hell was going on? What was happening to him? Why couldn’t he get mad? When it came to Ian, he was powerless to stop anything the wolf wanted. He tried to relax and let Ian handle the problems. Ian said he would, whatever they might be.\u003c/p\u003e\n\u003cp\u003e“Alpha, this is my new mate, Logan.” Logan raised his gaze to meet the interested stare of the pack alpha. He immediately remembered him as one of the huge wolves who had held him down for Ian to bite him the first time and witnessed the sex-crazed weakling he’d become afterward. He tried for a moment to return his challenging gaze, but after only a few seconds a tingling he took for a warning twisted in his chest, and he had to look down at the floor. Instinctively he leaned toward Ian, who put a comforting hand on his arm. He instantly felt more at ease, though he hated being so dependent. He could feel the interested stares of the other big wolves in the room, and one of them in particular, loomed close to him, Casey, the big wolf who had interrogated him in his cell with such intensity.\u003c/p\u003e\n\u003cp\u003eComing right up to him, Casey pointed at Logan’s waxed chest and smiled at Ian. “Looks very good, Ian. Does he have his tattoo?”\u003c/p\u003e\n\u003cp\u003eIan turned him around and put a hand on his upper back to make him bend over slightly, hooking a finger into his waistband, and pulling it down. Logan’s entire body went red with embarrassment as his ass went bare. The big alpha called for order and motioned them all to sit down, saving Logan a measure of humiliation. Ian sat next to the alpha and pulled Logan down beside him. Logan was the only human at the table and leaned so his arm touched Ian’s, while he studied the rest of the wolves covertly. They were gammas by what he knew of the pack rating system. Alphas always sat at the head of the table with their beta next to them. All the rest, no matter what their nature, were the gammas or the soldiers. Casey, the mean one, was by his nature, an alpha, but the pack could have only leader, and that most definitely was Marco.\u003c/p\u003e\n\u003cp\u003eMarco began. “What’s your full name, Logan?”\u003c/p\u003e\n\u003cp\u003eGlancing at Ian, he mumbled under his breath, but Ian squeezed his arm in encouragement. He cleared his throat, trying again. “Logan Winters.”\u003c/p\u003e\n\u003cp\u003e“Elias Winters is your father?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eA few gasps could be heard around the table. Logan glanced up and then quickly lowered his head again. He was grateful for Ian’s hand on him. These huge men frightened him, though he couldn’t quite remember why he was supposed to be so afraid of them. He was also felt a kind of antipathy for them. He had no idea where it was coming from, either.\u003c/p\u003e\n\u003cp\u003e“Logan,” the alpha continued. “Do you understand what has happened to you?”\u003c/p\u003e\n\u003cp\u003eGlancing at Ian, Logan shrugged. “No, not exactly. I seem to be having trouble with my memory.”\u003c/p\u003e\n\u003cp\u003eHe was waking up though. Across the table, Casey snorted, and Ian growled low and menacingly, half-rising out of his chair.\u003c/p\u003e\n\u003cp\u003eThe alpha spoke firmly. “That’s enough.” Ian settled back beside him, and Marco turned to the wolf directly across from Ian. “Casey, Logan is Werekin now, Ian’s mate. Whatever he was before is irrelevant. The slate has been wiped clean.”\u003c/p\u003e\n\u003cp\u003eCasey hesitated, showing his reluctance before he spoke directly to Ian. “Sorry, but it’s hard to think of him as Werekin. He was a Hunter. He may have even killed some of our own.”\u003c/p\u003e\n\u003cp\u003eIan frowned at him, but Marco spoke up, interrupting them both. “Logan is one of us now. Once Ian gave him the first bite, he became one of us, even more so when Ian mated with him. You’ll treat him with the same care as you treat all of our pets, or you’ll answer to me, personally.” Marco turned toward Ian. “May I continue with him, Ian, or does Logan need a minute?”\u003c/p\u003e\n\u003cp\u003eLogan wondered with irritation why they were asking Ian if Logan needed a break, but Ian shook his head, and the questioning continued.\u003c/p\u003e\n\u003cp\u003e“Logan,” Marco continued, “You were a Hunter, a member of a group sworn to kill all of us, including Ian. Your group thinkswe’re all monsters, but you understand we’re far from being monsters, don’t you?”\u003c/p\u003e\n\u003cp\u003eLogan nodded slowly, not really sure of anything, but trying to be agreeable. Ian smiled, so Logan spoke up. “I don’t know about any of that.” He put a shaky hand to his head. He did know yesterday, he thought, when he stood up to Ian. At the moment, he could hardly think. “It seems like I should know, but II can’t…”\u003c/p\u003e\n\u003cp\u003e“We need you to tell us everything you can remember. The memories will begin to come back stronger in a few hours or days. It’s important you tell Ian all you know when they do. Ian’s life, as well as ours, could depend on it.”\u003c/p\u003e\n\u003cp\u003e“I-I remember my father is a leader,” Logan said with a rush of alarm. “He can be very— harsh. I don’t think he would bargain for me or come for me if that’s what you’re thinking.”\u003c/p\u003e\n\u003cp\u003e“Would he talk to you as a liaison for us?”\u003c/p\u003e\n\u003cp\u003e“He won’t talk to anyone for you. He thinks you’re animals.” Confused, not sure where the information was coming from, he stumbled over the next words.“He-he would expect me to-to get myself out of any situation I found myself in. He would expect me to be-to be a man. If I couldn’t escape, he’d expect me to k-kill myself.”\u003c/p\u003e\n\u003cp\u003eCasey smirked. Logan’s irritation grew for the wolf, manifesting as an uneasiness in the center of his chest and a tenseness in his muscles.\u003c/p\u003e\n\u003cp\u003e“If that meant he wanted you to be brave, that’s a joke,” Casey taunted. “Hunters are all cowards. They use snipers and attack from the shadows, not openly like wolves.”\u003c/p\u003e\n\u003cp\u003e“Casey,” Marco said in warning.\u003c/p\u003e\n\u003cp\u003eLogan looked up and made eye contact with him for the first time. An invisible spark flashed between them across the table. Ian had turned to speak to the alpha, missing the look that passed between them.\u003c/p\u003e\n\u003cp\u003eCasey raised his eyebrows and smiled mockingly. He leaned across the table and spoke softly to him. “You’re not acting much like a man now, are you, little Hunter?”\u003c/p\u003e\n\u003cp\u003eWith a sudden surge, all the anger he’d been suppressing came back. Logan shot to his feet, pulling away from Ian’s hand. “Fuck you, asshole!”\u003c/p\u003e\n\u003cp\u003eCasey lunged, caught Logan by his bare arms and jerked him across the table. Instantly, Ian leapt across the table, threw Casey off Logan, and took him to the floor. Marco and all the gammas jumped forward, pulling the two apart and forcing Logan back by the bulk of their bodies.\u003c/p\u003e\n\u003cp\u003eOne of the gammas herded Logan out into the hallway, not touching him, but crowding him back, looking at him solicitously. “Are you injured?” he asked him anxiously.\u003c/p\u003e\n\u003cp\u003eLogan shook his head in a daze. He had livid bruises already coloring his arms from Casey’s hands. They felt like they had been squeezed to a pulp, but hecouldn’t think of anything at that moment except Ian, terrified he was getting hurt. He tried to go back inside, but the gamma stood protectively in front of the closed door. After several tense minutes, the door opened, and Ian stepped outside. He stalked grimly toward Logan, took his hand, and pulled him from the hallway, down the corridor and up the stairs to their quarters. Logan had no choice but to run along behind him, sureif he’d fallen, Ian would have simply dragged him along, like a caveman.\u003c/p\u003e\n\u003cp\u003eWhen they arrived at their quarters, Ian jerked open the door, slammed it behind them, and whirled to face him. “Do you have any idea how badly you could have been hurt?” Ian came toward Logan as he backed up. “Do you?”\u003c/p\u003e\n\u003cp\u003e“I-uh…” Logan continued to back away until he hit the wall behind him. He held out his hands to ward off the blow he thought was coming. Ian walked up to him, slapping the hands down with contempt.\u003c/p\u003e\n\u003cp\u003e“Don’t be ridiculous.” He took him by the wrists and looked at the bruises on his arms. His face tightened for a moment, but he pulled his gaze back to Logan’s eyes. “You deliberately baited that hot head. Damn it, Logan!”\u003c/p\u003e\n\u003cp\u003eThe baiting had been from the other side, but Logan didn’t argue. “I’m not afraid of him.”\u003c/p\u003e\n\u003cp\u003e“Then you’re stupid! He could break you in half!What if I hadn’t been there?” Ian pulled his fist back and slammed it into the wall beside Ian’s head, shattering the sheetrock.\u003c/p\u003e\n\u003cp\u003e“If you hadn’t been there, I could have handled it. I’m not helpless, even if he is a big gorilla.” Logan yelled back at him, even though a part of him rebelled against it. In the next minute hewas in Ian’s arms, being carried to the bedroom. Ian threw him on the bed, pacing up and down in front of him, obviously trying to calm himself. He walked back and forth several times, then snarled, “The hell with it!” Turning, Ian flung himself down beside him and took Logan’s chin in his hand, forcing Logan to look at him.\u003c/p\u003e\n\u003cp\u003e“Do you have any idea what it felt like when he put his hands on you that way? Do you? You’re mine, damn it! He had no fucking right to touch you!” He jumped back to his feet and paced again. “I told you I’d never touch you again unless you asked me to. Unless you wanted it. Tell me you want it, Logan, please.”\u003c/p\u003e\n\u003cp\u003eLogan felt a hard shiver go down his spine fromIan’s desperate tone.\u003c/p\u003e\n\u003cp\u003e“Tell me.”\u003c/p\u003e\n\u003cp\u003eLogan was drawn into Ian’s dark gaze. His eyes seemed to glitter at him, and he smelled so damn goodLogan’s body trembled. \u003c/p\u003e","sourceLink":"https://allnovel.net/logan-s-choice-dark-hollow-wolf-pack-3/page-8.html","bookId":2255,"creation":"Oct 5, 2019 5:15:16 PM","modification":"Oct 5, 2019 5:15:16 PM"}
