{"id":86051,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You just need to loosen up, is all.”\u003c/p\u003e\n\u003cp\u003e“Everything was going fine before you showed up.” I think of my mother, I think of the one-year anniversary of my dad’s death that is rapidly approaching. “Actually, it wasn’t fine, but that’s beside the point.”\u003c/p\u003e\n\u003cp\u003eHe nudges me with his elbow. “You want to talk about it?”\u003c/p\u003e\n\u003cp\u003eI laugh. “With you? No.”\u003c/p\u003e\n\u003cp\u003e“I’m a good listener.”\u003c/p\u003e\n\u003cp\u003e“Sure you are.”\u003c/p\u003e\n\u003cp\u003e“Well, if you ever change your mind . . .”\u003c/p\u003e\n\u003cp\u003eI look out toward the water, the way the reflection of the moon shimmers on the tops of the waves. “Didn’t you have something you wanted to tell me?”\u003c/p\u003e\n\u003cp\u003e“Yes.” He waits until I look at him to begin talking. “I am madly in love with you and want to get married. And have children. We would have beautiful children.”\u003c/p\u003e\n\u003cp\u003e“Is it beyond your capacity to have a serious conversation?” I start to get up.\u003c/p\u003e\n\u003cp\u003e“Wait,” he says. “I’m sorry. Don’t go. There really is something I want to say, and it’s actually of a serious matter. Semi-serious, anyway.”\u003c/p\u003e\n\u003cp\u003e“If it’s not, I’m going to punch you.”\u003c/p\u003e\n\u003cp\u003eHe grins. “How’d you know I like it rough?”\u003c/p\u003e\n\u003cp\u003eI sock him, lightly, on the shoulder. His arm is solid muscle and my hand probably hurts more than his shoulder does.\u003c/p\u003e\n\u003cp\u003e“What I wanted to say,” he continues, “is ‘thank you.’ For helping me out that first night. And going along with it when Allison was giving her dad that story. I could tell you were pissed.”\u003c/p\u003e\n\u003cp\u003e“Nothing I said would’ve made a bit of difference,” I say. “You made the decision, shacking up with the owners’ daughter. She gets what she wants, and they’re not going to let some employee tell them otherwise.”\u003c/p\u003e\n\u003cp\u003eGriffin laughs. “There’s no shacking up going on there, sweetheart, I promise.”\u003c/p\u003e\n\u003cp\u003e“Yeah, okay,” I say skeptically. “Griff.”\u003c/p\u003e\n\u003cp\u003eHe holds his hands up. “Hey, I’m not saying she isn’t hot. But she’s what—sixteen? Seventeen? All set with the statutory rape charges, thank you very much.” “Well, you might want to let her in on that, because she certainly seems awfully enamored with you. And honestly? Knowing Allison, you’re probably not even close to being the oldest guy she’s been with.” Okay, so that was something of a cheap shot but whatever.\u003c/p\u003e\n\u003cp\u003eHe grins. “Are you . . . jealous?”\u003c/p\u003e\n\u003cp\u003eI stand. “Please. Don’t think you’re the first good-looking rich boy I’ve ever met.”\u003c/p\u003e\n\u003cp\u003e“So you do have some experience, then.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“Allison said you were kind of a prude.”\u003c/p\u003e\n\u003cp\u003e“Oh really?” Definitely don’t feel bad about that cheap shot now. “That’s funny, because Allison doesn’t actually know me. I was involved with a guy who was very much like you, if you want to know the truth, and we broke up because I couldn’t stand him. Because he’s arrogant. And an asshole. All things you’re proving to be as well.” I bite my lip. “I mean, you’re just—”\u003c/p\u003e\n\u003cp\u003e“Ouch. So . . . this ex-boyfriend of yours. He a big guy? Think I could take him?”\u003c/p\u003e\n\u003cp\u003e“I think I would love to see the two of you battle it out to the death. Really, I’m just trying to get through this summer.”\u003c/p\u003e\n\u003cp\u003e“Now I’m really curious. You should tell me what’s going on with you. I’m not lying when I say I’m a good listener.”\u003c/p\u003e\n\u003cp\u003e“Speaking of lying . . . I’ve been thinking about it. Any sane person would come clean by now if they weren’t being honest about the whole kidnapping thing. Right?”\u003c/p\u003e\n\u003cp\u003e“Probably.”\u003c/p\u003e\n\u003cp\u003e“And you’re still adamant that it happened.”\u003c/p\u003e\n\u003cp\u003e“Correct.”\u003c/p\u003e\n\u003cp\u003eI sit back down, facing him. “Look me in the eye and tell me that you’re not lying.”\u003c/p\u003e\n\u003cp\u003eHe turns his face so he’s looking directly at me. It’s been probably a day since he’s shaved and his face is covered in dark stubble. His eyes, though, are a clear, bright blue. His expression is serious.\u003c/p\u003e\n\u003cp\u003e“I would never lie to you.”\u003c/p\u003e\n\u003cp\u003e“So you really were kidnapped?”\u003c/p\u003e\n\u003cp\u003e“I was really kidnapped. Is there anything else you’d like to know?”\u003c/p\u003e\n\u003cp\u003eI look back toward the water and wrap my arms around my knees. “A lot,” I say. “But there’s plenty of time for that.”\u003c/p\u003e\n\u003cp\u003eHe smiles, and for a minute I almost feel bad that he thinks I’m being nice because I actually like him.\u003c/p\u003e\n\u003cp\u003eOn Sunday, I go visit Mom. I make us grilled cheese paninis with tomatoes and basil, which is one of her favorite lunches, and we sit at the kitchen table, the window open, a cool breeze blowing through.\u003c/p\u003e\n\u003cp\u003eShe doesn’t eat much of her sandwich, though, and she winces every time she reaches forward to get her glass of water.\u003c/p\u003e\n\u003cp\u003e“Are you doing okay?” I ask.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she says, wincing again. “I’ve got this pain in my shoulder is all. And my back and my neck and my head . . .” She laughs a little and waves her hand. “It’s nothing, Jill.”\u003c/p\u003e\n\u003cp\u003eBut she’s got a sad look on her face, and for a minute I want to tell her what I’m up to, that if Uncle Nate actually is right about their accident, then I am going to do everything I can to get to the bottom of it.\u003c/p\u003e\n\u003cp\u003eInstead, though, I get up and go to the counter where her array of various medications are kept. The painkillers, the antidepressants, the anti-seizure pills. I twist the cap off the bottle of the Vicodin and give her one.\u003c/p\u003e\n\u003cp\u003e“Here, take this.”\u003c/p\u003e\n\u003cp\u003eShe does, like an obedient child, and I imagine that’s how she must feel and I hate that this is what her life is.\u003c/p\u003e\n\u003cp\u003e“Mom,” I say. “Let’s plan on doing something fun soon. Would you be up for that?”\u003c/p\u003e\n\u003cp\u003eShe puts the pill in her mouth and washes it down with a sip of water. “What did you have in mind?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Something, though. It doesn’t have to be anything big, but I’d really like it if you were able to go out and just . . . I don’t know. Have a good time.”\u003c/p\u003e\n\u003cp\u003e“You’re a sweetheart. Yes, that sounds nice. Why don’t you think of something and let me know. Hopefully I’ll feel up for it.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you think about a few things you might feel up for doing. You don’t have to tell me right now, but we can try to plan for it the next Sunday or something.”\u003c/p\u003e\n\u003cp\u003eShe nods. “How are things going at the ranch? Lorrie called me the other day and we had a nice chat. How’s everything with that boy you weren’t getting along with?”\u003c/p\u003e\n\u003cp\u003e“Better.”\u003c/p\u003e\n\u003cp\u003e“That’s good. What’s his name?”\u003c/p\u003e\n\u003cp\u003e“Griffin. He’s actually . . . a little more interesting than I might have first thought.”\u003c/p\u003e\n\u003cp\u003eMom smiles. “In what way?”\u003c/p\u003e\n\u003cp\u003e“Oh, you know . . .” I shrug. “There’s just some things about him that I didn’t realize at first, I guess.”\u003c/p\u003e\n\u003cp\u003e“That’s great, honey. I’m happy to hear that. I’m glad you guys were able to figure things out.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Mom,” I say, even though, really, I haven’t got anything figured out yet.\u003c/p\u003e\n\u003cp\u003eChapter 15: Griffin\u003c/p\u003e\n\u003cp\u003eSome of the campers and I are playing a raucous game of disc golf when I see Jill walking over. She’s wearing her usual four-inch inseam cutoff jeans and work boots and a Sea Horse Ranch t-shirt that’s on the flimsy side, which is a good look for her.\u003c/p\u003e\n\u003cp\u003e“We’re going to be heading out for the hike pretty soon,” she says. “Why don’t you guys go get your packs and then head over to the lodge and Karen will give you your bag lunches.” She looks at me. “Are you joining us?”\u003c/p\u003e\n\u003cp\u003eI hadn’t planned on it, as Jill had always seemed intent on keeping our activities as separate as possible, but a hike would be fun, and if she’s offering, well . . .\u003c/p\u003e\n\u003cp\u003e“I’d be happy to,” I say. A few of the kids cheer and then hurry off to get their daypacks. “Where are we hiking?”\u003c/p\u003e\n\u003cp\u003e“We’re going to drive up to Pacifica and hike Sweeney Ridge.”\u003c/p\u003e\n\u003cp\u003eI grin. “And are you extending the invitation because you’re hoping to push me off the ridge once we make it to the top?”\u003c/p\u003e\n\u003cp\u003eShe gives me a patient smile. “I hadn’t thought about it, but now that you bring it up . . .” Her gaze goes to the retreating backs of the campers as they head down the hill toward their cabins. “I would have full-on mutiny on my hands if I did that. Those kids sure do like you.”\u003c/p\u003e\n\u003cp\u003eI pull a pack of gum from my pocket and take a piece out, then offer one to her. She pauses but then takes it. “It’s because I carry this around with me,” I say, sliding the gum back into my pocket.\u003c/p\u003e\n\u003cp\u003eShe unwraps her piece of gum and puts it in her mouth. “I could carry around all the gum in the world and they wouldn’t adore me half as much as they do you.”\u003c/p\u003e\n\u003cp\u003e“Don’t be so hard on yourself.” Without really thinking about it, I sling my arm around her shoulders. She doesn’t pull away, though, or try to shrug me off. “I’ll teach you everything I know.”\u003c/p\u003e\n\u003cp\u003eChapter 16: Jill\u003c/p\u003e\n\u003cp\u003eSweeney Ridge is the longest hike we take with the campers, and it’s one of my favorite places. If it’s a clear day, as it is today, some of the views you get of the Bay Area are absolutely stunning. Dad and I used to come here a lot, and as we pull into the parking area, it’s hard not to think about him and wish that he were here, too. But the kids are all excited, especially to see the abandoned Nike Missile Base covered in all its graffitied glory.\u003c/p\u003e\n\u003cp\u003eWe take the Mori Ridge and Baquiano Loop, which is a seven-mile loop with about a 1400-foot elevation gain. It will be a challenge for some of the campers, but a lot of the trail is actually paved, and I’m hopeful they’ll all hang in there and be able to see the 360 degree view of the Bay.\u003c/p\u003e\n\u003cp\u003eSome of the campers have stayed behind to go canoeing with Lorrie, Allison, and Karen, so I lead the small group and Griffin brings up the rear. Behind me, I can hear Simon and Heather talking, giggling. I glance over my shoulder and they’re not quite holding hands, but they’re close enough to.\u003c/p\u003e\n\u003cp\u003eWe come to an area of unpaved trail where there is a line of flagstones that you can walk across like lily pads. Dad and I used to make a game of it—who could cross all the stones without falling off, or, as I got older and more coordinated, who could hop across the stones, or skip across them.\u003c/p\u003e\n\u003cp\u003eThat’s what I’m thinking about as I step on the first one, and then Simon starts to say something and I turn, right as I’m about to step onto another rock. I turn my head only slightly, just so my ear is a little closer, but it throws me off balance and I slip. There’s the pain as my ankle twists awkwardly, which is quickly eclipsed by the feeling of the back of my head slamming into the rock I was just standing on.\u003c/p\u003e\n\u003cp\u003eI lie there for a moment, dust rising up around me. A few of the campers have gathered around and their faces take up my entire line of vision, which is slowly draining of color.\u003c/p\u003e\n\u003cp\u003e“Jill? Are you okay?”\u003c/p\u003e\n\u003cp\u003eI blink. The pain in my head is not enormous, but it’s insistent and I know that trying to sit up—which I very much want to do—would not be a good idea. The colors continue to bleed away, until it looks like we’ve been transported back in time and are in a black and white movie.\u003c/p\u003e\n\u003cp\u003e“How odd,” I say, though my voice is barely a whisper.\u003c/p\u003e\n\u003cp\u003e“Go get help!” someone yells, and someone yells something back, and both their voices sound very far away. There is a sensation of falling, of dropping away, and suddenly, all I can see is a very narrow tunnel of sky. It would be easy enough to resist, I think, but it also, in a strange way, feels good, so instead of fighting it, I give in to the sense of falling, I let go, curious to see where I’ll land.\u003c/p\u003e\n\u003cp\u003eNowhere, apparently, because it feels like only a second has passed when I reopen my eyes. Color has returned, though the colors seem harsh and a little too sharp. Griffin is there now too, leaning over me.\u003c/p\u003e\n\u003cp\u003e“I’m okay,” I say, trying to brush his arm off of me. Sitting up now is painful but possible, but as I start to, he puts his hand on my shoulder and holds me down.\u003c/p\u003e\n\u003cp\u003e“You shouldn’t get up yet,” he says. “You just knocked yourself out. You might have a concussion.”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I tell him. “I don’t have a concussion. How long was I out for?”\u003c/p\u003e\n\u003cp\u003e“A minute, maybe. A little less.”\u003c/p\u003e\n\u003cp\u003e“I’m fine, then. Let me sit up.”\u003c/p\u003e\n\u003cp\u003eHe looks at me skeptically and for a second I think he’s not going to let me, but then he does, rocking back on his heels.\u003c/p\u003e\n\u003cp\u003e“I didn’t realize I’d turned so clumsy,” I say. I glance around to see the worried looks on the campers’ faces and I feel bad for scaring them. “Though this is a good lesson to always carry a First Aid kit with you,” I tell them. I touch the back of my head where a small lump is starting to form. \u003c/p\u003e","sourceLink":"https://allnovel.net/fall-with-me/page-12.html","bookId":1898,"creation":"Oct 5, 2019 5:11:33 PM","modification":"Oct 5, 2019 5:11:33 PM"}
