{"id":65058,"no":20,"title":"Page 20","content":"\u003cp\u003eI didn’t burn many calories. I took the elevator to the lobby, walked out onto Fifty-seventh Street, turned right, and walked a few doors to Ninth Avenue. I turned right again, and Armstrong’s was halfway up the block.\u003c/p\u003e\n\u003cp\u003eAnd did I feel a magnetic pull? I don’t know. Maybe. I suppose I was attracted and repelled at the same time, and in about equal measure.\u003c/p\u003e\n\u003cp\u003eI opened the door, walked in, and one breath told me I was in a place where people drank beer and smoked cigarettes. Two thoughts hit me at the same time—that it smelled awful, and that it smelled like home.\u003c/p\u003e\n\u003cp\u003eThere were ten or a dozen people at the bar, and I recognized most of them. Around a third of the tables were occupied. No large parties, just groups of two or three. The conversation throughout was sufficiently muted so that you could hear the music. Jimmy got rid of the jukebox shortly after he opened the joint, and kept the radio on an FM station that played nothing but classical music.\u003c/p\u003e\n\u003cp\u003eThe walls at Armstrong’s are a collection of incongruities, and the pick of the litter is the mounted elk’s head hanging on the rear wall. Directly beneath it, looking across the room at me through a pair of Buddy Holly–style horn-rimmed glasses, was a stocky guy around my age wearing a suit and a tie and a half smile on his thin lips. He was smoking a cigarette. From the looks of the ashtray, it wasn’t his first.\u003c/p\u003e\n\u003cp\u003e“ ‘Lucille,’ ” he said. “You know the song, don’t you? Hell, everybody knows it. She picked a fine time to leave him, with their four snot-nose brats and a crop in the field. So the singer decides not to nail her after all, because he feels sorry for the whiny-ass husband. Never happen in real life, not if she was as fine-looking as the song makes out. Sit down, for God’s sake. What do you want to drink?”\u003c/p\u003e\n\u003cp\u003eThe waitress was new to me, a dishwater blonde, tall and slender. She had an air about her that suggested she was easily confused, but she got the drink order right, bringing me a glass of Coca-Cola and Steffens another Scotch. He said, “Vann Steffens. You don’t remember me, do you?”\u003c/p\u003e\n\u003cp\u003e“Have we met?”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact,” he said, “I don’t know. But I recognized you the minute you walked in. Of course I was expecting you. Couple of times, you and I were in the same place at the same time. Not this place, but one that’s not too far from here. Or was, until it closed. Morrissey’s, the after-hours. You remember the place?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“They performed a humanitarian service, the Brothers Morrissey. Made sure a man didn’t die of thirst just because it was past four in the morning. I was there now and then over the years, and I saw you there at least twice and maybe more’n that. You were with a guy named Devoe, had a piece of a joint on the next block.”\u003c/p\u003e\n\u003cp\u003e“Skip Devoe. His bar was Miss Kitty’s.”\u003c/p\u003e\n\u003cp\u003e“Another joint that’s closed. And it seems to me I heard he died. Our age, wasn’t he? How’d he die?”\u003c/p\u003e\n\u003cp\u003e“Acute pancreatitis,” I said, and that was indeed what it said on Skip’s death certificate. I always figured it was a mix of drink and sadness that took him out.\u003c/p\u003e\n\u003cp\u003eSteffens shook his head. “Hell of a world,” he said. “You and me, did we ever get introduced at Morrissey’s? I can’t say one way or the other. I was never there before three, four in the morning, and by then I was half in the bag, so there are things happened that I don’t remember, and things I remember that never happened. Anyway, when I heard your name the other day, I knew who they were talking about.”\u003c/p\u003e\n\u003cp\u003e“How did that happen?”\u003c/p\u003e\n\u003cp\u003e“A fellow was talking,” he said, “about how you were looking for a fellow named Robert Williams with a wife who maybe had an affair with Jack Ellery, who I understand got himself killed recently.” He lit a cigarette, crumpled the now-empty pack. “You don’t smoke, do you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“And you’re in here drinking Coca-Cola. I heard you were off the booze these days. Make you uncomfortable, sitting in a joint like this?”\u003c/p\u003e\n\u003cp\u003e“No,” I said. That wasn’t entirely true, but I didn’t see that I owed him the truth. “You said your name’s the same as the muckraker.”\u003c/p\u003e\n\u003cp\u003e“Joseph Lincoln Steffens, dropped the Joseph in his writings. Wrote The Shame of the Cities, about municipal corruption. Put an end to it, too, as you may have noticed.” He grinned, dragged on his cigarette. “But what he’s most famous for is what he wrote when he came home from a trip to the Soviet Union. ‘I have seen the future and it works.’ Except everyone got the line slightly wrong, because he wrote that he’d been to the future, not that he’d seen it. And he changed his mind about it anyway, decided it wasn’t the future and it didn’t work. Proving you’d better be careful what you say, because people are going to change the words around on you, and go on quoting them long after you stop believing them yourself.”\u003c/p\u003e\n\u003cp\u003e“Interesting.”\u003c/p\u003e\n\u003cp\u003e“You’re being polite, Matt. I know enough about him to be a bore on the subject, but that comes of sharing a name. And no, we’re not related. The family name got changed a generation or two back. It used to be Steffansson, like the polar explorer, and no, he’s not a relative either.”\u003c/p\u003e\n\u003cp\u003e“And your first name is Vann?”\u003c/p\u003e\n\u003cp\u003e“Evander,” he said. “But I’ve forgiven my mother for that one, God rest her soul. I chopped it down to Van, and then I tagged an extra N onto it because people thought that was my last name, Van Steffens, like Van Dyke and Van Rensselaer.”\u003c/p\u003e\n\u003cp\u003e“And they’re not your relatives, either.”\u003c/p\u003e\n\u003cp\u003e“You begin to see the pattern, huh?” He patted his breast pocket, remembered he’d just finished the pack. “I need a cigarette,” he announced. “Where’s the machine?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “No machine. There’s a little food market next door, the Pioneer. They sell cigarettes.”\u003c/p\u003e\n\u003cp\u003e“And this place doesn’t? Why the hell not?”\u003c/p\u003e\n\u003cp\u003e“Jimmy’s against smoking.”\u003c/p\u003e\n\u003cp\u003e“There’s an ashtray on every table. Half the people in here are smoking.”\u003c/p\u003e\n\u003cp\u003e“He’s not going to prohibit it. He just doesn’t want to encourage it.”\u003c/p\u003e\n\u003cp\u003e“Jesus. Next door?”\u003c/p\u003e\n\u003cp\u003e“Out the door and turn left.”\u003c/p\u003e\n\u003cp\u003e“Jesus. It’s a good thing he’s not against drinking. Place would have a tough time making ends meet.”\u003c/p\u003e\n\u003cp\u003eXX\u003c/p\u003e\n\u003cp\u003eWHILE HE WAS GONE, the waitress came over and emptied the ashtray. I thought about the Morrissey Brothers and the after-hours they used to own and operate, one flight up from an Irish off-Broadway theater. I thought about Skip Devoe, and I thought about Jack Ellery, and I thought about the Scotch and melting ice cubes in Vann Steffens’s glass.\u003c/p\u003e\n\u003cp\u003eThere was a pay phone on the wall at the far end of the bar, and just as I looked at it a fellow with a goatee and a crew cut hung up, checked to see if his quarter had come back, and headed for the men’s room.\u003c/p\u003e\n\u003cp\u003eI called my sponsor. “I’m in a bar,” I said, “meeting an informant, or at least I think that’s what he’s going to turn out to be. I didn’t want to be here but I felt I had to.”\u003c/p\u003e\n\u003cp\u003e“And you’re all right?”\u003c/p\u003e\n\u003cp\u003e“I’ve been drinking a Coke. He left the table, and his Scotch is sitting there, and I figured I’d spend a quarter and wake you up.”\u003c/p\u003e\n\u003cp\u003e“I was awake. The Scotch look good to you?”\u003c/p\u003e\n\u003cp\u003e“It started fucking with my head,” I said. “I’m at Armstrong’s.”\u003c/p\u003e\n\u003cp\u003e“Ah.”\u003c/p\u003e\n\u003cp\u003e“And old times managed to get into the conversation. I never met the guy, but I guess we must have traveled in similar circles.”\u003c/p\u003e\n\u003cp\u003eThrough the window, I saw Steffens emerge from the market. He stopped on the sidewalk to open his pack of Luckies. “There’s my guy,” I told Jim. “I’ll get off now. I’m okay, I just thought I ought to call.”\u003c/p\u003e\n\u003cp\u003e“And you’ve got plenty of quarters.”\u003c/p\u003e\n\u003cp\u003e“Always,” I said.\u003c/p\u003e\n\u003cp\u003e“Best seat in the house,” Steffens said. “You know why?”\u003c/p\u003e\n\u003cp\u003e“I bet you’ll tell me.”\u003c/p\u003e\n\u003cp\u003e“Anywhere else and you’re staring at the fucking moose. Sit right under it and you don’t have to look at it.”\u003c/p\u003e\n\u003cp\u003e“I believe it’s an elk.”\u003c/p\u003e\n\u003cp\u003e“I stand corrected. And, while we’re correcting each other, it’s not the Pioneer. It’s the Pio- meer. The idiots spelled it wrong.”\u003c/p\u003e\n\u003cp\u003e“It used to be part of a chain. Then the affiliation ended, and they had to change the name.”\u003c/p\u003e\n\u003cp\u003e“So they changed one letter.”\u003c/p\u003e\n\u003cp\u003e“Cheaper that way, I guess. Everybody still calls it the Pioneer.”\u003c/p\u003e\n\u003cp\u003e“Pioneer with an M, Saloon with no A, and a smoke-filled room where they won’t sell you cigarettes. You okay with the cola?”\u003c/p\u003e\n\u003cp\u003e“I’m fine. You were starting to tell me about Mr. Williams and his wife.”\u003c/p\u003e\n\u003cp\u003e“I was, and it won’t take long, either. I already told you her name was Lucille. Fine-looking woman, and what you could call free with her favors. I got lucky myself one night, and it never happened again but that doesn’t mean I don’t remember her fondly. I’ll say this much, I’ve never been worried that her old man’s gonna kill me for it.”\u003c/p\u003e\n\u003cp\u003e“That would be Robert Williams, but I think you called him Bobby.”\u003c/p\u003e\n\u003cp\u003e“I did, but there’s as many Bobby Williamses and Bob Williamses as there are Roberts, and what I and pretty much everybody else called him was Scooter.”\u003c/p\u003e\n\u003cp\u003e“Scooter Williams.”\u003c/p\u003e\n\u003cp\u003e“On account of he had one of those whatchacallits, like a motorcycle but dinky.”\u003c/p\u003e\n\u003cp\u003e“A motor scooter.”\u003c/p\u003e\n\u003cp\u003e“Well, duh, obviously, but I was going for the brand. A Vespa? I think that’s it. So they could have called him Vespa Williams, but nobody did. Scooter. I don’t think he kept the thing that long anyway. Rode around on it long enough to get a nickname, then sold it or it got stolen.”\u003c/p\u003e\n\u003cp\u003eScooter was an NYU dropout from somewhere in the Midwest. Got himself a cheap apartment on a bad block on the Lower East Side, met Lucille and married her, and got through the days by smoking a lot of grass and selling enough to pay for what he smoked. He worked now and then for a couple of moving companies, drove a gypsy cab now and then, and did gofer work for the neighborhood Democratic club. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17/page-20.html","bookId":2335,"creation":"Oct 5, 2019 9:56:28 AM","modification":"Oct 5, 2019 9:56:28 AM"}
