{"id":65069,"no":31,"title":"Page 31","content":"\u003cp\u003e“And now he’s dead, and you figure it can’t be a coincidence.”\u003c/p\u003e\n\u003cp\u003e“No,” I said, “I figure it’s almost certainly a coincidence. But I figure it’s worth the price of a hat to rule out the possibility that it’s not.”\u003c/p\u003e\n\u003cp\u003eA hat, in police parlance, is twenty-five dollars. A coat is a hundred. I have no idea what a hat actually costs these days, I can’t remember the last time I went out and bought one, but argot outlasts its origins. A pound is five dollars, and once upon a time that’s what a British pound sterling was worth in American money. I don’t suppose you can get much of a hat for five pounds.\u003c/p\u003e\n\u003cp\u003eAnd a hat was what I’d be buying Joe Durkin. He was a detective at Midtown North, on West Fifty-fourth, and Gramercy Park was well out of his range, but I didn’t know anybody in the precinct where Sattenstein had lived and died, and didn’t want to draw attention by making myself known to whoever had caught the case. Easier to ring Joe and get him to make a couple of phone calls.\u003c/p\u003e\n\u003cp\u003eWhich had led to my sitting across a Formica-topped table from him in a coffee shop on Eighth Avenue. He was there because he was doing me a favor, but we both knew it was the sort of favor a person got paid for.\u003c/p\u003e\n\u003cp\u003e“For the sake of argument,” he said, “let’s say it wasn’t a coincidence, and whoever killed him had a reason. What would that reason be?”\u003c/p\u003e\n\u003cp\u003eTo keep him from telling me something, I thought. Which he might have been ready to do, if I’d had the brains to call him back.\u003c/p\u003e\n\u003cp\u003eI said, “No idea, Joe.”\u003c/p\u003e\n\u003cp\u003e“None at all?”\u003c/p\u003e\n\u003cp\u003e“Well, he had a history. I don’t know if he’s got a yellow sheet, and my guess is he doesn’t, but for a period of time he was a receiver.”\u003c/p\u003e\n\u003cp\u003e“Not on the Jets, I don’t suppose.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if you’re familiar with a man named Selig Wolf, but—”\u003c/p\u003e\n\u003cp\u003e“Jesus, of course I am. A wide receiver if there ever was one.”\u003c/p\u003e\n\u003cp\u003e“Well, Mark’s uncle Selig taught him the business.”\u003c/p\u003e\n\u003cp\u003e“Selig was his uncle?”\u003c/p\u003e\n\u003cp\u003e“His mother’s brother. Younger or older, I forget which.”\u003c/p\u003e\n\u003cp\u003e“Woman’s got a brother, he would pretty much have to be younger or older.”\u003c/p\u003e\n\u003cp\u003e“He could be a twin.”\u003c/p\u003e\n\u003cp\u003e“One’s born first, even with twins. Why are we even having this conversation? Jesus, Selig Wolf. You couldn’t want a better teacher.”\u003c/p\u003e\n\u003cp\u003e“So I gather. He followed in his uncle’s footsteps for a few years, he got wiped out in a burglary, and the whole mess had the effect of scaring him straight.”\u003c/p\u003e\n\u003cp\u003e“And at the time of his death he was teaching mentally challenged children how to tie their shoes. A tough way to make a living, but a noble calling indeed.”\u003c/p\u003e\n\u003cp\u003e“No, he was working as a bookkeeper for a couple of small firms.”\u003c/p\u003e\n\u003cp\u003e“And cooking the books for them.”\u003c/p\u003e\n\u003cp\u003e“Maybe a little.”\u003c/p\u003e\n\u003cp\u003e“You gotta love this city. You really do. He told you all this in an hour?”\u003c/p\u003e\n\u003cp\u003e“So? I just told you the whole thing in about ten minutes.”\u003c/p\u003e\n\u003cp\u003e“But that he went and opened up about it.” He shrugged. “So maybe you’re not bad at what you do. You know, if he never took a bust, odds are there’s nobody in the One-Three that knows he was a fencing master. I might feel obliged to pass the word.”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t have to say where you heard it.”\u003c/p\u003e\n\u003cp\u003e“A snitch,” he said. “A generally reliable source.”\u003c/p\u003e\n\u003cp\u003e“That’s me, all right.” I passed him the two bills I’d palmed earlier, a five and a twenty. “I appreciate this, Joe. And you could use a new hat.”\u003c/p\u003e\n\u003cp\u003e“Hats I got a whole rack of. What I could use is a coat. Oh, man, the look on your face! Worth the price of admission right there. I’m glad to have the hat, my friend, and glad for the chance to sit down with you for a couple of minutes. Things working out for you?”\u003c/p\u003e\n\u003cp\u003e“I get by.”\u003c/p\u003e\n\u003cp\u003e“All we can ask,” he said. “All anybody can ask.”\u003c/p\u003e\n\u003cp\u003eI was back in my room, running it through my mind, when the phone rang. It was Joe, resuming our conversation as if it had never ended. “This Sattenstein,” he said. “Perp might have sized him up as a soft target. On account of he had a bandaged hand.”\u003c/p\u003e\n\u003cp\u003e“It was like that when I saw him.”\u003c/p\u003e\n\u003cp\u003e“You spot a man with a bandaged hand, you’re not worried he’ll fight back. But how’d he hurt the hand? Maybe he hit somebody. So maybe he’s a man with a short fuse, type who’d be apt to take a swing at a guy tries to hold him up.”\u003c/p\u003e\n\u003cp\u003e“With his other hand.”\u003c/p\u003e\n\u003cp\u003e“Whatever. So the perp slams him with whatever he brought along to hit people with. Your traditional blunt instrument.”\u003c/p\u003e\n\u003cp\u003e“It’s possible,” I said. “You just thought this up?”\u003c/p\u003e\n\u003cp\u003e“I picked up the phone and passed on the word about the vic’s famous uncle Selig. Which was news to all concerned, and my guy there showed his appreciation by mentioning the bandaged hand. A little quid for the old pro quo. I’d say one hand washes the other, but the bandage would get in the way.”\u003c/p\u003e\n\u003cp\u003eSo Sattenstein’s sitting home and brooding over the woman who decided she was a lesbian, and the walls are closing in on him and he forgot to pick up a six-pack earlier, so if he wants a beer he has to leave the house. And why not walk a few blocks and drink it in the good company a saloon can provide? And who knows, maybe he’ll get lucky. You never know.\u003c/p\u003e\n\u003cp\u003eAnd there he is, drinking with his left hand because his right hand’s still bandaged. And somebody spots him, tags him when he leaves. Hits him too hard.\u003c/p\u003e\n\u003cp\u003eWhy not?\u003c/p\u003e\n\u003cp\u003eBecause I really wanted that to be how it played out. That way it was sheer coincidence. Fate, kismet, karma. Dumb luck. And if it was any of those things, then it wasn’t my fault.\u003c/p\u003e\n\u003cp\u003eI sat in my room and looked up his telephone number and tried to decide if it looked familiar, if it had been written on the message slip I’d crumpled and tossed. If it looked familiar, it wasn’t because I’d seen it written out, but because I’d dialed it several times when I was first trying to reach the man.\u003c/p\u003e\n\u003cp\u003eI dialed it now, and the machine picked up. I listened to a dead man’s voice. I hung up, wondering how long it would be before someone unplugged the machine, how long before the telephone company cut off the phone service.\u003c/p\u003e\n\u003cp\u003eYou don’t die all at once. Not anymore. These days you die a little at a time.\u003c/p\u003e\n\u003cp\u003eI don’t know how long I sat there, but eventually the thought came to me that I ought to go to a meeting, and I looked at my watch and saw I was too late for any of the noon meetings. It was past two already, and I hadn’t been to a meeting or eaten anything since breakfast.\u003c/p\u003e\n\u003cp\u003eCall your sponsor, a little voice murmured, and I picked up the phone, and when I had the number half dialed I realized I was calling his home number, and he’d be at his shop. I tried his work number and got it wrong, some woman answered, and I apologized and looked up the number, and got a busy signal.\u003c/p\u003e\n\u003cp\u003eI called Jan. The phone rang twice, and I rang off before she could answer.\u003c/p\u003e\n\u003cp\u003eI called Greg. The machine picked up, and I rang off. I’d left him enough messages.\u003c/p\u003e\n\u003cp\u003eBut something made me dial the number again, and this time when the machine picked up I let the message play through to the end. After he’d invited me to leave a message after the beep, a mechanical voice cut in to inform me that the message tape was full.\u003c/p\u003e\n\u003cp\u003eWell, that explained why he hadn’t returned my calls. He hadn’t returned anybody’s calls. Out of town, most likely, and not checking his messages, and—\u003c/p\u003e\n\u003cp\u003eI rushed out of there. When I got to the street, there was an eastbound cab discharging a passenger in front of the big apartment building across the street. I yelled out, ran across the street, dodged traffic.\u003c/p\u003e\n\u003cp\u003e“You could get killed like that,” the driver said. “What’s the big hurry?”\u003c/p\u003e\n\u003cp\u003eI didn’t remember his address. I knew he was on Ninety-ninth between First and Second, and on the uptown side of the street near the middle of the block. There were four houses in a row that looked about the same, and it could have been any of them, but the first one I tried was the second from the right, and I spotted his name on one of the buttons. I pushed it and didn’t get a response, but then I hadn’t been expecting one.\u003c/p\u003e\n\u003cp\u003eThere was a button at the bottom of the column marked Sput, which suggested that the building had a dyslexic superintendent. I rang it, and when nothing happened I rang it again. No response.\u003c/p\u003e\n\u003cp\u003eI rang a couple of apartments on the third floor, and eventually somebody answered and wanted to know who I was and what I wanted. I remembered the smell of mice. “Exterminator,” I said, and the buzzer let me in.\u003c/p\u003e\n\u003cp\u003eI climbed the stairs. The mouse smell was faint, and I doubt I’d have noticed it if I hadn’t remembered our conversation. Mice, cabbage, wet dog with garlic. At the third-floor landing a woman stood in a doorway, frowning at me. If I was an exterminator, why was I empty-handed? Where were my work clothes?\u003c/p\u003e\n\u003cp\u003eBefore she could say anything, I drew out my wallet, flipped it open. I extended a forefinger, pointed upstairs. She shrugged, sighed, returned to her apartment, and I heard the bolt shoot home as she locked her door.\u003c/p\u003e\n\u003cp\u003eI climbed three more flights of stairs and went to Greg’s door. I rang the bell and heard the chimes sound within, and when all was still I knocked on the door. As if that would accomplish anything.\u003c/p\u003e\n\u003cp\u003eI tried the knob. The door was locked. Well, of course it would be locked. It was too late in the year for him to be at Fire Island, but there were enough other places for a week’s vacation, Key West or South Beach or some modest but genteel resort in the Caymans or the Bahamas. And he’d certainly lock up before he left, and what was I doing here anyway? I hadn’t returned a telephone call, which may have been from some other Mark and not the one who’d been killed in a street mugging, and to compensate I’d rushed uptown and flimflammed my way into his building, and wasn’t it time for me to turn around and go home?\u003c/p\u003e\n\u003cp\u003eI tried a credit card on the lock. If it wasn’t bolted, if the spring lock was all that was keeping me out, I might be able to loid my way in. I spent a couple of minutes establishing that such was not the case. The door was locked, and I couldn’t open it, short of kicking it in.\u003c/p\u003e\n\u003cp\u003eIt seemed to me that I could sense something. It seemed to me that I could feel it.\u003c/p\u003e\n\u003cp\u003eI got down on one knee, lowered my face to floor level. There was a space of perhaps a quarter of an inch beneath the bottom of the door. Enough to show light, if there’d been a light on within the apartment. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17/page-31.html","bookId":2335,"creation":"Oct 5, 2019 9:56:28 AM","modification":"Oct 5, 2019 9:56:28 AM"}
