{"id":65072,"no":34,"title":"Page 34","content":"\u003cp\u003e“That’s great,” I said, and finally managed to hang up.\u003c/p\u003e\n\u003cp\u003eSo they were alive, all three of them.\u003c/p\u003e\n\u003cp\u003eI got to the noon meeting at Fireside. There was a message in my box when I got back. Red Man, it said, and there was a number. It took me a minute, but I figured out that it was Dennis Redmond, and made the call from my room.\u003c/p\u003e\n\u003cp\u003e“I figured Monday for the autopsy results,” he said, “but either they’ve got a light load over there or Stillman jumped the queue. No sign of blunt force trauma to the head. Or to any other part of him, as far as that goes.”\u003c/p\u003e\n\u003cp\u003e“So it looks like he did it himself.”\u003c/p\u003e\n\u003cp\u003e“It always did,” he said. “Of course somebody could have drugged him and strung him up. But that didn’t happen either. No drugs in his system, no blood alcohol.”\u003c/p\u003e\n\u003cp\u003eSo he’d died sober.\u003c/p\u003e\n\u003cp\u003e“In fact,” he said, “all the physical evidence supports a verdict of suicide. Strangulation’s the cause of death. There ought to be a law.”\u003c/p\u003e\n\u003cp\u003e“Against suicide? I think there already is.”\u003c/p\u003e\n\u003cp\u003e“Against belts,” he said. “Where do they get off making them strong enough to support a man’s weight? You might as well be putting a loaded gun in the hands of a child.”\u003c/p\u003e\n\u003cp\u003e“How else are people going to keep their pants up?”\u003c/p\u003e\n\u003cp\u003e“What the hell’s wrong with suspenders? Or you could do like they do with fishing line. A certain amount of pressure and it snaps, gives the fish a sporting chance. Why not do the same with belts? A weight of more than a hundred pounds and it breaks. Think of the lives that would be saved.”\u003c/p\u003e\n\u003cp\u003e“And what about children?”\u003c/p\u003e\n\u003cp\u003e“Never thought of it,” he said. “But you’re right, it’d just trigger an epidemic of juvenile suicide. I guess there’s only one answer.”\u003c/p\u003e\n\u003cp\u003e“And that would be?”\u003c/p\u003e\n\u003cp\u003e“Warning labels. Works with cigarettes. Matt, I just thought you’d want to know. Your friend killed himself. Though I don’t suppose it makes you happy to hear that.”\u003c/p\u003e\n\u003cp\u003e“No,” I said. “How could it? But at least it saves me having to figure out what to do next.”\u003c/p\u003e\n\u003cp\u003eI was watching television when the phone rang. ESPN was showing a Gaelic football game, or a match, whatever they call it, and I sat there while a lot of young men in shorts and long-sleeved jerseys showed enormous energy doing something entirely incomprehensible. There was running and passing and kicking involved, and the score kept changing, in what struck me as a wholly arbitrary way.\u003c/p\u003e\n\u003cp\u003eI hit the Mute button and picked up the phone, and it was Jan. She said, “I think we should talk.”\u003c/p\u003e\n\u003cp\u003eXXXIV\u003c/p\u003e\n\u003cp\u003eTIFFANY’S IS THE FAMOUS Fifth Avenue jewelry store, and if I’d told a friend I was off to meet my girlfriend at Tiffany’s, he’d probably assume we’d be shopping for rings. But Tiffany’s is also the name of a coffee shop on Sheridan Square, open twenty-four hours a day, and Jan had picked it as a meeting place because it was midway between her neighborhood and mine.\u003c/p\u003e\n\u003cp\u003eI took my time walking to the subway, but even so I had to wait for her, and she showed up with a companion, a sharp-featured woman in her fifties with unconvincingly black hair. They came to my booth, each carrying a shopping bag, and Jan introduced the woman as Mary Elizabeth. We nodded at each other, and I motioned for them to sit down, and Jan looked at Mary Elizabeth, who shook her head.\u003c/p\u003e\n\u003cp\u003e“We won’t stay,” Jan said. She put her shopping bag on the table, and Mary Elizabeth placed hers alongside it. “I think this is everything,” Jan said.\u003c/p\u003e\n\u003cp\u003eI nodded, lost in thought, and then when nobody moved or said anything I remembered my assigned role in the proceedings. I reached into my pocket and took out a ring of keys. I put them on the table, and they just sat there for a beat, and then Jan reached for them, picked them up, weighed them in her hand, put them in her purse.\u003c/p\u003e\n\u003cp\u003eShe turned to go, and Mary Elizabeth turned with her, and then Jan turned back to face me again. All in a rush she said, “I really hate this, and what I hate most of all is the timing. Right before your anniversary.”\u003c/p\u003e\n\u003cp\u003e“In a couple of days.”\u003c/p\u003e\n\u003cp\u003e“Tuesday, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“I guess so.”\u003c/p\u003e\n\u003cp\u003e“I was going to wait until afterward,” she said, “but I thought maybe that would be worse, and—”\u003c/p\u003e\n\u003cp\u003e“Let it go,” I said.\u003c/p\u003e\n\u003cp\u003e“I just—”\u003c/p\u003e\n\u003cp\u003e“Let it go.”\u003c/p\u003e\n\u003cp\u003eShe looked on the point of tears. Mary Elizabeth said, “Jan,” and she turned and walked after her, to the door and out.\u003c/p\u003e\n\u003cp\u003eI stayed where I was. Two shopping bags shared the top of my table with the cup of coffee I’d ordered but so far hadn’t touched. One shopping bag was from a department store, the other from a company that sold art supplies. Each was a little more than half full, and Jan could have managed both of them herself. Mary Elizabeth, I decided, was there for moral support.\u003c/p\u003e\n\u003cp\u003eI went to St. Paul’s for the evening meeting. Afterward I followed the crowd to the Flame and sat there until everybody went home. I walked down Ninth to Fifty-seventh, then walked on past my hotel and all the way across town to Lexington Avenue. I turned on Lexington and walked down to Thirtieth Street and got there just in time to help set up chairs for the midnight meeting.\u003c/p\u003e\n\u003cp\u003eThere were a few familiar faces in the room but nobody I really knew. They didn’t have a speaker, and the chairperson asked me if I had ninety days clean and sober. I said I’d spoken recently, and didn’t feel up to it. She found somebody else. They can always find somebody.\u003c/p\u003e\n\u003cp\u003eI sat there for an hour and drank a couple of cups of bad coffee and ate a few cookies. I didn’t pay much attention to the speaker and didn’t raise my hand during the discussion. At the end I thought about finding someone to go out for coffee with, and decided the hell with it. I walked up to Forty-second Street and caught a cab the rest of the way home.\u003c/p\u003e\n\u003cp\u003eMy two shopping bags were as I’d left them, unpacked, standing side by side on the floor next to the bed. I went to bed, and they were still there the next morning. When I came back from breakfast, the maid had serviced my room, making my bed with clean sheets, emptying my wastebasket. And the shopping bags remained right where I’d left them.\u003c/p\u003e\n\u003cp\u003eI picked up the phone, called Jim. “I’ve got two shopping bags on my floor,” I said, “and I can’t seem to figure out what to do with them.”\u003c/p\u003e\n\u003cp\u003e“Empty shopping bags?”\u003c/p\u003e\n\u003cp\u003e“About half full.” He waited, and I said, “Clothes of mine. That I’d left at Jan’s place.”\u003c/p\u003e\n\u003cp\u003e“What I like about you,” he said, “is you always come right to the point.”\u003c/p\u003e\n\u003cp\u003eSo I talked and he listened, and I waited for him to ask me why I’d waited the better part of a day before telling him what was going on, but he never said a word about my silence. He waited until I’d run out of words, and then he said, “You knew it was coming.”\u003c/p\u003e\n\u003cp\u003e“I suppose so.”\u003c/p\u003e\n\u003cp\u003e“That make it easier?”\u003c/p\u003e\n\u003cp\u003e“Not especially.”\u003c/p\u003e\n\u003cp\u003e“No, I didn’t think so. How do you feel?”\u003c/p\u003e\n\u003cp\u003e“Devastated.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“Relieved.”\u003c/p\u003e\n\u003cp\u003e“That sounds about right.”\u003c/p\u003e\n\u003cp\u003eI thought for a moment. Then I said, “I keep thinking that I made this happen.”\u003c/p\u003e\n\u003cp\u003e“By going to bed with Donna.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“You realize, of course, that just because you keep thinking it doesn’t change the fact that it doesn’t make any sense.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t?”\u003c/p\u003e\n\u003cp\u003e“Think about it, Matt.”\u003c/p\u003e\n\u003cp\u003e“She didn’t know about Donna.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“She didn’t even pick it up subliminally, because we haven’t spent any time together since then. We’ve barely even talked on the phone.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“I’m just looking for a way for it to be my fault.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“I went to the midnight meeting last night.”\u003c/p\u003e\n\u003cp\u003e“Probably didn’t hurt you.”\u003c/p\u003e\n\u003cp\u003e“Probably not. I think I’ll spend most of the weekend in meetings.”\u003c/p\u003e\n\u003cp\u003e“Not a bad idea.”\u003c/p\u003e\n\u003cp\u003e“SoHo meets tonight. I think I’ll go somewhere else.”\u003c/p\u003e\n\u003cp\u003e“Good thinking.”\u003c/p\u003e\n\u003cp\u003e“Jim? I’m not going to drink.”\u003c/p\u003e\n\u003cp\u003e“Neither am I,” he said. “Isn’t that great?”\u003c/p\u003e\n\u003cp\u003eI went to meetings throughout the weekend, but I was in my room Saturday afternoon just long enough to get a phone call. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17/page-34.html","bookId":2335,"creation":"Oct 5, 2019 9:56:28 AM","modification":"Oct 5, 2019 9:56:28 AM"}
