{"id":65079,"no":41,"title":"Page 41","content":"\u003cp\u003e“Don’t see no problem there,” he said.\u003c/p\u003e\n\u003cp\u003eOutside, Mark looked at my old mattress and nodded his approval. “I always wondered what it would be like to throw one of those out a window.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“One minute it was there,” he said, “and then it wasn’t. It was sort of satisfying, actually. Made more of a noise landing than I thought it would.”\u003c/p\u003e\n\u003cp\u003e“Nobody on the street seemed to notice.”\u003c/p\u003e\n\u003cp\u003e“Well, New York,” he said. “That dude at the desk. Jacob? He was pretty cool about the whole thing. He high on something?”\u003c/p\u003e\n\u003cp\u003e“He has a fondness for cough syrup,” I said.\u003c/p\u003e\n\u003cp\u003e“Well, shit,” Mark said. “Who doesn’t?”\u003c/p\u003e\n\u003cp\u003eXL\u003c/p\u003e\n\u003cp\u003eTHERE WAS TIME for a quick bite before the meeting, and Mark suggested a deli on Broadway. “We’ll take the bike,” he said.\u003c/p\u003e\n\u003cp\u003eIt was eight or ten blocks away, and we got there in a hurry. When we were seated and had ordered our pastrami sandwiches, I excused myself and made a phone call.\u003c/p\u003e\n\u003cp\u003eJim was still at the shop. “I was supposed to call as soon as I got rid of the booze,” I told him, “and it slipped my mind completely.” I brought him up to date, and he asked me how I felt now. “A lot better,” I said.\u003c/p\u003e\n\u003cp\u003eHe said he might be late for the meeting, but that he’d see me there. I went back to the table and told Mark I’d never been on a motorcycle before. “You’re kidding,” he said. “Never?”\u003c/p\u003e\n\u003cp\u003e“Not that I remember,” I said, “and I think it’s something I’d remember. Even in a blackout, that’s the sort of thing that would cut through the fog.”\u003c/p\u003e\n\u003cp\u003e“You should get one, man. Seriously.”\u003c/p\u003e\n\u003cp\u003eThe pastrami was good, the french fries well-done. I liked the place, and wondered how come I’d never happened on it before. It wasn’t that far from my hotel, and I had to have walked past it dozens of times over the years.\u003c/p\u003e\n\u003cp\u003eMark told me parts of his story while we ate. There was a lot of heroin in it, and a lot of hectic trips back and forth across the country. He’d spent a lot of time in Oakland and San Francisco, and sometimes he missed it. “I’ll hear California calling,” he said, “but I’ll hear a needle calling, and it’s the same voice, you know? So I figure for now I’ll stay right where I’m at.”\u003c/p\u003e\n\u003cp\u003eA couple of times over the years I’ve had dreams in which I was capable of flight. I soared over the rooftops, banking and turning effortlessly, reveling in the simple delight of it all. After our meal I got a second ride on the back of Mark’s Harley, from the deli to St. Paul’s, and it had an unreal quality that brought those flying dreams to mind. I had slipped into a zone of unreality when I opened my hotel room door the first time, and in this new world mattresses sailed out of windows and motorcycles tore through the night.\u003c/p\u003e\n\u003cp\u003eThen we walked into the meeting at St. Paul’s and the world came back into focus.\u003c/p\u003e\n\u003cp\u003eJim wasn’t there. I got a cup of coffee and took a seat, and an exchange speaker from Bay Ridge told a story that started at age four, when he circled the living room the morning after a party and polished off the dregs of everybody’s drinks. “Right away,” he said, “I knew what my life was going to be about.”\u003c/p\u003e\n\u003cp\u003eI raised my hand during the discussion and said I’d had a difficult day, and one that had included a challenge to my sobriety. But I’d stayed sober, and what especially pleased me was that I’d actually gone so far as to ask for help, which was by no means characteristic behavior on my part. I’d received the help I needed, made a friend in the process, and capped the experience with an adventure. Just a little adventure, I said, but that was about as much excitement as I could stand. And, I added, if I just managed to go to bed sober, when I woke up the next morning I’d have a year.\u003c/p\u003e\n\u003cp\u003eThat got some applause. Several people congratulated me during the break, including Jim, who must have come in toward the end of the qualification. Afterward the two of us followed the crowd to the Flame, but instead of joining the big table we took a small one by ourselves. He ordered a full meal—he’d come straight to the meeting from the shop—and I had a cup of coffee.\u003c/p\u003e\n\u003cp\u003e“You didn’t go into detail,” he said.\u003c/p\u003e\n\u003cp\u003e“It was a little more drama than I wanted to share. Not that it wouldn’t have made a good story. We wound up throwing the mattress out the window.”\u003c/p\u003e\n\u003cp\u003e“That must have been fun.”\u003c/p\u003e\n\u003cp\u003e“I didn’t get to do it. I went downstairs to make sure it didn’t land on anybody. I figured I’ll have enough names on my Eighth Step list as it is.”\u003c/p\u003e\n\u003cp\u003e“Good thinking.”\u003c/p\u003e\n\u003cp\u003e“Actually,” I said, “Mark did all the thinking. He took complete charge and showed real executive ability. Though I worked out how to replace the mattress.”\u003c/p\u003e\n\u003cp\u003e“You swiped one from an empty room.”\u003c/p\u003e\n\u003cp\u003e“I reassigned it,” I said. “But Jesus, Jim, when I opened the door…”\u003c/p\u003e\n\u003cp\u003eHe let me talk my way through it. When I was done he frowned and said, “It wasn’t a practical joke, was it?”\u003c/p\u003e\n\u003cp\u003e“It was serious as a heart attack,” I said. “You couldn’t file charges, but what it was is attempted murder.”\u003c/p\u003e\n\u003cp\u003e“He figured you’d pick up a drink and it would kill you. And it would have, though it might have taken a couple of years.”\u003c/p\u003e\n\u003cp\u003e“He knew I was getting close,” I said. “And he didn’t want anybody getting close. He killed Jack Ellery because he was convinced he’d wind up in the spotlight as a direct result of Jack’s process of making amends. He killed Mark Sattenstein to keep him quiet, and he killed Greg Stillman to close down my investigation. He didn’t have to do all that, I’d done all I’d signed on to do, but every time he stirred the pot something new floated up and got me into it all over again. So the only way Steve was going to get rid of me was to kill me.”\u003c/p\u003e\n\u003cp\u003e“You know his name?”\u003c/p\u003e\n\u003cp\u003e“His first name. They called him Even Steven, as a counterpart to High-Low Jack. Because Jack had mood swings and Steven didn’t, evidently. He was cool as a pistol.”\u003c/p\u003e\n\u003cp\u003e“Isn’t it—”\u003c/p\u003e\n\u003cp\u003e“Hot as a pistol, cool as a cucumber. A fellow who knew them both hit on the idea of inverting clichés, and it only took him twenty-five years of daily marijuana use to come up with it.”\u003c/p\u003e\n\u003cp\u003e“Cannabis, friend to man.”\u003c/p\u003e\n\u003cp\u003e“If he could get me to drink,” I said, “I probably wouldn’t be able to pursue the investigation any further, and even if I did I’d lack credibility. I’d be another raving drunk with paranoid delusions, and the cops see plenty of those. And if I went on a decent bender, there was a good chance it’d kill me outright, and at the very least it would make me an easy victim. Things happen to people when they’re drunk. They fall down flights of stairs or off subway platforms, they lurch off curbs in front of buses. He’d made Sattenstein’s death look like a mugging and Stillman’s like a suicide, and he could find a way to kill me and make it look like something else.”\u003c/p\u003e\n\u003cp\u003e“And now?”\u003c/p\u003e\n\u003cp\u003e“He’ll look for another way.”\u003c/p\u003e\n\u003cp\u003e“And what will you do?”\u003c/p\u003e\n\u003cp\u003e“Try to get him,” I said, “before he gets me.”\u003c/p\u003e\n\u003cp\u003eHe thought about it. “You know,” he said, “sometimes I’ll sit around the shop all day, and then at the last minute a job comes in and it has to be done in a rush. I wind up missing dinner with my wife and the first half of my meeting.”\u003c/p\u003e\n\u003cp\u003e“And that’s what happened tonight.”\u003c/p\u003e\n\u003cp\u003e“It is,” he said, “and it invariably annoys the bejesus out of me. But nobody pours top-shelf bourbon for me, and nobody’s trying to kill me, so maybe I haven’t got all that much to complain about.”\u003c/p\u003e\n\u003cp\u003eWhen we left the Flame he said, “You know, you’re always going out of your way to walk me home. Tomorrow’s your anniversary, and I think it’s time I walked you home for a change.”\u003c/p\u003e\n\u003cp\u003eAnd when we reached the Northwestern he said, “All these months and I’ve never had a look at your room.”\u003c/p\u003e\n\u003cp\u003e“You want to see it?”\u003c/p\u003e\n\u003cp\u003e“Long as I’m here.”\u003c/p\u003e\n\u003cp\u003eI said, “Jim, I’m all right.”\u003c/p\u003e\n\u003cp\u003e“I know that.”\u003c/p\u003e\n\u003cp\u003e“Mark and I left the room in good shape. There was still a faint odor of bourbon, but we left the window open, so it’ll be gone by now.”\u003c/p\u003e\n\u003cp\u003e“Probably true.”\u003c/p\u003e\n\u003cp\u003e“And he wouldn’t have come back. He tried something and it didn’t work, so he’ll try something else.”\u003c/p\u003e\n\u003cp\u003e“Stands to reason.”\u003c/p\u003e\n\u003cp\u003e“But you still want to come up.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eWe went upstairs, and I opened my door to a room that was just as I’d left it, if a good deal colder. I closed the window. Jim looked around the room, then walked over to the window himself. “Nice view,” he said.\u003c/p\u003e\n\u003cp\u003e“It’s something to look out at,” I said, “when I’m in the mood to look out at something.”\u003c/p\u003e\n\u003cp\u003e“A man couldn’t ask for more. It seems to suit you.”\u003c/p\u003e\n\u003cp\u003e“I think so.”\u003c/p\u003e\n\u003cp\u003e“And when you wake up tomorrow,” he said, “you’ll have a year.”\u003c/p\u003e\n\u003cp\u003e“Sometimes that sounds like a lot,” I said, “and sometimes it doesn’t.”\u003c/p\u003e\n\u003cp\u003e“You know what else you’ll have tomorrow? One more day to get through. And sometimes that’s a lot.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“And it’s all a day at a time, and there’s no need to think in long-range terms, but if you keep it up you might wind up with long-term sobriety. You know how to make sure you achieve that elusive distinction?”\u003c/p\u003e\n\u003cp\u003e“How?” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17/page-41.html","bookId":2335,"creation":"Oct 5, 2019 9:56:28 AM","modification":"Oct 5, 2019 9:56:28 AM"}
