{"id":96238,"no":8,"title":"Page 8","content":"\u003cp\u003eThere were a few things I felt good at: sneaking into mansions, getting in the face of brazen bullies, and decorating in the style of the macabre.\u003c/p\u003e\n\u003cp\u003eI wanted to share my ideas with Jagger because I was sure that I could help out with the opening of the club. I could design, decorate, or even clean. I didn\u0027t care. I\u0027d sweep floors if Ihad to. When I worked at Arm strong Travel, there wasn\u0027t anything I wanted to do--and I was being paid. However, for a chance to be part of the Crypt,I\u0027d be willing to do anything--well, almost anything--for free.\u003c/p\u003e\n\u003cp\u003eThe next night, before I headed to the Mansion to spend time with Alexander, I raced to the factory to plead my case for joining the Crypt\u0027s crew.\u003c/p\u003e\n\u003cp\u003eI found Jagger in one of the main factory rooms pacing and talking on the phone. When he caught sight of me, he quickly ended his call.\u003c/p\u003e\n\u003cp\u003e\"I guess Sebastian told you we were here?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I figured it out on my own,\" I said triumphantly. \"I want to talk to you about something.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\" Jagger seemed pleased. He dusted off anold chair and offered it to me. \"Please sit down.\"\u003c/p\u003e\n\u003cp\u003eI obliged and took a seat.\u003c/p\u003e\n\u003cp\u003e\"What can I do for you?\" he asked intently. If Jagger wasn\u0027t so nefarious and creepyandAlexander\u0027s onetime enemy, he would actually have been sexy. His white hair was jagged and edgy, and his mismatched eyes were intense and mesmerizing.And there was something attractive about the word \"Possess\" that was emblazoned across his upper arm.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to help youwithyour club.\"\u003c/p\u003e\n\u003cp\u003e\"Really. . . ,\" he said ina tone that revealed he was clearlyas surprised as he was suspicious.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m great at decorating. Icanhelp find funthings around town.\"\u003c/p\u003e\n\u003cp\u003eI realized I might be treading on his ego. After all, he did run the Coffin Club. Who was I to tell him he needed help to design a successful club?\u003c/p\u003e\n\u003cp\u003e\"Of course, Iknow youare reallygood at it, too,\" I continued.\u003c/p\u003e\n\u003cp\u003eJagger sized me up. \"Icould use anextra hand,\" he finally said. \"But what about your boyfriend?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure he\u0027ll want to help.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I guessed that. But will he mind us working so closelytogether?\" Jagger whisked back his white locks confidently. \"What if youwind up preferring mycompany?\" He grinned, his fangs catching the light of the flickering candelabra and his blue and green eyes piercing through me.\u003c/p\u003e\n\u003cp\u003eBut I wasn\u0027t interested in his romantic inferences. \"I don\u0027t think that will happen, and he\u0027s not the jealous type.\"\u003c/p\u003e\n\u003cp\u003e\"I imagine he knows about the Crypt?\"\u003c/p\u003e\n\u003cp\u003e\"Uh. . . yes.\"\u003c/p\u003e\n\u003cp\u003e\"And what does he think of the idea? He didn\u0027t seem keenonit whenIbrought it up to him and Sebastianat his party.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think he likes it any more now than he did then.\"\u003c/p\u003e\n\u003cp\u003e\"But you do?\"\u003c/p\u003e\n\u003cp\u003e\"I love the Coffin Club,\" I gushed. \"And I want a place where I can hang out here in Dullsville.\"\u003c/p\u003e\n\u003cp\u003eJagger beamed. His pale skin radiated with the glow of my compliments. He rose, taking in his surrounding as if he was imagining the new club.\u003c/p\u003e\n\u003cp\u003e\"But there\u0027s that whole thing about . . . vampires,\" I said.\u003c/p\u003e\n\u003cp\u003e\"That bothers you?\" He leaned over me, his hair hanging sexily over his eyes.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" I did my best to confront him. \"I think this club should be for mortals only.\"\u003c/p\u003e\n\u003cp\u003e\"I thought that a vampire club would be up your alley.\"\u003c/p\u003e\n\u003cp\u003eIs tood up. \"Uh. . . it is,\" I said sincerely.\u003c/p\u003e\n\u003cp\u003e\"You want to be one,\" he said, stepping incloser.\u003c/p\u003e\n\u003cp\u003e\"I know,\" I said, determined.\u003c/p\u003e\n\u003cp\u003e\"You are in love withone,\" he said witha mischievous grin.\u003c/p\u003e\n\u003cp\u003e\"Iknow, but he\u0027s different.\"\u003c/p\u003e\n\u003cp\u003e\"From me?\" Jagger brushed myhair awayfrom myneck.\u003c/p\u003e\n\u003cp\u003eIstepped back, bumping into mychair. \"From the typical vampire,\" I said sharply.\u003c/p\u003e\n\u003cp\u003eJagger laughed, having funwithhis little game. \"Well . . . youseemed to blend inwiththe Dungeon,\" he said,confronting me again. \"And that Phoenixguy.\"\u003c/p\u003e\n\u003cp\u003eIplaced the chair betweenus, not saying anything. Ididn\u0027t like what he was insinuating, that Iwas attracted to Phoenix--someone other thanmyboyfriend--eventhoughthe realitywas that PhoenixwasAlexander.\u003c/p\u003e\n\u003cp\u003e\"How canyoube inlove witha vampire and not want to have a club where he canattend?\"\u003c/p\u003e\n\u003cp\u003e\"You know I mean nefarious, unknown vampires.\"\u003c/p\u003e\n\u003cp\u003e\"Do I really? You think Alexander is the only be nevolent vampire?\"\u003c/p\u003e\n\u003cp\u003e\"Uh. . . no.\"\u003c/p\u003e\n\u003cp\u003e\"Or are you afraid that if he spends enoughtime around his kind, he might prefer their company?\" he asked,putting his foot on the chair and leaning in. \"He might be reminded of what he is missing.\"\u003c/p\u003e\n\u003cp\u003eThat was something I hadn\u0027t imagined. I had only been thinking about two things--the potential danger of vampires mixing with unsuspecting mortals, and the risk of blowing the coffin lid off of the secret identity of my boyfriend, thus threatening his stay in Dullsville.\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you jealous of Luna?\" Jagger asked coldly. \"Don\u0027t you think it\u0027s weird--Sebastianmeets her and within an hour takes the extra plunge, so to speak?And Alexander has known you for how long now?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s different, and you know that. I\u0027m not a vampire. Luna is.\"\u003c/p\u003e\n\u003cp\u003e\"So she is,\" he said. \"Lucky Luna. So what kind of vampire would you be? The Sebastian kind? Or the Alexander kind?\"\u003c/p\u003e\n\u003cp\u003e\"Icame here to help, not to discuss myboyfriend.\"\u003c/p\u003e\n\u003cp\u003e\"For which club? The mortal one, or the vampire one?\" he asked. \"I find it curious--perhaps more than a coincidence--that Scarlet, Onyx, and Sebastian have been suggesting a mortals-only club. You didn\u0027t happen to talk to them as well, did you?\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t about to admit that I had. \"But they\u0027re right. This townis too small for anincreased vampire population.\u003c/p\u003e\n\u003cp\u003eGossip spreads so quickly here. If the mortal patrons know it is safe, they will want to come. But if they get wind of anything nefarious, then they will want to shut down your club completely.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t seem the type to worry about what others think.\"\u003c/p\u003e\n\u003cp\u003e\"I worry about what their actions can do to myfriends. More vampires in this town--ones not so benign, such as yourself--\" I said for good measure \"--can under mine or even threaten the existence of the ones who already live here.\"\u003c/p\u003e\n\u003cp\u003e\"Alexander--\"\u003c/p\u003e\n\u003cp\u003e\"And now you, Luna, Sebastian, Onyx, and Scarlet.\"\u003c/p\u003e\n\u003cp\u003eHe stood up and thought for a moment as he put the chair back bythe table. \"But it seems to me that you would want this to be a place for you--to hang out with the ones you really want to be with,\" he said. \"Really want to be.\"\u003c/p\u003e\n\u003cp\u003eI fantasized for a moment, imagined myself immersed in a world of vampires, dancing and sipping blood-filled drinks. It was an eye into the Under world that I wouldn\u0027t get by attending Dullsville High but only by partying with vampires and being accepted as one of their own.\u003c/p\u003e\n\u003cp\u003e\"I know . . . but a club full of and attracting more vampires is not good for everyone else. My parents--my brother.The towns people.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll never know we\u0027re here. Unless you tell them.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not going to tell anyone.\" I was miffed that he\u0027d even insinuate that I\u0027d be a blabber mouth after I\u0027d kept the biggest secret from anyone--that my boyfriend was a vampire.\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s risky enoug has it is--with all of you hiding out in this factoryit raises suspicion and fuels gossip. I don\u0027t think it\u0027s a good idea to add to the mixby inviting new vampires.\"\u003c/p\u003e\n\u003cp\u003e\"Then what\u0027s the point of the club? What kind of business would I be running? Besides, I have a few things planned for this club to make it even more special.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll find out soon enough.\"\u003c/p\u003e\n\u003cp\u003e\"A mortal club would be special all on its own. I don\u0027t think you truly understand how amazing it would be for us to have a place to dance,\" I said. \"There isn\u0027t one here. Nothing for anyone to do.And you\u0027d still make a fortune.\u003c/p\u003e\n\u003cp\u003eThere\u0027s a lot of extra money these kids into wnare willing to spend. Why would you want anything to get in the way of\u0026nbsp;\u0026nbsp;that?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure I like people telling me what to do,\" he said, getting in my face. \"Especially people who want to be a member of this club--for eternity.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d pushed Jagger too far.\u003c/p\u003e\n\u003cp\u003e\"Does Alexander know you\u0027re here?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, I do,\" he said from behind me.\u003c/p\u003e\n\u003cp\u003eI was as startled as Jagger was. I whipped around to find Alex ander standing next to me.\u003c/p\u003e\n\u003cp\u003e\"You wouldn\u0027t want anything to jeopardize our truce, would you?\" Jagger asked.\u003c/p\u003e\n\u003cp\u003e\"And I\u0027m sure you wouldn\u0027t as well,\"Alexander shot back.\u003c/p\u003e\n\u003cp\u003eThe ten sion was thick. I wasn\u0027t sure which vampire was going to budge first.\u003c/p\u003e\n\u003cp\u003eJagger softened. \"Your girlfriend was just convincing me how she could help me out.\"\u003c/p\u003e\n\u003cp\u003eI turned to Alexander, awaiting his reaction. Iwasn\u0027t about to let onto Jagger that Ihadn\u0027t toldAlexander yet about assisting him in fixing up the club.\u003c/p\u003e\n\u003cp\u003e\"Yes, I think it\u0027s a good idea for her to help decorate,\" he said.\u003c/p\u003e\n\u003cp\u003eJagger was pleased. He had two antagonists all at once interested in his endeavor.\u003c/p\u003e\n\u003cp\u003e\"Here, let me show youaround,\" he said proudly. \"With the girls pitching in and cooperation from my suppliers for the Coffin Club, this club will be up and running in a few weeks. It doesn\u0027t take anytime to set up a rave--all you need is music and a place to invite people. But I want this to be more than a simple place to party. I want it to be a place to belong.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have a stage, a dance floor, a bar, and as the club expands, so will we,\" Jagger said, giving us a tour of the factory and his vision of the Crypt.\u003c/p\u003e\n\u003cp\u003e\"What is this door to?\" I asked, moving to a door on the far side of the room and twisting the knob. I\u0027d seen on the blue prints that it led to the Covenant. It was locked.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" he said, guiding me away.\u003c/p\u003e\n\u003cp\u003ePerhaps Jagger had had a change of heart. With Sebastian, me, and now Alexander on board and telling him not to invite more vampires to Dullsville, he might not want anything to jeopardize his success.\u003c/p\u003e\n\u003cp\u003e\"So you aren\u0027t planning on spreading word about the club to vampires?\"Alexander asked.\u003c/p\u003e\n\u003cp\u003e\"I think Raven\u0027s right,\" Jagger replied. \"Whyshouldn\u0027t Ifill the club withmortals?\" he said witha wicked grin.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t sure if I\u0027d reallyconvinced him or not. But especiallynow that Jagger had explained the plans for the Crypt,Ireallycouldn\u0027t wait until it opened.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you\u0027ll be part of the club,\" Jagger said. \"You will be the first onthe invitationlist, Raven. I wouldn\u0027t want it anyother way.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/cryptic-cravings-vampire-kisses-8/page-8.html","bookId":2146,"creation":"Oct 5, 2019 6:19:51 PM","modification":"Oct 5, 2019 6:19:51 PM"}
