{"id":34931,"no":23,"title":"FINN AND THE FAIRY SHOEMAKER","content":"Finn O’Shea’s grandmother knew more about fairies than anyone else in the village. One afternoon when the sun was shining on the tops of the Nine Hills, which rose up a few fields beyond the edge of the village, Finn and his grandmother were coming home from a walk. Suddenly the old woman darted forward and picked up the tiniest bit of a gray feather. Her sharp eyes had spied it under the shadow of a foxglove.\n\u003cbr\u003e \n\u003cbr\u003e “What is it, Granny?” asked Finn.\n\u003cbr\u003e \n\u003cbr\u003e “An owl’s feather, lad. It fell out of one of their wee red caps,” said she, laughing quietly. “They had a fine revel in the fields last night, my boy, for it was Midsummer Eve. That is the time when the wee folks are gayest, you know.”\n\u003cbr\u003e \n\u003cbr\u003e 159“I wish I could see them dancing,” said Finn.\n\u003cbr\u003e \n\u003cbr\u003e “Ah, my lad, no mortal can see them so long as they keep their wee red caps on,” said grandmother. “Sometimes in their revels they toss their caps aside, but you see the frogs are always on the lookout to warn the fairies if mortal steps are near. These tiny elves are very clever. Do you see those three circles of green which are a little lighter in color than the rest of the grass? That is where they danced until the village cocks began to crow. Then they made off to the Nine Hills. Ah! It would be a wonderful sight to see the wee folks whirling and gliding about in the white moonlight to the sweetest fairy music. But as I said, few mortals have ever seen them.”\n\u003cbr\u003e \n\u003cbr\u003e “Do they dance every night, grandmother?”\n\u003cbr\u003e \n\u003cbr\u003e “Every night, Finn. If the weather is fine they frolic on the green, especially if the moon is bright. When the nights are wet and stormy they keep inside the hills, where there is an elfin village.”\n\u003cbr\u003e \n\u003cbr\u003e 160Finn look very serious. “Grandmother,” he said, “these wee folks must wear out a good many pairs of shoes.”\n\u003cbr\u003e \n\u003cbr\u003e “That they do, my lad. I’m sure I don’t know what they would do without little Leprechaun, the Fairy Shoemaker. He is the only industrious one among them.”\n\u003cbr\u003e \n\u003cbr\u003e “Tell me about him, Granny,” said Finn.\n\u003cbr\u003e \n\u003cbr\u003e Grandmother sat down on a large stone and looked toward the Nine Hills.\n\u003cbr\u003e \n\u003cbr\u003e “The Fairy Shoemaker is very rich, Finn, richer than my lord O’Toole who lives in the castle by the sea. Indeed, there is no one in all Ireland who has as much gold as this elfin shoemaker who spends his days working for the fairies. All kinds of shoes he makes,—stout little brogans and buskins, high hunting boots, bits of satin slippers that you could stand on a penny, tiny sandals with silver laces and diamond buckles,—all kinds of shoes. O Finn, my lad, he is a wonderful wee old man.”\n\u003cbr\u003e \n\u003cbr\u003e “Where does he keep his money, Granny?”\n\u003cbr\u003e \n\u003cbr\u003e “Why, what a question, my lad! Do you 161think this sly little Elf would let any mortal know that secret? Not he!”\n\u003cbr\u003e \n\u003cbr\u003e “I wonder if anyone has ever seen him,” said Finn.\n\u003cbr\u003e \n\u003cbr\u003e “My lad, your great-grandmother O’Shea knew a poor farmer who found a pot of gold buried in one of his fields. The villagers always believed that the man had in some way caught little Leprechaun, and made him point out the spot where his gold was hidden.”\n\u003cbr\u003e \n\u003cbr\u003e “Granny,” said Finn, “I’d like to catch the Fairy Shoemaker. One pot of his gold would make us very rich, wouldn’t it?”\n\u003cbr\u003e \n\u003cbr\u003e “Catch little Leprechaun, Finn! My lad, you couldn’t do it.”\n\u003cbr\u003e \n\u003cbr\u003e “He is very tiny, grandmother. I’m sure I could hold him easily.”\n\u003cbr\u003e \n\u003cbr\u003e “You would have to catch him, first, Finn. He is the trickiest Elf of all. No one can see him as long as he wears his wee red cap! And if you should chance to find him without it, you wouldn’t dare take your eyes off him for one second or away he would go. Some people say bad luck is sure to come to mortals 162who meddle with the fairies,” said grandmother, looking about cautiously. “It is better to earn your pot of gold, my lad. But come, the sun has gone behind the hills.”\n\u003cbr\u003e \n\u003cbr\u003e Finn was very quiet all the way home. He was wondering how he could catch the Fairy Shoemaker and make the little Elf tell where his treasure crocks were hidden. He would begin the search in good earnest the very next day.\n\u003cbr\u003e \n\u003cbr\u003e In the morning when Finn drove the cow to the pasture, he peeped carefully among the low willows that bordered the brook. He looked all around the big stones in the meadow. Several times he stopped and listened! Once he felt sure he caught the clicking sound of an elfin hammer. It seemed to come from the direction of a tall ragweed, but when Finn drew near, the sound stopped suddenly and he could see nothing. Patiently each day he searched for the little Leprechaun. One afternoon when he was sauntering through a shady glen near the Nine Hills he stooped down to quench his thirst at a tiny spring of clear water. He fancied he heard a faint clicking sound! “Tip-tap, tip-tap.” Finn raised his head quickly and listened!\n\u003cbr\u003e 163\n\u003cbr\u003e 165“Rip-rap-tip-tap\n\u003cbr\u003e Tick-a-tack-too;\n\u003cbr\u003e Tip-tap-tip,\n\u003cbr\u003e Rip-rap-rip,\n\u003cbr\u003e Tick-tack-too.”\n\u003cbr\u003e \n\u003cbr\u003e The sound came from behind a large stone near the spring. Soon the tapping stopped and the shrill voice sang out:\n\u003cbr\u003e “Tip-a tap-tip\n\u003cbr\u003e And tick-a-tack-too,\n\u003cbr\u003e Every stitch helps\n\u003cbr\u003e To finish a shoe.”\n\u003cbr\u003e \n\u003cbr\u003e Finn could hear his heart beat. He crept cautiously along and peeped around the stone. There, on a tiny stool, sat the Fairy Shoemaker hammering away at a wee hunting boot of scarlet leather, which he held between his knees. And his bit of a red cap was hanging on a spear of tall grass! Finn leaped to his 166feet, faced little Leprechaun, seized the red cap, and said, “Good day, sir.”\n\u003cbr\u003e \n\u003cbr\u003e Instantly the little Elf jumped up and looked sharply through his spectacles at Finn. He was about twelve inches tall and his queer little face was full of wrinkles. A long gray beard reached to the top of a leathern apron which almost covered his brown suit.\n\u003cbr\u003e \n\u003cbr\u003e “Good day, sir,” repeated Finn.\n\u003cbr\u003e \n\u003cbr\u003e “Humph!” grunted Leprechaun.\n\u003cbr\u003e \n\u003cbr\u003e Finn went closer, grasped the little Elf’s shoulder, held him tightly, and stared sharply at him.\n\u003cbr\u003e \n\u003cbr\u003e “You’d better be off,” said the Fairy Shoemaker; “I have work to do.”\n\u003cbr\u003e \n\u003cbr\u003e Finn kept his eyes fixed on the wee man, and said, “Come, now, where do you keep your treasure crocks? I shall not let you go until you tell me.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh! Is that all you want?” laughed the Elf. “Well, come along with me.”\n\u003cbr\u003e \n\u003cbr\u003e Finn was delighted. The old man seemed very easy to manage. Leprechaun looked up pleasantly and said, “Your pardon, sir.” He 167pulled out a tiny gold snuffbox, took a pinch and offered some to Finn. “Snuff, sir?” he said with a smile.\n\u003cbr\u003e \n\u003cbr\u003e “Why, how friendly he seems,” thought Finn, taking a pinch.\n\u003cbr\u003e \n\u003cbr\u003e “Pouf-f!!” The Fairy Shoemaker blew all the snuff right into Finn’s face.\n\u003cbr\u003e \n\u003cbr\u003e “Tshoo-oo!—Tshoo-oo! A-a-a-tshoo-oo-oo!” sneezed Finn, shutting his eyes! In a twinkling the wee man had snatched his red cap and was gone!\n\u003cbr\u003e \n\u003cbr\u003e Finn went home a little discouraged. “Why didn’t I remember what Granny told me about his tricks?” he said to himself. “I’ll try again, and he shall not catch me a second time.”\n\u003cbr\u003e \n\u003cbr\u003e One afternoon a few weeks later, Finn walked as far as the Nine Hills. He was very tired, so he lay down on one of the grassy slopes to rest. How quiet it was on the shady hillside!\n\u003cbr\u003e “Tip-a-tap-tip\n\u003cbr\u003e And tick-a-tack-too,\n\u003cbr\u003e Rip-rap-rip\n\u003cbr\u003e Tick-tack-too.”\n\u003cbr\u003e \n\u003cbr\u003e 168The sound came from the crest of the hill. After a little pause a shrill voice sang:\n\u003cbr\u003e “A wedding feast to-night\n\u003cbr\u003e And dancing on the green!\n\u003cbr\u003e In moonbeams’ silver light\n\u003cbr\u003e Gay fairies will be seen!\n\u003cbr\u003e Tiny satin sandals\n\u003cbr\u003e To grace the dainty bride;\n\u003cbr\u003e Stitch away Leprechaun\n\u003cbr\u003e They must be your pride.”\n\u003cbr\u003e \n\u003cbr\u003e It was the voice of little Leprechaun! The Fairy Shoemaker was working away near the crest of the hill. Finn crept up the grassy slope, and there in the shadow of some low bushes sat the tiny Elf. He was putting a high heel on the daintiest white satin sandal. And beside him lay his wee red cap!\n\u003cbr\u003e “Tip-tap-rip-rap\n\u003cbr\u003e Tick-a-tack-too.”\n\u003cbr\u003e \n\u003cbr\u003e The elfin hammer was working busily—busily!\n\u003cbr\u003e \n\u003cbr\u003e Finn slipped up quietly, and grasping the red cap in one hand laid hold of the wee 169man’s shoulder with the other. Up jumped the Elf. He looked round quickly for his cap.\n\u003cbr\u003e \n\u003cbr\u003e “Good day, sir,” said Finn.\n\u003cbr\u003e \n\u003cbr\u003e Leprechaun made a deep bow.\n\u003cbr\u003e \n\u003cbr\u003e “You are busy, I see.”\n\u003cbr\u003e \n\u003cbr\u003e “Always busy, sir,” answered the wee man. “Always busy.”\n\u003cbr\u003e \n\u003cbr\u003e “I suppose you like to make shoes, especially such dainty ones?” And all the time Finn kept his eyes on the little Elf’s face and held him fast.\n\u003cbr\u003e \n\u003cbr\u003e “I like to work” said the Fairy Shoemaker slyly. “Come, now, do you?”\n\u003cbr\u003e \n\u003cbr\u003e Finn felt a little confused at this last question, but he answered,\n\u003cbr\u003e \n\u003cbr\u003e “You have plenty of gold and some to spare, I should think. Come, tell me where you keep your treasure crocks.”\n\u003cbr\u003e \n\u003cbr\u003e “I will show you where I keep one of them,” answered Leprechaun.\n\u003cbr\u003e \n\u003cbr\u003e “All right,” answered Finn. “If you’ll lead me to the spot where one crock of gold is buried, I’ll not bother you again.”\n\u003cbr\u003e \n\u003cbr\u003e “Come, then,” said the Elf.\n\u003cbr\u003e \n\u003cbr\u003e 170“Mind that you keep your snuffbox in your pocket,” said Finn. “You shan’t catch me that way again.”\n\u003cbr\u003e \n\u003cbr\u003e “This way,” laughed the wee man.\n\u003cbr\u003e \n\u003cbr\u003e Down the hillside and over the fields hurried the Fairy Shoemaker, leading Finn along at a good pace. It was wonderful to see this queer Elf skip across the ditches and hedges, and hop over the stones and rough places in the meadow. Finn was becoming very tired. “How much farther is it?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e “Come along, come along,” laughed little Leprechaun.\n\u003cbr\u003e \n\u003cbr\u003e Finally they came to a field full of ragweed. The Fairy Shoemaker stopped suddenly. Then pointing with his tiny finger, he said, “If you dig deep under the roots of this weed, you’ll find one of my treasure crocks filled to the brim with gold.”\n\u003cbr\u003e \n\u003cbr\u003e “But I can’t dig without a spade,” said Finn excitedly.\n\u003cbr\u003e \n\u003cbr\u003e “Of course not,” answered Leprechaun. “But now that you know the spot you can get the gold whenever you like.”\n\u003cbr\u003e \n\u003cbr\u003e 171“I shall get it to-day,” said Finn. “I’ll run home now and get my spade. But I’d better mark the weed, I think.”\n\u003cbr\u003e \n\u003cbr\u003e “That would be a good plan,” said the Shoemaker. “Here I have a bit of bright red string in my pocket. Let us tie it around the stem near the top.”\n\u003cbr\u003e \n\u003cbr\u003e How deftly the elfin fingers tied the mark!\n\u003cbr\u003e \n\u003cbr\u003e “Thank you very kindly,” said Finn.\n\u003cbr\u003e \n\u003cbr\u003e “Is there anything else I can do for you, sir?” asked Leprechaun.\n\u003cbr\u003e \n\u003cbr\u003e “You will promise not to touch the string?”\n\u003cbr\u003e \n\u003cbr\u003e “I promise not to touch it, sir. Also I assure you no one else shall touch it,” said Leprechaun.\n\u003cbr\u003e \n\u003cbr\u003e “Well, then, you may go. Here is your red cap. I thank you very much for your kindness. Good day!” said Finn pleasantly.\n\u003cbr\u003e \n\u003cbr\u003e “Good day, sir,” said the Fairy Shoemaker, and off he scampered, chuckling to himself.\n\u003cbr\u003e \n\u003cbr\u003e You may be sure Finn hurried away to fetch his spade. How surprised Granny would be to hear that he had caught the Fairy Shoemaker. He would not tell her until he 172carried home the treasure. In breathless haste he got his spade and hurried back to the field of ragweed. Then Finn stood still and looked! A bit of bright red string was tied around every ragweed in the field! The Fairy Shoemaker had tricked him again! He thought he heard a low chuckling laugh. Finn listened carefully. From among the weeds he heard a faint voice singing,\n\u003cbr\u003e “How does the little Leprechaun\n\u003cbr\u003e Fill treasure crocks with gold?\n\u003cbr\u003e The live long day he works away\n\u003cbr\u003e From far-off times of old.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1708/50315.html","bookId":653,"creation":"Aug 5, 2019 6:01:13 AM","modification":"Aug 5, 2019 6:01:13 AM"}
