{"id":85163,"no":72,"title":"Page 72","content":"\u003cp\u003eAfternoon, etretat: the light stretches grandly across the beach, but her painting has not gone well. It is her second attempt at this scene -- overturned fishing boats on the shingle. She wants a human figure for it and has finally settled for the effect of two ladies and a gentleman strolling down by the cliffs, city ladies with light-colored parasols who strike a perfect note against the darker, colonnaded arch in the distance. Another painter is present today, too, a bulky man with a brown beard who has set the legs of his easel almost in the tide; she regrets not having chosen him for a subject instead. She and Olivier glance at each other when he passes them on his way to the water\u0027s edge, silent company for their silence.\u003c/p\u003e\n\u003cp\u003eHer sky won\u0027t go right today, even when she adds more white and a fine blending of ocher. Olivier leans over to ask her why she is shaking her head. The ocher in the vast, real light touches his bristling hair, his mustache, his pale shirt. She doesn\u0027t intend it, but when he bends close she puts one hand to his cheek. He catches and holds her fingers, kisses them with a warmth that courses through her. In sight of the windows of the town, in sight of the heavy back of the stranger painting the cliffs, the ladies under their distant parasols, they kiss each other for an endless moment, their third kiss. This time she feels his mouth insisting, opening hers as Yves would have tried only in the darkness of their bedroom. His tongue is strong and his mouth fresh; she understands then, with her arms around his neck, that his youth really is still inside him and that this mouth is the passage into it, a tunnel for the tide.\u003c/p\u003e\n\u003cp\u003eHe stops just as abruptly. \"My dearest.\" He puts down his brush and walks a few paces away, stones sliding audibly under his boots. He stands looking out to sea, and she sees no melodrama, only his need for a greater distance to collect himself. She follows him anyway and slips her hand into his. His hand is older than his mouth. \"No,\" she says. \"It was my fault.\"\u003c/p\u003e\n\u003cp\u003e\"I love you.\" An explanation. He is still gazing out toward the horizon. His voice sounds bleak to her.\u003c/p\u003e\n\u003cp\u003e\"And why is that so hopeless?\" She watches his profile for a response. In a moment he turns and takes her other hand.\u003c/p\u003e\n\u003cp\u003e\"Be careful what you say, my dear.\" His face is composed now, gentle, completely his own. \"An old man\u0027s hope is more fragile than you imagine.\"\u003c/p\u003e\n\u003cp\u003eShe suppresses the urge to stamp her foot on the loose shingle-- that would only make her look childish. \"Why do you think I can\u0027t understand that?\"\u003c/p\u003e\n\u003cp\u003eHe is gripping her hands, still facing her. For once, she likes his disregard of any possible onlookers. \"Perhaps you can,\" he says. He is beginning to smile, his affectionate, grave smile, his teeth yellowed but even. When he smiles she knows where the lines of his face have come from; it solves a mystery every time. She knows now that she loves him, too, not only for who he is but for who he was long before she was born, and because he will someday die with her name on his lips. She puts her arms around him without any invitation, around his lean body, his ribs and waist, under the layers of clothes, and holds him tightly. Her cheek rests on the shoulder of his old jacket, where it fits. His arms go around her completely in return; they are full of living warmth. In that moment, it will later seem to her, all the rest of his brief future is settled, and even the longer reach of hers. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-swan-thieves/page-72.html","bookId":2244,"creation":"Oct 5, 2019 5:05:41 PM","modification":"Oct 5, 2019 5:05:41 PM"}
