{"id":105208,"no":10,"title":"Page 10","content":"\u003cp\u003eBobby and I returned to the tape recording. A few minutes later, Harry approached us with a handheld radio in his mitt.\u003c/p\u003e\n\u003cp\u003e“Gentlemen,” he said, “we have something.” He spoke to the tech agent. “Map.”\u003c/p\u003e\n\u003cp\u003e“City or state?”\u003c/p\u003e\n\u003cp\u003e“City.”\u003c/p\u003e\n\u003cp\u003eThe tech agent spread the map over the table. Bobby and I and all four agents gathered around it.\u003c/p\u003e\n\u003cp\u003e“St. Paul PD found the van on Jackson Street near East Seventh,” Harry said. It took him about ten seconds to locate the spot in the northeast corner of downtown St. Paul.\u003c/p\u003e\n\u003cp\u003e“That’s the Badlands,” I said.\u003c/p\u003e\n\u003cp\u003eHonsa wanted to know, “Badlands?”\u003c/p\u003e\n\u003cp\u003e“In the twenties and thirties, when St. Paul was a haven for gangsters”—I circled the area immediately east of the state capitol campus casually with my finger—“they called this the Badlands because of the speakeasies and the bootleggers and because it was home to some of the gangsters. Poor Irish, Jews, Mexicans, Italians, blacks—they all lived there, too, and mostly they got along but sometimes they didn’t. There’s not much left of it now. Mechanic Arts High School is gone, the synagogues—Sons of Moses, Sons of Abraham—the grocery stores, Diamond’s Bar. It was carved up in the fifties and sixties when they built the freeways.”\u003c/p\u003e\n\u003cp\u003e“How do you know these things?” Harry asked.\u003c/p\u003e\n\u003cp\u003e“It’s my town.”\u003c/p\u003e\n\u003cp\u003e“The immediate area where the car was found has been recently gentrified.” Bobby’s voice was low, and he spoke with a measured cadence. He used his finger as a pointer. “Along here they’ve constructed new condominiums and apartment buildings. On this corner is the Gopher Bar. It’s a run-down joint with a lot of upper-class traffic mixing with the lowlifes. It serves the best chili dogs this side of Chicago.”\u003c/p\u003e\n\u003cp\u003e“Why bring Chicago into it?” I asked just to break the tension. It didn’t work. I was starting to worry about Bobby as much as Honsa was.\u003c/p\u003e\n\u003cp\u003e“The van was reported stolen two weeks ago,” Bobby said. “We could canvass the bar and condos, asking if anyone had seen the driver, make it sound like a simple GTA. Patrolmen only. No plainclothes, no FBI. That should reduce suspicion if there is anyone to see.”\u003c/p\u003e\n\u003cp\u003e“I agree,” said Honsa. “In the meantime, we’ll get a city wrecker to tow the van to our facilities and have a forensics team standing by.”\u003c/p\u003e\n\u003cp\u003e“Go,” Bobby said.\u003c/p\u003e\n\u003cp\u003eHonsa turned. He spoke into a handheld as he walked away. Bobby seemed to relax slightly. He was in control.\u003c/p\u003e\n\u003cp\u003e“Let me hear the tape again,” he said.\u003c/p\u003e\n\u003cp\u003eI was sitting in a maroon wingback chair and staring at the empty fireplace when Shelby descended the stairs. She was carrying a number of large books under her arm. I stood as she crossed the floor. She didn’t speak until she was within striking distance.\u003c/p\u003e\n\u003cp\u003e“I thought you had left,” she said. Her voice didn’t sound much different than Bobby’s. Her fist was clenched, and for a moment I wondered what I would do if she punched me. Nothing, I decided.\u003c/p\u003e\n\u003cp\u003e“How’s Kate?” Bobby asked. Shelby turned her head as he approached. “How’s Katie holding up?” He wrapped his arm around Shelby’s shoulder.\u003c/p\u003e\n\u003cp\u003e“Katie—she’s asleep. She fell asleep.”\u003c/p\u003e\n\u003cp\u003e“That’s good.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“How are you?”\u003c/p\u003e\n\u003cp\u003e“Me?”\u003c/p\u003e\n\u003cp\u003e“How are you holding up?”\u003c/p\u003e\n\u003cp\u003e“I’m not.”\u003c/p\u003e\n\u003cp\u003eShelby rested her head against Bobby’s chest, and he wrapped both of his arms around her and pulled her close.\u003c/p\u003e\n\u003cp\u003e“Bobby, what if—what if…”\u003c/p\u003e\n\u003cp\u003e“Shhhhh.” He stroked her short blond hair. “It’ll be all right, you’ll see.”\u003c/p\u003e\n\u003cp\u003eI turned away. I would have liked to do that, too, comfort Shelby. Only it wasn’t my place. It never would be.\u003c/p\u003e\n\u003cp\u003eI returned to the dining room table and sat down. A few moments later Shelby and Bobby joined me, Bobby’s arm still around her shoulder. Shelby set the books on the table. They were Bobby’s—and my— high school and college yearbooks.\u003c/p\u003e\n\u003cp\u003e“You said before that you might know this—this person,” she said. “Maybe these will help.”\u003c/p\u003e\n\u003cp\u003e“Very good thinking,” Bobby said and kissed her hair just above the ear.\u003c/p\u003e\n\u003cp\u003e“I’m going to get some coffee and go back upstairs. I want to be there if Katie wakes up. I don’t want her to be frightened.”\u003c/p\u003e\n\u003cp\u003e“Good idea,” Bobby said. He kissed Shelby again, this time on the cheek.\u003c/p\u003e\n\u003cp\u003eBefore she left, Shelby rested her hand oh so briefly on the point of my shoulder and gave me a gentle squeeze. I turned to look at her, but she was already walking away. I caught Honsa’s eye as she passed him on her way to the kitchen. He was smiling the same reassuring smile he always smiled.\u003c/p\u003e\n\u003cp\u003eIt was 6:05 by my watch when the phone rang. “Wait, wait,” Honsa said, and we waited until the tech agent started his tape recorder and contacted the phone company. “All right,” the agent said. Bobby answered the phone.\u003c/p\u003e\n\u003cp\u003eThe disguised voice said, “Did you talk to McKenzie?”\u003c/p\u003e\n\u003cp\u003e“I spoke to him.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“And what?” \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-10.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
