{"id":105224,"no":27,"title":"Page 27","content":"\u003cp\u003eInstead of being offended, Ruth said, “A body needs a nice fillet every once in a while, if you know what I mean.”\u003c/p\u003e\n\u003cp\u003eThe women all laughed like they knew exactly what she meant and I was reminded of yet another aphorism, this one more recent: Girls just wanna have fun.\u003c/p\u003e\n\u003cp\u003eMrs. Thomforde pulled out an empty chair and said, “So what brings a nice boy like you to the East Side?”\u003c/p\u003e\n\u003cp\u003e“Isn’t this where all the good-looking women hang out?”\u003c/p\u003e\n\u003cp\u003eThe girls liked that answer, and it occurred to me that if I were into sexagenarian romance, I could have made out like a bandit.\u003c/p\u003e\n\u003cp\u003eI sat in the chair and asked, “So, did anybody win any meat?”\u003c/p\u003e\n\u003cp\u003eTurned out that Ruth won a five-pound package of New York strips that she expected her husband to ruin. “He’s awful. Burns everything. I say, ‘Let me cook the steaks.’ Oh, no, grilling’s a man’s job. He’ll turn these steaks into charcoal, wait and see.”\u003c/p\u003e\n\u003cp\u003eThe girls all nodded in understanding. They had known each other for decades, knew each other’s families as well as they knew their own. The general consensus was that Ruth’s husband could screw up a ham sandwich.\u003c/p\u003e\n\u003cp\u003eWhile they were telling me this, Mrs. Thomforde rested a hand on my forearm. “You brought a friend,” she said.\u003c/p\u003e\n\u003cp\u003e“Actually, she brought me.”\u003c/p\u003e\n\u003cp\u003e“Good evening, Mrs. Thomforde,” Karen said.\u003c/p\u003e\n\u003cp\u003e“What do you want?” Mrs. Thomforde asked. I noticed she didn’t offer Karen a chair.\u003c/p\u003e\n\u003cp\u003e“I’m looking for your son.”\u003c/p\u003e\n\u003cp\u003e“Why? Is he lost?”\u003c/p\u003e\n\u003cp\u003eThe girls all thought that was a pretty witty reply until Karen said, “Yes, he’s lost, and if I don’t find him soon, he’s going back to prison.”\u003c/p\u003e\n\u003cp\u003e“Oh, Jeezus,” said Ruth.\u003c/p\u003e\n\u003cp\u003e“May we speak privately?” Karen asked.\u003c/p\u003e\n\u003cp\u003e“What is it?” Mrs. Thomforde gestured at the other women. “You can speak in front of my friends.”\u003c/p\u003e\n\u003cp\u003eKaren said, “Scottie is late reporting back to the halfway house. Several hours late.”\u003c/p\u003e\n\u003cp\u003e“You’re going to send him back to prison for that? Scottie is a good boy.”\u003c/p\u003e\n\u003cp\u003e“Mrs. Thomforde, everyone in a halfway house program is treated as if they’re incarcerated in jail. If they’re not where they’re supposed to be when they’re supposed to be there—”\u003c/p\u003e\n\u003cp\u003e“You saying that Scottie broke out of jail? That he’s a fugitive?”\u003c/p\u003e\n\u003cp\u003e“If I don’t find him soon, he’ll be treated that way.”\u003c/p\u003e\n\u003cp\u003e“Why can’t you people just leave him alone?”\u003c/p\u003e\n\u003cp\u003eIt was the same question Joley had asked, and it made me angry. I tried not to let it show.\u003c/p\u003e\n\u003cp\u003e“Mrs. Thomforde,” said Karen. “The way the system works—”\u003c/p\u003e\n\u003cp\u003e“The system, the system. I hate the system. The system put a seventeen-year-old child in prison for a crime he didn’t even commit. He didn’t shoot that cop. That other boy shot him. The cop wasn’t even hurt that bad. Only they punished Scottie for it, and see what’s happened? Do you see? His life was ruined, that’s what happened. The system—”\u003c/p\u003e\n\u003cp\u003e“Mrs. Thomforde,” said Karen.\u003c/p\u003e\n\u003cp\u003e“—is terrible. The system doesn’t work. Now you say that Scottie’s run away—”\u003c/p\u003e\n\u003cp\u003e“I didn’t say that.”\u003c/p\u003e\n\u003cp\u003e“Wouldn’t you run away, too, from such a system?” Mrs. Thomforde glared at Karen; her mouth was twisted with fury. “He wouldn’t be running away if he was living at my house. None of this would happen if you let him stay with me. I thought you were going to let him stay with me?”\u003c/p\u003e\n\u003cp\u003e“That’s what I thought, too,” Ruth said. The girls were listening intently.\u003c/p\u003e\n\u003cp\u003e“I don’t see how that’s going to happen now,” Karen said. Her frustration was palpable; whatever empathy she felt for Mrs. Thomforde had been left at the curb. “After this incident…” Karen shook a finger at the older woman. “When he was furloughed to your home the last time, he didn’t stay there the entire weekend like he was supposed to. Did he?”\u003c/p\u003e\n\u003cp\u003e“He certainly did. He was in the house the whole time.” I noticed that Mrs. Thomforde was looking upward and to her left when she spoke. “He helped me do some chores around the house, helped me move furniture and clean. He played the drums. He’s such a fine musician.”\u003c/p\u003e\n\u003cp\u003e“He was seen in a bar, Mrs. Thomforde. That’s a terrible violation of the terms of his parole.”\u003c/p\u003e\n\u003cp\u003e“I don’t know where you’re getting your information, but you better go back and get some more. Anyone saying Scottie wasn’t at my house is lying. Scottie wasn’t anywhere else but at my house for the entire weekend. We had a family reunion. The entire family came over and we had dinner together. Scottie played the drums for us.”\u003c/p\u003e\n\u003cp\u003e“Mrs. Thomforde—”\u003c/p\u003e\n\u003cp\u003e“Are you saying she’s a liar?” one of the East Siders asked. “We don’t lie.”\u003c/p\u003e\n\u003cp\u003eI liked the collective “We,” but didn’t say so.\u003c/p\u003e\n\u003cp\u003e“What’s important is where Scottie is now,” Karen said. “Do you know, Mrs. Thomforde?”\u003c/p\u003e\n\u003cp\u003e“No, I don’t. You’re the one who’s supposed to be watching him.” \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-27.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
