{"id":105226,"no":29,"title":"Page 29","content":"\u003cp\u003e“It has authentic Mexican food,” I said. “The best in town. Unless you prefer Taco Bell.”\u003c/p\u003e\n\u003cp\u003eI had the impression that she did. Just the same, I parked in the lot next to a Lexus SUV, which was parked next to a Ford minivan, and joined the line. Karen followed reluctantly. The owner, a man named José, stood behind a white folding table loaded with pastel-colored coolers containing soft drinks. He scribbled orders on a pad and handed them through a window into the kitchen inside the trailer. There was a large chalkboard to his right. The trailer served a full menu, yet I recommended the tacos. The tortillas were warmed on a griddle and piled high with chopped onions, fresh cilantro, hot sauce, and your choice of fifteen different kinds of meat, including cow brains. I ordered chicken. Karen requested shrimp. I didn’t say anything at the time, but shrimp tacos? Really? That’s so Southern California.\u003c/p\u003e\n\u003cp\u003eThere were a few picnic tables with huge umbrellas scattered around the lot, only they were all full, so we ate with the Audi between us, using the hood for a table.\u003c/p\u003e\n\u003cp\u003e“This is amazing,” Karen said after her second bite.\u003c/p\u003e\n\u003cp\u003e“What did I tell you?”\u003c/p\u003e\n\u003cp\u003e“The sauce, though. It’s so hot.”\u003c/p\u003e\n\u003cp\u003e“I like it that way.”\u003c/p\u003e\n\u003cp\u003eWe continued eating in silence until Karen asked, “How do they get away with this, selling food in a vacant lot?”\u003c/p\u003e\n\u003cp\u003e“The owners get away with it because no one has complained yet. I mean, look. Their customers love them.” The lot was filled with every ethnic group you can find on the East Side: Hispanics, Somalis, Hmong, Native Americans, blacks, and whites, some with money, some obviously without—a true melting pot. “ ’Course, it’s only a matter of time.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Sooner or later someone will complain, and the city will step in with their ordinances and permit requirements and zoning regulations and shut it all down. The owners and their customers will protest, yet in the end the city council will explain how it’s making St. Paul a better place to live, and that will be that.”\u003c/p\u003e\n\u003cp\u003e“You’re a cynical man, McKenzie.”\u003c/p\u003e\n\u003cp\u003e“No, I’m not. I’m just having a very bad day.”\u003c/p\u003e\n\u003cp\u003eNot as bad as the Dunstons, my inner voice reminded me.\u003c/p\u003e\n\u003cp\u003e“Do you think Mrs. Thomforde was calling Scottie?” Karen asked.\u003c/p\u003e\n\u003cp\u003e“Who else would she call? All her friends were sitting at the table.”\u003c/p\u003e\n\u003cp\u003eKaren took her last bite of taco and washed it down with bottled water. “What do we do now?” she asked.\u003c/p\u003e\n\u003cp\u003e“If you’re up to it, we could visit Lehane’s and ask around, see if any of the regulars can give us a handle on this T-Man.”\u003c/p\u003e\n\u003cp\u003e“What do you mean, if I’m up to it?”\u003c/p\u003e\n\u003cp\u003e“It’s a dangerous place. More Minnesotans have been killed in and around Lehane’s than in Iraq.”\u003c/p\u003e\n\u003cp\u003e“It’s not that bad.”\u003c/p\u003e\n\u003cp\u003e“How would you know?”\u003c/p\u003e\n\u003cp\u003e“I’ve been there.”\u003c/p\u003e\n\u003cp\u003e“Alone?”\u003c/p\u003e\n\u003cp\u003e“No, I was—all right, I was with police officers looking to serve an apprehension and detention warrant on an offender.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, it’s different when you have guns. We should get guns.”\u003c/p\u003e\n\u003cp\u003e“No guns.”\u003c/p\u003e\n\u003cp\u003e“Karen.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Fine.”\u003c/p\u003e\n\u003cp\u003e“They’re not going to talk to you anyway, McKenzie. You start asking questions of that crowd and they’re going to kick your ass.”\u003c/p\u003e\n\u003cp\u003e“That’s debatable.”\u003c/p\u003e\n\u003cp\u003e“They might talk to me, though.”\u003c/p\u003e\n\u003cp\u003e“What makes you so popular?”\u003c/p\u003e\n\u003cp\u003eKaren’s blue shirt was open at the collar. She reached up, undid the next two buttons, and batted her eyelashes at me. “I’m a babe,” she said.\u003c/p\u003e\n\u003cp\u003eI hadn’t thought so when I first met her, but I was beginning to reconsider.\u003c/p\u003e\n\u003cp\u003e“Oh, this should be fun,” I said.\u003c/p\u003e\n\u003cp\u003eLehane’s was three blocks away from the taco trailer, yet it might as well have been on the far side of the moon for all the similarities. For one thing, there were no minorities. Lehane’s was whites only, and you didn’t need a sign in the window to figure it out. The place reeked of bigotry and hate. Men didn’t go there to relax or watch the ball game. They went to Lehane’s to nurse their grudges against mankind and to plot their revenge. They went there to rage against the world and their place in it. \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-29.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
