{"id":105238,"no":41,"title":"Page 41","content":"\u003cp\u003e“I understand.”\u003c/p\u003e\n\u003cp\u003e“—to find out if there was any news.”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003e“I’ll just hang up, then, and—”\u003c/p\u003e\n\u003cp\u003e“Karen?”\u003c/p\u003e\n\u003cp\u003e“—call some other time.”\u003c/p\u003e\n\u003cp\u003e“Karen? We haven’t heard from the kidnappers today.”\u003c/p\u003e\n\u003cp\u003e“Not at all?”\u003c/p\u003e\n\u003cp\u003e“Meanwhile, Scottie Thomforde is going about his life as if nothing has happened.”\u003c/p\u003e\n\u003cp\u003eThere was a long pause on the other end, and for a moment I thought she might have hung up. Finally Karen said, “If you want to ask me, go ’head.”\u003c/p\u003e\n\u003cp\u003e“When we went to the halfway house last night, I stayed in the car so Scottie wouldn’t freak out. I wasn’t there to hear your conversation. I don’t know what was said.”\u003c/p\u003e\n\u003cp\u003e“You can ask. I won’t mind.”\u003c/p\u003e\n\u003cp\u003e“Did you tip Scottie off?”\u003c/p\u003e\n\u003cp\u003e“No, McKenzie. I didn’t.”\u003c/p\u003e\n\u003cp\u003eI believed her. I needed to.\u003c/p\u003e\n\u003cp\u003eThe twenties and fifties that we culled from the night deposits were funneled through two Canon CR-180 scanners featuring optical character recognition software. When the process was complete, Harry would have two DVDs containing the images—front and back—and serial numbers of thirty-five thousand bills. This, I was told, is what they mean by “marking money.”\u003c/p\u003e\n\u003cp\u003e“What?” Harry told me. “Did you think we put a little blue dot on the top right-hand corner of each bill?”\u003c/p\u003e\n\u003cp\u003eI wondered aloud how the banks would be able to read the serial numbers off the bills when the kidnappers started to spend them. Harry rolled his eyes at me.\u003c/p\u003e\n\u003cp\u003e“They can’t,” he said. “Tracking actual bills is nearly impossible. Remember the Piper kidnapping in ’72?”\u003c/p\u003e\n\u003cp\u003eI told Harry that I was still eating Crayons in 1972.\u003c/p\u003e\n\u003cp\u003e“Virginia Piper was kidnapped from her stately manor in Orono,” Harry said. “When her husband came home, he found a tied-up house -keeper and a note demanding one million dollars.”\u003c/p\u003e\n\u003cp\u003e“It’s nice to see inflation hasn’t hit the kidnapping industry,” I said.\u003c/p\u003e\n\u003cp\u003e“Her husband was a retired investment banker. He dropped the ransom—all in twenties—behind a North Minneapolis bar. Those bills were marked, too. The next day they found Virginia Piper chained to a tree in Jay Cooke State Park up north.”\u003c/p\u003e\n\u003cp\u003e“Alive?”\u003c/p\u003e\n\u003cp\u003e“Yes, alive. But in all the years since the kidnapping, we’ve been able to recover only four thousand dollars of the ransom.”\u003c/p\u003e\n\u003cp\u003eI gestured at the machines. “What’s the point of all this, then?”\u003c/p\u003e\n\u003cp\u003e“The point is, when we do catch the kidnappers and find the ransom money on them, we can point and go, ‘Ahh-haa!’ ”\u003c/p\u003e\n\u003cp\u003eWhich seemed like a reasonable plan to me. Except the scanners could only record 180 bills per minute. Our progress slowed to a crawl.\u003c/p\u003e\n\u003cp\u003eNeil Edward Starr read the time aloud. “Ten twenty-two P.M. You might not believe this,” he said, “but putting all this together in less than eight hours is kind of amazing.”\u003c/p\u003e\n\u003cp\u003eThe currency had been divided among three Star Case 306 aluminum cases with combination locks. The cases were about eighteen inches long, twelve inches high, and six inches deep and were just big enough to contain all the bills: ten thousand fifties in one case and twelve thousand five hundred twenties in each of the other two. I figured the cases must have retailed for about a hundred bucks each, and I offered to pay for them. Starr wouldn’t think of it.\u003c/p\u003e\n\u003cp\u003e“All part of the service,” he said. “If you had opened a personal savings account, I would have thrown in a free toaster, too.”\u003c/p\u003e\n\u003cp\u003eI signed a receipt for the money and lifted one of the aluminum cases. As impressed as I had been by the actual bulk of the money, the weight caught me by surprise.\u003c/p\u003e\n\u003cp\u003e“Each bill weighs about one gram,” Starr said. “There are four hundred and fifty-four grams to a pound. You have thirty-five thousand bills. Do the math.”\u003c/p\u003e\n\u003cp\u003e“Seventy-seven pounds,” Harry said. He reached down and grasped the handle of the case containing the fifties. “I’ll take the light one.”\u003c/p\u003e\n\u003cp\u003e“We can lend you an armored truck to take you wherever you want to go,” Starr said.\u003c/p\u003e\n\u003cp\u003e“That might be just a little conspicuous,” Harry said.\u003c/p\u003e\n\u003cp\u003e“An armed escort, then.”\u003c/p\u003e\n\u003cp\u003e“Thank you, sir. We can take it from here.”\u003c/p\u003e\n\u003cp\u003eWe loaded the aluminum cases into the trunk of Harry’s car while Harry retrieved his SIG Sauer.\u003c/p\u003e\n\u003cp\u003e“Will you let me know what happens with that little girl?” Starr said.\u003c/p\u003e\n\u003cp\u003eI told him I would.\u003c/p\u003e\n\u003cp\u003e“I don’t know if I told you, McKenzie, but I have a daughter, too.”\u003c/p\u003e\n\u003cp\u003eHarry and I lugged the aluminum cases into Bobby Dunston’s house. Bobby met us at the door, and I gave him one of the cases. He seemed as surprised by the weight as I had been. We carried them to the dining room table, set them on top.\u003c/p\u003e\n\u003cp\u003e“Open it,” I said.\u003c/p\u003e\n\u003cp\u003e“What’s the combination?”\u003c/p\u003e\n\u003cp\u003e“I set it for your wife’s birthday.”\u003c/p\u003e\n\u003cp\u003eI quickly opened my case and stepped back. Bobby was having trouble with his. “Zero six twenty-seven?” he asked.\u003c/p\u003e\n\u003cp\u003e“Zero six twenty-eight,” I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-41.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
