{"id":105252,"no":55,"title":"Page 55","content":"\u003cp\u003eStill, officer down?\u003c/p\u003e\n\u003cp\u003eI rushed to his car. There was a bullet hole in the driver’s side door. The agent was giving his position and status when I yanked the door open. His left hand was pressed hard against his upper thigh. Blood was spilling from between his fingers and soaking his trousers and the car seat. I gently lifted his hand off his thigh to examine the wound, only I couldn’t see the bullet hole for the stream of blood that was pumping out of it. I returned his hand, knelt on the asphalt, and began removing the laces from my Nikes to use as a tourniquet. The agent didn’t miss a beat, still speaking calmly as he described the car. “Late-model dark blue Chevrolet Impala, Minnesota plates, first two digits G as in George, P as in Peter, heading west on Kenwood Parkway when last seen.” I slid the shoelace around his leg and tied it above the wound. “We cannot pursue. Repeat, we cannot pursue. Dammit,” he added after he set the handheld on the seat next to him.\u003c/p\u003e\n\u003cp\u003e“You got a pen?” I asked.\u003c/p\u003e\n\u003cp\u003e“A pen?” The agent searched his inside jacket pocket and produced a Paper Mate. I used it to twist the shoelace until it was tight around his thigh and the flow of blood ceased. I held it tight with both hands. Several sirens wailed in the distance. When a member of the law enforcement community goes down, people move fast. The tech agent leaned back against the seat and brought his hand to his forehead. He smeared himself with blood, realized what he was doing, took his hand away, and stared at the stained fingers.\u003c/p\u003e\n\u003cp\u003e“Oh, man,” he said. “My wife is going to kill me.”\u003c/p\u003e\n\u003cp\u003e“How’s your agent?” I asked.\u003c/p\u003e\n\u003cp\u003e“He’ll live,” Harry said.\u003c/p\u003e\n\u003cp\u003e“Gosh, that’s funny,” I told him, but I really didn’t think so, and Harry knew it.\u003c/p\u003e\n\u003cp\u003e“Bullet nicked an artery,” he said. “He lost some blood; he’s okay now. I doubt he’ll be out more than a couple of days.”\u003c/p\u003e\n\u003cp\u003e“How’s his wife taking it?”\u003c/p\u003e\n\u003cp\u003e“She’s upset.”\u003c/p\u003e\n\u003cp\u003e“Your agent thought she might be.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but I think she’ll get over it. They locked the door behind me when I left the hospital room.”\u003c/p\u003e\n\u003cp\u003e“Bullet wounds as an aphrodisiac—we should try that.”\u003c/p\u003e\n\u003cp\u003e“You first. Listen, McKenzie, I appreciate you taking care of my agent.”\u003c/p\u003e\n\u003cp\u003e“Least I could do,” I said. “It had to be the second kidnapper, you know. Who else knew where my car was parked?”\u003c/p\u003e\n\u003cp\u003e“Are you sure about the shooter’s vehicle?”\u003c/p\u003e\n\u003cp\u003e“Blue Chevy Impala. Your agent got the digits G and P, but I can’t confirm it. I was too busy crawling on my belly.”\u003c/p\u003e\n\u003cp\u003e“Not a Vibe?”\u003c/p\u003e\n\u003cp\u003e“Not even close.”\u003c/p\u003e\n\u003cp\u003e“The Walker has security cameras aimed at the front of their building and the Sculpture Garden. We’re examining the tapes to see if they’ll give us a lead. There are a lot of cameras in apartment buildings and businesses near the ransom drop. We’re looking at those, too. Did you sign your statement?”\u003c/p\u003e\n\u003cp\u003e“I did.”\u003c/p\u003e\n\u003cp\u003e“We’ll ask you to take a gander at some pictures later if we generate any, but for now, you can take off.”\u003c/p\u003e\n\u003cp\u003e“Where’s my Audi?”\u003c/p\u003e\n\u003cp\u003e“Let me make a quick call.” After Harry hung up the phone, he said, “It’ll be out front in a few minutes. Sorry about the damage. I hope your insurance company will cover it.”\u003c/p\u003e\n\u003cp\u003e“They didn’t the last time someone shot it up. They did raise my rates, though. I now pay high-risk insurance.”\u003c/p\u003e\n\u003cp\u003e“This sort of thing doesn’t happen very often, you know.”\u003c/p\u003e\n\u003cp\u003e“Really? It happens to me all the time.”\u003c/p\u003e\n\u003cp\u003e“I mean kidnappers trying to kill the mark after the ransom is delivered, after the victim is freed. Usually they’re either too busy counting their money or running like hell. Honsa thinks that mentioning Scottie’s name the way you did might have spooked him. He thinks the kidnapper ambushed you because he’s afraid you can identify him somehow.”\u003c/p\u003e\n\u003cp\u003e“If I could, I would.”\u003c/p\u003e\n\u003cp\u003e“Think about it. If you come up with anything, you’ll let us know?”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003e“Please, McKenzie. Let us deal with this. Don’t go out and play detective.”\u003c/p\u003e\n\u003cp\u003e“Who? Me?”\u003c/p\u003e\n\u003cp\u003e“I don’t blame your insurance company. You are high risk.”\u003c/p\u003e\n\u003cp\u003e14 \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-55.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
