{"id":105261,"no":64,"title":"Page 64","content":"\u003cp\u003eI explained that as well.\u003c/p\u003e\n\u003cp\u003e“No specific individual to watch for,” Schroeder said. “Makes it tougher. Where is the lady now?”\u003c/p\u003e\n\u003cp\u003e“Rickie’s.”\u003c/p\u003e\n\u003cp\u003e“Okay. I’ll pull in a couple of guys. We’ll go over there. You can introduce us. We’ll give her a couple of rules to follow—”\u003c/p\u003e\n\u003cp\u003e“Umm.”\u003c/p\u003e\n\u003cp\u003e“Umm, what?”\u003c/p\u003e\n\u003cp\u003e“You can’t let her know that you’re watching her.”\u003c/p\u003e\n\u003cp\u003eSchroeder studied me for a few beats. “That’ll cost you extra,” he said.\u003c/p\u003e\n\u003cp\u003e“Price is no object.”\u003c/p\u003e\n\u003cp\u003e“People say that, yet they rarely mean it.”\u003c/p\u003e\n\u003cp\u003e“I mean it.”\u003c/p\u003e\n\u003cp\u003e“What about you? Want a couple guys watching your back?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “Nah,” I said. “I’m a big boy. I can take care of myself.”\u003c/p\u003e\n\u003cp\u003e“Famous last words,” Schroeder said.\u003c/p\u003e\n\u003cp\u003eI decided to take Harry’s advice—finally—and go home. In fact, that was the plan after I stopped for a meal at a pretty good deli I knew on Como Avenue. Only my cell phone rang—I still hadn’t changed the damn ringtone. A voice from my sordid past told me I should drive to a club in downtown Minneapolis.\u003c/p\u003e\n\u003cp\u003e“You really want to meet me,” Chopper said. “You really want to meet me right now. It’s what you call a matter of life and death.”\u003c/p\u003e\n\u003cp\u003eStroll along Block E in downtown Minneapolis these days and you’ll hear opera—La Bohème, Tosca, Madame Butterfly, Don Giovanni, La Traviata. They were playing Bellini’s Norma from a speaker on the corner of Seventh and Hennepin when I crossed the street. It was meant to drive off the riffraff that were now congregating in the area between Hennepin and First avenues and Sixth and Seventh streets. I suppose it might work. Opera, after all, is a complex art form that uses a different style of voice than we’re accustomed to, and that makes some people uncomfortable. On the other hand, I didn’t care for the music at all until an ex-girlfriend exposed me to it, and now I like it, so who knows? Instead of ridding the streets of the less desirable among us, it might turn them into opera fans.\u003c/p\u003e\n\u003cp\u003eStill, you can’t blame the local merchants for trying. There was a time not too long ago when a tourist couldn’t swing a commemorative shopping bag on Block E without hitting a prostitute, john, pimp, drug dealer, drug addict, mugger, pickpocket, panhandler, or loitering teenager. It was the most notorious chunk of real estate in Minneapolis, a place of disreputable businesses, rough-and-tumble bars, peep shows, sex-oriented bookstores, and tripleX movie theaters that accounted for 25 percent of all the arrests in the city. The city council’s response to this blight on their fair community was to invoke eminent domain, seize all the businesses, and bulldoze them, literally turning Block E into an asphalt parking lot, thereby impelling the sinners to locate elsewhere.\u003c/p\u003e\n\u003cp\u003eA decade later, a few enterprising entrepreneurs decided that E stood for “Entertainment” and subsequently transformed the block into the crown jewel of Minneapolis’s thriving club and theater scene. A movie house, a pizza joint, an ice cream parlor, a game center, a Hard Rock Cafe, and other attractions were brought in, and the area was lit up like the inside of the Hubert H. Humphrey Metrodome during a ball game. Only, along with the tourists and suburbanites, the bright lights also attracted a criminal element, and Block E was once again becoming known for its casual shootings and what the cops euphemistically referred to as “disturbances.” Thus the experiment with opera. I almost felt guilty for humming along.\u003c/p\u003e\n\u003cp\u003eI found Chopper in an upscale club near Block E. He was drinking tap beer at a small table with a thin, twitchy white dude who had felon written all over him. The pair had demanded the attention of customers and the waitstaff alike, if not for their scruffy appearance, then certainly for their voices, which were loud and annoying—I heard them from six tables away. Not even the club bouncer dared try to do anything about them. I suppose it was fear. Chopper was sitting in a wheelchair, and nobody wanted to be accused of insensitivity toward the handicapped.\u003c/p\u003e\n\u003cp\u003e“Hey, hey, hey,” Chopper called loudly as I approached, doing his best Fat Albert impersonation. “Long time, man.”\u003c/p\u003e\n\u003cp\u003eI caught the eye of an alarmed waitress and made a circular motion with my finger as I sat, and she went off to fetch a round of drinks.\u003c/p\u003e\n\u003cp\u003e“So you’re fuckin’ McKenzie,” the felon said.\u003c/p\u003e\n\u003cp\u003e“Lower your voice or I’ll kick your teeth in,” I said.\u003c/p\u003e\n\u003cp\u003eHis face tried to turn red with anger, but he was so pale all he could manage was pink.\u003c/p\u003e\n\u003cp\u003e“Hey, hey, hey,” said Chopper.\u003c/p\u003e\n\u003cp\u003eI pointed a finger at him. “You, too.”\u003c/p\u003e\n\u003cp\u003e“I don’t need this shit,” the felon said. Quietly.\u003c/p\u003e\n\u003cp\u003e“It’s cool,” said Chopper. His voice didn’t carry beyond the table, either. “McKenzie’s cool. You gots t’ know the man has reason to be hostile.”\u003c/p\u003e\n\u003cp\u003eThe waitress came with our beers. “These guys running a tab?” I asked as she distributed the glasses.\u003c/p\u003e\n\u003cp\u003e“Yes, sir.” \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-64.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
