{"id":105262,"no":65,"title":"Page 65","content":"\u003cp\u003e“I have it.” I dropped a fifty on her tray. “Keep the change.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir, thank you, sir,” she said and hurried away.\u003c/p\u003e\n\u003cp\u003e“That’s real white of ya, McKenzie,” Chopper said.\u003c/p\u003e\n\u003cp\u003e“It’s not hard to make people happy,” I said. “Just speak softly and pay your bills.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” said the felon. “How happy you gonna make me?”\u003c/p\u003e\n\u003cp\u003eI turned to Chopper. “Who is this?”\u003c/p\u003e\n\u003cp\u003eChopper downed what was left of his first beer and started working on his second. In between sips, he said, “This here is—”\u003c/p\u003e\n\u003cp\u003e“Ain’t no need for names,” the felon said.\u003c/p\u003e\n\u003cp\u003e“This here is a friend of mine,” Chopper said. “And a friend of yours.”\u003c/p\u003e\n\u003cp\u003e“Is he?” I said.\u003c/p\u003e\n\u003cp\u003eChopper gestured at the felon with his glass. “Tell ’im what you told me,” he said.\u003c/p\u003e\n\u003cp\u003e“We ain’t talked about whatchacallit, recompense, yet.”\u003c/p\u003e\n\u003cp\u003e“No money gonna change hands. What you doin’ is a favor to me.”\u003c/p\u003e\n\u003cp\u003e“Fuck that.”\u003c/p\u003e\n\u003cp\u003eChopper’s eyes grew wide and menacing. Hell, I was frightened and he wasn’t even looking at me. But then, I knew his history. When I was in harness, I found Chopper sprawled in a parking lot in St. Paul with two slugs in his back. Apparently he had run afoul of a rival dope dealer. I saved his life that night (ask Chopper about it, he loves to tell the story), though the damage to his spine put him in a wheelchair permanently. Six weeks later, he wheeled himself out of the hospital. Two days after that, we found the dealer and his two bodyguards under the swings at a park near the St. Paul Vo-Tech. Someone had nined all three of them from a sitting position. The murders were never solved. Of course, that was before Bobby Dunston took over the homicide unit. Shortly after the killings, Chopper moved to Minneapolis. He now made his living operating a surprisingly lucrative ticket-scalping operation; he even had a Web site. What else he was involved in I didn’t know, nor did I care to know.\u003c/p\u003e\n\u003cp\u003e“You owe me, man,” Chopper said.\u003c/p\u003e\n\u003cp\u003eThe felon gave him the mad-dog, only his heart wasn’t in it. After a few seconds—just enough time to satisfy his manhood—he said, “Aww, fuck it,” and drank more beer.\u003c/p\u003e\n\u003cp\u003e“Tell ’im,” Chopper said.\u003c/p\u003e\n\u003cp\u003e“Tell me what?” I asked.\u003c/p\u003e\n\u003cp\u003e“There’s a price on your ass,” the felon said.\u003c/p\u003e\n\u003cp\u003e“A price?”\u003c/p\u003e\n\u003cp\u003e“A contract.”\u003c/p\u003e\n\u003cp\u003e“A contract?”\u003c/p\u003e\n\u003cp\u003e“What I’m sayin’.”\u003c/p\u003e\n\u003cp\u003e“What are you saying?”\u003c/p\u003e\n\u003cp\u003e“McKenzie,” Chopper said. “Watch my lips. Man put a hit on you. Open contract. Pays fifty large.”\u003c/p\u003e\n\u003cp\u003e“Fifty thousand dollars?”\u003c/p\u003e\n\u003cp\u003e“What I’m sayin’,” the felon said.\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous,” I said.\u003c/p\u003e\n\u003cp\u003e“I agree,” Chopper said. “I know guys who’d do it for five.”\u003c/p\u003e\n\u003cp\u003e“I know guys who’d do it for the cost of a Happy Meal,” the felon said. “Less if they’re crackheads.”\u003c/p\u003e\n\u003cp\u003e“What are you guys, crazy?” I said. “A contract? On me?”\u003c/p\u003e\n\u003cp\u003e“You are McKenzie,” the felon said.\u003c/p\u003e\n\u003cp\u003e“Yes, I’m McKenzie.”\u003c/p\u003e\n\u003cp\u003e“Well, then.”\u003c/p\u003e\n\u003cp\u003e“A fifty-thousand-dollar contract on me?”\u003c/p\u003e\n\u003cp\u003e“You fuckin’ quick on the uptake.”\u003c/p\u003e\n\u003cp\u003e“Listen—”\u003c/p\u003e\n\u003cp\u003e“I’m just sayin’ what I heard.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“Where what?”\u003c/p\u003e\n\u003cp\u003e“Where did you hear this?”\u003c/p\u003e\n\u003cp\u003e“Around.”\u003c/p\u003e\n\u003cp\u003e“Around where?”\u003c/p\u003e\n\u003cp\u003e“Around. Just around. It’s in the fuckin’ wind.”\u003c/p\u003e\n\u003cp\u003eI couldn’t believe I was hearing it right. I turned back to Chopper for confirmation.\u003c/p\u003e\n\u003cp\u003e“Fifty grand, every douchebag in the world be gunnin’ for you,” he said. “That kinda change, it’s gonna attract your high-priced talent, too. Your serious professionals.”\u003c/p\u003e\n\u003cp\u003eI had no idea what to say to that.\u003c/p\u003e\n\u003cp\u003e“Man must really want you dead,” the felon said.\u003c/p\u003e\n\u003cp\u003e“What man?”\u003c/p\u003e\n\u003cp\u003e“Dunno.”\u003c/p\u003e\n\u003cp\u003e“Who’s shopping the contract?”\u003c/p\u003e\n\u003cp\u003e“Dunno.”\u003c/p\u003e\n\u003cp\u003e“How are you going to collect if you don’t know who’s buying the hit?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t lookin’ to collect.”\u003c/p\u003e\n\u003cp\u003e“Do you think you could find out?”\u003c/p\u003e\n\u003cp\u003e“Fuck no, man. I did my civic duty.”\u003c/p\u003e\n\u003cp\u003e“I’ll pay.”\u003c/p\u003e\n\u003cp\u003e“Not enough, man. Not enough.” The felon stood. He looked down at Chopper. “We good?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“I’m outta here,” the felon said. “That fuckin’ music they playin’ drives me nuts.”\u003c/p\u003e\n\u003cp\u003eWe sat quietly at the table after he left, nursing our beers. After a few moments, I said, “Chopper?”\u003c/p\u003e\n\u003cp\u003e“I’ll ask around, but there are people know we’re tight,” he said. “Could be hard to get the intel, know what I’m sayin’? Then there’s that guilt by association thing. I ain’t sure I even want to know you for a while.”\u003c/p\u003e\n\u003cp\u003eI certainly couldn’t blame him for that.\u003c/p\u003e\n\u003cp\u003e“I appreciate you calling me,” I said.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“What do I owe you?” I asked. Chopper was nothing if not entrepreneurial.\u003c/p\u003e\n\u003cp\u003eHe surprised me when he said, “Nothin’, man. Gratis.”\u003c/p\u003e\n\u003cp\u003e“My God, Chopper. Next thing you know, you’ll be voting Democrat.” \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-65.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
