{"id":105268,"no":71,"title":"Page 71","content":"\u003cp\u003e“I wonder what it does for the liver.”\u003c/p\u003e\n\u003cp\u003e“I didn’t read that far ahead. So, McKenzie.” Schroeder leaned back in his chair and returned his feet to their perch on his desktop. “I notice the Kevlar vest you’re wearing.”\u003c/p\u003e\n\u003cp\u003eSo much for concealment, my inner voice said. I tapped my chest. “I’m starting a new fashion trend.”\u003c/p\u003e\n\u003cp\u003e“Just out of curiosity, exactly how much trouble are you in?”\u003c/p\u003e\n\u003cp\u003e“There’s a contract on my head. People have already tried to collect on it.”\u003c/p\u003e\n\u003cp\u003e“So I’ve guessed. How much?”\u003c/p\u003e\n\u003cp\u003e“Fifty thousand dollars.”\u003c/p\u003e\n\u003cp\u003e“Fifty—that’s nuts. You can kill a president for fifty thousand.”\u003c/p\u003e\n\u003cp\u003e“It’s nice to know I’m highly valued.”\u003c/p\u003e\n\u003cp\u003e“What do you want me to do about it?”\u003c/p\u003e\n\u003cp\u003e“I want you to keep me alive while I track down the man who issued it.” “How are you going to do that?”\u003c/p\u003e\n\u003cp\u003e“One punk at a time.”\u003c/p\u003e\n\u003cp\u003e“Or we could stash you someplace safe and I’ll do the looking.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“What can I tell ya, Greg? I’m a manly man doing manly things in a manly way.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. In that case”—Schroeder righted himself again and reached for the Booker’s—“you had better get those two ounces in now. Who knows if you’ll ever get another opportunity.”\u003c/p\u003e\n\u003cp\u003eSchroeder poured, I drank. While I drank he pulled a contract out of the top drawer of his desk and pushed it across to me. “Sign this,” he said.\u003c/p\u003e\n\u003cp\u003eAs my dear old dad always advised, I read it first. “What the hell?” I said.\u003c/p\u003e\n\u003cp\u003e“Something wrong?”\u003c/p\u003e\n\u003cp\u003e“Five hundred a day plus expenses.”\u003c/p\u003e\n\u003cp\u003e“That’s standard.”\u003c/p\u003e\n\u003cp\u003e“I know, still—one thousand dollars if you use your gun? Five thousand dollars if you actually kill someone?”\u003c/p\u003e\n\u003cp\u003e“It’s not that I don’t count that as part of the service,” Schroeder said, “but there’s a certain emotional jolt involved, as you know. Besides, they’re your enemies. They should be cheap at twice that price. Also, if we get arrested, it’s up to you to hire the best lawyer that money can buy. Remember, I get two fifty for every day I spend in jail up to one hundred thousand dollars. This is nonnegotiable.”\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say to that, so I didn’t say anything, just stared with my mouth hanging open and my eyes wide. Schroeder gestured at the paper in front of me. “It’s my rich-guy-gone-bad contract. You are rich, aren’t you, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Not as rich as I used to be,” I said.\u003c/p\u003e\n\u003cp\u003e“Sign, sign.”\u003c/p\u003e\n\u003cp\u003eI thought about leaving. Then I thought about the four slugs he put into a man who was this close to shooting me one cold and dark night. I signed.\u003c/p\u003e\n\u003cp\u003e“Now I get to watch you play private eye,” Schroeder said.\u003c/p\u003e\n\u003cp\u003e“Something like that.”\u003c/p\u003e\n\u003cp\u003e“Do you have a lead?”\u003c/p\u003e\n\u003cp\u003e“Dude calls himself Dogman-G.”\u003c/p\u003e\n\u003cp\u003e“Really? Think he gets much street cred with a name like Dogman-G?”\u003c/p\u003e\n\u003cp\u003e“Who knows? Maybe it was a choice between that and Trevor.”\u003c/p\u003e\n\u003cp\u003e“Personally, I think Trevor sounds scarier. What do you know about him?”\u003c/p\u003e\n\u003cp\u003e“He’s a North Side gangbanger.”\u003c/p\u003e\n\u003cp\u003e“That’s it?”\u003c/p\u003e\n\u003cp\u003e“I have some contacts in St. Paul that might be able to help.”\u003c/p\u003e\n\u003cp\u003e“I hate St. Paul.”\u003c/p\u003e\n\u003cp\u003e“Who asked you?” Schroeder wasn’t the first resident of Minneapolis who treated St. Paul with disdain, but at these prices I didn’t want to hear it.\u003c/p\u003e\n\u003cp\u003e“Let me try something,” Schroeder said. He picked up his phone, checked a number, punched it into the keypad, waited, and said, “Hi, Sarge,” when someone answered. “It’s Greg Schroeder… Not bad, not bad, you…? It could be worse, Sarge. She could be a lesbian.” I didn’t know what Schroeder was talking about, but he and the Sarge thought it was awfully funny. “Say, Sarge, what do you have on a banger calls himself Dogman-G…? That’s it? Seriously, that’s all you got…? I appreciate it’s hard to keep track. What is it they say, there’s an asshole born every minute…? Do you have his straight name…? No, no, I appreciate the effort… Put it on my tab… You know it. Thanks a lot.”\u003c/p\u003e\n\u003cp\u003eSchroeder hung up his phone. “I have some sources over at the MPD that I pay for information when I need it,” he said. “This one, the sarge, he says that the gang unit suspects that this Dogman-G’s been moving product in North Minneapolis. That’s it. They don’t have a sheet on him. They don’t even know his real name. All they know for sure is that he’s into dogs. Pit bulls.”\u003c/p\u003e\n\u003cp\u003e“So we’re back to St. Paul,” I said.\u003c/p\u003e\n\u003cp\u003e“Bite your tongue.” \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-71.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
