{"id":105282,"no":85,"title":"Page 85","content":"\u003cp\u003e“Yes,” I said, remembering the doughy, overweight man I had trapped in the cabin on Lower Red Lake.\u003c/p\u003e\n\u003cp\u003e“In prison he became lean and strong from working in the weight room. At first it was attractive. Afterward, he became so big—it is possible to have too many muscles, Mr. McKenzie. While his body was changing, so was his demeanor. Thomas had been a soft-spoken man, timid and shy. As he became stronger and harder, he became louder. The guards would make him quiet down during our visits because he would shout. On a couple of occasions they returned him to his cell because he wouldn’t quiet down. Over the years he became very angry. It frightened me how angry he became. He was incensed with you, of course. Soon his anger included the entire world. Me as well. He decided that I had caused his downfall, that I had ruined his life. Because he stole for me, he said, and because he had waited for me and I didn’t come. He told me to get out of his life. He told me this many times. Finally, I did.\u003c/p\u003e\n\u003cp\u003e“It was prison,” she said. “Prison changed him. Jeffrey Skilling defrauded millions of people, hurt millions of people, while he was CEO of Enron and he received a comfortable life in a converted college dormitory in Waseca, no bars on the window, no locks on the door, good food. Thomas, all he hurt was an insurance company, and he was condemned to a maximum-security prison with the worst scum on earth. That would change anyone.”\u003c/p\u003e\n\u003cp\u003e“You haven’t seen him since he was released?” I asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“He hasn’t tried to contact you in any way?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Not even to get his golf clubs back?”\u003c/p\u003e\n\u003cp\u003e“Not even for that.”\u003c/p\u003e\n\u003cp\u003e“If he does contact you, will you tell me?”\u003c/p\u003e\n\u003cp\u003e“He won’t.”\u003c/p\u003e\n\u003cp\u003e“He might.”\u003c/p\u003e\n\u003cp\u003eMrs. Teachwell turned in her chair to face me. Tears had welled up in her eyes again, and she brushed them away with her knuckle. “Why would he?” she asked.\u003c/p\u003e\n\u003cp\u003e“He’s in serious trouble,” I said. “When I’m in trouble, I seek out the people who love me best.”\u003c/p\u003e\n\u003cp\u003eShe thought about it for a moment, then said, “He won’t come here.”\u003c/p\u003e\n\u003cp\u003e“Will you tell me if he does?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Your husband is a fool, Mrs. Teachwell.”\u003c/p\u003e\n\u003cp\u003e“Ex-husband,” she said.\u003c/p\u003e\n\u003cp\u003eI liked Mrs. Teachwell. I liked that she stood by her man even though he really wasn’t her man anymore. Others might censure her as some kind of Tammy Wynette throwback, a relic from an era that existed before women were given the right to vote. Not me. I think we all pray for such loyalty from the people we love. I wondered briefly if Nina Truhler possessed that kind of loyalty. Sure she does, my inner voice told me. She’s proven it many times.\u003c/p\u003e\n\u003cp\u003eI dumped my Kevlar vest and guns in the back of the Jeep Cherokee and drove away from Mrs. Teachwell’s house. I stopped when the driveway intersected with the main drag and made a phone call. The new cell didn’t have Harry’s direct number on speed dial, and I was forced to go through the switchboard. “Special Agent Brian Wilson,” Harry said.\u003c/p\u003e\n\u003cp\u003e“It’s McKenzie.”\u003c/p\u003e\n\u003cp\u003e“McKenzie,” Harry said. “I’ve been wondering where you’ve been off to.”\u003c/p\u003e\n\u003cp\u003e“Orono,” I said.\u003c/p\u003e\n\u003cp\u003e“What’s in Orono?”\u003c/p\u003e\n\u003cp\u003e“The residence of Mrs. Thomas Teachwell.”\u003c/p\u003e\n\u003cp\u003e“Teachwell? The embezzler?”\u003c/p\u003e\n\u003cp\u003e“It’s him, Harry. He’s the T-Man. He was Scottie’s partner. He was the one who put a hit out on me.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003eI told him I was. I told him why.\u003c/p\u003e\n\u003cp\u003e“I’ll be damned,” Harry said.\u003c/p\u003e\n\u003cp\u003eI sniffed at the remark. It was a good opening for a joke, only I didn’t have one in me. I was too tired; my whole body pulsed with pain. Maybe next time. I told Harry to put a team on Mrs. Teachwell’s house, to tap her phone. He didn’t need the advice.\u003c/p\u003e\n\u003cp\u003e“Watch,” he said. “I bet I scoop him up in less than twenty-four hours.”\u003c/p\u003e\n\u003cp\u003eI didn’t take the wager, but I did ask Harry to call me when he had Teachwell in custody.\u003c/p\u003e\n\u003cp\u003e“What are you going to do?” he asked.\u003c/p\u003e\n\u003cp\u003e“Hide out until you find him.”\u003c/p\u003e\n\u003cp\u003e“That’s it? You’re not going to try to hunt him down yourself, get a little payback for Bobby Dunston?”\u003c/p\u003e\n\u003cp\u003eI flashed on the faces of two dead men in East Bethel—maybe three—and of the felon, left battered and broken in the ravine near my home. An hour ago I would have happily added Teachwell to the pile. Now, after hearing what Mrs. Teachwell had to say, I wasn’t so sure. The necessity of revenge had transformed Teachwell. It turned him from a fairly decent guy who made a mistake into a raging monster, a man who thought nothing of injuring innocent people, of hurting children, to gain the vengeance he felt was his due. I could argue that I was more than justified for going after him. I just didn’t want to become him.\u003c/p\u003e\n\u003cp\u003e“I’ve done my bit for God and country,” I said. “It’s time you professionals stepped in.”\u003c/p\u003e\n\u003cp\u003e“Goodness gracious, but that’s a mature attitude to take. Keep it up, McKenzie, and you’ll become a full-grown adult in no time at all.”\u003c/p\u003e\n\u003cp\u003e“That’s always been my goal, Harry. It’s what I long for late at night.”\u003c/p\u003e\n\u003cp\u003e22 \u003c/p\u003e","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-85.html","bookId":2221,"creation":"Oct 5, 2019 10:45:11 PM","modification":"Oct 5, 2019 10:45:11 PM"}
