{"id":82126,"no":28,"title":"Page 28","content":"\u003cp\u003e“I’m not sure what you want from me now, to make it up to you. Send me packing tonight? The only guy in the house not getting any?” I give her half a smile, hoping for that outcome. I’m so not in the mood right now.\u003c/p\u003e\n\u003cp\u003e“No. Make it up to me there.” She points to her bed and lays her hand on mine—the one on the doorknob.\u003c/p\u003e\n\u003cp\u003eShit. I’m trapped. I guess I’ve been stuck in worse encounters than having sex when I’m not really motivated to. “As long as you know it’s just tonight.”\u003c/p\u003e\n\u003cp\u003eShe laughs. “Yeah, I know all about your little romance—is it real, or publicity?”\u003c/p\u003e\n\u003cp\u003eIt takes me a second to realize she’s talking about Emma. “Yeah, not discussing that.”\u003c/p\u003e\n\u003cp\u003eShe nods. “Sure. Okay. I get it.”\u003c/p\u003e\n\u003cp\u003eI drop my hand from the doorknob. “Okay then.”\u003c/p\u003e\n\u003cp\u003eShe takes my hand, pulls me back across the room. “Okay then.”\u003c/p\u003e\n\u003cp\u003eChapter 23\u003c/p\u003e\n\u003cp\u003eEmma\u003c/p\u003e\n\u003cp\u003eI called the hotel this morning to make sure Reid and I were booked into separate rooms for our two nights in San Francisco. Not because I don’t trust Reid, but because Graham doesn’t.\u003c/p\u003e\n\u003cp\u003eWhich bothers me, but I understand it. The relationships we’ve had with Reid and Brooke trigger that small voice of what if in each of us. He thinks what if she’s not over Reid, and I think what if he’s really in love with Brooke.\u003c/p\u003e\n\u003cp\u003eThursday night, after Graham texted and said he missed me, I answered that I missed him, too. And then I lay in bed, scrolling through our old messages to each other, all the way back to the one where I asked him to meet me that morning before Dad and I left New York. He hadn’t answered, but he’d come. That morning, I wanted him in my life so much that I was willing to accept friendship-only terms, willing to swallow my desire, even if the thought of him with someone else induced a soul-deep ache.\u003c/p\u003e\n\u003cp\u003eI wouldn’t be able to do that now. I’m in too far. I want too much.\u003c/p\u003e\n\u003cp\u003eI think, too, about Reid’s request. I ignored it, because of course Graham’s not going to screw this up. And then I picture Brooke, pressed against him, touching him, and I tell myself for the hundredth time that he isn’t lying to me. But I’m worried that he’s lying to himself.\u003c/p\u003e\n\u003cp\u003eI wish I’d never seen that paparazzi photo. The thing I fear most would be so much easier to dismiss if it hadn’t been burned it into my eyeballs in living color. While I’m at it, I wish Emily had never seen it. She won’t drop the fact that he was secretive about Cara, even when I tell her that he isn’t secretive, he’s guarded, and yes, there’s a difference. “Emily, I trust him,” I say, and she harumphs. Maybe she hears the fear in my voice. Because that’s what it is—this isn’t distrust. It’s fear.\u003c/p\u003e\n\u003cp\u003eWhen I sign into Skype, Graham is waiting for me.\u003c/p\u003e\n\u003cp\u003e“Ten more days,” I say, and he smiles.\u003c/p\u003e\n\u003cp\u003eWe talk about our days. He took Cara to the park. I got my first slightly traumatic, very awkward airport pat-down.\u003c/p\u003e\n\u003cp\u003e“Strangely enough, the fact that she snapped on latex gloves beforehand didn’t make me feel any better. She kept stopping and saying, ‘Sensitive area,’ when she was about to go somewhere I don’t let anyone touch me.” I blush when I realize that isn’t quite true, and even if my webcam doesn’t reveal redder toned skin, I must be giving something away, because Graham arches a brow.\u003c/p\u003e\n\u003cp\u003e“Hmm.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe shakes his head slowly. “I think maybe you’ve been a very naughty traveler, Emma.”\u003c/p\u003e\n\u003cp\u003eI fall over onto the mattress laughing, embarrassed and turned on. “No more blue gloves! Please!” I say from my prone position. At most, he can see the edge of my hip.\u003c/p\u003e\n\u003cp\u003e“You know the rules,” he says. “No glove, no love.”\u003c/p\u003e\n\u003cp\u003eI sit up. “I cannot believe you just said that after what I went through today.”\u003c/p\u003e\n\u003cp\u003eHe laughs again while I pout. “I couldn’t resist. I’m sorry.” He tells me he’s been through the pat-down and a couple of body scans while traveling, and whenever he wears one particular band t-shirt to fly, it seems to provoke a random luggage search. “It’s bizarre. Radiohead t-shirt equals luggage search. Every. Time. I’m a little worried they’ll go for body cavities at some point.”\u003c/p\u003e\n\u003cp\u003eWe talk a few minutes more, and then he clears his throat and says, “Um, I need to tell you about something.”\u003c/p\u003e\n\u003cp\u003eHis tone tells me this isn’t a good something. For a couple of seconds, I can’t breathe. My heart is thudding in my chest. “Okay.”\u003c/p\u003e\n\u003cp\u003eHe takes a deep breath. “You know I’m graduating on Wednesday.”\u003c/p\u003e\n\u003cp\u003eI nod. “Yes.” I sense he’s not going for congratulations.\u003c/p\u003e\n\u003cp\u003e“Brooke is coming to the ceremony.” He runs a hand through his hair. “I would have told you before, but I honestly forgot about her plans to come whenever we were talking, and I didn’t want to just text it to you.”\u003c/p\u003e\n\u003cp\u003eBrooke is attending Graham’s graduation. I frown. “When did you invite her?”\u003c/p\u003e\n\u003cp\u003e“I didn’t, really, she just offered, last week. We met right before I started at Columbia, and I guess she just wants to show her support—”\u003c/p\u003e\n\u003cp\u003e“I get it.” I stop him before he offers more details about their years-long, dedicated friendship. “You’re really close and you have been for years before you met me, so there’s nothing for me to be concerned about.” Jealous about. Jealous is what I want to say. But I am concerned. I am jealous. I am Emma the green-eyed monster.\u003c/p\u003e\n\u003cp\u003e“Emma, I don’t want to upset you…”\u003c/p\u003e\n\u003cp\u003eToo late.\u003c/p\u003e\n\u003cp\u003e“There’s nothing going on between Brooke and me—any more than there’s something going on between you and Reid.”\u003c/p\u003e\n\u003cp\u003eI gasp. “That’s not the same at all.”\u003c/p\u003e\n\u003cp\u003e“You’re right, it’s not. You’ve actually been intimate… with him.” He realizes mid-sentence what he’s stepped into, but it’s too late to extricate himself from it.\u003c/p\u003e\n\u003cp\u003e“What exactly do you mean?”\u003c/p\u003e\n\u003cp\u003eHe’s not looking at my face on his screen. His eyes are turned away. So I wait. Finally, they blink back at me, dark and unreadable. “I guess I don’t know what I mean. And I know it’s none of my business, and I have no right to ask.”\u003c/p\u003e\n\u003cp\u003e“Ask what? Ask if I’ve slept with him?”\u003c/p\u003e\n\u003cp\u003eA muscle clenches at his temple. “I’m not asking you, Emma. It’s none of my business.”\u003c/p\u003e\n\u003cp\u003e“So you don’t care?”\u003c/p\u003e\n\u003cp\u003eSighing, he sits back against his pillows. I hate it when he does that, because I can’t see his face clearly at all. “Of course I care.” His voice is so soft, and I don’t know if it’s because he’s speaking softly or if it’s just because he’s moved away from the laptop microphone.\u003c/p\u003e\n\u003cp\u003e“Okay. So it’s not your business. But I didn’t.” I don’t tell him how very close we came. He doesn’t need to know that. His eyes close and he breathes another sigh. “Your turn,” I say.\u003c/p\u003e\n\u003cp\u003eA crease appears between his brows. “My turn for what?”\u003c/p\u003e\n\u003cp\u003eI tilt my head. “You. And Brooke.”\u003c/p\u003e\n\u003cp\u003e“No.” There’s no hesitation. “I’ve never slept with Brooke. I thought I told you, the morning we first talked about all of this—”\u003c/p\u003e\n\u003cp\u003e“You told me you didn’t love her. You never said you hadn’t slept with her.”\u003c/p\u003e\n\u003cp\u003eWe fall silent after this exchange, and the huge space between us feels electrically charged. My throat closes up and even though I’m relieved, I feel like crying.\u003c/p\u003e\n\u003cp\u003e“Emma, what’s wrong, baby?” He’s never called me that before. Close to the webcam now, his eyes are worried. “I’m sorry. I don’t want you to feel…”\u003c/p\u003e\n\u003cp\u003e“Insecure?” A tear winds down my cheek and I thumb it away.\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “You aren’t insecure. This is new for both of us—this relationship. And we’re trying to build it from a distance, after months of separation…” He runs a hand through his hair again and makes a frustrated sound. “It’s difficult. But not impossible. I’m sorry about Brooke, and for asking you about Reid—”\u003c/p\u003e\n\u003cp\u003e“I’m not. I want you to know.” My voice lowers. “You need to know, right? That it will be the first time for me…”\u003c/p\u003e\n\u003cp\u003e“I suppose so, yeah. I hadn’t… really thought of it that way. I’ve never, um…” He chews his lip, eyes shifting down and then back up to watch my face on his screen. “I’ve never been with a virgin.”\u003c/p\u003e\n\u003cp\u003eMy mind is racing, but coming to no conclusions at all. “Oh.”\u003c/p\u003e\n\u003cp\u003eHis hand rubs over his face. “God,” he mumbles. “I’m going to make you want nothing to do with me.”\u003c/p\u003e\n\u003cp\u003e“Graham,” I say, and he moves his hand down to his mouth, uncovering his eyes, watching me. “Trust me. That’s not possible.”\u003c/p\u003e\n\u003cp\u003eREID\u003c/p\u003e\n\u003cp\u003eEmma and I are meeting in the lobby at 5:00 a.m. for the first local station interview. We have a second one Tuesday, followed by a live radio interview in the afternoon. Thursday, we’re taping Ellen.\u003c/p\u003e\n\u003cp\u003eWhen I tell Brooke what I said to Emma—that I wanted another shot if Graham fucked up—she freaks. “Oh my God, Reid. Shit. That was a huge risk… but maybe she’ll automatically turn to you when she realizes he’s with me.”\u003c/p\u003e\n\u003cp\u003e“That was my thought.” I’m clicking through muted television channels, reclining against a mound of pillows on the hotel bed. Emma is just down the hall. I texted her earlier, told her I was here, and suggested that we meet in the lobby tomorrow morning. I’ve made plans for us tomorrow night, so I’m giving her unpressured space tonight.\u003c/p\u003e\n\u003cp\u003e“But she didn’t answer you?”\u003c/p\u003e\n\u003cp\u003e“I told her I didn’t want one. That I just wanted her to know where I stood.” Leaving the television tuned to music videos, I set the volume on low, like white noise. Emma plays videos in the background in her hotel room like some sort of soundtrack to her life, and I’ve wondered but forgotten to ask her if she does this at home, too. “So what makes you think you love him?”\u003c/p\u003e\n\u003cp\u003e“What?” Her voice is confused.\u003c/p\u003e\n\u003cp\u003eI don’t know if I inherited the capacity for debate or I just picked it up as a result of growing up with an attorney, like self-preservation. I’m already imagining what Brooke might say, and what I’ll counter with. “You’ve said a couple of times now that you’re ‘right’ for Graham. Do you think you love him?”\u003c/p\u003e\n\u003cp\u003eShe’s silent for a long moment and I think she’s about to tell me that how she feels about him isn’t my business and by the way go to hell. “I do.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Why what, Reid?” Exasperation saturates her words. “I don’t understand what you want to know, not that it’s your business anyway. But I’m in the mood to humor you. So why what?”\u003c/p\u003e\n\u003cp\u003e“Why do you think you love him?” Accent on think. Which she catches.\u003c/p\u003e\n\u003cp\u003e“That’s a weird way to put that,” she muses. “Why do you think you love him rather than why do you love him.”\u003c/p\u003e\n\u003cp\u003e“You know I don’t believe in love.” Whoa—that came out a little bitter. Wounded, even. Shit. \u003c/p\u003e","sourceLink":"https://allnovel.net/where-you-are-between-the-lines-2/page-28.html","bookId":2740,"creation":"Oct 5, 2019 4:40:41 PM","modification":"Oct 5, 2019 4:40:41 PM"}
