{"id":82134,"no":36,"title":"Page 36","content":"\u003cp\u003eOf course this girl is her best friend.\u003c/p\u003e\n\u003cp\u003eWhen we’re all seated in a booth at Chili’s, Emily gestures to my t-shirt. “So, you, uh, like them?” Sneaking into her offhand tone is a note of fangirl enthusiasm.\u003c/p\u003e\n\u003cp\u003eI glance down at my chest and back up. “Oh, yeah. They’re brilliant. Have you seen them perform live?”\u003c/p\u003e\n\u003cp\u003eShe shrugs. “Not yet, but I definitely will. You?”\u003c/p\u003e\n\u003cp\u003eI nod. “A couple times.”\u003c/p\u003e\n\u003cp\u003e“What? Really?” So much for indifference. She clamps her lips together to try to rein in her interest while Derek and Emma exchange suppressed smiles.\u003c/p\u003e\n\u003cp\u003e“Yeah, I know the bassist and the drummer—they were classmates of mine at Columbia. Cool guys.”\u003c/p\u003e\n\u003cp\u003eHer mouth drops. “Get out.”\u003c/p\u003e\n\u003cp\u003e“Yeah. They’re supposed to do Unplugged later in the summer, I think. I could probably get you into the taping, if you’re going to be in New York.” Emma’s hand slips into mine and she pulls it onto her lap. I squeeze her hand and she squeezes back.\u003c/p\u003e\n\u003cp\u003eEmily blinks, stunned. I would guess she doesn’t stun easily. Or often. “Uh, yeah, that would be great.”\u003c/p\u003e\n\u003cp\u003eDerek clears his throat to hide a laugh. “So you went to Columbia, man?” he asks. I nod. “Theatre, right?”\u003c/p\u003e\n\u003cp\u003e“No. Literature.” I expect him to react like Reid: Ah, and nothing else to say. But no, he plans to study English at CSU Long Beach, where Emily plans to major in anthropology. When we start to discuss literary theory and writing programs the way some guys discuss sports stats, the girls mock our academic jargon, but they grin at each other, covertly.\u003c/p\u003e\n\u003cp\u003eAnd just like that, I’m in.\u003c/p\u003e\n\u003cp\u003eChapter 29\u003c/p\u003e\n\u003cp\u003eREID\u003c/p\u003e\n\u003cp\u003eThe last expression I expect to see on Emma’s face Monday afternoon is joy.\u003c/p\u003e\n\u003cp\u003eAfter makeup does their damage, we wait backstage to be called onto the Conan set. At first, I think she’s faking happy to get through the interview. Then I realize it’s legit. Four days ago, I showed Emma a photo that should have devastated her, and wrecked any would-be relationship she’d begun with Graham. Instead, she looks like sunshine.\u003c/p\u003e\n\u003cp\u003e“This is an unexpected transformation.” I smile tightly into her glowing face. The green room sofa is small and our knees touch, lightly. She doesn’t seem to notice. There’s no doubt in my mind that her current state of mind has nothing to do with me.\u003c/p\u003e\n\u003cp\u003e“You were right about that picture.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“They fell asleep next to each other, but nothing else happened. You must have been correct about her playing mind games with you or whatever, because it looks like you’re the only one she sent it to.”\u003c/p\u003e\n\u003cp\u003eSo Graham didn’t own up, even after that photo—and he managed to convince her that nothing happened? I’m in awe. The guy has bigger cojones than I thought. I consider the two possibilities: either he intends to string them both along… or he considers Brooke a one-time hookup—a mistake that he doesn’t intend to repeat.\u003c/p\u003e\n\u003cp\u003e“I know what you’re thinking,” Emma says.\u003c/p\u003e\n\u003cp\u003eDoubtful. “What am I thinking?”\u003c/p\u003e\n\u003cp\u003e“That he’s lying to me. But I know he’s not.”\u003c/p\u003e\n\u003cp\u003eUnbelievable. Practically everything I did last fall earned Emma’s distrust, but this she’s willing to overlook? “So even after a compromising—some might say incriminating—photo of him in bed with Brooke, you aren’t worried that he might be cheating. I gotta hand it to the guy—he’s a god, if he can get away with that one.”\u003c/p\u003e\n\u003cp\u003eShe sighs. “Not every guy is a player, Reid.”\u003c/p\u003e\n\u003cp\u003e“Ouch.”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean it like that.”\u003c/p\u003e\n\u003cp\u003eI look steadily back at her, and don’t ask what other way she could possibly mean it. The possible responses are a jumble of pithy and serious and harsh and flirtatious, and in the end nothing works so I say nothing. After a few seconds, she looks away.\u003c/p\u003e\n\u003cp\u003eA set assistant pops in to tell us we have five minutes. We can’t go out there like this—awkward and avoiding eye contact. Intending to make small talk and bring us back to center, I ask what she did over the weekend.\u003c/p\u003e\n\u003cp\u003e“I hung out with Emily. And, um, Graham was in Sacramento Saturday and Sunday.”\u003c/p\u003e\n\u003cp\u003e“Ah.” The hell? My brain is whirring with the reasons why Graham would travel cross-country to make sure of her. I suspect Brooke is unaware of this little development.\u003c/p\u003e\n\u003cp\u003e“We saw a movie Saturday night, and they played the trailer for School Pride. I know it’s routine for you, but watching myself on that huge screen felt so strange. The movie looks pretty good, though.”\u003c/p\u003e\n\u003cp\u003e“You sound surprised.”\u003c/p\u003e\n\u003cp\u003eShe laughs. “I guess I am, a little. The last time a Jane Austen novel was modernized well on film was Clueless.”\u003c/p\u003e\n\u003cp\u003eI smirk at her. “Book snob.”\u003c/p\u003e\n\u003cp\u003eShe smirks back. “Guilty as charged.”\u003c/p\u003e\n\u003cp\u003eBefore I can wrap my brain any further around Graham in Sacramento, the door opens and the set assistant reappears. “You guys are on.”\u003c/p\u003e\n\u003cp\u003eConan goes well—the combination of the comedic venue and the fact that it’s our last interview help make it the best one we’ve done. When asked about the stories I ad-libbed on Ellen, I embellish them with help from Emma, who offers to let Conan feel the babies kick. The audience thinks we’re hilarious. I introduce a couple of clips from the movie—one of which includes a scorching kiss between Emma and me that gets everyone hot and bothered, and we’re out.\u003c/p\u003e\n\u003cp\u003eBefore we part, I give Emma a swift hug and brush a kiss on her cheek—because the side of her face is what she offers when I lean towards her. Then she’s in a limo to the airport and I’m in my car, dialing Brooke’s cell.\u003c/p\u003e\n\u003cp\u003e“Are you aware that Graham was in Sacramento this weekend?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I’ll take that as a no. He’s obviously playing both of you. Emma showed up to the Conan taping happy as shit. She was blissed out, and completely convinced that nothing happened between you guys. He’s more like me than I gave him credit for.”\u003c/p\u003e\n\u003cp\u003e“He’s nothing like you.” Her tone lashes me.\u003c/p\u003e\n\u003cp\u003e“Jesus, Brooke, seriously? He’s got you snowed, too? Or is he planning to screw you on the side—with your blessing—while he keeps Emma for a public relationship—”\u003c/p\u003e\n\u003cp\u003e“We didn’t have sex, okay?” Her words are angry, like she’s spitting them at me. “What he told her was true. He fell asleep, and I fell asleep next to him.”\u003c/p\u003e\n\u003cp\u003eI’m driving in a state of shock. I actually have to snap my mouth closed. “Okay, wait. Are you telling me he hasn’t nailed either of you? You’re right. Forget the like me comment.”\u003c/p\u003e\n\u003cp\u003e“No shit.”\u003c/p\u003e\n\u003cp\u003eMy hands tighten on the wheel. “Now what?” A more pointless question has never been asked. There is no now what. This is done. We’ve lost. On the other hand, neither of us has actually lost anything. We just managed to land right back where we started, like that damned board game with the ladders and slides that Mom played with me when I was a kid, before she decided to become a full-time drunk.\u003c/p\u003e\n\u003cp\u003e“Premiere night,” she says.\u003c/p\u003e\n\u003cp\u003e“Premiere night what? Are you planning to drape yourself over the buffet table naked and hope that gets his attention? Sounds like he’s made his choice to me.”\u003c/p\u003e\n\u003cp\u003e“What happens between Graham and me is my business, not yours,” she shoots back. I imagine her frothing at the mouth, because frankly, that’s how she sounds. “Yours is to be there to console Emma when she needs it, because she’s going to need it.”\u003c/p\u003e\n\u003cp\u003eI shake my head, incredulous at how confident she is in the face of failure. “Right.”\u003c/p\u003e\n\u003cp\u003eIgnoring me, she strategizes out loud, and I listen in spite of my misgivings. “Go to her room before we all leave for the premiere. Discuss walking the red carpet together, the seating arrangements at the theater, hanging out at the party, whatever. While you’re there, leave something in her room, somewhere not very visible—like your phone. Turn it to silent and lock it, of course. And delete all the messages, just in case.”\u003c/p\u003e\n\u003cp\u003eBrooke has gone off the double agent deep end.\u003c/p\u003e\n\u003cp\u003e“I don’t think Emma’s the sort to break into my phone and read the messages—”\u003c/p\u003e\n\u003cp\u003e“Shut up and let me think.” Goddamn I’ll be glad when this is over. I’d love to tell her to go to hell, but she’s still dangling Emma as a possibility, so I bite my tongue. “As soon as we’re all in our rooms after the party, call her from your room phone. Tell her you left your cell in her room, and ask her if she can bring it down the hall to your room, because you aren’t feeling well. When you hang up with her, call my cell. Be ready to come out and handle her. Think you can do that?”\u003c/p\u003e\n\u003cp\u003e“Yeah, sure, I can handle her. What exactly am I going to be handling?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I have to think. Just be ready. When I hang up, give it a few seconds and then come into the hallway and find her.”\u003c/p\u003e\n\u003cp\u003eGRAHAM\u003c/p\u003e\n\u003cp\u003eI fly into LA with Tim Warner—Mr. Bennet in School Pride—who also lives in New York. We discuss future projects and chat about Reid—specifically, Reid and Emma’s fake relationship. I find myself drumming the arm of the seat and not making eye contact when he mentions that they’re cute together.\u003c/p\u003e\n\u003cp\u003e“Is something wrong?” Tim says with a small tilt of his head.\u003c/p\u003e\n\u003cp\u003e“Um, no.” I try to appear confused by the question, shaking my head and giving a small shrug.\u003c/p\u003e\n\u003cp\u003e“Humph.” He’s not falling for it. “Graham, I was a gay boy in Alabama in the early eighties. In the interest of saving my own ass, I learned how to be enigmatic, and how to outright fib, so I know it when I see it. You have the mysterious part down, but son, you can’t lie worth a crap. Confession is good for the soul, I hear. So, what’s got you coming out of your skin?”\u003c/p\u003e\n\u003cp\u003eLike Brooke, he has no accent. “You don’t sound like you’re from Alabama,” I hedge.\u003c/p\u003e\n\u003cp\u003eHe shrugs. “I shot off to New York when I was seventeen, determined to separate myself from my past in every possible way. A good thing overall, but also a little tragic. But we’re not talking about me. We’re talking about you. Since we have a five-hour flight ahead of us, you might as well start talking.” He raises an eyebrow. “I’ll wear you down eventually.”\u003c/p\u003e\n\u003cp\u003eI sigh, conceding defeat. “Have you ever had to pretend to be in a relationship with a costar, because production wanted you to?”\u003c/p\u003e\n\u003cp\u003eHe gives me a pointed look. “No, but I’ve certainly had to pretend not to be in a relationship with a costar because production didn’t want me to.”\u003c/p\u003e\n\u003cp\u003eI stare at my hands. “Yeah? Well, me too. Though production doesn’t actually know about it. It’s more an unspoken clause, under the edict that Emma and Reid look involved.”\u003c/p\u003e\n\u003cp\u003e“I thought they were? They had a tiff or something—”\u003c/p\u003e\n\u003cp\u003e“No, they broke up last fall.”\u003c/p\u003e\n\u003cp\u003eWe both accept coffee service and a warm cookie from the flight attendant. Say what you will—flying first class is a shocking illustration of dissimilarity between the privileged and the non-privileged. While Tim and I will enjoy a catered meal, several snacks, hot towels and all the attention we could want, hundreds of people in the back of the plane are lucky to get a bag of pretzels and a can of soda. \u003c/p\u003e","sourceLink":"https://allnovel.net/where-you-are-between-the-lines-2/page-36.html","bookId":2740,"creation":"Oct 5, 2019 4:40:41 PM","modification":"Oct 5, 2019 4:40:41 PM"}
