{"id":82136,"no":38,"title":"Page 38","content":"\u003cp\u003e“Nice dress,” I say when Brooke joins me at the table. No one else is sitting there at the moment, everyone either admiring the buffet with its ice sculptures and chocolate fondue setup, or rubbing elbows with other Hollywood elite. “Matches your eyes.”\u003c/p\u003e\n\u003cp\u003eI laugh when she narrows those eyes at me.\u003c/p\u003e\n\u003cp\u003eShe glances around to make sure no one’s near. “You know where the rooms are located, right? Graham’s is in that alcove area on the other side of the elevators, and Emma’s and mine are in between yours and his.”\u003c/p\u003e\n\u003cp\u003eI nod. I’d checked out the locations she’d given me before leaving. “Did you have something to do with where our rooms are, Brooke?”\u003c/p\u003e\n\u003cp\u003eShe shrugs, and I wonder if she didn’t miss her calling as a CIA operative.\u003c/p\u003e\n\u003cp\u003e“You left your phone in her room?”\u003c/p\u003e\n\u003cp\u003eI smile. “Ingeniously wedged between sofa cushions.”\u003c/p\u003e\n\u003cp\u003e“We’ll leave when they do. As soon as you get to your room, call and convince her to bring your phone to your room. When you hang up with her, call me. I’ll be in the hallway between your rooms, and she’ll overhear my conversation. When we hang up, come out of your room and find her. Keep her faced towards you—that’s really important. Are you listening?”\u003c/p\u003e\n\u003cp\u003eSomething about her superior way of giving instructions just makes me want to pay no attention. “Yeah. Ask her to bring my phone. Then call you. Then come into the hallway. Real complicated.”\u003c/p\u003e\n\u003cp\u003eHer jaw sets. “Reid, I swear to God, if you screw this up—”\u003c/p\u003e\n\u003cp\u003e“Reid Alexander!” A woman appears next to our table with a girl of twelve or thirteen, who’s staring at me with a dumbfounded expression.\u003c/p\u003e\n\u003cp\u003e“Uh, yes?”\u003c/p\u003e\n\u003cp\u003e“I’m Johanna and this is Christina Noel and may I say that we are such huge fans of yours!” She sticks out a clammy hand for me to shake, barking, “Christina Noel, shake his hand!” The girl complies, her hand trembling. “We won tickets to the premiere and this after-party shindig and traveled 1421 miles to be here!” The woman says, leaning closer to stage whisper, “This hotel costs a fortune!” Straightening, she adds, “Worth every penny—but it’s a lot of pennies!” She hoots with laughter while the girl turns bright red. “Anyhoo, we are just speechless with delight to be here!”\u003c/p\u003e\n\u003cp\u003eSpeechless is not the word I would have chosen for her, though it appears fitting for her unfortunate kid.\u003c/p\u003e\n\u003cp\u003e“Oh, and look!” Staring at Brooke, she elbows the girl. “It’s Caroline.” I feel Brooke stiffen beside me at the condescending tone. “You were in that little cable series—what was it called—Life’s a Beach? We don’t let Christina Noel watch trashy stuff—no offense—so we haven’t seen it. But I’m sure it’s just peachy, for what it is.”\u003c/p\u003e\n\u003cp\u003eOh shit. Cleanup at Table One in three, two…\u003c/p\u003e\n\u003cp\u003e“Do you have a camera?” I ask. “How about a photo of me and Christina, er, Noel.” I gesture to the girl to stand next to me, since we’re about the same height if I remain seated. She inches closer, visibly shaking. Her mother tears through her bag hunting for her camera, tossing tissues, celebrity maps, and bottles of lotion and hand sanitizer on the table, oblivious to the fact that Brooke is giving her a marked-for-death stare.\u003c/p\u003e\n\u003cp\u003e“Ah-ha!” She produces a cheap camera and turns it on, but instead of lining up the shot, she thrusts it into Brooke’s hands. “Be a dear and take our picture, will you?” She squeezes herself on the opposite side of me from her daughter, all but knocking Brooke off of her chair.\u003c/p\u003e\n\u003cp\u003eBrooke snaps one photo before giving me a piercing glare as though I had anything to do with the insulting speech. “Call me. Later.” Shoving the camera back into Johanna’s hands, she spins and strides towards MiShaun and Tadd, disaster somewhat averted.\u003c/p\u003e\n\u003cp\u003e“Well, gracious me, what bee got into her bonnet?” Johanna mutters.\u003c/p\u003e\n\u003cp\u003eChapter 31\u003c/p\u003e\n\u003cp\u003eBrooke\u003c/p\u003e\n\u003cp\u003eMy phone buzzes. When I answer, Reid says, “You’re on.”\u003c/p\u003e\n\u003cp\u003eEmma is in the corridor, about to turn the corner. My heart is thumping so hard I can barely hear her footsteps. I face the window, like it’s normal to be taking in the 3 a.m. courtyard view while talking on the phone, no big deal. Here we go.\u003c/p\u003e\n\u003cp\u003e“Graham’s supposed to call me soon, but I wanted to let you know the soon-to-be-news,” I say, listening for Emma’s footfalls. She hears Graham’s name and stops at the corner, just as I knew she would.\u003c/p\u003e\n\u003cp\u003e“So am I going to get the dirty details?” Reid says, determined to make this artificial conversation miserable, just because he can.\u003c/p\u003e\n\u003cp\u003eI concentrate on saying what I want her to hear. “You know how impatient I am. I’ll be happy when he’s taken care of this so we can be together openly. All we have are stolen moments when she’s not around.”\u003c/p\u003e\n\u003cp\u003e“Your cruelty knows no bounds, does it?” Reid says. I want to tell him to shut the hell up. He’s only on the line to know when to exit his room, the jackass.\u003c/p\u003e\n\u003cp\u003e“He doesn’t want to hurt her, but we’re meant to be.” I try to sound casual, but Reid’s comments are making my teeth grind. “My God, that night we spent—I mean, I’ve been with a lot of guys—” Reid laughs softly in my ear, the bastard “—but he was mind-blowingly hot. Better than anyone, ever.”\u003c/p\u003e\n\u003cp\u003e“If only it were true…” Reid says. I’m going to kill him.\u003c/p\u003e\n\u003cp\u003e“We should have given in to this thing between us years ago instead of putting so much effort into remaining friends only.”\u003c/p\u003e\n\u003cp\u003e“So he’s never, in four years, made a move?” Reid laughs. “Man, what that must have done to your colossal sexual ego.”\u003c/p\u003e\n\u003cp\u003eSon of a—ignore, ignore, ignore.\u003c/p\u003e\n\u003cp\u003e“I’m sure he’ll tell her soon. He knows I’m better for him—I’m even ready to be a step-mommy to Cara, and he knows Emma’s too young for that. Hey, he’s calling in—gotta go.”\u003c/p\u003e\n\u003cp\u003eI pretend to flash over. I imagine Emma around the corner, pressed to the wall, listening to every word I say. Time to step it up.\u003c/p\u003e\n\u003cp\u003e“Hey gorgeous.” My voice is a purr. “When are you going to tell her?” She’s probably leaning against that wall, stunned. I shove the guilt away. I’m right for him. “Graham, I know it seems brutal, but you’ve got to rip the bandage off. I want to be with you, out in the open.”\u003c/p\u003e\n\u003cp\u003eReid murmurs, “Brutal indeed.”\u003c/p\u003e\n\u003cp\u003e“Yes, I can come down there now.” I start to turn in Emma’s direction. “I want you, too. You’ll see just how much when I get to your door.”\u003c/p\u003e\n\u003cp\u003eReid starts to make another comment and I hang up on him.\u003c/p\u003e\n\u003cp\u003eEmma scrambles into the alcove labeled Ice and Vending just before I round the corner. Hearing one small, audible sob, I hesitate, but I force myself to glide towards Graham’s room without looking back. I’m right for him. I turn into the short hallway where his room is located and wait. I would say now comes the tricky part, but this whole damned thing is tricky. I don’t think she’ll come to his room to confront us. I gambled on the fact that she wouldn’t confront me, ten seconds ago, but who knows. Which is why Reid is about to inadvertently intercept her.\u003c/p\u003e\n\u003cp\u003e“Emma?” I hear his voice around the corner, on cue. “What’s the matter?”\u003c/p\u003e\n\u003cp\u003eI creep quietly towards the corner, not daring to peer around yet. I hear her gasping and hope she doesn’t start hyperventilating or something, because that would screw up our plans right quick. “I can’t—I can’t—” she says, the sob in her throat breaking free.\u003c/p\u003e\n\u003cp\u003eI edge around the corner, carefully. Reid is facing me, Emma facing him. Perfect. There’s no betraying glance from him, though I know he’s aware of me. He takes her face in his hands and stares down into her eyes with the most compassionate look I’ve ever seen on his face. My God, he’s good.\u003c/p\u003e\n\u003cp\u003e“Come with me,” he says. “We can’t talk out here in the hall.” She sobs again as he pulls her close, one hand gentle on the back of her neck, the other flat at the small of her back. Bending his head to hers, he murmurs something I can’t decipher, and she nods. They turn, his arm around her, and walk to his door. They go inside.\u003c/p\u003e\n\u003cp\u003eI pull back around the corner and walk to Graham’s room, scrolling through the photos I’ve just taken, making sure each one is clear.\u003c/p\u003e\n\u003cp\u003eThis may be the most underhanded thing I’ve ever done, and the guilt is a bit crushing. I console myself with the knowledge that Reid really does seem to care about her. He’ll take care of her well enough. For a little while.\u003c/p\u003e\n\u003cp\u003ePushing Emma’s tears from my mind, I focus on the goal at hand. My mother used to be fond of archaic sayings like: Don’t put all your eggs in one basket and You can’t make an omelet without breaking a few eggs and I’m always walking on eggshells around you. The last time she declared one of these I said, “What’s with all the damned egg wisdom? Is this all You can take the girl off the farm…” reminding her of her hog-slopping, chicken-chasing, Neiman Marcus-free past. She never said anything about eggs again.\u003c/p\u003e\n\u003cp\u003eNow, for some unfathomable reason, those clichés are pouring into my head—because my eggs are all in one basket. And I just broke them all to make one giant-ass omelet. And every step to Graham’s room is on eggshells, because this has to work. This has to work.\u003c/p\u003e\n\u003cp\u003eI’m right for him.\u003c/p\u003e\n\u003cp\u003eI knock on his door and he opens it with a smile, which fades a bit when he sees me. My heart falters. He was hoping for Emma. I drink in the jealousy because it obliterates any feeling of remorse. His head angles the tiniest bit. “Brooke?” he says. I push myself to stand taller and look him in the eye with an expression of pity.\u003c/p\u003e\n\u003cp\u003e“Graham. I have… something to show you.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t move from the doorway. “What?”\u003c/p\u003e\n\u003cp\u003eI indicate his room. “Can we go inside, please? I need to show you in private.”\u003c/p\u003e\n\u003cp\u003eHe frowns, noting that I’m holding nothing but my phone, and stands back so I can enter.\u003c/p\u003e\n\u003cp\u003eI perch on the edge of his bed and pat the space next to me. “Sit.”\u003c/p\u003e\n\u003cp\u003eHe sits, still frowning. “What’s this about?”\u003c/p\u003e\n\u003cp\u003eIt’s about damned time, I think. “It’s about Emma. And… Reid.” His frown deepens and I pull up the photos on my phone. “I was going to get some ice, so I could chill a little Patron. I overheard them in the hall, whispering. And when I looked around the corner…” I hand him my phone, with the first photo pulled up.\u003c/p\u003e\n\u003cp\u003eHe scrolls through them, slowly. One. Two. Three. Four. And again. And again. He hands my phone back to me, silent. A wild pulse vibrates at the base of his throat, and he’s so quiet I’m afraid to breathe.\u003c/p\u003e\n\u003cp\u003e“Graham—”\u003c/p\u003e\n\u003cp\u003e“I’d like to be alone, Brooke.” He doesn’t look at me.\u003c/p\u003e\n\u003cp\u003eI swallow. The key to this working is no confrontation, no communication between them, just like last fall. “I can’t leave you alone, Graham.” I place my hand on his arm, carefully. “You don’t have to talk. But I’m not leaving you alone with this.”\u003c/p\u003e\n\u003cp\u003eCovering his eyes with both hands, he lies back on the bed, knees still bent at the end, feet on the floor. I lean next to him without touching him, prop myself beside him on my elbow as he inhales, exhales, inhales, exhales. Finally, his hands drop and stares at the ceiling. He’s not crying. He doesn’t look angry. His face is nearly devoid of expression, as though someone took an eraser to it. Except his eyes. In his eyes, thoughts are rolling like a searchlight, scanning dark corners. \u003c/p\u003e","sourceLink":"https://allnovel.net/where-you-are-between-the-lines-2/page-38.html","bookId":2740,"creation":"Oct 5, 2019 4:40:41 PM","modification":"Oct 5, 2019 4:40:41 PM"}
