{"id":83428,"no":12,"title":"Page 12","content":"\u003cp\u003eHe seemed to doubt my memory, though, because he extended a hand.\u003c/p\u003e\n\u003cp\u003e“We met once—a long time ago. I’m Max—”\u003c/p\u003e\n\u003cp\u003e“Edwards,” I filled in. “Formerly of Interpol. More recently of a high-level task force in charge of arresting high-level Circle leaders and their teenage sons.”\u003c/p\u003e\n\u003cp\u003eHe laughed a little, amused by my moxie, then said, “It’s nice to see you again, Cammie. I’m sorry we didn’t get to speak in Rome. I’ve become something of…a fan.”\u003c/p\u003e\n\u003cp\u003eHe had a way of speaking, low and almost under his breath, as if I were the only person in the world who was meant to hear his words, even as we stood three feet away from my mother.\u003c/p\u003e\n\u003cp\u003e“Oh. Really?” I said, almost mocking, as he looked at me over the top of his glasses.\u003c/p\u003e\n\u003cp\u003e“It’s a compliment, Cammie. You’ve made quite a name for yourself, you know?”\u003c/p\u003e\n\u003cp\u003eI did know. But I was also pretty sure that it wasn’t the kind of compliment covert operatives usually wanted.\u003c/p\u003e\n\u003cp\u003eHe lowered his voice even further. “I was very sorry to hear about your father’s passing. And what you went through. You have my condolences, Cammie.”\u003c/p\u003e\n\u003cp\u003eBut I didn’t want his sympathy. So I just turned toward my mother. “What is he doing here?” I asked.\u003c/p\u003e\n\u003cp\u003e“He’s here with a request,” my mother said.\u003c/p\u003e\n\u003cp\u003e“As you are well aware, Cammie, the Circle of Cavan is currently engaged in a record level of activity,” the man told me. “As such, there is a new interagency task force. CIA. MI6. Interpol. Israeli Secret Service. All the usual players are taking part, and—”\u003c/p\u003e\n\u003cp\u003e“I know all this. Get to the part I don’t know,” I told him, my patience running out.\u003c/p\u003e\n\u003cp\u003e“What you saw in Italy, Cammie. That was the result of this task force. We’re going to track the Circle leaders down.”\u003c/p\u003e\n\u003cp\u003eI glanced at my mother, and Agent Edwards must have read the look that passed between us.\u003c/p\u003e\n\u003cp\u003e“I know what you’re thinking, Cammie. The Circle has double agents, moles, traitors at every level of every agency. Well…that’s why this task force doesn’t report to any agency. We are very small. We are very select. We only have people we trust completely. And one of the people I trust most…is you. That is why I’ve come to ask a favor.”\u003c/p\u003e\n\u003cp\u003e“I’m not doing any favors for you,” I snapped.\u003c/p\u003e\n\u003cp\u003e“Hear him out, Cammie,” Mom warned, but I raged on.\u003c/p\u003e\n\u003cp\u003e“Did you bring Preston here?” I asked, but I didn’t really let myself be hopeful.\u003c/p\u003e\n\u003cp\u003e“No,” Max Edwards said. “But there is something you and I need to discuss.”\u003c/p\u003e\n\u003cp\u003e“Make no mistake about it, Agent Edwards, you can try to make me talk—you wouldn’t be the first,” I reminded him. “But that didn’t work out so well the last time, so you can save yourself the trouble.”\u003c/p\u003e\n\u003cp\u003eI started for the door.\u003c/p\u003e\n\u003cp\u003e“I’m not here to question you, Cammie.” The man’s words stopped me. “Not about Preston. Not about anything.”\u003c/p\u003e\n\u003cp\u003eAnd I couldn’t help myself. I turned and glared at him. “Then why are you here?”\u003c/p\u003e\n\u003cp\u003eHe shrugged, as if looking for a way to finally say, “I guess because we need your help.”\u003c/p\u003e\n\u003cp\u003e“I’m not helping you.”\u003c/p\u003e\n\u003cp\u003e“It’s not for me,” he said, and I didn’t move again. “As you know, when possible, we’ve been taking Circle members into custody. A few of the lower-level assets have been somewhat cooperative. But Mr. Winters…he is refusing to speak to anyone.”\u003c/p\u003e\n\u003cp\u003e“What did you expect?” I laughed a little at his naïveté.\u003c/p\u003e\n\u003cp\u003e“I’m sorry.” He smiled a condescending smile. “What I meant to say is that he refuses to speak to anyone…but you.”\u003c/p\u003e\n\u003cp\u003eAnd at last I was surprised. For all of his experience and training, Agent Edwards and his task force needed me.\u003c/p\u003e\n\u003cp\u003e“As I told you earlier, Agent Edwards,” Mom began, “my daughter does not have to go anywhere with you. She doesn’t have to help you. She will not—”\u003c/p\u003e\n\u003cp\u003e“I’ll do it.”\u003c/p\u003e\n\u003cp\u003e“Cammie,” my mother said, “you don’t have to do this. You don’t have to go and you do not have to help. It could be dangerous,” she added, the last part a warning.\u003c/p\u003e\n\u003cp\u003e“That’s true, Cammie,” Agent Edwards said, walking toward me. “Your mother is right. So what do you say?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I told him. “I’ll do it. I’ll—”\u003c/p\u003e\n\u003cp\u003eBut I never got to finish, because in the next second a syringe was in Agent Edwards’s hand, and the needle was in my arm, and just that quickly my mother’s office began to spin, the whole world spiraling quickly into black.\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003eThe room was black around me. A pounding, throbbing ache filled my head. I waited for my eyes to adjust to the darkness, but they didn’t. Instead, I was swallowed by the hollow emptiness, uncertain how to break free.\u003c/p\u003e\n\u003cp\u003eI shivered and realized I was freezing cold. My uniform felt familiar against my skin, and I knew that no one had bothered to change my clothes in the time that I’d been unconscious. But how long had that been? A few hours? A few days? The last time I’d woken up in a strange place, I’d just lost months of my life, and that memory came pounding back then. My head hurt. My arms and legs ached. I felt something churning in my stomach, and I couldn’t help myself, I was sick—vomit covered the floor, and I started to cry. I started to scream. I wanted out. I needed out. So I stood and pressed my hands against the walls.\u003c/p\u003e\n\u003cp\u003eI felt cold steel. Metal. Something man-made and foreign. And I knew that even though I was no longer being held by the Circle in Austria, I most certainly wasn’t in the Gallagher Academy anymore, either.\u003c/p\u003e\n\u003cp\u003eSlowly, I eased down the wall, feeling my way as I went, forcing myself to breathe deeply, steadily.\u003c/p\u003e\n\u003cp\u003e“I’m okay,” I said aloud to no one but myself. “I’m not lost. I’m not lost. I’m not—”\u003c/p\u003e\n\u003cp\u003eAnd then I found the lever. And then I turned it and felt the door shift against my hands. Light poured in, and I shut my eyes as I stumbled forward, out of the back of a van and into a massive, empty hangar. Bright fluorescent lights hung above; but inside there was nothing but the plain, unmarked van…and me.\u003c/p\u003e\n\u003cp\u003e“Hello, Cammie.” I jerked my head upward and saw Max Edwards standing on the catwalk that ran across the top of the room. “Welcome back.”\u003c/p\u003e\n\u003cp\u003e“Where are we?” I asked, my voice groggier than it should have been. My head pounded and swirled.\u003c/p\u003e\n\u003cp\u003eAgent Edwards was coming down the stairs, strolling easily toward me.\u003c/p\u003e\n\u003cp\u003e“I’m sorry you had to wake up alone like that, Cammie. I thought you’d sleep for at least another hour. Good thing I came to check on you.”\u003c/p\u003e\n\u003cp\u003eI rubbed my aching head. “My grandma says I have a high metabolism. Besides, I’m really, really good at being knocked unconscious. I have a lot of experience with that.”\u003c/p\u003e\n\u003cp\u003eAgent Edwards chuckled like he thought I was making a joke. I wasn’t.\u003c/p\u003e\n\u003cp\u003e“You’re not going to tell me where we are, are you?”\u003c/p\u003e\n\u003cp\u003e“No, Cammie. I’m not.”\u003c/p\u003e\n\u003cp\u003e“Or when we are?”\u003c/p\u003e\n\u003cp\u003e“No again. A smart girl like you can use time to calculate distance, Cammie, and you know I can’t let you do that. That wasn’t part of the deal.”\u003c/p\u003e\n\u003cp\u003e“Because this is need-to-know, and I don’t?” I asked.\u003c/p\u003e\n\u003cp\u003eHe smiled and shook his head. “Because you wouldn’t believe me.”\u003c/p\u003e\n\u003cp\u003eMax Edwards led the way down a long, narrow hallway. Cameras hung at regular intervals. It was all steel and concrete, and I felt the chill that seeped through the walls. “So how far underground are we?” I asked the man, who didn’t say a thing.\u003c/p\u003e\n\u003cp\u003eWe passed beneath a series of strange grates.\u003c/p\u003e\n\u003cp\u003e“Biohazard detectors?” I asked. “Air vents?”\u003c/p\u003e\n\u003cp\u003eAgain, the man was silent, but I didn’t need him to reply. I just needed him to take me to Preston, so I kept counting our steps, noticing the gradual incline of the hall. I wasn’t exactly new to covert underground facilities, so wobbly head and upset stomach or not, I was starting to feel like I might be on slightly familiar ground. But then the hallway turned, and I came to an abrupt stop in front of the most intimidating door I’d ever seen.\u003c/p\u003e\n\u003cp\u003e“Well, this is special,” I said while Edwards waved up at a security camera that was stationed overhead. “If I didn’t know any better”—I talked on while Edwards placed his palm on a scanner and looked into a retinal image camera—“I’d say this is a door fit for a…”\u003c/p\u003e\n\u003cp\u003eThe door sprang open, swinging wide, as I finished, “…prison.”\u003c/p\u003e\n\u003cp\u003eI glanced up at Agent Edwards, but again he said nothing. Still, I could see in his eyes that I was right.\u003c/p\u003e\n\u003cp\u003eThere were guards and thick walls. Cameras covered every angle, not hidden, not disguised. It was a place built to remind you that Big Brother was watching.\u003c/p\u003e\n\u003cp\u003eThe doors were made to lock down in a flash. It was all steel and chrome and concrete, and even if Edwards had had the forethought to pack me a jacket, I’m pretty sure I would have shivered.\u003c/p\u003e\n\u003cp\u003e“He shouldn’t be in prison,” I snapped at the man beside me. But Agent Edwards only laughed, a condescending huff that, despite the chill, burned me.\u003c/p\u003e\n\u003cp\u003e“Preston Winters is the next generation of one of the most powerful and notorious criminal families in the history of the world. Put your hand here, Cammie,” he instructed, almost as an afterthought, but I did as I was told.\u003c/p\u003e\n\u003cp\u003eMy palm stung, but I didn’t let him see me wince.\u003c/p\u003e\n\u003cp\u003eFinally, the guards cleared us to go through yet another massive door. I felt Agent Edwards’s hand on my back. If I hadn’t known better, I would have sworn he was worried for me as he instructed, “Once in the room, Cammie, do not leave your chair. You cannot carry anything in your pockets or in your hair. Do not mention the day of the week or the time of day.”\u003c/p\u003e\n\u003cp\u003eThere, among those windowless rooms and artificial lights, I knew the game they were playing.\u003c/p\u003e\n\u003cp\u003e“I don’t know the day of the week or the time of day,” I reminded him.\u003c/p\u003e\n\u003cp\u003e“Of course.” He didn’t scold me. He sounded too nervous.\u003c/p\u003e\n\u003cp\u003e“This is wrong,” I told him. “He doesn’t deserve to be here.”\u003c/p\u003e\n\u003cp\u003e“These are the rules, Cammie. Now, you can abide by them, or you can leave and we will have gone to a great deal of trouble for nothing. It’s your call.”\u003c/p\u003e\n\u003cp\u003eThere comes a time in every spy’s life when you don’t have the luxury of caring. Emotion is a rarity, a commodity so precious that you have to dole it out in special, secret batches. Agent Edwards had passed that point. This was a place for people who had to be immune to what they did, to what it meant. And I didn’t know if the chill inside the prison came from being underground or from the cold hearts of the people who filled it.\u003c/p\u003e\n\u003cp\u003eHe looked at me as if I were still young and innocent, as if part of him envied me because I was still able to feel. A part of me wondered how much longer I had before my heart froze over too.\u003c/p\u003e\n\u003cp\u003e“Come, Cammie.” He reached for the final door. “Your country needs you.”\u003c/p\u003e\n\u003cp\u003eThe first time I met Preston Winters he’d been twenty pounds too light for his frame, wearing clothes that were chosen by some focus group somewhere. He’d been too quick to smile—too easy to laugh. He’d been all about bad jokes and good eye contact, and I’d liked him. I’d liked him a lot. \u003c/p\u003e","sourceLink":"https://allnovel.net/united-we-spy-gallagher-girls-6/page-12.html","bookId":2750,"creation":"Oct 5, 2019 4:52:08 PM","modification":"Oct 5, 2019 4:52:08 PM"}
