{"id":83444,"no":28,"title":"Page 28","content":"\u003cp\u003e“A grown man blown to bits is sad. A small girl killed just days after her father.… An entire line wiped out.… That will cause the world to burn. The Iranians will have to break the treaty. And when the Iranians invade Caspia, Turkey will invade, and…boom.”\u003c/p\u003e\n\u003cp\u003e“We have to find her,” I said, turning to Zach.\u003c/p\u003e\n\u003cp\u003e“No.” Catherine shook her head slowly. I don’t know if Liz’s drugs were finally becoming too much, but her voice had a hazy quality as she looked at me. “No. You don’t.”\u003c/p\u003e\n\u003cp\u003e“But we…” I started, then something in her eyes made me stop. She shook her head.\u003c/p\u003e\n\u003cp\u003e“You know where she is, Gallagher Girl.” The words sounded different when Zach’s mother said them. Haunting and dangerous and cruel.\u003c/p\u003e\n\u003cp\u003e“Amirah.” I whispered the princess’s name and thought about my first night back at school, about the tiny seventh grader with the big brown eyes and utterly royal countenance. “Amy. She goes to the Gallagher Academy, doesn’t she?”\u003c/p\u003e\n\u003cp\u003eA dreamy smile spread across Catherine’s lips. “Good girl,” she told me. “It is a school fit for a queen. Now, go. Stop them.”\u003c/p\u003e\n\u003cp\u003e“Step away from the psychopath!”\u003c/p\u003e\n\u003cp\u003eI knew the voice as soon as I heard it, but still part of me was almost afraid to turn around.\u003c/p\u003e\n\u003cp\u003eMy aunt Abby’s eyes were on fire, and she crossed the room in two long strides, grabbing my arm and physically pulling me farther from Zach’s mother.\u003c/p\u003e\n\u003cp\u003e“Abby!”\u003c/p\u003e\n\u003cp\u003eAt first, I was terrified—afraid my friends and I had been caught playing hooky. But then my fear turned to relief as I realized Abby and Townsend had found us. We didn’t have to be on our own anymore.\u003c/p\u003e\n\u003cp\u003e“Abby, you’re here! How did you find us? Did you get my messages? Were you—”\u003c/p\u003e\n\u003cp\u003e“We weren’t following you,” Townsend told us. “We were following her.” He pointed to the woman tied to the chair, eyelids fluttering.\u003c/p\u003e\n\u003cp\u003eFinally, Abby released me and moved to examine Catherine.\u003c/p\u003e\n\u003cp\u003e“What did you do to her?” Abby asked. She picked up the empty syringe, smelled it. “Is that truth serum?” she asked, but Townsend just shook his head.\u003c/p\u003e\n\u003cp\u003eI could tell he was thinking about his own experience with that particular concoction when he huffed and said, “It’s stronger.”\u003c/p\u003e\n\u003cp\u003e“Well, isn’t this precious?” Catherine smiled weakly and forced her eyes open, almost like she didn’t dare drift off in the middle of the party.\u003c/p\u003e\n\u003cp\u003e“Abby, Catherine says the Circle is going to target Princess Amirah next,” Bex said.\u003c/p\u003e\n\u003cp\u003e“Yes,” Zach’s mother said with a decisive nod. Then, just as quickly, she shrugged. “I think so. No one knows exactly what the Circle leaders will do. They are capable of anything, after all. But I believe that is their next move. So I came here to tell the good guys so that they can save the day. Isn’t that what you do, darling?”\u003c/p\u003e\n\u003cp\u003e“Shut up! Just shut up!” Zach snapped. “I will never believe anything you say.”\u003c/p\u003e\n\u003cp\u003eShe looked at him and shook her head, smiled a little as she told him, “You are so like your father.”\u003c/p\u003e\n\u003cp\u003eThen she looked past me and Zach, past Bex and Abby, to where Agent Townsend stood by the door with his arms crossed.\u003c/p\u003e\n\u003cp\u003e“What do you think, Townsend, darling? Isn’t he like you?” She looked at Zach again. “I think he’s just like you.”\u003c/p\u003e\n\u003cp\u003eAnd then she closed her eyes and drifted off to sleep.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-three\u003c/p\u003e\n\u003cp\u003eThings my aunt said: She lies.\u003c/p\u003e\n\u003cp\u003eThings my boyfriend said: She lies.\u003c/p\u003e\n\u003cp\u003eThings my gut said: She lies.\u003c/p\u003e\n\u003cp\u003eThings I couldn’t deny: She was under the influence of truth serum.\u003c/p\u003e\n\u003cp\u003eThings we all had to admit: She wasn’t lying.\u003c/p\u003e\n\u003cp\u003e“Zach?” I asked, my voice too quiet in the darkness. The wind was strong and I could hear the waves crashing on the beach. Another storm was blowing in. I could feel it in the air. And as I stepped off the creaking porch and across the yard I tried again. “Zach.” But he didn’t answer.\u003c/p\u003e\n\u003cp\u003eI saw a dark shadow moving against the waves, leaning into the wind, so I walked down the tiny path, careful not to trip any of the alarms that had been set inside of him. I rubbed my arms and wished I’d brought a sweater, but Zach just stood in the blowing mist, his gray T-shirt growing steadily darker in the damp.\u003c/p\u003e\n\u003cp\u003e“Townsend is looking for you.”\u003c/p\u003e\n\u003cp\u003eZach laughed, a cold, cruel sound. “Well, eighteen years, folks. Glad he finally got around to it.”\u003c/p\u003e\n\u003cp\u003e“Zach, he didn’t—”\u003c/p\u003e\n\u003cp\u003e“Did you know?” he asked but didn’t turn to face me.\u003c/p\u003e\n\u003cp\u003e“No, Zach. Of course not. Why would I know that?”\u003c/p\u003e\n\u003cp\u003e“Did Joe say anything to you? Did your mom?”\u003c/p\u003e\n\u003cp\u003e“My mom didn’t know, Zach,” I told him. “No one knew.”\u003c/p\u003e\n\u003cp\u003eI thought about how Zach and Townsend had always reminded me of each other. They had the same posture, the same grin, the same earnest, serious nature. And now I knew why. I wished I’d seen it before then, and I also wished we could go back in time to before we knew. But we couldn’t do either.\u003c/p\u003e\n\u003cp\u003e“She never told me!” Townsend’s voice echoed from inside. Abby slammed a door, and the whole house shook.\u003c/p\u003e\n\u003cp\u003e“Has Abby killed him yet?” Zach asked.\u003c/p\u003e\n\u003cp\u003eI shook my head. “She’ll get over it.”\u003c/p\u003e\n\u003cp\u003eThen he turned to me, the moonlight slicing across his face. The wetness in the air grew heavier and water clung to his hair as he said, “Maybe I won’t.”\u003c/p\u003e\n\u003cp\u003e“Zach—”\u003c/p\u003e\n\u003cp\u003e“He left me. With her.”\u003c/p\u003e\n\u003cp\u003e“He didn’t know about you, Zach.”\u003c/p\u003e\n\u003cp\u003e“He should have known! He’s a spy. An operative. It was his job to know.”\u003c/p\u003e\n\u003cp\u003eI eased forward, reached out to touch his arm.\u003c/p\u003e\n\u003cp\u003e“You should go talk to him, Zach. He’s a good guy,” I told him. “You’re a good guy.”\u003c/p\u003e\n\u003cp\u003eBut Zach just shook his head. He looked like the saddest boy in the world when he told me, “I’m never having kids.”\u003c/p\u003e\n\u003cp\u003eLet’s get one thing straight. I’m eighteen years old as I write this. Kids? Totally not on my radar. In that moment, living through the next week was pretty much my only goal. But I can’t say that Zach’s words didn’t stop me. That a part of my brain—the part that was trained to see fifty steps ahead—had to wonder what it meant. For me. For us.\u003c/p\u003e\n\u003cp\u003e“You aren’t?”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t do that to a child.”\u003c/p\u003e\n\u003cp\u003e“You’d be a good dad.”\u003c/p\u003e\n\u003cp\u003eBut Zach just laughed. It was a cruel, mocking sound. “Because I had such good parental role models?”\u003c/p\u003e\n\u003cp\u003e“You had Joe.”\u003c/p\u003e\n\u003cp\u003eThen Zach turned back to the water and the darkness and the crashing, breaking waves. “I didn’t have anyone.”\u003c/p\u003e\n\u003cp\u003eI could have said, You have me. I could have taken his hand and told him everything was going to be okay—that there was no way the past would repeat itself. Not with us. But I learned a long time ago not to make those kinds of promises. I knew better than anyone that life can change on a dime. That even the best dads sometimes go away forever.\u003c/p\u003e\n\u003cp\u003eSo instead I just asked, “What are we going to do about Amirah?”\u003c/p\u003e\n\u003cp\u003e“Who?” he asked, like he hadn’t heard his mother at all.\u003c/p\u003e\n\u003cp\u003e“The princess, Zach. She’s just a little girl. And that little girl is going to die. They’re going to kill her.”\u003c/p\u003e\n\u003cp\u003eZach sank down to sit on a rock. He kept his gaze locked on the sea as he told me, “No, they aren’t. We’re not going to let them hurt anyone ever again.”\u003c/p\u003e\n\u003cp\u003eChapter Thirty-four\u003c/p\u003e\n\u003cp\u003e“Cam.” I felt a kick against my leg. A bright light burned my eyes.\u003c/p\u003e\n\u003cp\u003e“Get up,” Abby snapped. She stood above me, sunshine from the window spilling across her shoulders.\u003c/p\u003e\n\u003cp\u003e“What…what time is it?”\u003c/p\u003e\n\u003cp\u003e“Showtime.”\u003c/p\u003e\n\u003cp\u003eI pulled my tennis shoes on over bare feet and raced after her down the creaky stairs.\u003c/p\u003e\n\u003cp\u003e“Where?” I asked, taking a few steps more. “Where are we going?”\u003c/p\u003e\n\u003cp\u003eAbby smiled. “Home.”\u003c/p\u003e\n\u003cp\u003eYou don’t really appreciate things until they’re gone. I know it’s a cliché, but it’s also true. I’d always known that someday I would leave the Gallagher Academy. We were just months from graduation when my friends and I decided to flee, after all. But even then I didn’t realize how much I’d miss falling asleep in the common room with my classmates, some chick flick playing on the TV. I didn’t know how much I’d miss my classes and my teachers—even homework would have been a welcome change from my new reality. (And don’t even get me started on our chef’s awesome crème brûlée.)\u003c/p\u003e\n\u003cp\u003eBut most of all, I missed the building and the grounds. Some people say the Gallagher Mansion is a house. Some say it’s a school. But for me, in that moment, all that really mattered was that it was my home. And I was coming back to it. But as excited as I was, that didn’t mean I wasn’t nervous.\u003c/p\u003e\n\u003cp\u003e“Are you sure this is a good idea?” Bex asked. It wasn’t the first time that I had to wonder if she and I might share a brain. “I mean, I’m pretty sure fugitives from justice aren’t supposed to go home.”\u003c/p\u003e\n\u003cp\u003e“We’re not going to stay long, girls,” my aunt told us. “We’re going to lock that woman in the Sublevels.” Abby choked on the words. She refused to utter Catherine’s name. “And then we’re going to pick up Amirah and get her out of there. After that, we hit the road and lay low until this is over. Deal?”\u003c/p\u003e\n\u003cp\u003e“Deal,” we all said in unison, and I couldn’t resist turning around to eye the car that followed us.\u003c/p\u003e\n\u003cp\u003eAbby had insisted we split up—boys in Townsend’s car, girls in the van. Maybe she had wanted to give Townsend a chance to bond with Zach. Or maybe she just couldn’t stand the idea of being in the same vehicle as Catherine. (Even if Catherine was locked in the trunk.)\u003c/p\u003e\n\u003cp\u003e“Abby,” Macey said carefully, “where will Amirah go?”\u003c/p\u003e\n\u003cp\u003e“Someplace safe, girls.”\u003c/p\u003e\n\u003cp\u003e“But can’t she stay here?” Liz asked. “The school is one of the most secure buildings in the country.”\u003c/p\u003e\n\u003cp\u003e“Not until we know your mom and Joe have taken out the last member of the Inner Circle. Even then, she’s still the queen of Caspia. She will need protection for the rest of her life. So the best thing for now is to take her someplace where no one will find her.”\u003c/p\u003e\n\u003cp\u003eOf course my aunt was right. It was what we had to do. But I thought back to the girl I’d met the first night of the semester. She seemed so young and happy in our halls. I hated that we had to take her away from her school and from her friends. I hated that she was having to grow up so quickly. Largely, I guess, because I totally knew the feeling.\u003c/p\u003e\n\u003cp\u003e“Patricia!” Aunt Abby yelled, throwing open the front doors. “Dr. Fibs! Madame Dabney, we’re back!”\u003c/p\u003e\n\u003cp\u003eIt wasn’t a terribly covert entrance, but I wasn’t complaining when I saw Madame Dabney appear at the top of the stairs.\u003c/p\u003e\n\u003cp\u003e“Abby, it’s so good to see you, darling!” She rushed toward us, pulled my aunt into a hug, then turned her gaze past Abby, to my roommates and me. Maybe it was the sun playing tricks on me, but I could have sworn I saw a tear roll down her cheeks. “Welcome home, girls.” \u003c/p\u003e","sourceLink":"https://allnovel.net/united-we-spy-gallagher-girls-6/page-28.html","bookId":2750,"creation":"Oct 5, 2019 4:52:08 PM","modification":"Oct 5, 2019 4:52:08 PM"}
