{"id":83422,"no":6,"title":"Page 6","content":"\u003cp\u003eMom looked down at her list one final time, then folded the paper. “I guess that’s it. Welcome back, girls. And have a great semester.”\u003c/p\u003e\n\u003cp\u003eShe smiled out across the room. It was like a spotlight, so bright and hopeful and happy. When my mother looked like that, it was easy to believe that there was no evil in the world. I wanted to know if she was faking or forgetting. Whatever the case, I was hoping our last semester at spy school would teach us how to do that for ourselves.\u003c/p\u003e\n\u003cp\u003eThat night, our suite was unusually quiet. It was the first night back, after all. We didn’t have any tests or homework. There should have been movie marathons and makeovers. Liz should have been clamoring for extra credit; but even she was silent as we sat on our beds, none of us talking.\u003c/p\u003e\n\u003cp\u003e“What is it, Lizzie?” Bex tried to tease. “Have you reached your lifetime limit for bonus points?”\u003c/p\u003e\n\u003cp\u003eUsually a remark like that would make Liz go white and ask whether or not a limit to extra credit was an actual thing. Then she’d dig out her Gallagher Academy Student Handbook just to make sure. But she didn’t do either. And that, let me tell you, was scary.\u003c/p\u003e\n\u003cp\u003e“Seriously.” Bex moved to Liz’s bed. “What is it?”\u003c/p\u003e\n\u003cp\u003e“Nothing.” Liz stood and picked up a bundle of clothes, starting for the bathroom. “It’s nothing.”\u003c/p\u003e\n\u003cp\u003e“Liar.” Bex cut her off.\u003c/p\u003e\n\u003cp\u003eOn her bed, Macey shifted to study us. But she didn’t mention Preston again. She didn’t ask about Cambridge.\u003c/p\u003e\n\u003cp\u003e“It’s nothing, Bex. I’m just tired.” Again, Liz tried to go to the bathroom, but again, Bex cut her off.\u003c/p\u003e\n\u003cp\u003e“Try again.”\u003c/p\u003e\n\u003cp\u003eRight then it was like all the nostalgia had been drained from Liz. She had a brand-new encryption textbook, but she wasn’t giddy. There was a stack of Microbiology Monthlys waiting for her, but she hadn’t even picked them up. Liz wasn’t being Liz, and Bex was right not to like it.\u003c/p\u003e\n\u003cp\u003e“What is it, Liz?” I asked, flanking her from the other side. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“It’s nothing,” Liz said, louder. “It’s just…I keep thinking about what Knight told you—about what the Circle is doing.… I don’t know. It’s just…” She gave a slight glance toward the window. “I can’t help but worry that things are going to get worse before they get better.”\u003c/p\u003e\n\u003cp\u003eInstinctively, my gaze followed hers. I totally knew the feeling.\u003c/p\u003e\n\u003cp\u003eIt wasn’t exactly surprising when I couldn’t fall asleep. I thought about Liz’s words, about my mother’s warnings. Living to see graduation didn’t seem as unlikely as it had a few months before, but Bex was right. The future was out there. And I couldn’t shake the feeling that it was more than a little bit scary.\u003c/p\u003e\n\u003cp\u003eThat was why I slipped out of my bed and out of our room, into the dark and chilly halls, wandering in silence until—\u003c/p\u003e\n\u003cp\u003e“Hi, Cammie.”\u003c/p\u003e\n\u003cp\u003eThe girl in the hall was tiny. Her arms and hands were so small, she looked almost like a doll; but her big brown eyes were so brilliant that I was convinced that she had to be either dream or ghost.\u003c/p\u003e\n\u003cp\u003e“Sorry if I scared you,” the girl told me. “I didn’t know anyone else was up.”\u003c/p\u003e\n\u003cp\u003e“That’s…that’s okay.”\u003c/p\u003e\n\u003cp\u003e“You don’t know me, do you?” the girl guessed. Then she shrugged and smiled a little. “That’s cool.” She honestly sounded like she meant it. “I’m Amy.” She held out her hand in a manner that would have made Madame Dabney proud.\u003c/p\u003e\n\u003cp\u003eThere was nothing at all self-conscious about her. She was so poised. So beautiful. If I hadn’t known better, I might have thought that I had been transported back in time to an audience with a very tiny Cleopatra.\u003c/p\u003e\n\u003cp\u003eI studied the girl, wondering why—in that moment—she seemed so familiar. Probably I’d seen her around, encoded her face. Maybe I’d even met her last semester during one of the trances that had taken me out of my right mind. But in any case, it felt like I knew her when she asked, “Are you okay, Cammie?”\u003c/p\u003e\n\u003cp\u003eShe tilted her head and looked up at me with those big, brown eyes. I wasn’t surprised that she knew my name and my face. She’d probably heard more than a few stories about all that had happened in the past few years. And right then she was looking up to me. Literally. Figuratively. She was looking at me like I was exactly who she was hoping to grow up to be.\u003c/p\u003e\n\u003cp\u003eBut right then all I wanted to do was go back in time and be her.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I told her. “I didn’t recognize you.”\u003c/p\u003e\n\u003cp\u003e“I’m a seventh grader.” She shook her head slowly. “You’re a senior. You’re not supposed to recognize me. Besides, I thought I was coming to a school where not being recognizable was an advantage.”\u003c/p\u003e\n\u003cp\u003eShe laughed a little, completely at home and at ease, and even though I didn’t know that seventh grader, I liked her.\u003c/p\u003e\n\u003cp\u003e“So tell me, Amy, what are you doing wandering around out here when everybody else is sleeping?”\u003c/p\u003e\n\u003cp\u003e“I like the mansion at night. It doesn’t really feel like a school then. When I’m alone and barefoot on the carpets, it feels just like a home. Like my home.”\u003c/p\u003e\n\u003cp\u003eI smiled and nodded and knew exactly what she meant.\u003c/p\u003e\n\u003cp\u003eThe grandfather clock at the end of the hall started to chime. Three o’clock. In four hours, those halls would be filled with screaming girls and swinging backpacks, long lines at the waffle bar and a whole new semester.\u003c/p\u003e\n\u003cp\u003eMy last semester.\u003c/p\u003e\n\u003cp\u003eI looked at my new little friend and tried to see the mansion through her eyes—before the world got so close to our walls.\u003c/p\u003e\n\u003cp\u003e“Good night, Cammie,” Amy called to me as she walked to the end of the hall. She stopped with her hand on the banister, looking back over her shoulder at me. “We’re all glad you’re back.”\u003c/p\u003e\n\u003cp\u003eAnd then she disappeared up the stairs without a word or a sound; and I stood, silently wondering if I might have been mistaken. Maybe she really had been a dream.\u003c/p\u003e\n\u003cp\u003eChapter Six\u003c/p\u003e\n\u003cp\u003eIf our teachers were feeling any nostalgia about its being our Last First Day of a New Semester Ever, they totally didn’t show it the following morning.\u003c/p\u003e\n\u003cp\u003eFor starters, they made us have our breakfast conversations in Mandarin, and then Madame Dabney came by and reminded everybody that our holiday thank-you cards were due in the mail by noon. (Madame Dabney takes her thank-you cards very seriously.)\u003c/p\u003e\n\u003cp\u003eBut the day didn’t really get weird until my roommates and I joined the rest of the senior Covert Operations class in Sublevel Three. Because…well… Sublevel Three was empty.\u003c/p\u003e\n\u003cp\u003eMr. Solomon was gone.\u003c/p\u003e\n\u003cp\u003eAunt Abby was who-knew-where.\u003c/p\u003e\n\u003cp\u003eTechnically, Agent Townsend hadn’t been on the Gallagher Academy payroll all year.\u003c/p\u003e\n\u003cp\u003eExactly who I had been expecting as soon as we stepped off the elevator and into the ancient space, I wasn’t quite sure.\u003c/p\u003e\n\u003cp\u003eAnd then I heard the voices.\u003c/p\u003e\n\u003cp\u003e“Is the landline secure?” Mr. Smith asked.\u003c/p\u003e\n\u003cp\u003e“I think so,” my mother said. “But needless to say, we aren’t taking any chances.”\u003c/p\u003e\n\u003cp\u003e“Ask for Romero,” Mr. Smith was whispering just as the entire senior CoveOps class came walking around the corner.\u003c/p\u003e\n\u003cp\u003e“Mom?” I asked. “What are you doing here? Are you teaching us?” I asked, too much optimism in my voice. I should have known better.\u003c/p\u003e\n\u003cp\u003e“No, Cam. I’m sorry.” Mom brushed a hand across my cheek and put something in a backpack.\u003c/p\u003e\n\u003cp\u003eBehind her, Mr. Smith closed a door marked STORAGE with a snap. I heard the whining of gears and motors as the school’s security measures clicked into place, locking the closet, keeping whatever lay inside just out of reach.\u003c/p\u003e\n\u003cp\u003e“Good morning, ladies,” Mr. Smith said, even though he’d already seen us in Countries of the World. “If you’ll go back to class and take a seat, I’ll be right—yes, Ms. McHenry?” he asked Macey with a sigh.\u003c/p\u003e\n\u003cp\u003e“Where’s Mr. Solomon?”\u003c/p\u003e\n\u003cp\u003e“Away,” Mr. Smith said in a manner that totally didn’t encourage follow-up questions.\u003c/p\u003e\n\u003cp\u003eI watched the rest of the senior class pivot and start for our classroom, turning and moving like a flock of geese, but I was frozen to the spot. I looked from my mother to the backpack, from Mr. Smith’s eyes to hers. And I knew what had brought her all the way to Sublevel Three.\u003c/p\u003e\n\u003cp\u003e“You found another descendant, didn’t you?” I asked as soon as the rest of the class had left, but I didn’t wait for an answer. “Which one is it? William Smith? Is it the granddaughter in Toronto? I thought she might—”\u003c/p\u003e\n\u003cp\u003e“It’s not the woman in Toronto,” Mom said, her voice firm. “She’s descended from a different William Smith. Now, you need to—”\u003c/p\u003e\n\u003cp\u003e“Don’t tell me to stop worrying!” I snapped, louder than I’d intended. “The Circle of Cavan is planning something awful. Mr. Solomon and Zach are gone who knows where. We haven’t seen Aunt Abby or Agent Townsend in weeks.”\u003c/p\u003e\n\u003cp\u003e“Trust me, Cam, you don’t need to worry about my sister and Agent Townsend,” Mom said, but I was still rambling on.\u003c/p\u003e\n\u003cp\u003e“Zach’s mother is going around killing people. She’s killing people—and their kids—and I can’t do anything but worry.”\u003c/p\u003e\n\u003cp\u003e“I’m so sorry, sweetheart.” Mom sounded like she meant it, and I think she really did. “I have to go.”\u003c/p\u003e\n\u003cp\u003eI didn’t ask where. I didn’t ask why. I knew better than to beg for answers. She was never going to give them.\u003c/p\u003e\n\u003cp\u003e“Are you going to get Preston?” Macey called from the end of the hall.\u003c/p\u003e\n\u003cp\u003eMom shook her head. “No.”\u003c/p\u003e\n\u003cp\u003e“But you’re leaving, aren’t you? To track down one of them…one of the Inner Circle?” I asked, but my mother’s silence was her answer.\u003c/p\u003e\n\u003cp\u003eI watched her turn and walk steadily to the end of the hall, no hesitation. No fear.\u003c/p\u003e\n\u003cp\u003e“Mom,” I yelled, and she glanced back, dark hair falling across her shoulders. “Be careful.”\u003c/p\u003e\n\u003cp\u003eIt was cold as we walked from the P\u0026amp;E barn and back to the mansion that night. We shivered in our uniforms and thin sweaters. Overhead, there was a blanket of clouds hanging between us and a starry sky. I thought about Zach and Mr. Solomon, my mom and Aunt Abby. I wondered where in the world they might be. Was it cold there too? Or were they someplace where it was summer and the middle of the day? There were about a million things I didn’t know, so I gave up trying to guess the answers. Instead, I wondered what they would do if they were the ones being left behind, treated like they were helpless.\u003c/p\u003e\n\u003cp\u003eThe Circle of Cavan wasn’t my own private mission, no matter how personal it felt. It hadn’t started with me. But somehow I couldn’t shake the feeling that it was going to end with me. Eventually.\u003c/p\u003e\n\u003cp\u003eAnd right then I couldn’t take it anymore. The waiting. The helplessness. I didn’t want to go back in time anymore. I was ready for my future when I stopped and asked, “Okay. What can we do?”\u003c/p\u003e\n\u003cp\u003eIt wasn’t a rhetorical question. Very few questions at our school ever are.\u003c/p\u003e\n\u003cp\u003e“What do you mean, Cam?” Liz asked.\u003c/p\u003e\n\u003cp\u003e“I mean, we don’t know what the Inner Circle is planning and, aside from Ambassador Winters, we don’t know where any of them are.” I shrugged at the irony. “I don’t even know where my boyfriend is. Still, I don’t know about you guys, but I’m going to go crazy if I don’t do something.” \u003c/p\u003e","sourceLink":"https://allnovel.net/united-we-spy-gallagher-girls-6/page-6.html","bookId":2750,"creation":"Oct 5, 2019 4:52:08 PM","modification":"Oct 5, 2019 4:52:08 PM"}
