{"id":75201,"no":35,"title":"Page 35","content":"\u003cp\u003eAll those jokes women made about not being able to “walk right” after great sex? Bobbi totally got it now.\u003c/p\u003e\n\u003cp\u003eBut that was really no big deal in light of how emotionally devastated she felt after Gabe’s demeaning stipulations on how they conduct this new aspect of their relationship. Her decision to have sex with him despite that had seemed like a brave step forward last night but now seemed absurdly naïve.\u003c/p\u003e\n\u003cp\u003eIf she felt this awful about herself after just one night, how much worse would it get if they continued to have sex on a regular basis? She didn’t know if she had the stomach for this. Gabe had made her feel small and cheap. No that wasn’t fair . . . she had allowed Gabe to make her feel small and cheap. She bore half of the blame for this dreadful situation and she knew that.\u003c/p\u003e\n\u003cp\u003eShe exhaled impatiently as she listened to the ridiculous “hold” music while she waited for the supplier to come onto the line.\u003c/p\u003e\n\u003cp\u003e“Are you ignoring my calls, sweetheart?” The dark voice coming from the doorway of her tiny office nearly shocked her into dropping the receiver, and she fumbled frantically to keep it from falling.\u003c/p\u003e\n\u003cp\u003e“God,” she gasped. “You nearly scared me half to death.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” he said, sounding not at all remorseful. “I didn’t mean to sneak up on you.”\u003c/p\u003e\n\u003cp\u003eShe watched him warily as he stepped into the tiny glass booth and shut the door behind him. He dominated the tiny space and she immediately felt boxed in and claustrophobic.\u003c/p\u003e\n\u003cp\u003e“Do you mind?” she snarled. “I’m working.”\u003c/p\u003e\n\u003cp\u003e“Why haven’t you answered my calls?” he asked, using his pristine white handkerchief to wipe down the chair opposite hers before seating himself and raising his eyes to hers expectantly. She merely stared back at him with a raised eyebrow and he smiled at her. The sincerity on his face nearly undid her, and she had to bite her lip to keep from smiling back at him.\u003c/p\u003e\n\u003cp\u003eHe glanced down at his handkerchief and his nose wrinkled fastidiously when he saw that it was covered in a layer of gray dust and grime from the chair. Nonetheless he folded it meticulously before dropping it into one of his jacket pockets. He was a classic fish out of water in this environment, and it saddened her to realize exactly how far removed his world was from hers.\u003c/p\u003e\n\u003cp\u003e“Well?” he prompted, and she looked at him blankly, forcing him to elaborate. “My phone calls? You’ve been ignoring them.”\u003c/p\u003e\n\u003cp\u003e“I haven’t, the line’s just been busy all morning.” She held up the receiver pointedly and he shook his head.\u003c/p\u003e\n\u003cp\u003e“I’ve been calling your cell,” he told her, and her brow furrowed as she patted herself down with one hand, before glancing around her cluttered desk.\u003c/p\u003e\n\u003cp\u003e“I must have forgotten it at home,” she said. “I’ve been having a bit of a Monday.”\u003c/p\u003e\n\u003cp\u003e“Have you eaten?” he asked.\u003c/p\u003e\n\u003cp\u003e“Not hungry.” She shrugged. The music in her ear paused and she perked up, only to slump back down when it resumed again. “Oh my God, maybe they figure if they keep me on hold long enough I’ll simply give up?”\u003c/p\u003e\n\u003cp\u003e“Want to have brunch with me?” he asked, and she glared at him irritably.\u003c/p\u003e\n\u003cp\u003e“What part of ‘I’m working’ did you not understand?” she asked sarcastically. “And why aren’t you at work for that matter? Does my dad know that you’re slacking off like this?”\u003c/p\u003e\n\u003cp\u003e“I am one of the bosses you know?” he pointed out levelly. “I can take some personal time.”\u003c/p\u003e\n\u003cp\u003e“Oooh, color me impressed,” she rejoined caustically, and he grinned at her sarcasm. One thing about Gabe, he always seemed to enjoy her sense of humor.\u003c/p\u003e\n\u003cp\u003e“I wanted to see if you were okay,” he said, the grin fading. “You know? After last night.”\u003c/p\u003e\n\u003cp\u003e“Really? You want to have this conversation now? Here?” she asked in disbelief, gesturing expansively toward the glass walls and the phone in her hand.\u003c/p\u003e\n\u003cp\u003e“No time like the present,” he stated, and she sighed long-sufferingly.\u003c/p\u003e\n\u003cp\u003eGabe watched her struggle with whatever she wanted to say to him and waited with baited breath for her response. She looked gorgeous this morning, her skin glowed with good health and vitality and her lips were still swollen from his kisses. God, she was so damned exquisite he could spend hours just watching her. He was resentful of every second he had wasted in the past—all those moments when he had simply not seen her. Had he been completely blind?\u003c/p\u003e\n\u003cp\u003e“Look Gabe, I . . . ,” she began seriously, only to tilt her head toward the telephone receiver that she held pressed against her ear. “Hello? This is Roberta Richmond from Richmond’s Auto Repair Shop. You sent me the wrong shipment and I . . . no, wait! Don’t put me on hold again. Don’t put . . . damn it.” The last two words emerged in a frustrated whisper and her shoulders slumped in despair. Her eyes darted back up to meet his.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she assured him. “No need to worry about me. We had some fun and today it’s business as usual right?”\u003c/p\u003e\n\u003cp\u003e“Right,” he concurred, feeling nauseated at the thought of returning to “business as usual.” It felt dishonest.\u003c/p\u003e\n\u003cp\u003e“Then why are you here?” she asked angrily, keeping her voice low. “This behavior is not the way we usually operate. You’ve never come to my shop on a Monday morning before to ask me if I’m okay. We don’t do brunch. Ever. I don’t go to your office and you don’t come to mine. At least you didn’t before last week. That’s not the way our friendship operates. So what the hell is going on? What do you want from me?” She had a point. Gabe was the one who had insisted that they behave normally, yet here he was, acting completely out of character. \u003c/p\u003e","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-35.html","bookId":1836,"creation":"Oct 5, 2019 10:34:34 AM","modification":"Oct 5, 2019 10:34:34 AM"}
