{"id":75204,"no":38,"title":"Page 38","content":"\u003cp\u003e“I thought you weren’t coming,” he gasped, fighting for breath. She grinned at him, her legs tightening around his waist.\u003c/p\u003e\n\u003cp\u003e“Really? I was kind of hoping that I’d be coming.” It was a silly play on words that barely made sense but it delighted him.\u003c/p\u003e\n\u003cp\u003e“I’ll work on that for you,” he promised, thrusting his hardness against her core and she moaned, burying her face in the hollow of his neck as she pushed herself against him, establishing a quick rhythm that nearly had them both spending in seconds. Luckily reason reasserted itself and Gabe groaned before dropping his hands to her hips to stop her sensual grinding.\u003c/p\u003e\n\u003cp\u003e“Stop that, damn it! I want to get you to a bed this time,” he growled.\u003c/p\u003e\n\u003cp\u003e“Well, what are you waiting for?” she asked impatiently, and he wrapped one hand around her back and cupped the other beneath her butt to support her as he clumsily made his way upstairs with her still clinging to him tightly.\u003c/p\u003e\n\u003cp\u003eWhen he reached his room, he stumbled his way to the bed, dropped her down on the soft mattress and climbed up with her in the same motion. He studied her appreciatively as she lay spread out beneath him and growled ferally before hunching down and unceremoniously dragging down her top and sucking one tight nipple into his mouth with a rough finesse that had her arching her back off the bed.\u003c/p\u003e\n\u003cp\u003e“Oh God,” she cried out, clamping her thighs against his hips and curling her fingers into his hair.\u003c/p\u003e\n\u003cp\u003e“This isn’t going to last long,” he muttered against her breast.\u003c/p\u003e\n\u003cp\u003e“I don’t care,” she sobbed, reaching down between them to fumble with his belt and fly. He hissed when she managed to get everything undone and finally wrapped her hands around his length. She stroked him with both hands and he shuddered in response.\u003c/p\u003e\n\u003cp\u003eHe didn’t bother removing her shorts; he merely pushed them aside and positioned himself at her entrance before shoving his way in. The contrasting sensations of the cotton of her underwear and the wet silk of her intimate flesh against his responsive shaft nearly made him come before he’d gotten more than the head in and he swore gutturally when he realized that the reason he was feeling so damned much was because he wasn’t wearing a condom. He never forgot to put on a condom and he was momentarily disconcerted by the lapse.\u003c/p\u003e\n\u003cp\u003e“Shit, shit, shit. No condom. I’m sorry.” It nearly killed him to withdraw and Bobbi wailed when he left her but he took care of the protection as quickly as he could under the circumstances and was back with her seconds later.\u003c/p\u003e\n\u003cp\u003e“Don’t do that to me again,” she rebuked, and he apologized with a kiss before thrusting his way back in. They didn’t last long. It was rough and fast and over in less than four minutes.\u003c/p\u003e\n\u003cp\u003eGabe watched her come in that erotic way of hers, so quiet with just a gasp and a moan and then a long release of breath. He couldn’t imagine ever tiring of that or of feeling her orgasm around his shaft. The way she pulsed around him pulled his own climax from him.\u003c/p\u003e\n\u003cp\u003e“Bobbi,” he groaned as he poured himself into her. Just that. Just her name. It was all that needed saying.\u003c/p\u003e\n\u003cp\u003eShe had stayed longer this time, Gabe reflected hours later as he watched her slight figure walk across the lawn toward the high fence between their properties. Long enough for them to have a round two—which had been slow, sensual, and utterly devastating—and round three in the shower. She had left immediately after the shower, ignoring Gabe’s entreaties for her to stay longer. She hadn’t even wanted him to walk her to the gate, insisting that she would be fine.\u003c/p\u003e\n\u003cp\u003eAs he reflected upon the past few hours, he realized that she hadn’t spoken much at all. She had told him what she liked and where she liked it. Had expressed her appreciation when he had done something that she enjoyed. Had said his name in so many different ways that he’d lost count of them but she hadn’t spoken of anything else. Hadn’t told him how work on the Corvette was progressing, hadn’t said if she’d solved the delivery mix up of that afternoon.\u003c/p\u003e\n\u003cp\u003eThe animated chatter that he was used to from her had been completely missing and the absence disturbed him.\u003c/p\u003e\n\u003cp\u003eCHAPTER EIGHT\u003c/p\u003e\n\u003cp\u003eGabe groaned and blindly reached for the cell phone on the nightstand. Who in the hell would be calling before six in the morning? He glared at the display but it read “unknown” and he dragged his thumb across the screen to answer.\u003c/p\u003e\n\u003cp\u003e“Gabriel Braddock,” he snapped.\u003c/p\u003e\n\u003cp\u003e“It’s me.” Chase. Gabe pushed himself up and winced when he felt a burning sensation on the skin of his shoulders. He reached up gingerly with his free hand and investigated. There were three deep scratches scored into the flesh of both shoulders. He remembered Bobbi dragging her fingers down his back during their second bout of lovemaking and grinned at the memory—half aroused as he recalled exactly why she had made them. He had taken her to the brink and then eased off, she had been pissed off but he had made it up to her, prolonging the encounter until she had been out of her mind with lust.\u003c/p\u003e\n\u003cp\u003e“Gabe?” Chase’s voice brought him back down to earth with a jolt.\u003c/p\u003e\n\u003cp\u003e“Yeah, sorry. I’m here . . . When are you arriving?” Despite everything that had happened over the last few days, thoughts of his brother had remained very firmly in his mind. He was happy that Chase was returning home and would be out of immediate danger for the moment at least.\u003c/p\u003e\n\u003cp\u003e“I’ll be landing in Cape Town at eight thirty this morning. Can you pick me up? Or send a car?”\u003c/p\u003e\n\u003cp\u003e“I’ll pick you up,” Gabe said.\u003c/p\u003e\n\u003cp\u003e“Thanks. See you later.” His brother still sounded off. Gabe couldn’t put his finger on it but something was very wrong. Chase disconnected the call before he could respond and Gabe put his phone aside and lay there for a while. He wondered if Bobbi was awake yet. She usually got an early start to the day. He decided to check and sent her an SMS. \u003c/p\u003e","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-38.html","bookId":1836,"creation":"Oct 5, 2019 10:34:34 AM","modification":"Oct 5, 2019 10:34:34 AM"}
