{"id":75206,"no":40,"title":"Page 40","content":"\u003cp\u003e“Easy there,” he crooned, amused when she fixed a bemused look on his face. She looked completely dazed and incapable of speech.\u003c/p\u003e\n\u003cp\u003e“Uh . . . right,” she finally said. “Thanks. I mean . . .”\u003c/p\u003e\n\u003cp\u003e“You’re welcome.” He grinned.\u003c/p\u003e\n\u003cp\u003e“Right. I’ve got to go . . .” She still looked completely discombobulated when she turned away from him again.\u003c/p\u003e\n\u003cp\u003e“Have a good day,” he called to her back and she acknowledged the sentiment with a wave. “See you tonight.” So maybe he had presumed too much with that last statement, but aside from straightening her shoulders, she said nothing in response to it.\u003c/p\u003e\n\u003cp\u003eShe had already disappeared through the gate by the time Gabe realized that he was still standing on his front steps with a ridiculously goofy grin on his face and made his way back into the house. The grin didn’t fade until after his shower.\u003c/p\u003e\n\u003cp\u003eHe wasn’t grinning an hour later when he watched Chase make his way through the domestic arrivals gate at Cape Town International Airport. Chase looked haggard. That was the only word he could think of to describe his twin. He looked like he had lost at least ten kilograms, his hair was a shaggy mess, he obviously hadn’t shaved in days, and his cheeks were sunken hollows.\u003c/p\u003e\n\u003cp\u003e“Jesus,” Gabe whispered in shock when he first caught sight of the man. He plastered a smile onto his lips when Chase saw him and heartily embraced the man who was a mere ten minutes older than Gabe. When they had been younger even their own mother had had difficulty telling them apart. Their mother would burst into tears if she were to see Chase right now. Gabe, himself, felt like weeping.\u003c/p\u003e\n\u003cp\u003eHe held onto his brother longer than he usually would and Chase seemed content to let him. They eventually moved apart and Gabe cleared his throat awkwardly, kind of embarrassed to note the sheen of tears in his brother’s eyes but then even more self-conscious when he realized that he was doing a lot of blinking to clear his misty vision as well.\u003c/p\u003e\n\u003cp\u003e“Missed you, bro,” he muttered. He grabbed Chase’s tog bag, knowing that Chase would prefer to carry his precious camera equipment.\u003c/p\u003e\n\u003cp\u003e“Yeah, it’s been too long between assignments,” Chase agreed. He hadn’t set foot in the country in more than six months. He had inherited their father’s wanderlust and sense of adventure but had channelled it more productively. They chatted about the flight and airline food on the long walk back to the car—keeping things simple and impersonal.\u003c/p\u003e\n\u003cp\u003eChase whistled appreciatively when he saw the Lamborghini.\u003c/p\u003e\n\u003cp\u003e“This is a gorgeous piece of machinery.” He grinned boyishly, giving Gabe a glimpse of his old self. He did a slow circle around the car before coming to a halt at the driver’s side.\u003c/p\u003e\n\u003cp\u003e“Keys?” he asked hopefully.\u003c/p\u003e\n\u003cp\u003e“Yeah right,” Gabe scoffed. “If you think I’m letting your travel-weary butt drive this baby, you can think again.”\u003c/p\u003e\n\u003cp\u003e“You suck,” his brother groused.\u003c/p\u003e\n\u003cp\u003e“You sound like Bobbi,” Gabe chuckled, his heart doing a bizarre loop-the-loop in his chest at the mere mention of her name. What the hell? He busied himself with loading his brother’s gear into the car, hastily stifling that weird reaction. Luckily Chase traveled light—an occupational hazard—or they would have run into trouble. The car wasn’t exactly designed to carry a lot of luggage.\u003c/p\u003e\n\u003cp\u003e“You haven’t let her drive it yet?” Chase asked, after they had left the airport.\u003c/p\u003e\n\u003cp\u003e“Yet?” Gabe snorted. “Try ever. She’s too reckless, she could get herself killed.” He went ice cold at the very thought.\u003c/p\u003e\n\u003cp\u003e“Come on, she’s not that bad,” Chase dismissed. “She’s actually damned good at racing—competent and in control—you’re too much of a nervous ninny to see that.”\u003c/p\u003e\n\u003cp\u003e“Do not encourage her,” Gabe warned, and Chase shrugged.\u003c/p\u003e\n\u003cp\u003e“Whatever, man.”\u003c/p\u003e\n\u003cp\u003e“So will you be staying at your flat?” he asked Chase, referring to the luxury apartment in Camps Bay. When Chase didn’t immediately respond, Gabe glanced over at him in concern and saw that his brother was absently staring out at the passing scenery. He looked lost and haunted.\u003c/p\u003e\n\u003cp\u003e“Chase?”\u003c/p\u003e\n\u003cp\u003e“I’d prefer to stay at home this time round, bro. If that’s okay with you?”\u003c/p\u003e\n\u003cp\u003e“Of course it’s okay with me,” Gabe reassured. “It’s your house too.”\u003c/p\u003e\n\u003cp\u003e“I mean I don’t wanna cramp your style or anything. I know you always have some brainy blonde on call.” Gabe froze as he thought of Bobbi. How the hell were they going to work this with Chase staying under the same roof? The house was huge but . . .\u003c/p\u003e\n\u003cp\u003e“That’s a weighty silence.” Chase’s voice intruded in his thoughts and Gabe glanced over at him. “I take it things are more serious with this latest one then? What is she? An astronaut? A professor? No, you’ve already dated a professor . . . an astrophysicist? Neurosurgeon?”\u003c/p\u003e\n\u003cp\u003e“I’m not seeing anyone right now.” Gabe ended the speculation and the look of blatant disbelief on Chase’s face was almost comical. Gabe grinned reluctantly.\u003c/p\u003e\n\u003cp\u003e“I’m not exactly Don Juan, you know. I do occasionally find myself between relationships.”\u003c/p\u003e\n\u003cp\u003e“You lie,” Chase mocked. “No, say it ain’t so! My baby brother always has a bevy of beautiful blondes at his beck and call. Don’t tell me my hero has feet of clay. Don’t tell me!”\u003c/p\u003e\n\u003cp\u003e“Shut up,” Gabe laughed, enjoying his brother’s banter. He had been watching Chase grow more relaxed with every passing kilometer as if whatever emotional burden he was carrying grew lighter and lighter the closer they got to home. \u003c/p\u003e","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-40.html","bookId":1836,"creation":"Oct 5, 2019 10:34:34 AM","modification":"Oct 5, 2019 10:34:34 AM"}
