{"id":75217,"no":51,"title":"Page 51","content":"\u003cp\u003eJust call her. He repeated Chase’s words to himself. What was the worst she could do? Hang up on him? He winced at the thought. God, he hoped she didn’t hang up on him. He had no Plan B.\u003c/p\u003e\n\u003cp\u003eHe pushed the “Call” button and listened to the phone ring for a few endless moments. It rang for so long he was almost certain it would switch to voice mail, but when her breathless voice answered, he found himself both relieved and panicked.\u003c/p\u003e\n\u003cp\u003e“Hello?” His mouth had gone dry and he couldn’t quite bring himself to respond to her greeting. He considered hanging up but . . . “Gabe?”\u003c/p\u003e\n\u003cp\u003eYeah, Caller ID screwed him over. Of course she knew who it was.\u003c/p\u003e\n\u003cp\u003e“Hi, Bobbi,” he croaked, ridiculously nervous. “How are you?”\u003c/p\u003e\n\u003cp\u003e“Fine,” she said after a long silence. “And you?”\u003c/p\u003e\n\u003cp\u003e“I’m . . .” The fine hovered on his tongue and he opened his mouth to say it. “I’m a jerk. An idiot. A complete dick. And so, so sorry, Bobbi mine. I shouldn’t have been so abrupt with you last night. But . . . I was. And that’s no excuse. I have no excuse. I just hope you’ll forgive me?”\u003c/p\u003e\n\u003cp\u003eNo response.\u003c/p\u003e\n\u003cp\u003e“Bobbi? Are you there?” he asked nervously.\u003c/p\u003e\n\u003cp\u003e“Yes,” she whispered.\u003c/p\u003e\n\u003cp\u003e“I’ve missed you,” he told her softly, wishing he could see her. It frustrated him, not being able to see her face and read her mood.\u003c/p\u003e\n\u003cp\u003e“I missed you too, Gabe.” There was another long silence.\u003c/p\u003e\n\u003cp\u003e“Are you still angry with me?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t angry with you,” she corrected.\u003c/p\u003e\n\u003cp\u003e“Will you come around tonight?” he asked.\u003c/p\u003e\n\u003cp\u003e“I-I don’t think so, Gabe,” she said after another endless pause and Gabe’s entire world started crumbling around him at the rejection. “I’ll be there for the football tomorrow night.”\u003c/p\u003e\n\u003cp\u003e“Right,” he responded numbly. He’d forgotten about the Friday night game. The guys and their significant others would be descending on his house the following evening. “Football. Of course.”\u003c/p\u003e\n\u003cp\u003e“I’ll see you then, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay,” he repeated. He held the phone to his ear for a long time after she’d disconnected the call before dropping his arm. He sat on the lounger, hands clasped between his knees, elbows resting on thighs, and head down as he tried to figure out what to do next.\u003c/p\u003e\n\u003cp\u003e“Gabe.” Chase’s voice startled him and he looked up to see his brother standing in front of him. Chase sat down on the lounger opposite his. “You okay?”\u003c/p\u003e\n\u003cp\u003e“Not really,” he responded honestly, and Chase sighed. “You’ll be happy to know she’s not coming around tonight.”\u003c/p\u003e\n\u003cp\u003e“Seeing you like this doesn’t make me happy, Gabe.” Chase’s voice was almost gentle.\u003c/p\u003e\n\u003cp\u003e“You were right, you know? I don’t know what the hell I’m doing, Chase.” Gabe hated how his voice cracked. “I should never have touched her . . . but she’s just so damned alluring, so completely irresistible with that quirky smile, those lively eyes, and that wicked sense of humor.”\u003c/p\u003e\n\u003cp\u003e“You do realize that you don’t sound like a man who’s just physically attracted to a woman, right?” Chase pointed out, and Gabe frowned.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Smile? Eyes? Sense of humor?” Chase repeated. “I was expecting tits, arse, and killer legs.”\u003c/p\u003e\n\u003cp\u003e“Watch it,” Gabe warned. “And she does have all of those as well, of course.”\u003c/p\u003e\n\u003cp\u003e“Gabe, you need to figure out what you want from her and fast, before you muck things up even more than you already have.”\u003c/p\u003e\n\u003cp\u003eGabe snorted. Like he didn’t know that already.\u003c/p\u003e\n\u003cp\u003eTwenty-four hours later, Bobbi nervously made her way across the lawn toward the gate. She hadn’t heard from Gabe since his phone call the night before and she wasn’t quite sure what to expect from him tonight. She had felt awful after that awkward telephone conversation. It had been so tempting to just say yes and rush to his side again—but he couldn’t keep blowing hot and cold like that. It was too emotionally draining.\u003c/p\u003e\n\u003cp\u003eShe crossed the threshold of the gate onto Braddock property and followed the echoing sound of masculine laughter coming from the back of the house. Gabe had a standard-sized football field, complete with lines and goalposts in his huge backyard. He’d even had small bleachers built on either side of the pitch. Their friends and family only ever used the stands closest to the house and there were never enough people to actually fill them but Gabe liked symmetry—so of course he had to have two sets of bleachers.\u003c/p\u003e\n\u003cp\u003eThe group of men were standing around, chatting and stretching, a couple of them had pregame beers clutched in their hands. Their original group had grown to include Rick and Bryce Palmer, Pierre De Coursey, and Rick’s business partner, Vuyo Mashego. Bryce was more of a rugby player and didn’t take the Friday night games as seriously as some of the other men. He was one of the guys with a beer in hand, and so was his brother and Max Kinsley, a joker who didn’t seem to take anything seriously.\u003c/p\u003e\n\u003cp\u003eThey usually played five a side: goalkeeper, two defenders, a midfielder, and a striker. Chase saw her first and ran over to meet her halfway.\u003c/p\u003e\n\u003cp\u003e“Hey.” He grinned when he saw her all kitted out in her usual football gear.\u003c/p\u003e\n\u003cp\u003e“Hi. Are you playing tonight?” she asked. With Chase there they had eleven players.\u003c/p\u003e\n\u003cp\u003e“I’m thinking of substituting.” He shrugged, not seeming particularly concerned about it. “Or refereeing, maybe.”\u003c/p\u003e\n\u003cp\u003e“Is everybody here?” Bobbi casually glanced around the field. \u003c/p\u003e","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-51.html","bookId":1836,"creation":"Oct 5, 2019 10:34:34 AM","modification":"Oct 5, 2019 10:34:34 AM"}
