{"id":75223,"no":57,"title":"Page 57","content":"\u003cp\u003eShe replaced the receiver back in its cradle with the utmost care and blindly turned away from her desk. She wouldn’t allow him to creep into her life only to make her feel inadequate again. She was determined to be stronger than that.\u003c/p\u003e\n\u003cp\u003eA date? The knowledge filled Gabe with panic. Was he too late? Had somebody else snatched her up while Gabe had sat around feeling sorry for himself? The thought was unbearable.\u003c/p\u003e\n\u003cp\u003eHe studied the surface of his meticulously arranged desk. Just the way he liked it—everything neatly stowed away. Not a paperclip out of place. Bobbi had been the only bit of chaos in his life, but he now found that without her, his well-ordered life was . . . bland. He missed his lover and he missed his friend. He had foolishly tried to keep those two facets of her in separate boxes and it had naturally backfired on him. He was damned well going to do this thing right from now onward. Amateur hour was coming to an end.\u003c/p\u003e\n\u003cp\u003eBobbi started monitoring her calls after that. After that football night, she hadn’t expected him to hear from again for a long time and that phone call to the shop had rattled her immensely. She had Craig on phone duties, knowing that he would be vigilant about not letting any calls from Gabe slip through the cracks. She ignored any calls to her cell phone from him and simply came home too late for him to call the house.\u003c/p\u003e\n\u003cp\u003eHis messages started to pile up over the next few days. Voice mails clogged up her cell-phone inbox and handwritten notes from her father were left outside her bedroom door.\u003c/p\u003e\n\u003cp\u003e“Please call me.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry I missed you. Please call.”\u003c/p\u003e\n\u003cp\u003e“I missed you again. Please call.”\u003c/p\u003e\n\u003cp\u003e“Call me.”\u003c/p\u003e\n\u003cp\u003eAnd on and on it went. The voice mails he left on her cell phone were more detailed:\u003c/p\u003e\n\u003cp\u003e“I know I hurt you. I just want a chance to make it right. I miss you. Please call me.”\u003c/p\u003e\n\u003cp\u003e“Bobbi, I miss you. Call me.”\u003c/p\u003e\n\u003cp\u003e“I wish you’d answer my calls.”\u003c/p\u003e\n\u003cp\u003e“I can’t do this (he never elaborated on what “this” meant) in a message. I need to speak with you. Let me know when it’ll be convenient for me to call you or see you.”\u003c/p\u003e\n\u003cp\u003eIt was driving her crazy. At her previous girls’ night a few days before, each woman said she’d had at least one message from Gabe. They never urged her to call him though. They merely relayed the messages and then carried on as if nothing out of the ordinary had happened. Nobody had forced her to talk about it. They respected her silence on the matter. And she was eternally grateful for that.\u003c/p\u003e\n\u003cp\u003e“Good. You’re home.” Her father met Bobbi at the door when she let herself in that evening. He looked flustered and annoyed.\u003c/p\u003e\n\u003cp\u003e“Dad? What’s wrong?” She stepped past her agitated father and tried to drop her messenger bag carelessly onto a side table in the foyer, as she usually did. A huge bouquet of white roses resting on the tiny table thwarted the automatic gesture. She frowned and glanced around, looking for a different table, but they were all covered in gorgeous bouquets of white roses.\u003c/p\u003e\n\u003cp\u003e“Oh,” she said blankly.\u003c/p\u003e\n\u003cp\u003e“Yes, oh,” her father groused. “They’re everywhere.”\u003c/p\u003e\n\u003cp\u003e“Where did they come from?” she asked, wondering if there had been some kind of planning mishap with the Valentine’s Day thing. She knew that their theme was red and white—so original—maybe they had miscalculated the number of white roses they needed?\u003c/p\u003e\n\u003cp\u003e“They’re for you,” he said pointedly, and her eyes widened.\u003c/p\u003e\n\u003cp\u003e“But . . .”\u003c/p\u003e\n\u003cp\u003e“Look, I know you and Gabe have had some kind of tiff and if this is any indication, he feels terrible about it.” Her father knew nothing about what had happened between Gabe and Bobbi. Thankfully Billy had kept his mouth shut about the incident at the football match, even though her brother had futilely tried—on numerous occasions—to open up a dialogue with Bobbi about it.\u003c/p\u003e\n\u003cp\u003e“They’re from Gabe?” She knew her voice sounded flat and if her father’s frown was any indication, he didn’t understand why she wasn’t more enthusiastic about the floral “apology.”\u003c/p\u003e\n\u003cp\u003e“They are . . .” He nodded. “Gabe called after the first delivery and asked me to grab the card out of one of the bouquets and to be sure that you received and read it.”\u003c/p\u003e\n\u003cp\u003eThat sneaky rat! He knew that if it had been up to her the card would have been tossed into the bin unread, but by involving her father, Gabe had made it impossible for her not to read it. She took the pretty cream card from her father and glanced down at it. Gabe’s bold handwriting slashed across the surface of the small square of paper, and it took her a second to decipher the elegant cursive script.\u003c/p\u003e\n\u003cp\u003eDid you know that white roses signify new beginnings? I was hoping you’d appreciate that sentiment. Please turn over for more . . .\u003c/p\u003e\n\u003cp\u003eShe refused to smile at the polite instruction on the bottom of the tiny card. Anybody else would have been satisfied with an abbreviated PTO, but Gabe, of course, had to write a properly structured and well-mannered sentence. She turned over.\u003c/p\u003e\n\u003cp\u003eThese roses are white\u003c/p\u003e\n\u003cp\u003eMost violets are blue (well they’re actually violet but for the purposes of this poem we’ll say blue)\u003c/p\u003e\n\u003cp\u003eBobbi, my sweet\u003c/p\u003e\n\u003cp\u003eI really miss you\u003c/p\u003e\n\u003cp\u003e(I’m sorry. I’m really bad at poetry—G)\u003c/p\u003e\n\u003cp\u003eShe covered her mouth with a hand as she tried to stifle the half laugh, half sob that threatened to bubble up from her throat. This was . . . what was this? She didn’t even know what he meant to achieve with this.\u003c/p\u003e\n\u003cp\u003e“I’m going up for a shower, I’ll see you at dinner,” she said, folding her hand around the card and feeling the expensive bond paper cut into her palm. Her father’s face fell when she made no mention of the card’s contents. After she reached her room, she put the card onto her dresser and meticulously smoothed the creases out of the stiff paper. She read the words one last time before tearing the card up into four squares and tossing them into her dresser drawer. \u003c/p\u003e","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-57.html","bookId":1836,"creation":"Oct 5, 2019 10:34:34 AM","modification":"Oct 5, 2019 10:34:34 AM"}
