{"id":75236,"no":70,"title":"Page 70","content":"\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“We get a Christmas card and a birthday card—one between the two of us—from him every year.” Bobbi couldn’t help the surprised sound that emerged from her throat.\u003c/p\u003e\n\u003cp\u003e“You never mentioned that before,” she said, and he shrugged.\u003c/p\u003e\n\u003cp\u003e“It’s not important. He’s a narcissist. He never makes any kind of polite inquiry as to how we are, but always assumes that we must be dying to know what his latest adventure is. The reality is that both Chase and I lost interest years ago, but it would never occur to Leighton Braddock that maybe his sons don’t want to know about his awesome trips to far-flung places. I’m sure he imagines we think he’s the coolest dad in the world.” A reluctant laugh huffed from him. “He’s such an arse. I don’t even think he realizes that Mum has divorced him and remarried. I’m pretty sure if he ever swans back here someday he expects to reconcile with his lovely wife and have amazing relationships with his adoring sons.”\u003c/p\u003e\n\u003cp\u003e“Ooh,” Bobbi said, wincing, keeping her tone light. “It would almost be worth it just to see him get a huge dose of reality smacked in his face.”\u003c/p\u003e\n\u003cp\u003eThey lapsed back into silence for the remainder of the drive as Bobbi reflected upon what she had just learned. She knew Gabe better than most people but had never known how badly his father’s abandonment had affected him. Learning that she didn’t know everything there was to know about him was kind of exciting. It was like listening to a much-loved CD for the hundredth time only to unexpectedly discover a beautiful, hidden track at the end.\u003c/p\u003e\n\u003cp\u003eShe glanced out of the window when the car took a turn and saw that they were on their street. Her heart sank when Gabe bypassed his gate and drove to hers. Security let them in and he didn’t say anything as he maneuvered the Jeep up the long drive toward the house and drew it to a stop in front of the steps leading up to the front door.\u003c/p\u003e\n\u003cp\u003e“Should I come over later?” she asked in an unsteady voice, and his hands tightened perceptibly on the steering wheel, while he kept his face forward.\u003c/p\u003e\n\u003cp\u003e“I would love that,” he muttered before turning to face her. “But . . . I don’t want us to rush this.”\u003c/p\u003e\n\u003cp\u003e“Gabe . . . that cat’s been out of the bag for a while now,” she teased, and his teeth gleamed in the dark as he grinned.\u003c/p\u003e\n\u003cp\u003e“And what a pretty cat it is. One that I would love to pet and stroke and play with.”\u003c/p\u003e\n\u003cp\u003eShe choked and blushed furiously. “Uh . . .” She was at a complete loss for words.\u003c/p\u003e\n\u003cp\u003e“But we’re doing it right this time, Bobbi. So you stuff that gorgeous little pussy . . . cat right back in the bag.”\u003c/p\u003e\n\u003cp\u003e“Enough with the cat analogies,” she groaned.\u003c/p\u003e\n\u003cp\u003e“You started it,” he pointed out. “I merely ran with it.”\u003c/p\u003e\n\u003cp\u003eShe shook her head and slammed a palm to her face.\u003c/p\u003e\n\u003cp\u003e“You going to give me a good-night kiss?” he asked huskily, and she dipped her head coyly.\u003c/p\u003e\n\u003cp\u003e“Only if you walk me to the door,” she retorted.\u003c/p\u003e\n\u003cp\u003e“It’ll be my pleasure.” He leapt out of the Jeep and hurried around to help her down like she was one of his elegant blondes and Bobbi thrilled at the gentlemanly treatment. He took her hand and placed it in the crook of his elbow before walking her up the short flight of stairs and onto the well-lit porch.\u003c/p\u003e\n\u003cp\u003eHe stopped right in front of the door and turned to face her, maintaining a frustratingly polite distance between their bodies.\u003c/p\u003e\n\u003cp\u003e“I had a great evening,” he said.\u003c/p\u003e\n\u003cp\u003e“Me too.”\u003c/p\u003e\n\u003cp\u003e“Does that mean you’ll be willing to go out with me again?” he asked, and she rolled her eyes.\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“Good.” His eyes dropped to her mouth and his tongue wet his lips. Her eyes followed the movement hungrily. He stepped closer to her and inhaled deeply, then exhaled on a shuddery breath before cupping her neck with his palms. He used his thumbs to tilt her jaw and she barely had time to reflect upon how much the masterful gesture turned her on before his lips dropped onto hers for a drugging, sucking, gentle kiss that obliterated her thought processes until all she could do was enjoy the sensuality of his expert mouth.\u003c/p\u003e\n\u003cp\u003eThe kiss demanded nothing and left her wanting so much more. When he lifted his mouth, hers followed his blindly until he stood upright and removed the temptation from her reach.\u003c/p\u003e\n\u003cp\u003e“I’ll pick up my car at lunchtime,” he said, and she was in too much of a daze to do anything other than nod. “And we can have lunch together?”\u003c/p\u003e\n\u003cp\u003e“Lunch. Yes.” She nodded again.\u003c/p\u003e\n\u003cp\u003e“Good night, Bobbi mine,” he said, and the endearment had her smiling radiantly and truly feeling like his after the wonderful evening they had just enjoyed together.\u003c/p\u003e\n\u003cp\u003e“Yes, good night,” she repeated. He stood there unmoving and she gazed up at him dreamily.\u003c/p\u003e\n\u003cp\u003e“Aren’t you going in?” he asked, and she snapped out of her haze and flushed.\u003c/p\u003e\n\u003cp\u003e“Uh, yes. Of course!” She fumbled with the lock and opened the door . . . eventually.\u003c/p\u003e\n\u003cp\u003e“See you tomorrow.” She stepped inside and he nodded. “Good night.” She closed the door before he could respond, quickly reset the alarm, and then stood on tiptoe to peer out of the peephole, wanting to see what he did next. He was smiling as he turned away and when he went down the stairs, he did so with a bounce in his step that she recognized as happiness.\u003c/p\u003e\n\u003cp\u003eShe hugged that knowledge to her chest as she floated up to her room. He was happy. She had done that. Even if this relationship of theirs was doomed, she would not have exchanged tonight for anything else in the world.\u003c/p\u003e\n\u003cp\u003e“Good morning.” Gabe was slightly embarrassed by the singsong quality in his voice when he joined his brother for breakfast the following morning. Chase, who had been staring broodingly into his coffee, looked up and smiled when he saw Gabe’s grin. \u003c/p\u003e","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-70.html","bookId":1836,"creation":"Oct 5, 2019 10:34:34 AM","modification":"Oct 5, 2019 10:34:34 AM"}
