{"id":75237,"no":71,"title":"Page 71","content":"\u003cp\u003e“You’re in a good mood,” he observed.\u003c/p\u003e\n\u003cp\u003e“Why wouldn’t I be?” Gabe said after sitting down opposite him. “It’s a gorgeous summer morning. The sky’s blue, the birds are out, everything smells fresh and awesome.”\u003c/p\u003e\n\u003cp\u003e“You didn’t join me for our jog this morning,” Chase said.\u003c/p\u003e\n\u003cp\u003e“Slept in,” Gabe informed before crunching into a slice of whole-wheat toast.\u003c/p\u003e\n\u003cp\u003e“Good evening last night?” Chase asked.\u003c/p\u003e\n\u003cp\u003e“The best.”\u003c/p\u003e\n\u003cp\u003e“When will you see her again?”\u003c/p\u003e\n\u003cp\u003e“Lunch.” He couldn’t wait. He had enjoyed her company so much the night before that he had disclosed more about himself than he ever had to anybody else. It had been revelatory—he felt like he could tell her anything because she already knew him so well and wouldn’t judge him.\u003c/p\u003e\n\u003cp\u003eTheir conversation had been interesting, easygoing, and had flowed as readily as the wine, and it hadn’t been filled with only the fluff and banter that had characterized their previous discussions. It had felt more significant, like he was really getting to know her for the first time, and the more he learned the more he liked and respected her.\u003c/p\u003e\n\u003cp\u003e“Jeez, look at you,” Chase groused good-naturedly. “You’re beaming so damned brightly, you’re practically blinding me.”\u003c/p\u003e\n\u003cp\u003eGabe’s grin merely widened and he winked at his brother before diving into his breakfast.\u003c/p\u003e\n\u003cp\u003e“Hey, boss, your boyfriend’s here for his car.” Sean’s embarrassingly loud voice rang out across the shop floor where Bobbi was consulting with one of her few new female clients about fixing the brake line on the woman’s Mini Cooper.\u003c/p\u003e\n\u003cp\u003eBobbi winced and smiled apologetically at the woman, who returned the smile politely. Her client was one of those young twenty-somethings who had the sleek and pampered appearance of a woman who had money and enjoyed spending it on herself. The kind of woman Bobbi should probably have been when one took her background into consideration.\u003c/p\u003e\n\u003cp\u003eShe ignored Sean, knowing that Gabe wouldn’t interrupt her while she was in consultation with a client, but a quick peek over the woman’s shoulder told her that he had a clear view of them both. He waved at her and she waved back self-consciously. The woman glanced over her shoulder to see who Bobbi was looking at, and her entire body went on alert—shoulders up, chest out, chin up, and a sexy hair flick. She stopped listening to Bobbi and spent her energy projecting “I’m available” vibes toward the other end of the large workroom. Didn’t she hear Sean call Gabe Bobbi’s boyfriend for God’s sake? Or did she think Sean had meant someone else?\u003c/p\u003e\n\u003cp\u003eBobbi grimaced as she gathered that that was probably exactly what the woman thought. She wouldn’t for a second think Gabe was the “boyfriend” in question.\u003c/p\u003e\n\u003cp\u003eBobbi kept talking and explaining what would be done to her car, but the woman was a lost cause, and in the end, Bobbi just told her how much the service would cost and offered her a replacement car while they fixed her Mini.\u003c/p\u003e\n\u003cp\u003e“All good.” The woman dismissed her as her eyes hungrily followed Gabe, who was inspecting his Lamborghini and chatting amiably with Sean.\u003c/p\u003e\n\u003cp\u003e“I’ll get the keys,” Bobbi mumbled.\u003c/p\u003e\n\u003cp\u003e“Thank you. I’ll just . . . have a look around while you do that.” Bobbi watched as the woman made a beeline for Gabe.\u003c/p\u003e\n\u003cp\u003e“This is some car,” she said when she joined the two men. Sean looked immediately lovestruck, but she ignored him and focused her laser-like attention on Gabe. Bobbi had to admit that he looked even more gorgeous today. In that charcoal pinstriped suit, with a pale blue shirt and dark-blue-and-gray-striped tie, he oozed that conservative elegance Bobbi found so irresistible.\u003c/p\u003e\n\u003cp\u003e“I noticed it from across the room,” the woman was saying, and Bobbi rolled her eyes. Yeah, right. She hadn’t noticed the car until Gabe had been standing right beside it. Some more hair flicking followed combined with a ridiculous amount of eyelash fluttering. Bobbi snorted and tried not to feel insecure. Smelling of engines and looking grubby, when Bobbi stood beside a woman like that, it would be hard not to find her lacking.\u003c/p\u003e\n\u003cp\u003eBobbi made quick work of getting the keys to the woman’s replacement car and joined them a moment later. The woman was asking Gabe all these breathless and interested questions about his car, ignoring poor Sean, who looked crestfallen.\u003c/p\u003e\n\u003cp\u003e“Here you are, Ms. Simms,” Bobbi announced, holding up the keys. “She’s just a Fiat but she’s quite reliable.”\u003c/p\u003e\n\u003cp\u003eThe woman looked irritated by the interruption, and when she took the keys, she wrinkled her nose when her fingers brushed against Bobbi’s hand.\u003c/p\u003e\n\u003cp\u003e“I don’t know about you but I always find the whole garage experience to be such a chore,” she told Gabe in a confiding voice. “Everything and everybody’s just so . . . dirty. No offense of course.” The last was directed to Bobbi and absolutely devastated Sean. Gabe’s eyes narrowed as he took in Sean’s face before they shifted to Bobbi, who maintained a carefully and politely blank expression on her face.\u003c/p\u003e\n\u003cp\u003e“Well,” he said, reaching out and grabbing Bobbi’s hand before yanking her over until she was plastered against his side. She had had a bit of an oil spill that morning and her overalls were somewhat the worse for wear, but he didn’t hesitate and kept her firmly tucked beneath his arm. “Sometimes a bit of dirt isn’t so bad, is it sweetheart?” he asked Bobbi before dropping a long and very hot kiss on her surprised mouth.\u003c/p\u003e\n\u003cp\u003e“Hey there,” he whispered when he lifted his lips and she blinked, completely flustered. \u003c/p\u003e","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-71.html","bookId":1836,"creation":"Oct 5, 2019 10:34:34 AM","modification":"Oct 5, 2019 10:34:34 AM"}
