{"id":75248,"no":82,"title":"Page 82","content":"\u003cp\u003e“Roberta Rebecca Richmond, I am so utterly in love with you, I worship you, and I cherish you. You’ve always been the finest thing in my life, and I would consider myself the luckiest man in the world if you would consent to be my wife.”\u003c/p\u003e\n\u003cp\u003e“Oh Gabe . . .” She was complete a mess. For someone who never cried, Bobbi had been doing a lot of if over the last few weeks, and she no longer cared who saw her.\u003c/p\u003e\n\u003cp\u003e“Will you marry me?” he asked, and she grabbed his hand and tried to tug him up onto the bed with her. He got up and sat down next to her.\u003c/p\u003e\n\u003cp\u003e“Of course I’ll marry you, and I’ll try to be a good wife, even if I don’t conform to some people’s idea of the perfect corporate wife,” she said, and a growl worked its way up from his chest.\u003c/p\u003e\n\u003cp\u003e“Who the hell told you that?” he asked with a glower, and she grinned wetly.\u003c/p\u003e\n\u003cp\u003e“Gabe, I’m a mechanic, remember? More at home in overalls than ball gowns.”\u003c/p\u003e\n\u003cp\u003e“You know what?” he asked thoughtfully. “I once thought I wanted some perfectly bland blonde on my arm for all eternity. But I would have been bored out of my mind in no time flat. I’m so damned happy you kissed me that night at Sandro’s party—my life has been a crazy roller coaster ride since then, but with you the chaos always makes sense. I don’t want you to be a ‘good’ wife . . . I want you to be my Bobbi, exciting, fun, and adorable. Just be the woman I fell in love with. That’s who I want to marry.”\u003c/p\u003e\n\u003cp\u003eHe kissed the circlet of gold and diamonds he still held in his hand before lifting her left hand and lovingly sliding the ring onto her finger. Still choked up from his last words, Bobbi couldn’t speak, but the kiss she gave him said so much more than words ever could.\u003c/p\u003e\n\u003cp\u003eBobbi experimentally tested her weight on her leg and barely felt a twinge. It had been nearly a week since her accident and she was recovering quite nicely. She and Gabe had argued about when she could go back to work, and in the end she had taken a full week off. Her guys had been managing admirably in her absence.\u003c/p\u003e\n\u003cp\u003eBobbi had been bound and determined to be on her feet for this stupid Valentine’s Day event. She would be unveiling her new look to Gabe tonight, and while she was no longer anxious about whether he would like it or not—he liked her in everything—she was excited about dressing up for him. Which was something she had never expected to feel in a million years.\u003c/p\u003e\n\u003cp\u003eShe checked her appearance in the mirror for the hundredth time and waited for the doorbell to ring. When it finally did, she had to prevent herself from running down the stairs to let him in.\u003c/p\u003e\n\u003cp\u003eBilly, in a repeat of the first time Gabe had come calling on her, came up to get her and he stopped dead in the doorway when he first caught sight of her. She could see the surprise and pride in his eyes, but he merely lifted an eyebrow at her.\u003c/p\u003e\n\u003cp\u003e“Skirt’s a bit short, isn’t it?” He was teasing, but Bobbi immediately gasped and checked herself in the mirror again.\u003c/p\u003e\n\u003cp\u003e“Oh my God, is it?”\u003c/p\u003e\n\u003cp\u003eHe chuckled and came over to give her a one-armed hug. “You look gorgeous. If Gabe wasn’t already completely smitten with you, he’d be a goner tonight.”\u003c/p\u003e\n\u003cp\u003e“Oh . . . well, that’s okay then,” she said with a blush.\u003c/p\u003e\n\u003cp\u003e“Come on, let’s not keep your fiancé waiting.”\u003c/p\u003e\n\u003cp\u003eHer fiancé! She couldn’t get used to the sound of that.\u003c/p\u003e\n\u003cp\u003eGabe was pouring Mike another drink to settle the older man’s nerves when he heard Bobbi’s voice just beyond the door. He couldn’t keep the smile off his face at the thought of seeing her. The changeover at work had kept both Gabe and Mike busy over the past week, and he had barely seen her over the last couple of days. He had called often but calls didn’t cut it.\u003c/p\u003e\n\u003cp\u003eHe turned expectantly to face the door. He couldn’t wait for this stupid ball to end so that he could take her home with him and drag that ugly navy dress off until he had her splendidly naked and pinned beneath him. Because of her injury and her resulting weakness due to the amount of blood she had lost, they’d had to forego sex completely, but Bobbi had called him that afternoon to tell him she’d gotten the “all-clear” from her doctor, and Gabe had been a walking hard-on practically from that moment on.\u003c/p\u003e\n\u003cp\u003eThe door swung open and Billy stood aside to let Bobbi precede him into the room and . . .\u003c/p\u003e\n\u003cp\u003eWow.\u003c/p\u003e\n\u003cp\u003eThat was the only word that came to mind when he saw her. There were glorious amounts of golden skin on display everywhere he looked—her shoulders, her arms, and her legs. She was wearing one of those bustier-type dresses; it was pale pink, of all colors. The pretty pink was covered in a dark, gothic print that suited her to a tee. The bell-shaped mini skirt had the silhouette of a chapel printed on it, while the sweetheart bodice had bare black branches crisscrossing dramatically across the front. The short skirt ended at mid-thigh, just below the medical dressing that he knew was still there and revealed a shapely length of leg that made him want to just cover her up before other men saw her.\u003c/p\u003e\n\u003cp\u003eShe wore short biker boots, and Gabe could just see the frilly top of her ankle socks above the boot. The only jewelry she wore were the pair of gold hoop earrings that he had given her for Valentine’s Day and her engagement ring. Her eyes were dark and smoky and her lips just tinted with a sexy red shade that made him ache to kiss it off.\u003c/p\u003e\n\u003cp\u003eShe was an enchanting combination of hard and soft and was absolutely perfect.\u003c/p\u003e\n\u003cp\u003e“Well?” she asked impatiently. “What do you think?”\u003c/p\u003e\n\u003cp\u003e“You look quite . . . lovely.” Her father sounded a bit taken aback. “Quite the transformation.”\u003c/p\u003e\n\u003cp\u003e“She always looks lovely, Mike,” Gabe corrected. “And I don’t see a transformation, I see my Bobbi, and she looks—if you’ll excuse the phrase—absolutely smoking hot.” \u003c/p\u003e","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-82.html","bookId":1836,"creation":"Oct 5, 2019 10:34:34 AM","modification":"Oct 5, 2019 10:34:34 AM"}
