{"id":41753,"no":3,"title":"Chapter 3","content":"\u0026nbsp;Dad strode to his easy chair by the fireplace. He sank into its foam-rubber softness, sighing. He murmured a syllable into a tiny ball-mike on the side of the chair. A metallic hand raised a lighted cigarette to his lips. \n\u003cdiv\u003e\n \"Come here, son.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ronnie followed and sat on the hassock by Dad\u0027s feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe I\u0027ve never really explained things to you, Ronnie. You see, you won\u0027t always be a boy. Someday you\u0027ll have to find a way of making a living. You\u0027ve only two choices: You work for the government, like I do, or for a corporation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ronnie blinked. \"Mr. Davis doesn\u0027t work for the gover\u0027ment or for a corpor-ation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Davis isn\u0027t normal,\" Dad snapped. \"He\u0027s a hermit. No decent family would let him in their house. He grows his own food and sometimes he takes care of gardens for people. I want you to have more than that. I want you to have a nice home and be respected by people.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Dad puffed furiously on his cigarette.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you can\u0027t get ahead if people know you\u0027ve been a Reader. That\u0027s something you can\u0027t live down. No matter how hard you try, people always stumble upon the truth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Dad cleared his throat. \"You see, when you get a job, all the information you handle will have a classification. It\u0027ll be Restricted, Low-Confidential, Confidential, High-Confidential, Secret, Top-Secret. And all this information will be in writing. No matter what you do, you\u0027ll have access to some of this information at one time or another.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3100/85424.html","bookId":944,"creation":"Aug 11, 2019 5:30:17 AM","modification":"Aug 11, 2019 5:30:17 AM"}
