{"id":66705,"no":19,"title":"Page 19","content":"\u003cp\u003eOpening the door, she paused long enough to draw a breath of fresh cool air into her starving lungs, then climbed out. She marched purposely onto the deck. She could hear the sound of the boat’s twin engines purring contentedly in the background. That Neanderthal was about to pull out of port without letting her know he’d come back! Why should she be surprised? This was typical of everything else he’d done.\u003c/p\u003e\n\u003cp\u003e“It took you long enough,” she raged—then nearly swallowed her tongue in shock.\u003c/p\u003e\n\u003cp\u003eIt wasn’t Jack who’d come on board, but Carlos.\u003c/p\u003e\n\u003cp\u003eLorraine gasped and remembered too late that she’d left the gun belowdecks.\u003c/p\u003e\n\u003cp\u003eGary Franklin was worried. He hadn’t heard from Lorraine since she’d gone on this crazy trip to Mexico. To his way of thinking, there was something strange about the entire business. She’d been so desperate to find out everything she could about her father she’d refused to listen to him, refused to be reasonable.\u003c/p\u003e\n\u003cp\u003eAt one time Lorraine would have heeded his advice, but everything had changed when her mother died. Now he sometimes felt he didn’t know her at all. He tried to be patient, although it was increasingly difficult. After her mother’s death she’d withdrawn completely into herself, blocking out the world—and that included him. Frankly it had hurt; he’d wanted to comfort her, to hold her in his arms and help her through her grief. But she wouldn’t allow it. He’d finally realized it wasn’t anything personal. Lorraine might not have wanted him, but she hadn’t wanted anyone else, either.\u003c/p\u003e\n\u003cp\u003eVirginia’s death had devastated her, of course; it had been a shock to him, too. He’d heard all the mother-in-law jokes and laughed with the rest, but Virginia wasn’t like that. Wouldn’t have been like that, he corrected himself. She was gone now. The wedding was still set for late autumn, and he figured the sooner they were married, the better.\u003c/p\u003e\n\u003cp\u003eLorraine needed him more than ever, and he loved her. At thirty-six, he’d waited longer than most men he knew before deciding to make the leap into matrimony. He’d been looking for the right woman; at least that was what he’d told his parents. It wasn’t a lie, but it wasn’t the full truth.\u003c/p\u003e\n\u003cp\u003eUnlike his peers, he hadn’t felt any urge to settle down. To put it like that made him sound immature, which wasn’t the case, either. He happened to enjoy his freedom. But he felt it was time he got married, and he and Lorraine were compatible in the ways that mattered. They liked the same things, believed in the same causes. Both were sensible and not easily swayed by popular opinion. He liked an orderly world; so did she.\u003c/p\u003e\n\u003cp\u003eGary leaned back in his office chair and clasped his hands behind his head. Lorraine had given him the phone number where she could be reached, with the understanding that she preferred to contact him and not the other way around.\u003c/p\u003e\n\u003cp\u003eThis was one of the traits that irked Gary about his fiancée. She could be uncompromising. Occasionally she seemed a little too quick to form an opinion and cling to it. While he admired her straightforward manner, there were times he wished she’d been more willing to bend. Still, he had faith in her common sense. Despite his uneasiness, he supposed she’d manage all right, even in some out-of-the-way Mexican village.\u003c/p\u003e\n\u003cp\u003eHis phone pealed, and Gary reached for the receiver. “Hello.”\u003c/p\u003e\n\u003cp\u003e“Gary, it’s Marjorie Ellis.” The woman hesitated as if she expected a reaction.\u003c/p\u003e\n\u003cp\u003eGary didn’t give her one.\u003c/p\u003e\n\u003cp\u003e“I’m on the road right now, but I’ve got a couple of questions for you, if you have the time.”\u003c/p\u003e\n\u003cp\u003eMarjorie was new on the job and needed some guidance. A whole lot of guidance, if the truth be known. Their company, Med-X, sold medical supplies and equipment to hospitals, doctors’ offices, nursing homes and the like. Gary had been in the field for ten years and had recently accepted a management position.\u003c/p\u003e\n\u003cp\u003eMarjorie, who’d been hired as his replacement, lacked almost every skill he considered crucial to the job. She was disorganized. She wasn’t punctual. Her computer skills were inadequate, and he had to explain things three and four times before she grasped them. What redeemed Marjorie Ellis was the fact that Med-X clients loved her. That was surprising, but he couldn’t argue with success. Two months on the job, and she’d outsold every other trainee in the company. Now that was impressive.\u003c/p\u003e\n\u003cp\u003e“What do you need to know?” Gary asked, keeping his tone friendly and helpful.\u003c/p\u003e\n\u003cp\u003e“It’d probably be best if I came into the office and we talked about it. That is, if you have the time,” she said again.\u003c/p\u003e\n\u003cp\u003eTime was something Gary had plenty of, now that Lorraine was away. “Not a problem.” He glanced at his watch. “When?”\u003c/p\u003e\n\u003cp\u003e“Is this afternoon at four convenient?”\u003c/p\u003e\n\u003cp\u003eHe flipped noisily through the pages of his appointment calendar, doing his best to make sure she heard it. He already knew the slot was open. No use letting Marjorie think he wasn’t a busy man, though. “Does four-thirty work for you?”\u003c/p\u003e\n\u003cp\u003eGary heard the rustle of papers in the background and suspected she’d dropped a file. “Sure,” Marjorie said. “I’ll see you then.” Her voice was faint. Gary could picture her with the cell phone tucked under her chin while she bent to retrieve the spilled paperwork. Typical.\u003c/p\u003e\n\u003cp\u003e“I’ll look forward to it.” As he replaced the receiver, Gary realized how true that was. Marjorie was a ditz with plenty of…well, ditzy moments, but she was also likable and had a delightful easy laugh.\u003c/p\u003e\n\u003cp\u003eWithout Lorraine, he was actually lonely. He missed her and somehow doubted she missed him with the same intensity. An hour in Marjorie’s company—even if he had to explain the same computer program half a dozen times—would at least be a distraction.\u003c/p\u003e\n\u003cp\u003eCarlos intended to kill her. Lorraine knew it the minute she saw him. She looked wildly around, hoping someone would see her plight and help—or send for the police. There was no one, and even if there’d been people nearby, she wasn’t sure they would have risked becoming involved.\u003c/p\u003e\n\u003cp\u003eSlowly, as if he enjoyed the anticipation, Carlos advanced toward her. For every step he took, she retreated one until her back was against the bulkhead. His breath made her want to gag, but she refused to show her terror, refused to flinch.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” she demanded with false bravado.\u003c/p\u003e\n\u003cp\u003e“I come to teach you a lesson.” His smile vanished, and using both hands, Carlos ripped apart her blouse, sending the buttons flying.\u003c/p\u003e\n\u003cp\u003eLorraine gasped at the unexpectedness of his action and attempted to knee him but missed. Her knee wasn’t her only means of defense, however, and recovering quickly, she clawed her long nails down his face, leaving bloody streaks.\u003c/p\u003e\n\u003cp\u003eCarlos backhanded her with enough force to split her lip. Blood filled her mouth and she spit at him. He might rape and kill her, but she wouldn’t make it easy.\u003c/p\u003e\n\u003cp\u003eA shout came from the dock and she caught a glimpse of Jack. Jack. Thank God. It hadn’t registered at first, but if Carlos had reached her, he must have either killed or injured Jack.\u003c/p\u003e\n\u003cp\u003eAt the sound of Jack’s voice, Carlos glanced over his shoulder and cursed loudly. He grabbed for a gun tucked in his belt behind his back and would have fired if Lorraine hadn’t acted immediately. Using the full weight of her body, she threw herself against his side.\u003c/p\u003e\n\u003cp\u003eThe gun fired, then flew out of Carlos’s hand, landing on the deck. The bullet went wide, and Jack leaped aboard Scotch on Water, rocking the boat fiercely.\u003c/p\u003e\n\u003cp\u003eWithout hesitation, the two men dove at each other like wild beasts tearing into a fresh kill. Lorraine nearly tripped over the boxes of supplies as she scrambled to get out of the way. Arms and legs flailed and barely escaped hitting her. She danced a complete circle around the men, looking for a chance to assist Jack.\u003c/p\u003e\n\u003cp\u003eNot knowing what else to do, she jumped on Carlos’s back and wrapped her arms around his neck as tightly as she could in an amateurish endeavor to strangle him. He tossed her off almost effortlessly. She hit the side of her head when she landed, and for a moment saw stars.\u003c/p\u003e\n\u003cp\u003eStunned, she sat and waited for her vision to clear, then struggled to her feet. Refusing to stand by and do nothing, she reached for the bucket. If she could clobber Carlos over the head with it, or better yet put it on his head, she might actually be able to help. Unfortunately he wouldn’t hold still and she ended up chasing him around the deck, pail in hand, ready to act once the opportunity presented itself.\u003c/p\u003e\n\u003cp\u003eJack proved an able-bodied combatant, but Carlos outweighed him by forty or fifty pounds. He, too, seemed to be an expert at hand-to-hand combat.\u003c/p\u003e\n\u003cp\u003e“The gun!” Jack shouted at Lorraine. “Get the gun.”\u003c/p\u003e\n\u003cp\u003eOf course. That made perfect sense and would be a great deal more help to him than chasing after Carlos with a yellow rubber bucket. Adrenaline pumping, she hurried below for the Glock .22 he’d given her.\u003c/p\u003e\n\u003cp\u003eAs she disappeared she heard Jack curse. Frantic, she grabbed the weapon from its hiding place and checked to make sure it was loaded. Then, her hands trembling so badly she could hardly manage it, she released the safety and climbed back to the main deck.\u003c/p\u003e\n\u003cp\u003eIt didn’t dawn on her until a shot rang out that Jack hadn’t been referring to the gun belowdecks but the one she’d knocked away from Carlos. The one that had just been fired.\u003c/p\u003e\n\u003cp\u003eThe sound was like an explosion that echoed in her ears long afterward. She prayed with all her might that it was Carlos who’d been hit. Not Jack, please, not Jack.\u003c/p\u003e\n\u003cp\u003eBut God hadn’t heard her desperate plea. When she reappeared on deck, she found Jack lying in a pool of blood. He stared sightlessly up at the sky, unmoving.\u003c/p\u003e\n\u003cp\u003eJack, who’d put himself in harm’s way to protect her.\u003c/p\u003e\n\u003cp\u003e“No!” she screamed. She didn’t hesitate as she leveled the weapon she held at Carlos. “You dirty son of a bitch,” she sobbed, thinking Jack would be proud of her. Because she’d advanced beyond darn.\u003c/p\u003e\n\u003cp\u003eBlindly she fired the gun. Once, twice. Again and then again. The first bullet knocked the weapon out of his hand. He roared in anger and sprang back. The second shot grazed his shoulder. The next two went wide.\u003c/p\u003e\n\u003cp\u003eLorraine paused and aimed more carefully, figuring that if she’d hit him once she could do it again.\u003c/p\u003e\n\u003cp\u003eHer calm determination must have frightened him. With a cry of outrage, Carlos jumped overboard. Lorraine would have shot him in the water if not for the men racing toward the waterfront, shouting and waving guns. A bullet bored into the wood next to her head as two men pointed their weapons at her from the wharf.\u003c/p\u003e\n\u003cp\u003eActing purely on instinct, she reached for the boat’s throttle and shoved it forward. The powerful engines heaved and roared, but didn’t budge. Groaning with frustration and fear, she pushed them into full power as Jack had showed her earlier. Again nothing happened. Then, all at once, the boat surged forward with such force she was nearly hurled overboard. Her grip on the wheel was what saved her.\u003c/p\u003e\n\u003cp\u003eSomething didn’t feel right, but she didn’t have time to discern what it was until they were safely at sea. As they headed out, she looked back and realized what had happened.\u003c/p\u003e\n\u003cp\u003eShe hadn’t untied Scotch on Water. Behind her, she towed the entire dock and every other boat in town.\u003c/p\u003e\n\u003cp\u003eTen\u003c/p\u003e\n\u003cp\u003eRather than deal immediately with the problem of the attached dock, Lorraine set the course of Scotch on Water toward open sea. Leaving the helm, she ran over to Jack. His blood slicked the deck. Falling on her knees, she searched frantically for a pulse. Relief and gratitude surged through her at the strong steady beat she could feel against her fingertips. He was alive. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sooner-the-better-deliverance-company-3/page-19.html","bookId":2350,"creation":"Oct 5, 2019 10:02:09 AM","modification":"Oct 5, 2019 10:02:09 AM"}
