{"id":23034,"no":11,"title":"CHAPTER XI. MARK IS DISCHARGED.","content":"The next day Mark, with some misgivings, repaired to the shoe manufactory as usual. He knew he had done a bold thing in defending Johnny against his employer\u0027s son, but he never thought of regretting it.\n\u003cbr\u003e \n\u003cbr\u003e \"I would do it again,\" he said to himself. \"Catch me standing by and seeing Johnny whipped by any boy, no matter who he is.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark laid aside his hat and coat, and went to his customary bench.\n\u003cbr\u003e \n\u003cbr\u003e He had been at work fifteen minutes only, when Mr. Waite, the head of the room, entered, and went up to where he was standing.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Collins wants to see you, Mark,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know what for, Mr. Waite?\" Mark asked.\n\u003cbr\u003e \n\u003cbr\u003e \"No, Mark, but I hope it is to raise your wages,\" said Mr. Waite, pleasantly, for he had always liked our hero.\n\u003cbr\u003e \n\u003cbr\u003e \"I am afraid it is something quite different,\" said Mark, shaking his head.\n\u003cbr\u003e \n\u003cbr\u003e \"No trouble, I hope, Mark?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I can tell you better when I return.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark put on his coat, and went downstairs to the office.\n\u003cbr\u003e \n\u003cbr\u003e Squire Collins was seated at a desk, with his spectacles astride his nose. He looked up as Mark entered.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Waite tells me you wish to see me, Mr. Collins,\" said Mark.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said the squire, frowning. \"I presume you can guess what I want to see you about.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps so,\" answered Mark.\n\u003cbr\u003e \n\u003cbr\u003e \"I understand that you made a violent attack upon my son James in the pasture, yesterday afternoon.\"\n\u003cbr\u003e \n\u003cbr\u003e \"We did have a little difficulty,\" Mark admitted.\n\u003cbr\u003e \n\u003cbr\u003e \"Ha! I am glad you confess it. James says you made an unprovoked attack upon him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is not quite true, Squire Collins; I was very much provoked.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did my son attack you first?\" demanded the squire, sharply.\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So I thought. Then you have no excuse by your own confession.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think I have an excuse.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I fail to understand what it can be. To me it appears like a high-handed outrage of which you were guilty.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose James did not tell you what he was doing when I attacked him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I cannot remember that he did. What does that signify?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He had John Downie upon the ground, and was beating him brutally.\"\n\u003cbr\u003e \n\u003cbr\u003e Squire Collins was somewhat nonplussed at this revelation, as James had said nothing about Johnny.\n\u003cbr\u003e \n\u003cbr\u003e \"Well?\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"I ran up, and pulled him off, and prevented him from hurting Johnny.\"\n\u003cbr\u003e \n\u003cbr\u003e Squire Collins was rather embarrassed. He saw clearly that his son had been in the wrong, yet he was inclined to stand by him. Moreover, it chafed him that a poor boy should have presumed to interfere with his son, much more use violence towards him.\n\u003cbr\u003e \n\u003cbr\u003e He drew out his handkerchief and blew his nose, partly to gain time for consideration. At length he spoke.\n\u003cbr\u003e \n\u003cbr\u003e \"My son feels very indignant at your presumption in assaulting him,\" he said, \"and I wonder myself that you didn\u0027t see the impropriety of attacking the son of your employer.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Would you have had me stand by and see Johnny beaten?\" asked Mark, indignantly.\n\u003cbr\u003e \n\u003cbr\u003e \"I do not feel disposed to argue with you,\" said the squire, in a dignified tone. \"I feel compelled to take some action in the matter though I regret it. I cannot, of course, retain you in my employ. You are discharged. I have made up your account to date, and here is the sum due you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very well, sir,\" answered Mark, quietly, though his heart sank within him.\n\u003cbr\u003e \n\u003cbr\u003e Squire Collins handed him a dollar and thirty-seven cents, and Mark, putting them into his pocket, bowed and withdrew.\n\u003cbr\u003e \n\u003cbr\u003e He went back to the room where his hat hung, and taking it down, said to his fellow-workmen:\n\u003cbr\u003e \n\u003cbr\u003e \"Good-bye, boys, I shan\u0027t be with you any longer.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why, Mark, what\u0027s the matter!\" asked his next neighbor.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m discharged; that\u0027s all.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What for?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll tell you some other time—not now.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mark, I\u0027m really sorry for this,\" said Mr. Waite, pressing his hand warmly. \"I wish you good luck!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Mr. Waite,\" answered Mark, his lip quivering a little. \"I will hope for the best.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark walked home with a slow step. He dreaded to tell his mother of his discharge, for he knew that she would be still more depressed than himself. Youth is hopeful, but middle age is less sanguine.\n\u003cbr\u003e \n\u003cbr\u003e \"I won\u0027t go home at once,\" thought Mark. \"I will go to the wood and see the hermit. He may have some errand for me, and besides, he may be able to give me some advice.\"\n\u003cbr\u003e \n\u003cbr\u003e One object which Mark had, however, was to delay breaking the unwelcome news to his mother.\n\u003cbr\u003e \n\u003cbr\u003e He bent his steps towards the pasture, which he must cross in order to penetrate to the wood by the usual path.\n\u003cbr\u003e \n\u003cbr\u003e In a few minutes he entered the cabin, the door of which he found open.\n\u003cbr\u003e \n\u003cbr\u003e The hermit was no longer reclining, but was seated in a rocking-chair—the only article of luxury which the poor dwelling contained.\n\u003cbr\u003e \n\u003cbr\u003e \"Good morning, sir!\" said Mark. \"I hope you are better.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am much better. But how does it happen that you come here in the morning? I supposed you were at work in the shoe factory.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have lost my place there; I was discharged this morning.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ha! how is that?\"\n\u003cbr\u003e \n\u003cbr\u003e Upon this Mark told the story of his encounter with the boys in the pasture.\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose,\" he concluded, \"that James got me discharged in revenge for my interfering with him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then you regret what you did?\" inquired the hermit.\n\u003cbr\u003e \n\u003cbr\u003e \"No, I don\u0027t,\" answered Mark, warmly. \"I couldn\u0027t stand by and see Johnny beaten.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are right, and I respect you for what you did.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is a grievous thing for me, though,\" said Mark. \"It takes away my income, and I don\u0027t see how mother and I are going to live.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How much were you paid?\"\n\u003cbr\u003e \n\u003cbr\u003e \"About three dollars and a half a week. Sometimes I made a little more by over-work.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You have no occasion to be disturbed. I was about to propose that you should leave your place.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark looked surprised.\n\u003cbr\u003e \n\u003cbr\u003e \"I will take you into my own employ,\" added Anthony. \"How long have you been coming to me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"A week, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You may retain five dollars in compensation from the money you hold of mine, and hereafter, as you will give me your whole time, you shall be paid at the rate of a dollar a day—that is, seven dollars a week.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But, sir, you are overpaying me,\" protested Mark, who thought this compensation magnificent.\n\u003cbr\u003e \n\u003cbr\u003e \"Be it so. I can afford it. Let me know when you need more money.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have still about fifteen dollars.\"\n\u003cbr\u003e \n\u003cbr\u003e \"After paying yourself for the last week?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir. Can I do anything for you now?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes. I feel like taking a walk. That shows I am better. You may come with me, and if I tire myself, I will lean upon your arm in returning.\"\n\u003cbr\u003e \n\u003cbr\u003e \"With pleasure, sir. I am very glad that you feel better.\"\n\u003cbr\u003e \n\u003cbr\u003e \"After all,\" mused the old man, \"it is pleasant to have human sympathy. I thought I was able to do without it, but I am more dependent than I supposed.\"\n\u003cbr\u003e \n\u003cbr\u003e They walked for half an hour. When they returned to the cabin, the hermit said:\n\u003cbr\u003e \n\u003cbr\u003e \"To-morrow morning I expect a visitor from the city. I wish you to meet him at the train, and conduct him here. He is a small man, with a sharp look, and will probably be dressed in black. In fact, he is my man of business. You need say nothing of this, however, but let people conjecture as they will.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And shall I speak of my arrangement with you, sir?\"\n\u003cbr\u003e \n\u003cbr\u003e \"You may merely say that I have engaged you to do my errands. I shall not require you again to-day.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1828/53033.html","bookId":1019,"creation":"Aug 2, 2019 3:19:41 PM","modification":"Aug 2, 2019 3:19:41 PM"}
