{"id":23036,"no":13,"title":"CHAPTER XIII. THE LITTLE MAN IN BLACK.","content":"When the morning train arrived, Mark was on hand. He watched carefully for the man he was sent to meet. As it happened, the business agent was the last man to leave the train. He stepped upon the platform, and began to look about him.\n\u003cbr\u003e \n\u003cbr\u003e Mark advanced towards him, and raised his hat, politely.\n\u003cbr\u003e \n\u003cbr\u003e \"Is this Mr. Hardy?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e The small man regarded him sharply.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he answered. \"Have you a message for me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir. I am to conduct you to Mr. Taylor.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Just so. How is his health?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He has had an attack of rheumatism, but is better.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No wonder he is sick, living in that out-of-the-way place. Do you know him well?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Pretty well, sir. I am in his employ.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ha! then he is living a little more as he should do. What is your name?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mark Manning.\"\n\u003cbr\u003e \n\u003cbr\u003e \"M. M. Just so. Sounds like a fancy name. Is it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir; it\u0027s all the name I have,\" said Mark smiling.\n\u003cbr\u003e \n\u003cbr\u003e \"How long have you been in the employ of Mr. Taylor?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Only a little over a week.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know anything about his history?\" demanded Mr. Hardy, with a sharp look of inquiry.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir. He has told me something of it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Humph! Then he must have confidence in you. Well, let us be starting. Is it far?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Nearly two miles, sir. Perhaps you will be tired.\"\n\u003cbr\u003e \n\u003cbr\u003e \"In which case you will perhaps kindly carry me on your shoulders,\" suggested Mr. Hardy, quizzically.\n\u003cbr\u003e \n\u003cbr\u003e \"I am afraid I shouldn\u0027t be able to do that,\" returned Mark, with a smile.\n\u003cbr\u003e \n\u003cbr\u003e \"And yet, I don\u0027t believe I weigh much more than you. What is your weight?\"\n\u003cbr\u003e \n\u003cbr\u003e \"One hundred and twenty-three pounds.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And I weigh one hundred and twenty-four. I have one pound the advantage of you.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark, who was a stout boy, was rather pleased to learn that he weighed within a pound as much as his companion. I suppose most boys are proud of their size.\n\u003cbr\u003e \n\u003cbr\u003e They had commenced their walk and Mark found that his new acquaintance was a fast walker.\n\u003cbr\u003e \n\u003cbr\u003e \"Does Mr. Taylor ever have any visitors?\" asked the lawyer, for such was his profession.\n\u003cbr\u003e \n\u003cbr\u003e \"Not from the village, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"From any other quarter?\" asked Hardy.\n\u003cbr\u003e \n\u003cbr\u003e \"He had a call from his nephew, lately.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Lyman Taylor?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then he has found his uncle\u0027s place of concealment. What do you know of the interview?\"\n\u003cbr\u003e \n\u003cbr\u003e Mark gave an account of Lyman\u0027s visit, his demand for money, and his threatened violence.\n\u003cbr\u003e \n\u003cbr\u003e \"Did he suppose his uncle had money?\" inquired the lawyer, in an anxious tone.\n\u003cbr\u003e \n\u003cbr\u003e \"He did not suppose he had much, but he wanted a part of it, however small.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did he succeed in obtaining anything?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Taylor told me to give him five dollars.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I had a sum of money belonging to the hermit, in my possession. I used to buy things for him in the village.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then you think Lyman went away with the impression that my friend—the hermit, as you call him—had very little money?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir; I am sure of it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you under the same impression?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir; Mr Taylor has told me that he is moderately rich.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That shows he has great confidence in you. Don\u0027t breathe a word of it, my boy, or this rascally nephew will persecute his uncle, and make his life a burden.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He will learn nothing from me,\" said Mark firmly.\n\u003cbr\u003e \n\u003cbr\u003e \"You seem a good trustworthy boy—I think my friend made a good choice of a confidant.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e At length they reached the cabin in the wood. Old Anthony was already outside, waiting for their coming.\n\u003cbr\u003e \n\u003cbr\u003e \"Good morning, my friend,\" said the lawyer; \"the boy tells me you have been sick——\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I have had a visit from my old enemy, but I am much better.\"\n\u003cbr\u003e \n\u003cbr\u003e \"To be sick in such a place!\" said the lawyer with a shudder.\n\u003cbr\u003e \n\u003cbr\u003e \"I have not suffered, thanks to Mark—will you come in?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Let us rather bring chairs outside, if you are provided with such luxuries. We shall have several matters to discuss.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Hardy glanced significantly at Mark, who was leaning against a tree, and could of course hear the conversation.\n\u003cbr\u003e \n\u003cbr\u003e \"Mark,\" said the hermit, \"you may go farther away, but return in an hour. This gentleman and myself may have some things to speak of which are private.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Certainly, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, old friend,\" Hardy began, \"haven\u0027t you had enough of this strange existence? you are rich, and can afford all the comforts of life, yet you voluntarily surrender them, and bury yourself in this wilderness. Do you mean to stay here all your life?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I did at one time think it probable, now I am beginning to feel a greater interest in life.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The boy tells me your nephew has found you out?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; he came here in quest of money, but he went away convinced that I was nearly as poor as himself. If he knew the truth I should be in constant danger of robbery, or worse——\"\n\u003cbr\u003e \n\u003cbr\u003e \"If you die without a will, is he not your heir?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He would be, but I shall make a will. It is partly to give you instructions on this point that I have sent for you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You have no one else to leave your money to?\"\n\u003cbr\u003e \n\u003cbr\u003e \"A part will go to charitable institutions, a part——\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well?\"\n\u003cbr\u003e \n\u003cbr\u003e \"To one whom I hold in greater regard than my nephew—to the boy, who guided you hither.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Indeed! does he know anything of your purpose?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Nothing, and need not.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You have taken a fancy to him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; he is honest, manly, upright, just such a boy as I should have been glad to have for my son. Don\u0027t dissuade me, for the thought of doing something for him gives me a new interest in life.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I shall not dissuade you, Anthony, for I believe the boy to be all that you say. Of course if you had a blood relation who was deserving, I might make an objection. Has this boy relations?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Only a mother, who is mainly dependent upon him. By the way, have you invested the sum paid in lately?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No; but I have an application for it, or I should say, for four-fifths of it. Curiously, the applicant lives in this town.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who is it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Collins, the shoe manufacturer.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am surprised at this. I thought he was rich.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He has lost money by investments in stocks, and finds himself hard up.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What does he offer?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Seven per cent, secured by a mortgage on his shop.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Let him have it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you willing that your name should appear in the matter?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No; I shall transfer the sum to Mark, and make you his trustee or guardian.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I understand. Is he to know of his good fortune?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not at present. The boy was discharged only yesterday from the shop of this Collins,\" added Anthony, smiling.\n\u003cbr\u003e \n\u003cbr\u003e \"A good joke!\" said the lawyer. \"And now the boy lends him money. That is returning good for evil.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Without knowing it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Precisely.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1828/53035.html","bookId":1019,"creation":"Aug 2, 2019 3:19:41 PM","modification":"Aug 2, 2019 3:19:41 PM"}
