{"id":23045,"no":22,"title":"CHAPTER XXII. IN AN OFFICE ON BROADWAY.","content":"Mr. Hardy\u0027s office was in a large, high building, on Broadway. It was the fifth floor, but there was an elevator constantly running, which made it nearly as easy of access as if it had been on the first.\n\u003cbr\u003e \n\u003cbr\u003e Mark had never before ridden in an elevator, and he enjoyed the novelty of it. From a directory, near the entrance, they ascertained that Mr. Hardy occupied office No. 55, and this was easily found.\n\u003cbr\u003e \n\u003cbr\u003e \"Welcome to New York,\" said the agent, advancing cordially, to greet his visitors. \"Good morning, Mark. So you have piloted my old friend safely.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think he has piloted me, sir. I know very little of the city.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have not been here for five years,\" said Anthony, reflectively. \"I am unused to the noise, and it confuses me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I like it,\" said Mark.\n\u003cbr\u003e \n\u003cbr\u003e \"You are young, and enjoy new and busy scenes,\" said Mr. Hardy. \"Would you like to travel?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very much, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps you may some time.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am afraid it will be a long time before I am able.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Possibly not.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark, however, did not detect any special significance in these words.\n\u003cbr\u003e \n\u003cbr\u003e \"You may sit down here, and read a morning paper, Mark,\" said the agent, \"while I transact a little business with Mr. Taylor.\"\n\u003cbr\u003e \n\u003cbr\u003e The two entered an inner office, where Mr. Hardy produced an official-looking document, to which he called the attention of the hermit.\n\u003cbr\u003e \n\u003cbr\u003e \"Read it over,\" he said, \"and see if it meets your views.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Precisely,\" answered Anthony, after he had taken the time necessary to read it.\n\u003cbr\u003e \n\u003cbr\u003e \"Then it may as well be signed at once.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Hardy summoned three clerks from the outer office, and in their presence as witnesses the will was signed.\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose I may as well leave the document with you, John,\" said Anthony.\n\u003cbr\u003e \n\u003cbr\u003e \"It will be as well. Now, about the other matter. It seems to me you may as well send Mark at once in search of some clue to the possible existence of a grandchild. Before doing so, however, may I suggest something?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Certainly.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t like the idea of your living in that lonely cabin. Why can\u0027t you seek a home in the house of your young secretary? Has he a good mother?\"\n\u003cbr\u003e \n\u003cbr\u003e \"She is a very worthy woman.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Has she a room for you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think so.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What do you think of my proposal?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have been thinking of such a change myself. For the first time in five years I am beginning to find my cabin home monotonous.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am glad to hear it. You will be much better off in a home where you can be taken care of.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will attend to the matter without delay on my return.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So far, so good. Now, let me call in Mark, and speak to him of our plan.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark, at the summons, entered the back office.\n\u003cbr\u003e \n\u003cbr\u003e \"Mark,\" said Mr. Hardy, \"we want you to take a journey.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I shall be very glad to do so, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It will be a long one.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The longer the better,\" answered Mark, his eyes sparkling.\n\u003cbr\u003e \n\u003cbr\u003e \"Your first stopping place will be Chicago.\"\n\u003cbr\u003e \n\u003cbr\u003e The boy\u0027s eyes sparkled with excitement.\n\u003cbr\u003e \n\u003cbr\u003e \"I should like nothing better,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"The commission will be to trace out Mr. Taylor\u0027s daughter, and find out whether she left a child. Necessary instructions will be given in writing.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you think I am old enough?\" asked Mark, excited but doubtful whether he was competent for the duty assigned him.\n\u003cbr\u003e \n\u003cbr\u003e \"Discretion is more needful than age,\" answered Mr. Hardy. \"Perhaps an older messenger would be better, but as my friend wishes to avoid publicity, he is disposed to try you. Would your mother be willing to have you go?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think so, sir, but I hate to leave her alone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Taylor proposes to board with her while you are absent, if you think she would be willing to receive him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I know she would be glad to secure such a boarder,\" answered Mark, quickly; \"with that help she would be able to get along very well.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then that matter is probably settled. Now a few words to guide you in your quest.\"\n\u003cbr\u003e \n\u003cbr\u003e These words need not be repeated here, as in following Mark\u0027s journey it will be understood what they were.\n\u003cbr\u003e \n\u003cbr\u003e Their business concluded, Mark and the hermit left the office and descended to the ground floor.\n\u003cbr\u003e \n\u003cbr\u003e They were just leaving the building when Squire Collins entered.\n\u003cbr\u003e \n\u003cbr\u003e He arched his brows in surprise. \"You here?\" he said, addressing Mark.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"On what errand?\"\n\u003cbr\u003e \n\u003cbr\u003e Mark was privately of opinion that he had as much right to ask the manufacturer\u0027s business as the latter his, but he answered: \"Mr. Taylor had business here.\"\n\u003cbr\u003e \n\u003cbr\u003e Squire Collins smiled contemptuously. It did not strike him that the hermit\u0027s business was likely to be of any great moment. So people often deceive themselves and assume a superiority to which they have little claim.\n\u003cbr\u003e \n\u003cbr\u003e \"Probably old Anthony has just been paid his pension,\" he thought, as he left them, and made his way to the elevator.\n\u003cbr\u003e \n\u003cbr\u003e He, too, ascended to the fifth floor, and leaving it there went to John Hardy\u0027s office.\n\u003cbr\u003e \n\u003cbr\u003e \"Good morning, Mr. Collins,\" said Hardy. He knew nothing of the manufacturer\u0027s home title. \"I shall be at leisure in five minutes.\"\n\u003cbr\u003e \n\u003cbr\u003e The five minutes passed.\n\u003cbr\u003e \n\u003cbr\u003e \"Now I am at your service,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"Have you decided to let me have the money, Mr. Hardy?\" asked the manufacturer, trying to conceal his anxiety.\n\u003cbr\u003e \n\u003cbr\u003e \"Taking as security a mortgage on your manufactory?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think I can let you have it.\"\n\u003cbr\u003e \n\u003cbr\u003e Squire Collins looked much relieved.\n\u003cbr\u003e \n\u003cbr\u003e \"You will find the security ample,\" he said. \"The building is worth double the sum I am borrowing.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is it well insured?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The policies of insurance must be placed in my hands.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Of course.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have to take all precautions, as the money is not mine, but belongs to a boy for whom I am trustee.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I see.\"\n\u003cbr\u003e \n\u003cbr\u003e Squire Collins had no curiosity as to the name of the boy referred to. He would have been very much amazed had he been told that it was the very boy whom he had discharged from his employment only a short time previous. For that matter, Mark would have been quite as much surprised.\n\u003cbr\u003e \n\u003cbr\u003e In the course of half an hour the proper papers had been made out, a check for four thousand dollars handed to Squire Collins, and the shoe manufacturer left the office in as good spirits as Mark had done half an hour before.\n\u003cbr\u003e \n\u003cbr\u003e \"By-the-way,\" remarked the Squire at his supper table that evening, \"I met two persons from Pocasset in the city to-day.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who were they?\" asked James.\n\u003cbr\u003e \n\u003cbr\u003e \"Old Anthony and Mark Manning.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What could have taken them to the city?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I presume Anthony receives a small pension from some source, and went up to collect it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think it very likely,\" said James, thinking of what he had seen in the forest. \"I presume it isn\u0027t much.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Probably not.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I shouldn\u0027t think he\u0027d have gone to the expense of taking Mark.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The old man looked dazed. I presume he doesn\u0027t feel safe in going alone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very likely Mark asked to go. He\u0027s fastened himself on the old man, and means to get all he can out of him.\"\n\u003cbr\u003e \n\u003cbr\u003e It is wonderful how prejudice colors our opinion of others.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1828/53044.html","bookId":1019,"creation":"Aug 2, 2019 3:19:41 PM","modification":"Aug 2, 2019 3:19:41 PM"}
