{"id":23027,"no":4,"title":"CHAPTER IV. THE HERMIT EXPLAINS.","content":"Mark did not obey directly, but turning to the hermit said, \"Do you want this man to leave the cabin?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" answered the old man, \"but beware of him! He is all that is bad!\"\n\u003cbr\u003e \n\u003cbr\u003e \"A pretty recommendation to come from your uncle,\" said Taylor, sullenly. \"Uncle Anthony, I ask you once more to give me money. I am penniless, and am a desperate man.\"\n\u003cbr\u003e \n\u003cbr\u003e \"There is no money in this cabin, and you would search for it in vain, but if you will promise to leave this place and trouble me no more, I will provide you with five dollars.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What are five dollars?\"\n\u003cbr\u003e \n\u003cbr\u003e \"All that you will get. Do you make the promise?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, yes—\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mark, you may give this man five dollars on my account.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is he your treasurer!\" inquired Taylor, in surprise.\n\u003cbr\u003e \n\u003cbr\u003e \"He has charge of some funds out of which he buys me what I need.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How much money have you got of my uncle\u0027s, boy?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t care to answer the question. Ask your uncle.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A small sum only. It won\u0027t be worth your while, Lyman, to plot for its possession.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Have you no other money?\"\n\u003cbr\u003e \n\u003cbr\u003e \"None that you are likely to get hold of. I will save you the trouble of searching the cabin, or prowling round it, by repeating that I have no money concealed here. You know me well enough to know that I am not deceiving you.\"\n\u003cbr\u003e \n\u003cbr\u003e Lyman Taylor listened in sullen disappointment. He did know that his uncle\u0027s word could be relied upon implicitly, and that the hopes which he had built up of securing a large fund from the uncle he had once robbed, were not destined to be realized.\n\u003cbr\u003e \n\u003cbr\u003e \"It seems you are a pauper, then,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"I have not been compelled to ask for charity yet,\" answered Anthony. \"I live here for next to nothing, and have not suffered yet for the necessities of life.\"\n\u003cbr\u003e \n\u003cbr\u003e Lyman Taylor looked around him contemptuously.\n\u003cbr\u003e \n\u003cbr\u003e \"You must have a sweet time living here,\" he said, \"in this lonely old cabin.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I would not exchange it for the place in which you confess that you have passed the last four years.\"\n\u003cbr\u003e \n\u003cbr\u003e Taylor frowned, but did not otherwise notice the old man\u0027s retort.\n\u003cbr\u003e \n\u003cbr\u003e \"Give me the five dollars, boy,\" he said, \"and I will go. It seems I am wasting time here.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark drew a gold piece from his pocket and passed it to him.\n\u003cbr\u003e \n\u003cbr\u003e \"Have you many more of these?\" he demanded, his eyes gleaming with cupidity.\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Give me another.\"\n\u003cbr\u003e \n\u003cbr\u003e \"They are not mine to give.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not another one, Mark,\" said Anthony. \"He does not deserve even that.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Make way, then, and I will go,\" said the nephew, convinced that he had no more to expect.\n\u003cbr\u003e \n\u003cbr\u003e Mark moved aside, and he strode out of the cabin.\n\u003cbr\u003e \n\u003cbr\u003e \"Good-bye, Uncle Anthony,\" he said. \"You haven\u0027t treated me very generously, considering how long it is since you did anything for me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you utterly shameless, Lyman?\" said the hermit. \"I hope never to set eyes on you again.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, you are very kind. Boy, what is your name?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mark Manning.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, Mark, as you appear to be in charge of my uncle, I shall be glad to have you write me if anything happens to him. As his nearest relative and heir, I ought to be notified.\"\n\u003cbr\u003e \n\u003cbr\u003e Mark looked to the hermit for directions.\n\u003cbr\u003e \n\u003cbr\u003e \"Give him your address, Lyman,\" said Anthony. \"If there is any news to interest you, he shall write. But don\u0027t calculate on my speedy death. It is hardly likely to benefit you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I may want to visit your grave, uncle,\" said Lyman, jeeringly.\n\u003cbr\u003e \n\u003cbr\u003e \"Give him an address where a letter will reach you then.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No. —— Third Avenue, New York,\" said Taylor. \"Write soon.\"\n\u003cbr\u003e \n\u003cbr\u003e He left the cabin, and old Anthony and Mark were alone.\n\u003cbr\u003e \n\u003cbr\u003e \"He is my nearest relative,\" said the old man, \"and a relative to be proud of, eh, Mark?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Years since we were in California together, I had two thousand dollars in gold dust under my pillow. My nephew was my companion, but none of the gold belonged to him. I woke one morning to find my nephew gone, and my gold also. From that time I have not set eyes on him till to-day.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It was a shabby trick,\" said Mark, warmly. \"Were you left destitute?\"\n\u003cbr\u003e \n\u003cbr\u003e \"So far as money went, yes. But I was the owner of a claim which my nephew thought exhausted. I resumed work on it, and three days later made a valuable find. Within a month I took out ten thousand dollars, and sold it for five thousand more.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Your nephew does not know this, does he?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No; if he had, I should not have got rid of him so easily. But I have not told you all. I remained in California a year longer, and left it worth forty thousand dollars.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then why—excuse me for asking—have you come to this poor cabin to live?\" asked Mark.\n\u003cbr\u003e \n\u003cbr\u003e \"I had one other relative than Lyman, a daughter—I left her at a boarding-school in Connecticut. I returned to find that she had married an adventurer a month previous. Two years later I heard of her death. Life had lost its charm for me. I would not deprive myself of it, but in a fit of misanthropy I buried myself here.\"\n\u003cbr\u003e \n\u003cbr\u003e Old Anthony seemed weary, and Mark questioned him no more, but set before him the milk and loaf which he had brought with him.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1828/53026.html","bookId":1019,"creation":"Aug 2, 2019 3:19:41 PM","modification":"Aug 2, 2019 3:19:41 PM"}
