{"id":96386,"no":17,"title":"Page 17","content":"\u003cp\u003eChakas was silent.\u003c/p\u003e\n\u003cp\u003eSlowly, my armor started to fail. My breath came hard and shal ow. Something sparkled to my right. I tried to turn, but the armor had locked up and now held me immobile. An orange glare increased to unbearable bril iance, and I saw our bulkheads and control surfaces melt and col apse—while new wal s of hard light fought to rise between us and the vacuum. Even under siege, stripped of nearly al higher functions, the Didact’s ship was valiantly trying to protect us.\u003c/p\u003e\n\u003cp\u003eOur world became a twisting, free-form struggle between destructor beams and new construction. I watched in numb fascination as the struggle ramped up to a pitch I could not track with my natural senses … and then slowly subsided.\u003c/p\u003e\n\u003cp\u003eOur ship was losing.\u003c/p\u003e\n\u003cp\u003eHalf of what was left of the control center—abstract and angular and much smal er—fel away and vanished. I briefly saw the curved flank of a sleek Despair- class hunter-kil er, glinting and flashing as it reflected the dying glow of our hul ’s destruction. We drifted free. Our air rapidly staled, and we were surrounded by vacuum.\u003c/p\u003e\n\u003cp\u003eInto my narrowing point of view came three powerful, ful y operational seekers— longer, sleeker, versions of the Didact’s old war sphinxes. They lacked the scowling features of the older machines—depersonalized, dark, fast.\u003c/p\u003e\n\u003cp\u003eOne of them cut through the new-grown wal s and circled behind us, then dropped aft, penetrating interior bulkheads, searching for other occupants. Through shredded layers of ship’s decking, I watched it release the war sphinxes—only to smash them like toys, slice them into sections, and then reduce those to sparking dust.\u003c/p\u003e\n\u003cp\u003eThe sphinxes offered no resistance.\u003c/p\u003e\n\u003cp\u003eAnother took the Didact in tow, bouncing in his armor like a child’s toy on a string as he was hauled from the dying ship into the depths of space.\u003c/p\u003e\n\u003cp\u003eThe third lingered near me but took no action, as if awaiting instructions. Then, just as my vision shrank to a purplish cone and I thought I had taken my last breath, the seeker swept out its manipulators, seized my armor, and tugged me from the broken hul , not toward a flotil a of ships, but outward, around—and final y, down.\u003c/p\u003e\n\u003cp\u003eWe were al being unceremoniously dragged to the surface of the San’Shyuum world.\u003c/p\u003e\n\u003cp\u003eTWENTY-FOUR\u003c/p\u003e\n\u003cp\u003ePARALYZED, WRAPPED IN a transparent field like a bubble, unable to talk to anyone, my ancil a deactivated by suppressors, I had an ever-changing ringside view of what Forerunners do when their anger and fear takes charge.\u003c/p\u003e\n\u003cp\u003eThey have no warrior discipline.\u003c/p\u003e\n\u003cp\u003eThe atmosphere below was a swirling soup of smoke and fire. Warrior craft and automated weapon systems were mostly too smal to be visible, but I saw their effects—darting beams of needle light, glowing arcs cutting across continents, gigantic, stamplike divots punched into the crust and then lifted up, spun about, overturned. I had never seen anything like this—but the Didact had.\u003c/p\u003e\n\u003cp\u003eHis memories offered commentary and context as the grappler dragged me down toward that hel .\u003c/p\u003e\n\u003cp\u003eFor some time, my involuntary point of view spun away from the planet. Looking outward, I saw weapons and ships in higher orbits transit like frantic stars, the blinding sun—and then, the sparkling, dissolving hulk of the Didact’s ship.\u003c/p\u003e\n\u003cp\u003eThe ship that the Librarian had seeded inside the central peak of Djamonkin Crater—a bent, broken mass stil pitiful y trying to reassemble.\u003c/p\u003e\n\u003cp\u003eA ship that never even had a name.\u003c/p\u003e\n\u003cp\u003eSeveral times, the grappler and I passed through pulses of ionized gas and superheated plasma that tingled my nerves and throbbed in my bones—without actual sound.\u003c/p\u003e\n\u003cp\u003eIt slowly became obvious that the decimation of the San’Shyuum world was not al one-sided. The planet itself was a source of plasma pulses and other firepower.\u003c/p\u003e\n\u003cp\u003eMore interesting, I caught sight of a craft silhouetted against the stars that looked like nothing made by Forerunners—a flat platform surrounded by bil owing, silvery sails, flapping in and out like the bel of a jel yfish, as if trying to swim clear—but not succeeding.\u003c/p\u003e\n\u003cp\u003eThe bel dissolved, the platform broke up. Bodies spil ed, tiny and motionless—and then al of it was gone. I spun around again. The planet seemed close enough to touch, maybe a hundred kilometers below, nighttime emphasizing the dying glow of what might have been forests, cities.\u003c/p\u003e\n\u003cp\u003eNear the brightening arc of sunrise, a glistening river was delineated against the shadow of dawn, studded with smoking pinpoints of orange. Burning ships—ships made to float on water.\u003c/p\u003e\n\u003cp\u003eThere was plenty of time to feel sorry for myself, to regret al I had done, but contrary to al my self-expectations and past attitudes, I didn’t. Sorry about nothing, regretting nothing. Simply watching, waiting.… Waiting with a kind of contentment to die, if that was necessary and inevitable.\u003c/p\u003e\n\u003cp\u003eWondering about our humans, who had had every reason to regret having anything to do with me. And who, if they stil lived, might now be adding to their own awareness of past battles, old wars.\u003c/p\u003e\n\u003cp\u003eThe main prize was of course the Didact. He had fled some duty too onerous to contemplate. He had fought against a Council decision, and losing that fight, he had hidden away, entered into an honorable if not permanent retirement.\u003c/p\u003e\n\u003cp\u003eBut now his opponents had him again. That seemed more than significant—it caused a deeper anger than anything being done to me.\u003c/p\u003e\n\u003cp\u003eI shut my eyes for a moment.\u003c/p\u003e\n\u003cp\u003eWhen I opened them again, flares of atmospheric entry shot up on al sides. We were very close to the surface, less than sixty kilometers, and rapidly descending.\u003c/p\u003e\n\u003cp\u003eI spun again and saw space through a cone of ionized gases. Centered in that cone, something impossible appeared far beyond the panoply of ships and weapons exchanges: an enormous ripple that stirred the stars like a stick twirled through flecked paint. The disturbance swept across wel over a third of my view, then was framed by an el iptical lacework of hard light.\u003c/p\u003e\n\u003cp\u003eI recognized that this was one end of a massive portal—designed to transport a great deal of mass on a continuing basis.\u003c/p\u003e\n\u003cp\u003eI watched without emotion as an enormous but delicate silver ring emerged through the purplish hole in the center of the lacework. Despite its size, the portal had opened far from the orbiting ships, wel over a mil ion kilometers outward from the orbit of the San’Shyuum’s dying world … far above war, death, the concerns of little creatures like myself.\u003c/p\u003e\n\u003cp\u003e“It’s big,” my lips tried to say, but again my breath hitched, my lungs heaved, I tried to suck up whatever air was left, but clearly, I was running out. The seeker was towing me al the way down to the surface with only the bubble as protection.\u003c/p\u003e\n\u003cp\u003eThe ring far above shimmered. Within its delicacy, spokes of hard light shot toward the center and created a bril iant copper-hued hub ful y a third as wide as the ring itself.\u003c/p\u003e\n\u003cp\u003eHalf of the ring fel into shadow, the other half glimmered in bright sun.\u003c/p\u003e\n\u003cp\u003eThe inner surface—it’s covered with water— My tunnel vision narrowed around the ring, focused on it, and I noticed tiny details, clouds, clouds in shadow, impossibly tiny against such vastness … mountains, canyons, detail upon detail as my vision both sharpened and shrank inward, until it winked out altogether and I drifted through a thick pudding of nothing.\u003c/p\u003e\n\u003cp\u003eIt was now that the Domain opened to me, without benefit of ancil a, interface, or past experience. It was new, deep, appropriately shapeless—that made sense. I was dying, after al . Then, it assumed a form, rising around me like a beautiful building with gleaming, indefinite architecture, not quite seen but definitely sensed, felt—a lightness that carried its own somber joy.\u003c/p\u003e\n\u003cp\u003eHere comes everybody, I thought.\u003c/p\u003e\n\u003cp\u003eAnd everybody who had ever visited the Domain said to me: Preserve.\u003c/p\u003e\n\u003cp\u003eThe lightness vanished instantly. The building was being carved apart just as our ship had died.\u003c/p\u003e\n\u003cp\u003eMore messages.\u003c/p\u003e\n\u003cp\u003eThis time is coming to an end.\u003c/p\u003e\n\u003cp\u003ePreserve.\u003c/p\u003e\n\u003cp\u003eThe history of Forerunners will soon conclude.\u003c/p\u003e\n\u003cp\u003eThese came with a rising scream of anguish, as if I had plugged into a chamber where essences were pouring forth more than recal and knowledge—pouring forth frustration, horror, pain.\u003c/p\u003e\n\u003cp\u003eBefore the bump, and the sudden inrush of cold, clean air—breathable air, but with a sharp tang of soot and ozone—the Domain lifted up and away. I was grateful to be free of it. For a moment, I doubted I had seen anything but a reflection of my own emotions and predicament.\u003c/p\u003e\n\u003cp\u003e“Sometimes, there is a kind of broken-mirror aspect.”\u003c/p\u003e\n\u003cp\u003eVaguely I wondered about the giant ring. Had I imagined it? It had seemed so real.\u003c/p\u003e\n\u003cp\u003eThen a word flashed into my revived mind, echoing from the image I had just seen or imagined or conjured up from anoxia.\u003c/p\u003e\n\u003cp\u003eThat single word connected intimately with the precious little the Domain had revealed to me: Death. Destruction. Massive power.\u003c/p\u003e\n\u003cp\u003eThat word was Halo.\u003c/p\u003e\n\u003cp\u003eTWENTY-FIVE\u003c/p\u003e\n\u003cp\u003eJANJUR QOM • THE GREATER SAN’SHYUUM QUARANTINE WORLD\u003c/p\u003e\n\u003cp\u003e“WHAT IN HELL have they done to you, Manipular?”\u003c/p\u003e\n\u003cp\u003eThe voice was mannered, cultured. I recognized its highly trained and inculcated tones, like powerful music rising and echoing through a great, solemn structure.\u003c/p\u003e\n\u003cp\u003eFor a moment, I thought maybe this was the Domain again, speaking in a more physical and personal way. Not so, however. The voice was coming through my ears.\u003c/p\u003e\n\u003cp\u003eI could smel something other than burning—like the resonant, musky perfume favored by my father, far too expensive for my swap-father or other Miners … or Warrior-Servants. The voice was definitely not my father’s, however.\u003c/p\u003e\n\u003cp\u003eMy eyes were open but showed only a darkness swimming with vague shadows.\u003c/p\u003e\n\u003cp\u003e“Turn off the suppressors. His armor can revive him. And I do want him revived.”\u003c/p\u003e\n\u003cp\u003eSame voice, but not directed at me.\u003c/p\u003e\n\u003cp\u003eAnother voice, less powerful, subservient. “We don’t know whether the armor has been counterequipped.…”\u003c/p\u003e\n\u003cp\u003e“Turn them al off! We have the one we want. Let’s get some additional details. I’m sure there’s a mad scheme lurking here somewhere.”\u003c/p\u003e\n\u003cp\u003eMy armor loosened. Strength returned to my flesh. I had some freedom of motion but not much—the suppressor had been shut down, but physical shackles stil held me. I seemed to hang from a chain or a hook in a grayish, echoing volume. I blinked to clear the blurriness.\u003c/p\u003e\n\u003cp\u003e“There you are,” the voice said. “I ask you again, Manipular—what has the Didact done to you?”\u003c/p\u003e\n\u003cp\u003eI managed to speak—barely. “I’m a first-form. Not a Manipular.”\u003c/p\u003e\n\u003cp\u003e“You smel like a Warrior-Servant, but you look more like a misshapen Builder.\u003c/p\u003e\n\u003cp\u003eHow did that happen?”\u003c/p\u003e\n\u003cp\u003e“Brevet mutation. Necessary under the circumstances.”\u003c/p\u003e\n\u003cp\u003eThe powerful voice turned thick with pity. “Do you know where you are and what has happened?”\u003c/p\u003e\n\u003cp\u003e“I saw the planet being devastated. I saw a great ring lit by the sun on one side.\u003c/p\u003e\n\u003cp\u003ePerhaps I imagined it.”\u003c/p\u003e\n\u003cp\u003e“Mm. You’re on what is left of Janjur Qom, the primary treaty planet of the San’Shyuum. Our former enemies have turned enemy again. Not unforeseen, but can you tel me why the Prometheans al owed this to happen?”\u003c/p\u003e\n\u003cp\u003e“No.” I tried to focus on a blurred, shifting wal of light to my left—and couldn’t.\u003c/p\u003e\n\u003cp\u003eNone of it was familiar. None of it made sense.\u003c/p\u003e\n\u003cp\u003e“Why would the Librarian’s recent visit provoke this uprising?”\u003c/p\u003e\n\u003cp\u003e“I don’t know that it did.”\u003c/p\u003e\n\u003cp\u003e“But you do know about her visit.”\u003c/p\u003e\n\u003cp\u003e“The Confirmer mentioned it.”\u003c/p\u003e\n\u003cp\u003e“Ah! A shameful travesty, that one—who guards the guards? Stil , he has the wit to serve those who release him from onerous duties. You seem to remember a few important things.”\u003c/p\u003e\n\u003cp\u003e“I’m not trying to deceive you.”\u003c/p\u003e\n\u003cp\u003e“Of course not. It must feel good to be back among your kind.”\u003c/p\u003e\n\u003cp\u003e“I don’t know that I am, yet.”\u003c/p\u003e\n\u003cp\u003e“A violent return to the fold, that’s for sure—but under the circumstances, we could not afford to have an unassigned ship interfere with our operations.”\u003c/p\u003e\n\u003cp\u003e“There were humans.…”\u003c/p\u003e\n\u003cp\u003e“I haven’t inquired. If so, that infraction wil be punished, as wel .”\u003c/p\u003e\n\u003cp\u003eAs my eyes cleared and my senses returned, the large grayish outline before me took on shape and focus. I saw a Builder, perhaps the finest specimen of my rate I had ever observed, lovingly guided through at least three, possibly more mutations.\u003c/p\u003e\n\u003cp\u003eSculpted and trained for high office, even the Council itself.\u003c/p\u003e\n\u003cp\u003e“Who are you?” I asked.\u003c/p\u003e\n\u003cp\u003e“I am the Master Builder. You’ve met me before, Manipular.”\u003c/p\u003e\n\u003cp\u003eHe stil insisted on cal ing me that. It was meant as an insult. I did vaguely recal someone like him in my early youth, visiting my family’s world in the Orion complex.\u003c/p\u003e\n\u003cp\u003eHe had not then been cal ed Master Builder. He had been known simply as Faber.\u003c/p\u003e\n\u003cp\u003eWhere the Didact had been bulked and hewn, the Master Builder had been gently carved, rounded, polished to a rosy gray sheen. His skin radiated musky perfume. I thought of the San’Shyuum and their ability to charm.\u003c/p\u003e\n\u003cp\u003eMy head was ful of interesting thoughts, none of them focused, none involved with my situation, my predicament, my survival.\u003c/p\u003e\n\u003cp\u003eWe were arranged along one side of a long, dimly lighted corridor, broader than it was high, broken by angular blocks stepped up against the wal s. Every few seconds, upright bars of light swept down the middle, function unknown to me.\u003c/p\u003e\n\u003cp\u003eMy ancil a was stil suppressed.\u003c/p\u003e\n\u003cp\u003eThe Master Builder walked around me.\u003c/p\u003e\n\u003cp\u003e“When did you join the Didact in his mission?”\u003c/p\u003e\n\u003cp\u003e“On Erde-Tyrene.”\u003c/p\u003e\n\u003cp\u003e“Erde-Tyrene is assigned to the Lifeworkers as a nature preserve, under protection of the Librarian. Were humans involved in this plot from the beginning?”\u003c/p\u003e\n\u003cp\u003e“I don’t know what you mean.”\u003c/p\u003e\n\u003cp\u003e“Were they aware of the consequences of liberating the Didact from his Warrior Keep?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“It’s our best theory to date, that al of you were guided by the Librarian in an effort to frustrate the Council. Do you personal y disagree with the Council?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“How can you be so uninformed?”\u003c/p\u003e\n\u003cp\u003e“By not paying attention,” I said. “I lived among Miners before slipping away to Erde-Tyrene. They have little interest in Builders and their affairs.” \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-cryptum-halo-7/page-17.html","bookId":1631,"creation":"Oct 5, 2019 6:21:18 PM","modification":"Oct 5, 2019 6:21:18 PM"}
