{"id":75745,"no":110,"title":"Page 110","content":"\u003cp\u003eI nodded. “Some of my father’s coworkers, Mother’s fellow charity planners and families, their lawyer—”\u003c/p\u003e\n\u003cp\u003e“Their lawyer? Did he bring his skeevy son? What’s his name? Jeremy?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” I sighed and curled closer to him. “He was there too.”\u003c/p\u003e\n\u003cp\u003eHe began to stroke my hair. “He didn’t try anything with you, did he?”\u003c/p\u003e\n\u003cp\u003e“No. He just teased me about being sixteen and never been kissed.”\u003c/p\u003e\n\u003cp\u003e“The ass. Wait, why’d he think you’d never been kissed if the last time he saw you, he accused you of being sexually active?”\u003c/p\u003e\n\u003cp\u003e“Probably because I set him straight about all that the day he accused me.” I lazily drew the words I love you on his chest with my finger.\u003c/p\u003e\n\u003cp\u003e“I love you too.” Pressing a kiss to my temple, he asked, “And he didn’t try to kiss you himself?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “No.”\u003c/p\u003e\n\u003cp\u003eHis fingers found my hair. “Good. Did you get any good presents?”\u003c/p\u003e\n\u003cp\u003eClenching my teeth, I wished he hadn’t asked that. So I mumbled the answer, hoping he dropped it. Except he frowned and lowered his ear to my mouth. “Sorry, what was that?”\u003c/p\u003e\n\u003cp\u003e“I said I got a car,” I muttered on a sigh.\u003c/p\u003e\n\u003cp\u003eHis eyes widened. “Holy shit! Really? A car? What kind?”\u003c/p\u003e\n\u003cp\u003eI looked up at him nervously. “You aren’t mad?”\u003c/p\u003e\n\u003cp\u003e“What?” He blinked and frowned. “Why the hell would I be mad?”\u003c/p\u003e\n\u003cp\u003e“Because...” I glanced away, blushing. “My parents can just go out and buy me a brand new—”\u003c/p\u003e\n\u003cp\u003eCatching my chin, he coaxed me into looking up at him. “You can’t help it if your family has money and mine doesn’t. I think it’s amazing you have something to drive. Be grateful, not ashamed of your good fortune.”\u003c/p\u003e\n\u003cp\u003eI made a noncommittal sound and burrowed into him, wishing I could pass some of my “good fortune” his way so he didn’t always have to work so hard.\u003c/p\u003e\n\u003cp\u003e“What kind is it?” he asked, nudging his shoulder into mine.\u003c/p\u003e\n\u003cp\u003e“An Audi.” I looked up in time to catch his eyebrows lifting, impressed.\u003c/p\u003e\n\u003cp\u003e“Cool. I want to see it. Wait. Can I see it?”\u003c/p\u003e\n\u003cp\u003eAs an idea hit me, I perked to attention. “You want to drive it?” I offered instead.\u003c/p\u003e\n\u003cp\u003eHis mouth began to fall open before he sputtered, “Umm…hell, yes.”\u003c/p\u003e\n\u003cp\u003e“Shit, City, I’ve never been in a car this nice. Goddamn, it even smells awesome. Don’t you love that new leather smell?”\u003c/p\u003e\n\u003cp\u003eGrinning at him from the passenger side, I curled my legs up onto the seat with me and rested my cheek on my knees. “I love you more.”\u003c/p\u003e\n\u003cp\u003e“Ditto.” He grinned at me as he ran his palms over the steering wheel. “But you gotta admit this ride is sweet.”\u003c/p\u003e\n\u003cp\u003eI shrugged because, yeah, it was a nice car, but it didn’t really feel like mine. Across the center console from me, Knox groaned as he reached forward to run his fingers over the dash.\u003c/p\u003e\n\u003cp\u003eCocking up one eyebrow, I asked, “Are you ever going to drive it, or just sit there and stroke it all night?”\u003c/p\u003e\n\u003cp\u003e“Hush.” He held up a finger my way. “I’m savoring the moment.” Closing his eyes, he inhaled deeply and then sighed. “God, that’s nice.”\u003c/p\u003e\n\u003cp\u003eI shook my head in wonder. “I can’t believe you took a night off from work just so you could sit in the driver’s seat of my car and smell it.”\u003c/p\u003e\n\u003cp\u003e“Oh, Lord. I can.” He breathed it in again, and I laughed. Then he opened his eyes and started the ignition. “Okay, let’s drive.”\u003c/p\u003e\n\u003cp\u003e“Finally.”\u003c/p\u003e\n\u003cp\u003eHis lips quirked at my overdramatic sigh. “Mind if I take it out onto the highway?”\u003c/p\u003e\n\u003cp\u003eWe’d met on a backcountry road. Knox had hiked nearly a mile to get there and meet me, which I hadn’t liked much, but it’d been his idea. I had to admit, it was smart thinking. Absolutely no one else was around.\u003c/p\u003e\n\u003cp\u003eWith a flutter of my hand, I motioned for him to go. “Take it wherever you like.”\u003c/p\u003e\n\u003cp\u003eHe glanced at me. “Dangerous words, sweetheart. What if wherever I like is a completely different town far away from here, where no one knows either of us, and I set up house with you and keep you with me for the rest our lives?”\u003c/p\u003e\n\u003cp\u003eA grin lit me up from the inside out. “Then I’d say floor it so we can get there faster.”\u003c/p\u003e\n\u003cp\u003eChuckling lightly, he turned his attention to the car as he gingerly pulled it onto the road. “I wish. If we went away together now, we’d probably be forever on the run from your parents. I’d never find a job, and we’d be dirt broke and homeless within a week.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-110.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
