{"id":75746,"no":111,"title":"Page 111","content":"\u003cp\u003eI sighed. “You just have to be so practical and realistic about it, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Honestly? Yes, I do, otherwise I might be tempted to actually try something dumb exactly like that.”\u003c/p\u003e\n\u003cp\u003eA flutter of excitement rippled through my stomach over the idea of escaping with him and never coming back, of never having to worry about sneaking away to be with him ever again. It thrilled me that he wanted the same thing. I took a moment to envision what it’d be like if we just took off now and never came back.\u003c/p\u003e\n\u003cp\u003e“Ready to see what this thing will do?” he asked, jerking me from my daydream. We’d just reached the highway and he’d halted at a stop sign.\u003c/p\u003e\n\u003cp\u003e“Go for it.”\u003c/p\u003e\n\u003cp\u003eHe lifted an eyebrow. “You sure?”\u003c/p\u003e\n\u003cp\u003e“Just go!” I laughed at his hesitance, then I screamed and scrambled for some support when he peeled out, kicking up dust behind us and burning rubber when we hit pavement. “Oh my God, you’re crazy.”\u003c/p\u003e\n\u003cp\u003e“You said I could do whatever I liked.” He gave one of those boys-and-their-toys laughs and pressed his foot harder against the gas. “Fuck, this thing can move.”\u003c/p\u003e\n\u003cp\u003eI threw back my head and joined him in his joy because it felt so freeing.\u003c/p\u003e\n\u003cp\u003eHe kept it at top speed for about a mile, and we reached 120 miles per hour before he decided to back it off. But the rush of speed was still flowing through both of us when he turned down another gravel road. “Damn that was fun,” he panted out, finding the opening of a field to pull into where a row of trees partially concealed us.\u003c/p\u003e\n\u003cp\u003eAfter he cut the engine, killing all the lights so we had nothing but the moonlight coming in through the windows, he turned to face me. So I turned to face him too. I could make out the pleased smile on his face as he took my hands. “Thanks for that. It was fun.”\u003c/p\u003e\n\u003cp\u003eAnything that involved him was fun in my book, so I merely shrugged. “It was my pleasure.”\u003c/p\u003e\n\u003cp\u003eHe watched me a few seconds longer and rubbed his thumb over the back of my hand before sighing. “God, I missed you. I missed you so fucking much it scared the shit out of me. And it was...it was like a great big miserable premonition of what my life would be like without you.”\u003c/p\u003e\n\u003cp\u003eI frowned, confused. “Without me?”\u003c/p\u003e\n\u003cp\u003eHe nodded and glanced out the front window. “Don’t you ever worry about that? Whenever something starts going too good for me, I always freak, thinking it’s about to be taken away.” Moonlight reflected all the concern on his face as he turned back to me. “And I don’t know what I’d do if I lost you.”\u003c/p\u003e\n\u003cp\u003e“Well, you’re not going to lose me,” I assured him, reaching across the seats to cup his face. “I’m a lot harder to get rid of than that.”\u003c/p\u003e\n\u003cp\u003e“Promise?” Taking my hands, he turned them over to kiss the palms, one at a time.\u003c/p\u003e\n\u003cp\u003e“Cross my heart.” Leaning forward to kiss him, I growled when the gear shifter and cup holders got in my way. “Let’s get in the back. I want to be able to cuddle with you.”\u003c/p\u003e\n\u003cp\u003eA lascivious grin crossed his face. “Ah, you want to break your new car in right, huh?”\u003c/p\u003e\n\u003cp\u003eI wiggled my eyebrows and giggled. “Something like that.” Instead of opening my door and getting into the back that way, I climbed between the two front seats, laughing the entire way.\u003c/p\u003e\n\u003cp\u003e“Mmm, nice view.” Knox’s hand landed on my backside while I was trying to squeeze my hips through, and I tumbled into the backseat with an umph.\u003c/p\u003e\n\u003cp\u003eUnable to control my laughter, I held my stomach and scooted to the side so he could get through.\u003c/p\u003e\n\u003cp\u003eHe immediately slammed his knee into the center console. “Ouch. Shit.”\u003c/p\u003e\n\u003cp\u003eI started to reach for him. “Are you okay?” But he was already fumbling his way through, and I had to dive aside to get out of his way.\u003c/p\u003e\n\u003cp\u003eChuckling and out of breath, he landed ungracefully beside me and then wiggled until he was sitting the correct way. Then he blew out some oxygen and answered, “Yeah, I’m good.”\u003c/p\u003e\n\u003cp\u003eI curled up to him and massaged his knee. “Want me to kiss it better?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “No, actually. I think I hurt my lip even more. Maybe you should kiss that instead.”\u003c/p\u003e\n\u003cp\u003eI slapped at his chest. “Liar.” He hadn’t bumped anything even remotely close to his face.\u003c/p\u003e\n\u003cp\u003eGrinning, he tugged me into his lap. “How about you kiss me there, anyway?”\u003c/p\u003e\n\u003cp\u003eSo I did. We shared nothing but slow drugging kisses for the next couple minutes. He grew hard under me, and I knew I was wet, but neither of us did anything about it.\u003c/p\u003e\n\u003cp\u003eAfter a long, satisfied sigh, he drew his lips from mine and pressed our foreheads together while he lazily rubbed my back. “Sometimes I wish I hadn’t fallen so hard for you. I wouldn’t worry so much, and I could just concentrate on the fun we have.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-111.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
