{"id":75747,"no":112,"title":"Page 112","content":"\u003cp\u003e“You don’t have to worry, Knox.” I kissed his cheek. “Even if we were temporarily separated, I’d always be with you.” Placing my hand to his chest, I gazed into his eyes with all the sincerity in my soul. “And I’d always find my way back to this.”\u003c/p\u003e\n\u003cp\u003eHe covered my hand with his and pressed them more firmly against his heart. “I keep thinking about how to make this work,” he admitted from a rusty voice. “You became the most important thing in my world this summer, and I only want the absolute best for you, but...what if I’m not the best thing for you?”\u003c/p\u003e\n\u003cp\u003e“You are,” I insisted. “God, you can’t even realize, probably because you didn’t know me before, but you’ve given me…I don’t even know how to explain it, but something has bloomed inside me since meeting you. I don’t feel like a worthless, self-conscious misfit anymore. It’s like you’ve awakened the real me, and that person is special.”\u003c/p\u003e\n\u003cp\u003e“Of course you’re special. You’re the most extraordinary person I know. I saw it the first time we ran into each other in the woods.”\u003c/p\u003e\n\u003cp\u003e“Well, I didn’t. I didn’t see anything at all remarkable about myself until you showed me what I could be. So don’t ever think you’re not what’s best for me. Okay?”\u003c/p\u003e\n\u003cp\u003eHe threaded his fingers through my hair and gazed into my eyes before saying, “Will you marry me?”\u003c/p\u003e\n\u003cp\u003eMy mouth fell open.\u003c/p\u003e\n\u003cp\u003eShaking his head, he quickly revised, “I mean, someday, way far in the future when we no longer have to worry about our families or school or any of that shit. When we’re older.”\u003c/p\u003e\n\u003cp\u003e“Yes,” I whispered, bobbing my head so hard I could’ve given myself whiplash. “Yes!” I leaned in to kiss him, but he caught my face, halting me, his eyes searching mine.\u003c/p\u003e\n\u003cp\u003e“Are you sure? It’s not going to be easy, and I have no idea how we’re going to manage it. But I’ve been thinking. I thought about us and how we could make this work the entire two weeks you were gone.”\u003c/p\u003e\n\u003cp\u003e“And?” I pressed, eager to hear what conclusion he’d come to.\u003c/p\u003e\n\u003cp\u003e“And I…I need a job, a decent job, something worthy enough. So…I know…I think I know what I want to be.”\u003c/p\u003e\n\u003cp\u003eI lit up, too excited to hear what he had to say. “What?”\u003c/p\u003e\n\u003cp\u003e“Well…I love our woods. I love plants and working with my hands, and just being surrounded by nature. I think...what do you think of, like, me running a tree nursery?”\u003c/p\u003e\n\u003cp\u003e“You want to own a tree nursery?” I wasn’t expecting an idea like this, but I liked it. I loved it, actually, and I could envision Knox in that kind of profession perfectly.\u003c/p\u003e\n\u003cp\u003eHe shrugged, looking suddenly bashful. “I know I’d probably have to work at one for a while, learn the trade, you know. But then, maybe after a couple years when I’d saved up some money...” He shrugged again. “Who knows? Maybe it’d actually work.”\u003c/p\u003e\n\u003cp\u003e“Of course it will.” A smile spread across my face. “And I could minor in business management, so I could help you with the legal paperwork part of it.”\u003c/p\u003e\n\u003cp\u003eHe glanced at me in surprise. “You don’t have to do that.”\u003c/p\u003e\n\u003cp\u003eI grasped his arm and shook. “But I want to. I want to be your partner in all things.”\u003c/p\u003e\n\u003cp\u003eHe interlaced our fingers. “I want that too.”\u003c/p\u003e\n\u003cp\u003eI leaned in toward him, my mouth reaching for his. Our lips meshed, and soon we were breathing hard and straining for each other.\u003c/p\u003e\n\u003cp\u003eBy the time his palm slipped under my shirt, I was so keyed up I think I could’ve come as soon as he touched me. “I still have the condom in my pocket,” I said into his ear.\u003c/p\u003e\n\u003cp\u003eHe groaned, his hips lurching up to press harder between my legs. “Jesus, City. You sure like to tempt me.”\u003c/p\u003e\n\u003cp\u003e“We’re going to be married, anyway,” I coaxed, spider-crawling my fingers down his abdomen. “It’s pretty much like we’re already husband and wife.”\u003c/p\u003e\n\u003cp\u003eHe didn’t stop me when I opened his jeans. Leaning his head back against the leather car seat, he panted as I pulled him into my hand. “Are you sure?” he finally asked. “You’re only sixteen. Once it’s done, you can’t ever be a virgin again. And I could last for years on third base. There’s no reason to rush.”\u003c/p\u003e\n\u003cp\u003eI pressed my forehead to his and pumped him harder, making him press up into my hand. “I want to share every possible thing there is to share with you, Knox Arrow Parker. Please make love with me.”\u003c/p\u003e\n\u003cp\u003eThe moment his resistance shattered, he kissed me hard and gripped my clothes, yanking my shirt off over my head. I reached behind me and undid my bra. He slipped the straps off my shoulders and kissed his way down my collarbone and to my breasts. When he sucked a nipple into his mouth, I clutched his head and whimpered. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-112.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
