{"id":75749,"no":114,"title":"Page 114","content":"\u003cp\u003eI slid my hands around to cup his buttocks. “Move anyway.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I want you to come with me.”\u003c/p\u003e\n\u003cp\u003e“Baby, I already came. It’s your turn.”\u003c/p\u003e\n\u003cp\u003eI could tell by his expression that he wanted to argue with me, but the urge to pump took over, and he pulled out before pushing back in. This time didn’t hurt at all, but it still felt…funny. Knox groaned and buried his face in my neck. “Oh...shit. You feel so good.”\u003c/p\u003e\n\u003cp\u003eI stroked the back of his hair and down his back. “I love touching your bare back. Have I ever told you how much I love touching you here…?” I ran my fingers over the back of him before sliding them over his taut buttocks and clutching him hard in my palms. “And here.”\u003c/p\u003e\n\u003cp\u003e“I love you, period.” He lifted his face to kiss me and began to thrust with more purpose. My inner muscles seemed to adjust to the repeated invasion, and the stretching actually became…nice, until—I sucked in a breath when he hit a spot that felt a lot better than nice.\u003c/p\u003e\n\u003cp\u003e“Oh. Do that again.”\u003c/p\u003e\n\u003cp\u003e“What? This?” He did it, with a little more intensity. I arched under him and moaned. He kissed me deeper. The moment our tongues mated, he slid a hand down and caught my clit between his fingers. The shock made me come.\u003c/p\u003e\n\u003cp\u003eKnox grunted, gripped my hair and followed me into the storm.\u003c/p\u003e\n\u003cp\u003eWe held each other, kissing through it and then breathing against each other’s necks when we needed air. Once he stilled inside me, and my body was done quaking, he brushed damp hair out of my face and kissed my cheek.\u003c/p\u003e\n\u003cp\u003eI grinned up at him and whispered, “Home run, baby.”\u003c/p\u003e\n\u003cp\u003eHe laughed and pressed his forehead to my shoulder. “I can’t believe we just did that.”\u003c/p\u003e\n\u003cp\u003e“Me neither.” I stroked his damp skin and kissed the side of his head, then his temple. His cheek. “But it was pretty cool, wasn’t it?\u003c/p\u003e\n\u003cp\u003e“If by cool, you mean the most amazing thing ever, then sure.” He looked up at me. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eI snorted. “If by okay, you mean absolutely wonderful, then sure.”\u003c/p\u003e\n\u003cp\u003eChuckling at my answer, he pulled out of me and began to sit up. “I’m probably squishing you.”\u003c/p\u003e\n\u003cp\u003eI wanted to tell him he was fine, I liked him right where he was. But okay, I did feel a bit squished. I sat up beside him, thinking I should feel embarrassed that we were sitting naked together side by side in the backseat of my new car, but I didn’t even experience a smidgeon of awkward shame.\u003c/p\u003e\n\u003cp\u003eLooking down at his lap, he made a strange sound in his throat. “Okay, my first used condom. What the hell do I do with this thing?”\u003c/p\u003e\n\u003cp\u003e“Umm…throw it out the window?”\u003c/p\u003e\n\u003cp\u003eHe went to pull it off as I stood up and leaned over the front seat to turn the car onto accessory and roll down the back window for him.\u003c/p\u003e\n\u003cp\u003e“Shit,” he hissed. “There’s blood on it. Are sure you’re okay?”\u003c/p\u003e\n\u003cp\u003eI plopped back down beside him, rolling my eyes. “It was my first time; there was supposed to be blood.”\u003c/p\u003e\n\u003cp\u003e“I know, but...I’m actually looking at the fucking blood now, and it’s...do you still hurt? How bad did it hurt? Don’t lie to me. Because if you’re not okay—”\u003c/p\u003e\n\u003cp\u003e“Knox.” I clasped his face in both hands and smiled into his eyes. “I am more than okay. I’m wonderful. And, no, it doesn’t hurt at all.”\u003c/p\u003e\n\u003cp\u003e“But it did?” he pressed, worry creasing his features.\u003c/p\u003e\n\u003cp\u003eI squinted thoughtfully and admitted, “For like half a second maybe, but then it felt so good, the little pinch of pain at first was worth it.”\u003c/p\u003e\n\u003cp\u003e“Truth?”\u003c/p\u003e\n\u003cp\u003e“Truth,” I assured.\u003c/p\u003e\n\u003cp\u003eHe kissed me once, and then flung the used condom out the window so he could grasp my face and kiss me deeper. “Thank you,” he said, pulling me into his lap. “Thank you for the best summer of my entire life. I look forward to sharing twenty more with you, and then twenty more after that.”\u003c/p\u003e\n\u003cp\u003e“What about winter, and fall and spring?”\u003c/p\u003e\n\u003cp\u003e“Those too. I can’t wait to spend every season with you.”\u003c/p\u003e\n\u003cp\u003eHe leaned in to kiss me again, but a light filled the backseat.\u003c/p\u003e\n\u003cp\u003eI blinked against the sudden brightness. “What—”\u003c/p\u003e\n\u003cp\u003e“Shit, shit, shit.” He shoved me off his legs. “A car’s coming!”\u003c/p\u003e\n\u003cp\u003e“Oh my God!” Totally not expecting that, I dove off him the rest of the way, covering my chest as I went.\u003c/p\u003e\n\u003cp\u003e“Clothes. Now,” he ordered, finding his boxers first thing and yanking them on.\u003c/p\u003e\n\u003cp\u003e“I can’t find anything,” I wailed, my panic making my head even more blurry and unable to find a single piece of my outfit. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-114.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
