{"id":75751,"no":116,"title":"Page 116","content":"\u003cp\u003eAnd even if I did get a handle on it, I’d still never be enough for her. I knew my City. She needed someone she could be completely open with, and someone who could be open with her. Those were the kinds of connections that made her bloom, and they were something I’d never again be able to provide. There was too much ugliness in me now. I could never bring that kind of ugly into her life.\u003c/p\u003e\n\u003cp\u003eI wasn’t able to finish the sandwich. I kind of wanted to preserve it.\u003c/p\u003e\n\u003cp\u003eWhen I left my room, I paused outside her door. I even lifted my hand to knock. But my knuckles hovered in front of the wood about ten seconds before I dropped them, and I hurried out of the apartment.\u003c/p\u003e\n\u003cp\u003eAt the bar, Asher and Noel were arguing over who would have to wait tables.\u003c/p\u003e\n\u003cp\u003e“Man, you always work the bar. Just give it to me tonight.”\u003c/p\u003e\n\u003cp\u003eNoel only snickered. “Stop being a pussy, Hart. So a horde of insane women want your body. Shouldn’t you be eating that shit up?”\u003c/p\u003e\n\u003cp\u003eAsher scowled. “You’re an ass.” He promptly turned to Mason. “Lowe, man—”\u003c/p\u003e\n\u003cp\u003e“No way. I gave up the bar for Parker last week. Not going to do it again.”\u003c/p\u003e\n\u003cp\u003e“Jesus, you guys suck, you know that?”\u003c/p\u003e\n\u003cp\u003e“Oh, quit your bawling, Vagina Boy.” Ten tossed an apron in Asher’s face. “A couple handsy chicks grabbing your junk aren’t going to kill you.”\u003c/p\u003e\n\u003cp\u003e“You suck too,” Asher muttered, even as he jerked his waist apron into place. “You’re going to be stuck waiting tables whether you like it or not,” he grumbled to me, probably hoping to put me into just as bad of a mood as he was in.\u003c/p\u003e\n\u003cp\u003eBut I just shrugged. Waiting tables actually didn’t bother me. I’d noticed last week that those guys made more in tips than working the bar, and that’s what I needed. I put on my apron and helped Asher and Ten prepare the customer area for business.\u003c/p\u003e\n\u003cp\u003eWhen Harper, the doorman, started letting people in, I concentrated on doing a good job. About half an hour into the shift, I stopped by the bar to put in an order for a table full of middle-aged men. Noel came over to me and muttered a curse under his breath.\u003c/p\u003e\n\u003cp\u003e“Shit, I should’ve let Hart have the bar. He really is getting mobbed.”\u003c/p\u003e\n\u003cp\u003eI glanced over, but all I saw was a swarm of women... in Incubus shirts. Harper had deserted the entrance and was trying to shove his way through to help, but he wasn’t making much progress.\u003c/p\u003e\n\u003cp\u003eSetting my tray on the countertop, I waded through the people, booming, “MOVE!” and probably scaring the shit out of about twenty women. “Get away from him. Now.”\u003c/p\u003e\n\u003cp\u003eFemales scattered like flies. I grabbed a dazed Asher by the upper arm and physically escorted him to the bar.\u003c/p\u003e\n\u003cp\u003e“Man, I love you so hard right now,” he told me, clinging as close to my side as possible without touching me.\u003c/p\u003e\n\u003cp\u003eWhen I glanced at him, he flushed and lifted his hands. “I mean, not that way. I still dig chicks, just... maybe not an entire room full of them at once.”\u003c/p\u003e\n\u003cp\u003eHe looked ridiculous with his shirt torn, hair mussed, about five shades of lipstick peppered across his face and mouth, and damn, was that a hickey on his neck?\u003c/p\u003e\n\u003cp\u003eI felt sorry for him. He’d just been trying to find one special girl; I could relate to that. This wasn’t how he should be repaid.\u003c/p\u003e\n\u003cp\u003e“I guess you owe me one,” was all I said.\u003c/p\u003e\n\u003cp\u003eHe grinned. “Or more like twenty.”\u003c/p\u003e\n\u003cp\u003eI shook my head and got him the rest of the way to the bar, where Noel was already moving out from behind the counter.\u003c/p\u003e\n\u003cp\u003e“Okay, Hart. You were right; I was wrong. Give me your apron; I’ll wait tables for the rest of the night.”\u003c/p\u003e\n\u003cp\u003eHart must’ve still been too shaken to say any told-you-so’s. He merely untied his apron, handed it over and jumped behind the bar.\u003c/p\u003e\n\u003cp\u003eThe rest of the shift was uneventful. While we were cleaning, Mason approached, though.\u003c/p\u003e\n\u003cp\u003eHe looked nervous, which made me stop sweeping to give him my full attention.\u003c/p\u003e\n\u003cp\u003e“So, uh...” He wiped a hand over his face and made eye contact only to look away again. “My girlfriend, uh, I mean, fiancée—Reese. Reese would like...she wants to meet you.”\u003c/p\u003e\n\u003cp\u003eI cocked an eyebrow, immediately suspicious. “Why?”\u003c/p\u003e\n\u003cp\u003eI swear he turned a little green. His gaze darted to me only to flash away again. “Well...” he said slowly. “I think she’d really rather explain that to you herself.”\u003c/p\u003e\n\u003cp\u003eI began to shake my head. This was just too eerie—his behavior, the strangeness of his request, everything. What the hell wasn’t he telling me?\u003c/p\u003e\n\u003cp\u003e“She just wants to thank you,” he said, finally turning his full gaze on me. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-116.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
