{"id":75753,"no":118,"title":"Page 118","content":"\u003cp\u003eSo I jerked upright, gasping in a breath, hoping it would bring reason and sanity to my brain. She stirred as I scrambled to the opposite side of the mattress.\u003c/p\u003e\n\u003cp\u003eAfter briefly opening her eyes, the blue in them extra bright this morning, and then closing them again before yawning and stretching, she mumbled, “’Morning.”\u003c/p\u003e\n\u003cp\u003e“’Morning,” I repeated, not sure why I was being so pleasant with her. I should be pissed; she was in my bed...without my permission. But I still wanted to climb on top of her and fuck her like crazy, so yeah...I couldn’t summon even an ounce of outraged anger. Instead I said, “You’re in my bed.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” She started to sit upright too and the sheet slid down to her lap, revealing her conservative nightshirt that still didn’t hide the sway of her braless breasts underneath. When her red bedhead hair tumbled over her shoulders, I almost lost it. Swear to God, I never wanted anyone as much as I wanted her right then. And there’d been many times six years ago when she’d tempted me to the brink.\u003c/p\u003e\n\u003cp\u003e“You had a nightmare,” she explained.\u003c/p\u003e\n\u003cp\u003eI shook my head. “You shouldn’t have come in here. I thrash a lot when I’m dreaming. I could’ve accidentally hit you.”\u003c/p\u003e\n\u003cp\u003eShe only smiled. “But you didn’t.”\u003c/p\u003e\n\u003cp\u003eI opened my mouth to argue that it was too risky when she added, “Eva said Julian and Skylar would crawl into bed with you every night, and you never accidentally hit either of them.”\u003c/p\u003e\n\u003cp\u003eI clenched my teeth, silently cursing Pick’s gossipy woman. “Thus the reason I moved out of there so quickly. Just because I hadn’t hurt them yet, didn’t mean I wouldn’t eventually.”\u003c/p\u003e\n\u003cp\u003e“Is that why you agreed to move in with me?” she asked, cocking her head thoughtfully to the side. “To protect the babies.”\u003c/p\u003e\n\u003cp\u003eI was actually more concerned with protecting her. But if she wanted to assume that was the case, I’d let her. “Don’t ever come in here in the middle of the night again. It’s not safe for you. I’m not some ten-year-old boy dreaming about his mommy. I don’t need you to give me a lucky rabbit foot, monster repellant, or any kind of security object. I can take care of myself.”\u003c/p\u003e\n\u003cp\u003e“Oh? Is that why you calmed down last night as soon I came into the room and touched you, why you immediately curled into me and clutched me like I was your own personal teddy bear? Is that why you whispered my name before falling back into a deep sleep? Because you don’t need me? Because you can take care of yourself?”\u003c/p\u003e\n\u003cp\u003eGritting my teeth, I clutched my head, not sure how to handle this woman. I kept pushing her away at every turn. Why wasn’t she getting the hint? “I...am...dangerous now. Christ, woman. How many times do I have to tell you to keep your distance?”\u003c/p\u003e\n\u003cp\u003e“Probably as many times as it’ll take for me to convince you I’m not afraid. I know you’ll never hurt me.”\u003c/p\u003e\n\u003cp\u003e“How the hell could you know that?” I threw my hands in the air, incredulous. “I don’t even know that. There’s a violence inside me that isn’t getting better.” Actually, since I’d started up at the gym, it had improved. A lot. But not nearly enough time had passed to safely say I was cured. “You have no idea what I’ve been through, or what it’s turned me into. So can you just believe me when I say I’m not safe?”\u003c/p\u003e\n\u003cp\u003e“Or…maybe if you could, I don’t know, tell me what you’ve been through, then I could understand.”\u003c/p\u003e\n\u003cp\u003eNo way in hell was I ever talking about that. Glaring at her, I growled. “I thought you said you weren’t going to push anymore.”\u003c/p\u003e\n\u003cp\u003e“Crap.” She squeezed her eyes shut and clenched her teeth. “You’re right. I’m sorry. I forgot.” With a relinquishing sigh, she began to climb off the bed. “I’ll leave.”\u003c/p\u003e\n\u003cp\u003eI hated to see her go, but this was what was best, so I bit my tongue and let her walk.\u003c/p\u003e\n\u003cp\u003eWhen she paused at the door and turned back, hope flared inside me. I have no idea why I was hopeful. I didn’t want her to push, unless...somewhere deep inside of me, a small part did want her to push, to dig in and find my demons, then save me by slaying them all.\u003c/p\u003e\n\u003cp\u003eBut, no. Mostly I wanted to keep them all as far away from her as possible.\u003c/p\u003e\n\u003cp\u003e“I just want to know one thing. I think I deserve to know one thing since, you know, you’re putting my life at risk and all by living here in such close quarters with me.”\u003c/p\u003e\n\u003cp\u003e“What?” I uttered, pretty sure I couldn’t answer whatever she asked.\u003c/p\u003e\n\u003cp\u003e“What did Pick say to change your mind and make you agree to share an apartment with me?” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-118.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
