{"id":75757,"no":122,"title":"Page 122","content":"\u003cp\u003eHe snorted, but gave a small nod before saying, “Fine.”\u003c/p\u003e\n\u003cp\u003e“I want it in writing,” I said.\u003c/p\u003e\n\u003cp\u003eWith another glare my way, he started for his desk. After ripping a sheet from his planner, his scrawled out a few words before showing them to me. I nodded, realizing this meant nothing. As soon as I was behind bars, he could rip it to shreds and never think of Bentley again. But on the off chance he might actually keep his word about her and ensure Felicity’s future, I was willing to keep mine.\u003c/p\u003e\n\u003cp\u003e“It’s settled then.” With a degrading sniff, he folded the sheet, tucked it into his top right drawer, then turned and strolled from the room.\u003c/p\u003e\n\u003cp\u003eI was left alone, sweating and worrying. Sick to my stomach and hoping he wasn’t going after City right that moment, I struggled against the zip ties, only succeeding in cutting my wrists deeper than I already had.\u003c/p\u003e\n\u003cp\u003e“Fuck,” I muttered, right before the door came open, and Felicity in a different outfit slipped into the room. “What…how’d you get in here?”\u003c/p\u003e\n\u003cp\u003eShe sent me a tremulous smile as she hurried forward. “I slipped past my mother when she thought I was in the bathroom crying. Are you okay?” Tears filled her eyes as she took in my face.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I assured her. “What about you? Your cheek’s already bruising. I can’t believe he fucking slapped you.”\u003c/p\u003e\n\u003cp\u003e“I’ll get over it.” Distracted, she knelt by my tied hands and bit her lip. “God, your wrists are bleeding. How dare they do this to you?” She popped to her feet and hurried to a large desk before yanking open drawer after drawer.\u003c/p\u003e\n\u003cp\u003e“What’re you doing? City?”\u003c/p\u003e\n\u003cp\u003eShe kept opening drawers. “I’m looking for some scissors to cut those damn things off.”\u003c/p\u003e\n\u003cp\u003e“No…Felicity, stop.” She paused and glanced at me. I shook my head. “It’s no use. The sheriff’s already on his way.”\u003c/p\u003e\n\u003cp\u003e“I know. That’s why we have to get you free now.”\u003c/p\u003e\n\u003cp\u003e“And then what?” I pressed quietly.\u003c/p\u003e\n\u003cp\u003eDesperation crossed her features. “Then we’ll get out of here. Together.”\u003c/p\u003e\n\u003cp\u003e“And go where? Do what?” When she couldn’t answer me, I shook my head. “We can’t run from this, City. What’s going to happen is going to happen. Just… come here, talk to me, stay until they arrive. Please.”\u003c/p\u003e\n\u003cp\u003eShe shut the last drawer she’d opened, and her chin trembled as a new batch of tears filled her eyes. “This is all my fault. If only I hadn’t pressured you into having sex.”\u003c/p\u003e\n\u003cp\u003e“Baby, don’t. Come here.”\u003c/p\u003e\n\u003cp\u003eShe slumped to me and sat on my knees before wrapping her arms around me and hugging me. I buried my face in her hair and inhaled a lungful of her scent. “This was not your fault. I wanted to do it as much as you did. I regret nothing. It was just bad luck that your brothers came along when they did.”\u003c/p\u003e\n\u003cp\u003e“No.” She shook her head and sucked in a sob. “That was my fault too. I told Garrett I was going to show my new car to my friend Ada. But I guess he actually pays more attention to my life than Max ever did. He knew I didn’t have a friend around here named that. So they came looking for me until they found us.”\u003c/p\u003e\n\u003cp\u003e“It’s not your fault,” I insisted, pressing my lips to her neck. “Even if I’d known they were going to show up when they did, I still wouldn’t have changed anything we ever did together. You said I was the best thing that ever happened to you. Well, you’re the best thing that ever happened to me, and I’m honored to have spent the time with you that I did.”\u003c/p\u003e\n\u003cp\u003eShe shook her head and sobbed harder against my shoulder. “Stop talking like this is the last time we’ll ever see each other.”\u003c/p\u003e\n\u003cp\u003eI couldn’t tell her she was wrong, because I had no idea if she was or not. So instead of issuing false reassurance, I kissed her cheek and murmured into her ear, “Hey, make me a promise.”\u003c/p\u003e\n\u003cp\u003eShe lifted her face; her blue eyes were so red and watery, it almost broke me. “Anything,” she swore.\u003c/p\u003e\n\u003cp\u003e“No matter what happens tonight, don’t ever change, okay? You are fun and sweet and amazing just the way you are. You make the world a better place because you always find the bright side. You are the bright side. And if I’m ever going to make it through this, I need to know you’re out there, still glowing and making the world bright.”\u003c/p\u003e\n\u003cp\u003eShe nodded solemnly. “Any other promises?”\u003c/p\u003e\n\u003cp\u003eI knew what she wanted me to say. She wanted me to ask her to wait on me. But I wanted her to live on and have a full, happy life.\u003c/p\u003e\n\u003cp\u003eSo I murmured, “Yeah. Don’t ever cut this amazing hair, okay?” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-122.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
