{"id":75770,"no":135,"title":"Page 135","content":"\u003cp\u003eAlarmed by the outburst, I slapped my rump back on the couch.\u003c/p\u003e\n\u003cp\u003eAfter taking a moment to control my shuddery breaths, I nodded. “Well...at least now I know why you have continued to push me away, and I don’t blame you at all. You never would’ve had to go through any of that if you’d never gotten mixed up with me. I would hate me right now if I were you, too.”\u003c/p\u003e\n\u003cp\u003e“How many times do I have to tell you,” he growled from between clenched teeth, “I never hated you. I never blamed you. If anything, it was the memory of you that helped me survive the worst times.”\u003c/p\u003e\n\u003cp\u003eMy heart sang as I pressed my hands against the swelling hope in my chest. “Well, you don’t need a memory anymore, Knox. I’m here, in the flesh, and I’m more than willing to keep helping you through this.”\u003c/p\u003e\n\u003cp\u003eBut he shook his head. “No way. My head is too fucked up. I don’t want you to have to—”\u003c/p\u003e\n\u003cp\u003e“I don’t care what’s in your head, damn it.” My voice rose with my frustration. “We have the rest of our lives to deal with that. It’s what’s in your heart that concerns me. And I know you still have feelings for me. Why do you keep fighting that?”\u003c/p\u003e\n\u003cp\u003e“Because it’s what’s in my fists that concerns me,” he roared, raising his balled hands to show me how his knuckles had cracked open and bled after hitting the wall. “Just one swing of these things, City, and I could kill you.”\u003c/p\u003e\n\u003cp\u003eI rose to my feet, and something in my calm, self-assured expression made uncertainty flicker in his eyes. He lurched to his feet as well.\u003c/p\u003e\n\u003cp\u003eWith my first step forward, he took one in reverse. “What’re you doing?”\u003c/p\u003e\n\u003cp\u003eI shook my head, not even sure myself. “You’re not swinging your fists now,” I said.\u003c/p\u003e\n\u003cp\u003eHe skidded backward some more, lifting his hands to ward me off. “Don’t fucking touch me,” he snapped, desperation making his brown eyes wild and glassy.\u003c/p\u003e\n\u003cp\u003eHis intimidation tactic worked. I jerked to a stop, sucking in a surprised breath. Then I let out a growl at my own stupidity because I knew—I knew—he wouldn’t have hurt me if I’d ignored his request, if I’d just reached out and smoothed my fingers over his cheek.\u003c/p\u003e\n\u003cp\u003eIt felt as if I was in the worst predicament of my life, and I’d just lost my one chance to do the right thing. Now I had no idea what to do. I was torn between wringing his neck for being so stubborn and hugging the hell out of him because he’d gone through hell. Except I’d blown my opportunity to touch him.\u003c/p\u003e\n\u003cp\u003eSo I just stood there like an idiot and started to cry again.\u003c/p\u003e\n\u003cp\u003eHe let out a pained sound and squeezed his eyes closed. “Stop it. Stop it right now.”\u003c/p\u003e\n\u003cp\u003e“Stop what?” I hiccupped. “Stop crying?”\u003c/p\u003e\n\u003cp\u003e“Yes! Stop fucking crying. I can’t take it.”\u003c/p\u003e\n\u003cp\u003eI stomped my foot. “No. I will not stop crying. I ache for you. And I will mourn what happened to you, what’s still happening to you, if I want to!”\u003c/p\u003e\n\u003cp\u003e“I’m going to lose it, City.” He turned so he couldn’t see my face. “I’m not fucking lying.”\u003c/p\u003e\n\u003cp\u003eI ground my teeth and glared at him. “Then lose it. Do something about all these tears if you don’t like them.”\u003c/p\u003e\n\u003cp\u003eHe zipped his attention my way and gaped at me, his shock momentarily ebbing his rage.\u003c/p\u003e\n\u003cp\u003e“Do something,” I begged, feeling my heartache drip down each cheek.\u003c/p\u003e\n\u003cp\u003eWhimpering, he clutched his head. But instead of coming toward me, he turned away and rushed for the door, leaving me alone to cry by myself.\u003c/p\u003e\n\u003cp\u003eA sob caught in my throat, and for a moment, I didn’t think I’d be able to breathe through it. Then the air came, and I shuddered with defeat.\u003c/p\u003e\n\u003cp\u003eHe’d just left me. I couldn’t believe he’d really leave me.\u003c/p\u003e\n\u003cp\u003eMy knees gave out, so I half-crumbled, half-sat on the floor. Then I curled into a fetal position on the carpet, hugging myself, my head about to explode from the pain throbbing between my temples.\u003c/p\u003e\n\u003cp\u003eThe door reopened so quietly I didn’t hear it. I didn’t even realize he’d returned until he growled, “God fucking damn it,” directly above me, and I nearly jumped out of my skin.\u003c/p\u003e\n\u003cp\u003eThe next thing I knew, his arms were sliding gently around me, warmth and muscle, before my cheek was pressed against a steel chest where his heartbeat thumped loudly in my ear.\u003c/p\u003e\n\u003cp\u003e“Knox,” I whispered.\u003c/p\u003e\n\u003cp\u003e“I’m right here,” he said as he lifted me, then carried me from the living room and into my bedroom. He only paused to toe off his shoes, then he crawled into bed with me still in his arms. As he lay down, he draped me on top of him, and I curled around him, hungry and desperate for this contact at long last. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-135.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
