{"id":75774,"no":139,"title":"Page 139","content":"\u003cp\u003eKeeping his eyes closed, he smiled broader. “Oh, I think he does.”\u003c/p\u003e\n\u003cp\u003e“Well then, a girl must do her duty properly.”\u003c/p\u003e\n\u003cp\u003eI slipped up onto his lap, straddling his morning wood until it slid right up against my slick folds. He arched up his hips and rumbled out a sound of approval. Once I was in position, I leaned down to kiss him. As soon as my lips touched his, I canted my hips and joined us together, urging his cock inside me.\u003c/p\u003e\n\u003cp\u003eHe gasped, his eyes flying open as he pushed his hips up again, piercing me fully. “Oh, God. Shit.”\u003c/p\u003e\n\u003cp\u003eI straightened upright with a satisfied grin on my face before I lifted my bottom and came back down on him, riding slowly. He grabbed my waist, clutching me hard as he gaped up at me from dazed brown eyes.\u003c/p\u003e\n\u003cp\u003e“What is this?” he asked, nearly going cross-eyed as I increased the pace. “The dirty version of Sleeping Beauty?”\u003c/p\u003e\n\u003cp\u003eI smiled. “Why not? Someone once told me everything was better when it was dirty.”\u003c/p\u003e\n\u003cp\u003e“Jesus, I was a genius.” He grunted and reared up under me. “Can we wake up this way every day?”\u003c/p\u003e\n\u003cp\u003eBiting my lip, as I’m sure my face filled with smoky pleasure, I leaned over him to grasp his shoulders. “I think I can be persuaded to do this in one position or another each and every morning.”\u003c/p\u003e\n\u003cp\u003e“Good.” Gripping me harder, he flipped me over onto my back so he could come over me and sit up to look down before skimming his hands up over my breasts. “Because I’m pretty eager to try every position ever invented.”\u003c/p\u003e\n\u003cp\u003eHe surged deeper, and I couldn’t hold back with his hands igniting my nipples and his cock burrowed to my core. I started to come.\u003c/p\u003e\n\u003cp\u003eHe hissed out a breath. “Damn it, I can’t hold back when you do that.”\u003c/p\u003e\n\u003cp\u003e“Sorry, not sorry.”\u003c/p\u003e\n\u003cp\u003eI relished watching his eyes go unfocused.\u003c/p\u003e\n\u003cp\u003eThen his mouth dropped open and he groaned through his release.\u003c/p\u003e\n\u003cp\u003eIt didn’t take me long to realize he wasn’t lying about wanting to try sex in every position. I just wasn’t aware he meant all in one day. But as soon as I announced I was hungry, he pulled his T-shirt on me, dragged his boxers onto himself and carried me into the kitchen, where he sat me gently on the counter. Then, as I watched, he fixed my coffee for me just the way I liked it. Sipping, I watched him start breakfast, breaking eggs into the skillet. But as soon as they were finished and on a plate, he took one look at me still innocently drinking my coffee, and he shook his head, prowling my way.\u003c/p\u003e\n\u003cp\u003e“Why do you have to look so good, sitting there like that?” Skimming the shirt I wore up to the tops of my thighs, he stepped between my legs and gripped my hips to draw me to the edge of the counter. I suddenly realized why he hadn’t offered me panties—only a shirt—when he freed himself of his boxers and pushed inside me.\u003c/p\u003e\n\u003cp\u003eAnd God, the orgasm that followed, was...nice.\u003c/p\u003e\n\u003cp\u003eAfter that, he showered with me, where he took me against the wet tiled wall.\u003c/p\u003e\n\u003cp\u003eThe cutest part was his critique following each round. They all had their own perks, he claimed, but he wasn’t a fan of banging his knee against the kitchen cabinets when he was about to come, he claimed shower water really wasn’t helpful with lubrication at all, and he didn’t like not being able to see my eyes when he bent me over the couch to take me from behind. I loved being a part of it as he experienced each position for the first time. And, yeah, I had to agree with him when he concluded the bed was the best place.\u003c/p\u003e\n\u003cp\u003eSo we found ourselves back on the mattress in my room, where we took a nap for a while until I woke up in the late afternoon to him idly strumming his fingers down my back.\u003c/p\u003e\n\u003cp\u003eHe must’ve sensed I was awake because he asked, “Do you have to work tonight?”\u003c/p\u003e\n\u003cp\u003e“Mmm.” I stretched and rolled his way. “No.”\u003c/p\u003e\n\u003cp\u003e“Good.” He settled onto his side so he could face me too. Propping his cheek on his hand, he watched me with the most tender expression, as if he couldn’t believe he was really here with me.\u003c/p\u003e\n\u003cp\u003eI couldn’t quite believe it myself, and I feared how temporary it might be. Reaching up, I traced his dark eyebrows with my fingers. “So I can’t help but notice you haven’t tried to push me away or keep me at a distance all day. Dare I hope this means...?” I lifted my eyebrows and sent him a grin.\u003c/p\u003e\n\u003cp\u003eHe sighed and ran a hand up my thigh. “I’ve come to realize resisting you is futile.”\u003c/p\u003e\n\u003cp\u003eI scowled. “But you still think you’re a threat to me?”\u003c/p\u003e\n\u003cp\u003eHe glanced up at the ceiling, looking torn. “I don’t know. You’ve seen the way I can destroy a room.”\u003c/p\u003e\n\u003cp\u003e“A room. Property,” I clarified. “Not people.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-139.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
