{"id":75649,"no":14,"title":"Page 14","content":"\u003cp\u003e“You better go!” I hissed as loudly as possible.\u003c/p\u003e\n\u003cp\u003eKnox lurched into gear and started to race off, only to stumble to a stop a few seconds later and whirl back as he looked up at my window.\u003c/p\u003e\n\u003cp\u003eWhen our gazes met, I shook my head, confused.\u003c/p\u003e\n\u003cp\u003eWhat the heck was he doing? I waved him away, panicking, sure he’d be caught any second.\u003c/p\u003e\n\u003cp\u003eBut he only sent me a short, respectful nod before mouthing the words, “Thank you.”\u003c/p\u003e\n\u003cp\u003eThen he was gone again, dashing toward the woods.\u003c/p\u003e\n\u003cp\u003eBlood sprinted through my veins with a fervor that made me want to grab a pillow off my bed, scream into it as loudly as possible, and jump in an overexcited circle around my room.\u003c/p\u003e\n\u003cp\u003eIf my first encounter with Knox Parker hadn’t left me with the biggest crush ever, then this second one certainly had.\u003c/p\u003e\n\u003cp\u003eFresh blood was surprisingly easy to clean from leather seats. Just a quick wipe down with warm water, and boom, it looked as good as new. Thank God I hadn’t waited around for it to dry, though. That could’ve been a bitch.\u003c/p\u003e\n\u003cp\u003eSpending most of the twenty bucks and eleven cents I had on me, I stopped in at the first car wash I saw, and cleaned and vacuumed the Lexus inside and out. Then I drove it back to St. John’s, where I sat in the driver’s seat with my fingers wrapped around the steering wheel, wondering how I was going to get the keys back to their owner, and then wondering what the hell I was supposed to do after that.\u003c/p\u003e\n\u003cp\u003eSomeone at the hospital had assured me they would contact the pregnant woman’s next of kin, so I didn’t even have finding her husband to look forward to anymore.\u003c/p\u003e\n\u003cp\u003eI had no idea where my family was, no idea where to look for them, or where to go, or what to do. I was broke, homeless, unemployed and didn’t have a friend left in the world, it seemed.\u003c/p\u003e\n\u003cp\u003eThe panic of that reality started to swamp me, so I focused on the one task I did have. I needed to get this car back to its owner, except I couldn’t ask about her at the desk. I’d never gotten her name.\u003c/p\u003e\n\u003cp\u003eMaybe there was only one pregnant girl in the maternity ward.\u003c/p\u003e\n\u003cp\u003eOr maybe there were dozens.\u003c/p\u003e\n\u003cp\u003eI wondered if she had something with her name on it in her car. When I glanced at the glove compartment, I winced, not wanting to intrude on her privacy. But fuck, I needed to get the keys back to her somehow. So I reached over and pulled open the little door. After shuffling through the owner’s manual and a couple fast food restaurant napkins, I found her registration and pulled it out.\u003c/p\u003e\n\u003cp\u003e“Zoey Hamilton,” I murmured aloud, staring out the front windshield, before I returned her paperwork to the glove compartment.\u003c/p\u003e\n\u003cp\u003eOkay, so I needed to find Zoey Hamilton, or more likely, her husband Quinn Hamilton, since I was sure Zoey was currently occupied. The name Quinn Hamilton sounded vaguely familiar, but I couldn’t place where I’d heard it before, so I shrugged and forgot about it.\u003c/p\u003e\n\u003cp\u003eFind Quinn.\u003c/p\u003e\n\u003cp\u003eI could do that.\u003c/p\u003e\n\u003cp\u003eI stepped out of the car and shut the door. As I was pocketing the keys and wondering where the hell the maternity ward was in this place, someone shouted, “Hey!”\u003c/p\u003e\n\u003cp\u003eWithout giving the call any notice, I stepped toward the hospital but that voice yelled again, closer this time. “Hey, fucker! I’m talking to you.”\u003c/p\u003e\n\u003cp\u003eFinally, I glanced over to see some guy racing toward me, looking furious, with another man hot on his heels. The one in the lead had a head full of dark, messy hair and half his face was scarred, more scarred than the single slash mark bisecting my eyebrow and passing over my cheekbone. The one behind him was full of tattoos and face metal.\u003c/p\u003e\n\u003cp\u003e“What the fuck are you doing with this car?” Scarface demanded.\u003c/p\u003e\n\u003cp\u003eI glanced at the Lexus, and then back to him.\u003c/p\u003e\n\u003cp\u003e“Are you Quinn?”\u003c/p\u003e\n\u003cp\u003eA strange depression claimed me. I didn’t want him to be Quinn. I didn’t want to be done with my task yet. It was the only thing I had going for me. Besides, I’d kind of wanted to make sure Zoey and her baby made it through okay. Hanging around the waiting room with her keys seemed like the best excuse I had for sticking around.\u003c/p\u003e\n\u003cp\u003e“Do I look like Quinn?” the guy asked, scowling hard as he set his hands on his hips.\u003c/p\u003e\n\u003cp\u003eSince I’d never met Quinn, I had no idea what he looked like.\u003c/p\u003e\n\u003cp\u003eI frowned back. “Honestly, you look like a dick to me.”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed as he took an intimidating step forward. “And you look like a fucking dead man.”\u003c/p\u003e\n\u003cp\u003eI sighed, not really into the idea of getting into a brawl when I hadn’t even been released from the pen a day.\u003c/p\u003e\n\u003cp\u003eThe idiot was probably half a head shorter than me, too. But that didn’t seem to bother him. He cracked his knuckles, and I tensed, ready to throw down if he took a swing. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-14.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
