{"id":75777,"no":142,"title":"Page 142","content":"\u003cp\u003eI glanced between Noel and Ten, but they only sneered at each other before turning their attention to their women. Up on the stage, Asher was setting up for the band, but he seemed to be the only member who’d arrived yet.\u003c/p\u003e\n\u003cp\u003eI turned back to my two coworkers. Noel and Ten were back to chatting like best friends, as if they hadn’t just about broken into a fight. City was readying a table near Aspen so the two women could talk and laugh, and the other two waitresses were filling tables with condiments.\u003c/p\u003e\n\u003cp\u003e“What’re you two doing here, anyway?” I asked the guys. “I thought I was working with Mason tonight.”\u003c/p\u003e\n\u003cp\u003eMason chose that moment to exit the back hall with Pick.\u003c/p\u003e\n\u003cp\u003e“You are,” Ten answered, slugging my arm. “The rest of us are just here to watch dumb ass’s show.”\u003c/p\u003e\n\u003cp\u003e“I heard that,” Asher yelled, flipping him off.\u003c/p\u003e\n\u003cp\u003e“You were supposed to,” Ten called back, sending forth his own bird. “And you better make it good tonight. I could be at home, seducing my way into Caroline’s panties right now.”\u003c/p\u003e\n\u003cp\u003e“Fucker,” Noel muttered.\u003c/p\u003e\n\u003cp\u003eWhen Pick and Mason stopped talking between the two of them, Mason joined me behind the counter and paused, sending me a wary cringe. Then he lifted his hands. “Okay, just tell me now, on a scale of one to ten, how painfully are you going to kill me?”\u003c/p\u003e\n\u003cp\u003eI hadn’t seen him since learning what all he had revealed to City. But maybe a week of time had helped me get over it. Or maybe something else entirely had helped me get over it. I glanced at the redhead who watched us from Aspen’s side.\u003c/p\u003e\n\u003cp\u003eWhen I turned back to Mason, I shrugged. I could’ve gotten pissed and jacked him in the jaw. But I just couldn’t summon the anger. “It turned out okay,” I admitted before pointing at him threateningly. “But don’t ever spring shit like that on me again.”\u003c/p\u003e\n\u003cp\u003e“Oh, you don’t even have to worry about that,” he assured me quickly. “Never again.”\u003c/p\u003e\n\u003cp\u003e“And don’t tell Felicity a fucking thing that should be my place to tell her.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Right. Got it.”\u003c/p\u003e\n\u003cp\u003e“Good.” I grunted and got to work.\u003c/p\u003e\n\u003cp\u003ePick dropped by right before we opened to make sure we were ready. He paused in front of me and let out a self-satisfied smile. “Damn, I love it when I’m right,” he murmured before strolling away and stopping by City to say something to her. I scowled after him, wondering if I really did have some kind of after-sex glow going on.\u003c/p\u003e\n\u003cp\u003eThe other band members didn’t show for their gig until after the doors had been opened and customers started to spill in. I caught sight of Rock—never more to be considered Rocket to me—on stage, but he didn’t even glance my way. Noel caught my eye when he wanted to order some refills for him and his wife, though.\u003c/p\u003e\n\u003cp\u003eOnce I delivered their drinks, he waylaid me by clearing his throat. “So…Aspen says Felicity’s been happier lately then she’s ever seen her.”\u003c/p\u003e\n\u003cp\u003e“Okay.” I arched my eyebrows, waiting for him to get to his point.\u003c/p\u003e\n\u003cp\u003eHe growled out a sigh and made a face. “So maybe Pick knew what he was doing when he pushed you two at each other,” he admitted. Then he shrugged. “All I know is that a happier Felicity makes a happier Aspen, and that…” He wiggled his eyebrows, “Makes for a very happy Noel.”\u003c/p\u003e\n\u003cp\u003eOh, brother. “Well, that’s what I’m here for,” I deadpanned. “To improve your sex life.”\u003c/p\u003e\n\u003cp\u003e“Shut up,” he muttered, scowling. “Just keep doing whatever the fuck you’re doing. All right?”\u003c/p\u003e\n\u003cp\u003e“Gladly,” I murmured as he walked away. I turned to find City in the crowd, but a pair of laughing women plopped themselves onto the stool in front of me, controlling my attention.\u003c/p\u003e\n\u003cp\u003e“Knox!” they cheered in unison.\u003c/p\u003e\n\u003cp\u003eI blinked at Eva and Reese, finally seeing the similarities between them. Pick had said they were first cousins, but you couldn’t have proven it to me until I saw them side-by-side, grinning at me from the same color of blue eyes.\u003c/p\u003e\n\u003cp\u003e“Where did you two come from?”\u003c/p\u003e\n\u003cp\u003e“We were gossiping in Pick’s office,” Eva answered before she reached out and grasped my forearm. “How have you been, handsome?”\u003c/p\u003e\n\u003cp\u003eFrom the pity in her gaze, I realized she knew everything. I sent a sharp accusing glance to her cousin for being such a gossip. But Reese only shrugged, and not very apologetically.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I offered, carefully tugging my arm free.\u003c/p\u003e\n\u003cp\u003e“Good. You know, you really need to stop by the apartment again sometime. The kiddos have been asking about you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-142.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
