{"id":75654,"no":19,"title":"Page 19","content":"\u003cp\u003eThree days later, I hit pay dirt when I saw a form slipping stealthily through the trees toward me.\u003c/p\u003e\n\u003cp\u003eMy heart leapt into my throat.\u003c/p\u003e\n\u003cp\u003eHe’d come back.\u003c/p\u003e\n\u003cp\u003eHe didn’t see me, so I slunk behind a tree and slipped in behind him as soon as he passed. Exhilarated by his nearness, I bit my lip to contain my grin, but it escaped anyway. Right before he left the canopy of the woods and could step into the clearing that started our lawn, I cleared my throat.\u003c/p\u003e\n\u003cp\u003eStartled, he spun around and crouched, lifting his hands in a defensive manner. One fist was full with a rank, used diaper.\u003c/p\u003e\n\u003cp\u003eHis ninja stance looked ridiculous with that clutched in his death grip. Slapping my hand over my mouth, I blurted out a laugh. “I swear, if you use that diaper against me, I’ll never forgive you.”\u003c/p\u003e\n\u003cp\u003e“Holy shit, Felicity.” Shoulders falling, he dropped his hands—and that diaper—down to his side. Then he straightened to his full height. “You scared the fuck out of me.”\u003c/p\u003e\n\u003cp\u003eI continued to grin. “Yeah, well, I think you would’ve been more scared this evening if the sheriff showed up on your front porch, because he set up a spy cam in Garrett’s room. Next time you step foot in there, with one of those—” I tipped my chin toward the diaper, “you’ll be caught on camera.”\u003c/p\u003e\n\u003cp\u003eHe breathed a curse under his breath and immediately let the diaper fall to the ground by his feet. After a wrinkle of his brows, though, he sent me a suspicious frown. “Are you playing me right now? Did they really set up a spy cam?”\u003c/p\u003e\n\u003cp\u003eI scowled back and set my hands on my hips. “Feel free to go inside and find out for yourself if I’m lying.”\u003c/p\u003e\n\u003cp\u003eKnox studied me a second longer. Then he blew out a breath and ran his hands through his hair. After glancing longingly toward my house, as if the urge to vandalize Garrett’s bed was more than he could take, he turned back to me. “Why do you keep helping me, saving me from getting caught?”\u003c/p\u003e\n\u003cp\u003eThe question caught me off guard.\u003c/p\u003e\n\u003cp\u003e“Be-because...” I shrugged and glanced away. I couldn’t tell him it was because he was pretty; that was a stupid reason. Except it kind of was the reason.\u003c/p\u003e\n\u003cp\u003eGod, I was such an idiot.\u003c/p\u003e\n\u003cp\u003e“I need to show you something,” I blurted instead as I ripped my Kindle from the book bag I had strapped over my shoulder, where I’d housed snacks and drinks and stories to help me pass the time while I’d been playing stakeout and waiting for him to show.\u003c/p\u003e\n\u003cp\u003eAs I turned it on and flipped my way into the photo file, Knox wandered closer until I could smell his musky, apple boy scent. My fingers fumbled. I cleared my throat and finally scrolled to the picture I was seeking.\u003c/p\u003e\n\u003cp\u003e“Here.” I pressed on it to enlarge it.\u003c/p\u003e\n\u003cp\u003eKnox frowned and took the Kindle from my hand. “How’d you get a picture of Bentley?”\u003c/p\u003e\n\u003cp\u003e“Bentley?” After a second of confused frowning, I gasped. “You mean, the baby’s name is Bentley?” When I made a face, he glanced up at me, lifting his eyebrows.\u003c/p\u003e\n\u003cp\u003eI cleared my throat and immediately tried to soften my expression.\u003c/p\u003e\n\u003cp\u003eHe watched me with an amused smirk.\u003c/p\u003e\n\u003cp\u003e“Bentley,” I repeated again, much calmer this time. “That’s...” I wanted to say something positive, but I’d never heard of anyone naming a girl Bentley, and to me, it sounded strange.\u003c/p\u003e\n\u003cp\u003eKnox’s lips twitched as he recognized my dilemma and loved my distress. “Mercy thought it should be a car name, since she’s Mercedes.”\u003c/p\u003e\n\u003cp\u003eI nodded dumbly. “Well, I guess it’s good she didn’t go with Lamborghini or Porsche, or...Ferrari.”\u003c/p\u003e\n\u003cp\u003eHis eyebrows arched. “So you think Bentley is actually better than Lamborghini, Porsche, and...Ferrari?”\u003c/p\u003e\n\u003cp\u003eWhen it struck me that he wasn’t a big fan of the name either, I burst into a relieved smile and had to admit, “Not really.”\u003c/p\u003e\n\u003cp\u003eHe laughed softly. “Yeah, I give her crap about the name daily.”\u003c/p\u003e\n\u003cp\u003eGeez, why did he have to look so good when he smiled?\u003c/p\u003e\n\u003cp\u003e“Do you really have brothers named Cobra and Speed?” I asked, just to keep him talking and maybe smiling some more.\u003c/p\u003e\n\u003cp\u003eHis laugh grew louder as he threw his head back. “Unfortunately, yes. There’s also Hash and Rocket.”\u003c/p\u003e\n\u003cp\u003e“Wow. You have the most normal name of the group.”\u003c/p\u003e\n\u003cp\u003eEyes glittering with amusement, he shook his head. “Yeah, well my middle name’s—”\u003c/p\u003e\n\u003cp\u003e“Arrow,” I murmured before I could stop myself.\u003c/p\u003e\n\u003cp\u003eWhen he pulled back in surprise, my eyes flashed wide. “I mean...” Oh my God. I was trapped. Now he knew I was a creepy stalker who’d hunted up his middle name. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-19.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
