{"id":75656,"no":21,"title":"Page 21","content":"\u003cp\u003eWith a sniff, Knox reached for my hair again. “That’s not such a deep, dark confession. I’m ashamed of being a Parker damn near every day.”\u003c/p\u003e\n\u003cp\u003eMeeting his gaze, I shook my head solemnly. “Yet you’ve snuck over here three times to get vengeance for your sister’s honor.”\u003c/p\u003e\n\u003cp\u003eHe shrugged and focused his attention on slowly sliding his finger down one glistening red lock. “I get what you’re saying. They’re our families. Flaws and all, they’re ours, and they’re the only one we’re ever going to get. So, we naturally want to feel loyal toward them. But you also have to admit it’s okay to be disappointed when they let us down. And you don’t always have to agree or follow what they say or do.”\u003c/p\u003e\n\u003cp\u003eWhen his brown gaze lifted to meet mine, I expelled a breath I hadn’t even known I’d been holding. “Good point,” I whispered. Then I realized something. With a flash of clarity, I blurted, “Bentley’s my family.”\u003c/p\u003e\n\u003cp\u003eHe dropped my hair from his hands and frowned, almost suspiciously. “Okay, yeah. I guess. Your point?”\u003c/p\u003e\n\u003cp\u003eI straightened my back. “The rest of my...relatives might not claim her, but I’m going to.” Except, I wasn’t sure how. I’d probably never see that little redheaded baby again, unless... I tilted my head to the side. “Hey... Do you think...?”\u003c/p\u003e\n\u003cp\u003eI flushed, knowing it was an impossible request.\u003c/p\u003e\n\u003cp\u003e“What?” he asked, shifting closer.\u003c/p\u003e\n\u003cp\u003e“Nothing. I just...I want to see her again. I mean, can I... I don’t know.” Feeling like the idiot I was, I set my hand against my forehead and began to turn away, but Knox’s voice stopped me.\u003c/p\u003e\n\u003cp\u003e“You want me to set you up with an introduction with Miss Bentley? Without anyone else knowing about it?”\u003c/p\u003e\n\u003cp\u003eI whirled back to him, hopeful. “Do you think that’s possible?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I don’t see why not. I could say I was taking her outside for a walk or something. Mercy would be grateful for a break. Then you could just meet us in the woods.”\u003c/p\u003e\n\u003cp\u003eI tucked the piece of hair he’d been playing with behind my ear. “Really?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Sure.”\u003c/p\u003e\n\u003cp\u003eMy heart began to gallop. I was setting up a rendezvous meeting with Knox Parker. Yeah, there’d be a baby present, but still...it was too exciting to handle.\u003c/p\u003e\n\u003cp\u003eI bobbed my head. “Okay, that sounds...that sounds great. Thank you.”\u003c/p\u003e\n\u003cp\u003eHe nodded as well. “No problem. Does this afternoon work for you?” When I nodded again, he grinned. “Cool. We could meet, I don’t know, by the tree where we first ran into each other.”\u003c/p\u003e\n\u003cp\u003eHe remembered the tree where we’d met? Aww. Okay, fine, it’d only been a few weeks ago. Of course he’d remember the place where he’d pinned a girl to keep her from screaming to her brothers and alerting them of his presence so they didn’t kill him.\u003c/p\u003e\n\u003cp\u003eBut still...he remembered!\u003c/p\u003e\n\u003cp\u003e“Sounds like a plan,” I answered, sounding way too casual for how much I was really flipping out inside. “I’ll see you there.”\u003c/p\u003e\n\u003cp\u003eSo, I went home with Pick Ryan.\u003c/p\u003e\n\u003cp\u003eIn high school, I’d always felt sorry for the guy. Everyone knew the story of how he’d been abandoned at the hospital by his birth mother when he was born. He’d never known anything but foster care, and he’d always seemed to get the worst possible luck in caregivers.\u003c/p\u003e\n\u003cp\u003eMy family had been poor, my father a no-account drunk, and my mother was hardly ever around because she worked too hard to bring in the money. We kids had run wild and rarely went anywhere with clean, neatly kept clothes. But we’d had each other, and that counted for something. Pick Ryan hadn’t even had that.\u003c/p\u003e\n\u003cp\u003eYet, here I was sitting in the passenger seat of his classic monster car, relying on him for my next meal and room and board.\u003c/p\u003e\n\u003cp\u003eBecause now I was the one who had nothing.\u003c/p\u003e\n\u003cp\u003eIt felt strange to think those words. Nothing. No mother. No father. No sisters or brothers. My entire family... Gone.\u003c/p\u003e\n\u003cp\u003eChest heaving, I clenched my suddenly trembling hands into fists in my lap and tried not to think about my mother or sister, or baby Bentley trapped inside our house, burning to death. But maybe the flames hadn’t taken them. Yeah, the smoke had probably killed them first, cutting off their air supply and slowly suffocating—\u003c/p\u003e\n\u003cp\u003eOkay, that didn’t help. Sweat slipped down my temple and I had to shift in my seat of Pick’s suddenly cramped car.\u003c/p\u003e\n\u003cp\u003eI wondered if they’d died in their sleep without realizing what was happening, or if they’d been awake, screaming, begging for someone to save them.\u003c/p\u003e\n\u003cp\u003e“So, you got a kid?” I blurted, glancing toward Pick. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-21.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
