{"id":75661,"no":26,"title":"Page 26","content":"\u003cp\u003eWhen Pick pulled away, he waved at me. “We’ll talk work schedules when I get back.”\u003c/p\u003e\n\u003cp\u003eAfter he left, I was still too leery to take a breath. I couldn’t figure out why he hadn’t wanted Eva to go somewhere where he didn’t like one of his waitress’s boyfriends, but he hadn’t thought twice about leaving her here alone with me.\u003c/p\u003e\n\u003cp\u003e“Pick is a great judge of character,” Eva said, making me jump.\u003c/p\u003e\n\u003cp\u003eWondering if I’d said something aloud or she was just reading my mind, I glanced at her suspiciously. She sent me a soft smile. “I swear, I can smell the tension oozing off you. You didn’t want to be left alone with us, but don’t worry, I’ll stop bothering you and asking you a load of questions. Okay?”\u003c/p\u003e\n\u003cp\u003eI wanted to tell her she could ask anything she wanted to. This was her home; she had a right to know what kind of person was staying in it. But I was too relieved for a reprieve to voice any of that.\u003c/p\u003e\n\u003cp\u003e“I will put you to work as soon as you’re finished eating, though.”\u003c/p\u003e\n\u003cp\u003eAnd that’s what she did. After my soup and grilled cheese sandwich were gone, she held Julian and instructed me as to which boxes to carry and where to take them.\u003c/p\u003e\n\u003cp\u003eAbout the time I finished, Julian fell asleep on her shoulder and Skylar woke from her nap. After putting one to bed and carrying the other into the living room, she sent me an exhausted sigh. “Believe it or not, once upon a time I had them on a schedule where they slept at the same time, but not anymore.”\u003c/p\u003e\n\u003cp\u003eI tried to see my own mother in her, perpetually exhausted, too busy to sit and just relax. She’d always looked aged beyond her years, and sad. So freaking sad. Eva didn’t seem sad, though. There was an energy and youth about her that told me she thrived off the life she had.\u003c/p\u003e\n\u003cp\u003eI opened my mouth to tell her it seemed as if she had mothering down to a fine art, but the front door opened and Pick returned.\u003c/p\u003e\n\u003cp\u003e“Hey.” Eva met him there with a kiss. “How’d she take it?”\u003c/p\u003e\n\u003cp\u003ePick sighed, his shoulders sagging. “She wasn’t there. Some other woman answered the door, and apparently…” Pick glanced at me. “My waitress no longer lives there.”\u003c/p\u003e\n\u003cp\u003eWith a gasp, Eva shook her head. “Since when?”\u003c/p\u003e\n\u003cp\u003ePick shrugged. “No idea. I didn’t stick around to find out.” Growling out his impatience, he paced further into the room and ran his hand through his hair, only to pause when he caught sight of me watching him.\u003c/p\u003e\n\u003cp\u003eEva came up behind him and grasped his arm. “When’s the next time she’s scheduled to work?”\u003c/p\u003e\n\u003cp\u003e“Friday,” Pick answered, keeping his gaze on me.\u003c/p\u003e\n\u003cp\u003e“Do you think she’s okay?”\u003c/p\u003e\n\u003cp\u003e“She’d better be.” He hitched his chin at me. “I think we’ll start you at the bar tomorrow. It’s kind of an initiation rite to begin our new bartenders on ladies’ night, anyway.” His grin was secretive and amused, which made me narrow my eyes, but I shrugged, because it didn’t matter to me which night I started. I was actually restless to start as soon as possible. The sooner I made some money, the sooner I could get out of their hair.\u003c/p\u003e\n\u003cp\u003eThe rest of the night passed. Both kids scurried around, providing some entertainment. And Pick talked, updating me on people we both remembered from high school, except he never shared a single detail about the only person I really wanted to know about. And I refused to ask about her, because it was best if I never learned where or how she’d turned out.\u003c/p\u003e\n\u003cp\u003eBut still, I wanted to know, and it itched at me that he didn’t even mention her, didn’t volunteer one stray crumb of information.\u003c/p\u003e\n\u003cp\u003eEva dug up some old black T-shirts of Pick’s from back when he was a bartender at the very club he now owned. They were too tight on me, but we figured they’d do until I could get my own set of clothes.\u003c/p\u003e\n\u003cp\u003eThen Pick did an internet search on my brothers. We didn’t find the location of any living Parker I was related to, but he did find out Speed had been the one to die in the fire, and Hash had overdosed on cocaine.\u003c/p\u003e\n\u003cp\u003eWhen I went to bed that night, tucked away in Spiderman sheets, I couldn’t stop thinking about my brothers, my sister, Bentley. My parents. I wondered where Rocket and Cobra were and worried about how painfully the others had died. When I finally fell into a restless sleep, blood and sirens and smoke filled my head. My mother and sister screaming for help. My father staring into the headlights of an oncoming train. And the root of all my nightmares, the voice in my head saying, “I’ve been waiting months to get my hands on your sweet ass again, Parker.”\u003c/p\u003e\n\u003cp\u003eI woke mid-moan, thrashing on the single-sized bed and soaking it with sweat. Once I realized where I was, I rolled flat on my back and stared up at the glowing stars tacked to the ceiling until my breathing calmed. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-26.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
