{"id":75664,"no":29,"title":"Page 29","content":"\u003cp\u003eI didn’t know what to say. Instinctively, I wanted to reassure him that I wasn’t offended, but I kind of was. It wasn’t like Bainbridge money was dirty or anything. Then again, I guess I understood the pride part of it. Still, his answer left a tense lull in the air.\u003c/p\u003e\n\u003cp\u003eWhen a sound came from Bentley, we both looked down as if eager for a diversion. Her eyes were closed as she shifted in her sleep and turned her face toward the warmth of Knox’s chest...lucky girl.\u003c/p\u003e\n\u003cp\u003e“Is she...” I wrinkled my nose. “Is she snoring?”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “I think so.” He sent me a curious look. “You want to hold her again? While she’s sleeping like this.”\u003c/p\u003e\n\u003cp\u003eI immediately shook my head, still too intimidated by the ten-pound kid.\u003c/p\u003e\n\u003cp\u003e“No, that’s okay. I’ll just...I’m fine with watching you hold her.”\u003c/p\u003e\n\u003cp\u003eThe way he looked at me made me realize how I’d just announced I wanted to watch him. My face flamed hot. But he only grinned.\u003c/p\u003e\n\u003cp\u003e“Okay, then.” Backing up a few steps until he had his back to the tree, he lowered himself to his haunches and then sat on the ground. Then he resituated the baby on his shoulder and heaved out a relaxed sigh as he closed his eyes.\u003c/p\u003e\n\u003cp\u003eHe made it look so inviting I eased down a few feet away, facing him. After resting my hands on my crossed knees and letting out my own deep breath, I bit my lip, realizing there was really no more reason for me to sit here, watching Knox Parker hold a sleeping baby. I’d come to meet Bentley, interact with my niece, not drool over some cute boy.\u003c/p\u003e\n\u003cp\u003eBut nothing was going to make me leave just yet.\u003c/p\u003e\n\u003cp\u003eNeeding to speak before I imploded from the overwhelming effects of girl-crushing-in-the-presence-of-a-hot-guy anxiety, I blurted, “It’s really nice and peaceful out here, isn’t it?”\u003c/p\u003e\n\u003cp\u003eKnox didn’t open his eyes, but he did smile, which was...oh my God, absolutely beautiful.\u003c/p\u003e\n\u003cp\u003e“This is my favorite place on earth.”\u003c/p\u003e\n\u003cp\u003eMine too.\u003c/p\u003e\n\u003cp\u003eI might have sighed.\u003c/p\u003e\n\u003cp\u003eHis eyes came open. Crap, I hope he hadn’t heard that. Uncrossing my legs, I pulled them together and bent them up to my chest, hugging them and hiding as much of myself as possible.\u003c/p\u003e\n\u003cp\u003e“So, uh...” I glanced around the quiet forest, where I couldn’t even spot a squirrel to talk about. “What did the duck say when he bought lipstick?” When Knox snorted, I glanced at him and frowned. “What?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “You’re not getting me this time. Ducks don’t buy lipstick.”\u003c/p\u003e\n\u003cp\u003eOne of my legs escaped my arm hug and straightened so I could reach it out and nudge his foot with mine. “Come on. Just play along.”\u003c/p\u003e\n\u003cp\u003e“No way.” He laughed and shook his head. “I’m not falling for that again. If mutes don’t talk, then ducks don’t wear freaking lipstick.”\u003c/p\u003e\n\u003cp\u003e“Okay, fine.” I sighed dramatically, even though I kind of loved that he was talking to me...even if it was about duck lipstick. “Theoretically, if a duck were to wear lipstick and have the ability to speak, what do you think it’d say if it ever bought lipstick?”\u003c/p\u003e\n\u003cp\u003eHis mouth opened, but no words came. A thoughtful frown creased his brow before he slumped his shoulders and shook his head. “I give up. What would a duck say?”\u003c/p\u003e\n\u003cp\u003eI let a dramatic second of silence follow his question before I answered, “Put it on my bill.”\u003c/p\u003e\n\u003cp\u003eKnox stared at me, squinting slightly before he closed his eyes, bowed his head and sighed. “Seriously, Bainbridge? That’s awful. It’s even cheesier than the mute-midget joke.”\u003c/p\u003e\n\u003cp\u003e“It is not!” Okay, it might’ve been. But my gut instinct to disagree with him flared to life, because I really liked to argue-banter with Knox Parker.\u003c/p\u003e\n\u003cp\u003e“Someone needs to teach you some good and dirty, lewd jokes.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “Why do you think dirty jokes are so much better than nice, safe, clean ones?”\u003c/p\u003e\n\u003cp\u003eHis grin was pure, smoking hot, mischievous bad boy. “Because...everything’s better when it’s dirty.”\u003c/p\u003e\n\u003cp\u003eFeeling the urge to fan my face and sigh while melting into a puddle of raging hormones, I gulped down my initial reaction and gripped my knees tighter to my chest.\u003c/p\u003e\n\u003cp\u003e“Fine,” I said, trying to sound airy and all whatever, even though my voice was a little too high to accomplish such a feat. “I’ll never bother you with my completely appropriate, clean jokes ever again, then.”\u003c/p\u003e\n\u003cp\u003e“Oh, don’t be that way,” he chided through a grin. “You know I was just kidding.” It was his turn to nudge my sandals with his ratted sneaker. “Come on. Hit me with another. I swear, I won’t bash this one.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-29.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
