{"id":75665,"no":30,"title":"Page 30","content":"\u003cp\u003e“Nope. Not falling for it.”\u003c/p\u003e\n\u003cp\u003e“But you never know.” His voice was charming, cajoling, and oh so tempting. “It could be my newest favorite joke of all time.”\u003c/p\u003e\n\u003cp\u003eI snorted.\u003c/p\u003e\n\u003cp\u003e“Please.” He added an eyelash-batting grin to the begging, which okay, really made me want to give in.\u003c/p\u003e\n\u003cp\u003eBut I held firm, though I had no idea why, and I lifted my chin stubbornly. “Never again.”\u003c/p\u003e\n\u003cp\u003e“Felicity,” he scolded. “Tell me a damn joke.”\u003c/p\u003e\n\u003cp\u003e“Uh-uh.” Finding my fingernails suddenly the most interesting things I’d ever inspected, I examined them, looking for chips and dirt. “So, what do you want to be when you grow up?” I asked, totally flipping the conversation around so I wouldn’t end up giving in to him with one of my subpar anecdotes.\u003c/p\u003e\n\u003cp\u003eUnable to change gears so quickly, he sent me a startled glance before crinkling his eyebrows. “Huh?”\u003c/p\u003e\n\u003cp\u003eI shrugged. “I’m just curious. Where do you see yourself in ten years?”\u003c/p\u003e\n\u003cp\u003eBlurting out a laugh, he shook his head. “What is this? Some kind of job interview?” Then he arched an eyebrow and cocked me a sideways glance. “Where do you see yourself in ten years, Miss Bainbridge?”\u003c/p\u003e\n\u003cp\u003eI rested my chin on my knees. “In college.”\u003c/p\u003e\n\u003cp\u003e“At twenty-five?” he sputtered. “Holy shit, what do you plan on becoming? A freaking doctor?”\u003c/p\u003e\n\u003cp\u003e“Actually, yes. But not a medical doctor. And don’t cuss in front of my niece, please.”\u003c/p\u003e\n\u003cp\u003e“Pfft.” He snorted and shook his head, even though a grin lingered around his lips. “You think that was bad? You should hear the crap Mercy spews at Bentley to her face. This kid has no chance of not having a potty mouth.”\u003c/p\u003e\n\u003cp\u003eI started to tell him he still didn’t need to be part of the problem, but he went and added, “And what kind of doctor isn’t a medical doctor?”\u003c/p\u003e\n\u003cp\u003eI shrugged. “A psychological one.”\u003c/p\u003e\n\u003cp\u003e“A psych....” He pulled his head back as if surprised. When Bentley stirred in her sleep, he glanced down and shifted her until she was resting her cheek on his shoulder. Patting her back gently and swaying back and forth, he returned his attention to me. “You want to be a psychologist?”\u003c/p\u003e\n\u003cp\u003eI nodded and bit my bottom lip. “Yeah. I do. A child psychologist.”\u003c/p\u003e\n\u003cp\u003e“Wow,” he murmured, and he actually sounded impressed, which warmed a little spot in my heart. “That’s just...I don’t know. Wow.” When he shook his head, more bewildered than impressed, I frowned.\u003c/p\u003e\n\u003cp\u003e“What?” Gnawing on my lip, I watched him intently.\u003c/p\u003e\n\u003cp\u003e“Nothing. It’s just. It’s so...random. And yet specific. You don’t see a lot of fifteen-year-olds deciding something quite like that.”\u003c/p\u003e\n\u003cp\u003e“Almost sixteen,” I automatically corrected.\u003c/p\u003e\n\u003cp\u003eHe sent me a dry glance. “Same fucking difference,” he argued, only to quickly revise, “Same freaking difference. Sorry.” When he glanced down at the sleeping baby, something warm passed through me.\u003c/p\u003e\n\u003cp\u003eHe’d watched his language...for me.\u003c/p\u003e\n\u003cp\u003eI loved that.\u003c/p\u003e\n\u003cp\u003e“It’s just...” He shrugged before adding, “I can’t see anyone so young wanting to be something like that, just out of the blue, unless you actually know a child psychologist.”\u003c/p\u003e\n\u003cp\u003eWhen I blushed, his brown eyes widened. “Holy shit, you do? You’ve been to a psychologist?”\u003c/p\u003e\n\u003cp\u003e“Hey!” I picked up a handful of dirt and acorns and twigs at my side and tossed them at him, making sure they sprinkled over his pant legs and went nowhere near our niece. “It’s not something to be ashamed of. But, no, I haven’t.” I threw more fallen acorns at him. “Why would you automatically assume I’m mentally unstable?”\u003c/p\u003e\n\u003cp\u003eHe ducked his face protectively and gave a soft laugh, even though the second round also only pelted him from the knees down. “I didn’t say there was anything wrong with it. And I never once thought anything was mentally wrong with you, except maybe your inability to tell a good joke.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “Hardy, har har.”\u003c/p\u003e\n\u003cp\u003eKnox snickered but just as quickly fell serious again. “I just...you know, sometimes people experience traumatic things when they’re young, and they need help dealing with them, which made me wonder if...you had.”\u003c/p\u003e\n\u003cp\u003eThe way he watched me felt like a dissection, like he was prying his way into my brain, looking for my deepest darkest secrets...looking for trauma.\u003c/p\u003e\n\u003cp\u003e“Well, I’m sorry to disappoint you,” I said. “But I never experienced any traumatic events. I’ve led a very boring childhood.” A very boring, spoiled and elite, yet ignored-by-my-parents childhood. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-30.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
