{"id":75670,"no":35,"title":"Page 35","content":"\u003cp\u003e“You’ll stay here, of course.”\u003c/p\u003e\n\u003cp\u003eNot expecting her offer, I gasped. Aspen and Noel were already housing his two younger brothers. They didn’t need to take on anyone else. “Oh...no. I couldn’t. Aspen, you know I didn’t come here looking for a handout or a couch to sleep on. I—”\u003c/p\u003e\n\u003cp\u003e“Of course, I know that. And we won’t make you sleep on the couch. We’ll bunk you in Brandt’s room.”\u003c/p\u003e\n\u003cp\u003e“But—” Uncomfortable about any kind of gift or charity, I did a quick mental calculation in my head, trying to figure out how much money I had available to spend on a motel room…for multiple nights. And that would be zero dollars and maybe, oh, about thirty-eight cents, give or take—mostly take—a hundred bucks or so.\u003c/p\u003e\n\u003cp\u003eDamn.\u003c/p\u003e\n\u003cp\u003eBefore I could protest, though, the back door came flying open and Aspen’s husband swept into the kitchen, all six-foot-four sexy inches of him.\u003c/p\u003e\n\u003cp\u003eMy best friend was such a lucky shit.\u003c/p\u003e\n\u003cp\u003e“Hey,” he started to greet her with a seductive grin before he noticed me.\u003c/p\u003e\n\u003cp\u003eAfter doing a quick double take to make sure, yes, I was really here, I swear disappointment glittered in his eyes. But at least he gave me a friendly enough greeting. “Hi, Felicity. What’re you—”\u003c/p\u003e\n\u003cp\u003eHis attention was deterred when he noticed Aspen’s noodle project taking place on the cabinet counters. “What’s that?”\u003c/p\u003e\n\u003cp\u003eWhen he tried to glance around her to get a look, she dodged into his path, blocking his view. “Nothing.”\u003c/p\u003e\n\u003cp\u003eNoel’s gaze sprang to hers only for a slow smile to spread across his face. “You’re cooking something new again.”\u003c/p\u003e\n\u003cp\u003eShe snorted. “No.”\u003c/p\u003e\n\u003cp\u003eBut his grin only widened. And someone hand me a fan please, because Noel Gamble sure had a hormone-sizzling smile.\u003c/p\u003e\n\u003cp\u003eAspen sighed and ground her teeth. “It won’t be ready until tomorrow. The noodles take a day to dry out.”\u003c/p\u003e\n\u003cp\u003e“Noodles?” Her husband cocked a curious eyebrow. “As in...?”\u003c/p\u003e\n\u003cp\u003e“Chicken and noodles,” she grumbled, obviously reluctant to break the surprise.\u003c/p\u003e\n\u003cp\u003e“Chicken and...noodles.” He whimpered, and I swear he was half a breath from coming in his jeans...jeans that looked really good on him from the side view I had at the table.\u003c/p\u003e\n\u003cp\u003eGripping Aspen’s arms, Noel backed her into a cabinet. “Have I told you how much I love you lately?”\u003c/p\u003e\n\u003cp\u003eShe glowed, not that I blamed her. I was tingling over here myself from just watching his sexy manhandling.\u003c/p\u003e\n\u003cp\u003eBiting her lip, she answered, “A couple times this morning.”\u003c/p\u003e\n\u003cp\u003eNoel tsked and shook his head. “That’s not nearly enough.”\u003c/p\u003e\n\u003cp\u003eWhen he kissed her, I glanced away, sighing, as the misery of the day once again took its toll on me.\u003c/p\u003e\n\u003cp\u003e“I want to take you on this counter right now, get you all covered with flour, and—”\u003c/p\u003e\n\u003cp\u003e“Um, hey!” I waved my hand and glared irritably. “I’m still here.”\u003c/p\u003e\n\u003cp\u003eAspen gasped and jerked out of Noel’s arms, flushing bright red as she covered her swollen, well-kissed lips. “Sorry.”\u003c/p\u003e\n\u003cp\u003eNoel didn’t look so apologetic. He scowled at the interruption and folded his arms across his bulging chest before resting his back against the counter and asking, “So, what’s up with you today, Bainbridge? Come over for baby details?”\u003c/p\u003e\n\u003cp\u003eWait, what? I frowned. “Baby details?”\u003c/p\u003e\n\u003cp\u003eWas Aspen expecting?\u003c/p\u003e\n\u003cp\u003e“Oh, crap. I totally forgot!” She slapped a hand to her brow as she cringed. “Zoey went into labor today.”\u003c/p\u003e\n\u003cp\u003e“What?” I sprang from my seat, instantly alarmed. “Isn’t she, like, way early? Too early to be having a baby yet?”\u003c/p\u003e\n\u003cp\u003eNoel shrugged. “She did anyway. She went into labor and had it earlier today. The baby’s in NICU, but basically doing okay. I just got back from visiting them at the hospital.”\u003c/p\u003e\n\u003cp\u003e“How’s she doing?” Aspen asked, rubbing Noel’s arm. “Did you get to see the baby?”\u003c/p\u003e\n\u003cp\u003e“Through a window, but that was it. Zoey was worn out but still had enough energy to smile when we invaded her room. We decided to let her rest so we didn’t stay long.”\u003c/p\u003e\n\u003cp\u003e“Whew.” I swiped my hand over my brow and sank back into my seat. “Thank goodness they’re both okay. It was supposed to be a boy, right?”\u003c/p\u003e\n\u003cp\u003eNoel nodded. “J.B. And he has a head full of dark hair like his daddy.”\u003c/p\u003e\n\u003cp\u003eAspen patted his shoulder. “Tell her about the mysterious hero.”\u003c/p\u003e\n\u003cp\u003eI glanced between them. “The what?”\u003c/p\u003e\n\u003cp\u003e“Ten told me some Good Samaritan drove Zoey to the hospital.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-35.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
