{"id":75674,"no":39,"title":"Page 39","content":"\u003cp\u003e“Okay,” I murmured, still caught in my I-think-I-love-this-boy daze. We could go any direction he liked.\u003c/p\u003e\n\u003cp\u003eHe clasped my hand again and off we went. The squishy sound of mud gushing between my toes with every step notwithstanding, this was turning out to be the best afternoon walk of my life.\u003c/p\u003e\n\u003cp\u003eA minute later, Knox finally broke the silence between us by chuckling and shaking his head. “Seriously, what in the world were you thinking to wear such flimsy shoes into the woods?”\u003c/p\u003e\n\u003cp\u003eI flushed hard and hot. I’d been thinking I’d wanted to impress him with my girlishness. But I’d only shown him how senseless and impractical I was.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you were raised right next to these woods. You act like such a city girl.”\u003c/p\u003e\n\u003cp\u003eThat felt like an insult, so I scowled. “I do not.”\u003c/p\u003e\n\u003cp\u003eHis chuckle only grew louder as he paused and took the time to help me step over a log I definitely could’ve stepped over myself.\u003c/p\u003e\n\u003cp\u003eWith another irritable frown, I yanked my hand from his and leapt the log all on my own. “This is the first summer I’ve ever really come out here. Excuse me for not knowing there was a freaking swamp around.”\u003c/p\u003e\n\u003cp\u003eWhen I took another step on my own, my muddy shoe stuck to something I’d stepped in and it once again came off without me. Without the support of his hand in mine, I began to tumble to the ground, but he caught my elbow.\u003c/p\u003e\n\u003cp\u003eAs he helped me upright and then back into my shoe again, he winked. “Well, I practically live in these trees, so I should’ve paid attention to what you were wearing on your feet and not taken you this way. I totally owe you new shoes.”\u003c/p\u003e\n\u003cp\u003eMollified, I sighed. “No, you don’t. I’m the idiot who wore them, so—” I gasped out a short scream when I almost ran into a spiderweb...with a huge furry spider hanging in it. With it inches from my face and staring me in the eyeball, I lurched against Knox, clutching his hand hard. “Oh my God! Spider!”\u003c/p\u003e\n\u003cp\u003eHe laughed and steered me safely around the web. “You really are a city girl...Felicity Girl.”\u003c/p\u003e\n\u003cp\u003e“That’s a stupid name,” I muttered, even though I kind of liked him coming up with a special name for me.\u003c/p\u003e\n\u003cp\u003e“Spider!” he warned suddenly and ran his fingers up my ribcage, making me leap away, screaming.\u003c/p\u003e\n\u003cp\u003eHe laughed, so I slapped him on the shoulder.\u003c/p\u003e\n\u003cp\u003e“That was so not funny.” I slugged him again, but he only laughed harder. “Jerk.” I started to stomp around him, only for my slippers to get caught up again, making me stumble.\u003c/p\u003e\n\u003cp\u003eGrr. Why did this only happen when he wasn’t holding my hand?\u003c/p\u003e\n\u003cp\u003eHalf a breath later, he appeared at my side and silently took my hand. “Man, you are way too fun to rile, City Girl.”\u003c/p\u003e\n\u003cp\u003eI kept hold of his hand, but didn’t answer.\u003c/p\u003e\n\u003cp\u003eHe shrugged, and we walked along, growing quiet. After a ways, my irritation retreated, and the sounds of the forest eased my temperament. When we approached a tree in our path, I started to move around it to the right, but Knox’s fingers tightened around mine, taking me left. He kept moving left, letting me know we had a specific destination in mind.\u003c/p\u003e\n\u003cp\u003e“Where’re we going?”\u003c/p\u003e\n\u003cp\u003eHe glanced at me, his eyes lighting with pleasure. “You swear you’ve never been out this way before?”\u003c/p\u003e\n\u003cp\u003eI shook my head slowly, wondering what he was planning.\u003c/p\u003e\n\u003cp\u003eHis lips tipped into a grin. “Then it’s a surprise.”\u003c/p\u003e\n\u003cp\u003e“You weren’t lying when you said you practically live out here, were you?”\u003c/p\u003e\n\u003cp\u003e“Nope. This is where I come when I need to get away. I know these trees like the back of my hand.”\u003c/p\u003e\n\u003cp\u003eI nodded. This was his haven. Only a few weeks ago, it’d become mine too. “Strange,” I murmured thoughtfully. “We were both so ready to defend our relatives that day we met, and they’re the ones we always come out here to escape.”\u003c/p\u003e\n\u003cp\u003eHe glanced at me. “Family loyalty makes no sense at all, does it?”\u003c/p\u003e\n\u003cp\u003eI shrugged. Maybe it didn’t, but I didn’t feel like such the loyal Bainbridge being out here alone with this Parker boy. I felt reckless, and euphoric, and so free that a little bubble of joy in my chest began to grow and expand to unimaginable proportions.\u003c/p\u003e\n\u003cp\u003e“There,” Knox murmured in my ear as he pointed past me, letting me know we’d arrived at wherever he’d wanted to take me.\u003c/p\u003e\n\u003cp\u003eI looked over and squinted when I saw...was that water between the trees?\u003c/p\u003e\n\u003cp\u003e“Oh my goodness.” I stared in wonder as we drew closer to a ramp that led out onto a small wooden dock. “I had no idea there was a lake out here.”\u003c/p\u003e\n\u003cp\u003e“Strip pit,” Knox corrected. “It’s the only one. I guess they discovered a trace amount of coal years ago and did some mining, but never found enough to keep the project going. After they abandoned it, it filled with water.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-39.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
