{"id":75676,"no":41,"title":"Page 41","content":"\u003cp\u003e“But what the hell am I thinking?” His whisper turned harsh. “You’re a Bainbridge. I’m a Parker. We should hate each other on principle alone. I shouldn’t even be your friend, much less want to kiss you.”\u003c/p\u003e\n\u003cp\u003eMy eyelashes fluttered open. “You shouldn’t?” I have no idea why I asked that as if to make sure he was certain of his claim. He’d just said he shouldn’t, so he shouldn’t. Except I really wanted him to.\u003c/p\u003e\n\u003cp\u003eHis brown eyes blazed into mine. “I won’t,” he swore, his jaw hard with resolution.\u003c/p\u003e\n\u003cp\u003e“You won’t,” I murmured.\u003c/p\u003e\n\u003cp\u003eHe shook his head. But he was right there; our faces were so close. Maybe I could be the one to just lean in and...\u003c/p\u003e\n\u003cp\u003eWhen I did lean toward him, he leaned toward me, meeting me halfway. Oh God, I was going to kiss Knox Parker. I was going to press my mouth to his and—\u003c/p\u003e\n\u003cp\u003eWhat the heck did I think I was doing? This was insane. “You’re right,” I said, shaking sense back into my head and pulling away, dislodging his hold on my hair. “We probably shouldn’t even be friends. I should go.”\u003c/p\u003e\n\u003cp\u003eI yanked my feet from the pit and began to pull on my slippers.\u003c/p\u003e\n\u003cp\u003e“City Girl,” he said, as if apologizing, trying to explain.\u003c/p\u003e\n\u003cp\u003e“No, you’re right. This is... It’s insane. I’m going home and never—”\u003c/p\u003e\n\u003cp\u003e“Hey,” he whispered.\u003c/p\u003e\n\u003cp\u003eHe caught my hand when I tried to stand.\u003c/p\u003e\n\u003cp\u003eAfter drawing in a bracing breath, I turned back to meet his gaze. I expected him to spill out some other significant reason why we shouldn’t kiss, why even talking together and meeting in the woods was so wrong, why we were supposed to be enemies, blah, blah, blah, but instead...his mouth pressed against mine.\u003c/p\u003e\n\u003cp\u003eToo stunned to respond at first, I just knelt there, my knees digging into the dock, as he cupped my face in one palm and leaned in close. Then he tipped his head to the side and brushed his lips across mine again.\u003c/p\u003e\n\u003cp\u003eMy eyelids dragged closed, and a whimper escaped my throat.\u003c/p\u003e\n\u003cp\u003eHis mouth was so freaking soft. And warm. I pressed back, clutching his shoulder until my nails burrowed into his shirt.\u003c/p\u003e\n\u003cp\u003eHe made a sound that was somewhere between a groan and a growl, and his second hand cupped my face too before his palm slid across my cheek so he could sink his fingers in my hair. When his lips parted and his tongue came out to touch the seam of my mouth, I gasped from the bold sensation it caused...between my legs.\u003c/p\u003e\n\u003cp\u003e“Sorry.” He pulled his face back immediately but kept his hands in my hair. “Too much?”\u003c/p\u003e\n\u003cp\u003eHe meant, not enough, right?\u003c/p\u003e\n\u003cp\u003eBreathing hard, I only gaped. “But you said...we shouldn’t...kiss.”\u003c/p\u003e\n\u003cp\u003eHe grinned and swept his lips over my cheek. “Yeah, well, I couldn’t handle making you sad. And you looked sad when you tried to leave.”\u003c/p\u003e\n\u003cp\u003eA smile bloomed, bright and broad, across my face. He smiled back and bit his bottom lip. Drawn to him and tempted beyond anything I’d ever felt before, I leaned toward him, but he jerked back.\u003c/p\u003e\n\u003cp\u003e“We should probably stop there,” he said, looking a little panicked. “I don’t...I don’t know if I can trust myself after too much more.”\u003c/p\u003e\n\u003cp\u003eI nodded, but couldn’t help but feel saddened. I already missed the feel of his mouth against mine. But he was right. We’d already crossed too many boundaries. So, I started to turn away, except he growled and caught my wrist, spinning me back to him.\u003c/p\u003e\n\u003cp\u003e“Stop that,” he demanded, his eyes flashing with anger, right before he stamped his mouth back to mine.\u003c/p\u003e\n\u003cp\u003eMy fingers instantly gripped his hair as I pushed up onto my knees again and arched into him. “Stop what?” I asked, breathless, before his lips attacked mine again.\u003c/p\u003e\n\u003cp\u003e“Stop looking so sad when I don’t kiss you, and stop trying to leave when you’re sad. You’re not allowed to walk away from me unless you’re smiling.”\u003c/p\u003e\n\u003cp\u003e“Then stop trying to be so noble and not kiss me,” I growled back.\u003c/p\u003e\n\u003cp\u003e“Fine,” he snapped and yanked me in for a scorcher. “I won’t.” This time, when he opened his mouth, I was ready for him. My tongue met his, and he jerked in surprise before he slid his into my mouth.\u003c/p\u003e\n\u003cp\u003eAnd oh my God... Nirvana.\u003c/p\u003e\n\u003cp\u003eI have no idea how many kisses followed that, or how long we spent just making out, mouth to mouth, but my lips were pleasantly swollen and my brain felt permanently dazed when I finally pulled away and said I needed to get home before someone actually started to worry.\u003c/p\u003e\n\u003cp\u003eHe nodded and gave me one last closed-mouth, chaste kiss before pulling away and watching me push to my feet.\u003c/p\u003e\n\u003cp\u003e“So...I’ll see you around,” I said, suddenly uncertain. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-41.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
