{"id":75677,"no":42,"title":"Page 42","content":"\u003cp\u003eHis eyes glittered with amusement before he merely nodded and answered, “Yeah. See you.”\u003c/p\u003e\n\u003cp\u003eI have no idea why his response rubbed me the wrong way when I was the idiot who’d said the same exact thing to him first. Gah, I was the most insecure weirdo I knew.\u003c/p\u003e\n\u003cp\u003eTucking my hair behind my ear, I sent him one last unsure wave and spun away to hurry down the ramp to the shore of the strip pit.\u003c/p\u003e\n\u003cp\u003eBefore I reached it, however, he called after me. “Hey, City Girl.”\u003c/p\u003e\n\u003cp\u003eA giddy joy bloomed in my chest. “What?”\u003c/p\u003e\n\u003cp\u003e“Seriously, bring your swimming suit tomorrow. We’ll try out the alkali water.”\u003c/p\u003e\n\u003cp\u003eSpinning to face him, I walked backward away from him. “I don’t know. I don’t really need my batteries charged.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “After I get done kissing you hello, you will.”\u003c/p\u003e\n\u003cp\u003eI threw my head back and laughed.\u003c/p\u003e\n\u003cp\u003eAnd that was the first of many trips I walked away from him that summer with swollen lips and a silly grin plastered to my face.\u003c/p\u003e\n\u003cp\u003eI followed Pick through the front doors of the Forbidden Nightclub Thursday evening, expecting the scent of maybe mold, sour alcohol, and sweat, because my childhood home had always smelled like that after my dad went on a bender. But I was surprised by how clean it smelled, like new wood, recent construction, even the hint of fresh paint.\u003c/p\u003e\n\u003cp\u003eThe nightclub had a dark ceiling that made it seem lower than it probably was. Tables and chairs took up the left side while the center was open and a small stage encompassed the right. Since the actual bar was located at the back, I continued to follow Pick that way where a handful of guys were milling around.\u003c/p\u003e\n\u003cp\u003eOne sat on a stool at the bar with his back to us as he popped a sucker in his mouth and watched something on the screen of the laptop in front of him.\u003c/p\u003e\n\u003cp\u003e“Hart, what the hell are you watching?” Another guy, whom I immediately recognized from the hospital as Ten, asked the stool sitter as he approached from the side to see for himself.\u003c/p\u003e\n\u003cp\u003e“Man, check this out. Someone put Taylor Swift’s ‘Shake it Off’ song onto this eighties workout video, and it synched freaking perfectly. Holy shit, just look at that.”\u003c/p\u003e\n\u003cp\u003eTen watched for a second before he turned his face aside to give Hart an odd look. “Dude, really?”\u003c/p\u003e\n\u003cp\u003e“Whoa.” Another guy approached them from the other side of Hart to watch the video. “Someone please tell me guys don’t still wear tights like that. That’s way too much TMI for me.”\u003c/p\u003e\n\u003cp\u003eTen slapped a hand to his chest. “Jesus, you disappoint me, Lowe. How can you even see what the dudes are wearing when the chicks’ tits are bouncing around like that?”\u003c/p\u003e\n\u003cp\u003e“Okay, what’s all the fuss about over here?” A fourth guy hopped over the bar so he could see the screen of the laptop as well. But as soon as he saw a second’s worth, he immediately backed away and lifted both hands. “You guys need help.”\u003c/p\u003e\n\u003cp\u003eThat’s when Pick chose to announce us. “Hey, everyone. This is Knox Parker. He’s our new bartender.”\u003c/p\u003e\n\u003cp\u003eAll four men spun around, and every gaze landed on me.\u003c/p\u003e\n\u003cp\u003eThe fourth guy finally wandered closer, eyeing me up and down. “Since when do we have a new bartender?”\u003c/p\u003e\n\u003cp\u003e“Since today,” Pick answered casually.\u003c/p\u003e\n\u003cp\u003eMr. Curious hitched his chin Pick’s way. “Is this the ex-con?”\u003c/p\u003e\n\u003cp\u003ePick shook his head and sighed. “Ten,” he muttered. “You got a big fucking mouth, you know that?”\u003c/p\u003e\n\u003cp\u003e“What?” Ten shrugged. “Was I supposed to keep that secret?”\u003c/p\u003e\n\u003cp\u003e“Just...” Pick lifted his hands. “Let’s not go spreading his record around outside the six of us, okay? In fact, for the first week or so, you all don’t even know his name. Got it?”\u003c/p\u003e\n\u003cp\u003eNone of the other bartenders seemed to get it. They stared at him as if he’d lost his mind. I gave him my own confused glance, wondering why he wanted even my name kept under wraps. But he didn’t explain himself.\u003c/p\u003e\n\u003cp\u003eFinally, the one Ten had called Lowe pointed at me as he asked Pick. “Is he—”\u003c/p\u003e\n\u003cp\u003e“Yes,” Pick clipped out, sending Lowe a hard stare before Lowe whirled back to me and studied me from head to toe.\u003c/p\u003e\n\u003cp\u003eA moment later, he huffed out a strange sounding, “Oh.”\u003c/p\u003e\n\u003cp\u003eI had no idea what they were talking about, so I transferred a leery scowl between the two of them, hoping they’d clue me in. But all Lowe did when I glanced at him was offer me a nervous smile and a greeting nod, which only made me warier.\u003c/p\u003e\n\u003cp\u003eWhat the hell?\u003c/p\u003e\n\u003cp\u003eFrom his barstool, Hart tipped his chin up and decided to talk to me directly. “So what’d you do time for?” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-42.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
