{"id":75678,"no":43,"title":"Page 43","content":"\u003cp\u003eI turned my attention to him, and something in my gaze must’ve intimidated him because he took an untrusting pull back in his seat. Since it was obvious I already skeeved him out, I couldn’t help myself; I answered, “Rape and murder.”\u003c/p\u003e\n\u003cp\u003eA pregnant pause followed before Ten exploded, “What the fuck, Pick? You just hired a murdering rapist to work with us? Dude!”\u003c/p\u003e\n\u003cp\u003ePick sent me a dry glance as if to tell me to keep my mouth shut. But I only gazed back, unrepentant. It wasn’t as if I’d lied. I had done time for both accusations.\u003c/p\u003e\n\u003cp\u003eRubbing a spot on his forehead, Pick frowned at his bartenders. “How long have you idiots known me? Do you honestly think I’d hire a rapist?”\u003c/p\u003e\n\u003cp\u003eThe disgust in his voice seemed to relieve them, but the one still standing closest to me, visually inspecting me, asked, “What about the murdering part?”\u003c/p\u003e\n\u003cp\u003ePick shrugged. Then he glanced at Lowe and murmured, “I’m sure he had a good reason for that.”\u003c/p\u003e\n\u003cp\u003e“Oh, great. That’s just great.” Ten threw his hands into the air and spun away, before facing Pick again. “When he rapes and murders me, please tell my wife he probably had a good reason for it.”\u003c/p\u003e\n\u003cp\u003eHart, still sitting in front of the laptop, snickered. “If he murdered you, Ten, he would have a good reason.”\u003c/p\u003e\n\u003cp\u003e“Shut it, motherfucker.”\u003c/p\u003e\n\u003cp\u003e“Make me, douche stick.”\u003c/p\u003e\n\u003cp\u003e“Better watch it, cock licker, or I will.”\u003c/p\u003e\n\u003cp\u003e“Fellas.” Pick lifted his hands. “Jesus, my toddlers are better behaved than you two. Just...believe me when I say Knox is trustworthy. Okay? Now let’s get back to work. Gamble, you’re on training duty.”\u003c/p\u003e\n\u003cp\u003e“Yeah, thanks.” The guy next to me snorted out his sarcasm before drawing in a deep, irritated sigh and waving me to follow him behind the bar. “This way, Parker. Looks like you’re with me tonight.”\u003c/p\u003e\n\u003cp\u003eI paused, sending Pick a doubtful glance for pushing me off on these men who obviously wanted nothing to do with me. Except maybe Lowe. But I wasn’t sure what he was about, so I probably trusted him least of all.\u003c/p\u003e\n\u003cp\u003ePick merely waved me on. “That’s Noel by the way. Noel Gamble. He was a big football star back in the day.”\u003c/p\u003e\n\u003cp\u003eI pulled back to get a better look at Noel, recognizing his name. They’d let us watch football behind bars; I’d probably seen a dozen, if not more, of his games.\u003c/p\u003e\n\u003cp\u003e“Was?” Noel scowled at Pick. “That ‘was’ was only like a year ago, douche. Way to make me sound ancient and decrepit.”\u003c/p\u003e\n\u003cp\u003ePick merely shrugged and pointed at Ten. “And you’ve met Dipshit, aka Ten, aka Oren Tenning.”\u003c/p\u003e\n\u003cp\u003eI blinked in shock. Oren Tenning was another name I recognized from television. I never would’ve known him by his face since I’d only ever seen him on a screen in football pads and wearing a helmet.\u003c/p\u003e\n\u003cp\u003e“Another football star,” I said, suddenly placing where I’d heard the name Quinn Hamilton before, too. Zoey’s husband had replaced Gamble after he’d gotten hurt and was the current football quarterback for Ellamore State these days.\u003c/p\u003e\n\u003cp\u003e“Right,” Pick answered with a nod. “And this is Asher Hart. He was the new guy before you came along.” Setting his hand on Asher’s shoulder, he closed the guy’s laptop before adding, “He’s been with us over a year and sings in some little band.”\u003c/p\u003e\n\u003cp\u003eAsher snorted and reopened his laptop. “He means an awesome, kick-ass band. We perform here every Friday if you want to check us out.”\u003c/p\u003e\n\u003cp\u003eGrin flitting across his face, Pick pointed out the last guy, who was stacking glasses against the back wall. “Last but not least, that’s Mason Lowe. We’re basically related since his woman and mine are first cousins, so I kind of have to play favorites with him.”\u003c/p\u003e\n\u003cp\u003e“What the fuck ever,” Ten called from where he was taking a chair off a table. “I’m your favorite, and you know it.”\u003c/p\u003e\n\u003cp\u003e“So have you ever tended bar before?” Noel broke into the introduction, obviously ready to get to work.\u003c/p\u003e\n\u003cp\u003eI hadn’t even been old enough to drink before I’d been arrested, so no, I’d definitely never tended a bar before.\u003c/p\u003e\n\u003cp\u003eI shook my head.\u003c/p\u003e\n\u003cp\u003eHis jaw tightened briefly before he asked, “Waited tables?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Of course not.” He rubbed a spot on his forehead and sent Pick a scowl. “Couldn’t have made this even a little easy for me, could you, Ryan? Thanks a lot.”\u003c/p\u003e\n\u003cp\u003ePick waved Noel’s resentment away as he seated himself at the bar and pulled out his cell phone to check something. “He’ll be fine.” Then he grinned. “His dad was an alcoholic; he probably knows how to mix most drinks already.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-43.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
