{"id":75680,"no":45,"title":"Page 45","content":"\u003cp\u003eMy vision grayed as that name flooded me, drowning out every part of my brain until I was living in one big memory of her.\u003c/p\u003e\n\u003cp\u003e“How do you know that?” Pick’s sharp voice jerked me back to the present, away from visions of curly red hair, big innocent blue eyes, and a smile that had melted my soul in two seconds flat.\u003c/p\u003e\n\u003cp\u003eI blinked until Pick’s face came into focus. But my ears were still buzzing with acute awareness, and my skin wouldn’t stop tingling from just hearing that name.\u003c/p\u003e\n\u003cp\u003eNext to me, Noel was shrugging. “She showed up at our place yesterday. I guess she caught her douchebag boyfriend fucking some girl on their kitchen table, and get this. They kicked her out of the apartment.” He sniffed in disgust and shook his head. “Aspen’s having her stay at our place until she can find somewhere of her own.”\u003c/p\u003e\n\u003cp\u003e“Wait. Cam cheated on Felicity?” Mason paused beside Pick, scowling. “What kind of idiot would do that? I’m charging him double if he ever comes in here again.”\u003c/p\u003e\n\u003cp\u003e“I already was charging him double,” Ten called. When Noel snorted, he added, “What? I’ve hated that motherfucker since the first time he came in. The dick-licker rubbed me all kinds of wrong.”\u003c/p\u003e\n\u003cp\u003eI couldn’t say anything. Not that I would’ve jumped into the conversation if I could have, but all the air vacating my lungs robbed me of the ability, even if I’d wanted to. My vision went spotty all over again, and I latched on to the edge of the bar, hoping I didn’t pass out.\u003c/p\u003e\n\u003cp\u003eI tried to tell myself I was overreacting for no reason. Just because they were talking about some random woman named Felicity didn’t mean they were talking about—\u003c/p\u003e\n\u003cp\u003eBut then I glanced at Pick, and when I found him watching me with that look, I knew.\u003c/p\u003e\n\u003cp\u003eSon of a bitch.\u003c/p\u003e\n\u003cp\u003eThey were talking about her.\u003c/p\u003e\n\u003cp\u003eI could literally feel the color leach from my face.\u003c/p\u003e\n\u003cp\u003ePick turned his attention from me to sear Noel with a glare. “Why the hell didn’t you tell me this sooner? I’ve been trying to reach her for over a day.”\u003c/p\u003e\n\u003cp\u003eNoel blinked and pulled back, obviously surprised by the vehemence in Pick’s voice. “Well, sorry. But I had no idea you needed her. And hell, with all the hullabaloo of Hamilton becoming a dad and ex-convicts coming to work for us, I kind of forgot about it.”\u003c/p\u003e\n\u003cp\u003ePick slid his gaze back to me. I think he knew I was a split second away from reaching across the bar and strangling him, because he tipped his head toward the hall. “Knox. In my office, now.”\u003c/p\u003e\n\u003cp\u003eI nodded and followed him without a word. But as soon as the door was shut and we were alone, I grabbed him by the shirt and slammed his back against the wall.\u003c/p\u003e\n\u003cp\u003eI sat on the dock, dangling my feet into the calm water below as I waited for Felicity in nothing but a pair of swimming trunks. Sans Bentley. Thinking maybe I should’ve brought the kid today, I grabbed the edge of the dock with both hands and stared down at my nervous reflection in the depths below.\u003c/p\u003e\n\u003cp\u003eWhat the fuck did I think I was doing, meeting Abbott Bainbridge’s one and only daughter alone in the woods every day?\u003c/p\u003e\n\u003cp\u003eIt’d been okay at first, like sharing aunt and uncle custody. She’d only wanted to get to know her niece. I was cool with that. But Felicity impressed the hell out of me on a daily basis. She wasn’t like any Bainbridge I’d ever met before. She wasn’t like anyone I’d ever met. She didn’t put on airs and stare down her nose at me. She didn’t think all high and mighty of herself. She didn’t treat me like a nobody.\u003c/p\u003e\n\u003cp\u003eIn fact, I don’t think anyone had ever treated me the way Felicity treated me, or looked at me the way she looked at me. Like I was something special. Like I was someone.\u003c/p\u003e\n\u003cp\u003eHer being one of the most beautiful girls I’d ever seen didn’t help ease my obsession with her, either. Which is probably why I kissed her, even if that had been the stupidest thing I’d ever done, because now I was well and truly addicted, and there was no turning back from where this was headed.\u003c/p\u003e\n\u003cp\u003eBut, fuck...it’d been worth it.\u003c/p\u003e\n\u003cp\u003eHer lips, her soft cheeks, her hair. I couldn’t wait to see her again.\u003c/p\u003e\n\u003cp\u003eSo, here I sat, restless and eager for today’s rendezvous, even though I knew I should stay as far away from her as possible.\u003c/p\u003e\n\u003cp\u003eThe slap of flip-flops on the dock behind me made my heart jump-start into high gear. A grin tugged at my lips. Of course she’d worn flip-flops through the woods. Only the most impractical shoes for my practical girl.\u003c/p\u003e\n\u003cp\u003eExcept she wasn’t mine, and I shouldn’t forget that.\u003c/p\u003e\n\u003cp\u003eI wanted to whirl around and take in every inch of her. The craving was so strong I gripped the ledge harder until a splinter dug into my palm. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-45.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
