{"id":75692,"no":57,"title":"Page 57","content":"\u003cp\u003e“It’s a gift.” Cupping the unwounded side of his face, I rained more delicate kisses over the slightly puffy skin. Something had to have made quite an impact to leave this much of a mark. I shuddered, wondering what he’d been through.\u003c/p\u003e\n\u003cp\u003eHe merely held me close and tipped his face down toward me, allowing me to perform more tender loving care.\u003c/p\u003e\n\u003cp\u003eWhen I had him good and mollified, I kissed his jaw and murmured into his ear. “How did you get a black eye, Knox?”\u003c/p\u003e\n\u003cp\u003e“My dad,” he rasped, only to turn into me fully and hide his face in my hair.\u003c/p\u003e\n\u003cp\u003eI hugged him back, and we held each other for the longest time.\u003c/p\u003e\n\u003cp\u003e“I made us a picnic,” I finally said.\u003c/p\u003e\n\u003cp\u003eHe made a sound in his throat; it reminded me of a sob. “I know. I saw. It broke my heart to watch you pack it back up.” He groaned his regret. “I should’ve just come out of my hiding spot and shown you my eye then.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it,” I assured him, taking his hand. “We can still eat it now.” I led him back to the basket, but when I reached for it, he took it from me.\u003c/p\u003e\n\u003cp\u003e“I can carry it.”\u003c/p\u003e\n\u003cp\u003eI smiled at him. “Thank you. Do you want to eat at our tree? I think that’s closer than the dock.”\u003c/p\u003e\n\u003cp\u003eHe nodded once. “Okay.”\u003c/p\u003e\n\u003cp\u003eSo we walked to the tree and neither of us spoke the entire way. It felt strange, leading him along. He was never so meek. But whatever had happened between him and his dad must’ve rattled him. It took everything I had not to ask. Not yet, anyway. He’d talk when he was ready.\u003c/p\u003e\n\u003cp\u003eWe reached the trees and made ourselves comfortable on the ground. His eyes lit up when he saw everything up close that I’d brought. Meeting my gaze, he sent me a half grin. “Good choices.”\u003c/p\u003e\n\u003cp\u003e“I had a feeling you might approve.”\u003c/p\u003e\n\u003cp\u003eSitting side by side with our backs to the trunk of our tree and our shoulders brushing, we polished off everything. Neither of us spoke, but it was a comfortable silence, filled with a handful of glances and shared smiles.\u003c/p\u003e\n\u003cp\u003eAs he was licking the last of the Doritos off his fingers, he rumbled out a moan of delight. “Mmm. One of my favorite flavors. Only one thing on earth tastes better.”\u003c/p\u003e\n\u003cp\u003e“What’s that?” I asked, determined to find this food he loved, as rare as it may be, and procure it for him, even if I had to travel to the ends of the earth.\u003c/p\u003e\n\u003cp\u003eHe glanced at me, his lips curving warmly. “You.”\u003c/p\u003e\n\u003cp\u003eWhen he leaned toward me, I met him halfway, smashing my mouth against his. His tongue immediately spiked deep, gifting me with a hint of peanut butter, apple and ranch.\u003c/p\u003e\n\u003cp\u003e“You taste like heaven,” he broke away to tell me through shallow breaths. Then he tugged me onto his lap, and I was suddenly riding his erection through our clothes.\u003c/p\u003e\n\u003cp\u003eWe’d only gone this far a couple of times, but I loved each and every encounter. I thought maybe I was ready to do more just as one of his hands landed on my waist, under my shirt. While his other hand buried itself into my hair, he slid his fingertips against my bare skin.\u003c/p\u003e\n\u003cp\u003eI sighed into his caress, welcoming it. His warm palm moved from my waist, around to my back. It followed my spine up until his fingers reached my bra. His lips left mine to move along my jaw, then down my throat. Following the line of my bra, he slid his hand around to the front until he was cupping me through cloth, but as soon as his thumb brushed over my straining nipple, I gasped and went rigid, not expecting the zing that went through me.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, I’m sorry.” His hand came out from under my shirt in record time and lifted in surrender. “Jesus, City. I don’t know what I was thinking. I should’ve asked first. I wasn’t... I’m so sorry.”\u003c/p\u003e\n\u003cp\u003e“It’s okay,” I assured him. I wanted to tell him he could put his hand back there. I’d actually liked it; it had just shocked me. But from the look on his face, he wasn’t going to touch me again, so I lost my nerve.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I said this time, because I hated ruining the moment. I rested my head on his shoulder and he immediately wrapped his arms around me. “I just—”\u003c/p\u003e\n\u003cp\u003e“You didn’t do anything wrong,” he said and kissed my forehead.\u003c/p\u003e\n\u003cp\u003eHe kept his mouth against me and continued to hold me close, so I wrapped my hands around his forearm and clung back. Nestling onto my side so I could press my ear to his slowing heartbeat, I closed my eyes and enjoyed what I did have with him.\u003c/p\u003e\n\u003cp\u003e“He doesn’t hit us a lot, you know,” he said out of the blue. “I don’t want you to think he just wails on us every day.”\u003c/p\u003e\n\u003cp\u003eI turned my nose into his shirt and inhaled his clean, Knoxy scent. “Okay,” I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-57.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
