{"id":75695,"no":60,"title":"Page 60","content":"\u003cp\u003e“I think not, douchebag.” Ten appeared on the other side of Aspen. “She’s hooking up with Caroline and me.” He winked my way. “Isn’t that right, Three?”\u003c/p\u003e\n\u003cp\u003eI wrinkled my nose. “That is so wrong. And stop calling me Three. I will never...in hell...respond to that name.”\u003c/p\u003e\n\u003cp\u003eTen grinned and pointed at me. “Except you just did.” He slashed at the air and added a triumphant, “Boom.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “I still can’t believe you asked me to be your number three.”\u003c/p\u003e\n\u003cp\u003e“I can.” Asher scooped up a handful of beer nuts from the bowl in front of me and popped them into his mouth. “He’s a douche like that.”\u003c/p\u003e\n\u003cp\u003e“Wait, he did what?” Aspen spun to gape at Ten.\u003c/p\u003e\n\u003cp\u003eHe glanced around for Noel. When he was assured his wife’s brother was busy, he held up a finger in my direction. “For your information, I don’t share my woman with just anyone, thank you very much. You are the only person I have ever asked to be our number three. I mean, I was momentarily tempted to ask Amisha, Caroline’s new friend from the filmography department, because she’s so fucking hot, but I figured she’d probably take the offer to heart, so...I chose you. That should make you feel lucky.”\u003c/p\u003e\n\u003cp\u003e“Wow, you know, I do. I am so lucky you hit on me...right in front of your wife.”\u003c/p\u003e\n\u003cp\u003e“He’s such a loser,” Asher agreed.\u003c/p\u003e\n\u003cp\u003e“Whoa, whoa, whoa,” Ten spit out, scowling. “I did not hit on you. Damn. I very nicely asked if you’d consider being in a threesome with us, because one, you knew I wasn’t being seriously serious. Two, of course I did that shit in front of Caroline. It’d be sleazy, slimy, and, you know, cheaterish if I hadn’t.”\u003c/p\u003e\n\u003cp\u003e“Oh, because I’m sure your offer sounded just so classy otherwise,” Aspen dryly intoned.\u003c/p\u003e\n\u003cp\u003eTen ignored her and held up a third finger. “Three, even if hypothetically, you agreed, I never had plans to touch you. I just wanted you to buddy up with me so we could pleasure Caroline together, like a team.”\u003c/p\u003e\n\u003cp\u003eI slapped a hand to my forehead and sighed. “Lord, please don’t tell me there’s a four.”\u003c/p\u003e\n\u003cp\u003e“And four.” Ten grinned, wiggling his eyebrows. “You knew you were feeling the chemistry with her that night you two met. I mean, I could feel the vibes you ladies were putting off all the way across the bar. Sure, her idea of the perfect threesome,” he paused to roll his eyes, “is two guys and one girl, but fuck that. This is my theoretical daydream, and I say two chicks and one dude. However, she did admit that if she ever did allow another woman in bed with us, it’d be you.”\u003c/p\u003e\n\u003cp\u003e“Aww.” I pressed a hand to my heart. “I can’t believe she chose me. Caroline is such a sweetheart.” I glanced at Aspen and smiled from the compliment. “I love her.”\u003c/p\u003e\n\u003cp\u003eTen wiggled his eyebrows. “Yeah, you want to kiss her, don’t you?”\u003c/p\u003e\n\u003cp\u003eMy smile died flat. “You’re impossible.”\u003c/p\u003e\n\u003cp\u003e“I’m just saying. She can do amazing things with her tongue.” He winked. “Think about it.”\u003c/p\u003e\n\u003cp\u003eNoel returned, carrying two of the biggest Bahama Mamas I’d ever seen.\u003c/p\u003e\n\u003cp\u003eAs Aspen snagged hers and began to chug, I hooked my thumb Ten’s way. “Noel, I can’t even begin to imagine why you let this guy marry your sister.”\u003c/p\u003e\n\u003cp\u003eHe sighed and sent Ten a hard scowl as if to ask what he’d said about Caroline this time. But Ten only grinned.\u003c/p\u003e\n\u003cp\u003eNoel turned back to me. “Unfortunately, he snuck her off behind my back, and they eloped.”\u003c/p\u003e\n\u003cp\u003eMy eyebrows spiked. “Really?”\u003c/p\u003e\n\u003cp\u003eNoel motioned to Ten. “Why do you think half his face is so mangled?”\u003c/p\u003e\n\u003cp\u003eTen snorted. “Oh, whatever, fucker. You only wish you could make this much art.” Glancing at me, he said, “I fell into a river.”\u003c/p\u003e\n\u003cp\u003e“Ahh.” I sipped on my straw, studying his scars. There really did seem to be an artistic bent to them. And the coloring was... Wait. “Do you have a black eye?”\u003c/p\u003e\n\u003cp\u003eHe sent me a proud smirk. “You like it? I swear, this is my favorite shiner yet.”\u003c/p\u003e\n\u003cp\u003eI shook my head, confused. “Huh?”\u003c/p\u003e\n\u003cp\u003e“Ten has a habit of getting black eyes from people,” Aspen explained before she glanced at him. “Who gave you this one?”\u003c/p\u003e\n\u003cp\u003e“Hmm. Sorry, that’s confidential.” His gaze strayed to the new guy. “But I’ll tell you...I’m seriously impressed with his right hook.”\u003c/p\u003e\n\u003cp\u003eI glanced that way too, but the bartender’s back was to us as he counted out bills from the cash register. He seemed massively wide. And his arms... God, those things were ridiculous. If he’d been the one to throw the punch, then I didn’t doubt Ten; I bet he could pack a mean blow. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-60.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
