{"id":75696,"no":61,"title":"Page 61","content":"\u003cp\u003eI turned back to my crew when Asher stamped another kiss to my cheek. “I gotta get back to work,” he announced. “But really, I can be next in line if you want. I have good teeth, a pretty smile, and the best damn singing voice you’ll ever hear.”\u003c/p\u003e\n\u003cp\u003eI laughed and shoved at his arm, because I knew he was as serious about dating me as Ten was about making me his number three. These guys thought of me as a sister, someone to tease and protect. Not girlfriend material. “Get back to work, Rock Star,” I told him.\u003c/p\u003e\n\u003cp\u003eHe grinned and saluted me, then took off. Ten disappeared seconds later, leaving Aspen and me at the bar to get back to work on our drinks. We talked and laughed and after another Godzilla-sized Bahama Mama each, we danced. Mason bumped into us at one point, and even he had to give me a hug in sympathy, telling me he’d send his woman Reese around to cheer me up sometime.\u003c/p\u003e\n\u003cp\u003eHours later, I decided I loved this place. I loved the noise and music, and every single one of the hunky brotherly bartenders who went out of their way to cheer me up. I sat slumped on a stool at the bar, leaning a little too heavily against Aspen as I polished off my umpteenth drink and made a decision. Since this was an important enough declaration, I had to lift a proprietary finger into the air as I made it. “Tha’s it. I’m done with men. Forever and ever.”\u003c/p\u003e\n\u003cp\u003e“That new bartender keeps checking you out,” Aspen slurred into my ear, not listening to a freaking word I’d just said.\u003c/p\u003e\n\u003cp\u003e“Huh?” I glanced over, but he was already in the process of turning away. I scowled at his backside, even though he had a nice one. A very nice one. Hmm. It figured. I think only the sexiest men alive were allowed to bartend at Forbidden. It had to be some kind of decree written somewhere, or something.\u003c/p\u003e\n\u003cp\u003eMy drinking buddy nudged my elbow. “So? What do you think? I think he’s yummy.”\u003c/p\u003e\n\u003cp\u003eI sent her an incredulous glance because I’d never heard her appreciate anyone’s sexiness except Noel’s before, and every freaking bartender who worked at Forbidden was hotter than sin.\u003c/p\u003e\n\u003cp\u003eWhen she wiggled her eyebrows, letting me know she’d had one too many to drink, I snorted out a laugh. Aspen was adorable and hilarious when she drank.\u003c/p\u003e\n\u003cp\u003eShe leaned into me and whispered loudly, “I think you should ask him if you can ride his disco stick. You know, to help you repound from Cameron.”\u003c/p\u003e\n\u003cp\u003eI snorted and slapped a hand over my mouth. “You mean, rebound?”\u003c/p\u003e\n\u003cp\u003e“Tha’s what I said.” Her brow crinkled with confusion. “Wasn’t it?”\u003c/p\u003e\n\u003cp\u003e“Sure,” I murmured, since re-pound seemed just as apt a term for what she was talking about.\u003c/p\u003e\n\u003cp\u003e“So?” She went back to nudging my elbow. “What do you think of him?”\u003c/p\u003e\n\u003cp\u003eI reluctantly returned my gaze to the new guy. He was half turned away this time. From the side profile, something about him rang strangely familiar, and it sent a zinger I wasn’t expecting through all my girly parts. I blinked, wondering where the heck that had come from. Then he turned fully away, and the bulkiness and breadth of his shoulders brought back a complete stranger’s profile, which knocked some reality back into me.\u003c/p\u003e\n\u003cp\u003eHe really was a massive work of perfection, but I felt uncomfortable by the unexpected way just looking at him had made my body react. Guilt bit at my conscience because I’d only ever experienced such an instant physical craving for one other person in my life. So I said, “Meh. Too dark and brooding for my taste.”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Aspen chewed on her straw as she watched him. “I think there’s something hot about it. Like you just want to soothe his tortured soul.”\u003c/p\u003e\n\u003cp\u003eI snorted. “And what’s up with the overly tight T-shirt?” Okay, now I was just trying to find details to nitpick since I was done with men forever and ever, and maybe because I really didn’t like the way I kept envisioning myself ripping that tight T-shirt off him and just sinking my claws into his pecs before licking them. “I mean, yes, you’re built, buddy. We get it.”\u003c/p\u003e\n\u003cp\u003eAs Aspen snorted out a laugh, the new bartender turned his head just enough to the side, as if listening in on something...like our conversation.\u003c/p\u003e\n\u003cp\u003eI gulped and flinched back, even though there was no possible way he could’ve heard me in this loud, crowded place all the way at the other end of the counter. Could he?\u003c/p\u003e\n\u003cp\u003eI decided to quit bashing him, even though man bashing had felt fun. But he was a stranger—not Cam—and he hadn’t done anything to deserve my scorn.\u003c/p\u003e\n\u003cp\u003e“I think I’ll leave his disco stick alone,” I told Aspen.\u003c/p\u003e\n\u003cp\u003e“Okay, whatever.” She shrugged, letting me know it didn’t matter to her. “I’m just saying, if he was good enough for Pick to hire, he can’t be half bad.” Then she sucked down the last of her drink.\u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-61.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
