{"id":75697,"no":62,"title":"Page 62","content":"\u003cp\u003eNoel appeared in front of us and took Aspen’s drink away. “That’s it, ladies. No more alcohol for either of you. The bar’s about to close, anyway. And just so you know, you’re both riding back to the house with me. We’ll pick up whoever’s car you drove here in the morning.”\u003c/p\u003e\n\u003cp\u003e“Mine,” I said, lifting my hand.\u003c/p\u003e\n\u003cp\u003eHe snorted. “Then it’ll be fine. No one would even think about bothering that hunk of junk.”\u003c/p\u003e\n\u003cp\u003e“Hey, that’s my baby you’re offending.” Even though he was right, it was the crappiest car ever. At least it got me where I wanted to go...most of the time.\u003c/p\u003e\n\u003cp\u003e“Oh, God.” Aspen moaned and slapped a hand over her mouth. “I think I’m gonna be sick.”\u003c/p\u003e\n\u003cp\u003e“Shit.” Noel leapt over the bar and wrapped an arm around her waist. “I knew I should’ve cut you off sooner. Come on, baby. I’ll help you to the bathroom.” As he gently led her away, I sighed after them, jealous of their relationship. With a little moan of depression, I flopped my forehead onto the bar and tried to will my life to a better place.\u003c/p\u003e\n\u003cp\u003eWhen I reminded myself I wasn’t puking my guts out like my best buddy, I felt better. My life could be worse. But then I felt shitty because I shouldn’t be smug that I wasn’t sick and Aspen was. I didn’t realize I was still holding on to my empty glass until someone tried to ease it out of my hand.\u003c/p\u003e\n\u003cp\u003e“Oh! Sorry.” I sat up, releasing my grip. But the new bartender had already turned away and was walking off with my empty cup. I stared after him, curious, wondering how Pick had found him and what his story was. Then I wondered if he talked. I hadn’t heard him talk once tonight, had I?\u003c/p\u003e\n\u003cp\u003eI swear he had the slightest bit of a limp when he moved a certain way. It tugged at my inner healer until I could picture me running my hands up his strong, thick thighs and kissing them all better again.\u003c/p\u003e\n\u003cp\u003eAnd...what the hell? Why did I keep having these overly sexual thoughts about a complete stranger? I never had—crap! Had someone put something in one of my drinks? Maybe I’d been roofied.\u003c/p\u003e\n\u003cp\u003eBut, no. That made no sense. Noel had served me all my drinks, and besides, no one had tried to take advantage of me.\u003c/p\u003e\n\u003cp\u003e“Hey, Felicity,” Mason called from across the bar. I glanced over and was shocked to see the place was empty, and the guys had already cleaned up.\u003c/p\u003e\n\u003cp\u003eWhen the hell had they done that?\u003c/p\u003e\n\u003cp\u003eGod, just how out of it was I?\u003c/p\u003e\n\u003cp\u003e“Huh?” I called, waving at him and realizing I had been listening to Asher singing in the background of my consciousness. He always sang after hours during cleanup, which really should’ve clued me in to what had been going on around me.\u003c/p\u003e\n\u003cp\u003e“I’m taking off,” Mason told me, “but uh, there’s some lady outside, says she knows you.”\u003c/p\u003e\n\u003cp\u003e“Well, let her in.” I waved her forward, even though he hadn’t let her in yet and I couldn’t even see who he was talking about. “I’ll talk to some lady.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Okay, then.”\u003c/p\u003e\n\u003cp\u003eAs he left, the unknown woman entered and hurried my way. She had kind of an angry stride, and at first, I had no idea who the hell she was. But then she marched closer, and I suddenly recognized her, even though I’d only seen her once before.\u003c/p\u003e\n\u003cp\u003e“Oh, heeeey! Hi.” I waved and sent her a huge smile. “You’re that ho-bag who slept with my boyfriend. Sorry, I didn’t recognize you at first, what with your clothes on, and you know, Cam’s penis not inside you.”\u003c/p\u003e\n\u003cp\u003eI laughed at my joke, but she didn’t seem to find it very funny. Hmm, guess Cam preferred the dryer type.\u003c/p\u003e\n\u003cp\u003eStopping directly in front of my stool, she self-righteously fisted her hands to her hips and glared. “You were trying to have a baby with him?”\u003c/p\u003e\n\u003cp\u003e“Huh?” I cocked my head to the side, having no idea what she was talking about. “You should probably lay off the bad mushrooms, lady. You’re not making any sense.”\u003c/p\u003e\n\u003cp\u003e“Oh, so you deny it?” She whipped a box out of her purse and shoved it in my face. “Explain why this was in our bathroom trash then, bitch.”\u003c/p\u003e\n\u003cp\u003eI took issue with the bitch reference, but whatever she was sticking in my face smelled really raunchy, probably because she’d pulled it out of a wastebasket.\u003c/p\u003e\n\u003cp\u003e“Eww.” I shoved it back enough to focus on what it was until I realized it was the box from the first pregnancy test I’d taken days ago.\u003c/p\u003e\n\u003cp\u003e“Oh, right. That. No... Good God, no! I was totally not trying to have a baby with him, yuck. But my period was late, so I started to worry, and I took the test, but it’s all good, I’m not. And my period finally came today.” Evil karma-striking witch. “So, yeah...whew, huh?” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-62.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
