{"id":75642,"no":7,"title":"Page 7","content":"\u003cp\u003eI slowed to a stop, watching her, my anger draining into a nagging, itching sensation I concluded might be concern.\u003c/p\u003e\n\u003cp\u003eWhen she finally drew her driver’s side door open like an old decrepit woman, my Spidey sense kicked in, telling me something was definitely not right. She put out a hand, then swung out a leg, but when she went to stand, she gasped and fell back into the driver’s seat. As her face tipped forward, contorting with pain, I took a step her way, then paused and glanced around to make sure someone else wasn’t already moving in to check on her. But no one else had noticed her.\u003c/p\u003e\n\u003cp\u003eDamn it. Someone else should handle this. Not me. I wasn’t the best candidate for helping a woman in trouble.\u003c/p\u003e\n\u003cp\u003eShe finally heaved herself from the car with a sob, and I saw how large her stomach was. Cradling her pregnant belly, she stumbled toward the curb. The same moment I noticed a trickle of blood running down the inside of her leg, she tripped and started to fall.\u003c/p\u003e\n\u003cp\u003e“Whoa. Hey.” I dashed to her and barely caught her in time.\u003c/p\u003e\n\u003cp\u003eShe clutched my upper arms, her fingers digging in hard as if the grip was helping her stanch the pain. Lifting her face, she managed to say between shallow breaths, “I’m sorry...did I...almost...run you over?”\u003c/p\u003e\n\u003cp\u003e“Fuck that.” I helped her straighten back into a stand. “I’m fine. Are you okay?”\u003c/p\u003e\n\u003cp\u003e“I’m—oh!” She doubled over and began to crumple, letting go of me to grab her stomach. I kept her upright and she leaned her bowed head into my sternum as a moan of agony tore from her throat. “Something’s wrong,” she said after considerable panting. “I need to call my husband. Left my cell phone at home. So stupid.”\u003c/p\u003e\n\u003cp\u003e“We’ll call him from the hospital,” I said.\u003c/p\u003e\n\u003cp\u003e“No!” She choked out a sob and started to cry. “I don’t want to go to the hospital. I don’t want to lose my baby.”\u003c/p\u003e\n\u003cp\u003e“You’re going to be fine.” I clenched my teeth when I heard my too gruff reply, hoping my voice hadn’t scared her. “The hospital will help you save it.”\u003c/p\u003e\n\u003cp\u003eWhen she didn’t shy away, I slipped an arm under her legs at the knees and wound the other around her back before I lifted her off the ground. I didn’t know what else to say, what else to do. So I kept murmuring stupid shit, like how I was going to get her someplace safe so they could take care of her and make everything better. I had no idea if I was spouting off lies or not, but the words seemed to settle her as I carried her to the passenger side and opened the door.\u003c/p\u003e\n\u003cp\u003eAfter placing her inside, I dashed to the opened driver’s door and climbed behind the wheel. As soon as I sank into a cushioned leather seat, a shock wave of déjà vu and uncertainty claimed me. This was a nice car. An ex-con like me, twenty minutes free from the pen, should not be driving a car like this.\u003c/p\u003e\n\u003cp\u003eBut when the pregnant girl sucked in another breath of pain, I refocused on my main mission. Get her help. Fuck everything else.\u003c/p\u003e\n\u003cp\u003eGrasping the gearshift, I glanced behind me and reversed from the parking spot. “Is the hospital still on Twentieth and McClellan?”\u003c/p\u003e\n\u003cp\u003eShe shook her head and squeezed her eyes closed, her hand cradling her stomach in place. “I don’t...yes, maybe. That sounds right.”\u003c/p\u003e\n\u003cp\u003eThat was good enough for me. Checking traffic, I pulled onto the road, and a disorienting wave clouded me. It’d been too long since I’d last driven a vehicle. A blurry image of bright red hair filled the inside of my head, a girl’s laughter as I peeled out rang through my ears, and my nostrils flared as if I could still smell her flowery scent while I followed her over the center console and into the backseat.\u003c/p\u003e\n\u003cp\u003eBlinking the memories away, I shook my head and concentrated on traffic. But the pregnant woman’s pain grew thick, her breaths shorter and whimpers louder.\u003c/p\u003e\n\u003cp\u003e“How you doing?” I asked with a quick glance her way.\u003c/p\u003e\n\u003cp\u003eHer cheeks were even paler than her blonde locks as she sniffed and wiped at some of her tears. “I can’t believe I did this. I’m so stupid.”\u003c/p\u003e\n\u003cp\u003e“No, you’re not,” I tried to reassure her but only made her jump when I cursed and slammed on the brake before honking the horn and snarling more obscenities at the SUV who’d just cut us off. When I had to brake again at a red light, I risked another glance her way. She wasn’t faring any better than she’d been thirty seconds before. “It’s not your fault this is happening.”\u003c/p\u003e\n\u003cp\u003eBut she bobbed her head, her wet eyes apologizing as she looked at me. “It is. I’m on bed rest; I wasn’t supposed to leave the house.”\u003c/p\u003e\n\u003cp\u003eThe light turned green. I got us through the intersection and drew in a breath, trying to calm myself so I could help her. “I’m sure you had a good reason to leave.” Maybe talking would keep her mind off things.\u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-7.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
