{"id":75710,"no":75,"title":"Page 75","content":"\u003cp\u003eHe took a sudden interest in his feet and mumbled something that sounded a lot like, “No.”\u003c/p\u003e\n\u003cp\u003eMy jaw dropped. “Excuse me? Did you just say no?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I just don’t see the point.”\u003c/p\u003e\n\u003cp\u003eI shook my head, my mind utterly blown.\u003c/p\u003e\n\u003cp\u003e“The point in what? In talking? But...what?” Was he insane? “It’s been six years. There’s like a million things to catch up on. We need to talk.”\u003c/p\u003e\n\u003cp\u003eA muscle in his jaw twitched, the one and only sign I’d gotten so far that this encounter might in any way be difficult for him. But then he hitched up one shoulder. “I don’t have anything to say.”\u003c/p\u003e\n\u003cp\u003e“How could you not...but what about...oh my God! Of course we have shit to say. We never even officially broke up.”\u003c/p\u003e\n\u003cp\u003e“We’re broken up,” he told his feet.\u003c/p\u003e\n\u003cp\u003eI almost clutched my heart because it felt as if he’d just stabbed it. Gaping, I shook my head. “Can you look me in the eye when you tell me that?”\u003c/p\u003e\n\u003cp\u003eHe lifted his tortured brown eyes. “I don’t want to talk,” he said softly.\u003c/p\u003e\n\u003cp\u003eI wanted to pull my hair and scream. I wanted to hit him in the chest with both of my fists.\u003c/p\u003e\n\u003cp\u003eNo, I just wanted to grab him hard and yank him against me and kiss him, hug him, force him to admit he missed me just as hard as I’d missed him and that he was happy to see me.\u003c/p\u003e\n\u003cp\u003eBut he only looked away.\u003c/p\u003e\n\u003cp\u003eThe bastard couldn’t even watch as he broke my heart.\u003c/p\u003e\n\u003cp\u003eMy pain snapped into rage. “Well, I do! You might not have anything to say, but I have plenty. The last time I saw you, you swore you didn’t blame me for what happened.”\u003c/p\u003e\n\u003cp\u003eHe still refused to look at me, but his dark eyebrows furrowed in confusion. “I don’t.”\u003c/p\u003e\n\u003cp\u003e“Then why are you treating me like this?”\u003c/p\u003e\n\u003cp\u003eHe squeezed his eyes closed and bowed his head as regret passed over his features. It was the most emotion he’d shown me in six years.\u003c/p\u003e\n\u003cp\u003eHope flared inside me. This was it. Finally, he was going to open up to me and talk about...whatever was causing this inhuman behavior of his.\u003c/p\u003e\n\u003cp\u003eBut, nope. False alarm. He turned away to head down the hall away from Pick’s apartment, saying something in his gravelly voice that sounded like, “I can’t do this.”\u003c/p\u003e\n\u003cp\u003e“Do what?” I demanded, utterly confused and dogging his steps. “Why can’t you just talk to me? What did I do to make you hate me? Why wouldn’t you even see me when I came to visit you in prison?”\u003c/p\u003e\n\u003cp\u003eHe stopped in his tracks, and tipped his head to the side as if to put his ear toward me to hear better. “You came? To the prison?”\u003c/p\u003e\n\u003cp\u003e“Of course.” A tear slipped down my cheek, but I didn’t care about hiding it from him this time. “The first freaking chance I had. I was there the day I turned eighteen and was a legal adult.”\u003c/p\u003e\n\u003cp\u003eI’d finally been allowed visitation rights without parental consent. And the only thing I’d wanted for my birthday was to see his face. I would’ve been happy for only a few minutes as long as I could’ve gotten the chance to smile at him and tell him again that I still loved him. That I was still waiting for him.\u003c/p\u003e\n\u003cp\u003eIt had broken my heart when the guard had turned me away.\u003c/p\u003e\n\u003cp\u003eA dark cloud passed over Knox’s face. “Your birthday? I wasn’t...” He flinched, but then continued. “I wasn’t allowed visitors that day.”\u003c/p\u003e\n\u003cp\u003eI opened my mouth to ask, but that haunted pallor on his face made me close my mouth, hoping he’d tell me.\u003c/p\u003e\n\u003cp\u003eHe didn’t, of course.\u003c/p\u003e\n\u003cp\u003eSighing, I decided maybe I needed to be the one to open up before he would. I had no idea what had happened to him to change him this much, but I was determined to find out.\u003c/p\u003e\n\u003cp\u003eSo I laid all my cards on the table, face up. “I waited for you,” I confessed.\u003c/p\u003e\n\u003cp\u003eSlowly, he looked up, his brown eyes a little glossy and wet.\u003c/p\u003e\n\u003cp\u003e“I waited for you for four years with no word from you whatsoever. And I would’ve waited more...until two weeks before you were supposed to be released, I learned you’d killed two people. And one of them just happened to be the son of my father’s lawyer.”\u003c/p\u003e\n\u003cp\u003eHe didn’t react at all. No regret, no anger, no explanation, no nothing.\u003c/p\u003e\n\u003cp\u003eI lifted my hands in frustrated defeat. “And suddenly those two weeks left to wait became thirty more years.” My voice broke. “I couldn’t wait thirty years, Knox.”\u003c/p\u003e\n\u003cp\u003eHis eyes were sad when they shifted my way. “You shouldn’t have even waited four.”\u003c/p\u003e\n\u003cp\u003eI sniffed. “No, I guess I shouldn’t have. You kept us apart by killing him. You know that, right? When you showed me that your need for vengeance meant more to you than getting out to be with me, you slaughtered everything we could’ve had together. You are the one who kept us apart.” Shaking hard, I wrapped my arms around my chest, hugging myself. “I just hope it was worth it for you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-75.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
