{"id":75643,"no":8,"title":"Page 8","content":"\u003cp\u003e“My husband...” she started, fresh tears spilling down her cheeks. “His birthday’s this weekend. I wanted...I needed to get him a present.”\u003c/p\u003e\n\u003cp\u003e“What did you get him?” I asked as 20th Street came into view. Thank God.\u003c/p\u003e\n\u003cp\u003eThe woman made a sound of pain. “Two...two tickets to the science museum.” A brief pain-filled smile drifted across her face. “He loves science.”\u003c/p\u003e\n\u003cp\u003eI nodded. “He’ll like that, then.”\u003c/p\u003e\n\u003cp\u003eBut my answer only made her squeeze her eyes shut and cry harder. “Not if I k-killed our baby.”\u003c/p\u003e\n\u003cp\u003e“No, don’t even think that way. You didn’t kill anything. Fucker,” I muttered when some dumbass turned in front of us to only go ten miles per hour. I swerved around him.\u003c/p\u003e\n\u003cp\u003eThree blocks left. St. John’s rose up from its surrounding buildings, its bright red hospital cross on the side, a beacon of hope. Almost there. “How far along are you?”\u003c/p\u003e\n\u003cp\u003e“Sev...seven and a half months. Only thirty weeks.”\u003c/p\u003e\n\u003cp\u003eI reached out and covered her trembling hand on her stomach and squeezed briefly as I turned into the hospital’s parking lot. “Your baby will be fine.”\u003c/p\u003e\n\u003cp\u003eShe looked at me, her eyes brimming with tears, and in that moment I knew she believed me because everything around her calmed.\u003c/p\u003e\n\u003cp\u003e“Will you call Quinn for me? Tell him...”\u003c/p\u003e\n\u003cp\u003eWhen I parked at the entrance of the emergency room, she turned and looked up at the glass-fronted foyer. Her composure from moments ago dissolved. Sobbing uncontrollably, she hugged herself tight. “I want Quinn.”\u003c/p\u003e\n\u003cp\u003eI left her briefly to hurry around the car to her side. There was even more blood than before, but I didn’t let my gaze linger on that. I scooped her into my arms and spun her toward the entry doors that slid open for us. Someone must’ve seen us coming; a nurse was already pushing an empty wheelchair our way.\u003c/p\u003e\n\u003cp\u003eAfter I set the woman down, she looked up at me with fear and panic, watching me take a step back while half a dozen more medical workers swarmed her. They barraged her with questions, but she kept watching me, her gaze begging.\u003c/p\u003e\n\u003cp\u003e“You’ll get Quinn? My husband.”\u003c/p\u003e\n\u003cp\u003eI nodded. “Of course.”\u003c/p\u003e\n\u003cp\u003eThat seemed to quiet her. She turned her face aside to answer a nurse’s question, and they whisked her away, leaving me standing there like a clueless dumbass.\u003c/p\u003e\n\u003cp\u003eI glanced back at the silver Lexus, its engine still running in front of the opened hospital entrance. Realizing I had no idea what the woman’s name had been, or how to contact her husband Quinn, I lifted my hands to wipe my face. But something red on my palms made me stop. My fingers froze halfway to my mouth, and I swallowed at the sight of fresh blood coating my skin. A wave of nausea swept over me.\u003c/p\u003e\n\u003cp\u003eBlood on my hands.\u003c/p\u003e\n\u003cp\u003eThe last time I’d looked down and found blood dripping from my fingers, I’d just killed two men.\u003c/p\u003e\n\u003cp\u003eHe returned a week later. I hadn’t honestly taken him at his word when he’d said he’d smear baby poop on my brother’s bed for every diaper he had to change. But there he appeared in the doorway to Garrett’s room when I was exiting my own to head downstairs one evening.\u003c/p\u003e\n\u003cp\u003eWe both stopped cold, wide-eyed and caught in the act.\u003c/p\u003e\n\u003cp\u003eFinally, I scowled and set my hands on my hips. “You did not,” I whispered harshly. “Not again?”\u003c/p\u003e\n\u003cp\u003eHis grin was instant and so cute it melted my frown to mush. Then he gave a careless little shrug.\u003c/p\u003e\n\u003cp\u003eWith a roll of my eyes, I muttered, “Oh, but let me guess. You didn’t steal anything, right?”\u003c/p\u003e\n\u003cp\u003eLifting his hands, he turned them to show me his clean palms. “Not even that brand new laptop on his desk.”\u003c/p\u003e\n\u003cp\u003eI sighed and shook my head. “You can’t keep doing this. You’re going to get caught.”\u003c/p\u003e\n\u003cp\u003eHis gaze scrolled down my body, making me warm enough to remember I wore nothing but shorty shorts and a tank top. Then he murmured, “I haven’t gotten caught yet?”\u003c/p\u003e\n\u003cp\u003e“Uh, excuse me?” I lifted an eyebrow, playing indignant. “And just what do you think me coming out of my room and seeing you here is called?”\u003c/p\u003e\n\u003cp\u003e“Luck?” He flashed me another grin that, yeah, turned me into one of those girls—those stupid girls who abandoned all thought and reason for a pretty boy smile.\u003c/p\u003e\n\u003cp\u003eMy brain jumbled; I didn’t even know how to respond. A giddy blush rose up my throat, but I swallowed it back down. I couldn’t help the feeling, though; I liked thinking he considered running into me as lucky.\u003c/p\u003e\n\u003cp\u003eExcept I couldn’t let him know that.\u003c/p\u003e\n\u003cp\u003eI forced a scowl. “I hope you have a good escape route planned because—” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-8.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
