{"id":75720,"no":85,"title":"Page 85","content":"\u003cp\u003eHis shoulders deflated a little and he nodded. Sorrow filled his face. “I swear, the happy memories get to you the most. Make you feel like you’re trying to breathe through grinding sawblades or some shit.”\u003c/p\u003e\n\u003cp\u003eI drew in a sharp breath and nodded, feeling those blades now as Bentley’s innocent little blue eyes and red hair wavered to the forefront of my mind. Then Mercy’s smile as she danced around the kitchen with Hash, Speed and Cobra having a jousting match with empty toilet paper rolls they’d taped together.\u003c/p\u003e\n\u003cp\u003eYeah, the happy memories did hurt the most.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Ten murmured, echoing my thoughts. He nodded, patted me more softly on the arm, and moved out from behind the bar, calling out to all the waitresses and the waiting doorman that it was time to open.\u003c/p\u003e\n\u003cp\u003eI turned to watch him, and almost jumped out of my skin when I found Felicity right there, on the other side of the counter, frowning as she darted her gaze between me and Ten.\u003c/p\u003e\n\u003cp\u003e“What’re you doing here?” I demanded, giving an internal wince at how hard and accusing my voice sounded.\u003c/p\u003e\n\u003cp\u003eObviously not expecting the question, she yelped and dropped the box of napkins she’d been stuffing.\u003c/p\u003e\n\u003cp\u003eWide blue eyes gaped at me. “I...I’m working,” she stuttered before frowning and gritting her teeth as if mad at herself for flinching away from me.\u003c/p\u003e\n\u003cp\u003eI shook my head. “You’re not on the schedule.”\u003c/p\u003e\n\u003cp\u003eHer eyebrows crinkled. “Mandy has a sick kid, so I’m filling in her for her.”\u003c/p\u003e\n\u003cp\u003e“Does Pick know?”\u003c/p\u003e\n\u003cp\u003eSputtering, she shook her head. “I don’t think so. Why? If we can find a replacement, we don’t bother him with little changes here and there.”\u003c/p\u003e\n\u003cp\u003eShit, I was stuck working with her for a full night. And she looked really good in that black Forbidden shirt, blue jean skirt and half apron tied snug around her waist.\u003c/p\u003e\n\u003cp\u003eI drew in a sharp breath as quietly as possible. But, damn. Why did she still have to be so fucking breathtaking?\u003c/p\u003e\n\u003cp\u003e“Oh,” was all I mumbled as I began to turn away.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” she snipped at my back, her tone turning sharp. “I won’t try to make you talk tonight. I’ve completely lost the desire to say anything to you, anyway.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes and tried not to break as the sound of her tears in the stairwell of Pick’s apartment building echoed through my ears.\u003c/p\u003e\n\u003cp\u003eIt was best to be distant with her, I repeated to myself. It was best for her if I pushed her away.\u003c/p\u003e\n\u003cp\u003e“Though I did forget to tell you I’m sorry about your family.” Losing the acidity in her voice, she turned slightly sympathetic, which was even harder to resist. “I just learned yesterday that you didn’t know until you were released.”\u003c/p\u003e\n\u003cp\u003eI nodded, letting her know I’d heard her and hoping she’d move away. But I didn’t hear her leave.\u003c/p\u003e\n\u003cp\u003eI didn’t like her knowing that no one had told me my family died. It was exactly the kind of thing that would stir up her bleeding heart. And the last thing she needed was to feel any kind of compassion toward me. If I was going to successfully keep her away, she needed to loathe me.\u003c/p\u003e\n\u003cp\u003eExcept I’m pretty sure I didn’t have the heart to be cruel enough to drive her off for good.\u003c/p\u003e\n\u003cp\u003eBehind me, City spoke again. “I still leave flowers at Bentley’s grave, in case you ever want to know where she’s buried.”\u003c/p\u003e\n\u003cp\u003eAww, Jesus. A sob escaped and I immediately bumped a fisted hand to my mouth. I think my knees maybe even buckled, but maybe not because I managed to keep standing. It only felt as if the world had been knocked out from under me. Dizziness assailed me as I glanced back at the woman I loved.\u003c/p\u003e\n\u003cp\u003eTears had filled her lashes, but she wasn’t outright crying.\u003c/p\u003e\n\u003cp\u003eI lowered my hand enough to rasp, “Okay,” and she nodded, sending me a small smile before turning and moving away.\u003c/p\u003e\n\u003cp\u003eThe day of the cotillion seemed particularly hot and muggy. As I pulled on my mauve dress that mother had called puce, I groaned. This suffocating thing was going to stifle me in the heat even more. So I paused before slipping the straps over my shoulders to draw in one last fresh breath. Since the top part of my back would be exposed before the bottom part tied together corset style, I couldn’t wear a bra.\u003c/p\u003e\n\u003cp\u003eI took a moment to gaze at my bare breasts in the mirror, remembering Knox’s mouth on them. They were a little sore today, in a good achy way. Whenever I thought about what we’d done, the ache would spread, blossoming out my nipples and down between my legs. I wished he were here now, so I could press down against the hardness under his jeans and relieve some of this pulsing throb.\u003c/p\u003e\n\u003cp\u003eI was horny, I realized with a start, and it made me laugh. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-85.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
