{"id":75644,"no":9,"title":"Page 9","content":"\u003cp\u003eThe clatter of footsteps on the stairs squashed my lecture short. The Parker boy and I gaped at each other. He began to edge in reverse, back into Garrett’s room, but from the sounds of the voices approaching, Garrett and his friend Tad were the two coming up, which meant they’d surely discover anyone in his room within moments.\u003c/p\u003e\n\u003cp\u003eWithout pausing to think my decision through, I waved him forward. “Quick. In here.”\u003c/p\u003e\n\u003cp\u003eHis gaze flashed toward the stairs. A breath later, he darted to me. I grabbed his arm and yanked him into my room, shoving the door shut behind us just as I saw the top of someone’s head clear the second level.\u003c/p\u003e\n\u003cp\u003eI covered my mouth with my hand, breathing hard into my palm. Oh man, that had been close. I looked up at the boy to see if he shared my thoughts, but he was too busy staring into my room with a look of horror.\u003c/p\u003e\n\u003cp\u003e“Is this your bedroom?”\u003c/p\u003e\n\u003cp\u003eI frowned and leaned past him to try to view my room as if I were seeing it for the first time, because seriously, what the heck did he mean, saying it like that? It didn’t look that bad to me. It wasn’t all pink, and frilly, or overly girly at all. In fact, it was decorated in tones of blue. I didn’t even have pictures of my favorite male movie stars tacked to my walls, mainly because my mother would’ve disowned me if I had, though a life-sized poster of Stephen Amell would’ve looked so good right above my bed.\u003c/p\u003e\n\u003cp\u003eThe covers on my mattress were neatly made, no clothes littered the floor, even my books were all lined precisely on my bookshelves. It was a perfectly respectable bedroom, if I did say so myself.\u003c/p\u003e\n\u003cp\u003e“What’s wrong with it?”\u003c/p\u003e\n\u003cp\u003e“What?” He sounded distracted as he turned to me. I drew in a breath, not realizing we’d been so close. But when he was looking at me, with his gaze boring into mine, it felt as if there was nothing between us. No space. No air. Just him and me.\u003c/p\u003e\n\u003cp\u003e“Nothing,” he finally said, sounding dazed.\u003c/p\u003e\n\u003cp\u003eIt really wasn’t fair that he should be so beautiful. His brown eyes had a golden quality to them today, but his hair still looked as dark and carelessly arranged as it’d been days before, as if he never combed it with anything but his fingers.\u003c/p\u003e\n\u003cp\u003e“Then why did you sound so appalled?”\u003c/p\u003e\n\u003cp\u003eHis golden eyes tweaked with confusion before he looked back into my room. “I didn’t. I just...” He turned back to me. “I shouldn’t be in here.”\u003c/p\u003e\n\u003cp\u003eA quiet laugh blurted from my lips. “You shouldn’t be anywhere in this house.”\u003c/p\u003e\n\u003cp\u003e“Good point.” He opened his mouth to say more, but an enraged shout from Garrett’s room told us my brother had discovered his newest diaper present.\u003c/p\u003e\n\u003cp\u003eI grabbed the boy’s hand and jerked him away from the door, taking him by surprise so that he had to stumble after me. “This way.”\u003c/p\u003e\n\u003cp\u003eI debated where to stash him. The closet? The chest? Under the bed?\u003c/p\u003e\n\u003cp\u003eFootsteps rushed from Garrett’s room; I didn’t have much time to decide. I dragged him into my private bathroom with me. Just as I shut the door and locked it, Garrett stormed into my room roaring, “Felicity!” A second later, his fist pounded on the door in front of me.\u003c/p\u003e\n\u003cp\u003eI yelped quietly and jerked back, stumbling into the Parker boy who caught me against him, making me notice I was still holding his hand.\u003c/p\u003e\n\u003cp\u003eGlancing up into his golden brown eyes, I found a measure of comfort. So I kept peering into them as I called back to my brother. “What? I’m in the bathroom.”\u003c/p\u003e\n\u003cp\u003e“Did you see anyone come through here? Some fucking dead boy?”\u003c/p\u003e\n\u003cp\u003e“Yeah, Garrett. I have a boy in here with me while I shave my legs.” Parker’s eyes widened before I added, “What do you think? Geez, no, I have not seen a boy in here.”\u003c/p\u003e\n\u003cp\u003eA thump reverberated through my door as if my brother had just hit it with his fist in frustration. I jumped and then...I didn’t mean to, but I sank closer to the boy beside me. His fingers tightened reassuringly around mine. When Garrett didn’t try to slam his way into my bathroom, I slumped against the boy, and he seemed to share my relief because he leaned against me in return.\u003c/p\u003e\n\u003cp\u003e“Not a good time to be a smart-ass, Felicity,” Garrett growled. “If you see him, let me know immediately.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I called and rolled my eyes.\u003c/p\u003e\n\u003cp\u003eAnd that was that. Releasing a breath as my brother’s footsteps charged from my room, I smiled at my bathroom companion.\u003c/p\u003e\n\u003cp\u003eBut his confusion was obvious; he didn’t smile back. “You just lied for me.”\u003c/p\u003e\n\u003cp\u003eYeah, I didn’t quite understand why I’d gone to so much trouble for him either. If Garrett ever found out what I’d done, he’d show me the same lack of mercy he’d show his diaper vandal. Except I knew I’d do it the same way again if given a second chance. \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-9.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
