{"id":75725,"no":90,"title":"Page 90","content":"\u003cp\u003eEven Ten noticed, pausing by me and muttering, “Is it just me, or are there a ton of chicks here tonight? It’s not Thursday.”\u003c/p\u003e\n\u003cp\u003eNo, it wasn’t Thursday, and yes, there were definitely a ton of women. They gathered around the bar area too, not waiting for a waitress to come to them, but bringing their orders straight to us.\u003c/p\u003e\n\u003cp\u003e“And they all seem to be Incubus fans,” I noticed.\u003c/p\u003e\n\u003cp\u003e“What?” Ten whipped his head toward the crowd, where about twenty different women were just milling around, sipping from their assorted drinks, and...were they all staring at Asher?\u003c/p\u003e\n\u003cp\u003eTen broke out belly laughing. “Oh, my fucking God. You’ve got to be kidding me. Holy shit, this is too good to be true.”\u003c/p\u003e\n\u003cp\u003e“What?” I asked, slightly startled I was even curious enough to care what he was talking about.\u003c/p\u003e\n\u003cp\u003eHe set a hand on my shoulder and leaned confidentially closer. “Last night, Hart sang some song about this chick he saw singing karaoke a couple months back. Girl had a boyfriend, but she left him with a raging hard-on, and he’s been obsessed with finding her again ever since. Anyway, in the song, he had some lyric about her wearing an Incubus T-shirt and singing—”\u003c/p\u003e\n\u003cp\u003eOn cue, a new karaoke song began, playing a popular hit. I glanced toward the stage, to find three ladies preparing to sing. And they were all sporting different versions of Incubus on their shirts.\u003c/p\u003e\n\u003cp\u003e“Let me guess. It was All About that Bass?”\u003c/p\u003e\n\u003cp\u003eTen groaned. “Aww, hell no. Please don’t tell me all these fucking women are going to sing that one song all fucking night long? Stab me now.”\u003c/p\u003e\n\u003cp\u003eI glanced toward Asher, who was frowning in confusion at the stage, just as one tone-deaf woman started to butcher the opening line.\u003c/p\u003e\n\u003cp\u003e“No, no, NO!” Ten wailed, covering his ears. “I’m going to slaughter Hart for this.”\u003c/p\u003e\n\u003cp\u003eI tipped my head toward Asher. “I don’t think he gets it yet.”\u003c/p\u003e\n\u003cp\u003e“Hart!” Ten bellowed, storming Asher’s way. “You son of a bitch. Look what you’ve done.”\u003c/p\u003e\n\u003cp\u003eAsher whirled to him, utter confusion on his face. I couldn’t hear the conversation that followed, but it consisted of Ten raging and waving his arms in wild anger, and Asher’s expression of bewilderment morphing into horror.\u003c/p\u003e\n\u003cp\u003eHe whipped his head toward all the women at the bar, and as if sensing they finally had his attention, they began to wave and call, “Asher! Over here! Look! Are you sure it wasn’t me in this T-shirt?”\u003c/p\u003e\n\u003cp\u003eJerking backward until he bumped into the back counter, he merely gaped at them before he began to shake his head, denying what was going on.\u003c/p\u003e\n\u003cp\u003eFor the rest of the night, he refused to leave the safety behind the bar. Women were still occasionally able to reach across and grab at him, sometimes even catching bits of his clothes and tugging him closer. But overall, he managed to nervously laugh with them and gently pry their hands away.\u003c/p\u003e\n\u003cp\u003e“Better get used to it now, Hart,” Ten advised at one point. “If you’re going to be some big fucking rock star someday, this is going to be the norm for you.”\u003c/p\u003e\n\u003cp\u003eI was a little afraid Asher was going to vomit at that point.\u003c/p\u003e\n\u003cp\u003eFelicity was able to divert some of the women away from the bar by intercepting them and taking their orders, but a majority slipped past her to pester him. After a while, the three of us came up with a system where Ten and I dealt with customers and Asher stayed toward the back, mixing drinks.\u003c/p\u003e\n\u003cp\u003eWe were halfway through the shift when another diversion arrived to help me keep some of my attention off Felicity. A tall, bulky guy approached the bar. Ten immediately went to him and talked to him for a while, but he mainly kept his curious gaze on me. Then Ten reached across the counter to slug him companionably on the shoulder before he glanced at me and waved me over.\u003c/p\u003e\n\u003cp\u003eI approached warily because I had no idea what this was about. But as soon as I was close enough, the stranger stuck out his hand. “I’m Quinn Hamilton.”\u003c/p\u003e\n\u003cp\u003eI blinked, not expecting that, before I slowly shook with him. He nodded humbly, respect glinting in his gaze.\u003c/p\u003e\n\u003cp\u003e“I just wanted to thank you for everything you did for Zoey. You saved both her and the baby. And they’re my entire life.” Emotion flooded his features. “I don’t know what I’d do without them.”\u003c/p\u003e\n\u003cp\u003eUncomfortable because he was making me feel a strange kinship with him, I couldn’t look him in the eye as I nodded.\u003c/p\u003e\n\u003cp\u003e“If you ever need anything,” he went on, “I would be honored to help.”\u003c/p\u003e\n\u003cp\u003eI nodded again, but it felt really insignificant, so I added a rusty, “Yeah, okay.” Then something I really did want to know hit me. “How’re they doing?” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-90.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
