{"id":75727,"no":92,"title":"Page 92","content":"\u003cp\u003eNodding, he turned back to Asher. “Yep, he needs pussy. Bad.”\u003c/p\u003e\n\u003cp\u003eFelicity whirled from the table she’d been wiping down. I held my breath, wondering if she’d say anything about the last time I’d been with anyone, since she knew every detail about it. But she didn’t even glance my way, which felt like a punch to the solar plexus.\u003c/p\u003e\n\u003cp\u003e“Buck up, Asher.” She set a hand on his shoulder and gazed at him with all the sympathy in the world.\u003c/p\u003e\n\u003cp\u003eI hated every second her fingers lingered.\u003c/p\u003e\n\u003cp\u003e“There’s still hope you’ll find her. It’s only been one night since you sang that song.”\u003c/p\u003e\n\u003cp\u003eWhen he mumbled a non-response, she dropped her hand from him, and I could finally breathe again. Then she went and bumped her shoulder against his with an encouraging grin. “Hey. What did the mute say to the midget?”\u003c/p\u003e\n\u003cp\u003eAfter asking the question, her gaze sought mine.\u003c/p\u003e\n\u003cp\u003eI glowered, my jaw hard and hands fisting at my sides. But...what the hell?\u003c/p\u003e\n\u003cp\u003eHow dare she? How fucking dare she?\u003c/p\u003e\n\u003cp\u003e“Huh?” Asher glanced up with a confused frown.\u003c/p\u003e\n\u003cp\u003eI couldn’t stand here and watch this. Shoving my way from behind the bar, I stormed down the hall to the break room. Once inside with the door shut, I grabbed the coffee table and shoved it over, flipping it upside down and making all the magazines on top fly. I relished the chaos along with the crack and shatter of breaking wood when it landed. Except the hurricane of emotions started again as everything settled onto the floor. So I kicked the couch. Then I whirled to punch the wall.\u003c/p\u003e\n\u003cp\u003eWhen the door came open, I spun around, ready to unload on whoever dared to interrupt me. But seeing her made me jerk to a halt, instantly contrite and ashamed as she took in the mess I’d made.\u003c/p\u003e\n\u003cp\u003e“Well. I guess now I know how to get a reaction out of you.” Her words were steady and conversational as she stepped into the room and closed the door behind her.\u003c/p\u003e\n\u003cp\u003e“What’re you doing back here?” I hated the break in my voice. Every time I spoke, it reminded me of how I’d gotten it, and the helpless rage inside me only grew.\u003c/p\u003e\n\u003cp\u003e“I came to see why you left when I told Asher a joke.”\u003c/p\u003e\n\u003cp\u003eI snorted and had to look away before I said something I’d regret.\u003c/p\u003e\n\u003cp\u003e“Huh, Knox? Did you think that was something exclusive between us, that after you were gone, I’d just stop doing it when I was nervous or distressed or wanted to cheer someone up?”\u003c/p\u003e\n\u003cp\u003eAgony claimed my chest, clamping around it until I could barely breathe. But damn it, maybe I had thought she’d reserved her jokes for me alone. It had been our thing. How the hell could she do it with another man, right fucking in front of me?\u003c/p\u003e\n\u003cp\u003e“Did you have to tell him that joke?” I growled, unable to stop myself.\u003c/p\u003e\n\u003cp\u003eShe released a calm breath. “Yes.” When I slashed a scowl her way, she lifted her chin defiantly. “I had to know how you’d react. If you even remembered.”\u003c/p\u003e\n\u003cp\u003eSomething inside me eased. The anger and jealousy died instantly. Knowing she’d done it because of me thrilled me as much as it killed me...killed me because she really needed to stop caring about my reactions.\u003c/p\u003e\n\u003cp\u003e“Of course I remember,” I snarled, upset and hurting and hating all of this. “I spent six years behind bars because of that summer. I didn’t forget a damn thing.”\u003c/p\u003e\n\u003cp\u003eShe hugged herself, looking suddenly small. The pain in her eyes made me glance away.\u003c/p\u003e\n\u003cp\u003e“I thought you said you didn’t blame me,” she whispered.\u003c/p\u003e\n\u003cp\u003eI closed my eyes. “I don’t.”\u003c/p\u003e\n\u003cp\u003e“Then why are you acting this way? Refusing to even talk to me, ignoring me, being so cold?”\u003c/p\u003e\n\u003cp\u003eGod, this was bad. It hurt so much to hear the pain in her voice. I really fucking hated doing this.\u003c/p\u003e\n\u003cp\u003e“Because I have to,” I bit back, opening my eyes to glare.\u003c/p\u003e\n\u003cp\u003eWhen she glared back, looking as pissed and frustrated as I felt, I went on. “Everything that happened between us happened a long fucking time ago. It’s all in the past and should stay in the past. Things changed since then. I changed. I’m not that eighteen-year-old kid you once knew. I’m a complete stranger to you. So I don’t see the point in reliving old times and accomplishing nothing but stirring up a bunch of heartache. You moved on.”\u003c/p\u003e\n\u003cp\u003eShe opened her mouth to argue, but I held up a hand.\u003c/p\u003e\n\u003cp\u003e“And that’s what you were supposed to do, but you need to keep moving...away from me.”\u003c/p\u003e\n\u003cp\u003eDefeat crossed her face and her shoulders dragged. But she shook her head. “Why?”\u003c/p\u003e\n\u003cp\u003e“Because I’m no fucking good for you. Why do you think? I’m an ex-con. I went to jail for rape.” \u003c/p\u003e","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-92.html","bookId":2715,"creation":"Oct 5, 2019 10:36:19 AM","modification":"Oct 5, 2019 10:36:19 AM"}
