{"id":81706,"no":21,"title":"Page 21","content":"\u003cp\u003eThe gunshot woke the girls, of course. Ayaan rushed to throw her blazer over Ifiyah\u0027s ravaged form so the others wouldn\u0027t see what Gary had done to her. I tried to explain as calmly as I could that she was gone, and Gary too. There was some wailing and crying and a few of the girls offered up prayers for Ifiyah. None of us slept after that.\u003c/p\u003e\n\u003cp\u003eWhatever Gary had done to Ifiyah, she didn\u0027t reanimate. Either he ate her brain or... hell. I didn\u0027t understand how the Epidemic worked. All I knew was that she didn\u0027t get up again.\u003c/p\u003e\n\u003cp\u003eIn the first light of day I heard a tiny sound, a tinny sound like a bell ringing somewhere. \"What was that?\" I whispered, thinking of the bells that rang when you walked into a bodega in this city. This was the Virgin Megastore, though, and the doors were locked up tight - we checked. The sound was not repeated.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t relax, couldn\u0027t get comfortable, though fatigue softened my head and made my thoughts slow and cold as glaciers moving through an ice age, growing a few inches a year it felt like. I stood and watched the dead outside pressing up against the windows and didn\u0027t have the mental energy to plan or consider options. I barely noticed when one of the dead men slumped to the ground and others surged in to take his place.\u003c/p\u003e\n\u003cp\u003eA woman with a long open wound on her arm and an Yves-St.-Laurent bag still dangling from the crook of her elbow slapped the glass with a greasy palm and then fell, her body held up for a moment by the crowd behind her. She slid down the glass, her flabby cheek rippling where it pressed up against the window until she landed on the sidewalk outside. A teenage boy in a white t-shirt climbed on top of her but then he too collapsed.\u003c/p\u003e\n\u003cp\u003eHere and there others fell - singly at first, then in great clumps that rolled backwards like waves receding from a shoreline. I grabbed my rifle, thinking this must be some trick. But that had been Ifiyah\u0027s mistake, of course, to think the dead were capable of subterfuge. As far as I could tell they functioned automatically with no art or thought required. As they fell away from the megastore sunlight streaked in through the windows and lit up the faces of the girls.\u003c/p\u003e\n\u003cp\u003e\"They dhimasha, commander,\" Fathia said, as if she were giving me a report from the front. They are dying, is my best translation.\u003c/p\u003e\n\u003cp\u003eI could see that for myself. Of the hundreds, maybe thousands of dead people who had mobbed the megastore trying to get at us only a few were still standing and they were clutching their heads and wandering aimlessly around Union Square. They seemed less interested in us than in whatever had claimed the rest. Almost certainly that was giving them too much credit but that\u0027s what it looked like.\u003c/p\u003e\n\u003cp\u003eLeadership, I was told once by a Regional Field Head for the Disarmament Project in Sudan, has less to do with making the best decision than making a decision. \"Get your things, we\u0027re leaving,\" I told the girls.\u003c/p\u003e\n\u003cp\u003eThey snapped to it. Prayer mats were rolled up, weapons were checked and thrown over shoulders. Fathia and Leyla, the youngest girl, moved to collect Ifiyah\u0027s body, rolling her up in their mats.\u003c/p\u003e\n\u003cp\u003eI unlocked the door but Ayaan was the first one out, her weapon swinging wildly as she tried to cover each of the stragglers in turn. They didn\u0027t react to her presence at all. I shuffled the rest of the girls out the door and then took up the rear. I caught myself about to yell out an order and stopped myself - the noise might have broken the dead out of their spell - and instead jogged forward to tap Ayaan\u0027s shoulder. I pointed in the direction of the river.\u003c/p\u003e\n\u003cp\u003eIt was all she needed. She threw three quick hand signals at the girls and we broke into a run, not so much a sprint (we were each carrying twenty pounds of gear at the least) as a loping jog but there was urgency there, believe me. At first we had to leap over piles of bodies (or just step on them in a couple of places) but beyond the periphery of the Square the sidewalks were clear. Sixth avenue passed. Seventh. I slowed momentarily outside of Western Beef, wondering if this was where our luck ended but the dead had deserted the place. Every walking corpse in the Village must have been there at the megastore because we saw only a handful on our way back to the Hudson and those were easily dodged. Once we were past Sixth Avenue the spell wore off - they came at us as determined as ever, but just as slowly, too.\u003c/p\u003e\n\u003cp\u003eAs we ran past their rotten clutching hands I felt a certain real relief that we were back on familiar ground again. Maybe we were running for our lives and being chased by the dead but that was better than what we were leaving behind. Whatever had slain the dead in Union Square had to be big and powerful and I didn\u0027t relish finding out what it wanted from me.\u003c/p\u003e\n\u003cp\u003eThe thought that it might be benevolent, this unseen force that claimed the dead for its own, never even occurred to me. Ever since the Epidemic started there was nothing truly good or clean left in this world. Anything that seemed that way had to come with strings attached.\u003c/p\u003e\n\u003cp\u003eAt the river we stopped on the dock and waved our arms. The Arawelo stood out in the water about a hundred yards with no one visible on deck but we were too out of breath to think the worst. After a minute or two Mariam came up on deck, her blazer off and Osman\u0027s fishing hat perched low over her eyes. She made some frantic gesture toward the hatches and the two sailors emerged from below decks, looking as if they\u0027d been caught at something salacious.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t give a damn what they\u0027d been up to. They brought the boat in to the dock and threw us lines so we could tie it up. In a minute we were on board and we cast off again.\u003c/p\u003e\n\u003cp\u003eI guess leaving the megastore in such a hurry really had been the right decision.\u003c/p\u003e\n\u003cp\u003eWhen I finally sat down I found I was ravenous. I called for canjeero, a flat Somali bread that was our staple food on the boat. Osman rubbed his head and squinted at me for a while before he decided what he was going to say.\u003c/p\u003e\n\u003cp\u003e\"You in charge now, Dekalb? You\u0027re the weyn nin?\" He glanced around at the girls. \"Ifiyah didn\u0027t come back, I see.\"\u003c/p\u003e\n\u003cp\u003eI made no comment. Osman and I had possessed a sort of easy camaraderie on the voyage to New York. Two grown men on a ship full of children - it would have been hard not to bond. Now I was changed, though, in some subtle but very real way. I had fired a rocket-propelled grenade into a crowd of my enemies. I had ordered soldiers to shoot to kill. I had lead the girls to safety - and I had also let one of the dead eat their commanding officer. It made it hard to fall in with his breezy laissez-faire attitude. I wanted to order him to shut up, to leave me alone. I didn\u0027t, though. I guess I hadn\u0027t changed that much.\u003c/p\u003e\n\u003cp\u003e\"At least tell me you got the drugs and we can go home!\" He raised both hands in the air, surrendering to his disbelief. My silence left him high and dry and slowly he lowered his arms. We both knew we couldn\u0027t return to Somalia without the medical supplies. We had failed to find them and in the process we lost four of our number. I had nothing to add to that so I kept quiet.\u003c/p\u003e\n\u003cp\u003e\"Well that is just fucked up, sir, yes, sir!\" Osman said and flipped me a one-finger salute.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t bother to respond. Why argue with the obvious?\u003c/p\u003e","sourceLink":"https://allnovel.net/monster-island-zombies-1/page-21.html","bookId":2464,"creation":"Oct 5, 2019 4:37:27 PM","modification":"Oct 5, 2019 4:37:27 PM"}
