{"id":104070,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSatisfied, Monk headed out.\u003c/p\u003e\n\u003cp\u003eKonstantin kept up, but Kiska and Pyotr struggled. The way was steep. Monk and Marta both helped the smaller children, hauling them up the harder patches. Finally, they reached the top of the rise. Ahead, more hills spread in all directions, mostly wooded with a few open meadows. Off to the left, not too far away, a wide patch of silver marked a large lake.\u003c/p\u003e\n\u003cp\u003eMonk stepped in that direction. With a lake like that, there should be people, someone who could help them.\u003c/p\u003e\n\u003cp\u003eKonstantin grabbed his elbow. “We can’t go that way. Only death lies that way.” His other hand squeezed the badge affixed to his belt, a radiation monitor.\u003c/p\u003e\n\u003cp\u003eIn such verdant surroundings, Monk had forgotten about that danger. He flipped his badge up. Its surface was white, but as the radiation levels rose, it would begin to turn pink, then red, then dark crimson, then black. Sort of like a drugstore pregnancy test—\u003c/p\u003e\n\u003cp\u003ePhoto-flashes of memory cracked across his vision.\u003c/p\u003e\n\u003cp\u003e—a laughing blue eye, tiny fingernails—\u003c/p\u003e\n\u003cp\u003eThen nothing again.\u003c/p\u003e\n\u003cp\u003eHis head throbbed. He fingered the tender suture line through his wool cap. Konstantin looked at him with narrow, concerned eyes.\u003c/p\u003e\n\u003cp\u003eKiska, who Monk had learned was Konstantin’s sister, hugged her arms around her belly. “I’m hungry,” she whispered, as if fearful of both being heard and of showing weakness.\u003c/p\u003e\n\u003cp\u003eKonstantin frowned in his sister’s direction, but Monk knew they all should eat to keep their strength up. After their panicked flight, they needed a moment to regroup, to plan some strategy beyond running. Monk stared toward the lake while fingering his badge.\u003c/p\u003e\n\u003cp\u003eOnly death lies that way.\u003c/p\u003e\n\u003cp\u003eHe needed to better understand their situation.\u003c/p\u003e\n\u003cp\u003e“We’ll find a place to shelter and eat quickly,” Monk said.\u003c/p\u003e\n\u003cp\u003eHe crossed down into the next valley. A series of small ponds cascaded through a set of terraced ledges. The place sparkled with a dozen waterfalls and cataracts. The air smelled loamy and damp. Halfway down, a fern-strewn cliff side had been eroded into a pocket with an overhang. He led the children to it.\u003c/p\u003e\n\u003cp\u003eThey hunkered down and opened packs. Protein bars and bottled water were passed around.\u003c/p\u003e\n\u003cp\u003eMonk searched his pack. No weapons, but he did find a topographic map. He unfolded it on the ground. The header was in Cyrillic. Konstantin joined him, chewing on a peanut-butter-flavored bar. Monk noted the mountainous landscape was marked with scores of tiny Xs.\u003c/p\u003e\n\u003cp\u003e“Mines,” Konstantin said. “Uranium mines.” He ran a finger along the Cyrillic header, then waved an arm to encompass the area. “The Southern Ural Mountains. Chelyabinsk district. Center of old weapons factories. Very dangerous.”\u003c/p\u003e\n\u003cp\u003eThe boy tapped all around the map where radiological hazard symbols dotted the terrain. “Many open mines, old radiochemical and plutonium plants. Nuclear waste facilities. All shut down, except for one or two.” He waved to indicate a far distance away.\u003c/p\u003e\n\u003cp\u003eMonk mumbled with a shake of his head, staring down at all the hazard symbols. “And all I wanted to know was where we were.”\u003c/p\u003e\n\u003cp\u003e“Very dangerous, da,” Konstantin warned. He pointed an arm in the direction of the large lake, now out of sight. “Lake Karachay. Liquid waste dumping ground for old Mayak atomic complex. You stand one hour by the lake and you will be dead a week later. We must go around.”\u003c/p\u003e\n\u003cp\u003eKonstantin leaned closer to the map and tapped in the center of a cluster of mines and radiation plants. “We come from here. The Warren. An old underground city—Chelyabinsk 88—where thousands of prisoners were housed who worked the mines. One of many such places.”\u003c/p\u003e\n\u003cp\u003eMonk pictured the industrial-looking buildings he had seen in the cavern. Obviously someone else had found a new use for the abandoned place.\u003c/p\u003e\n\u003cp\u003eKonstantin continued, “We must go around Lake Karachay—but not too near.” He glanced up to Monk to make sure he understood. “Which means we must cross the Asanov swamp to reach here.”\u003c/p\u003e\n\u003cp\u003eThe boy held his finger over another mine opening on the far side of the lake.\u003c/p\u003e\n\u003cp\u003eMonk didn’t understand. Weren’t they seeking to escape, to get to someone who could help them?\u003c/p\u003e\n\u003cp\u003e“What’s there?” Monk asked, nodding to the mine marker.\u003c/p\u003e\n\u003cp\u003e“We must stop them.” Konstantin glanced to Pyotr, who cradled with Marta on a bed of moss.\u003c/p\u003e\n\u003cp\u003e“Stop who?” Monk remembered the young boy’s words to him.\u003c/p\u003e\n\u003cp\u003eSave us.\u003c/p\u003e\n\u003cp\u003eKonstantin turned back to Monk. “It is why we brought you here.”\u003c/p\u003e\n\u003cp\u003e11:30 A.M.\u003c/p\u003e\n\u003cp\u003eGeneral-Major Savina Martov glowered at the assembled children. They were in the school’s main auditorium. A photograph of the American glowed from a large LCD screen behind her.\u003c/p\u003e\n\u003cp\u003e“Has anyone seen this man lurking around early this morning? He may have been wearing a hospital gown.”\u003c/p\u003e\n\u003cp\u003eThe children stared blankly at her from banks of wooden seats. They’d all been rousted early from their dormitories. More than sixty children sat in tiers, designated by the color of their shirts. The white-shirted sat at the back, those who carried the genetic markers but showed little talent. The grays sat in the middle, mildly talented, but not remarkable.\u003c/p\u003e\n\u003cp\u003eUnlike the ten who shared the front seats.\u003c/p\u003e\n\u003cp\u003eThese last wore uniforms with black shirts. Omega class. Those rare few who displayed astounding talents. The dozen best, selected to serve Savina’s son, Nicolas, in the hard times to come, to be his inner council with Savina as its head.\u003c/p\u003e\n\u003cp\u003eNicolas was a sore point for Savina, a disappointment. He’d been born a white shirt. A loss of the genetic dice. Savina had impregnated herself via artificial insemination from one of the first generation. She’d been rash and paid dearly for it. She’d acted before they fully understood the genetics. There had been complications during the birth. She could have no other children. But she had developed a new purpose for Nicolas, one that would bring about true and lasting change. It became her life’s work after Nicolas was born.\u003c/p\u003e\n\u003cp\u003eAnd they were so close.\u003c/p\u003e\n\u003cp\u003eShe stared at the row of black shirts.\u003c/p\u003e\n\u003cp\u003eAnd the two empty seats in the Omega-class section.\u003c/p\u003e\n\u003cp\u003eOne child had vanished last night.\u003c/p\u003e\n\u003cp\u003ePyotr.\u003c/p\u003e\n\u003cp\u003eHis sister had vanished at the same time from a zoo in America. Savina still had heard no update on the girl’s status from Yuri. The man had gone strangely silent, not even responding to a transmitted emergency code.\u003c/p\u003e\n\u003cp\u003eSomething was happening.\u003c/p\u003e\n\u003cp\u003eShe needed answers. Her voice grew sharper. “And no one saw Konstantin, Kiska, or Pyotr leaving their dorm rooms? No one!”\u003c/p\u003e\n\u003cp\u003eAgain the blank stares.\u003c/p\u003e\n\u003cp\u003eMotion at the back of the room drew her eye. A toadish-looking man stepped into the room and nodded to her. Lieutenant Borsakov, her second in command. He was dressed in his usual gray uniform, including a stiff black-brimmed cap. He’d found something.\u003c/p\u003e\n\u003cp\u003eAt last.\u003c/p\u003e\n\u003cp\u003eShe turned to the trio of teachers standing to the side. “Confine them to their dormitories. Under close guard. Until the matter is settled.”\u003c/p\u003e\n\u003cp\u003eShe climbed the stairs and exited the auditorium, drawing Borsakov in her wake. Pock-faced and scarred, he stood only as high as her shoulders, which she preferred. She liked men shorter than herself. But he was bulky with muscle, and sometimes she caught him staring at her with a flicker of hunger. She preferred that, too.\u003c/p\u003e\n\u003cp\u003eHe trailed a step behind her as they crossed through the school to the exit. Once outside, she found two of his men. One had a chained Russian wolf at his side. It growled and rumbled, curling back lips to expose sharp teeth. The guard yanked on the lead, scolding it.\u003c/p\u003e\n\u003cp\u003eSavina gave the creature a wide berth. A mix of Russian wolfhound and Siberian wolf, its muscular form stood almost to Borsakov’s chest. The beast came from their animal research facility—nicknamed the Menagerie. It was where they experimented with new augments and tested various applications, using all manner of higher mammals: dogs, cats, pigs, sheep, chimps. It also served as a macabre petting zoo for the village. They’d found over the years that the children bonded with the animals and the relationship helped stabilize them psychologically. And maybe the bond wasn’t entirely human-animal, but also augment to augment, a shared commonality.\u003c/p\u003e\n\u003cp\u003eEven the wolf bore a surgical steel device.\u003c/p\u003e\n\u003cp\u003eThe augment capped the base of the dog’s skull, attached via titanium screws and wired in place. With the touch of a button on the radio-transmitter, they could feed pain or pleasure, enhance aggression or docility, dull senses or stimulate arousal.\u003c/p\u003e\n\u003cp\u003e“What have you found, Lieutenant?” she asked.\u003c/p\u003e\n\u003cp\u003e“The children are not in the cavern,” he said.\u003c/p\u003e\n\u003cp\u003eShe stopped and turned.\u003c/p\u003e\n\u003cp\u003e“We searched the entire village, even the deserted apartment complex, but when we circled wider, we discovered a scent trail along a back wall, behind the animal facility. It led to one of the service hatches to the surface.”\u003c/p\u003e\n\u003cp\u003e“They went outside?”\u003c/p\u003e\n\u003cp\u003e“We believe with the American from the hospital. The children’s trail came from the hospital.”\u003c/p\u003e\n\u003cp\u003eSo that at least answered one question. The American hadn’t escaped, then kidnapped the children. It seemed it was the other way around. The children must have helped him escape.\u003c/p\u003e\n\u003cp\u003eBut why?\u003c/p\u003e\n\u003cp\u003eWhat was so important about the man?\u003c/p\u003e\n\u003cp\u003eIt was a question that had nagged Savina since the man had first arrived. Two months ago, Russian intelligence had been alerted about a plague ship that had been pirated in the Indonesian seas. Intelligence services around the world were looking for it. She had been tasked to see if her subjects could find it. A test. One she had passed. Primed, the twelve Omegas had pinpointed the island where the ship was being held. A Russian submersible was sent to investigate and came upon the lagoon just as the ship was sinking.\u003c/p\u003e\n\u003cp\u003eIt was victory enough—until Sasha had begun scribbling with a fervor that almost burnt her augment out. A dozen pictures, from a dozen views, of a drowning man, being dragged down by a net. Believing this was significant—and being curious herself—Savina had alerted the Russian submariners. They already had divers in the water.\u003c/p\u003e\n\u003cp\u003eThey found such a man, barely conscious, tangled in a net. They rushed up in diving sleds, forced a respirator into his mouth, and rescued him back to their submersible.\u003c/p\u003e\n\u003cp\u003eSavina had ordered the man brought here, believing he must be significant. But once at Chelyabinsk 88, he claimed to be just one of the cruise ship’s electricians. During their interrogation, the man had not seemed especially bright to her, just a scarred and shaven brute of a man with a coarse vocabulary and missing one hand. Likewise, Sasha had showed no interest in him. Neither did any of her fellow Omega-class subjects. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-oracle-sigma-force-5/page-23.html","bookId":1528,"creation":"Oct 5, 2019 10:36:06 PM","modification":"Oct 5, 2019 10:36:06 PM"}
