{"id":104050,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Where are all the children?” Yuri asked.\u003c/p\u003e\n\u003cp\u003eThe answer came from his other side, bright and brittle as the ice frosting these highlands. “Barricaded in the church.”\u003c/p\u003e\n\u003cp\u003eYuri turned to face the speaker, Captain Savina Martov, the mission’s intelligence officer. She was buried in a black overcoat with a fur-lined hood. Her black hair was a match to the hood’s fringe of Russian wolf.\u003c/p\u003e\n\u003cp\u003eShe lifted a slender arm toward a steeple rising beyond the wagons and tents. It appeared to be the only permanent structure here. Built all of local stone, the church blended into the surrounding crags.\u003c/p\u003e\n\u003cp\u003e“The children were already assembled in the structure before our forces arrived,” Savina recounted.\u003c/p\u003e\n\u003cp\u003eDobritsky nodded. “Must have heard the motorcycles’ engines.”\u003c/p\u003e\n\u003cp\u003eSavina met Yuri’s eyes. Morning light danced in her green eyes. The intelligence officer had her own thoughts. It had been Savina who had delivered a cache of research papers to Yuri’s institute, notebooks and reams of data from Auschwitz-Birkenau, specifically the work of Dr. Josef Mengele, the concentration camp’s “Angel of Death.”\u003c/p\u003e\n\u003cp\u003eYuri had many sweat-soaked nightmares after reading through the material. It was well known that Dr. Mengele had performed all manner of horrible experiments on the prisoners, but the monster bore a special fascination for Gypsies, especially their children. He would ply them with treats and chocolates. They came to call him “Uncle Pepe.” This was all done just to get the children to better cooperate. Eventually he had them all slaughtered—but not before he discovered an especially unique pair of Gypsy twins.\u003c/p\u003e\n\u003cp\u003eTwo identical girls. Sasha and Meena.\u003c/p\u003e\n\u003cp\u003eYuri had read those notes with a mixture of fascination and horror.\u003c/p\u003e\n\u003cp\u003eMengele had kept meticulous notes on the remarkable twins: age, family history, lineage. He tortured the twins’ family and relatives to uncover more details, verified by testing with the girls. Mengele accelerated his experiments. But as the war drew to a close, he was forced to prematurely terminate his tests. He killed the twins with injections of phenol into their hearts.\u003c/p\u003e\n\u003cp\u003eMengele had scrawled his frustration near the end.\u003c/p\u003e\n\u003cp\u003eWenn ich nur mehr Zeit gehabt hätte…\u003c/p\u003e\n\u003cp\u003eIf only I’d had more time…\u003c/p\u003e\n\u003cp\u003e“Are you ready?” Savina asked Yuri.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eAccompanied by Dobritsky and another soldier, the pair headed into the camp. He stepped around a corpse sprawled facedown in a pool of frozen blood.\u003c/p\u003e\n\u003cp\u003eThe church appeared ahead. It was all stacked stones, no windows. A single door stood closed, constructed of hewn beams of stout wood, banded and studded in copper. The building looked more like a fortress than a church.\u003c/p\u003e\n\u003cp\u003eTwo soldiers flanked the doors with a steel battering ram.\u003c/p\u003e\n\u003cp\u003eDobritsky glanced to Yuri.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“Break it down!” the lieutenant ordered sharply.\u003c/p\u003e\n\u003cp\u003eThe men swung the ram and smashed the door. Wood splintered. It held for two more swings. Finally the door burst open with a crack of thunder.\u003c/p\u003e\n\u003cp\u003eYuri shadowed Savina and stepped forward.\u003c/p\u003e\n\u003cp\u003eSmall oil lamps lit the dark interior. Rows of pews lined either side, leading to a raised altar. Children of all ages cowered among the benches, strangely silent.\u003c/p\u003e\n\u003cp\u003eAs Yuri continued toward the altar, he studied the children. Many bore disturbing deformities: pinheaded microcephaly, cleft lips, dwarfism. One child had no arms at all, only a torso. Inbreeding. Yuri’s skin pebbled with unease. No wonder the rural folk around here feared this Romani clan, told tales of spirits and monsters.\u003c/p\u003e\n\u003cp\u003e“How will you know if these are the right children?” Savina asked with clear disgust in her voice.\u003c/p\u003e\n\u003cp\u003eYuri quoted from one of the tortured interviews recorded by Mengele. “The lair of the chovihanis.” The place was where the twins had been born, a secret kept by the Gypsies going back to the founding of the clans.\u003c/p\u003e\n\u003cp\u003e“Are these the ones?” Savina pressed.\u003c/p\u003e\n\u003cp\u003eYuri shook his head. “I don’t know.”\u003c/p\u003e\n\u003cp\u003eHe continued toward a girl seated before the altar. She clutched a rag doll to her chest, though her own garb was little better than her doll’s. As Yuri neared, he noted the child seemed perfect, spared of any of the deformities. In the dim light, the pure crystal blue of her eyes shone brightly.\u003c/p\u003e\n\u003cp\u003eSo rare among the Romani.\u003c/p\u003e\n\u003cp\u003eLike the twins, Sasha and Meena.\u003c/p\u003e\n\u003cp\u003eYuri knelt in front of her. She seemed not to notice him. Her gaze passed straight through him. He sensed there was something wrong with this child, possibly worse than any of the other deformities.\u003c/p\u003e\n\u003cp\u003eThough her eyes never seemed to focus any sharper, she lifted a hand toward him. “Unchi Pepe,” she lisped in a thin Romani voice.\u003c/p\u003e\n\u003cp\u003eA wash of fear swept through Yuri. Uncle Pepe. The pet name for Josef Mengele. It had been used by all the Gypsy children. But these children were too young to have ever seen the insides of a concentration camp.\u003c/p\u003e\n\u003cp\u003eYuri stared into those vacant eyes. Did the child know what Yuri and his research team intended? How could she? Mengele’s words haunted him:\u003c/p\u003e\n\u003cp\u003eIf only I’d had more time…\u003c/p\u003e\n\u003cp\u003eThat would not be Yuri’s problem. His team would be granted all the time it needed. The facility was already under construction. Far from prying eyes.\u003c/p\u003e\n\u003cp\u003eSavina stepped closer. She needed an answer.\u003c/p\u003e\n\u003cp\u003eYuri knew the truth; he’d known it the moment he stared into this girl’s face. Still he hesitated.\u003c/p\u003e\n\u003cp\u003eSavina placed a hand on his elbow. “Major?”\u003c/p\u003e\n\u003cp\u003eThere could be no turning back, so Yuri nodded, acknowledging the horror to come. “Da. These are the chovihanis.”\u003c/p\u003e\n\u003cp\u003e“Are you certain?”\u003c/p\u003e\n\u003cp\u003eYuri nodded again, but he kept his gaze fixed on the child’s blue eyes. He barely heard Savina order Dobritsky: “Collect all the children into the trucks. Eliminate everyone else.”\u003c/p\u003e\n\u003cp\u003eYuri did not countermand those orders. He knew why they were here.\u003c/p\u003e\n\u003cp\u003eThe child still held out her hand. “Unchi Pepe,” she repeated.\u003c/p\u003e\n\u003cp\u003eHe took the tiny fingers into his own. There was no denying it, no turning back.\u003c/p\u003e\n\u003cp\u003eYes, I am.\u003c/p\u003e\n\u003cp\u003eFIRST\u003c/p\u003e\n\u003cp\u003e1\u003c/p\u003e\n\u003cp\u003ePresent Day\u003c/p\u003e\n\u003cp\u003eSeptember 5, 1:38 P.M.\u003c/p\u003e\n\u003cp\u003eWashington, D.C.\u003c/p\u003e\n\u003cp\u003eIt wasn’t every day a man dropped dead in your arms.\u003c/p\u003e\n\u003cp\u003eCommander Gray Pierce had been crossing the national Mall when the homeless man accosted him. Gray was already in a bad mood, having finished one fight and was headed toward another. The midday heat only stoked his irritability. The day steamed with the usual D.C. swelter, baking off the sidewalk. Dressed in a navy blue blazer over an untucked cotton jersey and jeans, he estimated his internal temperature had risen from medium to well done.\u003c/p\u003e\n\u003cp\u003eFrom half a block away, Gray spotted a gaunt figure weaving toward him. The homeless man was dressed in baggy jeans rolled at the ankle, revealing scuffed army boots, only half laced. He hunched within a rumpled suit jacket. As the man neared, Gray noted his scrabbled beard was shot with gray, his eyes bleary and red as he searched around.\u003c/p\u003e\n\u003cp\u003eSuch panhandlers were not a rare sight around the national Mall, especially as the Labor Day celebrations had just ended this past weekend. The tourists had retreated back to their ordinary lives, the riot police had retired to the local bars, and the street cleaners had finished erasing the evidence. The last to leave were those who still sought some bit of loose change that might have fallen through the cracks, searching trash bins for bottles or cans, like crabs scavenging the last bit of meat from old bones.\u003c/p\u003e\n\u003cp\u003eGray did not sidestep the vagrant as he headed down Jefferson Drive\u003c/p\u003e\n\u003cp\u003etoward the Smithsonian Castle, his destination. He even made eye contact, both to judge any threat level and to acknowledge the man’s existence. While there were certainly some panhandling cons perpetrated by a few who were less than needy, most of the men and women on the streets were there through misfortune, addiction, or various forms of mental illness. And a good number of them were veterans of the armed services. Gray refused to look away—and maybe that was what brightened the other man’s eyes.\u003c/p\u003e\n\u003cp\u003eGray read a mix of relief and hope through the grime and wrinkles. Upon spotting Gray, the homeless man’s shuffling gait became more determined. Perhaps he feared his quarry might escape into the Castle before he could reach him. The man’s limbs shook. He was plainly inebriated or possibly suffering from drunken tremors.\u003c/p\u003e\n\u003cp\u003eA hand reached toward him, palm up.\u003c/p\u003e\n\u003cp\u003eIt was a universal gesture—from the slums of Brazil to the alleys of Bangkok.\u003c/p\u003e\n\u003cp\u003eHelp me. Please.\u003c/p\u003e\n\u003cp\u003eGray reached inside his blazer for his wallet. Many thought he was a sucker for succumbing to such panhandling. They’ll just use it to buy booze or crack. He didn’t care. It was not his place to judge. This was another human being in need. He pulled out his wallet. If asked, he would give. That was his motto. And maybe at a more honest level, such charity served Gray, too, a balm of human kindness to soothe a guilt buried deeper than he cared to face.\u003c/p\u003e\n\u003cp\u003eAnd all it cost was a buck or two.\u003c/p\u003e\n\u003cp\u003eNot a bad deal.\u003c/p\u003e\n\u003cp\u003eHe glanced into his wallet. All twenties. He had just cashed up at an ATM at the Metro station. He shrugged and tugged out a bill with Andrew Jackson’s face.\u003c/p\u003e\n\u003cp\u003eOkay, sometimes it cost more than a buck or two.\u003c/p\u003e\n\u003cp\u003eHe lifted his head just as the two met. Gray reached out with the twenty-dollar bill but found the man’s hand wasn’t empty. Resting in the middle of his palm lay a tarnished coin, about the size of a fifty-cent piece.\u003c/p\u003e\n\u003cp\u003eGray frowned.\u003c/p\u003e\n\u003cp\u003eIt was the first time a homeless man had tried to pay him.\u003c/p\u003e\n\u003cp\u003eBefore he could comprehend the situation, the man tripped toward him, as if suddenly shoved from behind. His mouth opened in an O of surprise. He fell into Gray, who reflexively caught the elderly man.\u003c/p\u003e\n\u003cp\u003eHe was lighter than Gray had expected. Under his jacket, the man’s body seemed all bone, a skeleton in a suit. A hand grazed Gray’s cheek. It burned feverishly hot. A flicker of fear—of disease, of AIDS—passed through Gray, but he did not let go as the man slumped in his arms.\u003c/p\u003e\n\u003cp\u003eCarrying the man’s weight, Gray shifted his left arm. His hand settled upon a hot welling wetness on the man’s lower back. It streamed over his fingers.\u003c/p\u003e\n\u003cp\u003eBlood.\u003c/p\u003e\n\u003cp\u003eGray pivoted on instinct. He hip-rolled to the side and dove off the sidewalk, with the man still clutched in his arms. The thick grass cushioned their fall. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-oracle-sigma-force-5/page-3.html","bookId":1528,"creation":"Oct 5, 2019 10:36:06 PM","modification":"Oct 5, 2019 10:36:06 PM"}
