{"id":104090,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe slowly nodded and covered the picture.\u003c/p\u003e\n\u003cp\u003eHer husband…?\u003c/p\u003e\n\u003cp\u003e“Why would she do that?” Kat asked. She stared at him with a bit more focused intent. “Draw such a picture.”\u003c/p\u003e\n\u003cp\u003eYuri stared back at the girl. His heart pounded harder, and his vision narrowed. It was Sasha’s drawings that had saved the man’s life. And now here was the same man’s wife. It was beyond coincidence, outside probable chance. What was going on?\u003c/p\u003e\n\u003cp\u003e“Dr. Raev?” the woman pressed.\u003c/p\u003e\n\u003cp\u003eHe was saved from having to answer by the flutter of tiny lashes. Sasha’s eyes opened, revealing their watery blue depths. Yuri scooted closer. The woman stood up.\u003c/p\u003e\n\u003cp\u003eSasha remained groggy, her gaze unfocused. But her heart-shaped face turned toward Yuri. “Unchi Pepe…?”\u003c/p\u003e\n\u003cp\u003eThat name.\u003c/p\u003e\n\u003cp\u003eYuri’s blood pounded in his ears and iced through him. He flashed to a dark aisle in a cold church, to a child clutching a rag doll before a stone altar, staring up at him with the same blue eyes.\u003c/p\u003e\n\u003cp\u003eHere were the same words. The same accusation.\u003c/p\u003e\n\u003cp\u003eUnchi Pepe…\u003c/p\u003e\n\u003cp\u003eThe pet name for Josef Mengele, the Butcher of Auschwitz.\u003c/p\u003e\n\u003cp\u003eHe took Sasha’s hand, knocking loose the blood pressure monitor.\u003c/p\u003e\n\u003cp\u003eNo, he promised to her. Not ever again.\u003c/p\u003e\n\u003cp\u003eTears blurred his vision.\u003c/p\u003e\n\u003cp\u003eHer tiny fingers clamped weakly to him. Her lids fluttered. “Papa…Papa Yuri…?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he whispered. “I’m here, baby. I won’t leave you.”\u003c/p\u003e\n\u003cp\u003eHer lips moved as she faded back to sleep. Her fingers relaxed and slipped from his. “Marta…Marta’s scared…”\u003c/p\u003e\n\u003cp\u003e11:50 P.M.\u003c/p\u003e\n\u003cp\u003eSouthern Ural Mountains\u003c/p\u003e\n\u003cp\u003eThe body was still warm, but the blood was cold.\u003c/p\u003e\n\u003cp\u003eThe kill was an hour or so old.\u003c/p\u003e\n\u003cp\u003eLieutenant Borsakov lifted his palm from the flank of the dead tiger. He reached to the head, grabbed an ear, and tugged up. The other ear matched the first, marking this cat as Arkady.\u003c/p\u003e\n\u003cp\u003eHe dropped it and stood.\u003c/p\u003e\n\u003cp\u003eIn his other hand, Borsakov carried his sidearm, a Yarygin PYa. He kept it raised, wishing it was chambered in something stronger than 9 mm. He searched for Zakhar. There was no sign of the cat.\u003c/p\u003e\n\u003cp\u003eBehind him, the old ibza still smoked and smoldered.\u003c/p\u003e\n\u003cp\u003eImpressed at the escape, he crossed back to the airboat. A pilot and two other soldiers sat aboard, bearing assault rifles, covering him. The headlamp of the swamp boat speared out into the darkness. The giant fan at the back of the craft slowly spun as the pilot idled its engine.\u003c/p\u003e\n\u003cp\u003eBorsakov climbed back aboard and waved them out into the dark swamp. The engine whined, the fan spun to a gale, and they sailed away from the glowing ruins of the hunter’s lodge and headed back out into the night. The hunt would have been easier if they’d had the use of infrared scopes or night-vision goggles, but Borsakov had discovered someone had sneaked into the supply shed sometime during the past day and damaged their limited equipment.\u003c/p\u003e\n\u003cp\u003eEither the American or the children.\u003c/p\u003e\n\u003cp\u003eThey’d known they would be hunted.\u003c/p\u003e\n\u003cp\u003e“Should we not report in with General-Major Martov?” his second in command asked and reached to the team’s radio.\u003c/p\u003e\n\u003cp\u003eBorsakov shook his head.\u003c/p\u003e\n\u003cp\u003eThe general-major did not take setbacks well.\u003c/p\u003e\n\u003cp\u003eThe airboat flew through the swamp.\u003c/p\u003e\n\u003cp\u003eHe would call when the American was dead.\u003c/p\u003e\n\u003cp\u003eAs they fled, Borsakov glanced back to the island, to the smoldering ruins and dead cat. He pictured the American and what he had accomplished.\u003c/p\u003e\n\u003cp\u003eWho was this man? And where did he get his training?\u003c/p\u003e\n\u003cp\u003e6:02 P.M.\u003c/p\u003e\n\u003cp\u003eWashington, D.C.\u003c/p\u003e\n\u003cp\u003eTrent McBride lifted the phone’s receiver to his ear. They’d allowed him to use a wall phone and patched his call to Mapplethorpe’s office. Trent was under no illusion that the conversation would be private. Someone was surely monitoring.\u003c/p\u003e\n\u003cp\u003eBut that wouldn’t stop him from calling in a status report.\u003c/p\u003e\n\u003cp\u003eAfter a few cursory exchanges with Mapplethorpe, Trent said, “It looks like the girl may survive.”\u003c/p\u003e\n\u003cp\u003eIf she had died, then there would be no reason to proceed.\u003c/p\u003e\n\u003cp\u003e“Very good,” Mapplethorpe answered. A short and significant pause followed; then he spoke. “How long until we know for sure?”\u003c/p\u003e\n\u003cp\u003eTrent checked his watch and calculated how much time he’d need. “To be certain. Six hours,” he said.\u003c/p\u003e\n\u003cp\u003eMiddle of the night.\u003c/p\u003e\n\u003cp\u003eIt would take coordination, but then they’d have everything.\u003c/p\u003e\n\u003cp\u003eMapplethorpe growled with satisfaction. “Then that’s very good news indeed.”\u003c/p\u003e\n\u003cp\u003e14\u003c/p\u003e\n\u003cp\u003eSeptember 6, 11:04 P.M.\u003c/p\u003e\n\u003cp\u003ePunjab, India\u003c/p\u003e\n\u003cp\u003e“We can go no farther,” Abhi Bhanjee said.\u003c/p\u003e\n\u003cp\u003eGray didn’t argue. The Mercedes SUV was up to its axles in mud. Exhausted, his nerves stretched to a piano-wire tautness, he drove the truck up to a stonier piece of ground.\u003c/p\u003e\n\u003cp\u003eFor the past two hours, rain had dumped heavily out of low skies. It seemed impossible for clouds to hold such volumes of water. They had left the mango orchards thirty miles ago and trekked through a landscape just as wooded, but here the terrain was wild. The rolling hills had given way to a broken escarpment of steep hills and cliffs. With the rain, creeks swelled and surged throughout the landscape. It was as if the entire world wept.\u003c/p\u003e\n\u003cp\u003eBut at least the torrent of rain had drowned away the helicopters. The hunters had given up the chase after losing their prey among the thousands of acres of property. Abe knew the lands around here well and had guided them along a steep-walled valley out of the orchards and into this inhospitable terrain.\u003c/p\u003e\n\u003cp\u003eNo one comes here, the man had said. Not good for farming.\u003c/p\u003e\n\u003cp\u003eThat was an understatement.\u003c/p\u003e\n\u003cp\u003e“We are not far,” Abe assured them as Gray braked to a stop. “Less than a kilometer. But we must walk from here.”\u003c/p\u003e\n\u003cp\u003eGray hid the SUV under the draping boughs of a banyan tree. Turning off the engine, he stared out at the cliffs and pictured the temple on the Greek coin. Abe claimed such a structure lay out among these lands. It was where Dr. Polk had been headed the day he disappeared. Only a few local villagers knew of this place. It was a site both revered and feared by Abe’s people, sacred ground for the achuta.\u003c/p\u003e\n\u003cp\u003eWhy had Dr. Polk come out here? What had so excited the professor?\u003c/p\u003e\n\u003cp\u003eWater sluiced over the windshield, blurring the view.\u003c/p\u003e\n\u003cp\u003e“Perhaps it’s best if we wait for a break in the weather,” Masterson suggested. “We can look for this temple after it stops raining.”\u003c/p\u003e\n\u003cp\u003eGray checked his watch. It was nearing midnight. He didn’t want to be anywhere near here by morning. Come daylight, the helicopters would be out searching again. The tank-size Mercedes SUV would be easy to spot in the open hills. Gray had already taken measures and disabled the truck’s GPS unit, fearing that was how the Russians had tracked them from Delhi.\u003c/p\u003e\n\u003cp\u003eHe had many unanswered questions in his head, but he knew one thing for certain. If they were going to track the last steps taken by Dr. Polk, they’d better do it now.\u003c/p\u003e\n\u003cp\u003eHe swung around to address the passengers. “I’m going with Abe. But the rest of you might want to stay with the vehicle.”\u003c/p\u003e\n\u003cp\u003eElizabeth raised her hand. “I’m going with you. If there’s some lost temple out there, you may need my help.”\u003c/p\u003e\n\u003cp\u003eKowalski nodded. “And where she goes, I’m going.”\u003c/p\u003e\n\u003cp\u003eElizabeth glanced to him with a look that started out annoyed but melted into something less sure.\u003c/p\u003e\n\u003cp\u003e“We should stay together,” Rosauro said, grabbing their pack of gear.\u003c/p\u003e\n\u003cp\u003eLuca nodded.\u003c/p\u003e\n\u003cp\u003eMasterson rolled his eyes. “It looks like we’re all going to get wet.”\u003c/p\u003e\n\u003cp\u003eWith the matter decided, they piled out of the SUV and into the rain. After a couple of steps, Gray was soaked to the skin. His clothes seemed to have gained twenty pounds.\u003c/p\u003e\n\u003cp\u003eKowalski cursed and glanced longingly back toward the SUV, but once Elizabeth moved, he followed in her footsteps.\u003c/p\u003e\n\u003cp\u003e“Over this way,” Abe said and pointed to a shattered cliff that rose up into ragged plateaus covered in trees. Roots tangled out of the sandstone walls, like the gnarled faces of old men, worn from the cliffs by rain and wind. Lightning crackled across the sky, booming with thunder.\u003c/p\u003e\n\u003cp\u003eThe storm worsened.\u003c/p\u003e\n\u003cp\u003eBone tired, Gray began to have further doubts about his plan. Since leaving Delhi earlier in the day, he’d been unable to contact Sigma. They’d lost the team’s satellite phone during the assault at the hotel. The prepaid cell phone he’d purchased in Delhi had no reception in this remote area.\u003c/p\u003e\n\u003cp\u003eThey were on their own. And while Gray normally preferred to operate with as little oversight as possible, he had the civilians to consider.\u003c/p\u003e\n\u003cp\u003eAbe set out toward a narrow ravine cut into the cliff. A creek flowed down the center of it, chugging leadenly with runoff. A narrow path bordered it, with sheer walls rising to either side.\u003c/p\u003e\n\u003cp\u003eGray followed Abe to the path. Once in the canyon, the rains lessened, as the winds were blocked. Still, water poured down the walls. The creek’s rumble, trapped in the ravine, grew louder.\u003c/p\u003e\n\u003cp\u003eThey continued single file.\u003c/p\u003e\n\u003cp\u003eThe canyon zigzagged like a thunderbolt, growing narrower and taller as it cut into the high hills.\u003c/p\u003e\n\u003cp\u003eAbe narrated as he walked. “Our people sometimes retreat here during times of persecution. My great-grandfather told stories of purges, where entire villages were destroyed. Those who escaped fled here to hide.”\u003c/p\u003e\n\u003cp\u003eNo wonder the achuta keep this place secret, Gray thought.\u003c/p\u003e\n\u003cp\u003e“But these walls do not guarantee protection,” Abe added cryptically. “Not forever.”\u003c/p\u003e\n\u003cp\u003eGray glanced to him, but Abe stepped ahead to where the canyon split into two courses. Abe ran his hand along one wall, as if assuring himself of something—then continued onward to the left.\u003c/p\u003e\n\u003cp\u003eGray fingered where Abe had touched. There was writing inscribed into the wall, barely visible through the rain, just shadows on the rock.\u003c/p\u003e\n\u003cp\u003eElizabeth studied the writing closer. “Harappan,” she said, surprised, and stared around her. “We must be in the outer edges of the Indus Valley. A great civilization once made their home here.”\u003c/p\u003e\n\u003cp\u003eMasterson agreed with a nod. “The Harappans lived along the Indus River five thousand years ago, leaving behind the ruins of sophisticated cities and temples. You can find them throughout the region. Perhaps our young Hindu friend mistook one of the old Harappan ruins for the temple inscribed on the strange coin.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-oracle-sigma-force-5/page-43.html","bookId":1528,"creation":"Oct 5, 2019 10:36:06 PM","modification":"Oct 5, 2019 10:36:06 PM"}
