{"id":104114,"no":68,"title":"Page 68","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe emptied the entire clip, dropping all five men.\u003c/p\u003e\n\u003cp\u003eMonk tossed the pistol aside. Pyotr dashed forward and grabbed another. He passed it to Monk, snatched his sleeve again, and they were off.\u003c/p\u003e\n\u003cp\u003eAll around the cavern, more explosions rocked. Men screamed and smoke poured from several of the abandoned apartment buildings. As he ran, he spotted the screaming passage of a rocket-propelled mortar or grenade. It slammed into another of the buildings. Concrete and glass exploded outward, showering the soldiers below.\u003c/p\u003e\n\u003cp\u003eThe base was under attack.\u003c/p\u003e\n\u003cp\u003eBut by whom?\u003c/p\u003e\n\u003cp\u003eGray raced the truck down the concrete ramp and through the massive doors. On the plane ride here, he had read about these complexes, these cities underground. The Soviets used to bring in orchestras and bands to play for the workers, filling subterranean amphitheaters. Still, Gray was not ready for the sheer size of the place.\u003c/p\u003e\n\u003cp\u003eNor the chaos.\u003c/p\u003e\n\u003cp\u003eSix trucks had led the initial assault.\u003c/p\u003e\n\u003cp\u003eTo soften them up, Luca had said.\u003c/p\u003e\n\u003cp\u003eGray couldn’t argue. This was Luca’s army, not his.\u003c/p\u003e\n\u003cp\u003eHe had one mission.\u003c/p\u003e\n\u003cp\u003eGray shot through a wall of smoke. He saw rocket fire slamming into the five-story apartment buildings, collapsing entire sections. Luca was in the bed of the truck, braced with a rocket on his shoulder. Two trucks flanked to either side. Kowalski drove one, Rosauro the other.\u003c/p\u003e\n\u003cp\u003eAfter their trucks passed through the mouth of the tunnel, the Gypsies closed off the exit road behind them, blocking the way with a pair of logging trucks, heavy with timber. Two dozen men manned the barricade and kept anyone from leaving.\u003c/p\u003e\n\u003cp\u003eGray was impressed by the Gypsies’ attack strategy—both now and moments before.\u003c/p\u003e\n\u003cp\u003eOn the way up here from the airport, all the vehicles in the region appeared to be just ordinary rural traffic, wandering the mountainside roads and dirt tracks. Then, upon a coordinated signal, the entire peaceful-looking countryside rose and turned upon the mountain in a synchronized assault. Rifles bristled out of bunkers built into the centers of hay trucks. Horses broke away from wagons with riders bearing shotguns, covering steeper terrain swiftly. Motorcycles rocketed out of the back of paneled milk trucks and shot up the side roads. The sudden transformation locked the mountainside down in a matter of minutes.\u003c/p\u003e\n\u003cp\u003eThe Russians who had already left the subterranean compound were waylaid on the road, driven into ditches, stripped of weapons, and tied up. By the time Gray reached the mountain entrance, the advance assault team was already barreling into the throat of the tunnel, leaving a trail of smoke and fire for him to follow.\u003c/p\u003e\n\u003cp\u003eGray hadn’t hesitated. They had no time to spare. Operation Saturn had to be found and stopped.\u003c/p\u003e\n\u003cp\u003eAnd Luca’s men assisted there, too. Like any good army, the Gypsies had gathered intelligence in advance of an attack. On the way up here, a man in a black ankle-length duster had stood in the middle of the road and waved Luca’s truck to stop. Two men in laboratory coats knelt in the roadside ditch, hands behind their backs, rifles held at their heads. The Gypsies hadn’t been gentle. Then again, it was the Russians who had slaughtered their mountaintop village and kidnapped their children.\u003c/p\u003e\n\u003cp\u003eThe Russians had started this war; the Gypsies intended to finish it.\u003c/p\u003e\n\u003cp\u003eThe interrogator passed Luca a hand-drawn map, splattered with blood. Luca handed it off to Gray. It was a crude schematic of Chelyabinsk 88, including a circle around the control station for Operation Saturn, located in a subbasement bunker beneath one of the cavern’s apartment structures.\u003c/p\u003e\n\u003cp\u003eWith the goal known, Gray careened the truck down the curving road toward the ongoing siege at the high-rise complex. The initial attack, while dramatic and surprising, had also clogged the road with rubble. One entire building had fallen across the central roadway.\u003c/p\u003e\n\u003cp\u003eGypsies in trucks continued to mount a fiery barrage.\u003c/p\u003e\n\u003cp\u003eOthers abandoned their vehicles and prepared for a ground offensive.\u003c/p\u003e\n\u003cp\u003eGray skidded his truck to where the men gathered and rolled out. Kowalski and Rosauro joined him. Hopping out of the truck bed, Luca called out in Romani. Men responded. After a few exchanges, Luca turned to Gray and hunkered down with him behind one of the trucks.\u003c/p\u003e\n\u003cp\u003e“The Russians have taken to the buildings, defending more fiercely the deeper you go.”\u003c/p\u003e\n\u003cp\u003eGray knew why. “They’ve pulled their forces back to defend the control station. If they’ve not already initiated Saturn, they will soon. We can’t wait.”\u003c/p\u003e\n\u003cp\u003eLuca held up a restraining hand and glanced back toward the gathered ground troops. “I have a man…ah, here he is.”\u003c/p\u003e\n\u003cp\u003eA small figure ran low over to them. He wore cement-gray clothes and a black cap. The two Romani men spoke quickly.\u003c/p\u003e\n\u003cp\u003e“This is Rat,” Luca introduced the newcomer.\u003c/p\u003e\n\u003cp\u003e“Nice name,” Kowalski mumbled.\u003c/p\u003e\n\u003cp\u003e“He’s a scout. Skilled at finding paths no one would think to guard. He may know a way, but it’ll have to be a small party. No more than five or six.” Luca looked around at their small group. “Perhaps just us. Va?”\u003c/p\u003e\n\u003cp\u003e“Va,” Kowalski agreed, then glanced to Gray for confirmation.\u003c/p\u003e\n\u003cp\u003e“The other men will keep the Russians busy,” Luca added, waving to the ground forces and trucks.\u003c/p\u003e\n\u003cp\u003e“We go then?” Rat asked in stilted English.\u003c/p\u003e\n\u003cp\u003e“Va,” Gray answered, earning a grin from the man and a clap on his knee.\u003c/p\u003e\n\u003cp\u003eThey readied their weapons—rifles and sidearms—and followed the small man toward a pile of rubble. Gray could see no way through. Luca motioned to the ground forces as they passed. A sharp warbling whistle spread across the smoky cavern.\u003c/p\u003e\n\u003cp\u003eRat waved their small team under a tilted section of wall. Gray ducked and found it led to a basement window of the closest apartment building.\u003c/p\u003e\n\u003cp\u003eAs they slowly continued into the scout’s maze, Gray heard a shout rise behind him.\u003c/p\u003e\n\u003cp\u003e“Opre Roma!”\u003c/p\u003e\n\u003cp\u003eLike a flame set to dry grass, the clarion call spread.\u003c/p\u003e\n\u003cp\u003eGunfire and rocket blasts intensified.\u003c/p\u003e\n\u003cp\u003eContinuing onward, Gray prayed they weren’t too late.\u003c/p\u003e\n\u003cp\u003eSavina moved swiftly down the stairs and into the bunker. She ignored the twinges from her back, the shooting pains down her legs, and her pounding heart. At the first sound of attack, she had the blast doors to the tunnel sealed and locked.\u003c/p\u003e\n\u003cp\u003eAbove, waiting for her, a group of the five strongest soldiers had been summoned by Dr. Petrov. The plan was to abscond with five children, carried on the backs of the soldiers. No more. She could not take all ten. Their best chance to escape was to move quickly and efficiently. The American prisoner had given her the idea. He and the children had fled out a back service tunnel. They would do the same.\u003c/p\u003e\n\u003cp\u003eBut Savina had one last measure to address.\u003c/p\u003e\n\u003cp\u003eShe entered the bunker and found the technician and engineer tearing out keyboards. They had already used magnetic wands to wipe the hard drives. The damage to the controls would guarantee that nothing would interfere with the progress of Operation Saturn.\u003c/p\u003e\n\u003cp\u003e“Is everything locked down?”\u003c/p\u003e\n\u003cp\u003eThe engineer nodded his head vigorously. “It would take an electrical genius weeks to repair it.”\u003c/p\u003e\n\u003cp\u003e“Very good.” She lifted her pistol and shot the engineer through the forehead. The technician tried to run, but Savina swung her arm and dropped him at the foot of the stairs, pierced through the neck. He writhed, choking on his own blood.\u003c/p\u003e\n\u003cp\u003eShe could not risk these two being caught. What they dismantled, they might be forced to fix at gunpoint.\u003c/p\u003e\n\u003cp\u003eShe could not let that happen.\u003c/p\u003e\n\u003cp\u003eTo satisfy herself even further, Savina grabbed a fire ax from the back wall and crossed to the boards. Lifting it high, she smashed both computers and electronics boards. Afterward, she rested the ax on the floor and leaned on its handle. She stared at the row of LCD screens. They still displayed views from various cameras. She considered smashing the monitors, too, but with her back in full spasm, she didn’t know if she could lift the ax again.\u003c/p\u003e\n\u003cp\u003eAnd in the end, what did it matter?\u003c/p\u003e\n\u003cp\u003eShe shoved the ax to the floor and stared at the centermost screen. Water poured in a toxic black stream.\u003c/p\u003e\n\u003cp\u003eLet them see what she had wrought.\u003c/p\u003e\n\u003cp\u003eShe smiled, enjoying this one last act of cruelty, then turned and headed for the stairs.\u003c/p\u003e\n\u003cp\u003eLet them watch the world die.\u003c/p\u003e\n\u003cp\u003eNo one could stop her.\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003eSeptember 7, 1:03 P.M.\u003c/p\u003e\n\u003cp\u003eSouthern Ural Mountains\u003c/p\u003e\n\u003cp\u003ePyotr led the man by his shirtsleeve. They ran through chaos. Soldiers screamed, glass shattered, rifles blasted, flames writhed, and smoke choked. But it wasn’t chaos to Pyotr.\u003c/p\u003e\n\u003cp\u003eHe tugged Monk into a sheltering dark doorway as a soldier rounded a corner ahead, searched, then moved on. Pyotr hurried the man down a hall, up some stairs, out a window, and over a pile of rubble to the next building.\u003c/p\u003e\n\u003cp\u003e“Pyotr, where are we going?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer, couldn’t answer.\u003c/p\u003e\n\u003cp\u003eReaching another hall, Pyotr stopped. In his head, he stretched outward along a thousand possibilities. Hearts glowed like small pyres, flickering with fear, anger, panic, cowardice, malice. He understood how each would move even before they did. It was his talent, only so much more now.\u003c/p\u003e\n\u003cp\u003eFor he had a secret.\u003c/p\u003e\n\u003cp\u003eOver the past years, as he woke screaming from his nightmare, waking other children with visions of bodies on fire, there was a reason his other classmates performed so poorly on their tests afterward. The teachers believed it was just because Pyotr had scared them, but they were wrong. Pyotr’s talent was to read hearts. They called it empathy. But he had a secret, something he only talked to Marta about.\u003c/p\u003e\n\u003cp\u003eSomething he knew from his dreams.\u003c/p\u003e\n\u003cp\u003eHe could do more than read hearts—he could also steal them. It wasn’t fear that made the other children perform poorly; they had something drawn from them. For just a few minutes after waking, Pyotr could do anything. He could multiply big numbers, like Konstantin; he could tell a person was lying by listening to how they talked, like Elena; he could see to hidden places, like his sister; and so much more. It filled him until he burned.\u003c/p\u003e\n\u003cp\u003eHe pictured the stars falling into him, screaming, feeding the emptiness inside him. In his dreams, he had always woken before he consumed them fully. Not today. Pyotr walked through a dream from which he could never wake. He knew he had crossed a line, but he also knew he had no choice. He was always meant to burn.\u003c/p\u003e\n\u003cp\u003ePyotr stared out at the chaos with a fiery gaze that was not his alone. Through a hundred eyes, he teased a pattern out of the chaos. Though he could not see the future—or at least no more than a few seconds—his ears took in every noise, his eyes interpreted every flicker of flame or shift of shadow, his heart read deep into what drove a man to choose to step here or there, to take that corner or not, to shoot or run. And with a shadow of his sister’s ability, his senses extended a few yards beyond even that. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-oracle-sigma-force-5/page-68.html","bookId":1528,"creation":"Oct 5, 2019 10:36:06 PM","modification":"Oct 5, 2019 10:36:06 PM"}
