{"id":104119,"no":73,"title":"Page 73","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe turned slightly to the side and wiped her eyes. “I know,” she said, but it sounded like a moan.\u003c/p\u003e\n\u003cp\u003eWith his senses tuned sharp by a trailing edge of nausea, Monk caught a scent in the air, familiar, spiced yet musky. No memory came with it, but his breathing grew heavier. Something…something about…\u003c/p\u003e\n\u003cp\u003e“We should let him rest,” Gray said and guided the woman away. “We’ll come back in the morning. It’s been a long day. You should be getting her home anyway.”\u003c/p\u003e\n\u003cp\u003eGray nodded to a blue stroller behind them. A small child slept, nestled in blankets, head capped like Monk’s, eyes closed, a pursed button of a mouth.\u003c/p\u003e\n\u003cp\u003eMonk’s eyes locked on the baby. Staccato flashes burst into existence out of nothingness.\u003c/p\u003e\n\u003cp\u003e…tiny fingers curled around his finger…walking down a long, dark hall, tired, rocking the small figure in his arms…little kicking feet as he changed a diaper…\u003c/p\u003e\n\u003cp\u003eJust snippets. No coherency. But unlike before, there was no pain, only a soothing brightness that did not fade this time.\u003c/p\u003e\n\u003cp\u003eOut of that glow, he found a small sliver of himself.\u003c/p\u003e\n\u003cp\u003e“She’s…her name…” The two turned to her. “It’s Penelope.”\u003c/p\u003e\n\u003cp\u003eThe woman stared at the child, back to him. Her entire form shook as teats spilled in shining streaks of joy. “Monk…”\u003c/p\u003e\n\u003cp\u003eShe rushed to his side, falling over him. She leaned and kissed him gently, her hair draped over them like a tent.\u003c/p\u003e\n\u003cp\u003eHe remembered.\u003c/p\u003e\n\u003cp\u003eThe taste of cinnamon, soft lips…\u003c/p\u003e\n\u003cp\u003eHe still did not know her name, but a surge of love swelled through him that drew tears to his own eyes. Maybe he would never know her name, not truly, but Monk knew one thing with all his heart: if she’d let him, he would spend the rest of his life learning who she was all over again.\u003c/p\u003e\n\u003cp\u003e7:01 P.M.\u003c/p\u003e\n\u003cp\u003eGray headed down the hospital corridor, leaving Kat and Monk some privacy. While here, he wanted to check on one last patient. He crossed over to the children’s ward. He showed his identification to an armed guard who protected the wing.\u003c/p\u003e\n\u003cp\u003eOnce through, he passed several wards and smaller rooms. The walls were painted with balloons and cartoon animals. He passed a tall boy in hospital pajamas. He was walking with a smaller girl. Both their heads were shaved on one side. They were chatting enthusiastically in Russian.\u003c/p\u003e\n\u003cp\u003eAll the children seemed to be recovering from their ordeal.\u003c/p\u003e\n\u003cp\u003eThat is, all except one.\u003c/p\u003e\n\u003cp\u003eHe crossed down another long corridor to a private room at the very end. The door was open. He heard voices inside.\u003c/p\u003e\n\u003cp\u003eGray knocked softly and entered. The room held a single bed and a small play area with a yellow plastic table and a set of children’s chairs around it. He found Dr. Lisa Cummings standing inside, filling out a chart. With her medical background, she was assisting the surgeons and doctors, while keeping Painter updated on status reports and abreast of any problems.\u003c/p\u003e\n\u003cp\u003eSasha sat at the table, coloring in her book. She wore a pink bonnet that covered her shaved head.\u003c/p\u003e\n\u003cp\u003e“Mr. Gray!” the girl called to him and popped out of her chair like a jackrabbit and ran over to him. She hugged his leg.\u003c/p\u003e\n\u003cp\u003eHe patted her shoulder.\u003c/p\u003e\n\u003cp\u003eSasha came here as often as Gray, visiting her brother.\u003c/p\u003e\n\u003cp\u003ePyotr sat in a wheelchair by the window, staring out at the growing twilight. He sat like a mannequin. Upright, stiff, unresponsive.\u003c/p\u003e\n\u003cp\u003e“Any change?” Gray asked and nodded to the chart in Lisa’s hands.\u003c/p\u003e\n\u003cp\u003e“Some actually. He’s now taking food by spoon. Baby food. It’s like he’s infantilized. The doctors are hoping that over time, he may grow into his body.”\u003c/p\u003e\n\u003cp\u003eGray hoped they were right. The boy had saved the world and sacrificed everything to do it.\u003c/p\u003e\n\u003cp\u003e“Gray, if you can put the boy to bed, we’ll let you have some time alone with him.”\u003c/p\u003e\n\u003cp\u003eGray nodded.\u003c/p\u003e\n\u003cp\u003e“C’mon, Sasha, let’s go back to your room.”\u003c/p\u003e\n\u003cp\u003e“Wait!” She let go of Gray’s leg and ran to Pyotr.\u003c/p\u003e\n\u003cp\u003e“Say good night to Pyotr, then we have to go,” Lisa insisted.\u003c/p\u003e\n\u003cp\u003eSasha kissed her brother on the cheek, then came running back to Gray and lifted her arms toward him.\u003c/p\u003e\n\u003cp\u003eGray knelt down for a good-bye kiss, too, and offered his cheek. She kissed it, then grabbed his earlobe. She leaned in close and whispered, tickling his ear.\u003c/p\u003e\n\u003cp\u003e“Pyotr’s not in there,” she said in conspiratorial tones. “Someone else is in there. But I’ll still love him.”\u003c/p\u003e\n\u003cp\u003eGray felt a slight chill at her words. Sasha must have overheard the doctors. The prognosis was ultimately grim. Even if Pyotr could recover some manner of life, he wouldn’t be the same boy.\u003c/p\u003e\n\u003cp\u003eGray rubbed her arm, reassuring her, but he offered her no false hope. It was best she adjust to the reality in her own way.\u003c/p\u003e\n\u003cp\u003e“Sasha,” Lisa said warningly.\u003c/p\u003e\n\u003cp\u003e“Wait!” she burst out again and ran to her table. “I have something for Mr. Gray.” She shuffled through her piles of papers.\u003c/p\u003e\n\u003cp\u003eGray waited, still down on one knee.\u003c/p\u003e\n\u003cp\u003eLisa smiled. “She really doesn’t want to go to bed.”\u003c/p\u003e\n\u003cp\u003eThe girl came flying back with a page ripped from a coloring book in her hand. She thrust it at Gray. “Here,” she said proudly.\u003c/p\u003e\n\u003cp\u003eGray stared down at a picture of a clown. She had colored it perfectly, even adding some nuance with shading to make the clown seem both sad and slightly creepy. She obviously still retained some artistic talent.\u003c/p\u003e\n\u003cp\u003eSasha leaned to his ear again. “You’re going to die.”\u003c/p\u003e\n\u003cp\u003eGray was taken aback by her statement, but there was no menace in her voice, only a matter-of-fact tone, as if commenting on the weather. Gray imagined Sasha was struggling to understand the concept of death. She had seen too much of it, and her brother hung somewhere in the balance between the living and the dead.\u003c/p\u003e\n\u003cp\u003eGray didn’t know what to say. But like before, he wouldn’t lie to her. He stood but kept a hand on her shoulder. “We all die eventually, Sasha. It’s the natural order.”\u003c/p\u003e\n\u003cp\u003eShe sighed in the overly dramatic manner of all exasperated children.\u003c/p\u003e\n\u003cp\u003e“No, silly.” She pointed up to the paper. “You have to be careful of that! That’s why I drew it!”\u003c/p\u003e\n\u003cp\u003eLisa pointed to the door. “That’s enough, Sasha. Time for bed.”\u003c/p\u003e\n\u003cp\u003e“Wait!”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eCrestfallen, she allowed Lisa to drag her away. She waved back at Gray, using her entire arm.\u003c/p\u003e\n\u003cp\u003eOnce they were gone, Gray crossed over to Pyotr. He liked to sit with the boy, to let him know he was not forgotten, that his sacrifice would be remembered. He also came here because of Monk. The boy had meant so much to his friend. Gray felt a certain obligation to keep Pyotr company.\u003c/p\u003e\n\u003cp\u003eBut in truth, the visits were also a balm on his heart. He felt a strange calmness with the boy that was inexplicable, as if some empathic aura still surrounded the child.\u003c/p\u003e\n\u003cp\u003eAs Gray sat now, he considered all that had happened. He remembered the boy dragging Monk into view down the hall. Gray now understood what Pyotr had been doing. His sister had saved Monk’s life by plucking him out of the sea and out of their lives, and Pyotr had been returning him, like putting a borrowed wrench back into a neighbor’s toolbox.\u003c/p\u003e\n\u003cp\u003eAll that had happened…Gray knew it hadn’t been luck, nor even coincidence. He stared at Pyotr and pictured Sasha, too.\u003c/p\u003e\n\u003cp\u003eIt had all been orchestrated.\u003c/p\u003e\n\u003cp\u003eAnd as Gray stared, he also recalled Nicolas Solokov’s goal: to manipulate the savants in order to produce the world’s next great prophet. The next Buddha or Muhammad or Christ. Gray had also discussed such speculations with Monk while the two had visited Pyotr here.\u003c/p\u003e\n\u003cp\u003eAfterward, his friend had nodded to the boy.\u003c/p\u003e\n\u003cp\u003eMaybe the Russians were more successful than they had imagined.\u003c/p\u003e\n\u003cp\u003eEither way, like so many great people, Pyotr had paid the ultimate sacrifice. Now they would never know the truth. And maybe it was better that way.\u003c/p\u003e\n\u003cp\u003eGray sighed and pushed away such melancholy thoughts. In his hands, he folded Sasha’s coloring page and glanced down to it. Apparently, besides everything else, Gray now had to worry about creepy clowns. As he creased the paper, he saw that the child had drawn something freehand on the blank page on the back.\u003c/p\u003e\n\u003cp\u003eUnfolding it, he stared down at a shape, finely drawn in black crayon.\u003c/p\u003e\n\u003cp\u003eIt was a small Chinese dragon, beautifully executed.\u003c/p\u003e\n\u003cp\u003eAn icy jolt of recognition shot through Gray. His hand rose to his throat. Tucked under his shirt was a pendant bearing the same dragon in silver, a gift from an assassin, both a promise from her and a curse.\u003c/p\u003e\n\u003cp\u003eGray glanced to the doorway. Had Sasha seen the charm sometime? He stared down at the crayon drawing, knowing in his heart she hadn’t.\u003c/p\u003e\n\u003cp\u003eIt was a warning—but not about clowns. As he stared, Gray realized Sasha had been pointing up to the page in his hands. From her low vantage, she hadn’t been indicating the clown. She had been pointing to the page’s underside.\u003c/p\u003e\n\u003cp\u003eTo the dragon symbol.\u003c/p\u003e\n\u003cp\u003eIn the quiet of the room, Gray sensed a looming danger. He whispered the name tied to that threat.\u003c/p\u003e\n\u003cp\u003e“Seichan.”\u003c/p\u003e\n\u003cp\u003eEPILOGUE\u003c/p\u003e\n\u003cp\u003eThe boy sits by the window and stares out at the twilight world beyond. He is not ready to go out there yet. He still has much to adjust to in this new home. It fits him poorly and makes it difficult for him to think.\u003c/p\u003e\n\u003cp\u003eHe can see his reflection in the glass: dark hair, small features, a familiar face. But it does not yet feel like his own. That, too, would come in time. As he stares, he watches the leaves falling past the window, drifting on the wind.\u003c/p\u003e\n\u003cp\u003eThere is no fear now, even as more leaves fall. That which lies deep inside him fills in the spaces with shadow and shape. Formed out of memory. What comes is still more familiar than his own reflection in the glass. He knows it was the face he once wore.\u003c/p\u003e\n\u003cp\u003eHe still remembers the darkness, a black sea swimming with lights. He remembers the dying sun in the middle, strangled away so that others might fly and shine. But in that last moment, the boy who had once worn this body had kept a secret from them all. As he left that dark sea to places beyond, he pulled another light out of harm’s way and dropped it into that empty dark sea.\u003c/p\u003e\n\u003cp\u003eSo it might live anew.\u003c/p\u003e\n\u003cp\u003eOutside now, more leaves tumble, and shadows of memory fill in gaps, forming the true face of the one who wore this body now. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-oracle-sigma-force-5/page-73.html","bookId":1528,"creation":"Oct 5, 2019 10:36:07 PM","modification":"Oct 5, 2019 10:36:07 PM"}
