{"id":69631,"no":17,"title":"Page 17","content":"\u003cp\u003e(with apologies to W. S. gilbert)\u003c/p\u003e\n\u003cp\u003ePlots, helter-skelter, teem within your brain;\u003c/p\u003e\n\u003cp\u003ePlots, s.f. plots, devised with joy and gladness; Plots crowd your skull and stubbornly remain,\u003c/p\u003e\n\u003cp\u003eUntil you\u0027re driven into hopeless madness.\u003c/p\u003e\n\u003cp\u003eWhen you\u0027re with your best girl and your mind\u0027s in a whirl and you don\u0027t\u003c/p\u003e\n\u003cp\u003ehear a thing that she\u0027s saying; Or at Symphony Hall you are gone past recall and you can\u0027t tell a note that\u003c/p\u003e\n\u003cp\u003ethey\u0027re playing; Or you\u0027re driving a car and have not gone too far when you find that you\u0027ve\u003c/p\u003e\n\u003cp\u003esped through a red light, And on top of that, lord! you have sideswiped a Ford, and have broken your\u003c/p\u003e\n\u003cp\u003eone working headlight; Or your boss slaps your back (having made some smart crack) and you stare\u003c/p\u003e\n\u003cp\u003eat him, stupidly blinking; Then you say something dumb so he\u0027s sure you\u0027re a crumb, and are possibly\u003c/p\u003e\n\u003cp\u003egiven to drinking.\u003c/p\u003e\n\u003cp\u003eWhen events such as that have been knocking you flat, do not blame supernatural forces; If you write s.f. tales, you\u0027ll be knocked off your rails, just as sure as the stars in their courses.\u003c/p\u003e\n\u003cp\u003eFor your plot-making mind will stay deaf, dumb and blind to the dull facts of life that will hound you, While the wonders of space have you close in embrace and the glory of star beams surround you.\u003c/p\u003e\n\u003cp\u003eYou begin with a ship that is caught on a skip into hyperspace en route for\u003c/p\u003e\n\u003cp\u003eCastor, And has found to its cost that it seems to be lost in a Galaxy like ours, but\u003c/p\u003e\n\u003cp\u003evaster. You\u0027re a little perplexed as to what may come next and you make up a series\u003c/p\u003e\n\u003cp\u003eof creatures Who are villains and liars with such evil desires and with perfectly horrible\u003c/p\u003e\n\u003cp\u003efeatures. Our brave heroes are faced with these hordes and are placed in a terribly\u003c/p\u003e\n\u003cp\u003ecrucial position, For the enemy\u0027s bound (once our Galaxy\u0027s found) that they\u0027ll beat mankind\u003c/p\u003e\n\u003cp\u003einto submission. Now you must make it rough when developing stuff so\u0027s to keep the yarn\u003c/p\u003e\n\u003cp\u003epulsing with tension, So the Earthmen are four (only four and no more) while the numbers of foes\u003c/p\u003e\n\u003cp\u003eare past mention.\u003c/p\u003e\n\u003cp\u003eOur four heroes are caught and accordingly brought to the sneering, tyrannical leaders. \"Where is Earth?\" they demand, but the men mutely stand with a courage\u003c/p\u003e\n\u003cp\u003ethat pleases the readers.\u003c/p\u003e\n\u003cp\u003eBut, now, wait just a bit; let\u0027s see, this isn\u0027t it, since you haven\u0027t provided a\u003c/p\u003e\n\u003cp\u003emaiden, Who is both good and pure (yet with sexy allure) and with not many clothes\u003c/p\u003e\n\u003cp\u003eoverladen. She is part of the crew, and so she\u0027s captured, too, and is ogled by foes who\u003c/p\u003e\n\u003cp\u003eare lustful; There\u0027s desire in each eye and there\u0027s good reason why, for of beauty our girl\u003c/p\u003e\n\u003cp\u003ehas a bustful. Just the same you go fast till this section is passed so the reader won\u0027t raise\u003c/p\u003e\n\u003cp\u003eany ruction, When recalling the foe are all reptiles and so have no interest in human\u003c/p\u003e\n\u003cp\u003eseduction. Then they truss up the girl and they make the whips swirl just in order to\u003c/p\u003e\n\u003cp\u003ebreak Earthmen\u0027s silence, And so that\u0027s when our men break their handcuffs and then we are treated\u003c/p\u003e\n\u003cp\u003eto scenes full of violence. Every hero from Earth is a fighter from birth and his fists are a match for a\u003c/p\u003e\n\u003cp\u003edozen,\u003c/p\u003e\n\u003cp\u003eAnd then just when this spot has been reached in your plot you come to with your mind all a buzzin\u0027.\u003c/p\u003e\n\u003cp\u003eYou don\u0027t know where you are, or the site of your car, and your tie is askew and you haven\u0027t a clue of the time of the day or of what people say or the fact that they stare at your socks (not a pair) and decide it\u0027s a fad, or else that you\u0027re mad, which is just a surmise from the gleam in your eyes, till at last they conclude from your general mood, you\u0027ll be mad from right now till you\u0027re hoary.\u003c/p\u003e\n\u003cp\u003eBut the torture is done and it\u0027s now for the fun and the paper that\u0027s white and the words that are right, for you\u0027ve worked up a new s.f. story. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-complete-stories/page-17.html","bookId":1734,"creation":"Oct 5, 2019 10:13:56 AM","modification":"Oct 5, 2019 10:13:56 AM"}
