{"id":7805,"no":12,"title":"CHAPTER XI THE MAN FROM DAKOTA","content":"\u0026nbsp;The man who had just entered the reading-room was no other than Detective Green. \n\u003cdiv\u003e\n He nodded pleasantly to Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you have put up here,” he said. “Well, it is a good place. And is this gentleman a friend of yours?” indicating the man in the white hat.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I bought the watch from him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ha! I thought so. I see you know me, Steve Ashton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered Ashton, nervously. “I hope you are well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very kind. Then you really hope I am well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course. Why shouldn\u0027t I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, there are some of your companions, I hear, who are not so cordial—Jim Beckwith, for instance. By the way, you have some business arrangements with Jim Beckwith?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know him, sir,” answered Astern, hesitatingly. “You know him well, I suspect. So you sold my young friend here a watch?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At a remarkable sacrifice?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. It was worth more than he paid for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And yet it seemed likely to be a losing bargain for him. It would have been—but for me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ashton looked at Walter inquiringly. The latter smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You gave me credit for being smarter than I was,” said Walter. “Mr. Green, here, came to my assistance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think, Mr. Ashton,” said Detective Green, with suavity, “that you have a wife and family in Dakota?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I, sir—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; and it was to obtain money to join them that you sold your watch on the train?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered Ashton, faintly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to give you a bit of advice. It will be wise for you to go to Dakota, as you planned. This is a wicked city—in spots—and I am afraid you have been keeping bad company. How long have you known Beckwith?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About six months.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he drew you into this business?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought so. You are new to the profession. Still, I knew you. I make it a point to get acquainted with the new men. Is the watch honestly yours?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Get it back from Beckwith, and then drop his acquaintance. If necessary, leave Chicago. Have you a trade?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. I am a machinist.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a good trade. Go back to it. Is that advice friendly?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered Ashton, with more confidence. “I didn\u0027t expect to get friendly advice from Detective Green.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps not. You didn\u0027t know me, that was all. You looked upon me as an enemy, I suppose?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am an enemy to those who are incurably bad. I think you were meant for an honest man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I was, sir. I should be still if I hadn\u0027t met with Jim Beckwith.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have done with him, then. If you follow my advice you need not fear meeting with me again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The detective went up to the desk, bought a cigar and then left the room, with a nod to Ashton and Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you follow his advice?” asked Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I will. Hereafter I will depend upon honest work for an honest livelihood. What is your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Walter Sherwood.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, Walter Sherwood, I am glad I did not succeed in robbing you. Yet I am glad I met you. It will lead to my reformation. Will you give me your hand?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Willingly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Steve Ashton shook the proffered hand energetically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I can do you a favor at any time I shall be glad to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you can. I cannot afford to live at a hotel. Can you recommend me to some respectable but modest-priced boarding-house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. The widow of a machinist who used to be employed in the same shop as myself keeps a few boarders. I think she would take you for six dollars a week, or five if you have a friend to room with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you show me the place after supper—that is, unless you are in a hurry to start for Dakota?” He added, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I never was in Dakota in my life,” said Ashton. “I told you a lie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was beginning to think so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I shall drop all that. From this time on you can trust me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n After supper Walter went round with Ashton to a house in Harrison Street—the boarding-house referred to. The door was opened by a careworn woman of middle age.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you do, Mr. Ashton?” she said, with an inquiring look.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, thank you, Mrs. Canfield. Have you any rooms vacant?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you asking for yourself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, for my young friend here, Mr. Sherwood.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you want a large room or a small one?” asked Mrs. Canfield, brightening up a little.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That depends a little on the price,” answered Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can give you a hall bedroom and board for five dollars and a half a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you show me the room?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be kind enough to follow me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter followed the landlady up a narrow staircase, or rather two of them, and was shown a hall bedroom, which seemed to be uncomfortably full, though it only contained a bedstead, a chair, a very small bureau and a washstand. There was scarcely room for him to stand unless he stood on the bed. It was indeed vastly different from his nice college room and from his comfortable chamber at home.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to see a larger room,” said Walter, not venturing to make any comment on the hall room.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was shown an adjoining apartment, about ten feet by twelve. It was small, but decidedly preferable to the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much do you charge for this room, Mrs. Canfield?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall have to charge you six dollars if you occupy it alone, but if you can get another young gentleman to occupy it with you I will say ten dollars for the two.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will take it alone at first. Can I move in tomorrow morning?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will have it ready for you by eleven o\u0027clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you like it?” asked Ashton, when they were in the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I can make it do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you have been used to something better?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can direct you to a better house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, but six dollars a week is all I can afford at present. I have no income, but I shall look for a place at once.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You haven\u0027t any trade, have you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered Walter, with a smile. Brought up as he had been, it seemed odd to be asked if he had a trade.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some trades pay very well. I have a nephew who is a bricklayer. He gets from three to four dollars a day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid I should not like that business. Besides, it would take a good while to learn it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter smiled to himself as he pictured some of his aristocratic college friends seeing him laying bricks. He was not a snob, nor would he have disdained to notice a friend or school companion filling such a position, but he felt that Providence must have something in store for him more congenial, though perhaps less lucrative.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have a cousin who is a carpenter,” proceeded Ashton. “He makes two dollars and a half a day, and supports a wife and three children in comfort.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder if I could support a family on fifteen dollars a week?” thought Walter. “Fortunately, I have only to support myself. I ought to be able to do that in a large city like Chicago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Reared in comfort, Walter knew very little of the competition and struggles of workingmen, and had an idea that he would be able easily to command a salary of ten dollars a week, though he was wholly disqualified for any special line of business. This he set down as the minimum. Paying six dollars a week for board, he calculated that he could get along on this salary with extreme economy. Fortunately, he was pretty well provided with clothing, or would be when he had sent for his trunk, and would not find it necessary for some time to come to purchase anything, except probably a pair of shoes, a necktie, or some trifle. Then probably his pay would soon be raised, and this would make him comfortable.\n\u003c/div\u003e \n\u003cdiv\u003e\n That evening Walter went to Hooley\u0027s Theater and occupied a dollar seat. It was hardly prudent, but he had seventy dollars still, and that seemed to him a large sum. He enjoyed the play, and got a sound night\u0027s rest after it.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning he settled his hotel bill, took his gripsack in his hand, and walked over to his new boarding-house.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3022/83587.html","bookId":259,"creation":"Aug 1, 2019 8:00:33 AM","modification":"Aug 1, 2019 8:00:33 AM"}
