{"id":7822,"no":29,"title":"CHAPTER XXVIII WALTER GOES OUT OF BUSINESS","content":"\u0026nbsp;By the time Walter received his prize of eight hundred dollars he had saved enough out of his wages to make nearly a thousand. He reflected with pride that this money had not been left him, but was the fruit of his own exertions. He resolved to say nothing in his letters home of his good fortune, but wait till he returned, when he would have the pleasure of taking his guardian by surprise. \n\u003cdiv\u003e\n A day later he received a letter from Doctor Mack, which had been forwarded from one place to another, and was now nearly three weeks old.\n\u003c/div\u003e \n\u003cdiv\u003e\n It ran thus:\n\u003c/div\u003e \n\u003cdiv\u003e\n DEAR WALTER: You give but scanty intelligence of your progress and success, or want of it. I respect you for your determination to support yourself, but I don\u0027t want you to carry your independence too far. As you have never fitted yourself for any kind of business, I presume your earnings are small. I should not be surprised to hear that you are straitened for money. If you are, don\u0027t let your pride prevent your informing me. I can easily send you fifty dollars, for your property was not all lost, and it is not fitting that you should deprive yourself of the comforts of life when there is no occasion for it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nancy often speaks of you, and, indeed, I may say that we both miss you very much, and wish the year were up, so that you might return to us. I have hopes of righting your property, so that you may go back to Euclid College at the beginning of the fall session. I am glad to learn by your last letter that your health is excellent. Once more, don\u0027t hesitate to write to me for money if you need a remittance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your affectionate guardian,\n\u003c/div\u003e \n\u003cdiv\u003e\n “EZEKIEL MACK.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter smiled as he finished reading the letter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what my good guardian would say,” he soliloquized, “if he knew that I had nearly a thousand dollars saved up? He would open his eyes, I fancy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He sat down at once and made a reply, in the course of which he said: “Don\u0027t trouble yourself to send me money. I can get along with the wages I receive. When I left home I made up my mind not to call upon you for help, and I am glad to say there is no occasion to do so as yet. I think my year\u0027s absence from college will do me good. I am ashamed when I consider how poorly I appreciated the advantages of study, and how foolishly I spent my time and money. If I ever go back to college I shall turn over a new leaf. I have seen something of the world and gained some experience of life, and feel about half a dozen years older than when I left college.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When Doctor Mack, a week later, read these lines he smiled contentedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My experiment is working well,” he said. “It is making a man of Walter. He has been a drone, hitherto. Now he has become a worker, and, though I may not like him better, for he was always near to my heart, I respect him more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n A week later Walter, on returning from a walk, found a middle-aged stranger in conversation with Professor Robinson.\n\u003c/div\u003e \n\u003cdiv\u003e\n The professor seemed a little embarrassed when Walter entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have some news for you, Walter,” he said. “I am afraid it will not be welcome to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Please let me hear it, professor,” said Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This gentleman is Nahum Snodgrass, of Chicago, who has been for some years a traveler for a large wholesale-drug-house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to meet you, Mr. Snodgrass,” said Walter, politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n Snodgrass, who was a thin, dry-looking man, nodded briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have just sold out my business to him,” went on Professor Robinson, “and henceforth shall aim to live more easily and enjoy the presence of my family.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I congratulate you, professor,” said Walter. “I think you deserve a life of leisure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Snodgrass is willing to take you into his employ, but he does not think he can afford to pay you as much as I did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Snodgrass, clearing his throat, “I find that Professor Robinson has been foolishly liberal. The ten per cent. commission which he has paid you is simply—stu—pendous!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have not been in the habit of taking that view of it,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps not, but I do,” said Snodgrass, firmly. “You are a very young man, and ought not to expect much pay. I will give you two dollars a week and pay your traveling expenses.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I beg to decline your offer, Mr. Snodgrass,” said Walter, politely. “I have thought of changing my business before, but was unwilling to leave the professor. As we are strangers, I need have no further hesitation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Young man,” said Snodgrass, “I think you are making a mistake. It will not be so easy getting another place as you suppose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps not, but I can afford to live a few weeks without work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your savings will soon go”—Snodgrass knew nothing of Walter\u0027s prize money—“and then what will you do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Trust to luck,” answered Walter, lightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nahum Snodgrass shook his head gloomily. He thought Walter a very foolish young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n Had Walter lost his position two months earlier it would have been a serious matter to him, but now, with a capital of nearly a thousand dollars, he could afford to be independent. As he expressed it, he could afford to be idle for a few weeks. Still, he didn\u0027t wish to remain unemployed for a long time. He felt happier when at work, but wished to secure some employment that would be congenial.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Snodgrass,” said the professor, “I think you are making a mistake in not employing Walter Sherwood.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Nahum Snodgrass shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t mean to pay away all my profits to an assistant,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you can\u0027t get along alone very well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will try, unless I can find some one that will take what I am willing to pay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He finally succeeded in doing this. A young man of eighteen, employed in a drug-store in town, who was on the point of being discharged, agreed to take the position, and stepped into Walter\u0027s place. To anticipate a little, he disappeared two weeks later, carrying with him fifty dollars belonging to his employer.\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter stayed two days longer at the hotel, and then, sending his valise ahead to Burnton, twenty miles farther on, started to walk the distance. He was in a mountainous country, and the scenery was wild and attractive, so that he felt that this arrangement would prove agreeable to him. He provided himself with a stout staff and started at good speed. He had accomplished about eight miles, when he was overtaken by a shabbily dressed traveler riding on the back of a fine horse. The horseman slackened his pace when he reached Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good morning, stranger!” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good morning!” responded Walter, turning his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to have company. It\u0027s a lonesome stretch of road here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Walter, carelessly. “But there isn\u0027t any danger, is there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, there might be. A friend of mine was stabbed and robbed here three months since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; and though I haven\u0027t much money with me, I shouldn\u0027t like to be robbed of what I have.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would be inconvenient.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you carry much money with you?” asked the other, in a careless tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter was not disposed to take a stranger into his confidence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not much!” he responded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are prudent. Are you armed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter drew out Dick Ranney\u0027s revolver, which he still carried. The stranger eyed him respectfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s a mighty handsome weapon,” he said. “Just let me look at it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter began to think he had fallen in with a highwayman again.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3022/83604.html","bookId":259,"creation":"Aug 1, 2019 8:01:22 AM","modification":"Aug 1, 2019 8:01:22 AM"}
