{"id":7829,"no":36,"title":"CHAPTER XXXV THE EMPTY JAIL","content":"\u0026nbsp;Walter drew from his pocket a folded paper. \n\u003cdiv\u003e\n “Read that!” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “MR. WALTER SHERWOOD:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have pleasure in sending you the reward for the capture of the noted criminal, Dick Ranney.\n\u003c/div\u003e \n\u003cdiv\u003e\n “MILES GRAY, Sheriff.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I tell you the story?” asked Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes! Yes!” exclaimed more than one.\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter gave an account of the affair in a clear, distinct manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, gentlemen,” said Walter, as he concluded, “do you believe that I would stoop to steal a horse?”\n\u003c/div\u003e \n\u003cdiv\u003e\n There were shouts of “No! No!”\n\u003c/div\u003e \n\u003cdiv\u003e\n And Walter might have gone scot free had he chosen, but he did not choose.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, gentlemen,” he said, “take me back to the lockup.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The door is broken!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will make no difference with me. I prefer to stand trial and let my innocence be proved.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027s a brave lad!” said more than one.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish my John would turn out like him,” added one of Walter\u0027s original supporters. “You shall go with me, and have the best bed in the house,” he continued.\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter accepted this proposal with thanks.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of all that had passed during the night Constable Stokes was blissfully unconscious. At an early hour he bent his steps toward the jail. When he saw the door broken he was astounded.\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt it necessary to report what had happened to some magistrate. He had walked but a few steps when he met Mr. Barry, Walter\u0027s lawyer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And how is my young client this morning, Stokes?” inquired the lawyer pleasantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Blessed if I know! He\u0027s bolted!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is amazing! Let me see how it was done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The door was broken from the outside!” he said, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course it was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you don\u0027t think the men could have done it?”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3022/83611.html","bookId":259,"creation":"Aug 1, 2019 8:01:39 AM","modification":"Aug 1, 2019 8:01:39 AM"}
