{"id":7799,"no":6,"title":"CHAPTER VI TRUE FRIEND AND FALSE","content":"\u0026nbsp;A college community is for the most part democratic. A poor student with talent is quite as likely to be a favorite as the heir to a fortune, often more so. But there are always some snobs who care more for dollars than sense. So Walter was destined to find out, for he made no secret of his loss of fortune. Most of his college friends sympathized with him, but there was one who proved unreliable. \n\u003cdiv\u003e\n This was Harvey Warner, the son of a man who had made a fortune during the Civil War, some said as a sutler. Harvey professed to be very aristocratic, and had paid especial attention to Walter, because he, too, had the reputation of being wealthy. He had invited Walter to pass a couple of weeks at the summer residence of the Warners, near Lake George. This, however, was before he had heard of Walter\u0027s loss of fortune. As soon as he learned this, he decided that the invitation must be withdrawn. This would be awkward, as he had been on very intimate terms with our hero, and had been a guest at the banquet.\n\u003c/div\u003e \n\u003cdiv\u003e\n Not foreseeing the effect of his changed circumstances on the mind of his late friend, Walter, meeting him on the campus the day afterward, called out, familiarly: “How are you, old fellow? Why didn\u0027t you come round to my room last evening?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I had another engagement, Sherwood,” answered Warner, stiffly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ought to give me the preference,” said Walter, not observing the other\u0027s change of manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ahem! a man must judge for himself, you know. By the way, is it true that you have lost all your money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know how much I have lost, but I am not coming back to college next year.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are in hard luck,” said Warner coldly. “By the way, I think we shall have to give up that plan for the summer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What plan?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, you know I invited you to visit me at Lake George.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter began to comprehend.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, are you not going to be there?” he asked,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but the house will be full of other fellows, don\u0027t you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So that there will be no room for me,” said Walter calmly, looking Warner full in the face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Awfully sorry, and all that sort of thing,” drawled Warner. “Besides, I suppose you will have to go to work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I expect to go to work—after awhile. Probably I shall take a few weeks for rest. By the way, when did you find out that your home would be full—of other fellows?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Got a letter from my sister this morning. Besides—in your changed circumstances, don\u0027t you know, you might find it awkward to be living in a style you couldn\u0027t keep up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Warner. You are very considerate. I really didn\u0027t give you credit for so much consideration.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t mention it! Of course with your good sense you understand?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And, by the way, I believe you borrowed two dollars of me last week. If it is inconvenient for you to pay the whole at once, you might hand me a dollar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I called that fellow my friend!” said Walter to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very considerate again, but I think I would rather pay the whole at once. Can you change a ten?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Harvey Warner looked surprised. He had jumped to the conclusion that Walter was the next thing to a pauper, and here he was better supplied with money than himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not sure that I have as much money here,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then come with me to the drug-store; I am going to buy a bottle of tooth-wash, and will change the bill there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Warner accepted this proposal.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027d better make sure of my money while he has it,” he reflected.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you\u0027re not very much disappointed about the visit?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at all! I should have had to decline. I have been invited to spend a month at the Adirondacks with Frank Clifford.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t mean it!” ejaculated Warner enviously.\n\u003c/div\u003e \n\u003cdiv\u003e\n Clifford was a member of an old family, and an invitation from him was felt to confer distinction. Warner himself would have given a good deal to be on sufficiently intimate terms to receive such a compliment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “When did he invite you?” he asked suggestively.\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter saw what was in his mind, and answered, with a smile:\n\u003c/div\u003e \n\u003cdiv\u003e\n “He invited me this morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Had he heard—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of my loss of fortune? Oh, yes! But why should that make any difference?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wouldn\u0027t go, if I were you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are going to be a poor man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know about that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are poor now, at any rate.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, perhaps so, but am I any the worse for that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you would understand my meaning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do, but I am glad that all my friends don\u0027t attach the importance you do to the possession of fortune. Good morning!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose it\u0027s the way of the world!” thought Walter, as his quondam friend left him. “But, thank Heaven, all are not mercenary! I\u0027ve got a few friends left, anyhow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n A few rods farther on he met Victor Creswell, perhaps the richest student in the junior class.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s this I hear, Walter?” he asked. “Have you lost your money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some of it, I believe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you are not coming back to college?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall stay out a year. Perhaps I can come back then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You needn\u0027t leave at all. My governor allows me a hundred dollars a month for my own use—spending money, you know. I\u0027ll give you half of it, if that will enable you to pull through.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter was touched.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a friend worth having, Creswell,” he said. “But I really think I shall enjoy being out of college for a year. I shall find out what is in me. But I sha\u0027n\u0027t forget your generous offer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better accept it, Sherwood. I can get along well enough on fifty dollars a month.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won\u0027t accept it for myself, but I\u0027ll tell you something. My chum, Gates, is very hard pushed. You know he depends wholly on himself, and twenty-five dollars just at this time would be a godsend to him. He is worried about paying his bills. If, now, you would transfer a little at your generosity to him—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know him very well, but if you speak well of him that is enough. I shall be glad to help him. Let me see how much I can spare.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew out a wallet, and from it four ten dollar bills.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here are forty dollars,” he said. “Give them to him, but don\u0027t let him know where they came from.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Creswell, you\u0027re a trump!” said Walter, shaking his hand vigorously. “You don\u0027t know how happy you will make him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, that\u0027s all right. But I\u0027m sorry you won\u0027t let me do something for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will if I need it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good!” said Creswell, in a tone of satisfaction. “Now, mind, you don\u0027t hesitate.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter, happy in the happiness he was going to confer, made his way quickly to his own room. Gates sat at the table with a troubled brow, writing some figures on a piece of paper.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you about, Gates?” asked his chum.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been thinking.” said Gates wearily, “that perhaps I ought to do what you have decided to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Leave college.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am so troubled to pay my bills. I wrote to my uncle last week—he is a well-to-do farmer—asking him if he wouldn\u0027t send me fifteen dollars to help pay my term bills. I promised to come and help him in the farm work during July.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What does he say?” asked Walter, smiling, Gates couldn\u0027t understand why.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That he never pays for work in advance—he doesn\u0027t approve of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He could afford it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes; he\u0027s got a good sum in the savings-bank, but he is a very cautious man. I don\u0027t see how I\u0027m going to get through. Perhaps I had better take a year away from college.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is no need of that. I have some money here for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some money for me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” and Walter placed four ten-dollar bills on the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, Walter, you are in no position to lend me money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “True; the money doesn\u0027t come from me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But who besides you would do me such a great favor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “One of the rich fellows in college—no, I can\u0027t tell you his name. You can take it without hesitation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But it must have been to you that he lent it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, he understands that it is to be given to you. Will it help you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will it help me? It will carry me through gloriously,” and Gates was radiant with pleasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to leave college now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; this help is providential. I will never be distrustful again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish Creswell could see how much happiness his gift has brought with it,” thought Walter.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3022/83581.html","bookId":259,"creation":"Aug 1, 2019 8:00:21 AM","modification":"Aug 1, 2019 8:00:21 AM"}
