{"id":72727,"no":2,"title":"Page 2","content":"\u003cp\u003e“Do you see them out there?” Courtney asked Ali, who was now standing at a counter, angrily whipping through a magazine, headphones in her ears. Jason was gone, and by the sounds of it, their parents were still upstairs, getting dressed.\u003c/p\u003e\n\u003cp\u003eAli’s head snapped up. She tore the headphones out. “Huh?”\u003c/p\u003e\n\u003cp\u003e“There are some girls outside. One of them is the girl who lives next door.”\u003c/p\u003e\n\u003cp\u003e“She’s in the yard?” Ali looked annoyed and walked to the window. But when she peered out, she frowned. “I don’t see Spencer. Thank God.”\u003c/p\u003e\n\u003cp\u003e“You’re not friends with her?”\u003c/p\u003e\n\u003cp\u003eAli snorted. “No. She’s a bitch.”\u003c/p\u003e\n\u003cp\u003eAnd you’re not? Courtney thought.\u003c/p\u003e\n\u003cp\u003eAli turned to face her as if Courtney had said it out loud. A nasty smile settled across her lips. “Cute shirt. But it’s giving me déjà vu.”\u003c/p\u003e\n\u003cp\u003eCourtney grabbed a banana from the basket. “I liked the color.”\u003c/p\u003e\n\u003cp\u003e“Yeah, right.” Ali sauntered to the counter and grabbed a donut from the open box.\u003c/p\u003e\n\u003cp\u003e“Careful,” Courtney said, strolling toward her. “Donuts will make you fat.”\u003c/p\u003e\n\u003cp\u003eJelly dripped down Ali’s chin. “So will mental hospital food, schizo.”\u003c/p\u003e\n\u003cp\u003eCourtney winced. She wasn’t a schizo, and Ali knew it. “Don’t.”\u003c/p\u003e\n\u003cp\u003e“Don’t,” Ali imitated, her features turning ugly.\u003c/p\u003e\n\u003cp\u003eCourtney sucked in her stomach. Ali always used a nasal, dumbed-down voice to mimic her. “Stop it,” she snapped.\u003c/p\u003e\n\u003cp\u003e“Stop it,” Ali imitated.\u003c/p\u003e\n\u003cp\u003eCourtney felt the old fire rise up inside, the one that had gotten her in trouble before. Although she tried her hardest to suppress it, something broke loose. “Guess what,” she spat. “I do have your Time Capsule flag.”\u003c/p\u003e\n\u003cp\u003eAli’s eyes widened. “I knew it. Give it back.”\u003c/p\u003e\n\u003cp\u003e“It’s gone,” Courtney said. “I gave it to Jason. And he doesn’t want to give it back to you.” It wasn’t exactly the truth, but this version sounded better.\u003c/p\u003e\n\u003cp\u003eAli glowered at Jason, who had just reappeared in the doorway. “Is this true? You knew she had my flag?”\u003c/p\u003e\n\u003cp\u003eJason looked back and forth between the girls, his gaze lingering on their matching outfits. “Well, yeah, Ali, but—”\u003c/p\u003e\n\u003cp\u003eAli’s gaze darted to something in Jason’s pocket. The shiny blue fabric peeked out. She snatched it out halfway, her eyes widening at the wishing well that was now wedged between the manga frog and the bubble-letter awesome. Her eyes narrowed on Courtney. “Did you draw this?”\u003c/p\u003e\n\u003cp\u003eJason grabbed it back from her and stuffed it back in his pocket. “Ali, just let it go.”\u003c/p\u003e\n\u003cp\u003eAli squared her shoulders. “You’re always on her side!”\u003c/p\u003e\n\u003cp\u003e“I’m not on anyone’s side,” Jason said.\u003c/p\u003e\n\u003cp\u003e“Yes, you are!” Ali glowered at Courtney. “It’s a good thing I told Mom that you threatened me last night. That’s why you’re going to the Preserve, you know.”\u003c/p\u003e\n\u003cp\u003eCourtney’s eyes widened. “I didn’t do anything to you!”\u003c/p\u003e\n\u003cp\u003eAli tipped her chin down. “Maybe you did. Maybe you didn’t. Either way, you’re not welcome here, bitch.”\u003c/p\u003e\n\u003cp\u003e“Ali, enough!” Jason shouted.\u003c/p\u003e\n\u003cp\u003e“Enough!” Ali imitated with a sneer. When she brushed past him for the stairs, she shoved him. Jason staggered backward and crashed into a wrought-iron bookshelf. The whole thing wobbled, and a platter with the New York City skyline on the top shelf shook precariously. Jason lunged forward, but it was too late. The plate shattered on the wood floor.\u003c/p\u003e\n\u003cp\u003eThe silence after the crash was deafening. Jason glared at Courtney, who had frozen in the corner. “Why did you have to start things with her?” he hissed.\u003c/p\u003e\n\u003cp\u003e“I couldn’t help it,” Courtney said weakly.\u003c/p\u003e\n\u003cp\u003e“Yes, you could,” Jason said. And then, letting out a frustrated groan, he pushed out the back door.\u003c/p\u003e\n\u003cp\u003eCourtney’s insides turned over. “Jason, wait!” she yelled, running to the window. Jason was her only ally—she couldn’t have him angry at her. But when she gazed out the glass, Jason was gone. The four girls were still cowering in the bushes, though.\u003c/p\u003e\n\u003cp\u003eShe glanced over her shoulder into the kitchen. Pieces of the New York City plate lay all over the floor. Soon enough, her mother would appear from wherever she was and discover the mess. She would call to her two daughters to ask what had happened. One would appear from upstairs. What if the other daughter was outside, talking to a few girls from school? It wouldn’t be Courtney out there, after all—she didn’t know anyone. She wasn’t even allowed outside.\u003c/p\u003e\n\u003cp\u003eThis was it. Her opportunity. If she went out there, their parents would think she was Ali, not Courtney. It would be the first time she’d ever impersonated her sister without Ali making her. The first thing you need to do, she told herself, is channel her. No one will believe you’re her if you don’t. So she shut her eyes and channeled her sister. A beautiful bitch. A manipulative queen bee. The girl who’d ruined her life.\u003c/p\u003e\n\u003cp\u003eHer skin prickled. It wasn’t even that difficult: Courtney had been the queen bee of a group of popular girls at the Radley, scoring the best table in the day room, controlling what shows they watched on TV, putting on the best performance for the ward’s talent show. And even before she’d gone to the Radley, kids had loved her—more than her sister, in fact. People felt at ease with Courtney; they picked her first for kickball, they teamed up with her for art projects, she got more valentines than anyone else in the class. Ali, however, sometimes put people off. She was too pushy, too intense. She yelled at people when no adults were watching, pouted when she didn’t get the best gift in the Secret Santa exchange, and once even kicked a girl’s brand-new kitten that she’d brought to show-and-tell. Yes, Ali was beautiful—a teensy bit more beautiful than Courtney, in fact—but she wasn’t the most-loved. It was why she’d worked so hard to get Courtney out of the picture. She wanted to be the one and only star.\u003c/p\u003e\n\u003cp\u003eCourtney noticed Ali’s blue wedges sitting by the door and slipped them on. To ensure her mother would see exactly where she was—and where her sister wasn’t—she casually knocked another plate off the shelf. As it fell with a loud, hard-to-ignore crash, Courtney pushed the screen door open and watched as the girls, who were now arguing loudly, fell silent and looked up. By the intimidated, reverent expressions on their faces, she knew she already had them fooled. Of course they thought she was Ali.\u003c/p\u003e\n\u003cp\u003e“You can come out,” she yelled in the most confident voice she could muster.\u003c/p\u003e\n\u003cp\u003eThe girls didn’t move.\u003c/p\u003e\n\u003cp\u003e“Seriously, I know someone’s there,” she said. “But if you’ve come for my flag, it’s gone. Someone already stole it.”\u003c/p\u003e\n\u003cp\u003eSpencer emerged from the bushes first. The others followed. And then it just . . . happened. They assumed she was Ali, and they asked her questions. Answers spilled from Courtney’s mouth so naturally, like this was a role that was perfect for her. And when Mrs. DiLaurentis appeared on the porch, her gaze flickered cautiously at the girls in the yard—these definitely weren’t Ali’s friends. But when she looked at her daughter, she didn’t suspect a thing. She just assumed Courtney was Ali. And when she closed the door again, the family was in the car within minutes. They drove away. Just like that.\u003c/p\u003e\n\u003cp\u003eCourtney was so excited and nervous and scared that she could barely keep up her apathetic act with the girls in the yard. She felt like she was about to burst. She felt like giving every tree in the yard a huge hug.\u003c/p\u003e\n\u003cp\u003eBy the time Courtney returned to the house, she felt like she’d just run the distance to the Radley and back. Her head felt light. Her limbs felt heavy. She looked around the kitchen. Pieces of the plates were still on the floor. A flower vase had been knocked over, too. The quiet house seemed to reverberate with the phantom sounds and voices of what had just transpired. Violent, desperate screams echoing in the air. A scuffle to get into the car. A protest that they had the wrong twin.\u003c/p\u003e\n\u003cp\u003eShe walked through the silent rooms, her sister’s wedges clomping on the floor. Her plan had worked. But suddenly, panic struck her. Now she had to keep it up. This wasn’t something that might only last a few days or weeks before people caught on that the wrong girl was at the Preserve. She had to figure out a way to stay home forever.\u003c/p\u003e\n\u003cp\u003eShe ran upstairs to her sister’s bedroom, taking the stairs two at a time. Her gaze scanned Ali’s black-and-white bedspread, the cutout magazine ads and pictures of her friends on the walls, the bulging closet full of clothes. She darted to Ali’s bed and slid her hand under the mattress. Ali’s diary was buried precisely in the middle, just as it had been yesterday. She sat down, opened to where she’d left off, and read.\u003c/p\u003e\n\u003cp\u003eBut when she got to the end, the fizzy feeling in her stomach had intensified. The diary was all about Naomi Zeigler and Riley Wolfe, and it made a lot of shadowy references to secrets and inside jokes that Courtney would have no way of knowing. There was no way she could remain friends with Naomi and Riley—she’d have to ditch them and form a new clique. Only, who?\u003c/p\u003e\n\u003cp\u003eThe four girls in the yard popped into her head. Spencer, Aria, Emily, and that last girl, the chubby one. She ran to Ali’s fifth-grade yearbook and scoured the pages. Hanna—that was her name. They hadn’t signed her yearbook—none of them knew Ali well. Perfect.\u003c/p\u003e\n\u003cp\u003eSlam.\u003c/p\u003e\n\u003cp\u003eHer head whipped up, and she shoved the diary back under the mattress. Only an hour had passed. Had they returned already? Had they figured it out?\u003c/p\u003e\n\u003cp\u003eShe peeked out the front window. There was a black car chugging at the curb; she couldn’t see the driver. Footsteps sounded across the kitchen floor, then creaked on the stairs. She remained stock-still as whoever it was padded down the hall. A figure appeared in her doorway, and she almost screamed.\u003c/p\u003e\n\u003cp\u003eJason looked at her with narrowed eyes. “Did they already take her?”\u003c/p\u003e\n\u003cp\u003eCourtney nodded, still not daring to breathe.\u003c/p\u003e\n\u003cp\u003eJason’s mouth became small and tight. “Well, I guess you’re happy now, huh, Ali?”\u003c/p\u003e\n\u003cp\u003eHe shook his head and continued toward his room. The door slammed loudly, rattling the walls. A few seconds later, the opening bars of an Elliott Smith song blared.\u003c/p\u003e\n\u003cp\u003eCourtney ran her hands down the length of her face. He’d called her Ali.\u003c/p\u003e\n\u003cp\u003eShe walked to the mirror. The girl in the glass wore a deep-pink shirt and wedge heels. She had glossy hair, a heart-shaped face, and an impish smile. After a moment, she threw back her head and tossed her hair over her shoulder, just the way Ali did, and then gasped. She’d nailed it.\u003c/p\u003e\n\u003cp\u003eEuphoria washed over her like a tidal wave. She was going to rule the school. Become fabulous. Turn into the best Alison DiLaurentis possible. She deserved it, damn it. And her sister? She thought of Ali’s face as her parents shoved her into the car, the life she would lead in the Preserve. But what was done was done. And it was only fair.\u003c/p\u003e\n\u003cp\u003eShe stood up straighter, admiring the girl in the mirror. Suddenly, she remembered something, ran back into the guest room, opened the top drawer of the ugly bureau, and pulled out the silver ring she’d stolen last night when Ali had taken it off to wash the dishes. She pulled it out and held it to the lamp. A small A was engraved into the face. Smiling to herself, she slid the ring onto her right pointer finger, the same finger Ali wore it on. \u003c/p\u003e","sourceLink":"https://allnovel.net/ali-s-pretty-little-lies-pretty-little-liars-0-5/page-2.html","bookId":2391,"creation":"Oct 5, 2019 10:25:24 AM","modification":"Oct 5, 2019 10:25:24 AM"}
