{"id":72757,"no":32,"title":"Page 32","content":"\u003cp\u003e“Let go of me!” Ali exclaimed. Her arm was starting to sting from the pressure of her sister’s fingernails, and her heart was beating so fast she thought it might explode in her chest. Her nostrils caught another whiff of that cigarette. The source was close, but it didn’t seem like her twin had been smoking. “What are you doing out here?”\u003c/p\u003e\n\u003cp\u003eCourtney chuckled again, the most horrible sound in the world. “Oh, I just wanted to see what your life is like. My life. What possessed you to pick those girls as your new friends? To torment me? To ruin my reputation?”\u003c/p\u003e\n\u003cp\u003e“There’s nothing wrong with them,” Ali said defensively, suddenly feeling a rush of protectiveness for her friends. “They’re really sweet.”\u003c/p\u003e\n\u003cp\u003e“They’re really sweet,” Courtney mimicked. “Do you think they’ll still do everything you ask when they find out what you did?”\u003c/p\u003e\n\u003cp\u003e“They’ll never believe you,” Ali said, but even she heard the waver in her voice.\u003c/p\u003e\n\u003cp\u003eCourtney raised her chin. “They will if I tell them the truth about you.”\u003c/p\u003e\n\u003cp\u003eAli tensed. All of a sudden, anger rushed through her, hot and potent. “The truth?” she asked. “And what would that be? How you manipulated me for years? How you got me sent to the hospital instead of you? How you stood there and told them I had to go away?”\u003c/p\u003e\n\u003cp\u003e“You did have to go away,” Courtney said, her voice eerily calm. “And you’re going to have to go again. You’re going to tell everyone what you did. And they’re never, ever going to forgive you.”\u003c/p\u003e\n\u003cp\u003eFear streaked through Ali’s veins, but she stood her ground. “I’m not going anywhere,” she said, planting her feet in the wet, chilly grass. She laughed as confidently as she could. “Do you really think it would be easy for you to step into my life and be me? I’ve done things you aren’t capable of. I’m better at being you than you ever were.”\u003c/p\u003e\n\u003cp\u003e“It’s my life,” her sister snarled, placing her hands firmly on Ali’s shoulders. “You really think I’m going to have a hard time? I can even be friends with those stupid bitches, if that’s what it takes. I can do this with my eyes closed.”\u003c/p\u003e\n\u003cp\u003e“No, you can’t,” Ali said. “You don’t know anything.”\u003c/p\u003e\n\u003cp\u003eCourtney snorted. “Please. I read your diary—my diary. I know everything about them, about you. You put every secret in there, everything important.”\u003c/p\u003e\n\u003cp\u003e“Not everything,” Ali snapped, thinking of Nick. Thank God she’d left him out. She wished she could lord that over Courtney right now—he had, after all, been her unrequited crush. But now that they were over, her twin would just laugh at her.\u003c/p\u003e\n\u003cp\u003e“You certainly put in enough in your diary,” Courtney taunted. “That’s how I figured out that we’ve been calling the wrong guy Dad. Watch where you store your secrets, Ali. Anyone can open up a diary and find out all kinds of things.” She took Ali’s arm. “And now it’s time for you to say good-bye. Let’s go find Mom and our real father, shall we? We can tell them everything!”\u003c/p\u003e\n\u003cp\u003eShe clamped down hard on Ali’s shoulders and tried to steer her toward the Hastingses’ house, but Ali folded her body in half and twisted away. Courtney grabbed her around the waist and yanked her across the grass, but Ali stumbled, pulling her sister down with her.\u003c/p\u003e\n\u003cp\u003e“Get up, bitch!” Courtney yelled.\u003c/p\u003e\n\u003cp\u003e“I’m not going anywhere with you!” Ali pulled hard on her twin’s hair and rolled over on top of Courtney, pinning her onto the prickly grass. The old feelings rushed back—she was that little nine-year-old girl again, fighting against a force so crazy, so manipulative, she didn’t know what else to do but hit her, punch her, lose her mind.\u003c/p\u003e\n\u003cp\u003eBut then, suddenly, she snapped back into herself. This was crazy. She hated her sister, but she couldn’t fall back into that trap. She had to be the bigger person.\u003c/p\u003e\n\u003cp\u003eShe rolled off Courtney, stood, and started toward the house. But just a few steps in, a hand snaked around her ankle, and she was sprawled on the grass once more. She felt her sister’s body press on top of her. The ends of her long hair tickled the back of Ali’s neck.\u003c/p\u003e\n\u003cp\u003e“I guess it’s plan B, then,” Courtney whispered. She moved off Ali and, before Ali could go anywhere, grabbed Ali’s ankles and dragged her toward the very edge of the property as though she were a rag doll. Ali howled and clawed at the ground, but her fingers couldn’t get a grip. When they passed some of the discarded tools, her heart picked up pace. Was she dragging her toward the hole?\u003c/p\u003e\n\u003cp\u003eAli tried to call out, but she couldn’t draw in a full breath. The house was so far away, the Hastingses’ barn now dark. Where had her friends gone? Had they left? Then she thought of Ian, waiting for her in the woods somewhere. Maybe he was the one who’d been smoking. She peered desperately into the black trees, praying he saw her. But the forest was silent. No branches crackled underfoot. No one emerged.\u003c/p\u003e\n\u003cp\u003eHer twin stopped dragging her when she was at the edge of the hole. Ali tried to scramble up, but Courtney pushed her down again, her eyes blazing. “I should have done this years ago,” she growled. And then she shot her hands toward Ali’s neck, ready to strangle her.\u003c/p\u003e\n\u003cp\u003e“No!” Ali screamed. “Please!”\u003c/p\u003e\n\u003cp\u003eBut her twin just tightened her grip. “You deserve this,” she said in a detached, almost automated voice. “You deserve to die for what you did.”\u003c/p\u003e\n\u003cp\u003eNo, I don’t! Ali kicked her legs and thrashed her arms. She twisted her neck and got a gulp of air. “I’ll do anything!” she cried. “Tell the truth—I don’t care! Just don’t kill me!”\u003c/p\u003e\n\u003cp\u003e“You deserve to die,” Courtney repeated.\u003c/p\u003e\n\u003cp\u003eWhen she readjusted for a better grip, Ali took a huge breath, her lungs screaming. “Remember how it used to be? When we used to be friends?”\u003c/p\u003e\n\u003cp\u003e“We were never friends,” her twin hissed.\u003c/p\u003e\n\u003cp\u003e“Yes, we were! I loved you! You loved me! I . . . I miss that!”\u003c/p\u003e\n\u003cp\u003eCourtney’s grip let up just a little bit, and Ali twisted to the side to free herself. She coughed violently, her lungs feeling like they’d never fill again. She scrambled backward, sat up, and looked hard at her sister. Courtney was breathing hard, her eyes wide. She stared at her hands with wonderment, as if she’d never seen them before.\u003c/p\u003e\n\u003cp\u003eThen she looked up at Ali. “I can’t,” she said in a small voice.\u003c/p\u003e\n\u003cp\u003e“Can’t what?” Ali dared to ask.\u003c/p\u003e\n\u003cp\u003eCourtney’s jaw trembled. “I want to kill you. But I can’t.”\u003c/p\u003e\n\u003cp\u003eRelief flooded Ali’s body. “Of course you can’t,” she said. “We’re sisters.”\u003c/p\u003e\n\u003cp\u003eCourtney glanced at her cagily. Once more, she peered at her hands. She shifted toward Ali, her eyes flashing again.\u003c/p\u003e\n\u003cp\u003e“M-maybe we can start over,” Ali bargained. If she kept talking, maybe she could keep her twin’s craziness at bay until someone came looking for them. “I can be me. You can be you. You can be Alison DiLaurentis again.”\u003c/p\u003e\n\u003cp\u003eCourtney blinked. “Just like that, you’ll switch back?”\u003c/p\u003e\n\u003cp\u003eAli nodded, swallowing a lump in her throat. “Just like that.” She reached out and touched her sister’s hand, a tender gesture she hadn’t made in years. “I just want a sister again,” she said softly. “That’s all I’ve ever wanted.”\u003c/p\u003e\n\u003cp\u003eCourtney’s head remained down for a few more beats. A strong scent of uprooted dirt swirled through the air, and for a moment, the crickets were silent. Then she breathed out a long, slow sigh. She covered Ali’s hand with her other one. “I don’t know if I can do that.”\u003c/p\u003e\n\u003cp\u003e“You can,” Ali urged. “Please.”\u003c/p\u003e\n\u003cp\u003e“I . . .” “Courtney” trailed off. Her eyes widened on something behind her. “You’re here,” she whispered.\u003c/p\u003e\n\u003cp\u003eAli tried to turn around to see who’d come. A parent? Ian? One of her friends? But before she could, her sister’s gaze hardened once more, her resolve apparent. She lunged forward and shoved her hard.\u003c/p\u003e\n\u003cp\u003eAli expected to hit grass immediately, but she felt nothing but air. She screamed out as the world turned upside down, and then her neck banged on something sharp and metallic. For a moment everything went black, then she heard a horrible clang in her ears. All the air seemed to leave her body as she hit the cold, flat, unforgiving earth. Something cracked close by. After a second, Ali realized it was a bone inside her body.\u003c/p\u003e\n\u003cp\u003eShe was at the bottom of the hole.\u003c/p\u003e\n\u003cp\u003eShe tried to scream, but her mouth wouldn’t open. Only a square of light peeked out far above her head. Stars twinkled in the distance. A sliver of moon peeked from behind a cloud.\u003c/p\u003e\n\u003cp\u003e“Help!” she cried, but it was only in her head. Her heart shuddered inside her chest like a seized engine. A strange, snapping sensation was taking place beneath her skin, nerves gone haywire. After a moment, she realized she wasn’t breathing—couldn’t breathe. She tried to claw, tried to fight, but it felt like every cell in her body was weighed down with sand. Then she realized what was going on. She was dying.\u003c/p\u003e\n\u003cp\u003eA figure appeared over the hole. Ali’s twin looked in, a strange mix of horror and relief on her face. She stared down at her hands again with that same where-did-these-come-from expression. Then she turned and looked at something just out of view.\u003c/p\u003e\n\u003cp\u003e“I didn’t know you were coming,” she said. “I thought you weren’t going to make it.”\u003c/p\u003e\n\u003cp\u003eAt first, Ali thought Courtney was talking to her, but then a voice answered. “Of course I made it. I’ll always come for you.”\u003c/p\u003e\n\u003cp\u003eAli strained to listen. It was a voice she was sure she recognized, a voice she’d heard many times before. But her brain, with its dying cells and lack of oxygen, couldn’t quite put the pieces together. She tried to lift her head to get a glimpse of who it was, but her neck wouldn’t move.\u003c/p\u003e\n\u003cp\u003e“Are you happy?” the voice said.\u003c/p\u003e\n\u003cp\u003eCourtney’s jaw wobbled. “I don’t know,” she said, looking back down in the hole, a hand over her mouth. “I can’t believe I just . . . did that.”\u003c/p\u003e\n\u003cp\u003e“But it was our plan all along.”\u003c/p\u003e\n\u003cp\u003eSuddenly, Ali realized whose voice it was. She tried to react, tried to scream, but she could feel herself slipping away inch by inch, first her feet, then her calves, then her knees. She struggled to stay present, but it was just too much of an effort. She stared at the top of the hole until her sister’s figure was nothing but a big blob of light and shadow. She thought of the second voice, that voice she knew. Only one question screamed over and over in her brain: Why?\u003c/p\u003e\n\u003cp\u003eBut before she could answer, the dying feeling, like a candle fizzling out, had reached her neck. She inhaled the last breath she would ever take, and then shut her eyes. After a moment, amid the dirt and the rocks and the earthworms, she breathed out and finally let go.\u003c/p\u003e\n\u003cp\u003e34\u003c/p\u003e\n\u003cp\u003eMISSING: ALISON DILAURENTIS\u003c/p\u003e\n\u003cp\u003eThe following morning, the real Alison DiLaurentis watched the sun come up through the maple blinds in her old bedroom. Bands of light illuminated the vanity she’d begged her mom to buy for her in fifth grade, the blue crystal knobs on her closet and bureau drawers, the faint patina of dust on the flat-screen monitor and TV. This room even smelled the same, like vanilla hand soap. It felt like home. \u003c/p\u003e","sourceLink":"https://allnovel.net/ali-s-pretty-little-lies-pretty-little-liars-0-5/page-32.html","bookId":2391,"creation":"Oct 5, 2019 10:25:24 AM","modification":"Oct 5, 2019 10:25:24 AM"}
