{"id":58657,"no":101,"title":"Chapter 101","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eBranded Swordsman\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAfter many discussions, the major Magisteriums in the south coast had all unanimously agreed to restrict the advancement to an official Magus.\u003c/p\u003e\n\u003cp\u003eUnder the purview of the contract, all guilds must abide by it solemnly, to control the acolyte’s advancement to an official Magus. Even if it was the academy or family absorbing newcomers, they must swear to a strict secrecy.\u003c/p\u003e\n\u003cp\u003eThere was an exception — information found within historical items and places!\u003c/p\u003e\n\u003cp\u003eIn the expanse of the south coast, there were many traces of the Magi remnants.\u003c/p\u003e\n\u003cp\u003eAll of them were located in extremely perilous locations. Even official Magi had to risk their lives to search for a piece of them.\u003c/p\u003e\n\u003cp\u003eMoreover, even if they were remnants, one cannot be sure of their contents.\u003c/p\u003e\n\u003cp\u003eTake Leylin for example, previously he spent a countless amount of resources and effort, yet he obtained nothing in the end. It was an extremely common situation.\u003c/p\u003e\n\u003cp\u003eHowever, once Magi discovered a trace of ancient remnants and obtain their inheritance or other precious resources, it would be the start of another legend!\u003c/p\u003e\n\u003cp\u003eAlthough searching for remnants had many unforeseeable dangers, it still drove many Magi to seek them.\u003c/p\u003e\n\u003cp\u003eThe restrictions on the knowledge to advance to an official Magus was signed by all Magisteriums and guilds of the south coast. Hence, any remnants that existed before the agreement were very likely to contain information regarding official Magus advancement!\u003c/p\u003e\n\u003cp\u003eThis was the reason for the birth of a few guildless official Magi!\u003c/p\u003e\n\u003cp\u003eAccording to the information gathered from Leylin’s inquiries, Dorotte became an official Magus only after he discovered a piece of information related to advancement while adventuring.\u003c/p\u003e\n\u003cp\u003eAlthough the amount of information missing was over 60% of the original and it was definitely not possible to become a Magus just by relying on it, it was still very precious!\u003c/p\u003e\n\u003cp\u003eMoreover, Leylin was only a level 3 acolyte. Before he became a Magus, he wasn’t sure of his importance to Dorotte and whether he could conduct such an important transaction with him.\u003c/p\u003e\n\u003cp\u003eTo obtain this piece of information, it could only be carried out through Kroft.\u003c/p\u003e\n\u003cp\u003e“Alright then! However, you should know the rarity of information concerning the advancement to an official Magus. What are you planning to exchange for it?”\u003c/p\u003e\n\u003cp\u003e“Although the information is extremely valuable, this and other single-use records are vastly different. I believe that this will leave Professor Dorotte satisfied!”\u003c/p\u003e\n\u003cp\u003eLeylin said as he put a hefty bag in Kroft’s hands.\u003c/p\u003e\n\u003cp\u003e“Moreover, after obtaining this piece of information, Professor you can also have a copy of it!”\u003c/p\u003e\n\u003cp\u003eTowards Leylin’s suggestion, Kroft only raised his eyebrows, not saying anything.\u003c/p\u003e\n\u003cp\u003eBut when he opened the bag, he could not help but sigh. “That old bag of bones Dorotte, would most likely not be able to reject you!”\u003c/p\u003e\n\u003cp\u003eLeylin smiled.\u003c/p\u003e\n\u003cp\u003eIn the bag he handed to Kroft, not only was it filled with a large number of magic crystals and precious ingredients, there was also a Flourishing Flower.\u003c/p\u003e\n\u003cp\u003eThis ingredient was extremely difficult to obtain and had regenerative abilities for magicians with broken limbs.\u003c/p\u003e\n\u003cp\u003eAs for the environment required for the Flourishing Flower to thrive, it must be in a place with a large number of vengeful spirits. Every day, it would be watered with the blood of dying people in order to grow.\u003c/p\u003e\n\u003cp\u003eThese ingredients were not common even in Abyssal Bone Forest Academy.\u003c/p\u003e\n\u003cp\u003eAfter all, in the breeding of artificial spirits, the research done by Abyssal Bone Forest Academy were far less suitable compared to Leylin, who had the help from A.I. Chip.\u003c/p\u003e\n\u003cp\u003eIf not for the news to recall Leylin, he would have already completed this nurturing experiment.\u003c/p\u003e\n\u003cp\u003eAs for this Flourishing Flower, it was a by-product from the experiment lab.\u003c/p\u003e\n\u003cp\u003eCurrently, Dorotte was looking all over for materials to regenerate Jayden’s arm, these materials were an enticement which Dorotte could not refuse!\u003c/p\u003e\n\u003cp\u003eAlthough he knew this, Leylin was still apprehensive about giving away such a precious material.\u003c/p\u003e\n\u003cp\u003eAs he had produced a Void Flower in the past and now that he had produced another precious ingredient, the Flourishing Flower, it would be hard to prevent suspicion.\u003c/p\u003e\n\u003cp\u003eBut if he wanted a favour from Dorotte, he could not avoid bringing out this Flourishing Flower.\u003c/p\u003e\n\u003cp\u003eAnd he was fortunate that this item was rare.\u003c/p\u003e\n\u003cp\u003eWithin the Magus World, there were many examples of frustrated and destitute acolytes who had stumbled across ancient remnants of Magi and turned into an official Magus becoming an overlord of a region.\u003c/p\u003e\n\u003cp\u003eCompared to them, Leylin’s luck was only so-so.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThree days later, within the laboratory.\u003c/p\u003e\n\u003cp\u003eLeylin’s wish had at last been fulfilled and now he held the information in his hands.\u003c/p\u003e\n\u003cp\u003e“Branded Swordsman? What’s that?” Leylin frowned, “Wasn’t this supposed to have something to help me become a Magus?”\u003c/p\u003e\n\u003cp\u003e“Haha… when I first received this, I was also rather doubtful. But Dorotte explained it to me,” said Kroft.\u003c/p\u003e\n\u003cp\u003e“Leylin! Magi are people who possess mysterious powers! In ancient times, those with great power were often labelled as magicians! As for Branded Swordsman, through the alchemical runes, a magic spell formation would be branded on their body, allowing them to gain power. It is a small division of the ancient Magi!”\u003c/p\u003e\n\u003cp\u003eKroft began teaching Leylin, “I see that you are now a Knight. Therefore, as far as you are concerned, it is indeed appropriate for you to become a Branded Swordsman.”\u003c/p\u003e\n\u003cp\u003e“I understand!”\u003c/p\u003e\n\u003cp\u003eLeylin was peering through a scrap of information as he said, “Branded Swordsman seem to emphasize more of physical strength training. Through the regular practice and branding, nature’s strength would be stored inside their body. In crucial moments, the energy would erupt explosively….”\u003c/p\u003e\n\u003cp\u003e“Why does it seem to resemble… a Knight?” Leylin’s eyes flashed.\u003c/p\u003e\n\u003cp\u003e“Correct! You interpreted it well! Part of the information regarding the inheritance of ancient Branded Swordsman was widely spread. After some modifications, it was suited more towards regular humans. This turned into the creation of Knights and Grand Knights!”\u003c/p\u003e\n\u003cp\u003eKroft nodded.\u003c/p\u003e\n\u003cp\u003e“Which is to say, a Branded Swordsman is an advanced version of a Knight!” Leylin had now gained some understanding.\u003c/p\u003e\n\u003cp\u003e“However, it\u0027s a pity that more than 60% of the information is missing. Especially the part about branding and spell formation setting, it is almost all gone. Attempting to forcibly brand a spell formation on the body, will only cause the Magus’ magic power to be in a mess….”\u003c/p\u003e\n\u003cp\u003eA regretful look flashed across Kroft’s face.\u003c/p\u003e\n\u003cp\u003e“In ancient times, the combination of Branded Swordsman and Magi were a nightmare to enemies of many other worlds....”\u003c/p\u003e\n\u003cp\u003e“Although this is the case, I am still very grateful to Professor!” Leylin bowed once again.\u003c/p\u003e\n\u003cp\u003eAfter walking out from the experiment lab, Leylin placed the book, which recorded the details of the Branded Swordsman, in his arms.\u003c/p\u003e\n\u003cp\u003e“Although it is quite dilapidated, I still have the A.I. Chip. Perhaps, I can use it to compute the remainder of the information. . .”\u003c/p\u003e\n\u003cp\u003eLeylin consoled himself, feeling much better suddenly.\u003c/p\u003e\n\u003cp\u003eHe always liked to prepare a few backup plans.\u003c/p\u003e\n\u003cp\u003eThe advanced meditation technique in Zither Moon Mountain Plains was only a myth. It was derived from a few broken pieces of information from Roman, which almost had zero credibility. If not for Leylin having seen similar content back in the experiment lab close to the Great Mankestre Snake’s lair, he would most likely not believe in it.\u003c/p\u003e\n\u003cp\u003eMoreover, even if the Dylan Gardens existed, would there even be a piece of the great Magus Serholm’s inheritance? Even if there was, Leylin did not know if the advanced meditation technique was suitable for him.\u003c/p\u003e\n\u003cp\u003eBy setting off, Leylin would be able to pick up a high-grade meditation technique that was suited to him; Leylin did not dare bet on his luck\u003c/p\u003e\n\u003cp\u003eHence, the preparation of a backup plan and now it became necessary to carry it out.\u003c/p\u003e\n\u003cp\u003eHe had a portion of the Grine Water, the A.I. Chip was also simulating the rank 1 defensive spell model. Now he managed to obtain advanced information concerning Branded Swordsman. All these would be simulated into a completed piece of information regarding advancement.\u003c/p\u003e\n\u003cp\u003eLeylin decided that if he failed to discover anything in the Zither Moon Mountain Plains, he would apply for graduation. He would then roam the south coast, searching for remnants and obtaining information on high-grade meditation techniques.\u003c/p\u003e\n\u003cp\u003eIf he did not obtain a meditation technique suited for him by 50, he would forcefully use the information in his hands to advance into a Magus.\u003c/p\u003e\n\u003cp\u003eAlthough this might cause difficulties for future advancements, Leylin felt that if he did not see any hope of advancement by 15, it was better to raise his strength before seeking better alternatives.\u003c/p\u003e\n\u003cp\u003eOn the route back to the dorm.\u003c/p\u003e\n\u003cp\u003eRecently, Bicky had paid very few visits to him. In the vast level of the dorm, Leylin was the only one who lived here.\u003c/p\u003e\n\u003cp\u003eLeylin looked at the two sides of the dull and lifeless hall and sighed. “Although the concealment is not too bad, with fewer people coming to bother you, living in such a place is really somewhat dreary….”\u003c/p\u003e\n\u003cp\u003eAfter entering his own room in the dorm with the bright lamp, Leylin felt much better.\u003c/p\u003e\n\u003cp\u003eWalking to the simple experiment lab, Leylin thought in his mind.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip! How is the progress on the simulation of rank 1 spell defensive model? Also the simulation the Grine Water?”\u003c/p\u003e\n\u003cp\u003e[rank 1 defensive spell model simulation progress: 14.3%. Estimated completion: 765 days!]\u003c/p\u003e\n\u003cp\u003eTowards the simulation of a rank 1 spell model, the A.I. Chip gave an unexpectedly long duration. However, Leylin was extremely pleased with this.\u003c/p\u003e\n\u003cp\u003ePreviously the A.I. Chip was not able to estimate the progress of a successful simulation. However, after recording the massive amount of information in the hidden library, the A.I. Chip finally allowed Leylin to see a glimmer of hope in a completed rank 1 spell model!\u003c/p\u003e\n\u003cp\u003e“As long as it can be completed! Two years, I can afford it!”\u003c/p\u003e\n\u003cp\u003eTwo years later, Leylin would only be 19, still in the prime of level 3 acolyte. This was the benefit of youth, never fearing that time was not enough.\u003c/p\u003e\n\u003cp\u003e[Calculating Grine Water formula in progress: 5.32%. Estimated ingredients: Fruit of Thousand-Eyed Tree, fresh blood of a Giant Tidal Snake....]\u003c/p\u003e\n\u003cp\u003e[Estimated effect: A huge consumption on acolyte’s life force, to stimulate breakthrough of spiritual force bottleneck!]\u003c/p\u003e\n\u003cp\u003e“So that’s the case!” Looking at the A.I. Chip’s analysis, Leylin finally knew why the academy viewed a level 3 acolyte below 20 years of age as potential Magus….\u003c/p\u003e\n\u003cp\u003eGrine Water’s effect was to consume a magician’s lifespan in exchange for a stimulated breakthrough.\u003c/p\u003e\n\u003cp\u003eThe younger the acolyte, the more life force there is for consumption. Hence the higher possibility of a breakthrough.\u003c/p\u003e\n\u003cp\u003eOnce an acolyte has an ageing body, they wouldn\u0027t be able to breakthrough even with Grine Water. This was because their physical body no longer had any more life force to be consumed.\u003c/p\u003e\n\u003cp\u003e“It seems that the previous situation has to be altered!”\u003c/p\u003e\n\u003cp\u003eLeylin stroked his chin. “The matter of searching for high-grade meditation technique will have to be pushed forward. Moreover, I cannot wait till I’m fifty! Thirty years old! After I’m thirty, if I haven\u0027t managed to find any high-grade meditation technique, I must try in breaking through!”\u003c/p\u003e\n\u003cp\u003eAfter firming his resolve, Leylin tidied up the experiment lab and took out an ancient Potioneering scroll.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-100\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-102\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-101","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
