{"id":59584,"no":1028,"title":"Chapter 1028","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eIncitement and Recruitment\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin remained silent, but his eyes flashed, he’d acutely sensed Baalzephon’s conspiracy. ‘So he’s instigating me, huh? He couldn’t meet his purpose, so now he’s full of hatred and jealousy.’\u003c/p\u003e\n\u003cp\u003eHad he been a real devil indeed, he would’ve fallen for the ploy by now. After all, to stop someone from advancing would make a blood enemy out of them. Furthermore, his ‘superior’ was a pit fiend as well. If Azlok did not agree, he could overthrow the decision of the Dark Eight and stop Leylin’s advance. Given the nature of the devils, this was definitely going to happen.\u003c/p\u003e\n\u003cp\u003e‘Pit fiend? The most efficient way to garner more hatred is to skip evolutions…’ An ordinary devil that had just evolved would be resented by twenty to thirty others. They would look everywhere for any mistakes they’d commit, trying to get it demoted. However, if a devil had jumped ranks the hatred would be tenfold, maybe even a hundred times worse!\u003c/p\u003e\n\u003cp\u003eAs for a greater devil evolving into a pit fiend, Baator had limited origin force. There could only be a certain number of pit fiends at any one time. If no other pit fiends died, Leylin’s advancement would rob another potential candidate of their chance.\u003c/p\u003e\n\u003cp\u003eThis scenario was likely to play out in Leylin’s case. That was why greater devils would have to have rotting brains to let their subordinates advanced.\u003c/p\u003e\n\u003cp\u003eMost devils who jumped forms did not meet a good end. The only ones that did were those who were extremely scheming themselves, proving their mettle with their brawn and brains.\u003c/p\u003e\n\u003cp\u003e“Come. Although you can’t evolve, please hold on to this; you deserve it!”Baalzephon handed Leylin a crystal that stored a holy spirit’s energy, “The energy stored inside this is enough for you to evolve into a pit fiend.”\u003c/p\u003e\n\u003cp\u003eBaalzephon was not in his pit fiend form right now. He’d instead adopted a human shape, looking extremely conniving. His poorly constructed face put on a ‘kind’ smile.\u003c/p\u003e\n\u003cp\u003e“Thank you, my Lord!” Although he felt extremely disgusted, Leylin still thanked him for the gift.\u003c/p\u003e\n\u003cp\u003e“Alright Leycian, I think you have great potential. We could have dinner one day…” Baalzephon invited. Leylin could do nothing but smile wryly and agree.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Goodbye, Leycian! I’m returning to Malbolge. My superior is Madam Thatcher of the Copper Citadel. You can look for me there, I’ll be excited to meet you again, soon…”\u003c/p\u003e\n\u003cp\u003eHanalin bid her bittersweet farewell to Leylin after the tense trial. She was currently in her evolved form, with black wings and an angelic face. She looked even more seductive and charming than before.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin had astutely discovered the change in her personality and character, obvious even from how she addressed him as an equal and even tried to lure him in. Now that she’d skipped multiple evolutions to reach her current state, her enemies were far stronger and more terrifying than before; they included her very own superior!\u003c/p\u003e\n\u003cp\u003eHer enemies would definitely be more attentive than before, looking for any loopholes that would cause her to be demoted, turning once more into an ugly lower devil. Knowing this, she was already trying to garner as much support as she could.\u003c/p\u003e\n\u003cp\u003e“Got it!” Leylin memorised her destination and the route, putting on a solemn expression. ‘It’s best to leave a backdoor, who knows whether I might have to use it in the future. I recall that the lady of the Sixth Hell is the Hag Countess.’\u003c/p\u003e\n\u003cp\u003eLeylin had been focused on Dis recently, but he couldn’t eliminate the possibility of travelling to other levels in the future. If Hanalin were still alive when he did, she would be a useful connection.\u003c/p\u003e\n\u003cp\u003eHanalin departed, satisfied with her gains. Leylin looked instead at the Bronze Citadel, with its flames reaching high in the sky. He scratched his nose as several half-dragons appeared abruptly, as well as the visages of several jackals.\u003c/p\u003e\n\u003cp\u003e‘Has the transfer of authority already begun?’ Leylin thought as he directly arrived at the Dark Eight’s garrison. His identity was verified, and he was immediately lead to Baalzephon in his vile human form.\u003c/p\u003e\n\u003cp\u003e“My lord Baalzephon! I am immensely honoured by your invitation,” Leylin bowed in gratitude. He glanced at the dining hall’s preparations— the carpet was a deep red as if it had been stained with blood, the floor-length curtains embroidered with glistening golden motifs of Baator, and chandeliers hung from the ceiling. There was even a demon’s head hung on the wall, and it looked as if it was Baalzephon’s.\u003c/p\u003e\n\u003cp\u003eThe tableware was all made of the finest gold, inlaid with all kinds of diamonds and pearls. The maids were all beautiful erinyes and pleasure devils.\u003c/p\u003e\n\u003cp\u003eSeveral petitioners, moulded into twisted forms, pushed a cart into the dining hall, one that was entirely on fire. They bowed in respect before taking their leave, allowing the erinyes and pleasure devils clad in black and white maid uniforms to place the dishes in front of The two.\u003c/p\u003e\n\u003cp\u003eSoup was first, a bubbling milky-white broth.\u003c/p\u003e\n\u003cp\u003e“Haha, no need to hold yourself back, my friend. The taste of cold soul worms is not as palatable…” Baalzephon smiled widely, scooping out a translucent soul worm. The thing was still wriggling.\u003c/p\u003e\n\u003cp\u003eSeveral struggling and miserable human visages could be seen on the worm, but Baalzephon just directly swallowed it down. An intoxicated expression appeared on his face.\u003c/p\u003e\n\u003cp\u003eDevils enjoyed enticing mortals to fall. Torturing the souls of petitioners and absorbing their immortal essence and soul force was their pleasure. After a petitioner had been sucked dry, they would be tossed into the hellforge and suffer torturous transformations. They would then become the lowest of the low— a lower devil.\u003c/p\u003e\n\u003cp\u003eOnly a select few souls were able to survive the treatment, becoming lower demons. They would be a bit stronger than others of their kind, and were more likely to be promoted.\u003c/p\u003e\n\u003cp\u003eDevils used the absorbed soul force of petitioners to climb up the ranks and grow stronger. Naturally, there were those who directly swallowed them up like Baalzephon— rumour had it that he was supposedly searching for the most beautiful texture and taste in souls.\u003c/p\u003e\n\u003cp\u003eAlthough Leylin was not opposed to swallowing souls, his personal preferences were different from devils. He did not like this twisted torture. As a result, he glanced away and found another topic to change the subject to.\u003c/p\u003e\n\u003cp\u003e“Well, Lord Baalzephon, may I ask if you are ready to move?” Leylin gestured at the busy lower demons, imps and others of their kind. They were all toiling away, lifting several huge demon ribs with complex carvings upon them. It seemed as if it was a spoil of war that was used to commemorate some bloody battle.\u003c/p\u003e\n\u003cp\u003e“Mm. We’d signed an agreement to hand the Bronze Citadel back to Tiamat… Not even a devil would betray a binding oath to the Styx.” Baalzephon sniffed the dark red blood in the tall wine glass, elegantly swirling the liquid around in leisure.\u003c/p\u003e\n\u003cp\u003e“Please forgive me for being direct, but such a high price for the victory of a single battle— isn’t that a bit much…” Leylin had deliberated over his wording carefully.\u003c/p\u003e\n\u003cp\u003e“Haha, Leycian! You really are an interesting fellow. To be honest, many of our subordinates dare not say anything, but inwardly they must be ridiculing us eight ‘fools’…” Baalzephon’s eyes seemed to see through everything, the corners of his lips curving into a humorous smile.\u003c/p\u003e\n\u003cp\u003e“Of course not! Even if half of the Bronze Citadel was exchanged for the destruction of the demon army, and especially the four flame balors and a bunch of greater demons, it would be extremely worth it!” Leylin naturally chose to continue Baalzephon’s discourse.\u003c/p\u003e\n\u003cp\u003e“You’re right! What do those ignorant animals know?” Leylin’s words had evidently touched Baalzephon’s heart. He stood up suddenly, walking around the dining hall in excitement.\u003c/p\u003e\n\u003cp\u003e“What is the Bronze Citadel even worth to us? It’s just a dead piece of land. The only useful thing is souls. Only with more souls can we forge more devils to improve our power and kill those chaotic bastards.”\u003c/p\u003e\n\u003cp\u003eTwo hellish streams of flame were shot out of Baalzephon’s nostril. He looked like he truly hated the crazy and chaotic demons.\u003c/p\u003e\n\u003cp\u003e“Are you willing to assist me, Leycian?” Baalzephon looked at Leylin, his eyes blazing with fervent emotion. It seemed as if this was the main reason he had invited Leylin here.\u003c/p\u003e\n\u003cp\u003e‘If I don’t agree, will he grow hostile immediately?’ Leylin seemed to go into shock, but in his heart he just laughed coldly. The solicitation of a devil was extremely unreliable. No matter how it looked, Baalzephon most likely just wanted to use him as cannon fodder.\u003c/p\u003e\n\u003cp\u003e“I am most grateful to my lord for valuing me. However, Lord Azlok is my direct superior.” Leylin’s expression was rather hesitant. After all, a loyal devil would find it difficult to change factions.\u003c/p\u003e\n\u003cp\u003e“Azlok? Hmph…” Baalzephon smiled disdainfully, but did not bring up the matter any further. It was clear that he was waiting for Leylin to make a decision. Besides, he’d completely exposed his true motives, and it was not possible to reveal anything more.\u003c/p\u003e\n\u003cp\u003e‘Mm, it looks as if my past in the second layer of hell has attracted his interest. So, the Supreme of Baator, that ruler only in name, has ambition towards Dis?’ An electric beat seemed to pulse in Leylin’s heart.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1027\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1029\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1028","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
