{"id":58659,"no":103,"title":"Chapter 103","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eA Meeting\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe vengeful spirit wearing red robes continuously attacked, clawing strips of flesh off of Leylin’s body.\u003c/p\u003e\n\u003cp\u003eLeylin’s expression of anger turned into indifference.\u003c/p\u003e\n\u003cp\u003eA few minutes later, he opened his mouth with difficulty, “Gurisasi ~ duoluxian!”\u003c/p\u003e\n\u003cp\u003eA dark-green flame burned on Leylin’s body, setting everything in the experiment lab ablaze….\u003c/p\u003e\n\u003cp\u003e“Hu…”\u003c/p\u003e\n\u003cp\u003eAfter the dark-green flame was extinguished, Leylin recovered his mobility.\u003c/p\u003e\n\u003cp\u003eAt this moment, he finally had enough strength to look around at his surroundings.\u003c/p\u003e\n\u003cp\u003eThe experiment lab was the same as before, all apparatus lying neatly in their original position.\u003c/p\u003e\n\u003cp\u003eAs for the pentagon formation, it had lost all of its light, and the vengeful spirit was nowhere to be found.\u003c/p\u003e\n\u003cp\u003eOn Leylin, there were no traces of injuries, yet his expression did not seem well.\u003c/p\u003e\n\u003cp\u003eIt was because different indicators flashed from the A.I. Chip:\u003c/p\u003e\n\u003cp\u003e[Host has suffered from an unknown forcefield attack, determined from the database to be caused by a vengeful spirit! vitality decreased by 0.1]\u003c/p\u003e\n\u003cp\u003e[Host has suffered from an unknown forcefield attack, determined from the database to be caused by a vengeful spirit! vitality decreased by 0.1]\u003c/p\u003e\n\u003cp\u003e[Host has suffered from an unknown forcefield attack, determined from the database to be caused by a vengeful spirit! vitality decreased by 0.1]\u003c/p\u003e\n\u003cp\u003eAfter 3 indications, Leylin’s face looked even more awful, “A.I. Chip, show me my current status!”\u003c/p\u003e\n\u003cp\u003e[Beep! Leylin Farlier. Level 3 acolyte, Knight. Strength: 3.1, Agility: 3.3, Vitality: 3.4, Spiritual force: 16.1, Magic power: 16 (magic power is in synchronisation with Spiritual Force). Status: Healthy]\u003c/p\u003e\n\u003cp\u003eAfter the upgrade from using Tears of Mary, Leylin’s Spiritual Force reached 16.1. However, his vitality decreased by 0.3. Clearly, this was caused by the attack of the vengeful spirit.\u003c/p\u003e\n\u003cp\u003e“As expected, an ancient potion’s formulary cannot be modified so easily!”\u003c/p\u003e\n\u003cp\u003eLeylin sighed. He acted on his own initiative, changing many processes of the formulary, thus causing such an outcome.\u003c/p\u003e\n\u003cp\u003e“However, this decrease in vitality, compared to the increase in Spiritual Force, shows the value of this potion!”\u003c/p\u003e\n\u003cp\u003eLeylin was certain of his modified formulary for the ancient potion, Tears of Mary.\u003c/p\u003e\n\u003cp\u003e“Ancient potion - Tears of Mary modification successful, Host to give a name!”\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s voice intoned.\u003c/p\u003e\n\u003cp\u003e“Blood Vengeance Potion!” Leylin thought of the final, flash of red, blurting out the name.\u003c/p\u003e\n\u003cp\u003eAlthough this potion requires a vengeful spirit as an ingredient, which was somewhat cruel, it was a potion that was hard to come by!\u003c/p\u003e\n\u003cp\u003eA single use could raise Spiritual Force by 3 points! The only minor backlash was : it was on the same level as the Azure Potion that Leylin had modified before.\u003c/p\u003e\n\u003cp\u003eAs for the formulation process of this potion, it was somewhat ruthless. However, Leylin did not bother about it.\u003c/p\u003e\n\u003cp\u003eFor Leylin, carrying out ruthless actions and even killing people, was well within reason when in the face of benefits!\u003c/p\u003e\n\u003cp\u003ePeople who only kill for joy were mental and inhumane.\u003c/p\u003e\n\u003cp\u003eIn his previous world, the environment was peaceful, so naturally he had also advocated peace then.\u003c/p\u003e\n\u003cp\u003eHowever, in the Magus World, war was everywhere. Deaths occurred daily. The plebeians who faced dawn did not know if they would be alive to see the sun set.\u003c/p\u003e\n\u003cp\u003eThe law of the jungle and survival of the fittest were proclaimed explicitly by various powerful guilds and organisations.\u003c/p\u003e\n\u003cp\u003eAfter coming to this world, Leylin followed ‘when in Rome, do as the Romans do’ and this became a completely egotistical person.\u003c/p\u003e\n\u003cp\u003eAs long as this potion was beneficial and did not cause him much hassle, he would not hesitate to create more of it!\u003c/p\u003e\n\u003cp\u003e“This is the feeling of achieving 16 Spiritual Force, huh? How amazing!”\u003c/p\u003e\n\u003cp\u003eLeylin shut his eyes, feeling the difference this increase brought him.\u003c/p\u003e\n\u003cp\u003eUnder his control, the Spiritual Force seemed to be a silver thread as it swept past every item in the room. Moreover, each of the item’s physical shape was perceived within Leylin’s mind.\u003c/p\u003e\n\u003cp\u003eFor regular acolytes, this was an extremely fresh feeling. However, Leylin saw that after a certain standard was achieved in Spiritual Force, it had a scanning effect similar to that of the A.I. Chip!\u003c/p\u003e\n\u003cp\u003e“This effect, if mastered properly, could discover a majority of ambushes, never having to fear for another sneak attack!”\u003c/p\u003e\n\u003cp\u003eLeylin appreciated the wondrous use of the Spiritual Force.\u003c/p\u003e\n\u003cp\u003e“It’s a pity, however. For me, this is not as useful as the A.I. Chip!”\u003c/p\u003e\n\u003cp\u003eIn his sea of consciousness, waves of Spiritual Force constantly surged at the borders, continuously expanding the area of the sea.\u003c/p\u003e\n\u003cp\u003e“Only that this external change is too obvious!”\u003c/p\u003e\n\u003cp\u003eLeylin picked up a bronze mirror. On the screen of the bronze mirror, a brown-haired youthful countenance was reflected. However, a pair of gleaming eyes flashed like diamonds in the night.\u003c/p\u003e\n\u003cp\u003eNormally, the upper limits of Spiritual Force for level 3 acolytes were 15, yet Leylin far exceeded this figure.\u003c/p\u003e\n\u003cp\u003eMoreover, when level 3 acolytes were about to breakthrough into an official Magus, their eyes would often show unusual signs of attraction.\u003c/p\u003e\n\u003cp\u003eThat was the result of the boundless expansion in their massive sea of consciousness.\u003c/p\u003e\n\u003cp\u003eHowever, for Leylin, this was not good news. To others, he was just a newly advanced level 3 acolyte, yet now he exceeded those limits, this would bring about curiosity and suspicion from others.\u003c/p\u003e\n\u003cp\u003eIf it was some regular acolyte, Leylin wasn’t too afraid. But if an official Magus required him to cooperate for questioning, then Leylin would meet with some trouble.\u003c/p\u003e\n\u003cp\u003eAfter all, Leylin had no confidence against official Magus since the A.I. Chip could not detect them.\u003c/p\u003e\n\u003cp\u003e“I can only conceal this for the time being!”\u003c/p\u003e\n\u003cp\u003eLeylin chanted a short incantation.\u003c/p\u003e\n\u003cp\u003eCreaking and cracking noises resounded on his face and his eyes dimmed, no longer radiating light.\u003c/p\u003e\n\u003cp\u003eThis was a simple use of the Shapeshifting spell—the ability to modify facial features.\u003c/p\u003e\n\u003cp\u003eMany female official Magus would obtain such a spell and cast it on their faces, achieving a beautification effect.\u003c/p\u003e\n\u003cp\u003e“I hope this can conceal my presence for the time being!” Leylin was not confident.\u003c/p\u003e\n\u003cp\u003eAfter several modifications of the Shapeshifting spell by the A.I. Chip, level 3 acolytes would not be able to discover this.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin was completely unsure if he could face an official Magus\u003c/p\u003e\n\u003cp\u003eIf they just walked past him, they may not notice his concealment. As long as they did not use any detection spells, he should be able to mask it.\u003c/p\u003e\n\u003cp\u003eDeep down in his heart, Leylin had already decided. After travelling around the Poolfield Kingdom and discovering the vestige traces, he would set off to Zither Moon Mountain Plains in search of the remnants of the great Magus Serholm.\u003c/p\u003e\n\u003cp\u003eIn any case, Leylin had expressed his interest to Kroft for wanting to travel, so suggesting it not did not seem too abrupt.\u003c/p\u003e\n\u003cp\u003eAfter making some arrangements, Leylin rubbed his rumbling stomach, giving a wry smile. His experiment had already extended over a day\u0027s worth of time.\u003c/p\u003e\n\u003cp\u003eNo matter how high his vitality was, he was still a mortal, unable to escape from the laws of nature. Hence, there were symptoms of hunger.\u003c/p\u003e\n\u003cp\u003eAlthough he could replenish his strength with potions, Leylin still felt nauseous. Moreover, if the circumstances allowed for a better option, he would not mistreat himself.\u003c/p\u003e\n\u003cp\u003eSince the academy had a restaurant, why waste a potion?\u003c/p\u003e\n\u003cp\u003eLeylin cleaned up and opened his dorm’s door.\u003c/p\u003e\n\u003cp\u003e* Pa! * A white letter fell onto the ground. It seemed like someone paid Leylin a visit earlier. However, after seeing him concentrate on his experiment, they did not dare intrude, hence leaving a simple note.\u003c/p\u003e\n\u003cp\u003e“Who would it be? Bicky? Nyssa? Or someone else…”\u003c/p\u003e\n\u003cp\u003eLeylin opened the letter in curiosity.\u003c/p\u003e\n\u003cp\u003eAfter seeing the signature, Leylin’s expression was shocked, “It\u0027s actually Jayden!”\u003c/p\u003e\n\u003cp\u003eAs a fifth-grade genius acolyte, Jayden was somewhat of a lone wolf, seldom interacting with other acolytes.\u003c/p\u003e\n\u003cp\u003eAs for now, Jayden actually took the initiative to meet with Leylin, which shocked Leylin.\u003c/p\u003e\n\u003cp\u003e“However, since he\u0027s visited me, then I\u0027ll meet him!”\u003c/p\u003e\n\u003cp\u003eAfter thinking for a while, Leylin raised his somewhat pale finger, directing scribbling on the white note.\u003c/p\u003e\n\u003cp\u003eEvery time his finger drew across, red characters would be left on the note.\u003c/p\u003e\n\u003cp\u003eThere was a simple spell cast on this paper note by Jayden, which could transmit some simple information. Of course, it was only usable in Abyssal Bone Forest Academy area, widely loved by acolytes.\u003c/p\u003e\n\u003cp\u003eThe recipient\u0027s reply was extremely quick. Very soon, Leylin met up with Jayden inside of a room in the restaurant.\u003c/p\u003e\n\u003cp\u003eJayden now seemed to be gloomier. Looking at the area of his severed limb, Leylin noticed that a slim tiny arm had regrown and could not help but laugh.\u003c/p\u003e\n\u003cp\u003eIt seems that his Flourishing Flower had been given to Jayden by Dorotte. What he did not know was the promise Jayden had to make in exchange for the Flourishing Flower.\u003c/p\u003e\n\u003cp\u003e“I have not thanked you regarding the Flourishing Flower!”\u003c/p\u003e\n\u003cp\u003eJayden sat on the white chair, raising his cup to Leylin.\u003c/p\u003e\n\u003cp\u003eThis gesture was somewhat impolite. Leylin frowned internally, yet not did not outwardly speak much about it.\u003c/p\u003e\n\u003cp\u003eAfter looking for a chair to sit down, he ignored the delicacy and aroma displayed in front of him. Leylin smiled in sincerity, “Regarding the information of official Magus that Professor Dorotte had exchanged with me, I should be the one expressing my thanks!”\u003c/p\u003e\n\u003cp\u003eNaturally, Leylin had no clue that Dorotte had this information of advancing into a Branded Swordsman.\u003c/p\u003e\n\u003cp\u003eIt was Jayden who had leaked the news to him. As for the reason why—it was probably due to Leylin ‘accidentally’ letting Jayden know that he had the Flourishing Flower.\u003c/p\u003e\n\u003cp\u003eFor Leylin, he would reap the largest benefit from Jayden, who desperately needed the Flourishing Flower to regrow his limb.\u003c/p\u003e\n\u003cp\u003eJayden’s expression turned softer, “No matter what, we are acolytes who came from the same area, so it\u0027s well within reason to help each other….”\u003c/p\u003e\n\u003cp\u003eLeylin too gave him some superficial replies, before Jayden finally revealed his motive for seeking Leylin today.\u003c/p\u003e\n\u003cp\u003e“Leylin, Professor Dorotte had long since told me that the information he had given you, a major portion of it was missing. There is no way that it could be reliable for advancing into an official Magus. It is because you also want to look for other traces that you are eager to go exploring, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Of course, no matter if it\u0027s the academy or the families, their conditions are too much!”\u003c/p\u003e\n\u003cp\u003eLeylin interlocked his fingers.\u003c/p\u003e\n\u003cp\u003eThis notion was considered by many level 3 acolytes. Only when the adventure for the remnants was unfruitful and acknowledging that the golden period of advancement was almost over, would they then consider signing a spiritual contract with the academy or the families.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-102\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-104\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-103","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
