{"id":59594,"no":1038,"title":"Chapter 1038","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eDiscovery\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e‘It seems to be a mere imitation of a Netherese golem…’ Leylin hid in the darkness, watching the big duel in the square. With the advantage given by Beelzebub’s memories and the fact that the golems were fixated on the pit fiends, the chances of him being discovered were minute.\u003c/p\u003e\n\u003cp\u003eHe could stalk behind this pit fiend, using it at the last moment to break past the blockade of golems in the square.\u003c/p\u003e\n\u003cp\u003e‘Only after the greater devils are all dead will the pit fiends be fatally wounded…’ Looking at the pit fiends who were still alive, Leylin shook his head inwardly. Many of the greater devils had taken the brunt of the golems’ rampage, and even some pit fiends were unlucky enough to be left behind and trapped in one’s vicinity.\u003c/p\u003e\n\u003cp\u003eWith the golems’ personalities, it would be completely suicidal for their colleagues to rescue them. Consequently, those pit fiends ended up with a tragic death, finally falling to Beelzebub’s traps.\u003c/p\u003e\n\u003cp\u003eEven members of the Dark Eight had fallen amongst the other pit fiends. The palace of an Archdevil was not something they could go after carelessly, even if it had fallen out of its owner’s control.\u003c/p\u003e\n\u003cp\u003eAnd yet despite all this, many of the pit fiends had ambition written all over their faces.\u003c/p\u003e\n\u003cp\u003eA tall statue stood before them, looking over their broken flesh. It had multiple pairs of eyes, and six strange fingers. A grin was on its face, spread from ear to ear, and all one could see were rows upon rows of jagged fangs.\u003c/p\u003e\n\u003cp\u003e“The Lord of Gluttony… This definitely has to be his palace!” Zapan’s eyes grew wide, and he greedily looked at the small palace building behind the statue.\u003c/p\u003e\n\u003cp\u003eThe building was in the style of the devils. It was distorted and terrifying, with strange and intricate descriptions. There was still a little hellfire burning atop it, seemingly going to continue burning to the end of the world.\u003c/p\u003e\n\u003cp\u003e‘The lord’s bedchambers. It’s rumoured that a lot of his treasures are hidden here. It’s an extremely important clue…’ Many pit fiends immediately began breathing heavily, and began to distance themselves from each other. Even the Dark Eight began to do the same.\u003c/p\u003e\n\u003cp\u003eThey had all taken great risks to come here, all for the inheritance of the Archdevil. They wished to grasp the power of gluttony, obtaining mastery over the origin force of hell. Only then would they qualify to become a Lord of Baator.\u003c/p\u003e\n\u003cp\u003eIn that pursuit, every other devil here was a competitor. Even former colleagues weren’t in the least bit worthy of their trust.\u003c/p\u003e\n\u003cp\u003eThe pit fiends exchanged glances. There seemed to be some invisible signal as they all rushed into the palace in unison. Devilish power fuelled fireballs that rained down on their peers, their earlier partnership put aside now that they were here. This wasn’t infighting: they’d never been united in the first place.\u003c/p\u003e\n\u003cp\u003e“Get lost, this belongs to me!”\u003c/p\u003e\n\u003cp\u003e“Kibosh, I’ll remember this!”\u003c/p\u003e\n\u003cp\u003e“Damn, wait until we fight a bloody battle!”\u003c/p\u003e\n\u003cp\u003eAll these devils coveted the lordship. They used all possible tricks, some even with a trace demonic influence.\u003c/p\u003e\n\u003cp\u003eLeylin had no intention to take part in this great battle. He could keenly sense that Beelzebub was absent. Yet, having suffered a great injury it wasn’t like he’d scurry back to his den to lick his wounds. That would only lead to death from his competition. All devils would betray their superiors, so Beelzebub wouldn’t even think of returning to his palace.\u003c/p\u003e\n\u003cp\u003e‘The most I can find here will be a few baubles and treasures; it won’t surpass what I’ve taken before. This statue, however…’ Leylin stealthily rested his hand on Beelzebub’s statue, and felt the surface texture and temperature. His eyes shone with the light of the A.I. Chip’s prompts.\u003c/p\u003e\n\u003cp\u003e‘This is one of Baator’s rarest materials, and it can preserve its temperature forever… The A.I. Chip’s scan didn’t glitch after all!’ Leylin’s eyes flashed, ‘Still, this statue must have been crafted by a master, it even expresses Beelzebub’s divine charm. On top of that, it has a trace of the laws of gluttony…’\u003c/p\u003e\n\u003cp\u003eThe gods of the World of Gods, just like Magi of laws, had comprehended the laws of their world to some extent. Their true bodies were a manifestation of these laws. When he’d become a demigod, Leylin’s own body was imprinted with the laws of massacre and devouring.\u003c/p\u003e\n\u003cp\u003eOf course, devils had their own power of laws, and Beelzebub was the embodiment of gluttony. His true body represented the laws of gluttony, and if a Magus could observe his body they would feel the power of gluttony. It was precisely this reason that a devil’s true form and truename were taboo, and offenders of the same were investigated by the churches.\u003c/p\u003e\n\u003cp\u003e‘Something that preserves the feeling of the power of gluttony like this statue can really be considered a treasure. But I feel like there’s something a little off about it…’ Just as Leylin prepared to research this a bit more deeply, his eyebrows suddenly twitched. He quickly concealed his form, becoming illusory and hiding his aura.\u003c/p\u003e\n\u003cp\u003eA stealthy figure hurried across his vision, heading towards Beelzebub’s palace. The person was using a powerful invisibility spell in tandem with many blessed items, but he still couldn’t hide from Leylin’s True Vision. Nothing could be hidden from the eyes of a god.\u003c/p\u003e\n\u003cp\u003e‘Baalzephon! So his death was faked after all,’ Leylin immediately realised who that stealthy figure belonged to.\u003c/p\u003e\n\u003cp\u003eHe had been entirely correct. The devil who was drawing closer seemed to be the member of the Dark Eight who had fallen in the Hall of Gluttony. This was the person who’d brought him all the way here, Baalzephon!\u003c/p\u003e\n\u003cp\u003eHis private actions had already made him a traitor, so Baalzephon hadn’t hesitated to fake death in order to avoid being questioned and attacked. His acting had been extremely successful, and as fixated on Beelzebub’s powers and authority as they were the fiends let him get away with his actions. The only one he hadn’t hoodwinked was Leylin.\u003c/p\u003e\n\u003cp\u003eBaalzephon had done the same thing as Leylin, furtively following behind the competition. The group of pit fiends cleared his path, but because his ability at stealth was awful he’d ended up trailing behind Leylin.\u003c/p\u003e\n\u003cp\u003e‘There are conscients of Archdevils following behind these pit fiends. There must be some other hints…’ Leylin didn’t have much of an opinion about what had just happened, but he looked with anticipation towards the palace. Devils understood each other best, and perhaps the meddling of the other Archdevils could expose traces of Beelzebub.\u003c/p\u003e\n\u003cp\u003eHowever, if any of them actually discovered Beelzebub, who could win a fight with him?\u003c/p\u003e\n\u003cp\u003e“I’ve found it!” A voice exclaimed in pleasant surprise. It attracted the attention of many pit fiends.\u003c/p\u003e\n\u003cp\u003eThere were powerful fluctuations in the area, and the pit fiend seemed to have activated some sort of mechanism which revealed the shadow of a semiplane that Leylin hadn’t noticed before.\u003c/p\u003e\n\u003cp\u003eA blazing pillar of light lit up around the palace, forming a mysterious array. It formed an illusory entrance.\u003c/p\u003e\n\u003cp\u003e“That Archdevil must be within the semiplane!” All of the pit fiends looked on with covetous eyes, frantically rushing towards the opening plane.\u003c/p\u003e\n\u003cp\u003e“It’s mine, it’s all mine!” Baalzephon had cast off his stealth as well, running in the same direction. However, none of the pit fiends cared. All of their attention was now fixated on the authority of the Archdevil.\u003c/p\u003e\n\u003cp\u003eOnly the few from the Dark Eight let out cries of surprise.\u003c/p\u003e\n\u003cp\u003e‘He hid it well, going as far as to secretly create a semiplane…’ A holy radiance flashed gold, and the blood red massacre domain came into existence. Many of the pit fiends were completely shoved aside.\u003c/p\u003e\n\u003cp\u003eAn incomparably perfect god appeared amongst the devils, his platinum form handsome and imbued with the greatest majesty. Seeing his target, Leylin had made an outrageous move, the outcome something even Baalzephon could not imagine.\u003c/p\u003e\n\u003cp\u003e“Divine force! It’s a god, a god has snuck in!” “It’s only a demigod. If we obtain his essence…” The greedy devils quickly surrounded Leylin.\u003c/p\u003e\n\u003cp\u003e“Hmph.” Leylin only snorted disdainfully, and an enormous tide of divine force turned into a spiritual storm that spread across the area.\u003c/p\u003e\n\u003cp\u003e“Stop him! How can we allow a god to obtain something from Baator?” Threatened by a demigod, the devils stood together in a rare show of teamwork. They cut apart the bindings of the divine force and the massacre domain, coming in front of Leylin. However, just at this moment, a strange smile curved in the corner of Leylin’s mouth.\u003c/p\u003e\n\u003cp\u003eHe turned his head and roared at Baalzephon: “Baalzephon, my servant. Stop these thieves, with no mercy. I command you as your superior!”\u003c/p\u003e\n\u003cp\u003e“Are you joking? Do you think you’re Asmodeus?” Baalzephon’s face split into a smile of ridicule. However, his movements soon dulled. Under the restraints of the contract, he couldn’t help but stop dead in his tracks. He stood solidly and blocked the other pit fiends, his bulky flaming sword slashing at them quickly.\u003c/p\u003e\n\u003cp\u003e“Damn, this is the power of a contract! When did I—” Baalzephon wanted to cry out, but he was entirely unable to. Restrained by the severe difference in their ranks, he was forced to attack the other pit fiends fiercely.\u003c/p\u003e\n\u003cp\u003eSadly, all of his power was used up against the attack of so many of his peers. It took a short while for the other devils to completely tear him apart.\u003c/p\u003e\n\u003cp\u003eHowever, this was already enough.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1037\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1039\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1038","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
