{"id":58661,"no":105,"title":"Chapter 105","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eThe Zither Moon Town\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eApart from Leylin, among this party of five, Bosain would be the strongest based on stats.\u003c/p\u003e\n\u003cp\u003eIn the stats detected by the A.I. Chip, Bosain’s Spiritual Force had reached 15! It was already the requirement needed to advance to the level of an official Magus.\u003c/p\u003e\n\u003cp\u003eHowever, for some reason, it was concealed like Leylin’s. Bosain also used some secret method to conceal his Spiritual Force’s energy waves and also the aberration of his eyes, without letting anyone find out.\u003c/p\u003e\n\u003cp\u003eMoreover, as a level 3 acolyte from a large family, Bosain’s magic artifact emitted energy waves that were extremely strong, only second to the Fallen Star Pendant hung around Leylin’s neck.\u003c/p\u003e\n\u003cp\u003eIn addition, the Lilytell family was one of the three big families of the academy. If Bosain, who was one of the younger generation that hailed from there, had no magic artifact on him, Leylin would be the first to not believe it.\u003c/p\u003e\n\u003cp\u003eAs for Jayden, Shaya, and Roth—they were level 3 acolytes who had just advanced. Jayden and Shaya carried magic artifacts with them and were stronger than Roth by a small margin. However, Roth was neither obsequious nor supercilious along the way—obviously he had his own hidden trump card.\u003c/p\u003e\n\u003cp\u003e“Without using any trump cards, between Bosain and I, we have a fifty-fifty chance of winning. As for Shaya and Jayden, they are below us by a little, whereas Roth is ranked the last. However, he cannot be taken too lightly either!”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes flashed, rapidly calculating that if any conflicts were to occur within the party, what would be the result and the control that he had of such a situation.\u003c/p\u003e\n\u003cp\u003eHowever, be it in the novels of his previous world, or the adventure that he undertook today, various adventurers would have internal strife after obtaining the treasures. It was inevitable.\u003c/p\u003e\n\u003cp\u003eLeylin questioned himself—if Jayden or the rest discovered that it was actually the inheritance of the great Magus Serholm they were after, they would definitely not be willing to share the loot obtained.\u003c/p\u003e\n\u003cp\u003eWho knew if he might be the first to revolt then?\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Zither Moon Town was a little town located at the foot of the Zither Moon Mountain Plains.\u003c/p\u003e\n\u003cp\u003eThis day, on a road that was flying with dust, there were five travel-worn horse riders that appeared.\u003c/p\u003e\n\u003cp\u003e“Alright, we will enter the Zither Moon Mountain Plains from the Zither Moon Town. Before that, we can have a lodging at the inn in the town!”\u003c/p\u003e\n\u003cp\u003eJayden reined in his horse. After getting down, he took out a badly damaged map to have a look.\u003c/p\u003e\n\u003cp\u003eAt this moment, he had a completely different appearance. It was a rather secular face changing spell, which let Leylin somewhat surprised.\u003c/p\u003e\n\u003cp\u003e“This is the area of the borders. If there were any people from the Sage Gotham Hut academy it wouldn\u0027t be odd at all, so we have to be more careful…”\u003c/p\u003e\n\u003cp\u003e“We know it already!” Bosain straightened his robes, showing impatience.\u003c/p\u003e\n\u003cp\u003eThe five of them led their horses to an inn called “Ghosts With Grievances Don’t Weep”.\u003c/p\u003e\n\u003cp\u003eOpening the door, it was as though it was a whole new world. Shouting and clamouring noises, along with the stenches of sweat and the odor of alcohol, wafted over.\u003c/p\u003e\n\u003cp\u003eJayden’s brow’s furrowed, but he still walked towards the counter, tossing out a golden coin.\u003c/p\u003e\n\u003cp\u003e“Give me 5 private rooms….”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, we only have 3 rooms left!” Before Jayden finished speaking, a person, who seemed to be the shop owner and who also stank of rum, interrupted him.\u003c/p\u003e\n\u003cp\u003e“Alright then! Three rooms, we’ll have it all. Also, give us your best delicacies!”\u003c/p\u003e\n\u003cp\u003eFinding lodging at an inn in this small town is already considered fortunate, so Jayden did not pursue further.\u003c/p\u003e\n\u003cp\u003eBut when he was paying the money, he complained, “Isn’t this damned place the one that doesn\u0027t have even a few visitors each year? Now, why is is that there are only 3 rooms left?”\u003c/p\u003e\n\u003cp\u003e“Burp!” The shop owner hiccuped, “Who knows? The Zither Moon Mountain Plains is filled with the damned poisonous gas and miasma. Many of these lads don’t return after setting off. Usually, there are only people here to drink some rum, but regarding gold coins, I seemed to have met with two waves of important guests today!”\u003c/p\u003e\n\u003cp\u003e“Two waves?” Leylin stepped forward, “Which is to say, there was someone else before us who came here?”\u003c/p\u003e\n\u003cp\u003e“Indeed, and they even asked for a tour guide. Gold coin payment, bah! Who wants to die in the depths of Zither Moon Mountain Plains?”\u003c/p\u003e\n\u003cp\u003eAfter hearing this news, Leylin and the rest looked at each other, having a somewhat ominous premonition.\u003c/p\u003e\n\u003cp\u003e“Alright! I’ll let Pinky bring you to your rooms!” The shop owner took down 3 keys that were extremely oily, as he shouted, “Pinky! Pinky! Don’t let me wait another second, if not I’ll scrape your skin off….”\u003c/p\u003e\n\u003cp\u003e* Bang! * Very soon, a dwarf which wore a grey pointed hat stood in front of the owner.\u003c/p\u003e\n\u003cp\u003e“Respected Sir, Pinky is here for your bidding….”\u003c/p\u003e\n\u003cp\u003eThis dwarf named Pinky was only half of Leylin’s height. He also wore a flowery green costume, looking somewhat comical.\u003c/p\u003e\n\u003cp\u003e“Bring our esteemed guests to the rooms upstairs to rest, you know which few!”\u003c/p\u003e\n\u003cp\u003eThe owner casually smacked the dwarf, before handing over the keys.\u003c/p\u003e\n\u003cp\u003e“Dear guests! Please follow Pinky! Be careful of the steps!”\u003c/p\u003e\n\u003cp\u003ePinky touched his hat and led the way at the front.\u003c/p\u003e\n\u003cp\u003eLeylin and the rest followed behind.\u003c/p\u003e\n\u003cp\u003eShaya took off her cloak, revealing a beautiful face and alluring body, and this attracted the whistles from a few drunken blokes suddenly.\u003c/p\u003e\n\u003cp\u003eTowards this, Shaya was not irked at all, she even sent a few coquettish glances over, igniting some heat within those drunkards.\u003c/p\u003e\n\u003cp\u003eLooking at these group of animals that were lusting over her, Leylin snickered. This expression of Shaya’s showed that she was already angry to a certain extent.\u003c/p\u003e\n\u003cp\u003eIf these drunkards acted recklessly and stepped forward to provoke, they would definitely suffer a fate worse than death!\u003c/p\u003e\n\u003cp\u003e“Leylin, you and Roth will be in this room, Bosain and me in the other. The last one would be for Shaya, any opinions?”\u003c/p\u003e\n\u003cp\u003eAs the organiser for this adventure, Jayden quickly allocated the rooms to the members.\u003c/p\u003e\n\u003cp\u003eSeeing Jayden assign the difficult Bosain to himself, Leylin and Roth heaved a sigh of relief, naturally not raising any objections.\u003c/p\u003e\n\u003cp\u003eShaya did not say anything either.\u003c/p\u003e\n\u003cp\u003e“Also, come to my room in a while’s time. Towards the previous batch of customers the shop owner mentioned, I am somewhat concerned!” Jayden’s brow’s furrowed.\u003c/p\u003e\n\u003cp\u003e“We are all staying at the same inn. I believe that we will definitely see the other party!” Leylin spoke blandly as if hinting at something.\u003c/p\u003e\n\u003cp\u003eAccording to that dwarf Pinky, the earlier batch of guests was currently not inside the inn. They seemed to have gone out to purchase some goods, even spending money to hire a tour guide.\u003c/p\u003e\n\u003cp\u003eDinner was held at the large hall on the first level. The main dish was mud bean paste, with some wild herbs as seasoning.\u003c/p\u003e\n\u003cp\u003eHowever, food like this was, in the eyes of Leylin and the rest, fit only for swines. The few of them had no appetite, yet they were curious about the previous batch of guests, so Leylin and the others chose to remain inside the large hall. They sipped on their drinks as they waited.\u003c/p\u003e\n\u003cp\u003e* Bang! *\u003c/p\u003e\n\u003cp\u003eLeylin was drinking his malt, and Shaya had reached her tolerance limits due to the provocation of a few drunkards beside her when the inn’s door opened at this moment.\u003c/p\u003e\n\u003cp\u003e* Hu Hu! * Large gale of cold wind blew into the inn, lowering the somewhat lively atmosphere.\u003c/p\u003e\n\u003cp\u003eAfter seeing these few people who just entered, Leylin’s body tensed.\u003c/p\u003e\n\u003cp\u003eIt was five cloaked figures. From the energy waves on their bodies, they were actually level 2 and 3 acolytes!\u003c/p\u003e\n\u003cp\u003eWhen they entered, they too obviously noticed Leylin and the others.\u003c/p\u003e\n\u003cp\u003eThe line of sight connected between the two parties, and sparks appeared. However, as if nothing had happened, the five cloaked figures did not stop and continued walking towards the second floor.\u003c/p\u003e\n\u003cp\u003e“How is it? Are they acolytes from the Sage Gotham Hut?”\u003c/p\u003e\n\u003cp\u003eShaya whispered, unable to conceal the worry on her face.\u003c/p\u003e\n\u003cp\u003e“I don’t know, but they are obviously not here on a holiday!” Jayden’s expression darkened.\u003c/p\u003e\n\u003cp\u003e“I say, if we did not choose this inn for lodging, would we have been able to avoid them?” Roth scratched his head.\u003c/p\u003e\n\u003cp\u003e“Avoidance?” Bosain smirked in contempt, “It is the thought of weak people. The Lilytell family would never ever have to avoid!”\u003c/p\u003e\n\u003cp\u003eBeing looked down upon by Bosain, Roth tensed. He was suffering from humiliation, yet he did not react.\u003c/p\u003e\n\u003cp\u003e“Moreover, the Zither Moon Town is so small, and there is only this one inn. When we entered the town, we were already exposed. Any sudden movements will only attract the vigilance of the other party!”\u003c/p\u003e\n\u003cp\u003e“The crucial thing is, what is their motive for coming here?” Leylin asked.\u003c/p\u003e\n\u003cp\u003e“Could it be that they also have found traces of the clues in here?”\u003c/p\u003e\n\u003cp\u003eJayden’s expression changed, “I purchased this lead for a heavy price, buying a book that was scribbled with ancient characters.\u003c/p\u003e\n\u003cp\u003e“Which is to say, the other party could have found something too. Who knows if they might even have a professor who tagged along…” Shaya’s face looked even more uneasy, “Should we abandon the operation this time?”\u003c/p\u003e\n\u003cp\u003e“No way!” Jayden was the first who refused. For this lead, he had paid too high a price, naturally he was unwilling for them to give up.\u003c/p\u003e\n\u003cp\u003e“I don’t think any of us here would be willing to let their professors claim half of the benefits that we obtained here after a dangerous exploration” Leylin added.\u003c/p\u003e\n\u003cp\u003e“However, before they notice us, the situation might change!”\u003c/p\u003e\n\u003cp\u003e“How about we get rid of them? I took a look, there are only three level 3 acolytes and two level 2 acolytes!” Jayden revealed a brutal expression.\u003c/p\u003e\n\u003cp\u003e“We can try, but it has to be done within the Zither Moon Mountain Plains. Moreover, we should eliminate all of the traces. I don\u0027t wish for the other side to find a reason to go to war with us!” Bosain added.\u003c/p\u003e\n\u003cp\u003e“It could also be some wandering magicians, instead of the acolytes from the Sage Gotham Hut…”\u003c/p\u003e\n\u003cp\u003eRoth said, his voice extremely soft.\u003c/p\u003e\n\u003cp\u003eA total of five acolytes, with three level 3 acolytes. This formation required too much time and effort to nurture them, so wandering magicians would never be able to do it.\u003c/p\u003e\n\u003cp\u003eOnly academies and large scale magician guilds would be able to send out these many acolytes at once.\u003c/p\u003e\n\u003cp\u003e“Alright then! No matter where they are from, even for the one percent chance that they are here to seek out the remnants, once they enter the Zither Moon Mountain Plains, they are our enemies!”\u003c/p\u003e\n\u003cp\u003eJayden spoke in a murderous tone.\u003c/p\u003e\n\u003cp\u003eAs acolytes, they did not wish to break the unwritten rules of the Magus World by taking action within the small town where regular humans lived. As for the other party, they could very well hold the same thoughts.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-104\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-106\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-105","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
