{"id":59606,"no":1050,"title":"Chapter 1050","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eDream Demon\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e*Bang! Bang!* The dried earth suddenly burst apart, forming two dark holes. A cloaked figure emerged from each of the holes, one of them removing his cloak to observe the surrounding soil. While it was still as barren as before, there was at least some form of life here. The place was not entirely dead.\u003c/p\u003e\n\u003cp\u003e“Bodach, why are all the routes you know underground?” Leylin glanced at the one-eyed dragon, doubting its race.\u003c/p\u003e\n\u003cp\u003e“Hehe… Don’t get hung up on those trivial things! So? I wasn’t wrong, was I? As long as we go through the underground whistling passage, we’ll be able to evade the wild regions with masters…” Bodach chuckled.\u003c/p\u003e\n\u003cp\u003eLeylin was one who only cared for the results and not the process, so he did not pursue the matter.\u003c/p\u003e\n\u003cp\u003e‘A.I. Chip, conduct a scan.’ Leylin immediately received information on the environment, tracking its hydrology and even the origin force. A look of astonishment flashed on his face.\u003c/p\u003e\n\u003cp\u003e“It’s not bad, huh? Compared to other places, this is already like an oasis!”\u003c/p\u003e\n\u003cp\u003eLeylin’s scans revealed a few small dried up shrubs in the area, making it look like the Gobi Desert. The presence of plants indicated moisture, and this flora would coexist with animal life. In an environment like Dreamscape which was often weakened, this was incredibly difficult to achieve.\u003c/p\u003e\n\u003cp\u003e‘Yet in order to survive many have to kill each other. Death is unavoidable…’ Leylin wondered in his mind. Survival and reproduction were the two primitive desires of all living beings, and in order to attain these two goals they could explode forth with surprising strength.\u003c/p\u003e\n\u003cp\u003eOf the two themselves, survival was the first priority. From ancient times wars for survival were the most bloody and ruthless of battles.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin’s attention had shifted from the battles between tribes, instead focusing in another direction.\u003c/p\u003e\n\u003cp\u003e‘Why is this place so special? Dreamforce waning should affect the entire world…’ His interest now piqued, Leylin’s gaze penetrated through the skies, mountains, and rivers, as powerful soul force burst forth. At that very moment, the skies and the ground seemed to freeze.\u003c/p\u003e\n\u003cp\u003e‘Hmm? Where are the Lords of Calamity here?’ Leylin instantly noticed the difference here. Theoretically, the places where the natives lived should be on the land of a Lord of Calamity, yet Leylin had found no signs of such.\u003c/p\u003e\n\u003cp\u003eThat wasn’t all. Destructive snow was nowhere to be found, as if there was nobody in charge.\u003c/p\u003e\n\u003cp\u003e“You noticed it as well?” The one-eyed dragon chuckled as he explained, “The Lord of Calamity here has the true form of a dream demon. It chose a unique virtual seal as its innate skill, allowing it to avoid all attacks from destructive snow... “\u003c/p\u003e\n\u003cp\u003e“So that’s why.” Leylin nodded, understanding the situation.\u003c/p\u003e\n\u003cp\u003eDream demons were a very rare species in Dreamscape. They were very compatible with dreamforce, and it was rumoured that adult dream demons grew as large as entire continents. Given one’s size, it could seal its territory up alongside itself.\u003c/p\u003e\n\u003cp\u003eThe gift of the virtual seal was one of the bloodline abilities of the dream demons. They could make their truesoul illusory, being sealed into the dreams of numerous life forms.\u003c/p\u003e\n\u003cp\u003e“In other words… This vast territory that we see here is a part of the dream demon’s body… and its thoughts and will have been broken up into pieces and sealed into the dreams of the beings dwelling here, silently taking in nutrition and fighting against the weakening of dreamforce?”\u003c/p\u003e\n\u003cp\u003eLeylin felt enlightened.\u003c/p\u003e\n\u003cp\u003eThe way dream demons dealt with methods was just too ingenious. By surviving within others’ bodies, they could both prevent the weakening of dreamforce and evade the destructive snow. Evidently they’d formed a special symbiotic relationship with the other natives of Dreamscape.\u003c/p\u003e\n\u003cp\u003eA dream demon could nourish the natives with its dreamforce and help them with its body, who in exchange would give it the soul energy to support its truesoul and prevent it from weakening. Dream demons were one of the creatures least weakened by dreamforce entering a trough.\u003c/p\u003e\n\u003cp\u003e“But this method would need to be paired with a specific bloodline ability… There might be a single pure-blooded dream demon in all of Dreamscape…” The one-eyed dragon Bodach sighed beside him.\u003c/p\u003e\n\u003cp\u003e“Whatever the motive is, this Lord of Calamity’s methods has allowed numerous natives to survive…” Leylin was quite in favour of methods like these where both parties benefited, “Given the characteristics of Dreamscape the chance of a native turning into an evil existence is one in ten thousand, maybe even one in a billion, but over the long term the dream demon will obtain goodwill and connections, which by themselves are terrifying…”\u003c/p\u003e\n\u003cp\u003eLeylin immediately categorised the dream demon as someone not to be provoked.\u003c/p\u003e\n\u003cp\u003e‘But my goal in coming here isn’t to go against the comatose demon. It probably wouldn’t even care if a native or two disappeared, that’s like plucking off a strand of hair…’ Even as he thought this, Leylin hastened towards the place with the most concentrated life aura, Bodach alongside him. The dragon said this was where he’d smelt the souls with Leylin’s scent. The dragon had only been looking for treasures then, too lazy to come and take a look.\u003c/p\u003e\n\u003cp\u003eHard soil had condensed into slabs as solid as steel here, but Leylin nodded in satisfaction.\u003c/p\u003e\n\u003cp\u003eThis region was much better than others in Dreamscape. The ground over there was full of sand, with no signs of anything else to be found. In comparison, with the nourishment and support of the body of the Dream Demon, the life here could somewhat be comparable to terrible places in other worlds.\u003c/p\u003e\n\u003cp\u003e*Swish! Swish!* Two black streaks suddenly appeared from underground, pouncing towards Leylin and Badoch.\u003c/p\u003e\n\u003cp\u003e“Hm? There’s a living being? Not bad!” Leylin grabbed forward, and two mice with coarse fur were caught suspended in the air, beady eyes full of insanity turning into fear as the hunter became the prey.\u003c/p\u003e\n\u003cp\u003e“Sawtooth mice? The toughness of the fur and the contamination…” Blue light flashed in Leylin’s eyes, and the A.I. Chip’s scans immediately allowed him to gain all information regarding them.\u003c/p\u003e\n\u003cp\u003e‘A vitality and radiation comparable to a rank 1 Magus. Unfortunately, that’s only the bottom of the food chain here. The intelligence hasn’t completely developed either, it can’t even realise our might.’ The single-eyed dragon snorted in annoyance, unable to understand why Leylin was interested in a few little ants.\u003c/p\u003e\n\u003cp\u003e“Then again, creatures who don’t know their place won’t live for long!” Leylin waved his hands.\u003c/p\u003e\n\u003cp\u003e*Crack! Crack!* A sharp sound rang out as the two mice with bones like steel broke apart. Their eyes lost all lustre as they fell to the ground.\u003c/p\u003e\n\u003cp\u003eLeylin gazed into the distance and spoke profoundly, “Be careful, Bodach. We have guests.”\u003c/p\u003e\n\u003cp\u003e“Guests?” Bodach looked in the same direction with puzzlement in his eyes, and a look of understanding then flashed across his face.\u003c/p\u003e\n\u003cp\u003eTwo powerful existences were present there, waiting quietly in place. A soul aura that was slightly more powerful than that of the two sawtooth mice slowly drew closer.\u003c/p\u003e\n\u003cp\u003eThe black grass in the distance rustled, and as if the being had discovered something the sounds stopped. It gave Leylin the feeling that the other party was feeling hesitant.\u003c/p\u003e\n\u003cp\u003eHowever, perhaps the temptation of the two coarse-furred mice was too huge. After a period of muffled breathing, a slender dark figure headed over.\u003c/p\u003e\n\u003cp\u003eIt looked like a child, only coming up to Leylin’s shoulder. He wore tanned leather hunting gear that was torn in many areas, with countless patches on it. Even then, he was still revealing a lot of skin.\u003c/p\u003e\n\u003cp\u003eEven with all these layers Leylin could still the purplish patterns on the skin. It immediately caused him to recall Gillian and her people.\u003c/p\u003e\n\u003cp\u003eThe young hunter’s face was tanned, and it was difficult to see what kind of expression he had on his face. His eyes first darted to the prey on the ground, and then at Leylin and Bodach, obviously frightened. No matter how he saw it, someone wearing such complete and luxurious clothing were not people to be provoked.\u003c/p\u003e\n\u003cp\u003eGulping, the young man struggled for a long while before pointing at the bodies of the mice on the ground, “This… mine…”\u003c/p\u003e\n\u003cp\u003eThanks to Gillian, Leylin had learnt the language of Dreamscape, so there was no language barriers. However, this wasn’t much anyway. After becoming a demigod, he was able to understand all languages, and existences of laws too could transmit information through soul communication.\u003c/p\u003e\n\u003cp\u003e“Yours!” Leylin gestured, inviting him to take them. Following his gaze, he obviously saw the purple pattern markings on the two mice’s hind legs.\u003c/p\u003e\n\u003cp\u003e‘He ran so far just for these two, and even risked offending us. Looks like the scarcity of food here is rather terrible…’ Seeing the young man cheer and rapidly throw himself over, Leylin had his own thoughts.\u003c/p\u003e\n\u003cp\u003eThe natives of Dreamscape had all experienced dreamforce being poured into their bodies, their strengths boosted greatly on average. Leylin estimated that they would have no problems with becoming comparable to rank 2 Magi upon reaching adulthood.\u003c/p\u003e\n\u003cp\u003eThe young man was now kneeling on the floor, seeing the blood that had spilt onto the ground with a look of pity on his face. He then picked up the mice and sucked the fresh blood out of the wounds.\u003c/p\u003e\n\u003cp\u003eThe blood of these sawtooth mice had a strong taste of iron. With just a look Leylin could tell that there was a terrifying amount of radiation and contamination inside, yet the youth looked like he was sampling something extremely delicious.\u003c/p\u003e\n\u003cp\u003e“Tsk… What a good appetite! It’s comparable to our rot-eating dragons…” Bodach pursed his lips.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1049\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1051\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1050","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
