{"id":59621,"no":1065,"title":"Chapter 1065","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAllsnake\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin’s laboratory had been transformed into an enormous maze of infinite space. A few furnaces within burned with the unquenchable fire of origin force.\u003c/p\u003e\n\u003cp\u003eThe powerful energy was restricted by many shackles formed of laws, poured into the enormous spell formation at the centre.\u003c/p\u003e\n\u003cp\u003eAt the heart of this spell formation was an enormous pool, liquid origin force from Dreamscape present within. Just a drop of this could drive other beings of law crazy.\u003c/p\u003e\n\u003cp\u003eA faint black shadow could be seen at the centre of the pool, greedily absorbing the surrounding energy and origin force to radiate a vaguely sharp and deadly aura. It seemed like some cruel giant creature of prehistoric times lay there, dormant.\u003c/p\u003e\n\u003cp\u003e“It took several hundred years, but the embryo of the weapon is ready. Next is the sculpting…” Leylin stood by the pool dressed in black robes, his eyes filled with satisfaction.\u003c/p\u003e\n\u003cp\u003e“Leylin… Leylin…” Just at this moment, his expression changed. A summons was transmitted from his bloodline, full of intoxicating power.\u003c/p\u003e\n\u003cp\u003e‘It’s the Snake Dowager! Has the time of our thousand year contract come already?’ Leylin sighed lightly as he stepped away. He watched as the surroundings changed greatly.\u003c/p\u003e\n\u003cp\u003eAs spacetime began to change, Leylin had already arrived outside the world boundary of the Magus World. His true body now emerged in the endless astral plane. A woman dressed in black was waiting for him in the limitless starry skies.\u003c/p\u003e\n\u003cp\u003e“We meet again… Snake Dowager!” Leylin said softly. He now had a clear estimate of the Snake Dowager’s strength. She was a rank 8 Magus! Even if she hadn’t formed her own path by refining her laws yet, and her combat power was a little inferior to the Lords of Calamity, she was a creature who’d lived countless years and most likely had several trump cards hidden.\u003c/p\u003e\n\u003cp\u003e“Your Excellency Leylin! Every time we meet, I seem to be ever more surprised…” The Snake Dowager’s face was veiled with a black muslin cloth. Only her glittering eyes, as bright as stars, were revealed to the outside world. They rippled with endless charm, filled with sweet-tempered emotion.\u003c/p\u003e\n\u003cp\u003eOne could see a fondness for life and beauty from her eyes, and anyone could see their most perfect image of a woman at its centre. It had to be said that when it came to laws of charm, the Snake Dowager’s comprehension had reached a terrifying level.\u003c/p\u003e\n\u003cp\u003e“With your current power, you’re at the forefront of rank 7 existences across all worlds. If it’s like this, then I can feel at ease…” The Snake Dowager stood shoulder to shoulder with Leylin. Her thousand snake form did not have the sphere of serpents below her, but Leylin felt that this was a true form, not her avatar.\u003c/p\u003e\n\u003cp\u003eHe smelt the fragrance of a maiden as well as the rippling of silky hair— and the most important thing was the intimate connection of bloodline. It gave all her bloodline descendents the feeling of being favoured by the gods.\u003c/p\u003e\n\u003cp\u003eStill, no matter how beautiful she was, she was still just a cooperative partner to Leylin.\u003c/p\u003e\n\u003cp\u003e“I have not forgotten our thousand year contract about the Shadow World. So, why have you come to find me?” Leylin wrinkled his brow.\u003c/p\u003e\n\u003cp\u003eIt was not easy to fight over a large world, especially the Shadow World which was equivalent in rank to the Purgatory World. There would be many beings of law in that place, and what’s more they’d managed to expel her in the past!\u003c/p\u003e\n\u003cp\u003eSnake Dowager was originally an existence of laws from the Shadow World, and had been a rank 8 Magus for a while. It was a pity that while fighting over the control of the world, her refinement of the power of shadows into her own path had failed. She had been forced to bring her bloodline descendents to the Purgatory World.\u003c/p\u003e\n\u003cp\u003eSince then, parts of her bloodline had circulated outside. They were tinged by the chaotic nature of Purgatory whatever world they spread to.\u003c/p\u003e\n\u003cp\u003eStrictly speaking, Leylin’s Kemoyin Warlock inheritance had been part of her legacy. Because of that, there was no way that the path of bloodlines and its conflict would be so easily resolved.\u003c/p\u003e\n\u003cp\u003eSince it stemmed from this reason, and he also intended to quell his quarrels with her, Leylin finally decided to help her out once. As for the other conditions and treasures, in truth it wasn’t enough of a motivation for an existence of laws to act.\u003c/p\u003e\n\u003cp\u003e“Is this fate?” Leylin’s eyes brightened. As if something had snapped, his aura began to come to a standstill. At this, the Snake Dowager’s eyes glowed with extraordinary splendour. It was clear that her junior Leylin had surprised her.\u003c/p\u003e\n\u003cp\u003e“Of course not. I had an agreement with the Trial’s Eye as well as other supremes to act at the most appropriate time,” the Snake Dowager said in a nasal voice, her tone clear and silky. All who heard it unconsciously lost themselves.\u003c/p\u003e\n\u003cp\u003e“Have you completed your preparations, Your Excellency?”\u003c/p\u003e\n\u003cp\u003e“I have, I’m ready to act at any time,” Leylin replied. His origin force weapon was now mostly complete. He’d need time to pour laws in and sculpt it, something that could not be rushed. Still, his current battle might exceeded that of ordinary rank 8 existences, making it very possible for him to escape with his own life.\u003c/p\u003e\n\u003cp\u003eBesides, if he was able to drag the Snake Dowager into Dreamscape, Leylin was sure that he would be able to teach her an unforgettable lesson.\u003c/p\u003e\n\u003cp\u003eWith his confidence in his own power, Leylin now dared to reveal his true self before the Snake Dowager. After all, his opponents were not limited to the existences of laws within the Shadow World. In the depths of Leylin’s heart, he had never trusted the Snake Dowager. This was so even if he’d signed a bloodline contract with Dreamscape as his witness.\u003c/p\u003e\n\u003cp\u003e“Very well, then. Let us depart now. We need to pass by five other worlds to reach the Shadow World, passing through the cracks between worlds…”\u003c/p\u003e\n\u003cp\u003eA giant pitch-black serpent emerged from her dulcet tones, the Allsnake symbol upon its head as it leapt into the endless astral river.\u003c/p\u003e\n\u003cp\u003eThis sort of ultra long-distance world transformation was required to transport Leylin and other existences of laws like him. Astral gates were unable to bear such a burden, so it was necessary to use the most primitive form of travel.\u003c/p\u003e\n\u003cp\u003eLeylin shrugged his shoulders and stepped onto the path paved by starlight, walking side-by-side with the Snake Dowager as they journeyed towards the Shadow World.\u003c/p\u003e\n\u003cp\u003eThe astral plane— This was the concept that the ancient Magi had of the distant universe. It represented the limitlessness of space with its endless borders. The ancient Magi had all been fond of exploring and exploiting the astral plane.\u003c/p\u003e\n\u003cp\u003eThe astral plane was full of numerous dimensions and worlds, planes, demiplanes, and even special places where the remains of ancient Magi lay dead. It was filled with danger, and the chaotic flow of space there would make it difficult for even rank 5 and rank 6 Magi to survive. It was even more pointless to talk about the strange and savage creatures here.\u003c/p\u003e\n\u003cp\u003eDuring ancient times, Magi below rank 7 used astral gates to explore the astral plane, danger omnipresent in their expeditions. However, for these two who were strolling through the astral river, the danger that was enough to annihilate a legion of great Magi was nothing more than some entertainment in their leisure time.\u003c/p\u003e\n\u003cp\u003eThe frantic space storms did not raise a single corner of the pair’s clothes. The astral creatures all made a detour around them, the turbulent and berserk auras of their bloodlines causing all weaker creatures to flee.\u003c/p\u003e\n\u003cp\u003eCurrently, the Snake Dowager seemed to maintain a very low profile. When they encountered the aura of existences of laws, it had always been Leylin who had confronted them.\u003c/p\u003e\n\u003cp\u003eShe naturally wanted to preserve the surprise of their attack, but Leylin felt that this was a rather useless gesture.\u003c/p\u003e\n\u003cp\u003eLeylin had not come unprepared. He’d already researched everything to do with the Shadow World, even if it was a shame that the Final War and its distance from the Magus World had left the news near useless.\u003c/p\u003e\n\u003cp\u003eLeylin only knew that the Snake Dowager’s contest for the control of the Shadow World had failed, and she had been banished. However, he was completely in the dark about who her opponent had been.\u003c/p\u003e\n\u003cp\u003eThe Snake Dowager had not breathed a word about the matter to anyone. Leylin reckoned that it was only when they reached the Shadow World that she would honestly tell him everything.\u003c/p\u003e\n\u003cp\u003e*Awooo! Awooo!* Standing on the path of starlight, Leylin watched as a huge creature with an extremely long tail walked past them with interest.\u003c/p\u003e\n\u003cp\u003eThe creature’s physique could not be described with just stats. It was roughly the same size as the Snake Dowager’s astral body, with dark brown leather on its skin imprinted with scales. It had thousands of gigantic feet beneath its fat body, their shapes strange and twisted. Six pairs of broken fleshly wings were on its back, and it saw them through a pair of amber eyeballs that had only just appeared. Its light green pupils greedily scanned across its surroundings.\u003c/p\u003e\n\u003cp\u003eAn enormous tongue occasionally pulled several floating creatures into this body, even the stronger astral creatures unable to escape this fate.\u003c/p\u003e\n\u003cp\u003eAfter seeing Leylin and the Snake Dowager, the enormous monster snorted. Two destructive pillars of smoke erupted from its nostrils. With a wave of its tail, it disappeared deeper into the astral plane.\u003c/p\u003e\n\u003cp\u003eThe Snake Dowager introduced the creature to Leylin, “This was Merxiname, the astral plane’s ‘streetsweeper’. It feeds on the corrupted trash of the astral plane, and has a gentle temperament…”\u003c/p\u003e\n\u003cp\u003e“I’ve seen its description before in books on the astral world, but this is the first time I’ve seen it in person…” Leylin looked at the enormous body of the Merxiname, his eyes filled with a faint regret.\u003c/p\u003e\n\u003cp\u003eThe creature’s body was almost as big as a plane, so it could only survive on the amount of food it would get in the astral plane.\u003c/p\u003e\n\u003cp\u003e“Also, the Merxiname has the ability to create astral wormholes. Follow it, perhaps we can save some time.” This secret was just one of many an ancient existence like the Snake Dowager would know, such as the burial grounds of treasure from ancient Magi. Even one bit of news could drive others crazy.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1064\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1066\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1065","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
