{"id":59625,"no":1069,"title":"Chapter 1069","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eXavier\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e‘Remain hidden as much as possible. Gather information and wait for further instructions.’ Giving commands to the rest of the puppets, Leylin descended into the atmosphere himself. Currently still in stealth mode, he was small enough a target to avoid the satellites’ detection even if they were still here.\u003c/p\u003e\n\u003cp\u003eAfter passing through a thick cloud full of radiation, Leylin saw a mysterious continent in front of his eyes. It was filled with the radiance of civilisation.\u003c/p\u003e\n\u003cp\u003e‘A.I. Chip, begin preparing plan 1,’ Leylin commanded.\u003c/p\u003e\n\u003cp\u003e[Beep! Plan 1 activated. Gathering data on gravity and atmosphere, remapping physical constants…] The A.I. Chip loyally carried out Leylin’s orders, and then presented an analysis chart filled with information to him.\u003c/p\u003e\n\u003cp\u003e‘The atmosphere here is suitable for the survival of large life-forms. The other physical constants aren’t much different either, just that the inertia of the elemental particles is greater. So I can only absorb them through specific channels?’\u003c/p\u003e\n\u003cp\u003eLeylin felt like the Shadow World was rather interesting. Microscopic soul sensing allowed him to discover a huge and terrifyingly powerful Weave here.\u003c/p\u003e\n\u003cp\u003e‘In essence it’s like the one in the World of Gods, but there’s some difference in its scope and ability. As well, its mainly powered by shadow force. Should I call it the Shadow Weave?\u0027\u003c/p\u003e\n\u003cp\u003eNow Leylin was left without doubt about the identity of this Mistress of the Night who’d taken the Shadow World from the Snake Dowager. It was evidently the Goddess of Shadows from the World of Gods, Shar!\u003c/p\u003e\n\u003cp\u003e‘Rumours say that the faith of dark wizards allowed Shar to involve herself in the domain of magic. Seems like it’s true…’ Leylin didn’t connect to the Shadow Weave directly. After all, Shar may have implemented some special restrictions, and any misstep could cause him to be discovered.\u003c/p\u003e\n\u003cp\u003e‘The most important thing now is to blend in and slowly get access to the Shadow Weave, obtaining enough power to control it.’ Leylin’s eyes glinted. With his experience from the World of Gods, it wouldn’t take long for Leylin to analyze the Shadow Weave.\u003c/p\u003e\n\u003cp\u003e*Vroom!* The sharp sound of a fast engine sounded out, and a large, foreign, yet all so familiar body flew past Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003eIts streamlined design could reduce air drag greatly, and the two wings at its side maintained its balance. The powerful engine drove it forward, allowing it to fly in the sky with several thousand people within.\u003c/p\u003e\n\u003cp\u003e‘A plane? I never thought they’d be so advanced…’ Leylin sighed. He could see the numerous specks of light that represented souls within the flying vehicle. These souls were so tiny a mere ripple of power on his end would completely decimate them. Still, the knowledge of these puny things had allowed them to successfully conquer the skies!\u003c/p\u003e\n\u003cp\u003e‘A similar inclination towards technology and development…’ Leylin had a look of nostalgia in his eyes as he stood atop the upper cabin of the plane. He slowly sat down, memories from his previous life appearing in his mind.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Within the cabin, a young girl with a ponytail gazed at a brown-haired young man anxiously, “Are you feeling sick, brother? Should I get an attendant?”\u003c/p\u003e\n\u003cp\u003e“No I’m fine, Jill. I just felt uncomfortable all of a sudden. This terror, only that time with the school bus can compare…” The brown-haired youth smiled with a pale face, but his hands were still trembling unconsciously.\u003c/p\u003e\n\u003cp\u003e“That accident?” Jill’s eyes darkened. She knew fully well that her brother Xavier was exceedingly talented, and his natural sense of danger was quite powerful. Once in primary school, it had allowed them to avoid a serious traffic accident.\u003c/p\u003e\n\u003cp\u003eRecalling how terrible the news had reported it to be, as well as the scene where none of her classmates had survived, the girl’s eyes reddened. She couldn’t control the tears that fell, “It’s all my fault… If I didn’t force Brother to go as well…”\u003c/p\u003e\n\u003cp\u003e“Er… Didn’t I say it already? Don’t worry about it, and act as if we’re going to crash in the next second…” The young Xavier glanced at the surrounding passengers sheepishly and quickly hugged Jill, smiling apologetically at everyone else.\u003c/p\u003e\n\u003cp\u003eWhat he hadn’t mentioned was that he hadn’t had such a premonition before getting on the plane. It was just that he suddenly quivered in that instant, feeling helpless and despair at a sure death. This feeling buried itself into his heart, causing great trauma.\u003c/p\u003e\n\u003cp\u003eHowever, this feeling disappeared just as quickly, leaving not a trace. It made him feel like he’d gone crazy.\u003c/p\u003e\n\u003cp\u003e“It’s nothing. Stop crying, Jill!” Xavier could only do his best to console his little sister, but he could not help recalling what had just happened.\u003c/p\u003e\n\u003cp\u003e‘That feeling of a sure death that suddenly disappeared… What was that about?’ At this thought, the young man could not help but pull out a pendant at his neck, the bright red string having a black snake rune on it, ‘Is there a force here that can destroy this plane in an instant? Or is a war about to break out soon?’\u003c/p\u003e\n\u003cp\u003e“Haha… A crash? You’re hilarious!” A middle-aged man who was reading a magazine at the side put the book in his hands down, adjusting his glasses, “Crashes were indeed common twenty years ago. You could be unlucky enough to have failing components or meet a bird. However shadow force has come quite far since then, and all aircraft are integrated into the Shadow Weave. All vehicles have powerful shadow armour protecting them, so even if you bump into a prehistoric dragon you won’t face any problems…”\u003c/p\u003e\n\u003cp\u003e“Exactly… I’ve gotten on so many flights, and I’ve yet to hear about any dangers!” A curly-haired woman beside them began to chatter away.\u003c/p\u003e\n\u003cp\u003e“Is that so?” Jill was still very childlike in her thoughts. Having heard this she immediately stopped crying. Beads of sparkling tears hung on her rosy face, making her look even more pitiful.\u003c/p\u003e\n\u003cp\u003e“Yes!” After seeing the state Jill was in, the man who had been speaking suddenly sensed his lolicon soul come ablaze, suddenly exploding!\u003c/p\u003e\n\u003cp\u003e“Don’t worry. Look at this!” He raised his arm, pulling at a portion of his sleeve to reveal a digital wristwatch with a unique design on his wrist. On the silvery-grey exterior was the symbol of a black crown.\u003c/p\u003e\n\u003cp\u003e“This…” Gasps could be heard everywhere. “The newest model of the rapid shadow series! Tsk…”\u003c/p\u003e\n\u003cp\u003e“Rapid Shadow V, providing the most convenient and quick connection to the Shadow Weave. It was developed by the empire’s chief scientist Lirlian using the latest 2D point technique. It now supports the storage and download of spells at rank 3 and above, even if casting mid-ranked spells needs the caster to control things very well. Only university students of the empire and mechanics above grade 5 can work this. I never thought uncle was such a bigshot!”\u003c/p\u003e\n\u003cp\u003eThe young man could not conceal the envy and fervour in his eyes after seeing the man’s watch, and he blurted out all the information about it.\u003c/p\u003e\n\u003cp\u003e“So? Are you at ease yet? Even if anything happens to components of the plane, with the Shadow Armour and Flight that I bought and stored before, it will be enough to protect you…” The man spoke, immensely pleased with himself. He then stowed the watch away, amidst cheers and sounds of admiration.\u003c/p\u003e\n\u003cp\u003e“Thank you, uncle!” Jill yelled sweetly, and the man sat back down, pleased.\u003c/p\u003e\n\u003cp\u003e“Right… Maybe I’m too uptight? How could there be supernatural happenings in this day and age? The records at home are like legends. They’re all fake…” The youth, Xavier, heaved a long sigh, beginning to doubt himself for the first time.\u003c/p\u003e\n\u003cp\u003e“Dear brother!” At this moment, a youth in a black suit and gold-rimmed glasses pulled at the safety belt, heading over with a grim look on his face.\u003c/p\u003e\n\u003cp\u003e“I think you’re very right!”\u003c/p\u003e\n\u003cp\u003e“Could you be…” Xavier was now extremely excited.\u003c/p\u003e\n\u003cp\u003e“Mm! Even with the government forcefully getting involved and increasing shadow protection for all aviation vehicles, accidents are everywhere…” the suited man said stiffly, causing Xavier to nod without end.\u003c/p\u003e\n\u003cp\u003e“This world is too dangerous. One could be struck down by a maglev just walking on the roads, much less when it comes to a flood of Shadow Weave connections allowing minors to use magic as they wish. There’s other issues as well…”\u003c/p\u003e\n\u003cp\u003eThe suited man’s words were headed in a strange direction. Soon, he picked out a beautiful advertisement from his briefcase and placed it in front of Xavier. “Hence, for the sake of you and your family, insurance is necessary! Our company is now launching the newest services that involve protection from Shadow Weave radiation as well as flight risks. Take a look, and ask me any questions you have. Here’s my business card…”\u003c/p\u003e\n\u003cp\u003e“So it’s to sell insurance…” Xavier’s face was now crinkled in a frown, and Jill finally smiled after all the crying.\u003c/p\u003e\n\u003cp\u003e“Well… I’ll think about it. But the attendant is coming over…” Xavier pulled back, pointing to the long-legged stewardess with a smile on her face.\u003c/p\u003e\n\u003cp\u003e“You must choose our Imperial Love. By picking Imperial Love, you’re choosing a better future…” the youth said sternly with a nod before returning to his seat.\u003c/p\u003e\n\u003cp\u003e“Sigh… young people these days…” An old granny seated behind him sighed, causing Xavier to wish he could bury his head in his chest...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1068\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1070\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1069","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
