{"id":58665,"no":109,"title":"Chapter 109","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eA Way To Enter\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe group discussed till late into the night, but no conclusions were arrived at.\u003c/p\u003e\n\u003cp\u003eAfter which, they assigned the sentry for the night watch, and the individuals returned to the tent to rest and meditate.\u003c/p\u003e\n\u003cp\u003eLeylin lay on a simple bed laid with the fur of a white wolf, anxiety stirring in his heart.\u003c/p\u003e\n\u003cp\u003eTo him, this inheritance that no one knew about was now revealed to the rest. Furthermore, using the A.I. Chip’s scanning abilities did not yield him any results. This made him feel rather irritated.\u003c/p\u003e\n\u003cp\u003eEven the meditation that he did daily had to be postponed.\u003c/p\u003e\n\u003cp\u003e“Maybe I should not put all my hopes in here. The south coast is extremely vast. Every dozens of years there would be an acolyte who stumbled upon an inheritance and obtain resources to advance into an official Magus. There are many chances…”\u003c/p\u003e\n\u003cp\u003eLeylin comforted himself, and then laughed in spite of himself.\u003c/p\u003e\n\u003cp\u003eOriginally, he had considered the great Magus Serholm’s inheritance as his own belonging, which had led him to be obsessed with it. Even a magician’s most basic intellect was affected by it.\u003c/p\u003e\n\u003cp\u003eAnd Jayden and the others were also in the same situation.\u003c/p\u003e\n\u003cp\u003e“How irritable, I ignored the dangers!” Leylin’s expression suddenly turned tranquil.\u003c/p\u003e\n\u003cp\u003e“The acolytes of the Sage Gotham Hut have all been killed by us. This will surely cause the other side to keep an eye on us and cause them to send some powerful acolytes or even official Magi to investigate...”\u003c/p\u003e\n\u003cp\u003e“Based on the location of the Sage Gotham Hut, I still have around 10 days’ time till the information reaches them...”\u003c/p\u003e\n\u003cp\u003e“8 days! If within 8 days I still haven’t discovered any clues here, I must leave.” Leylin’s eyes showed his resolve.\u003c/p\u003e\n\u003cp\u003eCompared with the great Magus Serholm’s inheritance, Leylin valued his own life even more.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter having decided thus, Leylin felt as if a load had been taken off of him, and even his spiritual force felt like it was cleansed and thus he entered into the state of mediation.\u003c/p\u003e\n\u003cp\u003eEarly morning, a skylark’s sharp cry echoed above their camp.\u003c/p\u003e\n\u003cp\u003eLeylin greeted Shaya, “Morning!”\u003c/p\u003e\n\u003cp\u003e“Morning!” said Shaya, two dark circles around her eyes. It appeared as if she hadn’t slept a wink last night. A few blood vessels were distinctly visible within her eyes. The gaze that she returned Leylin was inconceivable.\u003c/p\u003e\n\u003cp\u003e“I wonder...how is it that you can be so...relaxed?” After enduring for some time, Shaya at last enquired.\u003c/p\u003e\n\u003cp\u003e“This is an official Magus’ inheritance that we are talking about—there is a chance to even get some information and resources which would help us advance...”\u003c/p\u003e\n\u003cp\u003e“But we still haven’t found it, isn\u0027t that right?”\u003c/p\u003e\n\u003cp\u003eLeylin, facing the rising the sun, stretched his muscles satisfactorily.\u003c/p\u003e\n\u003cp\u003e“As long as something is not yours, you must not obsess over it too much. Otherwise, your heart will only suffer.”\u003c/p\u003e\n\u003cp\u003e“You are very odd indeed!” Shaya rubbed her hand across her forehead, as she continued, “However, Magi and acolytes are all queer people, so you can be considered as normal!”\u003c/p\u003e\n\u003cp\u003e“That may be so!” Leylin nodded, as he thought that if these people came to know that the remnants were left behind by the great Magus Serholm, then the situation could worsen.\u003c/p\u003e\n\u003cp\u003eBut, he certainly would not tell them about this bit of information.\u003c/p\u003e\n\u003cp\u003eThe 5 people walked away from the tents and gathered to eat their breakfast—which was a roasted fowl. After that, they all gathered together to discuss on how to proceed.\u003c/p\u003e\n\u003cp\u003e“Alright! Today will again be another day of solo explorations! Try your best to find the remnants!” said Jayden. After seeing that the discussion went on for ages with no result, he had no other option but to say this.\u003c/p\u003e\n\u003cp\u003eThis was also the most appropriate action for the current situation.\u003c/p\u003e\n\u003cp\u003eAlthough it is possible that any acolyte could find the entrance first, as long as it is opened, Jayden and the rest would also be able to find that open entrance from its energy waves. At the very most, they would just give the people who discovered the entrance a larger portion of the reward.\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003eAfter everyone had scattered in different directions, Jayden, upon seeing that Leylin still stood hesitating at the top of the cliff and was bowing to appreciate the Beta Daisy, he couldn’t help but ask.\u003c/p\u003e\n\u003cp\u003e“It is as you see. I am appreciating the flowers,” said Leylin, with a hint of a smile on his mouth.\u003c/p\u003e\n\u003cp\u003e“At such a moment?” Jayden’s eyes turned red; he made as if to go and reprimand Leylin.\u003c/p\u003e\n\u003cp\u003e“Be calm! You must not get irritated!” Leylin made a gesture to make him halt.\u003c/p\u003e\n\u003cp\u003e“Yesterday we all looked for clues at the cliff’s bottom, but we haven’t discovered this secret hidden among the ocean of flowers!”\u003c/p\u003e\n\u003cp\u003e“Secret? You mean, you found it?” Jayden appeared ecstatic.\u003c/p\u003e\n\u003cp\u003e“What? Leylin found it?” *Sou! Sou! Sou!* 3 shadows appeared directly next to Jayden and Leylin.\u003c/p\u003e\n\u003cp\u003eIt was the other 3 acolytes who had not strayed too far.\u003c/p\u003e\n\u003cp\u003e“En!” In front of his party’s eyes, Leylin slowly nodded his head.\u003c/p\u003e\n\u003cp\u003e“One of you who can use any floating spell, fly up to midair and have a look!” Leylin spoke.\u003c/p\u003e\n\u003cp\u003e“I’ll do it!” Bosain immediately withdrew a silver metal ball. On the metal ball, there were the energy waves of a magic artifact.\u003c/p\u003e\n\u003cp\u003eAfter that, Bosain twirled the metal ball, which then melted to become a liquid. This liquid stuck to his back and formed two huge, pretty and dazzling silver wings.\u003c/p\u003e\n\u003cp\u003e“It is a magic artifact that can change form as needed!” praised Leylin.\u003c/p\u003e\n\u003cp\u003eThis artifact probably could reach the standard of a medium-grade magic artifact, guessed Leylin. The synthesizer had lowered the might of it for an acolyte to wield its power.\u003c/p\u003e\n\u003cp\u003eOnly large-scale families with a long history would be able to enjoy such extravagant methods.\u003c/p\u003e\n\u003cp\u003e* Chi La! * A huge translucent silver wing flapped, bringing the dust off the ground. With this strength, Bosain immediately flew into midair.\u003c/p\u003e\n\u003cp\u003e“How is it? Do you see anything?” Jayden shouted below.\u003c/p\u003e\n\u003cp\u003e“Flowers…The arrangement of the Beta Daisy....”\u003c/p\u003e\n\u003cp\u003eA gust of wind flew past and Bosain flew down onto the ground, retracting his wings back in his body.\u003c/p\u003e\n\u003cp\u003e“This patch of Beta Daisy was planted on purpose. They have formed a character!”\u003c/p\u003e\n\u003cp\u003eBosain explained to the rest.\u003c/p\u003e\n\u003cp\u003e“What character?” Shaya and Roth asked.\u003c/p\u003e\n\u003cp\u003e“It is a Curagerian letter, and the meaning means ‘jump’!” Leylin said.\u003c/p\u003e\n\u003cp\u003e“Jump? Could it be that we have to jump directly off the cliff?” Jayden guessed. acolytes were not silly people, their judgement was clouded by the benefits in front of them previously.\u003c/p\u003e\n\u003cp\u003e“Haven\u0027t we already jumped once yesterday?”\u003c/p\u003e\n\u003cp\u003eRoth scratched his head, “Nothing was discovered, only those damned rocks below the cliff!”\u003c/p\u003e\n\u003cp\u003e“No! You climbed down. As for us, we used the Floating Feather spell to get down!” Bosain interrupted.\u003c/p\u003e\n\u003cp\u003e“I understand now, the remnant is located in a secret plane. As for the way to enter, it is to jump directly down from the cliff without using any spells!”\u003c/p\u003e\n\u003cp\u003e“Jump down directly? Are you crazy?” Shaya twisted her beautiful red hair, “Such a tall cliff with so many rock blades at the bottom. If we don\u0027t use any magic spells for defence, with our physical bodies, even Roth would fall to his death!”\u003c/p\u003e\n\u003cp\u003e“So, we need some experiment specimen!”\u003c/p\u003e\n\u003cp\u003eJayden said, “Go find some animals, better yet some humans!”\u003c/p\u003e\n\u003cp\u003e“That’s possible! But don\u0027t harbour too much hope!” Roth pulled out a bunch of tentacles from his bag and hurriedly left.\u003c/p\u003e\n\u003cp\u003e“We should also search in the surroundings, if we still can\u0027t find any, then let’s return to the town!” Jayden revealed a smile for the first time...\u003c/p\u003e\n\u003cp\u003e“Ahhhhh....”\u003c/p\u003e\n\u003cp\u003eFrightened screams could be heard from the cliff. Moreover, due to the high pressure from the wind, the voices were altered.\u003c/p\u003e\n\u003cp\u003e* Bang! *\u003c/p\u003e\n\u003cp\u003eA black dot fell from the top of the cliff, growing larger, finally, a human figure appeared.\u003c/p\u003e\n\u003cp\u003eIt was a person from the town who wore hunter gear. His face contorted and let out a hell-raising scream, free-falling from the top of the cliff.\u003c/p\u003e\n\u003cp\u003e* Sou! *\u003c/p\u003e\n\u003cp\u003eThe hunter smashed directly onto a rock blade and the huge force of impact directly severed his body in two.\u003c/p\u003e\n\u003cp\u003eThe corpse which was in two fell on the ground creating a huge pit. The bones and flesh were mixed together, the original appearance could not be recognised at all.\u003c/p\u003e\n\u003cp\u003eBeside these two pits, there was a smaller pit.\u003c/p\u003e\n\u003cp\u003eIt had the same gory scene, only that the skull belonged to an animal similar to a deer.\u003c/p\u003e\n\u003cp\u003e“How is it?”\u003c/p\u003e\n\u003cp\u003eAt the bottom of the cliff, Roth crossed his arms and inspected. Shaya too stood beside him. Moreover, in front of him, there was a semicircle object which glowed in green. From that object, Jayden’s voice could be heard.\u003c/p\u003e\n\u003cp\u003e“Nothing new! It’s just more meat paste, the result is similar to the deer from before!” Roth sneered, “It seems that our plan has failed…”\u003c/p\u003e\n\u003cp\u003eOn top of the cliff, Leylin and the other two crowded around. Upon listening to the voice from the other half of the green semicircle object, their faces disappointed.\u003c/p\u003e\n\u003cp\u003e“From the start, an animal, till the last, a human. It seems like there are some other conditions that need to be met!”\u003c/p\u003e\n\u003cp\u003eLeylin was the first to recover from his low spirits.\u003c/p\u003e\n\u003cp\u003e“Let us think carefully, we are running out of specimens to test!” Bosain revealed a sardonic smile, pointing at the empty ground nearby.\u003c/p\u003e\n\u003cp\u003eOn the empty ground, there were a few Zither Moon Town civilians who looked aghast at Leylin and the others. If not for the fact that their mouths were stuffed, they would most likely be cursing or begging for mercy right now.\u003c/p\u003e\n\u003cp\u003eEver since Jayden suggested finding substitutes, the five of them had immediately split up and done their job.\u003c/p\u003e\n\u003cp\u003eBosain was the most ruthless, it seemed like he went back to the town to kidnap a few citizens back here.\u003c/p\u003e\n\u003cp\u003eFor peak magician families from where he came from, the secular regular humans were like wild grass. No matter how many were cut off, more would sprout in the future. Being able to die for his cause was their glory!\u003c/p\u003e\n\u003cp\u003eAlthough Leylin did not agree with this, but going against Bosain for a few mere strangers was not worth it.\u003c/p\u003e\n\u003cp\u003eMoreover, using human specimens had a smaller margin for error, much more than a deer. It was also in accordance with Leylin’s interests!\u003c/p\u003e\n\u003cp\u003eAt the same time, he was extremely shocked at Bosain’s speed.\u003c/p\u003e\n\u003cp\u003e“Jumping down would represent courage! According to the map, there must also be ‘respect!’” Leylin spoke of his own conjecture.\u003c/p\u003e\n\u003cp\u003e“Then what is ‘respect’?” Bosain asked.\u003c/p\u003e\n\u003cp\u003e“In ancient times, when people visit their elders, they would bring a Beta Daisy to show their respect. This custom has lasted till today’s times, and many places in the south coast has retained such traditions!”\u003c/p\u003e\n\u003cp\u003eLeylin smiled and said.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-108\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-110\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-109","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
