{"id":59646,"no":1090,"title":"Chapter 1090","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eMeeting\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e‘The members of the imperial family are here indeed. They even brought the personal bodyguards of the imperial family.’ Crowley thought of the information gathered by the Bloodline Alliance. The imperial family of the Shadow Empire usually kept a low profile, but the strength that they had hidden was extremely powerful. Their personal bodyguards could cast shadow spells instantly, and amongst them were many mutants and bloodline carriers.\u003c/p\u003e\n\u003cp\u003e“We’re in danger today. The two of us could even die here. Are you afraid now?” Crowley looked at Steel Man.\u003c/p\u003e\n\u003cp\u003e“Haha… Cowardice does not exist in the commandments of a knight!” Steel Man’s answer was extremely heroic. A layer of white light glowed on his armour, forming a second layer of defence. Flames began to burn on the knight’s sword. Faced with such a perilous situation, Steel Man had evidently used a secret technique.\u003c/p\u003e\n\u003cp\u003e“Then… Let’s begin to break through the encirclement…” Crowley ripped opened his coat, revealing a scar-ridden upper body. The tattoo of a serpent came alive on his back.\u003c/p\u003e\n\u003cp\u003e“Unseal!” Crowley shouted, and the giant serpent was awakened. It opened its scarlet eyes and spat its forked tongue out, hissing loudly.\u003c/p\u003e\n\u003cp\u003e“Kill!” The both of them were like raging dragons as they roared, charging into the incoming troops.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eDays later, on an island.\u003c/p\u003e\n\u003cp\u003e“Cough…” Crowley opened his eyes, spitting out the fine sand in his mouth.\u003c/p\u003e\n\u003cp\u003eListlessness soon turned to concentration, “How did I end up here… Right, we were in the research facility! The Empire’s backup troops and imperial bodyguards… Steel Man, what a pity…”\u003c/p\u003e\n\u003cp\u003eEven Crowley would not be able to survive such an onslaught. Hence, after discovering that he had not died nor been taken prisoner, he was extremely perplexed.\u003c/p\u003e\n\u003cp\u003e“Are you awake?” An extremely enchanting voice sounded out beside him. Crowley turned towards it, and his throat immediately turned dry. His heart began to beat faster as well.\u003c/p\u003e\n\u003cp\u003eIt was a lady in a black gown. Her appearance was only average, but it carried a powerful, intoxicating attraction. What surprised Crowley even more was the feeling of closeness he had, a reverence that almost had him kneeling and kissing the soil her feet had trod on.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“May we speak for a moment, sir?”A lady dressed in uniform stood before Leylin in Thousand Bears City, waving her pass in front of him. The badge was representative of the Empire’s dignity and power as it shone in the crowd.\u003c/p\u003e\n\u003cp\u003ePassersby avoided the both of them, and some of them even looked at Leylin from a distance with schadenfreude. Anyone who had angered the department this young lady was from would meet with a miserable end in the Empire!\u003c/p\u003e\n\u003cp\u003e“I didn’t know… I’m rather popular now, huh? Follow me!” Leylin smiled and rubbed his nose, before moving into a cafe. He had no intention of being aware that he was treated like a suspect.\u003c/p\u003e\n\u003cp\u003eWhat made the onlookers flabbergasted was that this policewoman did not hesitate and followed him, even carrying a warm and gentle smile on her face.\u003c/p\u003e\n\u003cp\u003e“Tsk! Were they roleplaying? What audacity!” A short and fat man rubbed his glasses and chided in jealousy.\u003c/p\u003e\n\u003cp\u003e“Retard!” His friend beside him immediately covered his mouth. “This is a public area, under the surveillance of the central network and the Weave! Would anyone dare to use a fake identity on the streets?”\u003c/p\u003e\n\u003cp\u003e“What a pity… She was such a beautiful flower, and also my favourite type!” The fatty fought to retort.\u003c/p\u003e\n\u003cp\u003e“I actually think that they’re rather compatible, that boy is also cute!” A girl beside them spoke with stars in her eyes.\u003c/p\u003e\n\u003cp\u003e“Welcome!” The cafe waiter opened the door and welcomed them politely, but was momentarily stumped.\u003c/p\u003e\n\u003cp\u003eEvidently, he had recognised Leylin. Because this was the very same couple cafe that Leylin had entered together with the Snake Dowager.\u003c/p\u003e\n\u003cp\u003eAnd not only did Leylin bring the other girl into the private room, but he even left the bewildered girl lying there. This had left a deep impression on the waiter. In fact, if not for Leylin leaving some words for him to say to the girl before he left, the waiter would already have alerted the nearby authorities.\u003c/p\u003e\n\u003cp\u003eAlthough his facial expression did not change much after seeing Leylin bring in another girl, his eyes betrayed his thoughts. Leylin was apparently a skirt-chaser.\u003c/p\u003e\n\u003cp\u003e“I want to have a couple’s room, the same as before.” After listening to Leylin’s request, the waiter was left speechless. However, his professionalism had allowed him to grant Leylin’s request quickly. What was more remarkable was that it was the exact same room that Leylin had used previously.\u003c/p\u003e\n\u003cp\u003e“Do not disturb us no matter what happens!” The policewoman instructed him after he served the coffee, affectionately pulling Leylin into the room. The waiter was left speechless again after seeing this scene. Before he shut the door, he even gave Leylin the thumbs up…\u003c/p\u003e\n\u003cp\u003eThe room was suddenly enveloped by shadows, and the policewoman stretched her body with a relaxed expression. Just that movement alone caused her aura to change drastically. Her face grew even more exquisite than before, and a pair of watery eyes seemed to speak a language of their own.\u003c/p\u003e\n\u003cp\u003e“We meet again, Shar…” Leylin sighed, looking at the young lady that had changed from head to toe.\u003c/p\u003e\n\u003cp\u003eThis was the ruler of the Shadow World, the Mistress of the Night who was once an intermediate goddess from the World of Gods— Shar!\u003c/p\u003e\n\u003cp\u003eHe did not ask how she managed to look for him. After all, she had the entire world under her. After failing to search for Leylin’s aura, she would have definitely guessed that Leylin had used a fake identity to become a citizen. Through meticulous investigation, it was not a difficult task to track Leylin down. How would a group of corrupt officials peddling fake identities be a match for the ruler of this world?\u003c/p\u003e\n\u003cp\u003e“This brought you to me, didn’t it?” Leylin waved his identity pass.\u003c/p\u003e\n\u003cp\u003e“I never thought that the empire I raised single handedly has reached to such a level of corruption…” Shar admitted implicitly. Her eyes shone like stars as she looked at Leylin, “This is not your true body, but only a body formed by energy…”\u003c/p\u003e\n\u003cp\u003e“I came with grace, why wouldn’t you accept it?” Shar frowned, as if she had gotten upset. But Leylin’s expression did not change at all.\u003c/p\u003e\n\u003cp\u003eShe had to be joking! Had he believed Shar, then he was really courting death. Her level of deceit was absolute perfection. Even rank 7 and above beings would be deceived by her if they weren\u0027t careful.\u003c/p\u003e\n\u003cp\u003eHence, after Xavier and the Bloodline Alliance left, Leylin’s true body had already left Thousand Bears City, only leaving behind this projection here carrying all items that could identify him.\u003c/p\u003e\n\u003cp\u003e“Let’s not talk about that… Why are you here today, Miss Shar. What do you want to discuss?” Leylin sat on the soft satin couch, gesturing for her to sit down too.\u003c/p\u003e\n\u003cp\u003e“The spell that you used the other day… I saw the shadow of the World of Gods and of the arcanists…”\u003c/p\u003e\n\u003cp\u003eThere wasn’t much room for discussion for beings like them. Seeing that her deceit was exposed, Shar immediately delved into the main topic.\u003c/p\u003e\n\u003cp\u003e“You’re right, this is my harvest from the World of Gods.” Leylin admitted. Shar sat beside him in a reserved manner like a virtuous lady. Just the white skin on her hand was extremely alluring.\u003c/p\u003e\n\u003cp\u003eAfter hearing Leylin’s reply, Shar’s face changed for the worse, seemingly affected by his words. It was apparent that the fatal strike had left fear in her heart, and she felt extremely uncomfortable.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin did not mind it at all. He actually used a more unbridled stare and observed this female goddess in front of him. He had to admit that Shar’s body was extremely gorgeous, especially that strange temper of hers that added a layer of wildness. Many males would want to subdue her.\u003c/p\u003e\n\u003cp\u003eMoreover, he’d showed this trump card to Shar on purpose, using it as a deterrence that would allow him to gain the upper hand in the discussion.\u003c/p\u003e\n\u003cp\u003eIt was like a country which possessed nuclear weapons speaking to one without. This confidence and dignity, caused Shar’s expression to change.\u003c/p\u003e\n\u003cp\u003e“I caught a whiff of the Snake Dowager’s aura… You have met her before, in this place!” Shar digressed, looking at the place where the Snake Dowager once sat.\u003c/p\u003e\n\u003cp\u003e“Yes. We’re allies, it’s necessary to convey information and news…” Leylin did not avoid the question, and even stressed on the word ‘allies’.\u003c/p\u003e\n\u003cp\u003e“So then, what kind of price do I have to pay for you to break away from your alliance with the Snake Dowager? I believe that I am a better ally than her! How about we share the origin force of the Shadow World? You have the bloodline of the Shadow World, the origin force will definitely be extremely beneficial to you!”\u003c/p\u003e\n\u003cp\u003eShar immediately stated her price.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eEven more shadows had now enveloped the room, sealing the room tightly. Leylin had even sensed a seal from the world’s origin force. Shar was being extremely careful.\u003c/p\u003e\n\u003cp\u003eAfter having a great chat of over two hours, Leylin left the cafe under the envious gaze of the waiter.\u003c/p\u003e\n\u003cp\u003e“Break the alliance I have with the Snake Dowager?” Leylin shook his head. He had signed a bloodline pact with her, and Dreamscape itself bore witness to it.\u003c/p\u003e\n\u003cp\u003eAlthough his Nightmare Absorbing Physique was perfected, his powers would definitely reduce if he went back on his words. It was something that Leylin did not wish to see right now.\u003c/p\u003e\n\u003cp\u003e“So, the best way is for Snake Dowager to relinquish her rule as well… After all, I am a peace lover…” Leylin shameless gave himself a righteous tag to his name.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1089\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1091\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1090","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
