{"id":59654,"no":1098,"title":"Chapter 1098","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eMotion \u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Indeed!” The Snake Dowager looked at the board and nodded before she turned towards Crowley.\u003c/p\u003e\n\u003cp\u003e“You are henceforth my representative, able to command all rebel forces.” Dark red bloodline force formed a serpentine black eye that surrounded Crowley, causing his strength to rise several degrees once more.\u003c/p\u003e\n\u003cp\u003e“Yes, Mistress. Your will is my command!” Crowley knelt down.\u003c/p\u003e\n\u003cp\u003e“You go follow him,” Leylin told the slightly fervent Xavier.\u003c/p\u003e\n\u003cp\u003e“Re– Really? Thank you, Master!” Xavier hurriedly responded. The unbearable pressure had made him subservient somewhere along the line, especially now that he was in the presence of two of these terrifying existences.\u003c/p\u003e\n\u003cp\u003e“You served us well, so here’s a tidbit of information. Your sister is currently inside the palace as well. Try harder, kid!” Xavier hadn’t left yet, and this news caused his body to tremble as he picked up his pace.\u003c/p\u003e\n\u003cp\u003eOnce the two of them left, a strange atmosphere enveloped the surroundings of the villa.\u003c/p\u003e\n\u003cp\u003e“What do you think of their chances of success?” the Snake Dowager broke the silence. She stretched her body, causing Leylin to smell a unique scent that caused his heart to skip a beat.\u003c/p\u003e\n\u003cp\u003eLeylin opened his mouth after a moment of silence, “Project X has been in progress for so many years, and a big portion of the natural world has been taken over. The Shadow Weave’s influence has also permeated the whole world… Our opponent can choose to act at any time.\u003c/p\u003e\n\u003cp\u003e“Instead of leaving the button in the hands of the Mistress of the Night, why not have the subordinates detonate the bomb in advance? Isn’t now the best opportunity?”\u003c/p\u003e\n\u003cp\u003eIt was impossible for the Mistress of the Night to have taken care of three existences of laws without paying a certain price. The opponent would definitely be weakened, so the chances of their success were much higher. Things would grow more unclear once she made a complete recovery.\u003c/p\u003e\n\u003cp\u003e“The Mistress of the Night squandered away a great amount of the world’s accumulated origin force, it’ll be difficult for it to recover soon.” Leylin grasped a wisp of air while revealing a bizarre smile.\u003c/p\u003e\n\u003cp\u003eThe advancement of the Shadow World this time had failed. Its reserves of origin force were insufficient, and the civilisation itself wasn’t prepared either. Shar naturally understood this, so instead of causing it to advance she’d had the place expand. The World Origin Force had yet to condense, and there were numerous other missing factors as well.\u003c/p\u003e\n\u003cp\u003eBecause of all this, the Shadow World had been weakened by nothing. The sacrifices of Massa and Yuri only allowed it to recover slightly.\u003c/p\u003e\n\u003cp\u003eHowever, if Shar had enough time on hand she could lead the Shadow World to recovery, causing it to burgeon with origin force. At that time, the Mistress of the Night would not be so easy to handle.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Blood Nest had changed greatly by the time Crowley and Xavier arrived at the capital. Although the earthquakes hadn’t caused much damage to their core base, a large number of strangers had gathered in the basement’s inner conference hall.\u003c/p\u003e\n\u003cp\u003eAmong these strangers were people dressed in black Chinese gowns, witches with sharp hats, knights clad in armour, and expert martial artists. The ones that attracted Xavier’s attention were the group of people clad in army uniform that occupied the area. Everyone there had an aura of blood and iron that was unique to the armed forces.\u003c/p\u003e\n\u003cp\u003e‘This should be the rebels Clive mentioned before…’ Xavier noticed that several members of the Bloodline Alliance interacted with the rest of the groups, whereas the soldiers waited silently without any communication whatsoever.\u003c/p\u003e\n\u003cp\u003eThe situation in the hall was chaotic, with many people arguing over the changes that occurred a few days ago. Everyone had been frightened by that disaster that seemed able to destroy the world. Project X and the Tree of Life were brought up frequently as well.\u003c/p\u003e\n\u003cp\u003e“Everyone, quiet down!” The arrival of Crowley and Xavier immediately attracted a great deal of attention. The thousands of eyes in the hall caused every pore in the younger one’s body to tense up.\u003c/p\u003e\n\u003cp\u003eAfter all, none of those gathered here were exactly ‘ordinary.’ Any other citizen of the empire, even your average soldier, would’ve collapsed under the immense pressure.\u003c/p\u003e\n\u003cp\u003eBobbi pushed the other members of the Bloodline Alliance aside, her face filled with expectation, “How is it? Did that person agree?”\u003c/p\u003e\n\u003cp\u003e“No, but she didn’t reject us either…” Crowley shook his head. “The ancestor appointed me to act on behalf of her will to overthrow the decadent empire.”\u003c/p\u003e\n\u003cp\u003e“Without their assistance we won’t be able to resist the mastermind behind the empire.” Clive shook his head from within the group of levels. Only the higher-ups of the empire truly understood how terrifying the Mistress of the Night was.\u003c/p\u003e\n\u003cp\u003eWith her support, the imperial family held absolute power. If not for the threat of Project X and the Tree of Life, these soldiers would never have done something so arduous and thankless as rebelling unless their brains had gone haywire.\u003c/p\u003e\n\u003cp\u003e“What age are we in right now? To believe the existence of ancient myths based on some prophecies? Isn’t that ridiculous?” A questioning voice sounded out from the crowd, attracting numerous opinions in favour of the ridicule. Although they all held extraordinary powers themselves, they still had their reservations about ancient myths.\u003c/p\u003e\n\u003cp\u003e“This is a treasure the empire retrieved at the cost of their largest submarine. The Book of Salvation was left behind by the blind prophet Ari, and we managed to decipher the prophecy. As all souls become one, the day of doom approaches. That’s already happened. We need the help of the Snake Dowager!”\u003c/p\u003e\n\u003cp\u003eClive tossed a stone tablet out, translating the words and images upon it.\u003c/p\u003e\n\u003cp\u003e“These mysterious ancient relics have no credibility!” The same voice spoke out.\u003c/p\u003e\n\u003cp\u003e“What about this?”\u003c/p\u003e\n\u003cp\u003e*Hssssss!* A terrifying hiss resounded in the massive hall, and turbulent bloodline energy formed a gigantic chimera made up of over a hundred different snakes, seemingly covered by various grotesque scales.\u003c/p\u003e\n\u003cp\u003e“This bloodline?” Many of the bloodline carriers in the Bloodline Alliance descended from the Snake Dowager. Looking at this scene, they’d immediately knelt down.\u003c/p\u003e\n\u003cp\u003eThey felt the will of their ancestors surround Crowley, his bloodline causing them to swear allegiance by instinct. As the origin of their bloodline, the Snake Dowager could subdue Crowley and the rest with but a wisp of her aura.\u003c/p\u003e\n\u003cp\u003eSuch was the absolute control of a higher bloodline. It afforded more power than any spells of the soul, and it was impossible for the weaker bloodline to break out of their superiors’ grasp unless they managed to extract the source of their bloodline from them. However, Leylin was the only one in history who’d managed to do such a thing.\u003c/p\u003e\n\u003cp\u003e“He’s surpassed the energy limit!\u003c/p\u003e\n\u003cp\u003e“He broke through the rumoured energy limit just like that?” someone else muttered, and everyone changed in complexion. Crowley looked down upon the kneeling bloodline carriers like he was an emperor.\u003c/p\u003e\n\u003cp\u003eThe so called energy limit was propaganda created by the empire. Technology and the Shadow Weave could only do so much, and they hadn’t been able to pass a certain threshold. Because of that, they’d called this threshold the energy limit.\u003c/p\u003e\n\u003cp\u003eThe empire’s strongest energy weapons were only equivalent to a peak rank 6 Magus in power. Nobody had broken through that barrier.\u003c/p\u003e\n\u003cp\u003eAnd yet, Crowley managed to break through that rank with mere borrowed power. His body and spirit had been transformed by the Snake Dowager, increasing his capabilities to the peak of rank 6. With the help of the temporary authority from the Snake Dowager he could use some bloodline power to pass the bottleneck and become a half-step rank 7.\u003c/p\u003e\n\u003cp\u003eAlthough near rank 7 strength still left him having to kneel down in front of other beings of law like Leylin, Crowley was now undoubtedly the strongest person in the empire. He opened a path up with ferocity and violent imposition, instantly finding the fellow who’d been speaking all along.\u003c/p\u003e\n\u003cp\u003e“Do you have any opinions?” Strong winds blew to accompany his kingly demeanor.\u003c/p\u003e\n\u003cp\u003e“No! Not at all!” The person who spoke was a youngster with dyed hair and pierced ears. In the face of the terrifying pressure, he couldn’t even speak properly.\u003c/p\u003e\n\u003cp\u003e*Boom!* The floor shattered, and Crowley’s silhouette instantly appeared in mid-air. The hall overflowed with the arrogant and overbearing aura of the hundred snakes, and the other bloodline carriers felt it difficult to even breath.\u003c/p\u003e\n\u003cp\u003e“I’m the best proof of her existence. Her help allowed me to break through that so-called energy limit, entering a new realm…” Crowley gazed upon everyone from above, “Furthermore, that existence agreed to stop the Mistress of the Night mentioned in the prophecy. Can all of us not even handle the imperial family?“\u003c/p\u003e\n\u003cp\u003eHe roared in a loud voice, “Everyone here is aware of the existence of the two projects. Thus, now it is time for us to make a choice. Die loyal to that empire, or join me… In rebellion!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1097\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1099\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1098","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
