{"id":59657,"no":1101,"title":"Chapter 1101","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eTower\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThree groups merged inside the palace. Xavier looked at a wounded Clive and revealed a smile, “Well done, Mister Clive! We have one last target remaining!”\u003c/p\u003e\n\u003cp\u003e“Mm. Javis told me about the Emperor’s arrangement, and a backdoor to manipulate the robots before he… died…” Clive wasn’t smiling. His expression had a trace of loneliness. “He could’ve killed me, I didn’t expect him to back off so suddenly at the end… He’s so pitiful…”\u003c/p\u003e\n\u003cp\u003e“Everything was caused by the Empire. We’re here to correct that mistake!” Crowley and Bobbi came over, looking resolute.\u003c/p\u003e\n\u003cp\u003e“We don’t have much time! The Tree of Life is over there!” They could already see a white beam rising from within the palace, connecting with the skies to release a shocking glow of light.\u003c/p\u003e\n\u003cp\u003e“Snakebite Fist— Ultimate Snakebite!” Black energy roared forth from Xavier’s fist, the terrifying destructive energy it contained even surpassing laser weapons. The robots blocking their road were sent flying and broke apart in midair.\u003c/p\u003e\n\u003cp\u003e“Mister Leylin… Made me this strong with a few pointers…” Xavier ran inside the palace, the occasional robot blocking him turned into scrap metal. He’d finally understood just how terrifying Leylin was. Just the fact that he could be beside the Snake Dowager was sufficient to show his status.\u003c/p\u003e\n\u003cp\u003e“Hiss… Scram!” Although Xavier’s strength was already shocking, he was quite lacking in comparison to Crowley. That one low roar of his caused a gigantic beast made of a few hundred phantom snakes to surface, black air condensing to turn it real.\u003c/p\u003e\n\u003cp\u003e*Rumble!* *Rumble!* The chimera crushed a wave of robots into pieces, the corrosive liquid coming from the snakes causing the entire palace to collapse…\u003c/p\u003e\n\u003cp\u003e“Hmm?” Breaking open a brilliant and beautiful door, Xavier retreated a few steps in clear intimidation.\u003c/p\u003e\n\u003cp\u003eWhat welcomed him was a dazzling sight in the palace, exquisite dishes filling an entire long table. However, a few youths in royal clothing were lying on the ground, a dark green X visible on their skin.\u003c/p\u003e\n\u003cp\u003eA poised lady was clutching at her chest, sitting upright with a pained smile and an exquisite dagger stabbed into her body. A rose of blood had bloomed upon her clothes.\u003c/p\u003e\n\u003cp\u003e“This is… What’s going on?” Xavier murmured in disbelief.\u003c/p\u003e\n\u003cp\u003e“Just a simple change in the palace…” Bobbi walked in and glanced around, her eyes filled with disdain. However when she saw the few young princes and princesses on the ground, her facial expression finally changed.\u003c/p\u003e\n\u003cp\u003e“The X gene! Even the royal family wasn’t spared? Our old thoughts might be wrong; that existence doesn’t support the royal family, instead just using it as a puppet or plaything!”\u003c/p\u003e\n\u003cp\u003e“Why are you still staring blankly? The whole world is filled with such tragedy right now. We have to find the anti-teleportation array and anti-gravity room quickly. I don’t want to waste time breaking through each room one by one!” Crowley’s roar transmitted from the outside. The entire building was demolished with his ferocious strength as he continued rushing towards the incoming robots.\u003c/p\u003e\n\u003cp\u003e*Bang!* The huge building collapsed under the weight of marble, its pillars bending into an arc before it crashed into the ground. Numerous robots collapsed, but an even denser horde took their place, walking out from all directions like a terrifying flood. The scene numbed the scalps of those present.\u003c/p\u003e\n\u003cp\u003e“Damn it! It looks like the other party has long been prepared…” Xavier bit his teeth, and his body started to shake. A trace of black mist was emitted from his pores, and Bobbi was shocked to discover that her ability to sense him weakened, as if he was disappearing into thin air.\u003c/p\u003e\n\u003cp\u003e“These robots’ scanners are inflexible, I’ll sneak past them.” A resolute expression surfaced on Xavier’s face. Under the control of Snakebite Fist, his blood slowly cooled and he began to restrain his energy fluctuations.\u003c/p\u003e\n\u003cp\u003e”Wait for me, Jill!” Xavier broke through the robots, rushing directly towards that pillar of light.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Such a troublesome little demon,” Crowley said from atop the giant beast, “Don’t tell me I’ll have to use that move…”\u003c/p\u003e\n\u003cp\u003eThe beast started hissing even louder as if sensing his intentions, terrifying energy converging on its body.\u003c/p\u003e\n\u003cp\u003e“The target is the Tree of Life. Great Mistress, please give me strength!” Frightening balls of energy formed with Crowley’s prayers, merging together rapidly and rippling with terrifying power.\u003c/p\u003e\n\u003cp\u003e“Ha! Scram!” The surging balls of energy formed a massive black hole. Be it the robots, the forcefield, or the building itself, everything was devoured by the black hole to reveal a wide, spacious passageway.\u003c/p\u003e\n\u003cp\u003e“Dawn, activate!” A slender mechanical figure descended just then. A terrifying furnace roared as the Shadow Weave stilled around the area. The beam of light that had killed the Metalback Whale appeared once more!\u003c/p\u003e\n\u003cp\u003eExtremely dazzling white light instantly collided with the black hole, their collision distorting the surroundings. A storm of annihilation ensued, instantly destroying most of the palace and inflicting great casualties amongst both the robots and the rebels.\u003c/p\u003e\n\u003cp\u003eA mushroom cloud rushed into the sky, and the Tree of Life held firm and steady. A strange mechanical armour stood in front of Crowley, forming its last line of defence.\u003c/p\u003e\n\u003cp\u003eThe armour was smooth yet slender, its back attached to a skeletal wing and a hooked tail. It looked like an angel revealing its dark side.\u003c/p\u003e\n\u003cp\u003e“Scram, or you’ll end up dead!” An increasingly murderous look appeared in Crowley’s eyes. Regardless of who it was, being interrupted in the moment before success in life would cause one to fly into a rage.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, I can’t that.” A female voice was transmitted from the glowing armour.\u003c/p\u003e\n\u003cp\u003eLing was staring at the screen from within the control room, the man standing on the gigantic beast drawing all her attention.\u003c/p\u003e\n\u003cp\u003e“An attack surpassing the Empire’s energy limit… If I hadn’t taken Dawn from the submarine I’m afraid I wouldn’t have been able to block that attack…” Ling’s face revealed a bitter smile.\u003c/p\u003e\n\u003cp\u003e“Dawn is the pinnacle of the Empire’s technology, built to the limit of our energy. It’s our last trump card, our final defence…” Ling turned and looked at the direction of the Imperial Garden. “Father… This is all I can do for you…”\u003c/p\u003e\n\u003cp\u003e“Attack, kill them all and get rid of the Empire!” Crowley did not stop just because the other party was a girl. Such a thing would be extravagant for the rebel army. In a critical moment of life and death, any who blocked him would only be torn apart!\u003c/p\u003e\n\u003cp\u003e“For the Empire!” Ling shouted, and the radiant armour activated as a light sword with the power to cut through space appeared in its hands. The robot collided with the giant snake.\u003c/p\u003e\n\u003cp\u003e“Old man! The final moment is here…” The shadows flashed, and two old men on the verge of collapse appeared.\u003c/p\u003e\n\u003cp\u003e“Yeah… It’s been a long time since we fought alongside each other, Night Devil…” Sword Saint wiped the handle of his broken iron sword, sighing suddenly.\u003c/p\u003e\n\u003cp\u003e“The last glory of the Empire… shall be protected by us!” Night Devil suddenly roared, he and Sword Saint forming streams of light that rushed towards the rebels with the robot army.\u003c/p\u003e\n\u003cp\u003e“Kill!” Bobbi made eye-contact with the other higher-ups, deciding to fight. Both sides were fighting for their goals and beliefs; there was no possibility of turning back.\u003c/p\u003e\n\u003cp\u003eOutside the Imperial Garden, the rebel army and last resistance of the Empire collided. The overflowing energy scattered and caused a terrifying fluctuation.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Emperor!”\u003c/p\u003e\n\u003cp\u003e“To govern everything!”\u003c/p\u003e\n\u003cp\u003e“God!”\u003c/p\u003e\n\u003cp\u003eEmperor Aragon’s eyes were filled with eagerness as he stepped onto the central metal platform. A flash of light verified him as he moved towards the top of the Tree of Life, towards its crown. The surroundings of the platform were absolutely empty, with but an isolated metal seat present.\u003c/p\u003e\n\u003cp\u003e“The resistance of hundreds of generations, thousands of years of unwillingness… Dear ancestors, please bless and protect me!” A trace of resoluteness appeared on Emperor Aragon’s face, and he took a box out of his bosom. Inside was a pair of shrivelled eyes and some mermaid scales.\u003c/p\u003e\n\u003cp\u003e“Bring it on!” Madness flashed in Aragon’s eyes as he directly swallowed these items, “I am the world!”\u003c/p\u003e\n\u003cp\u003eImmediately after, a horrifying change emerged on his body. Tumours spread out along his body, with scales and humanoid faces on them. Aragon struggled to sit on the metal throne.\u003c/p\u003e\n\u003cp\u003e*Kacha! Kacha!* Many channels opened up around the tower, revealing needles attached to tubes. The tubes seemed to possess their own lives, encircling the Emperor.\u003c/p\u003e\n\u003cp\u003e*Pu! Pu! Pu!* “AAAAHHH!” Soon after, hundreds of thousands of these tiny needles pierced into Aragon’s body, stimulating all his nerves. The pain he felt exceeded the limits of human ability, able to cause a normal person to perish instantly. Even he couldn’t help but release a bestial roar.\u003c/p\u003e\n\u003cp\u003eNumerous tubes wriggled amidst this terrifying roar, seemingly trying to draw something in as Aragon’s body shrunk rapidly. He turned into a near-corpse.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1100\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1102\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1101","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
