{"id":59690,"no":1134,"title":"Chapter 1134","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eDark Clouds\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eWith their calculative nature, a god wouldn’t easily leave their divine kingdom once it was created. The kingdom served as the best of defences for their true bodies. Even if any avatars they sent out were killed they could be made up for with time, but the death of their main bodies would be a true death.\u003c/p\u003e\n\u003cp\u003eNaturally, Leylin had learnt of this method as well, stationing his true body in his divine kingdom as he started on the endless task of developing it and his resources.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe hubbub over Leylin’s ascension died down after a while, but there was still some turbulence in the dark. Pope Tiff of the Giant Serpent Church infiltrated the prime material plane with a group of elite priests, beginning to publicise Leylin’s deeds.\u003c/p\u003e\n\u003cp\u003eTiff was a legendary priest himself, and the ability of the numerous priests to cast spells up to rank 9 symbolised the power of a true god. With such backing, the Giant Serpent Church developed rapidly in the prime material plane.\u003c/p\u003e\n\u003cp\u003eIt started with the southern seas, as a large number of sailors, pirates, and adventurers began to embrace the new God of massacre. From there it spread to the mainland, unimpeded by the Church of Protection that now recognised Leylin’s divinity.\u003c/p\u003e\n\u003cp\u003eThe duty of Helm’s church was to strike against false gods and protect the churches of the true ones. Regardless of their indignation, they could only give up their hostility to Leylin. A god’s domain and duties imposed great limitations on them, and most times even they themselves couldn’t break through those barriers. Violating his own laws would cause Helm’s rank to drop, and he could even lose his position and fall.\u003c/p\u003e\n\u003cp\u003eOf course, the God of Protection not hindering them didn’t mean other gods weren’t either. Tyr decreed that Leylin was a Lord of Baator, stating that it would be his mission to bring down the evil God of Massacre.\u003c/p\u003e\n\u003cp\u003eMystra did the same, and to much greater effect. With the power of the Weave in hand, she had a great amount of influence over wizards that caused the Giant Serpent Church to be unable to obtain any powerful ones. This trend would definitely continue.\u003c/p\u003e\n\u003cp\u003eLuckily, devil hunters had magical abilities themselves, allowing the church to move along for the time being. If any problem did arise, their clerics could still play the role of magicians. Just like how battles between gods were long and protracted, the secular world was the same.\u003c/p\u003e\n\u003cp\u003eUnder their god’s chosen pope, the Giant Serpent Church worked tenaciously to expand in the prime material plane. They fought Mystra and Tyr with wit and courage, the situation likely to remain in a stalemate for a long time unless something big were to happen. On the surface, the prime material plane was gradually calming down.\u003c/p\u003e\n\u003cp\u003eNumerous gods had ascended over the ages, and the appearance of another lesser god only caused the denizens of the World of Gods to be a little surprised. The influence of his ascension was actually rather limited. As well, the upheaval in the north had greatly attracted everyone’s attention.\u003c/p\u003e\n\u003cp\u003eAs the greatest source of faith and souls, the prime material plane had numerous powerful existences eyeing it. Disaster after disaster occurred, and war was never absent from the mainland. Another round of battle had been ushered in after the period of calm.\u003c/p\u003e\n\u003cp\u003eThe war this time was launched by the orc empire. Having spent the winter accumulating resources, they managed to mobilize their troops and materiel as they got ready to rid the world of their nemesis the Silverymoon Alliance.\u003c/p\u003e\n\u003cp\u003eThe Alliance in return rose up in resistance. Headed by Alustriel, they were also actively preparing for war. Rumour had it that they’d even obtained the support of the Old Mage, Elminster.\u003c/p\u003e\n\u003cp\u003eMore importantly, the Goddess of the Weave and the God of Justice had now officially united, Tyr’s backing giving Alustriel the foundation to fight the orcs with. A number of aristocrats who had lost their fiefs banded together as well, giving her reinforcements.\u003c/p\u003e\n\u003cp\u003eMany aristocrats in the north had ended up miserable after the war, being annexed by other nobles. Now, everyone desperately hoped for the Silverymoon Alliance to regain its original territory, taking revenge on the orcs. If Alustriel still couldn’t obtain a decisive victory, the Silverymoon Alliance would likely be buried in the pages of history.\u003c/p\u003e\n\u003cp\u003eThus, with nobles fighting for land, commoners fighting for vengeance, and Alustriel fighting to restore Silverymoon to its glory, the fog of war shrouded the entire prime material plane. With divine strengths being pit against each other in the north, the incident of Leylin’s ascension was further suppressed…\u003c/p\u003e\n\u003cp\u003eThe new Silverymoon was the core of the alliance. With its neat, spacious streets and the magical lights on either side of the road, the place seemed to be just like the one in the past. The old Silverymoon was currently serving as the capital of the orc empire. For Alustriel to construct a replica showed her determination.\u003c/p\u003e\n\u003cp\u003eUnfortunately, the newer city was somewhat smaller and more jammed up due to limiting conditions. Only a few pedestrians were on the street, and the occasional guards and knights could be seen rushing about. Quite a number of shops had closed down, the clouds of war affecting everything.\u003c/p\u003e\n\u003cp\u003e*Clang! Thud!* In this situations, a team of knights dressed in heavy silver armour with the emblem of the God of Justice were currently sealing the entire streets.\u003c/p\u003e\n\u003cp\u003e“Holy Knight, Lady Rafiniya! The troops are ready!” A paladin saluted to Rafiniya. It seemed like her rank in the Church of Justice had risen once more.\u003c/p\u003e\n\u003cp\u003e“Mm,” Rafiniya nodded indifferently, looking at the familiar buildings around her and seemingly recalling her past in Silverymoon.\u003c/p\u003e\n\u003cp\u003e‘It really is similar… Such a pity that we can’t possibly go back in time…’ Rafiniya bitterly lamented in her heart.\u003c/p\u003e\n\u003cp\u003eHer mission had ended in failure, and only afterwards did she learn that she’d only been bait. While she was out on the surface, a real team of elites had been sent out with Elminster to conduct a secret operation.\u003c/p\u003e\n\u003cp\u003eThe lack of trust had caused Rafiniya to feel angry in the depths of her heart. However, she couldn’t do anything about it and it was this arrangement that had allowed her to avoid the deathtrap that was Debanks Island. Elminster’s team had suffered heavy casualties, and he himself had died once. The man had managed to resurrect himself with a clone he’d kept prepared, but it was still basically total annihilation.\u003c/p\u003e\n\u003cp\u003e‘The Giant Serpent Church certainly found out about us then. So they treated us like insects and didn’t pay any attention to us… Isn’t that why we were able to leave?’ Rafiniya was filled with bitterness. When had that back she’d been chasing grow so powerful, and yet become so evil and terrifying as to look upon her as an ant whose existence was to be dismissed?\u003c/p\u003e\n\u003cp\u003eAdding insult to injury, Rafiniya hadn’t been punished upon her return, instead actually rising in standing. She knew this wasn’t due to any merit on her part, just some consideration for the future.\u003c/p\u003e\n\u003cp\u003e“What… What’s happening?” She bit her lip, feeling an intense emotion corrupting her heart.\u003c/p\u003e\n\u003cp\u003eIf Leylin or Tyr were present, they would notice that she was experiencing an extremely unique change. Leylin had deliberately messed with her before, causing the now legendary paladin to slowly question her own faith as she drifted from her original alignment. A glimmer of dark red power developed in Rafiniya’s soul, hiding this from Tyr.\u003c/p\u003e\n\u003cp\u003e“Justice, and faith. My Lord… please forgive my lack of conviction, I will persevere on my path in the future!“ She finally stabilised her soul after a long period of struggle, “Announce it to every businessman and shop owner. Do it perfectly, these are orders from the church!”\u003c/p\u003e\n\u003cp\u003eSeveral paladins took her orders, rudely knocking on tightly shut doors to display notices stamped with Silverymoon’s crest to every shop owner. The faces of the merchants turned pale, sweat covering their fat and greasy foreheads.\u003c/p\u003e\n\u003cp\u003e“The Queen of Silverymoon has ordered thus— For the sake of life and war preparations of the citizens, all stores are to continue operating as per usual. Prices shall not exceed twice their original value, and an overseeing group under the Holy Knight has been formed. This order was issued on…”\u003c/p\u003e\n\u003cp\u003eThe paladins smacked the store owners’ faces with the notices, ignoring any entreaties as they continued their operations. They held no favour for these greedy merchants, seeing them as synonymous with greed and evil.\u003c/p\u003e\n\u003cp\u003eThese men hoarded supplies in the lead up to war, dropping supply in the market and profiting from their actions. Basically every merchant had blood on his hands, and if the alignments of those here were to be tested likely more than half of them would face immediate death. To tolerate their existence and a doubling of the price was already great grace!\u003c/p\u003e\n\u003cp\u003eBecause of all this the paladins could be said to be behaving roughly, the disgust evident in their eyes. Numerous anguished wails sounded out in New Silverymoon.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1133\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1135\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1134","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
