{"id":59709,"no":1153,"title":"Chapter 1153","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eHeart\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eMystra and Shar had never been on good terms. They were both gods of magic, and the natural rivalry between the two had ensured that only one could survive.\u003c/p\u003e\n\u003cp\u003eShar had been thought fallen in the Final War, but she’d actually managed to escape the destruction of her divine kingdom with serious injuries. Some amount of luck had allowed her to flee to the astral plane, stumbling upon the Shadow World.\u003c/p\u003e\n\u003cp\u003eMystra, on the other hand, had established the Weave to gain the support of worshippers and other gods. She’d become the guardian of the Weave, and the other gods had moved the channeling of their powers to complement the system.\u003c/p\u003e\n\u003cp\u003eEven having become a greater god Mystra was still cautious of the Goddess of Shadows. After all, Shar was the one god that could take over her position.\u003c/p\u003e\n\u003cp\u003eThe Shadow Weave was a counter to the Weave, and it had allowed Leylin to deal with Mystra’s silverflame and escape with ease. Since it was but one of his many trump cards, Leylin hadn’t been afraid of revealing it.\u003c/p\u003e\n\u003cp\u003e“Kukulkan… Shar…” It was like a bridge had been connected in Mystra’s mind, ‘That fear of death, was it because of Shar? Kukulkan managed to find some clues about her, so it gave me the feeling that he would bring about my demise?’\u003c/p\u003e\n\u003cp\u003eAlthough this conclusion was only logical, Mystra had underestimated the situation. She didn’t even realise that Leylin possessed another horrifying ace up his sleeve, once that could truly end her life.\u003c/p\u003e\n\u003cp\u003e“It’s not a big deal that the God of Massacre escaped,” Tyr reminded her, “The important thing now is to kill all these avatars. Our true bodies are already engaged in battle with Gruumsh…” Gruumsh was fighting crazily ever since he discovered that his pantheon had been ambushed. Their true bodies would not be able to hold him back much longer.\u003c/p\u003e\n\u003cp\u003e“I understand…” Mystra’s face darkened, and the silverflame strengthened once more. Even without Leylin’s domain pressuring them, the orc gods couldn’t dare to act recklessly.\u003c/p\u003e\n\u003cp\u003eThe silverflame net began to close in on them, and try as they may Ilneval and the others couldn’t stop Tyr’s ambush with Eicher’s Thorn. Shargaas was the one unfortunate enough to be struck by it, killing the avatar and inflicting serious injuries on his main body. Only then did the silverflame crush all the other avatars to death.\u003c/p\u003e\n\u003cp\u003e“Mystra!” “Tyr!” Many roars of hatred rang out from the large wasteland that was the combined divine kingdom of the orc pantheon, causing many worshippers and even petitioners to cower in fear.\u003c/p\u003e\n\u003cp\u003eNo voice came from Shargaas’ divine kingdom. Having suffered the most damage, he’d directly been put to sleep. As for Ilneval and Yurtrus, they were a bit better off. However, they’d lost multiple avatars as well, and wouldn’t dare act recklessly anymore.\u003c/p\u003e\n\u003cp\u003e*Woooo!* A mournful and immense bugle horn note sounded in the wasteland as two orc figures wreathed in golden light appeared in mid-air.\u003c/p\u003e\n\u003cp\u003e“Gruumsh is summoning us,” The male frowned, “Mystra and Tyr declared war, and summoned their subordinates as well. But right now…” This god was Bahgtru, the Lesser God of Brute Strength.\u003c/p\u003e\n\u003cp\u003eThe orc pantheon was rather special. Although Gruumsh was their only greater god, and the rest of them weren’t even intermediate gods, many of them excelled in combat. However, Shargaas, Ilneval, and Yurtrus were amongst the fighters, and Bahgtru alone wasn’t enough to fill their shoes.\u003c/p\u003e\n\u003cp\u003e“Do you have any plans?” he asked the woman beside him helplessly. Although his mother didn’t excel in fighting as the Goddess of Fertility, she had other remarkable abilities that fell under her domain.\u003c/p\u003e\n\u003cp\u003e“Shargaas was injured by Eicher’s Thorn. Even if life and healing come under my domain, his true body has entered a slumber now and I can’t heal him. On the other hand, Yurtrus only lost a lot of his energy. I can aid him in a swift recovery…” Luthic was extremely solemn, “But I’m not sure we’ve given this opportunity to recover…”\u003c/p\u003e\n\u003cp\u003e*Wooooo!* Another horn sounded, this one more drawn out and more frantic than before. The sound seemed to be filled with restlessness as it spread across the plains.\u003c/p\u003e\n\u003cp\u003e“Indeed, we won’t have the time to heal him. We can only stop them for now…” Bahgtru smiled wryly, “I’ll send all of my avatars over. I’ll leave managing my worshippers and petitioners to you…”\u003c/p\u003e\n\u003cp\u003eSeveral golden streaks flew out of Bahgtru’s divine kingdom, joining the large army in the prime material plane…\u003c/p\u003e\n\u003cp\u003eMystra and Tyr had been plotting to attack the orcs for a while. Leylin’s push had finally let them deal severe damage to the orc pantheon, and they’d even managed to cripple one of their gods. If they didn’t press the advantage now, what were they waiting for?\u003c/p\u003e\n\u003cp\u003eWar sprung up on both fronts. The Silverymoon Alliance attacked even as a war raged in the upper planes. Several subordinate gods like Azuth joined with hired hands from the good alignment to wage war on the divine kingdoms of the orcs. This was their chance to teach the orcs an unforgettable lesson!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWithin the Moonwood.\u003c/p\u003e\n\u003cp\u003eThe battle between gods and those of legendary might had already ruined half the region. The forest of twisted dark trees had ceased to exist, replaced by a sea of burning flames. The dismembered bodies of werecreatures dotted the landscape.\u003c/p\u003e\n\u003cp\u003eThe legendary battle was now drawing to a close. With Malar’s avatar dying so quickly, the werecreatures hadn’t been useful in the battle between gods. Now, they were facing the paladins. The leaders and shamans hadn’t wanted to engage in a fight to the death, and they’d used Gara’s demon army as a distraction as they fled.\u003c/p\u003e\n\u003cp\u003eEven if Shaman Gara had maniacally summoned an army of demons, the relentless attacks of the paladins had reduced their numbers until only the balor was left, fighting Rafiniya. The other paladins had joined Karal to chase down the fleeing werecreatures.\u003c/p\u003e\n\u003cp\u003e“Hehehe…” Even if it wasn’t a flame balor, the balor Rafiniya was facing was already at the legendary realm. It peppered her with heretical spells as its greatsword struck towards her with speed and precision. A common legendary would not be its match.\u003c/p\u003e\n\u003cp\u003eHowever, this balor was up against a paladin. On top of that this was Rafiniya, the Holy Knight, the Lady of Hope! She was resolute in her attacks, and even as injuries covered her body she didn’t take one step back. Her manic behaviour struck fear in even the demon’s heart.\u003c/p\u003e\n\u003cp\u003eRafiniya’s armour had already been shattered, and the balor’s sword had broken in half. The demon had also lost its whip in the midst of battle.\u003c/p\u003e\n\u003cp\u003e“Hehehe… We shall meet again, paladin!” the balor sniggered as he opened a portal. Even if he could still utter such words of pride, he was far too injured to act arrogant. Even though demons were chaotic, instinctual creatures, powerful ones like this balor still had some amount of intellect.\u003c/p\u003e\n\u003cp\u003eThe paladin was nearly burnt out as well. She had to rely on her sword to stay up, putting her weight on it to keep herself from collapsing. However, her eyes lit up as she saw the demon about to leave. The light was peculiar, difficult to describe in words. It contained law and chaos, good and evil.\u003c/p\u003e\n\u003cp\u003e“For justice!” she howled, burning up the last of her energy as she leapt into the flames. Even at the cost of letting the abyssal flames encroach upon her, she thrust her sword into the balor’s heart.\u003c/p\u003e\n\u003cp\u003e“You!” the balor collapsed halfway into the portal, terrified. However, a sardonic smile then appeared on his face, “HA, now I understand! Your power isn’t of purity. It’s the power of our rivals, the devils! In that case…”\u003c/p\u003e\n\u003cp\u003eThe demon used all his strength to push Rafiniya away, using a stump of a right hand to dig into his heart.\u003c/p\u003e\n\u003cp\u003e“Hehehe… Here, take my Root of Evil!” A burning heart was suddenly thrown at Rafiniya, and having expended all her energy the paladin just couldn’t block it. Filthy blood coated Rafiniya’s entire body, and a pure power of evil was immediately absorbed by it.\u003c/p\u003e\n\u003cp\u003e“What’s happening? Why can I absorb this energy?” Rafiniya stood up once she discovered her body was recovering, stupefied. However, the balor had been burnt to ashes, and nobody would be able to answer her question.\u003c/p\u003e\n\u003cp\u003e“The church. The mission. And support…” Rafiniya’s face was blank for a long while, before she collapsed to the ground.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1152\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1154\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1153","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
