{"id":59729,"no":1173,"title":"Chapter 1173","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eStrategy\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Something’s brewing in the prime material plane…” The clone returned to the church just as Leylin arrived at Malbolge.\u003c/p\u003e\n\u003cp\u003eHe looked at the tilted floor beneath his feet. The Sixth Hell was a boundless slope, a plane of constant landslides as the fortresses built on these slanted lands shifted constantly.\u003c/p\u003e\n\u003cp\u003eThe plane was blotted out, swarming with devil hunters that had chased the devils out of this layer. Sadly, they couldn’t find Glasya. The cunning and beautiful Queen of Lust had been incredibly decisive, abandoning her dignity as an Archdevil to give Malbolge up to Leylin. She’d escaped to the lower hells.\u003c/p\u003e\n\u003cp\u003e“Devils without a leader are a giant without a head or a beehive without a queen. They’re a complete mess…” Leylin didn’t encounter the slightest of troubles in taking Malbolge over, but there wasn’t any excitement on his face. His brows were instead furrowed, a trace of gloom in his expression.\u003c/p\u003e\n\u003cp\u003e“This should have been the best point to block me… My powers would only increase the more layers I conquered, and their powers would weaken…” Leylin smelt an obvious conspiracy from the retreat of his opponents.\u003c/p\u003e\n\u003cp\u003eHe wasn’t afraid of a combined resistance. He was only scared they’d abandon Baator entirely to hide themselves within the void. That would be troublesome.\u003c/p\u003e\n\u003cp\u003eOf course, this was not an easy task. Without control of their layers they’d be abandoned by Baator’s origin force, the more serious cases losing their authority in Baator and falling from the realm of laws.\u003c/p\u003e\n\u003cp\u003eAs long as there was even a glimmer of hope, the Lords of Baator wouldn’t choose to do this. Glasya’s decision to flee made Leylin sense something strange.\u003c/p\u003e\n\u003cp\u003e‘I can’t keep going like this, something big will happen. Distorted Shadow is still keeping an eye on me…’ Leylin looked at the occupied land of the Sixth Hell, and suddenly smiled. ‘I’ll still accept gifts on my doorstep, though…’\u003c/p\u003e\n\u003cp\u003e*Bang!* A layer of golden light suddenly spread out from Leylin’s divine kingdom, shrouding the entirety of Malbolge. Golden light filled the entire sky, and under the prayers of the devil hunters endless laws began to merge and transform the Sixth Hell.\u003c/p\u003e\n\u003cp\u003eThe rolling earth rumbled as the divine light flattened it out. The landslides lost all momentum, dying into the ground. The Sixth Hell fused with Leylin’s divine kingdom, radiating endless divine light. The last three layers seemed small and frail under this radiance, seemingly overwhelmed by it.\u003c/p\u003e\n\u003cp\u003e….\u003c/p\u003e\n\u003cp\u003e*Hurl!* Just as Malbolge was fused into Leylin’s divine kingdom, the beautiful Queen of Lust screamed within Nessus. She spat out large mouthfuls of filthy black blood that dissipated into the air, faintly transforming into grotesque life forms before returning to normal as a frightening pool formed on the ground.\u003c/p\u003e\n\u003cp\u003e“He… devoured… all of Malbolge…” Glasya looked unsightly as she lost her territory, as she became an Archdevil with an empty title.Glasya’s facial expression was unsightly as after losing her own territory, she as an Archdevil was only left with a empty title.\u003c/p\u003e\n\u003cp\u003eThat wasn’t the worst of it. Having lost the World Origin Force, she felt her own powers regressing without end as she almost fell out of the realm of laws.\u003c/p\u003e\n\u003cp\u003e*Crash!* Right at that moment, Malsheem suddenly exploded within the canyon. An all-powerful hand reached out of it, crushing millions of devils living within and sending flesh and blood flying everywhere. Distorted screams sounded out as the souls were fused into a dazzling black lightning that entered Glasya’s back.\u003c/p\u003e\n\u003cp\u003e*Zzzt!* A layer of frightening scales emerged on Glasya’s body, endless black wings extending from her back. The screams of the killed devils seemed to be captured within. Glasya continued screaming as her energy stabilised. She’d avoided the fall.\u003c/p\u003e\n\u003cp\u003e“I’ve failed, father.” Glasya looked like a black bat now, standing on the huge pal as she looked at the silhouette of an old devil.\u003c/p\u003e\n\u003cp\u003e“You did not fail, my daughter…” There wasn’t the slightest change within Asmodeus’ black eyes as he looked at the large contract in his hands. The mysterious Supreme of Baator closed the giant parchment in his hands after a long time, a smile on his face.\u003c/p\u003e\n\u003cp\u003e“Your survival is the greatest victory. With the Magi invading at the Second Dusk nigh, opportunities are aplenty. Our current job is to prepare to seize as much as we can in the future, retaining our strength as we wait for future chances…”\u003c/p\u003e\n\u003cp\u003e“Perhaps…” Glasya could faintly understand Asmodeus’ thoughts. The Lord of Nessus had always remained in human form, hiding behind the scenes. He’d finally revealed some of his ambitions.\u003c/p\u003e\n\u003cp\u003e“Are you thinking of becoming a god?” Glasya’s voice was trembling. If he wanted to become a god while already being an Archdevil, he definitely didn’t just aim to become a lesser god! His final objective was undoubtedly to become the ruler of devils, the God of Baator who truly controlled the Nine Hells! That would put him at the peak of gods.\u003c/p\u003e\n\u003cp\u003eThere was one other contender for that position right now. It was the God of Massacre who’d occupied six layers of his world, the Lord of Original Sin Leylin Farlier!\u003c/p\u003e\n\u003cp\u003e“The God of Massacre’s true body is that of a Magus. He’s bound to be attacked by the gods because of the destruction of the Weave— Tyr, Kelemvor, and Lathander won’t let that go. We only have to wait…”\u003c/p\u003e\n\u003cp\u003e“But…” There was obvious hesitation on Glasya face. She didn’t believe they had the time to wait for Leylin to be attacked. He’d be here soon to kill them!\u003c/p\u003e\n\u003cp\u003e“Nessus is different from the other eight layers of hell. This is the deepest layer of Baator, the ultimate land of evil. I’ve made preparations…” Resolution surfaced on Asmodeus’ face, “With my true body’s power and three Archdevils, we’ll separate the plane and seal it for a few thousand years…”\u003c/p\u003e\n\u003cp\u003e“Seal all of it?” That moment of shock exceeded all the surprises Glasya had ever felt put together. If they sealed themselves they wouldn’t receive any more fallen souls. They’d gradually be forgotten by the world, and they’d have to pay a huge price in order to separate in the first place.\u003c/p\u003e\n\u003cp\u003e“Keke… Don’t worry, my daughter. I’ve long accumulated enough souls in Nessus to last us that length of time. On top of that, we’ll be obstructing Kukulkan as well…”\u003c/p\u003e\n\u003cp\u003eAsmodeus let loose a sinister smile, deceit and intelligence reflected from his eyes, “He needs to unify all of Baator to become a greater god. Once Nessus separates itself, he’ll be dealt a terrifying setback. Furthermore, the defensive power of a separate Nessus alongside three Archdevils will be no less than a greater god’s divine kingdom…\u003c/p\u003e\n\u003cp\u003e“Once he loses the most important part, his plans to advance rapidly will definitely fall through. He’ll fall under the attack of the gods!” Asmodeus was sure about this.\u003c/p\u003e\n\u003cp\u003e“The only way for him to survive is to unify Baator and kill us?” Glasya looked at Asmodeus, feeling like his words were extremely foreign to her. “Why are you so sure about the matters of Magi?”\u003c/p\u003e\n\u003cp\u003e“Let me answer that question.” The shadows atop the huge hand distorted, causing Glasya to reveal a look of fear. She hadn’t sensed the fluctuations of power from the other party’s body, and they’d easily approached her… This was an unbelievable thing for a rank 7 Archdevil!\u003c/p\u003e\n\u003cp\u003e“Magus!” Glasya screamed. Distorted Shadow hadn’t hid his aura when he revealed himself.\u003c/p\u003e\n\u003cp\u003e“Keke… We’re currently allies, and we have a common enemy,” he sneered. He then looked towards Asmodeus, “I’ve convinced Baalzebul and Mephistopheles. They’ve agreed to our plans and are willing to use their layers to delay Leylin’s progress, allowing us to complete the separation. Of course, you need to guarantee assistance in regaining their powers and that you won’t harm them.”\u003c/p\u003e\n\u003cp\u003e“Not a problem!” Asmodeus guaranteed, “I’m a devil. I shall honour my pact!”\u003c/p\u003e\n\u003cp\u003e““Let’s hope so!”” two voices said in unison. The silhouettes of Baalzebul and Mephistopheles emerged in mid-air, one a disgusting worm and the other a flaming humanoid with devil wings and horns.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1172\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1174\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1173","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
