{"id":59736,"no":1180,"title":"Chapter 1180","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eMigration\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eDoron raised his head, looking at the murky dark skies. Crows were circling above his head, an omen of death.\u003c/p\u003e\n\u003cp\u003eA powerful plague had swept across their town once Old Holdman passed away. Some said it was a curse cast by the resentful wizard just before he died. No matter how much Doron was unwilling to believe it, it was true that the plague had caused many deaths. Even his best friend Mitch had fallen, and he was only saved from the brink of death due to Priest Rockefeller returning.\u003c/p\u003e\n\u003cp\u003e“Thank you, Lord Ilmater, for allowing Priest Rockefeller to return, and remove this curse from me…” he prayed piously.\u003c/p\u003e\n\u003cp\u003eIf not for the village priest returning, he would’ve had to report to the underworld. He believed this had to be decreed by the Lord! If not for him, why would Priest Rockefeller to return to them and cleanse them of the plague for free?\u003c/p\u003e\n\u003cp\u003eHowever, he was extremely regretful that he had to leave this place of birth, his home.\u003c/p\u003e\n\u003cp\u003e“Listen, in the name of the churches… Everybody of Blackwood Village has to move to the county town and wait for further commands…” A knight ordered.\u003c/p\u003e\n\u003cp\u003eDoron looked around his cart. There were a few scattered villagers around, each carrying heavy bags like ants coming together.\u003c/p\u003e\n\u003cp\u003eThis was the decree of the Lord, and the reason Priest Rockefeller had returned. All of Ilmater’s worshippers were to be moved to the county town, an order that made Doron feel like the feudal lord had gone crazy when he first heard it. Were there enough homes there for them to live in?\u003c/p\u003e\n\u003cp\u003eRockefeller had promised them that there were. As the plans for migration began, the members of the cities were given priority before the villagers.\u003c/p\u003e\n\u003cp\u003e“Wuu… My Lord, look at the wheat here first… They’ve grown so well… Let Old York reap them before leaving…” A farmer was carried out of the fields by a knight. He was holding onto the knight’s thighs, begging him to be allowed to stay.\u003c/p\u003e\n\u003cp\u003e“No means no, do you want to disobey the Lord\u0027s order?” The armoured knight kicked the farmer away in annoyance.\u003c/p\u003e\n\u003cp\u003eTruth be told even the knight found the lord’s orders odd. After all, his own manor and lands were located here as well. However, this had been decreed by both the church and the state, and they’d promised to compensate him for his losses. If not for that, he would not have complied.\u003c/p\u003e\n\u003cp\u003e‘I should be given at least twice the lands I have now!’ he thought with resolution. He grew louder and more violent with the villagers, scolding or even whipping them if he was unhappy.\u003c/p\u003e\n\u003cp\u003e“One by one, be inspected by the priest…” The end of the village road was swamped with carts containing the young, the old, and the disabled. Rockefeller had brought a batch of new priests and acolytes along, standing by the road and inspecting the health of every villager with a fever or bloody cough.\u003c/p\u003e\n\u003cp\u003eThose who had been diagnosed or suspected to have the plague were quarantined, and the people who passed were reportedly handed medicine that was said to repel any plagues.\u003c/p\u003e\n\u003cp\u003eThe fear of the deadly plague was strong enough reason for the villagers to migrate. If some still wanted to stay of their own free will after all these rounds of intervention, the lords and the priests wouldn’t bother with them anymore.\u003c/p\u003e\n\u003cp\u003e“The numbers are here, Father. Over a thousand out of the 4382 villagers have died, and the final number of those willing to migrate is 2900.” An acolyte brought a parchment with a report on it to Rockefeller. He had round glasses on his face that seemed somewhat comical, but his report was given solemnly.\u003c/p\u003e\n\u003cp\u003e“Almost three thousand worshippers huh? Very well, continue!” Rockefeller nodded his head in appreciation. He looked at the snaking queue, making up his mind, ‘These worshippers of our Lord must definitely be moved to a safe place!’\u003c/p\u003e\n\u003cp\u003eAfter the discussion in the Celestial Hall, the gods had all made it a priority for their churches to move their worshippers into their divine kingdoms. Separating the worshippers by god and moving them proved to be an extremely complicated process, troubling even the almighty gods themselves. Such big movements couldn’t ever be completed without several hundred years.\u003c/p\u003e\n\u003cp\u003eThe Magi wouldn’t give them such time. Plague after plague struck the prime material plane, ravaging the lands and killing countless lives. Several rounds of discussion later, the gods had just decided to demarcate areas and move everyone within.\u003c/p\u003e\n\u003cp\u003eTowns like Blackwood Village with only one god were easy to move, which is why they were the first to be moved. Rockefeller had been sent back to the village to perform this task.\u003c/p\u003e\n\u003cp\u003e“Why, Priest Rockefeller, why… I am devoted to the Lord, but my son and daughter were taken from me… Why?” An old man in ragged clothing appeared at this instant, kneeling before Rockefeller as he cried.\u003c/p\u003e\n\u003cp\u003e“How dare you!” The priests and acolytes of the church grew furious. Saying such a thing in the open was blasphemy!\u003c/p\u003e\n\u003cp\u003e“Have faith… The almighty god of suffering wants us to push through this turbulent times…” Rockefeller waved the soldiers away, personally bringing the man to his feet, “Appropriate measures of agony are needed… Our Lord is kind and benevolent, he will forgive this small mistake of yours…”\u003c/p\u003e\n\u003cp\u003eRockefeller was a complete priest, and held the highest position here. His word was law.\u003c/p\u003e\n\u003cp\u003e“Oh… God, I have sinned…” The white-haired old man weeped even louder than before, causing Doron to feel sorry for him from the side.\u003c/p\u003e\n\u003cp\u003eThat small crooked body reminded him of something he’d tried to forget. He shook his head and managed to push his cart forward. Just then, Rockefeller’s voice entered his ears.\u003c/p\u003e\n\u003cp\u003e“This tribulation is not something that the gods gave mankind. It is instead the beginning of the end.”\u003c/p\u003e\n\u003cp\u003e“The end?” Doron was startled, and he halted unconsciously.\u003c/p\u003e\n\u003cp\u003e“Plague, war, famine, death… These are things long recorded in the prophecies of the church…” Light glowed from Rockefeller’s face, causing him to look even more holy than before.\u003c/p\u003e\n\u003cp\u003e“The end of the world is fast approaching, and evils of foreign worlds have infiltrated our lands. Only the most pious of worshippers will receive salvation, obtaining eternal life in the divine kingdoms of the gods…”\u003c/p\u003e\n\u003cp\u003eRockefeller’s proclamation of the end of the world had been prepared by the church after a long period of work. The scenario it described frightened Doron out of his wits.\u003c/p\u003e\n\u003cp\u003eSo the plague that they had experience was not the end, but just the beginning. Under such an influence of the proclamation, coupled with the threat of the plague and death, even the free spirits now obeyed orders and hurried along to the county town.\u003c/p\u003e\n\u003cp\u003eRockefeller’s proclamation continued, “These evils will infiltrate our earth and plunder everything we have. Life, flesh, and souls… These perpetrators of the end, these reapers of death… They are called Magi!”\u003c/p\u003e\n\u003cp\u003eAfter many millennia, the taboo of the Magi finally began to circulate around the World of Gods once more. The Second Dusk was fast approaching!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eBlack County Castle was only a day and a half of a horse ride from Blackwood Village. It was where Mitch had worked as a servant to Mystra’s church, a place Doron had visited once before in his life. When he saw the tall limestone walls, Doron heaved a sigh of relief. He had never expected that this journey would feel this long.\u003c/p\u003e\n\u003cp\u003eHe looked around apprehensively, noticing the tired and weary villagers. Some of them were even injured, and the group looked like refugees from a disaster.\u003c/p\u003e\n\u003cp\u003eThis poorly formed procession of villagers would never cover much in a day of travel. Even Doron himself had tossed away many of his belongings. With the mess of this migration, many bandit groups had tried to rob them along the way. There were too few guards and priests to protect them completely.\u003c/p\u003e\n\u003cp\u003eA bandit had even charged up to Doron himself once, something the carpenter never wanted to experience again in his life.\u003c/p\u003e\n\u003cp\u003e“We can move to the divine kingdom of the Lord now that we’re here, obtaining eternal life?” Doron’s resolution had only lasted this far because of Rockefeller’s constant boasting about the divine kingdom. However, very soon he discovered that he had been thinking too much.\u003c/p\u003e\n\u003cp\u003e*Bang! Bang! Bang!* There were large groups of troops around the city walls, all carrying spears that put great pressure on the villagers.\u003c/p\u003e\n\u003cp\u003e“Listen up! There’s too many people coming over, so there will be a queue. Nobles will have priority, before villagers with an identity. As for the rest, wait outside the walls…” Many knights were shouting orders from horseback as they moved around the group.\u003c/p\u003e\n\u003cp\u003eThere were simply far too many tents outside the city right now, making it seem like a massive refugee camp. Priests could be seen from time to time, casting spells or passing medicine on. Temporary church buildings glowed with a golden light, protecting the area around the city.\u003c/p\u003e\n\u003cp\u003eThe churches protected the people from the plagues. If not for them, with the weak immunity of these refugees and the large numbers of people, the plague would reap all of them and ruin the gods’ plans.\u003c/p\u003e\n\u003cp\u003e“Alright then… Nobles first…” The carriage of the lord slowly entered the city, as Doron watched on outside. He didn’t know why, but the fires in his heart blazed even stronger.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1179\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1181\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1180","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
