{"id":59742,"no":1186,"title":"Chapter 1186","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eSpells\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe former queen of Silverymoon had become the lord protecting the human fortresses of the north. The last hope of the human race looked down on the army beneath her, a bitter smile hidden beneath her glory.\u003c/p\u003e\n\u003cp\u003eBeing Mystra’s blood daughter, Alustriel had once felt like the sky was going to fall when Mystra died. Even though she was a powerful legendary wizard with a trace of divinity in her blood, she knew full well that leading the humans of the north without her mother’s support would be extremely difficult. The Orc Empire was looming right over their heads…\u003c/p\u003e\n\u003cp\u003eOn top of that, the Silverymoon Alliance was a union of magic, led mainly by wizards. The loss of the Weave absolutely shattered their unity.\u003c/p\u003e\n\u003cp\u003eFortunately, the orcs had come to an agreement with them due to the invasion of the Magi. They didn’t send troops to wipe the alliance out.\u003c/p\u003e\n\u003cp\u003eHowever, the situation had turned worse after a few days. The horrifying plagues had swept their lands, and the Dark Ages had come knocking on the door.\u003c/p\u003e\n\u003cp\u003eAlustriel herself was a lucky soul. Her peak legendary power allowed her to cast spells independently of the Weave, so despite stumbling along the way like a child at first she managed to gain the ability to protect herself. Wizards under rank 20 were like unborn fetuses, unable to survive being without the Weave, but legendary wizards were at least newborn infants at this moment, able to tide through the destruction of the Weave.\u003c/p\u003e\n\u003cp\u003eOn top of all this, the trace of divinity she’d inherited from the Goddess of the Weave allowed Alustriel a chance to succeed her mother as the Goddess of the Weave. The gods assisted to secure the regime of the Silverymoon Alliance, albeit barely.\u003c/p\u003e\n\u003cp\u003eStill, she had to abandon a majority of her lands and build this final fortress, holing up against the catastrophic attacks of the insects. If the orcs weren’t considered, the survivors in this camp were the last lifeblood of the north.\u003c/p\u003e\n\u003cp\u003e‘Am I doing the right thing?’ Alustriel was a queen in an era of peace. Even in such critical moments, she was wracked with indecision.\u003c/p\u003e\n\u003cp\u003e“I have updates from the south, my Queen!” Old Mage Elminster stepped through a portal at that moment, dressed in a simple flax robe as he stood behind her like a humble follower bowing to her words.\u003c/p\u003e\n\u003cp\u003e“I’ve just obtained confirmation that a nest of the bugs popped up about a hundred miles south of us. The Gloomwood has been corroded by marshland…”\u003c/p\u003e\n\u003cp\u003eAlustriel’s heart skipped a beat. This was definitely the worst news for this camp! She’d come to learn that the tide of bugs originated from the massive colonies of hives. The appearance of a nest in an area spelled its death, an endless wave of insects engulfing the entire land and turning it barren.\u003c/p\u003e\n\u003cp\u003e“Damn it… We put so much effort into making this place arable… We’ve already cleared the lands… Just one harvest…” She lowered her voice, “It’s too late to move again. It took all we had to build this fortress. Even if we wanted to, the bugs are everywhere now. Where can we go?”\u003c/p\u003e\n\u003cp\u003eLooking at Alustriel’s mournful smile, Elminster’s heart was filled with bitterness.\u003c/p\u003e\n\u003cp\u003e“How are the wizards doing?” She seemed to make up her mind about something after a long time.\u003c/p\u003e\n\u003cp\u003e“Still training. Even the best of them can only use rank 4 spells, and this was someone at rank 20 before the catastrophe, just a step away from becoming legendary…” Elminster heaved a sigh.\u003c/p\u003e\n\u003cp\u003eThey’d had to return to their roots since the collapse of the Weave, using the elemental particles of the world to gather energy from their spiritual force and cast spells. Thankfully wizards had always been performing research on the arcanists, and finding training methods in the field wasn’t a big problem.\u003c/p\u003e\n\u003cp\u003eThey’d set up everything pretty soon given Silverymoon’s accumulated information and their talents. Even the gods couldn’t resist using the arcanist inheritances in this situation. The churches didn’t abolish the prohibition openly because that would tarnish the gods’ dignity, but the research was no secret.\u003c/p\u003e\n\u003cp\u003eSadly, the ‘talented’ wizards all turned inferior when it came to the arcanist inheritance. The convenience the Weave had afforded them had caused a drop in their quality. Only with it destroyed did many wizards begin to realise how incapable they were. With their rigid lines of thought, some older wizards didn’t even acknowledge the possibility of changing their path. They were having suicidal thoughts.\u003c/p\u003e\n\u003cp\u003eIn spite of Alustriel’s unconditional support and Silverymoon’s rich supplies, the best they could do right now was still a rank 4 spell. Detached from the Weave, the wizards now realised how hard spells were to control, demanding more ability and finesse. Many died trying to cast the new spells.\u003c/p\u003e\n\u003cp\u003e“Leave the last batch behind, but get all the rest.” It took a long while for her to make this tough decision, and a teardrop rolled down Alustriel’s cheek. She arrived above the army, waving them to silence.\u003c/p\u003e\n\u003cp\u003e“These bugs have taken our everything, and now they’re coming for our lives.” Her voice echoed throughout the region, “A vicious colony has popped up close to us, less than a hundred miles away. We’re out of supplies and fortification scrolls, and we won’t be able to built another city…\u003c/p\u003e\n\u003cp\u003e“Tell me, then. ARE WE GOING TO KEEP SILENT IN THE FACE OF THIS THREAT?”\u003c/p\u003e\n\u003cp\u003eDoron held tightly onto the weapon in his hands, as if that was the only way he could get a sense of security.\u003c/p\u003e\n\u003cp\u003e‘So we’re actually in such dangerous situation?’ A silent thought of fiery anger surfaced in his mind.\u003c/p\u003e\n\u003cp\u003e“No! I belong to this place, I will never leave!” Jimmy started hitting his shield with his axe.\u003c/p\u003e\n\u003cp\u003e“NEVER! WE WILL NEVER LEAVE!” A fearsome growl shook the entire fort.\u003c/p\u003e\n\u003cp\u003e“Great! I shall accompany you all on this crusade, let us fight for our survival!” Alustriel promised.\u003c/p\u003e\n\u003cp\u003e“”FOR SURVIVAL!”” The army set off in swift fury.\u003c/p\u003e\n\u003cp\u003eAlustriel kept to her promise, leading the troop from the front on her white horse. Her divinity had allowed her to maintain her power through the collapse of the Weave, so the presence of such a powerful leader definitely lifted the spirits of the army.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Our team will be in charge of the patrol today.” The army winded along on its way forward. Unlike a regular troop, Doron’s team was a little disorganised. They weren’t in high spirits regardless of Jimmy’s encouragement.\u003c/p\u003e\n\u003cp\u003eThe city was their last hope. If this hope was broken, even Doron would lose the courage to survive in this chaotic world.\u003c/p\u003e\n\u003cp\u003e“Come with me, Doron. Let’s go on patrol!” Jimmy waved his axe, unable to withstand the atmosphere.\u003c/p\u003e\n\u003cp\u003e“Alright.” Doron didn’t like the stifling aura here either, so he quickly stood up when Jimmy called him.\u003c/p\u003e\n\u003cp\u003eShrouded in darkness, the continent was full of unknown dangers. Even though many creatures had died out, unable to adapt to the new conditions, those that didn’t had become much more cunning and cruel.\u003c/p\u003e\n\u003cp\u003eDoron had heard rumours of creatures from the Underdark, driders and horrifying claw monsters that wanted to use the loss of the sun to blast out from their prisons and wantonly invade the mainland. They were backed by their own pantheon, headed by the Spider Queen, Lolth.\u003c/p\u003e\n\u003cp\u003eHer decision was absolutely correct. The celestial gods had to give way to the Underdark in the Dark Ages for manpower and supplies, letting them migrate from down below to the mainland. The drow were rumoured to have built a city on the surface already.\u003c/p\u003e\n\u003cp\u003eThe rumours said men were the lowest of slaves amongst the drow, alongside other species. They could be sacrificed to the gods at any time. Despite all this, a large number of wandering species were seeking shelter from the drow just to survive.\u003c/p\u003e\n\u003cp\u003e‘What a pity… Lolth is an evil god, and my Lord…’ Doron’s eyes flashed in struggle, but he soon turned firm. Even though the gods weren’t as glorious as they once were, their decrees remained meaningful enough to influence the entire prime material plane. The battle between good and evil had cast a shadow in Doron’s thoughts…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1185\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1187\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1186","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
