{"id":59747,"no":1191,"title":"Chapter 1191","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eProbe\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eCurrently, within the conference of the Magi.\u003c/p\u003e\n\u003cp\u003e“I’m afraid the Chaos Lord and Evil Filthy Eye won’t be able to hold up, we need to send reinforcements!” Distorted Shadow shouted frantically, but then he felt awkward when nobody stood with him. After all, Leylin’s words had made sense. It was impossible for Magi to take the risk to sacrifice themselves for others.\u003c/p\u003e\n\u003cp\u003e“If there’s still some doubt in your hearts, maybe I can prove my point…” The power of original sin shot forth from Leylin’s body, carrying traces of blood with black spots. This power that carried all the sins of the mortal world attracted numerous gazes; even if everyone here was a peak rank 8 some were shocked by Leylin’s aura.\u003c/p\u003e\n\u003cp\u003e“The path of original sin… This power…” The ancient Tree of Life seemed to recall something.\u003c/p\u003e\n\u003cp\u003eThe blood dripped down in the void, forming into the seven sins as it seemed to acquire a life of its own. The dense fog shrunk to form a few tall figures.\u003c/p\u003e\n\u003cp\u003eLeylin, the Darkness Lord, Mother Core, even Distorted Shadow… They were all imitated to perfection, including the energy waves of their truesouls! Such was the mercurial power of original sin. Even the faint auras being leaked by these rank 8 existences could be analysed and imitated.\u003c/p\u003e\n\u003cp\u003e‘Identical auras…’ Numerous rank 8s were surprised by the skill Leylin displayed, Mother Core most of all. ‘He’s grown stronger again. Even if it’s only an avatar, one can see the changes in his true body as well. It’s like he never met a bottleneck after reaching peak rank 8…’\u003c/p\u003e\n\u003cp\u003eShe sent her tendrils out to gather information, finally getting to the crux of the matter. ‘This is the influence of the Dark Ages? The negative emotions generated in the end times are the best nourishment for the Nightmare Hydra…’\u003c/p\u003e\n\u003cp\u003eIndeed, that was why Leylin engulfed the sun, bringing about the Dark Ages instead of attacking the gods. The Dark Ages benefitted him greatly, giving a thousandfold the power of sin he would’ve acquired during times of peace.\u003c/p\u003e\n\u003cp\u003eMassacre, death, greed, envy… All the deadly sins had come into play in the end times. They occurred often, and were intense when they did. Without anyone knowing the better, Leylin had actually seized the powers of everyone struggling in the prime material plane to increase his own power!\u003c/p\u003e\n\u003cp\u003eIt was like he had an entire world’s worth of zealots worshipping him, providing him with unending power. How could his strength not advance by leaps and bounds? The avatars that were more real than the originals crossed the boundaries of spacetime, containing violent energy.\u003c/p\u003e\n\u003cp\u003e“Kill the Overgod!” “Our glory cannot be tarnished!” “Reinforce the Lord of Chaos and Evil Filthy Eye!” Powerful conscients pierced through the sky, led by an avatar of original sin with the power of a peak rank 8 Magus. They descended upon the Abyss like several gigantic meteorites.\u003c/p\u003e\n\u003cp\u003e“Such vile power… As expected of the God of Massacre, more chaotic than the demons and more vile than the devils…” Both the Demogorgon and Orcus quivered at the edge of the Abyss. “The Magi are here! Inform the gods!”\u003c/p\u003e\n\u003cp\u003e….\u003c/p\u003e\n\u003cp\u003e“The truth shall verify everything!” Several existences were looking at the image displayed by Mother Core. The fake avatars had just arrived outside the Abyss, about to enter its depths.\u003c/p\u003e\n\u003cp\u003eA terrifying change occurred at that moment, green light brimming with the aura of life suddenly forming a cage of green vines that trapped the party. The flora of the world roared out, as if a primordial beast had just woken up.\u003c/p\u003e\n\u003cp\u003e“The God of the Wild, Silvanus… To think he’s still alive…” Mother Core’s face instantly became unsightly. Silvanus was second only to the Overgod, the number of Magi that had died at his hands not few.\u003c/p\u003e\n\u003cp\u003e“I didn’t expect this… Even if his divine body had been crushed, he didn’t fall completely…” The Darkness Lord sighed as well, looking at Leylin with a gaze of encouragement and gratification. Silvanus’ appearance had proved him right.\u003c/p\u003e\n\u003cp\u003e“Wait for it…” Leylin actually grew even more solemn, perhaps even a little eager.\u003c/p\u003e\n\u003cp\u003e*Rumble!* *Boom!* The four elemental planes roared out, rippling with terrifying power as an endless stream of elemental power congealed to form a powerful seal.\u003c/p\u003e\n\u003cp\u003eEarth, Fire, Wind, Water! The elemental gods had shown themselves, their combined might causing the Darkness Lord to lose his voice.\u003c/p\u003e\n\u003cp\u003eThe four elements formed a vast storm of origin force, instantly exterminating the avatars inside the cage. Not even a speck of dust was overlooked.\u003c/p\u003e\n\u003cp\u003e“No… These aren’t true bodies, they’re just avatars…” The Goddess of Air, Akadi, frowned. “They could even conceal their spiritual fluctuations from us… These Magi are even more difficult to deal with than the ancient ones…”\u003c/p\u003e\n\u003cp\u003e“That doesn’t matter. It is our duty to safeguard the peace and security of the entire world,” Kossuth the Lord of Fire said.\u003c/p\u003e\n\u003cp\u003e“At least we can be sure that they’re not as strong as in the last war. This is good news…” A gigantic flower bloomed as the will of nature descended upon them. Having lost his true body in the Final War, Silvanus had merged his will with the nature of the world, growing even stronger in the process.\u003c/p\u003e\n\u003cp\u003e“As long as we exist, we will not allow the Magi to advance even half a step!” The power of nature guided the four elements, forming a solid seal in front of the Abyss that prevented the two Magi within from escaping. The elemental planes roared, pouring origin force into the seal continuously, their might causing the hearts of the Magi watching to palpitate.\u003c/p\u003e\n\u003cp\u003e“Goddess of Air Akadi, God of Earth Grumbar, God of Water Istishia, God of Fire Kossuth, alongside the God of the Wild Silvanus… To think these ancient existences were actually still alive…” A peak rank 8 Magus released a cry of surprise,\u003c/p\u003e\n\u003cp\u003e“Jiejie… Very well, very well! We can settle the the vengeance of previous war together now…” A few avatars from the corner sneered. They were all like Distorted Shadow, mere remnant wills sealed up by the gods. Although Leylin had set them free, their powers had dropped and they were currently recovering.\u003c/p\u003e\n\u003cp\u003e“These are five pinnacle existences even amongst the greater gods. Unless we mobilise everyone, we won’t be able to break through the elemental planes…” Mother Core said, “On top of that, the two-world plan’s defences will drop if we leave.”\u003c/p\u003e\n\u003cp\u003e“It isn’t just that,” Leylin said without hurry.\u003c/p\u003e\n\u003cp\u003eNo Magus would underestimate him now, thinking of him as a new entry to their ranks. It wasn’t easy to confuse greater gods with an avatar, and being unable to see through his powers themselves couldn’t he casually mount a sneak attack upon any of them? All guarantees were fake, might being the only truth.\u003c/p\u003e\n\u003cp\u003e“I noticed another existence as well…” Leylin waved his hands, and the dark power of original sin built a murky image. A golden light was lurking within the darkness of the Abyss, something Mother Core’s probes hadn’t managed to discover.\u003c/p\u003e\n\u003cp\u003eSeeing the genuine appearance of the god, Mother Core immediately stirred up. “That’s the Earthmother, she’s mine!”\u003c/p\u003e\n\u003cp\u003e“Eh?!” Leylin frowned for a moment, but quickly relaxed. ‘Right. Mother Core has reached the limits of her path, unable to advance and comprehend the powers of spacetime. Chauntea walks the same path as well, so if she can devour the goddess to make up for her foundation she really will have a chance of advancing to rank 9…’\u003c/p\u003e\n\u003cp\u003eWhat was more enticing to a peak rank 8 existence than advancing to rank 9? Leylin could understand Mother Core’s excitement, her future had just appeared in front of her.\u003c/p\u003e\n\u003cp\u003e“Silvanus is mine,” the ancient Tree of Life followed. Its path of life perfectly fit into Silvanus’ domain of nature.\u003c/p\u003e\n\u003cp\u003e“Haha… Very well, this is the boldness we should have! Even a greater god is restricted by their faith, only fit to become my prey…” Looking at this atmosphere, the Darkness Lord began laughing in excitement.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1190\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-1192\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1191","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
