{"id":58677,"no":121,"title":"Chapter 121","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eLegends\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe Redbud Flower family was one of the three big families behind Abyssal Bone Forest Academy, the same as the Lilytell family.\u003c/p\u003e\n\u003cp\u003eThis was a family that had official Magi among every generation and could activate the battle prowess of those Magi in times of war. It was completely on a different level than Bicky\u0027s falling family.\u003c/p\u003e\n\u003cp\u003eWith the protection of the Redbud Flower family, Bicky\u0027s family could only grit their teeth in defeat as they would never be able to recover the Rainbow Potion.\u003c/p\u003e\n\u003cp\u003e\"As for Bicky, she was captured by the experts in her family. It\u0027s said that she would very soon be put on trial and charged guilty for betraying the family.\u003c/p\u003e\n\u003cp\u003eHong\u0027s eyes turned red, her tears almost falling.\u003c/p\u003e\n\u003cp\u003e\"Hu!\" Leylin exhaled a long breath.\u003c/p\u003e\n\u003cp\u003eBicky had a crush on Fayle, he knew it since the first day in the academy. Moreover, he also knew that Fayle did not have much moral values.\u003c/p\u003e\n\u003cp\u003eWhen Bicky told Leylin that Fayle had already accepted her to be his girlfriend, Leylin felt that there was a conspiracy behind it, yet he had no way of reminding her.\u003c/p\u003e\n\u003cp\u003eFayle, who had gathered enough contribution points in the secret plane, had exchanged it for the Grine Water. Adding on to the Rainbow Potion, his chances of advancement to a rank 1 Magus were extremely high!\u003c/p\u003e\n\u003cp\u003eAs for Bicky\u0027s family, it was akin to losing one official Magus. Moreover, they had to suffer even the loss of Bicky, who was an acolyte.\u003c/p\u003e\n\u003cp\u003e\"A rather good scheme. A pity that his character had somewhat fallen to the lowest. If I see him next time, I\u0027ll just kill him!\"\u003c/p\u003e\n\u003cp\u003eLeylin thought indifferently.\u003c/p\u003e\n\u003cp\u003eBicky was his good friend. Moreover they had a one night stand, so he had to try to rescue her. Moreover, as long as it was within his capabilities, he would help her seek revenge.\u003c/p\u003e\n\u003cp\u003eHowever in Leylin\u0027s heart, there wasn\u0027t any feeling of humiliation or disgrace that Bicky had given him.\u003c/p\u003e\n\u003cp\u003eLooking at it in detail, Bicky was Fayle\u0027s girlfriend both in name and in reality. In fact, it was Leylin who did the dishonorable thing and let Fayle wear a green hat[1. Wearing a green hat means to be cuckolded.], so naturally he did not have to feel humiliated or anything of the sorts.\u003c/p\u003e\n\u003cp\u003eHowever, the crucial point now was to save Bicky.\u003c/p\u003e\n\u003cp\u003eProfessor Kroft was an excellent candidate to save her, but Leylin very soon dismissed that thought.\u003c/p\u003e\n\u003cp\u003eThe relationship between the professors and acolytes in Abyssal Bone Forest Academy was only based on mutual benefits. The acolytes would fork out magic crystals and services. In return, the professors would give them knowledge.\u003c/p\u003e\n\u003cp\u003eIf it were Jayden and Torash, highly talented individuals who had gained their mentor\u0027s nurture, it was still alright. However, Bicky who had a rather average aptitude only had a simple relationship with her mentor.\u003c/p\u003e\n\u003cp\u003eIt was as if after she had graduated, the relationship between her and her mentor would wane unless she advanced into an official Magus.\u003c/p\u003e\n\u003cp\u003eMoreover, Kroft was the professor of Abyssal Bone Forest Academy. When entering the academy, he had already signed a contract not to interfere with the internal matters of other families.\u003c/p\u003e\n\u003cp\u003eAs for Bicky\u0027s family, it was one of the many families under the Abyssal Bone Forest Academy\u0027s banner.\u003c/p\u003e\n\u003cp\u003eHence, Kroft could not take action as he would dishonor the agreement.\u003c/p\u003e\n\u003cp\u003eAfter drinking the somewhat cooled down tea on the circular desk, he slowly spoke under the anticipatory gaze of Hong.\u003c/p\u003e\n\u003cp\u003e\"Due to an important experiment I am unable to leave, but I will write a letter. Please revert it to the elder behind Bicky\u0027s family. \"\u003c/p\u003e\n\u003cp\u003eThe experiment of purifying the bloodline had just entered its most important juncture.\u003c/p\u003e\n\u003cp\u003eIf not for Hong telling him the news of Bicky, Leylin might not even have taken the time away from it.\u003c/p\u003e\n\u003cp\u003eHowever, he could not leave the lab for too long either.\u003c/p\u003e\n\u003cp\u003eCompared to Bicky, Leylin\u0027s impending doom was even greater. He had to advance into a rank 1 Warlock in the shortest possible amount of time, to better deal with the threat from the Lilytell family.\u003c/p\u003e\n\u003cp\u003eFurthermore, the Lilytell family could trace it back to him any moment. Along with the passing of time, this possibility can only grow bigger. He had to purify the blood before the Lilytell family discovered anything, and find a safe place outside the academy to complete his most important advancement!\u003c/p\u003e\n\u003cp\u003eThis matter concerned his life and death! Comparing the weight of this matter, Bicky\u0027s issue could be put aside first.\u003c/p\u003e\n\u003cp\u003eLeylin reasoned that he was a genius acolyte in the Abyssal Bone Forest Academy that had a huge chance of advancing into an official Magus.\u003c/p\u003e\n\u003cp\u003eAs for Bicky\u0027s family head, he was only a level 3 acolyte. In the Magus World, the prerequisite of association was to have similar levels of strength! Hence, towards Leylin\u0027s words, the other party would definitely give it some consideration.\u003c/p\u003e\n\u003cp\u003eAfter hearing Leylin\u0027s words, Hong\u0027s eyes dimmed. She straightened her body and almost left the seat immediately.\u003c/p\u003e\n\u003cp\u003eIt seems that she thought that Leylin only wanted to gloss over this matter on a superficial level.\u003c/p\u003e\n\u003cp\u003eAs a matter of fact, that was the most common practice of acolytes. Hong was already mentally prepared, but she still felt a little frustrated.\u003c/p\u003e\n\u003cp\u003e\"On the letter, I will earnestly request for the head not to proceed with the trial and also to leave Bicky\u0027s source of spiritual force intact, not causing harm to it.\u003c/p\u003e\n\u003cp\u003eThe source of spiritual force was the most basic foundation of magicians which was the sea of consciousness and the spiritual force.\u003c/p\u003e\n\u003cp\u003eOnce this source was to be wasted, the magician would be crippled. This was often the methods of families executed on those members who had betrayed them.\u003c/p\u003e\n\u003cp\u003e\"And in return! I promise to compensate for the missing Rainbow Potion!\" Leylin\u0027s final words made Hong\u0027s eyes gleamed immediately.\u003c/p\u003e\n\u003cp\u003e\"Thank you! I am really so thankful...\" Hong was too excited that her speech turned incoherent.\u003c/p\u003e\n\u003cp\u003eIf it was just a simple request, the other party might not give Leylin any face at all, as they were both level 3 acolyte and the head were borne from a Magus family.\u003c/p\u003e\n\u003cp\u003eHowever, with the promise of compensation, it was a different case.\u003c/p\u003e\n\u003cp\u003eAfter all, even if they killed Bicky now, there were no benefits to the family at all. If they were only to keep her in captive, there was even the chance of receiving compensation for it!\u003c/p\u003e\n\u003cp\u003eAll logical magicians would definitely know what to choose between the two.\u003c/p\u003e\n\u003cp\u003e\"Bicky and I have the same mentor, so it\u0027s something I should do!\"\u003c/p\u003e\n\u003cp\u003eLeylin smiled and got up.\u003c/p\u003e\n\u003cp\u003eAfter his experiment, he would immediately try to advance. Once he succeeds and becomes an official Magus, his authority would immediately change.\u003c/p\u003e\n\u003cp\u003eAt that time, if he tries to rescue Bicky, it would be less troublesome.\u003c/p\u003e\n\u003cp\u003eTo tell the truth, the price of a Rainbow Potion could be easily compensated with what Leylin had now. Not to mention the peddling of potions, just based on the few precious herbs he grabbed in Dylan Gardens, each and every one of time had a price that was several times of the Rainbow Potion.\u003c/p\u003e\n\u003cp\u003eHowever if he were to just take the money and redeem her, he would easily be labelled as an idiot who had more money than sense. Leylin decided that there was no purpose in him being talked of as a fool.\u003c/p\u003e\n\u003cp\u003eUnder the combination of logic and benefit, he chose the way that would be least consuming for him.\u003c/p\u003e\n\u003cp\u003e\"I have sought out many a person, but only you, Leylin, helped me. Bicky would definitely be happy to have a friend like you!\" Looking on, Hong\u0027s relationship with Bicky seemed rather good.\u003c/p\u003e\n\u003cp\u003e\"If there are no other matters, then pardon me for taking my leave first!\"\u003c/p\u003e\n\u003cp\u003eLeylin smiled like a gentleman, leaving his seat elegantly.\u003c/p\u003e\n\u003cp\u003eBicky\u0027s matter was only a small surprise to Leylin. After leaving the lab to settle this issue, Leylin once again buried his head in the experiments.\u003c/p\u003e\n\u003cp\u003eThree days later, Leylin looked at a vulcanised crystal test-tube with an engrossed expression.\u003c/p\u003e\n\u003cp\u003eInside the test-tube, a layer of purple, red fluid had already occupied more than half the space within. Moreover, there was effervescence in it, continuously emitting tiny bubbles, as if having its life.\u003c/p\u003e\n\u003cp\u003e\"This is from all the essence from the Black Horrall Snake, adding on to the special blood purification apparatus using the heart as a primer. After the microscopic abilities of the A.I. Chip coupled with magic spells to continuously purify it, I have finally obtained half a test-tube of this ancient bloodline!\"\u003c/p\u003e\n\u003cp\u003eA dreamy expression could be seen on Leylin\u0027s eyes as he muttered.\u003c/p\u003e\n\u003cp\u003eJust by holding onto the test-tube, Leylin felt a tremendous force continuously emitting from the test-tube, radiating out to its surroundings.\u003c/p\u003e\n\u003cp\u003e\"It is indeed the bloodline of the ancient creature-Giant Kemoyin Serpent!\"\u003c/p\u003e\n\u003cp\u003eLeylin asked the A.I. Chip, \"How is the sorting of information concerning the Giant Kemoyin Serpent?\"\u003c/p\u003e\n\u003cp\u003eThese formidable creatures of ancient times would only be briefly mentioned in very few documents and tales of bards. There were many misconceptions about them, so what Leylin had the A.I. Chip do was to sort out the real content of the data on the Giant Kemoyin Serpent.\u003c/p\u003e\n\u003cp\u003eAfter all, this was his only choice!\u003c/p\u003e\n\u003cp\u003eAs for other bloodlines of other snake species, how could it be gotten that easily? Any creature with a trace of ancient bloodline could command a frightening price. Moreover, Leylin was not an official Magus yet, so many channels could not be used.\u003c/p\u003e\n\u003cp\u003e[Beep! After 3465 comparisons, omitting 139 false information, 45 repeated information, the main content has been sorted.] The A.I. Chip\u0027s voice intoned.\u003c/p\u003e\n\u003cp\u003e[Giant Kemoyin Serpent: Ancient creature, reaching the length of 5000 metres in an adult phase. It is known to have a powerful body and mysterious spellcasting abilities. In the adult phase it can go against rank 4 Magus and is the destroyer of many cities in legends. Main elemental properties: Darkness, with secondary element of Fire! In the legends, the Mother of Ten Thousand Snakes had failed to gain control of the Shadow World, hence bringing her children to the Purgatory World. From then on, her descendants all has the element of Fire.]\u003c/p\u003e\n\u003cp\u003e[Sources of origin: Ancient Creatures Illustration Handbook, The Travels of Grey, Diary of the great Magus Serholm, The Book of Giant Serpent....]\u003c/p\u003e\n\u003cp\u003e\"Darkness Element and Fire Element?\" Ecstasy filled Leylin\u0027s face.\u003c/p\u003e\n\u003cp\u003eAlthough after transplanting the bloodline, the Warlocks would naturally add on the elements of the ancient creature, it was definitely the best to have their innate affinity to be compatible with the ancient creature.\u003c/p\u003e\n\u003cp\u003eEven after changing bloodlines, the original qualities of the magician\u0027s body was extremely important. It was decided from the start of birth and was extremely difficult to change in the future.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip, bring out my elemental affinity chart!\"\u003c/p\u003e\n\u003cp\u003eIn front of Leylin, a projected image appeared.\u003c/p\u003e\n\u003cp\u003eThe longest bar was dark coloured, representing the main elemental affinity that Leylin had: Darkness.\u003c/p\u003e\n\u003cp\u003eAfterwards, it was followed by a fiery red bar half the size of the Darkness Element. This was Leylin\u0027s secondary elemental affinity, Fire.\u003c/p\u003e\n\u003cp\u003eAt the back, there was a green bar and few other colours, representing the affinity of other elements.\u003c/p\u003e\n\u003cp\u003eHowever, these bars were much shorter than Fire by a dozen times. If Leylin chose to cultivate mainly with those elemental energy particles, then he might not even be a level 2 acolyte by now.\u003c/p\u003e\n\u003cp\u003eWhich is to say, Leylin\u0027s affinity in the Darkness Element was highest followed by the Fire Element. The others could be treated as negligible.\u003c/p\u003e\n\u003cp\u003e\"The properties of the Giant Kemoyin Serpent is actually compatible with my affinity. According to the introduction of the Kemoyin\u0027s Pupil, under these circumstances, it can have a multiplier effect on the magician\u0027s affinity, which is also the best choice!\"\u003c/p\u003e\n\u003cp\u003eLeylin could not mask the overjoyed expression he had on his face.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-120\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-122\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-121","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
