{"id":58682,"no":126,"title":"Chapter 126","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eClayde\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eSeveral minutes later, within the large hall.\u003c/p\u003e\n\u003cp\u003eThere was no one else apart from Leylin and Bicky.\u003c/p\u003e\n\u003cp\u003eLeylin and Bicky sat facing each other, only separated by a small, white round-table. There were many appetizers and aperitifs arranged on this table.\u003c/p\u003e\n\u003cp\u003eBicky was holding a piece of sponge cake within her hand, but it appeared she had no appetite.\u003c/p\u003e\n\u003cp\u003e\"Is it true? How did you actually get promoted to a level 1 Magus this soon?\"\u003c/p\u003e\n\u003cp\u003eBicky, still appearing absent-minded, picked up a steaming drink and took a gulp.\u003c/p\u003e\n\u003cp\u003e\"Congratulations, Leylin! Also, thank you for coming over to help me.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t mention it. After all, you are my friend.\" Leylin smiled as he said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right! You are a good friend.\" Bicky unconsciously repeated whatever Leylin said, still looking dazed.\u003c/p\u003e\n\u003cp\u003e\"What do you plan to do from now on?\" asked Leylin, anxiously, seeing Bicky acting in this manner.\u003c/p\u003e\n\u003cp\u003e\"In the future?\" Bicky bowed her head as in deep thought and said, \"I do not intend to return to the academy. I shall go and travel and perhaps one day; I will return to my family...\"\u003c/p\u003e\n\u003cp\u003eSaying this, she looked eagerly at Leylin, \"Maybe I can become your follower?\"\u003c/p\u003e\n\u003cp\u003eAfter becoming an official Magus, a person can usually accept a few followers and agree upon a soul contract where the followers would pledge their life and loyalty to their master. In return, based on their accomplishments, the masters would have to provide their followers with knowledge and resources to the best of their abilities.\u003c/p\u003e\n\u003cp\u003eAnd in the outside world, a follower can be the representative of their master to a certain extent.\u003c/p\u003e\n\u003cp\u003e\"This will not do!\" Leylin refused Bicky\u0027s request after thinking for a while.\u003c/p\u003e\n\u003cp\u003e\"I have a big problem on hand. Besides all that...\"\u003c/p\u003e\n\u003cp\u003eEven though Leylin did not speak it out, Bicky understood that followers must have certain strength, which could, later on, be of help to their masters\u003c/p\u003e\n\u003cp\u003eNow, Leylin was already a Magus. With his talent, this was only the beginning of his journey.\u003c/p\u003e\n\u003cp\u003eAnd because of this, Leylin\u0027s followers\u0027 aptitudes should not be lousy. Otherwise, further cultivation would be useless.\u003c/p\u003e\n\u003cp\u003eBicky\u0027s spiritual aptitude was not very good-till now she was still only a level 2 acolyte. Leylin reckoned that, if she did not experience any strange events, the status of a level 3 acolyte would be the highest she could achieve in her lifetime, which would not be of much help to him.\u003c/p\u003e\n\u003cp\u003e\"If it\u0027s like this! I merely made a passing remark...\" Bicky laughed forcefully.\u003c/p\u003e\n\u003cp\u003eSeeing the way Bicky behaved, Leylin suddenly felt he had a headache coming on. He said, \"Regarding Fayle, have you decided what is to be done?\"\u003c/p\u003e\n\u003cp\u003e\"About him...\" Bicky remained silent for a moment.\u003c/p\u003e\n\u003cp\u003eA good while later, she calmly spoke, \"He entered the Purple-Gold Flower family and now has both Grine Water and the Rainbow Potion. I am afraid that he has already broken through and become an official Magus. What can I do?\"\u003c/p\u003e\n\u003cp\u003e\"At an appropriate moment, I will make him pay the price.\"\u003c/p\u003e\n\u003cp\u003eLeylin still wished to offer some hope and guarantee to Bicky.\u003c/p\u003e\n\u003cp\u003eCertainly, when and how he will take revenge is up to him to decide. In any case, Leylin himself wasn\u0027t prepared to be riddled with troubles to kill the guy who cheated Bicky.\u003c/p\u003e\n\u003cp\u003eEven if Fayle had advanced, he was now only a newly-minted Magus-which was definitely not a match for Leylin.\u003c/p\u003e\n\u003cp\u003eMoreover, there were many rank 1 spells contained within that Book of Serpent, some which can kill people without a trace of sound. Outsiders will definitely not be able to connect the death to Leylin.\u003c/p\u003e\n\u003cp\u003eBicky\u0027s eyes reddened as tears the size of beans rolled down her cheek.\u003c/p\u003e\n\u003cp\u003e\"Thank you! Thank you! Leylin...\"\u003c/p\u003e\n\u003cp\u003eShe cried as she pounced into Leylin\u0027s arms. Leylin\u0027s expression was tender as he hugged her with his left arm, with the right hand patting her gently on the back.\u003c/p\u003e\n\u003cp\u003eAfter which, Leylin made a strange gesture with his right arm where Bicky did not realise it.\u003c/p\u003e\n\u003cp\u003eA greyish black gas was pulled out from Bicky\u0027s body and held firmly in Leylin\u0027s hands.\u003c/p\u003e\n\u003cp\u003eSeveral hours later, after refusing Johnson\u0027s invite to stay, Leylin left the Tyler Fort on his own.\u003c/p\u003e\n\u003cp\u003eBefore leaving, he still went according to the contract and gave the Grine Water to the Tyler family as compensation.\u003c/p\u003e\n\u003cp\u003eIn exchange, Johnson pardoned Bicky\u0027s crime in front of all the members, even with the intent of making her the successor immediately.\u003c/p\u003e\n\u003cp\u003eLeylin walked a good long distance before looking back at Tyler Fort. With his vision, he could see a smoky white figure standing alone in front of the Tyler Fort, maintaining the gesture of sending Leylin off earlier.\u003c/p\u003e\n\u003cp\u003e\"I hope the potions I gave her will be of some use!\"\u003c/p\u003e\n\u003cp\u003eBefore leaving, Leylin even gave Bicky some of his modified Azure Potion and told her clearly of its uses. And like before, Leylin told a lie, saying that he managed to chance across them and made a purchase.\u003c/p\u003e\n\u003cp\u003eAlthough he had the strength of a rank 1 Warlock now and could definitely protect a potion\u0027s formula, he still wished to avoid trouble.\u003c/p\u003e\n\u003cp\u003eTo him, Bicky and the other acolytes in the Abyssal Bone Forest Academy were only part of his journey to climb to the top.\u003c/p\u003e\n\u003cp\u003eHe would slightly halt in this part of the journey, but not forever.\u003c/p\u003e\n\u003cp\u003eHe still wished to climb further to greater heights, to see and accomplish more things.\u003c/p\u003e\n\u003cp\u003ePerhaps, after he had climbed to the highest point, he would then reminisce of his past and return to it.\u003c/p\u003e\n\u003cp\u003eBut before that, he will never leave behind any regrets!\u003c/p\u003e\n\u003cp\u003e\"The issues are almost settled. Maybe I should leave the Poolfield Kingdom and travel around the south coast?\"\u003c/p\u003e\n\u003cp\u003eThe Lilytell family was a large family with a strong backing. Leylin\u0027s might could not even be compared to a fraction of it.\u003c/p\u003e\n\u003cp\u003eLeylin did not assume that after advancing into a rank 1 Warlock, he would be able to eradicate this family.\u003c/p\u003e\n\u003cp\u003eMoreover, at the very end, the Chairman Siley of the Abyssal Bone Forest Academy will definitely appear. This was a rank 2 Magus! An existence Leylin had no chance against right now!\u003c/p\u003e\n\u003cp\u003eAs the representative of the Abyssal Bone Forest Academy, Siley will definitely take action!\u003c/p\u003e\n\u003cp\u003eAfter thinking for some while, Leylin felt that deserting the school was his best choice.\u003c/p\u003e\n\u003cp\u003eAs for whether his professors and friends would be implicated?\u003c/p\u003e\n\u003cp\u003eNo matter if it was Kroft, or the Abyssal Bone Forest Academy members, or even Nyssa and the other acolytes, they were all members of the Abyssal Bone Forest Academy.\u003c/p\u003e\n\u003cp\u003eAs one of the three big families, the Lilytell family had to maintain its decorum of nobility and exercise the compliance of rules.\u003c/p\u003e\n\u003cp\u003eTowards this, the noble family amongst regular humans which Leylin was born in were not much different.\u003c/p\u003e\n\u003cp\u003eMoreover, even if the Lilytell family did not want face at the end and used other people as hostage to capture him, so what?\u003c/p\u003e\n\u003cp\u003eWould Leylin be this foolish to walk right into this trap?\u003c/p\u003e\n\u003cp\u003eAlthough Leylin would offer his help for Bicky and the rest of them, it always came with a prerequisite. That he had enough power to do it and it would not bring him much trouble.\u003c/p\u003e\n\u003cp\u003eOnce exceeding this threshold, Leylin would somewhat become cold-blooded.\u003c/p\u003e\n\u003cp\u003eTo put it in another way: even if the Lilytell family went to the Chernobyl Islands and used the Farlier family as a hostage to threaten him, Leylin would not give two hoots about it.\u003c/p\u003e\n\u003cp\u003eAt the very most, after his power had increased, he would return to exterminate the Lilytell family, thus avenging the Farlier family.\u003c/p\u003e\n\u003cp\u003eLeylin thought of his plans as he rode on a horse along the road.\u003c/p\u003e\n\u003cp\u003e*Thud Thud!*\u003c/p\u003e\n\u003cp\u003eWith the fast trampling of the horse hoofs, they ran past a forest.\u003c/p\u003e\n\u003cp\u003eAs for Leylin, he had been squinting his eyes. At this moment, they were suddenly opened, and a streak of toying expression appeared on his face.\u003c/p\u003e\n\u003cp\u003e*Pu!*\u003c/p\u003e\n\u003cp\u003eJust when the horse was about to leave the forest clearing, several arcs of light shot out from the trees.\u003c/p\u003e\n\u003cp\u003e*Ka-Cha!*\u003c/p\u003e\n\u003cp\u003eWith a huge boom, the fine steed was severed into a few pieces, bleeding out a huge amount of blood and intestines.\u003c/p\u003e\n\u003cp\u003eAt that moment when the light hit his horse, Leylin used his palm to press on the horse, grabbed his knapsack and jumped away from it.\u003c/p\u003e\n\u003cp\u003eWhen both of his feet landed on the ground, he realised he had been surrounded by a group of black-robed figures.\u003c/p\u003e\n\u003cp\u003eThey all gave off the energy waves of level 3 acolytes. A few of them also had the aura of magic artifacts radiating from their bodies. As for the one in the centre, his strength had already reached the standard of an official Magus!\u003c/p\u003e\n\u003cp\u003eThe clothes on these black robed figures had an image of several crows stitched on with a gold lining on it.\u003c/p\u003e\n\u003cp\u003e\"Such a getup? The Academy\u0027s Enforcement Squad?\"\u003c/p\u003e\n\u003cp\u003eLeylin already guessed who they were, and calmness showed on his face.\u003c/p\u003e\n\u003cp\u003e\"Leylin! Someone has accused you of killing your fellow level 3 acolytes. Bosain, Jayden, Shaya and Roth. Come back with us for your trial!\"\u003c/p\u003e\n\u003cp\u003eThe scarred faced leader did not hide the killing intent in his eyes.\u003c/p\u003e\n\u003cp\u003eLeylin understood that the Lilytell family had finally investigated the matter previously, and even push the blame of the other level 3 acolytes death onto his head.\u003c/p\u003e\n\u003cp\u003e\"And if I say no?\"\u003c/p\u003e\n\u003cp\u003eThe people who surrounded Leylin were not only level 3 acolytes but also an official Magus. Before his advancement, he could not even escape such a formation. But now, Leylin had an impulse and was rather eager to battle.\u003c/p\u003e\n\u003cp\u003e\"Defying the Enforcement Squad! Kill on the spot!\"\u003c/p\u003e\n\u003cp\u003eThe official Magus, Scarface, unleashed his killing intent and waved his hands.\u003c/p\u003e\n\u003cp\u003eMany incantations sounded, and various energy waves were emitted.\u003c/p\u003e\n\u003cp\u003eDazzling fireballs! Jade green corrosive acid! Purple blades, as well as several other magic artifacts were used, appearing above Leylin\u0027s head.\u003c/p\u003e\n\u003cp\u003e*Bang!*\u003c/p\u003e\n\u003cp\u003eA huge pit appeared on where Leylin stood. On the sides there were still flames burning, the surroundings littered with broken bones and mutilated corpses.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s already killed?\" An acolyte behind Scarface spoke.\u003c/p\u003e\n\u003cp\u003e\"Boom!\"\u003c/p\u003e\n\u003cp\u003eSuddenly, the acolyte\u0027s brains exploded with the white brain juices and blood splattering on the ground.\u003c/p\u003e\n\u003cp\u003e\"Ted?!\"\u003c/p\u003e\n\u003cp\u003eThe group members behind him shouted with faces of disbelief.\u003c/p\u003e\n\u003cp\u003e*Sua! Sua! Sua!*\u003c/p\u003e\n\u003cp\u003eArrows were immediately shot off, causing the level 3 acolytes behind the official Magus to have their heads explode.\u003c/p\u003e\n\u003cp\u003e\"This is? Illusionary spell?\" Scarface shouted and immediately chanted an incantation.\u003c/p\u003e\n\u003cp\u003e*Sssii!*!\u003c/p\u003e\n\u003cp\u003eEar piercing wails continuously sounded, and the air in the surroundings seemed to undulate like waves in the water.\u003c/p\u003e\n\u003cp\u003eThe void seemed to be ripped open like the curtains from a theatre. Scarface looked at the surroundings. The level 3 acolytes were all laying on the ground with their eyes shut tightly, not knowing if they were still alive or dead.\u003c/p\u003e\n\u003cp\u003eHowever, at this moment, the official Magus did not pay any more attention to them.\u003c/p\u003e\n\u003cp\u003e\"You... Advanced?\" Scarface had a shocked expression, \"You actually... Advanced into an official Magus at 18 years old!\"\u003c/p\u003e\n\u003cp\u003e\"What a frightening talent. A pity you have offended the Lilytell family, so you\u0027re destined to die here!\"\u003c/p\u003e\n\u003cp\u003eScarface licked his lips, revealing a bloodthirsty expression. \"Let me introduce myself. Clayde is my name, Clayde Lilytell!\"\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-125\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-127\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-126","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
