{"id":58684,"no":128,"title":"Chapter 128","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eFayle\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\"The ingredients needed for Method 3 and above are too precious. I can\u0027t even get them now!\"\u003c/p\u003e\n\u003cp\u003e\"Right now the Giant Kemoyin Serpent\u0027s bloodline is already fused with my body and even the soul. Forcefully removing it would mean that I will demote from a rank 1 Warlock. I might even lose my life, so this is impossible!\"\u003c/p\u003e\n\u003cp\u003e\"It seems like I can only hurry and brew the Serenity Potion!\" Leylin\u0027s face was solemn.\u003c/p\u003e\n\u003cp\u003eHe long since gotten the formula and even gathered the ingredients in the Abyssal Bone Forest Academy. Brewing the completed potion was only a matter of time.\u003c/p\u003e\n\u003cp\u003eHe thought he could rely on his willpower to overcome adversities. However, the emotional fluctuations had perplexed Warlocks for hundreds of thousands of years. It was something that could not be easily overcome with mere willpower.\u003c/p\u003e\n\u003cp\u003eLeylin was always proud of being a rational person. A circumstance where he could not control things was tormenting for him.\u003c/p\u003e\n\u003cp\u003eAfter which, Leylin looked at a nearby cave and gave a cold smile.\u003c/p\u003e\n\u003cp\u003eAfter stripping Clayde of his belongings, he trapped Clayde, who was unconscious, in a cave.\u003c/p\u003e\n\u003cp\u003eLeylin was somewhat anticipatory on the information about the Lilytell family.\u003c/p\u003e\n\u003cp\u003eEven though he suspected that Clayde has some sort of tracing spell on him, Leylin still decided to grill him.\u003c/p\u003e\n\u003cp\u003eAs long as he acts fast enough, Leylin predicts that he can leave before Clayde regains full consciousness.\u003c/p\u003e\n\u003cp\u003eMoreover, the enemy merely assumed Leylin to be a level 3 acolyte; they would never anticipate that Clayde would fail. However, Clayde will never have the chance to be assigned to such an easy task in the future.\u003c/p\u003e\n\u003cp\u003e......\u003c/p\u003e\n\u003cp\u003eAfter a few hours, Leylin retrieved what he wanted and left the area.\u003c/p\u003e\n\u003cp\u003eNothing was left of Clayde\u0027s presence in the area except for a pool of yellow pus.\u003c/p\u003e\n\u003cp\u003e\"I never thought that Bosain\u0027s backing would be this powerful. He was the only grandson to an elder who had reached the requirements of advancement by having an Elemental Essence Conversion of 80% and above...\"\u003c/p\u003e\n\u003cp\u003eLeylin pondered on the latest developments as he hurried along his way.\u003c/p\u003e\n\u003cp\u003ePotion Masters crafted different types of potions. Leylin accumulated an assorted bunch of torture methods from the experiments in Extreme Night City. Leylin tested these torture methods on Clayde. Very quickly, the official Magus was driven to near insanity, letting the cat out of the bag in the process as he begged for a quick death.\u003c/p\u003e\n\u003cp\u003eAccording to Clayde, Bosain\u0027s grandfather was a powerful elder of the Lilytell family and also a magus that Clayde was serving.\u003c/p\u003e\n\u003cp\u003eThis was the reason why he was able to command the rank 1 Magus.\u003c/p\u003e\n\u003cp\u003eAfter eliminating the linchpin of the enemy and Clayde, Leylin knew that the powerful elder\u0027s hate for him grew by the day.\u003c/p\u003e\n\u003cp\u003eHowever, there was still good news at the end.\u003c/p\u003e\n\u003cp\u003eBecause of selecting the head inside the Lilytell family, the internal conflict in the Lilytell family had reached a critical point. The various elders were not affiliated with each other; thus, Leylin only needed to worry about escaping from Bosain\u0027s\u0027 grandfather.\u003c/p\u003e\n\u003cp\u003eHowever, the audacity of Leylin to kill the enemies\u0027 linchpin magus has angered all of the clans in the family and they will certainly not mind dispatching of Leylin if it was convenient.\u003c/p\u003e\n\u003cp\u003eAlone, Leylin stood no chance against the powerful clans\u003c/p\u003e\n\u003cp\u003eLeylin took little time to realise that his best option was to escape\u003c/p\u003e\n\u003cp\u003eThe Poolfield Kingdom was Abyssal Bone Forest Academy territory, which was sort of Lilytell family\u0027s gathering grounds. The more to the east, the more obvious it gets.\u003c/p\u003e\n\u003cp\u003eThe region to the north was filled with unspeakable dangers. Leylin decided that West was the way to go. He ploughed through the Zither Moon Mountain Plains and entered the vicinity of the Sage Gotham Hut\u003c/p\u003e\n\u003cp\u003eThe two forces just had a war, where they were irreconcilable like fire and water.\u003c/p\u003e\n\u003cp\u003eIn the vicinity of the Sage Gotham Hut, the influence of the Abyssal Bone Forest Academy was definitely the weakest.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin was not planning to stay for long in the vicinity of Sage Gotham Hut. Although they would definitely be willing to rope in an official Magus and even put the Abyssal Bone Forest Academy at a disadvantage, Leylin had never planned to be a pawn for them.\u003c/p\u003e\n\u003cp\u003eThe whole south coast was still big! Abyssal Bone Forest Academy and Sage Gotham Hut only belonged to the remote area on the eastern side of the south coast, like the rural area.\u003c/p\u003e\n\u003cp\u003eAfter passing through the Inlan Dukedom controlled by the Sage Gotham Hut and passing through the Great Canyon Margaret and traversing through a dozen more kingdoms, he reached the central area of the south coast.\u003c/p\u003e\n\u003cp\u003eIt was said that the Light Magi in this area held the highest power and could live in harmony with regular humans. Massacres and battles seldom occurred here.\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s plan was to continue his progress in this area.\u003c/p\u003e\n\u003cp\u003eAlthough he only needed to meditate the high-grade meditation technique to advance, it did not mean that he had no need for resources.\u003c/p\u003e\n\u003cp\u003eRather, it was just the contrary, no matter if it was for Elemental Essence Conversion or the decreased time between meditations, Leylin required resources, lots of magical resources!\u003c/p\u003e\n\u003cp\u003eAt the same time, he required huge quantities of potions and to obtain enough gold for it.\u003c/p\u003e\n\u003cp\u003eAll these required a distribution centre to collect the ingredients.\u003c/p\u003e\n\u003cp\u003eThe largest markets in the south coast were in the central region, which was overseen by the Ennea Ivory Ring Tower and other large magisterium.\u003c/p\u003e\n\u003cp\u003eAs he thought of Ennea Ivory Ring Tower, Leylin recalled George.\u003c/p\u003e\n\u003cp\u003eIt was a youth who set off at the same time as him, finally entering the Ennea Ivory Ring Tower for his studies. In a flash, five to six years had passed. George had a fourth-grade aptitude, so it was very likely he had already advanced into a level 3 acolyte.\u003c/p\u003e\n\u003cp\u003e\"I wonder how they are now.\"\u003c/p\u003e\n\u003cp\u003eLeylin muttered as he sped up his pace towards the Zither Moon Mountain Plains.\u003c/p\u003e\n\u003cp\u003e*Bang!*\u003c/p\u003e\n\u003cp\u003eA huge cave immediately crumbled into a landslide, showing the apparent rage of the person who struck it.\u003c/p\u003e\n\u003cp\u003eUnder the rubble, the figure of an old man in silver white armour could be seen.\u003c/p\u003e\n\u003cp\u003eThere were some strange metal ornaments on this old man\u0027s face, his eyes showing his wrath.\u003c/p\u003e\n\u003cp\u003e\"Clayde... Clayde was actually killed too!\"\u003c/p\u003e\n\u003cp\u003e\"I will definitely not let you go!\" The old man gritted his teeth, the veins on his forehead bulging.\u003c/p\u003e\n\u003cp\u003e......\u003c/p\u003e\n\u003cp\u003eFayle\u0027s frame of mind was somewhat good the past few days.\u003c/p\u003e\n\u003cp\u003eEspecially when his servants and acolytes called him; Lord Magus Fayle\u0027, he would often have some smugness from it.\u003c/p\u003e\n\u003cp\u003eFayle did have the ability to be arrogant.\u003c/p\u003e\n\u003cp\u003eBefore the age of 30, he already advanced into an official Magus! This degree of progress even shocked his mentor.\u003c/p\u003e\n\u003cp\u003eFayle enjoyed giving this astonishment to others.\u003c/p\u003e\n\u003cp\u003eMoreover, with his title as a genius, the Purple-Gold Flower family took its initiative to rope him in, offering him an attractive contract.\u003c/p\u003e\n\u003cp\u003eThe restraints from the spirit contract were much looser than those given by the Academy.\u003c/p\u003e\n\u003cp\u003eAlthough he lost some freedom, it was insignificant compared to the knowledge of advancement and a rank 1 defensive spell model.\u003c/p\u003e\n\u003cp\u003eWithout these two items, he would never be able to advance into a rank 1 Magus; maybe to add one more item-Rainbow Potion!\u003c/p\u003e\n\u003cp\u003eFayle immediately thought of Bicky after recalling the Rainbow Potion. \"I guess that fool has already been killed off by her family?\"\u003c/p\u003e\n\u003cp\u003eHe smirked in disdain.\u003c/p\u003e\n\u003cp\u003ePreviously, if not for Bicky always sending him magic crystals and other resources, he would have already kicked her away already.\u003c/p\u003e\n\u003cp\u003eMoreover, Bicky unknowingly revealed that her family had a Rainbow Potion in their possession, so Fayle could not hold back from wanting it.\u003c/p\u003e\n\u003cp\u003eFirst, he put on an act to save her in the bloodbath to deepen their relationship. Afterwards, he told her of his concerns in advancement, and requested her to steal her family\u0027s treasure!\u003c/p\u003e\n\u003cp\u003e\"Hng! I, Fayle, will be a monarch unifying the south coast in future. Why would I even have my eyes on such trash?\"\u003c/p\u003e\n\u003cp\u003eFurthermore, according to some inside information, the Purple-Gold Flower family wanted to betroth a young girl to him. This was normally the methods used by Magi families to rope in genius Magi.\u003c/p\u003e\n\u003cp\u003eNot only could they bind him on their bandwagon, but they could also inject new heirs with superior bloodlines.\u003c/p\u003e\n\u003cp\u003e\"Men...Mentor, it\u0027s time to have lunch!\"\u003c/p\u003e\n\u003cp\u003eA shy voice sounded. It was a blonde female acolyte wearing grey robes. She was only about 11 or 12, where there was some baby fat on her cheeks.\u003c/p\u003e\n\u003cp\u003e\"En!\" Fayle acknowledged and caressed the girl\u0027s cheek.\u003c/p\u003e\n\u003cp\u003eThe girl\u0027s face reddened yet she did not dare to move, letting Fayle touch her. Finally, she left with an embarrassed expression.\u003c/p\u003e\n\u003cp\u003eAn insatiable lust could not be concealed in Fayle\u0027s eyes as he watched the girl\u0027s leaving figure.\u003c/p\u003e\n\u003cp\u003eFayle knew that he had some fetish towards this aspect. For example... He did not like mature women but only young girls!\u003c/p\u003e\n\u003cp\u003eThis little girl was an acolyte he had taken in after becoming an official Magus. As for why he took her under his wing, it was the Purple-Gold Flower family\u0027s request. On the other hand, it was also after seeing how she was this pure and lovable.\u003c/p\u003e\n\u003cp\u003eHe always felt it was disdainful to hide his desires.\u003c/p\u003e\n\u003cp\u003eMoreover, to outsiders, there was nothing wrong with that.\u003c/p\u003e\n\u003cp\u003eOfficial Magi always have special rights. Furthermore, if it was only this much the Purple-Gold Flower family had to invest in to get the teachings of an official Magus, the little girl was definitely benefitting from it.\u003c/p\u003e\n\u003cp\u003eFayle, whose robes was neat and tidy, sat on a long table.\u003c/p\u003e\n\u003cp\u003eBeside him was the little girl from before.\u003c/p\u003e\n\u003cp\u003eAround them, there was a dozen of maids and menservants quietly attending to their needs.\u003c/p\u003e\n\u003cp\u003eIn reality, there were the servants assigned by the Purple-Gold Flower family, so he did not have to waste a single coin.\u003c/p\u003e\n\u003cp\u003eMoreover, even this tower that he lived in was constructed by the Purple-Gold Flower family and sent to him by the initiative.\u003c/p\u003e\n\u003cp\u003eEvery time something like that happened, Fayle would be put in a good mood.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s today\u0027s lunch menu?\"\u003c/p\u003e\n\u003cp\u003e\"Fresh tenderloin beef, My Lord!\" An old housekeeper bowed and replied.\u003c/p\u003e\n\u003cp\u003eA pretty maid went open and opened the golden lid. An aroma of hot food wafted in the air. In the middle was a well-done beef tenderloin steak, coupled with soup and juice.\u003c/p\u003e\n\u003cp\u003eFayle expertly cut with the knife and used the silver fork to poke the meat.\u003c/p\u003e\n\u003cp\u003e\"This meat... Seemed to be redder than regular beef...\"\u003c/p\u003e\n\u003cp\u003eFayle spoke indifferently and placed the meat piece into his mouth...\u003c/p\u003e\n\u003cp\u003eAfter eating, Fayle used a white napkin to wipe his lips.\u003c/p\u003e\n\u003cp\u003e\"Today\u0027s beef flavour was pretty good, where did the beef come from?\"\u003c/p\u003e\n\u003cp\u003e\"My Lord! It was a meat vendor who approached our front door and pitched a sale. I saw that the steak quality was not bad, so I bought a few...\" The housekeeper reported.\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t this the outer vicinity of the Purple-Gold Flower family? There are actually meat vendors coming up to sell their goods?\"\u003c/p\u003e\n\u003cp\u003eFayle suddenly felt that it was absurd.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-127\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-129\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-128","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
