{"id":58685,"no":129,"title":"Chapter 129","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAn Incurable Curse\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Yes, I remember it clearly. That meat vendor wore a black hood, his dishevelled hair covering half his face. There was a metal hook on his left hand…”\u003c/p\u003e\n\u003cp\u003eThe housekeeper vividly recalled the memory of the meat vendor.\u003c/p\u003e\n\u003cp\u003e“This is really strange!” Fayle shook his head and looked at the little girl beside him.\u003c/p\u003e\n\u003cp\u003e“How is the construction of your mind runes coming on?”\u003c/p\u003e\n\u003cp\u003e“I have already constructed three but I can’t seem to construct the fourth! Also, inside the \u0026lt;All Living Things\u0026gt; biology…” The little girl reported back meekly.\u003c/p\u003e\n\u003cp\u003e“So it’s like this?” Fayle interlaced his fingers.\u003c/p\u003e\n\u003cp\u003e“Your progress is too slow. Tonight you must come to my room, I’ll be personally ‘coaching’ you!”\u003c/p\u003e\n\u003cp\u003e“Yes, Mentor!” The little girl replied softly.\u003c/p\u003e\n\u003cp\u003e*Dang Dang Dang!*\u003c/p\u003e\n\u003cp\u003eThe copper grandfather clock in the hall gave a resounding boom and the clock struck 12 times. The sky outside had already darkened and one could slightly see some visible blue stars.\u003c/p\u003e\n\u003cp\u003e“It’s already so late, why isn’t Nida here yet!”\u003c/p\u003e\n\u003cp\u003eFayle slammed opened the door with a loud bang, annoyance evidently seen on his face.\u003c/p\u003e\n\u003cp\u003e“Nida! Nida!” Fayle began to shout.\u003c/p\u003e\n\u003cp\u003eHis voice echoed throughout the silent hallway, reverberating for a long distance.\u003c/p\u003e\n\u003cp\u003eThe surroundings were in dead silence. Fayle could even hear his own breathing and the flow of his blood.\u003c/p\u003e\n\u003cp\u003e“Housekeeper! Housekeeper! Maids! Where are they?!”\u003c/p\u003e\n\u003cp\u003eImpatience began to show on his face, as he hurriedly put on his outer garments and stepped outside of the door.\u003c/p\u003e\n\u003cp\u003e*Dong Dong Dong!* The sound of leather boots striking the floor was heard.\u003c/p\u003e\n\u003cp\u003eA black figure walked slowly towards Fayle.\u003c/p\u003e\n\u003cp\u003e“Who? Who’s there?” Fayle called out warily, a silver short sword appearing in his hands.\u003c/p\u003e\n\u003cp\u003eNo matter how Fayle shouted, the footsteps maintained a constant pace that was neither too fast nor slow and walked towards him.\u003c/p\u003e\n\u003cp\u003eWhen the black figure drew closer, Fayle could almost see the full appearance of the figure.\u003c/p\u003e\n\u003cp\u003eIt was a middle-aged man who wore black robes. On his chest hung the trademark apron that butchers wore. On his head was a black hood, his dishevelled hair covering most of his face. What was especially attracting was his empty left sleeves. Instead, only a rusty metal hook was seen at the end of the sleeve.\u003c/p\u003e\n\u003cp\u003eThis description perfectly fit the one that the housekeeper mentioned earlier.\u003c/p\u003e\n\u003cp\u003e*Weng!*\u003c/p\u003e\n\u003cp\u003eThe silver short sword glinted and flew directly to the man with a whistling sound.\u003c/p\u003e\n\u003cp\u003e*Pu!* As if piercing through an illusion, ripples appeared on the meat vendor’s body and the silver short sword went through it.\u003c/p\u003e\n\u003cp\u003e“Illusory spell?!” Fayle’s lips started to move as he chanted a high pitched incantation.\u003c/p\u003e\n\u003cp\u003e*Xiu Xiu!*\u003c/p\u003e\n\u003cp\u003eA mixture of the sound of a quick panting on a metallic flute and like the sound of a rusty knife scraping against a metal continuously sounded, causing ripples in the air.\u003c/p\u003e\n\u003cp\u003eAfter the whistling sound ended, it was still absolute silence in the tall tower, as if the world only had Fayle and the meat vendor in it.\u003c/p\u003e\n\u003cp\u003eThe black robed man immediately raised his left hook and swung it at Fayle.\u003c/p\u003e\n\u003cp\u003e*Bubble!* From Fayle’s body, a layer of fluid formed transparent water shield, blocking the metal hook’s assault.\u003c/p\u003e\n\u003cp\u003eThis was Fayle’s innate spell which was finally activated in crucial moments!\u003c/p\u003e\n\u003cp\u003eSeizing this opportunity, Fayle hurriedly chanted and multiple frost spikes were shot towards the man.\u003c/p\u003e\n\u003cp\u003e*Pu!* *Pu!*\u003c/p\u003e\n\u003cp\u003eThe frost spikes entered the body and countless blood was spurted out. However, the man in the robes seemed not to be conscious about it, even his expression did not change, like that of a zombie who did not know pain. He continuously brandished his metal hook, causing ripples after ripples on the water shield.\u003c/p\u003e\n\u003cp\u003e“F*ck, what is this damned thing?”\u003c/p\u003e\n\u003cp\u003eFayle struck at the man in the robes for several more times before his mental fortitude seemed to be on the verge of collapse.\u003c/p\u003e\n\u003cp\u003eNo matter if it was physical or magical attacks, it all amounted to nothing when they landed on this man’s body.\u003c/p\u003e\n\u003cp\u003eInstead, every strike from this metal hook continuously consumed the energy needed to maintain the innate spell. Fayle could clearly feel that if the opponent were to attack several more times, his innate spell would completely shatter.\u003c/p\u003e\n\u003cp\u003e“Run!”\u003c/p\u003e\n\u003cp\u003eUnder the life or death crisis, Fayle felt as though he returned back to his acolyte days where he had to greet every Magus respectfully, before turning around and running away.\u003c/p\u003e\n\u003cp\u003e*Dong Dong Dong Dong!*\u003c/p\u003e\n\u003cp\u003eHearing the approaching footsteps of the man wearing the black robes resounding in his ears, it made Fayle run even faster.\u003c/p\u003e\n\u003cp\u003e20 metres!\u003c/p\u003e\n\u003cp\u003e10 metres!\u003c/p\u003e\n\u003cp\u003e5 metres!\u003c/p\u003e\n\u003cp\u003e1 metres!\u003c/p\u003e\n\u003cp\u003eFayle grabbed hold of the large main doors of the tall tower and dashed outside.\u003c/p\u003e\n\u003cp\u003e*Peng!* The door behind was closed shut. To Fayle’s utter dismay, he actually appeared inside his bedroom once again. Also, there was only a 3 metres distance between him and the man now!\u003c/p\u003e\n\u003cp\u003e“Damn it! Damn it! Damn it! What’s happening?”\u003c/p\u003e\n\u003cp\u003eFayle gritted his teeth and continued to run, yet returning to his room every time.\u003c/p\u003e\n\u003cp\u003eFinally, tears and mucus ran down Fayle’s face as he returned yet again to his room and closing the door shut tightly.\u003c/p\u003e\n\u003cp\u003e*Dong! Dong!* The knocking sounds that were the footsteps of the death god. Fayle felt that every step was stepping directly on his heart.\u003c/p\u003e\n\u003cp\u003e“Mentor! Papa! Mama! Save me!”\u003c/p\u003e\n\u003cp\u003eFayle crouched behind the door, crying like a little child.\u003c/p\u003e\n\u003cp\u003eAs if hearing his pants, the booming footsteps halted. Finally, when it was just one step away from the door, it disappeared….\u003c/p\u003e\n\u003cp\u003eFayle was pale stricken as he waited for a good half hour before his trembling hands opened the door, only to see no one there.\u003c/p\u003e\n\u003cp\u003e“Hu....”\u003c/p\u003e\n\u003cp\u003eFayle exhaled a large breath and collapsed to the ground as if all the bones had been removed from his body.\u003c/p\u003e\n\u003cp\u003e“It’s finally gone! I must write a letter to Mentor tomorrow and let him check what had transpired…”\u003c/p\u003e\n\u003cp\u003eFayle closed the door.\u003c/p\u003e\n\u003cp\u003eSuddenly, just when he had turned around, a dishevelled face appeared right before him.\u003c/p\u003e\n\u003cp\u003eWhat came closely following it was a black metal hook!\u003c/p\u003e\n\u003cp\u003e*Pu!* This time, the black metal hook directly broke through Fayle’s defensive forcefield and gouged his right eyeball out.\u003c/p\u003e\n\u003cp\u003eThe moment his eye was hooked out, black and red viscous liquid mixture flowed out.\u003c/p\u003e\n\u003cp\u003eThe man seemed to be unsatisfied as his sent his hook at Fayle’s head again!\u003c/p\u003e\n\u003cp\u003e*Bang!* Fayle’s body was sent to the ground from the force. The metal hook bore through his brains deeply. Fayle was still unconsciously writhing before he lost all signs of life.\u003c/p\u003e\n\u003cp\u003e*Brush!*\u003c/p\u003e\n\u003cp\u003eFollowing wipe, the man in black robes immediately withdrew a greasy bone saw and began to expertly dissect Fayle’s corpse.\u003c/p\u003e\n\u003cp\u003eAfter the dissection, Fayle’s muscles had been completely stripped clean. The colour of it too turned even redder, revealing the veins of blood, similar to that found in the beef tenderloin!\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eWinding the time back to yesterday morning.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eThe black robed man knocked on the kitchen’s door of the tall tower, revealing a hideous smile. “Do you want to buy meat? I have good tenderloin steak for sale…”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eSeveral \u003ci\u003eli \u003c/i\u003eaway from Fayle’s tall tower, Leylin looked at a spell formation with a solemn expression.\u003c/p\u003e\n\u003cp\u003eIn the centre of the formation, a black flame was flickering, in the heart of it was the scene of Fayle’s ending.\u003c/p\u003e\n\u003cp\u003eWith the images continuously flashing by, Leylin stared at the image without blinking, mysteriously chanting at the same time.\u003c/p\u003e\n\u003cp\u003eFinally, after the black robed man killed Fayle and scoured his flesh clean, Leylin’s expression loosened.\u003c/p\u003e\n\u003cp\u003e*Pa!* The black coloured spell formation collapsed.\u003c/p\u003e\n\u003cp\u003eThe surroundings immediately quietened down and a dead silence followed after.\u003c/p\u003e\n\u003cp\u003e*Dong Dong!*\u003c/p\u003e\n\u003cp\u003eThe black robed man inside the image earlier appeared in front of Leylin.\u003c/p\u003e\n\u003cp\u003e“You’re here now?” Leylin seemed to have expected it, with no shocked expression on his face.\u003c/p\u003e\n\u003cp\u003e“Shihiohj” The black robed man let off several indiscernible words and charged towards Leylin.\u003c/p\u003e\n\u003cp\u003e*Bang!* The black metal hook was grabbed by a scaly palm.\u003c/p\u003e\n\u003cp\u003eLeylin faced the black robed man and could even see the crude construction of his facial features.\u003c/p\u003e\n\u003cp\u003e“Look into my eyes!” Leylin spoke gently with a hissing voice like that of a snake’s.\u003c/p\u003e\n\u003cp\u003eThe black robed man unconsciously looked into Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003eAt this moment, there were some phenomenal changes in Leylin’s eyes — both his eyes turned into vertical pupils, letting off the crystal glow like amber!\u003c/p\u003e\n\u003cp\u003eInnate spell—Eye of Petrification!\u003c/p\u003e\n\u003cp\u003e*Ka-Cha!* *Ka-Cha!* A grey-white colour extended from the man’s face to his whole body.\u003c/p\u003e\n\u003cp\u003eSeveral seconds later, the black-robed man completely turned into a grey-white statue.\u003c/p\u003e\n\u003cp\u003e“Seize the chance!” Leylin picked up the grey statue and tossed it into the heart of the black formation!\u003c/p\u003e\n\u003cp\u003e*Crash!* The stone statue shattered in pieces, from it grayish-white gases appeared as if wanting to form into a human figure.\u003c/p\u003e\n\u003cp\u003e“Dust to dust, earth to earth, return to where you came from!”\u003c/p\u003e\n\u003cp\u003eLeylin chanted in the ancient Byron language.\u003c/p\u003e\n\u003cp\u003eA black circular whirlpool suddenly appeared in the middle of the formation. With a huge suction force, it sucked in the grey-white gas in.\u003c/p\u003e\n\u003cp\u003eAfter the whirlpool disappeared, Leylin then heaved a sigh of relief and collapsed to the ground.\u003c/p\u003e\n\u003cp\u003e“Such a curse cannot be easily activated by anyone!” Leylin smiled wryly.\u003c/p\u003e\n\u003cp\u003eAfter destroying all traces of Clayde, Leylin hurried along the way as he brewed the Serenity Potion, finally suppressing the emotional fluctuations that Warlocks had.\u003c/p\u003e\n\u003cp\u003eHowever after some thought, he wanted to see things come to an end. So he decided to kill Fayle before escaping the area.\u003c/p\u003e\n\u003cp\u003eThe Lilytell family would definitely have a wanted list on him through the Abyssal Bone Forest Academy, so what if he were to add another pursuer, the Purple-Gold Flower family to it? Anyway, it was the wanted list put up by Abyssal Bone Forest Academy, so having one or two families chasing after him had no difference.\u003c/p\u003e\n\u003cp\u003eFurthermore, Leylin saw a rank 1 curse spell inside the Book of Giant Serpent. It could completely kill Fayle with no one the wiser, and no trouble would come after him.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin did not think that this curse was this malicious, it would even reverse the sorcery on the spell caster!\u003c/p\u003e\n\u003cp\u003eThis left him with some lingering fear, especially after seeing the monstrous way Fayle was killed.\u003c/p\u003e\n\u003cp\u003eThese rank 1 spell requirements were extremely harsh.\u003c/p\u003e\n\u003cp\u003eFirst of all, he had to cast a Darkness body and use the opponent’s trace of scent, if not it could not be casted.\u003c/p\u003e\n\u003cp\u003eAfterwards, it required one to know the basics of spirit bodies. Fortunately, Leylin had amassed some experience in Extreme Night City, so he picked it up rather quickly.\u003c/p\u003e\n\u003cp\u003eFinally, this curse had a limitation which was the distance. Moreover, it could only attack a target that had lower stats than the spell caster.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-128\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-130\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-129","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
