{"id":58691,"no":135,"title":"Chapter 135","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAngler Town\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e[Modifying the Fallen Star Pendant’s runes inscription, increasing illusory runes to make Host compatible with its control.]\u003c/p\u003e\n\u003cp\u003eA.I. Chip sounded at this very moment.\u003c/p\u003e\n\u003cp\u003eBlue light flashed across Leylin’s eyes, and many transparent patterns began appearing on the surface of the Fallen Star Pendant.\u003c/p\u003e\n\u003cp\u003eNext, all he needed to do was to proceed with the modifications according to the transparent patterns on the Fallen Star Pendant.\u003c/p\u003e\n\u003cp\u003eAnd the A.I. Chip could assist Leylin during his inscription process, so there would not be any mistakes.\u003c/p\u003e\n\u003cp\u003eUsing a pair of tweezers to fish the Fallen Star Pendant onto a white cloth, Leylin took out a solid inscription pen and started to finely carve on the surface of the cross.\u003c/p\u003e\n\u003cp\u003eAt this point, his hand was like a steel sculpture — it was as steady as possible, without even a single tremor.\u003c/p\u003e\n\u003cp\u003eThis required an enormous amount of attentiveness and endurance and consumed a lot of time and energy.\u003c/p\u003e\n\u003cp\u003eAs time passed, beads of sweat started to drip from Leylin’s forehead.\u003c/p\u003e\n\u003cp\u003e[Fallen Star Pendant’s runes modification is a success! It has newly added reinforced runes, energy dissipation runes, extension runes...]\u003c/p\u003e\n\u003cp\u003eAs he listened to A.I. Chip’s reminders, Leylin revealed a smile.\u003c/p\u003e\n\u003cp\u003eImmediately, he picked up another inscription pen from beside him. It had grooves on its body and was just as solid.\u003c/p\u003e\n\u003cp\u003e“Next, I shall fill in these carvings!”\u003c/p\u003e\n\u003cp\u003eLeylin lit two beakers and proceeded to melt the raw materials he had separated earlier from the magic artifacts. Those beakers now contained only liquids.\u003c/p\u003e\n\u003cp\u003eSubsequently, Leylin followed a fixed proportion and mixed the two liquids together.\u003c/p\u003e\n\u003cp\u003eLeylin played with the grooves on the pen and it split open, revealing a hole to pour water into.\u003c/p\u003e\n\u003cp\u003eImmediately, he poured the concentrated silvery black liquid into the body of the pen.\u003c/p\u003e\n\u003cp\u003eFine runes started to twinkle and flicker around the inscription pen, producing an enchanting radiance.\u003c/p\u003e\n\u003cp\u003eWith a face of satisfaction, Leylin pushed the pen nib against the tracks of the inscriptions carved earlier on, repeating the process again.\u003c/p\u003e\n\u003cp\u003eBut this time, the pen left silvery black liquid in its trail, filling every notch of the inscription.\u003c/p\u003e\n\u003cp\u003eAfter finishing the last stroke, Leylin sized up the completely reformed cross and nodded his head with satisfaction.\u003c/p\u003e\n\u003cp\u003e“Activate!”\u003c/p\u003e\n\u003cp\u003eLeylin used the ancient Byron language and read out two words.\u003c/p\u003e\n\u003cp\u003e*Pong* A cylindrical beam of gray light began to emit from the cross. Threads of silver light were moving along the rune inscriptions that Leylin had carved earlier.\u003c/p\u003e\n\u003cp\u003eAs the silvery gray rays kept blending, they got brighter and eventually engulfed the Fallen Star Pendant in it.\u003c/p\u003e\n\u003cp\u003eWhen the rays completely vanished, the Fallen Star Pendant had changed in appearance entirely.\u003c/p\u003e\n\u003cp\u003eIt only retained the shape of the cross but was bulkier than before.\u003c/p\u003e\n\u003cp\u003eAlso, it had changed from a silvery black colour to a shade of dark red.\u003c/p\u003e\n\u003cp\u003eOn the surface there were numerous fine and detailed rune inscriptions, causing the original fragments of gems to be concealed beneath it.\u003c/p\u003e\n\u003cp\u003eLeylin then took the dark red Fallen Star Pendant, noting its weight was heftier than before.\u003c/p\u003e\n\u003cp\u003e[Beep! Fallen Star Pendant’s upgrade is now successful with those middle-grade magic artifacts! Current Physical Defence: 24, Magic Defence: 25!] A.I. Chip sounded again, bringing Leylin the good news.\u003c/p\u003e\n\u003cp\u003e“Physical defence rose from 13 to 24, and magic defence rose from 15 to 25! Not bad, really not bad!”\u003c/p\u003e\n\u003cp\u003eThis range almost surpassed the Scales of Kemoyin\u0027s defense. It was almost equivalent to gaining another innate defensive spell. Leylin was naturally very pleased.\u003c/p\u003e\n\u003cp\u003eBut there were a lot of other magic artifacts that have better innate spells. The would have another increase in power and defense in the future.\u003c/p\u003e\n\u003cp\u003eAs for the Fallen Star Pendant, unless he finds even more precious materials to upgrade, it would be difficult to increase its defensive characteristics as per Leylin’s requirements.\u003c/p\u003e\n\u003cp\u003eHence, in the long run, concentrating on his own innate spells was more dependable.\u003c/p\u003e\n\u003cp\u003e“In the south coast, acolyte ranks use beginner grade magic artifacts. Level 1 Magi use middle-grade magic artifacts and the occasional beginner grade magic artifacts. Only the extremely powerful level 2 Magi have the capability to get hold of high-grade magic artifacts!”\u003c/p\u003e\n\u003cp\u003eLeylin thought of the information he saw from the Book of Giant Serpent.\u003c/p\u003e\n\u003cp\u003eAlthough the era of the great Magus Serholm was somewhat distant, the general distribution of power and culture throughout the south coast could be seen.\u003c/p\u003e\n\u003cp\u003eNow that the Fallen Star Pendant had been promoted to a middle-grade magic artifact, it’s effective for Leylin as a level 1 Warlock. This, of course, put him in a good mood.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Great Canyon Margaret spanned across the Inlan Dukedom and several nearby kingdoms. It was also a place that was necessary to travel through to enter the Ennea Ivory Ring Tower, controlled by the Light Magi.\u003c/p\u003e\n\u003cp\u003eOf course, this was only with regards to Magi.\u003c/p\u003e\n\u003cp\u003eOrdinary citizens of this dukedom seldom step out of the kingdom, from their birth until their death. Even their mercenaries only received missions within the kingdom.\u003c/p\u003e\n\u003cp\u003eMercenaries and wandering bards who had travelled the vicinity could use the experience they gained to flaunt or gain respect.\u003c/p\u003e\n\u003cp\u003e“Great Canyon Margaret is filled with danger. Even a hastened journey takes several months…”\u003c/p\u003e\n\u003cp\u003eLeylin slightly frowned as he thought over the information about the Great Canyon.\u003c/p\u003e\n\u003cp\u003eTransportation in the Magus World was inconvenient, causing a great deal of inconvenience for magicians who travel far and wide.\u003c/p\u003e\n\u003cp\u003eOf course, he had another choice — he could ride in an airship.\u003c/p\u003e\n\u003cp\u003eBut unfortunately, not only was this mode of transportation costly, there was only a fixed number of dates per year for its departure. Furthermore, there were stringent requirements for passengers. They needed a local family or an organisation to be their guarantor.\u003c/p\u003e\n\u003cp\u003eLeylin was already on the wanted list of Abyssal Bone Forest Academy. So naturally, he wouldn’t wait for the airship and had to rush by foot.\u003c/p\u003e\n\u003cp\u003e“Your parent’s good friend, that Aunt Marian, where does she live?”\u003c/p\u003e\n\u003cp\u003eLeylin asked Ivy, who was behind him.\u003c/p\u003e\n\u003cp\u003e“Angler Town beside the Great Canyon!” Ivy said in a low voice.\u003c/p\u003e\n\u003cp\u003eLeylin nodded. This girl’s blood had greatly helped him. Besides, there was no clash in the itinerary. Under such circumstances, he didn’t mind lending a helping hand.\u003c/p\u003e\n\u003cp\u003e\"Well then! I will first send you to Angler Town to find your Aunt Marian!\"\u003c/p\u003e\n\u003cp\u003eLeylin told Ivy.\u003c/p\u003e\n\u003cp\u003e“L...Lord! Is it okay if I followed you around?”\u003c/p\u003e\n\u003cp\u003eAfter what Leylin said, Ivy stayed silent for a moment before asking this question.\u003c/p\u003e\n\u003cp\u003e“Oh? But why? I did not treat you very well!”\u003c/p\u003e\n\u003cp\u003eLeylin was surprised. When he crossed over, he was from nobility, a respected Magus acolyte. He’d never taken care of anyone before. Ivy even suffered a small illness on this journey. Things would have taken a bad turn if Leylin wasn’t a Potions master.\u003c/p\u003e\n\u003cp\u003eMoreover, every now and then, Leylin had to take from Ivy a big tube of blood. He simply could not comprehend why this girl would still want to continue following him.\u003c/p\u003e\n\u003cp\u003eMaybe, I was too charming? Or was she so oppressed that twisted feelings began emerging?\u003c/p\u003e\n\u003cp\u003eLeylin let his imagination run as he rubbed his chin.\u003c/p\u003e\n\u003cp\u003e“Is this for revenge?” But, he soon figured out what the girl had in mind.\u003c/p\u003e\n\u003cp\u003eIvy lowered her head, obviously tacitly agreeing.\u003c/p\u003e\n\u003cp\u003e“Ivy you should be aware that due to the genetic constitution of your family, before you can find the lost meditation technique, you’ll never be able to be an apprentice. Even I can’t do anything about it!”\u003c/p\u003e\n\u003cp\u003eOnly because Ivy and Leylin were inheritors of the same ancient bloodline, he felt that he should clarify it with her.\u003c/p\u003e\n\u003cp\u003e“I know! But I request from you to get me vengeance! For this reason, I’m willing to suffer any consequence!”\u003c/p\u003e\n\u003cp\u003eThe little girl made her last effort.\u003c/p\u003e\n\u003cp\u003e“My apologies. Magus advocate fair transactions. And regardless of your wealth, health or spirit, it is not enough for me to deal with another official Magus!”\u003c/p\u003e\n\u003cp\u003eLeylin did not hesitate to reject the girl’s plea.\u003c/p\u003e\n\u003cp\u003eUpon hearing Leylin’s ruthless yet very real words, Ivy’s shoulders trembled, hugged her knees as she sat in the carriage and fell silent.\u003c/p\u003e\n\u003cp\u003eSoon, the carriage entered Angler Town.\u003c/p\u003e\n\u003cp\u003eThis was obviously a Magus gathering area. There were little, almost none, ordinary people, and the architecture of the buildings around portrayed a gloomy style that appeared cold and weird. Even the atmosphere was filled with a moist putrefying stench.\u003c/p\u003e\n\u003cp\u003e“This kind of place doesn’t seem very good!”\u003c/p\u003e\n\u003cp\u003eLeylin frowned. According to his experience, these kinds of dangerous district beside the major transportation road, dwells those who harbors bad thoughts, Magus who have nowhere to turn to. Simply put, wanted criminals!\u003c/p\u003e\n\u003cp\u003eLeylin felt bad for Ivy. They followed the street and eventually got to the number plate Ivy had reported before.\u003c/p\u003e\n\u003cp\u003eAppearing in front of Leylin was a dilapidated two-story loft. Black wooden planks on the verge of collapsing revealed a decadent atmosphere.\u003c/p\u003e\n\u003cp\u003eThe first floor had been converted to look like a grocery store. But it didn\u0027t seem to be doing very well, and the people who entered were but a few.\u003c/p\u003e\n\u003cp\u003eParking the carriage at a side, Leylin pulled Ivy’s hand as they entered the grocery store.\u003c/p\u003e\n\u003cp\u003e“Marian! Is Marian here?” Leylin yelled out. He did not attempt to conceal the energy fluctuations in his body as the road to Angler Town was unimpeded.\u003c/p\u003e\n\u003cp\u003e“Respected Magus Lord, how may I serve you?”\u003c/p\u003e\n\u003cp\u003eBefore Leylin could finish his words, an obese middle-aged lady with a greasy grey apron and thick makeup made her way out, expressing humility and flattery.\u003c/p\u003e\n\u003cp\u003eIf it wasn’t for the level 3 acolyte’s aura she had on her body, with this kind of image, she looked exactly like an unkind housewife.\u003c/p\u003e\n\u003cp\u003e“Is this Marian?” Leylin asked Ivy who was standing at a corner.\u003c/p\u003e\n\u003cp\u003e“Yes… Yes!” Ivy nodded her head. Leylin finally understood why Ivy was so unwilling.\u003c/p\u003e\n\u003cp\u003eBy the looks of it, Ivy’s parents probably did not have anyone else to turn to back then. Hence, they allowed their housekeeper to send Ivy to Marian.\u003c/p\u003e\n\u003cp\u003e“This is Ivy! Any impression?” Leylin pulled Ivy in front of him.\u003c/p\u003e\n\u003cp\u003e“John’s daughter?!” Marian’s face changed slightly. “About the Langster family matter, I feel sad…” Marian said as she squeezed out a few drops of tears.\u003c/p\u003e\n\u003cp\u003e“...Back then, I just happened to pass by and the housekeeper begged me to bring her here…”\u003c/p\u003e\n\u003cp\u003eLeylin briefly spoke about the cause and effects.\u003c/p\u003e\n\u003cp\u003eUpon hearing that she has to offer shelter for Ivy again, Marian’s face completely turned embarrassed, as if things were already difficult for her. Leylin reckoned, if he wasn’t around, Ivy would have already been chased away.\u003c/p\u003e\n\u003cp\u003e\"Since it is what the Lord wants, then alright!\" She replied with an ugly smile after struggling for a long time.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-134\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-136\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-135","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
