{"id":58694,"no":138,"title":"Chapter 138","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eLimestone Wasteland\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Are you kidding… Argh...”\u003c/p\u003e\n\u003cp\u003eThe huge bloke had a sinister smile, but soon after he gave a miserable shriek.\u003c/p\u003e\n\u003cp\u003eThe surrounding Magi also cried out in surprise, as if they’d seen something unbelievable.\u003c/p\u003e\n\u003cp\u003eRight in front of them, the huge bloke’s belly began to slowly swell, taking the shape of a bulge.\u003c/p\u003e\n\u003cp\u003eThinking back to what Leylin said earlier, Lancey was fearful yet relieved that she did not touch the Brownstone Singer like she wanted to.\u003c/p\u003e\n\u003cp\u003eLooking at the big bloke freaking out and hurrying back into his tent, drinking and consuming all sorts of items with medicinal properties, smiles were seen hanging on the faces of all the people at the site...\u003c/p\u003e\n\u003cp\u003eAfter appreciating the spectacle, they rested for the night and carried on their journey the next day.\u003c/p\u003e\n\u003cp\u003eThe huge bloke had also recovered, but his complexion did not look very good.\u003c/p\u003e\n\u003cp\u003eWhere magicians were concerned, to induce an abortion or to do a caesarean section, it was a small and simple operation that even one man could handle.\u003c/p\u003e\n\u003cp\u003eThe effects of the Brownstone Singer might be frightening to a normal person. But for magicians, it was more of a practical joke than something to be feared.\u003c/p\u003e\n\u003cp\u003e“Due to the Grand Canyon Margaret’s topography, it became a paradise for many exotic creatures. Legends have it that you can still find trails of those that were said to be endangered or extinct here….”\u003c/p\u003e\n\u003cp\u003eLeylin secretly thought, as he saddled the Seated Lupin Wolf, and watched the surroundings slowly changed into an ash-gray rocky forest.\u003c/p\u003e\n\u003cp\u003eIf it wasn’t because of Grand Canyon Margaret’s complex and ever-changing topography, and the huge sandstorm encircling it for a good part of the year, this canyon would have long became a natural resource mine for the magicians.\u003c/p\u003e\n\u003cp\u003eAs time slowly passed by, the ash-gray rocky forest around Leylin and the others became shorter and shorter. Eventually, their surrounding only had fragmented small stones, resembling a barren land.\u003c/p\u003e\n\u003cp\u003e“Limestone Wasteland. We’ve already merged into the standard route. In the next ten days or so, we’ll be more at ease. But following this will be the frightful Golden Desert, where the Kary Vultures gather. Everyone should maintain their energy, and prepare for the upcoming battle…”\u003c/p\u003e\n\u003cp\u003eThe lead, an old geezer, yelled uninterrupted, as he rode a Seated Lupin Wolf that had a few strands of white beard on its face.\u003c/p\u003e\n\u003cp\u003e“Limestone Wasteland? A.I. Chip, bring out the map!” Leylin slightly lowered his head as a projection that only he could see was emitted.\u003c/p\u003e\n\u003cp\u003eOn a simple map, there were general markings of the danger zones within the Grand Canyon Margaret. In the center, there was a twisted green route, that was linked from one side of the map to the other.\u003c/p\u003e\n\u003cp\u003e‘Kary Vultures Gathering Place’ was marked with an eye-catching red font, that was in the center of the green line which they have to pass through.\u003c/p\u003e\n\u003cp\u003eOn the other two sides of the route, there were other extremely dangerous zones marked scarlet, which indicated that they cannot be traversed.\u003c/p\u003e\n\u003cp\u003eThis only meant that making a detour was impossible.\u003c/p\u003e\n\u003cp\u003eIf Leylin and the rest want to safely get across the Grand Canyon Margaret, the only way was to banish the Kary Vultures obstructing the route.\u003c/p\u003e\n\u003cp\u003e“Limestone Wasteland!”\u003c/p\u003e\n\u003cp\u003eLeylin found the range of the Limestone Wasteland on the blue map. It was a big ash-gray region.\u003c/p\u003e\n\u003cp\u003eSmall words were written beside the region: “Limestone Wasteland! Verified as having an extremely low level of risk, and no high-energy life form was ever seen…”\u003c/p\u003e\n\u003cp\u003eObviously, the Grand Canyon Margaret was explored by countless magicians on both sides and this was the best route to take to get across the canyon as it held the least risk.\u003c/p\u003e\n\u003cp\u003eAs expected, once they entered the Limestone Wasteland, Leylin felt the Seated Lupin Wolf’s muscles and fur slightly loosen up, as if entering a relatively relaxed state.\u003c/p\u003e\n\u003cp\u003e“The concentration of energy in the air here is very less as if the air has some kind of leakage and causes the energy within it to be vaporised.”\u003c/p\u003e\n\u003cp\u003eLeylin snapped his fingers and a small ball of flame appeared on his palm. It trembled in the breeze as if it could be extinguished at any time.\u003c/p\u003e\n\u003cp\u003eIf it were outside of this area, this small flaming wisp would be burning brightly, several folds brightly than now and its power would have been 1 degree or more.\u003c/p\u003e\n\u003cp\u003e“AI Chip, calculate this flame’s power.”\u003c/p\u003e\n\u003cp\u003e[Beep! Mission objective noted. Analysing the target. . . .completed! Flame’s power is 0.4238 degrees.] The AI Chip outputted the required data very quickly.\u003c/p\u003e\n\u003cp\u003e“As expected. The energy concentration in the air has been reduced. To cast spells here with complete power will cost even more strength than if cast outside of this place...”\u003c/p\u003e\n\u003cp\u003eMagicians and magical beasts all use the energy particles within the air to perform all sorts of unimaginable and marvellous magic. If the energy concentration in the air was less, the power of the spell cast will also be reduced.\u003c/p\u003e\n\u003cp\u003eMoreover, if a living being stayed in this place for a long time, it might undergo mutation.\u003c/p\u003e\n\u003cp\u003eAs for those beings who knew magic, they would abhor these kinds of regions.\u003c/p\u003e\n\u003cp\u003e“This type of area, the Limestone Desert, looks like it was caused by a war between two highly-ranked Magi, as stated in the Book of Giant Serpent!”\u003c/p\u003e\n\u003cp\u003eLeylin now begins to believe the legend; the Grand Canyon Margaret was created by two great Magi during their battle.\u003c/p\u003e\n\u003cp\u003eBut the Limestone Wasteland’s desert-like appearance was a good thing for travellers like them.\u003c/p\u003e\n\u003cp\u003eAt least, there was no need to worry about random, exotic species ambushing them along the way. They could rest and conserve energy.\u003c/p\u003e\n\u003cp\u003eThis tranquil life lasted fifteen days.\u003c/p\u003e\n\u003cp\u003eAlong the way, there experienced some bad weather and other situations. But it was not an issue for Leylin, who was a well-prepared magician.\u003c/p\u003e\n\u003cp\u003eThe night before they were to walk out of this Limestone Wasteland, the old geezer, who was leading them all, and Lancey, gathered the six Magi .\u003c/p\u003e\n\u003cp\u003e\"Starting tomorrow, we will be out of the Limestone Desert, and entering the Golden Desert!\"\u003c/p\u003e\n\u003cp\u003eUnder the illuminating flame, the old geezer’s wrinkled face showed uncertainty as his pair of pupils shone.\u003c/p\u003e\n\u003cp\u003e“At the heart of the Golden Desert, the third supply spot that we will pass by has been occupied by the abominable Kary Vultures. The reason why we formed small teams, was mostly for this! Now, it’s time to make the final decision!”\u003c/p\u003e\n\u003cp\u003eThe old and tiny geezer looked around: “Will we kill the Vulture King as mentioned before, or merely expel them?”\u003c/p\u003e\n\u003cp\u003e“What else? Of course, we kill it!” The huge bloke who was teased by the Brownstone Singer took the lead and voiced out first.\u003c/p\u003e\n\u003cp\u003e\"Materials made from the Vulture King can be sold for sell tens of thousands of magic crystals, and bar owners from both ends of the canyon will give extra rewards. Is there anything better than this?\"\u003c/p\u003e\n\u003cp\u003eThis was mentioned by the bartender from the Broken Axe Pub, who gave this small team an impromptu mission —— Kill the Kary Vulture King, do not let it leave alive!\u003c/p\u003e\n\u003cp\u003eOnce this is done, not only will the materials obtained from the Vulture King belong entirely to the group, the pubs on both sides will also give a generous amount of magic crystals as a reward.\u003c/p\u003e\n\u003cp\u003eBecause of the existence of the Kary Vultures, it had caused issues for cargos that were transported back and forth the canyon. It seems that the people involved can no longer tolerate it.\u003c/p\u003e\n\u003cp\u003eAnd the Kary Vultures were very vengeful creatures. If the Vulture King wasn’t killed, it would gather more of its kind and hunt down any visible Magi.\u003c/p\u003e\n\u003cp\u003eThe impromptu team Leylin was with, had a short discussion at the bar and agreed to the bartender’s proposal.\u003c/p\u003e\n\u003cp\u003eAfter all, official Magi all lacked resources. They couldn’t afford to miss any opportunity to accumulate more resources.\u003c/p\u003e\n\u003cp\u003eWhat the old geezer had put forward, was only to make a final confirmation.\u003c/p\u003e\n\u003cp\u003e“Of course!” “Well, did we not agree on this before?”\u003c/p\u003e\n\u003cp\u003eThe huge bloke’s words caused a resonance, and Leylin gently agreed. As long as it was appropriate, he did not mind giving his vote and gain some magic crystals.\u003c/p\u003e\n\u003cp\u003e“Great!” The old geezer smiled till the wrinkles on his face gathered together, resembling a chrysanthemum.\u003c/p\u003e\n\u003cp\u003eSeeing him like this, Leylin reckoned the Vulture King had an important material that the old geezer needed. Otherwise, he wouldn’t have been so into this.\u003c/p\u003e\n\u003cp\u003e“Good! Then I\u0027ll delegate tasks to everyone accordingly. The Kary Vultures are very cunning, their ability to fly makes battling them extremely troublesome. Those of you who know rank 1 flying magic ......”\u003c/p\u003e\n\u003cp\u003eThe leader old geezer started to deploy everyone.\u003c/p\u003e\n\u003cp\u003eContrastingly Leylin remained uncommunicative; he did not voice out his expertise. He ended up with the role of assisting the attacker.\u003c/p\u003e\n\u003cp\u003eThe old geezer’s arrangement was quite fair. In accordance with the principles of “work more, get more”, every magician was assigned a job within their capabilities and developed a detailed plan.\u003c/p\u003e\n\u003cp\u003eHowever, during the planning, the flying magicians who were tasked as attackers and responsible for intercepting had the privilege of selecting the spoils of war.\u003c/p\u003e\n\u003cp\u003eAnd the old geezer just had a showcase of his strange flying magic.\u003c/p\u003e\n\u003cp\u003eFlying was still a relatively rare ability amongst the rank 1 Magi. Not only is the specialised rank 1 flying magic rarely seen, it is also not practical.\u003c/p\u003e\n\u003cp\u003eNot unless they managed to obtain a few magic artifacts that could aid flying, like Bosain.\u003c/p\u003e\n\u003cp\u003eBut, as far as rank 1 Magi were concerned, only middle-grade magic artifacts would be deemed useful. For example, that item in Bosain’s hand — the liquefying metallic ball, called ‘Bright Silver’. Although it was very useful for one at the acolyte level, for an official Magus it would have very low power and be considered to be very weak. The most important factor, speed, of that artifact had not reached a suitable standard and to use it to assist with flying would only be seen as a joke!\u003c/p\u003e\n\u003cp\u003eIt was still rare to be able to master the rank 1 flying magic like that old geezer leader.\u003c/p\u003e\n\u003cp\u003eA pair of pale green wings grew on the back of the old geezer. When he soared into the sky, Leylin keenly felt the currents and particles in the wind fluctuate. Evidently, the old geezer was a Magus who specialized in Wind element energy particles.\u003c/p\u003e\n\u003cp\u003e[According to the quantity of energy particles dispelled from the target’s, determined to be of Wind element. Essence element conversion is 15-20%!]\u003c/p\u003e\n\u003cp\u003eA fine beam of blue flashed across Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip could now judge other magicians during sudden bursts of energy, to determine the general stats of the opposite party.\u003c/p\u003e\n\u003cp\u003eBut to get the most accurate data, it would still have to break through the protective force field of the target.\u003c/p\u003e\n\u003cp\u003eUnless he met a tenacious enemy, Leylin would never do something like that.\u003c/p\u003e\n\u003cp\u003eBefore a rank 1 Magi’s force field can be broken, the moment Leylin uses A.I. Chip to break through into the opponent’s protective force field, it’s as if Leylin had used his hands to peel off the other party’s clothes. It would definitely lead to some extreme hatred from the other party. Leylin did not wish to make more enemies.\u003c/p\u003e\n\u003cp\u003eOr maybe he could wait for the A.I. Chip to upgrade again, and then he could break through into the other magician’s force field without him noticing.\u003c/p\u003e\n\u003cp\u003eLeylin kept calculating in his heart, as he looked forward to such an ability.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-137\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-139\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-138","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
