{"id":58709,"no":153,"title":"Chapter 153","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eSeeking Entry\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Come on! I specially got someone to bring this black tea all the way from the eastern islands!”\u003c/p\u003e\n\u003cp\u003eThe simplistically carved wooden teacup was giving off steam, which vaporised into the air, bringing about the fragrance of brewed tea.\u003c/p\u003e\n\u003cp\u003eWith a hospitable smile on his face, the red-haired Crew brought a cup of black tea to Leylin.\u003c/p\u003e\n\u003cp\u003eSometime after Leylin finished consuming the crystals and made the decision to be a resident of the Nightless City, he bought a gift and paid the Magus Crew a visit.\u003c/p\u003e\n\u003cp\u003e“Come, this is a honey cake made from the honey of Pomelo Bees! The taste is delicious!”\u003c/p\u003e\n\u003cp\u003eAfter seeing Leylin drink the red tea, old Crew directed one of his maidservants to serve a plate of extremely sweet mini cake.\u003c/p\u003e\n\u003cp\u003eThe maidservants wore extremely exposing uniforms, only covering the few crucial areas. Most of her glossy skin was out in the open, which looked extremely alluring.\u003c/p\u003e\n\u003cp\u003e“If you like them, I can gift you a few!”\u003c/p\u003e\n\u003cp\u003eCrew laughed absent-mindedly.\u003c/p\u003e\n\u003cp\u003e“Please don’t tease me!” Leylin shook his head as he forced a smile. “Haven’t I already told you the purpose of this visit?”\u003c/p\u003e\n\u003cp\u003eAt the mention of getting down to business, Crew’s expression became stern.\u003c/p\u003e\n\u003cp\u003eHe waved his hands, and the maidservants in the surroundings bowed deeply, before quickly taking their leave. They were obviously trained and did not make any sound as they retreated.\u003c/p\u003e\n\u003cp\u003e“Do you wish to join an organisation in Nightless City?”\u003c/p\u003e\n\u003cp\u003eCrew’s expression was solemn.\u003c/p\u003e\n\u003cp\u003e“Yes, for the sake of high-grade information and some precious ingredients needed in experiments…”\u003c/p\u003e\n\u003cp\u003eWhat Leylin said was the truth. Obviously, he could brew his own potions and earn magic crystals, leading a very comfortable life in the Nightless City.\u003c/p\u003e\n\u003cp\u003eHowever, even if Nightless City was known as a trade centre, some precious items were still under strict regulations.\u003c/p\u003e\n\u003cp\u003eFor example, only a few official Magi were able to access high-grade information, as well as some information that was related to breaking through bottlenecks.\u003c/p\u003e\n\u003cp\u003eThese materials were heavily regulated, whether it was by magisteriums and guilds operating behind the scenes of the Nightless City, or through strict control and distribution on a periodical basis. As for wandering Magi like Leylin, there were no chances of obtaining them on the streets.\u003c/p\u003e\n\u003cp\u003ePerhaps a couple things could be found in black markets, but the amount would definitely be extremely little, and the prices extremely farfetched.\u003c/p\u003e\n\u003cp\u003eIf that was the case, it was better to join a guild, even obtaining privileges at times.\u003c/p\u003e\n\u003cp\u003e“Well… the magisteriums in Nightless City are quite regulated, and…”\u003c/p\u003e\n\u003cp\u003eCrew may have omitted some information, but Leylin was well aware of what he was implying.\u003c/p\u003e\n\u003cp\u003eWhile Magi organisations and families may have had the tradition of recruiting wandering Magi or those who were on the run, there was a crucial requirement said Magi must not have created trouble that might bring harm to the organisation backing them.\u003c/p\u003e\n\u003cp\u003eFor a Magus like Leylin, whose history was unknown, Magi organisations would do a complete investigation into his background, and then judge whether or not he was permitted to join their group.\u003c/p\u003e\n\u003cp\u003e“My full name is Leylin Farlier. I don’t have anything to hide, as you’ll find if you look into my history.”\u003c/p\u003e\n\u003cp\u003eLeylin didn’t have any plans on hiding anything about his background.\u003c/p\u003e\n\u003cp\u003eHe was from the Chernobyl Islands, and was a noble’s son. All of his experiences from when he was a child up till now had been recorded, and he was definitely not afraid of being investigated.\u003c/p\u003e\n\u003cp\u003eFurthermore, the only enemy that he had was the powerful Lilytell family. Unfortunately, the Lilytell family was a typical dark Magi family.\u003c/p\u003e\n\u003cp\u003eThey were the arch enemy of the light Magi, who were in control of Nightless City. Countless dark Magi had lost their lives within the light Magi’s domain.\u003c/p\u003e\n\u003cp\u003eLeylin had always been sticking to his role as an acolyte. There was no evidence that indicated he was insane or sick in the mind, such as having massacred regular humans at will.\u003c/p\u003e\n\u003cp\u003eAs a result, his identity would not affect his entry into an organisation in Nightless City.\u003c/p\u003e\n\u003cp\u003e“There were some disputes over interests before. Due to some personal conflicts and interests, I killed the heir of a family, and am now on their wanted list…”\u003c/p\u003e\n\u003cp\u003eLeylin briefly explained his past.\u003c/p\u003e\n\u003cp\u003eAfter hearing Leylin’s recount, Crew’s face turned even gentler.\u003c/p\u003e\n\u003cp\u003e“Be at ease. I personally do not have any animosity towards dark Magi. Moreover, you have already abandoned their camp, have you not?”\u003c/p\u003e\n\u003cp\u003eAs if afraid that Leylin was worried, Crew even explained himself.\u003c/p\u003e\n\u003cp\u003e“We of Nightless City will still welcome Magi like you, so be at ease!”\u003c/p\u003e\n\u003cp\u003eCrew sipped the black tea from the appealing wooden cup, before he slowly said, “So then, there are many guilds in the Nightless City; which one are you planning to join?”\u003c/p\u003e\n\u003cp\u003e“It’s precisely because I don’t know much that I’m here to seek your guidance!”\u003c/p\u003e\n\u003cp\u003eAn embarrassed expression surfaced upon Leylin’s face.\u003c/p\u003e\n\u003cp\u003e“En! Let me think, where should I begin?”\u003c/p\u003e\n\u003cp\u003eCrew racked his brains, and after thinking for a while, he said, “There are many guilds in the Nightless City. Ennea Ivory Ring Tower, Mercifura Academy, Four Seasons Garden, Hand of Femke, Human Faced Lion’s Eye…”\u003c/p\u003e\n\u003cp\u003e“These are all guilds that are more powerful, monopolising the trade behind the Nightless City. On the surface, there are a few other small organisations. Those ones aren\u0027t that strong, some even having only a semi-converted elemental Magus as their backer. If at any time they were to die, the organisation would naturally be dismissed…”\u003c/p\u003e\n\u003cp\u003e“They are only guilds in name, and their shares of resources are extremely few, to the point of almost being negligible. Some are even just based on friendships and the collaboration of experiments. After some time, groups like that will naturally be formed. These types of groups have no backing at all, so don’t even think of joining them!”\u003c/p\u003e\n\u003cp\u003eCrew advised Leylin with a good heart.\u003c/p\u003e\n\u003cp\u003e“As for the application, you only have to go to the communal centre, and request an application. Once you pass the test, you will be granted entry!”\u003c/p\u003e\n\u003cp\u003e“Of course, the Ennea Ivory Ring Tower might have some special welfare and restrictions…”\u003c/p\u003e\n\u003cp\u003eLeylin did not pay Crew a visit just to find out superficial information such as this. He also wanted to understand more about the inner workings of the large guilds in Nightless City. This information could only be known by older Magi who had been a resident of Nightless City for a long time.\u003c/p\u003e\n\u003cp\u003eOf course, Crew knew of this, so he leaked some important information further on in their discussion, allowing Leylin to grasp a better understanding of the various guilds.\u003c/p\u003e\n\u003cp\u003eSeveral hours later, Leylin bade Crew farewell with a huge grin on his face, and he returned to the villa.\u003c/p\u003e\n\u003cp\u003eIn the study room, a white ball formed from magic was floating in mid-air, giving off vivid rays of light that were not too harsh on the eyes, and brightening up the entire study as if it were day.\u003c/p\u003e\n\u003cp\u003eLeylin sat on an armchair, holding a stiff goose feather quill pen, and seemingly deep in thought.\u003c/p\u003e\n\u003cp\u003eOn the surface of the piece of parchment spread out over the table, there were several handwritten lines written in black ink.\u003c/p\u003e\n\u003cp\u003eAt the very top of the list was Ennea Ivory Ring Tower and Mercifura Academy, followed by Four Seasons Garden, and the tier below was the Hand of Femke, Human Faced Lion’s Eye, Aide Society, and the like.\u003c/p\u003e\n\u003cp\u003eThese were obviously the names of the true powers behind Nightless City.\u003c/p\u003e\n\u003cp\u003e“Ennea Ivory Ring Tower and Mercifura Academy are both schools and have the harshest requirements for Magi who wish to enter. They even demand that Magi hand over a part of their spirit, and make an unbreakable vow! Even though their treatment is the best, I won’t go there.”\u003c/p\u003e\n\u003cp\u003eFrom the very start, Leylin crossed off Ennea Ivory Ring Tower and Mercifura Academy from the piece of parchment.\u003c/p\u003e\n\u003cp\u003e“As for the Hand of Femke and the Human Faced Lion’s Eye, they are both organisations formed by and for half-humans. The ratio of pure humans to half-humans is quite low, and there are rumours that they are discriminated against, so I’m not going there either!”\u003c/p\u003e\n\u003cp\u003eOnce again, Leylin struck off two organisations from the list with a wave off his black goose feather quill pen.\u003c/p\u003e\n\u003cp\u003e“As for Aide Society, they are more partial towards using positive energy magic. It’s an organisation made up of light Magi who are known for their healing abilities, which is definitely not my cup of tea…”\u003c/p\u003e\n\u003cp\u003eLeylin struck off the characters that represented Aide Society.\u003c/p\u003e\n\u003cp\u003eThere was just one lonely option left on the parchment.\u003c/p\u003e\n\u003cp\u003e“Four Seasons Garden. I guess this is my only choice…”\u003c/p\u003e\n\u003cp\u003eLeylin had a bitter smile on his face. From the information that he had received from Crew, Leylin had a certain level of understanding regarding the organisations backing Nightless City.\u003c/p\u003e\n\u003cp\u003eHowever, many of them did not meet his requirements.\u003c/p\u003e\n\u003cp\u003eHe was thinking of entering an organisation as an external lecturer or a visitor, but most organisations required their recruits to pledge their absolute loyalty to them.\u003c/p\u003e\n\u003cp\u003eThere were some with more lax prerequisites, but unfortunately, their specialisation did not coincide with Leylin’s interests, so he could not learn much from them.\u003c/p\u003e\n\u003cp\u003eNo matter how he saw it, Four Seasons Garden was his only option.\u003c/p\u003e\n\u003cp\u003eFour Seasons Garden was a large scale Magi organisation. There were rumours that it was founded by a formidable Potioneering organization, and even now, Four Seasons Garden was still well known for its cultivation of vegetation, as well as Potioneering.\u003c/p\u003e\n\u003cp\u003eThis coincided with what Leylin was studying.\u003c/p\u003e\n\u003cp\u003eThe requirements to enter this organisation were also laxer, and those who had talent in Potioneering received excellent treatment.\u003c/p\u003e\n\u003cp\u003eLeylin had already achieved a certain level of attainment in Potioneering, and with the help of the A.I. Chip, he was almost as good as his mentor, Kroft. If he revealed just a small portion of his talent, it would definitely be enough to gain the respect of the Magi at Four Seasons Garden.\u003c/p\u003e\n\u003cp\u003eSince Four Seasons Garden was a Magi organisation renowned for Potioneering, it was sure to have many formulas, even including those ancient Potioneering formulas.\u003c/p\u003e\n\u003cp\u003eIn addition, the large quantities of documents and books that they possessed would definitely be extremely helpful for the A.I. Chip’s database.\u003c/p\u003e\n\u003cp\u003eAs Leylin pondered, a trace of anticipation flashed within his eyes.\u003c/p\u003e\n\u003cp\u003eThe next day, Leylin donned leather armour, with a cross blade in a silver scabbard, and went to the second level of the communal centre in the Nightless City.\u003c/p\u003e\n\u003cp\u003eThe level of activity in the construction resembling a gargantuan palm was very high; every now and then, magicians walked in and out like scurrying ants.\u003c/p\u003e\n\u003cp\u003eThis time, Leylin entered through the passage that resembled the thumb.\u003c/p\u003e\n\u003cp\u003eMost of the Magi here were rank 1, with cold auras that deterred others from getting into close proximity with them.\u003c/p\u003e\n\u003cp\u003e“These are most likely wandering Magi coming here to seek an opportunity!”\u003c/p\u003e\n\u003cp\u003eLeylin inadvertently scanned his surroundings and saw several strangely dressed Magi. Just based on the energy waves radiating from them, Leylin felt a sense of danger. With just one look at them, one could tell that they were no pushovers.\u003c/p\u003e\n\u003cp\u003eThere was a large hall at the end of the passage, and straight ahead of it, there were several counters that were separated by glass windows. Within those counters, several magicians seemed to be scribbling on their papers.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-152\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-154\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-153","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
