{"id":58710,"no":154,"title":"Chapter 154","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eFour Seasons Garden\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAs there were only a few official Magi, empty counters were readily available.\u003c/p\u003e\n\u003cp\u003eThere were a few magicians sitting on the big benches around the hall as if waiting for something or someone.\u003c/p\u003e\n\u003cp\u003eLeylin looked around and arrived in the front of an empty counter.\u003c/p\u003e\n\u003cp\u003e“Hello!” The young maiden behind the counter seemed to emit the energy waves of a level 3 acolyte. Upon seeing Leylin, she greeted him cheerfully, as her face brightened up with a smile.\u003c/p\u003e\n\u003cp\u003e“I wish to join Four Seasons Garden, hence I’m here to apply!” Leylin directly told her his purpose for arriving.\u003c/p\u003e\n\u003cp\u003e“Nightless City welcomes you as our newest member!” After listening to Leylin’s request, the young maiden’s smiling expression was more pronounced. “Please show me your ring!”\u003c/p\u003e\n\u003cp\u003eLeylin removed the silver ring from his finger and handed it over to her.\u003c/p\u003e\n\u003cp\u003eThe young maiden reached out for the ring, placed it onto an instrument from behind the counter, and then respectfully handed the ring back to Leylin.\u003c/p\u003e\n\u003cp\u003e“Please fill out this form, and we will send a reply to you as soon as possible!\" Subsequently, the young maiden handed a sheepskin parchment form to Leylin.\u003c/p\u003e\n\u003cp\u003eLeylin glanced at the form.\u003c/p\u003e\n\u003cp\u003eThe questions on the form were simple. They asked for a name, aptitude, elemental affinity, address, and so on. On the back of the form was a note, allowing magicians to fill in other information they deemed as important.\u003c/p\u003e\n\u003cp\u003eLeylin quickly filled out the form and handed it back to the maiden.\u003c/p\u003e\n\u003cp\u003eThe maiden accepted the form from Leylin and pressed on the crystal ball in front of her as if consulting something. Soon after, her face reflected her joy.\u003c/p\u003e\n\u003cp\u003e“Lord Leylin! A few examiners from Four Seasons Garden will be here this afternoon to conduct a test. You’ll only have to wait for a bit…”\u003c/p\u003e\n\u003cp\u003e“Oh? It seems like lady luck is shining on me!”\u003c/p\u003e\n\u003cp\u003eLeylin smiled as he nodded his head; he had finally found out what those magicians in the hall were waiting for.\u003c/p\u003e\n\u003cp\u003eAccording to Crew, after wandering magicians handed over their application forms, they would have to wait for the examiners of the various guilds, who would classify their abilities through an assessment.\u003c/p\u003e\n\u003cp\u003eThe timing was not fixed. It could be as short as a few days, or as long as a few months.\u003c/p\u003e\n\u003cp\u003eThis time, however, Leylin had managed to catch the right timing.\u003c/p\u003e\n\u003cp\u003e“Thank you!”\u003c/p\u003e\n\u003cp\u003eLeylin thanked the girl behind the glass window, and proceeded to a corner of the hall devoid of others, and closed his eyes as he waited.\u003c/p\u003e\n\u003cp\u003e“Hello Mister, would you like some lunch?”\u003c/p\u003e\n\u003cp\u003eA somewhat timid female voice sounded near Leylin.\u003c/p\u003e\n\u003cp\u003eLeylin opened his eyes and realised that a maid pushing a white dining cart had come up to him.\u003c/p\u003e\n\u003cp\u003eOn the dining cart, there were a few silver plates on which a temperature-maintaining spell had been cast. Even though they were covered, the food’s aroma still drifted over to Leylin’s nose.\u003c/p\u003e\n\u003cp\u003e“What kinds of dishes are there? Do they require magic crystals for payment?” Leylin asked with curiosity.\u003c/p\u003e\n\u003cp\u003eIt was evident that it was the first time the maid had seen an easygoing magician like Leylin; her reaction was sluggish. “There is roasted lamb thigh, calf loin… As for dessert, there’s an assorted fruit salad! All of these are complimentary...”\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head. It seemed that official Magi were treated pretty well in the Nightless City.\u003c/p\u003e\n\u003cp\u003eThis was common sense. It didn’t matter where it was; a person who had mastered a certain degree of power or ability would always be valued.\u003c/p\u003e\n\u003cp\u003e“Give me one portion of the roasted lamb thigh, as well as a portion of the fruit salad!”\u003c/p\u003e\n\u003cp\u003eThe lobby was very large, and there were even customised compartment rooms that one could choose so stay in. Other than meals, it seemed that there were other special offers.\u003c/p\u003e\n\u003cp\u003eLeylin personally witnessed a huge magician pulling a maid into one of the compartment rooms. Following which, sounds of repressed moans could be heard.\u003c/p\u003e\n\u003cp\u003e“L… Lord, if you want...” The maid servicing Leylin was also quite a beauty and combined with her slightly shy demeanour, caused one to feel lusty, and desire to ravage her.\u003c/p\u003e\n\u003cp\u003e“There is no need. I’ll just eat outside!”\u003c/p\u003e\n\u003cp\u003eLeylin shook his head. Inside the hall were some round tables and long benches, similar to the layout of a coffee place from his past life, where one could stay to dine.\u003c/p\u003e\n\u003cp\u003eLeylin considered whether he had his sperms acting as a brain. With the assessment commencing this afternoon, how could that magician still think of something like this? Wasn’t he afraid that his current actions would adversely affect his state of mind and ability to produce results during the assessment?\u003c/p\u003e\n\u003cp\u003eUpon hearing Leylin’s response, the maid released a sigh of relief. Soon afterwards, whether it was because she felt like she had been relieved of a huge burden, or she just felt empty, Leylin had made his way into her heart.\u003c/p\u003e\n\u003cp\u003eWhile the maid looked at Leylin, who exuded elegance and charisma, she momentarily felt an indescribable feeling.\u003c/p\u003e\n\u003cp\u003eLeylin, on the other hand, did not notice the maid’s feelings.\u003c/p\u003e\n\u003cp\u003eHe was currently skilfully controlling the knife and fork in his hands, sending the lamb thigh meat into his mouth. Every move he made had an indescribable feeling of elegance and grace to it.\u003c/p\u003e\n\u003cp\u003eIn his previous life, Leylin was someone who paid extra attention to etiquette, and as the heir to an aristocrat, the previous Leylin had also undergone etiquette lessons over a long period of time.\u003c/p\u003e\n\u003cp\u003eAs a result, the original Leylin was very noble-like, and when coupled with the charisma he had gained from the Kemoyin bloodline, plenty of young female magicians favoured him.\u003c/p\u003e\n\u003cp\u003eJust by walking along the streets of Nightless City, the present Leylin would spot several young ladies stealing glances at him.\u003c/p\u003e\n\u003cp\u003eThere were even a few voluptuous female magicians that directly requested a date with Leylin, causing him to be dumbfounded.\u003c/p\u003e\n\u003cp\u003eAfter having a pretty tasty lunch, Leylin waited for a while before entering the hall, in which a large commotion was occurring amongst the magicians.\u003c/p\u003e\n\u003cp\u003e“Are they here?”\u003c/p\u003e\n\u003cp\u003eLeylin watched attentively as two Magi, who wore white robes imprinted with four unknown flower designs, walked to the center of the hall.\u003c/p\u003e\n\u003cp\u003eNext to them were two other Magi wrapped in white cloaks, revealing nothing but two pairs of green eyes.\u003c/p\u003e\n\u003cp\u003e\"Today is the day of assessment for Four Seasons Garden and Hand of Femke. Those who have submitted their application form and would like to join Hand of Femke, please come with me!”\u003c/p\u003e\n\u003cp\u003eOne of the Magi with green eyes spoke first in a hoarse voice as if his vocal cords had been damaged.\u003c/p\u003e\n\u003cp\u003eAt the moment that he began to speak, the surrounding air started to faintly vibrate. Circles of aquamarine light started to loom around his body.\u003c/p\u003e\n\u003cp\u003e\"This is ...... a semi­-converted elemental Magus?!\" Leylin blinked.\u003c/p\u003e\n\u003cp\u003eThis type of energy wave was similar to the one that he had seen from the clone of the elder of the Lilytell Family.\u003c/p\u003e\n\u003cp\u003eAfter the cloaked figure revealed his strength as a semi-converted elemental Magus, the whole hall turned silent.\u003c/p\u003e\n\u003cp\u003eMagi only respected and answered to power and strength, and this was even truer among wandering magicians and dark Magi.\u003c/p\u003e\n\u003cp\u003eFurthermore, under normal circumstances, wandering magicians and wanted Magi had no fixed ways of breaking through their bottlenecks due to the lack of means to obtain advanced academic knowledge, potions, and the like.\u003c/p\u003e\n\u003cp\u003eAs a result, wandering magicians were generally of lower levels. Even amongst the wandering official Magi, it was extremely rare to find a semi­-converted elemental Magus.\u003c/p\u003e\n\u003cp\u003eWhile the large Magi organizations of Nightless City could easily dispatch two semi-converted elemental Magi as examiners, this kind of power was something that smaller organizations could only hope to achieve.\u003c/p\u003e\n\u003cp\u003eAfter the cloaked figured finished his speech, he left without delay, and headed to a nearby side tunnel, while his companion followed behind without a word.\u003c/p\u003e\n\u003cp\u003eUpon hearing the words of the green eyed magician, many magicians in the hall stood up and followed closely behind him.\u003c/p\u003e\n\u003cp\u003eLeylin could sense a mixture of energies emanating from these magicians. Some even had fur on their faces, which was an obvious trait of being half beast.\u003c/p\u003e\n\u003cp\u003e“It’s a pity, They’re just a tribe of sub-human Magi and not Warlocks!”\u003c/p\u003e\n\u003cp\u003eLeylin now anxiously wished to be able to find another Warlock organisation.\u003c/p\u003e\n\u003cp\u003eHe simply had too many unanswered questions regarding this ancient branch of Magi, the Warlock. With just the Book of Giant Serpents, he wouldn’t be able to go far upon the path of his bloodline.\u003c/p\u003e\n\u003cp\u003eHowever, unfortunately, warlocks seemed to be extinct within the South Coast. Leylin had travelled this far and had only been able to find a little girl in the Inlan Dukedom, who had a very slight connection with warlocks.\u003c/p\u003e\n\u003cp\u003e“Hello, everyone! I am Wade, a Magus from the Four Seasons Garden! This person next to me is Tyne!”\u003c/p\u003e\n\u003cp\u003eIn comparison to the lack of politeness received from the men from Hand of Femke, the two main examiners from Four Seasons Garden were friendlier.\u003c/p\u003e\n\u003cp\u003eWade, the middle-aged magician with golden hair, had taken the initiative and introduced himself. Tyne, who was next to him, was silent and taciturn, and sometimes even absent-minded.\u003c/p\u003e\n\u003cp\u003eHowever, from their bodies, one could feel that they possessed the strong energy waves of a semi­-converted elemental Magus, discouraging wandering Magi from causing trouble.\u003c/p\u003e\n\u003cp\u003e“Now! Those who want to be assessed for Four Seasons Garden, please come with me!”\u003c/p\u003e\n\u003cp\u003eThe golden-haired Wade turned towards the side road in the opposite direction that the Magi from the Hand of Femke had taken. Tyde followed closely behind.\u003c/p\u003e\n\u003cp\u003eLeylin and the rest of the five or six magicians exchanged glances and started taking strides to catch up.\u003c/p\u003e\n\u003cp\u003eThe side road was long, and the path was made of an unusual and bizarre material. The floor had no traces of cracks, and it was smooth and glossy. Leylin could even see his own reflection on the ground.\u003c/p\u003e\n\u003cp\u003eAfter walking for about ten minutes, Leylin and the rest arrived at a hall that was slightly smaller than the one from before.\u003c/p\u003e\n\u003cp\u003eIn the middle of the hall, there were several experiment tables and equipment for Potioneering.\u003c/p\u003e\n\u003cp\u003eUpon seeing this, Leylin instantly knew what the Four Seasons Garden was going to evaluate them on.\u003c/p\u003e\n\u003cp\u003e“As we all know, our Four Seasons Garden is famous for our specialisation in Potioneering. Therefore, we have some requirements in the area of Potioneering for new members. The test is very simple. Within the established time, successfully brew a bottle of Jeffrey’s Purifying Potion!”\u003c/p\u003e\n\u003cp\u003eWade spoke softly, but it seemed like some sort of magic technique was being used, and his voice was clearly heard by every magician’s ears.\u003c/p\u003e\n\u003cp\u003e\"Raw materials are arranged on the experiment tables; we have prepared three portions of raw materials for each of you. In other words, you’ll only have two chances to fail!\"\u003c/p\u003e\n\u003cp\u003e“This kind of request….”\u003c/p\u003e\n\u003cp\u003eLeylin squinted for a bit. Jeffrey’s Purifying Potion was a type of middle-grade medicine, which, even amongst potions of a similar tier, was famous for being extremely difficult to brew.\u003c/p\u003e\n\u003cp\u003eBrewing this potion with only three portions of ingredients and within a specified time limit was something only those who were at a level comparable to Potion masters such as Kroft would be able to pass.\u003c/p\u003e\n\u003cp\u003e“Tsk….”\u003c/p\u003e\n\u003cp\u003eSure enough, after the listing the requirements, Leylin heard distinct hisses from the magicians around him.\u003c/p\u003e\n\u003cp\u003e“In recent years, the larger powers within Nightless City have made their recruitment criteria increasingly stringent...”\u003c/p\u003e\n\u003cp\u003eAt this time, a sound of complaint travelled to Leylin’s ears.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-153\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-155\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-154","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
