{"id":58722,"no":166,"title":"Chapter 166","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eA Successful Retreat\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin turned around and saw the baldy’s snake shoot an ice bullet, which shattered the innate defense spell of his opponent.\u003c/p\u003e\n\u003cp\u003eAt the same time, the precious boa of his charged, revealing razor sharp fangs and sinking them into the light Magus’ neck.\u003c/p\u003e\n\u003cp\u003eBaldy’s opponent was a rather young looking Magus with blonde hair and blue eyes. He had an extremely cheery disposition.\u003c/p\u003e\n\u003cp\u003eIt was a pity, however, that right now, this light Magus had death written all over his face. With the continuous constriction of the boa, his life was drained away.\u003c/p\u003e\n\u003cp\u003eAfter killing the light Magus, the baldy’s Venom Snake threw Leylin a provocative look.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin acted as if he saw nothing, and dashed right into the division of the Ennea Ivory Ring Tower.\u003c/p\u003e\n\u003cp\u003e“Right now, he wants to be petty about such things and not steal treasures? This Magus is definitely somewhat mental!”\u003c/p\u003e\n\u003cp\u003eLeylin hurriedly ran past the doors and arrived at a place that seemed to be a library.\u003c/p\u003e\n\u003cp\u003e“These are all information meant for acolytes, so I’ll forgo them. A.I. Chip, scan!” Leylin’s eyes hurriedly swept the area. This library consisted of two floors, and the total area was rather huge. However, Leylin had read most of the books found here before, so they were not of much value to him.\u003c/p\u003e\n\u003cp\u003e[Beep! Mission establishing, beginning scan...]\u003c/p\u003e\n\u003cp\u003eAfter which, a light blue image was formed and appeared in Leylin’s vision.\u003c/p\u003e\n\u003cp\u003eThrough this image, Leylin could easily discover that between the two floors, there was an extremely tiny passage.\u003c/p\u003e\n\u003cp\u003eRight now, there was no one in the library, and books and chairs were strewn across the floor. It seemed that the people who were here had escaped quickly.\u003c/p\u003e\n\u003cp\u003eLeylin strode past the lobby and came to the hidden spot.\u003c/p\u003e\n\u003cp\u003e“It’s in here huh?”\u003c/p\u003e\n\u003cp\u003eLeylin looked at the wall before his hands punched into it without hesitation!\u003c/p\u003e\n\u003cp\u003e*Boom!* Dust flew around in the room, and an extremely narrow passage was revealed at the collapsed portion of the wall.\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003eThe passage was extremely short, and at the back, there was a small room. There were several shelves upon which some memory crystal balls sat on. Moreover, in the room sat three quivering acolytes.\u003c/p\u003e\n\u003cp\u003e“Ennea Ivory Ring Tower huh? George isn’t here!”\u003c/p\u003e\n\u003cp\u003eLeylin gave a quick scan and slightly waved his Crimson Palm.\u003c/p\u003e\n\u003cp\u003eA blurry red light filled the small room.\u003c/p\u003e\n\u003cp\u003eThe three acolyte’s eyes turned red, and they immediately lost consciousness, their bodies still trembling as signs of life became less obvious. From the looks of it, they wouldn’t live past today.\u003c/p\u003e\n\u003cp\u003eIn front of an official Magus like Leylin, these regular acolytes’ lives were like those of ants. With just a slight misstep, he might accidentally kill a few of them.\u003c/p\u003e\n\u003cp\u003eLeylin paid no mind as he stepped across the acolytes’ bodies, which were still involuntarily trembling, and came to the front of one of the wooden shelves.\u003c/p\u003e\n\u003cp\u003e“Elementary Meditation Techniques” “Potioneering Foundations…” “Rune Theories” “Study of Particles”\u003c/p\u003e\n\u003cp\u003eThe crystal balls on the wooden shelves were more valuable items, which could immediately transmit information into a magician’s mind without them forgetting anything.\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes swept past the crystal balls and noticed that they contained information meant for acolytes, which was not of much use to him. However, there was a clutter of black crystal balls in the middle of all of them, with various tags showing the high-grade information stored within. This caused Leylin to grin...\u003c/p\u003e\n\u003cp\u003eA dozen seconds later, Leylin walked out from the library, which combusted in flames just seconds later.\u003c/p\u003e\n\u003cp\u003eAt this moment, the whole division was in chaos, with magic spells being continuously fired across the battlefield.\u003c/p\u003e\n\u003cp\u003eAfter killing most of the official Magus enforcers, most of the division’s defenses fell apart.\u003c/p\u003e\n\u003cp\u003eSome were even acolytes who couldn\u0027t resist the attacks of a group of dark Magi!\u003c/p\u003e\n\u003cp\u003eThe dark Magi wilfully plundered resources as they deemed fit, destroying everything they could see before them, and letting loose their inner cravings for darkness.\u003c/p\u003e\n\u003cp\u003eLeylin watched the scene with a blank expression, using the A.I. Chip to scan the entire branch.\u003c/p\u003e\n\u003cp\u003eHe didn’t have much time, and there was at most a few minutes before Nightless City’s allied forces arrived. No matter how insane Leylin was, he wouldn’t dare to contend with a large number of light Magi.\u003c/p\u003e\n\u003cp\u003e“From the structure, this isn’t a division of the academy. Rather, this is more similar to a research organisation, with a lot fewer people here…”\u003c/p\u003e\n\u003cp\u003eLeylin traversed an area with disorganised architecture and idly looked around.\u003c/p\u003e\n\u003cp\u003e“I found it!”\u003c/p\u003e\n\u003cp\u003eAn excited voice rang out. “Guys, come here! I’ve found the entrance to the secret plane!”\u003c/p\u003e\n\u003cp\u003e“Hm?”\u003c/p\u003e\n\u003cp\u003e“That’s great!”\u003c/p\u003e\n\u003cp\u003eMultiple equally eager voices came for all around the region, and the dark Magi from before all gathered in a small garden.\u003c/p\u003e\n\u003cp\u003eHere, the large Rodent Magus was constantly rubbing his black claws, his beard sticking up, and his tiny eyes greedily fixated upon an oval object in the sky.\u003c/p\u003e\n\u003cp\u003eThat object seemed to be a mirror with silver rays of light surrounding it. In the centre was a deep and dark spiral.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, my magic can only show you the entrance to the secret plane. It will take some time to forcefully gain entry!”\u003c/p\u003e\n\u003cp\u003eThe large Rodent immediately asked, “Which of you captured any opposing Magi? Interrogate them and get the password and method to enter!”\u003c/p\u003e\n\u003cp\u003e“Look for Old Devil, she’s an expert in this field!”\u003c/p\u003e\n\u003cp\u003eThe zombie-like Magus was carrying the naked corpse of a female acolyte, gnawing her flesh from time to time as if savouring a delicacy.\u003c/p\u003e\n\u003cp\u003e“Hehe… That Magus’ spirit was extracted smoothly by me earlier; it seems like this will be a great harvest!”\u003c/p\u003e\n\u003cp\u003eThe old witch cackled and walked towards the silver circular hole, while chanting an extremely awkward sounding incantation.\u003c/p\u003e\n\u003cp\u003e*Weng Weng!*\u003c/p\u003e\n\u003cp\u003eThe void emitted energy waves as the circular entrance became enlarged, revealing the dark space of what seemed to be a storage.\u003c/p\u003e\n\u003cp\u003e“Haha… We have struck the jackpot…” The giant mouse rushed in like a whirlwind, with the following dark Magi following behind.\u003c/p\u003e\n\u003cp\u003e“I’ll stay behind to keep watch!” The old witch tossed several powder-like substances on the ground. “Anyway, we have to divide them in the end…”\u003c/p\u003e\n\u003cp\u003eLeylin exchanged a meaningful look with the old witch as he went into the secret plane.\u003c/p\u003e\n\u003cp\u003eThis secret plane was extremely small—about the size of a large warehouse. There was only one passage for people to walk about. On both sides of the warehouse, there were many labeled items and ingredients.\u003c/p\u003e\n\u003cp\u003e“Hurry! Pick the most valuable items and go, and burn the rest that we don’t need!”\u003c/p\u003e\n\u003cp\u003eZombie tossed the female corpse aside and looked at the door of the warehouse, before stepping in with a snort.\u003c/p\u003e\n\u003cp\u003eLeylin looked at the dark Magi who were happily shoving items into their pockets, and could not help but shake his head.\u003c/p\u003e\n\u003cp\u003eIn the Magus world, those magic artifacts which had spatial capabilities were extremely precious. At most, Leylin had only heard of them in legends and folklore. Until now, he had never seen any Magus owning an item like that.\u003c/p\u003e\n\u003cp\u003eHence, most Magi could only carry the most valuable items with them. Every time they went on a mission, they would be carrying many sacks, with some even having horse carriages that were filled with empty chests.\u003c/p\u003e\n\u003cp\u003eAs for right now, there were too many items in this warehouse. Leylin and the others could only choose the most valuable ones, and as for other large items, these dark Magi, who were already consumed by greed, could only choose to destroy them.\u003c/p\u003e\n\u003cp\u003e“If I had a spatial ring or something like that in future, then it would be much more convenient!”\u003c/p\u003e\n\u003cp\u003eLeylin rushed into a section where the shelves were filled with various ingredients, as well as heaps of magic crystals that had been tossed in a corner like trash.\u003c/p\u003e\n\u003cp\u003eLeylin quickly stuffed the precious materials into his own pockets. He immediately ignored the low-grade magic crystals, and only the high-grade magic crystals and magic crystal cards caught his eye.\u003c/p\u003e\n\u003cp\u003eAt this moment, he was still indulging in his fantasies.\u003c/p\u003e\n\u003cp\u003e“Of course, rather than getting any spatial ring, the best thing to do would be to occupy this territory. That would be real profit without any investment!”\u003c/p\u003e\n\u003cp\u003eLeylin was a little regretful about this, but he could only bury his delusions into the bottom of his heart.\u003c/p\u003e\n\u003cp\u003e[Beep! 4 Minute 37 Seconds have passed in the countdown, reaching close to the value set by the Host!]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s voice intoned.\u003c/p\u003e\n\u003cp\u003e“There’s no more time! Retreat!” Leylin’s eyes reflected his resolution, and he speedily left the warehouse.\u003c/p\u003e\n\u003cp\u003e“Nightless City’s forces are arriving. Run!”\u003c/p\u003e\n\u003cp\u003eAfter Leylin left the secret plane, he heard Rodent’s flustered voice.\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eLeylin and the old witch nodded, and transformed into two streaks of shadows, which disappeared into the air.\u003c/p\u003e\n\u003cp\u003eAfter the retreat of all the dark Magi, Leylin turned back to observe the sight of black flames emitting from Ennea Ivory Ring Tower.\u003c/p\u003e\n\u003cp\u003eSome of the Magi from the Nightless City who were using rank 1 flying magic descended from the sky.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA giant beast dashed past the land.\u003c/p\u003e\n\u003cp\u003eLooking on, this beast was over 50 metres tall and 200 metres long. Its appearance closely resembled a large hippopotamus, and its jaws occupied almost half of its body size.\u003c/p\u003e\n\u003cp\u003eWith every step that this gargantuan beast took, deep imprints would be made on the ground. Also, there were also tremors, as if mini earthquakes were occurring.\u003c/p\u003e\n\u003cp\u003eThe surrounding animals would scatter and flee after seeing this beast, not daring to stay a moment longer.\u003c/p\u003e\n\u003cp\u003eWithin this beast, the group of dark Magi from earlier were gathered inside of a large hall.\u003c/p\u003e\n\u003cp\u003eThe Magus wrapped in green fog, who went by the name of “Giant,” stood unscathed in the middle, and his aura had not even decreased by much. It was evident that he had disposed of his opponent with much ease.\u003c/p\u003e\n\u003cp\u003e“Alright! Since all of us here have made our vows and have undergone the judgement of the Trial’s Eye, take out 50% worth of the items that you have plundered!”\u003c/p\u003e\n\u003cp\u003eGiant spoke in a cold voice.\u003c/p\u003e\n\u003cp\u003eDespite the chaos of the Magi below, under the constraints of the power of the higher ups, as well as their oaths, they hastily piled some magic crystals and materials in the centre of the hall.\u003c/p\u003e\n\u003cp\u003eSoon enough, the materials and magic crystals formed a small mountain.\u003c/p\u003e\n\u003cp\u003e“This all amounts to at least ten million magic crystals!” Leylin’s eyes flashed as he mentally calculated.\u003c/p\u003e\n\u003cp\u003e“Moreover, this is only 50%. Which is to say, the division of the Ennea Ivory Ring Tower has lost close to twenty million magic crystals, along with the destruction of other items… The Ennea Ivory Ring Tower is going to go nuts this time…”\u003c/p\u003e\n\u003cp\u003eAfter giving it some thought, he was a little curious and asked the old witch beside him in a low voice.\u003c/p\u003e\n\u003cp\u003e“Do we really have to give up 50% of our profits? Isn’t that too much?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-165\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-167\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-166","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
