{"id":58724,"no":168,"title":"Chapter 168","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eIn Retrospect\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eOf course, even within dark Magi organisations, there were rules and regulations.\u003c/p\u003e\n\u003cp\u003eIf Leylin kept doing this, it would result in others ganging up on him and eliminating him under the pretext of self-defense.\u003c/p\u003e\n\u003cp\u003eThat was why Leylin needed to first cause some conflict, and then be able to act with a good reason to do so.\u003c/p\u003e\n\u003cp\u003eHonestly speaking, even if Venom Snake had not challenged him, he was also planning on instigating some of the weaker Magi and then blow the whole thing out of proportion.\u003c/p\u003e\n\u003cp\u003eAfterwards, he would use revenge as an excuse to righteously kill and then seize their treasures!\u003c/p\u003e\n\u003cp\u003eBut that was it.\u003c/p\u003e\n\u003cp\u003eLeylin assessed that after this affair, other dark Magi would be slightly dissatisfied with his actions, so he couldn’t let this get too far.\u003c/p\u003e\n\u003cp\u003e“You’re really…” The old witch was suddenly regretful, “I haven’t seen a youngster that’s as cool headed but also crazy in a very long time…”\u003c/p\u003e\n\u003cp\u003e“Nope! I’m just someone with the will to live!” Leylin said with a brilliant smile.\u003c/p\u003e\n\u003cp\u003e“What about you? When will you get your goods?”\u003c/p\u003e\n\u003cp\u003eThe moment this was brought up, the old witch’s face stiffened. This was the only reason why she was working with Leylin and had been dragged along in the end.\u003c/p\u003e\n\u003cp\u003e“Today’s harvest was pretty good, especially since we got two souls from official Magi. It shouldn’t take long before we can finalize the product!”\u003c/p\u003e\n\u003cp\u003e“Notify me once it’s finished, I’ll be at Nightless City these few days!” Leylin nodded.\u003c/p\u003e\n\u003cp\u003eFollowing which, he approached the bald Venom Snake and undid the concealment spell, revealing the face of a middle aged man that had a venerable countenance.\u003c/p\u003e\n\u003cp\u003e“It’s him!” The old witch cried out in alarm from behind him.\u003c/p\u003e\n\u003cp\u003e“You know him?” This aroused Leylin’s interest.\u003c/p\u003e\n\u003cp\u003e“No, I’ve only seen him a couple of times!” The old witch appeared rather rueful.\u003c/p\u003e\n\u003cp\u003e“He’s the head of a small light Magi faction, and he’s got a good reputation! Apparently, he’s quite skilled in transformation spells. I didn’t know he was actually a dark Magus!”\u003c/p\u003e\n\u003cp\u003e“This is quite normal! Dark Magi like to assume a righteous personality, just like you and me!”\u003c/p\u003e\n\u003cp\u003eLeylin’s silhouette melted into the darkness...\u003c/p\u003e\n\u003cp\u003eIn the following days. Leylin lived a very pleasant life in Nightless City.\u003c/p\u003e\n\u003cp\u003eIt couldn’t be denied that Nightless City was an unusually large Magi City, in which Leylin was able to enjoy all kinds of services tailored for a Magus’ pleasure.\u003c/p\u003e\n\u003cp\u003eSplash! Boiling tea water flowed out of an exquisite silver teapot into a tea cup engraved with purple flowery designs. A rich fragrance of black tea permeated the air of the whole lounge as it wafted back and forth.\u003c/p\u003e\n\u003cp\u003eLeylin sat in an armchair to the side with a serene expression. Behind him and under each of his legs were beautiful maids in revealing clothing who were extending their lily white and seemingly boneless small hands to massage him all over his body.\u003c/p\u003e\n\u003cp\u003e“How is it? The skills of maids are quite good, right? Want me to gift you a couple…”\u003c/p\u003e\n\u003cp\u003eA red-haired old Magus, who was standing to one side, was saying as he directed another maid to feed him grapes. Around him were a number of maids who waited upon him like he was a god.\u003c/p\u003e\n\u003cp\u003e“Don’t blame me for saying this Leylin, but your villa is much too simple. It doesn’t even have a guard dog! You’ll be the laughing stock for other Magi if you don’t do anything about this…”\u003c/p\u003e\n\u003cp\u003eCrew was squinting his eyes. His face revealed an expression of rapture.\u003c/p\u003e\n\u003cp\u003e“Stop trying to sell me your maids!” Leylin revealed a bitter laugh, “But you must know a lot of merchants in this field, right? You should introduce them to me someday!”\u003c/p\u003e\n\u003cp\u003eLeylin admitted that it was strange for there not to be a single person in the whole villa. Besides, he felt that he did need some people to help around while he lived in Nightless City, such as servants and the like.\u003c/p\u003e\n\u003cp\u003e“No problem! I’ll take you to Nightless City’s slave market tomorrow. Once you’re there, all your needs will be satisfied. Besides, there are even slaves from other races!”\u003c/p\u003e\n\u003cp\u003eCrew revealed an expression that said ‘I’m glad you came to your senses’. When he mentioned different races, a lewd smile was revealed on his old face.\u003c/p\u003e\n\u003cp\u003eSeeing the expression of this old pervert, Leylin was speechless.\u003c/p\u003e\n\u003cp\u003eHe conveniently grabbed something that looked like a newspaper from the table and was immediately attracted by the eye-catching title.\u003c/p\u003e\n\u003cp\u003e“Ennea Ivory Ring Tower’s division under attack! Severe losses!”\u003c/p\u003e\n\u003cp\u003e“Tragedy! Dark Magi attack the Tallinn Highlands. All Magi present have perished!”\u003c/p\u003e\n\u003cp\u003e“It’s a declaration of war! The dark Magi have initiated the third great Magi war. What are you going to do? Please listen in detail to the analysis by our special guest, Nicholas Kajitel…”\u003c/p\u003e\n\u003cp\u003eScenes of the havoc that Leylin and the others had wreaked were splashed all over the headlines.\u003c/p\u003e\n\u003cp\u003eIn addition, all of the reports came had very eye-catching headings, and some even exaggerated to say that this was provocation from the dark Magi and a forewarning that there were plans to begin the third Magi war.\u003c/p\u003e\n\u003cp\u003e“Look at this! All they’ve been reporting these days is about that incident. The Ennea Ivory Ring Tower really suffered a massive loss, this time, worth at least a hundred million magic crystals…”\u003c/p\u003e\n\u003cp\u003eCrew looked to be rejoicing at their misfortune, and Leylin briefly wondered if there was some history between Crew and the Ennea Ivory Ring Tower.\u003c/p\u003e\n\u003cp\u003e“Tsk! A hundred million crystals! What wouldn’t I do to get those many crystals?”\u003c/p\u003e\n\u003cp\u003eLeylin, too, had an expression of obsessive desire on his face, “But these dark Magi are really quite daring to even provoke the Ennea Ivory Ring Tower!”\u003c/p\u003e\n\u003cp\u003eLeylin’s facial expressions and movements were flawless as if he really had no knowledge of the incident.\u003c/p\u003e\n\u003cp\u003e“Sigh… This has happened multiple times in the past, just that nobody can tell whether it’s the Night Crows or the Zombies,” Crew continued.\u003c/p\u003e\n\u003cp\u003eThe Night Crows and Zombies were dark Magi organisations that operated in the shadows of Nightless City. Before Leylin’s arrival, both groups were infamous for having committed several huge crimes with ruthless methods.\u003c/p\u003e\n\u003cp\u003eThe dark Magi organisation that Leylin was a part of was not either of these groups but another —it was called the Thousand Meddling Leaves — though they were just as notorious.\u003c/p\u003e\n\u003cp\u003e“With Ennea Ivory Ring Tower’s Magi enforcers and help from Nightless City, it should be possible to capture those bold dark Magi, right?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid that’s not possible!”\u003c/p\u003e\n\u003cp\u003eCrew shook his head immediately. “The powers backing the dark Magi aren’t to be trifled with. Magi specializing in divination have had their spells achieve no effect, and we suspect that there’s at least a rank 2 Magus backing and giving them orders. We believe there might be even more than one of them…”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003eLeylin nodded, his expression turning to one of longing.\u003c/p\u003e\n\u003cp\u003e“A rank 2 Magus! I wonder if I’ll ever reach that level in this lifetime.”\u003c/p\u003e\n\u003cp\u003eHis look made Crew’s expression darken slightly.\u003c/p\u003e\n\u003cp\u003eLeylin was young and still had hope to achieve that.\u003c/p\u003e\n\u003cp\u003eBut he was different. After consuming a large part of his lifespan, his body’s vitality could no longer withstand the strain from another advancement. Furthermore, he had chosen the simplest route and broken through with the Grime Water, increasing the difficulty of breaking through to the next rank.\u003c/p\u003e\n\u003cp\u003e“Oh! My apologies!”\u003c/p\u003e\n\u003cp\u003eUpon noticing Crew’s expression, Leylin gave a bow in apology.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it. I just got nostalgic about some events in the past.” The desolate look in his eyes faded away. “Thinking back to my decision then, I’ve missed too many opportunities. If given the chance to relive my life, I think I’d still choose to sign that contract, though.”\u003c/p\u003e\n\u003cp\u003eLeylin understood his train of thought.\u003c/p\u003e\n\u003cp\u003eFor many acolytes, even if they were aware of the existence of high-grade meditation techniques, they had no choice but to break through with the Grime Water.\u003c/p\u003e\n\u003cp\u003eAfter all, only strictly-managed Magi organisations and large Families held possession of high-grade meditation techniques. Typically, level 3 acolytes had no social connections nor any strong background, and it was basically impossible for them to obtain those techniques.\u003c/p\u003e\n\u003cp\u003eHence, they would rather use the Grime Water and break through, and hope that after they advanced to an official Magus, they could find a way to make up for the disadvantages of this method.\u003c/p\u003e\n\u003cp\u003eHowever, even if there was such a method, it was not something any ordinary Magus could come into contact with. It might not even exist in the entire South Coast, and was more likely to be found only in the central continent.\u003c/p\u003e\n\u003cp\u003eAs a result, most Magi could only service their organisation for their entire life, and then retire, living aimlessly the way Crew was now doing.\u003c/p\u003e\n\u003cp\u003e“Alright! Enough about this mood-dampening topic. I’ll bring you to the slave market tomorrow to see a friend of mine. She has quite a few quality goods, like the snake girl from the previous time that remains fresh in my memories. You definitely can’t miss this chance!”\u003c/p\u003e\n\u003cp\u003eAt this point, Crew’s mood seemed to have brightened.\u003c/p\u003e\n\u003cp\u003eLeylin kept Crew company and they chatted for a while, and he had an exceedingly alluring time and sumptuous dinner before leaving Crew’s villa.\u003c/p\u003e\n\u003cp\u003e*Sssii!*\u003c/p\u003e\n\u003cp\u003eAt this moment, the pocket-sized diary trembled, letting off a slight glow.\u003c/p\u003e\n\u003cp\u003e“Leylin! I’ve already prepared what you wanted. When can you come over?” The old witch’s voice traveled to his ears from a green secret imprint.\u003c/p\u003e\n\u003cp\u003e“Give me a moment, I’m on my way!”\u003c/p\u003e\n\u003cp\u003eLeylin was delighted at the message, as the old witch’s efficiency was better than he had anticipated.\u003c/p\u003e\n\u003cp\u003eElm Street #231. It wasn’t Leylin’s first time here.\u003c/p\u003e\n\u003cp\u003eThe shop was located in a very remote area, and most Magi would not be able to find their way here.\u003c/p\u003e\n\u003cp\u003eAfter Leylin entered, the old witch closed the door and hung a sign that read “Closed”.\u003c/p\u003e\n\u003cp\u003eLeylin, unconvinced by this level of security, set up a sound-proofing spell around them.\u003c/p\u003e\n\u003cp\u003e“Rumours have been flying recently. How is it on your end? Have you been discovered at all?” Leylin asked, somewhat worried.\u003c/p\u003e\n\u003cp\u003e“Don’t worry. I’ve lived in Nightless City for over a century, and I do have some contacts…” She seemed rather pleased with herself.\u003c/p\u003e\n\u003cp\u003e“Also, these are the materials that were mentioned in the contract. I processed them using the method in the information you gave me! I did everything perfectly!”\u003c/p\u003e\n\u003cp\u003eThe old witch positioned a dozen crystal soul spheres in the size of a thumb in a row, and placed it on the counter.\u003c/p\u003e\n\u003cp\u003eWithin the soul, sphere were tens of expressionless spirits that seemed on the verge of dissipating. At the moment, many of them had lost their human form, which must have happened after brutal, inhuman torture.\u003c/p\u003e\n\u003cp\u003e“Has it really all been dealt with? The spirits need to have been immersed and soaked in immense suffering and hopelessness in order to achieve the best effect!”\u003c/p\u003e\n\u003cp\u003e“Hehe… I even captured a few spirits and experimented on them beforehand. On top of the basic pain that I can inflict, I also tortured their very souls. The effects are marvellous!” The old witch laughed excitedly, though it was a sound that caused others goosebumps.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-167\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-169\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-168","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
