{"id":58732,"no":176,"title":"Chapter 176","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eA Banshee\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIn the south coast, the storage type secret plane Leylin had previously raided and the laboratory type secret plane that the old witch found were all classified as small scale secret planes.\u003c/p\u003e\n\u003cp\u003eThe area of these kind of secret planes usually didn’t exceed a 100 mu and were only used to perform experiments and to store supplies. If one does not take into account of the items stored inside and only look at the area of the secret plane, its worth would be at the bottom.\u003c/p\u003e\n\u003cp\u003eAbove that were the resource type secret planes, the area of that type of secret planes is usually larger than 100,000 mu. The area is large and the topology is varied and suitable to grow resources necessary to Magi.\u003c/p\u003e\n\u003cp\u003eThe highest rank of secret planes are those that have spells that can adjust the living environments of both plants and animals, and can be controlled by a single Magus!\u003c/p\u003e\n\u003cp\u003eThese are only under normal circumstances, there are also places like Dylan Gardens which Leylin previously found. Even though the area was small but it was personally arranged by the fourth level warlock great Magus Serholm, thus its value couldn’t be compared to the normal planes of its kind.\u003c/p\u003e\n\u003cp\u003e“It’s a shame! If it was a resource type of secret plane, we could occupy it in secret then alter it, hehe… then we would be filthy rich!”\u003c/p\u003e\n\u003cp\u003eBrass Ring was stroking his chin as if he was caught in some fantasy.\u003c/p\u003e\n\u003cp\u003e“Keep dreaming!” The old witch sneered icily, interrupting Brass Ring’s fancy dreams.\u003c/p\u003e\n\u003cp\u003e“The bigger the area of the secret plane, the higher the cost of construction. As for the resource type secret planes which was larger than 100k mu, even for some ancient Magi organisations, there weren’t many that could afford to construct it…”\u003c/p\u003e\n\u003cp\u003e“All the present resource type secret planes that belongs to the large organisations are all remnants from the ancient Magi which have been altered slightly, that\u0027s all! If there really was a resource type secret plane being discovered here, the likes of us wouldn’t be able to stomach it. Even if we added our whole organisation plus the Boss that is backing it, it still wouldn’t be enough!”\u003c/p\u003e\n\u003cp\u003e“Let’s go! Even if it’s just a laboratory type of secret plane, there must still be a lot of valuable stuff inside. We’re also handing over a lot contributions to the higher ups. It’s enough for you to trade for a lot of resources!” Leylin said.\u003c/p\u003e\n\u003cp\u003eFor these kind of small scale secret planes, every large Magi organisation has set up missions.\u003c/p\u003e\n\u003cp\u003eNo matter if it’s Four Seasons Garden or the dark Magi organisation which the old witch belonged to, they all have the power to take it over. After which there naturally will be a lot of rewards for the finders.\u003c/p\u003e\n\u003cp\u003eIf this was a resource type of secret plane then Leylin would put in some thought in order to pocket it himself.\u003c/p\u003e\n\u003cp\u003eSince it’s only a laboratory type of secret plane, he didn’t put much thought into pocketing it. After all even if he was to occupy it because it’s so small he couldn’t actually alter it that much. At most he would only have a small scale secret base to hide.\u003c/p\u003e\n\u003cp\u003e“The entrance to the secret plane is on the west side of this town, inside a two story wooden building!”\u003c/p\u003e\n\u003cp\u003eThe old witch seemed quite familiar with the surroundings as she brought the three of them to a two-storey building made out of wood.\u003c/p\u003e\n\u003cp\u003eCompare to the small town, this place was even more remote. Weed were growing all around the villa and there were even two mole like animals quickly scurrying by.\u003c/p\u003e\n\u003cp\u003e“Originally this place was a lively street, but since 13 years ago the residents in this place kept dying one by one. Sometimes the town residents could hear sound of a woman wailing outside their homes, that\u0027s why the rumors spread about it being a cursed or a haunted house. The surroundings ended up being overgrown!”\u003c/p\u003e\n\u003cp\u003eThe old witch opened up the rusted gates while feeling rather satisfied with herself.\u003c/p\u003e\n\u003cp\u003e“I found this place during one of my explorations, after a couple of months of investigation, I’m sure that the unusual situations around here is cause by the deterioration of the defensive spells around the entrance to the secret plane, unwillingly leaking radiation …”\u003c/p\u003e\n\u003cp\u003e“According to calculations, after 13 years the defensive spells should have totally deteriorated. Leaving the entrance to the secret plane exposed…”\u003c/p\u003e\n\u003cp\u003e“Thusly I pretend to be an ordinary person and bought this building, plus I added a facade on the outside so other Magi couldn’t discover this place.”\u003c/p\u003e\n\u003cp\u003eLeylin was listening to the old witch while he was exploring the inside of this building.\u003c/p\u003e\n\u003cp\u003eThe bottom floor wasn’t that big, it only contained 2 to 3 buildings. The hall was filled with a thick layer of dust and broken furniture. In the corner was a spiral staircase filled with holes. It was the only thing connecting these two floors.\u003c/p\u003e\n\u003cp\u003eBeneath this obvious state of decline, Leylin could feel a strong aura of negative energy.\u003c/p\u003e\n\u003cp\u003eThis aura was extremely malevolent, and it carried with it a smell that Leylin was familiar with.\u003c/p\u003e\n\u003cp\u003e“Spirits! And they’re spirits that have been driven crazy from being vengeful!” The corner of Leylin’s mouth curved, “This old witch really found a nice place!”\u003c/p\u003e\n\u003cp\u003e“Follow me! Be careful not to touch the black mold on the walls, those are trigger points!”\u003c/p\u003e\n\u003cp\u003eThe old witch was in front leading the while, bringing the three behind as they climbed the squeaky stairs to the second floor. She seemed extremely familiar with this place.\u003c/p\u003e\n\u003cp\u003eThe area on the second floor was smaller than the large hall on the first, where the corridors only allowed 2 people to walk side by side.\u003c/p\u003e\n\u003cp\u003eBy chance Leylin was walking beside Jaye, because the other person was entirely wrapped in a cloak and didn’t speak much. Leylin couldn’t even distinguish the other person\u0027s gender.\u003c/p\u003e\n\u003cp\u003e“This oil painting is the entrance to the Ancient Spirit Slaying Sect’s secret plane!”\u003c/p\u003e\n\u003cp\u003eBy the end of the corridor, the old witch was pointing towards an oil painting that was hanging on the wall as she turned around and spoke to Leylin and the rest.\u003c/p\u003e\n\u003cp\u003eLeylin’s focus involuntarily shifted to the oil painting.\u003c/p\u003e\n\u003cp\u003eThis oil painting depicted a richly dressed noble woman, using a delicate fan to cover half her face.\u003c/p\u003e\n\u003cp\u003eDue to time and age, there were a lot of dust on the walls. Even around the oil painting were a ring of thick dust.\u003c/p\u003e\n\u003cp\u003eThe whole oil painting used green as a base color, and it didn’t seem to fit the picture.\u003c/p\u003e\n\u003cp\u003eBesides, maybe it’s because of the angle and line, but if he stared at it long enough, Leylin felt that the fan the noble woman was holding in the oil painting moved slightly.\u003c/p\u003e\n\u003cp\u003eSuddenly, the young woman inside the oil painting blinked her eyes!\u003c/p\u003e\n\u003cp\u003e“Is this oil painting alive?”\u003c/p\u003e\n\u003cp\u003eLeylin cried out involuntarily.\u003c/p\u003e\n\u003cp\u003e“You’re finally awake?” The old witch advanced as she cackled.\u003c/p\u003e\n\u003cp\u003e“Foreign intruders, speak the password!” The woman inside the oil painting blinked again as information directly entered each Magus that was present.\u003c/p\u003e\n\u003cp\u003e“Password? Your masters have all perished, and right now we’ve come to take everything inside the secret plane!”\u003c/p\u003e\n\u003cp\u003eThe old witch was staring at the woman in the oil painting, “If you choose to comply, there might be a place for you inside my storage room!”\u003c/p\u003e\n\u003cp\u003e“Password incorrect!” The woman inside the painting said. Leylin was keenly aware of that the fan which the noble woman held inside her hand closed slightly.\u003c/p\u003e\n\u003cp\u003e“It’s only a being conjured by spells, yet it dares to disobey me!”\u003c/p\u003e\n\u003cp\u003eThe old witch’s eyes emitted green lights, and a ring of green fireballs emerged flying directly toward the oil painting.\u003c/p\u003e\n\u003cp\u003e*Bam!*\u003c/p\u003e\n\u003cp\u003eAs the green fireballs burned the oil paint, the noble woman’s fan closed entirely exposing the face behind it.\u003c/p\u003e\n\u003cp\u003eLeylin didn’t expect that under the beautiful half of the noble woman’s face was a nose and mouth composed entirely out of bones.\u003c/p\u003e\n\u003cp\u003eThis appearance was as if the flesh and blood below the noble woman’s eyes had instantly disappeared.\u003c/p\u003e\n\u003cp\u003eA feeling of discrepancy and wrongness suddenly assaulted Leylin’s thoracic cavity.\u003c/p\u003e\n\u003cp\u003e*Scree!*\u003c/p\u003e\n\u003cp\u003eFollowing that, the shrill sound of a woman flooded the whole corridor.\u003c/p\u003e\n\u003cp\u003eThe green fireballs started to crumble, turning into small spark of green fire. Following which it directly extinguished in the fluctuation of the air.\u003c/p\u003e\n\u003cp\u003e[Beep! Host is being attacked by sound waves. Resemblance to banshee wail 67%. Abnormality in muscle coordination, spiritual force circulation rate lowered by 89%...]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip projected the status with red color in front of Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003e“Banshee wail? Could it be that there is a genuine banshee trapped inside that oil painting?” Leylin was startled, immediately a layer of crimson membrane appeared outside his body and isolated the sound.\u003c/p\u003e\n\u003cp\u003eEven though his ears still hurt, but his body has regained his mobility.\u003c/p\u003e\n\u003cp\u003eAt the same time, a couple of blood red tentacles like intestines protruded from the oil painting and they headed for Brass Ring.\u003c/p\u003e\n\u003cp\u003e“Damnable thing!” Brass Ring cursed as his body protruded countless bone spikes. The red intestines was directly pierced and was severed.\u003c/p\u003e\n\u003cp\u003e“Bone Spike Arts?!” Leylin was startled, “He actually solidified this kind of innate spells onto himself, is he a masochist?”\u003c/p\u003e\n\u003cp\u003eBone Spike Arts was a rank 1 spell, and was quite formidable. But its activation process was quite a hassle. It needed to be grown from a Magus’ own skeleton then pierce the Magus’ own muscle before attacking his opponent.\u003c/p\u003e\n\u003cp\u003eThis kind of spell was literally hurting oneself before hurting your opponent, only maniacs and masochist would pick this.\u003c/p\u003e\n\u003cp\u003e“I’ll tear you damnable thing to pieces!”. One could see that Brass Ring was quite enraged since he was forced to use his innate spell.\u003c/p\u003e\n\u003cp\u003ePresently, his whole body was covered with bone spikes. It gave one the impression that he was like a white sea urchin.\u003c/p\u003e\n\u003cp\u003eAt the same time, a green light spread from below his neck to his whole body, initiating blood staunching and similar effects.\u003c/p\u003e\n\u003cp\u003e“Stop!” The old witch’s body started to emit countless translucent spirit bodies, and every one of them circulated around Brass Ring’s body, making his speed drop.\u003c/p\u003e\n\u003cp\u003e“There is a spell effect on this oil painting, if you tear it apart the whole entrance to the secret plan will also collapse!”\u003c/p\u003e\n\u003cp\u003eThe old witch’s expression turned serious, “Let me do it!”\u003c/p\u003e\n\u003cp\u003eWhen the previous Banshee wail had struck, the bodies of both the old witch and Jaye emitted a black colored membrane. It seemed like neither of them suffered any injuries.\u003c/p\u003e\n\u003cp\u003e“Your Banshee wail was pretty good, it is a shame that the matching spell formation has been half collapsed due to the passage of time. What’s left isn’t something than can affect us official Magi…”\u003c/p\u003e\n\u003cp\u003eThe old witch looked upon the Banshee within the oil painting with pity, as she stroked the surface of the painting with her hand.\u003c/p\u003e\n\u003cp\u003eFollowing which tiny dark purple dots originated from the old witch’s palm and spread continuously. Like someone was adding a coat of paint.\u003c/p\u003e\n\u003cp\u003e“Come forth! My baby!”\u003c/p\u003e\n\u003cp\u003eThe old witch said softly, her voice sounding tender and flirtatious.\u003c/p\u003e\n\u003cp\u003eAs soon as these words were uttered, the Banshee within the painting turned fearful, as if she had encountered her natural enemy.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-175\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-177\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-176","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
