{"id":58740,"no":184,"title":"Chapter 184","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eThe Awakening\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eUpon hearing her words, Leylin looked up in surprise.\u003c/p\u003e\n\u003cp\u003eUnconsciously, they had already reached the peak of the mountain of white bones.\u003c/p\u003e\n\u003cp\u003eHere, it was completely deserted except for the white altar at the peak of the mountain.\u003c/p\u003e\n\u003cp\u003eIf one looked closely, it could be seen that the altar was made entirely out of human bones. These bones emitted energy fluctuations that far exceeded that of a rank 1 Magus and below, and just the aura made the air stifling, even for Leylin.\u003c/p\u003e\n\u003cp\u003eOn some bones that were wider, there were strange runes handwritten in blood.\u003c/p\u003e\n\u003cp\u003eThese runes were extremely complicated. Some were similar to 3D images, and Leylin had never seen any of them before.\u003c/p\u003e\n\u003cp\u003eWhat struck him the most was how, even though the runes had existed for over five thousand years, the blood was bright red and still looked fresh, as if ready to drip to the ground.\u003c/p\u003e\n\u003cp\u003eThey were arranged in a strange manner and seemed to form a map.\u003c/p\u003e\n\u003cp\u003eLeylin took a closer look and realised that he recognised several of the areas in the secret plane. Filled with ecstasy, he immediately got the A.I. Chip to record everything down.\u003c/p\u003e\n\u003cp\u003eAt the very centre of the altar, there was an odd skull used as a sacrifice.\u003c/p\u003e\n\u003cp\u003eThe skull was similar to that of a human’s skull, but on the cranium, there were two black, bent horns like that of a goat.\u003c/p\u003e\n\u003cp\u003eAlso, in the middle of the two horns, there was a small round hole that seemed to serve no purpose.\u003c/p\u003e\n\u003cp\u003e“Is this the spirit altar you were looking for?”\u003c/p\u003e\n\u003cp\u003eLeylin glanced at the old witch, but her eyes were already fixed on the altar. She was murmuring words in a language that he did not know, and seemed to have forgotten about the existence of the others with her.\u003c/p\u003e\n\u003cp\u003eWhat made Leylin more surprised was Jaye, who was beside him. Even with the cover of the huge black cloak, Leylin could tell she was shivering badly.\u003c/p\u003e\n\u003cp\u003eThis discovery worried Leylin, and at the same time, a sense of unease in his heart was intensified.\u003c/p\u003e\n\u003cp\u003e“It’s here. Right here… My darling, I can now help you…”\u003c/p\u003e\n\u003cp\u003eWhile mumbling incessantly, the old witch produced a fragment of a piece of parchment and threw it towards the altar.\u003c/p\u003e\n\u003cp\u003eAt the same time, Jaye, who had been shaking all this while, suddenly made her move!\u003c/p\u003e\n\u003cp\u003eStreams of translucent, faintly green rays of light descended from the heavens and formed a large net, aiming for Leylin. The surrounding air produced a hissing sound, and there seemed to be some undulations in the scenery around them.\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003eLeylin bellowed, though his expression did not undergo much changes.\u003c/p\u003e\n\u003cp\u003eIt was apparent that he had been expecting something like this, and had thus made some preparations.\u003c/p\u003e\n\u003cp\u003e*Boom!*\u003c/p\u003e\n\u003cp\u003eOn Leylin’s head, countless black strands of hair seemed to have lives of their own as they wriggled to counter the approaching green net.\u003c/p\u003e\n\u003cp\u003e*Pu Pu!*\u003c/p\u003e\n\u003cp\u003eThe instant the half transparent green net and the black strands of hair met, large amounts of white gas emerged, and the sound of corrosion constantly erupted in the air.\u003c/p\u003e\n\u003cp\u003eWith a wave of his hair, Leylin’s figure flickered and he shifted over ten metres away from his original spot.\u003c/p\u003e\n\u003cp\u003e“Madori Defensive Spell Formation!” Jaye, who was in the black cloak, was well aware that Leylin’s power surpassed hers. She had acted first in order to gain the upperhand.\u003c/p\u003e\n\u003cp\u003eWhile Leylin was dealing with that large net, Jaye had already fixed up a defensive formation around the spirit altar!\u003c/p\u003e\n\u003cp\u003e“Activate!” Along with Jaye’s words, translucent black rays rose around the spirit altar, keeping the altar, Jaye and the old witch protected inside.\u003c/p\u003e\n\u003cp\u003e“Latent Fireball!” With a flash of Leylin’s eyes, countless black fireballs emerged from the shadows, rushing towards the black dome!\u003c/p\u003e\n\u003cp\u003e*Bang!*\u003c/p\u003e\n\u003cp\u003eThe numerous black fireballs converged and its volume expanded by more than ten times. With the added bonus of Leylin’s elemental essence conversion of 70%, its might had become exceedingly horrifying.\u003c/p\u003e\n\u003cp\u003eUnder this level of attack, an ordinary Magus’ innate defensive spell would be completely destroyed within seconds!\u003c/p\u003e\n\u003cp\u003eThe black flames spread, and even with Jaye within the dome trying her very best to maintain it, it was still vibrating vigorously, as if on the verge of breaking.\u003c/p\u003e\n\u003cp\u003eHowever, Jaye was unperturbed and chanted a few incantations.\u003c/p\u003e\n\u003cp\u003e*Buzz buzz!* From the bottom of the altar, a circle of black light emerged, merging with the defensive spell formation.\u003c/p\u003e\n\u003cp\u003e*Peng!*\u003c/p\u003e\n\u003cp\u003eWith the addition of this circle of light, the entire defensive spell formation immediately became more radiant. Its colour was black to the extreme, and it was almost impossible to see the figures behind the formation.\u003c/p\u003e\n\u003cp\u003eFlames from the Latent Fireball burnt at the surface of the dome for over ten seconds.\u003c/p\u003e\n\u003cp\u003eBut when facing the reinforced defensive spell formation, they could do little but succumb and disperse.\u003c/p\u003e\n\u003cp\u003e“This…”\u003c/p\u003e\n\u003cp\u003eSeeing how Jaye seemed to be able to take advantage of the powers of the laboratory, Leylin hastily moved a few steps backwards.\u003c/p\u003e\n\u003cp\u003eThe old witch was sure to have hidden a lot of information from him. Thinking back to the spirit explosion that she had previously used and what had happened with the Loathsome Evil, Leylin was certain that the old witch had found out about these ruins much earlier, contrasting with what she had said. She must have already reaped a bountiful harvest from within the ruins before this expedition.\u003c/p\u003e\n\u003cp\u003e“Give up! This is the core of the secret plane. After borrowing a portion of its strength, it’s impossible to break through this defensive formation unless your power has reached such heights that you’re able to destroy this entire secret plane!”\u003c/p\u003e\n\u003cp\u003eFrom within the black dome, Jaye’s faint voice was transmitted over. However, there was no hint of joy in her gaze and her eyes were not on Leylin but rather on the witch. There were dozens of complicated emotions on her face- anticipation, joy, and also… fear!\u003c/p\u003e\n\u003cp\u003eUpon coming into contact with the altar, the yellowed fragmented piece of parchment burst into flames.\u003c/p\u003e\n\u003cp\u003eThese flames were a light yellow and extremely pure. They started off as small as a bean and gradually crept to engulf the entire parchment, the flames turning light blue.\u003c/p\u003e\n\u003cp\u003eAt the same time, the altar seemed to come to life and began to tremble.\u003c/p\u003e\n\u003cp\u003eFrom the gaps between the bones of the altar, fresh red blood trickled down. Dark rays were emitted from the eye sockets of many skulls.\u003c/p\u003e\n\u003cp\u003e“Old witch! You’d better calm down. It’s obvious that there’s an extremely strong and evil being trapped within the altar. I don’t care if you made a pact or some contract with it, but the strong won’t bother making transactions with the weak.”\u003c/p\u003e\n\u003cp\u003eOutside the spell formation, Leylin recalled what he had seen and hastily spoke.\u003c/p\u003e\n\u003cp\u003e“Of course, I know what’s in there! I knew about it 157 years ago! If not for it being in hibernation, and the conditions to awaken it being too harsh, I would have summoned it a long time ago… As long as I summon it, I can…”\u003c/p\u003e\n\u003cp\u003eThe old witch’s facial muscles twisted, her expression crazed as she gestured wildly.\u003c/p\u003e\n\u003cp\u003eThis exposed her knowledge about the ruins.\u003c/p\u003e\n\u003cp\u003e“You need to think this through. This is an evolved being that escaped out of the Loathsome Evil’s body and is much more sinister and vicious. It’s something the likes of you definitely can’t control.”\u003c/p\u003e\n\u003cp\u003eAs Leylin persuaded her, he’d already left his original position and backed away to where they had climbed up, a ring of Darkness energy particles around his two legs.\u003c/p\u003e\n\u003cp\u003e“I know better than you how vicious it can get! Even though I can’t control it, I know how it was assembled and basically everything there is to know about it. As long as we give enough offerings, with the power of this spirit altar, I can definitely…”\u003c/p\u003e\n\u003cp\u003eHer eyes were crazed as she spread out her arms and yelled, “Come out! The collective body of vengeance, the manipulator of spirits and bodies! The supreme king, Gargamel!”\u003c/p\u003e\n\u003cp\u003e“Gargamel?!” Leylin’s heart lurched.\u003c/p\u003e\n\u003cp\u003eBefore he had come here, he had seen plenty of records regarding the Ancient Spirit Slaying Sect and naturally knew about this Gargamel. It was a being that the sect had worshipped.\u003c/p\u003e\n\u003cp\u003eThey believed that a spirit was the last resting place for all beings, and the Gargamel was the one in charge of all these spirits!\u003c/p\u003e\n\u003cp\u003eIt was apparent that this was a Gargamel that had already taken shape after the Ancient Spirit Slaying Sect’s immense efforts in cultivating it! However, for some reason, this Gargamel had been sealed here by the Magi of the sect.\u003c/p\u003e\n\u003cp\u003eThe old witch had obviously received the inheritance from the Ancient Spirit Slaying Sect and obtained many benefits. She had also been working hard to unseal the Gargamel.\u003c/p\u003e\n\u003cp\u003eLeylin believed he had a rough understanding of this whole situation.\u003c/p\u003e\n\u003cp\u003eThe black ring of light around his legs flashed and, wrapped in energy particles, his body’s speed reached its limits and he instantly disappeared away from the mountain.\u003c/p\u003e\n\u003cp\u003eEven though he had no idea why the old witch had swindled him and Brass Ring into coming here, it definitely wasn’t anything good!\u003c/p\u003e\n\u003cp\u003eLeylin felt it was better if he retreated as soon as possible.\u003c/p\u003e\n\u003cp\u003eAs long as he was out of this secret plane, even if the old witch and Jaye attacked together, Leylin was certain he could take care of them.\u003c/p\u003e\n\u003cp\u003e“A smart move, but it’s a pity that it’s too late…” Jaye, who was nearby, gave a low sigh.\u003c/p\u003e\n\u003cp\u003eAt this very moment, the piece of parchment on the altar had already been burnt to ashes and, with a cry from the old witch, streams of black gases streamed out of the gaps within the bones of the altar.\u003c/p\u003e\n\u003cp\u003e*Weng Weng!*\u003c/p\u003e\n\u003cp\u003eAn ancient devil was awake once more.\u003c/p\u003e\n\u003cp\u003eAn aura that caused one’s heart to palpitate in fear arrived on top of the mountain of white bones.\u003c/p\u003e\n\u003cp\u003eIce-cold! Evil!\u003c/p\u003e\n\u003cp\u003eLeylin felt as if he had returned to his childhood, powerless while surrounded by a group of direwolves.\u003c/p\u003e\n\u003cp\u003eHe hated being made aware of how fragile his life was.\u003c/p\u003e\n\u003cp\u003eJust with the leakage of this aura, the secret plane vibrated slightly.\u003c/p\u003e\n\u003cp\u003eA vast amount of black gas converged and gradually solidified, forming a gigantic translucent figure.\u003c/p\u003e\n\u003cp\u003eThe figure brought the skull on top of the altar to its face, treating it as a mask. Its two completely red eyes seemed to be looking down on every one of the Magi present as if they were mere ants.\u003c/p\u003e\n\u003cp\u003eLeylin’s heart plummeted, and he could not gather any strength.\u003c/p\u003e\n\u003cp\u003e“Jiik!” The black figure bellowed towards the heavens.\u003c/p\u003e\n\u003cp\u003eWith the tremendous sound waves, the black defensive spell formation that had caused Leylin much trouble instantaneously gave way, and the old witch and Jaye were forced aside from the pressure.\u003c/p\u003e\n\u003cp\u003e*Pu!*\u003c/p\u003e\n\u003cp\u003eAs the old witch flew backwards, mouthfuls of blood spurted out like water gurgling in a spring.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-183\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-185\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-184","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
