{"id":58745,"no":189,"title":"Chapter 189","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eThe Great Magus War\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIn the dimly lit basement.\u003c/p\u003e\n\u003cp\u003eA faint red ball of light floated in midair, constantly emitting blood red rays of light, which caused the lighting of the basement to be slightly gloomy, and gave off a horrifying atmosphere.\u003c/p\u003e\n\u003cp\u003eThe previous Grand Knight, Number 1, was lying flat on the enormous white metal experimental table.\u003c/p\u003e\n\u003cp\u003eHis eyes were tightly closed, and his eyelids were constantly moving, as though he was being tortured in his dreams.\u003c/p\u003e\n\u003cp\u003eMoreover, the black brands on his body seemed to be alive, constantly lengthening and shortening as it wiggled. Moreover, it slowly protruded from his skin, giving off dark red rays of light as he breathed.\u003c/p\u003e\n\u003cp\u003e“The ancient Branded Swordsman used the magic runes and arrays crafted onto their bodies to enable them to store the world’s natural energy particles into their body. Those particles could also be completely released during critical moments, turning into a terrifying spell! Moreover, the Branded Swordsman’s physical abilities were far beyond the limits of ordinary people, reaching an unfathomable stage because a large amount of energy particles constantly reformed their bodies!”\u003c/p\u003e\n\u003cp\u003eCurrently, it could be said that Leylin was the top person in the south coast regarding the knowledge of the Branded Swordsman.\u003c/p\u003e\n\u003cp\u003eWith a white scalpel and tweezers in his hands, Leylin finally looked at Number 1, who was still unconscious.\u003c/p\u003e\n\u003cp\u003e“Even though I’m slightly eager to gain instant benefits, I can’t consider it any further!”\u003c/p\u003e\n\u003cp\u003eLeylin sighed as he said that. He still needed to get numerous results from the experiments conducted on the five Grand Knights using the A.I. Chip in order to gain accurate parameters before he could inscribe the final energy pathways.\u003c/p\u003e\n\u003cp\u003eHowever, time was pressing.\u003c/p\u003e\n\u003cp\u003eThe news concerning the war’s imminence had arrived so suddenly that it messed up most of Leylin’s original plans.\u003c/p\u003e\n\u003cp\u003eInitially, Leylin was certain that he would make the second transition in his bloodline by the time the Branded Swordsman’s experiment succeeded. At that moment, with his increase in power, it wouldn’t be impossible for him to battle against a rank 2 Magus.\u003c/p\u003e\n\u003cp\u003eA rank 2 Magus was at the level of the principal of the Abyssal Bone Forest Academy, who possessed great magical powers.\u003c/p\u003e\n\u003cp\u003eIf he could calmly wait and silently accumulate power, Leylin could quickly reach the peak domain that the majority of rank 1 Magi couldn’t reach in their entire lifetime.\u003c/p\u003e\n\u003cp\u003eHowever, everything was in ruins due to the dreadful news of the war.\u003c/p\u003e\n\u003cp\u003eAt this moment, all Leylin could do was quicken his research in hopes that by the time the war came, he could produce Branded Swordsmen. He didn’t expect them to have the full might of the ancient Branded Swordsman but possess at least 50-60% of their original power, which would be sufficient to ensure his life during the chaos of the war.\u003c/p\u003e\n\u003cp\u003eLeylin took a deep breath after he sorted through his thoughts.\u003c/p\u003e\n\u003cp\u003eAt that instant, he completely calmed down, dispelling all distracting thoughts from his mind.\u003c/p\u003e\n\u003cp\u003eAn indifferent light flashed past his eyes as Leylin carved at Number 1’s chest with the assistance of the A.I. chip.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Roar!” An enormous Venom Wyvern, accompanied by a distinct loud cry, dove down from the sky. It abruptly spread its wings when it was a couple of meters above the ground.\u003c/p\u003e\n\u003cp\u003e*Whoosh!* Enormous green wings covered the sky, casting a large shadow on the ground.\u003c/p\u003e\n\u003cp\u003eAfter spreading its wings, the enormous Venom Wyvern’s speed of descent drastically decreased, entering a gliding state. After gliding for a couple of meters in the air, it steadily landed on the Four Seasons Garden’s general headquarters’ landing pad.\u003c/p\u003e\n\u003cp\u003e*Bang!* The enormous beastial claws collided with the platform. When those sharp claws contacted the floor with such a large amount of momentum, it left several meter-deep markings.\u003c/p\u003e\n\u003cp\u003eSwish! A Magus who was wearing a white robe embroidered with plants directly jumped off the back of the Venom Wyvern.\u003c/p\u003e\n\u003cp\u003e“Lord Leylin!”\u003c/p\u003e\n\u003cp\u003eThe surrounding Four Season Garden acolytes hastily went forth to bow to him.\u003c/p\u003e\n\u003cp\u003eThere were two other armoured men that also jumped off from the Venom Wyvern’s back after Leylin disembarked. There were enormous greatswords the size of a door attached on their backs.\u003c/p\u003e\n\u003cp\u003e“These two are my followers. According to the school’s rules, I’ve the rights to bring two servants to live with me! Register them for me!”\u003c/p\u003e\n\u003cp\u003eLeylin told one of the acolytes, “You also to feed Hawke, and increase the amount of red bread pigs by two heads. It recently entered a state of binge eating prior to maturity, so it requires a lot of food…….”\u003c/p\u003e\n\u003cp\u003e“Your wish is our command, lord!” That acolyte deeply bowed as he commanded the rest of the subordinates behind him to start washing and cleaning the Venom Wyvern\u003c/p\u003e\n\u003cp\u003eThe acolyte seemed to have rapidly recorded something down. After a short while, he passed two metal tablets to Number 2 and 3, who were behind Leylin.\u003c/p\u003e\n\u003cp\u003eThe two tablets were completely black, and on the surface, there was a scarlet rune marking. The marking consisted of an inverted triangle within a circle, with a coiled black snake in the centre.\u003c/p\u003e\n\u003cp\u003eThis was Leylin’s secret imprint.\u003c/p\u003e\n\u003cp\u003e“This will be your access pass. Take good care of it, as the replacement procedure is extremely troublesome! Moreover, there are some restricted areas that you’re forbidden from entering, as we are currently in a state of emergency. If you do, you’ll be caught by the guards as a spy!”\u003c/p\u003e\n\u003cp\u003eThat acolyte’s expression was very stern, which made Leylin apprehensive.\u003c/p\u003e\n\u003cp\u003e“That’s acceptable!” Leylin nodded before leaving this place along with Number 2 and Number 3.\u003c/p\u003e\n\u003cp\u003e“Is the situation already that severe?” Seeing the Magi rushing around on the way, combined with the warning from that acolyte, Leylin’s heart was slightly heavy.\u003c/p\u003e\n\u003cp\u003eLeylin, who had gotten a lot of information from the previous experiment, rushed to reach the general headquarters of the Four Seasons Garden the next day.\u003c/p\u003e\n\u003cp\u003eAfter all, he didn’t want to get into a conflict with the Four Seasons Garden.\u003c/p\u003e\n\u003cp\u003eWhile he was still conducting experiments regarding the Branded Swordsman, he had brought Number 2 and Number 3 with him to make some adjustments to them using the result from experiments conducted on Number 1. Currently, Leylin had a higher understanding in his research on the Branded Swordsman!\u003c/p\u003e\n\u003cp\u003eUnder the calculations from the A.I Chip, Number 2 and Number 3 would definitely become good assistants for Leylin after they became Branded Swordsmen.\u003c/p\u003e\n\u003cp\u003eLeylin had made great progress regarding the problem in controlling them.\u003c/p\u003e\n\u003cp\u003eHe used the white termite as the main ingredient to make modifications to the two Grand Knights and used potions to increase the degree to which the brand was carved into their spirits.\u003c/p\u003e\n\u003cp\u003eHe should be able to control their consciousness to make them completely enslaved, under those two control measures.\u003c/p\u003e\n\u003cp\u003eAs for the Grand Knights Number 4 and Number 5, they were completely crippled, as the branded runes on their bodies were not compatible with them. The branding of runes wasn’t like drawing, where you could just erase your mistakes. Runes would be forever carved onto the body, and would also reside deep inside the spirit, forming a connection. This was the only way that the Branded Swordsmen could activate the natural energy particles!\u003c/p\u003e\n\u003cp\u003eSince it was Leylin’s first time operating, and he was lacking in experience and information, he had already carved the wrong runes onto the previous two female Grand Knights.\u003c/p\u003e\n\u003cp\u003eCurrently, there wasn’t a way for Leylin to erase those runes, so they would forever lose their chances in improving and, would stay at the rank of Grand Knight for the rest of their lives.\u003c/p\u003e\n\u003cp\u003eLeylin would naturally not bring those two burdens with him. He had instructed Damien and the two female Grand Knights to defend his villa in the Nightless City as a future supply base.\u003c/p\u003e\n\u003cp\u003eTruthfully, Leylin was still in the darkness regarding the information of the war.\u003c/p\u003e\n\u003cp\u003eHe knew that war was imminent, but didn’t know why it was occurring. Who were the opposing forces? Everything was shrouded from him.\u003c/p\u003e\n\u003cp\u003eHowever seeing how the Four Season Garden was acting as though it was going to meet a formidable enemy in combat, he could guess that the enemy, this time, wasn’t a simple one.\u003c/p\u003e\n\u003cp\u003eInformation gathering was one of the reasons why Leylin decided to come to the general headquarters of the Four Seasons Garden.\u003c/p\u003e\n\u003cp\u003eAfter arranging for the two Grand Knights to stay at the residential area of the Four Seasons Garden, Leylin briskly walked to the main lounge of the Potioneering team.\u003c/p\u003e\n\u003cp\u003eIt was rare for the two mischievous stone statues to not be creating trouble, so Leylin passed through them quickly.\u003c/p\u003e\n\u003cp\u003e*Creak!*\u003c/p\u003e\n\u003cp\u003eWhen the door opened, the lounge was still as flourishing and vast as before. A long, white birch table and chairs were orderly arranged. There was a white tablecloth on the table, on the side of which delicate flowers had been stitched.\u003c/p\u003e\n\u003cp\u003eDifferent teams in the Potioneering team sat at their respective positions, and constantly chattered among themselves.\u003c/p\u003e\n\u003cp\u003eThe only difference, this time, was that the table wasn’t filled with food, but was instead occupied by various documents and crystal balls that were being perused for information.\u003c/p\u003e\n\u003cp\u003eThe master’s position in the lounge wasn’t filled. It seemed that Decarte must have been busy, and couldn’t come here for the time being.\u003c/p\u003e\n\u003cp\u003eLeylin surveyed the area, and found the where Martin’s team was.\u003c/p\u003e\n\u003cp\u003eWhen he met Martin for the first time, that old fellow was positioned extremely far from the host’s position. However, now that Leylin had joined and completed some missions, that old man’s position had moved quite a bit forward. This was something that Martin had constantly bragged about to everyone.\u003c/p\u003e\n\u003cp\u003eHowever, even though he was sitting here, the excitement of being in this seat couldn’t cover the worry expressed on Martin’s face.\u003c/p\u003e\n\u003cp\u003eAfter seeing Leylin, Martin’s wrinkle covered face displayed a smile. “Leylin! Over here!”\u003c/p\u003e\n\u003cp\u003eHe pointed to the seat beside him.\u003c/p\u003e\n\u003cp\u003eLeylin smiled, and after greeting the few Magi that he knew, he walked over to sit beside Martin.\u003c/p\u003e\n\u003cp\u003e“I’m really glad that you could make it! You should know that due to this dreadful war, our tasks have become much more arduous…….”\u003c/p\u003e\n\u003cp\u003eSince they were extremely close to each other, Martin started to express his complaints to Leylin.\u003c/p\u003e\n\u003cp\u003e“Sorry! I’ll definitely work hard in the Potioneering aspect, so can you tell me the details regarding the war? I was previously exploring before I received the Lord leader’s secret imprint, so I’m currently still at a loss as to what is happening!”\u003c/p\u003e\n\u003cp\u003eLeylin’s face showed a textbook example of confusion.\u003c/p\u003e\n\u003cp\u003e“Oh! Look at my manners!” Martin patted his large forehead.\u003c/p\u003e\n\u003cp\u003e“Which part shall I start talking from?”\u003c/p\u003e\n\u003cp\u003eMartin stroked his beard and expressed a pondering expression.\u003c/p\u003e\n\u003cp\u003e“To be honest, the source of this battle is related to the previous two Magus wars…..”\u003c/p\u003e\n\u003cp\u003eMartin commented slowly, his expression becoming serious.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-188\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-190\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-189","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
