{"id":58749,"no":193,"title":"Chapter 193","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eTurin Language\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eSimilar to Abyssal Bone Forest Academy, there were restricted areas in the Four Seasons Garden’s library.\u003c/p\u003e\n\u003cp\u003eThe place Leylin wanted to go to was the Four Seasons Garden’s secret storage room.\u003c/p\u003e\n\u003cp\u003eIn this private room, large amounts of knowledge regarding various subjects were open to official Magi. The fees were extremely expensive, and even the current Leylin was in pain over the costly price.\u003c/p\u003e\n\u003cp\u003eAlthough he could copy the information with the A.I. Chip, that still took time.\u003c/p\u003e\n\u003cp\u003eLeylin had calculated that even if he used up all his contribution points, it would barely give him enough time to record half of the information available in the room.\u003c/p\u003e\n\u003cp\u003eHe had originally planned to amass enough contribution points first and then record all the information at one go.\u003c/p\u003e\n\u003cp\u003eBut now...\u003c/p\u003e\n\u003cp\u003eLeylin went straight to the second floor of the library and waved his transparent crystal card at an old bookshelf.\u003c/p\u003e\n\u003cp\u003e*Kreeeen!* The bookshelf moved backwards, revealing a small passage.\u003c/p\u003e\n\u003cp\u003eBehind the passage was a small library with strangely shaped books placed on the rows of black wooden bookshelves within.\u003c/p\u003e\n\u003cp\u003eSome of the books even had pairs of arms and legs, and if not for the iron chains restraining them, they might just stealthily escape.\u003c/p\u003e\n\u003cp\u003eAs he had a goal in mind, Leylin ignored them.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip! Scan the catalogue. Search keywords: Ancient Spirit Slaying Sect, Emergency Passages…”\u003c/p\u003e\n\u003cp\u003eTo find the content he needed from within this extremely extensive library, a lot of time would be wasted. Luckily for him, Leylin had the A.I. Chip, and within a few minutes, he found the information he wanted.\u003c/p\u003e\n\u003cp\u003e“I see…”\u003c/p\u003e\n\u003cp\u003eFollowing the A.I. Chip’s instructions, Leylin came to a corner and flipped through a very old book.\u003c/p\u003e\n\u003cp\u003eIt was extremely thick and heavy, and the cover was an ashen grey. The A.I. Chip judged that this book was made of a very special ancient stone material.\u003c/p\u003e\n\u003cp\u003eThis method of bookmaking belonged to an interesting group of tiny sub-humans—the Stone Men!\u003c/p\u003e\n\u003cp\u003eThis was a race that had an appearance extremely similar to that of humans, but the main difference was the thick layer of calcite on their skin, which looked very much like someone casting a stone-skin spell.\u003c/p\u003e\n\u003cp\u003eLeylin read through this large book made of stone. On one of the pages, a strange spell formation had been carefully recorded.\u003c/p\u003e\n\u003cp\u003e“It’s this one! It’s more than 90% similar to the spell formation in the secret plane of the Ancient Spirit Slaying Sect!” Leylin’s expression brightened up.\u003c/p\u003e\n\u003cp\u003eRight before his eyes, the A.I. Chip brought up a picture of the ancient spell formation that he had obtained from the secret plane. He then compared it to the spell formation that was recorded down, and came to a conclusion that the two had a similarity of over 90%!\u003c/p\u003e\n\u003cp\u003e“That’s astonishing!”\u003c/p\u003e\n\u003cp\u003eLeylin continued analysing it, looking increasingly cautious.\u003c/p\u003e\n\u003cp\u003eOnly now did he realise the true purpose of that spell formation—teleportation!\u003c/p\u003e\n\u003cp\u003eIn the secret room that Leylin had found a corpse in while escaping, there still existed an ancient teleportation formation!\u003c/p\u003e\n\u003cp\u003eThis type of teleportation formation could instantaneously teleport a few Magi to a distance further than several times the length of the south coast. However, due to the geologic faults and the extinction of crucial ingredients, the current south coast no longer had traces of these formations.\u003c/p\u003e\n\u003cp\u003eThe Stone Men then were the best slaves that the ancient Magi used to construct the teleportation formations. It was because of this reason that there were records of this race.\u003c/p\u003e\n\u003cp\u003e“So in the space between levels in the emergency passage, there’s actually an ancient teleportation formation?”\u003c/p\u003e\n\u003cp\u003eJust the thought of it made Leylin breathe more quickly.\u003c/p\u003e\n\u003cp\u003eThe south coast was surrounded by regions filled with varying levels of danger. In some places, rank 2 or 3 Magi would only be sending themselves to their death if they went there!\u003c/p\u003e\n\u003cp\u003eIt was because of the existence of such dangers that the Magi in the south coast would rather have an internal strife every once in a while to reduce the number of Magi than venture outwards. They were unwilling to expand the territory and gain more resources.\u003c/p\u003e\n\u003cp\u003eEven if Leylin wanted to leave the south coast and look for traces of the central mainland, he had no way to leave!\u003c/p\u003e\n\u003cp\u003eHowever, with the appearance of the ancient teleportation spell formation, Leylin saw a glimmer of hope!\u003c/p\u003e\n\u003cp\u003eIf he had tremendous luck and found a new land, how much profit would Leylin receive as the controller of the transportation pathway to there?\u003c/p\u003e\n\u003cp\u003e“No, I can’t do this! Calm down! Calm down! Whether this ancient teleportation formation can still be used or not, and where it leads to are all unknown. To make effective use of it, I have to answer all of these questions!”\u003c/p\u003e\n\u003cp\u003eLeylin stroked his chin and calmed his emotions.\u003c/p\u003e\n\u003cp\u003eHe then produced a tattered diary from within his robes. “I might be able to find an answer with information from this diary.”\u003c/p\u003e\n\u003cp\u003eIn the secret compartment within the emergency passage, not only did Leylin find the ancient teleportation formation, but he also found what seemed to be the remains of a high-ranking Magus of the Ancient Spirit Slaying Sect. In addition, he also found some miscellaneous items and this diary on the deceased Magus’ body.\u003c/p\u003e\n\u003cp\u003eThe first thing Leylin did upon returning was to order the A.I. Chip to record all of the information in this tattered diary.\u003c/p\u003e\n\u003cp\u003eUnfortunately, the language used in the diary was not one that the A.I. Chip was able to interpret. This made it difficult for Leylin to decipher the information within!\u003c/p\u003e\n\u003cp\u003e“Those strange people in black gowns who like to enslave spirits preferred to use an odd language and characters to issue commands. As long as we didn’t understand, we would be punished cruelly, which forced us to learn the name of that damned Turin Language!”\u003c/p\u003e\n\u003cp\u003eIn the Stone Men’s books, Leylin found this written account.\u003c/p\u003e\n\u003cp\u003e“No wonder the A.I. Chip couldn’t interpret the contents of the diary. So it was the Turin Language!” Leylin suddenly understood.\u003c/p\u003e\n\u003cp\u003eThe Turin Language was an exclusive language used in ancient times, which used special sound waves and light rays to transmit information. Even its characters contrasted hugely compared to other existing languages.\u003c/p\u003e\n\u003cp\u003eThere were no records of this Turin Language in the A.I. Chip’s database.\u003c/p\u003e\n\u003cp\u003e“Turin Language?”\u003c/p\u003e\n\u003cp\u003eLeylin went around the bookshelf, and in a corner, he finally found a few books that seemed to be written in the Turin Language. There was even a book that gave a concise introduction to interpreting this language.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, scan it!”\u003c/p\u003e\n\u003cp\u003eIn his excitement, Leylin hurriedly opened one of the books and ordered the A.I. Chip to record it down...\u003c/p\u003e\n\u003cp\u003e“My Lord, it’s already time for dinner. Are you planning to enjoy a dinner party here? Your contribution points are almost completely used up at this point…”\u003c/p\u003e\n\u003cp\u003eLeylin was immersed in the sea of knowledge and was using the A.I. Chip to translate and restore the information in the diary.\u003c/p\u003e\n\u003cp\u003eIn summary, there was a crazy Magus who kept using spirits to create the Gargamel. In the end, the experiment backfired on him. This was truly a tragic story.\u003c/p\u003e\n\u003cp\u003eWhat made Leylin most gleeful were the few images similar to the ancient teleportation formation that he found at the back of the diary.\u003c/p\u003e\n\u003cp\u003eBased on the images, as well as some speculations on the A.I. Chip’s part, Leylin would be able to test whether the formation was still workable.\u003c/p\u003e\n\u003cp\u003eNow in a marvellous mood, Leylin didn’t bother with the old manager and glanced at his crystal card. “I got it. I’ll be right out!”\u003c/p\u003e\n\u003cp\u003eDisregarding the old man, who was bowing so deeply his head touched the floor, Leylin jogged out of the library.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip! Based on the information from just now, how complete was the previously recorded ancient teleportation formation?”\u003c/p\u003e\n\u003cp\u003eLeylin asked a little nervously.\u003c/p\u003e\n\u003cp\u003e[Beep! Mission established, sorting through information regarding teleportation, and comparing…]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s mechanical voice sounded.\u003c/p\u003e\n\u003cp\u003eOn the virtual screen in front of Leylin, large numbers of words and images flashed past, with the formation that had been previously recorded placed in the very centre.\u003c/p\u003e\n\u003cp\u003e[Beep! Comparison results: Completion of teleportation formation: 98.8%. Situation on other end of formation unknown, unable to calculate!]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s answer made Leylin grin even more brightly.\u003c/p\u003e\n\u003cp\u003eThough there was still a troublesome Gargamel in the secret plane, Leylin felt that it would be in a hurry to escape. The secret compartment was hidden well, and there was a high chance that it was still well preserved.\u003c/p\u003e\n\u003cp\u003eThe most important thing was the source of energy!\u003c/p\u003e\n\u003cp\u003e“Even ancient teleportation formations needed a source of power! A.I. Chip, what does this formation need to be usable?”\u003c/p\u003e\n\u003cp\u003eLeylin asked.\u003c/p\u003e\n\u003cp\u003e[Magic crystal essence, or some object that contains a dense amount of energy particles!] The A.I. Chip intoned.\u003c/p\u003e\n\u003cp\u003e“Magic crystal essence huh? The magic crystal cards aren’t enough?” Leylin asked.\u003c/p\u003e\n\u003cp\u003e[Beep! The energy contained within is not enough, will require a purifying process to condense the energy. Projected ingredients: 10,000 magic crystal cards or more!]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s reply made Leylin’s legs wobble.\u003c/p\u003e\n\u003cp\u003e“Ten thousand magic crystal cards? A single card has a value of over a thousand magic crystals! Ten thousand magic crystal cards would mean that I will need over ten million magic crystals?!”\u003c/p\u003e\n\u003cp\u003eAfter a year of amassing resources from the light and dark Magi, the magic crystals and materials he had amassed only amounted to a value of less than five million!\u003c/p\u003e\n\u003cp\u003eAnd this A.I. Chip said that it needed twice that amount!\u003c/p\u003e\n\u003cp\u003eIn addition, the A.I. Chip only needed magic crystal cards. Leylin needed to exchange large amounts of resources, magic items, knowledge, potions, and the like for magic crystals. This exchange would result in him racking up huge losses due to his pressing need for them.\u003c/p\u003e\n\u003cp\u003e“So many magic crystals… I’m afraid there will only be that amount stored in a few large scale Magus organisations’ resource-based secret planes.”\u003c/p\u003e\n\u003cp\u003eLeylin then shook his head. “This isn’t the time to think about that. There isn’t anything that requires me to risk my life, and even if it’s the Third Great Magus War, it is still limited to within the Eternal River Plains’ secret plane, and won’t have much of an impact on the outside world!”\u003c/p\u003e\n\u003cp\u003eCurrently, in the Third Great Magus War, the main reason for the fighting was a dispute over the rights to the Eternal River Plains’ secret plane, so the various disputes and conflicts had been taking place within it.\u003c/p\u003e\n\u003cp\u003eAccording to Leylin’s guess, this slice of the cake was way too big, and no single organisation would be capable of devouring it whole. It would definitely be shared with the various large magisteriums and guilds.\u003c/p\u003e\n\u003cp\u003eAs for what Four Seasons Garden and the other guilds had to do, it was to do their best to fight for a larger share!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-192\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-194\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-193","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
