{"id":58750,"no":194,"title":"Chapter 194","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eBlackmail \u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eWhile freely strolling through the streets, Leylin heard an odd sound travel into his ears.\u003c/p\u003e\n\u003cp\u003e“We’re in such a dangerous situation, and yet you’re still so relaxed… It looks like I need to make a suggestion to Decarte for him to give you a more challenging job.”\u003c/p\u003e\n\u003cp\u003eThe tone of this voice was icy, giving Leylin the impression he had attracted the attention of a ravenous wolf.\u003c/p\u003e\n\u003cp\u003eLeylin gave a helpless laugh and scratched his nose, after which he turned back and gave a bow. “Lord Caesar!”\u003c/p\u003e\n\u003cp\u003eIn front of him was a Magus clothed in a black robe. There were several blood-red threads that decorated the robe, and bloodlust constantly emanated from him.\u003c/p\u003e\n\u003cp\u003eWhat was most unforgettable was the eye on his forehead!\u003c/p\u003e\n\u003cp\u003eThis three-eyed Magus was naturally Caesar of the hunting team. He was an elitist, and firmly believed in one’s origin, so after Leylin entered Four Seasons Garden, he just didn’t like Leylin and constantly caused him trouble.\u003c/p\u003e\n\u003cp\u003e“Wasn’t his entire hunting team deployed into the Eternal River Plains’ secret plane? Did something happen that required him to rush back and report?”\u003c/p\u003e\n\u003cp\u003eWhile Leylin made his conjectures, he explained himself to Caesar. “ I, your subordinate, have completed all missions required for me to receive my monthly allocations, and have decided to take a walk to settle my mind.”\u003c/p\u003e\n\u003cp\u003e“I see! Hehe, you’re very capable. There might be a position that suits you better…”\u003c/p\u003e\n\u003cp\u003eUnexpectedly, Caesar did not inconvenience him, and only said something profound before leaving.\u003c/p\u003e\n\u003cp\u003eLeylin was left standing on the road, deep in thought.\u003c/p\u003e\n\u003cp\u003e“What did he mean by that?”\u003c/p\u003e\n\u003cp\u003eSoon enough, Leylin found out the meaning to Caesar’s words.\u003c/p\u003e\n\u003cp\u003eDuring dinner, a banquet was held in the hall. Members of the Potioneering team gathered in the hall and enjoyed a sumptuous meal.\u003c/p\u003e\n\u003cp\u003eHazelnut chicken, roasted suckling pig, honey wine, and other delicious commonplace dishes were everywhere, arranged like trash on every corner.\u003c/p\u003e\n\u003cp\u003eAt the centre of the table, there were also various delicacies that were only available in the Magus World.\u003c/p\u003e\n\u003cp\u003eBubble fish! Dolosen Snake! Butter Yak! In addition, a lot of treasured ingredients that Leylin didn’t even know the names of were arranged neatly there.\u003c/p\u003e\n\u003cp\u003eThe alluring smell of fine wine spread in the air, tempting everyone’s palate.\u003c/p\u003e\n\u003cp\u003e“There must have been much blood shed by the acolytes in preparing these dishes.”\u003c/p\u003e\n\u003cp\u003eLeylin picked up a piece of baked bubble fish, and while his taste buds enjoyed the new experience, he heaved an inward sigh of content.\u003c/p\u003e\n\u003cp\u003eThis bubble fish was a high energy creature in the Magus World with a strength of a level 2 or 3 acolyte.\u003c/p\u003e\n\u003cp\u003eThe Four Seasons Garden’s magic kitchen specifically issued requests for acolytes to gather the fish.\u003c/p\u003e\n\u003cp\u003eBehind this feast, there were the blood, sweat, and tears of countless acolytes who had gone on dangerous expeditions. The results of their efforts, which had garnered them some insignificant returns, eventually turned into gourmet food on the official Magi’s tables!\u003c/p\u003e\n\u003cp\u003e“It’s for this reason that I hope to become the person who will deprive others, and not get deprived myself!”\u003c/p\u003e\n\u003cp\u003eLeylin had a resolute look in his eyes while still maintaining a kind smile about his lips. He took another roasted pig trotter and put it on his plate.\u003c/p\u003e\n\u003cp\u003eWith the nearing of his bloodline’s second transition, Leylin could feel abnormalities in his usual condition.\u003c/p\u003e\n\u003cp\u003eThe most obvious one was a heightened appetite, particularly for the flesh of considerably strong, high-energy creatures.\u003c/p\u003e\n\u003cp\u003eAfter the sumptuous dinner, Decarte knocked on a golden cup on the table.\u003c/p\u003e\n\u003cp\u003e*Ding-ling!*\u003c/p\u003e\n\u003cp\u003eThe entire room instantly turned silent. Leylin and the other Magi stood, waiting for the Potioneering team’s leader to issue missions and inform them of any arrangements.\u003c/p\u003e\n\u003cp\u003e“Everyone! Before we get into the important matters, let me announce something!”\u003c/p\u003e\n\u003cp\u003eDecarte looked at the Magi present and cleared his throat.\u003c/p\u003e\n\u003cp\u003e“Today, the hunting team’s Caesar looked for me, hoping to have a few Potion Masters join him! You must know that in the Eternal River Plains’ secret plane, there are frequent battles, resulting in a lack of healers. Many Potion Masters can use potions to achieve the same effect as healers.”\u003c/p\u003e\n\u003cp\u003eHearing Decarte’s words, Leylin’s heart suddenly lurched.\u003c/p\u003e\n\u003cp\u003e“Now, I’ll announce the list of people to be sent there. They are Wilkenson, Saladin… and lastly, Leylin!”\u003c/p\u003e\n\u003cp\u003eAs expected, Decarte increased his volume and read out Leylin’s name last.\u003c/p\u003e\n\u003cp\u003eIn that instant, Leylin felt countless pairs of eyes staring at him.\u003c/p\u003e\n\u003cp\u003eWithin these gazes were thoughts of curiosity, worry, and most prominently, schadenfreude.\u003c/p\u003e\n\u003cp\u003eHis ostensible team leader was sighing heavily by the side. After Leylin left, with Martin’s abilities, it would be impossible to tackle the heavy workload that resulted from the war. However, Martin did not have the courage to dispute it, since this was the decision of the Potioneering team’s leader.\u003c/p\u003e\n\u003cp\u003e“Oh, my heavens! Leylin! What do we do?”\u003c/p\u003e\n\u003cp\u003eHis partner, Oak, seemed to be completely stunned and gaped at Leylin.\u003c/p\u003e\n\u003cp\u003e“Don’t worry! Even if I am sent to the battlefield, I’ll most likely be working at the back, and won’t be in any real danger!” Seeing that there was someone who genuinely worried for him, a smile appeared on Leylin’s face.\u003c/p\u003e\n\u003cp\u003eIn reality, was there any place on a battlefield that was absolutely safe, especially when he was directly under that three-eyed Magus, Caesar?\u003c/p\u003e\n\u003cp\u003eThe moment he heard Decarte announce his name, Leylin immediately thought about Caesar’s cryptic smile.\u003c/p\u003e\n\u003cp\u003e“The aforementioned Magi have five days to prepare, after which they will be required to go to Four Seasons Garden’s branch at the Eternal River Plains’ secret plane and report. Otherwise, you will be seen as a traitor!”\u003c/p\u003e\n\u003cp\u003eDecarte seemed to be warning them at the end.\u003c/p\u003e\n\u003cp\u003eAfter offending the Abyssal Bone Forest Academy and the Lilytell family, which were both large dark Magi powers, Leylin had no wish to become enemies with an even stronger white Magi organisation.\u003c/p\u003e\n\u003cp\u003eIf it came to that, he would no longer have a place on the south coast.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA day later, Leylin hastily organised everything and brought his two Great Knight servants along. They set off for the Eternal River Plains.\u003c/p\u003e\n\u003cp\u003eThe sun shone mercilessly in the sky.\u003c/p\u003e\n\u003cp\u003eSmoke and dust flew above the ground, and not far away, the air seemed to be distorted.\u003c/p\u003e\n\u003cp\u003eThis torrid heat meant there were almost no people walking on the main street.\u003c/p\u003e\n\u003cp\u003e*Thud Thud Thud!* At this moment, three quick horses hurtled past destroying the calmness and quiet atmosphere on this road.\u003c/p\u003e\n\u003cp\u003e“Master! There’s some shade in front. Shall we take a break there?”\u003c/p\u003e\n\u003cp\u003eNumber 2 reined in his horse and asked Leylin, who was riding behind him.\u003c/p\u003e\n\u003cp\u003e“Let us take a rest. Although we can still manage, the poor horses can’t anymore!”\u003c/p\u003e\n\u003cp\u003eLeylin pointed to the horses, which were on the verge of frothing at the mouth.\u003c/p\u003e\n\u003cp\u003eBehind him, there were a few idle horses, on top of which were boxes and the other luggage they needed had been tied down. They looked listless, with their ears pressed to their heads, and the light in their eyes dim.\u003c/p\u003e\n\u003cp\u003eIf Leylin was travelling alone, he naturally could travel on the Venom Wyvern.\u003c/p\u003e\n\u003cp\u003eHowever, he had to bring his two Grand Knight subordinates and even had to haul around a large amount of luggage. With this large amount of things, it naturally exceeded the burden that the Venom Wyvern could carry.\u003c/p\u003e\n\u003cp\u003eThe Nightless City didn’t have any airships that could directly transport people to the Eternal River Plains’ secret plane, so Leylin could only rely on the most primitive method, which was traveling on horseback.\u003c/p\u003e\n\u003cp\u003eAs for the Venom Wyvern, Leylin commanded it to scout the area in the sky and accompany them on their journey.\u003c/p\u003e\n\u003cp\u003e“Master! Here’s some water!”\u003c/p\u003e\n\u003cp\u003eLeylin found a clean rock for himself to sit on. Number 3, who was behind him, passed him a large leather pouch.\u003c/p\u003e\n\u003cp\u003e“En!” Leylin drank from it.\u003c/p\u003e\n\u003cp\u003eAlthough the temperature did not impact his vitality very much, the ice cold water washing down his throat gave him a very refreshing sensation.\u003c/p\u003e\n\u003cp\u003e“Hmmm?”\u003c/p\u003e\n\u003cp\u003eSuddenly, a gray fog covered the area surrounding the shade of the trees they were under.\u003c/p\u003e\n\u003cp\u003eUnder the dim light, the various branches of the trees looked like the hands of monsters, as if wanting to grab hold of Leylin and the group.\u003c/p\u003e\n\u003cp\u003eAt the same time, a drowsy feeling began to enshroud the three of them.\u003c/p\u003e\n\u003cp\u003e“Who is it?” Number 2 and Number 3 expanded their muscles and were ready to emit energy waves.\u003c/p\u003e\n\u003cp\u003eLeylin’s icy glare stopped them, and they stiffly collapsed onto the floor.\u003c/p\u003e\n\u003cp\u003e“Hei Hei… Blood Rogue, these two Grand Knights of yours have been modified well! They can actually defend against my hypnosis!” The voice of a little boy travelled over.\u003c/p\u003e\n\u003cp\u003eLeylin’s brows furrowed as he heard the name ‘Blood Rogue’.\u003c/p\u003e\n\u003cp\u003eHe was still dressed as a normal Magus, yet this dark Magus from the Thousand Meddling Hands had actually seen through his disguise. From the looks of it, despite his efforts to conceal his identity, part of what he had done had been too high profile, resulting in the discovery of his identity.\u003c/p\u003e\n\u003cp\u003eIt was very likely that even the Four Seasons Garden had similar suspicions about him!\u003c/p\u003e\n\u003cp\u003eIt was because of this that Decarte was glad to see Caesar deploy Leylin elsewhere, and even chairman Reynold did not have any objections.\u003c/p\u003e\n\u003cp\u003e“Boy! What’s the matter?”\u003c/p\u003e\n\u003cp\u003eSince he had been found out, Leylin asked bluntly.\u003c/p\u003e\n\u003cp\u003e“Hehe… This is about Old Devil. She is an elder of the organisation after all, and it’s not known whether she is currently alive or dead. ‘Boss’ had instructed us to investigate thoroughly. According to what I know, her final appearance was to invite you and Brass Ring to participate in an expedition…”\u003c/p\u003e\n\u003cp\u003e“You’re correct! However, Brass Ring had perished inside! As for Old Devil, she is currently not able to leave! As for the secret plane’s location, I have no comments about that!”\u003c/p\u003e\n\u003cp\u003eLeylin did not believe that they would be this concerned about her whereabouts. It was more likely that they were coveting Old Devil’s position as an elder!\u003c/p\u003e\n\u003cp\u003eAs expected, after hearing Leylin’s answer, the boy snickered. “You’re the Blood Rogue, after all! The way you work is straightforward and clear-cut! Let’s stop talking about Old Devil and move on. I currently bring you a mission from Boss!”\u003c/p\u003e\n\u003cp\u003eWith the mention of this boss, the boy sounded more serious.\u003c/p\u003e\n\u003cp\u003e“What’s the meaning of this? Since when does the Thousand Meddling Hands force missions on their members?” Leylin wrinkled his brows. From the looks of it, the all-powerful dark Magus behind the Thousand Meddling Hands had finally been lured to the surface.\u003c/p\u003e\n\u003cp\u003e“Of course, there wasn\u0027t anything like this before! However, it’s all different now! I believe that you will definitely do something for the organisation in order to protect your identity. Am I right, Leylin—or shall I say, Blood Rogue!”\u003c/p\u003e\n\u003cp\u003eThe boy began to threaten him, a hint of arrogance apparent in his tone.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-193\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-195\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-194","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
