{"id":58753,"no":197,"title":"Chapter 197","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eGeorge and Bessita\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin rubbed his nose upon seeing the cautious expressions of the few people around him.\u003c/p\u003e\n\u003cp\u003eIn the Magus world, dark Magi and light Magi were archenemies. And in the Eternal River Plains, which was surrounded by the opposing forces on each side, not attacking after finding out Leylin was a dark Magus showed the immense trust they had in George.\u003c/p\u003e\n\u003cp\u003e“I left the domain of the dark Magi a few years ago and now live in Nightless City.”\u003c/p\u003e\n\u003cp\u003eLeylin thought and spoke a half-truth, “I\u0027m currently studying at Four Seasons Garden.”\u003c/p\u003e\n\u003cp\u003e“See? I knew it! Leylin, you\u0027re brave and honest. How could someone like you be a cruel dark Magus?”\u003c/p\u003e\n\u003cp\u003eGeorge laughed out gleefully.\u003c/p\u003e\n\u003cp\u003eShiera and the others appeared very embarrassed.\u003c/p\u003e\n\u003cp\u003eThe number of Magi that had been killed by Leylin was not public knowledge, but those Magi would have been furious after hearing George’s words.\u003c/p\u003e\n\u003cp\u003e“Oh, by the way, Leylin, are you going to the secret plane?”\u003c/p\u003e\n\u003cp\u003eThe Eternal River’s secret plane was a major event that triggered an earth-shaking response among the Magi of the south coast. The information regarding the secret plane had spread very quickly, and George and the others were not entirely clueless about it.\u003c/p\u003e\n\u003cp\u003eLeylin saw George’s anxious look and the other acolytes’ trading gazes, and he immediately understood.\u003c/p\u003e\n\u003cp\u003eIt seemed that George thought Leylin to be one of the acolytes, who were naive and wanted to try their luck within the secret plane.\u003c/p\u003e\n\u003cp\u003eOf course, this wasn’t surprising since after news about the secret plane spread, acolytes and Magi alike from all over started to convene at this location.\u003c/p\u003e\n\u003cp\u003eThe whole journey was laced with danger. Some died en route, and others would struggle at the entrance and be unable to enter, while others were lured or coerced by the larger powers and became cannon fodder.\u003c/p\u003e\n\u003cp\u003eThere was an extremely small minority of acolytes who would be successful in acquiring some resources from the secret plane and return to Nightless City and other Magi cities. This resulted in a reaction from the magicians in the cities, which in turn incited more acolytes to adventure into the plane.\u003c/p\u003e\n\u003cp\u003eIt was clear that George and the others also considered Leylin to be just like these acolytes.\u003c/p\u003e\n\u003cp\u003e“Leylin...” George turned silent, seeming to be carefully considering his next words. “The danger inside the secret plane is not something that we acolytes can handle. Only the official Magi, who are the main forces inside the plane, can stay within for long durations of time.”\u003c/p\u003e\n\u003cp\u003e“Many of my friends suffered inside. You’re still young and need not...”\u003c/p\u003e\n\u003cp\u003e“Just let him go!” Bessita suddenly spoke up.\u003c/p\u003e\n\u003cp\u003e“If he\u0027s lucky, he can get some resources and even advance!”\u003c/p\u003e\n\u003cp\u003eGeorge furrowed his brows. How could one count on such a thing as luck? Bessita was speaking of it too lightly.\u003c/p\u003e\n\u003cp\u003e“Actually, I was issued a mission by the academy. I have no choice but to go inside the secret plane.” Leylin sardonically stated.\u003c/p\u003e\n\u003cp\u003e“I see… No wonder then. I warned you only because it doesn’t seem to be in your nature to undertake such a dangerous task.” George patted his close friend’s shoulder in empathy and forced a smile.\u003c/p\u003e\n\u003cp\u003e“In this situation, we are probably all in the same boat and might even be assigned to the same location. After all, within the secret plane, the light Magi have gathered and created an alliance.”\u003c/p\u003e\n\u003cp\u003eAfter hearing that Leylin had been forced to come to the secret plane just like them, Shiera, Alexander, and the others revealed expressions of sympathy. Leylin’s situation was one they could empathise with.\u003c/p\u003e\n\u003cp\u003eThese kinds of missions were usually suicidal by nature. Only those who had no backing or acolytes who had offended important people would be dispatched by their academies to complete these missions.\u003c/p\u003e\n\u003cp\u003eWhen he turned, he saw a hint of an expression on Bessita\u0027s face. Something that seemed like... delight?\u003c/p\u003e\n\u003cp\u003e“Is this girl still brooding over what happened last time?”\u003c/p\u003e\n\u003cp\u003eLeylin inwardly grinned and actually found this a novelty.\u003c/p\u003e\n\u003cp\u003eAt his current level, he had already left Bessita far in the dust.\u003c/p\u003e\n\u003cp\u003eMany Magi had died at Leylin’s hands; what trouble could a lowly acolyte cause?\u003c/p\u003e\n\u003cp\u003eNo matter how she bared her fangs and made threatening gestures at Leylin, she was akin to a small kitten playing with him.\u003c/p\u003e\n\u003cp\u003e“Since we\u0027re all going the same way, how about you join us too, Leylin?\"\u003c/p\u003e\n\u003cp\u003eAt this moment, George put forth a proposal.\u003c/p\u003e\n\u003cp\u003e“Sure!” Leylin gauged that he still had quite a bit of time and, considering the speed at which George and his friends were travelling, he could reach the Eternal River Plain’s secret plane well before the deadline. Thus, he agreed.\u003c/p\u003e\n\u003cp\u003eHis relationship with George was quite good, so he could help out if the need arose.\u003c/p\u003e\n\u003cp\u003eBesides, there were still some matters that needed to be resolved between him and Bessita.\u003c/p\u003e\n\u003cp\u003e“Very good. Since Leylin\u0027s a level 3 acolyte as well, our combined battle strength has increased by a lot. Even if we meet a bandit, there\u0027s no need to be afraid.” George seemed very excited.\u003c/p\u003e\n\u003cp\u003eThe other acolytes did not refute him.\u003c/p\u003e\n\u003cp\u003e“Bandit? You\u0027re actually afraid of bandits?\" Leylin asked, rather stunned. In his mind, the so-called bandits were just peasant farmers with grass pitchforks and fishing spears.\u003c/p\u003e\n\u003cp\u003e“Oh, you don\u0027t know about this?” George seemed to be even more amazed than Leylin. “I can\u0027t believe you came this far when you\u0027re so overwhelming ignorant about the whole situation!\"\u003c/p\u003e\n\u003cp\u003eImmediately, George carefully explained to Leylin, “If it was a bandit group composed of only ordinary humans, then there\u0027s no need for us to worry. Shiera can single-handedly kill all those who come. However, the situation at the Eternal River Plains is different. Due to the number of acolytes travelling there alone, bandit groups that specifically target magicians have appeared. There are even rumours that official Magi are behind these bandit groups.\"\u003c/p\u003e\n\u003cp\u003eDue to large increase in the number of magicians travelling to the Eternal River Plains’ secret plane, the public security in that area was extremely chaotic. Some scattered dark magicians naturally had the idea to fight for the resources.\u003c/p\u003e\n\u003cp\u003eHowever, as these dark magicians were mostly acolytes, their strength was inadequate when compared to Leylin.\u003c/p\u003e\n\u003cp\u003eIf they were official Magi, the greedy dark magicians would be unwilling to attack, but if they were mere acolytes, then the they would not be as hesitant. Compared to the light Magi, who had grown in a protected environment like flowers in a greenhouse, acolytes on the dark side who had matured under the law of the jungle were obviously more powerful in battle. With their superior fighting instincts and their manipulation of timing when attacking, they were far more capable than their light acolyte peers.\u003c/p\u003e\n\u003cp\u003eMost of the acolytes in the area, especially those who were leaving, might be carrying some precious resources from the Eternal River Plains’ secret plane. If bandits ran into any of these acolytes, it would be enough for them to make a fortune!\u003c/p\u003e\n\u003cp\u003eThere were several dark magician acolytes that had these thoughts.\u003c/p\u003e\n\u003cp\u003eHence, the way to the Eternal River Plains’ secret plane was full of danger.\u003c/p\u003e\n\u003cp\u003eMany acolytes who were dreaming of panning for gold usually died before reaching the secret plane.\u003c/p\u003e\n\u003cp\u003eLeylin thought back to how he had not run into any big bandit groups during his journey.\u003c/p\u003e\n\u003cp\u003eOccasionally, he had encountered a few inexperienced local thieves that had been dealt with by Number 2 and Number 3.\u003c/p\u003e\n\u003cp\u003eThese two men had already advanced after receiving the incomplete runes of Branded Swordsmen and all ordinary men or acolytes were easily dealt with with a few sword attacks.\u003c/p\u003e\n\u003cp\u003e“So that\u0027s what\u0027s happening. It seems that I\u0027ve been rather lucky.” Leylin massaged his temples and laughed.\u003c/p\u003e\n\u003cp\u003e“I can’t help saying this, but man, your luck is too good! However, this has just been the outlying areas. As we continue to travel further into the Eternal River Plains, there will be more of these kinds of bandits. As the light Magi will focus all their energy on the secret plane, some entrances might have a generous amount of warnings placed, but other regions will just be disregarded...”\u003c/p\u003e\n\u003cp\u003eGeorge had a good grasp of Leylin\u0027s character and knew that this friend of his was not what he seemed to be on the surface. He was sure to have some trump cards.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t wrong either, since Leylin knew how to adapt to circumstances and act accordingly.\u003c/p\u003e\n\u003cp\u003eThe stronger Leylin was, the more secure his band of comrades would be. If he continued asking further, it would only result in Leylin being pressured to leave, which did not work well for their situation.\u003c/p\u003e\n\u003cp\u003eIt was but a mere assumption, but since Leylin could advance to a level 3 acolyte so quickly and receive solo missions, that meant he definitely had a great trump card. Poor George didn’t even consider the possibility that Leylin had already advanced to an official Magus.\u003c/p\u003e\n\u003cp\u003eAfter all, there was a wide chasm between a level 3 acolyte and the realm of official Magi.\u003c/p\u003e\n\u003cp\u003eEven if it was the most amazing genius, promoting to the Magus realm before 30 years of age was in itself a most outstanding speed of advancement.\u003c/p\u003e\n\u003cp\u003eGeorge, who knew that Leylin only had a third-grade aptitude, did not bother considering that all.\u003c/p\u003e\n\u003cp\u003e“Good! Now that you\u0027re a member of our group, let’s enjoy a toast.” George, as always, was very welcoming and put an arm around Leylin’s shoulder, patting Leylin\u0027s chest with his other arm.\u003c/p\u003e\n\u003cp\u003e“At least we\u0027re not lacking good wine nor beautiful women. Do you see that red-clothed beauty beside the bar counter? She\u0027s making bedroom eyes at you. If you just go up and speak to her, I bet she\u0027ll she\u0027ll be yours tonight! And then... heh!\"\u003c/p\u003e\n\u003cp\u003eGeorge hadn’t said much and had already reverted to his lecherous nature. Beside him, Shiera’s face changed and the next moment, George let out a sharp scream and begged for forgiveness.\u003c/p\u003e\n\u003cp\u003e“Haha...”\u003c/p\u003e\n\u003cp\u003eSeeing this, the acolytes from the Wetland Gardens Academy and Leylin were unable to keep a straight face.\u003c/p\u003e\n\u003cp\u003eLeylin obviously did not hit on anyone in the end, since George had been joking around to liven up the atmosphere.\u003c/p\u003e\n\u003cp\u003eThe result of this drinking session was surprisingly good. At least, after seeing Leylin produce the insignia of Four Seasons Garden, the relations between Leylin, Alexander and the rest of the acolytes all turned for the better.\u003c/p\u003e\n\u003cp\u003eBessita appeared to be very happy to welcome Leylin as their new comrade.\u003c/p\u003e\n\u003cp\u003eThe group rested in the small town for a while, before setting off early in the morning and resuming their journey.\u003c/p\u003e\n\u003cp\u003eThe missions assigned by Ennea Ivory Ring Tower and Wetland Gardens Academy all had time limits. George and the others had to report to a designated area within a stipulated time. If not, they would be labeled as criminals and be on their school’s wanted list.\u003c/p\u003e\n\u003cp\u003eThey were mere acolytes! If something like this were to happen, they would be finished for the rest of their lives!\u003c/p\u003e\n\u003cp\u003eHence, after receiving the mission, they could only obey the arrangements of the organisation no matter how unwilling they were. There was little choice but to enter the Eternal River Plains’ secret plane and accept the unknown fate their future held.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-196\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-198\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-197","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
