{"id":58576,"no":20,"title":"Chapter 20","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eSelection Of Mentors\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“The Abyssal Bone Forest Academy has a satirical sense of humour, huh; they actually have their academy under a graveyard!”\u003c/p\u003e\n\u003cp\u003eLeylin shook his head, but he felt rather comfortable, the pores on his body were all open and absorbed the air of the surroundings here.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip! What is the situation now?”\u003c/p\u003e\n\u003cp\u003e[Beep! Task Establishing! Acquiring sample of the environment, analysis in progress!]\u003c/p\u003e\n\u003cp\u003e[There is a significant increase in a type of energy particle here which faintly resonates with the Host’s consciousness. They are conjectured to be Shadow and Dark energy particles!] The A.I. Chip’s voice travelled over.\u003c/p\u003e\n\u003cp\u003e“No wonder! There is an increase in the energy particles here, which obviously benefits Shadow and Dark element Magi. It is like the novels from my previous world, where one must occupy an area that is filled with spirit energy when they practice the cultivation techniques of immortals!”\u003c/p\u003e\n\u003cp\u003eLeylin gained a slight understanding of the academy’s choices.\u003c/p\u003e\n\u003cp\u003e“Password!”\u003c/p\u003e\n\u003cp\u003eAt this moment, Dorotte had already brought the group to the centermost area in the graveyard, where there was a huge grave. Black marble stones were piled up one by one, making it resemble a huge black castle.\u003c/p\u003e\n\u003cp\u003eBeside the marbled door, there were two stone statues.\u003c/p\u003e\n\u003cp\u003eOn the left, there was a two-headed dog with spikes growing on its body.\u003c/p\u003e\n\u003cp\u003eOn the right, there was an earthworm with a pair of wings and razor sharp fangs protruding out, exuding a cruel aura.\u003c/p\u003e\n\u003cp\u003eThese two statues were lifelike. They had black jewels for eyes and looked as if they were alive.\u003c/p\u003e\n\u003cp\u003eWhen Dorotte walked in front of the statues, the earthworm on the left side spoke in a parched voice. With each opening and closing of the mouth, dust from the stone continuously fell down onto the floor.\u003c/p\u003e\n\u003cp\u003e“Enough! Jumal, don’t you recognise me?”\u003c/p\u003e\n\u003cp\u003eDorotte had a look of annoyance on his face.\u003c/p\u003e\n\u003cp\u003eRight after Dorotte spoke; the earthworm and huge dog both guffawed. Their voices brought about a huge wind, which flipped the robes of the acolytes behind.\u003c/p\u003e\n\u003cp\u003e“Dorotte! Although we are pretty familiar with each other, rules are rules!”\u003c/p\u003e\n\u003cp\u003eBoth of the statues seemed to have come alive. The huge dog licked its paws, and let out a female voice.\u003c/p\u003e\n\u003cp\u003e“Or, would you like to play with us?” The earthworm lifted its claw and made a human-like gesture, beckoning with the claw, “Then come! I feel itchy all over my body!”\u003c/p\u003e\n\u003cp\u003e“Alright! Alright! Let me think!” Dorotte rolled his eyes.\u003c/p\u003e\n\u003cp\u003e“Oh! Damnit! I should really take the head of the pig who set up this defensive spell formation and shove it up their ass!”\u003c/p\u003e\n\u003cp\u003eDorotte suddenly bellowed.\u003c/p\u003e\n\u003cp\u003e“Hurry and say it! What is the password?” The huge dog roared and there were sparks coming out from its mouth.\u003c/p\u003e\n\u003cp\u003e“The secret password is - I hate smelly bones!” Dorotte spoke softly.\u003c/p\u003e\n\u003cp\u003eLeylin’s mouth twisted, and only by using a strong willpower did he manage to suppress his laughter. Although Dorotte wore a skull, Leylin was extremely certain that he was currently sulking.\u003c/p\u003e\n\u003cp\u003e“Haha! The password is correct!” The earthworm and huge dog laughed loudly and let them pass.\u003c/p\u003e\n\u003cp\u003e“I bet the overseer keeping watch with the crystal ball is laughing to death right now!” The huge dog snickered, then returned to his original stone platform and changed into its former statue state.\u003c/p\u003e\n\u003cp\u003e“Puchi!” An acolyte finally found it hard to bear and let out a noise.\u003c/p\u003e\n\u003cp\u003e“Hng!” Green flames suddenly ignited within Dorotte’s sockets, “It seems like we must educate the new acolytes on how to respect their professors!”\u003c/p\u003e\n\u003cp\u003e*Pa!* Dorotte snapped his fingers.\u003c/p\u003e\n\u003cp\u003e“Ah! What is this, don\u0027t come over here, don\u0027t come over!” The acolyte who laughed out loud earlier retreated several steps and fell onto the floor, wailing loudly.\u003c/p\u003e\n\u003cp\u003e“Rousey! What is it!” An acolyte beside him walked forward.\u003c/p\u003e\n\u003cp\u003e“No…...Don’t come over!” Rousey screamed, and his face gradually twisted.\u003c/p\u003e\n\u003cp\u003eSeeing this scene, the nearby acolytes all felt a chill down their spines.\u003c/p\u003e\n\u003cp\u003e“Magi are equal among themselves, so they can afford to play jokes on each other. However, acolytes must always maintain their humility!”\u003c/p\u003e\n\u003cp\u003eSuddenly, Leylin understood the code of conduct in the Magi world. Only with equal strength, one will have the status to speak to another.\u003c/p\u003e\n\u003cp\u003eJayden and Kaliweir also seemed to be deep in thought.\u003c/p\u003e\n\u003cp\u003e“Carry him up and let us go in!” Dorotte pointed at Rousey, who was still screaming.\u003c/p\u003e\n\u003cp\u003eBoth of his servants walked over and carried Rousey, one on each side.\u003c/p\u003e\n\u003cp\u003e“Both of them are at least Grand Knights!” Seeing how the two servants subdued Rousey so easily, Leylin’s eyes flashed.\u003c/p\u003e\n\u003cp\u003eAfter opening to door to the grave, they all appeared in front of a stone staircase that spiralled downwards.\u003c/p\u003e\n\u003cp\u003eThe flight of stairs was spiralled and descended all the way into the depths of the darkness until they could not be seen anymore.\u003c/p\u003e\n\u003cp\u003eDorotte used his staff and knocked on the floor. *Dong Dong!*\u003c/p\u003e\n\u003cp\u003eBlue flames started to light up one by one, illuminating the ground within.\u003c/p\u003e\n\u003cp\u003e“Apart from the colour, it’s similar to an ancient castle from the medieval times!” Leylin exclaimed, and tread down the stairs of the Abyssal Bone Forest Academy.\u003c/p\u003e\n\u003cp\u003eLeylin did not know how long exactly he walked for under the illumination of the blue flames, but it was definitely over 20 minutes.\u003c/p\u003e\n\u003cp\u003e“So huge! The area of this underground building is so much larger than the area of the graveyard on top, and it is not even by several times. It almost resembles an underground kingdom already.”\u003c/p\u003e\n\u003cp\u003eLeylin calculated in silence.\u003c/p\u003e\n\u003cp\u003e“Our Abyssal Bone Forest Academy was constructed in the Gregorian Year 324, and it has been almost one thousand years since then…… As for our academy founder, it is Merlin Falek Driwilc……”\u003c/p\u003e\n\u003cp\u003eDorotte led at the forefront, and occasionally gave them a few sentences of explanation.\u003c/p\u003e\n\u003cp\u003e“The door which you all had entered from earlier is the main door! And besides that, there are still many exits inside the academy. As long as you have become a proper Magus, you can apply and chose an uninhabited, empty grave for your own personal passage!”\u003c/p\u003e\n\u003cp\u003eDorotte explained.\u003c/p\u003e\n\u003cp\u003eBut Leylin’s lip never stopped twitching, “The purpose for us to advance as a Magus is so we can obtain a grave? How delightful!”\u003c/p\u003e\n\u003cp\u003eHowever, ever since the unlucky guy was used as an example earlier, Leylin only dared to rant in his heart and didn’t say it aloud.\u003c/p\u003e\n\u003cp\u003e\"Our Abyssal Bone Forest Academy is divided into several large areas: the dormitories, classrooms, laboratories, gardening areas, trading post, mission area and such. As for their exact locations, someone will bring you for an induction later. For now, all of you must follow me to register at the administration area, and then we’ll commence the selection of your professors!”\u003c/p\u003e\n\u003cp\u003eDorotte came to the front of a slightly larger room, and pointed at the words on the steel door, “This is the administration area, however, I believe none of you will be willing to come here again in the future!”\u003c/p\u003e\n\u003cp\u003eSeeing the symbols on the door which seemed like both words and patterns at times, Leylin finally acknowledged that none of the characters were anything like what the brat[1. The brat refers to the previous host of Leylin’s body.] had encountered in the past.\u003c/p\u003e\n\u003cp\u003e“Oh! I’ve forgotten that you guys don\u0027t know the ancient Byron language!” Dorotte tapped his head, “No worries! This is one of the basics of incantation, you guys will learn it in the future!”\u003c/p\u003e\n\u003cp\u003e“Dorotte, huh? Enter!” An aged voice sounded from within, and the steel doors moved automatically. A steel hand opened the bolts on the door and even beckoned them in.\u003c/p\u003e\n\u003cp\u003eLeylin followed Dorotte inside and realised that this room was extremely large. An old man with white beard and red eyebrows was seated at the wide, black office desk. He was scribbling something with a feather pen, and beside him was a stack of parchment.\u003c/p\u003e\n\u003cp\u003eBehind him, there were countless bookshelves of over ten metres tall, and parchment and even crystal balls were disorderly arranged on them. It looked just like a library.\u003c/p\u003e\n\u003cp\u003e“You’re late!” The old man put down the quill pen in his hand, and his wrinkled face smiled gently.\u003c/p\u003e\n\u003cp\u003e“We met with some trouble along the way, a wandering giant storm sprite, so the dirigible was a little damaged, and hence the delay in time!” Dorotte explained.\u003c/p\u003e\n\u003cp\u003eThe old man said, “That\u0027s really unfortunate!”\u003c/p\u003e\n\u003cp\u003eAnd then he looked at the acolytes at the back and his bright eyes shone brilliantly. He scanned through the acolytes, before finally landing on Jayden.\u003c/p\u003e\n\u003cp\u003e“It seems like you are well rewarded this trip!”\u003c/p\u003e\n\u003cp\u003e“Of course!” Dorotte pointed, “Jayden, come over here!”\u003c/p\u003e\n\u003cp\u003ePulling Jayden to his side, “I have made a contract with him already! He is now my personal apprentice! Hurry! Settle the procedures for him!”\u003c/p\u003e\n\u003cp\u003eDorotte took a stack of forms from a heavy black pouch and handed it over to the old man.\u003c/p\u003e\n\u003cp\u003e“Mn! Fifth-grade acolyte, not too bad!” The old man took out an object resembling a pair of glasses with gold threads around its rim and hung it on his nose.\u003c/p\u003e\n\u003cp\u003e“Definitely! Melda, that scum, he actually pushed such a troublesome thing to me, haha! Now I want to see him angry!” Dorotte gloated loudly.\u003c/p\u003e\n\u003cp\u003e“So then! Jayden! Are you willing to become the personal apprentice of Dorotte?” The old man asked.\u003c/p\u003e\n\u003cp\u003e“I accept!” Jayden looked at Dorotte and agreed in a low voice.\u003c/p\u003e\n\u003cp\u003e“Good!” The old man took a sheet of parchment and wrote something on it, then handed Jayden a black sack too, “This is yours, hold it well!”\u003c/p\u003e\n\u003cp\u003e“Are the procedures done? I have taught him those meditation techniques, and right now I have to rush back to my experiments! It was difficult enough to find some inspiration along the way, but I did not have any ingredients on hand, do you know how much I was suffering?”\u003c/p\u003e\n\u003cp\u003eDorotte let out a shrill voice and pulled Jayden along, leaving the room quickly.\u003c/p\u003e\n\u003cp\u003e“Alright! Mister Dorotte’s task is completed. What\u0027s next are the things that you guys should be mindful of!” The old man knocked on the desk and drew the attention of the acolytes back to him, and then said in a satisfied manner.\u003c/p\u003e\n\u003cp\u003e“Since all of you have already handed in the fees and achieved the criteria for the contract, you are all acolytes of our Abyssal Bone Forest Academy now. Right now, all of you will begin with the selection of your professors!”\u003c/p\u003e\n\u003cp\u003e“There are two methods to choose a professor. The first is to chose by placing your name inside the crystal ball and my treasure will pick a professor for you! This method is absolutely free of charge.”\u003c/p\u003e\n\u003cp\u003e“Excuse me? What is your treasure?” An acolyte asked cowardly.\u003c/p\u003e\n\u003cp\u003e“Oh?” The old man laughed, and suddenly a black python appeared on the table, “This is my magical pet! Spotty! It does not recognise any of you, so I think it’s the fairest for it to choose! Any other questions?”\u003c/p\u003e\n\u003cp\u003e“No…...No more!” Seeing the large python, the acolyte quickly retreated backwards.\u003c/p\u003e\n\u003cp\u003e“There is also another method, which is for the acolytes to choose their own professors. Here with me is a list containing short introductions of various professors and their requirements, all for your choosing. Of course, if you choose this method, you will need a magic crystal as payment!”\u003c/p\u003e\n\u003cp\u003e“It doesn\u0027t matter which method you chose, but once you have decided on your professor, you can never change again!”\u003c/p\u003e\n\u003cp\u003eThe old man said, “Next up, I will call your names, and you will come forward and tell me your choice!”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-19\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-21\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-20","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
