{"id":58759,"no":203,"title":"Chapter 203","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eCurse\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e*Boom!*\u003c/p\u003e\n\u003cp\u003eA green hurricane rapidly advanced towards Jenna and formed a green shield that protected her.\u003c/p\u003e\n\u003cp\u003eLeylin’s flaming right hand collided with the shield, producing a tremendous noise.\u003c/p\u003e\n\u003cp\u003e“Uncle- Uncle Manla!” She produced a wide smile.\u003c/p\u003e\n\u003cp\u003eAlong with the loud noise of the wind, a burly, blonde man appeared in front of Leylin.\u003c/p\u003e\n\u003cp\u003e“Manla?” Leylin recognised this Magus, who had he had previously met once before.\u003c/p\u003e\n\u003cp\u003e“After receiving your transmission, I rushed over. Thank goodness I made it in time!” Manla stood in front of Jenna, glaring menacingly at Leylin.\u003c/p\u003e\n\u003cp\u003e“You actually dared to harm my niece to this extent! My family will definitely not…”\u003c/p\u003e\n\u003cp\u003e*Rumble!*\u003c/p\u003e\n\u003cp\u003eBefore Manla could even finish his sentence, Leylin wasted no time and sent out numerous black fireballs towards him.\u003c/p\u003e\n\u003cp\u003eFrom Leylin’s perspective, since they were already enemies, it was natural for him to eradicate them all. Who would bother with listening to what they had to say?\u003c/p\u003e\n\u003cp\u003e“Be careful, Uncle Manla! He’s very strong and his elemental essence conversion has surpassed 50%!”\u003c/p\u003e\n\u003cp\u003eWhile Jenna was yelling out warnings, Leylin was already manipulating latent fireballs to attack Manla’s green hurricane.\u003c/p\u003e\n\u003cp\u003eUnder the attack of the fireballs, which had a might of 51 degrees, Manla was basically forced to retreat step by step.\u003c/p\u003e\n\u003cp\u003e“So powerful!” An expression of shock appeared on Manla’s face.\u003c/p\u003e\n\u003cp\u003eShortly after, like a ghost, Leylin suddenly appeared in front of him, a clawed hand encased in crimson flames grabbing towards his face.\u003c/p\u003e\n\u003cp\u003e*Pop!*\u003c/p\u003e\n\u003cp\u003eThe sounds of bubbles being burst echoed and the defensive spell on the surface of Manla’s body was easily destroyed in the face of Leylin’s Crimson Palm. It was taken care of so easily, like paper being ripped apart.\u003c/p\u003e\n\u003cp\u003eLeylin’s palm didn’t stop moving and grabbed ahold of the burly man’s chest.\u003c/p\u003e\n\u003cp\u003e*Slash!* A bloody piece of flesh was ripped out by the dragging of the claw, and the surrounding skin was left slightly charred.\u003c/p\u003e\n\u003cp\u003e“This won’t do! The difference in power is too much. If we stay here, we’ll definitely die!”\u003c/p\u003e\n\u003cp\u003eManla immediately pulled Jenna up, turned, and ran!\u003c/p\u003e\n\u003cp\u003eRationally speaking, Manla was a semi-converted Magus whose elemental essence conversion was at least 50%. In the Magus community on the south coast, he would be considered the cream of the crop. However, he had the misfortune of meeting an evildoer like Leylin, who was much too powerful even when his spiritual force and elemental essence conversion were being suppressed. In terms of hand to hand combat, Manla couldn’t win either.\u003c/p\u003e\n\u003cp\u003e“Tiwoose Fererian!”\u003c/p\u003e\n\u003cp\u003eThe moment they started to escape, Manla threw out a silver magic scroll.\u003c/p\u003e\n\u003cp\u003eNine green tornados formed, and like a wall, they hindered Leylin from giving chase.\u003c/p\u003e\n\u003cp\u003e“You’re thinking of running?”\u003c/p\u003e\n\u003cp\u003eDarkness flashed in Leylin’s eyes, and after muttering a few incantations, he pointed forward with his right hand.\u003c/p\u003e\n\u003cp\u003eBlack fog immediately converged to become a black python, which headed for the two of them.\u003c/p\u003e\n\u003cp\u003eThis snake was like an illusion, passing through the green tornados. When it arrived in front of Manla, its crimson eyes were fixed on Jenna, and it bit towards her.\u003c/p\u003e\n\u003cp\u003e“What the hell is this?”\u003c/p\u003e\n\u003cp\u003eManla produced another tornado.\u003c/p\u003e\n\u003cp\u003e*Hua la!* The black snake ducked and passed through without trouble, and then opened its mouth, viciously biting Jenna’s neck!\u003c/p\u003e\n\u003cp\u003eTwo black pinholes instantly emerged on Jena’s fair neck. They transformed to form a strange, twisted rune.\u003c/p\u003e\n\u003cp\u003e“Jenna?”\u003c/p\u003e\n\u003cp\u003eThere was a white light surrounding Manla’s hand as he tried to brush the snake away.\u003c/p\u003e\n\u003cp\u003eHowever, with a swipe of the python’s tail, it shifted and bit Manla’s arm. The same rune was branded there as well.\u003c/p\u003e\n\u003cp\u003eAfter these two attacks, the snake hissed and turned back into the black fog, which entered Manla and Jenna’s bodies.\u003c/p\u003e\n\u003cp\u003e“This seems to be a curse! It’s going to be troublesome!”\u003c/p\u003e\n\u003cp\u003eManla’s face fell. He couldn’t feel anything different from the formation of the curse, but instincts told him that it was going to be inconvenient.\u003c/p\u003e\n\u003cp\u003e“Jenna, hold on!” Manla yelled crazily, the green hurricanes still spreading. His entire body seemed to turn into a gale, and disappeared into the forest.\u003c/p\u003e\n\u003cp\u003eSeeing Manla escape in that direction, Leylin did not move.\u003c/p\u003e\n\u003cp\u003eHis body seemed to have shattered like porcelain, with large volumes of blood suddenly gushing out.\u003c/p\u003e\n\u003cp\u003e“It seems like I can’t endure it any longer, the injuries are too severe.” Leylin was half kneeling on the floor. He suddenly became dizzy, and his vision began to blur.\u003c/p\u003e\n\u003cp\u003eIf possible, he obviously wanted to give chase and kill the two off. However, with his current physical condition, it was impossible for him to continue battling.\u003c/p\u003e\n\u003cp\u003e“However, the curse that I put up at the end… Hehe... cough, cough.”\u003c/p\u003e\n\u003cp\u003eLeylin laughed evilly but started to cough violently, spitting out large globs of black blood.\u003c/p\u003e\n\u003cp\u003e“Light elemental Magi will always be the archenemies of dark elemental Magi. Just a cage made of elemental particles was enough to reduce me to this state…”\u003c/p\u003e\n\u003cp\u003eLeylin laughed bitterly and his figure quickly turned into black smoke, disappearing into the forest.\u003c/p\u003e\n\u003cp\u003eCurrently, he was in urgent need of a place to treat his injuries.\u003c/p\u003e\n\u003cp\u003eAlthough he’d told George and the acolytes to wait for him, Leylin couldn’t even take care of himself, much less the others, so that matter was naturally thrown to the back of his mind.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter ten or so hours, in a temporarily set up tent.\u003c/p\u003e\n\u003cp\u003eIn the twilight, an oil lamp illuminated the area a dull yellow. Hay was spread across the floor, and Leylin sat atop of it. In his right hand was a test tube with a potion within, which he was constantly tilting towards the injuries on his left hand.\u003c/p\u003e\n\u003cp\u003eThis test tube was rather large, and in the translucent liquid, one could see something that looked like a baby’s face. It was encased in the liquid, and continuously let off little bubbles.\u003c/p\u003e\n\u003cp\u003e*Tssssss!*\u003c/p\u003e\n\u003cp\u003eAfter the potion was dripped into the wounds, large amounts of white gas were emitted, along with the sounds of corrosion.\u003c/p\u003e\n\u003cp\u003e“Ugh!” An intense pain struck Leylin’s nerves; he seemed to have been struck by lightning, his muscles involuntarily twitching.\u003c/p\u003e\n\u003cp\u003eLeylin bit down hard, and large droplets of cold sweat dripped from his forehead.\u003c/p\u003e\n\u003cp\u003eAfter that intense wave of pain, his wounds started to get numb.\u003c/p\u003e\n\u003cp\u003eThis numbing effect was very strong, feeling like tens of thousands of ants had crawled and gnawed on his bones. Leylin’s pale face reddened as he sucked in sharply.\u003c/p\u003e\n\u003cp\u003eAt the same time, in the areas where Leylin’s left arm was injured, various veins and muscles squirmed and began to regenerate.\u003c/p\u003e\n\u003cp\u003eFirst, the fractures in the bone were completely healed, and the flesh and veins followed soon after. After a few minutes, Leylin tested out his left arm.\u003c/p\u003e\n\u003cp\u003eAt this point, the injuries on his left arm had been completely healed. Leylin’s arm was slender and fair, but under that beautiful appearance, there were muscles that held much explosive power.\u003c/p\u003e\n\u003cp\u003eIt was impossible to tell that this arm had been on the verge of breaking off just minutes prior.\u003c/p\u003e\n\u003cp\u003eLeylin tested out his left arm again with some actions and smiled in satisfaction.\u003c/p\u003e\n\u003cp\u003e“I’m lucky there was some liquid left over from the Flourishing Flower! If not, the injuries on this arm wouldn’t have been able to be taken care of so easily.”\u003c/p\u003e\n\u003cp\u003eThe Flourishing Flower was an important ingredient used by Magi in operations to regenerate limbs.\u003c/p\u003e\n\u003cp\u003eNo matter what kind of injury it was, as long as there were enough Flourishing Flowers, it would be very likely that one could recover.\u003c/p\u003e\n\u003cp\u003eThe Flourishing Flower that Leylin was holding was something he had gained during his days as an acolyte. He had exchanged some of them in the Abyssal Bone Forest Academy for incomplete information about the Branded Swordsman.\u003c/p\u003e\n\u003cp\u003eExcluding the injuries on his arm, Leylin had also used several potions to treat his wounds. He was now able to move freely and fight in less vigorous battles.\u003c/p\u003e\n\u003cp\u003e“I’ve mostly recovered. I guess it’s time for me to go to the Marat Canyon!”\u003c/p\u003e\n\u003cp\u003eLeylin was a fairly cautious person. In the secret plane at the Eternal River Plains, it was dangerous beyond belief, to the point that even Magi were considered fodder! As a spy from the Thousand Meddling Hands, if he were ever to be discovered, he would be chased to the ends of the world!\u003c/p\u003e\n\u003cp\u003eIn this situation, if he were to sustain any injuries, Leylin knew that there was little chance of him surviving, much less being lucky enough to reap benefits.\u003c/p\u003e\n\u003cp\u003eLeylin had already considered leaving and going somewhere else if his injuries couldn’t be treated.\u003c/p\u003e\n\u003cp\u003eAfter all, he still valued his own life over making profits.\u003c/p\u003e\n\u003cp\u003eHowever, the situation was not so dire. Though he had made enemies with a possibly high ranking Magus family with the abilities of divination, he didn’t think much of it.\u003c/p\u003e\n\u003cp\u003e“I believe they aren’t feeling very well right about now, yes? My curse won\u0027t be taken apart very easily.”\u003c/p\u003e\n\u003cp\u003eLeylin smirked icily.\u003c/p\u003e\n\u003cp\u003eThough he had not been able to kill his opponents, he had successfully cursed Jenna and Manla with a spell that was unique to him.\u003c/p\u003e\n\u003cp\u003eThe formation of this curse originated from a curse in the great Magus Serholm’s Book of Giant Serpent. Leylin had started the foundations of that curse and had made the appropriate changes to it.\u003c/p\u003e\n\u003cp\u003eAfter adding in every method he could think of, the curse was so different from the original that even the great Magus Serholm would be unable to undo it.\u003c/p\u003e\n\u003cp\u003eLike a password, it was complicated and difficult to make sense of.\u003c/p\u003e\n\u003cp\u003eIf one were not the original maker of the password, and instead tried to use brute force to get through, the object protected by the password would be destroyed.\u003c/p\u003e\n\u003cp\u003eJenna and Manla seemed to have high standings within their family, and most likely wouldn’t be given up on so easily.\u003c/p\u003e\n\u003cp\u003eLeylin’s next task was to use the power of the curse to find out who his enemies were.\u003c/p\u003e\n\u003cp\u003eAs he had been followed and almost killed on the basis of some useless prediction, Leylin was quite annoyed.\u003c/p\u003e\n\u003cp\u003eHowever, there was still a family backing them, and he did not want to shed all sense of cordiality without making sense of the situation before him.\u003c/p\u003e\n\u003cp\u003eThis was why Leylin had chosen not to chase them and had instead placed a mark on both of them.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-202\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-204\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-203","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
