{"id":58775,"no":219,"title":"Chapter 219","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eTotal Captivity\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAs he watched the enemy Magus in charge of defense, Leylin raised his right hand and tapped.\u003c/p\u003e\n\u003cp\u003e*Weng!*\u003c/p\u003e\n\u003cp\u003eCountless black figures emerged from the shadows, overlapping with each other as they continuously multiplied. With the accumulation of the shadows, a small light appeared in front of his finger that formed a small-scale vortex that seemed to be able to suck one’s spirit in.\u003c/p\u003e\n\u003cp\u003eIn front of Leylin, a layer of greenish-gray iron covering instantly appeared on that Magus’ skin.\u003c/p\u003e\n\u003cp\u003eThis was ‘Iron Skin’, an innate earth element solidification spell that rank 1 Magi liked to use.\u003c/p\u003e\n\u003cp\u003e*Ripple!*\u003c/p\u003e\n\u003cp\u003eLeylin’s finger seemed to be moving extremely slowly, though in actuality it was approaching very quickly. As he tapped the Magus’ Iron Skin, the sound of rippling water could be heard.\u003c/p\u003e\n\u003cp\u003eIn front of Leylin’s finger, the Magus’ Iron Skin peeled off bit by bit like snakeskin. A look of incredulity appeared on the Magus’ face, and after having been quickly tapped on the forehead by Leylin, his eyes rolled back and he fainted.\u003c/p\u003e\n\u003cp\u003e“Laura?!” The team leader was furious.\u003c/p\u003e\n\u003cp\u003eShortly afterwards, a scroll appeared in his hands and Blake, who was to one side of the leader, produced a small shield the size of a palm.\u003c/p\u003e\n\u003cp\u003eImmense energy waves were emitted from these two items, indicating that they were ready to be activated at any moment.\u003c/p\u003e\n\u003cp\u003e“You two can attack me together!”\u003c/p\u003e\n\u003cp\u003eFacing this sight, Leylin simply smiled and clawed with both hands.\u003c/p\u003e\n\u003cp\u003e*Tssss!*\u003c/p\u003e\n\u003cp\u003eBlack streams of air were emitted from his fingers, and each of the ten black streams was like little snakes as they surrounded these two Magi.\u003c/p\u003e\n\u003cp\u003eWhere the two Magi had previously stood, two black cocoons could now be seen. From these cocoons, the occasional snake-like hisses could be heard.\u003c/p\u003e\n\u003cp\u003eSeconds later, the black mist dissipated, leaving behind two Magi that had fainted on the floor.\u003c/p\u003e\n\u003cp\u003eThere was a layer of vague imprints that were like black snakes wandering back and forth across their faces.\u003c/p\u003e\n\u003cp\u003e*Pak!*\u003c/p\u003e\n\u003cp\u003eAfter taking care of these three Magi, Leylin willed the shadow vines obstructing the sky to withdraw back into his shadow.\u003c/p\u003e\n\u003cp\u003e“I feel it now! With the constant stimulation from my bloodline, my control over the darkness is becoming increasingly stronger!”\u003c/p\u003e\n\u003cp\u003eThe darkness in Leylin’s pupils became deeper, and he appeared to be intoxicated while deep in thought as he mumbled to himself.\u003c/p\u003e\n\u003cp\u003eAfter handling these three Magi prisoners, Leylin waited another few minutes.\u003c/p\u003e\n\u003cp\u003e*Zoom!*\u003c/p\u003e\n\u003cp\u003eTwo unidentifiable human figures were flying across the ground, dashing towards Leylin rapidly. Even Leylin was only able to see after-images.\u003c/p\u003e\n\u003cp\u003e*Thud!*\u003c/p\u003e\n\u003cp\u003eThe two black figures were carrying something on their shoulders and came to Leylin, throwing the things on their backs onto the floor.\u003c/p\u003e\n\u003cp\u003e“Master!” Number 2 and Number 3 knelt on one leg, greeting him.\u003c/p\u003e\n\u003cp\u003e“In accordance with your orders, we have caught all of them. None have escaped!”\u003c/p\u003e\n\u003cp\u003eThe two Magi that had escaped just now were currently lying on the ground.\u003c/p\u003e\n\u003cp\u003eSeveral injuries that were so deep that bone could be seen on the bodies of the Magi. They were extremely pale, which was a result of extreme blood loss. It was not difficult to imagine that these wounds were the result of a fierce battle.\u003c/p\u003e\n\u003cp\u003e“Good! You did well!” Leylin expressed his approval towards his subordinates.\u003c/p\u003e\n\u003cp\u003eThese two Magi were newly advanced, and thus the weakest amongst the Magi. Numbers 2 and 3 were able to defeat them because of the immense power of Branded Swordsmen, a subdivision of the ancient Magi.\u003c/p\u003e\n\u003cp\u003ePerhaps, this was the obvious result of the large consumption of potential and vitality from Number 2 and Number 3.\u003c/p\u003e\n\u003cp\u003eTo obtain power, Leylin had no choice but to speed things up and carry out many taboo methods on their bodies. This allowed them to break through their limits and become Branded Swordsmen in a short period of time.\u003c/p\u003e\n\u003cp\u003eBecause of this, their vitality was being consumed at a faster rate. Based on the A.I. Chip’s calculations, they only had two more months to live.\u003c/p\u003e\n\u003cp\u003e“Bring them along. Let’s go!” Leylin heaved a sigh of relief as he pointed at the five Abyssal Bone Forest Academy Magi lying on the ground.\u003c/p\u003e\n\u003cp\u003eHe still had many questions that could only be answered by these people.\u003c/p\u003e\n\u003cp\u003eIn addition, it was no simple task to obtain official Magi slaves and guinea pigs.\u003c/p\u003e\n\u003cp\u003eLeylin still had many ideas and conjectures regarding Branded Swordsmen, and he needed to test it on these Magi.\u003c/p\u003e\n\u003cp\u003eAfter all, in ancient times, Branded Swordsmen were a subdivision of the official Magi, not Knights!\u003c/p\u003e\n\u003cp\u003eHence, with Grand Knights as guinea pigs, Leylin still felt he was lacking something even with the help of the A.I. Chip. In the end, all he produced was Numbers 2 and 3, who were incomplete versions of the Branded Swordsman.\u003c/p\u003e\n\u003cp\u003eThis could be due to their lack of the tremendous spiritual force that Magi possessed, which resulted in Number 2 and 3’s difficulty in manipulating the elemental particles in the air. It was several times more difficult than predicted by the A.I. Chip.\u003c/p\u003e\n\u003cp\u003eLeylin considered some scenarios and then brought the five Magi to a secure hidden area. After interrogating them, he immediately began to verify his doubts regarding Branded Swordsmen.\u003c/p\u003e\n\u003cp\u003eLeylin only dared to be so unscrupulous because this was a time of war and he was doing this to those from the enemy camp.\u003c/p\u003e\n\u003cp\u003eIf not, using official Magi as guinea pigs would most certainly result in society’s displeasure, and he would receive negative repercussions.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eOn a high ground filled with white flowers.\u003c/p\u003e\n\u003cp\u003eIn the thick fog, a large castle that looked like an upside-down cone existed.\u003c/p\u003e\n\u003cp\u003eThis castle only had one point that was connected to the ground, and yet it was able to support the main body of the castle on top. Looking at it gave one the misconception that the world was upside down.\u003c/p\u003e\n\u003cp\u003eIt seemed like this castle was normally upright, but someone had turned it upside down.\u003c/p\u003e\n\u003cp\u003eIn the walkway paved with white marble, an old woman with a head of silver hair was carrying an oil lamp, ambling slowly.\u003c/p\u003e\n\u003cp\u003e*Ka-cha!* A metal door with blue electric currents sparking on the surface was pushed forward.\u003c/p\u003e\n\u003cp\u003e*Tssss!* Large amounts of icy white gas began to condense as they came into contact with the outside. It filled the walkway behind her with a layer of white frost.\u003c/p\u003e\n\u003cp\u003eThe old lady walked in the house, which was practically a world of ice and snow. It was below 0 degrees, and if one were a regular human, it would be impossible for them to stay here for more than a few seconds.\u003c/p\u003e\n\u003cp\u003eIn the heart of the house, tendrils of white vapour constantly emanated from two ice coffins.\u003c/p\u003e\n\u003cp\u003eThrough the translucent coffins, one could see a burly man in one, and a girl lying quietly in the other.\u003c/p\u003e\n\u003cp\u003eBoth of them had their eyes tightly shut, a look of pain and signs of struggle flashing across their faces occasionally. Each had a rune with a snake wriggling about on their neck and right hand.\u003c/p\u003e\n\u003cp\u003e“Sorry for the trouble, Doctor Hyder!”\u003c/p\u003e\n\u003cp\u003eThe old woman got out of the way, and a Magus with a head of silver hair came from behind her.\u003c/p\u003e\n\u003cp\u003eThis Magus looked to be very old, with wrinkle after wrinkle heaping on his face. However, his eyes were bright and he had a benevolent smile on his face.\u003c/p\u003e\n\u003cp\u003e“Curses are a very troublesome part of spells. They involve many strange and cruel things and Magi in the south coast who know this type of magic are scarce. I can’t guarantee anything other than that I’ll try my best.”\u003c/p\u003e\n\u003cp\u003eHyder, a Magus specializing in healing, did not immediately approach the patients, but first spoke to the old woman.\u003c/p\u003e\n\u003cp\u003e“You are an expert in this field. If you are unable to solve this problem, then I don’t even know who I should approach.”\u003c/p\u003e\n\u003cp\u003eShe gave a bitter laugh.\u003c/p\u003e\n\u003cp\u003e“Alright! I’ll give it my all!” Hyder nodded. Usually, he definitely would not take on such jobs. Not only were they dangerous, it was easy to offend the Magus who had produced the curse.\u003c/p\u003e\n\u003cp\u003eHowever, he was on good terms with this family and owed them a few favours. Hence, he had no choice but to come.\u003c/p\u003e\n\u003cp\u003eHyder went forward and looked the ice coffins up and down, and then nodded.\u003c/p\u003e\n\u003cp\u003e“When unable to treat a condition, freezing the victim is a very good method!”\u003c/p\u003e\n\u003cp\u003eHe shifted his focus past the layer of ice, and upon seeing the curse runes within, he gasped.\u003c/p\u003e\n\u003cp\u003eHyder’s expression immediately became serious, and a stifling atmosphere pervaded the air.\u003c/p\u003e\n\u003cp\u003eHe produced several bizarre items from his clothes, which seemed to be useful in testing the nature and effects of the curse.\u003c/p\u003e\n\u003cp\u003eThe old woman behind him stood behind him in bated breath, not daring to even speak a word.\u003c/p\u003e\n\u003cp\u003eA good while later, Hyder put down the stethoscope in his hands and rubbed off the cold sweat on his forehead.\u003c/p\u003e\n\u003cp\u003e“How is it?” She immediately inquired.\u003c/p\u003e\n\u003cp\u003e“It’s troublesome! No, it’s extremely troublesome!” Hyder looked abnormally solemn.\u003c/p\u003e\n\u003cp\u003e“From this rune I felt an ancient aura. It’s possible that this was a curse passed on from ancient times, and there are basically no other models of it to be found on the south coast. Furthermore, this technique is very complicated and without large amounts of experimentation, trying to treat it at this point will only result in the curse going berserk in the body. The end result is something none of us want to see…”\u003c/p\u003e\n\u003cp\u003eNow, after seeing how demanding and crafty this curse was, even Hyder regretted his decision. Was it worth it to repay a favour and, in turn, offend a terrifying dark Magus?\u003c/p\u003e\n\u003cp\u003e“An ancient curse… hss...” the old lady gasped.\u003c/p\u003e\n\u003cp\u003eAs a family with a long history, she naturally understood the difficulty in dealing with this curse.\u003c/p\u003e\n\u003cp\u003eForcefully breaking the curse would only result in death, unless the Magus who had set the curse decided to stop pursuing the matter.\u003c/p\u003e\n\u003cp\u003e“Are there no other methods?” With a hopeful glint in her eyes, she stared at Hyder.\u003c/p\u003e\n\u003cp\u003e“It would be best to make a trade with the Magus who set the curse. Other than that, I would need large amounts of guinea pigs and practical tests to find a way and break the curse.”\u003c/p\u003e\n\u003cp\u003eHyder slanted his head and thought for a moment, before speaking.\u003c/p\u003e\n\u003cp\u003e“Also, there is a time limit for the curse. Based on my test, there is at most one more month before it will completely erupt!” Hyder dropped another bomb on her.\u003c/p\u003e\n\u003cp\u003eUpon hearing this, the old lady trembled and then she breathed in deeply, a resolute look on her face.\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter what happens to Manla, but nothing can happen to Jenna! That is my final threshold!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-218\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-220\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-219","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
