{"id":58578,"no":22,"title":"Chapter 22","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eMeditation Technique\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“I am willing!” Leylin hurriedly answered.\u003c/p\u003e\n\u003cp\u003e“That’s good! Since these are the arrangements made by the school, I’ll accept you as my disciple!” The middle-aged man stroked his beard.\u003c/p\u003e\n\u003cp\u003e“Although the environment here is quite ordinary, it’s enough to let you undergo the initiation!” Kroft swept his eyes over the examination room. “At least it’s very quiet here and we won’t be disturbed!”\u003c/p\u003e\n\u003cp\u003e“What initiation?” Leylin had some doubts.\u003c/p\u003e\n\u003cp\u003e“The initiation of a Magus!” Kroft replied.\u003c/p\u003e\n\u003cp\u003e“Now tell me, Leylin, what is a Magus to you?”\u003c/p\u003e\n\u003cp\u003e“A mysterious person with the ability to call forth thunder and storms, manipulate flames and other forces of nature!” Leylin said the definition he knew of in Chernobyl Islands.\u003c/p\u003e\n\u003cp\u003e“En! However, it’s a little off!” Kroft commented.\u003c/p\u003e\n\u003cp\u003e“A Magus is actually the title we give to people with power in ancient times. These Magi all learn the principles and how to control and manipulate the energy within. They are never ending in their pursuit of knowledge and truth!”\u003c/p\u003e\n\u003cp\u003eKroft explained the definition of Magi to Leylin.\u003c/p\u003e\n\u003cp\u003e“So it is to say, the title of Magus is actually not limited to only humans!” Leylin had a better understanding now.\u003c/p\u003e\n\u003cp\u003e“Indeed! Other kinds of demi-humans, and even other intelligent beings have Magi existing among their kind, for example, a Magus of the sea tribes, or even a Dragon Magus!”\u003c/p\u003e\n\u003cp\u003eKroft said, “Alright! Now let us begin the rites! Don\u0027t be afraid, it’s very simple!”\u003c/p\u003e\n\u003cp\u003e*Clap!* The floor around Kroft softened, and transformed into a spell formation of sorts, and a strange energy came spreading from within.\u003c/p\u003e\n\u003cp\u003eThe surroundings turned dark, with only the flame lit in the centre of the formation.\u003c/p\u003e\n\u003cp\u003e“Right now, give your hand to me!” Leylin stretched his hand out and a larger palm firmly clasped it.\u003c/p\u003e\n\u003cp\u003e“Abiding by the rites of ancient times, I will now guide you, Leylin Farlier, onto the path of a Magus!”\u003c/p\u003e\n\u003cp\u003e“Recite after me!”\u003c/p\u003e\n\u003cp\u003e“I swear! I will forever be in pursuit of the truth!” Kroft used an unfamiliar language, but Leylin understood it completely, and his mouth could not help but produce the same sounds.\u003c/p\u003e\n\u003cp\u003e“I swear! I will forever be in pursuit of the truth!” As it was a voice of a thirteen or fourteen-year-old youth, there was still a little immaturity in the voice.\u003c/p\u003e\n\u003cp\u003e“Without the permission of my mentor, I swear that I will not reveal any of the information my mentor passes on to me……”\u003c/p\u003e\n\u003cp\u003eKroft continued to recite and Leylin followed suit, the two voices very soon eerily turned into one.\u003c/p\u003e\n\u003cp\u003eIn the hearts of the formation, the flame suddenly grew brighter and blazed strongly….\u003c/p\u003e\n\u003cp\u003e“Congratulations on formally becoming an acolyte!”\u003c/p\u003e\n\u003cp\u003eAfter the rites, Kroft congratulated Leylin.\u003c/p\u003e\n\u003cp\u003eLeylin looked down at both of his hands. After the mysterious rites, it seemed like he saw the world in a different light, yet at the same time, he couldn\u0027t pinpoint the difference.\u003c/p\u003e\n\u003cp\u003e[An anomaly has been discovered in the brainwaves of the Host!] The A.I. Chip’s voice sounded.\u003c/p\u003e\n\u003cp\u003e“It seems like there is a change in spiritual force, but I don\u0027t have any further information regarding this field, so I can only supplement it in the future!” Leylin said helplessly.\u003c/p\u003e\n\u003cp\u003e“The meditation technique in the crystal ball has already been given to you, right? Take a look at it when you go back, you can already absorb the information in it now!”\u003c/p\u003e\n\u003cp\u003e“Tomorrow, come here at six in the morning!”\u003c/p\u003e\n\u003cp\u003e“You can leave now, but remember! Don’t wander around!” Kroft warned.\u003c/p\u003e\n\u003cp\u003e“I’ll do as you bid! Mentor!” Leylin bowed, and then walked out of the experimental lab.\u003c/p\u003e\n\u003cp\u003e“Luckily I passed them earlier; otherwise, I wouldn\u0027t even know where the dormitories are located!” When he was following the shadow slave earlier, Leylin had already let the A.I. Chip start mapping the area. Now, there was a small part that was completed, and he knew the places that he had walked past before.\u003c/p\u003e\n\u003cp\u003eThe areas with Magi are rather dangerous, and Leylin did not wish to suffer from any collateral damage from them.\u003c/p\u003e\n\u003cp\u003eAfter reaching the dorms, Leylin took the key out from the sack issued by the old man.\u003c/p\u003e\n\u003cp\u003eIt was a heavy, black copper key, and it was labelled ‘783’. Right now, it was rather cold and vacant in the dorms. Leylin walked through the empty corridors, and his hair stood on end as he listened to the echo of his footsteps.\u003c/p\u003e\n\u003cp\u003eFollowing the room numbers, he found his room, “It’s here!”\u003c/p\u003e\n\u003cp\u003eLeylin placed the key into the keyhole, and the heavy metal produced a click.\u003c/p\u003e\n\u003cp\u003eAs the large door opened, the dark room automatically produced a flame, “They actually use the principles of Magi to invent a similar sound activation system?”\u003c/p\u003e\n\u003cp\u003eLeylin placed his belongings down and inspected the place in which he was going to live for some years.\u003c/p\u003e\n\u003cp\u003eThe dormitory was a little small and was divided into three partitions, a bedroom, living room and washroom. They were actually self-contained living quarters, and there was even a new blanket placed on the bed, it looked prim and proper.\u003c/p\u003e\n\u003cp\u003e“The environment isn\u0027t bad!” Leylin sat on the bed and took out the things that were given by the academy.\u003c/p\u003e\n\u003cp\u003e“A set of acolyte robes. The A.I. Chip has detected that there are several spells cast on it, and the defense is even comparable to some of the leather armour around great stuff!” Leylin efficiently changed into the robes and pinned the acolyte badge to his chest.\u003c/p\u003e\n\u003cp\u003eThis look was exactly the same as the grey-robed acolytes he had seen earlier today.\u003c/p\u003e\n\u003cp\u003eWhat Leylin did next was to pack his things, and do a cleaning of the room.\u003c/p\u003e\n\u003cp\u003eWhen he went out, the doors of the dorm beside him opened, and a brown haired acolyte walked out, “Hello! Are you a new acolyte? I am Bill!”\u003c/p\u003e\n\u003cp\u003e“Hello! I am Leylin, and I have just arrived today!” Leylin answered, and he just happened to have some questions, “Excuse me, how do I get to the dining hall?”\u003c/p\u003e\n\u003cp\u003eHearing Leylin’s voice, Bill’s expression appeared as if he had expected it, “Right now it’s pretty late, and I’m about to go there too. Let’s go together?”\u003c/p\u003e\n\u003cp\u003e“I couldn\u0027t ask for more!” Leylin smiled gently, and closed his door.\u003c/p\u003e\n\u003cp\u003e“The dining hall is on level 3, underground, and everything there is free. Of course, you can fork out money and let them make a dish that you want to eat!”\u003c/p\u003e\n\u003cp\u003eBill led the way as he explained.\u003c/p\u003e\n\u003cp\u003e“I am from the Poolfield Kingdom, and you?”\u003c/p\u003e\n\u003cp\u003e“Chernobyl Islands!”\u003c/p\u003e\n\u003cp\u003e“Heavens! So far! You have definitely suffered along the way, huh?” Bill was obviously a chatterbox, and Leylin managed to probe some information out from him.\u003c/p\u003e\n\u003cp\u003eBill was the same as him, a new acolyte, and only arrived five days earlier than Leylin did. As for the whole of Abyssal Bone Forest Academy, the professors numbered close to a hundred, while the acolytes numbered over a thousand.\u003c/p\u003e\n\u003cp\u003e“Oh right! Who is your mentor?” Bill asked.\u003c/p\u003e\n\u003cp\u003e“Kroft, an alchemy professor!” Leylin replied.\u003c/p\u003e\n\u003cp\u003e“Alchemy? You’re good!” Bill was seemingly startled.\u003c/p\u003e\n\u003cp\u003e“Is it difficult to learn alchemy?” Leylin was a little worried now.\u003c/p\u003e\n\u003cp\u003e“Not only is it difficult, the study of alchemy requires a huge amount of resources and ingredients. People who don\u0027t come from a good family background will rarely choose this! However, alchemists tend to make a lot of money after they have been certified!” Bill gave Leylin a regretful look.\u003c/p\u003e\n\u003cp\u003e“You must have been randomly assigned a mentor during the selection, and then duped by that python Spotty!”\u003c/p\u003e\n\u003cp\u003e“Oh really?” Leylin rubbed his nose.\u003c/p\u003e\n\u003cp\u003e“Alright! We’re here at the dining hall now, take whatever you want to eat!”\u003c/p\u003e\n\u003cp\u003eThe dining hall was extremely extravagant, and the food was more delicious than what he had on the dirigible. Everyone who sat here was also an acolyte, and there were no signs of a Magus.\u003c/p\u003e\n\u003cp\u003eAfter dinner, Leylin bid farewell to Bill and then returned to his room. He sat on his bed, with the crystal ball clasped in his hands.\u003c/p\u003e\n\u003cp\u003e“I can finally start practising as a Magus!”\u003c/p\u003e\n\u003cp\u003eLeylin stroked the crystal ball, his eyes gradually turned hazy, and his nostrils flared.\u003c/p\u003e\n\u003cp\u003e[A data interface has been discovered, start transmitting or not?] The A.I. Chip’s voice sounded.\u003c/p\u003e\n\u003cp\u003e“Begin!” At Leylin’s command, an acute pain entered his brain, as if someone filled it with lead.\u003c/p\u003e\n\u003cp\u003e“This is…... “ Leylin grabbed his head, and discovered that many images and words appeared in his brain along with the pain, and the first line was: “Elementary Meditation Technique!”\u003c/p\u003e\n\u003cp\u003eThis information appeared out of nowhere and was firmly imprinted in Leylin’s mind.\u003c/p\u003e\n\u003cp\u003eAfter some time, Leylin finally recovered from the pain, but he was still feeling groggy.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, defragment the data for the elementary meditation technique!”\u003c/p\u003e\n\u003cp\u003e[Beep! Task established, beginning defragmentation!]\u003c/p\u003e\n\u003cp\u003eA blue interface started to flicker in front of Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003e[Beep! The data has been defragmented. 21.3% of miscellaneous information has been removed, begin to transmit?”\u003c/p\u003e\n\u003cp\u003e“Transmit!” Leylin ordered.\u003c/p\u003e\n\u003cp\u003eWith the continuous transmission from the A.I. Chip, Leylin began to gain an understanding of the elementary meditation technique for acolytes.\u003c/p\u003e\n\u003cp\u003eElementary meditation techniques are, as their name implies, special meditation techniques given to acolytes, and are the most basic of techniques. After many years of modification, they have already reached a nearly perfect stage, and the content of the elementary meditation techniques from the various academies did not differ by much.\u003c/p\u003e\n\u003cp\u003eTo be specific, they are similar to the visualisation techniques from his previous world. An acolyte draws mind runes inside their mind to increase their spiritual force, and as they draw more mind runes, their spiritual force grows stronger.\u003c/p\u003e\n\u003cp\u003eEvery Magi liked to record all the precise details and processes down.\u003c/p\u003e\n\u003cp\u003eIn regards to acolytes, they have divided the practice into three levels: level 1 acolyte, level 2 acolyte, and level 3 acolyte.\u003c/p\u003e\n\u003cp\u003eAs for the division between levels, it is seen through the progression of the elementary meditation technique.\u003c/p\u003e\n\u003cp\u003eWhen one has the ability to meditate with 8 runes, they have passed the criteria for a level 1 acolyte. Being able to meditate with 24 runes is the sign of a level 2 acolyte. As for level 3 acolytes, there seemed to be other conditions needed.\u003c/p\u003e\n\u003cp\u003eAs for the meditation progress, it is closely related to a Magus’ aptitude.\u003c/p\u003e\n\u003cp\u003e“In regards to meditation practice, the superiority of a fifth-grade acolyte is extremely obvious; they can become a level 1 acolyte in only five to six days. No wonder Jayden, who was a regular human before boarding the dirigible, was able to use a magic artifact in just half a month’s time.”\u003c/p\u003e\n\u003cp\u003eAs for a fourth-grade acolyte, the time needed to become a level 1 acolyte is approximately fifteen to twenty days. Third-grade acolytes will need a month’s time; second-grade acolytes will need half a year, and first-grade acolytes will need several years!”\u003c/p\u003e\n\u003cp\u003e“This difficulty in progressing will only increase when ascending to level 2 acolyte and level 3 acolyte, hence is it understandable for professors to favour acolytes with high aptitudes. After all, maybe one can receive the remuneration of a proper Magus in a dozen years, with just a little more effort put in now!”\u003c/p\u003e\n\u003cp\u003e[An independent file has been created for the meditation technique data, analyse or not?] The A.I. Chip prompted with a window.\u003c/p\u003e\n\u003cp\u003e“Begin analysing!”\u003c/p\u003e\n\u003cp\u003e[In the process of analysing! Progress: 0.11%] The A.I. Chip showed the current state.\u003c/p\u003e\n\u003cp\u003e“This crystal ball seems to input the information directly into the acolytes’ brains, but the method is a little too crude and it does not care if you remember it completely or not. But the A.I. Chip is able to defragment and store it directly in the memory bank, and is even able to aid by analysing the process!”\u003c/p\u003e\n\u003cp\u003eLeylin indifferently compared the differences between the two.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-21\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-23\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-22","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
