{"id":58778,"no":222,"title":"Chapter 222","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAppearance\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Rain of Fire!”\u003c/p\u003e\n\u003cp\u003eFrom atop the Venom Wyvern’s back Leylin’s gentle voice was heard.\u003c/p\u003e\n\u003cp\u003eShortly after, yet another huge black fireball emerged out of nowhere on top of the stronghold, and boom! The fireball exploded, dispersing into black fire droplets that looked like rain, spreading across the entire area.\u003c/p\u003e\n\u003cp\u003e*Sssii!*\u003c/p\u003e\n\u003cp\u003eAn acolyte who had been surrounding Nyssa had brief contact with a fire droplet that brushed by his shoulder, and before he could even make a sound, he had been reduced to a pile of white ash.\u003c/p\u003e\n\u003cp\u003e“Ru- Run!” The acolyte from the Lilytell family’s voice wavered, his fear apparent.\u003c/p\u003e\n\u003cp\u003e*Shua Shua Shua!* The acolytes that had been surrounding Nyssa looked as if they had seen a ghost, evading the fire droplets in the air, terrified.\u003c/p\u003e\n\u003cp\u003e*Tss tss!* A black spark fell on the silver threads that bound Nyssa.\u003c/p\u003e\n\u003cp\u003eIn that instant, this magic artifact was warped out of shape by the black flames and eventually melted into a silver white liquid that dripped to the ground.\u003c/p\u003e\n\u003cp\u003eUnder the onslaught of black fire droplets, large numbers of acolytes were turned to ash without any chance to resist.\u003c/p\u003e\n\u003cp\u003eThe surrounding buildings began to burn furiously, and under the attack of the Rain of Fire, everything instantly turned into a sea of fire.\u003c/p\u003e\n\u003cp\u003e“It’s- It’s Leylin!”\u003c/p\u003e\n\u003cp\u003eNyssa whispered, but at that moment, she saw a black fire droplet flying towards her.\u003c/p\u003e\n\u003cp\u003e“Hm?” Leylin looked around mid-air and suddenly noticed a very familiar figure from the corner of his eyes.\u003c/p\u003e\n\u003cp\u003e“It’s Nyssa!” Leylin exclaimed, and under his manipulation, the black fire droplet deviated, brushing past the edges of Nyssa’s hair.\u003c/p\u003e\n\u003cp\u003e“Who dares to attack the territory of the Abyssal Bone Forest Academy?”\u003c/p\u003e\n\u003cp\u003eSeveral black human figures dashed out. One of them rapidly chanted a few incantations, and a dome emitting green rays appeared in the sky, blocking the attack of the black fire droplets.\u003c/p\u003e\n\u003cp\u003e*Drip! Drip! Drip!*\u003c/p\u003e\n\u003cp\u003eCountless black fire droplets splashed onto the dome and began to burn.\u003c/p\u003e\n\u003cp\u003eThe Magus who cast the protection spell immediately cried out in alarm. “The might of this black fire is immense. My spiritual force is being rapidly consumed. Who will help me?”\u003c/p\u003e\n\u003cp\u003e“Me!” A Magus nearby immediately chanted a few words, and a layer of blue ice extended across the layer of protection.\u003c/p\u003e\n\u003cp\u003eGreen, blue, and black rays of light mixed together soared into the sky and descended, forming a huge tornado.\u003c/p\u003e\n\u003cp\u003eAfter the tornado descended.\u003c/p\u003e\n\u003cp\u003eThe two Magi looked pale, and it was evident that they had suffered massively.\u003c/p\u003e\n\u003cp\u003eHowever, at this point, nobody bothered with them.\u003c/p\u003e\n\u003cp\u003e“Black flames that are astoundingly strong! That Venom Wyvern as well! You must be ‘Blackfire’ Leylin!”\u003c/p\u003e\n\u003cp\u003eA Magus who seemed to be the leader recognised Leylin.\u003c/p\u003e\n\u003cp\u003e“What? It’s him!” “Leylin!” “That genius who betrayed us?”\u003c/p\u003e\n\u003cp\u003eAll of a sudden, clamours of disbelief broke out from the survivors.\u003c/p\u003e\n\u003cp\u003e“You… must be Magi from the Lilytell family, right?” Leylin clasped his hands behind his back. “Don’t deny it! Even from this distance, I can smell that putrid stench of your bloodline on your bodies!”\u003c/p\u003e\n\u003cp\u003e“So what?” A silver-haired Magus stood. “You actually dared to kill the sole grandson of our elder. I’ve already sent him a signal, so just wait here and prepare to be punished!”\u003c/p\u003e\n\u003cp\u003e“You’ve told him? Good! That’s great!”\u003c/p\u003e\n\u003cp\u003eLeylin’s reaction obviously surprised the silver-haired Magus.\u003c/p\u003e\n\u003cp\u003eLeylin continued, “Since you’ve already alerted him, there’s no point in keeping any of you alive.”\u003c/p\u003e\n\u003cp\u003eHearing Leylin’s words, the Magi present felt a chill in their hearts, a sense of foreboding became apparent.\u003c/p\u003e\n\u003cp\u003e“Shadow Domain!” Countless tentacles extended from the shadow under Leylin’s feet, spreading across the horizon and completely blocking all the sunlight in the area.\u003c/p\u003e\n\u003cp\u003e“Be careful!” The Magus leader nearby could only screech, before a black light flashed and a crimson palm went through his chest, digging out a bright red heart that still pumped furiously.\u003c/p\u003e\n\u003cp\u003eUnder the assault of the Crimson Palm, the innate defense spells of these Magi were torn apart like paper.\u003c/p\u003e\n\u003cp\u003e“He- He killed the leader!”\u003c/p\u003e\n\u003cp\u003eOne of the Magi present looked at Leylin as if they were looking at the devil incarnate, and yelled in despair before running in the opposite direction.\u003c/p\u003e\n\u003cp\u003e“Lum, come back!” The surrounding Magi shouted, but it was too late.\u003c/p\u003e\n\u003cp\u003eWithin the shadows, Leylin seemed to be a grain of dust that had fused with the gentle wind and floated to Lum’s back. A crimson palm went for his head.\u003c/p\u003e\n\u003cp\u003e*Rumble!*\u003c/p\u003e\n\u003cp\u003eA layer of crimson flames began to burn furiously on Lum, and turned the official Magus into ashes.\u003c/p\u003e\n\u003cp\u003eRegular rank 1 Magi were as weak as children in front of Leylin. They were easily taken care of.\u003c/p\u003e\n\u003cp\u003e*Zoom!*\u003c/p\u003e\n\u003cp\u003eLeylin suddenly sensed something and gazed into the distance.\u003c/p\u003e\n\u003cp\u003eFrom far away, a silver ray of light was like a sharp sword, heading here in a straight line.\u003c/p\u003e\n\u003cp\u003e“The main character is here!” Leylin grinned, arms rising as he clenched his fists.\u003c/p\u003e\n\u003cp\u003eThe darkness that had engulfed the entire region was withdrawn into Leylin’s palm, turning into a sphere of darkness which hovered in the air. Strong energy waves swept the area, a violent storm surging and bringing up an entire layer of the ground.\u003c/p\u003e\n\u003cp\u003e“Halt!” The silver-white ray shouted from afar.\u003c/p\u003e\n\u003cp\u003eUnfortunately, Leylin did not care for the voice and flung out the sphere of darkness.\u003c/p\u003e\n\u003cp\u003eThe sphere of darkness that was full of destructive power approached the remaining Magi soundlessly.\u003c/p\u003e\n\u003cp\u003eUnder their terrified gazes, the black sphere advanced slowly and steadily, their spells and innate defensive spells devoured by the sphere.\u003c/p\u003e\n\u003cp\u003eA few official Magi were run over by the sphere, leaving behind tracks on the ground.\u003c/p\u003e\n\u003cp\u003e“I’ll kill you!”\u003c/p\u003e\n\u003cp\u003eAlong with the furious growl, the speed of the silver ray increased by a few times, and Leylin could almost see an old man with silver ornaments on his face.\u003c/p\u003e\n\u003cp\u003e“Time to switch locations!” Leylin gave a light smile and patted Hawke’s head.\u003c/p\u003e\n\u003cp\u003e“Awoo!”\u003c/p\u003e\n\u003cp\u003eHawke let out a roar that seemed to be a demonstration of its might, and with a jolt of its wings, it quickly left the area.\u003c/p\u003e\n\u003cp\u003e*Chi!*\u003c/p\u003e\n\u003cp\u003eIn a few seconds, the silver light from afar arrived, revealing the figure of an old man in silver white attire.\u003c/p\u003e\n\u003cp\u003eThe old man gazed at the stronghold, which had been reduced to ruins. His clothes rustled despite the lack of wind, violent metal elemental particles hovered behind him.\u003c/p\u003e\n\u003cp\u003e“You can’t escape! Even if you were to escape to the ends of the earth, I will still find you and kill you!”\u003c/p\u003e\n\u003cp\u003eMetallic silver white rays flashed, and the old man was gone, leaving behind the echoes of his words.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAnother ten or so minutes passed.\u003c/p\u003e\n\u003cp\u003e*Crash!* Within the ruins, there was an area with a mound. A bizarre creature that looked like it had been sewn together emerged.\u003c/p\u003e\n\u003cp\u003e“Was that Leylin just now? I can’t believe this! So he’s actually became such a powerful official Magus…”\u003c/p\u003e\n\u003cp\u003eNyssa gazed in the direction Leylin had left, muttering to herself incessantly.\u003c/p\u003e\n\u003cp\u003eAs Leylin had intentionally directed his attack away, as well as her somewhat strong resistance to magic, she had not gained any major injuries in this terrifying attack save for a few holes in her clothes.\u003c/p\u003e\n\u003cp\u003e“Official Magus…” An envious glint appeared in Nyssa’s eyes.\u003c/p\u003e\n\u003cp\u003eTo be rid of the harm done to her body, she had to raise her strength to the level of an official Magus. Only then would she be able to alter her body and regain her original appearance.\u003c/p\u003e\n\u003cp\u003e“One day! I will reach that point one day!” Nyssa clenched her fists resolutely.\u003c/p\u003e\n\u003cp\u003e*Rustle!*\u003c/p\u003e\n\u003cp\u003eAt this moment, a large sound was heard from a fallen wooden building nearby. At the bottom of the building, an acolyte could be seen.\u003c/p\u003e\n\u003cp\u003eNyssa walked over curiously but was met with the face of the acolyte that belonged to the Lilytell family.\u003c/p\u003e\n\u003cp\u003eHowever, compared to Nyssa, this acolyte was very unlucky. Not only an arm and a leg was broken, there was a huge injury in his abdominal area. Even his intestines were spilling out, and all he could do was moan and groan in pain.\u003c/p\u003e\n\u003cp\u003e“You! Come here!” Upon seeing Nyssa, this acolyte brightened up.\u003c/p\u003e\n\u003cp\u003e“What is it?” Nyssa gazed at him indifferently.\u003c/p\u003e\n\u003cp\u003e“A filthy, lowly acolyte like you… still, has a bit of use! Send- Send me to my family, and I’ll give you a few items that are barely passable as a reward…”\u003c/p\u003e\n\u003cp\u003eThe acolyte stumbled over his words, looking at Nyssa with disdain, as if letting her touch him was a huge honour.\u003c/p\u003e\n\u003cp\u003eHowever, Nyssa was unmoved like a block of wood and stood there without moving.\u003c/p\u003e\n\u003cp\u003e“You... “The acolyte was flushed red with anger as he pointed at Nyssa, wanting to say something.\u003c/p\u003e\n\u003cp\u003e*Pak!*\u003c/p\u003e\n\u003cp\u003eWith his movement, a red ore fell from his lap, spinning on the ground.\u003c/p\u003e\n\u003cp\u003eUpon seeing the ore, Nyssa’s eyes looked dangerous.\u003c/p\u003e\n\u003cp\u003e“You! What do you think you’re doing?”\u003c/p\u003e\n\u003cp\u003eThe acolyte that had been arrogant beyond belief suddenly felt a hint of danger, a fearful expression flashed past before he tried to sit upright. “Are you trying to attack me? You have to think this—”\u003c/p\u003e\n\u003cp\u003e*Bang!*\u003c/p\u003e\n\u003cp\u003eBefore the acolyte could finish his words, a green corrosive ball landed on his head, eating through most of his head in the next second.\u003c/p\u003e\n\u003cp\u003eGazing upon his corpse, Nyssa went forward and retrieved that red ore.\u003c/p\u003e\n\u003cp\u003e“I merely followed your earlier instructions and focused my attack on your face, young master Lilytell…”\u003c/p\u003e\n\u003cp\u003eNyssa had a strange expression on her face. It seemed to be dread, but at the same time, she looked as if a weight had been lifted off her shoulders.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eLeylin stood in the heart of a spacious land filled with broken stones while appearing to be waiting for someone.\u003c/p\u003e\n\u003cp\u003eThe Venom Wyvern Hawke was useless in this level of battle and had been ordered to return.\u003c/p\u003e\n\u003cp\u003eAll of a sudden, Leylin raised his head as if he had sensed something.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-221\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-223\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-222","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
