{"id":58786,"no":230,"title":"Chapter 230","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eSlain \u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Latent Fireball!”\u003c/p\u003e\n\u003cp\u003eLeylin raised his right arm and hundreds of small black fireballs fused in front of him, till they were about the size of a human head. The black in the middle was even more intense, giving it a profound air as if it could suck in human spirits.\u003c/p\u003e\n\u003cp\u003eUnder the intense flames that were of a high temperature, even the brownish-yellow gravitational rays began to show signs of instability, constantly retracting and extending.\u003c/p\u003e\n\u003cp\u003eFacing the giant in front of him, Leylin’s expression was cold.\u003c/p\u003e\n\u003cp\u003eThe latent fireball soared through the sky as if passing through space, and it appeared in front of the metallic giant in an instant.\u003c/p\u003e\n\u003cp\u003eThe black fire’s high-temperature force field caused the metallic giant to sway slightly, liquid metal constantly melting and dripping onto the ground.\u003c/p\u003e\n\u003cp\u003eIn the face of such a terrifying attack, Marb steeled himself and grabbed on to his right arm!\u003c/p\u003e\n\u003cp\u003e*Ka-cha!*\u003c/p\u003e\n\u003cp\u003eThe ear-piercing sound of bones breaking sounded, and Marb himself actually tore off his own arm.\u003c/p\u003e\n\u003cp\u003eThe half-complete metallic arm that he tossed away showed signs of melting into the air and then turned into an oval metal ball. It then collided with the black fireball!\u003c/p\u003e\n\u003cp\u003e*Rumble!*\u003c/p\u003e\n\u003cp\u003eBright rays of light unceasingly spread out, and at the centre, there was a black and silver-white light that was constantly squirming… devouring...\u003c/p\u003e\n\u003cp\u003eEven though Marb had tried to increase the distance between them as best as he could, he was still affected by the energy waves. *Ka-cha!* The gravity spell formation at his chest immediately cracked.\u003c/p\u003e\n\u003cp\u003e*Pak!*\u003c/p\u003e\n\u003cp\u003eThe brownish-yellow gravity spell formation simply collapsed, and the gravity immediately went back to normal.\u003c/p\u003e\n\u003cp\u003e*Boom! Boom! Boom! Boom! Boom!*\u003c/p\u003e\n\u003cp\u003eExplosions sounded one after another like beans exploding.\u003c/p\u003e\n\u003cp\u003eJust ten seconds later, the entire ground had been levelled, and even a large portion of the earth had been blown off.\u003c/p\u003e\n\u003cp\u003eAt the centre was a gigantic pit that was so deep that one could not see the bottom.\u003c/p\u003e\n\u003cp\u003eAfter the ash and dust had somewhat dispersed, Leylin came to the side of the pit. Seeing the black flames that were still burning, he asked aloud, “Dead yet?”\u003c/p\u003e\n\u003cp\u003e*Shua!*\u003c/p\u003e\n\u003cp\u003eA silver-white figure immediately cut through the curtain of ash and appeared before Leylin.\u003c/p\u003e\n\u003cp\u003e“Marb?!” Producing an expression of pure shock, he quickly backed away!\u003c/p\u003e\n\u003cp\u003e“Ah! Ah! Ah!” Marb’s current condition was very pitiful. Not only had he lost his right arm, even his chest and thigh had injuries that were so deep one could see the bone.\u003c/p\u003e\n\u003cp\u003eThis was especially so for the injury above his waist. It looked as if he was on the verge of being broken into two.\u003c/p\u003e\n\u003cp\u003eIf this were an ordinary human or even an official Magus, they would find it difficult to survive, let alone go on the offense with such dangerous injuries.\u003c/p\u003e\n\u003cp\u003eBut Marb was evidently different. Liquid metal unceasingly flowed and covered several areas, forcefully patching up his body.\u003c/p\u003e\n\u003cp\u003eUpon seeing Leylin, silver light that seemed to have turned solid shot out of his eyes.\u003c/p\u003e\n\u003cp\u003e*Bang!*\u003c/p\u003e\n\u003cp\u003eTwo metal bombs behind his back exploded, the force instantly acting on his back.\u003c/p\u003e\n\u003cp\u003eUsing this method, he was able to catch up to Leylin.\u003c/p\u003e\n\u003cp\u003e“We shall perish together!” Marb pounced forward.\u003c/p\u003e\n\u003cp\u003eWhile in midair, his entire body dispersed and turned into a silver white curtain.\u003c/p\u003e\n\u003cp\u003eThe metallic curtain seemed to have a life of its own as it bundled Leylin within, leaving behind his head on the outside.\u003c/p\u003e\n\u003cp\u003e“Hm? An interesting attack! Is this your final attack?” Leylin watched the silver liquid metal wrapped around him like a cocoon, his expression cool and not the least bit flustered.\u003c/p\u003e\n\u003cp\u003e*Gulu! Gulu!*\u003c/p\u003e\n\u003cp\u003eA large amount of liquid metal gathered at Leylin’s shoulder, turning into the face of an old man.\u003c/p\u003e\n\u003cp\u003e“For the family! For Bosain! Metal will ultimately be destroyed…” The old man looked deranged and looked as if he was planning to die for a just cause.\u003c/p\u003e\n\u003cp\u003e“By the way… do you mean to die together with that puppet?”\u003c/p\u003e\n\u003cp\u003eJust as Marb was about to self-destruct, a voice lazily resounded from the other end of the battlefield.\u003c/p\u003e\n\u003cp\u003eMarb turned around in disbelief, and immediately caught sight of another Leylin that had suddenly appeared. He looked to be mocking the old man as he sized him up.\u003c/p\u003e\n\u003cp\u003e“You must have forgotten, but I am a Magus specialising in Dark elemental energy particles. For us, making a shadow clone is a piece of cake.”\u003c/p\u003e\n\u003cp\u003eWhile Leylin spoke, the “Leylin” that Marb had bound, began to transform in a bizarre manner.\u003c/p\u003e\n\u003cp\u003eThe entire body became black and turned into a bundle of black shadows.\u003c/p\u003e\n\u003cp\u003e“No!” A pair of silver-white hands reached out from the curtain as Marb yelled, trying to get away from the clone.\u003c/p\u003e\n\u003cp\u003e“It’s too late!” Leylin exclaimed indifferently, with even some pity in his voice.\u003c/p\u003e\n\u003cp\u003e*Shua Shua Shua!*\u003c/p\u003e\n\u003cp\u003eThe large lump of shadows that had Marb surrounded suddenly produced countless black tendrils that engulfed Marb.\u003c/p\u003e\n\u003cp\u003eMarb bellowed as large numbers of fine, rotating knives emerged from his body.\u003c/p\u003e\n\u003cp\u003e*Ka-cha! Ka-cha!* Sparks flew as the blades and tendrils made contact.\u003c/p\u003e\n\u003cp\u003eHowever, this time, the durability of the shadow tendrils had increased in might by a large margin, and the silver-white blades eventually got stuck. Some even snapped.\u003c/p\u003e\n\u003cp\u003e“Goodbye, Marb!”\u003c/p\u003e\n\u003cp\u003eHis expression was strange as he watched Marb, who was completely bound by the shadow tendrils.\u003c/p\u003e\n\u003cp\u003eNext, he raised his arm, and then clenched his fist!\u003c/p\u003e\n\u003cp\u003e*Boom!*\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e”Is it over?”\u003c/p\u003e\n\u003cp\u003eThe female Magus from before had escaped far, far away due to her fear of the aftershocks from the battle. Only after it ended did she dare to return while cowering.\u003c/p\u003e\n\u003cp\u003eIt was not that she did not want to escape, but if Marb was the one who won, it would be impossible for her to escape with her current speed. Hence, it would be better to take the chance and return. If Leylin and Marb were able to heavily injure each other, she could render some assistance too! This would ultimately benefit her!\u003c/p\u003e\n\u003cp\u003e“Or perhaps… the two of them perished together? If that’s the case, all their possessions will belong to me! Hahaha…”\u003c/p\u003e\n\u003cp\u003eAt the thought of picking up loot from two mighty people, the female Magus began to laugh aloud a little neurotically.\u003c/p\u003e\n\u003cp\u003e“My apologies, but you’ll have to be disappointed!”\u003c/p\u003e\n\u003cp\u003eNext, Leylin’s voice was heard and the female Magus’ maniacal laughter suddenly stopped like a duck who had its throat gripped.\u003c/p\u003e\n\u003cp\u003e“It’s you! That Leylin who caused me to be chased after…”\u003c/p\u003e\n\u003cp\u003eThe female Magus commented lightly, but quickly changed her words, “Oh! No, I mean Magus Leylin!”\u003c/p\u003e\n\u003cp\u003eAs he watched this female Magus, who seemed to be much too comfortable in this situation, Leylin shook his head and had no intentions of chatting with her.\u003c/p\u003e\n\u003cp\u003e“Hunting zones are still quite dangerous. If you want to gather resources, it’s better to head to the other zones.”\u003c/p\u003e\n\u003cp\u003eLeylin turned and left after he spoke.\u003c/p\u003e\n\u003cp\u003e“Hey! Wait! Where’s that Magus called Marb? Did you chase him away?” Only now did the female Magus react.\u003c/p\u003e\n\u003cp\u003eWith the fear from before still lingering in her heart, she looked around as if afraid that Marb would appear at any moment.\u003c/p\u003e\n\u003cp\u003e“Marb? He’s right here!”\u003c/p\u003e\n\u003cp\u003eLeylin waved, showing her the huge lump of metal in his hand.\u003c/p\u003e\n\u003cp\u003e“Hm?” The female Magus gazed at the item in Leylin’s hand with astonishment.\u003c/p\u003e\n\u003cp\u003eThat was a large piece of silver, metallic ore. At the beginning, she had assumed Leylin had found some materials and ignored it.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eHowever, upon closer inspection, there were a few strange depressions and protruding areas on the surface, like a… human face?!\u003c/p\u003e\n\u003cp\u003eAfter comparing the eyes and nose, the female Magus fell back three steps, “It’s Marb! You killed him?”\u003c/p\u003e\n\u003cp\u003eSuch an unusual reaction actually threw Leylin off.\u003c/p\u003e\n\u003cp\u003e”He’s a dark Magus. As a Magus from the hunting team, isn’t it normal to kill him?”\u003c/p\u003e\n\u003cp\u003e“Were…. were you dropped on the head as a child? I- no! What!”\u003c/p\u003e\n\u003cp\u003eToo confused, she began to stutter.\u003c/p\u003e\n\u003cp\u003e“That’s a peak rank 1 Magus! Peak! No matter where you go, someone with that level of strength is definitely of a high status and has an extraordinary battle power. It wouldn’t take more than one attack from him to kill off newly-advanced Magi! And you… you actually…”\u003c/p\u003e\n\u003cp\u003eShe peeked at the piece of metal in Leylin’s hand in disbelief, fear apparent while she glanced at Leylin.\u003c/p\u003e\n\u003cp\u003eLeylin smiled nonchalantly.\u003c/p\u003e\n\u003cp\u003eIn the south coast, rank 2 Magus usually did not make themselves known. Hence, peak rank 1 Magi were the strongest powers out there.\u003c/p\u003e\n\u003cp\u003eNow, a rank 1 Magus at his peak who was considered the strongest out there, had died by his hand! If news of this travelled out, it would definitely cause a huge stir.\u003c/p\u003e\n\u003cp\u003eIf this was the Leylin from before, he might even try his utmost to conceal this mater.\u003c/p\u003e\n\u003cp\u003eHowever, after his second bloodline transition and the sharp increase in his power, things had changed!\u003c/p\u003e\n\u003cp\u003eThis was an unrivalled confidence in himself! So what if news of his battle achievements was circulated? With his current strength, it was enough for him to take care of himself and cause anyone who had designs on him to suffer miserably!\u003c/p\u003e\n\u003cp\u003e”Awoooo!”\u003c/p\u003e\n\u003cp\u003eAt this moment, a huge Venom Wyvern circled the area briefly and then descended.\u003c/p\u003e\n\u003cp\u003eIt roared loudly and then used its huge head and nuzzled Leylin, trying to get a good response from him.\u003c/p\u003e\n\u003cp\u003e“This is… is this that legendary Venom Wyvern? How valiant, I like it…”\u003c/p\u003e\n\u003cp\u003eHer eyes shone like stars, “Handsome! Can you give me a ride?”\u003c/p\u003e\n\u003cp\u003eLeylin shot her a glance.\u003c/p\u003e\n\u003cp\u003eTo be honest, this female Magus did not look half bad, especially in terms of her figure. In addition, she had not mended her clothes that had been damaged while she was fleeing, thus revealing a whole lot of skin.\u003c/p\u003e\n\u003cp\u003eOrdinarily, and in a situation where he had time to spare, Leylin was not against playing around with her.\u003c/p\u003e\n\u003cp\u003eBut this was the secret plane! He was still being pressured by both the dark and light Magi factions. It would be a wonder if he was in the mood for this sort of thing.\u003c/p\u003e\n\u003cp\u003e“Boring!”\u003c/p\u003e\n\u003cp\u003eLeylin indifferent uttered a word and then jumped onto the back of the Venom Wyvern.\u003c/p\u003e\n\u003cp\u003e“Awoo…” The Venom Wyvern bellowed at the female Magus as if trying to demonstrate its power and spread its wings, flying off.\u003c/p\u003e\n\u003cp\u003e“Tsk! Such a petty man! It’s not as if I’ll die without you around!”\u003c/p\u003e\n\u003cp\u003eWaiting till the Venom Wyvern’s figure complete disappeared into the horizon, she fiercely made a rude gesture in Leylin’s direction.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-229\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-231\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-230","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
