{"id":58791,"no":235,"title":"Chapter 235","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eMeeting\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“These thin threads must represent my contract with the Four Seasons Garden! Now that they’re completely broken, it must mean that I’ve destroyed my contract with the Four Seasons Garden.”\u003c/p\u003e\n\u003cp\u003eA hint of glee appeared on Leylin’s face.\u003c/p\u003e\n\u003cp\u003eHaving destroyed his side of the contract, he could reap a lot of benefits! Leylin was now no longer under the constraints of the contract and was free to do anything that might harm the Four Seasons Garden, including brazenly killing their members.\u003c/p\u003e\n\u003cp\u003eAs for Reynold, who represented the Four Seasons Garden, and was the one who Leylin had made a contract with, he had to abide by the regulations stated in the contract. Without evidence, he would not be able to do anything against Leylin!\u003c/p\u003e\n\u003cp\u003eAlso, this method of destroying his end of the contract would not alert Reynold. This was one of the special chaotic characteristics of the Nefarious Filthbird.\u003c/p\u003e\n\u003cp\u003e*Rumble!*\u003c/p\u003e\n\u003cp\u003eThe Nefarious Filthbird, which was hovering in mid-air, swallowed the Trial’s Eye down its beak! Leylin could even see a round protrusion at the Nefarious Filthbird’s neck, travelling down and into its abdominal area.\u003c/p\u003e\n\u003cp\u003e“Chi chi!” After swallowing a Trial’s Eye, the Nefarious Filthbird made joyful screeches and transmitted a message to Leylin.\u003c/p\u003e\n\u003cp\u003e“Trial’s Eye will eventually perish, and chaos will remain eternal!”\u003c/p\u003e\n\u003cp\u003e“More! More summons! I will wipe all traces of the Trial’s Eye from you!”\u003c/p\u003e\n\u003cp\u003eLittle pieces of information were transmitted to Leylin and were transformed into a form that Leylin could understand.\u003c/p\u003e\n\u003cp\u003e“I will do so!” Leylin bowed deeply. Though he had no idea if the other party could really understand his actions, Leylin still had to remain polite on a superficial level.\u003c/p\u003e\n\u003cp\u003eThe Nefarious Filthbird nodded in a very human way and produced a long, loud cry.\u003c/p\u003e\n\u003cp\u003eAmidst its terrifying, ear-piercing screeches, the Nefarious Filthbird’s body exploded into the grey mist.\u003c/p\u003e\n\u003cp\u003eThe grey colour of the mist gradually faded into the air.\u003c/p\u003e\n\u003cp\u003eAt the same time, Leylin could feel the chaotic attribute that had been surrounding him ever since he had opened the test tube, dissipating.\u003c/p\u003e\n\u003cp\u003eThe Trial’s Eye was an existence on the same level as the Nefarious Filthbird! Without the chaotic power that the solution automatically let out, which isolated the area, the probing from the Trial’s Eye and the transmissions to Leylin would long since have attracted the Trial’s Eye here.\u003c/p\u003e\n\u003cp\u003eAfter the Nefarious Filthbird vanished, Leylin sensed some changes within his body.\u003c/p\u003e\n\u003cp\u003eHis contract with Four Seasons Garden was now completely destroyed. Other contracts with the Trial’s Eye were still there, but they had no reaction, as though nothing had happened.\u003c/p\u003e\n\u003cp\u003e“The power of chaos is amazing! The ancient Nefarious Filthbird is truly the mortal enemy of the Trial’s Eye! I wonder how the dark Magus behind Giant managed to obtain this solution.”\u003c/p\u003e\n\u003cp\u003eLeylin murmured to himself.\u003c/p\u003e\n\u003cp\u003eIn the south coast, contracts made with the Trial’s Eye were very common. They were very trustworthy, and there were almost no cases of them being tampered with.\u003c/p\u003e\n\u003cp\u003eBesides, the feathers of the ancient Nefarious Filthbird had become extinct over a thousand years ago.\u003c/p\u003e\n\u003cp\u003eHence, even Reynold would not imagine that Leylin would use this method to break away from the constraints of the contract.\u003c/p\u003e\n\u003cp\u003e“This power is truly terrifying!”\u003c/p\u003e\n\u003cp\u003eLeylin could not help but raise the status of Thousand Meddling Hands in his heart, in awe of the ability of this dark Magus organisation to procure a solution that was already extinct.\u003c/p\u003e\n\u003cp\u003e“But even in the organisation, there shouldn’t be a lot of this solution…” Leylin was quite sure about this. If not, the Thousand Meddling Hands would have used it a long time ago and wreaked havoc upon the south coast.\u003c/p\u003e\n\u003cp\u003eNight descended. Though they were within the secret plane, the moonlight was still bright, making it no different from the external world.\u003c/p\u003e\n\u003cp\u003eAt this moment, a black figure donning a cloak that covered his face sneakily crept into Four Seasons Garden’s camp and constantly moved towards the outer areas.\u003c/p\u003e\n\u003cp\u003e*Chila!*\u003c/p\u003e\n\u003cp\u003eAt a place where there was a devilish tree that was somehow divided into three parts, the black figure stopped and lit his hand up with crimson flames.\u003c/p\u003e\n\u003cp\u003e“You’re finally here!”\u003c/p\u003e\n\u003cp\u003eThe surface devilish tree twisted for a moment, and a man’s face appeared on the bark. It suddenly opened his mouth and spoke to the Magus, “Come down from here!”\u003c/p\u003e\n\u003cp\u003e*Tsssla!*As the wooden face spoke, a huge hole opened up at the roots of the devilish tree and revealed a pitch-black passageway.\u003c/p\u003e\n\u003cp\u003eThe Magus nodded and quickly walked down.\u003c/p\u003e\n\u003cp\u003e*Boom!* After his figure disappeared into the passageway, the entrance immediately closed and the human face vigilantly surveyed the area, before disappearing back into the tree trunk.\u003c/p\u003e\n\u003cp\u003eIt became peaceful once more as if nothing had happened.\u003c/p\u003e\n\u003cp\u003eThe passageway was very long, and this Magus walked for about ten minutes before he reached the end.\u003c/p\u003e\n\u003cp\u003eAt the end was a huge basement, the surroundings of which flickered with yellow earth magic. It most likely had been made very recently.\u003c/p\u003e\n\u003cp\u003eIn the spacious basement, there was the vague form of a giant with great amounts of green fog floating around him. Upon seeing the Magus, he seemed to smile. “You’re here!”\u003c/p\u003e\n\u003cp\u003e“Hn!” The Magus nodded and pushed back the hood to reveal a handsome young face.\u003c/p\u003e\n\u003cp\u003eBlack hair, elegant face, fair skin, and eyes that gave off a devilish glint.\u003c/p\u003e\n\u003cp\u003eJust by standing there, he was able to give off a strange charm.\u003c/p\u003e\n\u003cp\u003eThis person was, of course, Leylin. His eyebrows were currently furrowed because nothing good could be happening if Giant chose this moment to summon him here.\u003c/p\u003e\n\u003cp\u003eAt the same time, Leylin’s nostrils flared.\u003c/p\u003e\n\u003cp\u003e“Did you receive a lot of guests just now? I seem to sense the aura of many familiar people…”\u003c/p\u003e\n\u003cp\u003eGiant looked at Leylin with some surprise. “Yes! They’re all our comrades from the Thousand Meddling Hands. I’d already wiped off all traces of them, but you were actually able to notice! Looks like the rumours out there aren’t wrong, and you’re already a peak rank 1 Magus!”\u003c/p\u003e\n\u003cp\u003eGiant glanced at Leylin with some apprehension in his eyes. “Looks like our leader’s initial choice to attract you into entering our organisation was a right one!”\u003c/p\u003e\n\u003cp\u003eLeylin only gave a mysterious smile in reply.\u003c/p\u003e\n\u003cp\u003eAfter the second bloodline transition, he could feel that the quality of his body constantly increasing. Even a few of his organs seemed to have awoken from a deep sleep and obtained many miraculous abilities.\u003c/p\u003e\n\u003cp\u003eThough these abilities were of no help to him in battle, they could usually exhibit surprising effects at unexpected moments.\u003c/p\u003e\n\u003cp\u003e“Looks like you’re planning something grand!” Leylin looked Giant straight in the eye.\u003c/p\u003e\n\u003cp\u003eFrom what he had sensed, Giant had actually called out all of the elites of the Thousand Meddling Hands.\u003c/p\u003e\n\u003cp\u003eGetting in contact with him was a huge risk, and he had even gotten Leylin to enter the inner circle of the Four Seasons Garden. It was easy to tell what Giant had planned to do.\u003c/p\u003e\n\u003cp\u003e“Hehe! That’s not my plan, but the idea from the Lord behind me!” Giant brought up the rank 2 dark Magus behind the Thousand Meddling Hands once again.\u003c/p\u003e\n\u003cp\u003e“So, the feathers of the Nefarious Filthbird are rather useful, yes?” Giant asked.\u003c/p\u003e\n\u003cp\u003e“I’ve used them!” Leylin lifted his brows. “If there’s anything you want to say, say it!”\u003c/p\u003e\n\u003cp\u003e“Alright! Our target, this time, is the resource warehouse in the Eternal Plains’ secret plane that the Four Seasons Garden is in charge of!” Giant told him their goal without beating around the bush.\u003c/p\u003e\n\u003cp\u003e“This time, not only will our members go all-out on this mission, even the Lord behind us will make his move at opportune times.”\u003c/p\u003e\n\u003cp\u003eLeylin’s face twitched slightly at this news, but he accepted this peacefully.\u003c/p\u003e\n\u003cp\u003eIn the Four Seasons Garden, there was Reynold, who was at least a rank 2 Magus, taking charge! If there wasn’t an opponent with a similar level of power to attract the brunt of the assault, the invading dark Magi would just be committing suicide no matter how many of them there were!\u003c/p\u003e\n\u003cp\u003e“Alright. What’s my mission?” Leylin inquired.\u003c/p\u003e\n\u003cp\u003e“Good!” Giant pointed his thumb upwards. “Your mission is simple. The time we make our move is tomorrow night at 7. Reynold is planning on seeing you, right?”\u003c/p\u003e\n\u003cp\u003eGiant spoke matter-of-factly, but this made Leylin’s heart turn cold.\u003c/p\u003e\n\u003cp\u003eFor him to know about even this, there must have been other spies from the Thousand Meddling Hands in the Four Seasons Garden!\u003c/p\u003e\n\u003cp\u003eBut putting your hands on everything will only expose your own identity! Leylin smirked inside.\u003c/p\u003e\n\u003cp\u003eGiant had not noticed any abnormalities in Leylin and was still speaking, “At that time, we will lead Reynold away. Your mission is to pass through a spell formation inside his office and activate this spell design.”\u003c/p\u003e\n\u003cp\u003eAs he spoke, he passed a fist-sized red crystal to Leylin.\u003c/p\u003e\n\u003cp\u003e*Pak!* Leylin firmly caught the red crystal.\u003c/p\u003e\n\u003cp\u003e“What is this spell design?” The interior of the red crystal was laden with tiny runes. When the runes connected together, they looked like a gold liquid constantly flowing inside the crystal.\u003c/p\u003e\n\u003cp\u003eThough the A.I. Chip had never recorded such runes before, Leylin was sure that this was a spell design specially catered to a specific spell formation or artifact.\u003c/p\u003e\n\u003cp\u003eAfter all, how could something Reynold had placed in his own office and was personally protecting, be anything simple?\u003c/p\u003e\n\u003cp\u003e“It’s just a regular spell design to lift a seal!” It was obvious that Giant did not want to explain any further.\u003c/p\u003e\n\u003cp\u003eLeylin stared at the Giant for a long, long time, and then spoke. “You want me to do something in the area where the Four Seasons Garden has the tightest defense, which is a rank 2 Magus’ office. Are you trying to get me killed?”\u003c/p\u003e\n\u003cp\u003eAs he spoke, Leylin’s eyes turned into an amber hue.\u003c/p\u003e\n\u003cp\u003eA powerful spiritual force with a depthless darkness quickly descended upon the area!\u003c/p\u003e\n\u003cp\u003eBloodlust and terror! Spiritual force that carried dense elemental particles with it formed a phantom of a black, giant serpent, which glided around Giant. Its eyes were fixated on Giant, as if it was looking for a place for it to sink its teeth into.\u003c/p\u003e\n\u003cp\u003e“Such an imposing aura and such bloodlust! How many people has he actually killed?”\u003c/p\u003e\n\u003cp\u003eGiant’s heart went cold. He himself wasn\u0027t any good person and had taken the lives of countless people. However, compared to such a cold-blooded and strong bloodlust, he was still on a lower level than this person!\u003c/p\u003e\n\u003cp\u003eWhat made Giant even more shocked was that Leylin’s spiritual force had already reached an amount that only peak rank 1 Magi possessed. He might have even surpassed Giant himself!\u003c/p\u003e\n\u003cp\u003e“He actually dares to attack here!”\u003c/p\u003e\n\u003cp\u003eGazing into Leylin’s ice-cold pupils, Giant’s heart suddenly chilled, feeling as if his opponent knew all of his secrets.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-234\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-236\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-235","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
