{"id":58581,"no":25,"title":"Chapter 25","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eElementary Potioneering\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Professor! I have already become a level 1 acolyte and have understood the basics from the public lessons……”\u003c/p\u003e\n\u003cp\u003eLeylin said softly.\u003c/p\u003e\n\u003cp\u003e“I know, you wish to choose the subject for the knowledge I am providing!” Kroft interrupted Leylin’s speech.\u003c/p\u003e\n\u003cp\u003e“I heard that you have already been teaching other acolytes information from the public lessons that you’ve attended to earn magic crystals. It seems like your learning and memorising abilities are rather outstanding. From what I see now, you have the capability to learn an information of a higher tier!”\u003c/p\u003e\n\u003cp\u003e“Thank you!” Leylin bowed deeply.\u003c/p\u003e\n\u003cp\u003eLeylin had some understanding towards the paid lessons in the academy. Although professors have information on a higher level, it was only their own findings.\u003c/p\u003e\n\u003cp\u003eAs for the other cutting-edge research, including the results of various personal experiments, information was only traded at the professors’ level.\u003c/p\u003e\n\u003cp\u003eThis information was deemed the best, and can even be transferred directly into an acolyte’s memory so they will never forget it.\u003c/p\u003e\n\u003cp\u003eHowever, the fees were also the most expensive, each subject required at least ten magic crystals and Leylin simply could not afford it right now.\u003c/p\u003e\n\u003cp\u003eThe only thing he could hope for was the one free subject that Kroft promised at the start.\u003c/p\u003e\n\u003cp\u003eKroft nodded his head and moved the apparatus on his table aside. He then retrieved some strange items from god-knows-where and placed them on the table.\u003c/p\u003e\n\u003cp\u003eThere was a huge book with a yellow cover, a crystal ball, and a test tube filled with yellowish liquid.\u003c/p\u003e\n\u003cp\u003e“These three items represent my 3 areas of specialisation: The book on the left represents the Neutralisation of Energy, the crystal ball represents Herbalism, and the test tube represents Potioneering. Make your choice!” Kroft said.\u003c/p\u003e\n\u003cp\u003e“I choose Potioneering!” The reason Leylin chose Kroft as his mentor was to advance in Potioneering and then rely on selling potions to earn money for his studies, so naturally he chose this.\u003c/p\u003e\n\u003cp\u003eElementary Potioneering is an advanced course stemming from the public Potioneering Basics course. In theory, it is possible to start brewing potions after fully understanding these two lessons.\u003c/p\u003e\n\u003cp\u003e“I knew you would choose this!” The middle-aged Kroft revealed a smile.\u003c/p\u003e\n\u003cp\u003e“The art of potion brewing is extremely complex and complicated, the slightest mistake will result in a failure. All of the Potion Masters have spent a vast amount of resources to accumulate their experience. Are you ready for this?”\u003c/p\u003e\n\u003cp\u003e“Yes, Sir! I believe in this saying: You may not be rewarded for hard work, but without hard work, there will definitely be no reward!”\u003c/p\u003e\n\u003cp\u003e“Indeed! A very good mindset. One needs to have this philosophy on the road to truth!” Kroft nodded and handed the yellow test tube to Leylin.\u003c/p\u003e\n\u003cp\u003e“This is yours now!”\u003c/p\u003e\n\u003cp\u003e“This? How do I use it?” Leylin looked at the test tube in his hands.\u003c/p\u003e\n\u003cp\u003e“Just drink from it directly!”\u003c/p\u003e\n\u003cp\u003eLeylin opened the wooden plug and poured the yellowish liquid into his mouth.\u003c/p\u003e\n\u003cp\u003eAn obnoxious sewer stench infiltrated his senses, and the smell lingered in his nose. Leylin’s face turned red, and tears even came out.\u003c/p\u003e\n\u003cp\u003eHe barely managed to swallow it as he gasped for air.\u003c/p\u003e\n\u003cp\u003e“I swear, I have never drunk such a smelly thing before!!!”\u003c/p\u003e\n\u003cp\u003eSmelly!!! An unimaginable stench constantly shocked Leylin’s nerves, making him feel like fainting.\u003c/p\u003e\n\u003cp\u003eUnder the stimulation of the extreme smell, the surroundings appeared blurry to Leylin, and the items in the vicinity all seemed to be distorted.\u003c/p\u003e\n\u003cp\u003e“You…...It feels…...Not so……”\u003c/p\u003e\n\u003cp\u003eLeylin looked at Kroft, and at this moment, the professor looked like a noodle, twisting and distorting. The professor’s lips opened and closed and he spoke sporadically, which brought about a lot of noise. It sounded like the friction produced between two metals, or some broken radio with poor signal.\u003c/p\u003e\n\u003cp\u003eLeylin raised his hand, his smooth palms seemed to be filled with folds, and even melted like a candle, falling down one drop at a time.\u003c/p\u003e\n\u003cp\u003eAnd finally, Leylin’s entire body turned into a puddle of liquid and disappeared completely into the darkness……\u003c/p\u003e\n\u003cp\u003e“How do you feel?”\u003c/p\u003e\n\u003cp\u003eKroft’s voice rang, and Leylin was startled. He touched his head, the hard sensation bringing along warmth and a little moisture.\u003c/p\u003e\n\u003cp\u003eThe surroundings turned back to normal, and Kroft stood there smiling.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t feel too good!” Large amounts of sweat trickled down from Leylin’s head.\u003c/p\u003e\n\u003cp\u003e“Was what I saw earlier an illusion? It felt too real!”\u003c/p\u003e\n\u003cp\u003e“That is a normal occurrence, the illusionary spells of Magi seem like reality to acolytes, and some acolytes have even experienced their whole life inside the illusions and died of old age!”\u003c/p\u003e\n\u003cp\u003eKroft’s voice sounded.\u003c/p\u003e\n\u003cp\u003e“The information has already been transferred into your brain, do some more meditation after you go back!”\u003c/p\u003e\n\u003cp\u003eAt this moment, Leylin discovered a block of new information inside his brain. A phrase appeared on the right side of the text, saying: “Elementary Potioneering”\u003c/p\u003e\n\u003cp\u003e“Alright! Today your task is to sweep Area 3, and also freeze all the Fire Ant Grass……”\u003c/p\u003e\n\u003cp\u003eKroft handed out the tasks.\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head and picked up the tools lying in the corner of the lab, and then headed to Area 3.\u003c/p\u003e\n\u003cp\u003e“Congratulations, Leylin!” During Leylin’s break time, Bicky came before Leylin.\u003c/p\u003e\n\u003cp\u003e“I was just lucky!” Leylin smiled lightly.\u003c/p\u003e\n\u003cp\u003eBicky had come here a year earlier than him and was also a level 1 acolyte.\u003c/p\u003e\n\u003cp\u003e“Once you are a level 2 acolyte, you will be able to use rank 0 spells! Also, the mind runes will only get increasingly difficult. I still have to persevere for at least another year of meditation before I have a chance at advancing.”\u003c/p\u003e\n\u003cp\u003eWith the A.I. Chip, Leylin was fully aware of the situation he was in.\u003c/p\u003e\n\u003cp\u003eOn the other side, Merlin, who was boring over his experiments, raised his head and forced a smile that was uglier than crying.\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head in acknowledgement. He knew that this senior of his had burnt the muscles of his face in an experiment and was now unable to make any facial expressions.\u003c/p\u003e\n\u003cp\u003e“Magi experiments are really treacherous!” Leylin shook his head.\u003c/p\u003e\n\u003cp\u003eLeylin was rather efficient and normally finished the task Kroft gave him by noon. If there was spare time in the afternoon, he would go listen to the public lessons.\u003c/p\u003e\n\u003cp\u003e“Goodbye!” After saying goodbye to Bicky and Merlin, Leylin did not go to the academic area but instead went to the trading post.\u003c/p\u003e\n\u003cp\u003eThe trading post was huge and was located beside the Mission Area. However, it was rather chaotic; many grey-robed acolytes set up stalls, with an erect signboard stating the items and conditions that they wished to sell or trade.\u003c/p\u003e\n\u003cp\u003eOnce in awhile, a few acolytes would engage in haggling, it was extremely bustling.\u003c/p\u003e\n\u003cp\u003e“It seems like only acolytes are around. As for the Magi, they should have another area to trade in!” Leylin looked on and only saw grey robes, not a single white or black robed Magus was present.\u003c/p\u003e\n\u003cp\u003eLeylin browsed through the stalls. Some of them were set up on the floor, similar to the previous world’s street vendors, and looked to be a little dirty.\u003c/p\u003e\n\u003cp\u003eThe floor stalls’ items belonged to the miscellaneous category; most of them were bows, knives, darts and so on. There were also the fur, livers, and eyes of living organisms, and some still had traces of blood. The rest were some other items that Leylin could not identify.\u003c/p\u003e\n\u003cp\u003eAs for potions, every stall with ‘Potions’ on its signboard had acolytes clamouring over them. The stall owners all had calm expressions and radiated strong energy waves.\u003c/p\u003e\n\u003cp\u003eAccording to the estimation of the A.I. Chip, most of these acolytes were level 3 acolytes!\u003c/p\u003e\n\u003cp\u003e“As expected, the rarity of potions is above my imagination, not to mention magic artifacts, not a single one is on sale!\u003c/p\u003e\n\u003cp\u003eLeylin thought of Jayden, who previously used the green coloured badge. That was a low-grade magic artifact, similar to the ring he had before.\u003c/p\u003e\n\u003cp\u003eA level 1 acolyte could not use any spells, but Jayden had previously subdued Kaliweir through the green badge magic artifact.\u003c/p\u003e\n\u003cp\u003e“Now it seems like the magic artifact was given to Jayden by Dorotte!”\u003c/p\u003e\n\u003cp\u003eLeylin could not help but be a little envious. He previously owned a magic artifact too, but unfortunately, it had been broken and was used in the transaction for applying to the academy. With these conditions now, it would be extremely difficult to obtain another one.\u003c/p\u003e\n\u003cp\u003eLeylin looked at the goods on display as he walked towards the centre of the trading post.\u003c/p\u003e\n\u003cp\u003eThere were a few wooden huts here, and they seemed to have higher standards compared to the surroundings. The acolytes who occasionally walked in and out radiated strong energy waves.\u003c/p\u003e\n\u003cp\u003eLeylin casually walked into a shop selling potions.\u003c/p\u003e\n\u003cp\u003e“What do you need?” The shop owner was a fatty and wore a grey robe. He looked to be a little lazy. According to the readings of the A.I. Chip, he was also a level 3 acolyte and even carried a magic artifact.\u003c/p\u003e\n\u003cp\u003e“I need a set of equipment so that I can practice brewing potions!” Leylin said unhurriedly.\u003c/p\u003e\n\u003cp\u003e“Another one who is dreaming! And it’s actually a level 1 acolyte who wants to try brewing potions! You think you’re Merlin?” The fatty scolded him.\u003c/p\u003e\n\u003cp\u003e“Excuse me, Merlin is my senior and we have the same mentor!” Leylin replied.\u003c/p\u003e\n\u003cp\u003e“So it’s like this! It turns out you’re Kroft’s apprentice, so already brewing potions at this stage is understandable, it is understandable!” The fatty’s face seemed to be filled with spirit, “So you’re Merlin’s junior, hello, I am Woox!”\u003c/p\u003e\n\u003cp\u003eThe fatty introduced himself, and there was a cunning expression on his face, “Rather than potion brewing, if you are able to get me some of Merlin’s potions, I will give a good price for them. Of course, if they were made by Professor Kroft, it would be even better……”\u003c/p\u003e\n\u003cp\u003e“My apologies! Professor Kroft’s potions are impossible! As for Merlin’s, I’ll give it a try!” Leylin rolled his eyes, but he did not reject him outrightly.\u003c/p\u003e\n\u003cp\u003e“Now, can you give me an introduction of the apparatus?”\u003c/p\u003e\n\u003cp\u003e“Oh! Of course! Of course!” The fatty rubbed his hands and placed a few sets of glass apparatus on the wooden table.\u003c/p\u003e\n\u003cp\u003e“There is all of this! They are second hand, but they are still usable. I recommend this set; it’s from a level 3 acolyte that did not want it anymore!”\u003c/p\u003e\n\u003cp\u003eThe fatty took out an apparatus set which included beakers, a glass rod, a petri dish, test tubes, and a set of pale yellow tools. It seemed rather complete.\u003c/p\u003e\n\u003cp\u003eLeylin examined the equipment with his hands.\u003c/p\u003e\n\u003cp\u003eAccording to the analysis of the A.I. Chip, the quality of this apparatus set was average, but it was enough for him to use.\u003c/p\u003e\n\u003cp\u003e“I’ll take this one then! How many magic crystals?” Leylin asked.\u003c/p\u003e\n\u003cp\u003e“Two pieces!” The fatty replied.\u003c/p\u003e\n\u003cp\u003e“Wrap it well for me!” Leylin handed the two magic crystals over to the fatty. Fatty received them and packaged the set before handing it over to Leylin.\u003c/p\u003e\n\u003cp\u003e“Do you have any elementary potion formulas?” Leylin placed the bundle on his back and asked again.\u003c/p\u003e\n\u003cp\u003e“Yes! I have formulas for strength potions, hemostatic Potions, and bug removal potions, which one do you want?”\u003c/p\u003e\n\u003cp\u003e“The strength potion!” These were all elementary potion formulas, so Leylin simply picked one.\u003c/p\u003e\n\u003cp\u003e“Give me a set of ingredients as well!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-24\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-26\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-25","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
