{"id":58814,"no":258,"title":"Chapter 258","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAccomplishment\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Prepare the centrifuge! Beginning cooperation…”\u003c/p\u003e\n\u003cp\u003eLeylin shut his eyes, and black threads shot out from between his brows, connecting to the various apparatus in the laboratory.\u003c/p\u003e\n\u003cp\u003e*Ka-cha! Ka-cha!*\u003c/p\u003e\n\u003cp\u003eThe light flickered, and the apparatus in the laboratory were activated. Any instrument that had a measuring function began to show numbers and pointers on gauges moved.\u003c/p\u003e\n\u003cp\u003eWith the threads of spiritual force, Leylin worked on purifying his spiritual force and began the complicated separation process.\u003c/p\u003e\n\u003cp\u003eTwo hours later, Leylin looked at the half-finished product on the table and nodded.\u003c/p\u003e\n\u003cp\u003eOn the surface of the table was a piece of pink flesh.\u003c/p\u003e\n\u003cp\u003eThis had been the fossil of the Thousand Eyed Starfish. Leylin had fully expended the life force within it and had gotten rid of all the olive-coloured eyes.\u003c/p\u003e\n\u003cp\u003eThere was a very troublesome poison held within the eyes of the Thousand Eyed Starfish, and as such, they needed to be removed.\u003c/p\u003e\n\u003cp\u003eThe Thousand Eyed Starfish currently seemed to have returned to its original state, the tender flesh having a gleaming luster, as if it had only just been dug out, and was still covered in a layer of liquid.\u003c/p\u003e\n\u003cp\u003e“Yes! The separation operation was very successful! All that’s left is the last step.”\u003c/p\u003e\n\u003cp\u003eLeylin took out the grey-black, high-grade Reactive Potion, of which only half remained. He poured all of it onto the pink flesh.\u003c/p\u003e\n\u003cp\u003e*Tss tss!*\u003c/p\u003e\n\u003cp\u003eThe moment the grey-black potion was poured onto the flesh, large amounts of steam were produced. Through it, one could see the pink flesh decreasing in size at a rate that could be seen with the human eye. The flesh seemed to shrivel up and turn black.\u003c/p\u003e\n\u003cp\u003eLeylin expressionlessly used up all the liquid, and then chanted some ancient incantations.\u003c/p\u003e\n\u003cp\u003e“Wu wu wu…” These incantations were ancient, with a very boundless aura. It sounded like countless conch shells being blown at the same time. Blue waves of energy were like sweeping tides, wrapping around the flesh of the Thousand Eyed Starfish...\u003c/p\u003e\n\u003cp\u003eAfter the blue light dissipated, all that was left was an object the size of a longan.\u003c/p\u003e\n\u003cp\u003eThe object was grey in colour and even had lines that characterized muscle. It looked like salt-cured meat that had not been properly preserved.\u003c/p\u003e\n\u003cp\u003eThe salty meat began to emit the smell of something burning.\u003c/p\u003e\n\u003cp\u003e*Rumble!*\u003c/p\u003e\n\u003cp\u003eUpon smelling this, Leylin actually couldn’t help but swallow his saliva, a distinct look of longing appearing from the depths of his heart.\u003c/p\u003e\n\u003cp\u003e“Eat it! Eat it!”\u003c/p\u003e\n\u003cp\u003e“Hungry! Hungry! Hungry!”\u003c/p\u003e\n\u003cp\u003eThis thirst seemed to come from every cell in his body. It was extremely difficult to resist, and this feeling was the strongest at his chest, where his heart was.\u003c/p\u003e\n\u003cp\u003eLeylin could feel every blood vessel in his body pumping in excitement, urging him to swallow that piece of flesh on the table!\u003c/p\u003e\n\u003cp\u003e“Ah… haha… Primal desires? How can a mere thing like it control me?”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes turned a little red, and even his hands began to tremble.\u003c/p\u003e\n\u003cp\u003eHowever, he did not choose to consume the flesh of the Thousand Eyed Starfish right away. He first used the A.I. Chip to analyse its composition and nature in detail.\u003c/p\u003e\n\u003cp\u003eDuring this whole time, the meat in his hand was a huge temptation for him. However, even though every cell in his body shook with excitement, his expression stayed the same, as if he was unaffected—as cool and grim as a glacier that had existed for thousands of years.\u003c/p\u003e\n\u003cp\u003eIn his previous life, he had already developed an extremely staunch willpower. No matter how fierce and deadly the temptation, he could still control and stabilise his inner desires.\u003c/p\u003e\n\u003cp\u003e[Recorded composition of this object! Saved in folder: Material type- Ancient Creature- Thousand Eyed Starfish!] The A.I. Chip replied.\u003c/p\u003e\n\u003cp\u003eOnly after the stream of data finished working did Leylin gobble down longan sized meat.\u003c/p\u003e\n\u003cp\u003e*Boom!*\u003c/p\u003e\n\u003cp\u003eLike a bomb that had exploded, his entire body was paralysed by lightning, like a drunkard who had abstained for years and once more had fine liquor, or like a traveler who was on the verge of death from his thirst and had finally savoured the sweet taste of spring water!\u003c/p\u003e\n\u003cp\u003eLeylin felt as if his body was floating, lying on the peak of white clouds. There was joy coming from every cell in his body.\u003c/p\u003e\n\u003cp\u003eAn exceptionally sweet and refreshing feeling spread from his mouth and down his throat.\u003c/p\u003e\n\u003cp\u003eThe flesh of the Thousand Eyed Starfish first went to his stomach. Gastric fluid rushed forward, and in just a few seconds, digested it completely.\u003c/p\u003e\n\u003cp\u003eStreams of water like from a hot spring spread throughout Leylin’s body, and especially his heart was like a person dying of thirst, greedily absorbing this warm flow.\u003c/p\u003e\n\u003cp\u003eLeylin closed his eyes. He felt as if he was naked, flowing along a warm and comfortable large river.\u003c/p\u003e\n\u003cp\u003eA droplet of something moist suddenly rolled down his face. It was exceptionally sweet, exciting his taste buds to the extreme to the point that he unconsciously began to tear up.\u003c/p\u003e\n\u003cp\u003eFor him, who had a physique that far exceeded that of a regular person, it was basically impossible for him to react in such a way, but the flesh of the Thousand Eyed Starfish was able to do it!\u003c/p\u003e\n\u003cp\u003e“I’m afraid such a taste might make one addicted!” Leylin exclaimed in satisfaction.\u003c/p\u003e\n\u003cp\u003eThe process of consuming the Thousand Eyed Starfish was just too comfortable and pleasurable. The stimulation of one’s body and mind was definitely enough to make any regular human addicted!\u003c/p\u003e\n\u003cp\u003eHowever, Leylin was a Magus, and he was basically invulnerable in terms of his mind. His awareness of himself was as strong as steel, which was how he was able to keep ahold of himself and resist this temptation.\u003c/p\u003e\n\u003cp\u003eAt this moment, the robotic voice of the A.I. Chip was heard.\u003c/p\u003e\n\u003cp\u003e[Beep! Detected that the essence from the flesh of the Thousand Eyed Starfish has entered Host’s body. Determined to be useful to Host body! Beginning absorption…]\u003c/p\u003e\n\u003cp\u003eIn that moment, Leylin retreated two steps. He could feel the rate at which he was absorbing the hot stream increase by another level. At the place where his heart was, it was practically a black hole which steadily absorbed the essence.\u003c/p\u003e\n\u003cp\u003e[Beep! Host body has absorbed flesh of the Thousand Eyed Starfish. Rate of modification of host body’s heart has substantially increased.]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip began to work hard, the screen in front of him changing rapidly. Immediately after, Leylin could see in the column that displayed his stats, the number that showed the progress of the modification of his heart flying up quickly.\u003c/p\u003e\n\u003cp\u003e[70%, 75%, 80%, 85%, 90%!]\u003c/p\u003e\n\u003cp\u003eThe number rose like a fiery arrow but faltered slightly at the 90% mark. What came next was an eruption of heat, and the progress broke through 90% to reach 91%, and continued to rise!\u003c/p\u003e\n\u003cp\u003e[97%! 98%! 99%! 100%!!!]\u003c/p\u003e\n\u003cp\u003eWhen the modification of his heart reached 100%, Leylin suddenly felt faint, as if he had been pounded on the head with a large metal hammer.\u003c/p\u003e\n\u003cp\u003e*Bang! Bang! Bang!*\u003c/p\u003e\n\u003cp\u003eHis heart, surrounded by purple-red light, seemed to stop for a while.\u003c/p\u003e\n\u003cp\u003eNext, his heart began to once again pump with a huge amount of force!\u003c/p\u003e\n\u003cp\u003e*Bang! Bang! Bang!*\u003c/p\u003e\n\u003cp\u003eThis force was extremely powerful, to the point that people would be able to hear his heart beating from outside Leylin’s body!\u003c/p\u003e\n\u003cp\u003eBlood that held hints of purplish red began to form at his heart. Through his arteries, they were transported all over his body.\u003c/p\u003e\n\u003cp\u003eThe purplish-red blood, which had a slight chilling quality to it, formed a stark contrast with the heat from the flesh of the Thousand Eyed Starfish.\u003c/p\u003e\n\u003cp\u003eLeylin suddenly felt an overwhelming orgasmic feeling coursing through his body. Minutes later, the heat dissipated, and what replaced it was an extremely comfortable, refreshing feeling.\u003c/p\u003e\n\u003cp\u003e[Beep! Modification of Host body’s heart is complete. Detection of an increase in all body stats. Beginning recalculation of data!]\u003c/p\u003e\n\u003cp\u003eThe sound of the A.I. Chip’s voice was heard, and Leylin found the column with his stats being refreshed again!\u003c/p\u003e\n\u003cp\u003e[Beep! Leylin Farlier. Rank 1 Warlock, Bloodline: Giant Kemoyin Serpent. Strength: 21.1, Agility: 14.4, Vitality: 27.9, Spiritual Force: 85.6, Magic Power: 85 (Magic Power is in synchronisation with Spiritual Force). Elemental essence conversion: 99%]\u003c/p\u003e\n\u003cp\u003eIn a moment, a feeling of extreme power spread and seeped into his limbs and bones.\u003c/p\u003e\n\u003cp\u003e“After modifying my heart, it means that I have achieved a fusion of the deepest level with the bloodline of the Giant Kemoyin Serpent. Now, it is replacing my blood! In the future, if I have children, they will automatically inherit this Warlock bloodline!”\u003c/p\u003e\n\u003cp\u003eLeylin seemed to sigh, and looked at his stats once again.\u003c/p\u003e\n\u003cp\u003e“Although my strength and agility did not increase by much, my vitality had increased by a large amount, which makes sense! The physical body is a carrier for the mind and spirit. With a rise in spiritual force, it would naturally require an even more sturdy body to support it!”\u003c/p\u003e\n\u003cp\u003eFrom Leylin’s perspective, the body was like a glass, and the spiritual force was like the water in it. The bigger the glass was, the more water and thus, spiritual force it could contain. Conversely, no matter how much water there was, it would be useless if the glass was not large enough to hold it. It might even cause the glass to break.\u003c/p\u003e\n\u003cp\u003eHence, many official Magi would think up ways to strengthen their body to adjust and balance their powerful spiritual force.\u003c/p\u003e\n\u003cp\u003eHowever, what shocked Leylin the most was the rise in his spiritual force and elemental essence conversion.\u003c/p\u003e\n\u003cp\u003e“Spiritual force actually went up to 85.6, and elemental essence conversion is even more terrifying. It actually rose to 99%! I think even ancient elemental beings would just be at this level… With these results, I can try my hand at advancing to become a rank 2 Warlock!”\u003c/p\u003e\n\u003cp\u003eLeylin sighed in contentment.\u003c/p\u003e\n\u003cp\u003eThe requirements for a Warlock to advance was largely similar to a Magus, with the only difference being requirements in the bloodline.\u003c/p\u003e\n\u003cp\u003eLeylin’s current bloodline was directly from the ancient creature, the Giant Kemoyin Serpent, so there was definitely no problem at all. The conditions to advance to become a rank 2 Magus was for one’s spiritual force to reach 80, and one’s elemental essence conversion to be above 80%!\u003c/p\u003e\n\u003cp\u003eThese were the basic requirements to be promoted to be a rank 2 Magus.\u003c/p\u003e\n\u003cp\u003eIn terms of spiritual force, many Magi were able to reach it. However, they were often stuck in terms of their elemental essence conversion and were hence unable to proceed further.\u003c/p\u003e\n\u003cp\u003eThere were also ambitious people like Caesar and Decarte who had reached the requirements to advance but had not done so. They wanted to push their elemental essence conversion to above 90% to build a stronger foundation and pave the way for their future!\u003c/p\u003e\n\u003cp\u003eNot only had Leylin currently exceeded the basic requirements in spiritual force, but his elemental essence conversion had even reached the shocking number of 99%!\u003c/p\u003e\n\u003cp\u003eBesides ancient elemental beings that were made of elemental particles, there was nothing that could have a higher percentage than this.\u003c/p\u003e\n\u003cp\u003eLeylin was a being made of flesh and blood, rather than elemental particles. To be able to reach 99% was basically reaching the extremes of his limits.\u003c/p\u003e\n\u003cp\u003eHe was extremely clear about this and did not look to increase it any further.\u003c/p\u003e\n\u003cp\u003e“With the bonus from my bloodline, all of my body’s stats far exceed that of a regular Magus. Now, my elemental essence conversion has even reached 99%. Even in the entire south coast, I doubt that there’s a rank 1 Magus who’s stronger than me.”\u003c/p\u003e\n\u003cp\u003eLeylin was extremely clear of his ranking.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-257\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-259\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-258","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
