{"id":58830,"no":274,"title":"Chapter 274","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eInformation Gathering\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“An important treasure? What is it?”\u003c/p\u003e\n\u003cp\u003eLeylin had now changed his appearance to that of a middle-aged man. As he stared hard at the human figure made entirely out of black fog, discontent appeared on his face.\u003c/p\u003e\n\u003cp\u003e“We don’t know either, but it’s definitely extremely valuable and has to be very tempting for rank 2 Magi. Upon seeing that treasure, Alistair betrayed the Light Magi Alliance without any qualms and plotted against Alex and Juna, and then snatched it away.”\u003c/p\u003e\n\u003cp\u003eThe voice of the person in the black fog was very hoarse and its body seemed to be on the verge of disappearing at any moment.\u003c/p\u003e\n\u003cp\u003e“Alright. One last question—Where is he now?” Leylin heaved a long sigh and asked.\u003c/p\u003e\n\u003cp\u003e“I’m not sure. Somebody seemed to have found traces of him in Nightless City. We made a conjecture of where he’s going, and he’s probably fleeing towards the Endless Ocean…”\u003c/p\u003e\n\u003cp\u003eUpon hearing this answer, Leylin shook his head.\u003c/p\u003e\n\u003cp\u003eThe Endless Ocean was on the east side of Nightless City, and was in the complete opposite direction from the Brambles Iron Door. Even if he were to chase after him right now, he would not make it in time.\u003c/p\u003e\n\u003cp\u003eAlso, to dispatch a large number of people for a piece of news that he was still unsure whether it was genuine was simply not worth it!\u003c/p\u003e\n\u003cp\u003eThere were definitely a lot of Magi after Alistair. There were even rumours of a rank 3 Magus around, and Leylin was not going to participate.\u003c/p\u003e\n\u003cp\u003eHe himself was a significant fugitive as well!\u003c/p\u003e\n\u003cp\u003e“Do you have any more questions?” The figure in the fog asked.\u003c/p\u003e\n\u003cp\u003e“No!” Leylin got up to leave this room.\u003c/p\u003e\n\u003cp\u003e*Clang!* The large door rumbled as it closed shut, and the room sunk into darkness while the figure in the fog gradually dissipated..\u003c/p\u003e\n\u003cp\u003e“Dear customer, you have asked a total of two 4 A level and 3 B level questions. The total cost comes to…”\u003c/p\u003e\n\u003cp\u003eAfter Leylin walked out, a woman dressed in a revealing manner emerged, swinging her enchanting hips. She looked like the boss of a pub.\u003c/p\u003e\n\u003cp\u003eA pair of ample breasts were almost pressed onto Leylin’s chest.\u003c/p\u003e\n\u003cp\u003e“Alright, I understand!” Leylin seemed to be provoking her as he smiled, and a small black pouch with gold edges made a long arc in the air and accurately fell between the female boss’ ample breasts, causing her to pout playfully.\u003c/p\u003e\n\u003cp\u003eAfter rejecting her intentions and attempts to make him stay, Leylin quickly left.\u003c/p\u003e\n\u003cp\u003e*Hualala!* The bricks on both sides of the door shifted, revealing a secluded and dirty pathway. A distance away the sounds of Magi clamouring could be heard.\u003c/p\u003e\n\u003cp\u003eLeylin turned back, only to find that the door had already vanished without a trace.\u003c/p\u003e\n\u003cp\u003eThere was only a regular wall there, and the place where he had first entered was completely different from where he was now.\u003c/p\u003e\n\u003cp\u003eThese Magi organisations that sold information as a living usually had a perfect mastery over methods in concealing themselves. Leylin could guarantee that their entrance at the Brambles Iron Door was definitely one of many others, and it was impossible to find out where their headquarters were from these entrances.\u003c/p\u003e\n\u003cp\u003eEven this female boss was not easily dealt with! Leylin rubbed his fingers and left with a smile about his face.\u003c/p\u003e\n\u003cp\u003eAfter Leylin left, in the place where the trade had taken place, the female boss’ face changed and she collapsed onto a sofa, revealing her beautiful curves.\u003c/p\u003e\n\u003cp\u003eAt the same time, the immense spiritual force that did not lose out to a peak rank 1 Magus was gradually exhibited.\u003c/p\u003e\n\u003cp\u003eThis female boss was actually a peak rank 1 Magus! Even in the entire south coast, such strength could be enough to awe or intimidate anyone!\u003c/p\u003e\n\u003cp\u003eNow, however, cold sweat rolled down her face.\u003c/p\u003e\n\u003cp\u003e“How terrifying! This spiritual force…” The female boss patted her chest, fear still lingering in her heart, “He’s definitely a powerful rank 2 existence! Why is he here?”\u003c/p\u003e\n\u003cp\u003eShe could sense Leylin’s probing at the beginning, and in actuality if not for Leylin holding back at the end, she would definitely be in a worse state.\u003c/p\u003e\n\u003cp\u003eThe alluring female boss lay on her sofa for a while longer, thoughts rapidly running through her mind. All of a sudden, her expression changed.\u003c/p\u003e\n\u003cp\u003e“Could it be that he’s here because he received that information as well?”\u003c/p\u003e\n\u003cp\u003eImmediately, she paled and murmured in a low voice, “It’s getting harder and harder to do business here. This is not good! I need to leave as soon as possible! These kind of things happens every two or three days. I can’t take it any longer!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eLeylin, who was elsewhere, was also recalling the whole matter.\u003c/p\u003e\n\u003cp\u003eStrictly speaking, this matter did have a connection to him.\u003c/p\u003e\n\u003cp\u003eAfter he had destroyed one of the gates into the secret plane, some mechanism seemed to have been triggered and resulted in the mysterious changes in the Eternal River Plains’ secret plane.\u003c/p\u003e\n\u003cp\u003eA huge ruin had appeared at the heart of the secret plane.\u003c/p\u003e\n\u003cp\u003eOverjoyed at the unexpected good fortune, the dark and light Magi broke out in battle and, after much difficulty, settled on an agreement and developed this place.\u003c/p\u003e\n\u003cp\u003eThe light and dark Magi had put in a lot of effort in their exploration!\u003c/p\u003e\n\u003cp\u003eThese were the remnants left behind by the Magus who had created the secret plane! If there was a possibility of gaining some inheritance, then who wouldn’t jump at the chance?\u003c/p\u003e\n\u003cp\u003eThe light and dark Magi immediately dispatched their elites and teams that were headed by at least rank 2 Magi entered and explored the ruins.\u003c/p\u003e\n\u003cp\u003eIn this exploration, Alistair, Alex and Juna’s three teams worked together and overcame a few difficulties. It seemed like they had obtained some incredible item.\u003c/p\u003e\n\u003cp\u003eThis treasure seemed to be an amazing item effective for rank 2 Magi. Alistair had chosen to betray his teammates for this item, and after dealing with Alex and Juna on the sly, he had swept up the treasure and fled!\u003c/p\u003e\n\u003cp\u003eUpon receiving this news, dark Magi immediately attacked, and this had serious repercussions on the light Magi’s end. Not only had two rank 2 Magi died, even the corps that were guarding the area outside the ruins were attacked. At least three corps had been systematically annihilated.\u003c/p\u003e\n\u003cp\u003eEver since that matter, the dark and light Magi in the south coast were in a tense situation.\u003c/p\u003e\n\u003cp\u003eThough the light Magi had had the upper hand previously, it was not as if the dark Magi were completely powerless. The difference in their might was not very big.\u003c/p\u003e\n\u003cp\u003eNow, in the span of a few months, including Alistair, the Light Magi Alliance had lost a total of four rank 2 Magi!\u003c/p\u003e\n\u003cp\u003eThis definitely had an effect on the ratio of the power between the two factions. Though there were no losses in terms of their rank 3 Magi, which were the strongest they had, the dark Magi were starting to become restless.\u003c/p\u003e\n\u003cp\u003eOf course, this had nothing to do with Leylin. He was mostly attracted by that mysterious treasure.\u003c/p\u003e\n\u003cp\u003e“What could it be that would cause a rank 2 Magus to betray his faction and even plot against his companions?”\u003c/p\u003e\n\u003cp\u003eTraces of red appeared in Leylin’s eyes, and there seemed to be a voice inside shouting, “Snatch! Snatch it! Snatch the treasure!”\u003c/p\u003e\n\u003cp\u003eA desire that he could feel deep inside his bones invaded Leylin’s senses.\u003c/p\u003e\n\u003cp\u003e“Hm? That’s weird! When did I become so irrational?” Leylin’s expression changed and he grimly looked at the crystal at his wrist.\u003c/p\u003e\n\u003cp\u003eThe crystal at his wrist was currently emitting a circle of red rays, looking about to drip fresh blood.\u003c/p\u003e\n\u003cp\u003e“The situation is getting worse!” An imposing look flashed by his eyes, and he opened a flask and drank from it.\u003c/p\u003e\n\u003cp\u003e*Gulp! Gulp!*\u003c/p\u003e\n\u003cp\u003eLarge amounts of liquid that had a medicinal taste to it travelled down his throat, and Leylin’s expression seemed to calm down.\u003c/p\u003e\n\u003cp\u003eAs time passed, the rays from the crystal dimmed, and it turned into a transparent, colourless crystal.\u003c/p\u003e\n\u003cp\u003e“It’s getting increasingly serious…”\u003c/p\u003e\n\u003cp\u003eLeylin kept the crystal and a solemn expression appeared on his face.\u003c/p\u003e\n\u003cp\u003eAfter drinking the potion he had brewed, Leylin could feel his spirit becoming tranquil, the impulse from before vanishing.\u003c/p\u003e\n\u003cp\u003e“The effects of being a warlock are really troublesome to deal with!”\u003c/p\u003e\n\u003cp\u003eLeylin furrowed his brows. After his heart had been modified such that he had completely fused with the bloodline of the Giant Kemoyin Serpent, Leylin could feel that the intense emotions due to the bloodline, which he had suppressed with this potion of tranquility, were now beginning to stir restlessly.\u003c/p\u003e\n\u003cp\u003eAfter advancing to become a rank 2 Warlock, this situation had become increasingly serious.\u003c/p\u003e\n\u003cp\u003eLeylin now had no choice but to set up an early warning spell design on his wrist. This colourless crystal was a ward that Leylin had set up. The moment bloodline-induced emotions began to affect his rationality; the crystal would immediately emit blood-red rays.\u003c/p\u003e\n\u003cp\u003eThe graver this issue was, the more piercing the red rays on the surface of the crystal would be.\u003c/p\u003e\n\u003cp\u003eLeylin now had no choice but to prepare potions of tranquility and keep it at hand, occasionally drinking some to prevent the emotions from affecting his mind.\u003c/p\u003e\n\u003cp\u003eAfter all, for him to be able to come so far, the A.I. Chip was an important factor, the other being a clear mind.\u003c/p\u003e\n\u003cp\u003eIf he lost this factor, no matter how powerful he became, it would simply be a tragedy.\u003c/p\u003e\n\u003cp\u003e“These emotional issues of warlocks were definitely complications in ancient times. Though the great Magus Serholm had come up with this potion of tranquility, it can only treat the symptoms but not the root cause. I need to find a way that can permanently deal with it.”\u003c/p\u003e\n\u003cp\u003eLeylin looked grim.\u003c/p\u003e\n\u003cp\u003e“As for that Alistair, it’s not my place to think about that. Also, he’s so much further away…”\u003c/p\u003e\n\u003cp\u003eAfter regaining a clear mind, Leylin touched his chin.\u003c/p\u003e\n\u003cp\u003e“Of course, If he’s so blind as to offend me, then that’s a different matter altogether.”\u003c/p\u003e\n\u003cp\u003eAfter thinking this through, Leylin wore his hood once more and left this deserted alley.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA few hours later, Leylin emerged from a large building that had been built using gold and silver, a helpless look on his face.\u003c/p\u003e\n\u003cp\u003eBehind him, a Magus that seemed to be the owner was watching him leave, an apologetic expression on his face.\u003c/p\u003e\n\u003cp\u003eThis was one of the top three commerce centres in the Brambles Iron Door, and Leylin had just purchased some items.\u003c/p\u003e\n\u003cp\u003eIt was a pity that besides replenishing a few frequently used materials, there was no mention of the long distance detection spell that Leylin had been hoping to obtain.\u003c/p\u003e\n\u003cp\u003eAs for a method to solve the warped emotions from his Warlock bloodline? Leylin didn’t even bother asking about it.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-273\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-275\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-274","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
