{"id":58847,"no":291,"title":"Chapter 291","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eTreasure \u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAs if baffled by the kind smile on Leylin’s face, this acolyte mustered up his courage and asked, “My lord! Are you… perhaps, not from here? May this humble servant know what your name is? I… I am Aaron!”\u003c/p\u003e\n\u003cp\u003e“Me? I’m obviously not from around here!” Leylin laughed as he looked at these 3 acolytes.\u003c/p\u003e\n\u003cp\u003e“Though there are still a lot of things I’d like to ask you, I suddenly realised that it would be much faster if I were to see it for myself…”\u003c/p\u003e\n\u003cp\u003eDue to the look that Leylin was giving them, the 3 acolytes began to tremble, as if they were being stared at by some predator.\u003c/p\u003e\n\u003cp\u003e“Let’s go!” Aaron yelled, getting in front of the two female acolytes and chanting incantations.\u003c/p\u003e\n\u003cp\u003e“What a joke! You’re too slow!” Leylin shook his head, and three black streams of air shot out and entered the foreheads of the three acolytes.\u003c/p\u003e\n\u003cp\u003eThey turned dizzy, and without being able to even make a sound, they fainted.\u003c/p\u003e\n\u003cp\u003eLeylin approached the male acolyte called Aaron, his right hand directly pressing on the top of his head. The acolyte’s eyes turned jet black, and even his pupils vanished.\u003c/p\u003e\n\u003cp\u003eLarge amounts of images and voices were like a video, replaying in front of Leylin’s eyes. The A.I. Chip worked at full speed, gathering all the information it thought to be important and organised them.\u003c/p\u003e\n\u003cp\u003eThis was a spell that was like searching through one’s spirit. It allowed Leylin to look through the memories of lower ranked Magi.\u003c/p\u003e\n\u003cp\u003eHowever, this spell was not actually all that useful. It was only effective against beings weaker than official Magi, and the targets couldn’t be resisting.\u003c/p\u003e\n\u003cp\u003eWhen Leylin had first seen this technique in the library at the Four Seasons Garden, he had merely gotten the A.I. Chip to record it in passing. Unexpectedly, he was able to find a use for it here.\u003c/p\u003e\n\u003cp\u003eThough it was a simple task for him to sneak into this little team and gain information with all the methods he had, Leylin couldn’t be bothered to do all that. He didn’t want to waste time either.\u003c/p\u003e\n\u003cp\u003eIn addition, no matter how hard he tries to conceal it, there were many differences between magicians of the south coast and this subterranean world. This wasn’t something that could be easily covered up with acting. Rather than being considered suspicious when the time came, it would be better to do something about it right now.\u003c/p\u003e\n\u003cp\u003e[Gathering information regarding subterranean language, named the ‘Twilight Language’. Storing in database…] The A.I. Chip first collected information regarding the language. It would organise these data and transmit it to Leylin’s memories. After some practice, Leylin would be able to quickly grasp the language used in this world.\u003c/p\u003e\n\u003cp\u003eNext was information regarding the geography and factions here.\u003c/p\u003e\n\u003cp\u003eThough Aaron was weak and had never left the Twilight Zone, his memories had been enough to allow Leylin to gain a better understanding of this subterranean world.\u003c/p\u003e\n\u003cp\u003eAfter he had gathered all of the valuable information, a cold glint flashed in Leylin’s eyes and he forcefully began to modify Aaron’s memories, removing all traces of his existence and the happenings today. He left behind the false memories of a high-ranked Magus with unclear facial features that had suddenly appeared and had helped them subdue the Six-Toothed Giant Boar.\u003c/p\u003e\n\u003cp\u003eThese acolytes did not have anything Leylin found useful, and he did not want to kill anymore.\u003c/p\u003e\n\u003cp\u003eIn a situation where he would not suffer any negative consequences, Leylin didn’t mind doing some good deeds.\u003c/p\u003e\n\u003cp\u003eAfter all, he wasn’t some homicidal maniac who killed people for the fun of it.\u003c/p\u003e\n\u003cp\u003eHowever this method of altering memories carried a very high risk. Leylin paid no heed to Aaron’s original memories and forcefully did it. If there were no aftereffects, his luck must be unbelievably good.\u003c/p\u003e\n\u003cp\u003eAfterwards, Leylin repeated the process on the other four.\u003c/p\u003e\n\u003cp\u003eThough the information he gained was about the same, it created a rather complete set of information.\u003c/p\u003e\n\u003cp\u003e“This Six-Toothed Giant Boar shall be your compensation!” Leylin looked at the acolytes who were unconscious on the ground and laughed. The black ropes that bound the boar suddenly tightened, and splat! Blood flew in all directions!\u003c/p\u003e\n\u003cp\u003eA long time after Leylin left, Aaron woke up while clutching his head, “Ugh… my head hurts… where am I?”\u003c/p\u003e\n\u003cp\u003eNext, fragmented memories entered his mind, scenes appearing in his eyes, “We met a Six-Toothed Giant Boar. That guy, Blake, actually ran away first! We were lucky that a lord who was passing by saved us.”\u003c/p\u003e\n\u003cp\u003eAaron looked at the corpse of the huge Six-Toothed Giant Boar, he whooped with excitement, “How many magic crystals would such a large amount of raw material fetch? I’ve struck the jackpot!”\u003c/p\u003e\n\u003cp\u003e*Hah hah!*\u003c/p\u003e\n\u003cp\u003eFine streams of air streaked past Leylin’s ears, as the scenery around him became long images, before further distorting and forming into streaks of light.\u003c/p\u003e\n\u003cp\u003eLeylin hurried towards Potter Town, recalling the information he had gained from the five.\u003c/p\u003e\n\u003cp\u003eThis was indeed the underworld, and was the first layer, which was the closest to the continent on the earth’s surface. It was a pity that this was but a small region that was disconnected from the rest of the underworld.\u003c/p\u003e\n\u003cp\u003eThe Twilight Zone. This was the name of this region.\u003c/p\u003e\n\u003cp\u003eAround the Twilight Zone, if there weren’t gathering points for fearful, sinister beasts, there would be a wide expanse of a lava ocean. These dangerous regions isolated the Twilight Zone from the external world, and without the power of a Morning Star Magus, it was impossible to escape from the isolation caused by these regions.\u003c/p\u003e\n\u003cp\u003eThe only pathway that connected it with the external world had long since been abandoned.\u003c/p\u003e\n\u003cp\u003eLegends had it that thousands of years ago, there were two Morning Star Magi who had engaged in a great battle near the channel. The resulting fluctuations resulted in the crust of the earth collapsing, and causing terrifyingly large rocks that were almost several hundred million tons to thoroughly seal the channel and stop all communications between Twilight Zone and the external world.\u003c/p\u003e\n\u003cp\u003eIt was for this reason that the Twilight Zone instantly turned into an isolated island. Luckily, the Twilight Zone itself was rather large. Based on Leylin’s estimations, it was about half the size of the south coast. However, the population was only about forty to fifty million. So, the resources were self-sufficient and able to maintain the upkeep till now.\u003c/p\u003e\n\u003cp\u003e“Based on Aaron’s memories, this whole place is called the Twilight Zone, and it can be divided into the East, West, South, North and Central Regions, which makes up five in total. It is governed by regions, and there is no such thing as a kingdom or realm.”\u003c/p\u003e\n\u003cp\u003eFrom Leylin’s perspective, every city here could be said to be an independent power. As land was vast and there were few people, it was no surprise that organisations would flourish and decline quickly. Hence, it was rather chaotic.\u003c/p\u003e\n\u003cp\u003eLeylin was not interested in battles between mortals. What caught his attention was the information regarding the Magus World here.\u003c/p\u003e\n\u003cp\u003eIn the Twilight Zone, the Magus World here had preserved the traditions from the ancient era, still developing through taking in personal disciples and forming schools of thought.\u003c/p\u003e\n\u003cp\u003eAs for academies or anything of the sort, there was no mention of that in Aaron’s memories.\u003c/p\u003e\n\u003cp\u003eAaron and those two female acolytes were taught by a single mentor, and the Grand Knight was an assistant that they had employed while they went on this expedition.\u003c/p\u003e\n\u003cp\u003eHowever, what caused Leylin the most excitement was the information regarding high-grade meditation techniques in Aaron’s memories!\u003c/p\u003e\n\u003cp\u003eThat’s right. In Aaron’s memories, there were mentions of great amounts of high-grade meditation techniques. His mentor had once even promised that if he proved to have enough potential, he could even apply to obtain the qualifications to get a high-grade meditation technique to train in!\u003c/p\u003e\n\u003cp\u003eCompared to the situation in the south coast, where large organisations were very strict regarding this matter, Twilight Zone was evidently much more relaxed regarding the restrictions against obtaining high-grade meditation techniques.\u003c/p\u003e\n\u003cp\u003eThese Magi schools of thought set their foundations on different types of high-grade meditation techniques. Basically, all high-ranked Magi a given organisation would train in a single high-grade meditation technique. The earliest schools of thought were formed from a group of Magi who trained in high-grade meditation techniques, and for the better exchange of ideas, had set up their own organisations.\u003c/p\u003e\n\u003cp\u003e“A high-grade meditation technique!” A flame began to burn in Leylin’s heart.\u003c/p\u003e\n\u003cp\u003eHowever, he quickly came back to himself. The underworld was the most similar to the ancient era and had received much inheritance from the ancient Magi. In addition, with the isolation of the Twilight Zone, the Magi environment here still retained the style of the ancient era. Hence, inheriting high-grade meditation techniques was not unusual.\u003c/p\u003e\n\u003cp\u003e“However, from the fact that a school headed by a rank 2 Magus can be considered a large school of thought, the high-grade meditation techniques must not be that effective. If it isn’t damaged, there might be specific ingredients that cannot be found here.”\u003c/p\u003e\n\u003cp\u003eIn Aaron’s memories, the might of the Magi here in general was similar to that on the south coast. Official Magi were highly regarded and rarely seen. Rank 2 Magi were the big shots; perhaps a few cities in the five zones were under the control of rank 2 Magi.\u003c/p\u003e\n\u003cp\u003e“In general, the Magi here get to encounter even more high-grade meditation techniques. However, since these techniques are the core of every school of thought, besides a few specific people, Magi or acolytes will at most obtain a small part or a simplified version. This was the case for Aaron’s meditation technique.”\u003c/p\u003e\n\u003cp\u003eWhile searching his mind, some memories regarding meditation techniques were naturally recorded by the A.I. Chip.\u003c/p\u003e\n\u003cp\u003eThrough comparisons, Leylin found that the meditation technique Aaron trained in was quite interesting. It had an ancient aura to it, similar to that of Kemoyin’s Pupil and Sacred Flame. However the requirements were all lower, and it did not have the ability to really increase any ability or affinity towards elements.\u003c/p\u003e\n\u003cp\u003eAfter a careful search through Aaron’s memories regarding the meditation technique, Leylin found out that he was training in the high-grade meditation technique from his mentor’s school of thought, Aegalus. It was the simplified form of the Core’s Flame technique.\u003c/p\u003e\n\u003cp\u003eThis simplified version was a lot more effective in raising spiritual force as compared to the willpower runic meditation techniques that acolytes in the south coast used. After reaching a bottleneck in spiritual force, there was a certain probability of passing through the limits to become an official Magus by using items to assist this process. This probability was a lot higher than those who used Grine Water.\u003c/p\u003e\n\u003cp\u003eIn addition, as he trained in the simplified version of a high-grade meditation technique, there would be no problems if he were to obtain a genuine copy of the technique and train in it. Hence, these simplified high-grade meditation techniques were given out to screen acolytes who were suitable for training in it.\u003c/p\u003e\n\u003cp\u003e“A treasure trove! The Twilight Zone is a large treasure trove of high-grade meditation techniques!”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes were suddenly so bright that it was frightening.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-290\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-292\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-291","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
