{"id":58849,"no":293,"title":"Chapter 293","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eOpening A Shop\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe subterranean world was shrouded in darkness.\u003c/p\u003e\n\u003cp\u003eThe towns and cities here where there were sun stones were the areas in which human traffic was high.\u003c/p\u003e\n\u003cp\u003eIn the human cities of the Twilight Zone, the sun stone would be changed every 12 hours to be maintained, and kept the same light conditions as the surface of the earth.\u003c/p\u003e\n\u003cp\u003eHowever, a small area like Potter Town wouldn’t have a high-grade sun stone. At most, it would be the size of an egg.\u003c/p\u003e\n\u003cp\u003eBased on rumours, the larger a sun stone was, the higher its value and better its function was; it was said that at the capital of the five regions, there was a sun stone the size of a small mountain!\u003c/p\u003e\n\u003cp\u003eThe moment a sun stone was lost, the entire area would be engulfed in darkness and surrounded by countless dangers. Hence, at every area populated by humans, the sun stone was always placed in an area with the highest level of security.\u003c/p\u003e\n\u003cp\u003eSeeing the darkness outside the window, Leylin heaved a gentle sigh and pulled the curtains shut.\u003c/p\u003e\n\u003cp\u003eAfter setting up a defensive spell formation, Leylin sat up on the bed and began to meditate.\u003c/p\u003e\n\u003cp\u003eDark red specks of light were pulled out of the air one after another, and gathered at Leylin’s body.\u003c/p\u003e\n\u003cp\u003eIn his sea of consciousness, the silver-white crystals became even more solid, and the slight cracks at the sides seemed to be repairing themselves.\u003c/p\u003e\n\u003cp\u003eAs for the mark, with the seal from Leylin’s solidified spiritual force, that milky-white light had become dimmer. He could tell that in the near future, the mark would be completely destroyed.\u003c/p\u003e\n\u003cp\u003e“It’s going well!” After seeing this, Leylin, who had been on edge this entire time, could finally relax.\u003c/p\u003e\n\u003cp\u003eAfterwards, he collapsed onto the bed and went into a deep sleep.\u003c/p\u003e\n\u003cp\u003eMorning! With the regular pattern from the alarm clock, a ray of light passed through the curtain and entered Leylin’s room.\u003c/p\u003e\n\u003cp\u003e“I finally got some rest!”\u003c/p\u003e\n\u003cp\u003eLeylin opened his eyes, feeling extremely comfortable. The tiredness accumulated from camping outside for a month dissipated with just a single day of rest.\u003c/p\u003e\n\u003cp\u003eThis had to do with his frightening vitality. Even in his heavily injured state, all of his fatigue could be restored with a night’s rest.\u003c/p\u003e\n\u003cp\u003e“Good morning, Sir!”\u003c/p\u003e\n\u003cp\u003eIn the dining area within the inn, the slightly plump boss lady brought oatmeal bread and milk for breakfast, a smile on her face.\u003c/p\u003e\n\u003cp\u003eA few children with sullen, yellow skin and some dust on their face were all gathered at a corner, staring hard at Leylin’s breakfast with desire apparent in their eyes.\u003c/p\u003e\n\u003cp\u003eHowever, they only dared look from afar, gulping down some saliva but not approaching him to beg for some food.\u003c/p\u003e\n\u003cp\u003eWhether it was Leylin’s elegance or his armour, all of it was something that regular people did not possess.\u003c/p\u003e\n\u003cp\u003eThese people usually held a lot of power and a high position. They had once seen someone with a huge hammer use his black hand to crush a child’s head because he was annoyed by him!\u003c/p\u003e\n\u003cp\u003eAfter that incident, that murderer was merely imprisoned by the enforcement team for a few days and subsequently released after paying a fine.\u003c/p\u003e\n\u003cp\u003eHence, these children had a clear understanding of the situation: never provoke anyone with weapons!\u003c/p\u003e\n\u003cp\u003e“Go away! Don’t bother this lord who wants to enjoy his meal!”\u003c/p\u003e\n\u003cp\u003eSeeing these children harrassing her important guest, this lady boss shouted.\u003c/p\u003e\n\u003cp\u003e“It’s alright!” Leylin picked up a slice of oatmeal bread, “Let them have it!”\u003c/p\u003e\n\u003cp\u003e\"Yes, of course! My lord has such a kind heart!”\u003c/p\u003e\n\u003cp\u003eThe plump boss lady’s expression revealed her thought that this was a waste. However, she still tore the bread into several pieces and gave them to the children, “You’re so lucky to have met such a kind-hearted lord! Eat and leave!”\u003c/p\u003e\n\u003cp\u003eThe children quickly stuffed the oatmeal bread into their mouths, the aroma of food spreading inside their mouths. They cupped their hands over their mouths, on the verge of tears.\u003c/p\u003e\n\u003cp\u003eThe children had argued and even almost fought amongst themselves for just a bit of bread.\u003c/p\u003e\n\u003cp\u003eThere was a boy who was a little older than the rest of the group who had kept the oatmeal bread he had received in his clothes, probably to bring it back for someone to eat.\u003c/p\u003e\n\u003cp\u003eThough Grey Spotted Mushrooms could fill one’s stomach, they tasted horrendous.\u003c/p\u003e\n\u003cp\u003eIn addition, not everyone was able to even eat Grey Spotted Mushrooms. From the state of the children’s clothes, they must have come from poor families, and might not have even had decent meals.\u003c/p\u003e\n\u003cp\u003eLeylin merely glanced at them for a moment, and then shifted his focus away.\u003c/p\u003e\n\u003cp\u003eHe tossed out a piece of gold, which flew through the air and fell into the palm of the lady boss’ hand.\u003c/p\u003e\n\u003cp\u003e“I really like Potter Town and wish to settle down here. I also want to open a shop here. Do you know what procedures I have to go through?”\u003c/p\u003e\n\u003cp\u003eUntil his injures completely healed and he regained his strength as a rank 2 Magus, Leylin decided to temporarily live in seclusion.\u003c/p\u003e\n\u003cp\u003eHe had a long life anyway and could afford to waste this bit of time.\u003c/p\u003e\n\u003cp\u003e“You want to open a shop here?” The lady boss was shocked, “What kind of shop do you want to open?”\u003c/p\u003e\n\u003cp\u003e“What do you think of a weapons shop?”\u003c/p\u003e\n\u003cp\u003eLeylin spoke nonchalantly. The purpose of this was to have a cover while he analysed the long sword of the Rays of Dawn. Hence, he had chosen a weapons shop.\u003c/p\u003e\n\u003cp\u003eHe could clearly see that the Woody Wastelands was near Potter Town, and was an area where adventurers would go to. It wasn’t a bad idea to make and sell some weapons here, and it would definitely be profitable.\u003c/p\u003e\n\u003cp\u003e“A weapons shop…” The boss lady hesitated, “My lord, you’ll need to go through the department of internal affairs and the guards. Also, weapons are restricted items, so you’ll need to get approval from the capital and Joseph…”\u003c/p\u003e\n\u003cp\u003e“I see.” Leylin stroked his chin, and asked where the department of internal affairs, guard post and the baron’s residence were before leaving the inn.\u003c/p\u003e\n\u003cp\u003eIn just a few days, a weapons shop called “Blazing Hammers” covertly opened on the commerce street in Potter Town.\u003c/p\u003e\n\u003cp\u003eFor others, it might be a little troublesome to go through so many procedures, but Leylin was a Magus. With just some spells to confuse the target or alter memories, a lot of issues could be solved.\u003c/p\u003e\n\u003cp\u003eBesides, he could afford to spend a lot of money, so the opening of the shop was obviously a smooth sailing process.\u003c/p\u003e\n\u003cp\u003eThe shop took up a large amount of space. At the front was the counter and shop, and behind was the storeroom and smelting room, as well as the rooms of Leylin and a few workers.\u003c/p\u003e\n\u003cp\u003eThe moment one entered, they would see sharp weapons displayed on the wooden shelves lining two walls, glinting in the light. An icy feeling spread in the room.\u003c/p\u003e\n\u003cp\u003e“This is a first-rate steel weapon!”\u003c/p\u003e\n\u003cp\u003eA huge man who dressed like a mercenary entered immediately attracted to a large steel sword.\u003c/p\u003e\n\u003cp\u003e“This tempering technique is usually only found in a few large weapon shops!” The huge man caressed the sword, the silvery blue luster at the edges causing his eyes to be fixated on it.\u003c/p\u003e\n\u003cp\u003eThe price marked on the shelf almost had him biting his tongue, “Fifty gold! This really is the price that would be found in the capital! But this is just a small town…”\u003c/p\u003e\n\u003cp\u003eThe people in the Twilight Zone naturally had their own currency. The gold and silver used here were even more valuable than that of the south coast, and the currency was completely different.\u003c/p\u003e\n\u003cp\u003eIn order to help mask his identity, the gold and silver pieces that Leylin used were actually the money he had gained from the south coast, the shapes of which he had forcefully changed to match the currency used here.\u003c/p\u003e\n\u003cp\u003e“What would you like?”\u003c/p\u003e\n\u003cp\u003eAn intelligent-looking young man wearing the uniform of an attendant, who Leylin had hired, quickly asked with a smile.\u003c/p\u003e\n\u003cp\u003e“That sword is too expensive!”\u003c/p\u003e\n\u003cp\u003eThe large man waved the sword around for a while, reluctant to part with it. “Can it be cheaper?”\u003c/p\u003e\n\u003cp\u003e“My apologies!” He had an apologetic smile on his face. “Our shop does not allow bargaining. This is a rule set by our boss!”\u003c/p\u003e\n\u003cp\u003eThe large man’s face turned red, and he almost had the urge to cause a ruckus. However, he suppressed it.\u003c/p\u003e\n\u003cp\u003eThose who could make a living off of selling weapons usually had very powerful backgrounds; he wasn’t planning on dying just for this.\u003c/p\u003e\n\u003cp\u003eIn addition, the shop owner wasn’t any regular person either. It was said that he was an adventurer of noble blood who had retired. Not only had he taken care of the department of internal affairs and the guards with an insane speed, even the baron had treated him as an important guest.\u003c/p\u003e\n\u003cp\u003eWhat was even more shocking was that the shop owner had a terrifying might that far exceeded that of the average adventurer.\u003c/p\u003e\n\u003cp\u003eThis man had personally witnessed the young, black-haired shop owner take care of a few thugs, who wanted to extort protection fees, in a few seconds. They had subsequently been taken away by the guards, who had been informed and had arrived very quickly.\u003c/p\u003e\n\u003cp\u003eIt was said that their fate was to become a labourer until their deaths!\u003c/p\u003e\n\u003cp\u003eThese methods had intimidated a lot of people; after caressing the sword for a long time, as if it were his wife, the large man eventually reluctantly left.\u003c/p\u003e\n\u003cp\u003eBefore leaving, he even had the young man reserve the sword, saying that he would return once he had enough money.\u003c/p\u003e\n\u003cp\u003eThat night, after the last customer had left, the young man closed up and went to the room at the back.\u003c/p\u003e\n\u003cp\u003e*Knock knock!*\u003c/p\u003e\n\u003cp\u003e“Boss, can I come in?” The young man tried to make his voice sound calm.\u003c/p\u003e\n\u003cp\u003eEvery time he saw his boss, he felt like he would suffocate. The imposing aura from his new boss was too intense; the young man swore that he had once seen a real count, but even he had lacked the elegance and dignified aura this man exuded.\u003c/p\u003e\n\u003cp\u003e“Perhaps my boss really is the successor of a very ancient noble family, and is merely experiencing the life here!” The young man thought in his heart, before thinking it funny. He was imagining the wildest of fantasies.\u003c/p\u003e\n\u003cp\u003e“Is it Baelin? Come in!” A very youthful voice sounded.\u003c/p\u003e\n\u003cp\u003eBaelin composed himself, opened the door and entered.\u003c/p\u003e\n\u003cp\u003eIn the room, a handsome man in a loose robe was lying on a soft chair, occasionally drinking a beverage with peppermint mixed into it. He even had a huge black book in his hands.\u003c/p\u003e\n\u003cp\u003eHe was literate and had books! This was the biggest sign of nobility in the Twilight Zone!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-292\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-294\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-293","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
