{"id":58850,"no":294,"title":"Chapter 294","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eMeteor Sword \u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Baelin! Is anything the matter?”\u003c/p\u003e\n\u003cp\u003eLeylin gazed at the servant the baron had introduced to him and smiled.\u003c/p\u003e\n\u003cp\u003e“No, I’d just like to report the situation in the shop to you!” Baelin tried his best to be less nervous.\u003c/p\u003e\n\u003cp\u003e“Though there are a lot of people who show interest in our shop, boss, your prices… they’re a little too high, so it’s not good for business. I even think our shop will make a loss this month…”\u003c/p\u003e\n\u003cp\u003e“Is that so! I understand. You can go back now!”\u003c/p\u003e\n\u003cp\u003eLeylin waved his hands, looking as if he hadn’t been paying attention.\u003c/p\u003e\n\u003cp\u003e“Alright, you’re the boss! You call the shots!” Upon seeing this, Baelin could confirm that this Lord Leylin was probably a successor from an ancient noble family who was out here to experience life. If not, he definitely wouldn’t be taking things so lightly.\u003c/p\u003e\n\u003cp\u003eAfter Baelin left, Leylin started reading the book in his hands again.\u003c/p\u003e\n\u003cp\u003eOn the yellowed parchment paper, red runes constantly moved like flames.\u003c/p\u003e\n\u003cp\u003e“To make a weapon from the Rays of Dawn is extremely difficult!” Leylin sighed.\u003c/p\u003e\n\u003cp\u003eThe reason why he had opened this shop was to have his own smelting area while he recuperated. He could do some experimentation here.\u003c/p\u003e\n\u003cp\u003eAs for those blades outside? They were only the products made on the side during experimentation.\u003c/p\u003e\n\u003cp\u003eTwo years passed in a blur.\u003c/p\u003e\n\u003cp\u003eThe residents of Potter Town were already used to this Master Leylin, the boss of the weapons shop.\u003c/p\u003e\n\u003cp\u003eLeylin rarely went outside, and barely took care of his weapons shop. Everything was left to Baelin, and he only would occasionally come over to supervise.\u003c/p\u003e\n\u003cp\u003eAs he masked his identity well, nobody found out he was a Magus. At the most, they thought he was a young master from a noble family that was a wastrel.\u003c/p\u003e\n\u003cp\u003eIn time, the words “Blazing Hammers” at the top of the shop were beginning to become mottled and show signs of decay.\u003c/p\u003e\n\u003cp\u003eThe shop still had that lifeless aura to it. Though the weapons were known to be of superior quality, the prices were so expensive that people could only shrink back.\u003c/p\u003e\n\u003cp\u003eLeylin had no plans on relying on this shop to earn money. If the prices were too low, not only would business pick up, the other shops in the same industry would become jealous. Though he wasn’t afraid, Leylin didn’t want to stir up trouble over these small matters.\u003c/p\u003e\n\u003cp\u003e“Brother Baelin! I’m here again!”\u003c/p\u003e\n\u003cp\u003eAlong with the voice, a boy with brown hair walked in through the entrance to the shop. He wore a linen short-sleeved shirt with some patches on it, and his eyes shone with intelligence.\u003c/p\u003e\n\u003cp\u003e“So it’s Longbottom!” Baelin had no choice but to greet him.\u003c/p\u003e\n\u003cp\u003e“Hehe, Brother Baelin, let me help you!” Longbottom snatched the cleaning rag from Baelin’s hands and began to wipe at the wooden shelves and cabinets.\u003c/p\u003e\n\u003cp\u003eHis movements were practiced, and he was very familiar with the places that were often overlooked. Evidently, this was not the first time he was doing this.\u003c/p\u003e\n\u003cp\u003eAfter wiping the shelves and cabinets until they were sparkling clean, Longbottom expectantly looked at Baelin, waiting to be rewarded.\u003c/p\u003e\n\u003cp\u003e“Ugh, not again. Not again!” Baelin held his head, helpless.\u003c/p\u003e\n\u003cp\u003e“I told you! You’re only allowed to use it for five minutes, and you can’t tell anyone about this! You especially can’t let the boss find out!”\u003c/p\u003e\n\u003cp\u003eIf not for this little kid’s beautiful sister, Baelin wouldn’t bother with him.\u003c/p\u003e\n\u003cp\u003e“I know, I know!”\u003c/p\u003e\n\u003cp\u003eLongbottom quickly nodded his head like a chick pecking at rice, and came before a shelf and took out a silver cross blade.\u003c/p\u003e\n\u003cp\u003eThis cross blade was quite short, which was very fitting for Longbottom’s stature. It was about two fingers wide, and the hilt was made from pure silver. There was even a red diamond embedded within, making it seem very luxurious!\u003c/p\u003e\n\u003cp\u003eEvidently, with Longbottom’s financial background, he would definitely not be able to buy it no matter how much he saved up.\u003c/p\u003e\n\u003cp\u003eLongbottom held the cross blade carefully in his hands as if he were clasping some precious treasure.\u003c/p\u003e\n\u003cp\u003e“Hah!”\u003c/p\u003e\n\u003cp\u003eLongbottom slashed forward while holding the blade with both hands, making a crooked attack.\u003c/p\u003e\n\u003cp\u003e“Sigh… Little Longbottom, I’m not trying to be mean, but you’ll never be able to become a knight by learning with those normal soldiers!”\u003c/p\u003e\n\u003cp\u003eBaelin couldn’t help but shake his head. Potter Town was but a small one, and only the guards of the baron were knights. The rest were all made up of peasants, so what power could they have?\u003c/p\u003e\n\u003cp\u003eThis Longbottom had wanted to become a knight from a very young age! For this reason, he would secretly watch the soldiers’ training.\u003c/p\u003e\n\u003cp\u003eAfter discovering this place, he would come over to help free of charge, with the price of having Baelin lend him something in the shop for him to play with for a while.\u003c/p\u003e\n\u003cp\u003eOut of everything in the shop, Longbottom’s favourite weapon was this cross blade.\u003c/p\u003e\n\u003cp\u003e“Brother Baelin, then who should I learn from?” Longbottom held the blade, his expression desolate, “I’m only the son of a regular hunter, and we can’t pay the expensive fees to go through training…”\u003c/p\u003e\n\u003cp\u003eLongbottom had someone in mind.\u003c/p\u003e\n\u003cp\u003eEver since he had found out that the boss of the shop, Master Leylin, was a powerful knight, he was even more diligent in coming over. He might even become like the main characters in stories about knights, having a great talent in this area and ending up with Leylin taking a fancy to him!\u003c/p\u003e\n\u003cp\u003e“Sigh…” Looking at this, Baelin could only sigh. In Twilight Zone, it was extremely difficult for a regular person to become outstanding.\u003c/p\u003e\n\u003cp\u003e“Little Longbottom, I think you should give up on this impossible dream, and come over here to learn how to read from me every day!”\u003c/p\u003e\n\u003cp\u003eBaelin proposed seriously, “Though I don’t know that many letters, it’s enough for you to be able to read the accounts. When the time comes, you’ll be able to find some kind of bookkeeping job.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Brother Baelin!” Longbottom was extremely touched. Even if he wanted to study from someone, he would need to pay an exorbitant fee, yet Baelin was actually willing to teach him for free. This was something that he was very grateful for.\u003c/p\u003e\n\u003cp\u003e“It’s nothing, it’s nothing!” Baelin turned red, “It’s for my own sake too. If boss were to see this, I might not even be able to keep my job…”\u003c/p\u003e\n\u003cp\u003e“See what…”\u003c/p\u003e\n\u003cp\u003eLeylin’s voice sounded, and Baelin was stunned.\u003c/p\u003e\n\u003cp\u003eBaelin stiffly turned back to the sight of Leylin, who had just entered.\u003c/p\u003e\n\u003cp\u003e“Bo- Boss! Why are you here now?” The smile on Baelin’s face was extremely stiff, and he was even stuttering while speaking.\u003c/p\u003e\n\u003cp\u003eHe had let others play with the products in the shop, and that was already a huge offense. Leylin could fire him just like this! However, the pay here was so high to the point that Baelin was not willing to give up this job!\u003c/p\u003e\n\u003cp\u003eBaelin inwardly grumbled. Leylin had always been reclusive, and often stayed in his room or the smelting room, not making himself known for days on end. How could he be so timely today and meet with this sight?”\u003c/p\u003e\n\u003cp\u003e*Thud!*\u003c/p\u003e\n\u003cp\u003eLongbottom’s hands trembled, and the cross blade fell, producing a low thud as it hit the floor.\u003c/p\u003e\n\u003cp\u003e“Mas-Master Leylin!”\u003c/p\u003e\n\u003cp\u003eLongbottom called out while stuttering. For regular people like him, Leylin, the boss of a weapons shop, was an incredible person. Longbottom now felt like a thief who had been caught on the spot, and even his calves began to tremble.\u003c/p\u003e\n\u003cp\u003e“Oh?” Leylin shot a glance at the blade, and smiled at Baelin, “It looks like you’ve been having a lot of fun while I wasn’t around!”\u003c/p\u003e\n\u003cp\u003e“Boss! No, my lord! Please forgive me!” Baelin was so scared that he quickly knelt, while Longbottom’s body was already limp and he was unable to speak.\u003c/p\u003e\n\u003cp\u003e“I’ll settle this matter with you later!” Leylin glared at Baelin and spoke to Longbottom. “Kid, you have been touching the things in my shop as you pleased without gaining permission. How are you going to make it up to me?”\u003c/p\u003e\n\u003cp\u003e“My—My lord…” Longbottom’s teeth chattered and his voice sounded like he was crying. There were only regular people in his family, and they were perhaps even of a lower status to others. What could he give to make it up to Leylin?\u003c/p\u003e\n\u003cp\u003e“Alright! From today onwards, you are to report here and do some odd jobs here for two hours every day as compensation!\u003c/p\u003e\n\u003cp\u003eHaving teased him enough, Leylin touched his chin and made his decision.\u003c/p\u003e\n\u003cp\u003eLongbottom was stunned. What terrified him the most was that Leylin might have wanted him to pay money, and then get the guards to throw him in jail. Odd jobs? What kind of punishment was that?\u003c/p\u003e\n\u003cp\u003e“What are you in a daze like that for? Quick, thank my lord!” Baelin quickly reacted and pressed Longbottom’s head down.\u003c/p\u003e\n\u003cp\u003e“Thank you so much, my lord! Thank you so much!” Longbottom only now reacted, gratitude apparent on his face.\u003c/p\u003e\n\u003cp\u003eTo have a good reason to touch the weapons in the shop was basically a dream for him. He was even able to make a connection to Leylin, a legendary, powerful Knight. It was something he never imagined would happen!\u003c/p\u003e\n\u003cp\u003e“Alright! Come and work here starting tomorrow afternoon!”\u003c/p\u003e\n\u003cp\u003eLeylin nodded, turned, and went to the back of the shop.\u003c/p\u003e\n\u003cp\u003eActually, Leylin had long since noticed Baelin and Longbottom’s actions, but he couldn’t be bothered with them. However, a few of his experiments were going quite well, and he was in a good mood.\u003c/p\u003e\n\u003cp\u003eAfter he entered his room, Leylin thought, “A.I. Chip! How’s the progress of the weapon blueprint simulation?”\u003c/p\u003e\n\u003cp\u003e[Beep! Weapon blueprint simulation: 100%. Completed setup of blueprint and runes!]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip quickly intoned, and then sent an image of a weapon before Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003eThis was a black cross blade that looked to be very ordinary. It could be said to be ordinary to the extreme, but the cross section was filled with lines to loop energy, as well as runes.\u003c/p\u003e\n\u003cp\u003e[Design of exclusive weapon is complete, named “Meteor”] the A.I. Chip’s robotic voice sounded.\u003c/p\u003e\n\u003cp\u003eIn these two years, Leylin had finally completely analysed the middle-grade magical artifact that was the weapon for the Branded Swordsman— the Rays of Dawn. He had combined all his knowledge on smelting and spell formations, in order to create his own exclusive weapon!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-293\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-295\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-294","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
