{"id":58586,"no":30,"title":"Chapter 30","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eExperimenting With Spells\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin and Kaliweir discussed the finer details and then bade farewell to each other.\u003c/p\u003e\n\u003cp\u003eLeylin contemplated deeply before deciding to go on a mission with Kaliweir and his team.\u003c/p\u003e\n\u003cp\u003eHe still had a lot of potions which he did not dare to sell, so he could only seek for alternatives.\u003c/p\u003e\n\u003cp\u003eMoreover, converting the knowledge gained from learning a spell into battle experience requires a continuous process of battling.\u003c/p\u003e\n\u003cp\u003eRegarding battle experience, Kaliweir and his team’s average strength were similar to his and they also came from the same region. Everyone also knew each other beforehand which was naturally better than being with an unfamiliar group of people.\u003c/p\u003e\n\u003cp\u003eFurthermore, Kaliweir has undergone a long period of arduous training and has learnt a lot. Since he could be considered to have an abundant of experience, Leylin was more at ease with his team.\u003c/p\u003e\n\u003cp\u003e“When I master the spell model, my plan is to follow Kaliweir and his team on a mission and accumulate some experience. After that, I’ll leave the academy on my own and seek alternative ways……”\u003c/p\u003e\n\u003cp\u003eReturning back to his dorm, Leylin picked up the Umbra’s Hand spell book.\u003c/p\u003e\n\u003cp\u003eThe yellow cover of the spell book was extremely sturdy like leather, and there were some patterns on it which sent an icy cold feeling from Leylin’s fingertips into his body.\u003c/p\u003e\n\u003cp\u003eThe book was tightly bound by a metal chain and the ends were clipped in the fashion of a belt.\u003c/p\u003e\n\u003cp\u003e“Learning the Umbra’s Hand requires research in Shadow energy and Evocation. I’ve learned both long ago!”\u003c/p\u003e\n\u003cp\u003eVia selling potions, Leylin continuously improved his knowledge by acquiring advanced information on the Shadow element and studying them.\u003c/p\u003e\n\u003cp\u003e“The incantation for opening it – Mansidala!” Leylin spoke in a low voice.\u003c/p\u003e\n\u003cp\u003eAfter hearing the incantation, the book suddenly trembled and, amidst the trembling, the black chains automatically untied by themselves and the pages started to flip through.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, begin recording the information!”\u003c/p\u003e\n\u003cp\u003eLeylin continuously looked at the spell book containing the model of Umbra’s Hand. Only after quickly flipping through it once and hearing the notification from the A.I. Chip that it had fully recorded the content, did he put the book down.\u003c/p\u003e\n\u003cp\u003e“The construction of a spell model is the foundation for a Magus to cast spells. This process includes a series of complex variation as well as the precise construction of the spell model itself. To learn a spell, 3 months is needed at the very least!”\u003c/p\u003e\n\u003cp\u003eAs he learned of the difficulty for a Magus to cast spells, Leylin sighed. Without the A.I. Chip, he could only learn to cast spells after countless attempts and failures.\u003c/p\u003e\n\u003cp\u003e[The recording of data is finished, beginning analysis!] The A.I. Chip’s voice sounded.\u003c/p\u003e\n\u003cp\u003e“How long will it take?”\u003c/p\u003e\n\u003cp\u003e[Estimated time taken: 106 Hours 32 Minutes!]\u003c/p\u003e\n\u003cp\u003e“106 Hours 32 Minutes! That is the equivalent of four to five days, this speed is extremely fast!” Leylin nodded his head.\u003c/p\u003e\n\u003cp\u003eHe stood up, patted his body, and placed the two spell books away neatly.\u003c/p\u003e\n\u003cp\u003eHe then walked to one side of his dorm. Originally, this section was utilised for reception or other uses but Leylin changed it into a mini experiment lab for potion brewing.\u003c/p\u003e\n\u003cp\u003eAlthough it was rather dangerous to experiment here, with the A.I. Chip he could guarantee that nothing would go wrong.\u003c/p\u003e\n\u003cp\u003e“I’m going on a mission in a few months’ time! I better focus on brewing a few potions as preventive measures for sudden events!”\u003c/p\u003e\n\u003cp\u003eLeylin lit a candle and begun his potion brewing.\u003c/p\u003e\n\u003cp\u003eThe education system in Abyssal Bone Forest Academy was rather loose. From what Leylin saw, it was most similar to the ancient times of one teacher to one student.\u003c/p\u003e\n\u003cp\u003eThe academy was only providing land and the most basic of services. As for everything else, like acquiring advanced information, one had to learn from a professor, the chances of which were very slim.\u003c/p\u003e\n\u003cp\u003eMoreover, there weren’t any compulsory missions that one must take on. As long as a person could pay the school fees and did not meet a bad professor, one could normally stay here for 5 years!\u003c/p\u003e\n\u003cp\u003eOf course, when there was no motivation, one’s power would lessen as they did not seek to improve. At least in Leylin’s case, he had not come across such a wonderful thing like receiving a few pieces of magic crystals each month for free.\u003c/p\u003e\n\u003cp\u003eTo obtain magic crystals, one could only take up a mission and go outside of the academy using their life to fight for them!\u003c/p\u003e\n\u003cp\u003eThe world of Magus has always upheld the principles of fair trade.\u003c/p\u003e\n\u003cp\u003eIn the following dozen days or so, Leylin devoted his time to analysing the spell models and purchasing items like grains and nutrients for the mission he was going to take up.\u003c/p\u003e\n\u003cp\u003eOne afternoon, Leylin came to the spell experimenting area.\u003c/p\u003e\n\u003cp\u003e“The spell experimenting area is a place that the academy has specially set up for acolytes and Magi to test the prowess of their spells. After all, various spells have immense might and there is also the problem of radiation. If the experiments are not managed properly the academy will be blown to bits!”\u003c/p\u003e\n\u003cp\u003eThe spell experimenting area was located on the left-most of the academy, a remote area.\u003c/p\u003e\n\u003cp\u003eThe surrounding white marble rock walls were stacked neatly and seemed to be extremely sturdy.\u003c/p\u003e\n\u003cp\u003eVarious runes were written on these walls, two of which Leylin recognised. One was for the isolation of radiation contamination, and the other was for reinforcing the walls.\u003c/p\u003e\n\u003cp\u003e“Are you going to test your spells?” Leylin walked to a counter where a big, bald guy smiled jovially at him asking.\u003c/p\u003e\n\u003cp\u003e“Yes, I would like to. Are there any places for me to do so?”\u003c/p\u003e\n\u003cp\u003e“We have two large areas designated for the acolytes and Magi. You are only allowed to enter the area for acolytes and, within that area, space is divided into shared and single rooms. Shared rooms mean experimenting with your spells alongside another person. There might be interruptions caused by this but, it is inexpensive. As for single rooms, the fees are much more costly!”\u003c/p\u003e\n\u003cp\u003e“What are the rates for a single room?” Leylin asked.\u003c/p\u003e\n\u003cp\u003eThe baldy\u0027s eyes shone since it was obvious that there was a promising client here, “Three hours for 1 magic crystal. Our single rooms even have specialised measuring devices which can calculate and report the might of your spells. Furthermore, we have…… It’s absolutely worth it!”\u003c/p\u003e\n\u003cp\u003e“Give me one!” Leylin handed over a magic crystal to the big guy.\u003c/p\u003e\n\u003cp\u003e“Alright! Please hold on!” The big guy registered him quickly and handed back a black crystal-like item.\u003c/p\u003e\n\u003cp\u003e“This is your room card! Number 32!”\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head and entered the spell experimenting area.\u003c/p\u003e\n\u003cp\u003eOn both sides, the runes on the white marbles glowed with a sparkling light. Some of the rooms obviously had occupants, but there were no sounds coming out from them and only the sound of Leylin’s footsteps could be heard the corridor.\u003c/p\u003e\n\u003cp\u003e“As expected! The noise isolation is really effective!”\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head and, after locating his own room, swiped the black crystal on a black platform right outside the door!\u003c/p\u003e\n\u003cp\u003e*Ka-cha!* The door opened and a mechanical female voice sounded, “Welcome! You have three hours; please notice the allocation……”\u003c/p\u003e\n\u003cp\u003eThe interior of the room was huge! The area was similar in size to a basketball court from Leylin’s previous life.\u003c/p\u003e\n\u003cp\u003eIn the middle were a few human shaped targets wearing leather armour, metal armour and fur.\u003c/p\u003e\n\u003cp\u003eTo the far right, there was a screen on the wall and below it was the instructions on how to operate it.\u003c/p\u003e\n\u003cp\u003e- A Magus can attack a target with a spell, and the screen will automatically record the power of the spell. -\u003c/p\u003e\n\u003cp\u003e“The facilities here are very advanced and seem to have an intelligence of their own. However, it’s a pity that it is formed by magic, a different route from what my previous world took!” Leylin exclaimed silently.\u003c/p\u003e\n\u003cp\u003e“Let’s try with a physical attack first!”\u003c/p\u003e\n\u003cp\u003eLeylin’s muscles on his right arm bulged as he walked to the front of a white coloured target wearing leather armour.\u003c/p\u003e\n\u003cp\u003e* Bang !* Leylin moved and, with a low voice, he shouted and punched the middle of the leather armour, leaving a faint trace of an impression.\u003c/p\u003e\n\u003cp\u003eThe screen on the right flickered, and a few words appeared.\u003c/p\u003e\n\u003cp\u003e“Classification: Physical Attack. Degree of power: 2. Damage to target: Minimal.”\u003c/p\u003e\n\u003cp\u003e“It seems like these targets aren\u0027t made of common materials!” Leylin muttered to himself.\u003c/p\u003e\n\u003cp\u003e“Degree of power” is the official standard that Magi use to measure the extent of their might. A single unit, as a standard, is equivalent to the energy that can be completely released by 1 gram of magic crystal.\u003c/p\u003e\n\u003cp\u003e“This method of measurement isn\u0027t bad. A.I. Chip, in the future you can increase the content regarding this area!”\u003c/p\u003e\n\u003cp\u003e[Recording is done, defragmenting in process!] The A.I. Chip’s voice sounded.\u003c/p\u003e\n\u003cp\u003e“Ha!” Leylin pulled out the cross blade hanging on his waist and brought about a strong gale as he viciously cut down.\u003c/p\u003e\n\u003cp\u003e* Qiang! * A gap split opened on the leather armour revealing the white coloured wound beneath.\u003c/p\u003e\n\u003cp\u003e“Classification: Physical Attack. Degree of power: 3. Damage to target: Slight.”\u003c/p\u003e\n\u003cp\u003eSeeing the screen, Leylin nodded his head, “I used all my might to cut down with the cross blade earlier but it only gave this kind of damage to the target! It seems like I can put my mind at ease and learn magic!”\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, transmit the 2 spell models over!” After this period of continuous research, the A.I. Chip had already analysed the 2 spells completely. The last step was to transmit the information into Leylin’s hippocampus[1. Hippocampus - Memory recall area in the brain.] which would then enable him to grasp these two rank 0 spells immediately.\u003c/p\u003e\n\u003cp\u003e[Beep! Transmitting in progress!] With the A.I. Chip’s mechanical voice replying, Leylin felt a lot of memories regarding the techniques and procedures of casting these 2 spells surfacing in his mind.\u003c/p\u003e\n\u003cp\u003eEvery step felt extremely familiar. It was as if they were personally practiced by him countless of times.\u003c/p\u003e\n\u003cp\u003e“Bring out the data of these 2 rank 0 spells!”\u003c/p\u003e\n\u003cp\u003e“Acidic Aqua Shot: rank 0 spell. Casting time: 3 seconds. Effective distance: 7 Metres. Consumption: 2 spiritual force, 2 magic power”\u003c/p\u003e\n\u003cp\u003e“Umbra’s Hand: rank 0 spell. Casting time: 4 seconds. Effective distance: 10 Metres. Consumption: 2 spiritual force, 2 magic power”\u003c/p\u003e\n\u003cp\u003e“magic power is the amount of energy particles that are stored within the body. It is limited by the upper limits of the spiritual force!”\u003c/p\u003e\n\u003cp\u003eTo cast a spell, one does not only need to use their spiritual force as a primer but must also understand that the magic power within their body will be consumed as well.\u003c/p\u003e\n\u003cp\u003eLeylin suppressed his excited emotions, “A.I. Chip, Record in detail my spell casting process !”\u003c/p\u003e\n\u003cp\u003e“Pandora - Graygonger!”\u003c/p\u003e\n\u003cp\u003eWith the Byron language’s incantation sounding from Leylin, a ball of dark green liquid suddenly appeared at the upper area of his right hand. White bubbles continuously frothed outside of it.\u003c/p\u003e\n\u003cp\u003e“Let’s go!” Leylin flung the acidic ball in his hand and the green liquid streaked across in an arc, landing on a target wearing leather armour.\u003c/p\u003e\n\u003cp\u003e* Ssssii! Ssssii! *\u003c/p\u003e\n\u003cp\u003eThe corrosion of the physical target sounded nonstop as it continuously dissolved while emitting a huge amount of white smoke. At the same time, an odour that pricks at the sense of smell wafted in all directions.\u003c/p\u003e\n\u003cp\u003eAfter a few seconds, the human target had been corroded, leaving only a pair of white legs behind.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, estimate the degree of power!”\u003c/p\u003e\n\u003cp\u003e[Beep! Degree of power: 5]\u003c/p\u003e\n\u003cp\u003eLeylin turned to look at the screen at the right. At this moment, the words on the screen changed and a new record was shown.\u003c/p\u003e\n\u003cp\u003e“Classification: Magical corrosive attack. Degree of power: 5. Damage to target: Severe.”\u003c/p\u003e\n\u003cp\u003e“En! It seems like the A.I. Chip and this screen have the same estimated values so I won’t need to come here in future. I should be able to estimate the degree of power in my spells with the A.I. Chip.”\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head and begin experimenting with another spell.\u003c/p\u003e\n\u003cp\u003e“Umbra’s Hand!”\u003c/p\u003e\n\u003cp\u003eFollowing Leylin’s incantation, a black coloured hand suddenly appeared under a target which wore steel armour. It grabbed the target’s throat forcefully and, with a crashing sound, the target’s head fell onto the ground.\u003c/p\u003e\n\u003cp\u003e“Classification: Energy attack. Degree of power: 4. Damage to target: Severe.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-29\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-31\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-30","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
