{"id":58863,"no":307,"title":"Chapter 307","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eEarthquake\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eA Magus’ spiritual force and magic power were not infinite.\u003c/p\u003e\n\u003cp\u003eEven if they had extraordinary strength, they would still suffer from natural limitations.\u003c/p\u003e\n\u003cp\u003eEven if James was a level 3 acolyte, when faced with a troop of a hundred elite soldiers, he could only retreat.\u003c/p\u003e\n\u003cp\u003eThe opponent’s side had too many people, and even if they lined up for him to kill them, his pitiful amount of spiritual force and magic power would not be sufficient to kill them all.\u003c/p\u003e\n\u003cp\u003eAnd if these soldiers were all replaced with cavalrymen?\u003c/p\u003e\n\u003cp\u003eHopelessness had already started invading James’ heart. Being surrounded by that many cavalryman, the most he could do was to escape by himself with that magic artifact of his, leaving behind Jenny.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eBut, we have Lord Leylin with us now. There shouldn’t be any problem.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eJames glanced at Leylin and forced himself to calm down.\u003c/p\u003e\n\u003cp\u003eA situation where a squadron composed of magicians and civilian troops fighting each other has never before occurred in the history of Twilight Zone.\u003c/p\u003e\n\u003cp\u003eAfter all, no lord would stupidly provoke an official Magus.\u003c/p\u003e\n\u003cp\u003eMoreover, as far as Magi were concerned, they could use stealth and cast spells and could easily end the life of the perpetrator, so why should he unnecessarily waste his time?\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eIf Lord Leylin really was an official Magus, then they need not be worried about this danger.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eJames inwardly comforted himself with these encouraging thoughts, and then he heard Baelin’s nervous, almost-filled-with-fear voice asking, “Who are you all?”\u003c/p\u003e\n\u003cp\u003eAlthough he had advanced and become a Grand Knight, but it was evident that his attitude had not adjusted to this fact. After looking at the expressionless and dense army, the small city resident’s heart welled up with fear.\u003c/p\u003e\n\u003cp\u003eWith the horses neighing in the background, a small path opened up among the ranks of the calvary. An old fellow wearing a black Chinese suit, and with the mark of a human skull on his forehead, walked out.\u003c/p\u003e\n\u003cp\u003e“Rhodes, it really is you! You went as far as to dare station some troops here, are you not worried about being punished?” The expression on James’ face was an odd mixture of fury and regret.\u003c/p\u003e\n\u003cp\u003e“My beloved older brother, it is me!” Rhodes sneered.\u003c/p\u003e\n\u003cp\u003e“Older brother?” The stunned Baelin had only now discovered that if that sinister mark branded on Rhodes’ face was removed, he would closely resemble James.\u003c/p\u003e\n\u003cp\u003e“We are all employed by the Argus Family. Thus, there is no need for the soldiers to face off against each other with swords.” James tried one last compromise.\u003c/p\u003e\n\u003cp\u003e“Brother James! It’s because I want to prove that I’m better than you! Even in the aspect of choosing my leader! It will definitely be the next head of the Argus Family!”\u003c/p\u003e\n\u003cp\u003eRhodes’ expression seemed to express a deep-rooted hatred.\u003c/p\u003e\n\u003cp\u003e“If it is about the matter that happened during our childhood years, I will apologize to you for that. I can even kneel before you. Nevertheless, Rhodes, one must not enter this vortex, as it can kill you...”\u003c/p\u003e\n\u003cp\u003e“Heehihihiheee... saying these things now, what’s the use?”\u003c/p\u003e\n\u003cp\u003eRhodes gave an eerie smile and came over.\u003c/p\u003e\n\u003cp\u003e“All of you… Annoying!” Leylin, who was in front of the carriage, frowned, expressing his dissatisfaction.\u003c/p\u003e\n\u003cp\u003eJust as he had thought over and improved his plan, it was suddenly disrupted by this Rhodes and soon, an evil fire approached Rhodes.\u003c/p\u003e\n\u003cp\u003e“Is this Lord Leylin?”\u003c/p\u003e\n\u003cp\u003eRhodes gave a deep bow. In front of this person who had a high certainty of being an official Magus, he did not dare to be disrespectful.\u003c/p\u003e\n\u003cp\u003e“This is an internal affair of the Argus Family. Moreover, our family’s Lord Siegfried is also a respected Lord Magus. He also wishes he can meet you...”\u003c/p\u003e\n\u003cp\u003e“No! You lie! Grandpa Siegfried has been deceived by you.”\u003c/p\u003e\n\u003cp\u003eLeylin still did not respond. Jenny jumped up, in a straight sudden manner like the tail of a kitten when it was frightened or angry.\u003c/p\u003e\n\u003cp\u003e“The official Magus of the Argus Family is known as Siegfried, eh? It seems he is the common ancestor for both these troops...”\u003c/p\u003e\n\u003cp\u003eLeylin felt some pity for this Magus.\u003c/p\u003e\n\u003cp\u003eHis own descendants, for the sake of gaining power, were beating up each other. Maybe all of this gives him a headache. Or maybe he doesn\u0027t care about such things.\u003c/p\u003e\n\u003cp\u003eAfter all, a Magus’ lifespan was very long. By the time a few generations have passed by, whatever affection and such emotions that said Magus had towards his family would have become very diluted\u003c/p\u003e\n\u003cp\u003e“I do not care who has Siegfried\u0027s backing, but, I believe you are blocking my way. Now, step aside at once!”\u003c/p\u003e\n\u003cp\u003eLeylin frankly chided him. The one Rhodes mentioned was just a level 1 Magus, who certainly couldn’t induce fear in him, but he was extremely disgusted with Rhodes’ attitude.\u003c/p\u003e\n\u003cp\u003e“Hic…...” This kind of scolding, clearly made Rhodes feel deflated and he stood there looking foolishly around him. His face also turned red.\u003c/p\u003e\n\u003cp\u003eHis every effort and achievements were like jokes in the eyes of his family.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis is unfair! Again I hear such a tone. And again I am being subjected to such an expression. And in my childhood, my older brother was also the same. Why is he stronger than me in everything? Why do all the good things happen to him and not me?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eRhodes’s eyes turned redder.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMoreover, it isn\u0027t clear whether that Leylin is an official Magus or not. There exists a probability that he is just someone that slut Jenny hired to scare me.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eRhodes firmly waved his hand, “Charge!”\u003c/p\u003e\n\u003cp\u003eThe multitude soldiers received the order and immediately charged forth.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eEven if you are an official Magus, so what? Facing so many Knights, your spiritual force wouldn’t last long. After this mission is done with, if worst comes to worst, I will just hide myself within the Argus Family and live comfortably. Anyways, with me under Lord Siegfried’s protection, what can you do?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eRhodes eyed Leylin resolutely, his face turning the shade of an abnormally faint red.\u003c/p\u003e\n\u003cp\u003e“My lord! Jenny! You both please go ahead.” Baelin then pulled out his long sword and his whole body swelled up like a balloon. He resembled a small giant as he blocked the carriage from harm.\u003c/p\u003e\n\u003cp\u003eAfter the enemy made their charge, he made his battle preparations and roused the secret Knight techniques that Leylin had instructed him in.\u003c/p\u003e\n\u003cp\u003eAlso, the reason behind Rhodes’s unusual facial change was immediately accurately revealed within Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003e“His pupils are unusually dilated. The blood flow in his brain has accelerated by 34%, a clear symptom of damage to his spirit.”\u003c/p\u003e\n\u003cp\u003eSeeing the deranged-looking Rhodes, Leylin was somewhat clear on why the opponent was acting so unbridled.\u003c/p\u003e\n\u003cp\u003eThe studies of Magi were extremely dangerous. Any forms of expression could very well sacrifice the Magus’ life into it. Furthermore, once there was a slight mistake in important matters that concerned the consciousness, meditation, and spiritual force, many detrimental outcomes could be created.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis Rhodes, clearly received some harm to his sea of consciousness when he advanced to become a level 3 acolyte. He cannot completely control his spirit and his emotions, and so he appears rather nervous. \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eHowever, the reason why Rhodes went mad is only a small matter. Leylin only gave him a slight gaze before he focused his attention on the charging cavalry, his mouth displaying a slight sneer.\u003c/p\u003e\n\u003cp\u003eThe charging troops had approximately 200 people. It seems as if the entirety of the Lilan Castle had come to battle. All of them had donned excellent quality armor and the pikes and huge battle axes they wielded carried a sharp, cold glint.\u003c/p\u003e\n\u003cp\u003eTwo hundred mounts charged forth and the ground started to quake and under this mighty launch, Baelin only resembled a small, bemused ant.\u003c/p\u003e\n\u003cp\u003eThis kind of battle formation would even cause a Magus to frown, but Leylin stood calmly as if nothing of importance was happening.\u003c/p\u003e\n\u003cp\u003e“Why do you all always use a common man’s way of thinking against a Magus?”\u003c/p\u003e\n\u003cp\u003eHe lightly sighed and a faint khaki-colored light fell to the ground from his hands.\u003c/p\u003e\n\u003cp\u003e*Hissssss!* This light was as tiny as a firefly, and it looked as if a puff of breath blown on it would extinguish it.\u003c/p\u003e\n\u003cp\u003eAfter the khaki-colored light appeared on the ground, it promptly vanished from sight, as if it had fused into the soil and immediately ripples of tremors began to disperse out from the place where the light blended into the soil.\u003c/p\u003e\n\u003cp\u003e*Bang! Boom! Boom! Bang! Bang!*\u003c/p\u003e\n\u003cp\u003eThe tremors began to extend in all directions as if several dominoes had been struck down, and the tremors gained and dispersed more and more power. Finally, there even occurred an earthquake.\u003c/p\u003e\n\u003cp\u003e*Crrrrrrrrrackkk!* The ground began to split open. The huge shockwaves made the Knights feel as if they were caught in the crossfire of bullets.\u003c/p\u003e\n\u003cp\u003eThe surroundings quickly looked like as if there were waves from the sea surging forth causing continuous tremors.\u003c/p\u003e\n\u003cp\u003e“Argh!” “Earthquake!” “My horse” “Save me, my legs are broken!”\u003c/p\u003e\n\u003cp\u003eThe rifts began to open from the Knight at the forefront before they soon covered the ground of where the whole cavalry was.\u003c/p\u003e\n\u003cp\u003eAlong with the tremors, many horses stumbled and even threw their Knights atop them down.\u003c/p\u003e\n\u003cp\u003eThe ear-splitting bone cracks, the neighing of the horses were all covered by the tremors that the earthquake caused. Only Baelin and James with a certain level of physical ability could barely make out the noise.\u003c/p\u003e\n\u003cp\u003e*Rumble*\u003c/p\u003e\n\u003cp\u003eThe shock wave swept away all the soldiers and still continued on further till they dissipated.\u003c/p\u003e\n\u003cp\u003eAs for the consumption of this spell, it was barely five spiritual force points.\u003c/p\u003e\n\u003cp\u003eMagi wielded intelligence! Not brute strength! What Leylin did earlier was to calculate the conditions of the surroundings, before using very little force to cause a devastating earthquake using the butterfly effect.\u003c/p\u003e\n\u003cp\u003eJust one strike! A crushing defeat! More than two hundred cavalrymen were now dead. The wails of the injured and broken bits of limbs left Rhodes in utter shock.\u003c/p\u003e\n\u003cp\u003e“He...How can he be this powerful?”\u003c/p\u003e\n\u003cp\u003eRhodes roared within his heart before he frantically turned away to escape.\u003c/p\u003e\n\u003cp\u003e“Baelin! Go capture him!” Leylin pointed at Rhodes. However, Baelin stood there stupefied, not moving an inch.\u003c/p\u003e\n\u003cp\u003e“Aren’t you going?” Leylin flicked his finger, only to have a translucent palm slap the back of Baelin’s head.\u003c/p\u003e\n\u003cp\u003e“Oh! Okay!” Only then did Baelin regain his senses, running towards the direction Rhodes had escaped in.\u003c/p\u003e\n\u003cp\u003e“Mister Leylin! No, Lord Leylin! Pardon my presumptuous question… But what is your rank as an official Magus?”\u003c/p\u003e\n\u003cp\u003eJust then, James paid his respects to Leylin using the most revered formality, with Jenny following suit behind.\u003c/p\u003e\n\u003cp\u003e“Me?” Leylin grinned, “I’m just a rank 1 Magus who is shuffling his feet in front of the door of truth…”\u003c/p\u003e\n\u003cp\u003e“So you are indeed an official Magus! Please pardon our disrespect to you earlier!”\u003c/p\u003e\n\u003cp\u003eAfter hearing the words from Leylin’s own mouth, Jenny and James sighed in relief. They once again bowed to Leylin before an uncontrollable glee filled their eyes.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-306\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-308\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-307","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
