{"id":58912,"no":356,"title":"Chapter 356","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eRed Mist\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eEmergency sirens were blaring throughout Dolon City.\u003c/p\u003e\n\u003cp\u003eLeylin, Fendix, and the others floated across to the front of the city, watching the scene outside.\u003c/p\u003e\n\u003cp\u003eTen years where life and resources were constantly lost had visibly reduced the numbers of the horde of darkness creatures. The newest reports suggested that the beast emperors had already made plans to withdraw their troops and end the war.\u003c/p\u003e\n\u003cp\u003eIf not for the fall of the north and interference of the dwarves and gnomes, the war was on track to end in a few years. The current situation was different, however. The humans of the subterranean world were now facing the possibility of extinction.\u003c/p\u003e\n\u003cp\u003e“Underground Winter Spider knights! And they’re elites!”\u003c/p\u003e\n\u003cp\u003eLeylin looked up. Three regiments of Underground Winter Spider knights\u003c/p\u003e\n\u003cp\u003eHuge spider legs trod the ground silently, their dark elf riders wreathed in exquisite thin armor that looked ornamental. The surface of the armors was composed of intricate patterns. Matched with the handsome faces and lances, they seemed like a royal parade to Leylin.\u003c/p\u003e\n\u003cp\u003eAlthough these knights seemed extravagant and pretentious, the searing bloodlust they emanated was tangible. This was something only battle-hardened elites with fearless hearts could have.\u003c/p\u003e\n\u003cp\u003e“These are the dark elven royal family’s knights. I didn’t expect them to be sent out!” Fendix looked grim.\u003c/p\u003e\n\u003cp\u003e“Elite Underground Winter Spider knights are slightly more powerful than our Grand Knights. Those at the level of vice-captain and above are even as powerful as official Magi. Three formations of a thousand each, there are three thousand here!” The female Magus inhaled sharply.\u003c/p\u003e\n\u003cp\u003e“They’re planning to conquer Dolon City in one go!!”\u003c/p\u003e\n\u003cp\u003eLeylin sighed lightly, “Do we need to act?”\u003c/p\u003e\n\u003cp\u003e“There’s no other way!” Fendix smiled wryly, “But their matriarchs are sure to obstruct as well, and we have no guarantee that we can win against them. I can already feel the power of the abyss emanating from their bodies…”\u003c/p\u003e\n\u003cp\u003eCities were usually watched over by rank 2 Magi. The opposing camp had three matriarchs whose mission was to tie down the rank 2 Magi of the defending city. If they could not, the three rank 2 Magi would cooperate to cast a few large-scaled magic spells which would decimate these troops.\u003c/p\u003e\n\u003cp\u003e“There’s no choice. Let’s use ‘it’.” Leylin suddenly exclaimed.\u003c/p\u003e\n\u003cp\u003e“Hm?” Fendix chanced a glance at Leylin. “That’s our trump card that we’re planning to use in the final battle…”\u003c/p\u003e\n\u003cp\u003e“This is already the final battle!” the female rank 2 Magus interrupted before Leylin could answer, “I agree!”\u003c/p\u003e\n\u003cp\u003e“Alright, I’ll agree too!” Fendix glanced at the large dark elven army and laughed wryly, “This truly might be the final battle.”\u003c/p\u003e\n\u003cp\u003eWith the three Magi cooperating, a unique order was sent down using secret imprints, and under the lead of the Magi, the troops on the ground shifted some special items onto the city walls.\u003c/p\u003e\n\u003cp\u003eThey were numerous giant casks. They were like the wooden barrels found in bars to store beer, with firm iron hoops on either side keeping them steady. There were also letters of the Twilight Zone written on them in blood red, indicating danger.\u003c/p\u003e\n\u003cp\u003e“Now, let us wait and see!”\u003c/p\u003e\n\u003cp\u003eThe three Magi exchanged glances, and then fixed their attention on the fighting.\u003c/p\u003e\n\u003cp\u003e“Attack!” With the signal from the dark elves at the other side, a large wave of darkness creatures charged towards them.\u003c/p\u003e\n\u003cp\u003e“Engage the third layer of defense!”\u003c/p\u003e\n\u003cp\u003eFluorescent light exploded at the walls, revealing unending defensive runes. Large amounts of energy particles brought with them a terrifying destructive power, launching outwards.\u003c/p\u003e\n\u003cp\u003eThe darkness creatures charging over were injured by energy particles of multiple elements, covering their bodies with wounds. It resulted in a rain of flesh and blood.\u003c/p\u003e\n\u003cp\u003eA few of the more powerful ones dodged the attack. They climbed up on the carcasses of their comrades and clashed with the soldiers and Magi on the walls.\u003c/p\u003e\n\u003cp\u003eIn a moment, blood and fire exploded!\u003c/p\u003e\n\u003cp\u003eThe Magi and knights on the walls bellowed, and all sorts of spells and energy fluctuations were released. Numerous darkness creatures fell from the walls.\u003c/p\u003e\n\u003cp\u003eThis scene had repeated often in the past, and each time the dark elves would end up retreating, which ended the fight. Now, however, things seemed to have changed. The horde continued to charge with reddened eyes, unfearing of death.\u003c/p\u003e\n\u003cp\u003e*Tak tak tak!* Regular explosions sounded. The elite Underground Winter Spider knights seemed to have received an order, as they began to advance..\u003c/p\u003e\n\u003cp\u003eAlthough they were merely 3000 strong, they were like a surge of steel flooding over when they acted together.\u003c/p\u003e\n\u003cp\u003e“Go!” Underground Winter Spiders with barbs on their legs easily climbed up the city wall like monkeys.\u003c/p\u003e\n\u003cp\u003eFor darkness creatures, the city wall was lofty and difficult to reach, but for these Underground Winter Spider Knights, they were like a level road.\u003c/p\u003e\n\u003cp\u003e“Attack!” One of them rushed towards the wall, brandishing the black lance in his hand.\u003c/p\u003e\n\u003cp\u003eMultiple snowy-white pointed javelins were sent thrusting like blooming flowers, and a few soldiers in leather armour collapsed, blood splattering everywhere. Amongst them, there was even a knight in heavy armour!\u003c/p\u003e\n\u003cp\u003eIn front of the elite Underground Winter Spider Knights, regular soldiers and knights could not take on even a single blow, and only Grand Knights had a chance to win.\u003c/p\u003e\n\u003cp\u003e“Secondary Energy Fireball!”\u003c/p\u003e\n\u003cp\u003e“Vine Winding!”\u003c/p\u003e\n\u003cp\u003e“Icy Pearl!” The magicians waiting on top of the city walls immediately acted,and the knights who had just rushed up the walls were drowned in the colourful rays of magic spells.\u003c/p\u003e\n\u003cp\u003eTheir powerful bodies and mounts that they had always been proud of were torn into pieces by various spells.\u003c/p\u003e\n\u003cp\u003eHowever, the surviving Underground Winter Spider Knights still charged on fearlessly, and many captains and vice-captains launched forth with spells of their own, clashing with the Magi on the walls.\u003c/p\u003e\n\u003cp\u003e“Hands of Corrosion!” A knight in gleaming armour, riding a larger spider than its peers, called out loudly. Numerous black palms extended from the air and advanced towards the opposing Magi.\u003c/p\u003e\n\u003cp\u003e“Ah!” A level 3 acolyte’s face was caught by one of the black hands and immediately wasted away, blood and flesh wearing away.\u003c/p\u003e\n\u003cp\u003e“Be careful! He’s a vice-captain and has the strength of an official Magus!”\u003c/p\u003e\n\u003cp\u003eA middle-aged Magus with white air spoke in a low voice, his innate defensive spell formation flickering.\u003c/p\u003e\n\u003cp\u003e“The situation doesn’t look good,” Leylin commented, watching the scene below.\u003c/p\u003e\n\u003cp\u003eAt this moment, the three Magi felt a few bursts of spiritual force aimed at them that equalled their own strengths being released from the enemy camp. If they dared intervene, they would be faced with a terrifying attack by the matriarchs.\u003c/p\u003e\n\u003cp\u003eIn a situation where the higher-ranked forces were level, whoever first made the first move would be at a disadvantage.\u003c/p\u003e\n\u003cp\u003eThankfully, Leylin and the others were not planning on doing so.\u003c/p\u003e\n\u003cp\u003eFrom the looks of it, though, only rank 2 Magi could change the outcome.\u003c/p\u003e\n\u003cp\u003e“Let’s begin!” Leylin spoke lightly, the apathy in his eyes becoming more evident.\u003c/p\u003e\n\u003cp\u003e“The command has been sent down. I only hope the matriarchs won’t go crazy and fight with us!” The ring on Fendix’s finger flashed red as he smiled wryly.\u003c/p\u003e\n\u003cp\u003eAt this moment, it looked like the official Magi on the city walls had received the command.\u003c/p\u003e\n\u003cp\u003e“Begin! Activate!” They shouted, and all sorts of spells were aimed at the casks, causing them to explode into fragments.\u003c/p\u003e\n\u003cp\u003e*Rumble!*\u003c/p\u003e\n\u003cp\u003eThe wooden boards exploded open, and the red liquid within spilled to the ground.\u003c/p\u003e\n\u003cp\u003eThis red liquid was very muddy and looked to be some red wine that had yet to settle. After reaching the ground, it became volatile and created a red mist.\u003c/p\u003e\n\u003cp\u003eIn that moment, the top of the city wall was wrapped in red mist.\u003c/p\u003e\n\u003cp\u003e“Be careful of the toxic attack! Activate your defensive runes!”\u003c/p\u003e\n\u003cp\u003eA dark elf in golden armour ordered.\u003c/p\u003e\n\u003cp\u003e*Weng Weng!* In the twinkling of an eye, multi-coloured rays rose from the dark elven knights’ armours.\u003c/p\u003e\n\u003cp\u003eAfter being wrapped within this layer of light, the knights charged towards their enemies once again, undaunted.\u003c/p\u003e\n\u003cp\u003eThey were very confident in the durability of their bodies, since they were members of a high-energy race. Dark elves might have lower reproductive abilities, but the durability of their bodies far surpassed that of humans. This racial ability extended to the immunity to many toxins.\u003c/p\u003e\n\u003cp\u003eIt wasn’t as if the humans hadn’t considered using poison, but most poisons that were deadly to humans only left dark elves feeling slightly giddy, or gave them a nosebleed.\u003c/p\u003e\n\u003cp\u003eUsing poison would only hurt them more, and lead to more city guards dying. Thus, after a few attempts, the humans had given up on this method.\u003c/p\u003e\n\u003cp\u003eNow, however, the situation was slightly different.\u003c/p\u003e\n\u003cp\u003e“Hm?”\u003c/p\u003e\n\u003cp\u003eAn Underground Winter Spider knight rushed up the city wall and sent a Grand Knight flying. Just as he was about to stab his lance into his opponent’s heart, he suddenly lost his grip, and the lance fell to the ground.\u003c/p\u003e\n\u003cp\u003eRecalling the short burst of weakness, the knight wondered, ‘What’s going on? How did these toxins paralyse me? Didn’t I already activate the runes that defend against this?’\u003c/p\u003e\n\u003cp\u003eThe sudden realisation that the red mist had passed through the defensive layer without obstruction alarmed him. It was as if these runes were fake.\u003c/p\u003e\n\u003cp\u003eLarge numbers of yellow pustules and blisters erupted all over his skin, bursting as quickly as they had formed. The knight screamed out, miserably.\u003c/p\u003e\n\u003cp\u003e“Attack!” A ray of light flashed, and the Grand Knight that had been sent flying grasped this opportunity and brandished the giant steel sword in his hands, slashing it at this dark elf’s neck.\u003c/p\u003e\n\u003cp\u003eA line appeared, which soon turned into a fountain of blood.\u003c/p\u003e\n\u003cp\u003eThis dark elf’s delicate, pale neck was severed, its skull rolling on the ground.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-355\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-357\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-356","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
