{"id":58918,"no":362,"title":"Chapter 362","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eA Fair Trial\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e*Rumble!*\u003c/p\u003e\n\u003cp\u003eFaint fluctuations travelled over, and for there to be so many undulations despite the long distance allowed the people in the carriage to ascertain their identities.\u003c/p\u003e\n\u003cp\u003e“They’re Magi, official Magi! It looks like they’re battling. Do we still proceed?” A peak rank 1 Magus guild master approached Leylin’s carriage and bowed, asking for further instructions.\u003c/p\u003e\n\u003cp\u003e“Of course!” Leylin spoke indifferently. With the power, they held when they banded together, they could easily go on a rampage in the eastern region. Thus, they were fearless.\u003c/p\u003e\n\u003cp\u003eThe guild leader seemed to have the same thoughts and, after a moment of pause, they continued to advance.\u003c/p\u003e\n\u003cp\u003eThe rest of the party noticed the energy fluctuations as they closed in. One of the two seemed to have reservations with approaching them, while the other hesitated for a moment before heading in their directions.\u003c/p\u003e\n\u003cp\u003e“Trying to use us to block the enemy?” The Magi in the group of carriages silently waited while smirking.\u003c/p\u003e\n\u003cp\u003e*Xiu!*\u003c/p\u003e\n\u003cp\u003eSeconds later, a red streak shot over from afar, and a young Magus appeared.\u003c/p\u003e\n\u003cp\u003eThis Magus looked quite ordinary but for the black ring on his right index finger and his resolute eyes. After seeing so many official Magi, his eyes widened and he tried to take a long way around them.\u003c/p\u003e\n\u003cp\u003e“You can’t escape! How dare you steal our family’s treasure!” a woman’s voice sounded out. The young man quivered, bit his lips, ground his teeth, and then dashed towards the group of carriages.\u003c/p\u003e\n\u003cp\u003e“Save me! I’m a wandering Magus, and for some reason, this mad woman is chasing me. She keeps slandering me and saying that I stole her treasure!”\u003c/p\u003e\n\u003cp\u003eThis young Magus was naturally Aaron. After recuperating from his injuries, he had been unlucky enough to meet with the Magus from the Mambo Family, and had been chased all the way here.\u003c/p\u003e\n\u003cp\u003eAs for blocking this group’s path, that was naturally Merlin’s idea.\u003c/p\u003e\n\u003cp\u003e“Will they save me? After all…” Aaron worriedly communicated with Merlin in his mind.\u003c/p\u003e\n\u003cp\u003e“Don’t worry! I’ve already completely concealed the aura of the Teardrop Gemstone. That crazy woman behind us won’t find anything!” Merlin promised confidently.\u003c/p\u003e\n\u003cp\u003eAs for that confidence, it was definitely due to a certain someone within the carriages.\u003c/p\u003e\n\u003cp\u003e“Hehe… Young man, you’re pretty good to have actually helped me gather the Teardrop Gemstone. I didn’t even know the Mambo Family had this in their collection!” Leylin smiled lightly, a cold glint in his eyes.\u003c/p\u003e\n\u003cp\u003e*Xiu!* At this moment, a pink ray shot into this area, and the female Magus who had been chasing after Aaron appeared in their midst.\u003c/p\u003e\n\u003cp\u003eAfter seeing the group of carriages with so many Magi, she felt her chest tighten perceptibly.\u003c/p\u003e\n\u003cp\u003e“I am Ophelia of the Mambo Family! My apologies if I am offending you, but please do not stop me from pursuing this vile thief!”\u003c/p\u003e\n\u003cp\u003eThe group was arranged haphazardly, with a few small scale guilds in front. Ophelia’s tone was therefore not that polite.\u003c/p\u003e\n\u003cp\u003eAfter all, the Mambo Family was quite famous in this region.\u003c/p\u003e\n\u003cp\u003e“How dare you! Who do you think you are?”\u003c/p\u003e\n\u003cp\u003e“The Mambo Family? Never heard of it before.”\u003c/p\u003e\n\u003cp\u003eAlthough those in front were a just few small scale guilds, their higher-ups were watching on from the back, and even the legendary rank 2 Magus in charge of Nature’s Alliance was present. They were naturally unrestrained in their answers.\u003c/p\u003e\n\u003cp\u003e“You…” Ophelia’s voice lowered, and a faint aura of danger emanated from her body.\u003c/p\u003e\n\u003cp\u003eHow many people in her family dared to speak to her like this?\u003c/p\u003e\n\u003cp\u003eAt this point, however, more carriages had arrived, and the markings caused Ophelia to swallow the words she was planning to say, making her dumbstruck.\u003c/p\u003e\n\u003cp\u003e“The Lost Clock, Twisted Black Clouds, Infernal Blood, and… Nature’s Alliance!”\u003c/p\u003e\n\u003cp\u003eOphelia’s eyes widened. These were all medium scale guilds, and each one of them was powerful enough to pressure the Mambo Family—especially Nature’s Alliance, which had a powerful rank 2 Magus in charge.\u003c/p\u003e\n\u003cp\u003eThe moment they were provoked, they would squash her like one would an ant.\u003c/p\u003e\n\u003cp\u003eOn the other end, Aaron gaped, stunned. “So many! So many Magi and acolytes! Are they migrating?”\u003c/p\u003e\n\u003cp\u003e“Ophelia had no intentions of offending anyone; please forgive me!” Cold sweat rushed down Ophelia’s spine, and she immediately dropped to the ground and bowed.\u003c/p\u003e\n\u003cp\u003e“Haven’t you dealt with this yet?” At this moment, Leylin opened the door and descended from the largest and most luxurious carriage in Nature’s Alliance’s group.\u003c/p\u003e\n\u003cp\u003e“Lord Leylin!” All the Magi there immediately bowed.\u003c/p\u003e\n\u003cp\u003e“Ley-Leylin! The legendary rank 2 Magus said to have heavily injured a dark elven Sovereign Mother! Why is my luck so bad?” Ophelia was snarling on the inside, but she wouldn’t dare to even break into a cold sweat in this man’s presence.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Leylin furrowed his eyebrows, asking even though he knew the situation.\u003c/p\u003e\n\u003cp\u003e“My- My apologies, my lord!” A Magus from the Alliance was frightened so badly he couldn’t even speak clearly.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Leylin repeated once again, but the atmosphere had frozen. The entire group was quiet, and even some guild leaders of medium-scaled guilds, who were peak rank 1 Magi themselves, did not dare to make a sound.\u003c/p\u003e\n\u003cp\u003e“My lord, it’s like this....” Ophelia tried her best to make herself sound calm, narrating the whole story.\u003c/p\u003e\n\u003cp\u003e“Oh! Is that so?”\u003c/p\u003e\n\u003cp\u003eLeylin turned, and Aaron was pressed to the ground by an invisible force.\u003c/p\u003e\n\u003cp\u003e“I’ll give you one chance. You said you used your family’s secret method and found him. Do it again in front of us! If the Teardrop Gemstone is on him, then he shall be judged by us all. If not…” Leylin’s dangerous gaze landed on Ophelia, causing her head to tingle.\u003c/p\u003e\n\u003cp\u003e“If it isn’t, then Ophelia is willing to accept punishment!” Ophelia grit her teeth and forced out an answer.\u003c/p\u003e\n\u003cp\u003e“Not only that, those of us here are responding to summons from the central region to engage in battle. If you are proven to be wrong, you shall be prosecuted by the war council for obstructing military affairs.”\u003c/p\u003e\n\u003cp\u003eLeylin smiled to make up for his harsh words. “Well then, begin!”\u003c/p\u003e\n\u003cp\u003e“What do I do? What do I do?” Aaron watched Ophelia who had already begun to use her family’s secret method and the official Magi who were preparing to watch a good show. He repeatedly asked Merlin in his mind, while not even daring to look at the legendary rank 2 Magus at all.\u003c/p\u003e\n\u003cp\u003e“Don’t worry. I’m the legendary great Magus Merlin. What is a little rank 2 Magus to me?” Merlin boasted shamelessly, “With my spirit force concealing it, this girl definitely won’t find anything!”\u003c/p\u003e\n\u003cp\u003e“Then why didn’t you use it previously?” Aaron felt like he had been conned.\u003c/p\u003e\n\u003cp\u003e“A lot of my spirit force has been used, and it hasn’t been replenished,” Merlin explained vaguely, causing Aaron to immediately begin reproaching himself. How could he not trust Grandpa Merlin, whom he had grown up with?\u003c/p\u003e\n\u003cp\u003e“You’re dead meat!” Ophelia snickered while lowering her head, pointing at Aaron with the ring.\u003c/p\u003e\n\u003cp\u003e“There is a tracking spell formation on the Teardrop Gemstone passed down by my ancestors. As long he has it on him, my ring will emit red rays of light. Look, my lords!”\u003c/p\u003e\n\u003cp\u003eOphelia pointed the ring at Aaron, and shouted a word, “Mambo!”\u003c/p\u003e\n\u003cp\u003eAaron’s heart was at his throat, and he almost closed his eyes to wait for the judgement of destiny.\u003c/p\u003e\n\u003cp\u003e“Eh?” “Oh!” “Ah?”\u003c/p\u003e\n\u003cp\u003eAll sorts of sounds resounded by Aaron’s ears, but none of them were the accusations he had expected.\u003c/p\u003e\n\u003cp\u003eHe secretly chanced a glance at Ophelia, who was now looking lost and dejected.\u003c/p\u003e\n\u003cp\u003e“How is this possible? How is this possible? It wasn’t like this the last few times!” She lifted the ring and scanned him a few more times.\u003c/p\u003e\n\u003cp\u003eThe ring had no response, as if it were just an ordinary ring.\u003c/p\u003e\n\u003cp\u003e“Haha! How is it? Aren’t my concealing methods powerful?” Merlin chuckled heartily in Aaron’s mind.\u003c/p\u003e\n\u003cp\u003eIn reality, all of this was Leylin’s work. If not for him being there, Aaron would definitely have been seen through.\u003c/p\u003e\n\u003cp\u003e“How?” Ophelia shrieked, unwilling to give up as she took off the ring and inspected the formations within.\u003c/p\u003e\n\u003cp\u003eMoments later, she yelled out, “It must be you! You must have hidden the Teardrop Gemstone somewhere along the way!\u003c/p\u003e\n\u003cp\u003e“No! It must definitely be on your person. Hand it over!” Blazing pink flames appeared on her body.\u003c/p\u003e\n\u003cp\u003e“Enough! What a farce!” Leylin was still playing the role of a fair, altruistic judge.\u003c/p\u003e\n\u003cp\u003e“No! My lord, you need to believe me!” Ophelia’s voice cracked, sounding a little hoarse.\u003c/p\u003e\n\u003cp\u003e*Bang!*\u003c/p\u003e\n\u003cp\u003eA resplendent, silver light flashed, and the flames on her body were extinguished. She retreated a few steps and fell to the ground, her expression still full of stubborness.\u003c/p\u003e\n\u003cp\u003e“Haha, that girl actually dares to resist. She’s in trouble!” Merlin rejoiced in Aaron’s mind.\u003c/p\u003e\n\u003cp\u003e“What’s happening?” Aaron immediately asked.\u003c/p\u003e\n\u003cp\u003e“That Lord Leylin is a rank 2 Magus! His solidified spiritual force is not something a little girl like her can withstand, but she actually dared do so. What should have been a light injury will now become more serious, and might even affect her sea of consciousness…”\u003c/p\u003e\n\u003cp\u003e“Ah? Then what’s going to happen to her?” Aaron began to blame himself.\u003c/p\u003e\n\u003cp\u003e“What else can happen to her? If a rank 2 Magus wants to discipline her, she’ll still need to endure it even if she’s not in the wrong. She can’t complain either,” Merlin continued taking joy in her pain, and took the opportunity to educate Aaron, “This is the law of the Magus World!”\u003c/p\u003e\n\u003cp\u003e“Leave this place and never appear in front of me again! It seems like you just made a mistake this time. I won’t report it to the war council!”\u003c/p\u003e\n\u003cp\u003eLeylin hummed lightly and returned to the carriage.\u003c/p\u003e\n\u003cp\u003e“Thank you for your mercy, my lord!” His actions elicited words of gratitude from the female Magus.\u003c/p\u003e\n\u003cp\u003eOphelia left the area in a daze. Although she was in despair, were she to continue staying here, a few peak rank 1 Magi would make short work of her without Leylin even lifting a finger.\u003c/p\u003e\n\u003cp\u003e“What are you looking at? We’re leaving!”\u003c/p\u003e\n\u003cp\u003eSoon enough, the carriages continued their journey.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-361\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-363\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-362","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
