{"id":58930,"no":374,"title":"Chapter 374","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eClash\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAlthough the host talked about potential dangers in the finals, nobody drew back.\u003c/p\u003e\n\u003cp\u003eThe world of magicians was no paradise. Those who managed to survive this rat race had seen blood time after time again, and were well prepared for such a situation.\u003c/p\u003e\n\u003cp\u003eThe generous rewards that the large-scale guilds offered and the chance to become the inheritor of a rank 2 Magus had convinced them to bet their lives on this competition.\u003c/p\u003e\n\u003cp\u003e“Good! Since nobody’s backing down, let the finals begin!” The host waved his hands.\u003c/p\u003e\n\u003cp\u003e*Peng! Peng! Peng!* Three giant fireworks flew across the sky like colorful comets, and the music reached fever-pitch.\u003c/p\u003e\n\u003cp\u003e*Buzz!* Purple energy condensed into the spell formation, constantly increasing its strength until a hole was ripped open in space.\u003c/p\u003e\n\u003cp\u003eThe finalists stepped forward one after the other, receiving their amulets and spell formations before they disappeared with a flash of light.\u003c/p\u003e\n\u003cp\u003eAfter the last of them entered the secret plane, a giant curtain of light was formed around the competition area. Their figures blinked onto the curtain, each contestant occupying one of the dozens of square partitions.\u003c/p\u003e\n\u003cp\u003eThey were monitoring every inch of the secret plane, which surprised many of the Magi present.\u003c/p\u003e\n\u003cp\u003e“Such a clever monitoring technique, and so expensive as well…” Leylin murmured to himself.\u003c/p\u003e\n\u003cp\u003eHe, too, could develop a technique to monitor the whole plane, but it would cost too much.\u003c/p\u003e\n\u003cp\u003eEven with the leadership of the joint conference and the sponsorship of several large-scale guilds, they could only maintain this technique for a day or they would go bankrupt.\u003c/p\u003e\n\u003cp\u003eBut the result of ignoring such costs and using this technique was rather good. Nearly every contestant could be seen on the screen.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Something’s wrong!” Baelin said as he brandished his cross blade.\u003c/p\u003e\n\u003cp\u003eA sword wave streaked across the air, chopping a giant leech into two. However, the two halves didn’t die instantly. Instead, it writhed in the mud and splashed water all over the place.\u003c/p\u003e\n\u003cp\u003eBeing attacked by this leech the moment he was teleported into this marshland gave Baelin a bad omen.\u003c/p\u003e\n\u003cp\u003e“Be careful, master. I sensed a powerful monitoring ability here!” His armour split apart to reveal an eye. The Bio Boosting armour was communicating with him.\u003c/p\u003e\n\u003cp\u003e“It’s the Okell’s Great Observation Spell from the Plant affinity, which uses the roots and vines as transmission channels. If you want to act in secret, my lord, you must avoid any places that have plants in them” it said to him in his mind.\u003c/p\u003e\n\u003cp\u003eAs a Bio Booster, Baelin’s gains from inheriting the Bio Boosting armour of an ancestor was not limited to a significant boost in strength. Having the armour with him was like carrying around an old grandpa who would help him with his knowledge and experience.\u003c/p\u003e\n\u003cp\u003e“No wonder I feel uncomfortable, we are being watched!” Baelin nodded, and left the marshland quickly.\u003c/p\u003e\n\u003cp\u003eJust when he reached the edge of the marshland, Baelin heard something and pointed his cross blade at the bushes nearby. “Who’s there? Get out!”\u003c/p\u003e\n\u003cp\u003e“Don’t! We mean you no harm!” Two Magi stepped out who were similar in appearance.\u003c/p\u003e\n\u003cp\u003e“Lord Baelin, we were just teleported here.” “We are only trying to help any Magi who have fallen into swamps!” “Also, Lord Baelin, we admire your strength from the bottom of our hearts. How could we dare to harm you?”\u003c/p\u003e\n\u003cp\u003e“Yes! Yes!” The twin Magi spoke one after the other without pause, leaving no chance for Baelin to say anything himself.\u003c/p\u003e\n\u003cp\u003eIn fact, Baelin’s power with his cross blade and fleshy armour left deep impressions on the competing Magi. The respect of the very Magi he once feared left Baelin feeling quite smug.\u003c/p\u003e\n\u003cp\u003e“Lord Leylin should feel satisfied after watching this scene! In fact, Lord Leylin was on the judging platform all this while. Maybe I should find an opportunity to talk to him…”\u003c/p\u003e\n\u003cp\u003eBaelin venerated his Master from the depths of his heart. Not for a moment would he suspect Leylin of being the traitor among the upper circle of Magi. Had he not been stopped by Vinas, Aaron, and Memphis, he would have gone to Leylin’s mansion the moment he’d arrived.\u003c/p\u003e\n\u003cp\u003e“Haha…Haha…” Baelin stroked his head embarrassedly, a smirk on his face.\u003c/p\u003e\n\u003cp\u003eSeeing this, the twin brothers glanced at each other, a strange look flashing past their eyes.\u003c/p\u003e\n\u003cp\u003e“Lord Baelin!” One of them said as he approached him, “Since this place is so dangerous, how about we stick together?”\u003c/p\u003e\n\u003cp\u003e*Pang!* Just as he finished his words, several green brambles stuck out of the earth, tying Baelin’s feet up.\u003c/p\u003e\n\u003cp\u003e“Now!” he shouted.\u003c/p\u003e\n\u003cp\u003e“Profound energy blast!” The younger brother standing behind him crushed a crystal rune. Together with a chant, a powerful attack was launched.\u003c/p\u003e\n\u003cp\u003eA ball of purple liquid, filled with corrosive white bubbles, rushed directly towards Baelin’s head.\u003c/p\u003e\n\u003cp\u003eThe twins had gathered intelligence about the awesome power of this armour, so they had aimed instead at Baelin’s unprotected head.\u003c/p\u003e\n\u003cp\u003eThe twin brothers’ co-ordination was perfect, and their final strike reached an offensive power of around 60-70 degrees! Such an attack could even corrode mountains.\u003c/p\u003e\n\u003cp\u003e“Haha! Stupid! Even if you are more powerful than us, this is a competition! Why wouldn’t we take a gamble?” The elder brother laughed, looking at Baelin with a little excitement.\u003c/p\u003e\n\u003cp\u003eHe was not pleased when Baelin stole the limelight, and this chance for vengeance made him happy.\u003c/p\u003e\n\u003cp\u003e“Master!” The second before the corrosive liquid ball arrived, eyes arose from every parts of Baelin’s armour.\u003c/p\u003e\n\u003cp\u003eThese eyes were smaller, but they blinked with wisdom. Now, they were showing signs of rage.\u003c/p\u003e\n\u003cp\u003e*Pang!* A membrane of flesh formed like a helmet around Baelin’s head, protecting it.\u003c/p\u003e\n\u003cp\u003eAs the profound power blast hit the membrane, Baelin’s body was launched backwards. But weirdly, not a drop of blood flew out.\u003c/p\u003e\n\u003cp\u003eWhile Baelin was still in the air, his armour changed significantly.\u003c/p\u003e\n\u003cp\u003eFleshy membranes hardened to form real armour, and the dozens of eyes merged into thirteen big ones that were scattered along it. This terrifying appearance, was the most powerful form of the Bio Boosting armour.\u003c/p\u003e\n\u003cp\u003e*Bzzz!* The purple corrosive energy still attacked Baelin’s body, but it was nothing in front of his armour. There wasn’t even a tiny depression formed.\u003c/p\u003e\n\u003cp\u003eThis fact stupefied the twin Magi. They looked at each other, and immediately came to an accord. “Run!”\u003c/p\u003e\n\u003cp\u003eMagi who could defend against a joint attack of theirs were far more powerful than they could handle. They did not want to be thrown out this easily.\u003c/p\u003e\n\u003cp\u003e“You!” Baelin was about to blow his top, and jumped forward in a rage.\u003c/p\u003e\n\u003cp\u003e*Crack!* Pits were formed under Baelin’s feet as his jump landed him in front of the twins in an instant.\u003c/p\u003e\n\u003cp\u003e“Die!” Baelin raised his cross blade. Baelin’s strength was already at the peak of rank 1 Magi, approaching the boundary of rank 2. Once he made up his mind, it was easy to kill mere semi-converted Magi like them.\u003c/p\u003e\n\u003cp\u003e*Pup!* The cross blade ran through the neck of one Magus, then a light came out of his body.\u003c/p\u003e\n\u003cp\u003eHis body was covered by a milky light column, and disappeared immediately.\u003c/p\u003e\n\u003cp\u003e“You go along with him!” Baelin took no pity on them this time, and shoved his cross blade into the other’s heart.\u003c/p\u003e\n\u003cp\u003e*Peng!* This one disappeared into the white lights as well.\u003c/p\u003e\n\u003cp\u003eAfter killing the twin brothers, Baelin took a milky amulet out of his pocket.\u003c/p\u003e\n\u003cp\u003e*Beep!* After a flash, the number in this amulet turned from 1 to 3. Baelin stared at this in a daze, a wry smile on his lips…\u003c/p\u003e\n\u003cp\u003eOutside the secret plane, in the middle of the arena.\u003c/p\u003e\n\u003cp\u003eA light column burst out, an indistinct figure inside it.\u003c/p\u003e\n\u003cp\u003e“Quick! Medicine!” The host ordered with experience.\u003c/p\u003e\n\u003cp\u003eSeveral Magi dressed in milky robes with the symbol of a snake and cross rushed around.\u003c/p\u003e\n\u003cp\u003eAfter the light dissipated, the Magus who was eliminated first showed up, his face pale and the wound on his neck bleeding.\u003c/p\u003e\n\u003cp\u003e“I will stop bleeding first, prepare the life spell!” The medical team consisted of healing Magi, several of whom emitted energy fluctuations at the peak of rank 1.\u003c/p\u003e\n\u003cp\u003eA milky light bathing him, the wounded Magus was cured and the wound on his neck disappeared.\u003c/p\u003e\n\u003cp\u003eA second later, his younger brother was also sent out, and the medicine team took care of him as well.\u003c/p\u003e\n\u003cp\u003eUp in the platform, what happened just now was seen by Leylin, but he had an impulse of cover his eyes.\u003c/p\u003e\n\u003cp\u003e“Very adaptable, but still stupid! It seems that the years of exile and adventure taught him nothing. Fortunately, I didn’t tell anyone that I taught him! What an embarrassment…”\u003c/p\u003e\n\u003cp\u003e“Look! Haylon and Carl ran into each other!”\u003c/p\u003e\n\u003cp\u003e“The stars of the competition meet, this should be a good show!” Some Magi smiled gloatingly.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-373\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-375\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-374","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
