{"id":58934,"no":378,"title":"Chapter 378","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eChannelling Of Lifeforce\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“These aren’t just the people of the revolutionary army!” Baelin stared at the many black-robed Magi and his expression darkened.\u003c/p\u003e\n\u003cp\u003e“Haha… Of course!” At this moment, Longbottom had no more qualms. “The matriarchs of the dark elves have already infiltrated this area. Not long after, blood will flow, and the dark elves will rule the subterranean world!”\u003c/p\u003e\n\u003cp\u003eLongbottom’s face was slightly flushed.\u003c/p\u003e\n\u003cp\u003e“You lunatic!” Baelin roared, and charged at Longbottom.\u003c/p\u003e\n\u003cp\u003e“Life Absorption!”\u003c/p\u003e\n\u003cp\u003eLongbottom shouted, and a large phantom image of a spider appeared behind him.\u003c/p\u003e\n\u003cp\u003eCompared to the last few times, the image had become even larger and even held a terrifying aura. From the eyes of the spider, a very human light could be seen, as if it now held an intelligence of its own and had now become alive.\u003c/p\u003e\n\u003cp\u003e“Aru!” Baelin whistled for a while, and a gold phantom darted out from within a small crack amongst the spectators and dropped to the ground. Its figure suddenly increased in size, and in the blink of an eye, it was two stories tall.\u003c/p\u003e\n\u003cp\u003eThis was a giant, golden Underground Winter Spider. The stripes on its body gave it a very elegant feeling, and the phantom image on Longbottom’s back kept snarling, as if its honour was being challenged.\u003c/p\u003e\n\u003cp\u003e“Underground Winter Spider Emperor! So you are really the sinner responsible for the theft of the sacred creature!”\u003c/p\u003e\n\u003cp\u003eThe cold glint in Longbottom’s eyes expanded, and several greyish-green streams of air rose from his body.\u003c/p\u003e\n\u003cp\u003e“Ah!” “Ah!”\u003c/p\u003e\n\u003cp\u003eTwo short yelps were heard.\u003c/p\u003e\n\u003cp\u003eThese belonged to the two official Magi who were unfortunately struck by the stray streams of air. The moment they had contact with the greyish-green air, their bodies wilted and they turned into dried corpses that had died in an incomparably pitiful manner.\u003c/p\u003e\n\u003cp\u003e“You dare rob life force that does not belong to you. You’ll be devoured by it sooner or later!”\u003c/p\u003e\n\u003cp\u003eBaelin’s expression was dark as he rode the Underground Winter Spider Emperor, looking like a gallant knight.\u003c/p\u003e\n\u003cp\u003e“How would you understand how brilliant Life Absorption is?” Longbottom merely gave a cold answer to Baelin. Meanwhile, the giant spider phantom image pounced forward, the strange streams of air like black holes that greedily sucked in the life force within Baelin.\u003c/p\u003e\n\u003cp\u003eBaelin’s expression became grim as he patted the Underground Winter Spider Emperor he was on and collided with Longbottom.\u003c/p\u003e\n\u003cp\u003eThe energy particles formed from the clash between two rank 2 Magi created havoc as they sent a few people unlucky enough to be hit by stray particles flying. They were seriously injured.\u003c/p\u003e\n\u003cp\u003eWithin the greyish-green vortex, a knight on a giant golden spider was emanating red light. He looked like an ancient dragon-slaying prince as he charged towards the heart of the vortex.\u003c/p\u003e\n\u003cp\u003eThe battle kept changing location and caused a few stages to be completely destroyed.\u003c/p\u003e\n\u003cp\u003eAt this moment, the nine judges were trapped. The rank 2 Magi were already the most powerful in this entire competition area.\u003c/p\u003e\n\u003cp\u003eThe result of Baelin and Longbottom’s match could even decide the life or death of all the Magi here!\u003c/p\u003e\n\u003cp\u003eHence, even while battling with the revolution army and dark elves, many Magi tried to spare some energy and watch the battle.\u003c/p\u003e\n\u003cp\u003eWhat attracted their interest the most were the nine ice sculptures on the platform!\u003c/p\u003e\n\u003cp\u003eThese Magi knew very well that a small part of their chances of survival depended on Baelin, while most of it depended on whether these rank 2 Magi could break out of their restrictions.\u003c/p\u003e\n\u003cp\u003eEven Longbottom would be reduced to dust under the combined attacks of nine rank 2 Magi.\u003c/p\u003e\n\u003cp\u003e“Cough! Wake up, my lords!”\u003c/p\u003e\n\u003cp\u003eAt this moment, light flashed in a corner and a grey-haired Magus appeared.\u003c/p\u003e\n\u003cp\u003eHe mumbled spell incantations, a huge blazing fireball striking the nine sculptures and turning the podium made of gold and silver into a sea of fire.\u003c/p\u003e\n\u003cp\u003eThis Magus despaired as he saw the flames soon dying out under a layer of white frost. Dense icy mist lingered and froze the whole podium into ice and snow.\u003c/p\u003e\n\u003cp\u003eMeanwhile, not even a corner of the nine ice sculptures had melted.\u003c/p\u003e\n\u003cp\u003e“What a waste of energy. This is the icy air from the abyss and is a rank 2 spell which can be sustained for a long time.” Longbottom watched on and began to laugh coldly.\u003c/p\u003e\n\u003cp\u003eWithout waiting for his orders, a few dark elf special guards in black-robes charged forward and began to battle with the Magus in grey robes. Not long after, a sharp dagger pierced into his chest.\u003c/p\u003e\n\u003cp\u003eAfter seeing this, the many Magi who had plans to rescue him all fell silent, putting away all thoughts of rescuing the judges.\u003c/p\u003e\n\u003cp\u003eMost of them wanted to break away from their opponents and successfully leave this place.\u003c/p\u003e\n\u003cp\u003eAt this moment, the battles in the area became more brutal and intense.\u003c/p\u003e\n\u003cp\u003eOutside the competition area, everything had yet to die down.\u003c/p\u003e\n\u003cp\u003e*Teng! Teng! Teng! Teng!*\u003c/p\u003e\n\u003cp\u003eAt the horizon far away, a black line suddenly appeared. It gradually closed in and the two ends began to shrink, and it felt like the line would surround the whole competition area.\u003c/p\u003e\n\u003cp\u003eWhen the black shadows came closer, it could be seen that they were actually the elite Underground Winter Spider knights. There were a great number of dark elven Magi, which included multiple matriarchs and even Anya.\u003c/p\u003e\n\u003cp\u003e“Seal off that area and don’t let any human get away” Anya commanded, and then pointed at the cocoon in the middle, a gentle voice transmitted to every knight’s ears.\u003c/p\u003e\n\u003cp\u003e“Fight for Her Majesty!” “Fight for Her Majesty!”\u003c/p\u003e\n\u003cp\u003eThe many dark elven Underground Winter Spider knights cheered and then began their attacks.\u003c/p\u003e\n\u003cp\u003e“Prepare for Joint Earth Pitfalls Spell! Begin!”\u003c/p\u003e\n\u003cp\u003eAt this moment, brownish-yellow lights flashed and countless depressions appeared in front of the Underground Winter Spider knights. They were like long trenches, with earthen spikes piercing upwards and stopping the knights in their tracks.\u003c/p\u003e\n\u003cp\u003eThere were a few knights who had moved too quickly and fallen into the trench, their chests, arms, thighs, and even faces pierced through like skewered meat. Those who had yet to die kept howling in pain.\u003c/p\u003e\n\u003cp\u003eThree figures appeared in mid-air, causing Anya to furrow her brow slightly.\u003c/p\u003e\n\u003cp\u003e“The protectors of the east, west, and south have all arrived. What about that old Guardian of the Realm?”\u003c/p\u003e\n\u003cp\u003e“I’m right here. I wouldn’t need you to worry about me!”\u003c/p\u003e\n\u003cp\u003eGreen light flashed, and the the old protector appeared before Anya. Though he seemed weak and did not have much of an aura, Anya looked as if a great enemy had appeared in front of her.\u003c/p\u003e\n\u003cp\u003e“I didn’t expect you, Anya, to use the dark elves’ crown as a means to enter Twilight Zone without letting even the dark elven knights know about it…” He smiled slightly while greeting her.\u003c/p\u003e\n\u003cp\u003eThe crown of the dark elves was a sign of the authority of the Dark Elven Empire. It was also a very powerful magic artifact.\u003c/p\u003e\n\u003cp\u003eIt had a very simple function, which was to conceal the energy aura of a large group of people and their mounts. The key point was that it could turn around the battle. However, every time it’s used, it can only be used again after a fifty-year wait, which is why this inherited magic artifact of the magic elves could not be used flippantly.\u003c/p\u003e\n\u003cp\u003eNow, the dark elven crown could finally exhibit all its strength and shield numerous dark elven armies into the central region, almost wiping out all the Magi at the competition area.\u003c/p\u003e\n\u003cp\u003e“Except for the protector of the northern region who has died, all of the lord protectors are here. What’s this? Do you want to stop me?” A little green vortex appeared above Anya’s hands, glimmering with a mysterious light. It attracted the attention of everyone to look at the vortex, which had the intention of sucking human spirits in.\u003c/p\u003e\n\u003cp\u003e“Protecting Twilight Zone and the human race was our vow when we took on the role as protectors. This is an honour worthy of exchanging our lives for!”\u003c/p\u003e\n\u003cp\u003eThe Guardian’s face was filled with layers of wrinkles and he looked about to die of old age. However, his eyes still shone with light.\u003c/p\u003e\n\u003cp\u003eAnya sensed that, although the life force of the Guardian was like a flame that was sputtering out, it still emanated light and warmth that even caused her to be worried.\u003c/p\u003e\n\u003cp\u003eThe allied Magus army appeared behind these few protectors confronted the dark elves.\u003c/p\u003e\n\u003cp\u003e“The plan was actually leaked out. Who was it?”\u003c/p\u003e\n\u003cp\u003eAnya’s brows furrowed and then straightened out, “Whatever it is, we’ve finally restrained your nine rank 2 Magi. There are still many elite Magi and acolytes within the competition area. In other words, we have a sure victory in this war!”\u003c/p\u003e\n\u003cp\u003e“Attack!” Without waiting for the opposing Magi to finish their preparations, Anya immediately ordered for the dark elven matriarchs to attack.\u003c/p\u003e\n\u003cp\u003eWith a flash of her body, she somehow disappeared from the air and, when she reappeared, she was in front of the Guardian of the Realm.\u003c/p\u003e\n\u003cp\u003eA fair palm brought with it a terrifying devouring strength and was pressed towards the old man’s chest.\u003c/p\u003e\n\u003cp\u003e“Floating Light!” The light in the old protector’s eyes became brighter and he exclaimed.\u003c/p\u003e\n\u003cp\u003eNumerous tiny rays of light surged out continuously and formed a protective shield in front of him.\u003c/p\u003e\n\u003cp\u003eThe moment Anya’s hand made contact with the shield, a low sound was produced, and the ground suddenly trembled, the space even beginning to quiver.\u003c/p\u003e\n\u003cp\u003e“Old geezer, how much longer can your life force sustain you?”\u003c/p\u003e\n\u003cp\u003eAnya’s expression remained unchanging as she continued her attacks.\u003c/p\u003e\n\u003cp\u003eA tremendous vortex formed behind her, and any Magus that was sucked into it, turned into a dried corpse in an instant.\u003c/p\u003e\n\u003cp\u003e“Activating combination spell pattern!”\u003c/p\u003e\n\u003cp\u003eThe expressions of the protectors of the other three regions changed greatly, and as if they had made up their minds. They headed into the skies, shooting out great amounts of green threads that connected with the Guardian of the Realm.\u003c/p\u003e\n\u003cp\u003eTremendous rays from light force wrapped around him, and the next time he reemerged, he had already become a handsome and sunny middle-aged man.\u003c/p\u003e\n\u003cp\u003eIf not for the familiar spiritual aura about him, nobody would recognise him.\u003c/p\u003e\n\u003cp\u003eAs for the three other protectors, they began to age visibly.\u003c/p\u003e\n\u003cp\u003e“Good! Good! Good!”\u003c/p\u003e\n\u003cp\u003eAnya bit her lips. She could naturally see that the three rank 2 Magi were entrusting their life force to the Guardian. However, this meant that, after today, the four of them would have all their life force consumed and lose their lives.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-377\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-379\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-378","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
