{"id":58936,"no":380,"title":"Chapter 380","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eBaloney\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Don’t be silly!” Vinas laughed weakly as she reached out and caressed Aaron’s face.\u003c/p\u003e\n\u003cp\u003e“Sacrificing me, a single person, will allow you to save the entirety of Twilight Zone, what’s there to hesitate?”\u003c/p\u003e\n\u003cp\u003eAt the present moment, although her lips have gone pale and chapped from the loss of blood, her face remains full of radiance and it hurt Aaron to see her like this.\u003c/p\u003e\n\u003cp\u003e“No! You’re doing this for me! You’re doing this for me!”\u003c/p\u003e\n\u003cp\u003eAdvancing to the second rank did not ensure that he could match up to Longbottom, but it would at least greatly increase his chances of escape.\u003c/p\u003e\n\u003cp\u003eAaron wept, tears flowing down his face uncontrollably.\u003c/p\u003e\n\u003cp\u003eVinas laughed, her tone full of gratification “This impermanent fate! We were destined to be enemies, yet we fell in love… with each… other”\u003c/p\u003e\n\u003cp\u003e*Bang!* Vinas’ palm fell listlessly.\u003c/p\u003e\n\u003cp\u003eShortly after, a strong current of concentration, along with a warm and gentle scent, was injected into Aaron’s consciousness.\u003c/p\u003e\n\u003cp\u003eSacred Flame started to revolve quickly, causing Aaron’s aura to rise sharply, and he broke through the bottleneck of a rank 2 Magus.\u003c/p\u003e\n\u003cp\u003e*Snap! Snap! Snap!*\u003c/p\u003e\n\u003cp\u003eThe three parts of Meteor Sword assembled together, emitting bright silver rays, and from the light, a tall and thin sword shaped like a cross slowly appeared. The aura of a high-level magic artifact, also much closer to the level of becoming a magic weapon, spread out in a powerful manner.\u003c/p\u003e\n\u003cp\u003e“AAAAAAAAHHH!!!!”\u003c/p\u003e\n\u003cp\u003eAaron roared as he lifted the Meteor Sword and he transformed into a long arc as he charged into the midst of the battlefield.\u003c/p\u003e\n\u003cp\u003eAny magi who obstructed the path, be they from the Twilight zone or from the Dark Elven Empire, all faded into the air under the power of the Meteor Sword.\u003c/p\u003e\n\u003cp\u003e“What’s the matter?”\u003c/p\u003e\n\u003cp\u003eIn the middle of the battlefield, Longbottom stared at the huge incoming arc. With fierce eyes, he stopped toying with Baelin. A fireball aimed right at his head hit him.\u003c/p\u003e\n\u003cp\u003e*Pew!* The Meteor Sword released a ray of light, accurately targeted at the attack launched by Longbottom.\u003c/p\u003e\n\u003cp\u003eA great and powerful wave of energy surged forth like raging waves.\u003c/p\u003e\n\u003cp\u003eAlthough at this moment Longbottom could still kill Baelin, he would definitely suffer huge amounts of damage.\u003c/p\u003e\n\u003cp\u003e“Rank 2?” Longbottom’s pupils froze. Energy at this level, in addition to a high-level magic artifact designed for offence, was a great threat to him.\u003c/p\u003e\n\u003cp\u003eAs such, Longbottom made a choice. Without moving his body, his quickly moved backwards, layers of grey-green protective shields formed in front of his vision.\u003c/p\u003e\n\u003cp\u003e“Kill!” In the middle was Aaron’s silhouette. At this moment, as he charged forward with the mighty sword, silver threads of spiritual force continued to condense onto the arc, causing the sharpness of this high-level magic artifact to increase exponentially.\u003c/p\u003e\n\u003cp\u003e*Bang! Bang!* The protective shield set up by Longbottom was torn apart like crisp paper, and the blade of the sword even touched Longbottom’s eyes.\u003c/p\u003e\n\u003cp\u003e“Are you trying to kill me? With just you alone?” Longbottom had a sinister expression on his face, and the shadow of a spider appeared on his body, with its mouth wide open, clasping directly on the long sword.\u003c/p\u003e\n\u003cp\u003eSnap!\u003c/p\u003e\n\u003cp\u003eThe sound of a slight explosion rang in the air, following which, the silhouette of two people flew away, retreating.\u003c/p\u003e\n\u003cp\u003eLongbottom stroked his face, as below his left eye, a stream of blood flowed.\u003c/p\u003e\n\u003cp\u003eWhereas on the other end, Aaron\u0027s arm produced a bone crunching noise as he quickly retreated to where Baelin was.\u003c/p\u003e\n\u003cp\u003e“You… are you alright?” Baelin finally expelled the Corrosive spell’s energy left by Longbottom within himself and he stood up.\u003c/p\u003e\n\u003cp\u003eAlthough he did not witness the previous scene, he felt that the expression on his friend’s face was not right.\u003c/p\u003e\n\u003cp\u003e“Your strong armor has been damaged! Use this!” Aaron glanced at Baelin. He then passed the cross-shaped sword in his hand to Baelin. “The energy it can display in your hands will be much much greater than what it displayed in mine”\u003c/p\u003e\n\u003cp\u003eNow was not the time for idle talk, Baelin immediately took over the Meteor Sword, but the deathly stillness in Aaron\u0027s eyes still frightened him.\u003c/p\u003e\n\u003cp\u003e“This again! This again! Why is it that everytime I am about to succeed, there will always be more obstructions sprouting up?” On the other side, Longbottom observed this scene with a grim complexion.\u003c/p\u003e\n\u003cp\u003e”So what? Having one more rank 2 Magus does not change anything! You will all die here today!”\u003c/p\u003e\n\u003cp\u003eLongbottom roared. The phantom spider on his back suddenly did something unpredictable.\u003c/p\u003e\n\u003cp\u003eIt ruthlessly widened its mouth and plunged its sharp incisors into Longbottom’s shoulders.\u003c/p\u003e\n\u003cp\u003eStrings of red which were visible to the naked eye was extracted from Longbottom’s body. And the spider image on his back grew redder and started to expand.\u003c/p\u003e\n\u003cp\u003eAlthough Longbottom’s body continued to become thin and weak, leaving only skin and bones, which looked terrifying, the energy in his body was increasing exponentially, as though there was no limit.\u003c/p\u003e\n\u003cp\u003e“Dark Elven Ritual of Life! We cannot let him complete it or he will advance into the peak of rank 2, even though he will have to pay for it with his life...”\u003c/p\u003e\n\u003cp\u003eAaron\u0027s voice grew hoarse, but he immediately transformed into a silvery arc as he rushed at him.\u003c/p\u003e\n\u003cp\u003e”Old friend Aru! This time I will not hesitate and be benevolent. Just you wait, I will save you!”\u003c/p\u003e\n\u003cp\u003eBaelin gripped the Meteor Sword tightly. This melee weapon, when in the hands of a powerful warrior, also let out a deafening screech.\u003c/p\u003e\n\u003cp\u003e“Kill!” Baelin had a face of determination. The eye on his armor opened once again, and a huge restrictive aura suddenly arrived at the site, aimed at Longbottom who was in the center.\u003c/p\u003e\n\u003cp\u003e“Haha… Come! Come!”\u003c/p\u003e\n\u003cp\u003eLongbottom who had a stick-thin figure laughed wildly, and engaged Aaron and Baelin.\u003c/p\u003e\n\u003cp\u003e*Bang!* After the ritual of life, not only did his aura increase, it seemed to have experienced a transformation, allowing him to gain a huge boost.\u003c/p\u003e\n\u003cp\u003eHe raised his bony right arm against the Meteor Sword in Baelin’s hands.\u003c/p\u003e\n\u003cp\u003e*Bang bang!* The two came into contact, letting out a horrifying sound of metal brushing against metal. The Meteor Sword in Baelin’s hand could only cut the skin on Longbottom’s hand, following which it was blocked by Longbottom’s arm which was stronger than steel.\u003c/p\u003e\n\u003cp\u003e“Huh!” Baelin face was full of shock, he chopped another time, but the long sword that pierced Longbottom’s face was stopped by his teeth clenching hard.\u003c/p\u003e\n\u003cp\u003e“Sacred Flame!”\u003c/p\u003e\n\u003cp\u003eAaron pointed at Longbottom, a wave of pure white blaze laced with threads of silver fell, causing the area around Longbottom\u0027s body to burn.\u003c/p\u003e\n\u003cp\u003eLongbottom’s Magus robe, rings and accessories were all melted in the blazing fire but his body remained intact, just like sturdy metal.\u003c/p\u003e\n\u003cp\u003e“What is happening?” Jumping on this chance, Baelin finally drew out the long sword, standing up with Aaron who had retreated to a corner.\u003c/p\u003e\n\u003cp\u003e“The Ritual of Life has begun, and at this point his life does not belong to him, it belongs to the noble Mother of the Abyss. Simply put, the source of his life has been transferred and his body is only a puppet now. Whatever harm we inflict upon his body won’t have any effect.”\u003c/p\u003e\n\u003cp\u003eAaron\u0027s face turned serious, with a hint of frantic “But his ritual of life has not been completed, so the core should still be in the process of transferring, later I will control and mark him, take care of the rest!”\u003c/p\u003e\n\u003cp\u003e“Got it!” Baelin nodded “How are you going to…” he could not finish talking before Aaron madly dashed in.\u003c/p\u003e\n\u003cp\u003e“Die!” Longbottom watched Aaron charge towards him, his eyes full of vengeance and violence.\u003c/p\u003e\n\u003cp\u003eHe abruptly sent out a fist. The black fist collided with Aaron\u0027s chest, letting out a crisp sound.\u003c/p\u003e\n\u003cp\u003eSnap! Longbottom’s face suddenly changed and he retracted his fist. On his knuckles, a bone had already been pierced through and strands of black solidified blood could be seen.\u003c/p\u003e\n\u003cp\u003e“Wh...What’s happening? How can an ordinary Bone Piercing Spell take down my defenses!” There was a huge change in Longbottom’s expression, and he seemed to have thoughts of retreating.\u003c/p\u003e\n\u003cp\u003e*Bang! Bang! Bang!*\u003c/p\u003e\n\u003cp\u003eBut it was too late, Many silver bone piercings started to come out from Aaron\u0027s body, and his eyes turned white. Surprisingly, he was able to predict Longbottom’s retreat route. After dodging his long range attack, he clung onto Longbottom.\u003c/p\u003e\n\u003cp\u003e“Ah! Ah! Ah!”\u003c/p\u003e\n\u003cp\u003eSeveral bone piercings acted like a trap and pierced Longbottom all over, but Aaron grew even worse, blood spurting out of his body.\u003c/p\u003e\n\u003cp\u003e“Heh heh… This is my upgraded version of the Bone Piercing Spell, enjoy!”\u003c/p\u003e\n\u003cp\u003eAaron’s face was a mixture of madness and relief as he yelled, “Vinas, I am coming!”\u003c/p\u003e\n\u003cp\u003e“You lunatic!” Longbottom roared. He pounded on Aaron\u0027s back with his fists, and the great tremors even caused the ground to vibrate.\u003c/p\u003e\n\u003cp\u003e“Quick! Over there!” Aaron was bleeding from his nose and mouth, he used a sliver of spiritual force to mark out a position.\u003c/p\u003e\n\u003cp\u003eThat was on the flowery pattern on the abdomen area of the spider tattoo on Longbottom’s back. It was now shining with a silver light.\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003eBaelin’s expression was calm as a great silver aura was released, forming silver white flames.\u003c/p\u003e\n\u003cp\u003eLarge amounts of flame gathered on the Meteor Sword, a terrifying energy wave spreading throughout the entire competition venue, causing the surrounding Magi to involuntarily stop what they were doing.\u003c/p\u003e\n\u003cp\u003eThe huge wings behind Baelin rose, carrying him into the skies, causing him to look like a red meteor streaking through the skies.\u003c/p\u003e\n\u003cp\u003e“Die!” At this moment, Baelin no longer showed signs of hesitation and unwillingness. The long sword ruthlessly pierced through the defense of the spider image, the blade directly cutting through the marked position.\u003c/p\u003e\n\u003cp\u003eThe illusory spider screeched, and its eight legs started to tremble irregularly. Suddenly, it was sent tumbling down. It then turned into black smog and dispersed.\u003c/p\u003e\n\u003cp\u003e“Ugh ...glug…..” Longbottom’s expression was very weird; he looked as though he wanted to say something but could not, all that could be heard was a constant gurgling noise made within his throat.\u003c/p\u003e\n\u003cp\u003eThe light in his eyes dimmed until they were a dead black.\u003c/p\u003e\n\u003cp\u003e*Bang!* Longbottom’s corpse fell to the ground and sent a huge patch of dust flying.\u003c/p\u003e\n\u003cp\u003e“We… succeeded!”\u003c/p\u003e\n\u003cp\u003eBaelin mumbled to himself, feeling as though he lost a part of himself. He felt empty, as though he had lost something very important to him.\u003c/p\u003e\n\u003cp\u003e“Be careful, the darkness has not ended!” Both of Aaron’s eyes turned white and he fell to the ground, a pool of blood forming beneath his body.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-379\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-381\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-380","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
