{"id":58938,"no":382,"title":"Chapter 382","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eEpilogue\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“It was mainly to attain the power of destiny. The Meteor Sword was just something that came along with it. Besides, it’s not even complete!” Leylin was in a good mood as he explained the details to Baelin.\u003c/p\u003e\n\u003cp\u003eSoon after, a great number of alchemy ingredients appeared before him. Brilliant rays of light started seeping into the sword and making it shine brighter.\u003c/p\u003e\n\u003cp\u003e“The truth is, the Meteor Sword was designed by and customised for me, and it is missing the most important step!” Leylin drew the sword and held it up, his eyes glistening with excitement.\u003c/p\u003e\n\u003cp\u003e“Toxic Bile!“\u003c/p\u003e\n\u003cp\u003eThe terrifying image of a devil king started to manifest behind him. But this time round, the Toxic Bile was concentrated on the Meteor Sword instead of a large-scale attack.\u003c/p\u003e\n\u003cp\u003eMenacing, deathly strands of black crawled onto the sword and the once-bright silver glow started to dim before turning a glistening coal-black.\u003c/p\u003e\n\u003cp\u003eThis was the original intention of Leylin to forge the weapon.\u003c/p\u003e\n\u003cp\u003eThe scope of the attack by the Toxic Bile was too large. Leylin thus confined its poison within the sword, preventing it from diffusing freely.\u003c/p\u003e\n\u003cp\u003eHenceforth, anyone who was injured by the sword would immediately be poisoned. In addition, Leylin could use his own innate spells to supplement its already-great power.\u003c/p\u003e\n\u003cp\u003eLeylin looked at the dark sword shining in his hands, unable to mask his happiness. From here on, the power of Toxic Bile would not be used recklessly. Rather, it would be his common means of attack, greatly increasing his strength and power.\u003c/p\u003e\n\u003cp\u003e“There is one last procedure!” Leylin glanced over at Baelin, with a sharp look in his eyes.\u003c/p\u003e\n\u003cp\u003eBaelin had understood how this was going to turn out. He looked at Leylin and told him fearlessly, “I believe in the fairness and righteousness of Twilight Zone. You’ll be punished for everything you’ve done!”\u003c/p\u003e\n\u003cp\u003e“Haha... Fairness and righteousness ?”\u003c/p\u003e\n\u003cp\u003eLeylin shook his head and laughed, “The glory of my achievements will be recorded and sung by the people. As for the unglamorous stories behind the glory, who would pay any attention to them?”\u003c/p\u003e\n\u003cp\u003eA ray of black swooshed across. Baelin’s head was decapitated, and before it could land on the ground, both his head and body had started to decompose.\u003c/p\u003e\n\u003cp\u003eBlood splashed on the surface of the gold coin and the once brilliant shiny surface became dull. It seemed to faintly be emitting a hint of history.\u003c/p\u003e\n\u003cp\u003e“Lastly, with the sacrifice of the child of destiny! Unique magic item—Coin of Destiny, complete!“ Leylin finished his last incantation.\u003c/p\u003e\n\u003cp\u003eThe gloomy yet glowing item lay ominously in his hand.\u003c/p\u003e\n\u003cp\u003e“Unique magic item—Coin of Destiny! With the Sacred Flame at its core, and the blood sacrifice of the child of destiny, will bring forth a magic item that has an astonishing amount of power. The coin can guide us through the path of the future to a certain extent, and may produce uncertain results!”\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip tried to generate a description for the coin. However, it was very clear that even the A.I. Chip could not make an accurate judgement of its powers; after all, things such as fate and the power of destiny could not be assessed by the current A.I. Chip or expressed by data.\u003c/p\u003e\n\u003cp\u003eThe supposed unique magic item was hard to be categorised.\u003c/p\u003e\n\u003cp\u003eIn the Magus world, there were always magical items that possessed a power which surpassed magic equipment. However, the physical quality itself might be weak, while some others contain bizarre capabilities. Hence, they were not categorised the same as magic artifacts and magic equipment but had a classification of their own.\u003c/p\u003e\n\u003cp\u003eAmongst the unique magic items, some possessed limited capabilities, while there were others that display a horrifying amount of power!\u003c/p\u003e\n\u003cp\u003eA ray of silver lit up and, in a flash, Coin of Destiny had vanished into the bag Leylin was carrying.\u003c/p\u003e\n\u003cp\u003e“Kill the dark elves and the revolutionary army! As for the Magi of Twilight Zone, kill them too if they don’t pledge allegiance to me!”\u003c/p\u003e\n\u003cp\u003eLeylin looked around and inspected his surroundings.\u003c/p\u003e\n\u003cp\u003eThe Magi of Twilight Zone may have had an advantage in numbers, but the lengthy battle had exhausted them of their stamina and magic power. They were no match for the fresh Magi of Nature’s Alliance.\u003c/p\u003e\n\u003cp\u003eFurthermore, the Alliance had the support of Leylin, a rank 2 Magus.\u003c/p\u003e\n\u003cp\u003eAs time passed, the field got progressively quieter before settling for silence.\u003c/p\u003e\n\u003cp\u003e“Sire! What do I do with these captives?” Iren asked with a bow.\u003c/p\u003e\n\u003cp\u003eThere were weak and dispirited Magi all around, many of them covered with wounds and blood from multiple injuries.\u003c/p\u003e\n\u003cp\u003e“They are to hand over their spirit sources to me, kill them if they refuse!” Leylin gave the order indifferently.\u003c/p\u003e\n\u003cp\u003eSoon after, Leylin moved towards the remaining eight Magi encased in the ice sculptures and pointed at them.\u003c/p\u003e\n\u003cp\u003e“I shall add another layer of seals on these eight Magi. They will be transported back to headquarters to be interrogated by me!”\u003c/p\u003e\n\u003cp\u003eThe Magi from Nature’s Alliance were lying in ambush and the plan was carried out according to what he had planned. And sure enough, the results at the end were very favourable. The exhausted and injured Magi from both sides were eliminated at one stroke.\u003c/p\u003e\n\u003cp\u003eIn fact, Leylin was the one who notified the Guardian on the outside and asked for his assistance.\u003c/p\u003e\n\u003cp\u003e“The war outside should be ending about now?” Leylin smiled. He held up a special artifact and sent a communication signal through it.\u003c/p\u003e\n\u003cp\u003e“My Lord! Reporting on our status. The Magi on our side as well as the dark elves are severely injured. The dark elves have withdrawn their troops, but we cannot pursue due to similar losses on our end!” one of the Magi on the battlefield reported.\u003c/p\u003e\n\u003cp\u003eAny attempts at communication had been blocked long ago by Longbottom. With Leylin’s enhancement to the cocoon, only his own artifact could communicate with the outside.\u003c/p\u003e\n\u003cp\u003e“Very good! The current situation is the best of the three scenarios that I had anticipated!”\u003c/p\u003e\n\u003cp\u003eLeylin swept his eyes over the Magi from Nature’s Alliance and smiled, “As long as we follow and advance according to the plan, soon the entirety of Twilight Zone will be ours!“\u003c/p\u003e\n\u003cp\u003eLeylin had never led before, but he had experienced much in the Magus world. With his ability to influence their minds, Leylin’s words were bewitching and convincing.\u003c/p\u003e\n\u003cp\u003eAlthough there were some Magi among the crowd below that seemed to be somewhat hesitant, Leylin was pleased to see the obvious fiery ambition sparkling in their eyes, dispersing any sign of restlessness and confusion.\u003c/p\u003e\n\u003cp\u003e“As long as you are a living being with wisdom, it is difficult to remain unwavering in the face of temptation!“ Leylin rejoiced covertly in his heart but also let out a sigh…\u003c/p\u003e\n\u003cp\u003eThe news about the incident at the young genius competition spread like wildfire through the Twilight Zone.\u003c/p\u003e\n\u003cp\u003eThe leader of the revolutionary army, Longbottom, had disguised himself and snuck into the competition as a contestant. Once he was crowned champion, he plotted against the judges.\u003c/p\u003e\n\u003cp\u003eThereafter, the dark elven forces, under the conceal of their crown, joined to complete the ambush.\u003c/p\u003e\n\u003cp\u003eEven though their troops retreated in the end, a huge amount of damage was inflicted on the central region, causing numerous casualties.\u003c/p\u003e\n\u003cp\u003eThe situation of the arena was worse. The losses there were tremendous, and only a few Magi had survived.\u003c/p\u003e\n\u003cp\u003eLeylin, most powerful of the survivors as a rank 2, issued complaints about the dark elves’ conduct, calling for action from the central region.\u003c/p\u003e\n\u003cp\u003eAfter his return to the base, Leylin immediately gathered all of his Magi. Seeking the assistance of the other Magi who favoured his cause and started organising an army.\u003c/p\u003e\n\u003cp\u003eThe central region was currently in a state of tremendous chaos. A large number of high-level Magi had perished. The Guardian of the Realm, as well as the other Protectors, had all vanished without a trace as well. In the name of righteousness and for other reasons, the remaining Magi all united under Leylin’s banner.\u003c/p\u003e\n\u003cp\u003eLeylin, who was at the centre of attention, headed towards a different place on his own.\u003c/p\u003e\n\u003cp\u003eThis single empty space seemed to have emerged from the Earth’s crust, it was narrow and cramp, the continuously faint but hurried breathing could still be heard.\u003c/p\u003e\n\u003cp\u003e*Bang!* A massive explosion sounded and crushed rocks flew everywhere.\u003c/p\u003e\n\u003cp\u003eIn the midst of the mayhem, Leylin smiled as he walked forward with the Coin of Destiny in his hand, “Lord Guardian of the Realm, and Protector Logan, you both are truly very good at hiding. It took me awhile to find this place!”\u003c/p\u003e\n\u003cp\u003eLeylin took a quick glance around and realised that there were 2 dead bodies lying in this cave and on their corpses, some rank 2 energy was still present.\u003c/p\u003e\n\u003cp\u003eA half-naked old man, whose body was covered with incantations and coloured spots, leant against a rock trying to catch a breath. On the other side was a familiar face, Logan from the east. When he saw Leylin, he couldn’t believe his eyes.\u003c/p\u003e\n\u003cp\u003eIt seemed as if after the battle with the dark elves and Anya, two of the Protectors had died. Logan and the Guardian of the Realm were still struggling with their breaths.\u003c/p\u003e\n\u003cp\u003e“Why.… Why is it you?” Logan asked with a pale face.\u003c/p\u003e\n\u003cp\u003e“Oh?” Leylin raised his eyebrow, ”Looks like there are many Magi out there who miss you! So much so that you do not even dare to go back to your old nest, preferring to hide outside…”\u003c/p\u003e\n\u003cp\u003eBut he didn’t mind because, in the face of true power and capability, any crafty conspiracy would seem like a joke.\u003c/p\u003e\n\u003cp\u003e“How did you find us? Forget it, that is not important right now. I just want to know, young Magus, do you belong to us or the dark elves?” the Guardian by the wall struggled to ask.\u003c/p\u003e\n\u003cp\u003e“There’s no need to worry. The dark elves are not rich enough to bribe me! As for Twilight Zone’s Magi, they shall step on the path to glory under my leadership!”\u003c/p\u003e\n\u003cp\u003e“Well then! Go ahead!” the Guardian smiled, his eyes gleaming with wisdom.\u003c/p\u003e\n\u003cp\u003e“....” Leylin bowed slightly in respect to the Guardian who dedicated his whole life to serve the Twilight Zone. Soon after, a thick black darkness shrouded the entire area.\u003c/p\u003e\n\u003cp\u003eThe border between the northern and central region of the Twilight Zone.\u003c/p\u003e\n\u003cp\u003eAt this moment, in an open plain, two enormous armies were about to confront each other.\u003c/p\u003e\n\u003cp\u003eOn the north was the dark elven army, their skilled knights riding Underground Winter Spiders and emitting continuous energy waves from their bodies.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-381\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-383\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-382","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
