{"id":58941,"no":385,"title":"Chapter 385","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAllegiance\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe rank 2 Magus deferentially accepted the order and left, and minutes later, a rank 2 dark elven matriarch in skintight clothing walked in.\u003c/p\u003e\n\u003cp\u003eHer face was extremely delicate, her skin pale and exquisite. She was evidently a beauty that was hard to come by, though her expression now held apprehension.\u003c/p\u003e\n\u003cp\u003e“Alicia! As expected, it’s you!” Leylin laughed.\u003c/p\u003e\n\u003cp\u003eOut of all the dark elves, it was just this one matriarch that he had been standing against for ten or so years in Dolon City, and they could somewhat be considered acquaintances.\u003c/p\u003e\n\u003cp\u003e“Alicia greets the lord Guardian of the Realm!” The dark elven matriarch Alicia bit her lips, and then knelt and leaned down, respectfully touching her head to the cold ground.\u003c/p\u003e\n\u003cp\u003eShe was still slightly dazed. This young Magus that had contested with her for over ten years had long since reached the apex of the Magus World and had left her far behind. When she saw him, she even needed to kneel. She did not want to do this, yet could not express it on the outside.\u003c/p\u003e\n\u003cp\u003eFrom Leylin’s point of view, he took in everything, from the pretty and flirtatious matriarch’s exquisite jade-like back, rounded taut buttocks, to her slender, firm thighs.\u003c/p\u003e\n\u003cp\u003eAs if noticing Leylin’s gaze, a look of bashfulness appeared on Alicia’s face, but she secretly wriggled her body, revealing a silent charm.\u003c/p\u003e\n\u003cp\u003eIn her heart, however, she felt an intense feeling of humiliation.\u003c/p\u003e\n\u003cp\u003eThough dark elves were very open when it came to promiscuity to the point they could have boy toys of different races as well, it was always the dark elves dominating in the psychological aspect, with their mental belief in their stance as masters and owners who were untouchable.\u003c/p\u003e\n\u003cp\u003eBut now? This experience of offering herself up as a gift and fearing the other party not accepting was difficult for Alicia, a matriarch of fewer than 200 years and a very mentally sensitive dark elf.\u003c/p\u003e\n\u003cp\u003e“So what is your intention in coming here?” Leylin withdrew his gaze. He had always been able to control himself when it mattered.\u003c/p\u003e\n\u003cp\u003eIn addition, after advancing to be a rank 3 Warlock and taking over as the Guardian of the Realm, there were more than enough women wanting to climb into his bed. There had even been dark elves who had attempted this— after the great defeat of the dark elves, there was a large dive in the prices of dark elven slaves in the slave market, and there were many dark elven nobles on sale! It had to be said that because of their great outer appearance and innate skill at magic, dark elves were truly the most suitable choice to be Magus slaves.\u003c/p\u003e\n\u003cp\u003eEven if Leylin did not express anything, there would be Magi racking their brains on how to please him and sending him captive dark elves for him to enjoy.\u003c/p\u003e\n\u003cp\u003e“I represent the dark elven race and am here to offer my allegiance to my lord! Please let my race go!” Alicia’s voice brought with it sorrow as she continued kneeling, passing over a fine crown and a black crystal.\u003c/p\u003e\n\u003cp\u003e“This is the symbol of our power—the dark elven crown, as well as the complete volume of the high-grade meditation technique, ‘Life Absorption.’ We dark elves are willing to completely withdraw from north Twilight Zone, even pulling back till the north of the river. We will also supply top-grade exclusive slaves and many precious resources. Please let us off!” Alicia continued to beg while kowtowing.\u003c/p\u003e\n\u003cp\u003e“This…” Leylin pondered, fingers circling and rapping to create a regular rhythm.\u003c/p\u003e\n\u003cp\u003eAlicia’s breath almost stopped, awaiting the judgement of destiny in terror and anticipation.\u003c/p\u003e\n\u003cp\u003e“Fine.” Leylin nodded in agreement.\u003c/p\u003e\n\u003cp\u003eAfter the human race’s allied force recovered the northern region, it lacked the ability to advance and gain more.\u003c/p\u003e\n\u003cp\u003eIn addition, Leylin still had other ideas.\u003c/p\u003e\n\u003cp\u003eAn absolute power meant that once the human race completely extinguished the dark elves, gnomes, and dwarves with his help, they could very well decline quickly due to internal strife. This was not what Leylin wanted to see.\u003c/p\u003e\n\u003cp\u003eA constant, unyielding external pressure would evidently be able to serve the function of spurring on the humans.\u003c/p\u003e\n\u003cp\u003e“Many thanks, my lord!” Alicia was so elated she was on the verge of tears.\u003c/p\u003e\n\u003cp\u003eThough Leylin could immediately enjoy the enthusiastic desire of this matriarch to serve him, he still chased her out.\u003c/p\u003e\n\u003cp\u003eIt was obvious that Alicia’s value could not compare to the dark elven crown and high-grade meditation technique.\u003c/p\u003e\n\u003cp\u003e“Magic equipment— Dark Elven Crown!”\u003c/p\u003e\n\u003cp\u003eLeylin caressed the surface of this magic equipment. As it had been used recently in the war, the crown’s surface was dim, and it seemed unremarkable.\u003c/p\u003e\n\u003cp\u003eIf not for knowing about it beforehand, Leylin might have been tricked by its outer appearance and missed this magic equipment.\u003c/p\u003e\n\u003cp\u003eIn the world of the Magi, magic equipment ranked far above magic artifacts. They held a mysterious power within, and usually, only Magi at rank 3 and higher would have the opportunity to come into contact with one.\u003c/p\u003e\n\u003cp\u003e[Discovered magic equipment, beginning scan!]\u003c/p\u003e\n\u003cp\u003e[Beep! Scanning complete. 45.9% could not be analysed. Obtained high-grade concealing and icy runes, as well as traces of incomplete high-grade illusory spell formation runes…]\u003c/p\u003e\n\u003cp\u003eMany prompts from the A.I. Chip appeared.\u003c/p\u003e\n\u003cp\u003e“This is just the start. If I can completely analyse the inner workings of this magical device, I might even be able to forge my own…”\u003c/p\u003e\n\u003cp\u003eLeylin could tell that this was a great opportunity for him. He had been unable to improve his alchemy and high-grade enchantment skills in recent times.\u003c/p\u003e\n\u003cp\u003e“And this!” Leylin picked up that black crystal.\u003c/p\u003e\n\u003cp\u003eLarge amounts of information streamed in front of Leylin’s eyes. They were written in the dark elven language, but this was nothing important. Earlier in the eastern region, Leylin had obtained much fundamental academic content through the library in Nature’s Alliance. Things like the dark elven language were nothing much.\u003c/p\u003e\n\u003cp\u003e“Life Absorption!” This was a high-grade meditation technique passed down by the dark elves. Only dark elves who were as powerful as matriarchs were qualified to train in it.\u003c/p\u003e\n\u003cp\u003eFrom this, it could be seen that Longbottom had really been doing well with the dark elves, and had gained their trust.\u003c/p\u003e\n\u003cp\u003e“This meditation technique…” Leylin touched his chin, recalling the information the A.I. Chip had just recorded.\u003c/p\u003e\n\u003cp\u003eEven though this bit of time was not enough for him to completely analyse the meditation technique, he largely knew its characteristics and uses.\u003c/p\u003e\n\u003cp\u003eLife Absorption was obviously rated as high-grade and was in the top class even in Twilight Zone. If not, dark elves themselves had many high-grade meditation techniques. Why would they make it a rule that it was a meditation technique to be passed down?\u003c/p\u003e\n\u003cp\u003eThe characteristic of Life Absorption was that it could increase the spiritual force by robbing life force from other creatures, thus helping with breakthroughs.\u003c/p\u003e\n\u003cp\u003eThe higher the level, the easier it was to gain the life force of various creatures. At the end, it could even cause a deathly vortex that was similar to a calamity, and all creatures in range would be attacked regardless of what they were.\u003c/p\u003e\n\u003cp\u003eHowever, this meditation technique did have its disadvantages.\u003c/p\u003e\n\u003cp\u003eAs it relied on robbing life force to improve, its foundations were not stable. There had not even been a single matriarch who could break through from the rank 3 level into the Morning Star realm.\u003c/p\u003e\n\u003cp\u003eBesides, when one reached the more profound parts of the meditation technique, the Magus himself or herself would find their life force disappearing. This could not be compensated with any method other than the life force of other creatures.\u003c/p\u003e\n\u003cp\u003eThe moment the life energy gained was too immense, or if the Magus’ rank was too high, the Magi who trained in Life Absorption would lose their life force at a faster rate.\u003c/p\u003e\n\u003cp\u003eThis meant that every time Magi who trained in Life Absorption used it, it meant they were one step closer to the abyss of death. However, with the growth of strength and the later loss of life force, it was like a drug that influenced many Magi to use it and eventually destroy themselves.\u003c/p\u003e\n\u003cp\u003e“To cultivate in this sort of meditation technique, it’s best to find an ancient creature with enough life force and drain all its life force, succeeding in training in this meditation technique all at one go.”\u003c/p\u003e\n\u003cp\u003eLeylin’s plentiful experience allowed him to think of a few methods to solve this issue, but he then shook his head.\u003c/p\u003e\n\u003cp\u003e“It’s not just the difficulty in advancing in meditation techniques. Ancient creatures that have great life force cannot be underestimated by even rank 3 Magi… Unless it was their remains…”\u003c/p\u003e\n\u003cp\u003eAt this thought, Leylin naturally thought about the Icy Cave.\u003c/p\u003e\n\u003cp\u003eIf nothing unexpected happened, in the deeper parts of the Icy Cave, the Icy World held within the body of a creature with the strength of at least Morning Star strength, as well as the blood of an even more frightening existence.\u003c/p\u003e\n\u003cp\u003e“With my current strength, what will it be like if I go to the Icy World?”\u003c/p\u003e\n\u003cp\u003eLeylin was silent for a while, and a gold light suddenly flashed in his hands, a simple gold coin appeared in his palm.\u003c/p\u003e\n\u003cp\u003e*Bling!* Leylin flung the coin, and there was a sole golden arc in the air that then landed on the back of his hand.\u003c/p\u003e\n\u003cp\u003eLeylin lifted his palm and he saw the side with a skull engraved on it pointing up. Its eyes seemed to be ridiculing him with its smirk.\u003c/p\u003e\n\u003cp\u003e“It won’t end up well?” Leylin murmured, and gave up all thoughts of proceeding forth.\u003c/p\u003e\n\u003cp\u003e*Ka-cha!* Immediately after, a slight crack appeared on the surface of Coin of Destiny.\u003c/p\u003e\n\u003cp\u003eAs the unique magic item, Leylin had created by exhausting his thoughts, Coin of Destiny had the terrifying ability to predict the future!\u003c/p\u003e\n\u003cp\u003eHowever, there was also a limit. Though Leylin had given it a sacrifice using the child of destiny, as well as added much spiritual force from Sacred Flame, he did not train in this meditation technique and thus, could not obtain images and specific information. He could only approximate the judgement through positive and negative predictions.\u003c/p\u003e\n\u003cp\u003eBesides, due to the constraints from Sacred Flame’s level and the ranking of the sacrifice, there was a limit to how many times Coin of Destiny could be used.\u003c/p\u003e\n\u003cp\u003eIf he wanted predictions on rank 3 Magi and below, it could be used for a long time, but once it got up to the Morning Star realm, each usage would result in great damage to Coin of Destiny itself and then cause it to fall apart.\u003c/p\u003e\n\u003cp\u003eLeylin had asked for predictions on the situation if he headed to the icy caves. The skull head was up, implying that if Leylin really did that, it would not end up well for him.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-384\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-386\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-385","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
