{"id":58945,"no":389,"title":"Chapter 389","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eCentral Continent\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eKubler claimed to be a Magus from the central continent.\u003c/p\u003e\n\u003cp\u003eThe hometown of the great Magus Serholm, the core of the entire Magus world, The sacred land of Magi—the central continent!\u003c/p\u003e\n\u003cp\u003eAs for why Kubler was at this place, Leylin could not care less. On the contrary, he was very interested in the route Kubler had taken to get here.\u003c/p\u003e\n\u003cp\u003eIf they were to walk this path in the opposite direction, would they be able to successfully reach the central continent? Leylin spoke the question in his mind,\u003c/p\u003e\n\u003cp\u003eKubler’s face showed a moment of hesitation before he respectfully divulged the truth, ”In actual fact, the surface right above this subterranean world is the central continent! I learnt of the exact spot where the lava erupts from a research manual passed down through my family. After calculating the weaker points in the lava, I followed the pathway to arrive at this place.\u003c/p\u003e\n\u003cp\u003eHaving heard Kubler’s account, Leylin more or less understood the procedure of his entrance.\u003c/p\u003e\n\u003cp\u003eOn the whole, this was like what he had previously envisaged, and would also explain why the other party’s body had horrifying burn wounds—no matter how precise his calculations of the lava\u0027s weak points were, the flames and the high temperature were not something a rank 1 Magus could bear.\u003c/p\u003e\n\u003cp\u003eIf he had not by chanced upon the Life Vined Fruit, he might have already become a charred corpse!\u003c/p\u003e\n\u003cp\u003e“Mmm! I already settled the inconvenience with the dark elves and dwarves. You can have this as a reward for being open with your information!\" Leylin waved his hands and threw the Life Vined Fruit into Kubler’s hands.\u003c/p\u003e\n\u003cp\u003e“Thank you, my Lord!” A tinge of gratitude appeared on Kubler\u0027s face.\u003c/p\u003e\n\u003cp\u003eTo him, managing to keep his life had already been a huge reward. As for the fruit that was full of vitality, it was a welcome surprise.\u003c/p\u003e\n\u003cp\u003e*Sizzle!* A few fine red blood vessels sprouted forth from his fingers, drilled into the insides of the fruit, and started to draw large amounts of life essence.\u003c/p\u003e\n\u003cp\u003eWith a lively green radiance appearing on his body, his burn wounds recovered quickly. The scars gradually faded, eventually disappearing without a trace.\u003c/p\u003e\n\u003cp\u003eThe scene reminded Leylin of the parasitic body of the Huge Mankestre Snake he had seen as an acolyte. The two seemed to have a certain level of similarity in their abilities.\u003c/p\u003e\n\u003cp\u003eMoreover, the method of directly drawing in vitality seemed to be inspired by the meditation techniques that could absorb others\u0027 spiritual force.\u003c/p\u003e\n\u003cp\u003eOf course, those were all small matters.\u003c/p\u003e\n\u003cp\u003eHaving seen Kubler’s state improving, Leylin then asked him about the Black Serpent emblem “Also, this symbol. What meaning does it actually have?”\u003c/p\u003e\n\u003cp\u003e“What? My lord actually doesn’t know?” His response further surprised Leylin, but Kubler calmed down a moment after his reaction. \"It doesn\u0027t matter, the bloodline cannot be faked.\"\u003c/p\u003e\n\u003cp\u003eAfter seeing Leylin’s look of puzzlement, Kubler immediately explained to Leylin: “This is a symbol of our organisation—the Ouroboros Clan!”\u003c/p\u003e\n\u003cp\u003e“The Ouroboros Clan?” Leylin nodded, that name was indeed very vivid: “Is that an organisation of Bloodline Warlocks?”\u003c/p\u003e\n\u003cp\u003e“Yes! Furthermore, within the Ouroboros Clan, we only accept Warlocks who hold the bloodline of the Giant Kemoyin Serpent or its descendants!” Kubler answered very certainly.\u003c/p\u003e\n\u003cp\u003e“Additionally, a Giant Kemoyin Serpent Warlock with great power, simply by joining the Ouroboros Clan, could instantly obtain a relatively high rank…” he added after shooting Leylin a glance.\u003c/p\u003e\n\u003cp\u003e“Since this is the case, then I have nothing much to hide!” Leylin laughed. “In actual fact, I too am a wandering Magus. I came to Twilight Zone by accident and chanced upon the inheritance of the Giant Kemoyin Serpent among historical remains! It was there that I first saw the symbol of the Ouroboros Clan!”\u003c/p\u003e\n\u003cp\u003eLeylin spoke honestly. Even though he spoke vaguely, and did not reveal any real details, Kubler was smart enough to not ask further.\u003c/p\u003e\n\u003cp\u003eOn the contrary, he fed large amounts of information regarding the central continent to Leylin.\u003c/p\u003e\n\u003cp\u003eFrom this information, and records that he had obtained from ancient books, Leylin finally pieced together an image of the Sacred land of the Magi.\u003c/p\u003e\n\u003cp\u003eThe central continent was the core of the Magus World. It spanned across a huge area, and had an abundance of precious resources!\u003c/p\u003e\n\u003cp\u003eThere, official Magi were as common as the clouds, and rank 2 Magi were the elites! Rank 3 Magi were respected, although there were different ranks to them. Only Morning Star Magi truly held clout.\u003c/p\u003e\n\u003cp\u003eOrganisations in the central continent needed a Morning Star Magus to oversee their development if they hoped to grow in power. Some small organisations were occasionally built by rank 2 or rank 3 Magi, but they were short-lived, typically being destroyed after a short period of time.\u003c/p\u003e\n\u003cp\u003e\"You say we have Warlocks at the Morning Star realm overseeing the Ouroboros Clan?\" Leylin was most interested in this.\u003c/p\u003e\n\u003cp\u003eAfter all, they were rank 4 Warlocks with the bloodline of Giant Kemoyin Serpents! This was clearly his path ahead!\u003c/p\u003e\n\u003cp\u003e“Yes!” Kubler was clearly very pleased with Leylin’s usage of “we,\" with his tone and expressions being much intimate.\u003c/p\u003e\n\u003cp\u003e“Among the ranks of our Ouroboros Clan, the Grand Elder, Second Elder, and Third Elder have all reached rank 4. If they joined forces, they could even contend with a rank 5 Radiant Moon Magus! As a result, our Ouroboros Clan could be said to have some fame in the central continent!” Having said this, Kubler clearly felt proud.\u003c/p\u003e\n\u003cp\u003e“Rank 5! Radiant Moon Magus?” A doubtful expression crossed Leylin’s face, and he asked Kubler to clarify the rankings of Magi after the Morning Star realm.\u003c/p\u003e\n\u003cp\u003eOfficial Magi had a total of 9 ranks, and they were respectively termed Magi from rank 1 to 9.\u003c/p\u003e\n\u003cp\u003eAnd for every 3 ranks, there would be an extremely large bottleneck.\u003c/p\u003e\n\u003cp\u003eFrom rank 1 Magi to rank 3 Magi, and from the rank 4 Magi to rank 6 Magi, and eventually rank 7 and above, the differences between them was extremely terrifying.\u003c/p\u003e\n\u003cp\u003eThe central continent was slowly regaining the splendor of ancient times.\u003c/p\u003e\n\u003cp\u003eNot only were rank 4 Morning Star Magi becoming common, even rank 5 Radiant Moon Magi and rank 6 Breaking Dawn Magi would appear periodically.\u003c/p\u003e\n\u003cp\u003eMorning Star, Radiant Moon, and Breaking Dawn were the honorific titles of rank 4, 5 and 6 Magi respectively.\u003c/p\u003e\n\u003cp\u003e“Am I akin to a moon or sun?” Leylin laughed in his heart, “However, just a Morning Star Magus has a lifespan of more than a thousand years and possesses tremendous strength. The even greater glory and radiance rank 5 and 6 Grand Magi possess can be understood from just that…”\u003c/p\u003e\n\u003cp\u003eKubler had not discovered Leylin’s thoughts and continued to narrate, “I don’t qualify to know about what comes after the Breaking Dawn realm. Moreover, the few Magi who are at rank 6 are all the most influential leaders of the central continent, and are titled our ‘Kings!’”\u003c/p\u003e\n\u003cp\u003e“King of Magi? This term has a lot of meaning to it!” Leylin nodded.\u003c/p\u003e\n\u003cp\u003e“There are three main powers in the central continent. The Warlocks tied together by bloodlines, the Magus organisations that hold a lot of high-grade meditation techniques, and the Academies where various powers mingle with each other! Together, these three sets control over 70 percent of the resources and land of the entire continent. The rest is occupied by an assortment of human Magi and other species...”\u003c/p\u003e\n\u003cp\u003eWith Kubler’s description, a blueprint of the central continent gradually appeared in Leylin’s mind.\u003c/p\u003e\n\u003cp\u003eStrange species! Large amounts of resources! High-ranked Magi! And a larger stage and space for improvement!\u003c/p\u003e\n\u003cp\u003eA flame ignited within Leylin’s eyes, as well as an even stronger urge to immediately rush towards the central continent.\u003c/p\u003e\n\u003cp\u003eImmediately, he suppressed the desire and impulse.\u003c/p\u003e\n\u003cp\u003e“Alright! Now can you explain to me why you would risk your life to escape from the central continent?”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes that radiated coldness glanced into Kubler’s, which immediately made the latter feel a chill in his heart.\u003c/p\u003e\n\u003cp\u003e“Ac… Actually…” Kubler’s did not look good. After which he knelt down before Leylin, and placed his forehead tightly on the ground.\u003c/p\u003e\n\u003cp\u003e“Lord Leylin! Please accept me as one of your henchmen!”\u003c/p\u003e\n\u003cp\u003e“What do you mean? Please explain yourself clearly!” Leylin’s face remained unchanged. After which, he heard some untasteful stories from Kubler.\u003c/p\u003e\n\u003cp\u003eTo put things simply, Kubler had offended someone in the Ouroboros Clan, which had left him with no choice but to leave. Now, he wished to obtain Leylin’s protection so as to once again return.\u003c/p\u003e\n\u003cp\u003eHonestly speaking, from the looks of the central continent Magi, the subterranean world and other areas were all desolate. If not for the fact that he was forced into such circumstances, why would he willingly leave his hometown?\u003c/p\u003e\n\u003cp\u003e“Why do you think I can protect you?” Leylin desired to know. Before asking clearly, he would not easily promise anything.\u003c/p\u003e\n\u003cp\u003e“Of course! My lord has already achieved rank 3, and is a Giant Kemoyin Serpent Warlock, with a bright future. How can people like us rival that?” Kubler said matter-of-factly, and had a faint tone of admiration and inferiority.\u003c/p\u003e\n\u003cp\u003e“This subordinate has offended a Black Horrall Snake Warlock, who has the potential to at most grow to rank 3. The high-ranked officers of the Ouroboros Clan would definitely not side with him…”\u003c/p\u003e\n\u003cp\u003e“Growth potential?” Leylin was alarmed and understood that he heard something extremely important.\u003c/p\u003e\n\u003cp\u003e“Does My lord not know yet?” Kubler, on the other hand, had already in favour of himself, changed his address of Leylin.\u003c/p\u003e\n\u003cp\u003e“The inheritance I obtained did not contain any object in this area, please detailedly explain!” Leylin’s face looked upset. His heart had a bad omen.\u003c/p\u003e\n\u003cp\u003e“Yes! Subordinate will not hide anything!” Kubler’s attitude was extremely upright, and he had started to follow the standards of vassals; Leylin could not be bothered to correct him.\u003c/p\u003e\n\u003cp\u003eAs Kubler narrated, Leylin’s face got gloomier, and eventually was like that of the sky before an imminent storm.\u003c/p\u003e\n\u003cp\u003eflag_lw\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-388\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-390\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-389","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
