{"id":58947,"no":391,"title":"Chapter 391","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003ePlanning For The Afterlife\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“No, don’t worry! I have better plans!”\u003c/p\u003e\n\u003cp\u003eLeylin smiled faintly: “Furthermore, I still have some things to settle here….”\u003c/p\u003e\n\u003cp\u003eKubler\u0027s heart was too full of worry. He wondered whether his Lord was going to wait a hundred years for the next cycle.\u003c/p\u003e\n\u003cp\u003eMankestre Bloodline Warlocks like him did not have a long lifespan. He could, at most, last two or three hundred years. A hundred years was, to him, a significant portion of his lifespan!\u003c/p\u003e\n\u003cp\u003eBut… Kubler looked at the man whom he now served. As a vassal, the Lord has the last say, so what more could he do than laugh bitterly?\u003c/p\u003e\n\u003cp\u003e“I’ll be heading out for a while. Stay here and monitor the lava flow data, and contact me periodically using our secret imprints. In the meanwhile, use the special rocks here to make one of these. All you have to do is follow this blueprint!”\u003c/p\u003e\n\u003cp\u003eA fluorescent blue light flashed in Leylin’s eyes. It took him but a moment to form a design and imprint it into a crystal ball.\u003c/p\u003e\n\u003cp\u003eKubler’s face changed slightly as he received it, and he respectfully lowered his head. “Yes, my Lord!”\u003c/p\u003e\n\u003cp\u003e“Alright!” Moments after the order was given, Leylin transformed into a dark silhouette and disappeared.\u003c/p\u003e\n\u003cp\u003eA black streak pierced through the sky, creating friction with the air and leaving behind an ear-piercing screech.\u003c/p\u003e\n\u003cp\u003eEven if he had time to prepare, it was running out, so it was important to make the most of it!\u003c/p\u003e\n\u003cp\u003eNature’s Alliance, North Twilight Zone.\u003c/p\u003e\n\u003cp\u003eCeline sat behind the huge and luxurious office table and stretched lazily, revealing her perfect curves.\u003c/p\u003e\n\u003cp\u003eAlthough doing irksome corrections and office affairs every day was very troublesome, she found the tiring job enjoyable.\u003c/p\u003e\n\u003cp\u003eIt made every cell in her body shiver with excitement -- and even made her slightly moist down below -- every time she thought about how every word she put to paper, even every sentence she uttered, would make a big difference to the fates of numerous acolytes and even Magi.\u003c/p\u003e\n\u003cp\u003e“But it is a pity that my position here is not fully secured….” Celine glanced at her flat and smooth abdomen, a rather reluctant expression on her face.\u003c/p\u003e\n\u003cp\u003e“What’s wrong? Are you still grumbling that you’re not with child?”\u003c/p\u003e\n\u003cp\u003eThe voice of a young man suddenly sounded from inside the office.\u003c/p\u003e\n\u003cp\u003e“Ra… Radiant Guardian!”\u003c/p\u003e\n\u003cp\u003eWhen the other female Magi and office administrators saw Leylin, they could not contain the excitement in their eyes. Files were overturned and cups of tea spilled as they rushed to bow.\u003c/p\u003e\n\u003cp\u003e“Mmm!” Leylin said as he nodded and waved.\u003c/p\u003e\n\u003cp\u003eAll the Magi except Celine left the office quickly, completely silent.\u003c/p\u003e\n\u003cp\u003e“Yes!” Celine looked into Leylin’s eyes without fear.\u003c/p\u003e\n\u003cp\u003eAlthough the mental state of this impeccably handsome man was rather decent, his attire was somewhat dusty and messy.\u003c/p\u003e\n\u003cp\u003e‘Could this be the aftermath of rushing and being nervous?’ As a keen and observant woman, Celine immediately realized this...\u003c/p\u003e\n\u003cp\u003e“Leylin, you’re currently standing at the peak of Twilight Zone. One step and you can turn the entirety of it into a Magus kingdom, and pass it on through the generations!” Celine’s voice held a mixture of excitement and confusion, “A child! All you need is a child! An inheritor to your power!”\u003c/p\u003e\n\u003cp\u003eHer eyes clouded up as she hugged Leylin.\u003c/p\u003e\n\u003cp\u003eIf it was the past, Leylin definitely would not hesitate to argue with her over it. But now, Celine noticed the calm in Leylin’s eyes; calm like the still waters of an old well.\u003c/p\u003e\n\u003cp\u003eA realization hit Celine, making her immediately sink into immense fear. The day she loses Leylin’s affection would be the day she loses everything. This was also the reason why she strongly wished to bear Leylin’s child.\u003c/p\u003e\n\u003cp\u003eEven as she struggled to think of a method to show her affection, Leylin’s next words beat her down into the abyss.\u003c/p\u003e\n\u003cp\u003e“I have to go!”\u003c/p\u003e\n\u003cp\u003e“You’re going?” Celine was feeling slightly giddy, “Where to?”\u003c/p\u003e\n\u003cp\u003e“I’m leaving this place! Leaving Twilight Zone!” Leylin paused at every word, making sure Celine heard everything clearly.\u003c/p\u003e\n\u003cp\u003e“Are you mad? Why do you want to leave this place? You’re the king here! You’re my sun and my star. You are my everything….”\u003c/p\u003e\n\u003cp\u003eWhat would happen once Leylin leaves? The mere thought of scenarios that might happen if he followed through with his words made Celine sink into extreme fear. She hugged Leylin tightly, tears flashing at the corners of her eyes.\u003c/p\u003e\n\u003cp\u003eAnd yet, Leylin cruelly pushed her away, his hand cold as steel.\u003c/p\u003e\n\u003cp\u003eCeline calmed down and gazed at the emotionless Leylin.\u003c/p\u003e\n\u003cp\u003e“As you know, I’m actually not even a Magus of Twilight Zone, it was all an accident!” Leylin slowly said.\u003c/p\u003e\n\u003cp\u003eRegarding his history, after going through so many interactions and investigations, this woman had probably speculated a lot already.\u003c/p\u003e\n\u003cp\u003eSure enough, Celine’s face remained unchanged and she evidently did not feel surprised.\u003c/p\u003e\n\u003cp\u003e“I seek the pinnacle of the Magus world. The scene of different worlds from the top will be the most beautiful view one could ever hope for… So I cannot stop advancing. I must continue forward until I achieve my goal! I believe you too can understand this!”\u003c/p\u003e\n\u003cp\u003eLeylin looked into the depths of Celine’s eyes.\u003c/p\u003e\n\u003cp\u003eAt this moment, Celine had already completely calmed down. ‘Or rather, was it all just an act before?’ Leylin’s thoughts stopped here as he couldn’t help but secretly feel a little annoyed.\u003c/p\u003e\n\u003cp\u003e“I do! I’ve always known that when this place is can no longer fulfill your requirements any further, you would leave. I fully understand that, but I never thought that our separation would be this quick, or in this manner!”\u003c/p\u003e\n\u003cp\u003eCeline chuckled bitterly as she combed through her messy hair.\u003c/p\u003e\n\u003cp\u003e“Fate is unpredictable!” Leylin tried to hide the news about the central continent. “Plus, I’ve also made appropriate arrangements!”\u003c/p\u003e\n\u003cp\u003e“What arrangements? I can’t keep the other races and rank 2 Magi in check. Even I rose the ranks to the peak with your help, I’m only a rank 1 Magus, not someone they’ll listen to!” Celine was indeed very realistic and had already accepted the reality of Leylin leaving and was already planning her own future.\u003c/p\u003e\n\u003cp\u003e*Swish!* Leylin flicked his finger and a black ray of light penetrated the window, landing on the huge black stone sculpture in the plaza in front of the teaching block.\u003c/p\u003e\n\u003cp\u003e*Buzz!* The sculpture started trembling and a thin barrier of light flickered at the top.\u003c/p\u003e\n\u003cp\u003e“I left some of my aura on this sculpture. As long as my main body doesn’t die, this barrier of light will never dissipate… Believe in the deterrence of this rank 3 Magus and you’ll still be able to continue for a very long time!”\u003c/p\u003e\n\u003cp\u003eOther than being a clear indicator of whether he was dead or alive, there was absolutely nothing else that was useful about this aura.\u003c/p\u003e\n\u003cp\u003eBut as long as the Magi of Twilight Zone knew that Leylin was still alive somewhere, he would be a terrifying deterrence to them. And this was a way of assuring that the relations and power he left behind still existed!\u003c/p\u003e\n\u003cp\u003e“Good! What else?” Celine’s voice finally contained some hope.\u003c/p\u003e\n\u003cp\u003e“These!” Leylin handed her a few fine, white crystal chips.\u003c/p\u003e\n\u003cp\u003e“These are some spirit sources that I control: Iren, Gogoer and a few Rank 2 Magi! As long as they’re in your hands, there will never come a day where they betray you!”\u003c/p\u003e\n\u003cp\u003eThese Magi were the core strength of Nature’s Alliance. In fact, as long as Celine had them under her control, the entirety of Nature’s Alliance would be subject to her manipulation.\u003c/p\u003e\n\u003cp\u003eAs long as there was no internal conflict, Nature’s Alliance was the most powerful in the entire Twilight Zone. Even if Leylin suddenly went missing and caused a stir, it would not affect Nature’s Alliance too much.\u003c/p\u003e\n\u003cp\u003eAfter all, this was still Leylin’s backup plan. He still had the treasures of the Icy World waiting to be excavated and he would not give up on them so easily. This was also the reason why Leylin specially rushed back to prepare. Celine herself wasn’t an important enough reason for him to return.\u003c/p\u003e\n\u003cp\u003e“Besides, when I disappear, you can simply claim that I’ve gone to a secret facility for research. Anyway, it’s common for high-rank Magi to spend a decade on research, no?”\u003c/p\u003e\n\u003cp\u003e“Alright, good bye!” Leylin finally said and left.\u003c/p\u003e\n\u003cp\u003eThis was similar to how a person working at an office would act before leaving every morning. Leylin simply left after a few words, not at all like someone who was going to leave for someplace far away.\u003c/p\u003e\n\u003cp\u003eIn any case, Leylin had already seen Celine for who she was: a woman whose heart will never truly be moved. She was just calculative and thirsty for power. Looking at her suppressed excitement as she held the spirit sources, she must have already been rejoicing on the inside.\u003c/p\u003e\n\u003cp\u003e“Hold on! This will not be the last time right? What I said before was true, I will take care of your bloodlines, and turn them into the Guardian of the next generation...” Celine bit her lower lip.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I don’t have much time!” Leylin’s figure transformed into a black ray of light and he shot into mid-air, disappearing into the horizon in a flash.\u003c/p\u003e\n\u003cp\u003eLeylin understood Celine’s plans very well.\u003c/p\u003e\n\u003cp\u003eBloodlines of high-leveled Magi were hard to come by. Furthermore, he progressed incredibly fast. Celine thought that his bloodline was from an ancient, fearful creature. Hence, she wanted him to leave some of his seeds behind.\u003c/p\u003e\n\u003cp\u003eIn actual fact, Leylin was now a first generation Bloodline Warlock. The blood descendants he left behind would also have the Kemoyin’s Bloodline and would naturally be Warlocks! With a bit of nurturing, they would be unbelievably strong!\u003c/p\u003e\n\u003cp\u003eBut why would Leylin do that? Even when he fooled around with numerous girls before, he had secretly controlled his secretion and made sure not to leave any descendants behind.\u003c/p\u003e\n\u003cp\u003eA clink sounded in Celine’s hands as Leylin walked away, leaving behind remnants of a delicate gold cup.\u003c/p\u003e\n\u003cp\u003eShe always had great confidence in her charm and knowledge, but looking at the situation now, it seemed like Leylin did not have the slightest bit of concern towards her. This hurt her pride badly.\u003c/p\u003e\n\u003cp\u003eBut a smile crept onto her face once again as she stared at the huge number of spirit sources in her palms.\u003c/p\u003e\n\u003cp\u003eNow that Leylin had left, the power of Nature’s Alliance truly lied in her hands! A wave of happiness drowned her heart as her face flushed.\u003c/p\u003e\n\u003cp\u003eEverything had happened just as how Leylin had predicted. Under Celine’s leadership, Nature’s Alliance naturally became stronger.\u003c/p\u003e\n\u003cp\u003eThough there was unrest in the Twilight Zone for the 10 years after Leylin’s absence, it would still be contained.\u003c/p\u003e\n\u003cp\u003eThis, too, was related to Leylin’s prior subjugation of the power-hungry Twilight Zone Magi and the major powers of other races.\u003c/p\u003e\n\u003cp\u003eGradually, the tales of Radiant Guardian Leylin turned into a legend. As for Leylin, a new journey was just beginning for him...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-390\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-392\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-391","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
