{"id":58596,"no":40,"title":"Chapter 40","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eA Word Of Advice\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAfter the A.I. Chip’s scan, Leylin understood Jayden’s strength a little more.\u003c/p\u003e\n\u003cp\u003eLeylin was considered to have a considerable amount of battle experience amongst the level 2 acolytes. As long as his opponent did not have a magic artifact, he would have a very high chance of winning.\u003c/p\u003e\n\u003cp\u003eJayden had a magic artifact but was still slightly inferior to him. This meant that his battle strength was lower than Leylin’s. Even though he had some battle experience, it was not much.\u003c/p\u003e\n\u003cp\u003eOf course, these were only rough estimations from the A.I. Chip. In reality, fighting has to be viewed from many aspects.\u003c/p\u003e\n\u003cp\u003e“Jayden, I haven\u0027t seen you in such a long time!” Leylin greeted.\u003c/p\u003e\n\u003cp\u003eJayden naturally did not know that his stats had been found out by Leylin in just a second. He adjusted his robes and sat by Leylin’s side.\u003c/p\u003e\n\u003cp\u003eHe revealed his pale, white face as he raised his head to meet the sunlight.\u003c/p\u003e\n\u003cp\u003e“I haven’t basked in the sunlight for so long. Ever since I started following my mentor, my schedule has revolved around…... meditation, experiments and my studies!”\u003c/p\u003e\n\u003cp\u003eJayden stretched his body, looking contented.\u003c/p\u003e\n\u003cp\u003e“I heard that you are doing pretty well under Kroft!” Jayden said suddenly.\u003c/p\u003e\n\u003cp\u003e“It’s alright; I’m basically just brewing potions and exchanging them for resources!” Leylin was extremely modest.\u003c/p\u003e\n\u003cp\u003e“However, you recently went on a mission with Kaliweir, are you going to join that side?” Jayden suddenly smiled, but a cold glint seemed to flash in his eyes.\u003c/p\u003e\n\u003cp\u003eLeylin was a little speechless. He never thought that this conflict between groups that these kids had formed before was still ongoing. However, he had forgotten that he himself was only a boy of 14 years at this moment.\u003c/p\u003e\n\u003cp\u003e“We’re all acquaintances, we just did a mission together since we met by coincidence. That’s all!” Although Leylin was not afraid of Jayden, he still felt that it was better to avoid any trouble as much as possible.\u003c/p\u003e\n\u003cp\u003eJayden looked at Leylin several times and the A.I. Chip even informed Leylin that his brain waves had been scanned several times. It seemed as though Jayden had actually used a spell to determine if he was speaking the truth.\u003c/p\u003e\n\u003cp\u003eAfter some time, Jayden gave a radiant smile.\u003c/p\u003e\n\u003cp\u003e“I think highly of you! Intelligent! Prudent! Being with Kaliweir and the others will only drag you down. Only by joining a higher circle of friends can you obtain more resources, glory, and even life!”\u003c/p\u003e\n\u003cp\u003eJayden got up and continued in an indifferent tone, “Let me give you some advice, hurry up and leave the school!”\u003c/p\u003e\n\u003cp\u003e“What? Could you clarify that?” Leylin’s heart tightened as if had grasped something, and he hurriedly asked.\u003c/p\u003e\n\u003cp\u003eHowever, Jayden only smiled, walking away without taking a single glance behind him.\u003c/p\u003e\n\u003cp\u003eAfter Jayden’s figure had completely disappeared, Leylin sat back on the bench, a little lost for words.\u003c/p\u003e\n\u003cp\u003e“Pretending to be mysterious, as if he was a very powerful person, and even trying to convince me to join under his wing. Is that even fun? Does he really think of himself as the main character of a novel?”\u003c/p\u003e\n\u003cp\u003e“However! Jayden is a fifth-grade acolyte and is deemed highly likely to advance to a Magus. He would definitely be able to obtain news faster than me. I’m afraid that something has really happened!” Leylin’s face darkened.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIn a dark room, the fire was dimmed, and a promiscuous atmosphere permeated through the room.\u003c/p\u003e\n\u003cp\u003eThe moaning and shrill cries of a woman sounded, blending together with the constant low panting noises of a man.\u003c/p\u003e\n\u003cp\u003eAfter climaxing, the girl lay in the arms of the man, as limp as a bag of soil.\u003c/p\u003e\n\u003cp\u003e“You’re awesome, just like a lion!” Neela’s expression was hard to make out.\u003c/p\u003e\n\u003cp\u003eLeylin gently caressed Neela’s bare back and did not say a single word.\u003c/p\u003e\n\u003cp\u003eHe had encountered many things today and urgently needed to take it out on someone, so naturally he looked for Neela.\u003c/p\u003e\n\u003cp\u003eIn this period of time, he had long since hooked up with Neela. In this world, everyone was extremely open-minded about the notion of sex. Many people lost their virginity by the age of 11 or 12. Leylin and Neela both had their sexual needs, so they had already done the deed after only a few days.\u003c/p\u003e\n\u003cp\u003eIn any case, Neela was no longer a virgin. As for Leylin, he himself was a no-good person in his previous life. Both of them desired love and sex, and it wasn’t bad to have a friend with benefits.\u003c/p\u003e\n\u003cp\u003eWith the regulation of the A.I. Chip, he would definitely not leave his seed behind. Naturally, he could mess around to the fullest.\u003c/p\u003e\n\u003cp\u003eThinking of this, Leylin felt life stirring below his pants once again.\u003c/p\u003e\n\u003cp\u003e“Ah!” Neela let off a cry, and Leylin stopped her as she was about to climb on top of him. The corner of Leylin’s lips curved up wickedly, as he pressed Neela’s head downwards.\u003c/p\u003e\n\u003cp\u003eNeela rolled her eyes at Leylin, but her lips smiled coquettishly as she dived under the blankets.\u003c/p\u003e\n\u003cp\u003eLeylin let out a satisfied groan and leaned onto the wall slightly. Both of his hands grabbed hold of twin peaks, and he felt the sponge-like sensation transmitting to his hands.\u003c/p\u003e\n\u003cp\u003eSometime later, Neela got up and walked towards the washroom stark naked.\u003c/p\u003e\n\u003cp\u003eWhile he listened to the provocative beauty humming as she showered, Leylin began to ponder the day’s event.\u003c/p\u003e\n\u003cp\u003e“I shouldn’t care about Nyssa’s affairs anymore. Although Jayden’s warning was extremely sudden, it has to be treated seriously. This might have something to do with the phenomenon outside the academy. What’s next is to investigate where the other fifth-grade acolytes went.”\u003c/p\u003e\n\u003cp\u003eIn any case, the academy would definitely not forsake those acolytes who had the highest potential to succeed and advance to official Magi. If the academy was safe, they would definitely still be here. However, if they all left the academy for various reasons, it meant that the academy itself would be fraught with danger in the near future.\u003c/p\u003e\n\u003cp\u003e“Harosi has been cleaning up the area outside the academy since Perry’s death. After he has finished cleaning, it will be the best opportunity!” Leylin’s eyes flashed.\u003c/p\u003e\n\u003cp\u003e“My dearest, what are you thinking of?”\u003c/p\u003e\n\u003cp\u003eNeela stuck herself onto Leylin, and two soft mounds pressed against Leylin’s right arm.\u003c/p\u003e\n\u003cp\u003e“Just thinking about a few things!” Leylin smiled, “Recently Sir Harosi seems to be making a huge ruckus outside the academy!”\u003c/p\u003e\n\u003cp\u003e“You heard about it too? About Perry?” Neela lay on top of Leylin’s chest and did not make any other movements.\u003c/p\u003e\n\u003cp\u003e“Yeah! Losing a fifth-grade acolyte genius and a potential Magus, anyone would turn crazy for a period of time!”\u003c/p\u003e\n\u003cp\u003eLeylin said blandly, “You have your own cliques too, I need you to help me to find out a few things!”\u003c/p\u003e\n\u003cp\u003e“Neela’s smiled sweetly, “I’ll serve you, my lion king!”\u003c/p\u003e\n\u003cp\u003e“Don’t call me that! It feels extremely strange! It will make me think of some lion!” Leylin rolled his eyes.\u003c/p\u003e\n\u003cp\u003e“Alright! Let’s not talk about this, but about something more serious!” Leylin’s face was stern.\u003c/p\u003e\n\u003cp\u003eSeeing him act this way, Neela also stopped smiling.\u003c/p\u003e\n\u003cp\u003eGetting close to Leylin was so she could elevate her status and obtain more resources, and she clearly understood this.\u003c/p\u003e\n\u003cp\u003e“Help me check the results of Harosi’s battle. Also, find out if the academy’s surroundings are completely safe now. Lastly, I want to know where all the fifth-grade acolytes have gone recently!”\u003c/p\u003e\n\u003cp\u003eLeylin whispered into Neela’s ears.\u003c/p\u003e\n\u003cp\u003e“I got it!” Neela grabbed Leylin’s head with both hands, “Could it be that something big is going to happen?”\u003c/p\u003e\n\u003cp\u003e“I hope that it is only my imagination!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIt was the morning of the second day after he had walked out from Neela’s room. Leylin felt extremely refreshed and full of vigour. It seemed like his venting had indeed helped in curbing his emotional distress suitably.\u003c/p\u003e\n\u003cp\u003eAfter thinking for a while, Leylin went for a shower and then headed towards Professor Kroft.\u003c/p\u003e\n\u003cp\u003eKroft happened to be brewing a kind of potion. Red-coloured beetles were climbing around inside a test tube, occupying half of the space inside the test tube. It looked rather disgusting.\u003c/p\u003e\n\u003cp\u003e“You’re here! Is something the matter?”\u003c/p\u003e\n\u003cp\u003eKroft watched the test tube closely, as he sprinkled some blue petals into it.\u003c/p\u003e\n\u003cp\u003eThe red-coloured beetles hurriedly gorged on those petals, after which they dissolved and turned into a green-coloured liquid.\u003c/p\u003e\n\u003cp\u003eA dozen seconds later, the test tube half-filled with the red beetles turned into a green-coloured potion.\u003c/p\u003e\n\u003cp\u003e“Your skills are really amazing!” Leylin gasped.\u003c/p\u003e\n\u003cp\u003e“Haha! It’s just practicing!” Kroft shook his head, “You always look for me when you have a problem, so tell me what you want!”\u003c/p\u003e\n\u003cp\u003e“It’s like this. I, your apprentice, haven\u0027t seen senior Merlin, for some time now. Can I know where he has been?” Leylin inhaled deeply.\u003c/p\u003e\n\u003cp\u003e“Merlin?” Kroft’s face had on a mysterious smile, “He has accepted a mission and left the academy already!”\u003c/p\u003e\n\u003cp\u003e“How long will it last?”\u003c/p\u003e\n\u003cp\u003e“About 1 to 1.5 years! It’s possible that it may take longer!” Kroft’s tone became sterner, but there was a hint of gratification in it.\u003c/p\u003e\n\u003cp\u003e“One last question, was the mission suggested by the family supporting senior Merlin?”\u003c/p\u003e\n\u003cp\u003eAs a family that was able to rope in a genius Potioneering acolyte from Abyssal Bone Forest Academy, their influence should be at the peak. After all, they had an intricate relationship with Abyssal Bone Forest Academy, so their news network might even be more efficient than Kroft’s.\u003c/p\u003e\n\u003cp\u003e“Yes!” Kroft answered definitively. “You know, there are some things that were agreed on between the academy and me, so I cannot say it directly. But if you are to discover it on your own, then it would be none of my business!”\u003c/p\u003e\n\u003cp\u003e“However, you don’t need to be too worried. Your talent in Potioneering is only secondary to Merlin’s, and the academy needs a talent like you too!” Kroft comforted him.\u003c/p\u003e\n\u003cp\u003e“Yes!” Leylin smiled bitterly. It seemed like the academy still chose to categorise by aptitude grades. Those talented individuals like Jayden and Merlin who were also fifth-grade acolytes had all been given ample time to retreat. But when it came to him, the treatment he received was much inferior. Up until now, he had only received a few obscure hints from his mentor.\u003c/p\u003e\n\u003cp\u003eAs for those whose aptitudes were even worse, they probably wouldn\u0027t know what happened even after they were dead.\u003c/p\u003e\n\u003cp\u003eAlthough Leylin did not understand too well either, there was one thing that he was certain of! The academy was no longer a safe place to stay!\u003c/p\u003e\n\u003cp\u003eOnce again, Leylin was determined to leave, “So, may I also take up a dispatch mission?”\u003c/p\u003e\n\u003cp\u003e“You may! Go to the counter of the Mission Area and clarify your intentions. They will be able to understand since your aptitude isn\u0027t too bad and your talent in Potioneering is even more outstanding!”\u003c/p\u003e\n\u003cp\u003eKroft nodded his head.\u003c/p\u003e\n\u003cp\u003e“Thank you, Sir!” Leylin hurriedly bowed. Allowing acolytes to leave was an extremely good thing for them, after all, he did not want to stay in a potential battlefield.\u003c/p\u003e\n\u003cp\u003eAfterwards, Leylin assisted Kroft in a few more research experiments in Potioneering and also took the opportunity to seek answers for Nyssa’s problem. Unfortunately, Kroft did not have any good methods either.\u003c/p\u003e\n\u003cp\u003eAfter bidding farewell to his mentor, Leylin walked outside, “There is only a small family behind Bicky. As for Kaliweir and the others, they aren\u0027t fifth-grade acolytes, so they will most likely not receive the news. I’m afraid I will have to drop a few hints for them. As to whether they will understand the message or not, it all depends on their luck!”\u003c/p\u003e\n\u003cp\u003eIn the lavish second-level dining hall, the gorgeous crystal lights sparkled dazzlingly, as numerous musicians performed. Listening to music while tasting delicacies, it was indeed a very enjoyable thing to do.\u003c/p\u003e\n\u003cp\u003eFurthermore, the food here was all prepared with the utmost care. Not only could they increase one’s stats, they could also speed up the meditation process. As such, they have always been welcomed by acolytes and Magi alike.\u003c/p\u003e\n\u003cp\u003eHowever, there were very few customers here today. Most of their faces were gloomy, and the sight was rather unappetising.\u003c/p\u003e\n\u003cp\u003eLeylin sat on a goose-feathered coach and pushed a steaming mug towards Neela, “This is hot cocoa, with some ground black pearls inside it as well. It has also a certain beneficial effect towards meditation, won’t you try it?”\u003c/p\u003e\n\u003cp\u003eNeela, who was sitting opposite him, smiled bitterly, “If it was before, I would still be extremely excited. But now…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-39\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-41\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-40","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
