{"id":58974,"no":418,"title":"Chapter 418","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eThe Kobolds\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eMaybe that was why the Forgotten Land was not overtaken by the Magi. Otherwise, the barriers between dimensions would not deter against the greed of Magi!\u003c/p\u003e\n\u003cp\u003eThere were, of course, a handful of rare species who voluntarily entered the Forgotten Land to escape the grip of the Magi, however rare the cases might be.\u003c/p\u003e\n\u003cp\u003eThe Magi here were so few in number that Leylin only caught a glimpse of one in all this time. And it wasn’t without the aid of his A.I. Chip that he could make out some of his features.\u003c/p\u003e\n\u003cp\u003eThe said Magus was a mature male with peculiar scales embedded in his face — probably the result of a mutation.\u003c/p\u003e\n\u003cp\u003eWith the unexpected negligence of Robin, however, he fled at the speed of light upon noticing Leylin’s group.\u003c/p\u003e\n\u003cp\u003eThe concentration of energy particles continued to drop drastically as time passed and the group headed further into the Forgotten Land. Often, there was no soul in sight.\u003c/p\u003e\n\u003cp\u003eThose they did come across were mostly some rare species or exiled Magi who couldn’t survive in the central continent.\u003c/p\u003e\n\u003cp\u003eMore often than not, these meetings ended up in a battle.\u003c/p\u003e\n\u003cp\u003eWhile they showed mercy to many creatures, keeping in mind to conserve their energy, some of these creatures actually initiated the attacks.\u003c/p\u003e\n\u003cp\u003eThe most threatening one was a profuse chase by a rank 3 Cthulhu beast which bore the physique of a hill.\u003c/p\u003e\n\u003cp\u003eIt took Kesha, Robin, Leylin, and the surrounding Warlocks before the Cthulhu was wholly taken down, and the death of it actually garnered them a heap of rare materials. But unfortunately, a Black Horrall Snake Warlock was sacrificed in this face-off, removing a member from Leylin’s group.\u003c/p\u003e\n\u003cp\u003e*Flap flap!* Kesha’s pet, a pristine white bird, flew to a stop on her shoulder. Leylin often wondered why Kesha chose to keep a creature that only possessed an investigative nature instead of fighting abilities as her contracted partner.\u003c/p\u003e\n\u003cp\u003e“Guys, a tribe of Kobolds lies ahead of us. It is a sizeable one with a manpower of more than a thousand, I’m afraid we’ll have to make a detour!” Kesha announced as she opened her eyes.\u003c/p\u003e\n\u003cp\u003e“Kobold?” Upon hearing that, Leylin did a thorough research on this species through the A.I. Chip.\u003c/p\u003e\n\u003cp\u003e[Kobold: Ovipara, said to be a subspecies of giant dragons. They will reach a height of 3 feet (around 1 metre) upon maturity and their outer appearance is characterised by a scaly skin which can range from a dark reddish-brown to a faded black. There are two taupe horns on the crowns of their heads and their fiery red eyes possess infrared vision. Furthermore, they can obtain spells through their bloodline and become an expert—similar to that of a Bloodline Warlock!]\u003c/p\u003e\n\u003cp\u003e“Giant dragons?!” The frightful creature that was mentioned in his high-grade meditation technique—Dragon King’s Mystic Might came to his mind in that instance. The image of the Kobold on his A.I. Chip was, however, not close to his imagination of the creature.\u003c/p\u003e\n\u003cp\u003eNonetheless, the giant dragons of the ancient era were famous because of the majority Ehya subspecies which was said to be able to mate with any species. Thus, these Kobolds were only to be expected.\u003c/p\u003e\n\u003cp\u003eBut the thing that caught Leylin’s attention was actually their bloodline!\u003c/p\u003e\n\u003cp\u003eRank 3 creatures still existed in small numbers on the central continent despite their rarity. Moreover, Leylin had already reached the status of a rank 3 Warlock, it was about time he explored things in that field.\u003c/p\u003e\n\u003cp\u003eUnlike Leylin, other Warlocks did not own an A.I. Chip, nor could they extract ancient bloodlines from the blood of rank 3 creatures. As long as there was an adequate source, Leylin could extract as much of the ancient bloodlines as he wished.\u003c/p\u003e\n\u003cp\u003e“The bloodline of ancient giant dragons?” Leylin touched his chin, uncertain. “We can’t be sure if there are any rank 3 Kobold Warlocks… but it’s definitely possible in a large tribe with a population of over a thousand.\u003c/p\u003e\n\u003cp\u003eKesha spoke after that, “I’ve found several rank 2 Kobold Warlocks within them and there are no signs of division in the tribe as of now. They are definitely under the control of a stronger Warlock, there must be a rank 3 in there……”\u003c/p\u003e\n\u003cp\u003e“A rank 3 Kobold Warlock backed up by numerous Kobold warriors and low-grade bloodlines. That is enough of a threat to us, we have to take a detour!” Robin did not hesitate in his decision. It was an aftereffect of the death of his subordinate, the Black Horrall Snake Warlock, earlier. Afterall, he had spent a painstaking amount of time and effort in nurturing him.\u003c/p\u003e\n\u003cp\u003eLeylin was about to make a comment but said nothing upon seeing everyone’s approval towards Robin’s decision.\u003c/p\u003e\n\u003cp\u003eIt was clearly impractical for Robin to go against a huge Kobold tribe. Besides, the Kobolds were known for having diluted bloodlines and were already very distantly related to giant dragons. So it was almost impossible to extract giant dragons’ bloodlines from them, even for Morning Star Magi. Wouldn’t Leylin be digging his own grave if he persisted in moving ahead?\u003c/p\u003e\n\u003cp\u003eTo put things into perspective, Robin and the rest were all Bloodline Warlocks. They could start suspecting Leylin’s intentions in collecting bloodlines.\u003c/p\u003e\n\u003cp\u003e‘Well, I guess we can only make a mark and return in the future!’ And Leylin stealthily marked out the place on the map of his A.I. Chip.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eLeylin and his group made it to their destination in spite of the many mishaps on the way.\u003c/p\u003e\n\u003cp\u003eA saffron bonfire danced from below as an alluring aroma of roasted meat filled the air. The meat was dripping golden and glistening grease every now and then.\u003c/p\u003e\n\u003cp\u003eA small stretch of white tents encircled the bonfire.\u003c/p\u003e\n\u003cp\u003e“How are things going? Are the sentry and camouflaging spells up?” Kesha walked out of her tent, a cloud of steam still surrounded visibly. She had only clothed herself in a loose bathrobe and was still drying her hair.\u003c/p\u003e\n\u003cp\u003eShe had obviously just come out of the bath. Nobody knew where she got the water for it, but it was a simple thing for a high-ranking Warlock like her, even if a waste of resources.\u003c/p\u003e\n\u003cp\u003e“It’s all done, we’re undetectable.” Robin furrowed his brows and replied, “And I remember reminding you not to use any spells here!”\u003c/p\u003e\n\u003cp\u003e“Don’t worry! The water was from my spatial item!” Kesha was noticeably annoyed and even threw a coquettish glance at Noah who turned beet red.\u003c/p\u003e\n\u003cp\u003eRobin pulled a long face at that, saying, “Kesha, you’re old enough to be Noah’s granny! On top of that, our families have numerous blood relations, he might as well call you Aunt!”\u003c/p\u003e\n\u003cp\u003e“Rest assured, I have no interest in kids! On the contrary, I actually prefer mature and charming male Warlocks. Am I right, Leylin?” She shot Leylin a look.\u003c/p\u003e\n\u003cp\u003e“I’m gonna go double-check!” Leylin quickly excused himself from the circle to check on the spell formations before he got involved in the irrelevant argument.\u003c/p\u003e\n\u003cp\u003eFrom his vantage point, he was able to see the white haze that engulfed the whole campsite, making the bonfire and tents only faintly discernible.\u003c/p\u003e\n\u003cp\u003eLeylin was aware that it would be beyond unlikely to notice any anomalies in the campsite if viewed from outside. The campsite would look like nothing more than barren land.\u003c/p\u003e\n\u003cp\u003eThe whole camouflage was seamless under the setup of Robin’s and Kesha’s men, it would be challenging even for the A.I. Chip to locate areas that could be improved on.\u003c/p\u003e\n\u003cp\u003eLeylin strolled around aimlessly and shook his head at the indistinct quarrels.\u003c/p\u003e\n\u003cp\u003eMany families of Kemoyin Warlocks intermarried to preserve the purity of their lineage and for other benefits. Strictly speaking, every family in the Ouroboros Clan was related to every other, and they all could even be traced down to the same ancestors. Hence, it’d be a rotten mess if one were to try and piece the puzzle together.\u003c/p\u003e\n\u003cp\u003eLeylin was sick of hearing about the indecent acts of the aristocrats, and of the fact that they would always be superior regardless.\u003c/p\u003e\n\u003cp\u003eHe figured that he might as well use this extra time to study the spell models and relevant information in his A.I. Chip.\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes lost focus as he devoted the entirety of his attention to the A.I. Chip...\u003c/p\u003e\n\u003cp\u003eRobin and Kesha had made up by the time Leylin returned to the bonfire in the evening. They, too, knew it wasn’t a time to discuss such things.\u003c/p\u003e\n\u003cp\u003eRobin gathered all the warlocks next to the bonfire and spoke of the final safety precautions.\u003c/p\u003e\n\u003cp\u003e“This pocket dimension was discovered by a Barbarian Bear tribe from the Forgotten Land and the information was proliferated in the Forgotten Land instead of being kept secret. Following that, 2 factions, that were led by human magician fugitives and the local barbarians respectively, also marked out this sacred place, opposing the Barbarian Bears.\u003c/p\u003e\n\u003cp\u003e“They are the three main factions that we’ll be facing this time. Aside from a trickle of other intellectual species, we can overlook the rest…” He explained in detail.\u003c/p\u003e\n\u003cp\u003e“The entrance to the pocket dimension is at the mid-section of an underground river, guarded by these forces! We must break in swiftly, then fight our way through using either a boundary-breaking spell or by force…”\u003c/p\u003e\n\u003cp\u003eA solemn look was painted across the faces of Leylin and the rest.\u003c/p\u003e\n\u003cp\u003eGiven the pitiful concentration of energy particles in the Forgotten Land, it would be hard to find useful resources.\u003c/p\u003e\n\u003cp\u003eThus, this secret place was of utmost importance to the Forgotten Land and its livelihood, especially towards those factions! These factions would not sit back if Leylin and the rest were to take advantage of this land!\u003c/p\u003e\n\u003cp\u003eThough the group was practically undeterred as they were backed by the Ouroboros Clan, it must also be understood that the Clan would not launch an attack just for them. It just wasn’t worth it!\u003c/p\u003e\n\u003cp\u003eTo add on, there was no end to the amount of evil and wicked Magi and dangerous creatures in the Forgotten Land that couldn’t care less about it.\u003c/p\u003e\n\u003cp\u003eLeylin and the rest had to defend themselves throughout the duration of their escape from the Forgotten Land, or else it’d be a truly undignified sacrifice if they were to lose their lives.\u003c/p\u003e\n\u003cp\u003eThe boundary-breaking spell was a type of escaping spell that was fast and convenient, customised for entering and exiting pocket dimensions. Though the result varied for different types of lands, and might have no effect on occasion, it was still a useful spell.\u003c/p\u003e\n\u003cp\u003eThough, if one was superior in ability he’d able to travel through the pocket dimension with ease. Obviously, this did not work with Leylin and company. Why else would they painstakingly plot all this?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-417\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-419\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-418","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
