{"id":58981,"no":425,"title":"Chapter 425","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eEcological Garden\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin looked into the information the A.I. Chip had previously recorded.\u003c/p\u003e\n\u003cp\u003eThe three powers had been hanging around for a long time, and they had definitely obtained a few useful items.\u003c/p\u003e\n\u003cp\u003eBased on Dominic’s information, Quicksand Castle was far larger than it looked on the outside. It was practically a gigantic maze.\u003c/p\u003e\n\u003cp\u003eThe numerous rooms outside were the first layer of defense.\u003c/p\u003e\n\u003cp\u003eIf they did not leave on time, they would travel through countless rooms and later be trapped inside till their death.\u003c/p\u003e\n\u003cp\u003eThe mark of the second layer would first be this illusory corridor.\u003c/p\u003e\n\u003cp\u003eWith the dim yellow lighting, Leylin looked through the decorations in the corridor.\u003c/p\u003e\n\u003cp\u003eThe two walls were mostly white, with some strange patterns of flowers and plants, but there were no portraits of humans. The red carpet on the ground extended until the end of the corridor, with not a speck of dust in sight.\u003c/p\u003e\n\u003cp\u003e“This drawing technique?” Leylin touched his chin. “It has the style of the ancient era. Looks like it is one of Quicksand’s experimentation areas.”\u003c/p\u003e\n\u003cp\u003eThe strength of the current Magi could not compare to that of ancient times. Leylin even suspected that Magi at the Morning Star Realm or higher had even participated in the construction of this place.\u003c/p\u003e\n\u003cp\u003eAs a mere rank 3 Warlock, , a slight misstep could take away his life!\u003c/p\u003e\n\u003cp\u003eLeylin glanced at the oil paintings in the corridor vigilantly, he started advancing in a strange pace.\u003c/p\u003e\n\u003cp\u003eThe flower patterns on the two sides began to move in tune to his step. They began to grow, germinate, blossom and then wilt, creating a cycle.\u003c/p\u003e\n\u003cp\u003e“Rumours have it that the illusory corridor can only be entered with a unique walking frequency. It possesses a strange force that can send a person to any place he would like to go to.”\u003c/p\u003e\n\u003cp\u003eLeylin remembered this passage, as well as the account at the end, “If there are errors in one’s footwork, the illusory corridor will turn into a life-threatening trap, trapping both their body and soul.”\u003c/p\u003e\n\u003cp\u003eThis specific footstep was discovered through the huge sacrifice from the Magi on the outside, which now made things convenient for Leylin’s group.\u003c/p\u003e\n\u003cp\u003e“What exactly do I want?”\u003c/p\u003e\n\u003cp\u003eLeylin strolled along the corridor and constantly asked himself. A unique feature of the corridor was that if one did not have a clear desire, there would be no end.\u003c/p\u003e\n\u003cp\u003eAfter a specific period of time, the same mechanism would activate.\u003c/p\u003e\n\u003cp\u003e“Immortality, strength and all that would be too vague and exceed the abilities of the illusory corridor. I can only mention a place it can communicate with.”\u003c/p\u003e\n\u003cp\u003eLeylin muttered to himself, “It’s not safe to directly say the location of the Lamia Hair. If such a material doesn’t exist, the illusory corridor will instantly regard me as an intruder!”\u003c/p\u003e\n\u003cp\u003eThis was a test for all who entered. The true owner definitely knew what was at the end of the corridor.\u003c/p\u003e\n\u003cp\u003eThe teleportation of the corridor would only work within the castle. The moment Leylin mentioned an area that did not match what was inside, not only would there be no teleportation, but defensive spell formations would be activated instead.\u003c/p\u003e\n\u003cp\u003eHowever, he was unwilling to give up on the Lamia Hair.\u003c/p\u003e\n\u003cp\u003e‘I would like… to go to a place that will help my bloodline mature!’ A moment later, Leylin made up his mind and constantly repeated this line in his thoughts.\u003c/p\u003e\n\u003cp\u003eIn that instant, the corridor seemed to shrink and the flowery patterns on the walls sped up. In a few seconds, they completed a cycle of growth. A bit of light appeared at the end of the corridor, constantly expanding.\u003c/p\u003e\n\u003cp\u003e“Let’s go!” Leylin gritted his teeth and calmly headed ahead.\u003c/p\u003e\n\u003cp\u003e*Swoosh!* The feeling of weightlessness during the teleportation left him feeling dizzy.\u003c/p\u003e\n\u003cp\u003eShaking his head vigorously, he took stock of his surroundings.\u003c/p\u003e\n\u003cp\u003e“Where is this…?”\u003c/p\u003e\n\u003cp\u003eHe was in a large laboratory. He could see plants outside through the glass, as well as many glass vessels and experimental apparatus that were all neatly arranged inside.\u003c/p\u003e\n\u003cp\u003e“A lab, huh. My luck is pretty good. There’s definitely going to be something here to help mature my bloodline faster!”\u003c/p\u003e\n\u003cp\u003eLeylin let out a long breath, and immediately recalled the rumours regarding Quicksand. Given that their ranks consisted of Warlocks of various bloodlines, they had a vested interest in the field. It would not be difficult to find something that could help his bloodline mature.\u003c/p\u003e\n\u003cp\u003eLeylin arrived at a metal counter, and pulled out the first drawer. It was messy, mostly made of thick parchments recording data from experiments. It was all in the Byron language.\u003c/p\u003e\n\u003cp\u003eLeylin opened the other drawers, and the contents were about the same. There was mostly data from experiments, the counter practically filled by these documents.\u003c/p\u003e\n\u003cp\u003e“There is so much data, but it’s a pity there’s no information on the receptors and core data. There’s no way to tell the procedure of the experiment at all…”\u003c/p\u003e\n\u003cp\u003eLeylin found this regretful but quickly saved all the information to the database.\u003c/p\u003e\n\u003cp\u003eEven if it was mostly unrelated data, it was still very valuable. Who knows, some of these parchments could even hold the data essential to repeating the experiment!\u003c/p\u003e\n\u003cp\u003eIn addition, with all its recent advances and improvement in its abilities, it took little time to record everything.\u003c/p\u003e\n\u003cp\u003eEverything was organized neatly. It seemed like the Warlocks then had left in an orderly fashion, not leaving much behind.\u003c/p\u003e\n\u003cp\u003eAfter recording the information, Leylin turned his attention to the ecological garden outside the giant glass wall.\u003c/p\u003e\n\u003cp\u003eLarge leaves that were like palm-leaf fans covered the sky. Barely any sunlight shone down on the thick roots of the plants.\u003c/p\u003e\n\u003cp\u003eIt looked like a primordial forest.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin who had experience from Twilight Zone immediately realised the difference in this sunlight. This was not sunlight from the natural world, but an artificial recreation of heat and light. Though there was a similar effect, it lacked the harmony of nature.\u003c/p\u003e\n\u003cp\u003e“This place has probably been abandoned for thousands of years. To be able to let this ecological garden achieve a balance like this, it truly is a perfect system achieved with astonishing skill,” Leylin sighed and touched the glass.\u003c/p\u003e\n\u003cp\u003e[Custom-made reinforced glass. Degree of hardness: 3!] The A.I. Chip concluded.\u003c/p\u003e\n\u003cp\u003eA level 3 hardness meant that regular rank 3 Warlocks would be unable to break this glass. Leylin’s eyes brightened at this information.\u003c/p\u003e\n\u003cp\u003e“Looks like this place was used to hold many powerful creatures.” A giant fireball appeared in Leylin’s hands, the terrifying heat burning even the air around it into nothingness and searing through the void.\u003c/p\u003e\n\u003cp\u003e“Explosive Fireball!”\u003c/p\u003e\n\u003cp\u003eEnormous flames smashed against the glass wall, the dazzle of the heat and light incomparably piercing. Even Leylin himself had to close his eyes temporarily.\u003c/p\u003e\n\u003cp\u003eWhen he opened his eyes again, there was an indent in a part of the glass, but not much more. It still stood strong.\u003c/p\u003e\n\u003cp\u003e‘As expected of a material with a hardness of level 3!’ Leylin sighed, as he could immediately tell how much power this reinforced glass could withstand.\u003c/p\u003e\n\u003cp\u003eBased on the power of his attack, it needed to be used at least ten times before he could completely shatter this glass wall.\u003c/p\u003e\n\u003cp\u003e‘What for?’ he thought as he stroked his chin. While gathering information, he had also discovered an activating spell which should have been the key to entering the garden. The attack from before was purely to test how strong this laboratory was.\u003c/p\u003e\n\u003cp\u003e‘Looks like there were at most rank 3 creatures here, so it’s not too dangerous!’ Leylin was now assured. If not, the defence would not be so uncomplicated. Even if there were still spell formations that had yet to be activated, the creatures would still be around rank 3.\u003c/p\u003e\n\u003cp\u003eHe quickly arrived at an instrument that was like a disk. After checking it briefly, he found a groove and placed crystallised magic crystals inside, replacing the previous powder.\u003c/p\u003e\n\u003cp\u003eAfter that, Leylin placed both hands atop the disk, rays travelling from his palms and connecting with the disk. “Activate!”\u003c/p\u003e\n\u003cp\u003e*Ka-cha! Ka-cha!* The entire glass wall began to shake, great amounts of dust and silt sliding off.\u003c/p\u003e\n\u003cp\u003e*Rumble!* As it had not been activated for a long time, the mechanism seemed to be aged and produced a loud sound as a glass door opened.\u003c/p\u003e\n\u003cp\u003eA crack appeared within the glass, expanding in two directions, bringing with it an unusually refreshing breeze.\u003c/p\u003e\n\u003cp\u003eIn that instant, Leylin felt every cell in his body dancing in joy, and his Giant Kemoyin Serpent bloodline beginning to stir.\u003c/p\u003e\n\u003cp\u003e“I didn’t notice this before, but it seems like every plant in this ecological garden is an ancient species. Also, they’re quite a few times larger than the species we have now, containing traits of the ancient era…”\u003c/p\u003e\n\u003cp\u003eLeylin walked out of the laboratory and looked backwards. The laboratory from before was like a giant white egg, set atop a thick stone base. Everything around it looked like a primordial forest.\u003c/p\u003e\n\u003cp\u003e‘With such obvious traits of the ancient era, and given how lively my bloodline has become, this place is a perfect copy of that period,’ he determined.\u003c/p\u003e\n\u003cp\u003eThough such an environment may have been the norm at the time. This is very valuable information…’ Leylin revealed an expression of excitement, and immediately commanded, ‘A.I. Chip, record the parameters of the environment!’\u003c/p\u003e\n\u003cp\u003e[Mission established, beginning scanning. Recording parameters of the atmosphere…]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip loyally intoned, following through on Leylin’s command meticulously.\u003c/p\u003e\n\u003cp\u003eAfter giving the order, Leylin walked along a giant plant root, Meteor Sword in hand.\u003c/p\u003e\n\u003cp\u003eAt the end of the root was a berry vine, and atop a leaf the size of a millstone, he found bite marks.\u003c/p\u003e\n\u003cp\u003e‘An animal eating,’ Leylin looked at the mark on the leaf, ‘It should be omnivorous, these marks are of teeth used to tear flesh!’ The plan was repairing itself rapidly, erasing all traces of the bites.\u003c/p\u003e\n\u003cp\u003e‘They grow so quickly, which explains how this cycle was constructed here…’ Leylin touched his chin and came to the ground. At the root of the plant was a stinking thick, green goop.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-424\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-426\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-425","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
