{"id":58987,"no":431,"title":"Chapter 431","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eThe Hunt\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e*Chu!* The King Blood Vulture used its wings and fanned the two Blood Condors in its path away, flying into the sky.\u003c/p\u003e\n\u003cp\u003eA crimson beam of light struck down, and a shadow servant who could not dodge in time was shattered, scattering multiple bloodline treasures everywhere.\u003c/p\u003e\n\u003cp\u003eWith the commanding high-pitched squawk, the flock of Blood Vultures now had a leader and their formation immediately changed. Many of them flew high into the sky and, like a web, began to circle the shadow servants, occasionally dropping down in attack.\u003c/p\u003e\n\u003cp\u003eThough this method was effective at killing many shadow servants, the remaining servants’ movements in looting them were much too quick. After paying the price of a large number of casualties, a portion of them still broke out.\u003c/p\u003e\n\u003cp\u003e*Chu!* The King Blood Vulture roared, bringing with it multiple Blood Vultures as it gave chase.\u003c/p\u003e\n\u003cp\u003e“Found you!” Leylin met with the person who were chasing after him.\u003c/p\u003e\n\u003cp\u003eIt was a ginger female Magus. Her body was curvy, a golden headband rested on her forehead, and her pair of long and narrow eyes were fixed on Leylin.\u003c/p\u003e\n\u003cp\u003e“My name is Leylin. May I know yours?” In the face of her gaze that was ready to shoot flames, Leylin smiled slightly and performed a noble’s bow, his movements so precise there was nothing to criticise.\u003c/p\u003e\n\u003cp\u003e“Tanasha!” This female Magus had not expected Leylin to feel so relaxed. Though her chest was bouncing in her anger, she still had a lot of self-restraint as she announced her name.\u003c/p\u003e\n\u003cp\u003e“Are you prepared to admit to your sins?” Tanasha glanced at the handsome young man in front of her. Captives could be ransomed in the central continent. In addition, he had not caused too many casualties to her organisation, and was also a human backed by the Ouroboros Clan. Hence, it was not too surprising that he was still calm in this situation.\u003c/p\u003e\n\u003cp\u003e“Oh, no, you’ve misunderstood,” Leylin’s smile was dazzling, “I just want to ask you this. Do you… like Blood Vultures?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Tanasha’s mind could not process this fast enough. But looking at the numerous crimson figures appearing on the horizon, she suddenly had a bad premonition.\u003c/p\u003e\n\u003cp\u003eLeylin acted before she could do anything, “Eye of Petrification!”\u003c/p\u003e\n\u003cp\u003eHis eyes turned amber and the pupils became vertical slits, shooting out mysterious, unmeasurable rays of petrification.\u003c/p\u003e\n\u003cp\u003eThough it was only a rank 1 innate spell, with the addition of his Vapour Phase spiritual force and the strength of his bloodline, its power could not be underestimated.\u003c/p\u003e\n\u003cp\u003eAt the same time, Leylin quickly chanted some incantations, and numerous shadows emerged from all directions, forming a giant cage that trapped her inside temporarily.\u003c/p\u003e\n\u003cp\u003eTanasha’s reaction was extremely quick. “Storm!” Almost at the same instant the rays of petrification appeared, her eyes turned silver-white, releasing dazzling light that blocked them.\u003c/p\u003e\n\u003cp\u003eMeanwhile, a giant storm appeared from behind her, forming a tremendous tornado that stirred up and created chaos in the interior of the cage.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin’s sudden attack made her falter. “Lance of Corrosion!”\u003c/p\u003e\n\u003cp\u003eA dark green lance, tip white, appeared in Leylin’s hand. It shot towards Tanasha, accompanied by a burst of air.\u003c/p\u003e\n\u003cp\u003e“How confident are you that a mere Vapour Phase Magus dares provoke a Crystal Phase Magus?” Tanasha was expressionless, but her fury was evident.\u003c/p\u003e\n\u003cp\u003e*Snap!* Tanasha extended her delicate, pale arms and a translucent layer appeared on top of her smooth skin.\u003c/p\u003e\n\u003cp\u003eLeylin had used all his might when he shot this Lance of Corrosion forth, and yet, she’d caught it just like that.\u003c/p\u003e\n\u003cp\u003e*Boom!* She viciously crushed the Lance into powder, while Leylin paled as he took several steps back.\u003c/p\u003e\n\u003cp\u003eHowever, his smile now was as if he had gotten away with something.\u003c/p\u003e\n\u003cp\u003e“Hm?” Tanasha’s brows furrowed. Only then did she notice that after the Lance of Corrosion had been destroyed, a white feather had appeared.\u003c/p\u003e\n\u003cp\u003e*Pu!* The white feather had exploded into powder and lightly stuck to Tanasha’s body.\u003c/p\u003e\n\u003cp\u003e“This aura? And with a powerful lock-on spell formation…” Tanasha’s brows furrowed and she immediately sneered, “I just need two minutes to-”\u003c/p\u003e\n\u003cp\u003eHowever, her expression completely changed.\u003c/p\u003e\n\u003cp\u003eLeylin, who was opposite her, waved his arms towards her and activated the Dark Elven Crown, and immediately turned invisible.\u003c/p\u003e\n\u003cp\u003e*Sou! Sou! Sou!*\u003c/p\u003e\n\u003cp\u003eNumerous black figures appeared. The shadow servants from before quickly pounced towards her, only to be killed by her while heading in her direction.\u003c/p\u003e\n\u003cp\u003eHowever, with this opportunity, they threw some bloodline crystals, bones and the like at her legs. There was an especially large egg that had been knocked so hard that it broke, revealing the egg yolk and whites within.\u003c/p\u003e\n\u003cp\u003e*Chu chu!* Numerous Blood Condors hurried over under the lead of the king, and upon seeing Tanasha, their eyes instantly turned red.\u003c/p\u003e\n\u003cp\u003eThis was especially so for the the King Blood Vulture. It smelt its feather on Tanasha’s body. It was a feather used specifically to protect the Lamia fingerbone and was extremely precious. The smell was extremely unique, and there was no way it could recognise it wrongly!\u003c/p\u003e\n\u003cp\u003eIt now looked like the person who had infiltrated its mountain and looted the area as they wished, was also the thief who had stolen its treasure!\u003c/p\u003e\n\u003cp\u003eThe King Blood Vulture was furious, crimson lightning materialising around it.\u003c/p\u003e\n\u003cp\u003e“I- I- I!” Tanasha was momentarily stunned. No matter how stupid she might be, she knew what Leylin had planned.\u003c/p\u003e\n\u003cp\u003e“Wait, O King!” Tanasha was now sending spiritual force waves to the mind of the King Blood Vulture, her final attempt at saving herself.\u003c/p\u003e\n\u003cp\u003eHowever, would the enraged King Blood Vulture listen to her explanations? Though it had the intelligence of an adult, it was now in an angered state. Usually, in its territory, it would have what it wanted. Why would it listen to the explanations of a human?\u003c/p\u003e\n\u003cp\u003eNumerous bolts of crimson lightning struck down, drowning her...\u003c/p\u003e\n\u003cp\u003eMeanwhile, Leylin had made use of the Dark Elven Crown, and was sneakingly heading back.\u003c/p\u003e\n\u003cp\u003e*Boom!* Soil upended at an area, revealing numerous bloodline items within. Red gems and white bones were scattered, giving off a dazzling luster.\u003c/p\u003e\n\u003cp\u003e“There’s even a Blood Vulture egg here! It looks like a pretty good harvest.”\u003c/p\u003e\n\u003cp\u003eHolding a giant egg in his hands, Leylin looked elated. This was a few times larger than an ostrich egg, and it even had blood-red patterns on the surface, powerful life energy radiating from within. Leylin could even feel a throbbing from the shell.\u003c/p\u003e\n\u003cp\u003eBlood Vulture chicks could not be tamed, but one still in its egg could.\u003c/p\u003e\n\u003cp\u003eNot only did it have the ability to find bloodline treasures, it was also very popular for its ability to reach rank 3 after it had matured.\u003c/p\u003e\n\u003cp\u003eOf course, Leylin had no plans of selling it off. Rather, he wanted to subdue it.\u003c/p\u003e\n\u003cp\u003eThe central continent was vast and boundless. There were many places that even Magi were yet to explore, and the Blood Vulture’s ability to fly was very useful in this area. In the future, he could gain a steady flow of bloodline treasures, which was the best advantage!\u003c/p\u003e\n\u003cp\u003e“The harvest is quite good!” Leylin quickly kept everything properly.\u003c/p\u003e\n\u003cp\u003eHe had long since ordered the shadow servants to place whatever they had stolen on the road here. Whatever had been flung at Tanasha’s feet was just a small portion. The real treasures had long since been moved away and were all with Leylin.\u003c/p\u003e\n\u003cp\u003eAfter checking all his gains, Leylin looked back towards the Blood Vultures’ mountain, sinking into deep thought.\u003c/p\u003e\n\u003cp\u003e‘The King Blood Vulture has brought all its main forces to annihilate Tanasha. She is a Crystal Phase Magus after all, and it is possible for her to hold them off for some time. Should I go back and rummage through the Blood Vultures’ nests?’\u003c/p\u003e\n\u003cp\u003eLeylin immediately shook his head, throwing these enticing thoughts out of his mind.\u003c/p\u003e\n\u003cp\u003e“Forget it. What I now have is more than enough. I shouldn’t take such a risk at the end like this.”\u003c/p\u003e\n\u003cp\u003e“Besides, my real target is that rank 3 Crystal Phase Magus, not the rest of those bloodline treasures.”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes flashed ruthlessly...\u003c/p\u003e\n\u003cp\u003e“Damn it! Damn it! Damn it! I want to slaughter that wretched Magus and turn his flesh and blood into powder and feed it to a Carnivorous Flower!”\u003c/p\u003e\n\u003cp\u003eTanasha was in a tropical rain forest, sprinting hard.\u003c/p\u003e\n\u003cp\u003eHowever, she was evidently not in a very good condition. Not only were her clothes in tatters making her seem like a beggar, her entire right arm had disappeared. Her face was pale, with green veins visible on top.\u003c/p\u003e\n\u003cp\u003eThis flock of Blood Vultures was truly relentless. In order to break away from them, Tanasha had to employ a few secret methods that would stimulate the potential in her body in succession. She had even discarded a clone that she had nurtured for a long period of time before she could successfully draw the King Blood Vulture away.\u003c/p\u003e\n\u003cp\u003eTanasha was definitely fuming at the mouth, wishing she could eat Leylin alive.\u003c/p\u003e\n\u003cp\u003e“Tsk tsk, Ms Tanasha, you don’t seem to be in good health. Do you need treatment?” In the quiet rainforest, a voice suddenly sounded, causing Tanasha’s body to stiffen.\u003c/p\u003e\n\u003cp\u003eShe then looked at the young man she would never be able to forget, blocking her path.\u003c/p\u003e\n\u003cp\u003e“How- how did you get here? I already destroyed all auras and smells that would identify me!” Tanasha gaped, disbelieving.\u003c/p\u003e\n\u003cp\u003e“You don’t need to know. Right now, you can only answer a question of mine.”\u003c/p\u003e\n\u003cp\u003eLeylin produced an ink-black cross blade and pointed it at her. “Submit to me, or die.”\u003c/p\u003e\n\u003cp\u003eHe had naturally used the A.I. Chip to scan the surroundings and hunt her down. Though Tanasha had concealed her aura very well, and destroyed all the localizing marks that Leylin had shot out, nothing could be hidden in the face of the A.I. Chip.\u003c/p\u003e\n\u003cp\u003eNot considering anything else, just the signs of a human passing through on the road would not be able to escape the A.I. Chip’s nanoscopic scanning, no matter how hard Tanasha tried to cover her tracks.\u003c/p\u003e\n\u003cp\u003eIt was only after Leylin confirmed that she was heavily injured that he chased up to her.\u003c/p\u003e\n\u003cp\u003eTanasha was at the Crystal Phase, and was multiple levels higher than Leylin. In the past, it would have been a joke if a Vapour Phase Magus had announced his wish to kill a Crystal Phase Magus.\u003c/p\u003e\n\u003cp\u003eHowever, a hint of fear had already appeared on Tanasha’s pale face. She had no choice but to admit that Leylin had the strength and ability to kill the current her.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-430\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-432\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-431","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
