{"id":58988,"no":432,"title":"Chapter 432","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eSubjugation\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eRank 3 Magi were categorised into several stages. Leylin, at the Vapour Phase, could compress his spiritual force into a physical, observable fog.\u003c/p\u003e\n\u003cp\u003eOn the other hand, Magi at the Crystal Phase could solidify their spiritual force, even preserving it to sell.\u003c/p\u003e\n\u003cp\u003eSpiritual force at the Crystal Phase had an unimaginable advantage against Vapour Phase spiritual force.\u003c/p\u003e\n\u003cp\u003eIn other words, even if Leylin, Robin and Kesha had teamed up against Lucian, they wouldn’t be his match.\u003c/p\u003e\n\u003cp\u003eHowever, Tanasha’s spiritual force was exhausted long ago, including her Crystal Phase spiritual force crystals.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t be Leylin if he let such a good chance slip out of his hand.\u003c/p\u003e\n\u003cp\u003eNot only were Crystal Phase Magi powerful, they were considered nobles in the central continent due to their status as the reserve forces of Morning Star Magi.\u003c/p\u003e\n\u003cp\u003eUnder usual circumstances, it was out of the question for Leylin to defeat Magi of this rank. Perhaps only Duke Gilbert, his mentor, would be able to.\u003c/p\u003e\n\u003cp\u003eBut with Tanasha as she was, it would be easy.\u003c/p\u003e\n\u003cp\u003e“You…” Tanasha’s pale complexion flushed in anger, her fingers trembling, “How dare a lowly Vapour Phase Magus talk to me like that?”\u003c/p\u003e\n\u003cp\u003e“Looks like I’ll have to help you snap back to reality!” Leylin sighed in disappointment upon seeing her demeanour. His figure transformed into a ray of light and flashed in front of her.\u003c/p\u003e\n\u003cp\u003e*Thump!* He planted a fist on Tanasha’s cheek.\u003c/p\u003e\n\u003cp\u003e*Buzz!* A barrier of light was created around Tanasha as a brilliant ruby ring shone. It was, however, too feeble to deter Leylin as he easily broke through.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, Tanasha was sent flying, a large red patch on her cheek.\u003c/p\u003e\n\u003cp\u003eThe Meteor Sword has already reached her neck before she could react.\u003c/p\u003e\n\u003cp\u003e“Now choose… Surrender, or die!” There was a change in Leylin’s tone. Now he demanded with utter disdain, every word pricking with a bone-chilling vibe. He had decided to kill were she to choose it.\u003c/p\u003e\n\u003cp\u003eHe certainly did not wish to leave behind a Crystal Phase opponent.\u003c/p\u003e\n\u003cp\u003eTanasha wisely chose to be silent in front of the cold-hearted Leylin.\u003c/p\u003e\n\u003cp\u003eThis feeling of impending death was familiar to her. She felt as if she had returned to times of frailty and weakness, as old memories surfaced and she momentarily became distraught.\u003c/p\u003e\n\u003cp\u003e“What is with this woman’s mental state?!” Leylin shook his head, Tanasha’s reaction was nothing out of the ordinary since he was aware of the common psychological instability of Magi. There was also her injuries to consider. Moreover, all who entered the Forgotten Land would certainly have a dark past of own.\u003c/p\u003e\n\u003cp\u003e“I’m only giving you three minutes! Be quick!” Leylin tightened his grip on the sword and brought it closer to Tanasha’s neck.\u003c/p\u003e\n\u003cp\u003eOther Crystal Phase Magi would probably have a sense of dignity and pride, but things were different in the Forgotten Land. Those human Magi who entered here were mostly those who had reached an impasse, willing to forgo everything for a means of sustenance. It was easy for the mto capitulate.\u003c/p\u003e\n\u003cp\u003eLeylin’s cold voice caught Tanasha’s attention. The angry flush on her face had already dissipated by then, leaving behind a canvas of ivory.\u003c/p\u003e\n\u003cp\u003e“I… surrender!” She replied so softly Leylin could barely hear a thing.\u003c/p\u003e\n\u003cp\u003eAs if on cue, Tanasha fell limp to the ground, her backbone losing support the moment she agreed. Her tears were uncontrollable.\u003c/p\u003e\n\u003cp\u003eThe Meteor Sword remained on her neck in spite of everything.\u003c/p\u003e\n\u003cp\u003e“Make an oath! Also, relinquish your spirit source!” His voice was cold as ice.\u003c/p\u003e\n\u003cp\u003e“I… Tanasha…” Hesitance crossed Tanasha’s eyes as she fought an internal battle. However, she ended up choosing to surrender.\u003c/p\u003e\n\u003cp\u003eA sparkling strand of spirit source was released from her forehead and landed on Leylin’s palm.\u003c/p\u003e\n\u003cp\u003eThat was a Magus’ lifeline. Were it not voluntary, it would be completely impossible to offer it to another person. Rules were even stricter in the central continent, to prevent the dominance of one over another. Of course, this didn’t stop people with influence and power from committing it but similarly, it had to be done in secret or they would be boycotted by all Magi.\u003c/p\u003e\n\u003cp\u003eThis was no issue at all for Leylin since he didn’t plan for Tanasha to be seen by others.\u003c/p\u003e\n\u003cp\u003e“Master…” Tanasha called out in a deep voice and got up to her feet. She resembled a broken puppet, someone that had lost her soul.\u003c/p\u003e\n\u003cp\u003e“Being forced into the Forgotten Land, you must have your own dark past. But rest assured, I am not going to compel you to do things that are disgraceful to Magi. Instead, I can give you hope. A hope for revenge.”\u003c/p\u003e\n\u003cp\u003eThere was a bewitching tone to Leylin’s offer and Tanasha’s eyes lit up a little as the word ‘revenge’ rang in her ears and a hint of anger rushed through her.\u003c/p\u003e\n\u003cp\u003e“That’s right! Revenge!” Leylin made eye contact with Tanasha and lowered his voice. “I promise, when I’m strong enough to take revenge for you and not worry about the possible repercussions and retaliation, I will aid you in accomplishing your dream. That is, if you work for me wholeheartedly till then.\u003c/p\u003e\n\u003cp\u003e“I’m not trying to patronise you. You see, I’ve reached the Vapour Phase at less than a hundred years of age. Moreover, there will be no problems with advancing to the Morning Star realm because of my Kemoyin bloodline!”\u003c/p\u003e\n\u003cp\u003eDeep down, Leylin was aware that with his method, Tanasha would only be willing to become a puppet to him. To milk her for everything she was worth, Leylin needed to ignite her battle spirit by fuelling her with hope.\u003c/p\u003e\n\u003cp\u003eAnd instead of empty promises, he promoted his skills to Tanasha, proving his capability to help her in her revenge.\u003c/p\u003e\n\u003cp\u003e“One hundred years old! Vapour Phase!” Tanasha gazed at Leylin with a heightened intensity.\u003c/p\u003e\n\u003cp\u003eA hundred years of age was definitely old for humans. But for Magi, especially those who were at rank 3 and above, it wouldn’t even be considered as puberty.\u003c/p\u003e\n\u003cp\u003eFor Leylin who have both the talent and bloodline of the Giant Kemoyin Serpent, his status in the Ouroboros Clan could not be overlooked. All this pointed to one thing: There was a substantial chance for him to become a Morning Star Magus.\u003c/p\u003e\n\u003cp\u003eEven someone with the capability to escape a rank 3 Crystal Phase Magus would crumble like paper in the face of a rank 4 Morning Star Magus.\u003c/p\u003e\n\u003cp\u003e“I am at your beck and call, Master! I, Tanasha, will be your most loyal servant as long as my revenge is assured!” Tanasha knelt on a knee and gritted her teeth, a little more willing this time.\u003c/p\u003e\n\u003cp\u003eAlthough it was a mere promise without a covenant, what more could a captive like her bargain for?\u003c/p\u003e\n\u003cp\u003e”Haha…” Leylin cackled.\u003c/p\u003e\n\u003cp\u003eThe addition of Tanasha was definitely a reinforcement to Leylin, given her strength which was more than his.\u003c/p\u003e\n\u003cp\u003ePlus, she would be hidden from the public since this assistance would be carried out in secret.\u003c/p\u003e\n\u003cp\u003eThat was Leylin’s plan all along, to gather as much of an underground force as he could in case anything unexpected occurred.\u003c/p\u003e\n\u003cp\u003e“Take these potions quickly and recover!” Leylin showed generosity to the newly-recruited Tanasha and presented her with three tubes of differing colours.\u003c/p\u003e\n\u003cp\u003e“High-grade healing potion! High-grade spiritual force recovery potion! Sacred regeneration potion!” Tanasha’s face was painted with surprise as she recognised these three potions. Apart from their heavenly price, these potions were heavily utilised by large-scale organisations as their war reserves and could not even be bought with money.\u003c/p\u003e\n\u003cp\u003eThis was especially true for the sacred regeneration potion which could stimulate the regrowth of limbs that were as good as the original with absolutely no side-effects. It was unfamiliar, even to a rank 3 Magus like Tanasha.\u003c/p\u003e\n\u003cp\u003e“Thank you, Master!” Tanasha bowed and sighed in relief,\u003c/p\u003e\n\u003cp\u003e“Don’t mention it, it’s just something I made!” Leylin added to his credibility.\u003c/p\u003e\n\u003cp\u003eSure enough, Tanasha’s eyes widened at his sentence. She was beyond impressed, advancing to Vapour Phase before the age of a hundred was amazing enough, she did not at all expect that Leylin would be a Potions Grandmaster as well. This was genius at its best and would be considered rare even in the central continent. As long as there were no mishaps along the way, success was pretty much guaranteed.\u003c/p\u003e\n\u003cp\u003eHints of hope filled Tanasha’s eyes as she watched Leylin...\u003c/p\u003e\n\u003cp\u003eSimultaneously, in a clandestine area, Noah was staring at his dish, face drained of colour.\u003c/p\u003e\n\u003cp\u003eThere was an indistinct bloody liver-like substance lying on the white china, emitting a chalky fog.\u003c/p\u003e\n\u003cp\u003e“Eugh…” Noah slapped a palm over his mouth, resisting the urge to gag.\u003c/p\u003e\n\u003cp\u003eIn his vision, the Barbarian Bear Shaman’s stomach was cut open, and a large amount of yellow grease flowed out from it. There were also visible traces of the skeleton inside.\u003c/p\u003e\n\u003cp\u003e“Uncle, I can’t do this any longer!” Noah cried through the spaces of his fingers.\u003c/p\u003e\n\u003cp\u003eRobin didn’t look good either, his body was missing huge chunks of flesh and he was covered in terrifying wounds.\u003c/p\u003e\n\u003cp\u003e“It was rumoured that this place is dominated by the sin of gluttony, we will be attacked if we stop partaking! We have to keep going, success will be ours if they fail first.”\u003c/p\u003e\n\u003cp\u003eRobin persisted to his best abilities whereas Noah’s hand trembled as he picked his cutlery. Ultimately, he put them down again. All the food here was created from the sin of gluttony and due to it, all spells would be rendered useless; only their own tenacity could help them withstand the ‘feast’. *Ring ring ring!* The melodious bell rang from afar, but to the trio it seemed like it came from the depths of hell...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-431\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-433\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-432","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
