{"id":58989,"no":433,"title":"Chapter 433","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eRescue\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eNoah made several attempts to reach for the knife and fork but he gave up halfway, letting out an expression of intense suffering.\u003c/p\u003e\n\u003cp\u003eHe collapsed on the dining table with a bang, his teeth clenched tightly.\u003c/p\u003e\n\u003cp\u003eSimilarly, Robin had a pained look on his face as he endured the nausea and swallowed a bloody piece of meat.\u003c/p\u003e\n\u003cp\u003eWithin 30 seconds, the ringing of the bells came to an end, lasting only for a short duration.\u003c/p\u003e\n\u003cp\u003e*Ka-cha!* Out of nowhere, it seemed as if a huge invisible mouth took a bite. At this moment, Noah let out a deep cry.\u003c/p\u003e\n\u003cp\u003eA large portion of his flesh was missing on the right side of his head, his ear having completely disappeared. From the side, his ghastly white teeth could be seen. It was a horrifying sight.\u003c/p\u003e\n\u003cp\u003eSuddenly, a streak of light flashed across. A bloodied ear, still twitching unconsciously, appeared before a dark figure.\u003c/p\u003e\n\u003cp\u003e“Ew…….”\u003c/p\u003e\n\u003cp\u003eAfter a few rounds, Robin and Noah had paled, now resembling corpses. However, the Barbarian Bear Shaman on the other end had finally reached its limit and collapsed onto the table.\u003c/p\u003e\n\u003cp\u003e*Buzz!* As if a signal was given, the Barbarian Bear Shaman was immediately moved to the 13th chair, which was unoccupied. When this was done, numerous dark figures pounced on it.\u003c/p\u003e\n\u003cp\u003e“Ah……” The Barbarian Bear Shaman shrieked continuously. Soon after, fur and skin started disappearing piece by piece, followed by flesh, veins and even bones.\u003c/p\u003e\n\u003cp\u003e*Hoo...* The Crystal Phase Barbarian Bear Shaman no longer had any power to fight back and vanished within the dark figures.\u003c/p\u003e\n\u003cp\u003eEven up till the very last moment of its life, the Barbarian Bear Shaman was still very much conscious, as could be seen from the expression in its eyes.\u003c/p\u003e\n\u003cp\u003eAfter they engulfed the Barbarian Bear Shaman, the many dark figures dispersed and vanished into thin air one after another. At the same time, Noah could feel the strong imprisonment fading..\u003c/p\u003e\n\u003cp\u003e“It’s finally over…” he sighed, plopping to the ground shortly after. He began to vomit, almost to the point of spewing out bile.\u003c/p\u003e\n\u003cp\u003e“I swear. I won\u0027t be able to eat anything for at least three months…” Despite his bitter expression, Noah’s bodily wounds were in fact healing quickly.\u003c/p\u003e\n\u003cp\u003eHowever, Robin’s fervent eyes were fixed on a particular part of the void. From Noah’s perspective, a presence had already arrived somewhere.\u003c/p\u003e\n\u003cp\u003e“What reward do you wish for?” An inexplicable voice rang within the hearts of the two men.\u003c/p\u003e\n\u003cp\u003e“I want…” Robin answered. His voice was deep, but even more so, it carried his unrestrainable excitement…….\u003c/p\u003e\n\u003cp\u003eAt this point in time, Leylin walked out of the ecological garden with Tanasha and they returned to the illusory corridor.\u003c/p\u003e\n\u003cp\u003e“Master... According to our research, we will be able to get out after passing 3 more spatial points.” Tanasha’s condition seemed to have improved greatly, and even her missing arm was able to grow out again with the help of the potions.\u003c/p\u003e\n\u003cp\u003e“Yes,” Leylin nodded.\u003c/p\u003e\n\u003cp\u003e“After we get out, stay in the Forgotten Land for the time being. Wait for an opportunity to sneak out and join me! Do you have any restrictions in your organisation?”\u003c/p\u003e\n\u003cp\u003e“No! I am one of the leaders in the Alliance of the Exiled, I didn’t agree to any sort of soul-binding contract!” Tanasha responded quickly. It wasn’t surprising given her Crystal Phase strength.\u003c/p\u003e\n\u003cp\u003e“That\u0027s good…” Leylin nodded. He was about to say something else but all of a sudden, his expression changed and he gave Tanasha a look.\u003c/p\u003e\n\u003cp\u003eTanasha acknowledged with a nod before disappearing into a wave of water.\u003c/p\u003e\n\u003cp\u003eBased on the readings on the A.I. Chip, Magus energy waves were detected ahead. Since Tanasha was a backup plan arranged by Leylin, she could not show herself easily in front of outsiders.\u003c/p\u003e\n\u003cp\u003eLeylin smiled at Tanasha, who was now concealed behind the water, and walked past a corner.\u003c/p\u003e\n\u003cp\u003eThen, he saw a warlock dressed in a black robe, slumped on the ground. A puddle of black blood was growing beside him. Leylin knew this warlock well - he was one of Kesha’s men, named Arcus.\u003c/p\u003e\n\u003cp\u003e“Wake up, Arcus!” Leylin flipped Arcus over and immediately noticed the criss-crossed wounds on his chest as dark blood gushed out continuously.\u003c/p\u003e\n\u003cp\u003e“Curse power!” Leylin’s expression hardened as he felt an enormous power from the long, narrow cuts.\u003c/p\u003e\n\u003cp\u003eAs a Magus, Leylin was knowledgeable in curses, especially those in the Book of Giant Serpent, left behind by Great Magus Serholm. They inspired him greatly and even led him to develop many new ones of his own. This knowledge helped him to a great extent when he was at the south coast.\u003c/p\u003e\n\u003cp\u003eHowever, the deeper his knowledge, the more he understood about the strangeness and difficulty in coping with such power.\u003c/p\u003e\n\u003cp\u003eIn particular, the curses from ancient times were those that Leylin was unwilling to make contact with even now.\u003c/p\u003e\n\u003cp\u003eIt seemed like Quicksand Castle also contained a terrifying curse power, and this power had already found its way to Kesha and her group.\u003c/p\u003e\n\u003cp\u003eTo the unconscious Arcus, whose face was faintly branded with a spell made of dark fumes, Leylin looked at him and said, “Today is your lucky day!” He then smiled and pulled out a tube filled with a green solution from his leather pouch.\u003c/p\u003e\n\u003cp\u003eLeylin applied the thick, green fluid onto Arcus’ wounds drop by drop.\u003c/p\u003e\n\u003cp\u003e*Sizzle!* The green fluid immediately went through a strange transformation as it condensed into many tiny green worms, which remained on Arcus’ skin. It was a rather disgusting sight.\u003c/p\u003e\n\u003cp\u003eAfter that, the numerous green worms aimed at the dark fumes and pounced on them. They engulfed the dark curse power as if they were having a meal.\u003c/p\u003e\n\u003cp\u003eAs time went by, the dark fumes on Arcus’ face slowly faded away and he opened his eyes.\u003c/p\u003e\n\u003cp\u003e“M...Master Leylin! Thank you for saving me!” Arcus had realised the situation he was in. He struggled to bow but was stopped by Leylin.\u003c/p\u003e\n\u003cp\u003e“Did something happen to sister Kesha and the others?” Leylin’s voice was calm and full of wisdom.\u003c/p\u003e\n\u003cp\u003e“Yes, yes! After we entered Quicksand Castle, we were attacked!” Arcus answered with his pale, dry lips, sounding a little frightened.\u003c/p\u003e\n\u003cp\u003e“It’s a terrifying monster in human form! Not only are spells and physical attacks ineffective, the wounds inflicted by its scissors cannot heal! It also possesses a frightening ability to enter the void and heal itself!”\u003c/p\u003e\n\u003cp\u003e“Sir! Please save my master!” Arcus pleaded sincerely.\u003c/p\u003e\n\u003cp\u003e“Don’t worry! We are an organisation of bloodline brothers and Kesha is also my sister. I will not leave her in the lurch!”\u003c/p\u003e\n\u003cp\u003e“Rather than that, you……”\u003c/p\u003e\n\u003cp\u003e“I’m fine! I can leave by myself!” Arcus knew for sure that his presence was a burden thus he made a sensible decision.\u003c/p\u003e\n\u003cp\u003e“Alright! We are already near the exit, all you have to do is avoid the Magi outside, then leave this pocket dimension!”\u003c/p\u003e\n\u003cp\u003eLeylin nodded and watched Arcus as he limped out of the place.\u003c/p\u003e\n\u003cp\u003e“Master, are you going to save them?” A wave swept past the empty space and Tanasha, who had been concealed all these time, appeared again.\u003c/p\u003e\n\u003cp\u003e“Yes!” Leylin nodded.\u003c/p\u003e\n\u003cp\u003eKesha had been good to him and they were relatively close. He had to save her.\u003c/p\u003e\n\u003cp\u003eOf course, more importantly, through his analysis of Arcus, Leylin had already prepared himself for said curse . At the very least, he could ensure his own safety.\u003c/p\u003e\n\u003cp\u003eIf it was like that, there was no reason to refuse to rescue them while he was here.\u003c/p\u003e\n\u003cp\u003e“You don\u0027t have to involve yourself with this matter anymore, you may leave first!” Leylin ordered Tanasha.\u003c/p\u003e\n\u003cp\u003eAfter that, he immediately handed a large black box to her.\u003c/p\u003e\n\u003cp\u003e“You have to guard the contents of this box carefully. Do not open it, return it to me when we meet again later!”\u003c/p\u003e\n\u003cp\u003e“Yes, Master!” Tanasha bowed. After receiving the box from Leylin, a bright light flashed and the item disappeared.\u003c/p\u003e\n\u003cp\u003eAlthough rare, spatial artifacts could be found even on the south coast and Twilight Zone, leave alone the central continent.\u003c/p\u003e\n\u003cp\u003eTanasha had long since entered the Crystal Phase. A storage artifact was no big deal.\u003c/p\u003e\n\u003cp\u003eAs he watched Tanasha’s silhouette moving away, Leylin turned in the opposite direction and disappeared into the corridor.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Huff……”\u003c/p\u003e\n\u003cp\u003eKesha hid behind a large shelf, and her tall chest moved up and down unsteadily as she breathed.\u003c/p\u003e\n\u003cp\u003e“How is it? Has the trap succeeded?”\u003c/p\u003e\n\u003cp\u003eShe asked a Green-skinned Barbarian beside her. Both Kesha and the Green-skinned Barbarian had long, narrow wounds on their bodies. A pool of dark gas circled above those wounds.\u003c/p\u003e\n\u003cp\u003eThese two Magi were almost entirely drained of their energies and they were at their worst condition.\u003c/p\u003e\n\u003cp\u003e“The Fogbound Labyrinth can only trap it for 3 minutes!” The Green-skinned Barbarian said bitterly.\u003c/p\u003e\n\u003cp\u003e“Damn it! That amount of time isn’t even enough for us to recover, not to mention getting past the illusory corridor!” Kesha looked despair.\u003c/p\u003e\n\u003cp\u003eBeing pursued by the man in black, especially after sustaining such injuries, the illusory corridor had refused to transport a cursed person like her several times. They were practically trapped in there while still alive.\u003c/p\u003e\n\u003cp\u003eBy now, both Magi were already at the their limits. They had no more strength to fight back.\u003c/p\u003e\n\u003cp\u003e“I’d never expected that I would die here, and with a green-skinned dwarf beside me!” Kesha let out a faint sigh.\u003c/p\u003e\n\u003cp\u003e“What did you say, woman?” Angered after being called a dwarf, the Green-skinned Barbarian jumped up and pointed his staff at Kesha’s nose. “If you guys hadn’t intruded and killed many of our clan members, we wouldn’t have chased after you and we wouldn’t have run into that thing!”\u003c/p\u003e\n\u003cp\u003e“You…” Kesha wanted to refute further but her expression suddenly changed. She and the Green-skinned Barbarian dodged in opposite directions.\u003c/p\u003e\n\u003cp\u003eKa-cha! A brilliant, silver-white light streaked across and the large shelf was split into two. It exposed the silhouette of a man in a black trenchcoat who held a pair of scissors emitting a sharp radiance.\u003c/p\u003e\n\u003cp\u003e“Oh no! It broke through earlier than expected!” The Green-skinned Barbarian turned pale, looking even greener than usual, and it began to shiver.\u003c/p\u003e\n\u003cp\u003e“Fuck! I knew it, you green-skinned dwarves can’t be trusted!” Out of her despair, Kesha burst out swearing.\u003c/p\u003e\n\u003cp\u003eThe man in black made an ambiguous howl. The sounds of the scissors echoed as his footsteps slowly drew near.\u003c/p\u003e\n\u003cp\u003eWith her sea of consciousness now dried up, a bitter smile emerged on Kesha’s face. However, the man in black was evidently not one to show mercy even towards a female as he raised his hand and pierced at Kesha’s eyes with the scissors.\u003c/p\u003e\n\u003cp\u003e“Explosive Fireball!” A massive explosion sounded.\u003c/p\u003e\n\u003cp\u003eNumerous dark figures gathered to form a cage and bound the man in black.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-432\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-434\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-433","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
