{"id":58992,"no":436,"title":"Chapter 436","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003ePrivate Airship\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“What exactly is going on?” Noah shook his head, still feeling slightly giddy.\u003c/p\u003e\n\u003cp\u003e“Demon Hunter Cyril tried to hinder us, but Mentor showed up in time to save us, as simple as that!” Kesha laughed bitterly.\u003c/p\u003e\n\u003cp\u003eThe great name of Demon Hunter Cyril struck his ears like a peal of thunder. Rumour had it that this infamous, ferocious being would make even the most cunning devil burst out in tears, regretting that they were ever born into this world.\u003c/p\u003e\n\u003cp\u003eSimply thinking about falling into the hands of such a person had her breaking out in cold sweat.\u003c/p\u003e\n\u003cp\u003e“I should’ve thought of it earlier. Nefas, the city of sins, and the Forgotten Land are in close proximity and there are frequent interactions between their people. It is impossible that the forces in the Forgotten Land are not in contact with the Demon Hunter.” Robin’s face was full of remorse.\u003c/p\u003e\n\u003cp\u003eIn actual fact, what he meant was that those forces were the other party’s lackeys. When they saw that they could not handle their group, they immediately informed their master.\u003c/p\u003e\n\u003cp\u003eHowever, there was no conclusive evidence. In addition to that, the Demon Hunter was also a Morning Star Magus, which was why Robin spoke obscurely.\u003c/p\u003e\n\u003cp\u003e“If Mentor Gilbert hadn’t arrived in time, we would’ve been in grave danger. Oh yes, why did Mentor come here?” Robin asked with a doubtful expression.\u003c/p\u003e\n\u003cp\u003e“It was me!” Leylin stood out and gave a bitter laugh.\u003c/p\u003e\n\u003cp\u003e“Before I left, I’d already had a bad premonition. Thus, I gave Parker a letter. If I failed to return within the time limit, he would hand it over to Lucian immediately, who would then pass it on to Mentor… Thank goodness! Brother Lucian is indeed trustworthy. Mentor also didn’t get caught up in a high-level experiment……”\u003c/p\u003e\n\u003cp\u003eHis words were only partly true. As a matter of fact, it was the Coin of Destiny which allowed Leylin to predict the interference of a force at the Morning Star realm. However, he could not bear to give up on the Lamia Hair, hence he adopted such a compromising measure.\u003c/p\u003e\n\u003cp\u003eFrom the looks of it, it wasn’t a bad result.\u003c/p\u003e\n\u003cp\u003e“Sorry! I acted on my own!” Leylin admitted and apologised immediately.\u003c/p\u003e\n\u003cp\u003e“No! It’s nothing! We still have to thank you for your vigilance!” Robin waved.\u003c/p\u003e\n\u003cp\u003e“That’s right! Who would’ve known that the Demon Hunter was actually so treacherous? He even tried to snatch away small fries like us!” Kesha spoke with a face full of indignation.\u003c/p\u003e\n\u003cp\u003e“Silence!” Leylin and Robin shouted simultaneously to stop her.\u003c/p\u003e\n\u003cp\u003e“Towards Morning Star Magi, even if we are enemies, respect must be given no matter what! This is to respect the truth!” Kesha flushed red from embarrassment and lowered her head.\u003c/p\u003e\n\u003cp\u003e*Rumble!* At this time, a large wave was transmitted from afar. Leylin looked towards that direction in concern.\u003c/p\u003e\n\u003cp\u003e“No need to worry! The Demon Hunter may be famed for his strength, but you have to believe in our Mentor. He is also very powerful!” Robin noticed the worries on Leylin’s mind and gave him a comforting smile.\u003c/p\u003e\n\u003cp\u003e“Let’s hope things will be as such!” Leylin replied a little forcefully.\u003c/p\u003e\n\u003cp\u003eGetting Duke Gilbert out was already his last resort. Apart from this mentor, he could no longer think of any other ways to make the Demon Hunter give up.\u003c/p\u003e\n\u003cp\u003eShould their mentor be defeated, the students themselves would not have a good ending as well.\u003c/p\u003e\n\u003cp\u003e“Strength! It still comes down to strength!” Leylin could not help but clench his fists together as his yearning for the Morning Star realm grew.\u003c/p\u003e\n\u003cp\u003e*Whoosh!* A scarlet ray of light streaked across the horizon and Gilbert’s silhouette emerged before Leylin and the others.\u003c/p\u003e\n\u003cp\u003e“Mentor!” Robin and Leylin rushed to bow.\u003c/p\u003e\n\u003cp\u003e“You rascals, look what trouble you’ve gotten yourselves into, you even provoked Cyril!” Gilbert swept his eyes over before a smile surfaced on his bald, bare face. It seems, that in the battle between him and the Demon Hunter, he was not on the losing end.\u003c/p\u003e\n\u003cp\u003eAfter realising that, Leylin heaved a sigh of relief in his heart. At least the worst case scenario no longer had a chance of occurring.\u003c/p\u003e\n\u003cp\u003e“Alright! You must be exhausted after the expedition, just take a trip back on my airship!”\u003c/p\u003e\n\u003cp\u003eSmiling, Gilbert waved his hand and a small airship appeared on the spot.\u003c/p\u003e\n\u003cp\u003eAlthough it was smaller in size than the public airships, it was evidently more luxurious and ornate. The spell formations drafted on it were also more intricate and powerful.\u003c/p\u003e\n\u003cp\u003e“This is…” Leylin’s mouth opened wide.\u003c/p\u003e\n\u003cp\u003eDespite its small size, it was still a proper airship! With enough space to fit an airship of this size, surely Duke Gilbert’s space artifacts must have been at the level of magic equipment at least!\u003c/p\u003e\n\u003cp\u003eBut Robin thought Leylin had lost his senses because of the airship. “This is the ‘Black Scale,’ Mentor’s ship. When he advanced to become a Morning Star Magus, the Fayle clan sent it as a gift. It can use any network of channels and will be treated as an honoured guest at maintenance and rest stops!” he explained with a smile.\u003c/p\u003e\n\u003cp\u003e“What a lavish clan!” Leylin gasped. The family which had control over the central continent’s airship channels, had a lot of inside information as expected.\u003c/p\u003e\n\u003cp\u003e“Will they send a gift for every Morning Star Magus after they are promoted?” Leylin suddenly remembered and asked.\u003c/p\u003e\n\u003cp\u003e“That\u0027s right! Basically, after a Magus is promoted, the Fayle clan will definitely send a private airship as a gift!” Robin nodded.\u003c/p\u003e\n\u003cp\u003e“What a great scale of spending!” Of course, Leylin knew very well that it was probably not the intention of the Fayles. Instead, the Monarch of the Skies was using the chance to get on the good sides of the Morning Star Magi.\u003c/p\u003e\n\u003cp\u003eThe Black Scale’s interior was very luxurious. Comprising a master room, guest room, kitchen, meditation room and a customized living room, the airship was big enough to accommodate dozens of people without seeming crowded. For a private airship, this was enough.\u003c/p\u003e\n\u003cp\u003eGilbert sat on a sofa in the middle of the living room while Leylin and the other 3 stood respectfully at one side. A few clear-winged elves carried the teapot and cups and swiftly poured a cup of red tea for everyone.\u003c/p\u003e\n\u003cp\u003e“Sit!” Gilbert chuckled. “I am also rather interested in your experiences this time round!”\u003c/p\u003e\n\u003cp\u003eLeylin’s heart stirred. He knew that whatever was to come could not be avoided, but he showed no dissatisfaction about it.\u003c/p\u003e\n\u003cp\u003eBy the sole fact that Gilbert saved him, it was only right to share a large portion of the reward.\u003c/p\u003e\n\u003cp\u003e“Tiny energy waves are detected! Identified as Bloodline artifacts’ detection technology! Space artifacts are unable to cut them off!”\u003c/p\u003e\n\u003cp\u003eBy this time, the prompting sounds of the A.I. chip had reached Leylin’s mind. In his vision, he distinctly saw a scanning wave sweep past the 4 of them, not even sparing Noah.\u003c/p\u003e\n\u003cp\u003eThe wave was so obscure that even Robin could not feel it scanning his body, it even went on to scan Leylin’s spatial pouch and ring. Despite that, Leylin’s face remained unchanged.\u003c/p\u003e\n\u003cp\u003eThe few people remained silent for a while before Robin took the lead and spoke up, “Mentor, It’s like this…”\u003c/p\u003e\n\u003cp\u003e“.......” After listening to his narration, Gilbert looked at the imprint of the spell on Robin’s forehead and took a deep sigh, “I didn\u0027t expect that you would ultimately choose this path!”\u003c/p\u003e\n\u003cp\u003e“This is my choice!” Robin bowed and replied, “If not for this, I’m afraid I wouldn’t even get the chance to look at the realm of the Morning Star!” He spoke resolutely.\u003c/p\u003e\n\u003cp\u003e“As your mentor, I can only guide and advise you in your pursuit of the truth and the power of the bloodline. As for your final choice, I will not interfere any further.”\u003c/p\u003e\n\u003cp\u003eGilbert shook his head and said, “Since you are insistent on doing this, then so be it!”\u003c/p\u003e\n\u003cp\u003e“Mentor……” On the other side, Kesha was acting like a little girl, on the verge of crying. She spoke about her encounter extremely miserably.\u003c/p\u003e\n\u003cp\u003e“Arcus and the other two are all dead…… That\u0027s half the strength of my clan…… Mentor…….”\u003c/p\u003e\n\u003cp\u003eTowards the end, Kesha’s eyes flushed red and she started crying. Tears flowed out like a waterfall. She spoke nothing about her earnings from the extortion of the Green-skinned Barbarian, which was done in collaboration with Leylin.\u003c/p\u003e\n\u003cp\u003e“Alright! Alright!” Gilbert said helplessly. “After this, I will give orders for your clan to be taken care of!”\u003c/p\u003e\n\u003cp\u003e“Thank you Mentor!” Kesha’s face brightened up instantaneously, with such speed that it created a pang of admiration in Leylin.\u003c/p\u003e\n\u003cp\u003e“Leylin, how about you?” Gilbert finally directed his attention to Leylin, with a slight smile of interest in his eyes.\u003c/p\u003e\n\u003cp\u003e‘What the hell. Amongst you, one is his former student, while the other is a woman. I, the newcomer, am at the greatest disadvantage!’ In his mind, Leylin rolled his eyes but he kept a calm expression on his face. He patted the space pouch respectfully and a few items appeared on the desk.\u003c/p\u003e\n\u003cp\u003e“A bloodline crystal!” Kesha covered her mouth and let out a gasp as she saw the blood-red stone.\u003c/p\u003e\n\u003cp\u003eHowever, Robin’s focus was on the long-root fruit and a few pieces of large, milky white bones.\u003c/p\u003e\n\u003cp\u003eAs for Gilbert, he looked engrossingly at a large egg which sat in the middle of the desk. As he looked at the blood-red runes on it, he appeared to be deep in thought.\u003c/p\u003e\n\u003cp\u003e“Leylin, you’ve struck it big this time in the pocket dimensions!” Kesha leaned forward, almost squeezing her whole body into Leylin’s embrace. “This sister’s clan is already so pitiful, shouldn’t you help me out?”\u003c/p\u003e\n\u003cp\u003e“Haha…” Gilbert, however, made a carefree laugh.\u003c/p\u003e\n\u003cp\u003e“This is the egg of a Blood Vulture! Blood Vultures in the ancient times were originally well-known for searching for bloodline artifacts. Leylin, I suppose you got lucky and found a nest of Blood Vultures?”\u003c/p\u003e\n\u003cp\u003e“Yes!” Leylin scratched his head, looking a little embarrassed. “After I found the nest, I hid there for a few days before I finally seized the chance and snuck these things out……”\u003c/p\u003e\n\u003cp\u003eUpon hearing that, a hint of jealousy appeared on everyone’s face, even Robin’s. Why didn’t such good luck descend on him?\u003c/p\u003e\n\u003cp\u003e“These items, I’m willing to offer them all to Mentor!” What Leylin said thereafter turned Robin and Kesha’s minds blank.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not even possible not to offer...\" Leylin gave a sincere look, but he was utterly bitter inside.\u003c/p\u003e\n\u003cp\u003eAfter discovering that Leylin possessed these items and did not hand them over, Gilbert would not feel good about it. If that was the case, Leylin’s future life in the Ouroboros Clan would be difficult.\u003c/p\u003e\n\u003cp\u003e“Haha… Good!”\u003c/p\u003e\n\u003cp\u003eGilbert laughed out loud…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-435\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-437\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-436","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
