{"id":58993,"no":437,"title":"Chapter 437","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eCompleting The Project\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eUpon hearing Leylin’s words, Gilbert stared blankly at him for a while, and then started laughing heartily. “I will accept your gift then!”\u003c/p\u003e\n\u003cp\u003e“Thank you, mentor!” Gratitude was apparent on Leylin’s face as he bowed.\u003c/p\u003e\n\u003cp\u003e“Sure! Of course, I wouldn’t simply just want to have your things for no reason; after all, Blood Vulture eggs from the ancient times are still very precious!” Gilbert lowered his head in thought.\u003c/p\u003e\n\u003cp\u003e“How about this? Aren’t you currently accumulating contribution points to buy the scroll that can inject life into constructs? I’ll make an exchange with you directly then; a sealed fourth-grade magic scroll would be sufficient to make up for these items!”\u003c/p\u003e\n\u003cp\u003eGilbert swept his hand across the table top. The numerous bloodline treasures vanished, and a grey scroll covered in simple floral designs appeared.\u003c/p\u003e\n\u003cp\u003e“Thank you, Mentor!” Leylin received the scroll and expressed his thanks again, this time with more sincerity.\u003c/p\u003e\n\u003cp\u003e“Besides…” Gilbert glanced at Leylin’s ring and smiled.\u003c/p\u003e\n\u003cp\u003eLeylin scratched his head and displayed his embarrassment, knowing that Gilbert had discovered the items he had hidden in his spatial ring.\u003c/p\u003e\n\u003cp\u003e…...\u003c/p\u003e\n\u003cp\u003eAfter nightfall, Leylin lay on his bed and examined the scroll in his hands, satisfaction written on his face. “Exchanging those items for a fourth-grade scroll is indeed a fair trade, I didn’t suffer!”\u003c/p\u003e\n\u003cp\u003eHe then looked at the ring on his hand and collapsed onto the bed, looking as though he would fall into deep sleep soon enough.\u003c/p\u003e\n\u003cp\u003eBu in actual fact, he was sneering secretly. What Gilbert had discovered was actually what Leylin purposely wanted him to.\u003c/p\u003e\n\u003cp\u003eInside the ring, there was only a single Bloodline crystal and a few remains from ancient times. Gilbert did not value them exactly because there were only a few items, thus he silently agreed to Leylin’s secret stash.\u003c/p\u003e\n\u003cp\u003eIn actual fact, what Leylin had handed over today was not even ten percent of his real loot, much less the fingerbone left behind by the fifth-grade Lamia from ancient times.\u003c/p\u003e\n\u003cp\u003eThe temptation of such an item was too huge, and even Leylin was not willing to take it out. If not, it would be hard to pass Gilbert’s checkpoint.\u003c/p\u003e\n\u003cp\u003eNo matter what happened then, it would not be a situation that he would want to see. After all, Gilbert was rather nice to him, and he didn’t want to fall out with his mentor and the Ouroboros Clan.\u003c/p\u003e\n\u003cp\u003eBenefits are the greatest reason why people are divided, and Leylin did not want to use the fingerbone to put the bond between master and disciple to the test. Might as well avoid it for the better good.\u003c/p\u003e\n\u003cp\u003eYes, the real loot, including the Lamia’s fingerbone, were not on Leylin himself! Therefore, no matter how strict Gilbert was with his inspection, there was no use at all!\u003c/p\u003e\n\u003cp\u003e“However, although this journey was dangerous, I finally attained the items I wanted, and the other loot is not bad…” Leylin thought as he lay in bed, quickly falling into deep sleep for real.\u003c/p\u003e\n\u003cp\u003eThe Black Scale travelled at high speeds. Initially, Leylin and company took more than a month to travel from the Ouroboros Clan to Nefas City, but the return journey only required about ten days or so.\u003c/p\u003e\n\u003cp\u003eAfter returning to headquarters, Leylin, his mentor and a few seniors gathered together and returned to Onyx Castle to check on the Magus Tower in his territory.\u003c/p\u003e\n\u003cp\u003e“Welcome, Lord Leylin!” Parker stood in front of the black Magus Tower and saluted respectfully to Leylin. His voice still sounded old as usual, and was strangely mismatched with his youthful face.\u003c/p\u003e\n\u003cp\u003e“How is the construction of my Magus Tower going?” Leylin stepped forth and gently caressed the black tower, admiring the exquisite runes on it and the faint but powerful energy waves it emitted. A smile spread across his face.\u003c/p\u003e\n\u003cp\u003e“The entire structure of the Magus Tower has been completed, we’re just left with a few cores and most importantly, the activation of the spirit of the Tower! These are awaiting your completion, Master!”\u003c/p\u003e\n\u003cp\u003eParker’s response made Leylin satisfactory. He was serious when working too; the previous task that Leylin had given him was performed well. He had successfully delivered a letter to Duke Gilbert and helped Leylin avert his misfortune.\u003c/p\u003e\n\u003cp\u003e“Excellent! Leylin nodded, “Bring Snoopy to my lab someday. I haven’t taught him anything new in a long while too!”\u003c/p\u003e\n\u003cp\u003eHe, of course, knew that age was catching up to Parker and he had no ambition, so he placed all his hopes on his grandson Snoopy, whose importance surpassed any reward.\u003c/p\u003e\n\u003cp\u003eOf course, after hearing what Leylin said, Parker was slightly excited and his bow almost reached a right angle, “Thank you on his behalf, Master!”\u003c/p\u003e\n\u003cp\u003e“On my way back from this trip, I obtained the Scroll of Life. Under my orders, prepare to begin work. I would like my Magus Tower to be completed immediately!” Leylin gave his orders indifferently.\u003c/p\u003e\n\u003cp\u003e“Your wish will be executed!” Parker replied. All the preparations for construction were already complete, and the other core materials had already been prepared too. All was left was to wait for Leylin to return and take the lead.\u003c/p\u003e\n\u003cp\u003eWandering in his own Magus Tower, Leylin examined every corner carefully.\u003c/p\u003e\n\u003cp\u003eThe interior of the Magus Tower was very spacious. Leylin created all of it according to the highest standards, with a complete set of facilities that looked refined and luxurious.\u003c/p\u003e\n\u003cp\u003eLeylin looked at level after level, especially the positive and negative energy reactive pools, along with other places such as the laboratory, the binding room, and the ecological garden.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip! What are the results of the scan?” While looking around his tower, Leylin did not forget to let the A.I. Chip fully scan and record the decorations and spell formations that he saw before conducting an inspection.\u003c/p\u003e\n\u003cp\u003e[67.8% of the main structure of the Magus Tower has been scanned. Defence spell formation operation intact, areas that can still be further optimized: 2!] The A.I. Chip sent feedback faithfully.\u003c/p\u003e\n\u003cp\u003eAs the blueprint of the structure was originally done by Leylin himself, using the A.I. Chip’s perfect deductions, the decorations of the entire Magus Tower were perfect, almost to the point that no fault could be found.\u003c/p\u003e\n\u003cp\u003eThe remaining areas that could be further optimized were only small problems that resulted from improper construction and other reasons. No matter how perfect his plan was, as long as it was executed by humans, accidents were bound to happen. Leylin had long prepared for this.\u003c/p\u003e\n\u003cp\u003e‘The rest is alright, but the previous ecological garden can be altered a little by adding in the data I collected about the environment in the ancient times while at Quicksand Castle!’ Leylin stroked his chin.\u003c/p\u003e\n\u003cp\u003eSince the Magus Tower was yet to be completed, he could still take the chance to amend it now. If he waited until the defensive spell formations were activated, especially after the tower genie had been awakened, then he wouldn’t be able to amend anything even if he wanted to.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip! Design an improved version of the blueprint according to what I said earlier!”\u003c/p\u003e\n\u003cp\u003eLeylin had always liked to put the A.I. Chip in charge of the nitty-gritty things, while he himself was responsible for directing the big picture.\u003c/p\u003e\n\u003cp\u003e[Task established, adjusting original blueprint! Adding in simulated environment parameters from ancient times, beginning formation of the blueprint…]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip operated swiftly and projected a new blueprint in front of Leylin within a few minutes.\u003c/p\u003e\n\u003cp\u003eLeylin scanned the blueprint many times, satisfied with the blueprint made by the A.I. Chip. “Yes! To maximize the use of the original resources and set-up, I just have to add a few items and spell formations! This will do!”\u003c/p\u003e\n\u003cp\u003eHe now had numerous subordinates and a huge number of Stone tribe slaves. Once he handed down the task of amending the place, it would only take a small number of people working in shifts day and night for ten days to complete it.\u003c/p\u003e\n\u003cp\u003eLeylin stood at the side of the negative energy reactive pool on the lowest level, and examined the complicated spell designs. At the radiance of the pure gold, silver and other precious materials, his face showed no signs of sadness or joy, maintaining tranquility.\u003c/p\u003e\n\u003cp\u003e[Simulation of the spell formations of the entire Magus Tower complete, 341 dummy runs, number of malfunctions: 0!]\u003c/p\u003e\n\u003cp\u003eThe blue glow of the A.I. Chip flashed in the depths of Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003e“Begin!” Leylin exhaled gently, and placed a piece of compressed energy crystal that was emitting immense light rays and heat, much like a miniature sun, into a groove at the heart of the spell formation.\u003c/p\u003e\n\u003cp\u003e*Brr!* The entire spell formation started to shake, and ring after ring of runes appeared out of thin air. Traces of light circulated on the spell formation.\u003c/p\u003e\n\u003cp\u003e“Start!” Leylin’s spiritual force extended and connected with the spell formation.\u003c/p\u003e\n\u003cp\u003eIn the instant when the spiritual force came into contact with the spell formation, Leylin felt as though he had opened a valve, causing a multitude of energy particles to be frantically absorbed by the spell formation, before passing through a complex conversion channel and flowing into the negative energy reactive pool.\u003c/p\u003e\n\u003cp\u003eMeanwhile, outside the Magus Tower, Parker, Kubler, Snoopy and Leylin’s other subordinates had all gathered to watch this scene, their eyes all brightly lit.\u003c/p\u003e\n\u003cp\u003eA huge elemental wave seemed to form a vortex that was absorbed by the black Magus Tower.\u003c/p\u003e\n\u003cp\u003eOne by one, the magical runes on the body of the Tower lit up, bringing about frightening and yet stable waves, firmly connecting to one another.\u003c/p\u003e\n\u003cp\u003eOnly Leylin was in the Magus Tower at that moment. He ran to the top of the Magus Tower at the speed of lightning and saw that the external appearance was almost the same, but the spell formation and storage pool gave off an entirely different vibe.\u003c/p\u003e\n\u003cp\u003e“Next, the positive energy reactive pool!” Leylin pushed the same high energy crystal into the groove, and the same activation spell appeared from Leylin’s hands, merging into the four walls.\u003c/p\u003e\n\u003cp\u003e*Boom!* At the top of the Magus Tower, a huge elemental wave practically condensed into a physical substance, energy particles of various colours emitting brilliant lights and vibrant colours.They quickly subsided into two rainbows, one bright and one dark.\u003c/p\u003e\n\u003cp\u003eSoon after, the bright rainbow was absorbed by the peak of the Tower, while the rainbow with a hint of gold submerged into the ground.\u003c/p\u003e\n\u003cp\u003eThe positive energy reactive pool buzzed continuously, the elemental liquids within accumulating further and further until it finally reached the middle mark.\u003c/p\u003e\n\u003cp\u003eTwo spheres of light that resembled stars emitted from the peak and underground of the Tower, spreading continually across the structure. Numerous runes lit up one by one, and finally converged at its centre.\u003c/p\u003e\n\u003cp\u003e[Magus Tower spell formation fully activated! Currently operating well!] the A.I. Chip pointed out.\u003c/p\u003e\n\u003cp\u003eAt that point, Leylin was standing on the point of intersection of the positive and negative energy reactive pools. An unadorned scroll covered in bizarre floral designs appeared in his hands.\u003c/p\u003e\n\u003cp\u003e“Fourth-grade magic— the Scroll of Life!”\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, prepare to inject knowledge into the being!”\u003c/p\u003e\n\u003cp\u003eLeylin ripped open the grey scroll, and rays of light burst out. Suddenly, a terrifying attractive force was transmitted from the scroll. The Vapour Phase spiritual force of his consciousness was consumed in huge quantities, and the process only came to a gradual stop when it was close to being exhausted.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-436\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-438\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-437","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
