{"id":59002,"no":446,"title":"Chapter 446","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAzure Mountain Auction\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Sister Kesha, you’ve grown prettier again!”\u003c/p\u003e\n\u003cp\u003eWithin Phosphorescence Swamp, the headquarters of the Ouroboros Clan was bustling as usual, with many bloodline Warlocks shuttling to and fro.\u003c/p\u003e\n\u003cp\u003eBelow the Giant Kemoyin Snake statue, Leylin had recognised Kesha instantly.\u003c/p\u003e\n\u003cp\u003eHe walked up to her with a big smile and hugged her tightly as both his hands groped Kesha’s body impolitely.\u003c/p\u003e\n\u003cp\u003e“Alright! Alright! We’re still on the way, let’s talk when we get back!” Kesha’s breathing became heavy but she had a depressed look on her face.\u003c/p\u003e\n\u003cp\u003e“You got me there!”\u003c/p\u003e\n\u003cp\u003e“Haha……” Seeing the sister who made him concede defeat repeatedly become like that, Leylin could not help but laugh out loud. His face carried an unconcealable smugness.\u003c/p\u003e\n\u003cp\u003eAfter going through the restoration of Quicksand’s bloodline experiment, Leylin’s knowledge in this area had advanced greatly, reaching the peak of the central continent.\u003c/p\u003e\n\u003cp\u003eUnder his control and with the help of the A.I. Chip, the spell to protect his own bloodline had already been developed a long time ago.\u003c/p\u003e\n\u003cp\u003eAfter numerous “real-life combat tests” with Kesha, this female Magus had no choice but to admit that even if the female Warlocks from the Ouroboros Clan were to come forth all at once, exposing all of their secret techniques, they would not obtain Leylin’s seed.\u003c/p\u003e\n\u003cp\u003eLeylin, who had now let go of this matter, enjoyed himself without any apprehension. However, Kesha and the others were growing a little intolerant of him.\u003c/p\u003e\n\u003cp\u003e......\u003c/p\u003e\n\u003cp\u003eThe pink cotton quilt was covered in traces of their lovemaking, as a strong fragrance wrapped the entire room.\u003c/p\u003e\n\u003cp\u003eLeylin flexed his upper body, exposing his firm but sleek muscles. He was half reclined on the couch, listening attentively to Kesha’s accounts.\u003c/p\u003e\n\u003cp\u003eKesha looked more miserable, with her body full of scars from the havoc, but she had a look of satisfaction. The cotton clothes could not conceal her delicate body at all, it even exposed more than what others could bargain for.\u003c/p\u003e\n\u003cp\u003eDespite her miserable look, this was actually nothing but child’s play for female Magi. It could only be considered as a more intense game as they would be able to recover within minutes.\u003c/p\u003e\n\u003cp\u003eFor instance, the current Kesha’s breathing did not have the slightest heaviness from before; it even seemed calm.\u003c/p\u003e\n\u003cp\u003e“Leylin, the speed at which you’re improving, you’re one of the best talents in the Ouroboros Clan. Only Robin can surpass you!”\u003c/p\u003e\n\u003cp\u003eWith serious matters being brought up, Leylin no longer had the cavalier attitude from before and was now listening optimistically.\u003c/p\u003e\n\u003cp\u003e“Brother Robin’s success is due to him being well prepared, how can I compare to him?” Opposed to Kesha’s flattery, Leylin shook his head with a faint smile instead.\u003c/p\u003e\n\u003cp\u003eHe had advanced to the Hydro Phase very quickly, and it was supposed to create a big fuss in the Ouroboros Clan. After all, only an extreme talent could perform so well.\u003c/p\u003e\n\u003cp\u003eBut Robin had stolen his thunder. Just around when Leylin had advanced to the Hydro Phase, news had spread that Robin had actually become a Crystal Phase Magus.\u003c/p\u003e\n\u003cp\u003eHydro Phase Magi were not very rare in the central continent, but it was a different scenario with Crystal Phase Magi. Be it their individual strengths or the difficulty of the breakthrough, the two levels were not on the same platform.\u003c/p\u003e\n\u003cp\u003eNaturally, Leylin’s limelight was stolen by Robin.\u003c/p\u003e\n\u003cp\u003eDeep in his heart, Leylin was a little glad that Robin attracted a lot of attention to himself. He had always enjoyed reaping his rewards in the dark and did not want to show off like that.\u003c/p\u003e\n\u003cp\u003eAt the same time, he remembered the trace of the black mark on Robin’s forehead.\u003c/p\u003e\n\u003cp\u003eIt seems that the other party’s breakthrough was deeply connected to his encounter in the Quicksand pocket dimension.\u003c/p\u003e\n\u003cp\u003eDuke Gilbert seemed to know some of this information but of course, he would not tell Leylin about it. Leylin could only guess.\u003c/p\u003e\n\u003cp\u003e“Both of you are perverts!” Kesha’s expression was a little gloomy and she seemed to be full of indignance. Leylin and Robin had obviously benefitted a lot from the previous expedition, and only she ended up empty-handed. She even lost many of the powerful members of her clan.\u003c/p\u003e\n\u003cp\u003eWhat was worse was that when they were hunted down as fugitives, the responsibility was on all three of them.\u003c/p\u003e\n\u003cp\u003eChivalrously, Leylin wrapped his arm around Kesha’s slim waist and began to comfort her in a soft voice, “Alright alright! It’s already been over a hundred years, those people must have already lost their patience…”\u003c/p\u003e\n\u003cp\u003eAfter a while of tenderness, Leylin finally asked the question regarding his main purpose of this journey. “By the way, you’d mentioned an astral stone previously. What’s that about?”\u003c/p\u003e\n\u003cp\u003eHe had always drawn a clear line between work and pleasure.\u003c/p\u003e\n\u003cp\u003eOf course, Kesha knew that her relationship with this talented brother was just an insignificant link, and only the entanglement of benefits would allow her to bind him into her clan’s war chariot, making him at least a part of their camp. Hence she quickly gave an account of the whole story.\u003c/p\u003e\n\u003cp\u003e“Auction?” Leylin’s eyebrows knitted when he heard the news.\u003c/p\u003e\n\u003cp\u003e“Yes!” Kesha did not brush away Leylin’s unconsciously playful hands, she only glared. “An auction hosted by a Morning Star Magus in Azure Mountain City!” As if she knew that Leylin had not understood her, Kesha began explaining to Leylin again in detail.\u003c/p\u003e\n\u003cp\u003eIt turned out that after Magi entered the Morning Star realm, ordinary materials and resources were already far from sufficient to satisfy them. What Morning Star Magi needed had always been items that were highly cherished in ancient times, and even those that had long since been lost. These treasures were evidently not purchasable by magic crystals. Thus, organising some exchanges in private and barter trade became mainstream.\u003c/p\u003e\n\u003cp\u003eThe founder of Azure Mountain City, the Azure Mountain King, was a neutral Morning Star Magus. His clan controlled of almost half of the auctions that took place in the region.\u003c/p\u003e\n\u003cp\u003eEvery ten or so years, a grand auction would be held in the headquarters of Azure Mountain City. When that time came, many rare treasures would appear, attracting numerous Magi who intended to pursue them.\u003c/p\u003e\n\u003cp\u003eAnd behind the auction, the distinguished Azure Mountain King would also organise a small-scaled private exchange meeting.\u003c/p\u003e\n\u003cp\u003eThis secret meeting had a very high bar for attendance. Ordinary rank 3 Magi could not enter, and even Morning Star Magi of all sides snuck in to see if they could get things they needed.\u003c/p\u003e\n\u003cp\u003e“The next Azure Mountain auction is commencing soon, I have received information that there is someone there who wishes to sell an astral stone the size of a fist…” Kesha explained the matter thoroughly.\u003c/p\u003e\n\u003cp\u003e“Also, Leylin, even if you come back from the auction empty-handed, you can still try your luck at the exchange meeting later on. With so many highly ranked Magi there, surely there will be those who have astral stones on hand. Of course, the prerequisite will be for you to have an item that is attractive enough for the other party……”\u003c/p\u003e\n\u003cp\u003e“What time does the exchange meeting start? How do I obtain the authority to enter? What restrictions are there?” Evidently, Leylin’s interest in the exchange meeting was piqued.\u003c/p\u003e\n\u003cp\u003eAnd he had indeed accumulated a large quantity of items, which he had intended to sell in exchange for magic crystals or other raw materials.\u003c/p\u003e\n\u003cp\u003e“The exchange meeting will commence after the auction ends. As long as you are located within the borders of Azure Mountain City, highly ranked Magi who have fulfilled the requirements will be invited. Besides, rest assured that the entire exchange meeting will be conducted in anonymity. The distinguished Azure Mountain King is willing to vouch that there will be no trouble in the future!”\u003c/p\u003e\n\u003cp\u003eA neutral Morning Star Magus’ word had a definite reputation in the entire central continent, putting Leylin at ease.\u003c/p\u003e\n\u003cp\u003eIt seemed that the issue of materials that was perplexing him had a very high chance of being resolved in Azure Mountain City.\u003c/p\u003e\n\u003cp\u003eMoreover, after being low-profile and living in seclusion for such a long time, it was about time he went out to roam around.\u003c/p\u003e\n\u003cp\u003eLeylin, who was in high spirits, pulled Kesha into a new round of war once again.\u003c/p\u003e\n\u003cp\u003e“Marquis Leylin…”\u003c/p\u003e\n\u003cp\u003e“Good afternoon, Marquis Leylin!”\u003c/p\u003e\n\u003cp\u003eOn the way to the headquarters, a smile hung on the corner of Leylin’s lips as he greeted the surrounding royal warlocks who passed by from time to time. Occasionally, he nodded in response, which got the low-ranked warlocks overwhelmed.\u003c/p\u003e\n\u003cp\u003eAs of now, he was considered slightly famous in the Ouroboros Clan. On the contrary, being Gilbert’s disciple and having the talent to break through to becoming a Hydro Phase Magus was secondary. The primary reason he became famous was still the technique of protecting his seed.\u003c/p\u003e\n\u003cp\u003eEver since the test with Kesha and warlock Miranda, the crazy women in the Ouroboros Clan rarely bothered Leylin anymore.\u003c/p\u003e\n\u003cp\u003eIf they solely wanted pleasure, there were many boy-toys in their clans. There were all sorts of males—rough ones, weak ones, and also uniquely delicate boys. They did not have to bother Leylin.\u003c/p\u003e\n\u003cp\u003eFurthermore, there were also many male warlocks who came to Leylin with attractive conditions, in hope of acquiring the results of his research.\u003c/p\u003e\n\u003cp\u003eUndoubtedly, these were all rejected by Leylin.\u003c/p\u003e\n\u003cp\u003eThe mere consequence of offending the warlocks in the Ouroboros Clan made Leylin somewhat eager to avoid it, not to mention the possibility of his bloodline research results being spied on through those techniques.\u003c/p\u003e\n\u003cp\u003eHe could use it for himself but once he spread it, he would be provoking all the women in the Ouroboros Clan. Leylin was not such a fool.\u003c/p\u003e\n\u003cp\u003eFrom afar, Leylin spotted someone familiar and he immediately went up to greet her, “Good day, Miss Miranda!”\u003c/p\u003e\n\u003cp\u003e“It’s Sir Leylin! Haha… Today’s weather is great… Oh! I just remembered that I still have an experiment to conduct, please excuse me!”\u003c/p\u003e\n\u003cp\u003eMiranda laughed casually and left quickly with an excuse.\u003c/p\u003e\n\u003cp\u003eWatching her enticing back, Leylin rubbed his fingers as if he remembered the alluring scent she had while in bed. He could not help but let out a smirk.\u003c/p\u003e\n\u003cp\u003ePreviously, he had left her in an extremely miserable state. Now, it seems, Miranda had developed a slight fear of him.\u003c/p\u003e\n\u003cp\u003eLeylin came before Gilbert’s villa along his stroll.\u003c/p\u003e\n\u003cp\u003eHe was about to knock when the door suddenly swung opened and a figure walked out of the villa, almost bumping into Leylin.\u003c/p\u003e\n\u003cp\u003e“Brother Robin!”\u003c/p\u003e\n\u003cp\u003eLeylin scrutinized the current Robin carefully. The Crystal Phase energy waves on his body were very obvious. It seemed that he had completely stabilised at that level. In addition, the veins on Robin’s forehead seemed thicker and more distinct, and the black mark flashed with a strange luster.\u003c/p\u003e\n\u003cp\u003e“Leylin!” Robin smiled. His facial muscles seemed rather stiff, as if he had not smiled for a long time.\u003c/p\u003e\n\u003cp\u003e“I still have some matters, I’ll be leaving first! Mentor is inside!”\u003c/p\u003e\n\u003cp\u003eRobin exchanged a few words with Leylin and left in a hurry.\u003c/p\u003e\n\u003cp\u003eAs he watched Robin leave, Leylin’s entered a moment of deep thought.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-445\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-447\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-446","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
