{"id":59012,"no":456,"title":"Chapter 456","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eWing of the Sun\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eBehind the introductions were several other rows, each describing the items following the first.\u003c/p\u003e\n\u003cp\u003e“...... Now, please allow me to present the first item of this year’s auction: a treasure produced from the Fiery World, the Fiery Gemstone!” The host announced loudly, lifting the gauze from the tray behind him at the same time.\u003c/p\u003e\n\u003cp\u003e*Boom!* In a flash, 3 pieces of translucent crystal emerged before Leylin’s eyes. An unceasing flame seemed to be burning in the cores of the crystals.\u003c/p\u003e\n\u003cp\u003e“Treasures from another plane!”\u003c/p\u003e\n\u003cp\u003eNumerous Magi gasped. In order to start off the auction successfully, the Azure Mountain auction house had indeed put in much effort. Evidently, the first auction item was unexpected for many of them.\u003c/p\u003e\n\u003cp\u003e“The Fiery Gemstone is rumoured to be a treasure of the central Blazing World. Containing heavily compressed fire elemental particles, it can help break through and upgrade a fire-attributed Magus’ spiritual endowments, and is even an essential item the advancements of many high-grade fire elemental meditation techniques…” the host continued.\u003c/p\u003e\n\u003cp\u003eHowever, very few spared the attention to listen to him anymore. They had all averted their rapacious gazes to the Fiery Gemstone on stage.\u003c/p\u003e\n\u003cp\u003eEven Leylin was slightly tempted by this item, leave alone the other Magi.\u003c/p\u003e\n\u003cp\u003eResources from other planes, could only be obtained by Morning Star Magi due to the requirement for an astral gate. For rank 2 and rank 3 Magi like them, they were an inaccessible existence.\u003c/p\u003e\n\u003cp\u003eIt’s small-degree spiritual endowment enhancing effects especially drove many of them crazy.\u003c/p\u003e\n\u003cp\u003e“Alright. Now we will begin the auction for the compressed blazing gemstones, with the starting bid at 5 million magic crystals!” The host reported a figure, which was soon drowned amongst a cacophony of bids.\u003c/p\u003e\n\u003cp\u003eHuge figures appeared on the screen, which was refreshed again and again with the highest quoted price.\u003c/p\u003e\n\u003cp\u003eLeylin speechlessly watched the numbers spike on the corner of the screen, exceeding ten million in a flash and going all the way up to around 50 million before slowing down. He could not help but smile bitterly.\u003c/p\u003e\n\u003cp\u003e“I originally thought that the more than 90 million magic crystals from the Azure Mountain auction house was already a large fund. Now it seems it will be really difficult to win the bid for the astral stone…”\u003c/p\u003e\n\u003cp\u003eLeylin extinguished all thoughts of pressing the bid button. Although he had many items that he could use as payment and winning the bid for the compressed blazing gemstone was not hard, it was too ostentatious. Furthermore, his funds were limited, they had to be saved for later and were not to be wasted on this.\u003c/p\u003e\n\u003cp\u003eBecause he had already decided to give up, Leylin was able to relax and engrossedly watch the group of high-ranked Magi fight furiously over these treasures.\u003c/p\u003e\n\u003cp\u003eThe value of otherworldly treasures still exceeded Leylin’s expectations. Not only were the VIPs in the VIP lounge going all out, even Magi seated at the regular auditorium began quoting prices to fight for the items as well.\u003c/p\u003e\n\u003cp\u003e“Possessing the financial ability to compete for the Fiery Gemstone yet withdrawn within the regular auditorium crammed with all those low-ranked Magi, he is also a rascal pretending to be weak!” Leylin looked at a red-haired youth and assessed monotonously.\u003c/p\u003e\n\u003cp\u003e“Bidding closed, the three people who quoted the highest price will obtain the rights of attribution to the Fiery Gemstone!” The host, who stood on the central elevated platform with a slightly flushed face, spoke with an obvious excitement.\u003c/p\u003e\n\u003cp\u003eNow, on the screen, the large figures stopped in a moment. The highest bid had reached a shocking 85 million magic crystals! The second and third highest bid merely differed from the first by not more than 1 million magic crystals.\u003c/p\u003e\n\u003cp\u003e“This is crazy!” Leylin shook his head.\u003c/p\u003e\n\u003cp\u003eClearly, the quoted price this time had been overshot by a lot, even exceeding the original expectations of the auction house. The host calmed down and began introducing the next auction item, “Magic equipment - Aphopis’ Scepter! Starting bid: 38 million magic crystals or resources of equivalent worth…”\u003c/p\u003e\n\u003cp\u003eAn entirely golden, magnificently crafted scepter instantly appeared within Leylin’s sight. At the head of the scepter, many gold tassels and decorations formed the shape of a sun’s corona, emitting light and heat continuously.\u003c/p\u003e\n\u003cp\u003e“40 million magic crystals!”\u003c/p\u003e\n\u003cp\u003e“50 million magic crystals, and 3 moonstones on top of that!”\u003c/p\u003e\n\u003cp\u003eEvidently, this piece of magic equipment was already renowned among this group of Magi. Even before the host finished speaking, the Magi below had already begun quoting prices.\u003c/p\u003e\n\u003cp\u003eLeylin rested his chin on his hands and as he watched, he suddenly felt that he was actually considered poor.\u003c/p\u003e\n\u003cp\u003eCompared to these central continent Magi who took possession of rich resources and had long-spanning inheritances, even if he plundered the entire Twilight Zone, he would still only be considered slightly rich.\u003c/p\u003e\n\u003cp\u003eIf not for those few incidents of huge profit, and if he was not a Potions Grandmaster, he definitely would not have dared to participate in the auction for the astral stone.\u003c/p\u003e\n\u003cp\u003eShortly after, the piece of magic equipment, Aphopis’ scepter, was bought by a Magus in the VIP lounge at a high price of 90 million magic crystals. Many Magi could not help but take note of the VIP lounge number.\u003c/p\u003e\n\u003cp\u003eThe Azure Mountain auction was no doubt the top power in this area. What followed next was a large quantity of rare Magus treasures, information on high-grade meditation techniques, and also a great amount of valuable resources appearing on the stage one after another, something which many Magi pursued.\u003c/p\u003e\n\u003cp\u003eThe high-grade potions that Leylin initially sold were in there too. Although there were only a part of it, they were still sold at sky-high prices. The desires of Magi for high-grade potions could never be satisfied.\u003c/p\u003e\n\u003cp\u003eThis made Leylin rather happy but at the same time, he secretly rolled his eyes.\u003c/p\u003e\n\u003cp\u003eHe originally thought that the Azure Mountain auction house undertook a definite loss when they purchased his potions, but now it seems this transaction greatly profited the other party instead.\u003c/p\u003e\n\u003cp\u003e“Ladies and gentlemen, today’s auction is approaching an end, our Azure Mountain auction house has specially decided that the biggest treasures of this time’s auction will be up for auction at the last moment!” The host’s words piqued Leylin’s interest uncontrollably as he fixed his gleaming eyes on the stage.\u003c/p\u003e\n\u003cp\u003e“This time’s auction will continue on for 3 days, which means to say, there are 3 extremely valuable items to auction! There are few opportunities!” The host’s voice carried a hint of temptation.\u003c/p\u003e\n\u003cp\u003e“Next, please allow me to grandly introduce the first treasure: the ancient advanced meditation technique—Wing of the Sun!”\u003c/p\u003e\n\u003cp\u003eFollowing his words, the curtains on both ends of the stage were drawn, exposing the precious object behind it. It looked no different from the common large swords. Its model was full of antiquity and the middle section of its blade had obvious cracks on it, with the tip of the sword missing.\u003c/p\u003e\n\u003cp\u003eEven more so, what caused Leylin to slightly lose his spirit was the drop of golden blood on the blade of the broken sword, which looked as if it contained a life of its own. It took the form of a spiral and shone with radiance continuously.\u003c/p\u003e\n\u003cp\u003e“As you all know, once a Magus surpasses the Morning Star realm, reaching an even scarier and more unpredictable state, their lives will begin to sublime. Even the smallest cell of their blood will contain a deep secret about themselves, so much so that they may achieve blood reincarnation…”\u003c/p\u003e\n\u003cp\u003eThe host’s voice carried a slight excitement, “And this broken sword, had once been in contact with a little bit of the blood of the ancient Sun’s child! Through our appraiser’s verification, although the blood on the broken sword has completely lost its life energy, this sole drop of blood holds the information about the meditation technique of the Sun’s child from that time!”\u003c/p\u003e\n\u003cp\u003e“Sun’s child!!!”\u003c/p\u003e\n\u003cp\u003eAs soon as the host spoke, Leylin somewhat lost his cool.\u003c/p\u003e\n\u003cp\u003eIt wasn’t rare for the relic of such a powerful person from ancient times to contain some fragments of information. Even the Lamia fingerbone could forcibly catalyse the formation of a soul by the means of its own radiation. But to contain the complete information about the meditation technique was extremely rare.\u003c/p\u003e\n\u003cp\u003eBased on Leylin’s conjecture, the Sun’s child must have had a premonition about his death when he was facing his enemy and thus deliberately left a legacy behind.\u003c/p\u003e\n\u003cp\u003eOnly, what amazed Leylin was that he had never expected to see a relic of that Sun’s child, who was amongst the ranks of Quicksand, in this place.\u003c/p\u003e\n\u003cp\u003eSomewhere, he had a feeling that maybe, his fate with the ancient bloodline Warlocks—the Quicksand Organisation, was not so short-lived.\u003c/p\u003e\n\u003cp\u003e“We can guarantee that the meditation technique—Wing of the Sun—is absolutely complete! The ancient top meditation technique is still a great reference for us even if we are unable to practise it! Moreover, although the bloodline of the Sun’s child on the sword has completely lost its life energy, you never know, there may still be certain spells that can restore its vitality. If it’s like that, I’m afraid the Warlock structure of the entire central continent will be revised……”\u003c/p\u003e\n\u003cp\u003eThe host was trying his best to delude them, “For this auction item, the starting bid—200 million magic crystals, or other equivalent resources!”\u003c/p\u003e\n\u003cp\u003eAfter the host finished his sentence, the scene became calm and actually fell into a short, temporary awkward silence.\u003c/p\u003e\n\u003cp\u003eThe numerous Magi, all stared at the broken sword and its golden spiral which was on the elevated platform, with unknown thoughts.\u003c/p\u003e\n\u003cp\u003e“Huff…” Leylin gave a long sigh, “If Mentor Gilbert was here, he’d buy this at all costs…”\u003c/p\u003e\n\u003cp\u003eOf course, Leylin was sure of one thing—the auction would be conducted for three days and a valuable item would be revealed every day at the last moment; this advanced meditation technique was only the cheapest among the three precious treasures.\u003c/p\u003e\n\u003cp\u003eThe advanced meditation technique, Wing of the Sun, was similar to Kemoyin’s pupil—a technique specially customised for individual Warlocks. The criteria to practise it was to possess the bloodline of the ancient Sun’s child. According to Leylin’s intelligence and knowledge, ever since the ancient Sun’s child of Quicksand died, there had not been any news of the birth of similar bloodlines in the entire central continent.\u003c/p\u003e\n\u003cp\u003eHence, the Wing of the Sun meditation technique was at most useful for Magi as a reference, causing its worth to plummet.\u003c/p\u003e\n\u003cp\u003eAlso, the blood on the sword had lost its life energy and could not be used as a bloodline to be introduced into Magus bodies and passed down. Even though it looked very precious, its real worth was in fact not much.\u003c/p\u003e\n\u003cp\u003eOf course, the relatively low worth of this item was only when compared to the other two treasures. To Leylin, the price of this treasure was still too high to afford.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-455\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-457\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-456","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
