{"id":59020,"no":464,"title":"Chapter 464","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eCounting Spoils\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eOnly after finishing with the plunder of Number 5’s body did Leylin turn his gaze upon the black mask, his expression grave.\u003c/p\u003e\n\u003cp\u003e“The coercion of the A.I. Chip cannot last a long time. Once it fades, the controller of these bugs will get the news right away…”\u003c/p\u003e\n\u003cp\u003eThe powder he’d used on these stardust bugs would only work once; moreover, once the effect was gone, he was afraid that these bugs would still leak out all the information to the central control room.\u003c/p\u003e\n\u003cp\u003eLeylin could not allow this. Once he thought of the Morning Star Magus behind the scenes, he felt a chill.\u003c/p\u003e\n\u003cp\u003eFortunately, the other side still did not know his identity, so as long as the proof could be wiped out clearly, chances were that he could escape notice.\u003c/p\u003e\n\u003cp\u003eOnce he thought of that, a green flame fell on the mask, growing larger.\u003c/p\u003e\n\u003cp\u003eExplosions could be heard from the mask, so soft that one couldn’t hear them without the help of the A.I. Chip.\u003c/p\u003e\n\u003cp\u003eAfter confirming that the stardust bugs had all perished, Leylin burned the entire area to ashes, laughing grimly before leaving.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWith his timely retreat, Leylin did not get to see Leo’s crazed look as he arrived.\u003c/p\u003e\n\u003cp\u003eLeylin had been very careful to avoid places that could be monitored by Magi, even choosing to forgo travel by airship in favour of making his way on land. He hadn’t even hesitated to pass through some dangerous zones.\u003c/p\u003e\n\u003cp\u003eBy the time he’d arrived at a safe zone outside the region of influence of Azure Mountain City, he’d even gotten news about the great changes there.\u003c/p\u003e\n\u003cp\u003eWatching the news that Azure Mountain City had imposed a curfew and sealed off the airship network, even starting to hunt for him without restraint, Leylin could not help but feel glad at his early departure.\u003c/p\u003e\n\u003cp\u003eHe did not care about how crazy the Oakheart Family was, and didn’t even plan on spreading the news.\u003c/p\u003e\n\u003cp\u003eAlthough announcing the secret of the stardust bug would hurt the Oakheart Clan badly, there were few benefits for himself. On the other hand, this secret would make for a good bargaining chip in the future.\u003c/p\u003e\n\u003cp\u003eLeylin looked forward to the day he advanced to become a Morning Star Magus and the hush money the Azure Mountain King would provide.\u003c/p\u003e\n\u003cp\u003eOf course, having such dreams before advancing to the Morning Star realm would be nothing but courting death!\u003c/p\u003e\n\u003cp\u003eSince he didn’t choose to use an airship, Leylin’s return trip seemed to take a long time.\u003c/p\u003e\n\u003cp\u003eFor the sake of caution, he’d even taken a big detour and only then snuck back into his own territory.\u003c/p\u003e\n\u003cp\u003eOnly after entering his Magus Tower and being greeted by the mechanical voice of the tower genie did he relax completely.\u003c/p\u003e\n\u003cp\u003eA cup of hot coffee was placed on top of the table, emanating a rich and sweet aroma. Yet, Leylin only sat there without any facial expression, rapping his fingers on the table.\u003c/p\u003e\n\u003cp\u003eLeylin reflected on his actions after returning to his safe haven and listed out his weakness and gains in detail. He has always been doing that and it is because of this that he could survive without much mishaps in this sinister Magus world.\u003c/p\u003e\n\u003cp\u003eHe had gained a lot on this trip, enough to shock any Crystal Phase Magus. But, at the same time, he’d provoked a power that was very troublesome. Just a little bit of thoughtlessness could’ve ended up with him dead.\u003c/p\u003e\n\u003cp\u003eThe rage of a Morning Star Magus was awful. Once he was discovered, forget Leylin himself, not even his family and friends would meet a good end.\u003c/p\u003e\n\u003cp\u003e“I’ve cut off all the clues. To the auction house I was just ‘Blood Rogue,’ and at the anonymous barter, I’d disguised myself as well. I even destroyed the evidence afterwards. To think to look for me from all this is nearly impossible!”\u003c/p\u003e\n\u003cp\u003eLeylin was very confident in his own methods and the A.I. Chip’s coverup.\u003c/p\u003e\n\u003cp\u003e“As for prophetic spells, they’re very inaccurate on their own, and they work much worse against high ranked Magi. Adding on the cover from my Magus Tower…” This aspect was what worried Leylin the most.\u003c/p\u003e\n\u003cp\u003eThere may be no normal clues, but if any mysterious spells were added into the mix… the thought scared him.\u003c/p\u003e\n\u003cp\u003eEspecially prophetic spells. Those were extremely troublesome. Unless you were much higher in rank than the other party, as long as they paid a certain price, they could find out everything about you!\u003c/p\u003e\n\u003cp\u003e“Fortunately, there are very few prophetic Magi on the continent, and to correctly trace it back to me with my strength being at the Hydro Phase and the cover of my Magus Tower, it’ll be impossible for those normal ones. And to employ a Morning Star Magus that specialized in prophecy for the task would entail a huge price.”\u003c/p\u003e\n\u003cp\u003eWith the database of the A.I. Chip and his personal experience with the Coin of Destiny, Leylin understood the workings of prophecy Magic much better than any ordinary Magus at his level.\u003c/p\u003e\n\u003cp\u003e“And the Azure Mountain King is not a prophetic Magus, and to pay the huge price of a Morning Star realm prophet is impossible within a short period of time… I must take advantage of this opportunity and immediately advance to the Crystal Phase. If things drag out until then, it’ll be much better…”\u003c/p\u003e\n\u003cp\u003eIt took much more to predict the location of a Crystal Phase Magus to one at the Hydro Phase. What Leylin needed to do the most now was to improve his own strength so predictions would fail.\u003c/p\u003e\n\u003cp\u003eStrong radiation would be enough to interfere with such things!\u003c/p\u003e\n\u003cp\u003eOnce Leylin advanced to the Morning Star realm, all this would count as a minor matter. Nobody would offend one Morning Star Magus for the sake of another.\u003c/p\u003e\n\u003cp\u003eOnce Leylin advanced to the Morning Star realm, he could use this matter of the stardust bugs to extort the other party. At that time, the Azure Mountain King would only be able to swallow that bitter pill obediently.\u003c/p\u003e\n\u003cp\u003e‘And there’s no need to worry much about Vance and the Rolithe Family!’ Leylin remembered the patriarch of the Rolithe Family that died at his hands. Because of Jessia’s entanglement and having been detected by Leylin’s Coin of Destiny, he will always be at the losing end, how miserable is that.\u003c/p\u003e\n\u003cp\u003eHe didn’t even know who killed him. As for the Rolithe Family, for them to find out would be even harder.\u003c/p\u003e\n\u003cp\u003e“Diamond Jellyfish, astral stone!” Leylin touches his chin, muttering, “For such precious treasures to appear in such a small family at the same time is abnormal. Perhaps I should have Parker go watch them…” For the current Leylin, a family with only a Hydro Phase Magus was no matter.\u003c/p\u003e\n\u003cp\u003eEven were Vance not dead, with all the subordinates Leylin had amassed in over a century, he didn’t even need to move himself to crush them.\u003c/p\u003e\n\u003cp\u003eHowever, for the patriarch of a small family to suddenly advance by leaps and bounds, and at the same time to possess such precious treasures, made Leylin unable to help but suspect that he had found some great treasure or inheritance.\u003c/p\u003e\n\u003cp\u003eIn the central continent, there were plenty of Magi. As a result, there was an abundance of inheritance and historical remains. Almost every day in the Magi World, there would be lucky Magi who would ride on the coattails of their ancestors, and have high possibilities of promotion.\u003c/p\u003e\n\u003cp\u003e‘No, the Rolithe Family does not know right now that I’m the murderer. It would be too obvious to let Parker go.’ Leylin was not afraid of their vengeance, but he was worried that the Oakheart Family would also associate him with the killer, which would be terrible!\u003c/p\u003e\n\u003cp\u003eLeylin thought for a bit, and opened up a secret imprint, “Tanasha! Go to the Black River Domain, and secretly watch the Rolithe Family. Report to me their every move!”\u003c/p\u003e\n\u003cp\u003e“Understood, Master!” came her respectful voice in return.\u003c/p\u003e\n\u003cp\u003eAfter slowly separating from the inner circle of the Forgotten Land, this lady had wholeheartedly joined Leylin and become his most powerful subordinate.\u003c/p\u003e\n\u003cp\u003eFor a Crystal Phase Magus, even eliminating the entire Rolithe Family would be no problem, leave alone simply monitoring them.\u003c/p\u003e\n\u003cp\u003e“Now that the annoyances are out of the way, let’s take a look at the spoils!” After closing the secret imprint, Leylin spat out a breath and waved his hand, causing a few objects to appear on the table.\u003c/p\u003e\n\u003cp\u003eInside a purple box were two black stones, one big and one small, each flickering in a weak blue light.\u003c/p\u003e\n\u003cp\u003eThese were Leylin’s main purpose in making the trip—astral stones!\u003c/p\u003e\n\u003cp\u003eThe big one was from Leo and was the size of a quail egg, and the small one was what he’d plundered from Vance. It was only the size of a fingernail.\u003c/p\u003e\n\u003cp\u003eIn fact, the one he’d gotten from Vance was enough to conduct preliminary research on astral gates, but to Leylin there would never be enough. He wasn’t losing money anyway, and one could never have too much of these high-class resources.\u003c/p\u003e\n\u003cp\u003eEspecially after he reached the Morning Star realm. At that point, the number of astral stones he’d need to build an astral gate already made Leylin worry, so even though he had enough for now, the more the better.\u003c/p\u003e\n\u003cp\u003e“With all these things, this trip was worth it!” Leylin touched his chin, looking at the other things on the table.\u003c/p\u003e\n\u003cp\u003eThe most eye-catching of them all was a crystal statue, bright and pink, that seemed indestructible as if made of diamond.\u003c/p\u003e\n\u003cp\u003eThis was a Diamond Jellyfish, a valuable natural resource that had been lost to time. It could greatly increase the probability of a Hydro Phase Magus advancing to the Crystal Phase.\u003c/p\u003e\n\u003cp\u003eAlthough the rest couldn’t compare to the Diamond Jellyfish, they were still very precious treasures, altogether useful enough to increase the probability of a breakthrough further by one or two levels.\u003c/p\u003e\n\u003cp\u003eAdding the optimised spell formation, it seemed like Vance’s chances of promotion this time were quite big.\u003c/p\u003e\n\u003cp\u003eUnfortunately, all of this had now become Leylin’s fortune. The goods from Vance and Number 5 had swelled Leylin’s pockets once more.\u003c/p\u003e\n\u003cp\u003e“No wonder the atmosphere felt strange lately, I better just stay within my tower and breakthrough the Crystal Phase bottleneck...” Thinking of what he’d heard and seen on the trip, Leylin’s face became gloomy.\u003c/p\u003e\n\u003cp\u003eWhether it was the Ouroboros Clan, or Azure Mountain City, everyone seemed tense and depressed, as if war was on the horizon.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-463\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-465\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-464","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
