{"id":59024,"no":468,"title":"Chapter 468","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eBlackrain World\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIn a wasteland where little red grass with serrated edges filled the seams of rocks, which were decorated with strange images of humanoid faces, droplets of black rainwater generated within the cracks in the ground, quickly rose, and rained into the horizon.\u003c/p\u003e\n\u003cp\u003eThe rain here was actually black, and moved in the opposite direction.\u003c/p\u003e\n\u003cp\u003eA dim golden spiritual force seed lay atop a blade of red sawtooth grass, giving off spiritual force undulations and scanning the surroundings. Leylin admired the sight.\u003c/p\u003e\n\u003cp\u003e“In that case, I’ll name this place the “Blackrain World”. I never thought I’d be so lucky and find a plane without a protector, and I wasn’t even discovered…\u003c/p\u003e\n\u003cp\u003e“If Duke Gilbert found this place, he’d definitely go crazy in elation, right? However, it’s much too extravagant for me!”\u003c/p\u003e\n\u003cp\u003eA complete different plane represented boundless top-grade resources, as well as much information regarding different dimensions. It was more than sufficient to make a Morning Star Magus go insane in envy.\u003c/p\u003e\n\u003cp\u003eWhen it came to places like this which held traces of life and were possible to reside in, Leylin believed that Duke Gilbert would immediately hold no qualms and open the astral gate to arrive here, no matter the cost.\u003c/p\u003e\n\u003cp\u003eHowever, all this was much too early to Leylin. What he had opened up was merely a spiritual force channel that could not transport physical objects, much less his own body. That was a function of an astral gate, and still in the remote future for him.\u003c/p\u003e\n\u003cp\u003e“If not for this seed being formed from Crystal Phase spiritual force, it might long since have dissipated. However, at this rate, this merely slows down the process…”\u003c/p\u003e\n\u003cp\u003eThe rays from the golden spiritual force seed were very weak. In this environment, it seemed on the verge of being extinguished.\u003c/p\u003e\n\u003cp\u003e“I can only transmit information here, so what’s most valuable to me here would be the coordinates of this world, high-grade meditation techniques or information regarding the path to power and the like…” Leylin now urgently wished for a high-energy energy creature to take him away.\u003c/p\u003e\n\u003cp\u003eThis was merely a spiritual force seed, and if it dissipated, then so be it. However, if he could make a trade with another party, that would be a frightful profit.\u003c/p\u003e\n\u003cp\u003eEven if it was just the simple exchange of information, that would be the most beneficial for him.\u003c/p\u003e\n\u003cp\u003eAncient Magi had walked the path of glory through studying and imitating the paths of other worlds. If Leylin wished to restore the glory of the ancient era, he would definitely need to go along this road.\u003c/p\u003e\n\u003cp\u003e[Unable to determine world’s location.] Leylin frowned. With the connection to his spell formation, he could feel that his spiritual force seed had reached a very remote area, and this connection was only faintly discernable, and seemed to be on the verge of breaking down.\u003c/p\u003e\n\u003cp\u003e“One way of sending out the coordinates is to project a localising mark there. As long as it isn’t destroyed, it can send out waves of information infinitely, and then allow me to infer the coordinates. However, that’s impossible for now.” Leylin furrowed his brows.\u003c/p\u003e\n\u003cp\u003eHow many benefits could be obtained from a new world? It was enough to cause Morning Star Magi to go crazy. Even Breaking Dawn Magi would go green in envy and work to obtain it! Before all that, what was needed were the coordinates.\u003c/p\u003e\n\u003cp\u003eThis method of calculating the coordinates was very complicated. It could not be obtained so easily just by sending a spiritual force seed over. A series of meticulous, complicated calculations had to take place, as well as coordinating with the seed in that world.\u003c/p\u003e\n\u003cp\u003eHowever, the seed was now unable to hold on for long.\u003c/p\u003e\n\u003cp\u003eBeing able to reach the Blackrain World was completely coincidental, and a repeat was impossible.\u003c/p\u003e\n\u003cp\u003e“There’s another method. I can bewitch the intelligent inhabitants here and get them to set up some sort of altar, which in actuality would be a coordinate projecting device. I’ll then determine…” As long as the coordinates were confirmed, the Blackrain World would not be able to escape his grasp.\u003c/p\u003e\n\u003cp\u003eLeylin had never heard of the terrifying ability to teleport himself into different worlds, even in legends.\u003c/p\u003e\n\u003cp\u003eIn addition, without a protector, Leylin’s spiritual force seed was not destroyed at the outer layer of the world. This meant that the Blackrain World lacked Magi who were at or above the Radiant Moon realm. At most, their highest battle might would be at the Morning Star realm, and therefore they lacked any defence!\u003c/p\u003e\n\u003cp\u003e“What I lack now is time…” Leylin gave a wry smile. His spiritual force seed could not be replenished in the Blackrain World, and was on the verge of dissipating.\u003c/p\u003e\n\u003cp\u003eThe moment it dissipated, it would be a complete loss. How could he take it lying down?\u003c/p\u003e\n\u003cp\u003eA one in a ten thousand chance of finding a world was not so easily found. The Coin of Destiny had already been damaged to this point, and could no longer be used unless it was crucial.\u003c/p\u003e\n\u003cp\u003eAt this moment, Leylin’s brows twitched, “There’s something there!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eMeanwhile, in the Blackrain World, Leylin’s spiritual force seed lay in the plains, while two dark green humanoid beings approached.\u003c/p\u003e\n\u003cp\u003eThese two creatures could somehow be said to look human. They had human torsos and two legs, but their bodies were filled with scales, and their eyes held blood-red pupils.\u003c/p\u003e\n\u003cp\u003eThe arms were rather terrifying. On one side they had four, and on the other, three. There was even a horn sticking out from their heads.\u003c/p\u003e\n\u003cp\u003e“Since they have so many arms, let’s call them the “Multi-Armed Race!” Leylin did not hesitate as he named this race, looking as if he was the conqueror of the place.\u003c/p\u003e\n\u003cp\u003e“…”\u003c/p\u003e\n\u003cp\u003eThe two members of the Multi-Armed race gathered a type of green fruit while they conversed in a language that Leylin could not understand. Their language was not sounded with their throats, but information was relayed through something like electrical currents projected from their horns.\u003c/p\u003e\n\u003cp\u003eEven if he identified that information, Leylin still did not understand.\u003c/p\u003e\n\u003cp\u003e[Discovery of information regarding language of a different plane. Recording!] The A.I. Chip loyally intoned.\u003c/p\u003e\n\u003cp\u003eAll methods of communication were definitely practical and universal. With enough samples, simulating them would merely be a question of time.\u003c/p\u003e\n\u003cp\u003eAt this moment, Leylin noticed how frightful their physical strength was. It even exceeded that of a few rank 1 high-energy creatures.\u003c/p\u003e\n\u003cp\u003e“If this isn’t the usual standard in this world, then their strength must be exceptionally high…” Leylin sighed, ordering the spiritual force seed to make a move.\u003c/p\u003e\n\u003cp\u003e“Hello!” Information in the ancient Byron language through spiritual force was transmitted into the minds of these two Multi-armed beings.\u003c/p\u003e\n\u003cp\u003e“p”\u003c/p\u003e\n\u003cp\u003eThese two were obviously scared by the sound and immediately retreated, on their guard.\u003c/p\u003e\n\u003cp\u003e“The ancient Byron language is a languages governed by rules, and also one that is common to many worlds. I didn’t expect it not to work here!” Leylin sighed. Though Magi of the ancient era seemed to have taken over many dimensions, and forcefully implemented their language and words, the number of different worlds out there were like the countless stars in the sky. It was very possible for some to have been overlooked.\u003c/p\u003e\n\u003cp\u003e“It’s going to dissipate anyway. Any changes in the situation are better than none at all!”\u003c/p\u003e\n\u003cp\u003e*Buzz!* With Leylin’s control, the dark golden spiritual force seed began to vibrate, giving off a dim radiance.\u003c/p\u003e\n\u003cp\u003eThis strange situation immediately attracted the attention of two other Multi-Armed beings. They gathered in front of the seed and began to gesticulate at it. When they realised the dark golden seed posed no threat, they began to argue.\u003c/p\u003e\n\u003cp\u003eAt the end, one of them seemed to have persuaded their comrade, and used a white animal skin to carefully pick up the spiritual force seed that was already looking weak, and darting in a direction.\u003c/p\u003e\n\u003cp\u003eThe wind whooshed on both sides, the scenery blurring, and Leylin had to recalculate the strength of this race.\u003c/p\u003e\n\u003cp\u003eTens of minutes later, these two Multi-Armed beings brought Leylin to a large tribe.\u003c/p\u003e\n\u003cp\u003eIn terms of its appearance, it looked very primal. There were few houses, all built of bulky rocks that had been piled up, seeming very boorish.\u003c/p\u003e\n\u003cp\u003eMany beings of the Multi-Armed race moved around the tribe every once in a while, even greeting these two after seeing them.\u003c/p\u003e\n\u003cp\u003eLeylin obviously did not let this chance slip by and carefully observed everything in the tribe. He immediately made a discovery.\u003c/p\u003e\n\u003cp\u003e“Not considering the elderly and children, there seems to be only two types of looks for the Multi-Armed race.”\u003c/p\u003e\n\u003cp\u003eThe Multi-Armed beings had two types of looks. One was three arms on the right, and four on the left, while the other was the exact opposite, with four on the right and three on the left. The latter was usually larger, and their scales were more firm.\u003c/p\u003e\n\u003cp\u003eLeylin inferred that this could be a difference that indicated their genders.\u003c/p\u003e\n\u003cp\u003eThe two Multi-Armed beings did not seem to have a low status in the tribe. They proceeded forth with Leylin and came before a giant cave.\u003c/p\u003e\n\u003cp\u003e“Hm? This place?” Leylin was immediately wary.\u003c/p\u003e\n\u003cp\u003eFrom within the cave, he could feel energy particles converging. This meant there was an existence that dealt with magic, and there were even undulations similar to those of spell formations. However, compared to the Magus World, it had a different style.\u003c/p\u003e\n\u003cp\u003eOutside the cave were hung all sorts of materials. Some were from animals and plants, such as the roots and fruits.\u003c/p\u003e\n\u003cp\u003e“Looks like I’ve been brought to the a place where offerings are made, or where the tribe leader resides. That’s good too, since these people are usually more open…”\u003c/p\u003e\n\u003cp\u003eThe two Multi-Armed beings firrst kowtowed outside the cave devoutly, and then yelled.\u003c/p\u003e\n\u003cp\u003e“Sknglk…” An answer resounded from within the cave.\u003c/p\u003e\n\u003cp\u003eThe two Multi-Armed beings immediately placed the hide that carried Leylin within on the ground. Respectfully bowing, they then left.\u003c/p\u003e\n\u003cp\u003eThe moment a sound entered Leylin’s ears, he was instantly shocked. “Morning Star!!! There’s actually a Morning Star-ranked being here!”\u003c/p\u003e\n\u003cp\u003e*Tok! Tok! Tok!*\u003c/p\u003e\n\u003cp\u003eGiant footsteps were heard, and immediately after, a being that was two times larger than others of its race appeared before Leylin.\u003c/p\u003e\n\u003cp\u003eIt stared at Leylin’s seed, giant blood-red eyes shining as it immediately grabbed it before its figure disappeared into the cave.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-467\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-469\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-468","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
