{"id":58603,"no":47,"title":"Chapter 47","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eInconvenience\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin tried to wrest his way out, but an excruciating pain radiated from his shoulders.\u003c/p\u003e\n\u003cp\u003e[Host has sustained injuries from an arrow! Warning! Warning! High bacteria concentration on the arrowhead, recommend immediate disinfection of the affected area!]\u003c/p\u003e\n\u003cp\u003e\"Damn it!\" Leylin hurriedly pulled out the arrow and took a silver dagger from his robes. Gritting his teeth, he gouged out the flesh surrounding the wound.\u003c/p\u003e\n\u003cp\u003eHe hurriedly retrieved a green coloured potion from his waist pouch and poured half of it onto the wound. The other half he emptied into his mouth. Only after hearing the A.I. Chip\u0027s voice, [Crisis under control], did he heave a sigh of relief.\u003c/p\u003e\n\u003cp\u003eWhen Leylin was struck by the arrow, Doris had also been struck by the lightning, and had fallen down, crashing onto the ground.\u003c/p\u003e\n\u003cp\u003eAt this moment, Doris\u0027s whole body was charred and its wings were more than half broken.. One of her hands had vanished without any trace of it left behind, and her ankle was still grasped by the Umbra\u0027s Hand spell. Her life force had dropped to a dangerous level. She could die at any moment.\u003c/p\u003e\n\u003cp\u003e\"Revenge! My revenge!\" Doris unconsciously kept muttering those words. Suddenly its eyes flashed coldly, and it bit off its own right leg.\u003c/p\u003e\n\u003cp\u003e* Pa! * The leg flew in the air. The Umbra\u0027s Hand, which was holding onto the ankle, disappeared quickly as well.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s die together!\"\u003c/p\u003e\n\u003cp\u003eDoris\u0027s whole body inflated. Warts on its face vibrated. Her speed tripled as she charged directly at Leylin.\u003c/p\u003e\n\u003cp\u003e\"Damn it!\" Leylin pressed down on his shoulder wound and hastily retreated. At the same time, he threw out the last explosive potion.\u003c/p\u003e\n\u003cp\u003e* Bang! * An intense explosion reverberated.\u003c/p\u003e\n\u003cp\u003eRed flames and green liquid mixed together. It let off a dark green firelight.\u003c/p\u003e\n\u003cp\u003eLeylin rolled back several times before he could finally escape the blast radius.\u003c/p\u003e\n\u003cp\u003eAt this moment, the surroundings were showered with a bunch of green-coloured bones and flesh. It was utterly repulsive.\u003c/p\u003e\n\u003cp\u003e\"Eh?\" Looking at the green-coloured remains on the ground, Leylin saw that a yellow fluid swiftly flowed out, continuously corroding the ground. His expression involuntarily changed, and he hurriedly inspected his body.\u003c/p\u003e\n\u003cp\u003eA few drops of thick fluid had unknowingly corroded his leather armour and opened several wounds on his body. Around each of these wounds was a patch of yellow that was beginning to numb that area.\u003c/p\u003e\n\u003cp\u003e[Host is suffering from an unknown secondary pathogenic infection. It has invaded the Host and is spreading at very rapidly. Recommend to take counter measures!]\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Scan the injury! Find a way to treat it!\"\u003c/p\u003e\n\u003cp\u003e[Mission parameters established! Scanning......]\u003c/p\u003e\n\u003cp\u003e[Beep! Treatment requires 30 grams of Human Head Bird, 500 millilitres of pink ink oil, 50 grams of Green Coconut Rock......]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip continued to list down a huge number of items.\u003c/p\u003e\n\u003cp\u003e\"When would I have the time to buy these? A.I. Chip, generate the method for immediate suppression!\" Leylin\u0027s face darkened.\u003c/p\u003e\n\u003cp\u003e[Cauterising the wound with a flame will be effective in reducing the rate of infection!] The A.I. Chip responded.\u003c/p\u003e\n\u003cp\u003e\"A flame?\" Leylin ripped his clothes and casually picked up a burning branch as he placed the glowing flame on his wound.\u003c/p\u003e\n\u003cp\u003e* Sssii! * The sound of something being barbecue was heard accompanied by the smell of charring flesh. Leylin\u0027s face contorted in pain.\u003c/p\u003e\n\u003cp\u003eMinutes later, the A.I. Chip pronounced the treatment effective. Leylin put away the fire and sat limply on the ground panting, cold sweat dripping all over his body.\u003c/p\u003e\n\u003cp\u003e\"The enemy, this time, was extremely dangerous! Its resistance towards physical and flame attacks was extremely high. Its speed was also fast, and it had a poison attack. It seems to have been prepared specifically for me. If not for the A.I. Chip, I\u0027m afraid......\"\u003c/p\u003e\n\u003cp\u003eDoris\u0027 body fluids, containing the secondary infection from the arrow\u0027s poison, were something that the A.I. Chip had not factored in. This made Leylin, who expected only mild injuries from the encounter, suffer such a wretched victory.\u003c/p\u003e\n\u003cp\u003e\"On top of that, the explosive potions that I had prepared have all been used! I have to prepare more ingredients again!\"\u003c/p\u003e\n\u003cp\u003eThe past few battles, Leylin had highly relied on potions to defeat his enemies. However, the consumption was also huge, and he threw away close to a thousand magic crystals in value.\u003c/p\u003e\n\u003cp\u003eFortunately, he knew how to brew explosive potions; if not, the cost would have skyrocketed even higher.\u003c/p\u003e\n\u003cp\u003e\"Flame can only temporarily constrain the spreading of the pathogen. I have to buy the necessary ingredients to cure it completely!\" Leylin looked at his charred wound, his brows furrowed as he gulped down another strength Potion before picking himself up and heading back to Grey Stone City.\u003c/p\u003e\n\u003cp\u003eThis was a huge disturbance. It was very likely that the city\u0027s guards already sensed that something was amiss and would very soon send someone over to inspect.\u003c/p\u003e\n\u003cp\u003eLeylin endured the intense pain and sneaked back inside Grey Stone City. He stealthily took out his chest, not bothering to even bring his two horses along with him. After stealing a light brown coloured horse outside the city walls, he escaped under the cover of night. He was headed towards the Magus market located on the map.\u003c/p\u003e\n\u003cp\u003eAs for the summons of the city lord, it was only natural that he ignored it completely.\u003c/p\u003e\n\u003cp\u003e......\u003c/p\u003e\n\u003cp\u003eA dozen odd days later, on the way to Wolkan Province, a light brown coloured horse could be seen carrying two huge chests with a black robed figure astride its back. The horse was panting heavily as its four hoofs dashed across the ground.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Show me my current status!\" Leylin\u0027s body which moved up and down with the horse\u0027s movement, thought inwardly.\u003c/p\u003e\n\u003cp\u003e[Beep! Leylin Farlier, level 2 acolyte, Knight. Strength: 1.3(2.5), Agility: 1.5(2.7), Vitality: 1.0(3.0), Spiritual force: 4.1(4.4), Magical Power: 4.0. Status: Host is in a weakened state due to infection from the pathogen]\u003c/p\u003e\n\u003cp\u003e\"Although the pathogen was inhibited, it has been a dozen odd days since then. My body is still in a weak condition. Only my spiritual force has increased again- this must be due to the result of constant meditation!\"\u003c/p\u003e\n\u003cp\u003eLeylin looked at his stats and smiled bitterly.\u003c/p\u003e\n\u003cp\u003eRight now he had a completely new face. He had changed from an icy cold soldier into an extremely dashing golden-haired blue eyed westerner. His face, however, was devoid of colour.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Project the mind map!\" Leylin looked at the little information he had compiled superimposed onto an extremely detailed map.\u003c/p\u003e\n\u003cp\u003e\"From Bicky\u0027s intelligence gathering, there should be a gathering area for Magi nearby. There, I will be able to buy ingredients to treat this infection!\"\u003c/p\u003e\n\u003cp\u003eBased on half a month of probing and simulation, Leylin surmised that the opponent had only dispatched Doris. Due to the official war with Abyssal Bone Forest Academy, nobody could be bothered with a lowly level 2 acolyte like himself. This was a great piece of news.\u003c/p\u003e\n\u003cp\u003e\"I can probably even make inquiries about the current situation in Abyssal Bone Forest Academy!\" Leylin made up his mind and left the main road. He quickly found a spot, took out his tent and tools, and went about setting up camp.\u003c/p\u003e\n\u003cp\u003e\"This area seems a little desolate. However, it\u0027s only normal. Magus activities always steer clear of human communities as much as possible. Moreover, the radiation from a Magus is not something that regular humans can withstand.\"\u003c/p\u003e\n\u003cp\u003eLeylin sprinkled some white powder around the tent area to prevent bugs and beasts from approaching. He then picked up a metal pan, poured some stream water into it, and lit a bonfire.\u003c/p\u003e\n\u003cp\u003eJust as the stream water began to boil, Leylin emerged from the trees and threw some mushrooms and other plants into it.\u003c/p\u003e\n\u003cp\u003eA moment later, after adding some spices and a few strips of jerky, a fresh fragrance of food permeated the air.\u003c/p\u003e\n\u003cp\u003eLeylin scooped a bowl for himself. The soup base was white in colour. It felt extremely comforting to drink it while it was hot.\u003c/p\u003e\n\u003cp\u003eLeylin sighed in contentment, \"As expected, food that\u0027s hot is the best. I could almost puke from constantly eating biscuits and jerky.\"\u003c/p\u003e\n\u003cp\u003eThe surroundings were dotted with wildflowers, and there was also the sound made by an unknown bird; its cry was much similar to that of a skylark.\u003c/p\u003e\n\u003cp\u003e\"If not for my injury, this would have been perfect!\" Leylin finished his meat broth and adjusted his robes.\u003c/p\u003e\n\u003cp\u003eUnder his clothes, a charred area of flesh had a layer of fine hair growing around it looking like hair on one\u0027s head, which creeped people out.\u003c/p\u003e\n\u003cp\u003e\"Over there, kill him!\"\u003c/p\u003e\n\u003cp\u003eSigns of movement came from the trees nearby. Leylin\u0027s brows furrowed. The shouting gradually became closer. He had a feeling that trouble had come knocking once more.\u003c/p\u003e\n\u003cp\u003eThe bushes nearby split apart as a large guy protecting a nobly dressed young lady rushed out.\u003c/p\u003e\n\u003cp\u003eWhen the large guy saw Leylin, he was shocked. He never expected someone had set up camp here. He said with a bitter smile at Leylin, \"I\u0027m afraid you\u0027ll also be implicated in this.\"\u003c/p\u003e\n\u003cp\u003e\"Over there, don\u0027t let him escape!\" A group of armed soldiers in leather armour rushed over. The leader wore an extremely beautiful chainmail.\u003c/p\u003e\n\u003cp\u003e\"This outfit does not seem like something mercenaries or adventurers would wear. These people are most likely the personal retainers of some nobility which is even more troublesome!\" Leylin\u0027s brows furrowed.\u003c/p\u003e\n\u003cp\u003eAccording to the A.I. Chip\u0027s scan, this large guy was obviously injured but still had the strength of a Preparatory Knight.\u003c/p\u003e\n\u003cp\u003eAs for the pursuers, the leader was at Knight level, whereas the soldiers behind were just a little stronger than the average human.\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" The leader looked at Leylin.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just an innocent bystander, please continue and don\u0027t mind me. I haven\u0027t seen anything today!\" Leylin continued drinking his meat broth.\u003c/p\u003e\n\u003cp\u003eThis casual vibe obviously made the private squad leader apprehensive since the large guy and young lady stood on the other side.\u003c/p\u003e\n\u003cp\u003e\"Please save us! We are the descendants of Viscount Barrett. If you were to lend us a helping hand, I will definitely remember your kindness, and you will forever have the friendship of the Barrett family!\"\u003c/p\u003e\n\u003cp\u003eThe young lady had a pair of mesmerising blue eyes. At this moment her face had a pleading expression that would most likely move the majority of noble male youths to impulsively swear to fight for her honour.\u003c/p\u003e\n\u003cp\u003e\"Miss Lanning, the Viscount only asks for you to return. Please do not resist!\" The leader told the young lady.\u003c/p\u003e\n\u003cp\u003e\"That underhanded and despicable worm, he covets the possessions of my family and poisoned my father to his death. Even if I die I will not go back!\"\u003c/p\u003e\n\u003cp\u003eThe young lady poured all of her problems out in one go, sneaking a glance at Leylin from time to time. Although her movements were extremely well concealed, Leylin still saw through it.\u003c/p\u003e\n\u003cp\u003e\"It seems like a struggle of inheritance by a descendant who has failed. By purposefully revealing this conflict, you want to drag me down into this huh?\" Leylin shook his head.\u003c/p\u003e\n\u003cp\u003e\"Viscount Sire has not done any of the things you claim. As for the inheritance, it is to be decided after the meeting with the nobles!\"\u003c/p\u003e\n\u003cp\u003eThe leader exclaimed loudly.\u003c/p\u003e\n\u003cp\u003e\"I have proof on my body!\" The young lady snarled.\u003c/p\u003e\n\u003cp\u003e\"Quick, bring Missy home!\" The leader seemed prepared to not negotiate any further.\u003c/p\u003e\n\u003cp\u003eA few of the commoner troops brandishing their knives and swords charged forward. The large guy roared and shielded the noble young lady.\u003c/p\u003e\n\u003cp\u003eThe large guy\u0027s strength was obviously not bad. Even though he was injured, he still made 5 of these soldiers pay with their lives.\u003c/p\u003e\n\u003cp\u003eThe commoner troops went forward to chop and retrieve the head of the large guy. They then tied the screaming noble young lady up and only then did the leader who had been wary of Leylin give him a suspicious glance.\u003c/p\u003e\n\u003cp\u003e\"It looks like we have been bothering you! Let\u0027s go!\"\u003c/p\u003e\n\u003cp\u003eThe leader said as he turned around and prepared to leave.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-46\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-48\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-47","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
