{"id":59036,"no":480,"title":"Chapter 480","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eTease\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin didn\u0027t feel good the entire night due to the orders to capture Robin. Regardless of how things would unfold, it would still be disadvantageous to the Ouroboros Clan.\u003c/p\u003e\n\u003cp\u003eThe disciple of a Morning Star Magus had shown signs of betrayal, which would be a fatal blow to the emotions of the Warlocks that had just settled down. But since it was Gilbert’s wish, Leylin could only carry it out.\u003c/p\u003e\n\u003cp\u003eHowever, he somehow felt that things weren\u0027t so simple.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Leylin! Welcome!” Robin hugged Leylin and laughed heartily. He was full of smiles, and looked as though he wasn\u0027t affected by the news.\u003c/p\u003e\n\u003cp\u003eRobin still had the appearance of a very young male, if one ignored the numerous runes imprinted on his face.\u003c/p\u003e\n\u003cp\u003eCompared to the last time they met, the imprints on Robin’s forehead were even more terrifying, and practically occupied more than half of his face. It made Robin’s original facial features seem immensely sinister and horrifying.\u003c/p\u003e\n\u003cp\u003e“Senior Robin!” Leylin put on a stiff smile.\u003c/p\u003e\n\u003cp\u003eAfter making brief bodily contact with him earlier on, a quiver had run through his entire being and he’d felt every pore on his body contract.\u003c/p\u003e\n\u003cp\u003eSuch a feeling was an indication of what a ferocious beast Robin had become, automatically putting Leylin on guard.\u003c/p\u003e\n\u003cp\u003eLeylin peered past Robin, and he scanned the members of his family behind him.\u003c/p\u003e\n\u003cp\u003eThe family that Robin belonged to was known as the Parble Family. In the entire Ouroboros Clan, their bloodline lineage was one of the purest, and they were a long-standing noble family that possessed great influence.\u003c/p\u003e\n\u003cp\u003eOn previous adventures, Robin could have dispatched fifty rank 3 Warlocks as he wished, and he even brought along a pure-blooded nephew, which went to show how much of a standing their family had.\u003c/p\u003e\n\u003cp\u003eBut now, the teenagers that followed behind Robin had gloomy expressions... Or more accurately, they had an air of death around them.\u003c/p\u003e\n\u003cp\u003eWhat made Leylin even more shocked was that behind Robin, there wasn\u0027t a single family elder to be seen, and there weren\u0027t many Warlocks who were at rank 3 and above. Even Noah was nowhere to be found.\u003c/p\u003e\n\u003cp\u003e“Such a situation must definitely mean that something huge has happened!”\u003c/p\u003e\n\u003cp\u003eLeylin’s hunch was getting clearer, but his facial expression only became more sincere, and he said slightly apologetically, “I\u0027m sorry, senior, according to Mentor’s orders…”\u003c/p\u003e\n\u003cp\u003e“Oh! Rest assured, it\u0027s a total misunderstanding! I’ll go to headquarters with you tomorrow to explain!” Robin seemed honest.\u003c/p\u003e\n\u003cp\u003eHe then enthusiastically invited Leylin, “You haven\u0027t been to my castle and laboratory before, right? Stay here for the night. Your vassals are also my guests. I have prepared a sumptuous banquet for them, and I believe you’ll like it here…”\u003c/p\u003e\n\u003cp\u003eWhat else could Leylin say when Robin was being so cordial? He could only check into the vacant room that Robin had specially left for him, just as his vassals that had rushed here with him did into theirs.\u003c/p\u003e\n\u003cp\u003eThe oaken floor had an oily layer of gloss on it. The smell of incense filled the room, and the four walls were filled with portraits, armour and swords.\u003c/p\u003e\n\u003cp\u003eAlthough Parker had never specifically learned about assessments in this aspect, he also knew that this was surely one of the best rooms in the castle.\u003c/p\u003e\n\u003cp\u003e“It’s just that… My Lord, you…” Parker didn’t have the slightest interest in examining the helmet that was said to have been adorned with the feathers of multicoloured birds, but instead stood in front of Leylin with a worried look on his face.\u003c/p\u003e\n\u003cp\u003e“I know. You mean to say that I had received orders to apprehend Robin, but yet I’m now associating with him, and this will inevitably make people suspicious and cause them to attack...” Leylin lay on an armchair embedded with huge rubies, and interrupted Parker with a wave of his hand, brushing him off.\u003c/p\u003e\n\u003cp\u003e“But what else can we do? Robin is my senior after all, and before this matter has been fully investigated, we cannot make any rash conclusions!”\u003c/p\u003e\n\u003cp\u003e“Anyway, he has already agreed to return with us tomorrow, so we don’t have to demand anything else…”\u003c/p\u003e\n\u003cp\u003eEven upon hearing Leylin’s words, Parker’s smile remained bitter. This was, of course, the most normal scenario, but from his point of view, Robin seemed to be showing symptoms of insanity., and it was impossible to deduce his next course of action using logic.\u003c/p\u003e\n\u003cp\u003eFurthermore, it was hard to guarantee that he didn’t have plans to first numb them and then get rid of all his problems at once.\u003c/p\u003e\n\u003cp\u003eAmong all the bloodline nobility of the land, they were undoubtedly the best, and even orders from the headquarters would sometimes be boycotted by them, openly or secretly.\u003c/p\u003e\n\u003cp\u003e*Knock! Knock! Knock!* Just as Parker was about to say something, a steady and rhythmic knocking sound came from the door.\u003c/p\u003e\n\u003cp\u003eA tender voice sounded from behind the door, “Respected Marquis! The banquet has begun!”\u003c/p\u003e\n\u003cp\u003e“You may enter!” Leylin nodded.\u003c/p\u003e\n\u003cp\u003eThe door was promptly opened, and a girl dressed as a servant, whose face still had baby fat, appeared in front of Leylin and Parker.\u003c/p\u003e\n\u003cp\u003eThe female servant’s face flushed with nervousness as though it was her first time seeing such high-ranking guests.\u003c/p\u003e\n\u003cp\u003e“How great it must be to be young…” Leylin pinched her cheeks, hardly standing on courtesy. This made her blush all the way to her neck.\u003c/p\u003e\n\u003cp\u003eHe felt the aura of a pure Kemoyin bloodline from the girl. It seemed that she shared blood with Robin, and they were probably weren’t far removed.\u003c/p\u003e\n\u003cp\u003eFrom the bloodline, it seemed that this girl had a bright future, and might even be in the direct line of descent in Robin’s family. But in order to greet Leylin, she naturally had to change into the clothes of a servant.\u003c/p\u003e\n\u003cp\u003e“What’s your name?” Leylin asked, smiling. Parker stood aside, expressionless, as though he hadn’t seen Leylin’s gesture.\u003c/p\u003e\n\u003cp\u003eAs a high-ranking Warlock, who also once had authority over a Warlock clan, he had become completely immune to such matters.\u003c/p\u003e\n\u003cp\u003eEven if Leylin did anything in front of him, he would still be able to stand as straight as a pine tree.\u003c/p\u003e\n\u003cp\u003e“Ed... Edda, Sir! The female servant’s voice held a hint of a repressed sob, as though she was about to cry any moment.\u003c/p\u003e\n\u003cp\u003eAt her age, she obviously knew a lot. If this high-ranking bloodline nobleman wanted her, there wouldn’t be any objections from anyone, regardless of if it was an elder or her parents. They might even send her over with great joy.\u003c/p\u003e\n\u003cp\u003eHence, although she was on the verge of tears, Edda held them back, trying to stay strong.\u003c/p\u003e\n\u003cp\u003eLuckily for her, Leylin stopped teasing her. He gently asked Edda, whose face was turning fully red, “I also have another close friend in the Parble Family by the name of Noah, do you know him?”\u003c/p\u003e\n\u003cp\u003e“Uncle Noah?!” the little girl cried out, yet shortly after she seemed to have remembered something, and raised her guard against Leylin.\u003c/p\u003e\n\u003cp\u003eIt was alright, though. From her behaviour earlier on, Leylin became aware of many things.\u003c/p\u003e\n\u003cp\u003e“No need to be afraid! He and I are good friends, if anything has happened to him, I will definitely help!” Leylin acutely discovered Edda’s hidden hostility, and plastered his kindest smile on his face.\u003c/p\u003e\n\u003cp\u003e“Uncle Noah… He has been locked up!” The little girl finally mumbled after a seemingly long struggle with herself, and her voice was practically so low that it couldn’t be heard.\u003c/p\u003e\n\u003cp\u003e“Got it, I will try rescuing him!” Leylin caressed her head and guaranteed.\u003c/p\u003e\n\u003cp\u003e“What do you think is the possibility of her telling the truth?” Leylin asked indifferently after sending the servant away.\u003c/p\u003e\n\u003cp\u003e“The possibility isn’t high; after all, she was sent by them!” Parker shook his head.\u003c/p\u003e\n\u003cp\u003e“I think so too, but it’s also possible that it’s information brought to us by the other powers in the Parble Family…” Leylin stroke his chin.\u003c/p\u003e\n\u003cp\u003eHe had a premonition that this trip to the Parble Family Parble Family was perhaps not as simple, and it was possible that more unexpected things were slated to happen.\u003c/p\u003e\n\u003cp\u003eThe atmosphere in the drawing room was tense, but a few seconds later, Leylin’s light laugh broke the silence. “Let’s not think too much about this right now, and just enjoy the banquet!”\u003c/p\u003e\n\u003cp\u003e“Yes, sir!” Parker nodded and followed behind Leylin. He was decked in a black tailcoat, and wore a beautiful tie around his collar, appearing as if he had made preparations long ago.\u003c/p\u003e\n\u003cp\u003eWhile Leylin and company were enjoying the wine and delicacies made by the Parble Family, and even the female Warlocks that were brimming with enthusiasm, somewhere in the depths of the ancient castle an invisible darkness spread endlessly.\u003c/p\u003e\n\u003cp\u003e“Divulging the information to him on purpose? Your plan is really badly done...” In a dim and narrow room, a blue secret imprint hovered in midair, and the voice of a middle-aged man faintly sounded.\u003c/p\u003e\n\u003cp\u003e“Rest assured! I know him very well, once he knows about this, he definitely will give chase!” A silhouette shrouded in black gas was conversing with the secret imprint. Numerous squirming veins emerged from the black gas from time to time, and were densely packed, making one’s scalp go numb.\u003c/p\u003e\n\u003cp\u003e“I don’t care about your plan, but Leylin has to be handed over to me!” The blue secret imprint spoke with gritted teeth, apparently harbouring an unforgettable hatred towards Leylin.\u003c/p\u003e\n\u003cp\u003e“We have been making deals and collaborating on many occasions, you don’t have to worry!”\u003c/p\u003e\n\u003cp\u003eThe figure shrouded in the black gas was silent for a while, then continued asking, “Actually, these are all small matters. What I really wish to know is: when are you planning to take action?”\u003c/p\u003e\n\u003cp\u003e“Very soon… The elders in the Ouroboros Clan will soon become a thing of the past. Then, our plan can truly be launched. After all, the counterattack of three Morning Star Warlocks would be hard to bear even for a Radiant Moon Magus…”\u003c/p\u003e\n\u003cp\u003eThe glow of the blue imprint completely dimmed down with the last words of the middle-aged Magus.\u003c/p\u003e\n\u003cp\u003e“Very soon…” The figure in the black gas muttered, and suddenly chanted a certain syllable. The gas dispersed, revealing a face all so familiar to Leylin.\u003c/p\u003e\n\u003cp\u003eLeylin, who was still at the banquet, naturally knew nothing about all of this. Now, he was like a huge butterfly, dancing gracefully among a cluster of flowers.\u003c/p\u003e\n\u003cp\u003eThe enthusiasm of the female Warlocks of the Parble Family practically melted the many Warlocks, and those that Leylin had brought over were also immersed in delight.\u003c/p\u003e\n\u003cp\u003e“Feels like things won’t be that simple…”\u003c/p\u003e\n\u003cp\u003eParker leaned against a pillar with a glass of wine in his hand, watching Leylin’s performance, yet a puzzled look flashed in his eyes.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-479\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-481\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-480","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
