{"id":59046,"no":490,"title":"Chapter 490","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eLarge Crisis\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eNaturally, this female Magus was Tanasha. As a Crystal Phase Magus from the Forgotten Land, she had a sensitive identity and served as Leylin’s hidden force.\u003c/p\u003e\n\u003cp\u003eTanasha also participated secretly in several battles. As soon as he’d noticed the sudden change in the Parble family, Leylin had sent her to rescue his Magi in the castle.\u003c/p\u003e\n\u003cp\u003e”Parker, how are the casualties?” Even so, injuries and deaths couldn’t be prevented, although it was still better than being wiped out.\u003c/p\u003e\n\u003cp\u003e”Master, we lost two rank 3 Magi this time, one of them at the Vapour Phase…” Parker didn’t look well, and the big loss this time could be seen on his face.\u003c/p\u003e\n\u003cp\u003eAfter listening carefully, Leylin sighed.\u003c/p\u003e\n\u003cp\u003eThe Magus world was full of danger. Death was common in fights between Magi, so those who fought in battles seldom cared about it.\u003c/p\u003e\n\u003cp\u003eBut as an enforcer, he couldn’t say this out loud.\u003c/p\u003e\n\u003cp\u003eLeylin pointed three fingers to the sky. ”I swear on the name of Leylin Farlier, every Magus who fights to the death for me will be adequately compensated.”\u003c/p\u003e\n\u003cp\u003eHis vassals followed him for different reasons. Some of them wanted to further improve themselves, but many worked for their families like Parker. Thus Leylin’s oath successfully relaxed them.\u003c/p\u003e\n\u003cp\u003e”What happened in the Parble Family was very complicated. Prepare a room for me, I need to contact the headquarters.” Knowing there were great dangers, it would be foolish to make further movements.\u003c/p\u003e\n\u003cp\u003eLeylin had his own forces to back him, and it was time he put them to good use. This clone was only rank 3, and this was his only chance to kill it.\u003c/p\u003e\n\u003cp\u003eHe was very confident in the strength of his forces.\u003c/p\u003e\n\u003cp\u003e”Your room has been prepared, please follow me!” Tanasha led Leylin deep into the cave.\u003c/p\u003e\n\u003cp\u003eAlthough this secret base was temporary, it wasn’t a big problem to construct several rooms using spells.\u003c/p\u003e\n\u003cp\u003eParker looked at Tanasha whose face was covered by a black cloth, moving his mouth but finally said nothing.\u003c/p\u003e\n\u003cp\u003eOnly now did he learn that another Crystal Magus served his master! Rich in experience, he felt an aura of danger from the cold-blooded aura of that Magus.\u003c/p\u003e\n\u003cp\u003eHow many hidden powers did master have?\u003c/p\u003e\n\u003cp\u003eAlthough he was used to his master performing miracles, Parker felt like he was shrouded with another mysterious veil.\u003c/p\u003e\n\u003cp\u003eOf course, this was just his imagination, he would rather die than inquire about his master’s secrets or even the woman’s identity. This was how a subordinate should behave.\u003c/p\u003e\n\u003cp\u003eNot only him, the other Magi accepted the existence of Tanasha immediately as well, as if she had been with them all this time.\u003c/p\u003e\n\u003cp\u003eAnd with the help of Tanasha, their base was quickly tidied up.\u003c/p\u003e\n\u003cp\u003eWhen facing great danger, great power could give people confidence. This wasn’t limited to ordinary people; even Magi felt the same way.\u003c/p\u003e\n\u003cp\u003eIn a cave dug with earth elemental spells, Leylin found the secret imprint of his communications officer. He pressed his hand on the imprint, and soon the device was covered in black light.\u003c/p\u003e\n\u003cp\u003eAfter several minutes, Leylin’s face turned dark, ”It can’t get through!”\u003c/p\u003e\n\u003cp\u003eHe pressed down on the imprint once more, ”Headquarters! Is anyone there?”\u003c/p\u003e\n\u003cp\u003eAfter several attempts, he couldn’t help but admit that the liaison assigned specifically to him, who was expected to be ready for his message any second, had deserted his post.\u003c/p\u003e\n\u003cp\u003eKnowing this, Leylin frowned. He had no other backing in the central continent except the Ouroboros Clan, and he would be in danger if something happened in headquarters. The pressure from Azure Mountain City alone would force him to hide in the underground of society, with the dregs of the Magus world.\u003c/p\u003e\n\u003cp\u003e”What the hell happened?” Leylin searched the other pages. There was no feedback from Kesha. Lucian was there but he didn’t say much, just that some accident had occurred and all outer-ring movements were cancelled.\u003c/p\u003e\n\u003cp\u003e”Cancelled? Now?” Leylin smiled coldly, directly ending contact with Lucian. Judging from his tone, something must have happened in the headquarters that caused them to lose their ability to react.\u003c/p\u003e\n\u003cp\u003eAnd from his secretive manner, he still didn’t take him to be a core member, and was suspicious at this key moment.\u003c/p\u003e\n\u003cp\u003eIt was too dangerous without accurate information. Leylin considered calmly for a moment, and flipped to another scale-shaped red imprint.\u003c/p\u003e\n\u003cp\u003eAfter a short while connecting, a response finally came in, “Is this Leylin?”\u003c/p\u003e\n\u003cp\u003e”It is!” Leylin spoke in a low voice, ”Freya, are you in the headquarters now?”\u003c/p\u003e\n\u003cp\u003e”Yeah, I’m here. Leylin, it’s now an emergency! You better come back immediately and not go out!”\u003c/p\u003e\n\u003cp\u003eLeylin was surprised about her panicked voice. She hadn’t acted like this even when the bloodline of her own family was deteriorating.\u003c/p\u003e\n\u003cp\u003e”I have trouble here too. The Parble Family colluded with Azure Mountain City, and even the clone of the Azure Mountain King is here!” Leylin related the information he hadn’t told Lucian just now.\u003c/p\u003e\n\u003cp\u003e”The Parble Family, a clone of the Azure Mountain King?” she cried out in surprise. Anyone would be nervous if a Morning Star Magus, even if just a clone, appeared in their hinterland.\u003c/p\u003e\n\u003cp\u003e”I knew it!”\u003c/p\u003e\n\u003cp\u003e”Knew what?” Leylin asked.\u003c/p\u003e\n\u003cp\u003eFreya seemed to notice her slip of tongue, and after a while she spoke in a low voice, ”Are you in a safe place?”\u003c/p\u003e\n\u003cp\u003e”Absolutely safe!” Leylin moved his fingers, and black light covered the whole room.\u003c/p\u003e\n\u003cp\u003e”Wait a minute, I need to change into an encrypted channel!” As Freya’s voice arrived, the light on that brand first vanished and then returned, now brighter.\u003c/p\u003e\n\u003cp\u003e”Things don’t seem good…” Leylin listened carefully, he knew that what Freya was going to say definitely affected his life.\u003c/p\u003e\n\u003cp\u003e”We can’t make contact with Mentor or the other two elders…” Freya’s nervous voice came from the brand.\u003c/p\u003e\n\u003cp\u003e”Can’t make contact? What does that mean?” Leylin was confused.\u003c/p\u003e\n\u003cp\u003e”My teacher said they were about to find the coordinates of the Purgatory World, and they needed to conduct detailed experiments and couldn’t be disturbed! Thus, they cut off all connection with the outside. Yesterday, I found that the spiritual flame my teacher gave me was about to die out, so I broke into my teacher’s lab...and…”\u003c/p\u003e\n\u003cp\u003e”What did you find?” Leylin’s voice also became nervous.\u003c/p\u003e\n\u003cp\u003e”Nobody was in that lab, even the astral gate had stopped working!” Intermittent sobs laced Freya’s words.\u003c/p\u003e\n\u003cp\u003e”The same thing happened in the labs of the other two elders!”\u003c/p\u003e\n\u003cp\u003e”I...I...I…” Leylin was about to curse, so he took a deep breath to calm himself down.\u003c/p\u003e\n\u003cp\u003eExperiments on the astral gate were very dangerous, and if you didn’t return before the astral stones ran out of power, the Magi who passed through would be trapped in another world.\u003c/p\u003e\n\u003cp\u003eAs Freya said, the astral stones had run out, and even the spiritual flame was extremely weak; they were trapped in another world!\u003c/p\u003e\n\u003cp\u003eThe three Morning Star Magi were the backbone of the Ouroboros Clan. Once they lost them, it wouldn’t be long before the whole clan was destroyed. No wonder the headquarters was in a mess, and even Lucian was thrown into disarray.\u003c/p\u003e\n\u003cp\u003e”Are you sure?” Leylin felt his throat tighten, but he still held on to hope.\u003c/p\u003e\n\u003cp\u003e”We have tried everything to contact them, even projecting the spiritual flame. Nothing worked… My Mentor... I’m afraid they’re lost in another world…”\u003c/p\u003e\n\u003cp\u003eOn the other side of the brand, Freya couldn’t restrain her choking sobs.\u003c/p\u003e\n\u003cp\u003eWhen someone was lost in another world, it wasn’t as simple as not being able to come back. Big worlds always hated outsiders, and once you were unable to return in time, the Magi stuck there would have no good end.\u003c/p\u003e\n\u003cp\u003eNibble away from the safety of the astral gate, and finally reverse the attitude of the world, that was the best way to seize another world.\u003c/p\u003e\n\u003cp\u003eNow, the three Morning Star elders were like ordinary people lost in the boundless ocean, surrounded by bloody sharks.\u003c/p\u003e\n\u003cp\u003eNothing could be worse than this.\u003c/p\u003e\n\u003cp\u003eAfter she wept for a while, Freya’s voice finally grew firm, ”Do you know why the Azure Mountain King is here?”\u003c/p\u003e\n\u003cp\u003e”I have no idea, I thought it was for the Parble Family or me, but now I’m not sure…” Leylin smiled bitterly.\u003c/p\u003e\n\u003cp\u003eIf it was just an experimental accident, there was still hope. But what if the whole thing was set up by their enemies?\u003c/p\u003e\n\u003cp\u003eThinking about the omens of war recently, and the abnormal behaviour of the Azure Mountain King, Leylin thought this was very possible.\u003c/p\u003e\n\u003cp\u003eAfter thousands of years, why did they find the Purgatory World at this exact time? It made sense if this was their enemies’ plot.\u003c/p\u003e\n\u003cp\u003e”Good job! Good job! One astral coordinate trapped three Morning Star Magi…” Leylin took a deep breath, if he was right, after the Morning Star Magi of the Ouroboros Clan disappeared, they would be dealt with as fast as lightning.\u003c/p\u003e\n\u003cp\u003eIf they couldn’t settle this matter, from now on, whether the Ouroboros Clan would continue to exist in the central continent was a question.\u003c/p\u003e\n\u003cp\u003eCutting off the connection, Leylin fell into deep thought.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-489\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-491\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-490","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
