{"id":59047,"no":491,"title":"Chapter 491","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eObliterating Hurricane \u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eWhat happened this time round was evidently a conspiracy, a huge conspiracy against the Ouroboros Clan!\u003c/p\u003e\n\u003cp\u003eFirst, it was the revealing of the world coordinates so as to attract three Morning Star Magi, which caused them to fall into enemy hands.\u003c/p\u003e\n\u003cp\u003eAfter which, the military controlled the borders heavily. First, they created trouble to sound out the situation. Upon confirmation that the three Morning Star Giant Kemoyin Serpent Warlocks were all not around, they would proceed to exterminate entire family clans!\u003c/p\u003e\n\u003cp\u003eDuring that unstable period, Leylin, who was a rank 3 Magus in the Crystal phase, was considered a small and insignificant figure, and could potentially be exterminated at any time!\u003c/p\u003e\n\u003cp\u003e“I have to be a more prominent figure if I do not wish to be attacked. More so if I wish to even go against the tide!” After some contemplation, Leylin’s expressions revealed more determination.\u003c/p\u003e\n\u003cp\u003e“Those who are below the rank of Morning Star are considered insignificant figures, what about those who advance past the Morning Star realm?”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes shone, “Only upon advancement to a rank above Morning Star can I decide my own fate. Then, I will not be abandoned or destroyed at the wishes of others!”\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, what’s the progress on the collection of data with regards to the Morning Star realm?” Leylin immediately asked.\u003c/p\u003e\n\u003cp\u003e[Beep! The Morning Star realm deductions are currently 34.5% completed!] The A.I Chip intoned.\u003c/p\u003e\n\u003cp\u003eLeylin had always been fixated on data in this area, but due to the lack of actual specimens, the progress was barely halfway through. The recent progress was all thanks to the Azure Mountain King’s clone, which had allowed for the progress to increase by quite a bit.\u003c/p\u003e\n\u003cp\u003eLeylin recalled what he had used when advancing to Morning Star, “The Lamia fingerbone has already been prepared. The bloodline combustion experiment has also been tested multiple times, and there wouldn’t be any errors. The only thing left now is the A.I Chip’s deductions on the Morning Star realm!”\u003c/p\u003e\n\u003cp\u003eThose three factors were the key to Leylin’s confidence in advancing to the Morning Star realm.\u003c/p\u003e\n\u003cp\u003eOn the other hand, the A.I Chip which had to deduce the nature of the Morning Star realm was also a pivotal factor, “The current progress is insufficient. We need a progress of at least 50% and above to be able to avoid mistakes during the formation of the point mass!”\u003c/p\u003e\n\u003cp\u003e“A sample of the clone of a Morning Star Magus would be sufficient!”\u003c/p\u003e\n\u003cp\u003eA ray of determination shone across Leylin’s eyes. He turned his palms upwards, where stony rune filled with holes appeared.\u003c/p\u003e\n\u003cp\u003e“If this still doesn’t work, then we’ll add this in…”\u003c/p\u003e\n\u003cp\u003eA Magi who had just attained Crystal phase and want to construct a point mass in order to be promoted to Morning Star rank would at the very least, take a couple hundred of years of accumulation and hard work. Leylin naturally knew that, but time was not on his side. Furthermore, he had many hidden trump cards, and had a deep enough understanding, which could surpass that of many Crystal phase Magi who had hundreds of years of accumulated knowledge!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAt the fringes of Parble Family’s territory stood a starry-eyed Magus with long blue hair, his face red with fury.\u003c/p\u003e\n\u003cp\u003eThe numerous high-ranked Warlocks and even larger numbers of common soldiers before him were too numerous to count.\u003c/p\u003e\n\u003cp\u003eNot far away, the outline of a giant city could be seen. Above it there were flames that had started to consume the city. The cries and sobs of the residents seemingly passed through the raging flames and arrived before the Magus.\u003c/p\u003e\n\u003cp\u003eThe resentment, together with the extreme agony accumulated could cause a catalyst for a terrifying existence to be borne.\u003c/p\u003e\n\u003cp\u003eAs compared to Leylin’s previous life, in this world where the power of energy was more reactive, anything was possible!\u003c/p\u003e\n\u003cp\u003eBut the Azure Mountain King had not once furrowed his brows. It was as if exterminating the tens of thousands of people was like swatting a fly, which had not stirred up any of his emotions.\u003c/p\u003e\n\u003cp\u003e“Seven cities have already been destroyed, and there’re more than five million casualties. More than ten high-rank Warlocks have perished…”\u003c/p\u003e\n\u003cp\u003eThe Azure Mountain King gave a cold smile: “To think that the Ouroboros Clan is still burrowing its head into the sand like an Ostrich. Looks like Gilbert and the rest have already fallen into the other realms…”\u003c/p\u003e\n\u003cp\u003eHis visit this time round was obviously not just for Leylin, but more so to sound out the reactions of the Morning Star Magi.\u003c/p\u003e\n\u003cp\u003eIf the other party was around, how would it be possible that they’d watch on as he wreaked havoc? Warlocks typically had very fiery tempers, and they might even have directly attacked Azure Mountain City. But now?\u003c/p\u003e\n\u003cp\u003eThe other party’s high-ranked military prowess was evidently held up, and even the reinforcements from the high-ranked Warlocks seemed chaotic. This was why they were so easily massacred.\u003c/p\u003e\n\u003cp\u003e“I had originally decided to just let my clone perish here. But from the looks of it now, I think I can get far more benefits…”\u003c/p\u003e\n\u003cp\u003eThe Azure Mountain King’s eyes shone with greed that could not be concealed. But he swiftly caressed his face and his expressions slowly became gloomy.\u003c/p\u003e\n\u003cp\u003e“Leylin Farlier!” He deeply called out the name of the man who had caused him to suffer losses to the extent that he had disgraced the name of his clan.\u003c/p\u003e\n\u003cp\u003e“I hope you’ll continue living long enough to see the day that I attack the Ouroboros Clan…” The Azure Mountain King laughed coldly.\u003c/p\u003e\n\u003cp\u003eIn an instant, his brows furrowed, and his eyes widened. “This aura? He has the guts to appear here?”\u003c/p\u003e\n\u003cp\u003ePart of the Azure Mountain King’s facial muscles cramped up, “Since you have a death wish, I’m more than willing to help you with that!”\u003c/p\u003e\n\u003cp\u003e*Boom!* The entire body of the Azure Mountain King transformed into a blue ray, and in an instant he streaked across the sky and disappeared. It was not until half an hour later that a few cowering low-ranked Warlocks emerged from the sea of corpses. Their faces registered horror, and they did not dare to shoot a single glance at the direction the Azure Mountain King before they swiftly escaped from the area. What had happened today would forever be a nightmare in their lives.\u003c/p\u003e\n\u003cp\u003eWest Sea Canyon.\u003c/p\u003e\n\u003cp\u003eThis was a rank 3 danger zone in the Parble Family’s territory. From the depths of the crevices, a hurricane that could obliterate anything in its path would appear. Any being below rank 4 would not have a chance at surviving the hurricane.\u003c/p\u003e\n\u003cp\u003eCurrently, Leylin was standing at the edge of the cliff. The strong winds caused his robes to flap in the wind.\u003c/p\u003e\n\u003cp\u003e*Jiu!* An ear-piercing explosive sound could be heard from a distance.\u003c/p\u003e\n\u003cp\u003ePure energy waves led to a chain reaction. Large amounts of air were displaced, instantly forming a vacuum.\u003c/p\u003e\n\u003cp\u003e*Thump!*The Azure Mountain King’s body landed on the floor steadily. His brows were furrowed as he levelled a deadly stare at Leylin. It seemed as if he was afraid that the minute he was distracted the sly Magus would escape like he did the previous time.\u003c/p\u003e\n\u003cp\u003e“To think that you still dare to appear before me. Am I supposed to clap for you at your bravery?” After the scanning with soul force, and upon confirmation that there were no Morning Star Magi lying in ambush, the Azure Mountain King caressed his own face. Even though the part of his face where Leylin had attacked previously did not have a mark, the humiliation still lingered on.\u003c/p\u003e\n\u003cp\u003eThe humiliation could only be wiped away with Leylin’s fresh blood!\u003c/p\u003e\n\u003cp\u003e“Why would I not have the guys to come?” Leylin laughed lightly, “You are but a clone who can’t make a breakthrough to the Morning Star realm… Furthermore, I’m the enforcer of this region. The crimes you’ve committed must be tried by me!”\u003c/p\u003e\n\u003cp\u003eObviously, Leylin could not divulge the news that all of the three chief Warlocks of the Ouroboros Clan had gone missing. As a result, he skillfully used his status as a smokescreen.\u003c/p\u003e\n\u003cp\u003eAs he was the enforcer of the region, after he had confirmed that he could not complete the task himself, the reinforcements from the headquarters took over.\u003c/p\u003e\n\u003cp\u003eThe Azure Mountain King was not a fool, and there was no guarantee of deceiving him. However, as long as he could arouse the Azure Mountain King’s suspicions, it would be considered a success.\u003c/p\u003e\n\u003cp\u003eIf there was a possibility that there were still Morning Star Magi present in the Ouroboros Clan, the enemies would not dare to be too unruly.\u003c/p\u003e\n\u003cp\u003eThe destructiveness of the killing tactics of a Morning Star Magus would definitely do both parties no good. Once a Morning Star Magus was pressured, he would disregard the peace treaties and begin to unbridledly utilise Morning Star Arcane Arts. The destruction that they could cause would be so immense that even Radiant Moon Magi would not be able to account for it.\u003c/p\u003e\n\u003cp\u003eIn other words, even if they were to successfully attack the Ouroboros Clan, the benefits they got might not even make up for the losses that they would suffer from the Morning Star Arcane Art.\u003c/p\u003e\n\u003cp\u003eMagi were not fools, and if the battle would not bring about benefits, and even potentially cause them to suffer losses, they would not be willing to engage in it.\u003c/p\u003e\n\u003cp\u003eIt was under such threats that those with the powers of a Morning Star Magus could peacefully co-exist in the central continent, which was also why there were rarely any large conflicts.\u003c/p\u003e\n\u003cp\u003eFrom Leylin’s understanding, a Morning Star Magus was equivalent to a nuclear weapon from his previous life. Countries with nuclear weapons could choose mutual destruction. As a result, they would tolerate each other, which was why the peaceful outlook could be sustained.\u003c/p\u003e\n\u003cp\u003eBut now? If outsiders got wind about how all of the nuclear weapons in the Ouroboros Clan were missing, then a calamity would be imminent.\u003c/p\u003e\n\u003cp\u003eAs a result, in front of the Azure Mountain King, Leylin presented himself as a high-ranking official who was very concerned about his honour.\u003c/p\u003e\n\u003cp\u003eBefore he was certain that the problem could not be handled, he had not requested for reinforcements from the headquarters. That would explain, though barely, why there was no response from the Morning Star Magi.\u003c/p\u003e\n\u003cp\u003eHe had done all that he could, and could not be bothered about how the Azure Mountain King would react to it.\u003c/p\u003e\n\u003cp\u003eSure enough, the Azure Mountain King was only thrown off for a while, before a mocking smile appeared on his face.\u003c/p\u003e\n\u003cp\u003e“Do you think I would believe your nonsense?”\u003c/p\u003e\n\u003cp\u003e“It’s up to you to believe it or not!” Leylin shrugged his shoulders, “But you will have to perish here today!”\u003c/p\u003e\n\u003cp\u003e*Rumble!* In an instant, as if to prove what he had said, the calm waves of the West Seas Canyon started to crash against the cliff.\u003c/p\u003e\n\u003cp\u003eAs a royal of the Ouroboros Clan, Leylin naturally had access to a lot of reading materials. Since the geological conditions of the West Seas Canyon were not a secret, that piece of information would have naturally have been recorded in the database of the A.I Chip.\u003c/p\u003e\n\u003cp\u003eAnd Leylin who wanted to keep the Azure Mountain King’s clone had immediately thought of the West Seas Canyon’s unique environment and the obliterating hurricane.\u003c/p\u003e\n\u003cp\u003eHis abilities were not on par with that of the opponent, and hence he needed external aid!\u003c/p\u003e\n\u003cp\u003eAfter serious inspections of the area, and upon using the A.I Chip to stimulate the eruption process of the West Seas Canyon, deducing the concrete timing was merely a matter of time.\u003c/p\u003e\n\u003cp\u003eAfter which it was the selection of a suitable timing to attract the Azure Mountain King\u003c/p\u003e\n\u003cp\u003eLeylin believed that due to the hatred the Azure Mountain King had towards him, once he discovered Leylin’s aura, he would definitely come forth.\u003c/p\u003e\n\u003cp\u003eSure enough, everything had worked out as he had expected.\u003c/p\u003e\n\u003cp\u003e*Howl!*\u003c/p\u003e\n\u003cp\u003eThe raging hurricane whistled like a giant black dragon, and it suddenly rushed towards the sky, spewing out its rage.\u003c/p\u003e\n\u003cp\u003eLeylin, who was standing in front of the raging flames, was like an ancient heroic knight riding upon a giant mystical creature.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-490\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-492\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-491","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
