{"id":59066,"no":510,"title":"Chapter 510","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Assuming the Post\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“It’s time to start the ceremony!” Parker’s tone conveyed his high spirits and excitement. He was wearing the suit of a compere, and his hair was sleekly styled.\u003c/p\u003e\n\u003cp\u003eHis previous investment at this time had gained him the most returns. Leylin was advancing at the speed of light, far beyond his own predictions. It made him feel like he was in a dream.\u003c/p\u003e\n\u003cp\u003eWith unanimous joyous cheers, Leylin stepped on the flower petals laid out on his path as he entered the hall, wearing a magical robe with a gold crown on his head.\u003c/p\u003e\n\u003cp\u003eAt the same moment, an overbearing and horrifying force similar to that of an ancient beast was slowly released from his body. From his eyes, one could faintly see the image of an enormous black serpent which was several tens of thousands of metres long.\u003c/p\u003e\n\u003cp\u003eMorning Star! The formidability of a true Morning Star made many Magi and Warlocks bow their heads respectfully to welcome him. Some of the sullen emissaries were also so overwhelmed by his aura that they too bowed, albeit rather unwillingly.\u003c/p\u003e\n\u003cp\u003e“In accordance with the rules, Warlocks of the Ouroboros Clan who are promoted to the Morning Star realm will fundamentally acquire the noble title of a Duke! Congratulations to you, Duke Farlier!”\u003c/p\u003e\n\u003cp\u003eFaisal stepped up and ceremoniously handed a snake-shaped scepter embedded with jet black crystals to Leylin, who accepted it effortlessly and raised it up.\u003c/p\u003e\n\u003cp\u003eNumerous bloodline Warlocks stood up and bowed in salutation, “ Greetings, Duke Leylin!”\u003c/p\u003e\n\u003cp\u003eThis was a tradition of the Ouroboros Clan, something shared by many other Magus organisations. Yet, for Faisal himself to do it meant that Leylin had already succeeded in suppressing internal strife. Seeing this unfold, many influential emissaries were left in deep thought.\u003c/p\u003e\n\u003cp\u003e“The ceremony shall begin!” Parker yelled after Leylin was seated.\u003c/p\u003e\n\u003cp\u003e“The emissary from the Rustic Woodlands— Louis greets Duke Leylin!” An old fellow dressed in a red suit took the lead and saluted Leylin.\u003c/p\u003e\n\u003cp\u003e“The Lord’s promotion to the Morning Star is a grand occasion for all of us in the central continent. This is a gift from our Master!”\u003c/p\u003e\n\u003cp\u003eThe entourage standing behind him lifted the cloth off a tray to reveal a rock shimmering with brilliance.\u003c/p\u003e\n\u003cp\u003e“An astral stone!” “Such a huge astral stone is rare indeed!” “The Rustic Woodlands is so magnanimous!”\u003c/p\u003e\n\u003cp\u003eThe comments from the surrounding visitors were incessant.\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head and smiled, evidently very pleased. Such opportunities to receive free gifts without obligations were always welcomed.\u003c/p\u003e\n\u003cp\u003e“I have just been promoted to the Morning Star, and my need for astral stones is undeniable. Thank your Master on my behalf!” Leylin expressed his contentment, and the emissary was delighted. He bowed again and retreated.\u003c/p\u003e\n\u003cp\u003e“Duke Leylin! I am the emissary from the Fallor Family, and I present to you a personalized private ride— the Colossal Serpent!”\u003c/p\u003e\n\u003cp\u003eAnother emissary stepped forward and presented a core controller. In the middle of it, an image of a private airship could be seen. The detailing and ornamentation of the warship structure were vivid and thorough.\u003c/p\u003e\n\u003cp\u003e“That is very considerate of you!” Leylin nodded his head.\u003c/p\u003e\n\u003cp\u003eThe Fallor Family controlled the entire airship network. They also had the support of the Monarch of the Skies, and gifting every newly promoted Morning Star their very own airship was their tradition. As such, Leylin voiced, ”I thank the kindness of chief Fallor and the Monarch of the Skies…”\u003c/p\u003e\n\u003cp\u003ePerceiving Leylin to have understood their intentions, the emissary respectfully bowed and retreated. Almost immediately, yet another emissary stepped forward….\u003c/p\u003e\n\u003cp\u003eThe etiquette for this ceremony was complicated, but Leylin still had to receive them one by one and express his own goodwill. It would be extremely important and beneficial for the Ouroboros Clan.\u003c/p\u003e\n\u003cp\u003eLeylin was brimming with enthusiasm and was all smiles. He conversed casually with many of the emissaries with ease, showing no impatience.\u003c/p\u003e\n\u003cp\u003eAt this time, a Magus with a head of brown hair who was wearing a silver robe stepped forward. Impressive undulations emitted from his body without restraint. He clearly lacked manners, and was disrespectful in front of Leylin.\u003c/p\u003e\n\u003cp\u003e“You’ve come with ill intentions!” Leylin’s eyes narrowed and he glared at the Magus.\u003c/p\u003e\n\u003cp\u003e“Greetings, my Lord, from Collins of Jupiter\u0027s Lightning!” Collins straightened his back and looked straight into Leylin’s eyes without a hint of fear.\u003c/p\u003e\n\u003cp\u003e“Collins is one of the more able ones in Jupiter’s Lightning. He clearly wants to test Leylin’s strength as a baseline comparison…” Paul remarked from the side, smiling at Philip with a wineglass in hand.\u003c/p\u003e\n\u003cp\u003e“Collin’s abilities are not comparable to Cyril’s. Shall we give him a helping hand?” Philip rubbed his fist, his eyes glistening with ambition.\u003c/p\u003e\n\u003cp\u003e“There’s no need! Duke Leylin is very powerful, do not ever underestimate him!” Paul’s dead-fish eyes glimmered with a smile.\u003c/p\u003e\n\u003cp\u003eThe atmosphere inside the hall didn’t seem right. All the emissaries’ eyes were locked on the confrontation between the two Morning Stars.\u003c/p\u003e\n\u003cp\u003eSince it was a celebration, Leylin and Collins did not go overboard. On the surface, it looked like they were just staring at each other in the face. However, a ruthless cross-sword fight between the spiritual domains had already unfolded unknowingly.\u003c/p\u003e\n\u003cp\u003eA few minutes later, the colour started to drain from Collins’ confident face, and beads of sweat appeared on it.\u003c/p\u003e\n\u003cp\u003eWitnessing the scene, the other Magi thought they had seen a ghost. Paul and Philip exchanged glances, and both broke out in smiles.\u003c/p\u003e\n\u003cp\u003e“Oh!” A moment later, Collins scathingly stumbled a few steps back. Although there were no differences in his expression, the imposing aura on his body had disappeared.\u003c/p\u003e\n\u003cp\u003eLeylin, on the other hand, continued to sit upright. No one could tell what he had in mind.\u003c/p\u003e\n\u003cp\u003e“This is a present from our chief!” Collins no longer dared to look Leylin in the eye as he presented the gift. Soon after, he left in haste.\u003c/p\u003e\n\u003cp\u003eAll the Magi who witnessed this silent confrontation grew more fervent about Leylin.\u003c/p\u003e\n\u003cp\u003eThe revelry lasted until midnight. After receiving bountiful gifts, Leylin began conversing about his experience during his advancement.\u003c/p\u003e\n\u003cp\u003eIt was, in a way, his means of imparting knowledge. Many of those present were rank 3 Magi after all.\u003c/p\u003e\n\u003cp\u003eLeylin was forthcoming, pointing out mistakes made during the construction of the point mass, as well as other general tips. Many rank 3 Magi were intoxicated by this essential information, and even some Morning Stars fell into deep thought. When it was time to disperse, many felt reluctant to leave.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter the banquet was over, Leylin chose not to rest, and instead, headed out to meet another guest in a private room.\u003c/p\u003e\n\u003cp\u003e“Distinguished Azure Mountain King, we meet again!” Leylin smiled calmly and sat opposite the Magus.\u003c/p\u003e\n\u003cp\u003eThe person here was certainly the Azure Mountain King. He possessed the same appearance as his clone, with blue hair and a pair of starry eyes.\u003c/p\u003e\n\u003cp\u003eHe had not come to this ceremony representing Azure Mountain City, and instead snuck in on the pretence of a diplomatic mission. He’d felt threatened by Leylin.\u003c/p\u003e\n\u003cp\u003e“You can call me Zack!” The Azure Mountain King spoke in a deep tone, without any further intentions of undermining Leylin.\u003c/p\u003e\n\u003cp\u003e“Alright, distinguished Zack, let’s talk about the compensation that you have to make with regards to my territory!”\u003c/p\u003e\n\u003cp\u003eLeylin leant back on the sofa, intertwined his hands. He was unusually relaxed. Opportunities for such extortion, where one took advantage of another’s weakness, were very rare.\u003c/p\u003e\n\u003cp\u003e“Sure! Your people, your land, and any other losses, I’ll pay you for it all. I’ll even pay double, as long as you promise not to leak the matter of the stardust bugs!” Zack said frankly.\u003c/p\u003e\n\u003cp\u003eHe only yielded to Leylin as Leylin knew his biggest secret. If this information was leaked out, the entire Oakheart Clan would be faced with imminent disaster. Even his own life would be in danger.\u003c/p\u003e\n\u003cp\u003eLeylin was well aware of this. But he also knew that the destruction of the Oakheart Clan, and the fall of the Azure Mountain King, would not net him any benefits. On the other hand, such extortion had the potential for a lot of profits.\u003c/p\u003e\n\u003cp\u003eAs such he didn’t mind letting Zack leave… as long as he paid his due, of course.\u003c/p\u003e\n\u003cp\u003e“Let’s not talk about the territory for the time being, you destroyed my Magus Tower. Shouldn’t you compensate me with another?” Leylin laughed with a hint of profoundness.\u003c/p\u003e\n\u003cp\u003e“Consider it done! I will build you one that is exactly the same!” the Azure Mountain King replied with a rich and overbearing tone.\u003c/p\u003e\n\u003cp\u003e“Oh! No, no, no! I think you misunderstood something…” Leylin swayed his finger, ” What I need, is a Magus Tower that corresponds to my current status. Do you understand?”\u003c/p\u003e\n\u003cp\u003e“What…” Zack took a cold breath, and immediately blurted out, “Impossible! This is extortion!”\u003c/p\u003e\n\u003cp\u003eAlthough Leylin’s previous Magus Tower was of considerably high quality, it was only fitting for a rank 3 Magus. In the central continent, anything that catered to the Morning Star rank would cost more, especially so for the Morning Star Magus Tower!\u003c/p\u003e\n\u003cp\u003eThe construction cost of a Morning Star rated Magus Tower would be at least ten times more than that of Leylin’s previous Magus Tower. Even if he were to sell his territory, it could not even cover the cost of building one level of it. Leylin’s request was like a lion biting a huge chunk of meat off the Oakheart Clan’s body.\u003c/p\u003e\n\u003cp\u003eBased on Zack’s proposed bill of compensation, the Oakheart Clan wouldn’t suffer a huge loss. But to build a Morning Star rated Magus Tower? Even if Leylin were to decline all the other compensations, this request alone would still be outrageous.\u003c/p\u003e\n\u003cp\u003e“Indeed, I am extorting you. Didn’t you know?” Leylin mockingly laughed.\u003c/p\u003e\n\u003cp\u003e“Compared to the matter about the stardust bugs and the whole Oakheart Clan being erased from this world, I think it’s a good deal… With the accumulated wealth of Azure Mountain City, there should be no difficulty in constructing one such Magus Tower, right?”\u003c/p\u003e\n\u003cp\u003eBeing reprimanded by Leylin, Zack’s face hardened as he gritted his teeth in anger, ”… Fine!”\u003c/p\u003e\n\u003cp\u003e“That’s the way!” Leylin smirked, obviously pleased. His expression immediately turned from one of hostility to that of friendliness, and this made Zack perplexed.\u003c/p\u003e\n\u003cp\u003e“Other that the Magus Tower, I have no other requests, so long as you assist me in building an astral gate…”\u003c/p\u003e\n\u003cp\u003eHaving sensed the limits of Zack’s tolerance, Leylin naturally and pursued further benefits without scruples. After all, Zack wouldn’t suddenly appreciate him if he lowered his requests, so he could just as well get a hold of as many benefits as possible.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-509\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-511\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-510","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
