{"id":59085,"no":529,"title":"Chapter 529","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eObstruction And A Grin\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“No! No matter what, I have to get it back!” The old man took out his light yellow notebook. A map with many black dots appeared on it immediately.\u003c/p\u003e\n\u003cp\u003e“Find him! Rip him apart! And bring everything back!” Following the old man’s growl, streaks of crystal-clear light flashed in the secret chamber and a few translucent puppets suddenly widened their bloodshot eyes.\u003c/p\u003e\n\u003cp\u003eAs if they understood the old man’s words, they rapidly shuttled through the void, gradually vanishing.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“This feeling, something bad’s about to happen!” Leylin’s eyebrows furrowed. He’d actually been feeling a sense of discomfort ever since he exited the Path of Quandary. It was as if someone was secretly spying on him. However, the scanning of the A.I. Chip and his own soul force could not discover anything.\u003c/p\u003e\n\u003cp\u003eAnd now, this feeling of discomfort suddenly intensified, even to the point of turning to anxiety!\u003c/p\u003e\n\u003cp\u003e“The malice that’s pervaded the atmosphere...” Leylin shut his eyes and quickly opened them again. At this moment, his pupils had already turned into a pair of amber slits. A thin, blood-red line flashed across them.\u003c/p\u003e\n\u003cp\u003eSuddenly, rumbling sounds rang out as a large amount of spell runes flickered. A colourful radiance shot into the sky and formed a gigantic ice cage, trapping Leylin within.\u003c/p\u003e\n\u003cp\u003e“What? I definitely didn’t trigger any traps… Unless…” Leylin squinted his eyes slightly. This situation caused him to become clear-headed.\u003c/p\u003e\n\u003cp\u003e“Haha… I, who have gained control over the entire core secret chamber, am an invincible existence in Scarlet Crescent!” In the core control room, the old Magus’ face shone brightly, his hands still grasping a piece of ruby with its tips connected to numerous crystal threads.\u003c/p\u003e\n\u003cp\u003eStrings of complicated commands were continually transmitted through the ruby in his hands.\u003c/p\u003e\n\u003cp\u003eNumerous crystal-clear hexagonal snowflakes suddenly condensed within the trap, forming a large quantity of icy blades, shields, axes and such. They all smashed loudly towards Leylin’s head.\u003c/p\u003e\n\u003cp\u003eLeylin thought of an idea. “Kemoyin’s Scales!” “Blood Flame!” His body was immediately wrapped in a layer of dense, black snake scales as a blood-red flame raged above him, subliming the large quantity of ice.\u003c/p\u003e\n\u003cp\u003eAs if it was provoked, the ice condensed once more with a sizzle. Its blue core became even more crystal-clear, emanating a piercing chill.\u003c/p\u003e\n\u003cp\u003eThe ice, which was covered by the blue radiance, stood firmly while it was being roasted by the flames. A large quantity of cold air was emitted, even breaking through the Blood Flame’s seal. It shot in front of Leylin, who smashed it apart with a frown.\u003c/p\u003e\n\u003cp\u003eSharp icy blades slashed his body, only enough to create thin, long sparks. They couldn’t even break through the outermost energy defence.\u003c/p\u003e\n\u003cp\u003e“Absolute Zero Kelvin!” Leylin’s pupils narrowed and his face no longer had the previous relaxed look.\u003c/p\u003e\n\u003cp\u003e”This was undoubtedly set up by ancient Magi. Such a formation that unifies all the runes in the area is definitely difficult for ordinary Morning Stars to withstand… However, It doesn’t seem to be working at full force… That means…”\u003c/p\u003e\n\u003cp\u003eLeylin seemed to be in a deadlock with the huge icy spell formation on the surface. However, he was actually calculating something in his mind.\u003c/p\u003e\n\u003cp\u003e*Whoosh!* Suddenly, space twisted and a few rays of white light seemed to have broken through the boundary as they appeared right before Leylin.\u003c/p\u003e\n\u003cp\u003eThe handle, which bore the sharp broken sword, had already pierced the edge of Leylin’s chest.\u003c/p\u003e\n\u003cp\u003e“So fast!” It was difficult for Leylin to react in time. The only thing he managed to do was strengthen the Kemoyin Scales’ defence to the maximum.\u003c/p\u003e\n\u003cp\u003eCompared to other spells, the innate spells of Magi were activated purely by thought. With such incomparable speeds, they were the common last-ditch resorts when their lives were in danger.\u003c/p\u003e\n\u003cp\u003e*Schlick!* A broken sword, seemingly forged out of pure crystal, pierced through the energy defence as well as the runes outside the black scales with much difficulty, coming into contact with the scales themselves.\u003c/p\u003e\n\u003cp\u003e*Pop!* Leylin frowned, as if at something bursting. Behind him, a large Multi-Armed Race phantom came into existence and channelled a dark green energy to cover his body.\u003c/p\u003e\n\u003cp\u003e“My goodness!” The muscles on his right hand flexed, hammering a punch at the opponent. This made the translucent figure retreat.\u003c/p\u003e\n\u003cp\u003eAfter waiting for the opponent to put a certain amount of distance between them, Leylin looked at his chest with a gloomy face.\u003c/p\u003e\n\u003cp\u003eA bright white line in the shape of a crescent had been carved on the Kemoyin Scales. The sword had left behind a deep pit, taking a few smaller scales with it.\u003c/p\u003e\n\u003cp\u003e“Puppet?!” When Leylin got a clear view of the figures making a sneak attack, he shouted in surprise.\u003c/p\u003e\n\u003cp\u003eIn front of him were a few translucent figures in pure white, body-fitting Magus robes. In their hands were a large quantity of physical weapons, including the broken crystal sword from before.\u003c/p\u003e\n\u003cp\u003e“A puppet that is able to break through my Kemoyin’s Scales defence, such a rank… I’m afraid can only be created by an ancient Magus…”\u003c/p\u003e\n\u003cp\u003eLeylin looked at the bloodshot eyes of the puppet before him, confirming his conjecture, ‘Someone’s behind all this.’\u003c/p\u003e\n\u003cp\u003e“So this is the power of a Morning Star? Even the Void Assassin could not take down the opponent!” In the core, the old man’s dignified face warped as he clenched his teeth.\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter. I have the spell formations to control the core and the puppets on hand. Even if it takes up a little more energy, I have to take down the enemy!”\u003c/p\u003e\n\u003cp\u003eWith his orders, the arms of the Void Assassins surrounding Leylin warped, revealing daggers, knives, and even weapons that looked like power saws. They were all translucent except for the golden runes twinkling on them, seemingly made from crystal.\u003c/p\u003e\n\u003cp\u003eSpace twisted once more as these Void Assassins vanished into thin air again. It was as if they were vipers hiding in the dark, preparing to deal a fatal blow at any time!\u003c/p\u003e\n\u003cp\u003eWith these enemies around eyeing covetously at their prey, in addition to the pressure of the icy cage above their head, any ordinary Morning Star would definitely have sustained serious injuries.\u003c/p\u003e\n\u003cp\u003e“It’s a pity that you met me!” A sneer emerged at the corner of Leylin’s lips. Wasn’t the shadow-attribute Giant Kemoyin Serpent even better at concealing itself in the void? He’d previously used spells such as Shadow Stealth to lay in ambush, and he naturally knew about the weaknesses and disadvantages of such spells like the back of his hand.\u003c/p\u003e\n\u003cp\u003eAlthough the ancient spell formation was a little more troublesome, the enemy evidently did not have complete control over it. This gave him an opportunity.\u003c/p\u003e\n\u003cp\u003e“Only…” Leylin laughed coldly as a radiance sparkled in his eyes.\u003c/p\u003e\n\u003cp\u003eA translucent figure shot out from the void with a whoosh, the dagger in its hands aimed ferociously at Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003eLeylin’s face remained unchanged and he suddenly stretched out his wrist. When it came to a stop once more, he was holding one of the puppet’s arms in his hands.\u003c/p\u003e\n\u003cp\u003eA gigantic blue iceberg, with a great blazing flame at its bottom, started to exert pressure on everything below as it rumbled. At the same instant, a sharp aura suddenly shot out in the other three directions.\u003c/p\u003e\n\u003cp\u003e“Good! Very soon, that thing will belong to me…” In the control room, the old man watched a pale Leylin. Looking at his wounded body, he could not help but let out a carefree smile.\u003c/p\u003e\n\u003cp\u003e“Haha… So what if you’re a Morning Star? I’m the king here!” The old man spread out his arms and cheered, but his voice was instantly silenced with a grunt, as if he had been strangled at the neck.\u003c/p\u003e\n\u003cp\u003eWhen it came back, it returned as a frustrated curse, “How did he escape?”\u003c/p\u003e\n\u003cp\u003eIn the projection he’d been looking at from the control room, Leylin’s condition had already hit rock bottom. His entire body was soaked in blood, and he seemed ready to die at any moment. However, every opportunity to kill him was thwarted by small problems in the coordination of the Void Assassins, letting him evade it by luck. At least, that’s what he’d seen it as.\u003c/p\u003e\n\u003cp\u003eAnd right when he was in the most desperate straits, that lucky Magus had actually discovered a flaw in the spell formation, directly breaking through space and escaping.\u003c/p\u003e\n\u003cp\u003eThe old man roared in anger, smashing his fist violently on the platform of the control room with a bang.\u003c/p\u003e\n\u003cp\u003e“If I had known all the control spells, and obtained the highest authority, even a Radiant Moon Magus wouldn’t be able to escape this place, let alone this Morning Star!” What followed the bout of rage was a sense of helplessness.\u003c/p\u003e\n\u003cp\u003eIndeed, he’d used his map and reached the control room, obtaining partial authority by following his ancestor’s notes. In fact, he didn’t encounter much danger at all. However, his ancestor did not have a high position in Scarlet Crescent. This naturally meant he had no way to gain complete control of the place.\u003c/p\u003e\n\u003cp\u003eThat previous spell formation was actually the limits of what he could accomplish with his current authority. As for those Void Assassins, he had to thank the fact that their creator was none other than his ancestor. That was why he had a backdoor method to take control of them.\u003c/p\u003e\n\u003cp\u003e“Damn! Damn! DAMN!” The old man’s face was full of indignance, “Just these Void Assassins have already made this trip worthwhile, but the most important item is still not in my hands. Not to mention, this place will definitely be monopolised by great forces in the future. I’ll no longer have a place here…”\u003c/p\u003e\n\u003cp\u003eHe subconsciously shot a glance at the other black dots. They were already very close to the core area, especially the one that represented the Radiant Moon. It seemed to have an unstoppable force, barging its way through and already sweeping past several small-scaled resource points, making the Magus secretly hurt.\u003c/p\u003e\n\u003cp\u003eSuch desire and the strong indignance led this Magus to a decision, “Try again, no matter the result, you have to leave!”\u003c/p\u003e\n\u003cp\u003eHe looked at another screen, pressing the jewel down without hesitation. A huge flame exploded forth, forming an enormous blazing giant that blocked Leylin’s path.\u003c/p\u003e\n\u003cp\u003e“So it’s fire after ice? But it’s still of the same degree of power as the previous one…” Leylin shook his head, becoming more confident in his judgement.\u003c/p\u003e\n\u003cp\u003e“Catch him! Catch him!” The old Magus grabbed the jewel with both hands, his eyes full of excitement and desire.\u003c/p\u003e\n\u003cp\u003eAnd at this time, Leylin, who was on the screen, suddenly lifted his head and laughed at him. The old man’s hair stood on end…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-528\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-530\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-529","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
