{"id":59093,"no":537,"title":"Chapter 537","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eBlood-sucking Loach\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e‘A.I. Chip, begin scan! Keywords: Soul force, high-grade meditation technique.’\u003c/p\u003e\n\u003cp\u003eThankfully, Leylin had the A.I. Chip which was fused with his soul. It responded instantly to his thoughts, [Beep! Mission established, starting scan!]\u003c/p\u003e\n\u003cp\u003eSoon enough, a blue display was projected in front of his eyes, showing a very long list. Leylin gathered himself and started looking through the information carefully.\u003c/p\u003e\n\u003cp\u003e“High-grade meditation technique—Void Phantom: Five layers in total and complete. As long as…”\u003c/p\u003e\n\u003cp\u003e“Ancient soul force Arcane Art— Multi-luster Sacrificial Rite: Able to strengthen soul force and improve the power of spells that are rank 4 and above by 50%, all in exchange for the egg of a Nefarious Filthbird!”\u003c/p\u003e\n\u003cp\u003e“Crystallised soul force: 500g of the crystallised soul force of a Morning Star in exchange for astral stones of the same quality!”\u003c/p\u003e\n\u003cp\u003e“Ancient Bloodline— Offspring of the White-scaled Illusory Tiger: Not only can it keenly sense soul force, a contract with it has the extraordinary effect of strengthening the soul. Prices to be negotiated face to face!”\u003c/p\u003e\n\u003cp\u003eThe large amounts of data dazzled Leylin, every item on the screen nearly causing him to salivate. He realised then that he was poor. He was way too poor!\u003c/p\u003e\n\u003cp\u003eWhether they were from his plunder of Twilight Zone or his other sources of wealth, his resources that could originally be sold off at astronomical prices were dispensable to Morning Stars.\u003c/p\u003e\n\u003cp\u003eOther things, such as his bloodline refinement method and the data on Quicksand’s experiments could not see the light of day.\u003c/p\u003e\n\u003cp\u003eLeylin suddenly found that the only things he could take out to sell were the astral stones he’d appropriated from the clan treasury.\u003c/p\u003e\n\u003cp\u003e“This won’t do! I need to find a source of revenue as soon as possible!” Leylin watched the items on the screen, eyes turning slightly red.\u003c/p\u003e\n\u003cp\u003eThese Morning Star Warlocks had gathered too many amazing items. As long as he obtained a portion of any of them and hand it over to the A.I. Chip to experiment with, the progress on the analysis of soul force would definitely increase rapidly. This was very important to him.\u003c/p\u003e\n\u003cp\u003e“But… a source that suits a Morning Star, and it needs to be regular as well…”\u003c/p\u003e\n\u003cp\u003eHe found himself in a bind. Other Warlocks would surely have taken such sources over already, how would he get a chance? His only option was to think up a brand new source of income.\u003c/p\u003e\n\u003cp\u003eLeylin flipped through the pages absent-mindedly, and finally found some things he was interested in.\u003c/p\u003e\n\u003cp\u003e“Teleportation required: I need to reach Sunset Mountains within three days. If any friends have teleportation points, please contact me. Prices are negotiable!”\u003c/p\u003e\n\u003cp\u003e“Requesting help: Rebellion by Marine Dragon Whales at the East Region. Need at least three Morning Stars to suppress them. Each will be guaranteed a minimum of 1000g of astral stones, and additional rewards will be given to those who capture their enemies…”\u003c/p\u003e\n\u003cp\u003e“Assistance required in attacking the Mage Basin. Once conquered, offering 5% of their yearly profit!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAll sorts of conscients gathered at the other end of the trade area, communicating rapidly. The deals were near-instant.\u003c/p\u003e\n\u003cp\u003e“If there isn’t anything else, I’m afraid I’ll have to take on some missions here, becoming a mercenary of sorts…”\u003c/p\u003e\n\u003cp\u003eFace grim, Leylin followed a thread of information to a dark conscient, “May I know if Sire here is selling high-grade meditation techniques?”\u003c/p\u003e\n\u003cp\u003eFloating in front of Leylin was a bundle of black light. An extreme darkness full of terrifying energy converged on it. Though it was merely a conscient, it was still enough to cause Leylin to feel fear.\u003c/p\u003e\n\u003cp\u003e“En!” The other party answered unwillingly, as if not really interested in this deal. Unlike other items, this sort of knowledge and special techniques could be sold off multiple times and not even at a very high price, which was Leylin’s first target.\u003c/p\u003e\n\u003cp\u003eAfter all, he had already gained a top-grade meditation technique, Wing of the Sun. With this one, as well as the other accumulations from before, the A.I. Chip’s research would reach a whole new level and he could obtain more information.\u003c/p\u003e\n\u003cp\u003e“May I know the price?” Leylin calmed down, readying himself to negotiate with the other party. He did not have a lot of astral stones, and there were a lot of good resources here. He needed to be frugal.\u003c/p\u003e\n\u003cp\u003eBesides, the requirements listed by the other conscients were just unbelievable. Even Leylin could not take it, especially the one asking for the egg of the Nefarious Filthbird. He’d blacklisted that choice right away.\u003c/p\u003e\n\u003cp\u003eThe Nefarious Filthbird and Trial’s Eye were at the same level and had the ability to traverse worlds. How could it be of equal value to an ancient Arcane Art?\u003c/p\u003e\n\u003cp\u003eJust thinking of this, Leylin felt that they were crazy. As for the soul force crystals, he could just produce himself. They weren’t all that useful anyway.\u003c/p\u003e\n\u003cp\u003eIn general, since there was news of people hoping for an exchange, they obviously wanted to sell items off at a higher price. Hence, very few deals were made in this trading area. Most of the idle soul forces and conscients lazed around here, and once they saw a cheaply-priced trade, immediately pounced forth like a bunch of sharks that smelt blood.\u003c/p\u003e\n\u003cp\u003eMorning Star Warlocks were erudite, and also had the detective ability that soul force offered them. Each and every one of them was old and sly, and while it was not impossible to get pick up cheap gains, the effort and time one needed to put into it was too much.\u003c/p\u003e\n\u003cp\u003eThis was the conclusion Leylin came up with after surveying the scene multiple times. Hence, he gave up on the thought of picking up cheap deals and began to trade honestly.\u003c/p\u003e\n\u003cp\u003e“My Void Phantom not only has five complete levels, but also includes an affinity to the element of illusion. It’s at an unconditional price of 5000g of astral stones!” The dark conscient didn’t seem to care if Leylin actually wanted to purchase it.\u003c/p\u003e\n\u003cp\u003e“Mm! However, its requirements for the users is too high. Besides, we’re all Warlocks. The high-grade meditation techniques of Magi are only for reference, which makes your price too…” Leylin frowned. With his knowledge of high-grade meditation techniques, just a few casually-thrown-out sentences caused the conscient to begin hesitating.\u003c/p\u003e\n\u003cp\u003e“Furthermore, haven’t you sold this meditation techniques many times already? How can it have the same price as before?” Realising he had a chance, Leylin immediately attacked.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter a complicated negotiation similar to the business deals in his previous world, Leylin finally bought the high-grade meditation technique, Void Phantom, at a low price just like he wanted to. However, the astral stones he had gotten from the headquarters of the Ouroboros Clan had been practically halved in that instant.\u003c/p\u003e\n\u003cp\u003eHe calculated it all carefully. The real wealth was definitely on the three dukes, and all that was left in the headquarters were merely scraps.\u003c/p\u003e\n\u003cp\u003eLeylin had too few astral stones left on him after buying the meditation technique. He took a look around, and upon finding nothing special quickly found a little corner, his soul force withdrawing from the Morning Star area.\u003c/p\u003e\n\u003cp\u003e“Hah…” In the headquarters of the Ouroboros Clan, at the core laboratory in the technological department, Leylin gave a long huff and observed the black crystal in his hands.\u003c/p\u003e\n\u003cp\u003e[Beep! High-grade meditation technique Void Phantom has been recorded. Saved into database under high-grade meditation techniques] The A.I. Chip’s emotionless voice sounded.\u003c/p\u003e\n\u003cp\u003e“Very good!” Seeing the progress bar that was now progressing again, Leylin’s heart that had been aching was finally consoled.\u003c/p\u003e\n\u003cp\u003eHe left the technical department and came before the bloodline laboratory from before.\u003c/p\u003e\n\u003cp\u003eThis was the core laboratory of the Ouroboros Clan, and only the three Morning Stars were allowed access to it. Of course, after Leylin took over, he had used this as his own laboratory. The experiment on the revitalisation of the Sun’s Child bloodline had been performed here.\u003c/p\u003e\n\u003cp\u003e“Tower genie, how’s the situation with the specimens?” Leylin asked.\u003c/p\u003e\n\u003cp\u003e“The specimens are currently doing well. The number of surviving blood-sucking loaches is being kept at 20 and above, and they have consumed 32.7 tons of culture fluid.”\u003c/p\u003e\n\u003cp\u003eThe tower genie projected a series of data in front of Leylin, to which he nodded his head. At the beginning, the blood-sucking loaches’ numbers had rapidly dwindled, but after the other specimens had gotten used to the bloodline of the Sun’s Child, they could finally survive for a longer time. At this point, a decent number of them could remain alive at a time.\u003c/p\u003e\n\u003cp\u003eLeylin came to the cultivation pool from before.\u003c/p\u003e\n\u003cp\u003eThe liquid in the pool had already turned a dark green, with occasional streaks of gold flashing underwater. It had also expanded tenfold from before.\u003c/p\u003e\n\u003cp\u003eWater splashed everywhere, and a golden monster jumped out to bite at Leylin, its mouth full of sharp teeth. It was even spitting out flames!\u003c/p\u003e\n\u003cp\u003e*Tsss!* Before the flames could reach him, they were blocked by a layer of white light. Black lightning grouped together to form a large hand, slapping it back into the water.\u003c/p\u003e\n\u003cp\u003e“Mm! It’s very lively!” Leylin chuckled, judging this mutated blood-sucking loach.\u003c/p\u003e\n\u003cp\u003ePerhaps, calling them blood-sucking loaches was no longer suitable, since what was in front of Leylin was a whole new species that had gone through the stimulation from the bloodline of the Sun’s Child.\u003c/p\u003e\n\u003cp\u003eIt had expanded in size by ten times and was full of golden scales. There was even a strange horn-like thing on the head, and it had scarlet eyes and sharp teeth below. It growled, on the offensive.\u003c/p\u003e\n\u003cp\u003eAs if the attack had given rise to some chain reaction, multiple golden streaks jumped out from under the water with a splash, beginning to attack each other and roaring. Some of these loaches had grown a pair of sharp claws at the stomach area and were unusually ferocious as they launched attacks at their own kin.\u003c/p\u003e\n\u003cp\u003e“The offensive abilities of the blood-sucking loaches has increased by a large amount. Every time there’s a bloody battle like this, the surviving blood-sucking loaches will gain even more strength. The most powerful blood-sucking loach is estimated to survive for 45 days and 21 hours. Its bloodline was from a blood-sucking loach king…” The tower genie introduced by Leylin’s ear.\u003c/p\u003e\n\u003cp\u003e“Is it this one?” Leylin had noticed the golden blood-sucking loach right at the centre. It had already bore no semblance to its previous form, and had grown to become a more powerful being. Flowing scales covered its entire body like a layer of smooth liquid. The bloodied look in its eyes had not ebbed, but it now seemed to have some intelligence.\u003c/p\u003e\n\u003cp\u003eAfter observing for a while longer, Leylin ordered, “That’s enough. Prepare the next phase!”\u003c/p\u003e\n\u003cp\u003e*Rumble!* The ceiling above the cultivation pool suddenly opened, and some mysterious fluids were poured in from a translucent crystal container.\u003c/p\u003e\n\u003cp\u003eAs if it had been exposed to a stimulant, even the largest blood-sucking loach immediately immersed itself in this ‘civil war.’\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-536\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-538\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-537","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
