{"id":59102,"no":546,"title":"Chapter 546","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Rank\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIt was the early morning and the air was refreshing, a situation that seldom occurred. Even the lava rivers weren’t boiling hot right now.\u003c/p\u003e\n\u003cp\u003eThe large black city gates opened slowly, and a small caravan made its way through.\u003c/p\u003e\n\u003cp\u003eWithin the caravan were many black one-horned clansmen. Their mode of transport was a giant creature that looked like a snail. Their shells towered high, a few openings in them made expressly for the easy retrieval of items.\u003c/p\u003e\n\u003cp\u003eThere were no goods in the huge shell of the largest mount, and only a space that was specially cleared for Leylin to sit in, with his legs crossed.\u003c/p\u003e\n\u003cp\u003eThough this snail’s movements weren’t especially quick, it was advantageous in that there were practically no jolts from the travel. Even the temperature of this place was different from that of the surroundings, and it left Leylin feeling very satisfied.\u003c/p\u003e\n\u003cp\u003eAt the thought of the unwillingness to part on Uma’s face, as well as Wook\u0027e and Wook\u0027bo\u0027s stunned expressions, Leylin had the urge to laugh.\u003c/p\u003e\n\u003cp\u003eHe had no plans on interfering with matters relating to other races. That ‘Intellectual One’ had also known from the aura undulations that Leylin had intentionally emanated, that he was not to be provoked, and did not want to keep a time bomb like Leylin around.\u003c/p\u003e\n\u003cp\u003eHence, everything clicked together. The one-horned race immediately agreed to bring Leylin along on their next travel. With the travelling merchants as the guide, they brought Leylin to a bigger city.\u003c/p\u003e\n\u003cp\u003eIn all honesty, compared to the city where many different races lived together in harmony, the black city that the one-horned race had built was like a town in the countryside.\u003c/p\u003e\n\u003cp\u003e“Woking City! The largest city in the Blazing Thorn Land. I hope it won’t let me down!” Leylin’s eyes flashed with a glint that nobody could see through, while his hands began to move quickly.\u003c/p\u003e\n\u003cp\u003eLarge amounts of Magus materials were fished out of his spatial ring and arranged to form a small-scale spell formation.\u003c/p\u003e\n\u003cp\u003eThe whole process was covert, and not the slightest sound was made. It was not just the one-horned beings outside. Even the snail that Leylin was sitting on did not feel it.\u003c/p\u003e\n\u003cp\u003e*Buzz…* An extremely slight undulation that only Morning Star ranked Kemoyin Warlocks could detect was transmitted into the distance.\u003c/p\u003e\n\u003cp\u003e“Go!” Two dull spiritual flames appeared on Leylin’s hands, quickly disappearing into the spell formation.\u003c/p\u003e\n\u003cp\u003eFollowing that, Leylin closed his eyes, a thread of soul force linking with the spell formation. His mind seemed to pass through the snail shell and arrive outside, spreading further.\u003c/p\u003e\n\u003cp\u003eA long while later, Leylin opened his eyes and shook his head.\u003c/p\u003e\n\u003cp\u003e‘It still isn’t working! This is the limit of what I can do. I’m afraid the two Dukes aren’t in this region…’ Leylin sighed, his expression complicated.\u003c/p\u003e\n\u003cp\u003eA world was much too large. It could be said that the Lava World far surpassed the central continent in terms of surface area. To find two people in such a large area, a needle in a haystack couldn’t even begin to describe it.\u003c/p\u003e\n\u003cp\u003eThough Gilbert and the rest were Morning Star Warlocks and would definitely make a name for themselves wherever they were, one had to remember that Jupiter’s Lightning definitely had an organisation here. It was possible that before he could even find Gilbert, the Radiant Moon Magi would be at his doorstep wanting his life.\u003c/p\u003e\n\u003cp\u003e‘But… Morning Star strength is rare even in other worlds. If I was a Magus from Jupiter’s Lightning, I would probably scheme to seize control of large-scale organisations and find a way to lure other members to come over as well…’\u003c/p\u003e\n\u003cp\u003eLeylin began to envisage the plans that Gilbert and the others would make after coming here suddenly, and immediately had several trains of thought.\u003c/p\u003e\n\u003cp\u003e‘I’m afraid I’ll have to go to other large cities. Intelligence groups there must have the information I want!’ Leylin’s eyes shone, and he pointed at the spell formation in mid-air.\u003c/p\u003e\n\u003cp\u003eA layer of crimson flames immediately started to rage, swallowing the spell formation and the two soul fires within.\u003c/p\u003e\n\u003cp\u003eIn the crimson flames, the spell formation that had originally been large and oversized shrunk down into little droplets that rolled around and disappeared into a soul crystal.\u003c/p\u003e\n\u003cp\u003eWhen the crimson flames had died out, all that was left was a red crystal the size of a fist.\u003c/p\u003e\n\u003cp\u003eAt the heart of the crystal were two fine silver-white flames that intertwined, forming the strange shape of the Ouroboros.\u003c/p\u003e\n\u003cp\u003e‘Alright! The sensing technique has been set. I won’t need to go through the troublesome task of setting up a spell formation every single time in the future.’ Leylin looked relaxed as he kept the crystal properly. Immediately after, he felt the whole group come to a halt.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Furrowing his brows, Leylin opened the shell of the snail and went outside.\u003c/p\u003e\n\u003cp\u003e“Mister Ley, there’s a battle going on outside. The undulations have already reached the Earth grade, hence I’ve ordered the group to stop!” A giant one-horned clansman came before Leylin, looking very respectful.\u003c/p\u003e\n\u003cp\u003eInitially, he had had qualms regarding Intellectual One’s plans, but after Leylin had shown some tricks, the other party was immediately taken in. His gaze towards Leylin was full of deference.\u003c/p\u003e\n\u003cp\u003e“Oh? I didn’t notice that just now.” Leylin nodded, spreading a pair of large white wings from his back. A powerful strength flowed through them, allowing his body to fly into the air.\u003c/p\u003e\n\u003cp\u003eThis expansive view immediately allowed him to view the scene far away.\u003c/p\u003e\n\u003cp\u003eEnergy undulations were spread recklessly, and two figures moved to and fro in the lava, filling the whole sky with magma droplets.\u003c/p\u003e\n\u003cp\u003e“Indeed, energy at the Earth grade,” Leylin nodded.\u003c/p\u003e\n\u003cp\u003eThis world naturally did not have the same classification system as the Magus World, but several beings with extraordinary strength still existed here, though the differences in ranking were not as distinct.\u003c/p\u003e\n\u003cp\u003eFrom what Leylin knew, individuals who had exemplary abilities only had a few divisions. Exemplary, Earth, Sky, Star!\u003c/p\u003e\n\u003cp\u003eBased on Leylin’s understanding, ‘Exemplary’ referred to knights and acolytes, and they were beings which possessed the slightest bit of extraordinary strength. They were the lowest stratum. Earth referred to the equivalents of official Magi, or perhaps those who could reach rank 2. Similarly, Sky were the strong ones, as strong as rank 3! And those of Star rank were beings who existed in legends and myths, and were on par with the Magus World’s Morning Star Magi.\u003c/p\u003e\n\u003cp\u003eThe classification of ‘Stars’ allowed Leylin to guess that Lava World definitely had been influenced by the Magus World. Or, at least, there had been a few Morning Star Magi that had paid attention to this world.\u003c/p\u003e\n\u003cp\u003eIf not, the classification of Stars would not be so similar.\u003c/p\u003e\n\u003cp\u003eAs for strength, the one-horned race that Leylin had seen up to this point depended completely on their body. Only the Intellectual One he saw that day seemed to have awakened some magical ability, which was rather decent.\u003c/p\u003e\n\u003cp\u003eThe two beings of another race that were fighting in front of Leylin paled in comparison to the Intellectual One from before, whether in terms of the intensity of their energy or undulations.\u003c/p\u003e\n\u003cp\u003eHowever, after observing for a long while, Leylin made a discovery, “A summoning ability? And it’s the power of a totem?”\u003c/p\u003e\n\u003cp\u003eThese two were obviously not of the one-horned race. One of them was extremely obese, to the point that their waist couldn’t even be seen. A long nose hung from its face, making it look like an upright elephant, except that its skin was bright yellow.\u003c/p\u003e\n\u003cp\u003eThe other was green, and from the big-headed race. It had an exceptionally small body and very nimble arms, with many runes and spell patterns rolling from its fingertips and being carved into the ground.\u003c/p\u003e\n\u003cp\u003e“Ignite!” With its voice, the image on the ground suddenly brightened, a layer of soil solidifying to form a berserk bear-like creature.\u003c/p\u003e\n\u003cp\u003eA pentagonal spell formation appeared on the elephant clansman, and in the next moment, the space seemed to shatter. A large double-headed cheetah descended from another space.\u003c/p\u003e\n\u003cp\u003eThe two creatures looked each other face to face, and then began to tear at one another viciously, powerful energy undulations sweeping through the region.\u003c/p\u003e\n\u003cp\u003e‘There’s a shadow of the Magus World here! It seems that the ancient Magus World once took over many worlds and made use of the strengths of this place, giving rise to many strength-based systems. Looks like the rumours were real!’\u003c/p\u003e\n\u003cp\u003eLeylin watched on with interest, occasionally finding traces of some systems similar to that in the Magus World from their usage of energy.\u003c/p\u003e\n\u003cp\u003eHowever, his attitude of watching leisurely had clearly offended the two of them.\u003c/p\u003e\n\u003cp\u003e“You damned bird person. What are you looking at?” The elephant man roared, and it summoned a large goshawk, its sharp feathers and claws like steel as they emanated glints that inspired terror.\u003c/p\u003e\n\u003cp\u003eThe goshawk cawed out and pounced towards Leylin, its large talons seemingly able to tear through anything.\u003c/p\u003e\n\u003cp\u003eThe other opponent seemed to have slowed his movements, standing aside and waiting to watch a good show.\u003c/p\u003e\n\u003cp\u003e“Really…” Leylin couldn’t help but shake his head, watching the goshawk that was throwing itself at him speechlessly. Never did he expect that watching such a spectacle could cause trouble.\u003c/p\u003e\n\u003cp\u003e‘Summoning methods can technically be divided into elemental summoning, spatial summoning, bloodline summoning, all the way to the greatest, which is world summoning! The summoning methods here are probably those of the lowest level, spatial summoning. They can only instantly summon contracted beings of this world before the summoner…’\u003c/p\u003e\n\u003cp\u003eLeylin touched his chin, watching the goshawk that was pouncing over, and suddenly laughed.\u003c/p\u003e\n\u003cp\u003eFor some reason, after seeing that smile, the elephant man on the ground felt a chill, as if he had done something very wrong.\u003c/p\u003e\n\u003cp\u003eSoul force invaded the insides of the goshawk’s mind. Leylin immediately found a spell formation that symbolised a contract. It was twinkling, and as if it had discovered the invasion of another being, it began to retaliate.\u003c/p\u003e\n\u003cp\u003eHowever, soul force was far too powerful. With just a sweep, the elephant man’s low-grade spiritual force was utterly defeated, and the spiritual branding had also been erased. The large goshawk felt giddy and suddenly found the white-winged person in front of it favourable, circling around Leylin.\u003c/p\u003e\n\u003cp\u003e“Impossible!” The intense spiritual attack, as well as the erasing of his mark immediately caused the elephant man to be seriously injured.\u003c/p\u003e\n\u003cp\u003eHe involuntarily cried out and spat a mouthful of fresh blood, crumbling down on the spot.\u003c/p\u003e\n\u003cp\u003eThe other opponent seemed to be scared out of its wits and stayed rooted to the spot.\u003c/p\u003e\n\u003cp\u003eHow could this summoning partner of his be defeated in such a straightforward manner? The green-skinned clansman felt like his thoughts came crashing down.\u003c/p\u003e\n\u003cp\u003eHe was beginning to pity his opponent. Just a casual act had provoked such a terrifying existence. They had to be at least of the Sky rank!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-545\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-547\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-546","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
