{"id":59105,"no":549,"title":"Chapter 549","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eEmberwing Race\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe Lava World was vast, and a few hundred years would not be enough to traverse the entire world.\u003c/p\u003e\n\u003cp\u003eBased on the information he obtained from Jake, this continent that Leylin was on was the largest in the Lava World, called ‘Blazing Crown’.\u003c/p\u003e\n\u003cp\u003eAround Blazing Crown, was an ocean formed of lava. Within this lava ocean were all kinds of terrifying high-energy beings, and it was a much more dangerous place than the oceans in the Magus World.\u003c/p\u003e\n\u003cp\u003eHence, communication between Blazing Crown and the other continents was minimal. Even the most powerful extraordinary ones rarely left the continent.\u003c/p\u003e\n\u003cp\u003eTo Jake’s knowledge, Blazing Crown was the heart of the Lava World. The other ‘continents’ were merely slightly large islands.\u003c/p\u003e\n\u003cp\u003e‘What an interesting world! An ocean formed of lava? If those fire-elemental Magi were to find out about this place, they would be willing to migrate over even if it cost them a fortune.’ Leylin touched his chin, beginning to browse through the intelligence he had obtained from Jake.\u003c/p\u003e\n\u003cp\u003eThough the information was very complicated, the A.I. Chip had recorded everything and could quickly filter out the wrong and useless information, leaving behind the great amounts of valuable intel. It then combined a few pieces that seemed to be linked.\u003c/p\u003e\n\u003cp\u003eSoon, Leylin managed to form an image of the true Lava World.\u003c/p\u003e\n\u003cp\u003eThis was a world of flames. Fire elemental beings and lava creatures occupied over 80% of the area here. The one-horned race, as well as the ant race that Jake was a part of, could only somewhat survive at the edges of the continent.\u003c/p\u003e\n\u003cp\u003eOn the complete map of the continent, there were no signs of the single-horned city. Woking City was merely a black dot at the edge, and was basically a remote and desolate place.\u003c/p\u003e\n\u003cp\u003eThree organisations stood at the apex of Blazing Crown.\u003c/p\u003e\n\u003cp\u003eThere was the Divineflame Empire made entirely of fire elemental beings. The Atlan Union was made up of the Emberwing race, a life form similar to humans, and then the Allied Kingdom was made up of the rest. There weren’t any others at the same level as them.\u003c/p\u003e\n\u003cp\u003eOf these three, the Divineflame Empire was the most powerful. The Atlan Union and Allied Kingdom had to collaborate to stave off their invasions.\u003c/p\u003e\n\u003cp\u003eWars were incessantly fought as they tried to seize good territory from the lava and fire elemental beings. It was to the point that huge military campaigns were launched every few years.\u003c/p\u003e\n\u003cp\u003eAs for the divisions in their ranks, it was the same as what he’d already encountered. The weakest was Exemplary, followed by Earth, Sky, and Star.\u003c/p\u003e\n\u003cp\u003eAs for those above the Star rank, beings that possessed the strength of Radiant Moon Magi, he hadn’t come across any such thing. Although it could just be that Jake’s organisation hadn’t acquired that level of information yet.\u003c/p\u003e\n\u003cp\u003eEven so, Leylin’s current strength allowed him to do as he liked in the Lava World as long as the other Star ranks or Jupiter’s Lightning didn’t set their sights on him.\u003c/p\u003e\n\u003cp\u003e“If I were Gilbert and the others, I would either find a place and hide myself completely, or build an organisation in secret that would give off a distinct signal to the outside, letting any rescuers know where I am.…”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes flashed, and the A.I. Chip immediately began to search through the data.\u003c/p\u003e\n\u003cp\u003eSoon enough, a distinct heading attracted Leylin’s attention. “Riot at Eastern City of Atlan Union. Rebel army ‘Triserpent Sect’ has taken responsibility for the event. There are conjectures that this could be a retaliation in response to the large-scaled attack of the Union…”\u003c/p\u003e\n\u003cp\u003e“Triserpent Sect?” This phrase that was full of meaning immediately got him to make a mental association.\u003c/p\u003e\n\u003cp\u003e“Isolate all information about the Triserpent Sect!” Leylin commanded. With the keyword found, the A.I. Chip’s search went more quickly. Almost instantly, information relating to the Triserpent Sect was projected in front of him.\u003c/p\u003e\n\u003cp\u003eThrough reading this information, Leylin gained a deeper understanding of this organisation.\u003c/p\u003e\n\u003cp\u003eThe Triserpent Sect, which was also called the Triserpent Resistance Army, was an up-and-coming organisation, and its development was rapid. With the goal of overthrowing the rule of the Atlan Union, their operations were unpredictable and very much supported by the lower class commoners.\u003c/p\u003e\n\u003cp\u003eIt was said that there were three heads of the Triserpent Sect, and they were terribly powerful, the Atlan Union’s attempts at cornering and annihilating them were to no avail.\u003c/p\u003e\n\u003cp\u003eHowever, days ago, the Atlan Union had suddenly announced that they had achieved victory while trying to eliminate the Triserpent Sect. Not only had they destroyed many of its branches, they had even killed the head.\u003c/p\u003e\n\u003cp\u003eThe news of rebellion that Leylin had seen was retaliation launched by the Triserpent Sect.\u003c/p\u003e\n\u003cp\u003e“Triserpent Sect? Interesting! Is it really the three dukes, or is this bait?” Leylin touched his chin, but it was obvious that in the Atlan Union, there were clues of the location of the two Morning Star dukes!\u003c/p\u003e\n\u003cp\u003eFor this reason, Leylin had to go there no matter what.\u003c/p\u003e\n\u003cp\u003e‘I keep having this feeling that the Atlan Union is very suspicious.’ Leylin touched his chin and sank deep into thought.\u003c/p\u003e\n\u003cp\u003eThe three dukes had no grudge against the Atlan Union. Why would they suddenly attack them? Unless… They had made some astounding discovery in the Atlan Union!\u003c/p\u003e\n\u003cp\u003e‘Come to think of it, Jupiter’s Lightning found this world first. It would be strange if they did not painstakingly manage it. Hence, if the ones working behind the scenes in the Atlan Union were Jupiter’s Lightning, that would explain everything…’\u003c/p\u003e\n\u003cp\u003eLeylin wondered as explored different possible solutions.\u003c/p\u003e\n\u003cp\u003eCompared to the Divineflame Empire that was against all foreigners and full of fire elementals, the Atlan Union formed of the Emberwing race similar to humans were easier to manipulate.\u003c/p\u003e\n\u003cp\u003eOn top of that, their strength was only second to the Divineflame Empire in Blazing Crown, and was more suited to the needs of the Morning Star Magi of Jupiter’s Lightning.\u003c/p\u003e\n\u003cp\u003eHowever, while this made sense logically, Leylin believed things could not be so simple. The same intuition that had helped him obtain astonishing harvests during dangerous moments was blaring sirens at him.\u003c/p\u003e\n\u003cp\u003e‘No matter what it is, I need to go the Atlan Union! As for the Triserpent Sect, we’ll see…’ Leylin sighed.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eBoiling lava and fiery red light formed the only luster of the Lava World. And yet, even under this dazzling redness, life was growing stubbornly.\u003c/p\u003e\n\u003cp\u003eThis was a grassland, and little steel trees similar to the one Leylin had seen before and filled the area, along with vegetation whose leaves had jagged edges. A few slender channels of lava could be seen every once in a while, flowing past like little streams in the grasslands. Yet, they could not harm the area at all.\u003c/p\u003e\n\u003cp\u003eThese plants that were like grass that had their roots firmly and deeply in the ground, even boring into the lava and absorbing its energy for their growth.\u003c/p\u003e\n\u003cp\u003eThe stubborness for life had Leylin feeling surprised.\u003c/p\u003e\n\u003cp\u003e“Uncle Ley! Why do you like watching this iron-thread grass?” A very fair girl cloaked in red darted over, the sparse red feathers covering her forehead bouncing up and down.\u003c/p\u003e\n\u003cp\u003eThis girl was no different from an ordinary human child, if one disregarded the feathers on her forehead and on the back of her hand.\u003c/p\u003e\n\u003cp\u003eThis was the Emberwing race. In the Lava World, besides fire elemental life forms, they were the largest racial group, and formed the largest group in the Atlan Union.\u003c/p\u003e\n\u003cp\u003e“I just like them for their resilience!” Leylin chuckled as he handed over a large piece of meat to her. “Take this! I’m afraid we’ll have to part here.”\u003c/p\u003e\n\u003cp\u003e“Uncle Ley, are you leaving?” The little girl sucked on her finger, looking reluctant.\u003c/p\u003e\n\u003cp\u003eThough they had met on the road, the powerful aura of this clansman even had her father in awe. Based on her father’s guesses, this Mister Ley must be at least an Earth rank working hard to temper oneself and fervently hoping to advance to a higher realm.\u003c/p\u003e\n\u003cp\u003e“Brother Ley, are you already leaving?” Not long after, another large man of the Emberwing race rushed over. He had obviously just heard the news, and looked anxious.\u003c/p\u003e\n\u003cp\u003eLeylin now had a few fine red feathers on his forehead. This was the appearance of the Emberwing race.\u003c/p\u003e\n\u003cp\u003eIn the Atlan Union, it was much too eye-catching if he were to continue pretending to be of the winged race.\u003c/p\u003e\n\u003cp\u003e“Yes! Working hard in this world can’t stimulate my progress anymore. Hence, I’ve decided to join the army! Perhaps competing against those evil fire elementals of the Divineflame Empire will help me advance to a higher level!”\u003c/p\u003e\n\u003cp\u003eLeylin’s expression was callous, “Besides, I’ve had a dream since I was young. I wanted to punish those flame bastards with my iron fist… Just in time for me to steel my skills in the upcoming battle at the Death Grand Canyon Battle!”\u003c/p\u003e\n\u003cp\u003e“D… Death Grand Canyon!” The large man’s eyeballs protruded. That was the frontlines of the battle between the Atlan Union and Divineflame Empire. That was also where the most casualties were.\u003c/p\u003e\n\u003cp\u003e“You…” The large man only moved his lips, but seeing the resolute look on Leylin’s face, he did not say more.\u003c/p\u003e\n\u003cp\u003e“My good brother, help me kill a few more fire elementals!” The large man could only pat Leylin’s shoulders as if wishing him luck, and he watched Leylin’s figure disappear into the horizon...\u003c/p\u003e\n\u003cp\u003e“Hah… I’ve finally arrived…” Leylin saw the outline of the Emberwing race in the distance, and let out a long breath.\u003c/p\u003e\n\u003cp\u003eThe moment he had obtained intel on the Triserpent Sect, he had immediately set off and hurried here in secret.\u003c/p\u003e\n\u003cp\u003eHowever, as the Lava World was much too big, and Woking City was located in a very remote area, he had expended much time and effort to reach this place.\u003c/p\u003e\n\u003cp\u003eAs for the large man and family of Emberwing race, they were only a few companions he had joined out of loneliness on the way here.\u003c/p\u003e\n\u003cp\u003e“Compared to the Magus World, many Exemplary ranks join the army directly in the Lava World and hold high rankings. If I want to obtain any information or intel, that would be the most convenient place.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-548\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-550\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-549","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
