{"id":58613,"no":57,"title":"Chapter 57","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eMurphy\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin rang the doorbell that hung on the door. A crisp ring of a bell could be heard, followed by the noise of scurrying footsteps.\u003c/p\u003e\n\u003cp\u003e\"Hello! May I ask who you are? Do you have an appointment?\" A meticulous looking butler appeared in front of Leylin.\u003c/p\u003e\n\u003cp\u003e\"Leylin Farlier, I am here to visit the owner of this villa!\" Leylin smiled.\u003c/p\u003e\n\u003cp\u003eThe butler obviously looked distressed as he said, \"Sir, as you know, my master, Murphy, is a renowned scholar. His schedule every day is extremely packed, perhaps......\"\u003c/p\u003e\n\u003cp\u003eAt this moment, a girl, who seemed like the maid, hurriedly ran over and whispered into the butler\u0027s ears.\u003c/p\u003e\n\u003cp\u003eThe butler\u0027s complexion immediately changed as he bowed deeply, \"Master invites you into the living room!\"\u003c/p\u003e\n\u003cp\u003eLeylin smiled as he retrieved the energy waves he radiated.\u003c/p\u003e\n\u003cp\u003eUpon entering inside the villa, there was a corridor littered with various art pieces like paintings and exhibited on the faint yellow colored walls were all kinds of oil paintings, and other specimens of art, which were rather pleasing to the eyes.\u003c/p\u003e\n\u003cp\u003eAs the living room came into view, it became quite obvious that it was a spacious house.\u003c/p\u003e\n\u003cp\u003eThe decor in the room was extremely aesthetic. Although there were no dazzling golden or silver items or gems, these pieces had an aura of history and gave off a feeling of understated elegance.\u003c/p\u003e\n\u003cp\u003eBeside the fireplace in the living room, an old scholar with white brows and beard lounged on a dark red recliner.\u003c/p\u003e\n\u003cp\u003eThe old man\u0027s eyes seemed muddy with only occasional traces of intelligence within.\u003c/p\u003e\n\u003cp\u003eThe old man\u0027s originally squinted eyes opened upon seeing Leylin. He stood up and spread his arms in an embracing gesture, \"Welcome, my young friend!\"\u003c/p\u003e\n\u003cp\u003eLeylin went forward to hug the old man, \"It is an honour to be able to meet you! I hope you like this present I brought for you!\"\u003c/p\u003e\n\u003cp\u003eAnna stepped forward and handed over to the butler an extremely exquisite cap.\u003c/p\u003e\n\u003cp\u003e\"I like the tail feathers of the night hawk. They represent peace!\" The old man waved his hands, \"Lille, you may take your leave, I want to have a good chat with this friend of mine!\"\u003c/p\u003e\n\u003cp\u003e\"Take your leave too!\" Leylin told Anna who was beside him.\u003c/p\u003e\n\u003cp\u003eAfter extending their salutations, the few maids, and the butler left, closing the door behind them. Very soon, there was only Leylin and the old man left in the living room.\u003c/p\u003e\n\u003cp\u003e\"Alright, let\u0027s reintroduce ourselves! Murphy, level 3 acolyte! I have been a resident of Extreme Night City for 3 years now......\" The old man\u0027s eyes showed signs of his reminiscing past events.\u003c/p\u003e\n\u003cp\u003e\"So then, guest from afar, how about you?\"\u003c/p\u003e\n\u003cp\u003e\"Leylin Farlier, level 2 acolyte and wandering Magus. I have recently come to Extreme Night City and wish to reside here for several years.\" Leylin smiled and executed the bow between Magi.\u003c/p\u003e\n\u003cp\u003e\"I detect signs of youth in your body. Being able to advance into level 2 acolyte at this age, you have a rather great aptitude!\" Murphy sighed in admiration.\u003c/p\u003e\n\u003cp\u003e\"I was just lucky......\" Leylin demurred. Although the old man\u0027s body had degenerated, the energy waves of a level 3 acolyte told anyone that it was not good to provoke him.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip, initiate scan!\"\u003c/p\u003e\n\u003cp\u003e[Murphy. Strength: 1.5, Agility: 1.4, Vitality: 2.9, Spiritual force: 8.5, Magical Power: 8. Status: Healthy. Evaluation: level 3 acolyte, relatively dangerous!]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip faithfully relayed the figures onto Leylin\u0027s field of vision.\u003c/p\u003e\n\u003cp\u003eBeing a wandering level 3 acolyte, Murphy\u0027s array of magic spells definitely surpassed Leylin\u0027s. Moreover, he would have some extremely-difficult-to-deal-with trump cards hidden to protect his life.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin came with good intentions. From the A.I. Chip\u0027s area scan, the number of acolytes residing in Extreme Night City was not high. As for this Murphy, he radiated one of the strongest energy waves.\u003c/p\u003e\n\u003cp\u003eAfter exchanging several polite greetings, Leylin delved immediately into the main purpose of his visit.\u003c/p\u003e\n\u003cp\u003e\"So it\u0027s like this! I wish to reside permanently in Extreme Night City, and even open an ingredients shop. You know, the procedures are extremely tedious, and I also need a resident to act as my guarantor......\"\u003c/p\u003e\n\u003cp\u003e\"So you came here to look for me?\" Murphy smiled and drank the cup of red tea that was on the table.\u003c/p\u003e\n\u003cp\u003e\"To be honest, as an ambitious and truth seeking Magus, gold coins and the like should no longer sway us. Although I don\u0027t know why you arrived at this conclusion, on a whim perhaps? Or for some other reason? To me, this indeed is a small matter!\"\u003c/p\u003e\n\u003cp\u003e\"Coincidentally, I have some friendly relations with the Lord of Extreme Night City. One of his sons is also under my tutelage. Moreover, any city lord will not refuse the request of a Mysterious Entity...... The residential procedures here in Extreme Night City, as well as the shop permit, can all be settled very easily.\" Murphy guaranteed.\u003c/p\u003e\n\u003cp\u003e\"Then I must really thank you!\" Leylin nodded his head, \"If there are any areas I could help you with, do not hesitate to ask!\"\u003c/p\u003e\n\u003cp\u003eAlthough this was said to satisfy the requirements of etiquette, both Leylin and the old man knew that it was mentioned as a mere courtesy.\u003c/p\u003e\n\u003cp\u003eThe handling of residential procedures may be difficult to regular humans. However, for a famous scholar like Murphy, it was only a matter of a few words. Even if Leylin wanted to handle these procedures by himself, he would have to spend more time than the old man.\u003c/p\u003e\n\u003cp\u003eFor both Murphy and Leylin, this matter was simply a means to establish a basic friendship of convenience between them.\u003c/p\u003e\n\u003cp\u003e\"Extreme Night City is a peaceful and quiet place. If you wish to have peaceful days then this place will definitely meet your needs. Later on, I will also introduce you to a few friends of mine. However, there are some set conventional customs that have to be complied with......Don\u0027t worry, they are all customary practices, for example, one should not massacre the residents or something like that!\"\u003c/p\u003e\n\u003cp\u003e\"I definitely agree!\" Leylin\u0027s coming to Extreme Night City was to avoid the chaos of war and intrigue. Naturally he would not do anything that would draw attention to himself.\u003c/p\u003e\n\u003cp\u003eLeylin and Murphy then talked about many Magi related questions, from how to stabilise a spell model for advanced levels to some of Murphy\u0027s personal adventures.\u003c/p\u003e\n\u003cp\u003eAlthough Murphy was only a level 3 acolyte, his experience was abundant due to having remained at this level for a long time already. This made Leylin feel that the trip was not in vain.\u003c/p\u003e\n\u003cp\u003eOn the other hand, Leylin\u0027s vast knowledge and eidetic memory shocked Murphy.\u003c/p\u003e\n\u003cp\u003eBoth of them regretted not having met earlier. They even had their lunch together all the way until dusk before Murphy let Leylin leave. When they bade farewell, they even arranged for their next meeting.\u003c/p\u003e\n\u003cp\u003e\"According to what Murphy said, the magicians in Extreme Night City are all of the acolyte level. As for the few nearby cities, official Magi were also extremely rare making this place very suitable for an acolyte to live in!\"\u003c/p\u003e\n\u003cp\u003eThe inquiries he made today caused Leylin to feel at ease, letting him walk at a slower and a more relaxed pace.\u003c/p\u003e\n\u003cp\u003e\"Only regarding this case where plants and wood withered is Murphy completely ignorant. After all, he is already quite old and does not wish to take risks......\"\u003c/p\u003e\n\u003cp\u003eThe two street lamps were lit with a dim yellow flame, allowing Leylin to see the road ahead.\u003c/p\u003e\n\u003cp\u003eAnna followed quietly behind Leylin. Being an outstanding maid, she obviously knew what she had to do, which was not to interrupt Leylin while he was deep in thought.\u003c/p\u003e\n\u003cp\u003eAfter Leylin ran through a simulation of his plans one more time, they had both arrived at the inn.\u003c/p\u003e\n\u003cp\u003e\"Young Master!\" \"Sir!\"\u003c/p\u003e\n\u003cp\u003eOld Welker, Greem, and Fraser came forward to receive them.\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head, \"After dinner all of you come to my room. There are many things I want to inform all of you regarding my future plans!\"\u003c/p\u003e\n\u003cp\u003eDinner was vegetable salad and mutton soup, followed by huge pieces of dried cookies. After Leylin finished and allowed Anna to clean up, the core people among his subordinates went to Leylin\u0027s room.\u003c/p\u003e\n\u003cp\u003eLeylin sat on a chair wrapped in beast hide and quietly listened to their reports.\u003c/p\u003e\n\u003cp\u003e\"Welker, how was the search for a residence?\"\u003c/p\u003e\n\u003cp\u003e\"Young Master, Old Welker has already contacted a Knight who is preparing to move to Sage Province. He is willing to sell a small manor in Extreme Night City to you.\" Old Welker reported. Despite being an old man, he was brimming with energy after finding them a new home.\u003c/p\u003e\n\u003cp\u003e\"Very good, what is the area like? Is the place enough to house all of us? How much is it?\" Leylin asked.\u003c/p\u003e\n\u003cp\u003e\"Please be at ease Young Master. Old Welker, I have gone to the manor and taken a look today. The area was very big and has no problem accommodating a hundred people. Moreover, there is even an oil palm forest, a fish pond, and a mill. Knight Victor originally built it according to a baron\u0027s standards. He never thought that it would change ownership this quickly. As for the price, Knight Victor has set it at 5000 gold coins!\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not that expensive, gold coins aren\u0027t an issue!\" Leylin twined his fingers. To a Magus, such earthly items as gold coins are insignificant. What they were concerned with were only magic crystals, high-grade ingredients, and the acquisition of remnant ancient knowledge.\u003c/p\u003e\n\u003cp\u003eLeylin had high-grade magic crystals of his own. Any one piece would be able to fetch a price far surpassing this amount of gold coins. However, Leylin was not prepared to do that. After all, magic crystals were rarer. If he really could not get the gold coins, then he would go borrow some from Murphy in exchange for a few potions--which was not a bad idea at all.\u003c/p\u003e\n\u003cp\u003e\"Very well!\" Let\u0027s take a look tomorrow. If the price and the area are both suitable, we can sign the contract immediately.\" Leylin nodded his head, saying, \"Also, go walk the streets and scout something for me. Recently, the herbs available in Extreme Night City have decreased. There will definitely be many small-sized shops that can no longer manage and are about to close down. Go and look into them first!\"\u003c/p\u003e\n\u003cp\u003e\"Forgive me for asking, but Young Master, are you thinking of opening a herb shop? The permit for doing such business has rather strict requirements......\" Fayern said.\u003c/p\u003e\n\u003cp\u003e\"Regarding that, none of you have to worry. I have already made arrangements. The permit will be here in a few days.\"\u003c/p\u003e\n\u003cp\u003eHearing this, Fayern and Old Welker were dazed. To be able to guarantee such a thing quite easily, Leylin\u0027s identity as a noble had already been confirmed.\u003c/p\u003e\n\u003cp\u003e\"In Poolfield Kingdom, the nobility represents progress and hope!\"\u003c/p\u003e\n\u003cp\u003eWith this in mind, their gazes towards Leylin became more fervent.\u003c/p\u003e\n\u003cp\u003eFayern silently clenched his fists. Being one of the few who could look ahead, he naturally knew that he could not work as a mercenary for much longer. Most of the mercenaries carried a lot of injuries and scars with to their graves knowing little enjoyment in their typically short lives. However, getting hired by this Sir Leylin as his private army could be the fastest way out of the trade.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-56\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-58\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-57","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
