{"id":59128,"no":572,"title":"Chapter 572","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Sneak Attack\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“This is the Northern Duke! I hereby command all residents of Tylasus City to return to their homes. You are not allowed to leave. Anyone outside will be killed without discretion!” While the defensive formation was being reinforced at the leader’s residence, a tremendous sound was transmitted to the city.\u003c/p\u003e\n\u003cp\u003e“I am Kiel, commander of the southern military. Nobody is allowed outside from henceforth!”\u003c/p\u003e\n\u003cp\u003e“I am the commander of the eastern military. Nobody is…”\u003c/p\u003e\n\u003cp\u003e“This is an order from the Western Duke…”\u003c/p\u003e\n\u003cp\u003eLoud sounds echoed continuously throughout the city, and an expression of glee surfaced on Schiker’s face.\u003c/p\u003e\n\u003cp\u003e“It’s my uncle the Northern Duke, Turin, and the others…” The dukes and military commanders were the pillars of the Atlan Union. Every single one of them was a Star rank.\u003c/p\u003e\n\u003cp\u003eThis sudden aid had excited him immediately.\u003c/p\u003e\n\u003cp\u003eAlong with the voices of the Star ranks, orders were passed down and the city was sealed. A layer of fiery-red isolation layer kept Tylasus within.\u003c/p\u003e\n\u003cp\u003e“Scarlet Eye really did have something planned. Is he trying to deal with all of us at once?” The leader of the Magi sized up the spell formation from a distance away as he floated in mid-air.\u003c/p\u003e\n\u003cp\u003e“A fire-type isolation spell formation and the reckless assault of elite troops truly can stall us. With the attacks from others of the same rank… Scarlet Eye really has a huge appetite!”\u003c/p\u003e\n\u003cp\u003eSaka seemed rather confident, on the other hand. “Don’t worry! Our emperor will come and bring us back!”\u003c/p\u003e\n\u003cp\u003e“I hope so!” The leader of the Magi laughed. Watching the many troops entering the city in an orderly manner, suppressing the chaos, and taking over the defence, he couldn’t help but sneer.\u003c/p\u003e\n\u003cp\u003e*Rumble!* Large amounts of fire energy were emitted from the bodies of the Northern Duke and the rest, fighting against the few Morning Stars.\u003c/p\u003e\n\u003cp\u003eFire sparked in the sky above the capital, space itself crumbling as silver storms wreaked havoc on the land.\u003c/p\u003e\n\u003cp\u003e“The leader knew you were going to do this, and had set a trap in advance. All of you shall die here today.” The Northern Duke’s expression was firm.\u003c/p\u003e\n\u003cp\u003eWith the addition of the many legions and the participation of the Star ranks, the Emberwings’ impending doom was reversed, and the scales had now tipped in their favour.\u003c/p\u003e\n\u003cp\u003e“Do you think you can stop us just like this? How naive!” The leader of the Morning Stars produced multiple mechanical arms, protecting himself with the mass of steel. Seeing the Northern Duke and the others charging over, his eyes shone with pity.\u003c/p\u003e\n\u003cp\u003e“In this war, what determines victory can only be a strength above the Morning Star realm!”\u003c/p\u003e\n\u003cp\u003e“Above… Morning Star? Do you mean?” The Northern Duke and the others glanced towards the outside of the city in disbelief.\u003c/p\u003e\n\u003cp\u003eA flame giant that towered into the very heavens was contending against a similarly large, terrifying phoenix. Every attack of theirs seemed to shake heaven and earth, destroying their surroundings. It seemed like the end of the world.\u003c/p\u003e\n\u003cp\u003eThis was the battlefield between Scarlet Eye and his opponent, the Divineflame Emperor. In a battle between rank 5s, Morning Star Magi could not even attempt at interfering unless there were enough of them.\u003c/p\u003e\n\u003cp\u003e*SKREEEE!* And at this moment, the winner seemed to have been decided. The giant phoenix’s calls sounded out as gigantic sharp claws ripped apart the elemental’s breastplate to a shower of lava and fire.\u003c/p\u003e\n\u003cp\u003e“You’ve lost, Archibald!” Scarlet Eye’s voice sounded from the phoenix’s mouth. As they heard this sound, glee appeared on the faces of the Northern Duke’s party. The leader that they had placed their hopes on hadn’t betrayed their trust!\u003c/p\u003e\n\u003cp\u003e“Yes, I’ve lost,” the fire elemental giant clutched at his chest, rocks falling out from the huge injury, causing earthquakes as they hit the ground.\u003c/p\u003e\n\u003cp\u003e“You really are a genius, Scarlet Eye, you’ve already reached the peak of rank 5… I made the right decision today. If not, you could’ve been the key to changing the status quo between the Divineflame Empire and the Atlan Union!”\u003c/p\u003e\n\u003cp\u003eThe Divineflame Emperor’s voice boomed like a thunder that rumbled throughout the heavens.\u003c/p\u003e\n\u003cp\u003e“Decision?” Scarlet Eye seemed to be confused, but immediately after the giant phoenix retreated.\u003c/p\u003e\n\u003cp\u003eHowever, it was too late! Large amounts of thunder clouds formed in the sky, and terrifying bolts of black lightning struck down. The dark clouds covered the skies, blocking the brilliant sun.\u003c/p\u003e\n\u003cp\u003eThe lightning came together to form a lance, and a Magus suddenly appeared, gripping it.\u003c/p\u003e\n\u003cp\u003eThis Magus’ forehead was marked with a rune in the shape of a moon. “Goodbye!” he called out in a low voice as he tossed the lance.\u003c/p\u003e\n\u003cp\u003e*Swish!* As if it was a deity from the World of Gods that had been enraged, a world-extinguishing bolt of lightning shot down from the skies.\u003c/p\u003e\n\u003cp\u003eThis horrifying black lance seemed to transcend the limits of time and space, and even the void was subdued under the tip of the lance, carrying the might of an apocalypse. This terrifying instrument of destruction appeared before the phoenix.\u003c/p\u003e\n\u003cp\u003e*Skree!* The phoenix called out, the sound this time filled with sorrow and suffering.\u003c/p\u003e\n\u003cp\u003e*Ka-cha!* As the dazzling white light formed by the collision dissipated, the Star ranks noticed that the Phoenix Scarlet Eye had transformed into had suffered a gigantic injury. Feather after flaming feather fell to the ground before bursting into intense flame. Within this fire, the feathers somehow seemed even more magnificent.\u003c/p\u003e\n\u003cp\u003eLeylin’s pupils shrank as he saw this scene. Even if this was just a transformation, the parts that left the body still managed to retain their shape. This showed just what level his fire phoenix transformation had reached!\u003c/p\u003e\n\u003cp\u003e“Leader!” While the Northern Duke and the rest clamoured over this sneak attack, Leylin and the others who were hiding in the residence watched on grimly.\u003c/p\u003e\n\u003cp\u003e“That Magus is Zegna from Jupiter’s Lightning! How did he get here?”\u003c/p\u003e\n\u003cp\u003eLeylin obviously knew the Magus in the black robe. This Zegna had come to stop him when he had travelled here from the Magus world. However, he’d pitifully been stalled by Wayde.\u003c/p\u003e\n\u003cp\u003eThe rank 5 energy undulations, as well as that face that left a deep impression, were both things he could never forget.\u003c/p\u003e\n\u003cp\u003e“The Zegna now is different from the one we met before. It’s probably just a clone, but why does it have the undulations of a rank 5 Magus? Even if it’s much weaker than before, it’s still a Radiant Moon!” Gilbert looked to be distressed, evidently unable to make sense of this.\u003c/p\u003e\n\u003cp\u003e“It should be some sort of ancient secret technique! A rank 5 clone is an exceptionally powerful trump card. I’m more curious about the how he deceived the Lava World’s World Will and was able to sneak in successfully!” Leylin stroked his chin.\u003c/p\u003e\n\u003cp\u003e“Zegna, even you betrayed me!” Scarlet Eye’s voice was produced from the body of the giant phoenix, the injuries on its wings quickly regenerating.\u003c/p\u003e\n\u003cp\u003e“Esteemed leader!” Zegna, who was in mid-air, first bowed slightly to him. “Our relationship only extended to a cooperation between us. Rather, it was but a transaction that consisted of mutual benefits. So then, how could there be a betrayal?”\u003c/p\u003e\n\u003cp\u003e“Alright! Scarlet Eye, that was the first round. The second round is about to start now!” The towering fire elemental giant roared, and Zegna sprung into action as well. Black lightning and powerful lava encircled Scarlet Eye…\u003c/p\u003e\n\u003cp\u003e“Leader?!” The Northern Duke, the supporting troops, and the others immediately had a change in expression. Though Scarlet Eye was at the peak of Radiant Moon, his opponent was not weak. This long-time enemy of the Atlan Union, the Divineflame Emperor, had teamed up with a terrifying rank 5 Magus from another world. Even the most stupid person could tell that their leader was in trouble.\u003c/p\u003e\n\u003cp\u003e“Everyone, this is the day to dedicate yourselves to our country!” The Northern Duke sighed, a rare solemness appearing on his face. It was evident that he was already expecting his death.\u003c/p\u003e\n\u003cp\u003e“Haha… Vape, Sulu, we’re heading off first!” A few Star ranked elders erupted into an insane laughter, their expressions showing their readiness for death.\u003c/p\u003e\n\u003cp\u003eSeeing such a solemn expression, the leader of the Morning Star Magi began to hesitate.\u003c/p\u003e\n\u003cp\u003eWhile the Star ranks of this world had fewer secret methods than Magi, if they really went all out his side could suffer a large number of casualties.\u003c/p\u003e\n\u003cp\u003eMorning Stars like them, who had been nurtured by Jupiter’s Lightning through and through, were few in number. Most of their Morning Stars joined from other races, and only Zegna could keep them suppressed. In the face of great casualties to this core team, he was beginning to hesitate.\u003c/p\u003e\n\u003cp\u003eThe dukes and commanders who were all veterans in battle exchanged glances, all having noticed the strange look in their opponent’s eyes.\u003c/p\u003e\n\u003cp\u003e“Alright! It’s been revealed that the Morning Star Magi are afraid of casualties. This battle is going to be fun. Zegna is probably going to cough up blood…” Emma exclaimed, taking joy in his misfortune.\u003c/p\u003e\n\u003cp\u003eThis was reality. Even if the Morning Star Magus leader could harden his resolve, the other Morning Star Magi might not be willing to. After all, they had merely signed a contract and joined Jupiter’s Lightning, and there were no rules that stated they had to give up their lives for the organisation.\u003c/p\u003e\n\u003cp\u003eWhen the opponent made use of this fact and displayed they were not afraid to sacrifice themselves, and that they would take their opponents down at any cost, then they would be involving themselves in a pointless fight.\u003c/p\u003e\n\u003cp\u003e“I’m afraid Zegna’s already foreseen this. He won’t be that enraged.” Leylin shook his head, stating his opinion. “The Divineflame Emperor’s plan should be to kill as many Star ranks and weaken the Atlan Union as much as possible. However, killing these people won’t do Zegna any good, and it could even have the opposite effect, hurting his own forces. Thus, he won’t grow mad. His main objective is likely the firasource stones. We need to monitor the residence. I believe Zegna is about to make a move!”\u003c/p\u003e\n\u003cp\u003e“You’re right.” Gilbert nodded to acknowledge Leylin’s prediction after a momentary silence.\u003c/p\u003e\n\u003cp\u003eThe battle pushed on and things turned out just like Leylin expected. The Morning Stars immediately yielded to the Emberwings who were going all out. Their inefficiency drove Saka insane, but there was nothing he could do about it.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-571\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-573\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-572","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
