{"id":59132,"no":576,"title":"Chapter 576","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eBlackfire Phoenix\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Could this egg be the legendary phoenix egg?” Leylin guessed absent-mindedly.\u003c/p\u003e\n\u003cp\u003eOnly a creature as ancient as that would be able to automatically push Scarlet Eye’s progress in Fireplume to an unprecedented thirteenth level. On top of that, it could create amazing soul treasures such as firasource stones!\u003c/p\u003e\n\u003cp\u003eThe reason he thought that way was because the moment this egg that was bathed in scarlet radiance appeared, his own Fireplume began to operate more quickly. A large, demonic version of the blackfire phoenix appeared behind him, and extreme desire filled his heart.\u003c/p\u003e\n\u003cp\u003eThe blackfire phoenix chirped for a long while, extending its wings. The scarlet energy emanated by the egg was continually being absorbed by it.\u003c/p\u003e\n\u003cp\u003e[Beep! Change detected in host’s Fireplume. Energy levels increasing rapidly, currently at peak of level ten.]\u003c/p\u003e\n\u003cp\u003e[Beep! Qualitative change has been detected in host’s Fireplume. Entering level eleven.]\u003c/p\u003e\n\u003cp\u003e[Beep! Unknown essence being absorbed by host. Scans show atomic configuration is similar to that of firasource stones. Soul force is being enhanced.]\u003c/p\u003e\n\u003cp\u003e[Beep! Density of host’s point mass increasing. Affinity with fire elemental particles increasing.]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s constant prompts left Leylin stunned for a moment. The egg’s great amounts of energy had constantly been absorbed by Dark Fireplume, and with the assistance of the A.I. Chip’s simulations he had broken through to the eleventh level!\u003c/p\u003e\n\u003cp\u003eThe eighth and ninth levels of Fireplume marked the Sky rank, while the tenth and eleventh marked those at the Star rank, the Morning Stars. The twelfth and thirteenth belonged to rank 5, the Radiant Moon realm. Scarlet Eye, being at the thirteenth level himself, was at the peak of Radiant Moon.\u003c/p\u003e\n\u003cp\u003eNow, Leylin’s Dark Fireplume had been pushed to the peak of the Morning Star realm at the eleventh level.\u003c/p\u003e\n\u003cp\u003e‘This is definitely a phoenix egg! What other than a real phoenix could propel the progress of Fireplume and enhance one’s soul?’\u003c/p\u003e\n\u003cp\u003eLeylin immediately became incomparably excited. ‘I’ve only just taken in a part of its energy. If I use all…’\u003c/p\u003e\n\u003cp\u003eHe scanned his stats.\u003c/p\u003e\n\u003cp\u003e[Leylin Farlier, Rank 4 Warlock. Bloodline: Giant Kemoyin Serpent(complete form). Strength: 50, Agility: 45, Vitality: 65, Spiritual force: 956.8, Magic power: 956 (Magic power is in synchronisation with spiritual force). Soul force: ???]\u003c/p\u003e\n\u003cp\u003e“What a terrifying enhancement to the soul! Though I don’t know how much exactly it was, just the difference in spiritual force is frightening.” As he was mumbling, Leylin took a look at his innate elemental affinities.\u003c/p\u003e\n\u003cp\u003eThe red line that was in second place, the one that marked his fire affinity, had risen by a large amount. Although it still couldn’t compare to his darkness affinity, it left the third place far in the dust.\u003c/p\u003e\n\u003cp\u003e‘This isn’t bad either. If my darkness affinity was too high, I could easily have been forced under the control of the Snake Dowager, walking the full path of the Kemoyin Serpent. With this fire elemental affinity, I might be able to change my direction…’ Leylin’s eyes were glistening; the benefits he’d gained from this phoenix egg were immense.\u003c/p\u003e\n\u003cp\u003e“This egg is definitely the source of all the firasource stones. Let’s take it and go!” Gilbert and Emma saw the egg emanating a scarlet radiance, and their voices began to tremble in excitement. With their knowledge, they could obviously tell that this was the egg of some ancient being, and one that was very strong at that!　.\u003c/p\u003e\n\u003cp\u003eSuch powerful ancient creatures had been lost to the Magus World for tens of thousands of years. If the Ouroboros Clan could hatch one… Gilbert and Emma couldn’t help but immerse themselves in this beautiful fantasy.\u003c/p\u003e\n\u003cp\u003e“But…” Through the black flames, Leylin could see the energy in the egg falling rapidly, “So sad…” A piteous look flashed in his eyes.\u003c/p\u003e\n\u003cp\u003e“It’s had its life force extracted by Scarlet Eye multiple times. I took some just now myself, and its life energy has become far too weak for it to be hatched. We can only use it as an extremely precious fire elemental treasure.” Leylin sighed, moving to stow the egg away.\u003c/p\u003e\n\u003cp\u003e“YOU DARE…” an enraged voice sounded, the earth cracking apart and rumbling as it spoke. High-pitched phoenix cries sounded, and a whole layer of earth was ripped off, even the rocks and soil burnt to void by the flames.\u003c/p\u003e\n\u003cp\u003eA rare light illuminated the area, and the trio looked up to see the earth above them being dug up. Scarlet Eye charged down, looking like a sun with the flames he emitted.\u003c/p\u003e\n\u003cp\u003e“He came this quick? Zegna and that Divineflame Emperor are useless…” Leylin shook his head, but he didn’t stop the motion of his hands. “Withdraw immediately, I’ll hold him off for a while.”\u003c/p\u003e\n\u003cp\u003eNormally, Gilbert and Emma would have thought Leylin a fool for such a thing. He was, after all, a Morning Star trying to stop an enraged Radiant Moon. However, the series of miraculous breakthroughs in his strength had them thinking it was the opposite way around. They actually believed in him, and even subconsciously listened to his instructions. They took out necklaces that were emanating starlight, preparing to leave.\u003c/p\u003e\n\u003cp\u003e“Return it to me!” Large flaming claws motioned to grab the egg at the center, fighting the black flames over it.\u003c/p\u003e\n\u003cp\u003e“Leader Scarlet Eye! It’s been a long time.” The energy of the black flames increased rapidly as they attempted to devour flames at the thirteenth level of Fireplume. They exploded forth with power.\u003c/p\u003e\n\u003cp\u003eLeylin grinned as he soared up, the demonic black flames that began fill the area actually rivalling Scarlet Eye’s own.\u003c/p\u003e\n\u003cp\u003e“You’re… LEY!” Scarlet Eye’s pupils shrank. “Wretched Magus from another world, how dare you deceive me!”\u003c/p\u003e\n\u003cp\u003e*Swish!* Leylin made a grabbing motion with his palm, and Schiker’s unconscious body flew into his hands.\u003c/p\u003e\n\u003cp\u003e“Let’s make a deal, shall we? Let us go, and your son won’t come to any harm.” Leylin felt no guilt in using Schiker to blackmail the Atlan Union leader.\u003c/p\u003e\n\u003cp\u003e*Rumble!* The tremendous flames immediately wreaked havoc on the area, but Scarlet Eye flushed red. Leylin’s words obviously had a huge effect on him.\u003c/p\u003e\n\u003cp\u003eA long while later, he spoke through gritted teeth, “Alright, but the phoenix egg stays.”\u003c/p\u003e\n\u003cp\u003eWith the A.I. Chip’s scanning and the opponent’s own behaviour, Leylin immediately made a discovery. ‘Hmm? He’s injured?’\u003c/p\u003e\n\u003cp\u003eThis conjecture delighted him. With the suppression of the eleventh level Dark Fireplume alone, he wasn’t too confident in his chances. But now?\u003c/p\u003e\n\u003cp\u003e“No!” As the words left Leylin’s mouth, he and Scarlet Eye transformed into huge phoenixes. Two birds, one red and the other black, pounced towards the scarlet egg.\u003c/p\u003e\n\u003cp\u003eThe one Scarlet Eye had transformed into was huge, and had an overwhelming aura. And yet, although Leylin’s black phoenix was smaller, it burnt with devilish black flames that could devour all matter.\u003c/p\u003e\n\u003cp\u003e*Yuuu!* *Scree!* Two different phoenix calls sounded as they slammed into each other. Flames of black and gold surrounded the phoenix egg as the two began a bloody battle.\u003c/p\u003e\n\u003cp\u003e“Don’t you care for your child anymore?” Even in the midst of the fierce battle, Leylin did not miss the opportunity to disturb his opponent. Every sliver of fear he caused was an advantage.\u003c/p\u003e\n\u003cp\u003e“I won’t give it up, not even for Schiker! Besides, do you think you qualify to threaten me?” Scarlet Eye’s cold expression contrasted heavily with the fire energy he emanated, the flames burning even the air as it formed a giant phantom map of the Lava World. This image trapped Leylin.\u003c/p\u003e\n\u003cp\u003eHe was ambitious and ruthless. He did indeed love Schiker, but it was not to the extent that he could be threatened by Leylin. However, even that slight bit of reservation was more than enough for Leylin himself.\u003c/p\u003e\n\u003cp\u003e‘Damn it! Is this really Fireplume? Why are the flames black?!’ Scarlet Eye’s expression grew dark. This opposing Magus was also using the Emberwings’ Fireplume, and had progressed to the eleventh level in it. However, what was shocking was that his black flames were capable of controlling his own, and if not for him being at a higher level his flames would already have been completely eaten through.\u003c/p\u003e\n\u003cp\u003e‘This Magus cannot remain, his technique is forbidden!’ Malice flashed in Scarlet Eye’s eyes, and golden flames wrapped around the true body of the phoenix.\u003c/p\u003e\n\u003cp\u003e“Flaming Undead Aves!” The terrifying attack that had seriously injured two rank 5s appeared once more, its ferocious flames causing the clouds in the sky to be burnt to nothingness.\u003c/p\u003e\n\u003cp\u003eThe gigantic flaming undead aves streaked through the sky, causing all the battles to cease. The Emberwings began to revere the undead aves as if they had seen their god.\u003c/p\u003e\n\u003cp\u003e“This attack would have forced me into retreat at your peak power, but what a pity…” Leylin laughed madly, black flames engulfing everything as his entire person turned into a terrifying blackfire phoenix.\u003c/p\u003e\n\u003cp\u003e“Mutated Obscure Fireplume— Soaring Demonic Phoenix!”\u003c/p\u003e\n\u003cp\u003eThe Emberwings in the capital of the union saw a unique scene in the sky that day. A demonic black flaming phoenix rammed into their leader’s own phoenix form. Even the sparks from that battle would cause most Star ranks to quiver in fear.\u003c/p\u003e\n\u003cp\u003eThe leader’s entire residence was burnt to ashes by the flames, and besides a few Star ranks who coughed up blood and retreated quickly, everything was incinerated.\u003c/p\u003e\n\u003cp\u003e“Haha… Scarlet Eye, the Atlan Union leader, doesn’t amount to anything much!” Arrogant, hearty laughter sounded as a figure covered in black flames withdrew, his face filled with an insane smile.\u003c/p\u003e\n\u003cp\u003e“The leader… was defeated?” The Northern Duke who had met Leylin once flew backwards as he mumbled in disbelief.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-575\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-577\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-576","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
