{"id":59136,"no":580,"title":"Chapter 580","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVitality Bottleneck\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“In terms of techniques, the mutated Fireplume is probably comparable to a top-grade meditation technique…”\u003c/p\u003e\n\u003cp\u003eLeylin checked on the point mass in his sea of consciousness. After devouring the essence of Fireplume, the point mass had not only become more concentrated, with the nebula outside expanding by half, it now emanated a trace of fiery-red amongst the darkness.\u003c/p\u003e\n\u003cp\u003eAfter obtaining Fireplume, his aptitude had changed. Previously, his darkness elemental affinity was the main element. Now, his fire elemental affinity had been raised, and while it was still not up to par with the darkness element, it was catching up.\u003c/p\u003e\n\u003cp\u003e“My Kemoyin’s Pupil is no longer a meditation technique solely for Giant Kemoyin Serpent Warlocks, but a top-grade one infused with Fireplume.” Leylin obviously would not start training in Fireplume all over again. He was, at his roots, a Magus, and a bloodline Warlock at that. Hence, while running its simulations, the A.I. Chip had fused the essence of Fireplume into his point mass.\u003c/p\u003e\n\u003cp\u003eFireplume fused with Kemoyin’s Pupil. The two had been made compatible with previous simulations, and they now fused together to form a slightly mutated meditation technique.\u003c/p\u003e\n\u003cp\u003eThe effects of the technique far surpassed that of the fourth level of the original Kemoyin’s Pupil, and even allowed Leylin to see hope of simulating the fifth level!\u003c/p\u003e\n\u003cp\u003eOnce simulation of the meditation technique was complete, Leylin only needed to solve the bloodline issues and he would be able to rid himself of the bloodline shackles of rank 4, and pry open the realm of the Radiant Moon!\u003c/p\u003e\n\u003cp\u003e“Kemoyin’s Pupil doesn’t have a fifth level anyway. I’ll just continue calling this upgraded fused meditation technique the same thing.” Leylin continued to use the already given name with no intention to think of a new one.\u003c/p\u003e\n\u003cp\u003eWhether it was the twelfth and thirteenth levels of Fireplume or the fifth level of a meditation technique, they all enabled one to enter the Radiant Moon realm. Even if Leylin had some rough ideas about that, it would require a large period of time for him to comprehend them all.\u003c/p\u003e\n\u003cp\u003eEven so, it was still much better than having no hope at all.\u003c/p\u003e\n\u003cp\u003e“Besides Fireplume, I’ve recorded a lot of information regarding the culture, technology and geography of the Lava World. The A.I. Chip’s database is much more complete, and I’ve benefited quite a lot!” Leylin stroked his chin.\u003c/p\u003e\n\u003cp\u003eThe advantage of having the A.I. Chip meant that he could leave Magi far behind in the dust in terms of his learning speed. In other worlds, he was basically like a fish in water, recording even the most complicated information with just a sweeping scan by the A.I. Chip. He could analyse and understand everything quickly, and was much faster than Magi who had to study one book after another.\u003c/p\u003e\n\u003cp\u003eFor this reason, he could rapidly gain clarity on the path of strength in other worlds and fuse it into his own body, a unique advantage for himself.\u003c/p\u003e\n\u003cp\u003e“In general, the harvests were so immense during this trip to the Lava World, that my absorption is bursting at the seams…” Leylin glanced at his stats.\u003c/p\u003e\n\u003cp\u003e[Leylin Farlier. Rank 4 Warlock. Bloodline: Giant Kemoyin Serpent (Matured Body). Strength: 50, Agility: 45, Vitality: 65, Spiritual force:956.8, Magic power: 956 (Magic power is in synchronisation with spiritual force). Soul force: ???]\u003c/p\u003e\n\u003cp\u003e“The lowest numbers for spiritual force among Morning Star is 500 and above, and I’ve almost reached 1000! However, soul force has yet to be enumerated.”\u003c/p\u003e\n\u003cp\u003eLooking at the numbers, a wry smile appeared on his face.\u003c/p\u003e\n\u003cp\u003eHe had obtained much in the Lava World, especially with a few advancements in his soul that allowed his soul force to rise sharply in power. While the A.I. Chip could not show the numbers, just the difference in spiritual force implied that there was a large change.\u003c/p\u003e\n\u003cp\u003eSoul force was a higher-grade version of spiritual force. Hence, advancements in the soul could be seen through advancements in spiritual force.\u003c/p\u003e\n\u003cp\u003e“However, an increase of around 400 is already beginning to exceed the limits of what my body can handle!”\u003c/p\u003e\n\u003cp\u003eThe wry smile at the corner of Leylin’s lips grew even more obvious. Fireplume and the phoenix egg were treasures that put emphasis on the elements, but did not do much for strength.\u003c/p\u003e\n\u003cp\u003eWhile he had a large increase in spiritual force at one go, his body had already begun to show signs of an inability to endure.\u003c/p\u003e\n\u003cp\u003eThis was because there was too much water in the cup, and the cup was too small. Though there weren’t any obvious residual effects yet, Leylin could only turn into a spirit and walk the path of a spirit Magus if he did not treat this in time.\u003c/p\u003e\n\u003cp\u003e“To solve this, the essence is to strengthen my vitality and allow the body, as well as the spiritual force that suddenly increased, to grow harmonious once more, and get everything done once and for all.”\u003c/p\u003e\n\u003cp\u003eLeylin commanded, “A.I. Chip, with my current control, how much vitality do I need to sustain my spiritual force?”\u003c/p\u003e\n\u003cp\u003e[Beep! Mission established, scanning of stats of host body. Beginning construction of model. Beginning deduction…]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s robotic voice was heard as it formed a blue human figure in Leylin’s mind. Terrifying spiritual force undulations were emanated from the model.\u003c/p\u003e\n\u003cp\u003e[Deduction completed. To completely match with spiritual force, host must have a vitality of 100 or above!] The A.I. Chip intoned loyally.\u003c/p\u003e\n\u003cp\u003e“A vitality at 100 or above?” Leylin touched his chin.\u003c/p\u003e\n\u003cp\u003eAs the body was a vessel for spiritual force, Magi took vitality rather seriously. They even had some techniques and body-tempering spell formations just for this.\u003c/p\u003e\n\u003cp\u003eWith Leylin’s current state, with a vitality as high as 65, 90% of the techniques for increasing vitality were useless to him.\u003c/p\u003e\n\u003cp\u003eHowever, with his knowledge and the accumulations from his explorations in the past, he immediately had an idea.\u003c/p\u003e\n\u003cp\u003e“Not considering those remote techniques, Multilimb Strength is very suitable for me right now. Even in the worst situation, I can control my current condition and prevent it from getting worse!”\u003c/p\u003e\n\u003cp\u003eLeylin stood up with a flash of understanding and headed to another training room.\u003c/p\u003e\n\u003cp\u003e*Ka-cha!* His body suddenly contorted in a strange manner, arranging himself such that he looked like a strange rune. Bizarre joints and muscles could be heard vibrating within him.\u003c/p\u003e\n\u003cp\u003eThese vibrations combined and gradually formed a slightly hoarse voice.\u003c/p\u003e\n\u003cp\u003eThe voice seemed to be chanting some sacrificial text, full of a great, ancient feeling that also held within a barbaric air.\u003c/p\u003e\n\u003cp\u003e“Multilimb Strength!”\u003c/p\u003e\n\u003cp\u003e“Aoooo!” A shrunken seven-armed figure appeared behind Leylin, and with his chanting, more runes appeared from the Multi-Armed Race figure and disappeared into Leylin’s back.\u003c/p\u003e\n\u003cp\u003eWhen the ceremony was over, the rays of light from the Multi-Armed Race member disappeared into Leylin’s back and formed a strange golden image of the Multi-Armed Race, looking like a vivid tattoo.\u003c/p\u003e\n\u003cp\u003eMultiple golden threads scattered on Leylin’s skin and muscles, and everything quickly quietened down.\u003c/p\u003e\n\u003cp\u003eLeylin got up, looking at his palms. The skin was pale, bones slender, and there didn’t seem to be much of a difference. Occasionally, though, faint flashes of gold would be seen flashing within.\u003c/p\u003e\n\u003cp\u003eThere seemed to be a layer of dense armour on his body, which made it heavy. This was nothing to Leylin. More importantly, the instant the tattoo was completed, the pressure from having his spiritual force straining his body at all times, while not completely dissipating, had reduced.\u003c/p\u003e\n\u003cp\u003eSeeing this result, Leylin heaved a long sigh of relief.\u003c/p\u003e\n\u003cp\u003e“Though Multilimb Strength can’t increase my vitality, it has an effect of sealing and reinforcing the body, which can maintain my current state. When I find more body-tempering spell formations…”\u003c/p\u003e\n\u003cp\u003e“Now, I need to quickly take care of the allied forces who are still occupying the territories that belong to the Ouroboros Clan. I’ll then make use of the Ouroboros Clan’s forces and get them to help me find treasures, potions, or spell formations and the like that can increase my vitality…”\u003c/p\u003e\n\u003cp\u003eLeylin made plans for himself, feet continuing to move until he reached another secret room.\u003c/p\u003e\n\u003cp\u003eOn the door, there were many seals that formed a chain, locking the door tightly. However, a boiling heat could still be felt.\u003c/p\u003e\n\u003cp\u003e*Buzz!* A black flame automatically appeared from Leylin’s body, and it absorbed all the heat.\u003c/p\u003e\n\u003cp\u003e“Pretty good level of heat! It’s like another form of the phoenix’s flames!”\u003c/p\u003e\n\u003cp\u003e“A.I. Chip!” Leylin commanded inwardly.\u003c/p\u003e\n\u003cp\u003e[Beep! Limits to authority opened! Passed scanning!] Along with the A.I. Chip’s voice, two blue streams of data flashed from Leylin’s eyes, millions of ant-like golden words flickering and entering the seal.\u003c/p\u003e\n\u003cp\u003e*Ka-cha! Ka-cha!* The runic chain broke open, and terrifying golden flames surged out from behind the door.\u003c/p\u003e\n\u003cp\u003e*Skreeee!* As if provoked or challenged, the black flames on Leylin’s body grew more exuberant, forming a black layer of isolation that kept the door tightly shut.\u003c/p\u003e\n\u003cp\u003eLarge amounts of golden flames were eaten into and devoured by the black flames as they strengthened themselves.\u003c/p\u003e\n\u003cp\u003eSuch a devilish process left Leylin in shock.\u003c/p\u003e\n\u003cp\u003eAfter entering the secret room, one could see a giant world of ice and snow. At the heart, however, a golden sun was emanating rays of light. Numerous ice runes formed chains that restrained the sun, but it still produced a boiling heat.\u003c/p\u003e\n\u003cp\u003eIn that moment, there was a deadlock between the icy blue and fiery gold.\u003c/p\u003e\n\u003cp\u003e“The bloodline of the rank 6 Sun’s Child!” Leylin’s eyes were unfocused, the black flames automatically forming the figure of a devilish black bird. Crimson eyes were glued onto the little sun in the middle, looking fearful.\u003c/p\u003e\n\u003cp\u003e“It’s a pity…” Leylin sighed once again. This was the highest-ranked bloodline he had gained thus far.\u003c/p\u003e\n\u003cp\u003eAfter the phoenix egg had broken, it automatically formed a dense crystal and there were no traces of its bloodline remaining, leading Leylin to start wondering if the phoenix was a bloodline creature at all. There was no way to refine any ancient bloodline in this case.\u003c/p\u003e\n\u003cp\u003e“I have a feeling that the bloodline of the Sun’s Child is very compatible with Fireplume, but it’s a pity… I already have another bloodline…”\u003c/p\u003e\n\u003cp\u003eLeylin sighed. If he had the bloodline of the phoenix, he would change his bloodline no matter how difficult it would be. However, the bloodline of the Sun’s child? That was only rank 6, and wasn’t powerful enough to motivate him to take this risk.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-579\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-581\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-580","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
