{"id":59140,"no":584,"title":"Chapter 584","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eGiant Dragon Potion\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Leylin!” Gilbert and Emma had come over while Leylin was deep in thought. Their eyes were twinkling with joy.\u003c/p\u003e\n\u003cp\u003e“What’s this? You’ve acquired an interest in body tempering?” Emma had immediately made the connection after glancing at the mess of materials on the table.\u003c/p\u003e\n\u003cp\u003e“Mm. My soul has strengthened too much recently, and my physical body hasn’t been able to keep up.” Leylin nodded. This wasn’t any information worth hiding after all.\u003c/p\u003e\n\u003cp\u003e“Seriously,” Gilbert sat down speechlessly, “Us bloodline Warlocks have the advantage of increased vitality due to our inheritance of ancient genes. We’re ahead of Magi in this field, and normally we only have to worry about how to increase our soul force. There are practically no other people in your situation!”\u003c/p\u003e\n\u003cp\u003eLeylin’s monstrous growth rate was something Gilbert found difficult to digest.\u003c/p\u003e\n\u003cp\u003eLeylin laughed, and asked the two dukes some other questions about body tempering. However, both of them knew even less than he did, and could hardly give him any useful information.\u003c/p\u003e\n\u003cp\u003eIn the end, Leylin could only ask, “How much do you know about Sky City?”\u003c/p\u003e\n\u003cp\u003e“What?!” “Don’t tell me you’re going there!?” Both Warlocks stood up in shock.\u003c/p\u003e\n\u003cp\u003e“Why? What’s the matter?” Leylin asked with a smile.\u003c/p\u003e\n\u003cp\u003eThe Endowing Scepter kept in Sky City was a treasure that only Virtuous Sky Sages could come in contact with, and it had the ability to increase his physique by two levels without any side effects. To the present Leylin, that was a huge temptation.\u003c/p\u003e\n\u003cp\u003eTwo levels was roughly twenty points of vitality. With the additional ten points from the Giant Dragon Potion, his vitality would grow very close to a hundred points. The remainder could be increased slowly through Fireplume or Multilimb Strength.\u003c/p\u003e\n\u003cp\u003eTherefore, if he couldn’t find other methods to substitute for it, he had to go through with this.\u003c/p\u003e\n\u003cp\u003eAfter a moment of silence Emma spoke. “Leylin… Even though the Monarch of the Skies hasn’t targeted Warlocks before, you know the situation with our Warlock Union…”\u003c/p\u003e\n\u003cp\u003eDue to unknown reasons, bloodline Warlocks had been rejected and were treated as enemies by the regular Magi of the central continent. They had even reached the verge of extinction. Despite the tremendous efforts of the few Radiant Moon Warlocks, most Warlocks still felt quite unsafe. This was why the Morning Star Area had come up.\u003c/p\u003e\n\u003cp\u003eIf the Monarchs hadn’t given the suppression of Warlocks their tacit approval, this would have been impossible.\u003c/p\u003e\n\u003cp\u003eIn Emma’s eyes, Leylin was an up-and-coming talent who she had high expectations for, even someone who she considered a son-in-law. She naturally wouldn’t want Leylin to leave and expose himself to danger.\u003c/p\u003e\n\u003cp\u003e“Mentor Gilbert, what do you think?” Leylin could only laugh wryly inside, his eyes focusing on Gilbert.\u003c/p\u003e\n\u003cp\u003e“Let’s not talk about the Monarch of the Skies. Sky City is a holy land for Magi in the central continent, and is considered the Palace of Truth. Countless top-grade masters, artisans and scholars gather there, calling it the cradle of knowledge. In terms of innovations and advancements in spells, rapid progress is made every single day!”\u003c/p\u003e\n\u003cp\u003eGilbert scratched his bald head, recalling some fond memories from the past as his eyes shimmered.\u003c/p\u003e\n\u003cp\u003e“If you hadn’t already become a Morning Star Warlock and the pillar that’s propping up our Ouroboros Clan, my very first recommendation would be to go to Sky City if you intend to travel across the continent!”\u003c/p\u003e\n\u003cp\u003e“If this is the case, I’m even more interested in going there!” Leylin stroked his chin, yearning evident in his expression.\u003c/p\u003e\n\u003cp\u003e“Alright then, but you have to be extra careful. It’s best to hide your true identity.” Gilbert and Emma smiled wryly at each other. They knew Leylin well enough. He was the stubborn type, and now that he had already made his own decision, he would not change his mind easily. He just wanted to listen to their suggestions.\u003c/p\u003e\n\u003cp\u003e“I know!” Leylin crossed his arms, leaning slightly forward.\u003c/p\u003e\n\u003cp\u003e“Well then, is there any reason for you to come all the way here now?”\u003c/p\u003e\n\u003cp\u003e“Oh yes, of course! We’d even forgotten about that!” Gilbert slapped his forehead. He passed Leylin a recording crystal.\u003c/p\u003e\n\u003cp\u003e“After a month of hard fighting, we have finally regained all our territory. This is the new map we’ve drawn out.”\u003c/p\u003e\n\u003cp\u003eLeylin sent his soul force into the crystal, and immediately perceived a giant map. Different colours were used to divide the regions that belonged to the different bloodline nobles.\u003c/p\u003e\n\u003cp\u003eCompared to the previous map, there was not much of a change on the whole, but much of the nobles’ territories had been greatly modified.\u003c/p\u003e\n\u003cp\u003ePrimely, the territory that belonged to the nobles under the previous First Elder’s wings had been greatly reduced, reallocated instead to the Blood Serpent Family and more significantly the Farlier Family.\u003c/p\u003e\n\u003cp\u003e‘On the whole, both the dukes’ rights and benefits remain the same as before, while I get a hold of the territory and resources that originally belonged to the First Elder?’ Leylin pondered over this in his mind, though on the surface, just nodded, “I think this is fine! Let’s go with this redistributed map!”\u003c/p\u003e\n\u003cp\u003eOnly after Leylin agreed to this redistribution did Gilbert and Emma feel as if a weight had been lifted off their shoulders. After all, Leylin was far too crucial to the Ouroboros Clan, and if he was dissatisfied with the distribution and left the clan they would be in deep trouble.\u003c/p\u003e\n\u003cp\u003eLeylin laughed and shook his head as he saw both of these ‘senior’ Morning Star Warlocks in fear and trepidation before him.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Master! I’ve captured a third batch of Kobold Warlocks, and placed them in the binding room.” Tanasha bowed to Leylin as she reported. This Magus who was currently wearing a black dress had afforded him even more respect since his advancement, She had become very cautious with her work as well. At Leylin’s command, she had captured large numbers of Kobold Warlocks in the blink of an eye.\u003c/p\u003e\n\u003cp\u003e“Mm, good job!” Leylin knew exactly what she wanted.\u003c/p\u003e\n\u003cp\u003eHe laid lazily on the couch, waving his right hand slightly. A demonic dark flame formed on her forehead, leaving behind a distinct brand in the shape of a black snake.\u003c/p\u003e\n\u003cp\u003e*Hss! Hss!* Surrounding the snake were hazy flames. The snake looked as if it was alive, about to break through the thin membrane of skin at any moment,\u003c/p\u003e\n\u003cp\u003e“Master!” Tanasha knelt down in trepidation. She could feel terrifying power from the mark, enough to crush her into powder!\u003c/p\u003e\n\u003cp\u003e“This is my secret imprint, and is representative of me. I’ve also stored within a one-time attack from my own hands. Normal Morning Stars won’t be able to withstand it....” Leylin closed his eyes slightly as he spoke slowly. In the meanwhile, Tanasha was thrilled by his words.\u003c/p\u003e\n\u003cp\u003e“I’d once promised you at Quicksand Castle that once I was strong enough, and not afraid of retaliation, I would grant you your vengeance.” Indeed, this was the reason that Tanasha had chosen to serve under him.\u003c/p\u003e\n\u003cp\u003e“Yes, Master! It’s just that I never thought this time would come so soon…” Tanasha sounded a little unsteady. Leylin’s rate of advancement was far beyond her expectations.\u003c/p\u003e\n\u003cp\u003e“The family that you are going to take revenge on has no Morning Star. I have also talked to their backing organisation, and they won’t get in your way. You should be able to handle everything. The secret imprint I’ve left on you is your last resort!”\u003c/p\u003e\n\u003cp\u003e“Thank you, Master!” Tanasha’s choked as she sobbed, her eyes red as the memories of her being harmed and chased after came up. It was still extremely vivid in her mind, how she’d even have to hide in the wilderness to survive.\u003c/p\u003e\n\u003cp\u003e“Go!” Leylin waved his hand, and Tanasha exited respectfully.\u003c/p\u003e\n\u003cp\u003eAfter exiting the Magus Tower, Tanasha felt the secret imprint on her forehead, especially the immense power within it, and her eyes glinted with strength. “How have you been, Dove? I will be back soon...”\u003c/p\u003e\n\u003cp\u003eMost would think Tanasha and this Dove were very good friends from her words, but they would be frightened upon looking at the terrifying expression on her face.\u003c/p\u003e\n\u003cp\u003e“Deeply buried hatred that hasn’t dissipated over time. It’s instead fermented and grown…” After Tanasha left, Leylin stood up slowly, and announced something that sounded like a prophecy.\u003c/p\u003e\n\u003cp\u003eHe had a feeling that Tanasha’s trip back would be accompanied by a great amount of bloodshed and pain. The misery of being forced to leave home and the experience of hiding for survival was enough to turn Tanasha into a terrifying goddess of vengeance.\u003c/p\u003e\n\u003cp\u003eBut the history between them didn’t matter to him. No matter what had happened, Leylin would surely side with Tanasha, and for a very simple reason. He had no relationship with the other party, whereas Tanasha was his subordinate.\u003c/p\u003e\n\u003cp\u003eLeylin had always favoured people of his own. He followed his own set of rules, and would definitely side with his own people if they were engaged in conflict with outsiders. Were Freya to fight his subordinates, for example, he would support her. But in case the two of them fell out, he would choose to protect his own benefits.\u003c/p\u003e\n\u003cp\u003eHis personal benefits was in the core of his set of rules. The closer an external circle of benefits was to the centre, the more priority it received.\u003c/p\u003e\n\u003cp\u003eAs for fairness? Justice? To things like that…Haha.\u003c/p\u003e\n\u003cp\u003e“Tower genie! Begin the modulation of Kobold Warlocks based on the bloodline operation sequence I had entered earlier on!”\u003c/p\u003e\n\u003cp\u003eTake now for instance. Leylin’s interests were in conflict with those of the Kobolds, so he would not hesitate to sacrifice them.\u003c/p\u003e\n\u003cp\u003e[Beep! First stage of modulation beginning, increase in activity of bloodline…] The tower genie’s voice sounded. Meanwhile, sounds of mournful cries could be heard from the multiple cages under the Magus Tower...\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter days of experiments, Leylin held a purplish red bloodline potion in a test tube, his face filled with satisfaction, “Even though there were some failures in between, the Giant Dragon Potion is finally ready!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-583\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-585\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-584","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
