{"id":59145,"no":589,"title":"Chapter 589","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eLightwing\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe title of Virtuous Sky Sage was an honour given by Sky City to top scholars. As long as Magi had achievements in academics and were acknowledged by the Sage Committee, they could be awarded this title.\u003c/p\u003e\n\u003cp\u003eNot only was it an honour to become a Sage, there were benefits to it as well. Not only could they gain a bonus of two levels to their vitality from the Endowing Scepter, they also had the opportunity to join Sky City themselves. Even if they did not enter, the Monarch of the Skies would still protect them, and they would be able to move around the central continent without obstruction.\u003c/p\u003e\n\u003cp\u003eHence, whether it was for the fame, the benefits, or just to make up for their weaknesses in academics, large numbers of scholarly Magi came here every year, which allowed Sky City to gain the good reputation of being the cradle of truth.\u003c/p\u003e\n\u003cp\u003eEven if he couldn’t pass, just gaining the favour of the Monarch of the Skies and being baptised by the Endowing Scepter once was no big issue.\u003c/p\u003e\n\u003cp\u003eLeylin was now feeling very confident. The gift he had prepared would surely move rank 6 Breaking Dawn Magi!\u003c/p\u003e\n\u003cp\u003eHow could the coordinates of another world not be enough? He’d never promised Wayde not to give away the coordinates of the Lava World to a third party anyway.\u003c/p\u003e\n\u003cp\u003eIt was attractive enough that the Monarch of the Skies could make an exception.\u003c/p\u003e\n\u003cp\u003eHe was just unsure if Wayde and Zegna would cough up blood after finding out about this.\u003c/p\u003e\n\u003cp\u003eWhich Magus would not take the secret of a world’s coordinates to their grave? Only a freak like Leylin would actively go around, using it as a gift and giving it to others.\u003c/p\u003e\n\u003cp\u003e“Boffel!” The person who had arrived announced his name.\u003c/p\u003e\n\u003cp\u003eAs he began to judge the Magus opposite him, the first word that came to Boffel’s mind was ‘Young’! Whether it was his handsome face or the surging life force, everything gave him a sense of youth.\u003c/p\u003e\n\u003cp\u003e“Based on the rumours, Lord Leylin should be less than three hundred, yes? You’ve already become a Morning Star and gained such a huge reputation!”\u003c/p\u003e\n\u003cp\u003eBoffel observed this genius Warlock. He wore gilded robes and gloves. His eyes were full of warmth and his smile was like the sunshine. With the crescent dangling from his earlobe, his handsome face was the type that young, teenaged girls or even female Magi would go crazy over.\u003c/p\u003e\n\u003cp\u003e“So it’s Lord Boffel!” Leylin looked at this person who seemed very similar to an angel, and had no idea how to react. However, the Morning Star radiation from his body was something that could not be imitated.\u003c/p\u003e\n\u003cp\u003eThe Monarch of the Skies held control of various organisations across the continent, and had quite a few Radiant Moons under his wing. Obviously, the Morning Stars subordinate to him were much larger in number. Boffel here was one of them.\u003c/p\u003e\n\u003cp\u003eOfficial Magi could make modifications to their own bodies. By the time a Magus reached Morning Star, they were almost guaranteed to have something strange on their bodies. Presently, Leylin could not tell if the other party’s shining wings were due to his bloodline or some sort of spell. The only way to confirm would be to run tests on him.\u003c/p\u003e\n\u003cp\u003e“Are you here as a representative of the Ouroboros Clan, my Lord? What is it that you require?” Boffel asked after the greetings. This was a question that had been weighing on his mind for a while. He had heard of the Ouroboros Clan’s recent activities, as well as of their conflict with Jupiter’s Lightning. It was unlikely that Leylin would come out at such a crucial time for a holiday.\u003c/p\u003e\n\u003cp\u003e“Mm! I heard that the appraisal for Virtuous Sky Sages is about to begin. I’ve come bearing the truth!” Leylin did not conceal his motives.\u003c/p\u003e\n\u003cp\u003e“Appraisal?!” Boffel was dumbstruck. Never could he have expected that Leylin would actually be interested in this,\u003c/p\u003e\n\u003cp\u003eThe title of Virtuous Sky Sage was only something that made it more convenient for scholars to travel across the continent. However, Leylin was already at Morning Star. Which organisation would not give him face?\u003c/p\u003e\n\u003cp\u003eBenefits, honour and the like were as fleeting as cobwebs to Morning Star Magi. Perhaps the only thing they would regard with importance would be the baptism of the Endowing Scepter for them, the only thing that they regarded as important would be the baptising through the Adept Scepter.\u003c/p\u003e\n\u003cp\u003eAn increase of almost 20 points in vitality was very attractive even to Morning Stars.\u003c/p\u003e\n\u003cp\u003e“The Sage Appraisal is a public selection of Magi throughout the central continent. Am I not qualified?” Leylin asked with a smile.\u003c/p\u003e\n\u003cp\u003e“Of course you are! Lord Leylin’s presence is sure to make the appraisal more exciting than usual!” Boffel answered without any hesitation.\u003c/p\u003e\n\u003cp\u003eThe Sage Appraisal had long since gained a reputation for its independence of factions and status. It held the unanimous approval of all of the central continent’s Magi, which was how it had become a holy land in the first place. It took in fresh blood all the time, and Boffel would be a fool to refuse Leylin.\u003c/p\u003e\n\u003cp\u003e“Hehe… In that case, please follow me to the temporary villa we’ve prepared for you. You can organise the thesis that you wish to present as well as your experiments, and wait for the appraisal to begin!”\u003c/p\u003e\n\u003cp\u003eBoffel’s invitation was enthusiastic. Though they were few in number, Morning Stars were known to attend the Sage Appraisal, and Sky City had its own policy on dealing with this.\u003c/p\u003e\n\u003cp\u003eIn general, as long as the Magi who came forward did not break laws and had no restrictions placed on themselves, they could do as they wished and would need to be received warmly.\u003c/p\u003e\n\u003cp\u003e“Many thanks!” Leylin did not reject Boffel’s invitation.\u003c/p\u003e\n\u003cp\u003eNo matter where he went, he would be monitored anyway. He could just move into the place that had been specified, and he would be treated well too.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“My Lord!” A maid wearing a pure white silk gown was respectfully holding a towel and other items, waiting for Leylin’s summon.\u003c/p\u003e\n\u003cp\u003e“This is a pretty good place!” Leylin had on a loose white robe and was half reclining on a chair made of jade and stone. Within arm’s reach were fine food and good liquor.\u003c/p\u003e\n\u003cp\u003eHe was now inside a gigantic white villa. The whole place seemed to be made entirely out of white marble, resulting in an aura of refined elegance. Three fountains were placed next to Leylin, spurting out fragrant spring water.\u003c/p\u003e\n\u003cp\u003eOutside was a flowering garden with a lawn. The lands of the villa were very expansive, and in Sky City where every inch of land was extremely valuable, this was practically unbelievable.\u003c/p\u003e\n\u003cp\u003eOf course, special privileges and preferential treatment were inevitable and only rightful when it came to Morning Stars.\u003c/p\u003e\n\u003cp\u003eAfter bringing him to this area and instructing the staff inside to take care of him, Boffel left in a hurry, probably to report to his superiors.\u003c/p\u003e\n\u003cp\u003eHierarchy was etched deep into the minds of the people in the Magus World. Even if Leylin displayed his incredible battle might and terrifying talent, the one receiving him was merely a Morning Star.\u003c/p\u003e\n\u003cp\u003eThe real ruler of Sky City, his Majesty, the Monarch of the Skies, was still acting behind the scenes alongside with the other Radiant Moon.\u003c/p\u003e\n\u003cp\u003e“You are a Lightwing?” Leylin couldn’t help but ask after seeing the white feathers behind this maid’s back.\u003c/p\u003e\n\u003cp\u003e“Yes, my lord!” This maid was rather tall and slender. Her legs and body were perfectly proportionate, resulting in a smooth curve.\u003c/p\u003e\n\u003cp\u003eThe Lightwings were one of the winged races. They had an exceptional sensitivity to light elemental energy particles, and usually had very good results when training in light-type high-grade meditation techniques.\u003c/p\u003e\n\u003cp\u003eShe seemed to be using a three level meditation technique.\u003c/p\u003e\n\u003cp\u003eOf course, if she were of Boffel’s level of strength, Leylin would be unable to identify her bloodline and specific meditation technique, as they were both at the Morning Star realm.\u003c/p\u003e\n\u003cp\u003e“What’s your name?” Leylin took a towel from the other party and wiped his hands as he asked in curiosity.\u003c/p\u003e\n\u003cp\u003e“Yuro, my lord!” The Lightwing maid spoke as if in a hurry. Leylin’s presence just put too much pressure on her, even if he intentionally withheld his energy undulations.\u003c/p\u003e\n\u003cp\u003e“Accompany me outside.” Since he had come to the place called the cradle of truth, how could Leylin miss a chance to go out? Besides, he had come as a guest. Boffel would be stupid to dare restrict his freedom.\u003c/p\u003e\n\u003cp\u003eHowever, he was currently in someone else’s territory. With Boffel being backed by the Monarch of the Skies, Leylin had to give him some face and bring the maid along.\u003c/p\u003e\n\u003cp\u003e“Al- Alright!” Yuro lowered her head deeply. As a maid of this villa, she obviously knew her duties.\u003c/p\u003e\n\u003cp\u003e“Let’s go!” Leylin stretched before taking the lead.\u003c/p\u003e\n\u003cp\u003e“Do you know where the Great Library is?” Leylin was most interested in this place. The information in his A.I. Chip only came from the Ouroboros Clan and what he’d gathered himself during his travels. Compared to the entirety of the central continent, that was like a drop in the ocean.\u003c/p\u003e\n\u003cp\u003eThe Sky City, however, was different. Not only was it the territory of the Monarch of the Skies, it was also the holy land of knowledge, the academic center of the entire central continent.\u003c/p\u003e\n\u003cp\u003eThe knowledge they had accumulated was bound to be at a terrifying level. How much would the A.I. Chip grow after he acquired all of it?\u003c/p\u003e\n\u003cp\u003eKnowledge was power among Magi. This was no longer just a maxim, and had instead become a fundamental truth.\u003c/p\u003e\n\u003cp\u003e“The Great Library is beside the Sky Plaza. Would you like to go there, my Lord?” Yuro asked in a low voice. As she raised her head, Leylin’s near devilish handsomeness warmed her face.\u003c/p\u003e\n\u003cp\u003e“Of course! I’ve long since been interested in the largest library in the entire central continent!” There was a hint of worship in Leylin’s tone. There was a thirst and worship of knowledge specific only to those who were keen to learn the truth.\u003c/p\u003e\n\u003cp\u003e“Understood, my Lord. Please come with me!” Yuro began to lead the way.\u003c/p\u003e\n\u003cp\u003eHer long, soft hair came loose, occasionally floating above the feathered wings on her back, as it it were sitting on a gentle breeze.\u003c/p\u003e\n\u003cp\u003eLeylin rubbed his nose and followed with a laugh.\u003c/p\u003e\n\u003cp\u003eAfter heading out of the residential area, the shadows of conical buildings were seen as the buildings covered the glaring sun in the sky. There were plants growing beside the spotless streets. The bustling streams of people travelled back and forth, making Leylin feel like he had returned to his previous world.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-588\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-590\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-589","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
