{"id":59157,"no":601,"title":"Chapter 601","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Return To Twilight Zone\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eA tremendous volcano thundered and bellowed, as if a giant from the legends launching a flaming iron fist into the skies.\u003c/p\u003e\n\u003cp\u003eLava fell like rain, forming rivulets that flowed together to become a network of rivers.\u003c/p\u003e\n\u003cp\u003eThe black volcano towered high into the sky, looming over the region just like the clouds and causing the skies and the ground to turn dark.\u003c/p\u003e\n\u003cp\u003eThe lava glowed red, flickering between dark and bright. The scene was magnificent, a rose amidst the thorns.\u003c/p\u003e\n\u003cp\u003e“Mount Asura! It’s been such a long time. I’ve never come back since I arrived at the central continent…” Leylin’s eyes were filled with a certain profoundness. The events that brought him to the central continent and the people and his history with Twilight Zone became incomparably vivid once more.\u003c/p\u003e\n\u003cp\u003eIndeed, Leylin was preparing to leave the central continent for a while and return to Twilight Zone. Even though that place was barren and inadequate compared to the central continent, it held a treasure trove that only he knew of.\u003c/p\u003e\n\u003cp\u003e‘The body of the Scorpion Man, as well as the blood of the protector of the Icy World!’ Leylin’s thoughts drifted to the contents of the Icy Jade Scorpion Emperor’s memories that he had acquired from its bloodline when he explored the Icy Cave.\u003c/p\u003e\n\u003cp\u003eThat terrifying ancient battle still brought shivers to his spine to this day; even Morning Stars barely met the requirements to participate in it.\u003c/p\u003e\n\u003cp\u003eThe remains of a Morning Star level bloodline creature were only a small treasure to Leylin, and didn’t mean much, but the bloodline of that bronze female giant wasn’t so simple.\u003c/p\u003e\n\u003cp\u003eThat was a bloodline that crossed rank 7, one that had already begun to touch upon laws! In front of that, the current Leylin was like a moth drawn to the flame. Whether it be refining the ancient bloodline into an imprint or trying to assimilate it, either one of these actions would be extremely helpful to him.\u003c/p\u003e\n\u003cp\u003eParts of his hopes for advancing to the Radiant Moon realm were placed on this. Furthermore, the protector of such a world would definitely have information about the world’s coordinates in its bloodline and genetics.\u003c/p\u003e\n\u003cp\u003eThat was the powerful ancient Icy World that even the Snake Dowager coveted and yet was unable to occupy! It was an unknown number of levels more important than the Lava World, and Leylin would be the sole benefactor of it.\u003c/p\u003e\n\u003cp\u003eIt was because he had this that he was confident enough to give away the coordinates to the Lava World as a gift.\u003c/p\u003e\n\u003cp\u003eLeylin had other plans for the Icy World and the female giant’s bloodline.\u003c/p\u003e\n\u003cp\u003eWhen she had been killed by the Snake Dowager, would her body retain any scent or aura from the Purgatory World, which would allow him to deduce the coordinates of that world?\u003c/p\u003e\n\u003cp\u003eEven if it wasn’t on her body, the Icy World had been invaded by the Snake Dowager who had come from the Purgatory World, so how could there not be any traces left behind?\u003c/p\u003e\n\u003cp\u003eWith the Icy World as a springboard, the difficulty in locating the Purgatory World would be reduced by a large amount. Once at the Purgatory World, finding the bloodline primogenitor, the Snake Dowager, would make breaking through the bloodline shackles a simple task.\u003c/p\u003e\n\u003cp\u003eOf course, the whole process wouldn’t be that simple, but the general idea wasn’t bad, and it was the best way to break through the bloodlie shackles.\u003c/p\u003e\n\u003cp\u003eOf course, Leylin did not dare confront the Snake Dowager just like that. That was basically sending a lamb into a tiger’s den. He didn’t believe that he had any way of resisting strength that had surpassed that of Breaking Dawn and controlled Laws. Therefore, ample preparation was necessary, and this method could only be used as a last resort. Unless all his other options were exhausted, Leylin didn’t even want to consider this option.\u003c/p\u003e\n\u003cp\u003eHe would lie low in the Twilight Zone, and find a way to break through to Radiant Moon. That was Leylin’s basic plan.\u003c/p\u003e\n\u003cp\u003e“Mount Asura will be dormant for a period of time every hundred years, which makes it the best time to go underground right now!” Leylin recalled the time he had come up from the subterranean world. While he had grasped the right timing and prepared well, it had still been very dangerous. He could not help but smile slightly at that.\u003c/p\u003e\n\u003cp\u003eHe came to the crater of the volcano, and observed the terrifying lava channel.\u003c/p\u003e\n\u003cp\u003e“The volcano is filled with boiling hot lava all year round, and only when it’s dormant will a channel show itself. It’s still not time yet… even if a Crystallised Phase Magus were to charge down there, they would be burnt to smithereens.…”\u003c/p\u003e\n\u003cp\u003eOf course, that was for rank 3 Magi. After he reached the Morning Star realm, what should have been horrifying and dangerous was as safe and stable as the garden in his backyard.\u003c/p\u003e\n\u003cp\u003e*Rumble!* A layer of black flames appeared on the surface of Leylin’s body, forming an oval layer that wrapped him within. A black bubble parted the lava, quickly disappearing into the depths…\u003c/p\u003e\n\u003cp\u003eThe terrifying heat from the lava was absorbed by the black flames, blocking all from Leylin who was contained within. As time passed, the black bubble endured the spurts of lava to head straight down.\u003c/p\u003e\n\u003cp\u003eHe was withstanding a natural disaster on his own and going through the lava against the current. Even Mount Asura erupting could do little against him. This was the power of a Morning Star!\u003c/p\u003e\n\u003cp\u003e*Boom!* In the subterranean world, large amounts of magma flew out of a pool, accompanied by tremors. A bubble of black flame burst through the thick, durable rocks at the top and fell to the ground. Leylin’s figure appeared once more as he withdrew the flames.\u003c/p\u003e\n\u003cp\u003eCompared to before when he had to rack his brains and look for opportunities, the current Leylin could travel anywhere as and when he wished. It was extremely convenient.\u003c/p\u003e\n\u003cp\u003eSeeing the dark sky and the stifling rock ceiling, Leylin sighed, “Twilight Zone, I’m back!”\u003c/p\u003e\n\u003cp\u003eFeeling the large difference in the concentration between the central continent and this place, Leylin shook his head, “It’s no wonder that Morning Stars pay no attention to this, the elemental particle concentration is so low here.”\u003c/p\u003e\n\u003cp\u003eCompared to the central continent, this place was like the barren countryside, if even that. The restriction of a low particle concentration would reduce the might of any spells used here by a large amount.\u003c/p\u003e\n\u003cp\u003eMorning Stars cared little for this place, and regular Magi had no way to pass through the lava channel. Hence, Twilight Zone still retained its own path, and the influence from the external world was minimal up till Leylin’s arrival.\u003c/p\u003e\n\u003cp\u003eOne sweep of his soul force and the surroundings were displayed in his mind. He had been the master of Twilight Zone in the past, and was somewhat familiar with the general area. He knew where he was instantly.\u003c/p\u003e\n\u003cp\u003e“When I left, there wasn’t even a rank 3 Magus in Twilight Zone, right?” Leylin touched his chin. Here, even rank 2 Magi could be considered the rulers, while rank 3 were the emperors. Morning Star? There hadn’t been one in years.\u003c/p\u003e\n\u003cp\u003e“Am I like a high-levelled player in a newbie village, crushing everyone here?” Leylin touched his chin, a grin on his face, “But I like it!”\u003c/p\u003e\n\u003cp\u003eIt was a fool’s behaviour to still try to fight even when the enemy was powerful. Even if one could win for a while, a single failure would leave him with no hope of reprieve.\u003c/p\u003e\n\u003cp\u003eLeylin did not like these methods. Often, he would act only when he was very confident, and all he hoped for was for the Magi in the world to all be at rank 1 and 2, which made it easy for him to manipulate them.\u003c/p\u003e\n\u003cp\u003eIt was because he had this stable mindset that he could leave till today.\u003c/p\u003e\n\u003cp\u003e“I wonder how Nature’s Alliance Academy is doing. Has Celine been able to take care of it? And then there’s the dark elves, gnomes and other races…” After he determined the direction, Leylin’s body turned into a streak of light as it hurried towards the headquarters of the northern Nature’s Alliance academy.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe northern region, Nature’s Alliance academy.\u003c/p\u003e\n\u003cp\u003eEternal Light spells brightened up the room, reflecting a black desk with innumerable documents on the surface, as well as ink, quill pens and other stationery.\u003c/p\u003e\n\u003cp\u003eA female Magus with a delicate face wearing luxurious upper-class clothing kneaded at her brows with slender fingers, seeming very tired.\u003c/p\u003e\n\u003cp\u003e“Director!” The door was pushed open, and a female Magus hugging a file ran in hastily.\u003c/p\u003e\n\u003cp\u003e“Urgent news from the frontlines! Potti City has been attacked again. All of our subordinates were killed, and two professors were even…”\u003c/p\u003e\n\u003cp\u003e“Alright.” The beautiful director nodded her head from behind the desk, giving a drawn-out sigh. “Almost a hundred years ago, the fall of the northern region also started from Potti City. I just don’t know if anyone will come and turn the situation around this time…”\u003c/p\u003e\n\u003cp\u003eShe stood up and pulled the curtains open.\u003c/p\u003e\n\u003cp\u003eThere was a gigantic square of the academy outside the windows. At the middle, the statue of a young Magus stood proudly, still having a slight radiance.\u003c/p\u003e\n\u003cp\u003e“Leylin, where are you? With your strength, I’m sure you must be doing well wherever you are, right?” This beautiful director was naturally Celine.\u003c/p\u003e\n\u003cp\u003eWhen Leylin had left Twilight Zone, he had left behind a series of tricks, allowing Celine to take control of Nature’s Alliance academy for almost a century. She had also advanced to rank 2. However, the academy was now facing the largest crisis since its establishment!\u003c/p\u003e\n\u003cp\u003eThe tide of darkness creatures had come forth once more! And in this wave, there were countless beast emperors that had mutated and reached rank 3!\u003c/p\u003e\n\u003cp\u003eThat was not all. The gnomes and elves had now joined hands in rebellion and distanced themselves from the humans. They were now attacking in the north as well.\u003c/p\u003e\n\u003cp\u003eThe defensive stronghold of the north, Potti City, had fallen under the cooperation of the three races, and two rank 2 professors from Nature’s Alliance had fallen as well.\u003c/p\u003e\n\u003cp\u003e“Director, we need to react to this, or Lord Banker will use this opportunity to create issues! The exchange between academies is about to begin as well, and I’m afraid…” Concern was evident on this female Magus’ face.\u003c/p\u003e\n\u003cp\u003eAfter hearing this, the look of helplessness on Celine’s face grew more obvious. The immense pressure came not only from the outer world, but also the inner departments. Banker had initially been an ordinary professor of Nature’s Alliance, but he’d had a miraculous encounter and gained the inheritance of some ancient Magus. His strength had shot up, and had now entered rank 3!\u003c/p\u003e\n\u003cp\u003eWith power, he obviously desired the corresponding status. In Banker’s eyes, that would be Celine’s position.\u003c/p\u003e\n\u003cp\u003eThough he was fearful of Leylin, which meant Banker did not dare go too far, there were still countless Magi who sided with him. After all, Leylin had already disappeared for almost a century.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-600\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-602\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-601","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
