{"id":59160,"no":604,"title":"Chapter 604","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Invincible \u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Since when has the strength of other tribes and the darkness creatures grown to such a point?” Celine bit her lips, blaming herself slightly and feeling a little remorseful.\u003c/p\u003e\n\u003cp\u003eLeylin’s rule had forced the other races in Twilight Zone to slavery, only to be exploited by human Magi. It was unexpected that in just a hundred years’ time, they had actually gotten powerful again.\u003c/p\u003e\n\u003cp\u003eIf not for Leylin’s appearance today, even if the opponent hadn’t launched a sneak attack they could’ve won just based on this army that infiltrated their borders. It could practically wipe out all the human Magi.\u003c/p\u003e\n\u003cp\u003eAfter all, before this the humans had only one rank 3 Magus, Banker.\u003c/p\u003e\n\u003cp\u003e“Luckily, there’s still him!” Celine looked at Leylin’s silhouette, eyes filled with an unconcealable pride.\u003c/p\u003e\n\u003cp\u003eAs Leylin looked at the beautiful ruler of dark elves, he could not help but let out a chuckle, “Alicia! I didn’t expect to see another familiar face. Not only have you advanced to rank 3, you’ve also become the queen of the dark elves. It’s truly worth congratulating!”\u003c/p\u003e\n\u003cp\u003eHowever, as this laughter echoed in the opposing queen’s ears, her entire body grew rigid. It was as if she had been struck by lightning.\u003c/p\u003e\n\u003cp\u003eThe many humiliations that the owner of this voice had brought to the dark elves immediately appeared in her mind, something that Alicia would never forget.\u003c/p\u003e\n\u003cp\u003eYes, this new ruler of the dark elves was impressively, Leylin’s old ‘friend’— the matriarch of dark elves, Alicia. Even that time, it was her who had surrendered to Leylin outside Potti City, personally offering the high-grade meditation technique of the dark elves and their piece of magic equipment.\u003c/p\u003e\n\u003cp\u003e“You’re Leylin! Leylin Farlier!” The opposing queen directed her gaze that was on Celine towards Leylin, gritting her teeth.\u003c/p\u003e\n\u003cp\u003eWhen Leylin restrained himself, he seemed just like an ordinary person, and it made the other rank 3s overlook him.\u003c/p\u003e\n\u003cp\u003eBut with Leylin speaking, a sort of confidence that came from a control of the overall situation emerged from him, making him seem outstanding and superior.\u003c/p\u003e\n\u003cp\u003e“It’s him! The humans’ Radiant Guardian!”\u003c/p\u003e\n\u003cp\u003e“I’ve seen his portrait before, I’m definitely not wrong!” One after another, the other races exploded with rage. The fear that Leylin instilled in them was etched deeply.\u003c/p\u003e\n\u003cp\u003e“Mass murderer! Butcher! Leylin Farlier, repay my father’s and the other tribes’ hatred with your blood!” The sturdy dwarf ruler jumped out, a hammer in hand which seemed to be made of thunder.\u003c/p\u003e\n\u003cp\u003e“Oh! I remember now, you’re that lucky survivor from the dwarf royal family right? The little rascal who hid in the corner of the palace, not daring to move at that time…” Leylin patted his head with an amiable sense of familiarity.\u003c/p\u003e\n\u003cp\u003eYet, this expression and his words had instead caused the dwarf to instantly fly into a rage.\u003c/p\u003e\n\u003cp\u003eLeylin was not bothered by him. He turned his attention to the gnome steering the large robot, “Hm… a mechanical colossus… You gnomes have managed to create another one? The craftsmanship has improved as well, and the problem of low battery has been solved as well!”\u003c/p\u003e\n\u003cp\u003e“Sir Leylin’s knowledge really leaves me in awe for life. Furthermore, if you hadn’t seized our most precious gnome’s book at that time, I believe we could still have sat down happily for a chat…” The one controlling the frightening colossus was an old, senile gnome whose hands were covered with all sorts of scars and burns.\u003c/p\u003e\n\u003cp\u003e“Oh, there’s also rank 3 beast emperors,” Leylin looked at the three mountainous darkness creatures at the side, “This is great!”\u003c/p\u003e\n\u003cp\u003e“What’s great? Is he mad?”\u003c/p\u003e\n\u003cp\u003e“Even if he is the former Radiant Guardian, for a rank 3 to think of fighting us all together is too arrogant of him…” Many of the tribes began to clamour.\u003c/p\u003e\n\u003cp\u003eAlicia, on the other hand, was different. People like her had seen how terrifying Leylin could be, and they had a bad premonition instead.\u003c/p\u003e\n\u003cp\u003eEven if she had advanced to rank 3, the fear she held towards Leylin had once more surfaced from deep in her memories after she saw him in person.\u003c/p\u003e\n\u003cp\u003eOn top of that, he had such a confident expression and there was an enigmatic aura on his body…\u003c/p\u003e\n\u003cp\u003eAlicia’s expression changed several times, and at last, she kneeled in front of Leylin before the widened eyes of the many Magi and tribes, “Alicia greets the Lord, the Radiant Guardian! Please forgive my tribe’s mistake this time!”\u003c/p\u003e\n\u003cp\u003e“Grand Matriarch! How can we just let them go like that?”\u003c/p\u003e\n\u003cp\u003e“Is the humiliation that the humans have already brought us not enough? How can we simply grovel at their feet like that?” Even before Alicia’s allies spoke, the matriarch under her caused an uproar.\u003c/p\u003e\n\u003cp\u003e“Enough! I am the Grand Matriarch of the dark elves. I will take responsibility for this matter alone!” Alicia responded coldly.\u003c/p\u003e\n\u003cp\u003e“Haha… Good! Alicia! I admire your ability to have a clear view of things!” Leylin clapped and laughed heartily.\u003c/p\u003e\n\u003cp\u003e*Roar!* Seeing that something seemed amiss, a small black elephant, one of the beast emperors with large fleshy wings on its back started howling in tandem with a two-headed leopard. Both of them pounced towards Leylin. A terrifying power beyond the normal rank 3 level caused the earth to tremble.\u003c/p\u003e\n\u003cp\u003eAt the same time, a beast emperor in the form of a large blue ape secretly slipped away from behind.\u003c/p\u003e\n\u003cp\u003eThe movements of a few emperor darkness creatures seemed to trigger some sort of chain reaction; the tribes at the opposite side had join forces to attack Leylin together. Ignoring the indecisive dark elves and Alicia who was still kneeling, the dwarf ruler threw the large hammer in his hands with a howl, and terrifying blue thunderbolts swept across the area. The colossus, too, created a roaring sound that caused many rank 2 Magi to retreat with pale faces.\u003c/p\u003e\n\u003cp\u003eThese tribes were attacking with a common target in mind— Leylin!\u003c/p\u003e\n\u003cp\u003eFour rank 3 attackers led the charge! On top of that were a whole group of fighters that were as strong as rank 1 and 2 Magi, many of them using treasures. Such an attack would leave even Crystal Phase Magi seriously injured as they fled.\u003c/p\u003e\n\u003cp\u003eIn the face of this earth-shattering attack, Leylin’s kept an unchanging expression, chuckling as he spoke, “Do you know why I said this is great just now? It’s because, with all of you gathered together, I don’t have to go through the effort of going to your lairs to finish you off one by one!”\u003c/p\u003e\n\u003cp\u003eImmediately, a terrifyingly strong energy wave burst forth from his body. A starry domain expanded, engulfing the entire area within it.\u003c/p\u003e\n\u003cp\u003eMany energies were snuffed out in an instant, and all of the energy attacks within the Morning Star domain had completely dissipated, exposing the silhouettes of the foreign races, all of them at a loss.\u003c/p\u003e\n\u003cp\u003eAll Leylin had done was release the power of his domain, and the joint attack of the many tribes had been nulled completely!\u003c/p\u003e\n\u003cp\u003eSurging waves! Surging waves of disbelief and fear rolled in their hearts!\u003c/p\u003e\n\u003cp\u003eAll the Magi who had been worried about Leylin just now were stunned. Seeing the tribes’ combined attack, they’d thought nothing could surpass that amount of power. However, the moment Leylin made his move was the moment they realised that what they’d been looking at was like the glow of a firefly in the night. Although such a glow was visible in the dark, once the sun came up, they would disappear without a trace.\u003c/p\u003e\n\u003cp\u003eThe frightening aura being emitted from Leylin’s body was so powerful that these Magi could not help but kneel down, not daring to harbour any other thoughts at all.\u003c/p\u003e\n\u003cp\u003e“Such strength?” Will stood behind Leylin, but he could not help but kneel either. He only felt that the Leylin now was entirely different from before. He was like the sun, moon and stars in the sky, up high and eternal.\u003c/p\u003e\n\u003cp\u003e“This… this is the domain that belongs to a Morning Star!” Celine murmured, her tears spilling out helplessly. She finally understood the magnitude of the opportunity she had lost at that time, and that she could never get it back.\u003c/p\u003e\n\u003cp\u003e*Ka-cha!* As if hitting emergency brakes, the elephant and the two-headed leopard suddenly stopped. They retreated with even greater speed, their bodies bursting forth with blood-red light. Their massive bodies rapidly grew emaciated, making it obvious that they had utilised some secret technique which exhausted a lot of energy.\u003c/p\u003e\n\u003cp\u003e“Still want to escape?” Leylin shook his head.\u003c/p\u003e\n\u003cp\u003eTwo gigantic, yellowish-brown palms extended from the ground with a sudden boom, grasping the two beast emperors within. The sound of bones shattering could be heard, and be it physical attacks or magical attacks the two could not leave a scratch on the palms..\u003c/p\u003e\n\u003cp\u003eThe two beast emperors looked at Leylin, an obvious plea in their eyes.\u003c/p\u003e\n\u003cp\u003e“You’re quite smart, even comparable to ordinary humans!” Leylin gasped slightly in admiration, but the pair of gigantic hands suddenly exerted a bit of force.\u003c/p\u003e\n\u003cp\u003e*Ka-cha! Ka-cha!* Following two loud sounds, the two rank 3 beast emperors had been pinched so hard they exploded.\u003c/p\u003e\n\u003cp\u003e“Ra– Rank 4! You’ve already advanced to rank 4. You’re a Morning Star Magus!” A voice like that of a dead man echoed from within the throat of the gnome inside the colossus.\u003c/p\u003e\n\u003cp\u003eMorning Star!\u003c/p\u003e\n\u003cp\u003eThe crowd was sluggish for a moment, unable to react instantly. Only after a while did they suddenly realise what that meant.\u003c/p\u003e\n\u003cp\u003eIndeed, only a Morning Star Magus would be able to withstand the attacks of the numerous tribes without changing his expression, and even slaughter two beast emperors with just a light touch.\u003c/p\u003e\n\u003cp\u003eIt was just that this happy news for the human Magi was a total tragedy for the tribes!\u003c/p\u003e\n\u003cp\u003eWhat did a Morning Star represent? In Twilight Zone, such a person was invincible! And with Leylin’s youth, these tribes would probably have to be enslaved for thousands of years.\u003c/p\u003e\n\u003cp\u003eThis was still fortunate. If Leylin wanted to hold them responsible for their rebellion, their entire race would probably go extinct! A Morning Star’s anger was exactly that terrifying.\u003c/p\u003e\n\u003cp\u003eThe large hammer-shaped magic artifact in the dwarven ruler’s hands fell to the ground with a bang, and two streaks of blood flowed down from his eyes. Although many of the tribes had been stripped of all their abilities in the Morning Star field and were lying limp on the ground like dead dogs, he was still barely able to stand, “Oh, Fate! Why are you so unjust, even allowing that murderer to become a Morning Star in the sky? And for us of the other tribes, there’s only suffering?”\u003c/p\u003e\n\u003cp\u003ePearls of blood flowed down his eyes with each word he spoke. And just as his resentful questions ended, the radiance in the dwarven ruler’s eyes dimmed. He was dead.\u003c/p\u003e\n\u003cp\u003e“There’s still one more!” Leylin stretched out his hand and grabbed the air, and it was as if a huge hand appeared out of nowhere and a large blue ape was captured.\u003c/p\u003e\n\u003cp\u003eOnce the large blue ape fell onto the ground with a bang, it kowtowed to Leylin repeatedly, continuously begging for forgiveness.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-603\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-605\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-604","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
