{"id":59172,"no":616,"title":"Chapter 616","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Successful Planning\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin’s voice held no enthusiasm as he mercilessly released thread-like rays of crimson light that pierced into the Scorpion Man’s back. The green blood began to squirm as if it had just seen its worst enemy.\u003c/p\u003e\n\u003cp\u003eUnfortunately, it was not just the blood of the female bronze giant that was affected by the poison. Even the voice of the Arctic Queen was turning sluggish.\u003c/p\u003e\n\u003cp\u003eLeylin paid no attention to the fervent pleas and offers of the Arctic Queen, instead focussing on refining the bloodline in his hands.\u003c/p\u003e\n\u003cp\u003eWith his manipulations, the green blood from the Scorpion Man’s back was slowly extracted, veins showing themselves one after the other.\u003c/p\u003e\n\u003cp\u003e“Ahhh! The Snake Dowager… The Snake Dowager again.” The Arctic Queen\u0027s voice calmed. “Even if I’ll die right away and be damned for eternity, I won’t let the Snake Dowager prevail!”\u003c/p\u003e\n\u003cp\u003eThe green blood began to boil and rumble, bursting into verdant flames.\u003c/p\u003e\n\u003cp\u003e‘Hmm? The toxins were removed ahead of time… As expected, the vitality of an ancient Morning Star creature is more powerful than that of one from the present. The potion’s been counteracted…’ ’Leylin’s brows furrowed, but he did not do anything to indicate he would give up.\u003c/p\u003e\n\u003cp\u003eIt was way too rare to acquire the chance to refine the bloodline of an ancient creature, especially one that could comprehend laws. Such a thing was almost never seen! Obviously, Leylin didn’t want to give up just like this.\u003c/p\u003e\n\u003cp\u003e*Hss!* A large phantom snake appeared, and space immediately froze. Great power burst forth from Leylin’s body, locking onto the Scorpion Man and the blood.\u003c/p\u003e\n\u003cp\u003e“Plan B then,” Leylin’s voice was cold, his eyes without any emotion.\u003c/p\u003e\n\u003cp\u003eGreat amounts of blood-coloured threads dug into the Scorpion Man’s back, forming forbidden runes after mixing with the poison. It caused the Arctic Queen’s movements to grow even more sluggish.\u003c/p\u003e\n\u003cp\u003e“Give up! I know everything already, and have come up with a method specifically to deal with you!” Leylin’s voice held no sympathy, he spoke the truth.\u003c/p\u003e\n\u003cp\u003eAfter a period of external observation, he’d run over ten thousand simulations with the A.I. Chip, preparing many contingency plans for this trip underground. He’d predicted this situation already, and prepared specific countermeasures against it.\u003c/p\u003e\n\u003cp\u003eLeylin had stored tens of spell patterns to seal ancient bloodline in the A.I. Chip’s database.\u003c/p\u003e\n\u003cp\u003eThe Arctic Queen could not move about freely and had not finished her resurrection. In front of Leylin who had made meticulous preparations, her various attacks were destroyed in practically a single blow.\u003c/p\u003e\n\u003cp\u003eHer cries had transformed into mournful wails. Even her sorrowful cries grew softer and softer. Her soul was being suppressed and weakened.\u003c/p\u003e\n\u003cp\u003e“If your main body was around, you’d definitely be able to crush me like an ant, but it’s a pity that you’re only a droplet of her blood. You haven’t even revived yourself completely…” Leylin spoke calmly, eyes flashing with a peculiar light.\u003c/p\u003e\n\u003cp\u003eThere was no reply as the soul force from the other side died down, and then began to weaken at a terrifying rate. Large amounts of green blood withdrew and returned to the back of the Scorpion Man, and the green blood vessels rejoined with the blood.\u003c/p\u003e\n\u003cp\u003eGreen blood mixed together, decreasing in volume yet becoming brighter and more vibrant. It emitted a dark, bronze light.\u003c/p\u003e\n\u003cp\u003e‘What’s going on? Has she really given up?’ Suspicion flickered in Leylin’s mind. He put his guard up, but still retained the same front.\u003c/p\u003e\n\u003cp\u003eWith the Arctic Queen’s movements, the green blood that had been spread out gathered to form a single droplet of resplendent bronze blood.\u003c/p\u003e\n\u003cp\u003e“The original blood of the Icy World’s Guardian?” Leylin’s eyes grew dazed, his voice full of emotion.\u003c/p\u003e\n\u003cp\u003eThis was the blood of an existence that controlled laws, an existence with rank 7 strength at the very least! It even held the imprint of its original owner, able to revive the being from this single drop.\u003c/p\u003e\n\u003cp\u003eThe effects of Leylin’s purification began to show themselves as the blood condensed on the Scorpion Man’s body.\u003c/p\u003e\n\u003cp\u003e“Yield!” Leylin took out a notebook with a slightly yellow cover. He opened it up to reveal a slight lustre from the title page. At the centre of the page was a round sealing spell formation.\u003c/p\u003e\n\u003cp\u003e“Bloodline Sealing Tome? No!” The Arctic Queen\u0027s originally feeble energy undulations suddenly reverberated once more, her voice distorting, becoming androgynous as it turned hoarse.\u003c/p\u003e\n\u003cp\u003e“The Snake Dowager and her blood, the Icy World shall forever be your enemy!” Her voice became masculine, awakening some sort of ancient memories and sending a malicious curse Leylin’s way.\u003c/p\u003e\n\u003cp\u003e“As the bronze empress, the Guardian of the Icy World, I offer a sacrifice... skmgkl...” Leylin did not recognize who exactly she was making a sacrifice to.\u003c/p\u003e\n\u003cp\u003e“You may have had the upper hand today, but you could never have thought of laws! That is a strength that surpasses your understanding…”\u003c/p\u003e\n\u003cp\u003e“I offer up all the laws I possess. Strength of skmgkl, descend!”\u003c/p\u003e\n\u003cp\u003eThe dark green flames crackled as their strength grew tenfold, and even the tremendous Morning Star body of the Scorpion man was eaten into rapidly.\u003c/p\u003e\n\u003cp\u003eLarge amounts of runic chains cracked, and the poison withdrew. Even Leylin’s bloodline extraction spell was forcefully interrupted.\u003c/p\u003e\n\u003cp\u003e“This is… the power of laws? Unthinkable! It’s only a single drop of blood…” Leylin’s face grew pale, suffering the backlash from a spell being interrupted.\u003c/p\u003e\n\u003cp\u003eHowever, he did not have the time to think further. That droplet of blood which contained laws had already been offered. After breaking the seal, it turned into a shooting star as it charged towards Leylin.\u003c/p\u003e\n\u003cp\u003eThe energy defences shattered layer by layer as the blood advanced, unimpeded even by the Kemoyin Scales and the Scarlet Earring.\u003c/p\u003e\n\u003cp\u003eThe blood slammed into Leylin’s chest, splattering all across his body. One could hear the hissing as it corroded him away.\u003c/p\u003e\n\u003cp\u003eWhite fumes shot up as the Kemoyin Scales on Leylin’s chest fell apart visibly, piece by piece. A pool of green liquid had latched onto his chest, burning into it.\u003c/p\u003e\n\u003cp\u003eThe Kemoyin Scales softened and fell off one after another with no end in sight, revealing charred flesh and bones.\u003c/p\u003e\n\u003cp\u003e[Beep! Host’s chest has severe burns. Immediate treatment recommended.]\u003c/p\u003e\n\u003cp\u003e[Beep! Detected corrosion of host by unknown energy. Expulsion procedures recommended] the A.I. Chip reported immediately.\u003c/p\u003e\n\u003cp\u003e“I’ve burned the power of the laws in my body as well as the remains of the Scorpion Man. The result is an explosive force that can kill even Radiant Moons…\u003c/p\u003e\n\u003cp\u003e“Let us be buried together in the ice and snow, you who contain the bloodline of the Snake Dowager!” The Arctic Queen’s voice grew lower and lower as it eventually disappeared.\u003c/p\u003e\n\u003cp\u003eThe terrifying green blood had spread from his torso to his limbs, verdant blood vessels crawling over Leylin’s face. It caused him to look sinister and horrifying.\u003c/p\u003e\n\u003cp\u003e[Beep! Warning! Warning! Life and soul force of host is being consumed at a heavy rate. Immediate action required. Time until collapse of genes: 34s…]\u003c/p\u003e\n\u003cp\u003eThe prompt box that the A.I. Chip ejected had a very dense blood-red colour in the frame, displaying the danger of the situation. If he was not careful, he could lose his life.\u003c/p\u003e\n\u003cp\u003e“It’s finally reached this point…”\u003c/p\u003e\n\u003cp\u003eThough half of Leylin’s body was being corroded by the green blood as he laid on the ground, there was no trace of dismay on his ice-cold face. Instead, it seemed as if a scheme of his had succeeded.\u003c/p\u003e\n\u003cp\u003e“With 3410 possible scenarios as well as 982 sudden occurrences, the opponent chose the method of mutual destruction. Not like that was a surprise…”\u003c/p\u003e\n\u003cp\u003eEven with preparations, the corrosion from the bloodline of a creature that comprehended laws caused Leylin to cough violently, large amounts of fresh blood seeping through his fingers.\u003c/p\u003e\n\u003cp\u003e*Hss…* Behind him, the tremendous figure of a Giant Kemoyin Serpent came into view once more. Now, however, its energy was unstable. Tinted dark green, were burning on the body of the giant serpent.\u003c/p\u003e\n\u003cp\u003eIt was not just the figure behind him. Leylin felt even the Giant Kemoyin bloodline in his body being eaten into; expelled and even destroyed!\u003c/p\u003e\n\u003cp\u003e“Bloodline Ignition!” Blood-red light surged from Leylin’s eyes as the purple blood of the Kemoyin Serpent was enriched several fold which was now filled with insanity and fury.\u003c/p\u003e\n\u003cp\u003eA large amount of his own blood bubbled up, purple confronting green.\u003c/p\u003e\n\u003cp\u003eLeylin rolled to his side and got up. Though using Bloodline Ignition to fight was like fixing thirst by drinking poison, he now had control over his own body again, albeit temporarily.\u003c/p\u003e\n\u003cp\u003e“The A.I. Chip has already simulated this several times, and the rate of success is as high as at 90%!” Leylin clenched his fists tightly. “A 90% chance is enough for me to take the risk!”\u003c/p\u003e\n\u003cp\u003eA resolute look appeared on Leylin’s face. “If I can’t climb to the top in this lifetime, I would rather die and rot as sludge!\u003c/p\u003e\n\u003cp\u003e“Sun’s Child imprint!”\u003c/p\u003e\n\u003cp\u003eHe abruptly took off the white glove on his right hand, the golden-red bloodline imprint emitting dazzling light.\u003c/p\u003e\n\u003cp\u003e[Activating plan ‘Thoroughfare’. Support and trajectory activated!] The A.I. Chip intoned.\u003c/p\u003e\n\u003cp\u003eAn enormous blazing light spread in this underground world, as if a sun had risen within.\u003c/p\u003e\n\u003cp\u003eEverywhere the flaming light, be it soil, rocks, or spells of ice, everything was vapourised immediately, causing the underground cave to expand rapidly.\u003c/p\u003e\n\u003cp\u003eThe beings still in the world of ice could see a tremendous sun rising from the castle, imparting heat and light to this underground world. The ever-unchanging ice began to melt, mountains collapsing as doomsday seemed to have arrived.\u003c/p\u003e\n\u003cp\u003eIce melted into flowing water, which quickly evaporated itself. The white vapour spread everywhere, turning into a layer of fog in the surroundings. Quickly, the original dark brown soil was revealed once more.\u003c/p\u003e\n\u003cp\u003eThe range of this heat continued to expand, as if ready to transform the entire world of ice.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-615\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-617\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-616","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
