{"id":58618,"no":62,"title":"Chapter 62","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eModified Potion\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\"What are you guys doing? Put me down quickly!\"\u003c/p\u003e\n\u003cp\u003eAt this moment, Langford, who was trapped, transformed rapidly.\u003c/p\u003e\n\u003cp\u003eThe maniacal look on his face vanished, and his eyes showed sanity. The originally bald head had grown a large amount of green hair that quickly extended to his ankles.\u003c/p\u003e\n\u003cp\u003e\"Look his hair is already growing, it seems like he has regained his sanity!\" The little girl\u0027s voice rang out and the green vines were retracted.\u003c/p\u003e\n\u003cp\u003e\"Langford! You actually did not master anticipating when your episodes of insanity would trigger. You even broke the rules of the canyon by startling our customer! You better obtain our guest\u0027s forgiveness. Otherwise, you will be chased out of this place!\"\u003c/p\u003e\n\u003cp\u003eTwo voices gradually left, and Leylin did not see the other two level 3 acolytes, even after the battle had ended. Moreover, even the interior of the cave remained unharmed.\u003c/p\u003e\n\u003cp\u003eUpon noticing that something was amiss, the dwarf hurriedly bowed before Leylin, \"My apologies, Sir! Due to some mental strain, there are times when I\u0027m unable to control myself. I hope you will allow me to make amends for the inconvenience I caused.\"\u003c/p\u003e\n\u003cp\u003eLangford was a little dispirited, \"Earlier I really thought I had the timing down. Alas, I never anticipated that it would flare up more often than before, who knows if I really have to move out....\"\u003c/p\u003e\n\u003cp\u003eLeylin too did not know how to react in this situation. He could only say, \"Then please wake my servant up. Also, hurry and bring the ingredients I requested!\"\u003c/p\u003e\n\u003cp\u003e\"Of course!\" The dwarf geezer dragged his long shaggy hair and stood in front of Greem. He lifted Greem\u0027s eyelid to have a look, \"Your servant has only fainted temporarily. He will recover after a short rest!\"\u003c/p\u003e\n\u003cp\u003eHe then took some brown coloured powder from his robes and made Greem swallow them. Not long after, the burly fellow woke up.\u003c/p\u003e\n\u003cp\u003eLangford then brought out a small box and handed it to Leylin, \"To compensate for your trouble. Furthermore, I can give you a 50% discount!\"\u003c/p\u003e\n\u003cp\u003e\"...\" Leylin was a little speechless, but he still handed the magic crystals to the geezer and gave the box to Greem for him to carry before he bade farewell.\u003c/p\u003e\n\u003cp\u003eAs they said their goodbyes, Langford bowed deeply again, \"If you still wish to trade with me, please remember, only when my hair has grown past my ankle, will I be in a period of sanity. The rest of the time, avoid me for the time being.\u003c/p\u003e\n\u003cp\u003eLeylin nodded his head and left the canyon with Greem.\u003c/p\u003e\n\u003cp\u003eOriginally, he was in a mood to browse around. However, after this incident, he had completely lost interest. Who knew if there were other crazy people in this canyon.\u003c/p\u003e\n\u003cp\u003eThe path of a Magus is treacherous, each failure in advancement--be it through an experiment or as a side effect of spell radiation--can cause irreversible damage to those involved, even costing them their lives sometimes.\u003c/p\u003e\n\u003cp\u003eAdding prolonged longevity and immense power, over time a Magus\u0027 character would undergo some kind of change; some may even develop mental problems.\u003c/p\u003e\n\u003cp\u003eLeylin thought of Langford and the two level 3 acolytes who had rendered their assistance. The feeling they gave Leylin was completely different from that of the acolytes of Extreme Night City.\u003c/p\u003e\n\u003cp\u003eTo put things in perspective, it was like a pack of wolves against lambs.\u003c/p\u003e\n\u003cp\u003e\"It seems like real magicians very seldom prefer to stay around humans, and they predominantly stay in rural areas.\u003c/p\u003e\n\u003cp\u003eSeeing the might of those two level 3 acolytes today made Leylin somewhat more zealous, \"Once I have successfully brewed the Azure Potion, I too can quickly advance to that level!\"\u003c/p\u003e\n\u003cp\u003e......\u003c/p\u003e\n\u003cp\u003eIn the lab, under the brilliant light, Leylin took and stared at a test tube from the table. It continuously bubbled with blue froth.\u003c/p\u003e\n\u003cp\u003eWith extremely firm hands, he shook it according to a mysterious rhythm.\u003c/p\u003e\n\u003cp\u003eThe blue bubbles in the test tube continued to froth upwards then vanish as it reached the brim.\u003c/p\u003e\n\u003cp\u003e[The reaction in the potion has become extremely stable, and is estimated to exceed the threshold in 3 Minutes 24 Seconds!] The A.I. Chip\u0027s observation alerted.\u003c/p\u003e\n\u003cp\u003eAfter reporting this condition, a timer at a bottom corner of Leylin\u0027s visual field started the countdown.\u003c/p\u003e\n\u003cp\u003eWhen the countdown reached 0, Leylin immediately used the ancient Byron language and muttered an incantation, \"This is the azure blue ocean, come! My little babies!\"\u003c/p\u003e\n\u003cp\u003eHis other hand immediately dropped some of the blue crystals he was holding, into the test tube.\u003c/p\u003e\n\u003cp\u003e* Weng Weng! * The test tube started to tremble.\u003c/p\u003e\n\u003cp\u003eA few streaks of a brilliant blue light flew out of its mouth and rotated around it turning into little blue coloured mermaids.\u003c/p\u003e\n\u003cp\u003eThese little mermaids had a girl\u0027s torso and were only the size of Leylin\u0027s thumb. On their chests hung two shell pieces while the bottom half of their body was that of a fish\u0027s tail. At this moment, they were holding hands together, circling the test tube, singing, and dancing.\u003c/p\u003e\n\u003cp\u003eTheir sweet distinct elegant voices sang and it reverberated within the room strumming on Leylin\u0027s heartstrings.\u003c/p\u003e\n\u003cp\u003e\"The final step! Resist the alluring voices of the mermaids!\" Leylin\u0027s expression tightened.\u003c/p\u003e\n\u003cp\u003eRumours had it that the singing voices of mermaids not only have terrifying bewitching energy, but these voices were also used to prey on sailors in the deep seas. Many suspected these mermaids as main culprits behind the creation of ghost ships!\u003c/p\u003e\n\u003cp\u003eRight now, Leylin felt a strong impulse to throw everything he owned to the side, and dive straight into the ocean.\u003c/p\u003e\n\u003cp\u003e\"This is only an illusion. It only has the 10% of an actual mermaid\u0027s might. If these were real or were cast by mermaid Magi, what would the effects be?\" Leylin clenched his teeth and gave off a layer of grey-black light from his body deflecting these voices.\u003c/p\u003e\n\u003cp\u003e\"Manse!\" After waiting for roughly 30 seconds, Leylin suddenly blurted out a word.\u003c/p\u003e\n\u003cp\u003e* Chi Chi! * Black coloured needles appeared piercing through the chests of those little mermaids.\u003c/p\u003e\n\u003cp\u003eAgonised expressions could be seen on the pretty faces of the mermaids. Suddenly, they dissolved and turned into a few drops of blue liquid that returned into the test tube.\u003c/p\u003e\n\u003cp\u003eHuge amounts of bubbles, crystals and the drops of liquid rapidly merged and at that instant turned into a test tube half filled with a dark blue potion.\u003c/p\u003e\n\u003cp\u003e* Crash! Leylin shook the test tube lightly. From within the test tube came the crashing sound like that of great surging waves in an ocean.\u003c/p\u003e\n\u003cp\u003e[The modified Azure Potion has been brewed successfully.] The A.I. Chip indicated.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip, how potent is this potion compared to the original formulation?\" Leylin asked.\u003c/p\u003e\n\u003cp\u003e[Beep! Collecting the vapours. Analysing and comparing data... Estimated to have 33% of the original potion\u0027s effect.]\u003c/p\u003e\n\u003cp\u003eAlthough the previous estimate was 35.4%, there would be some minute differences during the actual brewing. Furthermore, it was the first time he did this experiment, so achieving this effect made Leylin very content.\u003c/p\u003e\n\u003cp\u003e\"A pity that the consumptions of Hove Violet Leaves for this process is too high!\" Leylin looked at the remnants of the Hove Violet Leaves lying on the side.\u003c/p\u003e\n\u003cp\u003eOnly the essence from the middle of a whole piece of Hove Violet Leaf could be used for the potion. Apart from that, many complicated steps also had to be accomplished resulting in the high consumption rate.\u003c/p\u003e\n\u003cp\u003eHe estimated that even after Welker bought all of the ingredients available, it would only allow Leylin to brew the potion another 30 to 40 times.\u003c/p\u003e\n\u003cp\u003e\"Now, I wonder what the effects of this ancient potion are?\"\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s eyes flashed in anticipation. He directly walked to an empty space and sat cross-legged on the floor. He then poured the Azure Potion into his mouth.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a little bitter, and has a rather fish-like odour.\" The muscles on Leylin\u0027s face twitched, \"The palate of these ancient Magi was just so-so....\"\u003c/p\u003e\n\u003cp\u003e\"According to the A.I. Chip\u0027s calculations, the best complement to potions that increase spiritual force is meditation!\"\u003c/p\u003e\n\u003cp\u003eLeylin thought of this before completely entering into a meditative mode.\u003c/p\u003e\n\u003cp\u003eThis time, the meditations effect was very obviously different from before. With a vague concept of time, Leylin felt like he was in the middle of an azure blue ocean and boundless blue sea water squeezed his middle almost suffocating him.\u003c/p\u003e\n\u003cp\u003eWhen seen from the outside, the muscles on Leylin\u0027s handsome face twitched, and drops of sweat continuously dripped out.\u003c/p\u003e\n\u003cp\u003eAlmost two hours later, Leylin abruptly opened both of his eyes.\u003c/p\u003e\n\u003cp\u003e\"Phew! The feeling from meditating like this is several times more uncomfortable than before!\" Leylin shook his head.\u003c/p\u003e\n\u003cp\u003eThe meditation of an acolyte, more often than not, led to exhaustion afterwards. However, right now Leylin felt his whole body aching, especially his brain, which felt like someone took a large metal hammer and kept smashing it. Even now he was somewhat dizzy.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip. Display my stats.\" Leylin ordered.\u003c/p\u003e\n\u003cp\u003eImmediately, a blue screen appeared before Leylin and showed a stream of numbers.\u003c/p\u003e\n\u003cp\u003e[The Host\u0027s spiritual force has been detected as undergoing a rapid rise!]\u003c/p\u003e\n\u003cp\u003e[Host is under the influence of an unknown, spiritual force increasing by 0.01]\u003c/p\u003e\n\u003cp\u003e[spiritual force increasing by 0.01]\u003c/p\u003e\n\u003cp\u003e[The meditative state is deepening. Effect optimised. spiritual force increasing by 0.03]\u003c/p\u003e\n\u003cp\u003e[spiritual force has reached the threshold, increasing by 0.05]\u003c/p\u003e\n\u003cp\u003e......\u003c/p\u003e\n\u003cp\u003e[Meditative state ended, Host\u0027s stats undergoing change. Strength: 3.1, Agility: 3.3, Vitality: 3.2, Spiritual force: 4.9, Magic Power: 4.0. Status: Healthy]\u003c/p\u003e\n\u003cp\u003eRows of data were displayed, and Leylin discovered at the end that his spiritual force had increased by 0.2.\u003c/p\u003e\n\u003cp\u003e\"This figure!\" Leylin\u0027s eyes widened, \"If the original ingredients were used, doesn\u0027t that mean that I can increase the spiritual force by about 0.7 at a time! It is indeed worthy to be called an ancient potion. Even for official Magi, this is a pretty good outcome!\"\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip, assuming there are enough potions on hand, how much time will I need to reach 7 spiritual force points?\" Leylin asked.\u003c/p\u003e\n\u003cp\u003e[Inputting effect of Azure Potion, establishing simulation, factoring tolerance principle, calculation in progress....]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip began calculating, dozens of seconds later, the A.I. Chip\u0027s voice intoned.\u003c/p\u003e\n\u003cp\u003e[According to the Host\u0027s resistance to medicinal properties, it is estimated that the Host will achieve 7 spiritual force points after two months!]\u003c/p\u003e\n\u003cp\u003eThe necessary conditions to advance to level 3 acolyte was to have mastery over at least 2 spell models, a spiritual force of 7 and to use a reactive elixir.\u003c/p\u003e\n\u003cp\u003eLeylin had gotten the spell models and reactive elixirs long ago. What kept him back was this spiritual force bottleneck.\u003c/p\u003e\n\u003cp\u003e\"A pity, though! The success rate for brewing the Azure Potion is extremely horrifying. Even if it\u0027s me, I will at most succeed one out of ten times!\"\u003c/p\u003e\n\u003cp\u003e\"Hove Violet Leaves. I need huge amounts of Hove Violet Leaves. If it cannot be done, I must organise a trading party to acquire them from other cities.\"\u003c/p\u003e\n\u003cp\u003eLeylin clenched his teeth. His eyes revealed obvious desire.\u003c/p\u003e\n\u003cp\u003e\"Young Master!\" As he walked out from the lab, Anna, who was waiting outside, greeted him immediately.\u003c/p\u003e\n\u003cp\u003e\"Pass these orders down. From now on, our establishment will cease all operations and devote all resources towards purchasing Hove Violet Leaves. Moreover, Fraser is to make a trip to nearby cities to acquire them!\" Leylin\u0027s expression was extremely grim.\u003c/p\u003e\n\u003cp\u003e\"Yes!\" This was the first time Anna had seen this side of Leylin, so she hurriedly retreated.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-61\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-63\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-62","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
