{"id":59180,"no":624,"title":"Chapter 624","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eDreamscape Realm\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eStorms and turbulence wreaked havoc in the huge space, wiping out the entire troop within seconds. This terrifying scene rendered all onlookers speechless.\u003c/p\u003e\n\u003cp\u003e“Leylin is... actually so strong?” Gail looked at Leylin’s back view, a little confused. Large amounts of light started to leak out from the spatial crack, the scene within seeming like an entirely separate galaxy.\u003c/p\u003e\n\u003cp\u003e“First, it was the key, then it was the counterattack. I have to open up a path for myself next!” Leylin muttered under his breath as a dazzling moon rose up behind him. Space stabilised as the translucent moonlight scattered and revealed a silver pathway.\u003c/p\u003e\n\u003cp\u003e“Come here!” Before he left, Leylin waved his hand. Gail, who was on the floor, flew to him.\u003c/p\u003e\n\u003cp\u003e“Brother…” The little lass called out hoarsely before she kept silent, realising that Leylin was not the same person she knew.\u003c/p\u003e\n\u003cp\u003e“The power of destiny gave us a chance to meet in this world. Although I cannot be sure if this is reality or an illusion, let this be my present to you!” Leylin chuckled lightly, and directed a spot of light into Gail’s forehead before stepping through into the pathway.\u003c/p\u003e\n\u003cp\u003eTwilight Zone, on top of an altar.\u003c/p\u003e\n\u003cp\u003eThe surface of the black altar was filled with runic circuits full of energy, and Carol was seated at the center. Opposite her was the crystal ball that had collected Leylin’s aura, streams of black air circulating around it continuously. Eugene and the other Magus could only watch on.\u003c/p\u003e\n\u003cp\u003eSuddenly, the crystal ball cracked and the black air dispersed. Carol screamed at the top of her lungs before fainting.\u003c/p\u003e\n\u003cp\u003e“What happened? The curse backfired?” The leader of the Magi knitted his brows together, and a bright green weapon flashed before going into Carol’s body and awakening her.\u003c/p\u003e\n\u003cp\u003e“What’s going on? Didn’t you say that your soul body spell has reached the state where you can enter any dreams and fool any Morning Star Magus?” Eugene bellowed.\u003c/p\u003e\n\u003cp\u003e“We’ve been had! He’s already reached the Radiant Moon realm! The truesoul of a Radiant Moon is not something that a low-levelled dream manipulation could confuse…” Carol looked a little out of focus, “Furthermore, even though I couldn’t perceive everything in the dream, I’m sure that Leylin is hiding a huge secret!”\u003c/p\u003e\n\u003cp\u003e“That’s obvious. How could someone who broke through to the Radiant Moon realm have no secrets?” The leader’s voice turned icy. “Prepare for battle! He has definitely noticed us!”\u003c/p\u003e\n\u003cp\u003eLeylin was currently floating in the void, feeling weightless. He’d been in this state ever since he escaped from that dream world, only seeing a misty fog in front of him. There seemed to be no end to it.\u003c/p\u003e\n\u003cp\u003e“I can’t let this continue. I need to get back quickly!” Leylin pushed ahead, putting in all his strength. His soul exuded a cooling radiance under which the fog dissipated to reveal a small island.\u003c/p\u003e\n\u003cp\u003eAs he stepped foot onto the island, the steady feel of the ground gave him a sense of security. The place wasn’t too big, at most a thousand metres in diameter. At its centre was a miniature fountain, a few lights moving about in the waters.\u003c/p\u003e\n\u003cp\u003e*Grr! Grr!* “Hi there!” On top of a black palm tree, a single-eyed owl greeted Leylin happily.\u003c/p\u003e\n\u003cp\u003e“Hello, friend! Where am I?” Leylin waved.\u003c/p\u003e\n\u003cp\u003e[Beep! Scan complete. No life force undulations detected. Heat and radiation levels are at zero.] The A.I Chip reported in secret.\u003c/p\u003e\n\u003cp\u003e“This is the gap between Dreamscape and the real world. Hmm… the last time someone visited was 572 years after you, that was a very pretty lass!”\u003c/p\u003e\n\u003cp\u003eLeylin grew confused by the owl. “Wait… Isn’t this the dream world from the curse? How could someone from the future arrive before me?” he asked.\u003c/p\u003e\n\u003cp\u003e“Dreamscape is a dimension created by the dreams of all intelligent creatures. It is everywhere, and unfathomable. Time and space are intangible here.”\u003c/p\u003e\n\u003cp\u003eThe owl looked at Leylin, “Your dream is, therefore, a part of Dreamscape!”\u003c/p\u003e\n\u003cp\u003e“Is it?” Leylin grew suspicious. He had heard about Dreamscape before. Even in the ancient era, it was a place that caused many Magi to tremble. There had even been an invasion from Dreamscape once that caused great harm to the Magus World.\u003c/p\u003e\n\u003cp\u003eThere were a lot of demons in Dreamscape that were not weaker than rank 7 Magi which wielded laws.\u003c/p\u003e\n\u003cp\u003eOf course, there was a lot of instability in this world. Even the weakest worm could grow into a powerful demon the next day, and the strongest demon could disappear in the next moment.\u003c/p\u003e\n\u003cp\u003eDue to this characteristic, the invasion of Dreamscape dissipated quickly, but to the Magi of the ancient era, this was a taboo, not to be spoken of.\u003c/p\u003e\n\u003cp\u003e‘Many Magi from the ancient era have explored Dreamscape. I never thought I’d get this chance as well…’ Leylin touched his chin, ‘Not mentioning anything else, what would happen if I found the dream world of powerful Magi, or even the dream of the ancient Wisdom Tree or the dream of the Snake Dowager… Wouldn’t it be too strange?’\u003c/p\u003e\n\u003cp\u003e“Then Sir, how does one return to the real world? And if I wish to come back here afterwards, how can I accomplish that?” Leylin bowed to the owl on top of the tree.\u003c/p\u003e\n\u003cp\u003e“I like your courtesy, lad!” The owl hooted again and shook its wings. A single grey feather fell into his hand.\u003c/p\u003e\n\u003cp\u003eLeylin looked at this feather. It was very soft, but the tail region seemed to have a certain sort of power to it.\u003c/p\u003e\n\u003cp\u003e“It’s easy to leave Dreamscape, all you have to do is wake up. As for coming back, that feather over there might be of some help!\u003c/p\u003e\n\u003cp\u003e“Now, I need to return, I have a dinner appointment with the past me. Have a nice dream, sir!” As the owl disappeared from his sight, Leylin’s grip around the feather tightened.\u003c/p\u003e\n\u003cp\u003e“Will it be alright as long as I wake up?” He muttered to himself, looking a little perplexed.\u003c/p\u003e\n\u003cp\u003e…...\u003c/p\u003e\n\u003cp\u003e*Boom!* Leylin’s muscles tightened as he felt as if he was falling, and he abruptly sat up.\u003c/p\u003e\n\u003cp\u003e“Dear, are you okay?” Celine switched on the lights and came over in concern.\u003c/p\u003e\n\u003cp\u003e“This is… Nature’s Alliance Academy?!” Looking at the familiar yet strange ceiling and the surrounding decorations, Leylin’s pupils dilated and he quickly sobered up.\u003c/p\u003e\n\u003cp\u003e“Are you alright?” Celine looked worried. After all, for such a powerful Magus to have nightmares was something beyond rare.\u003c/p\u003e\n\u003cp\u003e“I’m fine!” Leylin raised his right hand, and a grey feather appeared in his left palm.\u003c/p\u003e\n\u003cp\u003eLeylin muttered under his breath, “Dreamscape! The strangest of planes, an ensemble of conscients in a messed up time and space. One day, I will reveal your secrets. A.I. Chip, show me my previous condition!”\u003c/p\u003e\n\u003cp\u003e[Beep! Host body facing an unknown disturbance, truesoul weakening.]\u003c/p\u003e\n\u003cp\u003eVarious pieces of data showed that Leylin’s experience just now wasn’t merely superficial.\u003c/p\u003e\n\u003cp\u003e[Beep! Target coordinates found!] In the last line, Leylin saw a position.\u003c/p\u003e\n\u003cp\u003eThis was the location the A.I. Chip had traced back from the curse.\u003c/p\u003e\n\u003cp\u003e“It isn’t too far… it looks like this sort of dream curse requires a certain amount of proximity…” Leylin’s face darkened, and he began radiating a murderous aura.\u003c/p\u003e\n\u003cp\u003e“Whoever you are that spied on me, die!” An explosion sounded out as he turned into a phantom, disappearing from the room. Celine could only look into the space Leylin disappeared to, uncertainty filling her face.\u003c/p\u003e\n\u003cp\u003e“Quick! The curse has been countered, Leylin will find us!”\u003c/p\u003e\n\u003cp\u003eCarol seemed to wake up from her trance upon hearing the leader’s reminder.\u003c/p\u003e\n\u003cp\u003e“What should we be scared of? He’s just a newly advanced Radiant Moon. As long the three of us combine powers, we have nothing to be afraid of!” Eugene said indignantly.\u003c/p\u003e\n\u003cp\u003e“Eugene makes sense. Prepare for battle.” The leader sighed.\u003c/p\u003e\n\u003cp\u003e“Leader, why are you—” Carol looked anxious at first, before growing shocked as she glanced at the sky not far away.\u003c/p\u003e\n\u003cp\u003eA black tornado was whirring with energy as it headed for them in full force.\u003c/p\u003e\n\u003cp\u003e“It’s not that we’re choosing not to leave. He’s already found us,” the leader said bitterly.\u003c/p\u003e\n\u003cp\u003e*Hss!* The person heading towards them at full speed was obviously angered by their provocation. The horrifying phantom of a Kemoyin Serpent Emperor appeared behind his back. Concentrated black gases engulfed everything in their path, sweeping in their direction.\u003c/p\u003e\n\u003cp\u003e*Whoosh!* The obstructions on the way, be they stones, mud or anything else, turned into nothing in a split second.\u003c/p\u003e\n\u003cp\u003eEugene’s pupils constricted as he stared at the person charging at the with the speed of light. “Is that the Giant Kemoyin Serpent? Why do I feel so repressed? It looks so different from the phantom in the data, and...” his hand trembled, “Why does a newly advanced Radiant Moon have such a powerful aura?”\u003c/p\u003e\n\u003cp\u003e“All of you! Die!” The phantom behind Leylin devoured everything even as he was shouting.\u003c/p\u003e\n\u003cp\u003e“Shit! We have to leave!” Sparks of black fire flashed, and it seemed as though the serpent took a big bite of every place Leylin passed, loud snaps echoing again and again.\u003c/p\u003e\n\u003cp\u003e“This is not the Giant Kemoyin Serpent… It’s their ruler! It’s the Kemoyin Serpent Emperor!” The leader seemed to have thought of something as he exclaimed, “That rumour is actually real!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-623\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-625\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-624","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
