{"id":59195,"no":639,"title":"Chapter 639","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAccident and Meeting \u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe sudden appearance of a half human statue, and the hairline cracks that could only be seen through Astral Vision… all this caused a chill in Leylin’s heart.\u003c/p\u003e\n\u003cp\u003eThe things in Dreamscape were way too mysterious, but the attraction they held for Leylin was incomparable. Precisely because of this, Leylin who had all along been immersed in experiments had slightly neglected the extreme dangers contained there.\u003c/p\u003e\n\u003cp\u003eLeylin looked at the continuously enlarging cracks on the statue, and could not help but say with a deep voice, “Seal!”\u003c/p\u003e\n\u003cp\u003e*Ring!* A blood-red radiance emerged from underground, instantly transforming into a translucent cage. The runes he’d previously set up near the statue began to flicker as well. Suppressive energy waves gathered together, firmly sealing the half human statue within.\u003c/p\u003e\n\u003cp\u003eThe range of cracking on the statue grew wider even as it was sealed off, all the cracks coming together to form a terrifying large mouth.\u003c/p\u003e\n\u003cp\u003eA wave of tiny black bugs wriggled out of the big mouth, each one the size of an ant. They crawled out of the statue layer after layer, covering the ground in a flash.\u003c/p\u003e\n\u003cp\u003eThe concentration of the dark red dreamforce was amplified several times as it formed a dense whirlpool that rippled back and forth in the air.\u003c/p\u003e\n\u003cp\u003e‘Why is the dreamforce circulating so fast?’ This discovery dulled a lot of the joy from the experiment’s success. Leylin began reflecting on himself. With just one insignificant step in the study of Dreamscape, he had only pulled off a corner of the veil. He still needed to be wary of the unknown. The little bit of complacency that had appeared was immediately suppressed.\u003c/p\u003e\n\u003cp\u003e*Squeak!* Accompanied by a creepy screech and a fine gnawing sound, Leylin found to his horror that the binding runes were shattering apart one by one. Even the spell formation on the ground was terrifyingly being corroded.\u003c/p\u003e\n\u003cp\u003eThe dark red dreamforce constantly darkened further, and its strange power even caused Leylin’s expression to change.\u003c/p\u003e\n\u003cp\u003e“Damn it! If I wait until tomorrow, I’ll use up all the isolation materials found today…” Leylin’s heart was very hateful, but he was helpless.\u003c/p\u003e\n\u003cp\u003e“Destroy!” He suddenly attacked, and a strange black flame swept across the room violently, completing drowning all the places the half-human statue had previously been.\u003c/p\u003e\n\u003cp\u003eThe temperature of the entire laboratory rose to an extreme for a moment, before falling rapidly once more.\u003c/p\u003e\n\u003cp\u003eThe original floor had melted due to the high temperature, hollowing out. At the bottom of this hole were all sorts of molten materials that mixed together and solidified again, forming colourful gem-like crystals.\u003c/p\u003e\n\u003cp\u003e*Creak!* Black spots started appearing on these crystals one by one.\u003c/p\u003e\n\u003cp\u003eAlthough the statue disappeared, those black bugs had impressively survived Leylin’s demonic flames.\u003c/p\u003e\n\u003cp\u003e‘They’re based off dreamforce, I need to solve the problem from its roots.’ Leylin’s eyes turned gloomy. He waved both hands, and the current experimental boards in the lightning pool flew out in a flash, exploding to form dust in the air. As if some power was bringing them together, they then formed a fine membrane, covering the area where the black bugs were.\u003c/p\u003e\n\u003cp\u003e“Isolate!” A great amount of lightning covered the membrane and formed an isolation layer similar to that of the previous experiment. Dark red dreamforce was isolated to the outside.\u003c/p\u003e\n\u003cp\u003eA large amount of dreamforce condensed, unexpectedly causing many holes in the membrane, causing it to crack under the attack.\u003c/p\u003e\n\u003cp\u003e‘Although the dreamforce can be isolated, it can also break through the latter. My last experiment only targeted an ordinary Dreamscape creature… So this kind of thing can happen when encountering something of a higher rank…’ Leylin’s pupils narrowed.\u003c/p\u003e\n\u003cp\u003eThis meant that, if he encountered an even more powerful existence, this membrane he set up would likely be torn apart immediately.\u003c/p\u003e\n\u003cp\u003eThinking over it once, that made sense as well. A rope net could catch small fish, but how could it catch a tiger shark in the ocean?\u003c/p\u003e\n\u003cp\u003e‘The priority is to completely eliminate all these hidden dangers before the opponent gains Dreamscape’s support!’ Determination flashed in Leylin’s eyes as the demonic flames burned once more.\u003c/p\u003e\n\u003cp\u003eThis time, the black ants that lost dreamforce melted apart very quickly, turning into motes of black light and dissipating.\u003c/p\u003e\n\u003cp\u003eAs if due to this event, the dreamforce outside the membrane grew richer, causing fine cracks to appear on the membrane. It would rupture at any time.\u003c/p\u003e\n\u003cp\u003e“Faster! Make it faster!” Leylin shouted deeply. Cold soul force merged, being injected into the flames.\u003c/p\u003e\n\u003cp\u003eThe black flames immediately burned tenfold more vigorously, burning all of the black ants into ashes. And the instant when the last ant disappeared, the isolation membrane emitted a saddening cry, unable to bear the heavy load any longer as it shattered. The dreamforce had lost its target though, and it hovered for a while before dissipating automatically. It caused Leylin to let out a deep breath. He turned around.\u003c/p\u003e\n\u003cp\u003eAll of a sudden, it was as if the half-human statue was pasted in front of his eyes, the huge cracked mouth seemingly ridiculing him! A terrifying gloomy breath was constantly emitted from the crack that was the huge mouth.\u003c/p\u003e\n\u003cp\u003eLeylin’s pupils narrowed as dense Kemoyin Scales emerged in an instant, New Moon soul force bursting forth from his truesoul to cover his body.\u003c/p\u003e\n\u003cp\u003e*Squeak!* The terrifying black ants emerged once more, covering Leylin’s entire body. His Magus robes, which were a magic artifact, did not even manage to block them for a moment, thousands of holes forming on it instantly.\u003c/p\u003e\n\u003cp\u003eThe black ants covered Leylin’s body, and even the rank 5 Kemoyin Scales could not resist the opponent’s fangs. An intense pain was transmitted from his skin as countless nicks appeared on Leylin’s body.\u003c/p\u003e\n\u003cp\u003e*HSS—* Behind him, the phantom of a Kemoyin Serpent Emperor emerged, growling as a layer of black flames burned on Leylin’s body.\u003c/p\u003e\n\u003cp\u003e“Huff…” After the flames stopped burning, Leylin was momentarily taken aback. When he came back to his senses, all the black ants had disappeared.\u003c/p\u003e\n\u003cp\u003eHowever, fine black wounds were still densely packed on his body, making it seem a little horrifying.\u003c/p\u003e\n\u003cp\u003e“Is this the invasion of Dreamscape?” Leylin looked at the blue lightning pool, the hollow ground, and the scales that had automatically emerged on his body, heaving a deep sigh.\u003c/p\u003e\n\u003cp\u003eDreamscape was a world where reality and virtuality were mixed, and all sorts of things could happen in there.\u003c/p\u003e\n\u003cp\u003e‘I’m afraid that with that sort of influx of dreamforce, this lab has already become a building of Dreamscape. Even the nature of the materials has changed…’ Such a situation was very similar to the process of a high-ranked Magus irradiating his castle on his own accord, only at a much deeper and more overbearing level.\u003c/p\u003e\n\u003cp\u003e‘A.I. Chip, raise the alert level once more. Forbid all entry other than my own!’ As he walked out of the laboratory, Leylin was slightly gloomy. The feeling of being shrouded in an illusion, as if he had been struck by magic but had not realised it, really left him uncomfortable.\u003c/p\u003e\n\u003cp\u003eMoreover, although dreamforce was not like magic, it could still affect reality. No matter what he experienced in dreams, it would all be reflected on his main body.\u003c/p\u003e\n\u003cp\u003e‘Dreamscape experiments are indeed full of dangers!’ Leylin sighed. Even the current him did not dare to live near this laboratory.\u003c/p\u003e\n\u003cp\u003e“Your Highness Leylin! You’re finally out?” Jeffrey’s voice was heard as Leylin walked out of the castle. This rank 5 protector of the Morning Star area had actually been waiting outside the castle without his knowledge.\u003c/p\u003e\n\u003cp\u003e“What’s the matter, Your Highness Jeffrey?” Leylin asked curiously. This was considered his personal territory, Jeffrey could not intrude on his own. It would be considered disrespectful to its owner.\u003c/p\u003e\n\u003cp\u003e“I tried to contact you several times, but there was some hindrance so I could only wait outside…” Jeffrey shrugged his shoulders with a bitter smile.\u003c/p\u003e\n\u003cp\u003e“I see. Forgive me, I was immersed in an experiment!” Leylin immediately apologised as an embarrassed look emerged on his face. The effect of the pollution and isolation of dreamforce was much more terrifying than other spells.\u003c/p\u003e\n\u003cp\u003eIf a laboratory in such an environment was still able to receive communications from the outside world, that would truly be something fishy!\u003c/p\u003e\n\u003cp\u003e“What experiment are you performing? I heard that there was even an accident before, and the pollution caused by the leakage is very serious…” Jeffrey looked at the tightly guarded castle behind Leylin that had no signs of life, seeming curious.\u003c/p\u003e\n\u003cp\u003eOf course, the leakage due to an experiment was something Leylin had deliberately made up so he could tighten the vigilance in this place openly and seemingly righteously.\u003c/p\u003e\n\u003cp\u003e“Nothing much… Just the leakage from an interplanar experiment. Something seems to have escaped as well…” Leylin’s words were both true and false, showing the great improvement in his acting skills. Even without the A.I. Chip’s coordination, he was able to deceive an old sly fox like Jeffrey.\u003c/p\u003e\n\u003cp\u003e“It’s a cute, timid creature. In order to play hide and seek with it, I had no choice but to seal off the entire castle…” Leylin smiled.\u003c/p\u003e\n\u003cp\u003e“Oh!” Jeffrey nodded but did not pursue any further. Magi’s experimental information was definitely top secret, not to mention that both Leylin and himself were rank 5 warlocks of equal ranks. It would have been way too out of line.\u003c/p\u003e\n\u003cp\u003e“This Sir Leylin has not invited us in even now, isn\u0027t he too rude?” At this moment, a Warlock standing beside Jeffrey spoke up indifferently, actually displaying slight hostility towards Leylin.\u003c/p\u003e\n\u003cp\u003e“Hm?!” Leylin was also shocked. Only now did he notice this figure beside Jeffrey. He was very handsome, his eyes containing an exuberance and vitality. His body’s aura was extremely abstruse, yet also very easily neglected.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-638\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-640\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-639","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
