{"id":59203,"no":647,"title":"Chapter 647","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Dream Spell\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e[Beep! Host’s Dreamscape alteration has been completed. Dreamforce adaptability has increased. Host has absorbed the remaining dreamforce. Vitality and spiritual force increasing, recalculating data.]\u003c/p\u003e\n\u003cp\u003eFollowing the A.I. Chip’s voice, Leylin saw his stats being refreshed.\u003c/p\u003e\n\u003cp\u003e[Leylin Farlier, Rank 5 Warlock. Bloodline: Kemoyin Emperor (Complete Form). Strength: 76, Agility: 62, Vitality: 155.7, Spiritual Force: 1821.5, Magic Power: 1821(Magic power is in synchronisation with spiritual force). Soul Force: 182 (New Moon).]\u003c/p\u003e\n\u003cp\u003e“I didn’t expect the alterations from dreamforce to have so many benefits!” Leylin nodded, rather satisfied with the upgrades.\u003c/p\u003e\n\u003cp\u003eThe most important thing about this alteration was that with the absorption of dreamforce, his body was beginning to get used to this strength. That was a prerequisite to employing dreamforce based spells.\u003c/p\u003e\n\u003cp\u003eNow, Leylin could see a strange red bar on the histogram that showed his elemental affinities, a third place below darkness and fire but still ahead of even his ice affinity.\u003c/p\u003e\n\u003cp\u003e“Affinity with dreamforce?” Leylin muttered to himself, knowing what this represented.\u003c/p\u003e\n\u003cp\u003eElemental affinity, or the attraction of specific forces, was the prerequisite to Magi being able to cast spells. His affinity with dreamforce surpassed his expectations..\u003c/p\u003e\n\u003cp\u003e[Beep! Host body’s dreamscape alterations completed. Gained dream ability— Illusory Dream! Might when casting illusory-type spells increased by 50%. Resistance to illusions increased by 35%. Host has a possibility of creating a dream forcefield around the body, bewitching intellectual creatures!]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip called all this to his attention.\u003c/p\u003e\n\u003cp\u003e‘It seems like this Dreamscape alteration had a lot of benefits. If not for dreamforce being too unstable, it wouldn’t have been bad to focus on training it.…’ Leylin stroked his chin.\u003c/p\u003e\n\u003cp\u003eDreamforce was very powerful. If a Magus were to train in this area, the rise of their strength would definitely be very quick. However, Leylin was not going to consider this. There was the aspect of his own affinity to it, but more importantly the instability of dreamforce left Leylin unwilling to gamble on it.\u003c/p\u003e\n\u003cp\u003eLeylin’s view was that the dreamforce would have restrictions when being used in a different world, and also had terrifying variance in the power. If other sources of power ranged from 1000 to 1500, then that of dreamforce would be from 1 to 10000! This meant that creatures in dreams might be frail little bugs a day ago, but could turn into a demon god the very next day.\u003c/p\u003e\n\u003cp\u003eBeings that were demons the day before could very well turn into creatures not even comparable to bugs due to the weakening of dreamforce.\u003c/p\u003e\n\u003cp\u003eMore importantly, these changes had no pattern! They might never happen, but could also happen continuously, which made it seem like a fraud.\u003c/p\u003e\n\u003cp\u003eHence, Leylin would at most use dreamforce as a tool, but not train mainly in it.\u003c/p\u003e\n\u003cp\u003e“However, with an affinity with dreamforce, I can now cast basic dream based spells…” Leylin came to the centre of the laboratory. A thick isolating glass there held within a gigantic ball of dark red dreamforce that was dense to the extreme within.\u003c/p\u003e\n\u003cp\u003eThis was all the dream energy that Leylin had collected in this period of time.\u003c/p\u003e\n\u003cp\u003eWith the push from a few incantations and soul force, an illusory spell model floated above his hands.\u003c/p\u003e\n\u003cp\u003e[Opening Sluice Gate No. 1.] Along with the A.I. Chip’s voice, one of the channels on the glass revealed a tiny opening. Dark red dreamforce squeezed out like an earthworm, revolving around Leylin and seeming extremely lively.\u003c/p\u003e\n\u003cp\u003eSeeing that the dreamforce was enough, the sluice gate ruthlessly closed once more, leaving the dreamforce that had escaped outside.\u003c/p\u003e\n\u003cp\u003e“Rank 1 dream spell— Eternal Light!” A spell model that was complex and strange, with the energy node within constantly changing was sent from the A.I. Chip to Leylin’s memories.\u003c/p\u003e\n\u003cp\u003eWith the push from a few incantations and soul force, an illusory spell model floated above his hands.\u003c/p\u003e\n\u003cp\u003eThe dreamforce around Leylin immediately disappeared into the model.\u003c/p\u003e\n\u003cp\u003e*Rumble!* The energy from a rank 1 spell caused dazzling white rays of light to fill the laboratory.\u003c/p\u003e\n\u003cp\u003e[Beep! Casting of rank 1 spell ‘Eternal Light’ is successful. Undulations and data has been recorded. Recording into spell database under dream spells, rank 1] The A.I. Chip quickly intoned.\u003c/p\u003e\n\u003cp\u003e[Eternal Light: A rank 1 spell that creates light for eternity. Estimated duration to be 50 years, 8 months. Power: 100 - 300 degrees.]\u003c/p\u003e\n\u003cp\u003eFollowing that, even more detailed information was shown on the screen of the A.I. Chip.\u003c/p\u003e\n\u003cp\u003e“A regular rank 1 spell should have a power between 20 and 80 degrees. The amplification from dreamforce is so terrifying…” Leylin touched his chin, gazing at the light on the walls that would not extinguish.\u003c/p\u003e\n\u003cp\u003e“Regular light magic and even Eternal Light can last for at most a few years… However, the\u003c/p\u003e\n\u003cp\u003eenergy provided by dreamforce can last for 50 years…”\u003c/p\u003e\n\u003cp\u003eIt had to be said that the great effects of dreamforce surpassed Leylin’s expectations.\u003c/p\u003e\n\u003cp\u003e“Once I research and create an offensive rank 5 dream spell, even rank 6 Magi can only tremble under it!” Leylin’s eyes flickered with a fervent heat.\u003c/p\u003e\n\u003cp\u003eThe spell model of the rank 1 dream spell he had just cast had come from the animal hide of the natives that had come from Dreamscape. The anonymous Magus had spent decades and come up with a system suitable for natives of the Dreamscape to use. He had even invented a series of dream spells. Though they were only from rank 1 to rank 3, that was still astonishing to Leylin.\u003c/p\u003e\n\u003cp\u003eTo be able to incorporate dreamforce into a Magus’ path and then invent usable models meant that this Magus’ attainments in spells could even surpass himself.\u003c/p\u003e\n\u003cp\u003eThe information left behind by this person had allowed him to avoid detours, and even aided him in creating a good foundation, thus saving him much time.\u003c/p\u003e\n\u003cp\u003eEven with the foundations and systems, deducing rank 4 and rank 5 content would usually take Magi a long period of time, but for the A.I. Chip it was just a matter of how much power it allocated.\u003c/p\u003e\n\u003cp\u003e“With such sensitivity towards spells as well as knowledge of laws, the Magus who accidentally landed in the Dreamscape should at least be rank 6, or even a rank 7 Magus who grasped laws!” Leylin’s eyes shone with yearning, and he threw himself into the nerve-wrecking experiments.\u003c/p\u003e\n\u003cp\u003eTime was fast approaching to fulfill the arrangement he had with Melinda. Before that, he had to constantly amass more strength so that he had enough to save himself, and even escape her schemes.\u003c/p\u003e\n\u003cp\u003eWhatever conspiracy there was, strength would be key. Once the difference in strength grew\u003c/p\u003e\n\u003cp\u003einsurmountable, any conspiracies or plots would be useless.\u003c/p\u003e\n\u003cp\u003eWhether it was dealing with the Blazing Flame Monarch or other dangers, dream spells could be\u003c/p\u003e\n\u003cp\u003eused as Leylin’s hidden trump card and be the deciding factor of victory!\u003c/p\u003e\n\u003cp\u003eHence, Leylin dedicated most of the A.I. Chip’s operations into the experiment.\u003c/p\u003e\n\u003cp\u003e…..\u003c/p\u003e\n\u003cp\u003e‘One needs to employ dreamforce for dream spells. Though I’ve done all I can to prepare some, I can’t use it more than a few times. The energy needed for spells at and above rank 4 is terrifying…’\u003c/p\u003e\n\u003cp\u003eLeylin donned a large white gown, translucent goggles in front of his eyes. Watching the ball of\u003c/p\u003e\n\u003cp\u003edark red dreamforce behind the wall, his eyes twinkled.\u003c/p\u003e\n\u003cp\u003eDark red dreamforce constantly drifted from the ball. It was similar to a scarlet python that swept across the wall, but it was forcefully blocked.\u003c/p\u003e\n\u003cp\u003eThis was the material that Leylin had identified to isolate dreamforce over many experiments.\u003c/p\u003e\n\u003cp\u003eIn a situation where no people rigged it, just the instinctual attacks of the dreamforce could do nothing against the isolating reinforced glass.\u003c/p\u003e\n\u003cp\u003e‘Based on my estimations and the A.I. Chip’s calculations, this dream energy can only be used to cast a rank 4 spell 6 to 10 times, while a rank 5 spell can only be cast 3 times or less…’\u003c/p\u003e\n\u003cp\u003eLeylin’s expression was dark. After breaking the connection with Dreamscape, gathering\u003c/p\u003e\n\u003cp\u003edreamforce had turned into a large issue.\u003c/p\u003e\n\u003cp\u003eNo matter how he tried to store them properly, dreamforce was constantly dissipating. While this was a slow process, the keen A.I. Chip had discovered it. Finding a way to store and transport dreamforce was another aspect that it was working hard on.\u003c/p\u003e\n\u003cp\u003e‘Spells that use dreamforce as a base are most effective when related to illusory spells. Dreamforce and the illusory magic are extremely similar, and fusing them is the best option!’\u003c/p\u003e\n\u003cp\u003eThe spell model that the A.I. Chip was calculating constantly improved by his conjectures, and gradually revealed its true form.\u003c/p\u003e\n\u003cp\u003eA spell model with numerous illusory runes flickering to and fro, emanating multi-coloured misty brilliance that all seemed like a dream began to take shape in the A.I. Chip’s simulations.\u003c/p\u003e\n\u003cp\u003e[Remaining time till rank 5 dreamforce spell is deduced: 3h 41min 12s.] The A.I. Chip had now\u003c/p\u003e\n\u003cp\u003egiven an accurate prompt.\u003c/p\u003e\n\u003cp\u003e“3 months and 9 days for the deduction of a rank 5 spell to be completed?” Leylin’s excitement could not be concealed.\u003c/p\u003e\n\u003cp\u003eWhile he had been recuperating and altering his body, the A.I. Chip had not been idle, analysing and studying this area.\u003c/p\u003e\n\u003cp\u003eNow, the fatal dream attack that he had been anticipating was about to be completed!\u003c/p\u003e\n\u003cp\u003eWhile he was waiting, time seemed to flow incredibly slower. Finally, Leylin heard the prompt\u003c/p\u003e\n\u003cp\u003efrom the A.I. Chip.\u003c/p\u003e\n\u003cp\u003e[Beep! Rank 5 dream spell deduction completed. Progress of construction of spell model: 100%!]\u003c/p\u003e\n\u003cp\u003eWhat had always been a robotic voice sounded incomparably gleeful in Leylin’s ears.\u003c/p\u003e\n\u003cp\u003e“It’s finally done!” Leylin clenched his fist and immediately read through the content given by the A.I. Chip.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-646\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-648\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-647","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
