{"id":58622,"no":66,"title":"Chapter 66","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eRune Shackles\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\"Light! There\u0027s a light ahead!\"\u003c/p\u003e\n\u003cp\u003eA guard walking in the vanguard shouted.\u003c/p\u003e\n\u003cp\u003eLeylin took a look. Indeed, the far end of the tunnel was radiating light.\u003c/p\u003e\n\u003cp\u003e\"Enter!\" Jackson gripped his large sword with both hands and was the first to rush in.\u003c/p\u003e\n\u003cp\u003eThe rest followed suit.\u003c/p\u003e\n\u003cp\u003eLight! Eye-piercing light radiated downwards from above!\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s eyes were stinging -- tears flowed down uncontrollably. He immediately used his hand to cover his eyes.\u003c/p\u003e\n\u003cp\u003e\"Argh!\" \"Monster!\" \"Be careful!\"\u003c/p\u003e\n\u003cp\u003eVarious shouts resounded, and weapons were brandished.\u003c/p\u003e\n\u003cp\u003e[Alert! Imminent attack ahead! Optimal response: step back and crouch!] The A.I. Chip\u0027s voice intoned and projected a faint blue screen.\u003c/p\u003e\n\u003cp\u003eOn the screen, a talon the size of a palm was clawing towards Leylin.\u003c/p\u003e\n\u003cp\u003eLeylin hurriedly retreated a step and crouched to dodge the attack.\u003c/p\u003e\n\u003cp\u003eAmidst the wails all around, Jackson\u0027s faint howling could be heard.\u003c/p\u003e\n\u003cp\u003eAfter the A.I. Chip\u0027s scan, Leylin could see that many lizard-like creatures were making use of their familiarity with the geography to attempt a massacre of Jackson and the squad of guards around him.\u003c/p\u003e\n\u003cp\u003eThe sneak attack was so quick that when Jackson and the rest finally reacted, the whole squad already suffered heavy casualties.\u003c/p\u003e\n\u003cp\u003eAs Leylin swept his gaze across the scene before him and his eyes finally adjusted to the bright light. He realised that the floor was already littered with corpses. Many of them had traces of having been chewed on by these strange creatures.\u003c/p\u003e\n\u003cp\u003eAt that moment, only the 2 Knight level squad leaders and the grey robed figure, who always followed behind Jackson, were all that remained of the group with Jackson.\u003c/p\u003e\n\u003cp\u003eAs for the acolytes, one had fallen to the ground and another had a large wound on his abdomen that was oozing blood.\u003c/p\u003e\n\u003cp\u003eAt the apex of the cave, white-coloured jellyfish-like creatures were floating. The flash from earlier had radiated from their bodies.\u003c/p\u003e\n\u003cp\u003e\"The surge of light radiated from these jellyfish could actually increase instantaneously and produce an effect similar to a flashbang grenade. The coordination demonstrated by these strange creatures that caused several deaths and injuries definitely hinted at some intelligence controlling them from behind the scenes!\"\u003c/p\u003e\n\u003cp\u003eAfter light burst from the jellyfish, they seemed to have become a little dispirited as they floated around in the air. Although there was still some light emanating from their bodies, it was not piercing to the eyes. It seemed like the flash from earlier was a one time attack.\u003c/p\u003e\n\u003cp\u003e\"This is a Flash Jellyfish, a kind of subterranean creature. Their earlier attack can only be used once. They need a day of rest before emitting such an intense burst of light again!\"\u003c/p\u003e\n\u003cp\u003eMurphy appeared, clutching a book to his chest.\u003c/p\u003e\n\u003cp\u003e\"What we need to deal with are not these parasitic organisms, but that fellow in the middle!\" Leylin pointed to the centre of the cave, and smiled bitterly.\u003c/p\u003e\n\u003cp\u003eLeylin and the rest entered a large underground cave earlier, where the ceiling was littered with stalactites and Flash Jellyfish, which allowed them a panoramic view of the interior.\u003c/p\u003e\n\u003cp\u003eAt this moment, in the cave, there were many mutated, yet familiar creatures. There were lizards, brown bears, and elks, all numbering over a dozen. At the centre most of them all, there was an enormous yellow snake that seemed to be the king, as it was guarded by the other creatures.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Mankestre - Great Withering Snake Mankestre!\" Murphy\u0027s book fell from his hands to the floor, letting off a bang.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip, scan!\" Leylin instructed.\u003c/p\u003e\n\u003cp\u003e[Great Withering Snake - Mankestre (Half-adult body) Strength: 11.9, Agility: 6.5, Vitality: 14, Spiritual force: 8]\u003c/p\u003e\n\u003cp\u003e[Abilities: 1 - Parasitic. A Mankestre is able to develop an extremely strong parasite in its body, and spread it to other organisms, making them its underlings.]\u003c/p\u003e\n\u003cp\u003e[2 - Wither. In any areas where a Mankestre has passed by, the plants will die, and become a type of nutrient for the Mankestre. An adult Mankestre possesses the strength of an official Magus, and can transform an entire forest into withering ashes.]\u003c/p\u003e\n\u003cp\u003e[Source of information: , \u0026lt;Nigel\u0027s Travels\u0026gt;]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip delivered the information immediately in front of Leylin.\u003c/p\u003e\n\u003cp\u003e\"Half-adult body? It doesn\u0027t seem to be at its adult stage!\" Leylin first heaved a breath of relief, before shouting out loud, \"Murphy, don\u0027t be fooled by its appearance. This is but a non-adult Mankestre. We still have a chance!\"\u003c/p\u003e\n\u003cp\u003e\"Indeed!\" Murphy scrutinised the brown yellow colour of the huge snake and finally recovered from his fright, \"An adult Mankestre is at least 100 metres long, and this snake is obviously not of that length yet. A number of parasites that it produces is also not right!\"\u003c/p\u003e\n\u003cp\u003e\"This huge snake is the cause of the withering woods?\" Jackson asked at the side while staring at the huge snake as his Adam\u0027s apple moved.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right! A Mankestre uses the juice of plants as their food. They are rather crafty and lazy, and also hate to move about. Basically, it uses the parasites to gather food for itself!\"\u003c/p\u003e\n\u003cp\u003eMurphy, who had bountiful experience and wisdom, was extremely aware of the habits of the huge Mankestre Snake.\u003c/p\u003e\n\u003cp\u003e\"So then, if we kill it, the herb production in Dark Night Woods can recover again?\" Jackson used his long sword and pointed at the huge yellow snake that was protected by its parasitic mutated creatures.\u003c/p\u003e\n\u003cp\u003e\"In theory, it should be the case as long as you kill it or drive it away. Although its death cannot revive the withering woods, it can still allow the prey and woods to slowly recover back to what it once was!\"\u003c/p\u003e\n\u003cp\u003eMurphy smiled wryly.\u003c/p\u003e\n\u003cp\u003e* Hiss! * The snake coiled in the centre of the cave hissed, and let off a low, snake-like speech.\u003c/p\u003e\n\u003cp\u003eIt was a kind of sound made by the friction of rubbing two pieces rotten leather together, which was extremely unpleasant to the ears.\u003c/p\u003e\n\u003cp\u003eThe creatures surrounding Leylin and the rest seemed to have received orders, and howled as they charged forward!\u003c/p\u003e\n\u003cp\u003eLeylin casually took a look, \"There are too many creatures, and the parent body is not yet dealt with, I must conserve my magic power!\"\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Simulate the most optimal method of attack!\"\u003c/p\u003e\n\u003cp\u003eLeylin pulled out his cross blade.\u003c/p\u003e\n\u003cp\u003e[Beep! Inputting situation data, initiating build with Host\u0027s stats!]\u003c/p\u003e\n\u003cp\u003e[Calculating battle simulation for the most optimal method!] The A.I. Chip continuously displayed the attack style of creatures surrounding home.\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s feet moved as he dodged a brown bear\u0027s attack. The cross blade in his right hand drew a strange trajectory, and deflected the paw of the bear, and directly pierced through its skull.\u003c/p\u003e\n\u003cp\u003e* Bang! * The huge brown corpse of the bear fell to the ground, and even the Mankestre Snake had taken notice, looking at Leylin.\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s scalp tingled, as he hurriedly kept his distance.\u003c/p\u003e\n\u003cp\u003e\"Nicely done!\" Jackson shouted in admiration. His body seemed to turn into a gust of wind, and continuously ravaged the mob of creatures, leaving a trail of blood behind him.\u003c/p\u003e\n\u003cp\u003e\"It seems that Jackson has ignited the secret Knight technique! His technique should be enhancing his agility \"\u003c/p\u003e\n\u003cp\u003eThe few acolytes also casted their rank 0 spells that they had prepared and assisted in killing these creatures.\u003c/p\u003e\n\u003cp\u003eLeylin only took a look and did not bother about them anymore.\u003c/p\u003e\n\u003cp\u003e* Sssii! *The corpse of the brown bear that Leylin had killed rapidly decomposed. From the bones, many veins appeared, which turned into the creature that Leylin and the rest had been chasing earlier. The creature then climbed into the Mankestre\u0027s mouth.\u003c/p\u003e\n\u003cp\u003eThe Mankestre Snake opened its mouth and revealed rows of razor sharp teeth. Its tongue coiled, as it swallowed the strange red veined creature into its belly.\u003c/p\u003e\n\u003cp\u003e\"Retrieving its parasite huh?\" Leylin was rather shocked.\u003c/p\u003e\n\u003cp\u003eAfter swallowing the parasite, the Mankestre Snake finally uncoiled and looked at Leylin and the group, who were unrestrainedly slaughtering the creatures. Its crimson eyes showed signs of rage.\u003c/p\u003e\n\u003cp\u003e* Bang! * The huge body of the snake shot out, and the entire cave trembled violently.\u003c/p\u003e\n\u003cp\u003eThe huge Mankestre Snake\u0027s body moved at an alarming speed, charging towards Jackson.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s too quick! With an agility of 6.5, I can only see its afterimage \" Leylin rapidly retreated, and at the same time, he used the cross blade to block his chest.\u003c/p\u003e\n\u003cp\u003eA surge of immense force came rushing over, and the cross blade that Leylin held onto flew in the air, completely broken .\u003c/p\u003e\n\u003cp\u003e\"Such a strong force, and it\u0027s only a casual swipe!\" Leylin\u0027s pupils constricted.\u003c/p\u003e\n\u003cp\u003eThe Mankestre Snake opened its jaws wide, and its razor sharp teeth snapped at Jackson, bringing about a fish-like smell. If Jackson were to be caught, he would definitely die without a corpse left.\u003c/p\u003e\n\u003cp\u003e\"Sir!\" The remaining two Knights and the grey robed person shouted.\u003c/p\u003e\n\u003cp\u003e\"Hah! Good try!\" At the brink of death, Jackson finally released all of his internal energy, and the sword pierced at the crown of the snake with a speed that was hard to track by eye.\u003c/p\u003e\n\u003cp\u003eThe sword, however, only left a white spot on the scales of the snake. As for Jackson, he used the force to rebound, and twisted his waist, evading the snap of the snake\u0027s jaw.\u003c/p\u003e\n\u003cp\u003e\"Protect our Lord!\" The two Knights rushed forward. The Mankestre Snake let out a ferocious roar, and directly gobbled the two Knights into its belly.\u003c/p\u003e\n\u003cp\u003e\"Secondary Fireball!\"\u003c/p\u003e\n\u003cp\u003e\"Acidic Aqua Shot\"\u003c/p\u003e\n\u003cp\u003eAt this moment, the other acolytes also cast their spells, striking the body of the huge snake.\u003c/p\u003e\n\u003cp\u003e* Bang! * A black arrow with a yellow flame exploded from the body of the huge snake, revealing two scorched holes/wounds/gashes.\u003c/p\u003e\n\u003cp\u003eThe huge snake let off a roar, which carried a tinge of agony. Its scales shook, and it sent its tail flying towards the few acolytes.\u003c/p\u003e\n\u003cp\u003e\"The vitality of the snake is too high, any normal rank 0 spells would not be able to affect its movement at all!\"\u003c/p\u003e\n\u003cp\u003eThe huge snake swatted its tail, and a few acolytes who were unable to dodge in time were turned into meat pancakes, and blood oozed from beneath the snake\u0027s body.\u003c/p\u003e\n\u003cp\u003e\"No! Decker! Lancer!\" Murphy cried hoarsely in anguish.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no choice, we have to retreat first!\" The few remaining people huddled together, when the grey robed figure behind Jackson spoke in a deep growl.\u003c/p\u003e\n\u003cp\u003e\"No! This damned worm dared to kill Decker and the rest! I will definitely not let it go!\" Murphy\u0027s eyes were rather bloodshot.\u003c/p\u003e\n\u003cp\u003e\"I have a spell that can temporarily restrict its movements, the rest will be up to you guys.\"\u003c/p\u003e\n\u003cp\u003eMurphy stepped forward, placed the monocle that he always carried in his hand, and tossed it towards the huge snake.\u003c/p\u003e\n\u003cp\u003e* Bang! * The glass shattered on the huge snake, and many dark red runes suddenly surfaced.\u003c/p\u003e\n\u003cp\u003eThe dark red runes multiplied, and turned into the shape of a long chain, binding the snake within it.\u003c/p\u003e\n\u003cp\u003e\"What a powerful restraining spell!\" Leylin\u0027s eyes flashed, \"It will not be able to move for at least half a minute, so use whatever methods you guys have in that time.\"\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-65\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-67\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-66","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
