{"id":59225,"no":669,"title":"Chapter 669","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eDeparture and Twilight\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“And now my second descendant is born,” Leylin didn’t know himself what he was feeling exactly, but the birth of a descendant still caused a slight tenderness in his heart.\u003c/p\u003e\n\u003cp\u003e“Please excuse me,” he said to Offa and Jeffrey, knocking them out of their stupor.\u003c/p\u003e\n\u003cp\u003e“Of course Your Highness, go handle your own matters first,” they answered with understanding.\u003c/p\u003e\n\u003cp\u003eBlack flames flashed as Leylin disappeared, only to arrive at a room in the castle. This luxurious room was filled with the smell of blood and amniotic fluid. A few wet nurses had already collapsed on the floor, the main culprit being the infant that was still crying out loud.\u003c/p\u003e\n\u003cp\u003eThese wet nurses had been carefully selected, and almost all of them were rank 1 Warlocks. Still, the power from the rank 5 bloodline in the child’s body surpassed the limits of what they could bear.\u003c/p\u003e\n\u003cp\u003eAfter all, Leylin, Freya, and the rest normally suppressed their vital radiations on purpose to avoid polluting the surrounding environment. A newborn couldn’t possibly have such awareness.\u003c/p\u003e\n\u003cp\u003eAs the infant wept, darkness elemental energy particles emerged and began circling around it. Black flames burnt constantly, beginning to wreck the surrounding furniture and bed sheets.\u003c/p\u003e\n\u003cp\u003e“Its spiritual force and bloodline force are rebelling?” Instead of frightening him, this news actually made Leylin glad. “This child’s innate skill is very high!”\u003c/p\u003e\n\u003cp\u003eThis degree of rebellion did not bother him, and he easily suppressed it as he held the infant up. Seemingly due to sensing the bond of their bloodline, the infant immediately stopped crying upon seeing Leylin, and even let out an innocent smile.\u003c/p\u003e\n\u003cp\u003eBeing a peak rank 3 Warlock whose vitality surpassed most others, Freya had managed to maintain her consciousness till now. When she saw who had arrived, she was shocked at first but then relaxed, “Dear… Our child…”\u003c/p\u003e\n\u003cp\u003e“Yes, our child is born. It’s been hard on you,” Leylin comforted her gently, his palms still caressing the forehead of the infant in his embrace. Black light flashed in the room, causing it to fall into a deep slumber.\u003c/p\u003e\n\u003cp\u003eJust like this, Leylin embraced the child and accompanied Freya quietly. Even though she was a Warlock, the fatigue due to the pregnancy and labour of a child with such a unique bloodline still caused her to fall into a deep sleep very quickly.\u003c/p\u003e\n\u003cp\u003e‘A legacy of the bloodline, eternal from generation to generation.’ Leylin seemed to grow some special feelings as he looked at the soundly sleeping infant in his hands.\u003c/p\u003e\n\u003cp\u003eThe pursuit of eternal life was the dream of all humans, but there were almost none who succeeded in the endeavour. Hence there was another method; by producing offspring and passing down their bloodline, one could achieve a sort of immortality of genetics.\u003c/p\u003e\n\u003cp\u003eThen there was a sort of spiritual immortality. By passing on one’s own knowledge and perception of the world to others, teaching students of one’s culture and wisdom, one could achieve an immortality of its own.\u003c/p\u003e\n\u003cp\u003eDescendants would need to be nurtured. One would need to inculcate their own ideas in their blood descendants, spreading their knowledge. This, too, created an eternal life in some sense. As long as this tradition was passed from generation to generation, one could be considered as having partly accomplished the goal.\u003c/p\u003e\n\u003cp\u003eHence, be it in his previous life or in this world, humans always held feelings for their descendants. Although individuals who broke this norm did exist, they were not the mainstream.\u003c/p\u003e\n\u003cp\u003eTo Leylin, passing down his bloodline was not only a means to form his power. His descendants would inherit his ideas and legacy. Although true eternal life existed in the Magus World, something much more attractive than having descendants, that did not hinder him from keeping them as a last resort.\u003c/p\u003e\n\u003cp\u003e‘The power of its bloodline is very rich, but it also conceals some dangers!’ Soul force swept through the infant, revealing everything about its body before his eyes. Leylin’s eyebrows furrowed.\u003c/p\u003e\n\u003cp\u003eAt rank 5, the Kemoyin Emperor bloodline would definitely be detected by the Snake Dowager. With him taking the heat, these bloodlines that were diluted with others might not be given much attention, but even small movements, combined with the infants’ inability to stay on guard, would lead to complete annihilation. Hence, he had to take precautions.\u003c/p\u003e\n\u003cp\u003e‘A.I. Chip, construct a Dreamscape defence,’ Leylin commanded.\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip quickly responded. [Beep! Mission established! Beginning to transfer runes…]\u003c/p\u003e\n\u003cp\u003eMisty runes began to appear on Leylin’s hands one after the other, forming a unique seal that merged into the infant’s back before flickering and fading.\u003c/p\u003e\n\u003cp\u003e‘The possibility of his bloodline attracting attention was already very low. With the addition of these defences it should be negligible,’ Leylin was nodding as he thought of Celine, ‘I still need to find the time to make a trip to the Twilight Zone.’\u003c/p\u003e\n\u003cp\u003eThe main door was pulled open with a thud, and he walked out while carrying the child.Outside the door, Gilbert and Emma were waiting alongside Kubler and his other subordinates, all of them with excitement in their expressions.\u003c/p\u003e\n\u003cp\u003e“Congratulations, Master!” His first subordinate Warlock knelt down respectfully. Kubler’s actions were followed by the loud sounds of congratulations.\u003c/p\u003e\n\u003cp\u003e“Mm,” Leylin nodded, raising the infant in his hands above his head, “This child shall be called Syre. Syre Farlier, son of Leylin Farlier!”\u003c/p\u003e\n\u003cp\u003eIn the language of the central continent, the name Syre carried the connotation of being honourable and blessed. It was a very good name. Hearing Leylin’s announcement, Kubler and the others momentarily drowned the area with cheers, “Syre! Syre!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA grand feast was held that night in celebration. Not only did Offa, Jeffrey and Wayde attend, even Bevis had to force a smile on his face and come over to congratulate Leylin.\u003c/p\u003e\n\u003cp\u003eAfter the grand feast ended, Leylin gathered Gilbert, Emma, Offa, and the others, announcing his decision to set out on a long journey. He told these people that he’d discovered another world, and was preparing to delve into a long-term expedition.\u003c/p\u003e\n\u003cp\u003eAlthough Offa and others did not really understand Leylin’s actions, they still consented and promised to support the Ouroboros Clan as they always had. To the outside world, the Warlock invincible under Breaking Dawn was going to conduct long-term research, and he would hence stay in the Morning Star Area for a very long time.\u003c/p\u003e\n\u003cp\u003eLeaving aside the effect this news had on the central continent’s current situation, Leylin had left the Morning Star Area the very next day in secret.\u003c/p\u003e\n\u003cp\u003eHis departure this time was very low-profile. By the time someone realised it, they’d already lost his tracks.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eTwilight Zone.\u003c/p\u003e\n\u003cp\u003eThe lake of lava burst apart, revealing Leylin’s figure, looking expressionlessly at his cuff. There, the lava had impressively burnt a round hole, leaving a mark.\u003c/p\u003e\n\u003cp\u003e‘Indeed. Now that I’m sealed, I’m not as strong as the last time I came here. I can only be considered an ordinary Morning Star now…’ A bitter smile hung at the corner of Leylin’s lips.\u003c/p\u003e\n\u003cp\u003eDue to the restrictions from the Allsnake Curse, he could no longer utilise power at Radiant Moon, even having taken the initiative to seal his bloodline force. Still, all that had only bought him three years of time.\u003c/p\u003e\n\u003cp\u003eHe had to use this time to break through the shackles of his bloodline, resolving the curse. If not, the consequence would be his bloodline being completely sealed by it, something that would lead to immediate death!\u003c/p\u003e\n\u003cp\u003eNow that he’d taken the initiative to seal a large portion of his bloodline, the A.I. Chip evaluated him to be no stronger than a Morning Star Magus. The best proof of this was the lava passageways. He could run amok in them before, but now it had managed to break through his defences and even leave a mark on his clothes.\u003c/p\u003e\n\u003cp\u003e‘This doesn’t feel good,’ Leylin’s eyebrows furrowed.\u003c/p\u003e\n\u003cp\u003eBeing sealed due to the Allsnake Curse, he was now inferior to an ordinary Radiant Moon Magus. He had to conceal his own aura in the Morning Star Area to deceive people, so how would he dare to stay there for any length of time? With his strength having suffered great losses, the central continent was too dangerous for him. He had to go into hiding for some time.\u003c/p\u003e\n\u003cp\u003eLeylin never believed in fairness and good blood. Only the most meticulous plans would guarantee his safety as he advanced on his path. Remaining in the Morning Star Area would cause unending problems. Going out instead was better for both parties.\u003c/p\u003e\n\u003cp\u003eBefore confirming that Leylin had thoroughly died, who would dare to harm the Ouroboros Clan, Freya and her child?\u003c/p\u003e\n\u003cp\u003eThere was, in fact, a darker thought deep in Leylin’s heart. If anyone reached out for his power, he could at most come back for revenge later on, paying them back tenfold. Those with no qualms made the most terrifying of enemies.\u003c/p\u003e\n\u003cp\u003e‘After resolving the matters in Twilight Zone, I’m afraid I’ll need to make a trip to the south coast.’ Making silent calculations, Leylin suddenly lifted his head to look at the gloomy rock ceiling, letting loose a quiet sigh.\u003c/p\u003e\n\u003cp\u003eThe current him had to leave for the Purgatory World to resolve the Allsnake Curse. With the Snake Dowager’s lair being there, the amount of danger could not be described.\u003c/p\u003e\n\u003cp\u003eThus, even Leylin wasn’t very confident in his outing this time. Thus, settling all matters on his hands evidently became important. The central continent was taken care of, and next would be Twilight Zone.\u003c/p\u003e\n\u003cp\u003eAfter that, he still wanted to return to the south coast in his heart. Be it the rank 3 Magus who inflicted serious damage on him at that time and force him to flee underground, or the matters related to the Farlier Family on the Chernobyl Islands, he needed to tie up all loose ends.\u003c/p\u003e\n\u003cp\u003eEven a Morning Star like the current him would be invincible in the south coast.\u003c/p\u003e\n\u003cp\u003eOnly when these matters were totally resolved would Leylin be able to abandon everything completely. He could then enter the Purgatory World, striving for his own path forward even at the cost of death.\u003c/p\u003e\n\u003cp\u003e‘Twilight Zone’s matters are easy. Only, should I leave behind a hand in the shadows?’ Leylin stroked his chin. His entire figure suddenly transformed into a black flame, whistling into the horizon.\u003c/p\u003e\n\u003cp\u003eCeline was currently beside a cradle. Looking at the figure that suddenly emerged beside her, she exclaimed with pleasant surprise, “Leylin!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-668\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-670\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-669","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
