{"id":59244,"no":688,"title":"Chapter 688","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eThorned Thunderbird\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“How brazen of you, intruding into the restricted area of the Lyers Family!” The Magi surrounding Leylin and Jorgian wore robes and had long, ocean blue hair. To his surprise, these silver-pupiled, fair-skinned people had an obvious aura from a bloodline on them. They were a group of Warlocks!\u003c/p\u003e\n\u003cp\u003e‘Bloodline Warlocks! I never thought there’d be Warlock inheritances in the subterranean world!’ Light flashed in Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003e‘No, this is only to be expected. After all, the subterranean world is much more vast than the surface world, and it’s normal for there to be ancient Warlock inheritances. I just never expected that there would be Warlocks protecting the other side of the tunnel in the Eternal Plains pocket dimension…’\u003c/p\u003e\n\u003cp\u003eLeylin surveyed his surroundings. The Warlocks surrounding them looked very young, but this was a side-effect of their bloodlines. They were in face much older, and the aged aura created a huge contrast with their handsome faces.\u003c/p\u003e\n\u003cp\u003e‘They’re at least rank 2… Also, this bloodline?’ A light blue tint covered Leylin’s eyes. The surrounding Warlocks were just as shocked seeing that two people had been able to exit the restricted area.\u003c/p\u003e\n\u003cp\u003e;A.I. Chip, scan their bloodlines and match it with the database!; Leylin commanded inside his mind.\u003c/p\u003e\n\u003cp\u003eThese Warlocks were under Morning Star, and did not notice any of Leylin’s actions. The A.I. Chip quickly obtained what he wanted.\u003c/p\u003e\n\u003cp\u003e[Collection of bloodline data complete. Comparing with database… Determined to be ancient Thorned Thunderbird.]\u003c/p\u003e\n\u003cp\u003eImmediately after, the A.I. Chip showed all information on the ancient Thorned Thunderbird.\u003c/p\u003e\n\u003cp\u003e[Beep! Ancient Thorned Thunderbird, rank 6 being! Rumoured to be descendant of the primordial Thunderbird. Possesses powerful thunder and lightning abilities and soundwave attacks. Likes to dwell in areas with plentiful metal elementals. Evaluation: Incomparably dangerous. The nemesis of ancient metal race!]\u003c/p\u003e\n\u003cp\u003e“Bloodline Warlocks from rank 6 beings! No wonder I felt the bloodline giving me some slight pressure!”\u003c/p\u003e\n\u003cp\u003eLeylin watched the surrounding Warlocks with some pity in his eyes, “It’s a pity that the Warlocks’ bloodlines have weakened quite a bit and can’t be purified to its original rank 6!”\u003c/p\u003e\n\u003cp\u003eThe Warlocks surrounding Leylin might have bloodline from a rank 6 ancient Thorned Thunderbird, but their status was similar to the Black Horrall Snake Warlocks of the Ouroboros Clan. The bloodline had weakened and lost all the power from their ancestors.\u003c/p\u003e\n\u003cp\u003e“However, since they exist, there must be powerful people within this Warlock family. I should be able to purify their bloodline…”\u003c/p\u003e\n\u003cp\u003eLeylin shot a glance at these Warlocks with malicious intent, giving them a feeling as if calamity loomed.\u003c/p\u003e\n\u003cp\u003e“However, this is the Lyers family’s restricted area, and you intentionally got these adventurers to enter. Seems like there’s some unspeakable secret inside…”\u003c/p\u003e\n\u003cp\u003eLeylin thought about it for a while and did not eliminate the possibility of the Lyers family giving out this news in order to get blood sacrifices, attracting adventurers to come and explore.\u003c/p\u003e\n\u003cp\u003eIf that was the case, it would explain why Jorgian and his crew were obviously low-ranked, but could enter the ruins without obstructions.\u003c/p\u003e\n\u003cp\u003e“Why are you still talking to them? All Magi who sully our Lyers Family have only the ending of death!”\u003c/p\u003e\n\u003cp\u003eThe Warlocks of the Lyers family were urged on by someone like a leader and immediately chose to attack without hesitation. Fine, minute static electricity force field were produced from their bodies, forming a powerful domain that kept Leylin and Jorgian within. Leylin could practically feel their bloodlust, and they evidently wanted to keep them here no matter the cost.\u003c/p\u003e\n\u003cp\u003e“This spell?” Seeing these Warlocks all having blue electricity shooting everywhere that formed a large-scaled static electricity field that merged and amplified each other, Leylin looked slightly interested.\u003c/p\u003e\n\u003cp\u003e[Rank 1 spell: Static electricity field! Determined to be opponent’s rank 1 innate spell that can produce static electricity force field on a large scale. Energy consumption at the minimum, and has effects of amplifying each other.]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip transmitted the functions of the spell at this moment.\u003c/p\u003e\n\u003cp\u003e“Kill him!” The leader donned a layer of lightning armour, and two gigantic blue bright wings stretched behind his back, causing his speed to suddenly increase. He almost turned into a streak of blue lightning.\u003c/p\u003e\n\u003cp\u003e[Rank 2 Thorned Thunderbird Warlock Bloodline Spell determined to be: Lightning Armour, rank 3 bloodline spell: Wings of Lightning.]\u003c/p\u003e\n\u003cp\u003eThrough the opponent’s bloodline activities and spells, the A.I. Chip managed to gather much information, and large amounts of data was showed in front of Leylin.\u003c/p\u003e\n\u003cp\u003e“As expected of an ancient rank 6 bloodline. These innate abilities are very practical!”\u003c/p\u003e\n\u003cp\u003eLeylin sighed slightly. It was a pity that there were no Morning Star Warlocks in their midst. No matter how useful a spell, they were pointless if they did not reach a certain level.\u003c/p\u003e\n\u003cp\u003e“Break!” Leylin spat out a syllable and terrifying darkness-type elemental particles spread like a rising tide.\u003c/p\u003e\n\u003cp\u003eSurging energy particles thundered as they turned into a giant beast with a weapon, attacking the opponents’ joint static electricity forcefield.\u003c/p\u003e\n\u003cp\u003e*Tss tss!* Blue sparks flashed and mixed with streams of black gas. Immediately after, there was a dull sound of thunder, and even the ground shook.\u003c/p\u003e\n\u003cp\u003eMiserable cries rose and fell in succession, and the Thunderbird Warlocks who were only rank 1 and 2 crumpled to the ground.\u003c/p\u003e\n\u003cp\u003e*Chiu chiu!* The leader in the air who saw this emitted a piercing cry, turning and then transforming into lightning and leaving.\u003c/p\u003e\n\u003cp\u003e“Get down here!”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes were never on him, but a faint image of a double-headed black snake had already appeared on him, four blood-red eyes giving him a dead stare.\u003c/p\u003e\n\u003cp\u003e“Hss hss!” The snake kept flicking its tongue and quickly drew this leader into its mouth. Blue lightning flashed everywhere and then disappeared.\u003c/p\u003e\n\u003cp\u003eThe double-headed black snake meandered to the ground and spat out the leader. However, he had already fainted, and the lightning around his body had disappeared without a trace.\u003c/p\u003e\n\u003cp\u003e“Too weak. Much too weak! This extent…”\u003c/p\u003e\n\u003cp\u003eLeylin narrowed his eyes. A bloodline like this wasn’t enough to even arouse his interest to extract it.\u003c/p\u003e\n\u003cp\u003e“My- my lord! We…” At the other side, Jorgian, who had seen Leylin and Lyers fighting had been so afraid that he’d fainted before.\u003c/p\u003e\n\u003cp\u003eThe Lyers family’s reputation was like a sun in the sky within the Arthur Empire. It was said they had a Morning Sar in charge. Wasn’t this Magus seeking death by provoking him?\u003c/p\u003e\n\u003cp\u003eHowever, the crux of the issue was that whether Leylin or the Lyers family, Jorgian could not afford to offend either side and almost burst into tears.\u003c/p\u003e\n\u003cp\u003e“I’ll wait for a while more here. Leave first!” Leylin shooed him away.\u003c/p\u003e\n\u003cp\u003e“How– How can I leave my lord behind to confront the Lyers family?” He hesitated, but Leylin obviously could tell.\u003c/p\u003e\n\u003cp\u003e“Once their reinforcements come, it wouldn’t be just these sort of low-ranked characters. What, you mean you’re thinking of going against the Lyers family with me?”\u003c/p\u003e\n\u003cp\u003eLeylin had a half-smile on his face as he watched Jorgian.\u003c/p\u003e\n\u003cp\u003e“No, no, my lord! I shall take my leave first!” He immediately turned pale and fled at lightning-speed after bowing, as if there was some ferocious beast chasing him.\u003c/p\u003e\n\u003cp\u003eWatching his back, Leylin shook his head. He was just a tiny character after all, and if he really did stay, unafraid of death, he’d definitely be affected . Choosing to leave was a rather sensible decision.\u003c/p\u003e\n\u003cp\u003eNow, Leylin could not be bothered with this boy. He watched a trace of lightning shooting over from the distance, a smile lighting up his face slightly.\u003c/p\u003e\n\u003cp\u003e“Chiu chiu!” It was as if tens of thousands of birds were calling at the same time. When the lightning disappeared, there was another figure in the sky.\u003c/p\u003e\n\u003cp\u003e“You attacked them?” The newcomer was very young, and his brows were furrowed in his anger. He’d evidently been angered by the miserable state of the many Lyers family Warlocks on the ground.\u003c/p\u003e\n\u003cp\u003e“They offended me. I’ve been benevolent enough not to kill them. If I did things like I usually do, they can only descend to the underworld and repent for their sins!” Leylin shrugged.\u003c/p\u003e\n\u003cp\u003e*Huala!* White electric current streaked past, as if tearing through the sky. In mid air, the Warlock’s overbearing and furious words could be heard, “Good, very good! Then I’ll let you see a bit of my ‘benevolence’!”\u003c/p\u003e\n\u003cp\u003eTerrifying energy from someone who had reached the realm of a rank 4 Warlock and attaining Morning Star burst from his body. Countless dark clouds converged, enveloping the whole region.\u003c/p\u003e\n\u003cp\u003e*Rumble!* Eight blue pillars of light instantly descended. Boundless lightning shot out from the pillars, forming a large purgatory.\u003c/p\u003e\n\u003cp\u003eLightning and fire gathered in purgatory and trapped Leylin within.\u003c/p\u003e\n\u003cp\u003e[Rank 4 Thorned Thunderbird Warlock Bloodline Spell determined to be: Berserk Lightning Prison.] The A.I. Chip projected the opponent’s spell before Leylin at this moment.\u003c/p\u003e\n\u003cp\u003e“A rank 4 spell. Looks like I have to get a little serious!”\u003c/p\u003e\n\u003cp\u003eLeylin’s expression became grimmer. He, who now was struck by the Curse Mark of Ten Thousand Snakes, could only display Morning Star strength and was on par with the opponent.\u003c/p\u003e\n\u003cp\u003e*Chi chi! Huala!* Numerous electricity snakes surrounded by flames opened their mouths full of blood and devoured Leylin.\u003c/p\u003e\n\u003cp\u003eDazzling lightning was very harsh on the eyes, but a hint of black rays leaked from the electricity.\u003c/p\u003e\n\u003cp\u003eThe black radiance grew until it cut through the lightning, turning into an illusory, terrifying giant serpent and appeared behind Leylin.\u003c/p\u003e\n\u003cp\u003e“Hss…” The serpent had shackles with metallic stings, but it still paid that no mind as it snarled at the lightning clouds in the sky.\u003c/p\u003e\n\u003cp\u003e“Warlock? Such a terrifying an evil bloodline force?”\u003c/p\u003e\n\u003cp\u003eFrom within the thunderclouds, the Warlocks’ bewildered voice could be heard. Following which, the voice silenced and turned into the piercing sounds of rumbling.\u003c/p\u003e\n\u003cp\u003e*Chiu chiu!*\u003c/p\u003e\n\u003cp\u003eA streak of dazzling blue radiance abruptly burst forth from the clouds, landing on Leylin’s shoulder.\u003c/p\u003e\n\u003cp\u003e“Booming Thunderclap!” The opponent’s voice only reached Leylin after the electricity struck Leylin.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-687\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-689\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-688","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
