{"id":58625,"no":69,"title":"Chapter 69","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVestige Traces\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe night was dark, and there was tranquility. Dried up old trees littered the surroundings, and on the branches, there were ravens ruffling their feathers.\u003c/p\u003e\n\u003cp\u003e* Bang! *\u003c/p\u003e\n\u003cp\u003eThe grass patch below the tree tore open, revealing a dark passage beneath it.\u003c/p\u003e\n\u003cp\u003eLeylin was draped in black robes, and his face was veiled. One would not be able to see his face.\u003c/p\u003e\n\u003cp\u003eThe nearby villa was still lit with lanterns, and the patrolling mercenaries did not know that their master had already left the villa.\u003c/p\u003e\n\u003cp\u003eIn Leylin\u0027s experiment lab, there was a direct passage which Leylin set up himself, with no one being the wiser.\u003c/p\u003e\n\u003cp\u003e\"Since that huge Mankestre snake is an experimental body, there should be some experiment labs nearby from magicians! Moreover, that huge Mankestre snake had actually occupied Dark Night Woods for a few years, and not one magician had stepped forward to deal with it. There could only be one reason for that!\"\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s eyes flashed, \"That experiment lab is most likely abandoned! The magician in it, due to some circumstances, could no longer look after it, or is most likely dead! That is why the huge snake could escape from it!\"\u003c/p\u003e\n\u003cp\u003eFor magicians, seeking ancient vestiges had always been in their best interests.\u003c/p\u003e\n\u003cp\u003eThe remnants left by ancient Magi, such as official Magi experiment labs, would often contain many valuable data and ingredients, high levelled research, spells and magic artifacts with immense might. These were all items that magicians always sought after.\u003c/p\u003e\n\u003cp\u003eRumour had it that more often than not, there were examples of acolytes who were lacking having stumbled upon ancient remnants, and beginning to wield tremendous power after that.\u003c/p\u003e\n\u003cp\u003eOf course, there were failed ventures and explorations where they finally died under the ancient mechanisms or curses from the corpses.\u003c/p\u003e\n\u003cp\u003eHowever, for magicians, searching for vestiges was still a very beneficial thing to do.\u003c/p\u003e\n\u003cp\u003eFrom an experiment lab which could create a half-adult huge Mankestre snake, any one item in it could let Leylin immediately get rich quickly, and even obtain more precious ingredients and knowledge to pave the way for him to advance into an official Magus in future.\u003c/p\u003e\n\u003cp\u003e\"Since I have already found some traces, I will definitely have a look at the experiment lab!\"\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s gaze was determined. He was not afraid of risks, especially when the benefits strongly outweigh the risks.\u003c/p\u003e\n\u003cp\u003eFor this venture, he had specially prepared many items, which were enough measures to counter against any sudden developments.\u003c/p\u003e\n\u003cp\u003eAs for his subordinates? Not only were they easily susceptible to divulging news, but under the traps set up by official Magi, even Knights were only an existence slightly greater than ants. They were completely of no use, hence Leylin even kept his departure from them.\u003c/p\u003e\n\u003cp\u003eLeylin journeyed for several nights in a row. Since there were no people around, he could use many of his methods.\u003c/p\u003e\n\u003cp\u003eHe splashed a green potion onto the ground, bringing about a ball of green coloured wind particles, which wrapped Leylin\u0027s body within them. His whole body seemed to turn into a breeze, and disappeared into the night.\u003c/p\u003e\n\u003cp\u003eWhat Leylin used was a hastening potion which he had formulated throughout the years.\u003c/p\u003e\n\u003cp\u003eAs an outstanding Potions Master, no matter if it was using potions to journey or fight, he was entirely in his element.\u003c/p\u003e\n\u003cp\u003eIn the original passage, where Leylin and the others had battled the huge Mankestre snake.\u003c/p\u003e\n\u003cp\u003ePeople had already been sent from the city lord\u0027s castle to retrieve the mutilated corpses and largely dissected huge Mankestre snake. What remained were many impressions on the ground, as well as traces of flames and frost, which spoke of the intense fight that had occurred previously.\u003c/p\u003e\n\u003cp\u003e\"The scenario from earlier has already been recorded down by the crystal ball given by the academy. To use that to signify the completion of mission is absolutely acceptable.\"\u003c/p\u003e\n\u003cp\u003eFrom the battle previously, Leylin had used the crystal ball to record only most of the exploration mission, especially the corpse of the huge Mankestre snake at the end.\u003c/p\u003e\n\u003cp\u003eWith some ingredients from the corpse, as well as the record from the crystal ball, it could be said that Leylin\u0027s mission in Extreme Night City was finally completed.\u003c/p\u003e\n\u003cp\u003eHowever, he had no plans whatsoever to leave at all.\u003c/p\u003e\n\u003cp\u003eNot mentioning whether the mess of a war that Abyssal Bone Forest Academy was entangled in at the moment already had a victor, Leylin did not want to go back during this period.\u003c/p\u003e\n\u003cp\u003eHe had just managed to formulate a modified formula for the Azure Potion. Now would be the best time to break through into a level 3 acolyte, so why would he risk going back to the academy and expose himself in the process?\u003c/p\u003e\n\u003cp\u003eAs for Extreme Night City, Leylin did not even see an official Magus, which put him at ease to carry out his experiments and breakthrough.\u003c/p\u003e\n\u003cp\u003eLeylin would wait for a buffer of three years after the dust settled for the war of the Abyssal Bone Forest Academy. Although his advancement to a level 3 acolyte would still be fast that way, it would not be as eye catching!\u003c/p\u003e\n\u003cp\u003eAt that time, he could figure out an excuse, and cover his tracks easily.\u003c/p\u003e\n\u003cp\u003eAs for the corpses of the acolytes on the floor, naturally, they had already been inspected by Leylin. Back then, he had kept all the valuable items for himself before bringing the heavily injured Jackson and Murphy to leave the place.\u003c/p\u003e\n\u003cp\u003e\"However, that group of acolytes were all paupers, and not a single one of them had more than 10 magic crystals! Only on that Half-Beast Man acolyte, there was still a frost smelted gold rune which can be considered to be rather good!\"\u003c/p\u003e\n\u003cp\u003eLeylin grumbled in his mind, as he came to the centremost area of the cave.\u003c/p\u003e\n\u003cp\u003eUnder the light radiated by the Flash Jellyfish, the whole cave was extremely bright. Leylin could see that on the ground at the centre, traces of where the huge Mankestre snake was coiled were still apparent.\u003c/p\u003e\n\u003cp\u003e\"It actually managed to make such a deep impression, they are indeed of the same nature narrated by compendiums: an extremely lazy being.\u003c/p\u003e\n\u003cp\u003eLeylin crouched and felt the earth that was sunken in.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Record composition!\"\u003c/p\u003e\n\u003cp\u003e[Recording completed, comparing to normal earth data in the databank. The target has 0.0005% of compound remnants, and is tentatively determined to contain Maike alloy!]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip\u0027s voice intoned.\u003c/p\u003e\n\u003cp\u003eMaike alloy was a type of artificial metal, made by spells of magicians, that was extensively used to construct incubation pools in experiment labs.\u003c/p\u003e\n\u003cp\u003e\"This is right!\" Leylin eyes flashed with glee.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip, is it possible to follow the tracks of the snake and find its original breeding area?\u003c/p\u003e\n\u003cp\u003e[Scanning in progress! The target\u0027s data has been heavily covered by other creatures and is lacking in important information. Mission failed!] The A.I. Chip\u0027s voice intoned.\u003c/p\u003e\n\u003cp\u003eLeylin scanned the surroundings. The ground was littered with claw marks from various creatures. Such was the devastation left by the parasitic abilities of the huge Mankestre snake.\u003c/p\u003e\n\u003cp\u003e\"What a pity....\" Leylin shook his head.\u003c/p\u003e\n\u003cp\u003e\"However, according to the habits of the huge Mankestre snake and the clues left by the other traces, that experiment lab should not be far off from here!\"\u003c/p\u003e\n\u003cp\u003eLeylin commanded the A.I. Chip, \"A.I. Chip, scan every item in the surroundings!\"\u003c/p\u003e\n\u003cp\u003e[Missions establishing, beginning imaging!]\u003c/p\u003e\n\u003cp\u003eAlong with the A.I. Chip intonation, the image of a blue coloured map was projected in front of Leylin\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eIn the centre was a huge cave, with many small tunnels in the near vicinity. Leylin even found a few parasitic bodies that had survived through sheer luck. However, it was unknown how much longer they could live for when the parent was dead.\u003c/p\u003e\n\u003cp\u003eThe map expanded until it finally reached the limit of its range.\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s brows furrowed, \" A.I. Chip, restart scan! Lower the precision to the lowest, and search in an extended perimeter! Begin running through a checklist of radioactive density!\"\u003c/p\u003e\n\u003cp\u003eWith the command, the map in Leylin\u0027s eyes turned more out of focus. However, the perimeter extended, almost encompassing the nearby geography of the cave too.\u003c/p\u003e\n\u003cp\u003e\"Maintain this area and precision!\"\u003c/p\u003e\n\u003cp\u003eLeylin walked out of the cave and began running towards a direction. Following his movement, the edge of the map also continuously expanded....\u003c/p\u003e\n\u003cp\u003eA few hours later, Leylin walked towards a large black granite boulder.\u003c/p\u003e\n\u003cp\u003e\"The surrounding areas have already been inspected. Although the radioactive densities are higher, this should be where the shedding of the huge Mankestre snake took place previously!\"\u003c/p\u003e\n\u003cp\u003e\"As for the only place with no radiation, but not within the scope of the A.I. Chip\u0027s scanning perimeter, this is the only place!\"\u003c/p\u003e\n\u003cp\u003eLeylin looked at the large black granite boulder in front of him. This boulder was of the height of several humans, almost the size of a small mountain.\u003c/p\u003e\n\u003cp\u003eIn the map that the A.I. Chip scanned, this huge boulder had absolutely no traces of radiation. Even standing before it now, the A.I. Chip still did not detect anything.\u003c/p\u003e\n\u003cp\u003e\"This kind of scenario has happened several times back at the academy. It is due to the spell formations set by official Magi, which are interfering with the detection of the A.I. Chip!\"\u003c/p\u003e\n\u003cp\u003eLeylin stroked the surface of the large black granite boulder. It was ice cold, damp, and had algae growing on it.\u003c/p\u003e\n\u003cp\u003e\"However....What I must do to enter?\"\u003c/p\u003e\n\u003cp\u003eLeylin exerted strength in his right arm and grabbed some of the rock powder.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Analyse composition!\"\u003c/p\u003e\n\u003cp\u003e[Beep! Mission establishing, in the process of gathering data....] The A.I. Chip\u0027s voice continuously intoned, and a screen appeared in front of Leylin that was densely packed with the various data of the granite rock.\u003c/p\u003e\n\u003cp\u003e\"It seems like there are no differences between this and a normal granite rock!\" Leylin drew the data of normal granite rock and made a comparison. However, he finally had to acknowledge that the magician defended his secrets very well. Leylin had absolutely no way of finding the entrance to the experiment lab.\u003c/p\u003e\n\u003cp\u003e\"However, since that huge Mankestre snake was able to come out, it means that the defense in the spell formation has some sort of problem. I just require more time to inspect....\"\u003c/p\u003e\n\u003cp\u003eLeylin stroked his chin and began setting up a tent beside the granite rock.\u003c/p\u003e\n\u003cp\u003eHe decided to stay here for a long time in order to continuously detect any loopholes or weakness in the spell formation, hoping to find a way to enter.\u003c/p\u003e\n\u003cp\u003eAfter all, there won\u0027t be anyone coming to the vicinity of the withering woods anymore, especially when the city lord\u0027s castle has sent people to retrieve the corpses of the acolytes, troops and the huge snake.\u003c/p\u003e\n\u003cp\u003eAfter chewing on several biscuits that he brought along with him, Leylin began to analyse the spell formation on the large black granite boulder.\u003c/p\u003e\n\u003cp\u003eOf course, he only dared do this as he was sure that the owner of the lab was already dead through his observations and conjectures. Who knew if that unknown magician had long since died a natural death.\u003c/p\u003e\n\u003cp\u003e\"After having been here for so long, yet with no magicians coming out, the accuracy of this conjecture has yet been raised by 30%.\u003c/p\u003e\n\u003cp\u003eLeylin stared at the large black granite boulder before him with a zealous expression contained within.\u003c/p\u003e\n\u003cp\u003e\"If I manage to dispel the spell formation, the items in there are all mine!\"\u003c/p\u003e\n\u003cp\u003eFor Leylin, who was a level 2 acolyte, an experiment lab belonging to an official Magus was a huge treasure trove!\u003c/p\u003e\n\u003cp\u003e\"Only that... The traps set by official Magus are extremely dangerous. I must absolutely not be blinded by greed and fall into a trap!\"\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-68\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-70\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-69","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
