{"id":59249,"no":693,"title":"Chapter 693","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eRemodelling the Mask\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Ah, the Purgatory World……”\u003c/p\u003e\n\u003cp\u003eLight seemed to flash in Leylin’s eyes, “In the ancient times, it was an extremely famous and formidable world. Not only does it have the Snake Dowager, but there are also numerous existences of the same rank keeping watch there. Moreover, the Purgatory World has not completely declined like the Magus World, as it still possesses the strength of ancient times…”\u003c/p\u003e\n\u003cp\u003e‘Forget the dangers of the place itself, even finding the Purgatory World’s coordinates is already a considerably huge problem!’ Leylin rubbed his chin in thought, ‘According to the information from the legacy left behind by the Ouroboros clan’s ancestors, it is fundamentally possible to confirm that the Purgatory World is located in the Calm Jade constellation. However, the specific positioning is still a problem!’\u003c/p\u003e\n\u003cp\u003eThe Snake Dowager’s bloodline shackles were still present, and the Ouroboros Clan’s ancestors had never given up on exploring the astral plane.\u003c/p\u003e\n\u003cp\u003eFrom the information and experience that they accumulated from generation to generation, and adding the A.I. Chip’s analysis and deduction, it was already possible to lock down the coordinates of the Purgatory World to within one region.\u003c/p\u003e\n\u003cp\u003eIt was a pity that the Calm Jade constellation was just too big. Finding the Purgatory World in it was like finding Leylin’s old Earth in the Milky Way.\u003c/p\u003e\n\u003cp\u003eAnd what Leylin now wanted to do, was to ascertain the position of that ‘earth’ within the galaxy’s myriad of stars, planets and other celestial bodies.\u003c/p\u003e\n\u003cp\u003eWithout having to be said, this was an extraordinarily tremendous undertaking. Even though Leylin had the A.I. Chip’s assistance, he also needed to wait for a very long time. But now, the Snake Dowager’s curse evidently did not afford him that luxury.\u003c/p\u003e\n\u003cp\u003e‘And even if the coordinates of the Purgatory World have been found… This curse!’ Leylin couldn’t help but reach up to his cheeks, feeling the icy sensation emitted by the Mask of the Dreamless.\u003c/p\u003e\n\u003cp\u003eAlthough this mask had prevented him from being drawn into Dreamscape, he constantly felt the ill intent from the dream world. This intention possessed tremendous cruelty, and there were constant attacks on the mask’s defenses. It appeared like they were waiting for Leylin to relax, or the Mask of the Dreamless to shatter one day.\u003c/p\u003e\n\u003cp\u003e‘The Snake Dowager is the master of the bloodline, I’m afraid her response towards my descendants will be incomparably cruel. Not to mention the Allsnake Curse… Once I appear in the Purgatory World, what if she realises it? Won’t I be delivering myself to her door?’\u003c/p\u003e\n\u003cp\u003eLeylin’s face darkened. Despite how much her power had been suppressed in reaching out to the Magus World, she’d still managed to leave him with a fate worse than death as she’d pleased. If he entered the Purgatory World…\u003c/p\u003e\n\u003cp\u003eConsequently, before going to the Purgatory World, it was absolutely necessary to have an effective method to conceal himself.\u003c/p\u003e\n\u003cp\u003e“A. I Chip! Establish mission, conceal my aura. Find a way to prevent discovery by the Snake Dowager!” Leylin commanded.\u003c/p\u003e\n\u003cp\u003e[Beep! Mission established, beginning to collect data, establishing simulation……] The A.I. Chip’s feedback was very prompt.\u003c/p\u003e\n\u003cp\u003e‘The preparation needed to leave for the Purgatory World is really too much…’ Leylin knitted his brows in vexation, ‘I need to look for the world’s coordinates, develop a concealment technique, and also find time for space concealment technology. I then need to hide myself, and find a method to avoid piquing the interest of the World Will, and then try to escape the guardians…’\u003c/p\u003e\n\u003cp\u003eIf it was a normal small scale world, these inconveniences could be reduced a little, but the Purgatory World that Leylin wanted to go to was a gigantic world. In the ancient era it was second only to the Magus World and the Astral World, and there existed many at or above rank 7 there. One misstep would mean death… Actually even death would be a luxury, so Leylin absolutely couldn’t afford to be careless.\u003c/p\u003e\n\u003cp\u003e[Simulation complete! Possibility of hiding from the Snake Dowager: 89.7%!] the A.I. Chip rapidly projected the results, putting a smile on Leylin’s face.\u003c/p\u003e\n\u003cp\u003e“The probability is quite good, what do I need to do?”\u003c/p\u003e\n\u003cp\u003e[Exporting program… the host needs to commence modification of spiritual force and soul force, and the Mask of the Dreamless must correspondingly be remodelled……]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip specifically laid out the steps one by one, forming a checklist that appeared in Leylin’s consciousness.\u003c/p\u003e\n\u003cp\u003e‘Mm… The A.I. Chip has stored materials and the required techniques. All I need is time…’ Leylin stroked his chin: “I don’t have much time left, it is necessary to act as quickly as possible…”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eSeveral months had passed in a flash. Leylin had remained inside the belly of the mountain in this period, sequestered from the outside world.\u003c/p\u003e\n\u003cp\u003eWith regards to Leylin, although the subterranean world’s resources and enormous knowledge attracted him greatly, under the effect of the Allsnake Curse his priorities had been made clear.\u003c/p\u003e\n\u003cp\u003eIf he couldn’t resolve the Allsnake Curse and break through the bloodline shackles then his path forwards would be completely cut off. This was a situation that Leylin absolutely could not endure! Thus, he put his utmost enthusiasm into his work, throwing himself into the preparations…\u003c/p\u003e\n\u003cp\u003e‘I’ve worked hard for several months, but there’s still two things left to do…’ Leylin looked at the black petri dish in front of him, within which a lump of dark brown liquid was spreading continuously.\u003c/p\u003e\n\u003cp\u003e“The mix of corrosive water from the Pool of Lamentation, and ground ancient bones…” White powder was thrown into the petri dish, making the dark brown liquid swell up at once.\u003c/p\u003e\n\u003cp\u003e“Weeping spirits who creep in the Abyss, in the name of the Nefarious Filthbird, I summon the power of chaos…” The ancient curse was cast, and amidst the bleak and mysterious words the dark brown liquid suddenly transformed into a formless blue mass.\u003c/p\u003e\n\u003cp\u003e“Finished!” A hint of joy emerged from Leylin’s eyes, and he gritted his teeth with resolution in his face.\u003c/p\u003e\n\u003cp\u003e*Bang!* He took off the Mask of the Dreamless, throwing it into the dark blue mass.\u003c/p\u003e\n\u003cp\u003eVery quickly, an evil intent arrived from a distant world. It was as if he was falling, and by the time Leylin understood what was happening he was already in a world of ice. White trees were everywhere, and the ceiling was dotted with shards of barb-like ice.\u003c/p\u003e\n\u003cp\u003eA white python flicked its scarlet tongue at Leylin.\u003c/p\u003e\n\u003cp\u003e“Alabaster Devilsnake, we meet again! I thought you would be replaced by a three-headed python this time!” Leylin laughed in the ugly face of the Alabaster Devilsnake, waves of dark red dreamforce appearing in his hands, “I do not have much time, I am afraid I cannot play with you for too long. I need to dispose of you quickly!\u003c/p\u003e\n\u003cp\u003e“Dreamforce spell—” Leylin’s eyes flashed with a trace of blood red, and piercing rays of light were continuously released from his body.\u003c/p\u003e\n\u003cp\u003eMisty light wrapped Leylin up along with the Alabaster Devilsnake in a flash. Faint trembles spread to every corner of this dream world.\u003c/p\u003e\n\u003cp\u003e*Schlick!* The enormous serpent roared with that sound, and the misty light withdrew to reveal the silhouette of the Alabaster Devilsnake. Only, there were many pure white scales scattered on the floor, and there was a fresh wound in the serpent’s skull. Scarlet blood continuously flowed out, dyeing the white snow red. It was a terrible scene,\u003c/p\u003e\n\u003cp\u003e“How could I waste the blood of a rank 5 creature?” Leylin lightly chuckled, and the blood floated up into the sky. It turned into crimson pearls that gathered in his palm, forming a ball of dark red.\u003c/p\u003e\n\u003cp\u003e*Hsss—* At this moment, the body of an enormous snake faintly emerged outside this icy world. It only exuded a tiny breath, but even that filled Leylin with a sense of heavy oppression.\u003c/p\u003e\n\u003cp\u003e‘That should be an existence at rank 6 at the least. With these endless reinforcements, I’m afraid even the strongest enemies will be dragged down completely. What a pity…’\u003c/p\u003e\n\u003cp\u003eLeylin bowed his body a little, as if he was leaving the field. He then called out to the Alabaster Devilsnake and the existence outside, “Farewell, gentlemen!”\u003c/p\u003e\n\u003cp\u003e*Boom!* A gentle and pleasant light emerged, and Leylin’s shadow disappeared into the light, leaving behind the useless roars of the two pythons.\u003c/p\u003e\n\u003cp\u003e[Beep! Set time has passed, beginning forceful awakening!] When Leylin heard the cold, mechanical sound of the A.I. Chip, it was more touching than any music.\u003c/p\u003e\n\u003cp\u003e“Phew… On the whole, there weren’t any errors in my calculations.” Leylin wiped his cold sweat, in reality, his actions today were certainly risky. Fortunately the end result was not bad, and it seemed as if fate was on his side.\u003c/p\u003e\n\u003cp\u003eA ball of dark red blood was floating in his hand, undulating with a frightening strength that was faintly mixed with dreamforce.\u003c/p\u003e\n\u003cp\u003eThis was the Alabaster Devilsnake blood that Leylin had collected. Dreamscape was both illusory and real, and if this power of confusion could be used properly it was more frightening than any spell.\u003c/p\u003e\n\u003cp\u003e*Rumble! Rumble!* White bubbles frothed around the Mask of the Dreamless in the petri dish, and Leylin threw the ball of blood into it.\u003c/p\u003e\n\u003cp\u003e*Bang!* A layer of demonic blood-red flames burnt up the surface of the Mask of the Dreamless. Accompanied by special undulations, traces of golden-red patterns began to slowly appear on the mask.\u003c/p\u003e\n\u003cp\u003e‘Once dreamforce is intercepted, it’ll take a while for it to dissipate. I need to take advantage of this moment’ Leylin’s eyes reddened as he used many complex alchemy techniques on the mask. The entire laboratory was lit up with brilliant lights and colours.\u003c/p\u003e\n\u003cp\u003eAt the last moment, the Mask of the Dreamless changed its appearance: It could still only cover half the face, but there were many fine lines on it now. On the surface of the mask were even strange patterns of red and gold.\u003c/p\u003e\n\u003cp\u003e[Beep! Mask of the Dreamless remodelling has been completed!] The A.I. Chip’s voice rang out, and it even displayed the data of the redone mask.\u003c/p\u003e\n\u003cp\u003e[Magic Item— Mask of the Dreamless (Improved Model) Weight: 210g Materials: Loke Alloy, One-Eyed Snake fangs, Alabaster Devilsnake blood. Effects: 1. Can protect from the surveillance of Dreamscape, protect the truesoul from suffering invasion from Dreamscape. 2. Can release Alabaster Devilsnake bloodline and soul force undulations, and conceal the host’s information…]\u003c/p\u003e\n\u003cp\u003e“Success!”\u003c/p\u003e\n\u003cp\u003eLeylin placed the ice-cold mask on his face, and with a single thought he emitted the aura of the Alabaster Devilsnake.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-692\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-694\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-693","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
