{"id":59255,"no":699,"title":"Chapter 699","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eBeholders\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“An Exemplary!” The leader of the merfolk cried out involuntarily, his eyes now holding a trace of reverence towards Leylin. However, he wasn’t all that surprised either. From what Leylin had done, it was evident that he was no ordinary person.\u003c/p\u003e\n\u003cp\u003e“We are people from the Eden trading company. If you don’t mind, you could come up our ship and get some rest. I believe the rest will be delighted to chat with an Exemplary…” The leader of the merfolk spoke reverently.\u003c/p\u003e\n\u003cp\u003eThis was the reason Leylin showed his strength. In a primitive world in an era during the age of discovery, there must be sins everywhere behind the scenes. The law of the jungle was utilised to the utmost.\u003c/p\u003e\n\u003cp\u003eIf this was just Leylin alone without any power, he would be robbed and then thrown to the bottom of the sea.\u003c/p\u003e\n\u003cp\u003eJust the luxurious material of his clothing could be the cause of his death.\u003c/p\u003e\n\u003cp\u003eThe moment he showed his mysterious strength, the treatment he got immediately changed.\u003c/p\u003e\n\u003cp\u003eWithout making certain Leylin’s strength and his background, the Eden trading company would not dare lay a hand on him.\u003c/p\u003e\n\u003cp\u003e“Many thanks!” Leylin expressed his gratitude aloofly, refusing the drawbridge that they let down for him and instead flying onto the deck.\u003c/p\u003e\n\u003cp\u003eStanding on deck, Leylin was slightly surprised by these crew members’ strange appearances.\u003c/p\u003e\n\u003cp\u003eThe few sailors beside him all looked very strange. There were some similar to the merfolk that Leylin had seen, but their tails had turned into two legs. They wore what labourers did and clearly did not have a high status here.\u003c/p\u003e\n\u003cp\u003eBesides the merfolk sailors, Leylin saw another type of creature.\u003c/p\u003e\n\u003cp\u003eThis was a person escorted by the merfolk that evidently had a higher status. However, their appearance was totally different from a regular human being and they only had a large pupil. The pupil alone had a diameter of 1 decimeter, and around its socket, large amounts of tendrils hung down, forming something like limbs.\u003c/p\u003e\n\u003cp\u003eAppearance-wise, it was very similar to the Beholder Leylin saw in games in his previous world.\u003c/p\u003e\n\u003cp\u003e“Alright! Though I’d long since guessed that this world wouldn’t be made up of humans, this appearance is really quite rare…”\u003c/p\u003e\n\u003cp\u003eLeylin ridiculed it in his mind. Perhaps due to adapting to the environment or some other reason, there were multiple different tribes but they all had bodies similar to humans. A head, four limbs, a torso became the most common structure of all beings, and there were at least one or two races similar to humans.\u003c/p\u003e\n\u003cp\u003eLike the merfolk he’d seen, while they maintained having a tail on their lower bodies when in water, that instantly turned into humans’ legs once they got on shore.\u003c/p\u003e\n\u003cp\u003eCreatures that were completely different from humans like the Beholder did exist, but were never that common.\u003c/p\u003e\n\u003cp\u003eLeylin had already named this being the ‘Beholder tribe’. In Purgatory World, it was unexpectedly this sort of race that was in charge and enslaving those similar to the human race.\u003c/p\u003e\n\u003cp\u003e“Revered Exemplary, please accept the sublime respect of I, Geiger Guguno Axde.”\u003c/p\u003e\n\u003cp\u003eOne of the Beholder’s tendrils went upwards, and Leylin suddenly received spiritual undulations. The greetings within seemed to be rather flattering.\u003c/p\u003e\n\u003cp\u003e“Greetings!” Leylin obviously had a more profound understanding of the usage of spiritual force, which was why his usage of it was effortless.\u003c/p\u003e\n\u003cp\u003eHowever, what he found strange was that this Beholder tribe used spiritual force, which was similar to brainwaves, to communicate.\u003c/p\u003e\n\u003cp\u003e“Perhaps this form is because they’re highly intelligent creatures!” Leylin nodded inside.\u003c/p\u003e\n\u003cp\u003e“You must be someone of the Ceraph Continent, yes? It is only at that area that there are humans!”\u003c/p\u003e\n\u003cp\u003eThe gigantic Beholder pupil stared hard at Leylin, and he could even see an inverted image of himself in the eye. After a short moment the Beholder sent spiritual force that held information.\u003c/p\u003e\n\u003cp\u003e“My apologies, but I must keep my origins a secret. I promised my Mentor that before I gained any fame, I would not reveal my history!” Leylin answered righteously, but that only made the other party more grim and respectful.\u003c/p\u003e\n\u003cp\u003e“Your mentor must be an amazing Exemplary!” To become famous far and wide was extremely difficult even if on just one continent. To be able to do that meant he must be an extraordinarily powerful Exemplary.\u003c/p\u003e\n\u003cp\u003e“Mm! He is indeed an elder worthy of respect, full of wisdom and resolution…”\u003c/p\u003e\n\u003cp\u003eA hint of nostalgia rose in Leylin’s eyes, and he then asked Beholder, “I met with some troubles at sea and had to float on the surface for a long time. May I know where this is?”\u003c/p\u003e\n\u003cp\u003e“Oh, this is the end of the shipping route of the Hail Continent, which makes it very close to the Hail Continent. You came so close but still got into troubles, and I can only say that you and your boat have very bad luck…”\u003c/p\u003e\n\u003cp\u003eThe Beholder seemed to say without malicious intent. Noticing the slip of its tongue, many tendrils waved around, flustered, “Oh, my apologies! I didn’t say that on purpose. It’s just that there are far too many storms and ferocious beasts in the ocean, and because there’s no law or regulations, even the Golden Deity Fleet can’t say they’re safe until they reach the port and stand on land.”\u003c/p\u003e\n\u003cp\u003e“I understand,” Leylin waved his arms, but a hint of of sadness and lingering fear showed on his expression. “I’m quite tired. Would it be possible for me to have a room and get some rest? Also, please send me to the nearest port. I’m willing to pay for it with something of equal value…”\u003c/p\u003e\n\u003cp\u003eWhile speaking, Leylin astutely realised there was someone spying on him from the shadows. This should be the Exemplary that he had discovered previously.\u003c/p\u003e\n\u003cp\u003eTheir strength was not half bad and seemed to be at peak rank 3. They also had a few powerful magic artifacts and unique magic items.\u003c/p\u003e\n\u003cp\u003e“Seems like this is the protector or owner of this fleet who’s at rank 3?”\u003c/p\u003e\n\u003cp\u003eWith the A.I. Chip’s adjustments, his aura was also at around rank 3. With his Mask of the Dreamless, he was rather charming.\u003c/p\u003e\n\u003cp\u003e“This…” Beholder seemed to hesitate, but immediately after, a streak of concealed spiritual force undulations was transmitted that caused it to change its words.\u003c/p\u003e\n\u003cp\u003e“No problem! We were planning to make a stop at the nearby Elias Port, and you can get off there. On our ship you are our most esteemed guest, so please don’t mention anything about paying…”\u003c/p\u003e\n\u003cp\u003eBeholder’s eye squinted which seemed to be a way of expressing its respect…?\u003c/p\u003e\n\u003cp\u003e“Alright!” Leylin nodded, and under the guidance of a merperson that the Beholder called out, entered the hold of the ship.\u003c/p\u003e\n\u003cp\u003e“My lord, here is your room. If there’s anything you need, please tell us!”\u003c/p\u003e\n\u003cp\u003eThe merperson humbly lowered his head, and once Leylin got familiar with his room, retreated.\u003c/p\u003e\n\u003cp\u003e“It’s not bad!” Leylin looked around his surroundings. This was the higher levels of the ship, and besides important personnel, perhaps even the leader of the merfolk did not have the authority to stay here.\u003c/p\u003e\n\u003cp\u003eLight blue shells and red coral decorations adorned the room, making it look beautiful.\u003c/p\u003e\n\u003cp\u003eInside, there was something like a bed that was covered with the fur of some unknown being. Just by looking at it, it was obvious that it was soft and smooth.\u003c/p\u003e\n\u003cp\u003eWhat attracted Leylin’s attention more, however, was the large blue pearl at the heart of the room.\u003c/p\u003e\n\u003cp\u003eIn the A.I. Chip’s scan, the pearl seemed to be breathing, sucking in the turbid air in the room and, after going through some unknown transformation, released pure oxygen and was even able to clean the air. This eliminated the fishy smell of the ocean.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, scan!” Leylin commanded.\u003c/p\u003e\n\u003cp\u003e[Beep! Mission established. Beginning scan.] The A.I. Chip intoned loyally, and immediately after, probing undulations scanned through and did not miss any corners.\u003c/p\u003e\n\u003cp\u003e[Scan completed! Yet to find any suspicious items or spying spell formations.] The A.I. Chip intoned.\u003c/p\u003e\n\u003cp\u003e“Alright, looks like they aren’t playing any tricks. I just need another layer of protections so I can be at ease though.” With a tap of his finger, a blue rune appeared and rapidly disappeared into the wall.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, a resplendent blue layer of light appeared within the hold of the ship and quickly disappeared.\u003c/p\u003e\n\u003cp\u003e[Defence and warning spell patterns completed. Activation of comprehensive control. Simultaneous detections ongoing.]\u003c/p\u003e\n\u003cp\u003eOnce the A.I. Chip sent information over, Leylin could finally completely relax.\u003c/p\u003e\n\u003cp\u003e“Hah…” He lay on the soft bed and huffed out a sigh, “At least I managed to regain a portion of my mobility before they found me, or things would have gotten complicated!”\u003c/p\u003e\n\u003cp\u003e“However, after recovering up to this point, the rest of the injuries aren’t that bad. I can even use external items…”\u003c/p\u003e\n\u003cp\u003eAt this thought, Leylin’s palm touched at his waist. Silver spatial rays flashed and a dark red healing potion appeared in his palm.\u003c/p\u003e\n\u003cp\u003eWIth Leylin’s attainments as a grandmaster at Potioneering, as well as the vast amount of resources provided by the Bloodline Union and Doze Imperial City of the Blazing Flame Monarch, he’d long since made a huge quantity of potions at the grandmaster level that he constantly kept at his side to deal with any unexpected situations.\u003c/p\u003e\n\u003cp\u003eThe expedition into Purgatory World was of utmost importance, and he obviously brought everything along.\u003c/p\u003e\n\u003cp\u003e“With my vitality and rank as a Warlock, high-ranked potions probably won’t do much for me unless they’re primordial potions…”\u003c/p\u003e\n\u003cp\u003eThe dark red potion didn’t taste all that good and even had a spicy taste that seemed to sting his nose. However, without even a flinch, Leylin drank it.\u003c/p\u003e\n\u003cp\u003eThe potion worked quickly. A flush first appeared on Leylin’s face, before the sound of cracking was heard everywhere in his body, as if his bones were breaking. At the same time, it was flourishing with life like a plant.\u003c/p\u003e\n\u003cp\u003eAfter treatment using potions was used a few times, Leylin no longer had the feebleness of before.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-698\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-700\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-699","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
