{"id":58563,"no":7,"title":"Chapter 7","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eExtortion\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLeylin had been avoiding meaningless fights.\u003c/p\u003e\n\u003cp\u003eIn his opinion, the fun of winning against others couldn\u0027t be compared to the fun of enhancing his strength through cultivation.\u003c/p\u003e\n\u003cp\u003eMoreover, there\u0027s no hatred between him and Ourin. He probably even needed to thank him for heavily injuring the original Leylin, which had given him a chance for rebirth.\u003c/p\u003e\n\u003cp\u003eLeylin was a practical person. To him, face was never more important than reasoning.\u003c/p\u003e\n\u003cp\u003eEven using the honor of his family to swear wasn\u0027t the slightest loss for him. However, Ourin\u0027s request after that had touched the bottom line.\u003c/p\u003e\n\u003cp\u003e\"You......you can\u0027t do that! Those black robed lords won\u0027t let you off!\"\u003c/p\u003e\n\u003cp\u003eLeylin tightly grabbed onto the sack on his hands with a frantic expression.\u003c/p\u003e\n\u003cp\u003e\"Haha......why would those black robes barge into our matters? Don\u0027t forget, you were beaten half dead by me previously, and no one had paid it any mind.\"\u003c/p\u003e\n\u003cp\u003eOurin clenched his fist, and clear cracking sounds could be heard from his bones, \"If you don\u0027t want me to break your bones one by one, obediently hand the magic crystals over!\"\u003c/p\u003e\n\u003cp\u003eAs Ourin\u0026nbsp;drew closer, his large frame engulfed Leylin within his shadow.\u003c/p\u003e\n\u003cp\u003eLeylin observed his surroundings; this location was already quite far from the camp. Around him were only some lackeys that had been brought by Ourin. They were all looking at them as if they were viewing a show.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t bother looking, no one will come to save you......\"\u003c/p\u003e\n\u003cp\u003eOurin grinned.\u003c/p\u003e\n\u003cp\u003e\"Really? That\u0027s best then!\" Leylin suddenly laughed.\u003c/p\u003e\n\u003cp\u003eHis silhouette flashed. When Leylin reappeared, he was already behind Ourin, \"Perfect, I can take revenge for that day\u0027s incident!\"\u003c/p\u003e\n\u003cp\u003eA fierce kick was thrown out! Carrying intense wind, it kicked into Ourin\u0027s waist area.\u003c/p\u003e\n\u003cp\u003eOurin felt an intense force coming from Leylin\u0027s leg, sending his body into the air!\u003c/p\u003e\n\u003cp\u003eBang! Ourin fell to the ground, severe pain coming from his waist which made his eyes turn slightly red, \"You dared! You dared! You actually dared to hurt me!\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re dead! I will hang you!\"\u003c/p\u003e\n\u003cp\u003eOurin ferociously stood up, rays of blood-thirsty and savage light shooting out of his eyes.\u003c/p\u003e\n\u003cp\u003e\"This is the advantage of having a good constitution?\" Seeing that the kick that he used fifty percent of his strength for did nothing much to Ourin, Leylin\u0027s pupils shrank.\u003c/p\u003e\n\u003cp\u003e\"Ha!\" Ourin waved his fist around like a violent black bear.\u003c/p\u003e\n\u003cp\u003eLeylin flashed sideways, dodging Ourin\u0027s fist. When Ourin\u0027s fist landed on the small tree behind, it actually left a deep dent. A strength of 1.7 is indeed not a trivial matter.\u003c/p\u003e\n\u003cp\u003e\"Such a heavy punch. Even with my constitution, I can\u0027t withstand more than a few punches......\" Leylin swiftly thought.\u003c/p\u003e\n\u003cp\u003e\"A.I Chip! Simulate the best method to defeat him!\"\u003c/p\u003e\n\u003cp\u003e[Beep! Task established! Starting assist mode!] A voice came from the A.I Chip. Its powerful calculation ability instantly came up with the best solution.\u003c/p\u003e\n\u003cp\u003e[Duck! Task established! Initiating assist mode.] The A.I Chip prompted. Leylin immediately crouched down, dodging the roaring Ourin\u0027s tackle.\u003c/p\u003e\n\u003cp\u003e[A flaw appeared in enemy\u0027s defense! Most effective attacking location: Armpit!] The A.I Chip\u0027s voice sounded.\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s figure continuously flashed, dodging Ourin\u0027s attacks while also getting closer. \"Do you know? Although your strength is powerful, you\u0027re not agile enough. This is the disadvantage of your body shape......\"\u003c/p\u003e\n\u003cp\u003eAs Leylin could still speak when he\u0027s attacking, it showed that he was still holding back.\u003c/p\u003e\n\u003cp\u003e\"This......is this still the Leylin from before? He......why has he become so much more powerful?\" The surrounding youths all opened their mouths in shock.\u003c/p\u003e\n\u003cp\u003eUnder the everyone\u0027s expressions of disbelief, Leylin threw out a punch! It hit Ourin\u0027s armpit with his entire strength. Ourin, who had suffered the attack, fell onto the ground with a pained expression, and couldn\u0027t get up for a long time.\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s full strength was at least 1.5 and wasn\u0027t very different from Ourin\u0027s. Furthermore, the place that he had hit was also the weak spot. Ourin fell onto the ground, his eyes bloodshot as he growled, \"You\u0027re dead for sure! My family will not let you off!\"\u003c/p\u003e\n\u003cp\u003e\"Oh! Really?\" Leylin remained indifferent towards Ourin\u0027s threat, and even gave Ourin a kick in his lower abdomen. Ourin curled himself up, like a cooked prawn.\u003c/p\u003e\n\u003cp\u003eLeylin squatted down, looked at Ourin with a face full of smiles, \"Since you won\u0027t let me off anyways, do you think that it would be better if I just made the first move and killed you?\"\u003c/p\u003e\n\u003cp\u003eAt that moment, Leylin\u0027s smile at Ourin looked like the devil\u0027s.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not joking, he really dares to take action!\" Ourin saw the killing intent in Leylin\u0027s eyes. Suddenly, he felt as though he was being stared at by a tiger. The anger within his head completely vanished and was replaced with fear.\u003c/p\u003e\n\u003cp\u003e\"Mister Leylin! Lord Leylin! You can\u0027t do that! I......I have the Dorlan family behind me. If you kill me, you\u0027ll get yourself in trouble!\"\u003c/p\u003e\n\u003cp\u003e\"Then do you admit your wrongs!\" Leylin issued a ridiculing question.\u003c/p\u003e\n\u003cp\u003e\"I admit my wrongs! I apologize...... sorry!\" Under the threat of death, Ourin succumbed quickly.\u003c/p\u003e\n\u003cp\u003e\"Very good, I accept your apology. In addition, according to the law of nobility, I have the rights to request for compensation!\"\u003c/p\u003e\n\u003cp\u003eLeylin said smilingly which gave Ourin a bad feeling.\u003c/p\u003e\n\u003cp\u003e\"As compensation, hand all the magic crystals you have with you!\" Leylin smilingly said those words of extortion.\u003c/p\u003e\n\u003cp\u003e\"Oh! No! You can\u0027t do this! Do you know how many people have been sacrificed for my family to obtain these magic crystals?\"\u003c/p\u003e\n\u003cp\u003eOurin struggled to protest.\u003c/p\u003e\n\u003cp\u003e\"Sometimes, it\u0027s just a simple multiple choice question in the world. Now, it\u0027s your turn. My dear Ourin, life or magic crystals, choose one!\"\u003c/p\u003e\n\u003cp\u003eLeylin didn\u0027t seem to have any reaction to Ourin\u0027s begging. Instead, he stepped on Ourin\u0027s face, gradually increasing the amount of force he exerted.\u003c/p\u003e\n\u003cp\u003eThe boots stepping on Ourin\u0027s face sent his head further and further into the ground, giving a suffocating feeling.\u003c/p\u003e\n\u003cp\u003eAfter a few minutes, Leylin released some of the pressure, \"So? Have you thought through it properly?\"\u003c/p\u003e\n\u003cp\u003e\"Puah!\" Ourin inhaled the fresh air in big mouthfuls. His face was now covered with mud and footprints, making him look hilarious.\u003c/p\u003e\n\u003cp\u003eHowever, none of the surrounding youths dared to smile.\u003c/p\u003e\n\u003cp\u003eOne of the youths slowly began to retreat, wanting to leave this place.\u003c/p\u003e\n\u003cp\u003eLeylin picked up a pebble, [Wind estimation completed! Shooting orbit adjusted!]\u003c/p\u003e\n\u003cp\u003eWhoosh! The pebble hit the escaping youth\u0027s leg, sending him sprawling on the ground.\u003c/p\u003e\n\u003cp\u003e\"Ourin, see that? Don\u0027t bother waiting for reinforcements......Furthermore, don\u0027t try to challenge my patience!\"\u003c/p\u003e\n\u003cp\u003eLeylin looked at the surrounding youths. Those who had Leylin\u0027s gaze sweep past them all lowered their heads, their bodies trembling.\u003c/p\u003e\n\u003cp\u003e\"Okay! I can give you the magic crystals! But I left them in the carriage! Follow me back to get them!\" Ourin said in surrender.\u003c/p\u003e\n\u003cp\u003e\"magic crystals are so important. You don\u0027t bring them with you, but leave them at the carriage,? Are you treating me like a fool?\"\u003c/p\u003e\n\u003cp\u003eSuch childish lies naturally couldn\u0027t get pass Leylin.\u003c/p\u003e\n\u003cp\u003e\"It seems like you haven\u0027t had enough!\" A ray of fierceness flashed across Leylin\u0027s eyes. He grabbed onto Ourin\u0027s arm and suddenly gave it a snap!\u003c/p\u003e\n\u003cp\u003eCrack!! Ear piercing sounds of fracture could be heard, followed by Ourin\u0027s miserable scream.\u003c/p\u003e\n\u003cp\u003e\"If you still refuse to speak the truth, I\u0027ll break your other arm!\"\u003c/p\u003e\n\u003cp\u003e\"No! No! No! You can\u0027t do this, the black-robed lord won\u0027t let you off!\" Ourin clutched onto his arm, rolling on the ground.\u003c/p\u003e\n\u003cp\u003e\"Haha......why would those black robes barge into our matters? Did you forget that I was beaten half dead by you previously, and no one paid any mind to it?\"\u003c/p\u003e\n\u003cp\u003eLeylin coldly smiled, sending Ourin\u0027s words back to him.\u003c/p\u003e\n\u003cp\u003e\"Seems like you\u0027re really yearning for death!\" Leylin was just about to go up and take action.\u003c/p\u003e\n\u003cp\u003e\"Wait! Wait! Fine! I\u0027ll give you the magic crystals, but you have to swear that you will not take revenge on me anymore!\" Ourin shouted with a pale face as he saw Leylin approaching him.\u003c/p\u003e\n\u003cp\u003e\"Okay! I swear with the honor of my Farlier family!\" Leylin answered.\u003c/p\u003e\n\u003cp\u003eOurin\u0027s face turned green. Struggling to a half seated position on the ground, he took out a golden coloured pouch from his bosom and tossed it at Leylin, \"All my magic crystals are here!\"\u003c/p\u003e\n\u003cp\u003eLeylin took it and gave it a look. This was a palm-sized pouch made with gold and silver threads. In the center of it was a picture of an eagle and a shield, surrounded by many plants. It appeared to be a family symbol.\u003c/p\u003e\n\u003cp\u003eLeylin opened the pouch and saw over dozens of black coloured crystals quietly lying there.\u003c/p\u003e\n\u003cp\u003e[Beep! Discovered an unknown energy source!] The A.I Chip alerted.\u003c/p\u003e\n\u003cp\u003e\"So? Can it be used?\" Leylin had an excited expression on his face.\u003c/p\u003e\n\u003cp\u003e[Searching the database......information insufficient! The method of usage not found!\"\u003c/p\u003e\n\u003cp\u003e[Alert! An energy source with unknown radiation. Recommendation: The Host\u0027s body to strengthen defense!]\u003c/p\u003e\n\u003cp\u003e\"So it\u0027s like this?\" Leylin inwardly thought, then turned to Ourin and asked, \"Which academy are you going to?\"\u003c/p\u003e\n\u003cp\u003e\"Wet......Wetland Gardens!\" Ourin had an ugly expression on his face.\u003c/p\u003e\n\u003cp\u003e\"Wetland Gardens! I\u0027ve heard before that the entry fee is ten magic crystals, right?\"\u003c/p\u003e\n\u003cp\u003e\"Correct! Where did you hear it from?\" Ourin was a little surprised.\u003c/p\u003e\n\u003cp\u003eLeylin faintly smiled, looking a little mysterious. He had never heard of any Wetland Gardens before and was only bluffing Ourin since most of the school fees were basically all in rounded figures. It wasn\u0027t a big deal if he guessed it wrongly anyway.\u003c/p\u003e\n\u003cp\u003e\"Okay! I\u0027ll return it to you!\" Leylin took out three magic crystals from the pouch and tossed the pouch with the magic crystals back at Ourin.\u003c/p\u003e\n\u003cp\u003e\"These three magic crystals will be my compensation!\" Although he could take all the magic crystal now, Leylin is still unsure of the attitudes of the black and white robes on this matter. He also doesn\u0027t want to use himself to test out their bottom lines. Thus, he left Ourin the sufficient amount of magic crystals for the entry fee. That way, even if they quibbled about it, Leylin had an excuse.\u003c/p\u003e\n\u003cp\u003e\"Tha......thank you!\" Ourin\u0027s facial expression turned a lot better. If he were to lose all of these magic crystals and wasn\u0027t unable to enter the academy, he really didn\u0027t know how he\u0027d face his family.\u003c/p\u003e\n\u003cp\u003e\"Rest assured! I won\u0027t take your magic crystals!\" Leylin raised his head and looked at the surrounding nobles, who all had their hands tightly clenched into fists. Seeing this, Leylin couldn\u0027t help shaking his head.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Lord Leylin!\" Hearing Leylin\u0027s assurance, the other youths all felt relieved and immediately bowed.\u003c/p\u003e\n\u003cp\u003e\"But! I want to request other compensation!\" Leylin looked at a youth, the one that tried to escape but had been knocked down.\u003c/p\u003e\n\u003cp\u003e\"The Cross Blade at your waist looks pretty nice!\" Leylin looked at the youth, who looked a little frightened. Leylin then pointed to the Cross Blade at the youth\u0027s waist.\u003c/p\u003e\n\u003cp\u003eHaving heard the hint, the youth hastily replied, \"Lord, you can have it!\"\u003c/p\u003e\n\u003cp\u003e\"Haha! I won\u0027t hold back then!\" Leylin took the Cross Blade from the youth. After gauging its weight, he nodded his head in satisfaction.\u003c/p\u003e\n\u003cp\u003eAs a noble\u0027s sword, the quality of this crossed sword was excellent.\u003c/p\u003e\n\u003cp\u003eThe hilt of the sword was decorated with beautiful flower patterns to prevent it from slipping from the hand. The scabbard was made from the skin of sharks, giving it a luxurious feeling.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-8\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-7","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
