{"id":59261,"no":705,"title":"Chapter 705","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Offerings and Beast Spirits\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003ePort Elias not only had the title of the Pearl of the Hail Continent, but also housed so many different races that even Leylin was left overwhelmed. That was not all; both sides of the busy road were filled with multiple shops, selling anything from the lowest quality armour and protective gear to the highest grade equipment such as high-grade sealing scrolls and other things. Everything one might need was present in these shops.\u003c/p\u003e\n\u003cp\u003eBased on Leylin’s understanding, the beings in Purgatory World were of varying races, each relying on their physical bodies and bloodline specific innate abilities to battle. There was no need for them to train themselves; their bloodlines would increase their strength with the simple passage of time until they reached their peak.\u003c/p\u003e\n\u003cp\u003eOf all the systems, only two were used throughout the whole world: sacrificial offerings and beast spirits.\u003c/p\u003e\n\u003cp\u003eThese offerings meant sacrificing something, or someone, to a certain dignitary. After obtaining their blessing, an inhabitant would have their power increased in some form, be it a pure boost to their strengths or mysterious new abilities.\u003c/p\u003e\n\u003cp\u003eThe path of offerings was more like an exchange in Leylin’s eyes. The natives would offer up items that were of value to their chosen dignitary, and in turn, they would these dignitaries help the natives increase their strength. Such methods were very similar to the gods in the World of Gods, while still being somewhat different.\u003c/p\u003e\n\u003cp\u003eSince he hadn’t delved deeply into the subject, he couldn’t be certain what exactly the difference was. Perhaps it had to do with the devotion that these beings held for their chosen dignitaries, but they did not request the beings to bring offerings every day or at fixed intervals. There were even some that could rely on their support even though they hadn’t offered anything at the time; although there was the need to have offered something of extraordinary value to the dignitary prior to that. This was a distinct difference from the gods of the World of Gods.\u003c/p\u003e\n\u003cp\u003e‘It looks like even power systems from the World of Gods were assimilated during ancient times, and those past rank 6 in the Purgatory World have made some changes to them…’ Leylin touched his chin.\u003c/p\u003e\n\u003cp\u003eIn this enormous universe, the Magus World and the World of Gods were like two extremes. They were the greatest in size and held the most powerful beings.\u003c/p\u003e\n\u003cp\u003eThese two worlds had real information about existences up to rank 8 in power. The primordial entities deduced that only when one of the two managed to seize the other’s resources and gain their laws, power systems, and their knowledge that they could advance to eternality, to rank 9.\u003c/p\u003e\n\u003cp\u003eThis was what sparked the Ancient Magus War. Having already advanced to the peak of rank 8, there was nothing else that would attract the attention of the Magi in the myriad other worlds. Only the guidance and understanding necessary to reach rank 9 would ignite their desire to fight for it, no matter how slim the chance!\u003c/p\u003e\n\u003cp\u003eOf course, as these two worlds were about equal in power, the result was that both sides were severely crippled. The collective strength of the Magus World deteriorated greatly, and the World of Gods had gone so far as to completely seal itself.\u003c/p\u003e\n\u003cp\u003eIt wasn’t just these two worlds that were involved in the war, countless smaller and weaker worlds suffered from collateral damage as well. Their unique strength and advancement systems had been leaked, and through real battle experience the systems were refined to become more accessible.\u003c/p\u003e\n\u003cp\u003eThe path of offerings was something Leylin believed was an evolution of the system of faith that the gods used. They removed the restrictions between gods and their followers, and turned it into a system of equivalent exchange. It was only after these changes that it fit the Purgatory World’s circumstances.\u003c/p\u003e\n\u003cp\u003eAfter all, not every world’s laws were suitable for the spread of religion.\u003c/p\u003e\n\u003cp\u003eAs for the second common method, the path of beast spirits, Leylin had previously listened to some explanations about it from Geiger Dole.\u003c/p\u003e\n\u003cp\u003eAs the Purgatory World was a home to various races, with numerous ferocious beasts and high-energy entities occupying it, some intellectual beings invented the concept of hunting these ferocious beasts and extracting their souls. After doing so, these would be sealed into the user’s body, summoned during battles using certain techniques.\u003c/p\u003e\n\u003cp\u003eSince sealed beasts differed in strength, it created different ranks for these beast spirit masters. On top of that, when one’s beast spirit magic reached a higher rank, the corresponding beast spirit masters would be able to seal even more spirits.\u003c/p\u003e\n\u003cp\u003eAncient legends even spoke of a beast spirit master who had reached an unprecedented realm. He had sealed innumerable beast spirits at the level of Morning Star all over his body, and had enough power to destroy a whole continent!\u003c/p\u003e\n\u003cp\u003eThe energy from the sealed spirits could even aid in the cultivation of a beast spirit master, allowing them to reach a higher rank faster.\u003c/p\u003e\n\u003cp\u003e“Offerings and beast spirits are the main power systems in Purgatory World,” Leylin mumbled to himself, his eyes scanning for shops with related material.\u003c/p\u003e\n\u003cp\u003eThese two strength systems could be considered the main paths to power of the sentient races in the Purgatory World. Looking at how vast the world was, it wouldn’t be strange to find that smaller branch races had their own systems. Leylin wouldn’t even be surprised if there were magic inheritances here.\u003c/p\u003e\n\u003cp\u003eWith a long period of data collection, and adding on the current lightspeed thought process of Leylin’s own brain, he’d learnt much of the common languages in the Purgatory World with the help of the A.I. Chip. At the very least, daily conversations were already no issue.\u003c/p\u003e\n\u003cp\u003e‘Here it is,’ he though soon after setting his sights on a shop that looked like a huge open clam. He then walked in.\u003c/p\u003e\n\u003cp\u003eHe could sense a powerful aura pervading the shop, and given its location and the attitudes the pedestrians had towards it he reasoned that this shop would have something worthy of his attention.\u003c/p\u003e\n\u003cp\u003e‘Welcome to my shop, revered Alabaster Devilsnake, descendant of the Dignitary Snake Dowager!’ A voice sounded in Leylin’s head the moment he entered the shop. It surprised him; although he was still using the Alabaster Devilsnake’s bloodline to conceal himself, it was very rare for someone to have the ability to even notice that layer of concealment.\u003c/p\u003e\n\u003cp\u003eThe shop owner clearly took him for a member of the Alabaster Devilsnake family, and sounded rather humble. After all, Alabaster Devilsnakes grew to rank 5 upon maturity. In addition to their being descendants of a dignitary, they had a very high status.\u003c/p\u003e\n\u003cp\u003e“Where are you?” Leylin surveyed the interior of the clam, which was just a white space with multi-coloured lights floating in the air.\u003c/p\u003e\n\u003cp\u003eInformation appeared in Leylin’s mind. This was not spiritual force, but an even more mysterious kind of communication.\u003c/p\u003e\n\u003cp\u003e[Beep! Detected soul force undulations coming through. Deny or accept?] At this moment, the A.I. Chip’s prompt was transmitted.\u003c/p\u003e\n\u003cp\u003eNow, Leylin had found a lifeform that could use soul force directly.\u003c/p\u003e\n\u003cp\u003e“State your name!” Leylin’s lips did not move, but mysterious soul force was sent out. There was even a chaotic luster in Leylin’s eyes, which let him immediately discover the energy core located in the middle of the white space.\u003c/p\u003e\n\u003cp\u003eA green bundle of light was hidden within the layers of the void, with countless green soul force threads that linked it to the room.\u003c/p\u003e\n\u003cp\u003e“The customer was able to find my core?” At this moment, the information transmitted from the core held a trace of alarm. “Also, this energy is soul force?!” It was clearly shocked by Leylin’s ability to use soul force and was extremely afraid.\u003c/p\u003e\n\u003cp\u003e“This is the first time I’ve seen someone do something as stupid as allowing others into their own body,” Leylin placed his hands behind his back and began to browse the shop’s items, occasionally using soul force to communicate with it.\u003c/p\u003e\n\u003cp\u003e“Don’t you know that once someone who can use soul force discovers your soul core, they could destroy you in an instant?”\u003c/p\u003e\n\u003cp\u003eOnce the words left his mouth, Leylin felt the whole place shudder, especially the core. It was then that a trembling soul appeared.\u003c/p\u003e\n\u003cp\u003e“Lord Alabaster Devilsnake, please forgive me!” A little white person came out of the core and grovelled at Leylin’s feet.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, I’m just an ordinary customer,” Leylin couldn\u0027t help but console this being after seeing it on the verge of fainting.\u003c/p\u003e\n\u003cp\u003e‘Ordinary customer? Can ordinary customers use soul force? Do they posses such a terrifying aura of power?’ The little person’s thoughts were bitter, but it could only follow behind Leylin carefully.\u003c/p\u003e\n\u003cp\u003e“Though your methods can scare other races who don’t know about the soul force system, this is still far too risky!” Leylin lectured it as he grabbed a blue bundle of light.\u003c/p\u003e\n\u003cp\u003eA roaring snarl was transmitted from the bundle of light. Through the blue screen, Leylin could faintly see a small and exquisite sea fish. Its mouth was like a sharp pike which shone with a little luster.\u003c/p\u003e\n\u003cp\u003e“This is the Golden Pike Trout. This beast spirit is very suitable for beginners seeking to become beast spirit masters!” Seeing Leylin seemingly interested in the beast spirit, the little person immediately went beside him and began to introduce the fish with a fawning expression on his face, “If my Lord likes it, I can…”\u003c/p\u003e\n\u003cp\u003eSuddenly, the thought that drawing in a person that could take control of his life and death had the little person apprehensive and in fear. Perhaps even if Leylin wanted to take everything in its shop for free, it would be forced to agree.\u003c/p\u003e\n\u003cp\u003e“No thank you! This sort of thing is useless to me.” Leylin waved his arms.\u003c/p\u003e\n\u003cp\u003e“Do you have anything with a general introduction to the pah of offerings and beast spirit spells? The more detailed the better!”\u003c/p\u003e\n\u003cp\u003e“Yes, yes I do!” The little person smiled and waved his arms. Two tremendous red bundles of light flew over. The rays dissipated and revealed a cow horn bugle and a pink shell.\u003c/p\u003e\n\u003cp\u003eLeylin picked up the bugle horn and immediately received a prompt from the A.I. Chip.\u003c/p\u003e\n\u003cp\u003e[Discovered spiritual force data interface. Accept or deny?]\u003c/p\u003e\n\u003cp\u003eEvidently, the two items were like crystal spheres in the Magus World, acting as a medium to store information.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-704\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-706\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-705","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
