{"id":59269,"no":713,"title":"Chapter 713","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eThreat and Action\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e[Beep! High-energy magnetic field discovered. Determined to be from a Rank 5 being. Host is advised to be careful.] The A.I. Chip’s immediate prompt surprised Leylin.\u003c/p\u003e\n\u003cp\u003e‘Looks like I can’t leave even if I want to at this point,’ a mysterious smile rose at the edges of Leylin’s lips. Still, he pretended to be oblivious to everything, planning to leave after bidding Belinda farewell.\u003c/p\u003e\n\u003cp\u003eJust as Leylin was about to move, tremendous soul force undulations full of Just as Leylin was about to move, a streak of tremendous soul force undulations full of astounding strength and intent was transmitted over, “Wait, he can’t leave!”\u003c/p\u003e\n\u003cp\u003eA figure gradually appeared from the surface of the water. A layer of transparent distortions gradually dissipated, revealing a large Beholder.\u003c/p\u003e\n\u003cp\u003eThis one, however, was different from Geiger. It had three different giant eyes of varying sizes. The three eyes were in triangular formation, with the central one connected to a few fleshy-red channels. Pure white tendrils drooped to the ground, forming the Beholder’s legs. A great and powerful aura emanated from its body.\u003c/p\u003e\n\u003cp\u003e‘This one should be an Elder Eye of the Beholders,’ Leylin judged inwardly.\u003c/p\u003e\n\u003cp\u003eAn adult Beholder had the strength of an ordinary rank 3 Magus. Elder Eyes usually had strength at Morning Star.\u003c/p\u003e\n\u003cp\u003eThis Beholder was even more uncommon. Besides the power from its own race, it was a powerful Sacrificer! The power of judgement emanated from its body, causing Leylin’s eyes to narrow.\u003c/p\u003e\n\u003cp\u003e“This Beholder should be the leader that Belinda mentioned. Doesn’t that mean it is a rank 5 Sacrificer?”\u003c/p\u003e\n\u003cp\u003eAs a Rank 5 Sacrificer, this Beholder had strength comparable to a regular Radiant Moon Magus. What was most terrifying, however, was that its body had been fully branded by the Trial’s Eye and even the A.I. Chip was unable to scan and determine its stats.\u003c/p\u003e\n\u003cp\u003e“Greetings, Lord Bayclark!” Belinda knelt reverently while pulling at Leylin’s clothes to do the same.\u003c/p\u003e\n\u003cp\u003e“Greetings to Sire Bayclark!” Leylin merely bowed slightly. This made him seem arrogant, and a hint of disapproval was evident in the Beholder elder’s large eye.\u003c/p\u003e\n\u003cp\u003eIt glanced towards Belinda, transmitting tremendous soul undulations. Fury was evident within its eyes and it criticised her, “Belinda! Your actions today have tarnished the glory of our master. And it’s not just your failure at Port Elias’ stronghold... All your decisions so far have been rash!”\u003c/p\u003e\n\u003cp\u003e“Lord Bayclark!” While still kneeling, Belinda straightened her back, “Your subordinate is responsible for the failure at Port Elias, but allowing Nick to leave was a very ordinary matter. He might not be a subordinate of our Master of Order, but he is a descendant of the Matriarch.”\u003c/p\u003e\n\u003cp\u003e“And a fellow clansman of yours,” the Beholder added coldly, “I have long warned you to not be too kind towards those of your kind with mixed blood. They can only bring trouble!”\u003c/p\u003e\n\u003cp\u003e“Lord Bayclark, I can vouch for Nick. He’s on our side, he helped me at the port.” Seeing Bayclark’s eyes flash with red, Belinda gritted her teeth and spoke on Leylin’s behalf.\u003c/p\u003e\n\u003cp\u003e“Alright, I’ll let him go. I hope your luck continues, or else there’ll be another pair of vertical pupils in my collection!” Bayclark twisted his body and turned towards Leylin, “Or should I say, two pairs.”\u003c/p\u003e\n\u003cp\u003eBelinda was badly frightened by this rank 5’s threats, ridicule and lack of trust.\u003c/p\u003e\n\u003cp\u003eLeylin obviously wasn’t the same. Outwardly he seemed indignant at this, his face and ears turning red. However, he was making a calm analysis on the inside, ‘It arrived far too quick. That means it was already nearby, perhaps it was the commander of this operation while Belinda was the one in charge of Port Elias…’\u003c/p\u003e\n\u003cp\u003eNumerous sea tribes arrived as Bayclark and Belinda conversed. Mermen, octomen, and sharkmen, each outfitted in custom-made armour, brandished their assortment of weapons that included pikes and choppers. There were even magicians among their rank, neatly spread out into rows that formed a huge legion of staffs behind Bayclark.\u003c/p\u003e\n\u003cp\u003e“Followers of the Master of Order! Evil, chaotic power has taken over Port Elias and even killed our companions. This entity has committed the worst sin under the skies. What should we do?” The Beholder elder turned, transmitting tremendous soul force undulations and radiating it in all directions.\u003c/p\u003e\n\u003cp\u003e“Eliminate them!” “Suppress them!” “Burn them to death!” The marine people in Bayclark’s legion raised their weapons and roared.\u003c/p\u003e\n\u003cp\u003e“Very good! You are all devout believers of our master!” The Beholder elder’s slit eyes seemed to be filled with traces of red, “I hereby order all of you to attack. The target is Port Elias!”\u003c/p\u003e\n\u003cp\u003eAt that, the clamour from the cries of these beings was enough to disperse the clouds in the sky. The surface of the water split apart amidst their thundering voices, countless enormous sea creatures revealing expansive level backs.\u003c/p\u003e\n\u003cp\u003eAll the troops climbed atop the enormous marine beasts in an orderly manner, making them look like terrifying war forts.\u003c/p\u003e\n\u003cp\u003e“You, mixed blood of the Alabaster, believer of the Mistress! You must come with me and use the blood of chaos to prove your loyalty!”\u003c/p\u003e\n\u003cp\u003e“What right do you have to do that?” Leylin exclaimed in annoyance, pretending to be a hot-headed person.\u003c/p\u003e\n\u003cp\u003e“What right do I have? Well, I can kill you whenever I want to,” Bayclark chuckled, while vast soul force wrapped tightly around Leylin. This was clearly a threat. Leylin was playing the role of a mixed blood with at most Morning Star strength, so he immediately paled.\u003c/p\u003e\n\u003cp\u003e“Belinda…” he looked at Belinda who was still kneeling and giving him a pleading look, “Fine, I’ll do it!”\u003c/p\u003e\n\u003cp\u003e“That’s the spirit! Chaos is an old enemy of your Matriarch too. Your actions will surely earn her favour.” The Beholder elder released his soul force. It went near the coastline where a large golden octopus appeared, which let Bayclark stand on its head.\u003c/p\u003e\n\u003cp\u003e“I merely approve of some of the Matriarch’s ideologies. I don’t follow the path of sacrifices. A bloodbath won’t bring me any benefits.” Leylin looked grim as he mounted a large marine beast with Belinda.\u003c/p\u003e\n\u003cp\u003eBelinda was apologetic, and she transmitted over to him, “I’m sorry, Nick. I I dragged you into this. When the time comes, just protect yourself. Leave the rest to me.”\u003c/p\u003e\n\u003cp\u003e“It’s not your fault,” Leylin smiled with difficulty while a trace of coldness flashed in the depths of his eyes, ‘A rank 5 Sacrificer, and someone with a high position in the organisation, would make a great gift for the Nefarious Filthbird.’\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA curfew had been imposed in Port Elias due to the recent events.\u003c/p\u003e\n\u003cp\u003eStreets that were usually bustling with life were exceptionally quiet. Boat wreckage and blood could be seen floating in the ocean, and the houses that had been wrecked in the incident were left desolate, yet to be repaired.\u003c/p\u003e\n\u003cp\u003eGroups of troops jogged around in an orderly manner on the streets, occasionally charging into shops and demanding they be allowed to search the area. It was pure chaos.\u003c/p\u003e\n\u003cp\u003eAt this moment, an urgent alarm rang out and a piercing defensive air signal sounded.\u003c/p\u003e\n\u003cp\u003eFrom a high vantage point, one could see a large wave of giant marine beasts with countless figures on their back surging forth like a tide on the surface of the waters. Aggressive beings approached the port from the sky as well.\u003c/p\u003e\n\u003cp\u003eThis scared a few of the free merchants, and they secretly put away their goods and escaped. After all, they could not afford to provoke either organisation. Doing so would only lead to a horrible death.\u003c/p\u003e\n\u003cp\u003eMerchants were not the only ones. Even the most evil pirates ran from such a dangerous place. They would rather fight the local troops trying to run away than stay here any longer.\u003c/p\u003e\n\u003cp\u003eJust as the chaos was about to escalate, the bright cries of a hawk sounded out. A large Nighthawk beast spirit spread its wings as it circled above the port with a figure on top of it. Terrifying power descended that was at the peak of rank 4, and the pier finally managed to regain its calm.\u003c/p\u003e\n\u003cp\u003eA swishing sound could be heard as something surged towards them. Soon, numerous streaks of light flew in from various locations to stand behind Elias’ Governor, bowing in greeting, “Lord Governor!”.\u003c/p\u003e\n\u003cp\u003eThey all had Morning Star-ranked strength, but they could not conceal the worry in their expressions.\u003c/p\u003e\n\u003cp\u003e“They are Trial’s Eye’s followers. I can sense that nauseating smell coming from their bodies even from here.” A white-haired elder with a hook-like nose and hawk beak spoke coldly.\u003c/p\u003e\n\u003cp\u003e“This should be about what happened this afternoon. I’ve already asked for support from the headquarters. However, they are too far away. Even if they used a teleportation spell formation, they would still need to use it several times. It seems our enemies have been preparing for a long time,” Elias’ Governor looked grim as he clenched his fist, causing the air to explode with an ear-piercing shriek. It seemed that he had been thoroughly enraged.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-712\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-714\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-713","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
