{"id":59287,"no":731,"title":"Chapter 731","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Killing and Clone\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe large snake figure that was even taller than a mountain stood before him, with large energy undulations of rank 5 emitting from it.\u003c/p\u003e\n\u003cp\u003eThis aura caused many of the family members with the blood of the Alabaster Devil to fall, yet Leylin was not the least bit affected.\u003c/p\u003e\n\u003cp\u003eHis expression did not even change, still assessing this huge beast in front of him as if picking and choosing goods.\u003c/p\u003e\n\u003cp\u003eEvidently, this attitude had led to Kenta’s great wrath.\u003c/p\u003e\n\u003cp\u003e“Hss!” The Alabaster Devilsnake hissed and pounced forward.\u003c/p\u003e\n\u003cp\u003e*Rumble!* The surface of the ground shook unceasingly, and the area at the middle caved in, forming a terrifying large pit.\u003c/p\u003e\n\u003cp\u003eThe tremendous snarls and the figure of the white snake streaked across from the pit.\u003c/p\u003e\n\u003cp\u003eTerrifying explosions sounded continuously. A tremendous white snake figure was sent flying at the end, large droplets of blood sprinkling across the sky.\u003c/p\u003e\n\u003cp\u003e“Impossible!”\u003c/p\u003e\n\u003cp\u003eThe large snake rolled in the sky and then regained Kenta’s human figure, though there were now numerous tiny wounds all around his body. His clothes had long since become tattered, and his expression showed his disbelief.\u003c/p\u003e\n\u003cp\u003e“How’s that possible? How can there be someone more powerful than me? I am favoured by the Mistress, a rank 5 of the noble Alabaster Devils!”\u003c/p\u003e\n\u003cp\u003e*Boom!* Immediately after, a streak of black flashed, and Kenta coughed up blood as he frantically retreated.\u003c/p\u003e\n\u003cp\u003e“There’s nothing that’s impossible! While a giant rank 5 serpent is powerful, there’s still a huge disparity when compared with the primordial Thousand-Eyed Giant, Golden Titan and the like.”\u003c/p\u003e\n\u003cp\u003eLeylin’s black figure slowly emerged, a mysterious Multi-Limb Race appearing at his back. The figure was now shimmering with gold and seemed to have solidified, turning into a golden deity statue.\u003c/p\u003e\n\u003cp\u003eThough it looked very delicate, there seemed to be a primordial giant beast concealed under Leylin’s black cloak. The strength hidden within caused even the Alabaster Devilsnake to look fearful.\u003c/p\u003e\n\u003cp\u003e“Hand over your blood and soul obediently, and I might even let you die more comfortably.”\u003c/p\u003e\n\u003cp\u003eAs Leylin closed in step by step, Kenta let out a strange shriek and transformed into a streak of white, preparing to abandon his family and escape.\u003c/p\u003e\n\u003cp\u003e*Pak!* Many dark red chains appeared once more, sealing the whole White River Valley.\u003c/p\u003e\n\u003cp\u003e“Your strength and speed are all lacking! Even your manipulation of dreamforce can’t measure up to me.”\u003c/p\u003e\n\u003cp\u003eLeylin stated the truth calmly while ambling over.\u003c/p\u003e\n\u003cp\u003e“No!” Kenta kept falling back, almost pressing his body on the chain walls.\u003c/p\u003e\n\u003cp\u003eSuch a ridiculous pose filled Belinda with pleasure and eased her desire for revenge, but she then found this pitiful.\u003c/p\u003e\n\u003cp\u003e“Mighty Mistress, I am willing to give up everything that I am. Please release a clone and protect your descendant!”\u003c/p\u003e\n\u003cp\u003eAt his wit’s end, Kenta’s expression suddenly flashed with ruthlessness and began an offering spell formation.\u003c/p\u003e\n\u003cp\u003eSilver rays of light flashed, and immediately after, blood and flesh splattered everywhere. An arm that was still dripping blood fell onto the spell formation.\u003c/p\u003e\n\u003cp\u003e“The offering shall be the flesh and blood of your child!”\u003c/p\u003e\n\u003cp\u003e*Rumble!* Crimson flames flashed, and the attention of a conscient in the void descended on the area.\u003c/p\u003e\n\u003cp\u003eUnder the red flames, Kenta’s arm was melted till it turned into a blood-red mask, the tremendous conscient making use of this item and descending.\u003c/p\u003e\n\u003cp\u003e“Oh Mistress, please protect your descendant!” Watching the mask take shape, Kenta might look pale and had an arm on the shoulder with a gaping wound, but his eyes were filled with elation.\u003c/p\u003e\n\u003cp\u003e“Begin the experiment!”\u003c/p\u003e\n\u003cp\u003eIn front of him, Leylin merely muttered something.\u003c/p\u003e\n\u003cp\u003e“Chirp chirp…* Grey rays of light flew from his chest. Within which was a grey feather that was like an illusion, bringing with it the power of chaos.\u003c/p\u003e\n\u003cp\u003eThe grey luster spread in the surroundings, forming an overcast sky.\u003c/p\u003e\n\u003cp\u003e“While the Feather of Chaos might be able to conceal and have the power of misleading others, how effective would it be after the Snake Dowager’s clone is summoned and descends? That’s worth investigating!”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes glinted with intelligence. While the Nefarious Filthbird had already told him this, Leylin preferred to determine this for himself.\u003c/p\u003e\n\u003cp\u003eIf he found there was an issue here, he wouldn’t need to head to his death in the holy city.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip! Record the following scene carefully. Remember to collect data!” Leylin commanded inside.\u003c/p\u003e\n\u003cp\u003e[Beep! Mission established. Beginning scanning of surroundings, recording data!] The A.I. Chip loyally intoned.\u003c/p\u003e\n\u003cp\u003eThe crimson mask opened its eyes, revealing a pair of bewitching pupils. Just meeting the gaze caused the bloodline force in Leylin’s body to begin rebelling.\u003c/p\u003e\n\u003cp\u003e“The clone of the Snake Dowager!” Leylin muttered to himself.\u003c/p\u003e\n\u003cp\u003e“Mighty Mistress, it is he who futilely tried to kill your descendant and even tried to refine us into beast spirits. Such evil behaviour must be punished!”\u003c/p\u003e\n\u003cp\u003eKenta roared, while the conscient in the crimson mask stared at Leylin silently.\u003c/p\u003e\n\u003cp\u003e“We finally meet, Snake Dowager!” Through his truesoul, Leylin’s voice was transmitted to the mask in the offering spell formation.\u003c/p\u003e\n\u003cp\u003e“Emperor of the Kemoyins, you dare appear before me?”\u003c/p\u003e\n\u003cp\u003eThe eyes in the mask showed doubt followed by ire, a great voice sounding in Leylin’s mind, “The power of chaos! You’ve sided with the Nefarious Filthbird and sealed off this region?”\u003c/p\u003e\n\u003cp\u003eEyes swivelling, they rested on the gray feather in the air.\u003c/p\u003e\n\u003cp\u003e“Let’s just say this is a temporary cooperation.” Leylin’s expression showed his sincerity as he bowed towards the clone of the Snake Dowager and greeted her carefully, “Well then, mighty Mistress, is there a possibility of us settling this?”\u003c/p\u003e\n\u003cp\u003e“If you take the initiative and abandon your Kemoyin Serpent bloodline and let me seal you myself!”\u003c/p\u003e\n\u003cp\u003eThe clone went silent for a while and then answered coldly, as if this was the furthest she was willing to go, while Leylin’s pupils showed his hostility in answer.\u003c/p\u003e\n\u003cp\u003eSealing his emperor bloodline meant there was no chance of advancing forever, and his Warlock rank would fall to 4.\u003c/p\u003e\n\u003cp\u003eThat was not something he could bear to let happen.\u003c/p\u003e\n\u003cp\u003e“Then… This discussion will come to naught? As expected,” Leylin sighed and manipulated the feather of chaos in his hands.\u003c/p\u003e\n\u003cp\u003eA crystal with the power of chaos from before appeared in his hands, burning up fiercely.\u003c/p\u003e\n\u003cp\u003eGreat amounts of the power of chaos, mixed with Leylin’s own strength, swallowing up the offering spell formation like a tsunami.\u003c/p\u003e\n\u003cp\u003e*Whistles* Crimson rays emanated from the mask and quickly showed signs of being unable to endure the pressure, and was then drowned out by large amounts of gray power of chaos.\u003c/p\u003e\n\u003cp\u003e“How- How’s that possible? Kenta watched the scene, stunned, feeling like all the faith he had had crumbled.\u003c/p\u003e\n\u003cp\u003eLeylin and the Snake Dowager’s clone had chosen to communicate through the soul, which was why these outsiders could not understand what had just happened.\u003c/p\u003e\n\u003cp\u003eAll they saw was that the black-cloaked being, Leylin, and the Snake Dowager’s clone in the mask had gazed at each for an instant and, immediately after, the clone had been swallowed by the grey strength.\u003c/p\u003e\n\u003cp\u003eThe Snake Dowager was a mighty dignitary for them, and was everything to all bloodlines. How could it be extinguished so easily?\u003c/p\u003e\n\u003cp\u003eThe shock rendered them speechless, and Kenta lost all will to resist.\u003c/p\u003e\n\u003cp\u003e[Beep! Recorded all data. Confirmed that no information has been leaked.] The A.I. Chip’s robotic voice sounded, allowing Leylin to heave a sigh of relief.\u003c/p\u003e\n\u003cp\u003eHe had used the power of chaos to seal off the area, so that the clone had no way of returning, and even all information would not be transmitted back.\u003c/p\u003e\n\u003cp\u003eIf not, even if he were to dispose of the clone, he would immediately be found by the Snake Dowager herself.\u003c/p\u003e\n\u003cp\u003eThankfully, with the help of the Nefarious Filthbird and its strength being proficiency in misleading, it had even temporarily cut off all connections between the clone and the Snake Dowager.\u003c/p\u003e\n\u003cp\u003e“The reason the clone had lost was not that it had lost to the Nefarious Filthbird, but because it was caught by surprise, as well as a boost from me…”\u003c/p\u003e\n\u003cp\u003eLeylin clearly understood the situation and would not be proud that he had been able to destroy an energy clone.\u003c/p\u003e\n\u003cp\u003eThe loss of a clone was, to the Snake Dowager, like a human losing a strand of hair. It was not worth even mentioning.\u003c/p\u003e\n\u003cp\u003eHowever, this was a good start. At the very least, Leylin was certain that with help from the Feather of Chaos, he could conceal himself completely and sneak into the holy city without trouble.\u003c/p\u003e\n\u003cp\u003e“By concealing myself with the law of chaos and help from the A.I. Chip. I’ll be able to hide myself unless I meet with the main body.”\u003c/p\u003e\n\u003cp\u003eLeylin completely sighed in relief, gaining more confidence in his plans.\u003c/p\u003e\n\u003cp\u003e“How can the Mistress of all snakes, a dignitary, be defeated and die so easily? How can that be?”\u003c/p\u003e\n\u003cp\u003eHe headed over to Kenta. This guy was now not in his right mind. For bloodline holders, the Snake Dowager was everything to them, and they could not accept this fact.\u003c/p\u003e\n\u003cp\u003e“Once he regains his wits, he might begin to harbour doubt towards her. I’ve planted the seed, allowing them to understand that she’s merely a powerful existence. That seed will then sprout and grow till he begins to seek to surpass his limits and obtain more power… With that tiny possibility of one in a million, that could awaken the emperor bloodline of the Alabaster Devilsnakes and allow him to become a rank 6… Next, he’ll be like me and try to break away from the restraints of the Snake Dowager, or be sealed with the Curse Mark of Ten Thousand Snakes and have his bloodline absorbed till his death!”\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip analysed, and a large number of possibilities in the future appeared.\u003c/p\u003e\n\u003cp\u003eThis was not the power of destiny, but precise estimations based on a massive amount of analysis and behaviours of individuals.\u003c/p\u003e\n\u003cp\u003eThough its rate of having inaccuracies was quite high, Leylin was confident that someday, the A.I. Chip could be like a god of the future, simulating everything that had happened and could happen in a world.\u003c/p\u003e\n\u003cp\u003e“If it reaches that point, I would probably have reached rank 9 by then…”\u003c/p\u003e\n\u003cp\u003eLeylin sighed, “It’s a pity, but you won’t get that opportunity!”\u003c/p\u003e\n\u003cp\u003eDark red blades of light slashed, and Kenta’s head fell to the ground.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-730\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-732\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-731","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
