{"id":58630,"no":74,"title":"Chapter 74","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eGreat Magus Serholm\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\"I must hurry!\" Leylin strode into the villa.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Scan the main structure of the villa!\"\u003c/p\u003e\n\u003cp\u003e[Mission establishing, beginning scan....]\u003c/p\u003e\n\u003cp\u003ePreviously, the A.I. Chip could not scan the blueprints of the villa due to the layer of spell formation and defensive measures on the surface of the villa.But, that was not the case now.\u003c/p\u003e\n\u003cp\u003eVery soon, a layer of light in the shape of a blue map appeared in front of Leylin\u0027s eyes.\u003c/p\u003e\n\u003cp\u003e\"En! There are two storeys in the villa. On the higher floor, it\u0027s the bedroom and bathroom! The first floor would be the guestroom. As for the experiment lab, it is located underground! The entrance is built into the back of a wardrobe!\"\u003c/p\u003e\n\u003cp\u003eUnder the scan of the A.I. Chip, the interior of the villa was displayed in front of him fully.\u003c/p\u003e\n\u003cp\u003e\"To the bedroom first!\" Leylin rapidly ran up the second floor.\u003c/p\u003e\n\u003cp\u003eGripping the yellow bronze handle, Leylin opened the large door to the bedroom. A layer of dust immediately infiltrated his nose. The surface of Leylin\u0027s body automatically created a layer of black coloured light membrane, shielding him from the dust.\u003c/p\u003e\n\u003cp\u003eLeylin then scanned the area, \"Everything is all neatly placed!\"\u003c/p\u003e\n\u003cp\u003eThe bedroom was very small, with only a bed, a table and a chair, and a closet.\u003c/p\u003e\n\u003cp\u003eLeylin opened the closet, \"The clothes have all disappeared, it seems that the owner here has prepared to abandon this place!\"\u003c/p\u003e\n\u003cp\u003eAlthough he had thought of this before, Leylin was still somewhat disappointed.\u003c/p\u003e\n\u003cp\u003eHe immediately rummaged through the bedroom but found nothing of value. Even the drawers of the table were empty, and there was only some blank parchment paper in the corners of the room.\u003c/p\u003e\n\u003cp\u003e\"These should be remnants of the diary or record book! A pity that there\u0027s nothing written on them!\"\u003c/p\u003e\n\u003cp\u003eLeylin felt that it was somewhat a shame. His eyes suddenly flashed, \"Diary! I got it!\"\u003c/p\u003e\n\u003cp\u003eThe yellow parchment paper was very old and seemed as if would break into many pieces. However, to Leylin, these few pieces of parchment paper were supreme treasures!\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Scan the traces on the parchment paper!\"\u003c/p\u003e\n\u003cp\u003eLeylin ordered, and a layer of blue light was immediately projected in front of his eyes. As for the parchment paper, lines of red handwriting were intermittently surfacing.\u003c/p\u003e\n\u003cp\u003e\"This is something that the Magus wrote on a piece of parchment paper, but traces of his handwriting were left on these pieces of parchment!\u003c/p\u003e\n\u003cp\u003eLeylin was somewhat elated. Magi would only use spells to appraise items, but there were spells that defended against such attempts. However they had absolutely no defences against Leylin\u0027s previous world\u0027s graphology, and he eventually found some clues.\u003c/p\u003e\n\u003cp\u003eThe information on the parchment paper was extremely disorderly. Many characters were overlapping with one another, and even the A.I. Chip was unable to differentiate between them.\u003c/p\u003e\n\u003cp\u003eAfter putting together the scattered pieces, what little information Leylin gotten should have been this diary:\u003c/p\u003e\n\u003cp\u003eSeptember 1st, clear. Extreme Night City is a very tranquil city, I hope I can carry out my experiments here peacefully....\u003c/p\u003e\n\u003cp\u003eDecember 5th, dark. Oh! Damn it! The experiment has failed yet again, as expected! The difficulty of synthesizing bloodlines has far exceeded my expectations....\u003c/p\u003e\n\u003cp\u003eWhat remained was extremely vague, and even the dates could not be deciphered:\u003c/p\u003e\n\u003cp\u003eAfter reading Wayne\u0027s letter, I conducted a few more experiments. I have to admit, he was right, I was heading in the wrong direction all along, this is indeed some sorrowful news....\u003c/p\u003e\n\u003cp\u003eThe experimental body has failed completely. As for what\u0027s left of the eggs, even if they could hatch, my plan has completely failed. Oh, my heavens....\u003c/p\u003e\n\u003cp\u003eThere is nothing of value here anymore. Maybe I should go to the Dylan Gardens to have a look. Wayne said that his experiments have already achieved a few stages of success, this is a great piece of news for us....\u003c/p\u003e\n\u003cp\u003eThe contents of the diary stopped here, it was a continuous record of a Magus\u0027 failure and ended in the abandonment of the lab.\u003c/p\u003e\n\u003cp\u003eBesides a person called Wayne from the Dylan Gardens, Leylin gained nothing whatsoever.\u003c/p\u003e\n\u003cp\u003eHowever, there were too many Wayne\u0027s, and as for Dylan Gardens, Leylin never heard of it before.\u003c/p\u003e\n\u003cp\u003e\"Not right, wait a minute!\"\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s eyes suddenly flashed, and in the corner of the parchment paper, he discovered a name.\u003c/p\u003e\n\u003cp\u003eThe faint red writing was extremely vague, hence, Leylin almost missed it earlier.\u003c/p\u003e\n\u003cp\u003e\"Nor... Norco Curadu Sfar!\"\u003c/p\u003e\n\u003cp\u003e\"Norco Curadu Sfar!\" Leylin\u0027s eyes widened, \"Great Magus Serholm!\"\u003c/p\u003e\n\u003cp\u003e\"Could it be that the owner of this lab was the great Magus Serholm?\"\u003c/p\u003e\n\u003cp\u003eNorco Curadu Sfar was a legend of the south coast! In the legends, not only was he an erudite scholar, he had obtained extremely outstanding results along the path of a Magus. He had even led the whole of the south coast Magi to repel the countless advances of the subterranean people and marine creatures.\u003c/p\u003e\n\u003cp\u003eThis kind of great Magus was the role model for all Magi in the south coast.\u003c/p\u003e\n\u003cp\u003eEarlier in the market, the dishonest merchant who tried to sell Leylin the Lowian Academy Teachings had tried to pass off the original decrepit page as the writings of the great Magus Serholm, but it was seen through by Leylin.\u003c/p\u003e\n\u003cp\u003e\"A respected figure like this, his legacy would definitely be of value. A pity that the two storeys were left with nothing and there definitely would not be any legacy or things of the sort!\"\u003c/p\u003e\n\u003cp\u003eRegret streaked across Leylin\u0027s face, but he still memorised the contents on the parchment paper.\u003c/p\u003e\n\u003cp\u003e\"I hope that there will be something to gain from the experiment lab!\"\u003c/p\u003e\n\u003cp\u003eLeylin gave the bedroom one last disappointed glance before he puffed out a breath, and blew the parchment paper into bits.\u003c/p\u003e\n\u003cp\u003eComing to the wardrobe on the first floor, originally, the in built wardrobe should have been stuck on the wall. However, due to a small crack, Leylin could now see the passage behind it.\u003c/p\u003e\n\u003cp\u003eThis should be something that was done by the Mankestre Snake.\u003c/p\u003e\n\u003cp\u003eLeylin shifted away the emptied wardrobe, and the black passage appeared before him.\u003c/p\u003e\n\u003cp\u003e* Pa! * Leylin snapped, and a layer of light illuminated the area, dispelling the darkness and revealing a flight of steps that led downwards.\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s eyes flashed fervently as he walked down.\u003c/p\u003e\n\u003cp\u003e* Clang! *\u003c/p\u003e\n\u003cp\u003eThe leather shoes and ground made a dull noise from friction.\u003c/p\u003e\n\u003cp\u003eCompared to the villa above, the underground space was more spacious, and was almost the size of 3 to 4 villas.\u003c/p\u003e\n\u003cp\u003eCriss-crossed walls littered the area, separating the underground lab into a few large areas.\u003c/p\u003e\n\u003cp\u003eLeylin continued down the passage, and from time to time, he could see the labelling of the areas.\u003c/p\u003e\n\u003cp\u003eAn ancient handwriting was used. However, it had some relevance to the Byron language. As Leylin walked, he looked.\u003c/p\u003e\n\u003cp\u003eData area, garden area, incubator area, potioneering area, herbology area... Each and every special area appeared in front of Leylin\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eAfter seeing the incubator area, Leylin\u0027s eyes flashed, and he walked in.\u003c/p\u003e\n\u003cp\u003eA ball of light always floated around him, illuminating the sight of the incubator area.\u003c/p\u003e\n\u003cp\u003eWhat initially entered Leylin\u0027s sight were many circular glass domes, but the glasses had already cracked, revealing many rotten eggs of mysterious organisms.\u003c/p\u003e\n\u003cp\u003eUnder the alert from the A.I. Chip that there were no signs of life around, Leylin put on a pair of gloves, and held a grey egg that resembled a granite stone in his hands.\u003c/p\u003e\n\u003cp\u003e[Scanning in progress, similarity level to the Mankestre Snake: 73.2%, Huge Wood Python: 34.5%, Huge Tree Lizard: 13.8%]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip continuously projected the results of the scan.\u003c/p\u003e\n\u003cp\u003e\"It seems like these are all the brothers and sisters of the half adult Mankestre Snake!\" Leylin gasped as he saw the many dead eggs within the glass domes.\u003c/p\u003e\n\u003cp\u003eIf they were all still alive, Leylin would most likely not be able to escape.\u003c/p\u003e\n\u003cp\u003eAfter some searching, Leylin discovered a strange incubating pool. On the surface of the glass ball, there was a circular hole that was cracked through, and the remnants of some egg shells.\u003c/p\u003e\n\u003cp\u003e\"The Mankestre Snake from earlier should have been bred in this incubating pool....\"\u003c/p\u003e\n\u003cp\u003eLeylin sized up the area and was unresigned as he continued searching, finally obtaining nothing. He could only pick up a dead egg that looked like a stone and toss it.\u003c/p\u003e\n\u003cp\u003eData area, garden area, potioneering area, herbology area...\u003c/p\u003e\n\u003cp\u003eLeylin looked over everything once. The great Magus Serholm would have definitely spent a lot of time and effort on it. The set up in each area was extremely thorough.\u003c/p\u003e\n\u003cp\u003eHowever, when he left, he brought along everything with him. Leylin, who originally wished to get lucky, had now also completely tossed that notion away.\u003c/p\u003e\n\u003cp\u003eApart from the few blank pieces of parchment paper in the bedroom, there was nothing that Leylin found.\u003c/p\u003e\n\u003cp\u003e\"The final area! The dissecting room!\"\u003c/p\u003e\n\u003cp\u003eLeylin wore a disappointed expression that he found difficult to mask, and walked into the room.\u003c/p\u003e\n\u003cp\u003e* Clang! *\u003c/p\u003e\n\u003cp\u003eThe steel door boomed opened and a concentrated aura of dense negative energy permeated the air. Leylin could even hear the faint wails of countless souls.\u003c/p\u003e\n\u003cp\u003e\"On the way of a Magus who seeks the truth, one can never avoid spilling blood!\" Leylin muttered the maxim of the great Magus Serholm.\u003c/p\u003e\n\u003cp\u003eAfter sizing up the area, Leylin noticed that there were some traces of black blood on the white experiment table. He picked up some powder from it.\u003c/p\u003e\n\u003cp\u003e\"A.I. Chip! Scan!\"\u003c/p\u003e\n\u003cp\u003e[No surviving cells were detected! Due to various intense radiations, there are deficiencies and mutations in the fragments of the cells, unable to detect source!]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip\u0027s voice intoned.\u003c/p\u003e\n\u003cp\u003e\"F*ck!\" Leylin felt utter disappointment as he kicked the experiment table.\u003c/p\u003e\n\u003cp\u003eTowards Magi who loved explorations, nothing was more disappointing than devoting countless effort and energy to enter the vestiges of ancient times and returning empty handed.\u003c/p\u003e\n\u003cp\u003eAlthough the Alchemy diary could already be considered to be extremely beneficial to Leylin, compared to the great Magus Serholm, that kind of loot was somehow inadequate.\u003c/p\u003e\n\u003cp\u003eThis was the great Magus Serholm!!! An official Magus that was at least rank 4!!!\u003c/p\u003e\n\u003cp\u003eBut in his lab, Leylin gained nothing at all, which made him extremely vexed.\u003c/p\u003e\n\u003cp\u003e\"Forget it! At least I still have the diary of that unlucky fellow. I did not suffer any loss. Moreover, this experiment could very well be a lab that the great Magus Serholm used when he was a rank 1 or 2 Magus. If not, I would have definitely not been able to enter....\"\u003c/p\u003e\n\u003cp\u003eSuddenly, Leylin was rather glad.\u003c/p\u003e\n\u003cp\u003eIf he had trespassed into the lab of the great Magus Serholm when he was at his peak. and if there had been some curse laid out, Leylin certainly would have been unable to resist right now.\u003c/p\u003e\n\u003cp\u003e* Bang! *\u003c/p\u003e\n\u003cp\u003eAs if kickstarting some kind of chain reaction by kicking the experiment table, a gust of wind blew past the ground, turned into a whirlwind, and coiled the dust up in the air.\u003c/p\u003e\n\u003cp\u003e\"Eh?\" Leylin\u0027s face tightened, and his right hand extended into his waist pouch.\u003c/p\u003e\n\u003cp\u003eThe cyclone grew larger and larger, before finally forming into a translucent human figure.\u003c/p\u003e\n\u003cp\u003e\"How many years... How many years has it been already! I have finally caught a whiff of a living human!\" The translucent figure seemed to gasp and revealed a vague elderly visage.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-73\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-75\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-74","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
