{"id":59307,"no":751,"title":"Chapter 751","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Eternal Ent\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe holy city had paid a price in blood to gather information about the gluttonous beasts, and in return Belinda had been taken advantage of by those dishonest profiteers when she tried to get a hold of the information.\u003c/p\u003e\n\u003cp\u003eHowever, the information was worth the exorbitant price. It was unquestionably genuine, and had helped her escape danger several times.\u003c/p\u003e\n\u003cp\u003e‘This won’t do. If the gluttonous beast evolves, its capabilities will have grown even greater. It might even discover my presence…\u003c/p\u003e\n\u003cp\u003e“Even if I continue waiting patiently for the beast to leave, there will still be others. This place is obviously a gathering point for them, otherwise the mission wouldn’t be marked with such great difficulty. And now… The aura given off by this evolving beast is making the others subconsciously keep away from this place…’ Belinda’s eyes flashed.\u003c/p\u003e\n\u003cp\u003e“This might be my best chance!” she said, with a resolute expression in her eyes.\u003c/p\u003e\n\u003cp\u003e“Dreamforce spell— Hollow!” A crimson trace of dreamforce lingered on Belinda’s skin like a scarlet veil, and she looked like she had just stepped out from a fairytale.\u003c/p\u003e\n\u003cp\u003eAs a mixed-blood Alabaster Devilsnake, she had naturally inherited the ability to manipulate dreamforce. After her black conversion, her innate skill had strengthened considerably even.\u003c/p\u003e\n\u003cp\u003eHowever, at this moment an anxious look appeared on her face. ‘The dreamforce has weakened…’\u003c/p\u003e\n\u003cp\u003eThe dreamforce that Belinda had pulled to this world was several times weaker than before, and its power had clearly fallen. She had a feeling like all of Dreamscape had perished, and there was not a single trace of life. Even the intensity of the dreamforce had greatly decreased.\u003c/p\u003e\n\u003cp\u003eDreamscape had sunk into its silent phase, and those with the Alabaster Devilsnake bloodline like her could only consider it as bad news. During this testing time of the Calamity of Gluttony, Belinda could tell that many Alabaster Devilsnake bloodlines had been massacred on the battlefield due to losing the dreamforce they had mastered.\u003c/p\u003e\n\u003cp\u003e‘Almighty Matriarch, please bestow your blessings on my clan!’ Belinda prayed inwardly and soon vanished into thin air.\u003c/p\u003e\n\u003cp\u003eBorrowing the illusionary powers of Dreamscape, Belinda concealed herself completely and approached the Crescent Lake. The nearer she drew to the two heads of the mountainous rat gluttonous beast, the more she could feel its ghastly energy that cared for nothing in the world, as well as its sinister will to satisfy its appetite at all costs. Her skin prickled with fear, as if an edge of a sharp sword was pressing against her soft cheek.\u003c/p\u003e\n\u003cp\u003e‘It’s going to be alright.’ The gluttonous beast’s ability to respond to this type of invasion had diminished, and as Belinda drew closer to the Crescent Lake, her eyes glimmered with joy. Belinda warily passed by the two-headed giant rat and reached the Crescent Lake’s lakebed, and the precious stones which radiated a blue glow disappeared without a trace into her hands.\u003c/p\u003e\n\u003cp\u003e‘Blue quartz!’ After the success of her operation, Belinda had a feeling that things had gone beyond her expectations.\u003c/p\u003e\n\u003cp\u003e‘Excellent, with the holy light crystal Nick should be able to carry on for a bit longer…’ Belinda clamped down on the excitement in her heart, stowed the blue quartz away safely, and prepared to leave immediately.\u003c/p\u003e\n\u003cp\u003eA monstrous cawing suddenly filled the air.\u003c/p\u003e\n\u003cp\u003eIt was at this moment that the two-headed rat’s body suddenly transformed. It opened its eyes in a flash, revealing four green irises filled with an oppressive manic insanity. The purple veins on its body throbbed explosively, and innumerable blood clots and tumours pulsed beneath its skin in a horrifying manner.\u003c/p\u003e\n\u003cp\u003eThe gruesome sarcoma on its neck was enclosed in a crimson light, and was steadily shrinking and swelling.\u003c/p\u003e\n\u003cp\u003e‘Its evolution failed!’ Belinda was astonished. It was clear that the gluttonous beast had not accumulated enough energy, leading to a failure in its evolution. This was the worse case scenario: after failing its evolution the gluttonous beast would enter a fearsome foraging state to make up for its lack of energy.\u003c/p\u003e\n\u003cp\u003eThe gluttonous beast was now even more psychotic than the average beast, and it would fear nothing, not even death. The beast roared, its inhuman cry bursting forth into the surroundings.\u003c/p\u003e\n\u003cp\u003eThe sound of something breaking could be heard as fine cracks began to appear like a spiderweb on Belinda’s veil of dreamforce.\u003c/p\u003e\n\u003cp\u003eAs it began to crumble, Belinda’s expression changed in an instant. The sky flashed red, and her figure was immediately revealed. No later than that were the beast’s four enormous green eyes fixed on her.\u003c/p\u003e\n\u003cp\u003eThe rank 5 beast converted its rage over the failed evolution and its hunger into a berserk killing intent, and its fearsome gaze left Belinda feeling suffocated.\u003c/p\u003e\n\u003cp\u003e“Run!” The enormous phantom of an Alabaster Devilsnake formed behind Belinda, and wisps of dreamforce converged like a crimson wave in front of the giant rat.\u003c/p\u003e\n\u003cp\u003eShe didn’t turn back as she fled in a hurry, becoming a streak of red in the landscape as she struggled to escape.\u003c/p\u003e\n\u003cp\u003eHowever, the rank 5 existence was still a terrifyingly powerful beast contaminated by gluttony, and its power far exceeded Belinda’s capabilities. With a berserk roar, the giant two headed rat approached the impenetrable wall of dreamforce and the figure of a giant serpent within it. The insanity only grew deeper in its eyes as it charged straight through.\u003c/p\u003e\n\u003cp\u003eThe sound of a shrill scream and a frightening explosion pierced Belinda’s ears. The rat was covered by wisps of green smoke and the odour of rotting flesh. The corrosive dreamforce had eroded its previously smooth coat into a festering mess, riddled with bald spots that exposed the tender white flesh beneath. It looked extremely grotesque.\u003c/p\u003e\n\u003cp\u003eThe wall of dreamforce and the shadow of the Alabaster Devilsnake had been obliterated with a single strike from the giant rat. Like a black hole, it had sucked all of the dreamforce and even the soul projection into itself.\u003c/p\u003e\n\u003cp\u003eWith a flash of yellow light, the two headed rat’s serious injuries healed immediately, and its aura grew even more tyrannical. If it had enough food, the gluttonous beast’s injuries could recover completely at a frightening speed, and it didn’t even have to overcome any bottlenecks to advance. This was the truly terrifying aspect of the gluttonous beasts!\u003c/p\u003e\n\u003cp\u003e“Oh.” Belinda grew faint at the sight of her soul projection being extinguished. Two lines of blood trickled out from her eyes. It wasn’t only that; her traumatic injuries ripped apart the streak of light, she was no longer able to rapidly flee the battlefield.\u003c/p\u003e\n\u003cp\u003eThe two headed rat chirped as it stared at Belinda, sizing up where it would take its first bite. To this gluttonous beast, a rank 4 adventurer was rather good nourishment.\u003c/p\u003e\n\u003cp\u003e“You disgusting bastard, let’s go!” In this life or death crisis, Belinda grew extremely fierce. An enormous black battle sword appeared in her hands.\u003c/p\u003e\n\u003cp\u003eThe only way she could deal with this kind of gluttonous beast was to use large-scale destructive techniques, and heavy duty weaponry could also show good results.\u003c/p\u003e\n\u003cp\u003eThe colossal two headed rat was as fast as lightning once it started moving. Belinda only saw a yellow flash before a titanic force swept towards her, knocking the black sword out of her hands and driving to her knees. Blood spilt from her mouth.\u003c/p\u003e\n\u003cp\u003e‘A rank 5 existence! It’s even on the verge of breaking through, at a higher state that I could never hope to reach…’ After receiving this life-threatening injury, Belinda could only smile bitterly. The sound of sharp crunching made Belinda look up, only to see that her extremely expensive battle sword which had received the Matriarch\u0027s blessing had disappeared into the giant rat’s toothy maw.\u003c/p\u003e\n\u003cp\u003e“It actually ate it…” Belinda lost her ability to smile, and her eyes narrowed, “Don’t tell me that my fate is to disappear into this gluttonous beast’s stomach?”\u003c/p\u003e\n\u003cp\u003eThe rat beast finished its meal of her battle sword and pounced towards Belinda, its sharp front claws ripping through Belinda’s defense and disembowelling her.\u003c/p\u003e\n\u003cp\u003e“Farewell, Sophia… and Nick…” In her final breaths of life, Belinda’s expression was serene. Apart from a trace of regret, she didn’t seem to have any feelings of fear.\u003c/p\u003e\n\u003cp\u003e*Thud!* A shock wave suddenly sent Belinda flying back, yet the sharp pain she expected didn’t come. Her eyes grew wide with confusion, and she recognised the mysterious object that protected her.\u003c/p\u003e\n\u003cp\u003e“Isn’t that… Nick’s amulet?” She recalled Sophia’s reminder, and her heart grew warm.\u003c/p\u003e\n\u003cp\u003eThe green light began to tremble, fluttering like a leaf in the breeze. The giant tree leaf seemed to be full of a brilliant radiance within the sacred light. The veins and stem of every leaf were clearly pronounced, and each one seemed like a piece of lustrous jade.\u003c/p\u003e\n\u003cp\u003eThe boundless green light dispersed, and with the green leaf at its core a giant human-like figure that was over ten feet tall appeared. The giant person’s body had a wooden grain texture, with vines and green leaves decorating its shoulder and body. It looked like a giant tree soldier.\u003c/p\u003e\n\u003cp\u003e“My esteemed mistress, you’ve been injured!” The Ent said in a droning and nasal voice.\u003c/p\u003e\n\u003cp\u003e“Who are you?” Belinda asked expressionlessly.\u003c/p\u003e\n\u003cp\u003e“The Protector of Wisdom! I am from the clan of Eternal Ents, you can call me Benny,” the Ent seemed to smile at her, “I will stay behind and hold back this beast, so please leave this place as quickly as possible!”\u003c/p\u003e\n\u003cp\u003eAfterwards, Benny the Ent bellowed and charged towards the two-headed giant rat.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-750\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-752\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-751","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
