{"id":59308,"no":752,"title":"Chapter 752","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eSuccessful Growth\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e*Chik! Chik!* The large two-headed mouse bellowed, a pair of sharp claws being enveloped by yellow light. A huge wound was torn open on Benny’s ches, but for the Ent who didn’t have any weak points or even flesh and blood, there was naturally nothing like a scene of blood spurting out.\u003c/p\u003e\n\u003cp\u003eOn the contrary, there was no pain on Benny’s face. Instead, a green circle of light was emitted from his chest and it began to heal immediately. Even the giant claws were caught inside, inducing the large rat’s fury.\u003c/p\u003e\n\u003cp\u003e“Bind!” Green leaved vines were like the most terrifying of law-shackles, extending from Benny’s arm and twining around the giant rat.\u003c/p\u003e\n\u003cp\u003e‘Powerful regeneration abilities and such physical strength… Could this be the Primordial Ent rumoured to be from ancient times?’ Belinda watched the two monsters fighting and gritted her teeth, making use of this hard-to-come-by chance and beginning to flee. Meanwhile, the mysterious feelings she had for Leylin grew even stronger…\u003c/p\u003e\n\u003cp\u003e*Rumble! Rumble!* Terrifying earthquakes wreaked havoc near the crescent lake, causing dust to fly everywhere. Two huge figures could vaguely be seen in battle. Wooden arms or vines were sent flying on occasion, and this would be accompanied by a terrifying crunch.\u003c/p\u003e\n\u003cp\u003eThe Ent was evidently not a match for the giant mouse, but due to its characteristics it could buy a lot of time for Belinda to escape. By the time the giant mouse achieved victory, it could only roar in fury at the pile of wood shavings.\u003c/p\u003e\n\u003cp\u003eSomeone else was spying on the battlefield from the darkness.\u003c/p\u003e\n\u003cp\u003e“This darned old mouse. Get an entire brigade over here for me. I want it dead!” Aegnis glared at the giant two headed rat hatefully, her eyes showing her wrath. The few soldiers behind her could only agree meekly.\u003c/p\u003e\n\u003cp\u003e‘Thankfully, Belinda’s fine.’ Aegnis patted her chest, a pondering look in her eyes. She was obviously worried about Belinda going on a solo mission and had followed her secretly. If not for the appearance of the Ent, she probably wouldn’t have been able to keep from acting herself.\u003c/p\u003e\n\u003cp\u003e‘Nick seems rather interesting! Are otherworldly summoning techniques his trump card?’ While sacrifices and beast spirits were the norm in the Purgatory World, there were also other paths to power. Even Magi existed here, hence Leylin’s summoned Ent didn’t surprise Aegnis too much. At most, she would think he’d inherited some relatively obscure abilities.\u003c/p\u003e\n\u003cp\u003e‘But this Ent that he so casually summoned has the power to hinder a rank 5 gluttonous beast for a while…’ Aegnis stroked her chin, ‘I should warn Thomas and get him to stop his plans for now. I should look up Nick’s history, he might be someone who’ll give us a huge surprise.’\u003c/p\u003e\n\u003cp\u003eHowever, Aegnis had no idea that when Leylin’s true identity was revealed, she wouldn’t be surprised, but horrified.\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am!” one of the guards immediately bowed and withdrew.\u003c/p\u003e\n\u003cp\u003e“Next up, it’s you, you disgusting old mouse. How dare you harm my adorable Belinda? I’m going to tear your bones apart and use your brain juices as gravy!” A vast and horrifying three-headed snake appeared abruptly in tandem with her announcement, pouncing towards the giant two headed rat.\u003c/p\u003e\n\u003cp\u003eThe rest of the soldiers exchanged glances. In the end, despite their unwillingness, they could only follow their leader and charge forward as well. A massive battle was about to ensue…\u003c/p\u003e\n\u003cp\u003eAegnis had grown slightly fearful after Leylin revealed that tiny bit of his strength. Thomas’ plan for revenge had been put on hold, which gave him valuable time.\u003c/p\u003e\n\u003cp\u003eHowever, battles generally grew more intense, and things had almost gotten desperate.\u003c/p\u003e\n\u003cp\u003eIn order to contain the wave of gluttonous beasts, the holy city had already arranged campaigns against them several times. Even the Snake Dowager herself had sent out a clone, but in the face of Beelzebub’s huge army of gluttonous beasts, they yielded tiny results. Several of her clones were even destroyed. The bloody loss of life caused the holy city to be in an extremely unstable situation.\u003c/p\u003e\n\u003cp\u003eA few months later, after several attempts to meet the beast wave, the battle line was pushed to the edges of the holy city. The city walls, and the triumphal arch that used to be filled with holy light, had now turned into the last line of defence for the snake beings.\u003c/p\u003e\n\u003cp\u003eFurthermore, compared to the spread of gluttony itself, the Gluttonous Army had Beezlebub himself in charge. Even the Snake Dowager would not be able to deal with them easily.\u003c/p\u003e\n\u003cp\u003eIt could be said that the holy city was now in a desperate state of emergency and on the brink of life or death.\u003c/p\u003e\n\u003cp\u003eThere were many residents within the holy city, and they would often hear the roars of the gluttonous beasts as they slumbered. They had no choice but to contribute and help with the holy city’s defences.\u003c/p\u003e\n\u003cp\u003e“I’ve told you many times already! This is property of the Stewart Family, and I am a guest of Young Master Thomas. Unless you get his consent, you have no right to look through anything here. Scram!” Leylin sent a group of patrolling officers away sternly.\u003c/p\u003e\n\u003cp\u003eEven while using the name of the Stewarts, Leylin had no choice but to take the risk to use a mental hint, and only then did the patrolling officers leave obediently.\u003c/p\u003e\n\u003cp\u003eAfter sending them away, Leylin laughed wryly. “Is it already the fourth time this month? Each time they seem to be even more urgent. Looks like rumours of the gluttonous beasts being on the verge of breaching the holy city have spread widely…”\u003c/p\u003e\n\u003cp\u003eHe then came to the flowerbed. The little green tree had already grown quite tall and was completely emerald green, like a flawless work of art.\u003c/p\u003e\n\u003cp\u003eEven with concealing spell formations, this strange scene had attracted some attention from others. If not for Leylin spending most of his time close to it, perhaps there would be someone brazen enough to come in and steal it.\u003c/p\u003e\n\u003cp\u003e“The ‘holy light crystal’ that Belinda sent over seems to have a good effect on the Wisdom Tree! Cough cough…” Leylin sized up the little green Wisdom Tree, looking quite satisfied. Even while he was coughing, the hope in his heart grew.\u003c/p\u003e\n\u003cp\u003e‘I had to courteously bow to Thomas in the past, hiding my true strength for later. It’s given me two years, which was just enough for this stump to successfully grow. Destiny is on my side!’ Leylin’s eyes burned with passion.\u003c/p\u003e\n\u003cp\u003eEver since he found out that holy light crystals were beneficial for the little Wisdom Tree, he had secretly acted and committed a few alarming crimes, gathering large amounts of crystals and bringing the growth of the Wisdom Tree forward.\u003c/p\u003e\n\u003cp\u003eLeylin had always acted with caution and did not leave any traces behind. Since they were at war, their intent to hunt down criminals was weaker than usual. With this as a cover, he had been able to hoodwink them easily.\u003c/p\u003e\n\u003cp\u003eAfter all, who would suspect an old geezer on the verge of death?\u003c/p\u003e\n\u003cp\u003eYes, in two years the Allsnake Curse had practically extracted all of Leylin’s life force. Even with facial transfiguration techniques, many wrinkles still appeared on his forehead and palms.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, how much longer do I have?” Leylin inwardly asked.\u003c/p\u003e\n\u003cp\u003e[Beep! Gathering data on Host’s life force… Establishing conjecture model! … Experiment completed. Estimated time till death: 34 days 12 hours 23 minutes 32 seconds.] The A.I. Chip intoned faithfully.\u003c/p\u003e\n\u003cp\u003e“A little more than a month? It’s shorter than I expected. Is it because I helped out the last time? Cough cough…” Leylin began to cough hard again, his handkerchief covered in scarlet blood.\u003c/p\u003e\n\u003cp\u003e“The rejection is also becoming more and more serious,” Leylin smiled wryly and threw the blood-stained handkerchief aside.\u003c/p\u003e\n\u003cp\u003eHe was now already at his very weakest.\u003c/p\u003e\n\u003cp\u003eThe frightening part of the Allsnake Curse was that it was essentially fatal for all of the descendants and Warlocks who made use of the Dowager’s serpent bloodlines. It was already an incredible thing that Leylin had managed to hold on for so long.\u003c/p\u003e\n\u003cp\u003e*Roar!* *Awoo!* *Rumble!* *Clatter!* Load roars, multi-coloured flames and the cries of many snake beings could be seen and heard. The ground shook underneath them all continuously. This was another attack from the gluttonous beast wave outside towards the holy city.\u003c/p\u003e\n\u003cp\u003eThe Snake Dowager and Beelzebub had yet to act, and seemed to have come to some tacit agreement, handing down the responsibility of victory to their subordinates. Thus, these attacks happened a few times everyday, resulting in many sacrifices and refugees.\u003c/p\u003e\n\u003cp\u003eWith the protection and the support they believed he had, many neighbours came to Leylin and prayed for help. Leylin ruthlessly rejected all of them.\u003c/p\u003e\n\u003cp\u003e“No!” “I don’t want Daddy to go!” “Please, don’t send me to the battlefield! I don’t want to die!” Noise could be heard from the streets, and the moans and cries of wretched souls travelled into Leylin’s ears.\u003c/p\u003e\n\u003cp\u003e“How chaotic.” Leylin shook his head and returned to his deckchair, narrowing his eyes as if taking a nap.\u003c/p\u003e\n\u003cp\u003e“Grandpa Nick, we’ve come to visit!”\u003c/p\u003e\n\u003cp\u003e*Bang!* The door was pushed open, and Sophia as well as Belinda walked in. In Sophia’s eyes was an unconcealed sense of sorrow. From his life aura undulations, Leylin did not have long left. Even Belinda no longer had any reservations and came to visit him often.\u003c/p\u003e\n\u003cp\u003e“Hey, you’re here!” Leylin’s smile was like that of a lonely old geezer, kind and friendly as he watched little children dropping in, “I’ve just made some tea!”\u003c/p\u003e\n\u003cp\u003eThe dilapidated courtyard was the same as before, just that beside the green tree Leylin had made a round table and deck chair, not leaving the area at all. On the wooden round table was a porcelain teapot that was emitting steam.\u003c/p\u003e\n\u003cp\u003e“Come and try my new brew!” Leylin was very friendly and made a cup of green tea for Belinda and Sophia.\u003c/p\u003e\n\u003cp\u003e“Oh, it’s very fragrant!” While holding the teacup, Sophia looked extremely content.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-751\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-753\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-752","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
