{"id":59314,"no":758,"title":"Chapter 758","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eHalfway To Rank 7\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Your Wings of Gluttony will belong to me!” Along with Leylin’s announcement and Beelzebub’s miserable cries, the monstrously dark wings were forcefully torn off, splattering blood everywhere.\u003c/p\u003e\n\u003cp\u003e*Hss—* The phantom Kemoyin Emperor behind Leylin opened its mouth wide, and it seemed like there was a black hole at its depths. It immediately devoured the entirety of the devil’s fleshy wings.\u003c/p\u003e\n\u003cp\u003e*Pila! Pila!* Two lumps of flesh surfaced on the snake’s back. It then spread out a tremendous pair of fleshy wings that looked similar to Beelzebub’s own.\u003c/p\u003e\n\u003cp\u003e“The law of gluttony…” Leylin sounded rather bewitched by them, “Combined with my own abilities, what kind of result will there be?”\u003c/p\u003e\n\u003cp\u003eThe terrifying black hole wreaked complete havoc, devouring Beelzebub’s entire body. In front of the Kemoyin Emperor’s innate skill of control, the devil’s mortal body which had been created with the Black Horrall Snake as its source material was suppressed to a huge degree. Beelzebub’s body gradually disappeared as the Kemoyin Emperor devoured it.\u003c/p\u003e\n\u003cp\u003eThe Kemoyin Emperor easily digested the power of gluttony that came from the source body of the Black Horrall Snake. A comprehension of the power of gluttony combined with Beelzebub’s memories as it surfaced in Leylin’s sea of consciousness, surging towards Leylin’s truesoul barriers like a raging tide.\u003c/p\u003e\n\u003cp\u003e“Keke… I am the true master of the law of gluttony, its contamination isn’t something the likes of you can resolve. Thank you very much, this body is great!” A barely visible shadow appeared above the Kemoyin Emperor, and Beelzebub’s voice sounded from within the blazing demonic flames.\u003c/p\u003e\n\u003cp\u003eUnder his influence, the Kemoyin Emperor quickly digested that large bundle of energy. Even as it evolved, Leylin’s own will was being eroded.\u003c/p\u003e\n\u003cp\u003eBeelzebub had completely comprehended the law of gluttony, and to steal this power Leylin would first have to face the retaliation of his conscient. It released a large amount of power that mixed with the laws of gluttony as they approached Leylin. “Gluttony’s corruption!”\u003c/p\u003e\n\u003cp\u003eSeeing that demonic palm, Leylin maintained an icy expression. He didn’t look to be in pain, only releasing a powerful green lightning containing the power of the world origin force in his body. His cold voice sounded, “Strike three!”\u003c/p\u003e\n\u003cp\u003e*Crackle!* “NOOOOO!” Leylin’s gigantic body immediately disintegrated, and an unwilling bellow rang out. Under the suppression of the Purgatory World’s will, Beelzebub’s conscient melted away like snow in the sun, leaving behind only the purest energy and comprehension of laws.\u003c/p\u003e\n\u003cp\u003e[Beep! Genetic recombination complete!] The A.I. Chip’s voice sounded, and the Kemoyin Emperor behind Leylin behan to transform once again.\u003c/p\u003e\n\u003cp\u003eTwo sharp claws stretched out, and the horn on its forehead protruded even further. The devilish wings became increasingly mystical, and black rhombus-shaped scales covered its body, emitting a mysterious luster.\u003c/p\u003e\n\u003cp\u003e“A new bloodline? No!” The Snake Dowager who watched this scene from afar could no longer keep her calm. Even though she was afraid of the protection of the World Will, she still attacked.\u003c/p\u003e\n\u003cp\u003e“Allsnake Shadow!” The murky Shadow World almost appeared to have been summoned by the Snake Dowager, attacking the Purgatory World.\u003c/p\u003e\n\u003cp\u003eLeylin did not counterattack. Instead, he spoke a few words, “I am Leylin Farlier, lord of all Kemoyin. As of this moment, all of the Kemoyin bloodline shall leave the control of the Snake Dowager!”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes held traces of turmoil within them as he made this solemn announcement. His voice practically rang throughout the world; as long as it was a descendant of the Giant Kemoyin Serpent bloodline they heard his voice and couldn’t help but kneel respectfully in subservience.\u003c/p\u003e\n\u003cp\u003e*Hss—* The giant snake behind Leylin completed the core of its transformation. No longer feeling the suppression of the Snake Dowager, it snarled at her.\u003c/p\u003e\n\u003cp\u003e“Ugh!” The pain on her expression was even clearer than before. Power from another plane seemed to be surging into Leylin’s body.\u003c/p\u003e\n\u003cp\u003e“I shall destroy your godly status,” he murmured, and with a vicious bite from the giant serpent behind him the sound of glass shattering could be heard. A huge gap had formed in the network of blood vessels on the Snake Dowager’s back The excruciating pain caused the enormous serpents in the sphere of snakes to groan piteously below the Snake Dowager, and the faint image of the Shadow World promptly crumbled.\u003c/p\u003e\n\u003cp\u003eLosing a part of her bloodline force caused great damage to the Dowager’s authority. It was enough to grievously injure her, and force her into a deep sleep.\u003c/p\u003e\n\u003cp\u003e“Leylin... Leylin!” The Snake Dowager snarled, no longer daring to stay here. The gigantic sphere of snakes rammed against the shackles of chaos.\u003c/p\u003e\n\u003cp\u003eEven more giant serpents were continuously struck by the lightning. However, they opened up a gap in the World Will’s restrictions that allowed the Snake Dowager to escape. She had the feeling that if she’d stayed here longer she would’ve died.\u003c/p\u003e\n\u003cp\u003e‘She escaped? Makes sense, she doesn’t know I’m limited to just three uses of this power. Furthermore, with my control of the bloodline and devouring power, as well as the attention of the World Will, she’d be in trouble if she stayed any longer.’ Leylin’s eyes flashed, and he did not chase after her. He currently had more more pressing matters at hand to attend to.\u003c/p\u003e\n\u003cp\u003e[Beep! Optimisation of host’s bloodline is completed. Law of gluttony and Allsnake origin blood have been added, currently at rank 6. Please rename the bloodline.] The A.I. Chip’s voice sounded.\u003c/p\u003e\n\u003cp\u003e“Targaryen. Call it the Targaryen bloodline!” Leylin decided on a new name.\u003c/p\u003e\n\u003cp\u003e[Beep! Recorded. Bloodline evolution has been completed. Targaryen has been saved to the database, currently at rank 6.] As it sounded out, the A.I. Chip formed images of Leylin’s new bloodline patterns, naming them Targaryen. A circle of blood-red energy enveloped Leylin’s body.\u003c/p\u003e\n\u003cp\u003eThe bloodline force of the Kemoyin Emperor had been changed to an entirely new bloodline. This change even extended to Leylin’s truesoul. It was like glass shattering as a bottle exploded; the feeling of breaking through a bottleneck of the soul caused Leylin to tremble involuntarily.\u003c/p\u003e\n\u003cp\u003eThe new bloodline force surged violently, and with irresistible power the golden line in Leylin’s Full Moon truesoul expanded to envelop the entire thing. It was like a flame had been ignited.\u003c/p\u003e\n\u003cp\u003e[Beep! Host has broken through bloodline shackles. The positive energy of the truesoul is beginning to advance to rank 6] the A.I. Chip transmitted.\u003c/p\u003e\n\u003cp\u003eFor a Magus to advance from rank 5 to rank 6, the most important point was to completely convert negative soulforce to positive soul force. Leylin’s truesoul had already shown signs of the transformation, but due to the bloodline shackles the full process had been interrupted. Now, without the shackles, the process could be completed. [1 Negative and positive soul force are yin soul force and yang soul force. Just didn’t use those names because most of the novel has stuck to a western theme so far and actual chinese concepts weren’t prevalent before.]\u003c/p\u003e\n\u003cp\u003eThe bloodline shackles had been like an enormous mountain weighing down on Leylin, putting him under a lot of pressure. With them gone, the power he had amassed allowed him to soar. His truesoul rumbled in that instant, the moon set ablaze as it turned into a blazing golden sun. It grew severalfold in volume, emitting powerful and concentrated energy.\u003c/p\u003e\n\u003cp\u003eWith the strength he possessed, Leylin’s success in breaking through to rank 6 was a given. Yet, that was not all. The A.I. Chip’s voice sounded once more. [Beep! Host has reached rank 6. Huge changes have been made to body’s condition. Recalculating…]\u003c/p\u003e\n\u003cp\u003eIt then intoned loyally once more, [Beep! Host’s rank 5 innate skill Devour has been affected by law of gluttony. Devour has reached rank 6, now able to digest any energy, even that powered by opponents’ laws.]\u003c/p\u003e\n\u003cp\u003e‘Devour has been upgraded to rank 6 from rank 5… So I can devour laws from now?’ Leylin’s eyes twinkled, ‘Great! This innate bloodline ability is worthy of the rank 6 Targaryen bloodline!’\u003c/p\u003e\n\u003cp\u003ePast rank 6 was the realm of laws, and a bloodline that could devour laws and make them his own was obviously terrifying. This was also why he had spared no effort in getting Beelzebub to come to the Purgatory World. The law of gluttony and the innate skill of Devour complemented each other just too well. They were the best pair in Leylin’s view.\u003c/p\u003e\n\u003cp\u003eThe ability to break through without end as long as one possessed enough energy was something Leylin coveted. He considered it to be the best catalyst in the process of breaking through his bloodline shackles.\u003c/p\u003e\n\u003cp\u003e[Beep! Host’s comprehension of law of devouring(transformed from law of gluttony) now at 99%]\u003c/p\u003e\n\u003cp\u003e[Beep! Host’s body has been converted to a body of laws. Progress: 99%. Body’s stats have surpassed standard limits, unable to be quantified. A switch to the Heavenly Astral Race’s measurement units is suggested.]\u003c/p\u003e\n\u003cp\u003eSeeing the last prompt, Leylin’s lips quirked as he burst into a wild laughter. Such terrifying strength caused even the air around him to shake. Since he had taken such huge risks in this adventure, he would obviously want to get the best benefits.\u003c/p\u003e\n\u003cp\u003eAfter reaching rank 6, the soul of a Magus would basically reach its limits, and its soul force would become tangible. Once they grasped a certain law, they would reach the realm of a rank 7 Magus. While Beelzebub’s law of gluttony was pretty good, Leylin did not like it all that much. After all, he still felt some lingering fear towards that insane appetite.\u003c/p\u003e\n\u003cp\u003eHaving the abilities of his bloodline influenced by the power of gluttony, he could thus form the law of devouring. It was something Leylin had long since anticipated.\u003c/p\u003e\n\u003cp\u003eLeylin had grasped many laws even as he reached rank 6. He was no ordinary Breaking Dawn Monarch. In fact, he could be said to be halfway to rank 7!\u003c/p\u003e\n\u003cp\u003eOnce he completely comprehended the last bit of the law of devouring, there would be nothing holding him back from becoming a Magus who comprehended laws.\u003c/p\u003e\n\u003cp\u003eBreaking Dawn Monarchs couldn’t grasp the power of laws the moment they broke through. They would have to wait to enter the peak of rank 6 before they could even peer into the world of laws.\u003c/p\u003e\n\u003cp\u003eBut Leylin had done it! He had done something that was practically unprecedented in the Magus World’s history.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-757\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-759\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-758","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
