{"id":59331,"no":775,"title":"Chapter 775","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Year 0\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eTime passed in the blink of an eye. The world continued to turn and change. For someone like Leylin, he often would not feel the passing of time once he wholeheartedly devoted his heart and soul to something. While he was at work, hundreds of years could slip by stealthily.\u003c/p\u003e\n\u003cp\u003eOf course, to beings of laws who had life spans that were easily ten thousands of years long, such a tiny amount of time was perhaps considered just a nap. But to average humans, this meant more than ten generations of cycles of life and death.\u003c/p\u003e\n\u003cp\u003eThis was a relatively long period of time even for Magi. A few low-ranking Magi perhaps didn’t even possess such a long life expectancy. Only the almighty high-ranking beings would pay no attention to the passing of time like that.\u003c/p\u003e\n\u003cp\u003eFor the average Magus in the south coast or even the subterranean world, the news of the outside world that left the deepest impression on them in this long period of time, was probably the sudden rise of the Ouroboros Clan to power.\u003c/p\u003e\n\u003cp\u003eThe present-day Ouroboros Clan had long broken away from the embarrassing phase of having only two or three small fry. Instead, it had grown to become an influential power that spanned across the entire Magus World. Its formidable influence even extended to the subterranean world.\u003c/p\u003e\n\u003cp\u003eThe Farlier family that led the Ouroboros Clan was even acclaimed as the “first bloodline family”!\u003c/p\u003e\n\u003cp\u003eThe powerful bloodline that had been passed down generations overshadowed every other Warlock family in the central continent. Their extraordinary military capabilities were quickly revealed.\u003c/p\u003e\n\u003cp\u003eAmong Leylin’s direct descendants, this sort of prowess was made even more obvious. Even the bloodline energy of collateral relatives with many generations between them was enough to make other Kemoyin families benefit greatly.\u003c/p\u003e\n\u003cp\u003eFreya’s and Maggie’s families were evidently the ones receiving such benefits. They followed the Farlier family closely, taking up the role of their subordinates. They had also greatly purified their own bloodlines through marriages and other methods, increasing their proportion of high-ranking Warlocks higher and higher until they seemed to emerge like an endless stream.\u003c/p\u003e\n\u003cp\u003eThis new generation of Warlocks possessed extraordinary bloodline energy, and zealously believed in Leylin as their bloodline originator. They became the foundation of the Ouroboros Clan’s rule.\u003c/p\u003e\n\u003cp\u003eLeylin, who was gradually seen as a divine being, had already become a part of the legends. He did not appear in public for decades at a time, and was surrounded by an air of mystery.\u003c/p\u003e\n\u003cp\u003eSyre and the other Warlocks, the sons of his second generation, slowly took control over the authority in the Ouroboros Clan.\u003c/p\u003e\n\u003cp\u003eA team of Warlocks clothed with garments with the Ouroboros motif was travelling through the subterranean world unhurriedly.\u003c/p\u003e\n\u003cp\u003eBehind them were many captives and supplies that had obviously been plundered.\u003c/p\u003e\n\u003cp\u003e“Chief Lucca! The headcount has been checked. Nothing has been left behind. I can confirm that their clan has been completely destroyed!” An average-looking blond Warlock reported, with a worshipful look in his eyes.\u003c/p\u003e\n\u003cp\u003e“Very well! Imprison them in chains. Prepare to sell them as highly-ranked slaves!” Lucca said without the slightest hint of hesitation. The Warlocks under him received his order as per normal, and carried everything out methodically, as though they were already very accustomed to all this.\u003c/p\u003e\n\u003cp\u003e“The subterranean world! Such a gloomy sky is rather hard to get used to indeed. Perhaps after this mission has been accomplished, I should apply to rest on the surface for some time…”\u003c/p\u003e\n\u003cp\u003eLucca gazed at the dark rocky sky, and couldn’t help but to sigh to himself.\u003c/p\u003e\n\u003cp\u003eAs an elder of the Ouroboros Clan, he was already more than 500 years old, and had experienced all the major events from the initial attack to the glory that followed. His youthful appearance was already unable to conceal the continuous exhaustion of his body.\u003c/p\u003e\n\u003cp\u003e“Indeed… Recalling all of this, it truly seems as though I am in a dream.”\u003c/p\u003e\n\u003cp\u003eLucca couldn’t help but murmur as he glanced at the numerous captives and the troop that was moving forth once again.\u003c/p\u003e\n\u003cp\u003eEverything all began from when the lord had entered the Ouroboros Clan. It was as though he was born to be a strong contender. The speed at which he was promoted was so fast that it practically exceeded the limits of Lucca’s imagination.\u003c/p\u003e\n\u003cp\u003e“These damn lowly beings. How dare they disobey the Ouroboros Clan’s orders! They are simply digging their own grave! Of course, it’s only with Chief Lucca that we could have easily destroyed them!”\u003c/p\u003e\n\u003cp\u003eThe blonde team member came to his side and said, trying to curry favor with him.\u003c/p\u003e\n\u003cp\u003e“Me?! Haha… In the past, perhaps I was still worth noticing with the strength of a rank 3 Warlock, but now… Don’t make fun of your Uncle Lucca!”\u003c/p\u003e\n\u003cp\u003eLucca gazed at this Warlock as a doting look flashed across his eyes.\u003c/p\u003e\n\u003cp\u003e“In comparison to the true bloodline nobilities, the blood serpent clans and the Maggie family, my tiny achievements don’t count for anything, much less when compared to the Farlier family. After all, they directly inherited the lord’s bloodline.”\u003c/p\u003e\n\u003cp\u003eLucca’s voice became extremely respectful. A look of admiration also spread across the young Warlock’s face.\u003c/p\u003e\n\u003cp\u003e“A rank 6 bloodline! He didn’t even need to work especially hard to enter the realm of Morning Star, and even Radiant Moon …”\u003c/p\u003e\n\u003cp\u003eThe young man’s face was full of envy and self-disappointment, “If only I could also…”\u003c/p\u003e\n\u003cp\u003e“Lukard! Stop those unrealistic fantasies of yours! Lord Leylin didn’t have an outstanding bloodline in his early days, yet he made it to his current level all the same.”\u003c/p\u003e\n\u003cp\u003eLucca’s tone turned rather stern, “Now, what you need to do is to look after the order!”\u003c/p\u003e\n\u003cp\u003e“Yes Chief!” Seeing how Lucca spoke so harshly and with a serious expression, the young Warlock immediately saluted him and ran to the back of the troop.\u003c/p\u003e\n\u003cp\u003e“This chap is really…”\u003c/p\u003e\n\u003cp\u003eLucca shook his head, with a helpless expression in his eyes.\u003c/p\u003e\n\u003cp\u003eThe rise of the Farlier family and the families of their subordinates was definitely a huge blow to the original bloodline nobilities.\u003c/p\u003e\n\u003cp\u003eOf course, under the crushing suppression of absolute strength, these bloodline nobilities didn’t even dare to let out a fart. They accepted the Farlier’s family unconditional authority with complete sincerity.\u003c/p\u003e\n\u003cp\u003eSomething else that had risen into popularity at the same time was the abnormal worshipping of the ‘Emperor bloodline’. Of course, having such a mentality was perfectly normal to Warlocks.\u003c/p\u003e\n\u003cp\u003eIt was a pity that the Farlier family’s control over their bloodlines had always been very strict. There were few cases of the bloodline outflowing to other families.\u003c/p\u003e\n\u003cp\u003eTo date, only a scarce number of the original bloodline nobilities managed to obtain that special privilege.\u003c/p\u003e\n\u003cp\u003eA great many of the older nobilities had already predicted that the rising Emperor bloodline would shuffle the cards on the table. They were willing to pay any price in order to obtain the new and powerful bloodline.\u003c/p\u003e\n\u003cp\u003eOf course, they didn’t entirely dare to actually plot to seize the bloodline. Currying favour with the Farlier family and even the other subordinate families at all costs was their fundamental policy.\u003c/p\u003e\n\u003cp\u003eAt the same time, anyone who tried to illegally covet for the Farlier family’s bloodline was bound to face a bloody death in their hands..\u003c/p\u003e\n\u003cp\u003e“Sigh… Although Lukard’s bloodline is considered rich, it’s nothing compared to the Emperor bloodline. Besides, with our family’s status, having the bloodline spread to us would only happen far away in the indefinite future…”\u003c/p\u003e\n\u003cp\u003eThe slight thought of those noble descendents who followed like flies behind the ladies of the Farlier family all day long made Lucca’s scalp prickle with pins and needles.\u003c/p\u003e\n\u003cp\u003eHe hadn’t had the heart to tell his junior this cruel reality, afraid that he would become discouraged.\u003c/p\u003e\n\u003cp\u003e“Sigh… Hopefully Lady Luck will smile upon that silly boy, and let him be favoured by one of the young ladies of the Farlier family. Even if he’s marrying into her family, it’s still acceptable…”\u003c/p\u003e\n\u003cp\u003eLucca couldn’t help but begin to let his imagination run wild. He then laughed involunarily.\u003c/p\u003e\n\u003cp\u003e“Forget it, I think it would be more realistic to think about my earnings that the captures this round will bring me…”\u003c/p\u003e\n\u003cp\u003eThose in power in the Farlier family certainly were informed about this contradictory situation. However, the proliferation of a bloodline was originally a highly serious matter, and it would take time.\u003c/p\u003e\n\u003cp\u003eThus, the only thing they could do now was to constantly develop new ways to gain benefits and challenge that contradiction.\u003c/p\u003e\n\u003cp\u003eAlthough deep in his heart, Lucca was not satisfied with his family not obtaining the new bloodline, he was clearly attracted to the profits he was about to gain.\u003c/p\u003e\n\u003cp\u003eOnce it was confirmed that his profits from this round was enough for him to accumulate a certain value of contribution points, he would be able to even exchange them for precious materials for his dash towards the crystal phase. Lucca’s face was wreathed in smiles.\u003c/p\u003e\n\u003cp\u003e“This is the advantage of having control over the transaction channel! Who would have thought that I, Lucca, would actually have the opportunity to advance to rank 3 crystal phase…”\u003c/p\u003e\n\u003cp\u003eThe profits that the Ouroboros Clan gained from the bilateral trade were considerably high. The result of this was the plentiful resources for training and cultivation. This alleviated the contradiction to a certain extent.\u003c/p\u003e\n\u003cp\u003e“Take note, we’re about to reach the City of Alabaster!”\u003c/p\u003e\n\u003cp\u003eLucca’s voice made the entire troop turn restless. Even he himself couldn’t help but look forward to it.\u003c/p\u003e\n\u003cp\u003eThe channel of the City of Alabaster was of great importance, and was practically the lifeline of the entire trade industry. Thus, the level of security was at its highest, and it was also the most bustling part of the city.\u003c/p\u003e\n\u003cp\u003eAlthough the exchanges between the subterranean world and at the surface had penetrated their society, both parties have never found a channel more convenient and faster than this one. Therefore, it further highlighted the importance of the location of the City of Alabaster.\u003c/p\u003e\n\u003cp\u003eWhile the astral gate could resolve the problem of only being able to transport important supplies and people within a smaller distance range, it would definitely suffer losses if huge amounts of trading content was involved.\u003c/p\u003e\n\u003cp\u003eUntil now, the entire subterranean world had already came to a common understanding: whoever seized control of the City of Alabaster would reap enormous profits.\u003c/p\u003e\n\u003cp\u003eUnder the temptation of such great benefits, perhaps the other underground powers who originally conducted the trading processes and were infringed on had never given up on lusting after the City of Alabaster.\u003c/p\u003e\n\u003cp\u003eAlthough they absolutely did not dare to launch a direct attack, they carried out many other little tricks.\u003c/p\u003e\n\u003cp\u003eThe City of Alabaster loathed such powers who were like rats in the dark gutters. The moment they were discovered, they were sentenced to the firmest form of repression and annihilation.\u003c/p\u003e\n\u003cp\u003eBut as long as the Ouroboros Clan continued to exploit the subterranean world, one would imagine that such resistance would not be lacking.\u003c/p\u003e\n\u003cp\u003eThis time, Lucca was precisely acting under orders to eliminate one of the smaller powers by force.\u003c/p\u003e\n\u003cp\u003eThose superior overlords and the profiteers were not in the least bit afraid of these insignificant little pests. Their stance was unusually unanimous, which was a resolute decision to destroy them!\u003c/p\u003e\n\u003cp\u003eIn the face of such overwhelming strength, no matter how determined and solemn the defending party was, their final outcome was death.\u003c/p\u003e\n\u003cp\u003eLucca glanced at the line of captives behind him, the corners of his mouth twisting into a look of utter disdain.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-774\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-776\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-775","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
