{"id":59352,"no":796,"title":"Chapter 796","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAnthony\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e‘A.I. Chip, how’s the progress on the analysis of the Weave?’ Leylin inwardly asked, closing his eyes.\u003c/p\u003e\n\u003cp\u003e[Beep! Analysis prioritises concealment of the host. Current progress: Rank 0 Weave 87.69%, Rank 1 Weave 37.61%, Rank 2 Weave 2.33%!] The A.I. Chip quickly replied.\u003c/p\u003e\n\u003cp\u003eThis was one of the many reasons why Leylin was advancing so slowly as a wizard, and he was very interested in the existence of the Weave. If he was able to completely analyse the Weave without being discovered by Mystra, it would make it extremely convenient for him to cast spells.\u003c/p\u003e\n\u003cp\u003eEven with such a huge project on his hands, Leylin was still able to reach rank 5 as a wizard. This display was already enough for Ernest to rave and exclaim that he was a genius, even a monster.\u003c/p\u003e\n\u003cp\u003eWizards in the World of Gods were ranked according to their level of contact with the Weave. Those below rank 3 could only make contact with its surface, memorising and using rank 0 spells. They would acquire a deeper understanding of it upon reaching rank 3, gaining the ability to use rank 1 spells.\u003c/p\u003e\n\u003cp\u003eLeylin was now a rank 5 wizard, able to make contact with the second layer to use rank 2 spells. He was doing rather well for himself. On top of that, being a wizard in itself gave him great status. If he was lucky, he could even be conferred a lordship as he was in a large noble family, and it was highly likely that he’d gain his own land with meritorious deeds, passing it down the generations.\u003c/p\u003e\n\u003cp\u003eThis was the dream of commoners. It was a pity though; at this level everything was like the dirt on the ground to Leylin, filling him with disdain as he trod on it.\u003c/p\u003e\n\u003cp\u003e‘Ranks 1 to 5 are considered normal in the central continent, and those from rank 6 to 10 are considered elites. From 1- to 15 are experts and those above are true powerhouses who enjoy great reputation in the continent. Even if they aren’t considered Legends, they are the apex of power, and those who appear most often. Legends could care less about worldly matters, placing their ambition and hopes on obtaining divinity, perhaps igniting their godfire and obtaining a place as a deity…’\u003c/p\u003e\n\u003cp\u003eThis was Leylin’s current understanding of the power hierarchy in the World of Gods, obtained from the intel he had acquired as well as his own conjectures. Gods were set on a pedestal here, living in their divine eternal lands while their churches and priests raised followers for them.\u003c/p\u003e\n\u003cp\u003eThe prime material plane prevented all powerful forces from entering, and even if a god were to make a material body and descend they would only have the strength of a peak Legend at most. Of course, they held another title; they were called Saints. Even if their real bodies descended they would still have the same name.\u003c/p\u003e\n\u003cp\u003eHence, there were many situation in the prime material plane where high-ranked Legends besieged Saints and caused their fall. Sometimes they even managed to rob them of their divine force. Those gods would basically not let their real bodies descend and could only do that with their clones.\u003c/p\u003e\n\u003cp\u003e‘Legends are the most powerful in the prime material plane. If I can become one quickly, I’ll have enough power to protect myself. Besides, I need to do that to gain divine force.’ Leylin stroked his chin. As he had gotten enough nutrients growing up, he was already rather tall for a 13-year-old, as could be seen in the mirror. Besides his face being immature, he was practically a little adult.\u003c/p\u003e\n\u003cp\u003e‘Is the reason for the bottleneck in my stats that I’ve yet to fully develop?’ Leylin pondered over his situation, ‘Based on this progress, it’ll probably take centuries of training to reach the rank of Legend. That’s too long, and I haven’t even considered what comes after…’\u003c/p\u003e\n\u003cp\u003eLeylin conjectured that the Legends of the World of Gods were quite similar to Morning Star Magi. They possessed abilities that surpassed imagination, and while one used legendary magic the other used Arcane Arts. In addition, they both met the bare requirements for entering the ancient war campaign, and after advancing, they would undergo a massive transformation.\u003c/p\u003e\n\u003cp\u003e‘Compared to the rankings of Magi, the division of ranks in the World of Gods are greater in number. In addition, those high-ranked Legends have abilities comparable to rank 5 Radiant Moon Magi…’ Even in the prime material plane, there were many powerful beings amongst the natives of this world. While there were high-ranked Legends, there were still many children of gods, divine beings, and even demigods.\u003c/p\u003e\n\u003cp\u003eBased on Leylin’s thoughts, their abilities would not lose out to rank 6 Breaking Dawn Monarchs, or even a near rank 7 like him.\u003c/p\u003e\n\u003cp\u003e“The World of Gods is filled with danger,” Leylin sighed. Not only were there churches and followers all over the continent, the gods had eyes everywhere in their children and family. The moment abnormalities were discovered, and he attracted the attention of the gods… Leylin instantly felt his scalp prickle in fear.\u003c/p\u003e\n\u003cp\u003e‘Perhaps… Adventuring is not a good option. There are many ways to increase the lifespan of wizards. I can use time to train… Besides, my main body can afford to wait for me!’ Leylin changed his mind.\u003c/p\u003e\n\u003cp\u003eWithout external dangers, he didn’t mind spending more time if that would ensure his safety.\u003c/p\u003e\n\u003cp\u003e“Young Master Leylin, your afternoon classes are starting! Don’t make Master Anthony wait too long!” A gentle voice was heard from outside, and Leylin was pulled back to reality.\u003c/p\u003e\n\u003cp\u003e“Alright!” Leylin found a towel and wiped at the droplets of water on his body, and then headed to a room outside.\u003c/p\u003e\n\u003cp\u003eThere were two maids with pretty faces and blushes on their cheeks. They went forward, using their tender little hands to straighten the creases on his clothes.\u003c/p\u003e\n\u003cp\u003eIn a feudal family, the family head and young master’s personal maids were very important. They not only had to serve their masters in their daily lives, but also take care of their master’s bodily needs. If nothing went wrong, this role was usually taken on by the daughter of the housekeeper.\u003c/p\u003e\n\u003cp\u003eThe Faulen Family obviously could not do away with this custom. Leylin’s two personal maids were the daughters of the main housekeeper Leon. It was obvious that they had already prepared themselves mentally and were even slightly excited, but Leylin had no plans to do anything.\u003c/p\u003e\n\u003cp\u003e‘I’m only thirteen. Although young masters might have become experienced in that area at this age, they can’t be compared to me…’ Leylin knew how to control himself.\u003c/p\u003e\n\u003cp\u003e“Claire, Clara! Has Master Anthony arrived?” Leylin watched these two sisters, and only when the flush spread down to their pale necks did he ask them teasingly.\u003c/p\u003e\n\u003cp\u003e“Ye- yes, young master!” Claire blushed as she answered, feeling slightly relieved yet also disappointed.\u003c/p\u003e\n\u003cp\u003e“I can’t let my teacher wait for too long…” Leylin smiled as he left, not forgetting to tease them for a while.\u003c/p\u003e\n\u003cp\u003e“But this’ll only go on for these two years…” Smelling that sophisticated aroma, Leylin mumbled to himself.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eRays of sunlight shone in through the window, brightening up the hall.\u003c/p\u003e\n\u003cp\u003e“Mentor Anthony!” Leylin respectfully bowed. While he’d already learnt all the knowledge that the scholar knew, Leylin did not act too rudely since manners were compulsory for nobles.\u003c/p\u003e\n\u003cp\u003e“Leylin, you did well!” Anthony was already an old man, his kind voice low and his eyes shining. It was obvious that he truly liked this student.\u003c/p\u003e\n\u003cp\u003e“I’ve already taught you everything in terms of etiquette and speech in the continent. Today, we shall delve into its history…” Anthony produced a thick yellow tome that looked like a dictionary and placed it on the desk.\u003c/p\u003e\n\u003cp\u003eHistory was a rare subject even among nobles, only a few scholars focused on it. However, Leylin differed from the rest; he was extremely interested in this subject.\u003c/p\u003e\n\u003cp\u003e“History is confusing and tasteless. Many nobles hate it. Can you tell me why you chose this?” Anthony caressed the cover of the volume, looking rather nostalgic.\u003c/p\u003e\n\u003cp\u003e“It’s because knowing history makes one wise. It’s like a mirror that allows us to know ourselves better. No matter how foolish or absurd a situation, it’s already occurred in the past. We need to prevent such things from repeating.”\u003c/p\u003e\n\u003cp\u003e“A novel idea… cough cough… that makes sense… cough cough…” Anthony’s face was flushed, but he suddenly began to cough, his body bending into a stooping position.\u003c/p\u003e\n\u003cp\u003e“If you can see that, you’re definitely my student… Of course, you have Ernest as your master and might not think much of this, but I hope you’ll take this!” Anthony’s hands trembled as he produced a white silken bundle and unwrapped it layer by layer, revealing the emblem within.\u003c/p\u003e\n\u003cp\u003e“This is the proof of my glory as a scholar, presented to me in the king’s capital by the God of Knowledge. It is now yours… Cough cough…” Anthony’s hands trembled as he placed the emblem in Leylin’s hands, “I believe you will not tarnish its glory!”\u003c/p\u003e\n\u003cp\u003e“I swear on it!” Sensing that this old man’s life force was already fading, Leylin answered seriously.\u003c/p\u003e\n\u003cp\u003eWhile he already had a wizard for a mentor, Leylin had not abandoned his studies of culture, and Anthony taught him very seriously. It could be said that in these 8 years, the old man had already spent a lot of effort on him.\u003c/p\u003e\n\u003cp\u003e‘What a great teacher!’ Leylin judged inside, but had no plans of helping him. On one hand, he wanted to avoid revealing himself, and on the other, the concepts in the World of Gods were different. In the eyes of believers, death was merely another beginning. With the guidance of a priest, their souls would rise with glory to the land of the gods, where they could live an eternal life.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-795\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-797\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-796","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
