{"id":59357,"no":801,"title":"Chapter 801","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eSpellbook\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eA wizard’s advancement required large amounts of time and energy, and the difficulty of advancing increased the further one walked the path. Two years had passed, and yet Leylin’s ranking as a wizard had only risen by one. However, his speed far surpassed his peers and was a huge motivation for Ernest.\u003c/p\u003e\n\u003cp\u003e“Although I’ll get an additional spell slot after I advance to rank 6, I won’t be able to reach a deeper level of the Weave… What a pity. If not for that I could’ve gotten a rank 3 spell slot and had a greater chance of victory…” Leylin looked at his stats, his eyes full of regret.\u003c/p\u003e\n\u003cp\u003eWizards were ranked based on their achievements with the Weave. Only rank 7 wizards could make contact with the third level, and gain the authority to cast rank 3 spells.\u003c/p\u003e\n\u003cp\u003eSimilar to rank 5 wizards who had just made contact with the second level of the Weave, rank 6 wizards could only use rank 2 spells as well. The difference was that they had greater spiritual force which meant that they had more spell slots. If Leylin could advance once more and have his spiritual force access the third level of the Weave, it would be a great advancement for him. However, his time was scarce.\u003c/p\u003e\n\u003cp\u003eWhen he noticed the question marks behind the rank zero spell slots, Leylin finally beamed. With a complete analysis of the rank 0 Weave, Leylin would never be limited by rank 0 spell slots and wouldn’t even need materials when casting spells. He wouldn’t forget spells either.\u003c/p\u003e\n\u003cp\u003eIt could be said that Leylin could use the Weave anytime he wanted to cast rank 0 spells, and there was no need to prepare things like spell slots.\u003c/p\u003e\n\u003cp\u003eHe had substituted the inflexible spell slots with his own mana, making it the only limit on his casting of rank 0 spells. As long as he had enough mana, he could cast as many rank 0 spells as he wanted.\u003c/p\u003e\n\u003cp\u003e“Perhaps I should prepare a rank 1 or 2 spell and reserve enough spiritual force for casting rank 0 spells…” Leylin muttered to himself. Being able to flexibly use rank 0 spells was the best trump card up his sleeve. If enemies tried to evaluate him based on the ranking system of wizards in the World of Gods, they would be in for a nasty surprise.\u003c/p\u003e\n\u003cp\u003e“I’ll memorise Web for a rank 2 spell, and Animate Rope and Mage Armour for rank 1. That would save me a lot of spiritual force…”\u003c/p\u003e\n\u003cp\u003eLeylin had an advantage in this aspect. Wizards prepared their spell slots a day in advance. After a night of restful meditation, most of his spiritual force would have been replenished until it was almost full. As a result, he could use more of his spiritual force. While he could only use rank 0 spells, it wasn’t half bad…\u003c/p\u003e\n\u003cp\u003eLeylin was flipping through an ancient spellbook. It was made of the leather from some animal skin; there were even traces of scales on it. Powerful magic emanated from the tome. This was something Ernest had passed on to Leylin, a spellbook containing multiple low-ranked spells. Ernest himself used it quite often.\u003c/p\u003e\n\u003cp\u003eWizards always forgot their spells. Once they stored one in a spell slot, all memories relating to it would become fuzzy, even vanish. It was necessary to relearn them again and again. Hence, a spellbook that recorded all the spells the knew became extremely important. In many situations, spellbooks were wizards’ most valuable items.\u003c/p\u003e\n\u003cp\u003eThis specific spellbook had been given to Leylin by Ernest, and had been made of the skin of a landwyrm. It was worth hundreds of gold coins.\u003c/p\u003e\n\u003cp\u003eThe paper in the spellbook seemed rather new, and did not match with the old cover.\u003c/p\u003e\n\u003cp\u003eErnest had clearly taken the advantage to remove the spells he had recorded in there. Wizards recorded the spells that they were proficient in inside the spellbook, and it was a very important task for them to accomplish. This was something that they could not commission others to complete for them.\u003c/p\u003e\n\u003cp\u003e“Web, Animate Rope, as well as Mage Armour…” Leylin flipped through the spellbook and quickly found the relevant information.\u003c/p\u003e\n\u003cp\u003eLeylin placed less emphasis on spellbooks than other wizard. The A.I. Chip itself was a comprehensive collection of spellbooks, and the efficiency at which it transmitted spells to his memories far exceeded that of studying from paper.\u003c/p\u003e\n\u003cp\u003eMost of the time Leylin spent on this book was just to deceive Ernest or use it to learn spells. He could then compare the spells to those from the Magus world, appreciating the difference in the power of laws within them.\u003c/p\u003e\n\u003cp\u003eWith his finger stroking a looping spell rune, Leylin immersed himself in the analysis of the spells.\u003c/p\u003e\n\u003cp\u003e“Compared to the spells of the Magus World, the magical circuits and nodes here are very simple. Wizards have to go through the Weave first, and it’s impossible to compare the complexity of these two types of spells. Simply put, Magus spell models require spiritual force to form an entire template for the spells, while the spell models here act more like keys…” With Leylin’s powerful learning abilities and memory, there was practically no difficulty in recording spell models here.\u003c/p\u003e\n\u003cp\u003eWithin minutes, the A.I. Chip’s prompt sounded.\u003c/p\u003e\n\u003cp\u003e[Beep! Spells have been stored. Rank 2 spell slot: Web. Rank 1 spell slot: Mage Armour, Animate Rope!]\u003c/p\u003e\n\u003cp\u003eLeylin somehow felt like part of his spiritual force had disappeared. There were now three more nodes on the Weave, which represented the three spells he had remembered. Tomorrow, he could cast them using specific gestures or commands.\u003c/p\u003e\n\u003cp\u003e“Besides the convenience and speed, the plus point for wizards here is only that the requirements are less stringent when compared to Magi…” Once his spiritual force was completely extracted, Leylin found that the memories of the three spell models had disappeared without a trace.\u003c/p\u003e\n\u003cp\u003e‘Damn it, that greedy god!’ Leylin cursed inside in annoyance, but did not dare say it aloud. As a Magus, seeing how the wizards were made use of so thoroughly rendered him furious and frustrated.\u003c/p\u003e\n\u003cp\u003eIn a bad mood, Leylin had no plans of studying the spellbook further. He instead sent a command out in his mind, ‘A.I. Chip, prepare for transmission of spell models: Web, Mage Armour, and Animate Rope!’\u003c/p\u003e\n\u003cp\u003e[Beep! Mission established. Beginning transmission…]\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip loyally carried out Leylin’s instructions, and soon enough Leylin found information related to these three spell models in his mind. The A.I. Chip raised his learning speed unfathomably.\u003c/p\u003e\n\u003cp\u003e“I’ll probably have to endure this cycle of preparing ammunition and enduring exploitation for a long while,” Leylin looked dejected, but he quickly sorted out his feelings, “Preparations of the spell slot are complete. I can try a counterattack now. Before that, I still have to take care of the matter with the god of knowledge…”\u003c/p\u003e\n\u003cp\u003eAfter Leylin checked the strength he possessed, he began to assess other issues.\u003c/p\u003e\n\u003cp\u003e‘Bishop Tapris must have gotten information somewhere, but he might not be trying to eliminate our Faulen Family. After all, our family is made up of followers of the god of knowledge, and if they swapped another family in here, they might not be more suitable than us. However, it’s obvious that he’s trying to nudge us… We’ll need to yield for now and gain support from the church…’\u003c/p\u003e\n\u003cp\u003eAll sorts of possibilities and sudden events flowed before Leylin’s eyes, the future revealing itself before him. The dim yellow light from the oil lamp stretched his shadow further and further…\u003c/p\u003e\n\u003cp\u003eSoon enough, it was the day of the celebration at the god of knowledge’s church. Leylin was clad in a fitting attire with an armless leather breastplate inside. There were two spell scrolls in there as well. It was not that the Faulen Family lacked better metallic armour, but metal often interfered with the flow of magic for wizards, causing their spell casting to fail. Unless they found precious metals like mithril or adamantine, wizards would not use metal tools.\u003c/p\u003e\n\u003cp\u003e“Morning, Cousin Isabel!” Leylin found a surprising figure at the entrance to the manor.\u003c/p\u003e\n\u003cp\u003e“Morning, Cousin Leylin!” Isabel was still wearing that tight-fitting armour. Coupled with her perfect body, she emitted a sense of attractiveness and danger.\u003c/p\u003e\n\u003cp\u003eIn reality, ever since their last meeting, Isabel had stayed hidden in her room. She had become very reclusive, and besides a few banquets this was the first time Leylin was truly seeing her.\u003c/p\u003e\n\u003cp\u003e“Are you going to the church of knowledge at the port?” Isabel rested against the doorframe, black sheath touching the ground, “It’s rather dangerous out there now. I want to go with you!”\u003c/p\u003e\n\u003cp\u003e“That’s my overbearing cousin!” It was only at this moment that Leylin felt his childhood playmate had returned.\u003c/p\u003e\n\u003cp\u003e“But!” He stepped forward slightly, causing Isabel to subconsciously grab the hilt of her sword. “I can handle these trivial matters myself!”\u003c/p\u003e\n\u003cp\u003eSeeing how she was prickly like a porcupine and was resisting the urge to draw her sword, Leylin wanted to laugh. While he would like to draw closer, it was not the time to give her more stress.\u003c/p\u003e\n\u003cp\u003e“Let’s go!” Leylin jumped onto the carriage. The one driving it was the rank 6 warrior Jacob, and along with his skilled shouts and the sounds of whipping, the carriage marked with the Faulen Family’s crest slowly went on its way.\u003c/p\u003e\n\u003cp\u003e“You idiot!” Behind him, Isabel was stamping her feet in annoyance, while a small blush appeared on her face.\u003c/p\u003e\n\u003cp\u003e“While my cousin has become very threatening towards strangers, she’s still the same person who is warm on the inside like before. Good…” In the carriage, Leylin laughed lightly. “But there seems to be some huge issue with her, especially that evil power. If it isn’t solved, I’m afraid…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-800\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-802\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-801","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
