{"id":59358,"no":802,"title":"Chapter 802","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eCelebration\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eLively streams of people filled the bustling pier. The air was filled with the smell of sea and rum.\u003c/p\u003e\n\u003cp\u003eAs the horse carriage entered the port, Leylin watched the busy scene outside through a little window within. Sailors, farmers, soldiers, adventurers, and all sorts of people entered his sights. They were quickly classified, marking those who had decent strength and harboured malicious intent.\u003c/p\u003e\n\u003cp\u003eAs he had been immersed in the study of magic, Leylin rarely came out from the manor, much less came to this area. ‘It seems like the Faulen Family has managed this place extremely well; it even surpasses my expectations. It’s understandable that someone might covet this place.’\u003c/p\u003e\n\u003cp\u003eLeylin glanced towards the group next to the crossroad. A wandering bard was now performing there, and he could not help but exclaim in his surprise. “Hm? There are even bards wandering around!”\u003c/p\u003e\n\u003cp\u003eBards in the World of Gods weren’t just street performers. They were usually spies that were primarily responsible for probing for intel, or they made a living out of selling information. Most importantly, they were usually very powerful.\u003c/p\u003e\n\u003cp\u003eWith how much the Faulen Pier was flourishing, quite a few bards had come forth to perform or on vacation.\u003c/p\u003e\n\u003cp\u003e“Jacob, what’s the name of that bard? How long has he been here for?” Leylin enquired.\u003c/p\u003e\n\u003cp\u003e“That one? I heard that he’s called Xuno and comes from the faraway Northern Lands. His poems are always very pleasant to listen to and there are always interesting stories. The baron was even thinking about inviting him to perform in the manor some time ago…” Jacob answered quickly.\u003c/p\u003e\n\u003cp\u003eThe commoners here quickly gave way and presented their greetings to the authority that managed the island and port. Sitting in the middle of the horse carriage, Leylin was however unperturbed by everyone’s reverence and instead furrowed his brows, “There are far too many people here, and yet the frequency at which the patrol appears is too low…\u003c/p\u003e\n\u003cp\u003e“Jacob, how much strength does our family have?”\u003c/p\u003e\n\u003cp\u003eJacob froze for a moment, surprised by Leylin’s question. “Are you referring to the patrol, young master?”\u003c/p\u003e\n\u003cp\u003eHowever, for someone like him who had once been the commander of this place, Jacob knew the situation with the patrol very well. “We have two groups here that come up to a hundred people total. They’re all great little guys with good strength.”\u003c/p\u003e\n\u003cp\u003e“Great little guys? Good strength? That means there aren’t any with exemplary strength, and they are only able to suppress those sailors and thieves?” Leylin grew speechless, “Out of this hundred, how many have professions? How much armour do we have? And long-range weapons such as crossbows?”\u003c/p\u003e\n\u003cp\u003eIn the World of Gods, where exemplary powers were suppressed to the utmost, armour and weapons were a huge factor when it came to strength. Troops with great equipment and training would find no trouble dealing with those with professions below rank 5. If there were enough of them, even those at rank 10 and below did not dare go head to head with soldiers.\u003c/p\u003e\n\u003cp\u003eOf course, after rank 10, numbers would not be enough to make up for the lack of quality.\u003c/p\u003e\n\u003cp\u003e“Professions? Armour? Crossbow?” Jacob’s surprised voice sounded in front of him.\u003c/p\u003e\n\u003cp\u003e“What? We don’t have them?” Leylin sighed.\u003c/p\u003e\n\u003cp\u003e“Professions? The leaders of those two groups are retired military officials that the baron recruited. They’re low ranked warriors who haven’t even been certified to rank 5. As for armour, those who are vice leaders and above all have one set, and there are a total of twelve. And crossbows… Our patrol doesn’t have equipment like that, though there seem to be a few stored in the manor…” Jacob looked a little flustered as he spoke.\u003c/p\u003e\n\u003cp\u003e“Too little, it’s much too little! This is too weak…” Leylin seemed to be complaining.\u003c/p\u003e\n\u003cp\u003e“Young Master, why do you say so?” A look of surprise appeared on Jacob’s face, “A Baron has over a hundred elite troops. Even in the kingdom, that power is equivalent to what a viscount can have… In order to bear the costs of this group, the baron throws in a large amount of his earnings…”\u003c/p\u003e\n\u003cp\u003e“Baron… this…” Leylin had a sudden realisation. The Faulen Island was a newly developed territory with no population. It was difficult to even get farmers to plow the lands here, not even considering recruiting troops.\u003c/p\u003e\n\u003cp\u003eIf not for the Faulen Island being on an isolated piece of land, having to deal with numerous vicious pirates, Baron Jonas would long since have halved the number of troops here. In order to recruit enough people, there was no way but to hire them by offering large amounts of money, and he probably had to take care of their food and their families.\u003c/p\u003e\n\u003cp\u003eWhile the barons in the Dambrath Kingdom could have many troops, they never had so many unless it was wartime due to the great costs.\u003c/p\u003e\n\u003cp\u003eIf not for the benefits from the trade, the Faulen Family would long since have gone bankrupt due to the army.\u003c/p\u003e\n\u003cp\u003e“The rise of a noble family is truly difficult…” Leylin sighed inside. The father of this body had gone through hundreds of battles, and with difficulty obtained this uninhabited island as his territory. With his hard work over half his life, Baron Jonas finally made this area a little popular, yet now his work was immediately coveted.\u003c/p\u003e\n\u003cp\u003e“If all of the hundred were to have equipment…” Leylin calculated it. Creating armour was extremely expensive in the World of Gods, and a complete set could even be a knight’s treasure passed on through generations. The value was equal to even a small manor. If modified by magicians or blessed by priests, the armour’s price would be even more terrifying and perhaps comparable to a city!\u003c/p\u003e\n\u003cp\u003e“It’s not practical to change the armour of the patrol, but I can think of something when it comes to their weapons. At the very least, they can’t use rusted metal...” Leylin sighed and clutched at his forehead.\u003c/p\u003e\n\u003cp\u003eHe was no longer in his original body, where he was exceedingly wealthy. In the World of Gods, he spent only a few gold coins every month, and most of it was spent on spell materials.\u003c/p\u003e\n\u003cp\u003e‘There are ways for low-ranked magicians to earn money, but that’s mostly labour from copying spells or brewing low-ranked potions. There’s not enough time… Sigh, in the World of Gods, the small nobles don’t do that well. Only the churches are truly wealthy. The paladins of the church of the Goddess of Singing Waters all had a full set of metal armour, and some even had been blessed with divine spells…’\u003c/p\u003e\n\u003cp\u003eLeylin could not help but think back to what he had seen before as a soul seed. The wealth of the churches of the gods were renowned in the continent, especially that of the Goddess of Wealth. It was said that their headquarters had been built with gold and silver, and even the ground was paved with gold bricks. Leylin, who was going insane over his poverty, had even decided to steal everything once he made his mark on this world.\u003c/p\u003e\n\u003cp\u003e“Then… Can I use them?” Suppressing the immoral thoughts he had, Leylin asked Jacob who was outside.\u003c/p\u003e\n\u003cp\u003e“Of course! As the next-in-line of the Faulen Family, the young master’s wish is our command!” Jacob answered resolutely, “Do you need me to send down the signal?”\u003c/p\u003e\n\u003cp\u003e“No, there’s no need to for now. I want to go to the church of knowledge, and it shouldn’t be too dangerous. Tell them…” Leylin spoke apathetically.\u003c/p\u003e\n\u003cp\u003eHe added some more words on the inside, ‘You’re useless against priests or holy warriors. On top of that, few would be willing to fight against the church and god they believe in.’\u003c/p\u003e\n\u003cp\u003eAfter Leylin was done with his instructions, the carriage once more sank into silence. He did not continue speaking and only judged the terrain and buildings outside curiously.\u003c/p\u003e\n\u003cp\u003eAs the carriage reached a spacious area, Jacob’s voice was heard, “Young Master, we’ve reached the Knowledge Shrine!”\u003c/p\u003e\n\u003cp\u003eLeylin looked outside the window. The streets were clean and tidy, and the passersby were very cultured. Whether it was farmers or soldiers walking past, all would control their footsteps such that they were softer, appearing prudent and reverent. Put next to the bustle and chaos at the port, the two were practically worlds apart.\u003c/p\u003e\n\u003cp\u003eA lofty and majestic church emitted dazzling light through the carriage. The churches of the gods were always constructed splendidly, being beautiful and solemn,\u003c/p\u003e\n\u003cp\u003e“O god of knowledge…” Many voices could be heard saying their prayers.\u003c/p\u003e\n\u003cp\u003eAs this was a day of celebration, many followers of the god of knowledge had congregated here. The spacious floor was crowded with people.\u003c/p\u003e\n\u003cp\u003eIn order to worship the god of knowledge, Jonas had dedicated the best section of land on the port and did not accept even a copper coin. In the eyes of the priests however, this was a given.\u003c/p\u003e\n\u003cp\u003e“Seems like the ‘cultured people’ of the port are here!” Leylin sighed as he rubbed his face, changing his expression to a sunny one.\u003c/p\u003e\n\u003cp\u003e“Young Master Leylin!”\u003c/p\u003e\n\u003cp\u003e“Welcome, welcome!” “My, look who’s here!”\u003c/p\u003e\n\u003cp\u003eMany familiar faces crowded around. They included his uncles and aunts, and he had no choice but to smile and greet them one by one.\u003c/p\u003e\n\u003cp\u003eWith Anthony as his mentor, Leylin had no faults when it came to his manners. What he showed off was his most perfect image as the next-in-line of a noble family, and everyone sang his praises.\u003c/p\u003e\n\u003cp\u003eThe price, however, was that after the many greetings Leylin found his facial muscles had begun to stiffen, and much time had passed.\u003c/p\u003e\n\u003cp\u003e‘I know this is troublesome, but it’s necessary. Nobles…’ Leylin sighed as he entered the large shrine and threw a small bag of gold coins into the donation box. The pot-bellied priests beamed in reply.\u003c/p\u003e\n\u003cp\u003eLeylin looked around. The ornamentation of Oghma’s church wasn’t half bad. There were bookshelves and statues all around, and it was filled with a scholarly atmosphere…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-801\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-803\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-802","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
