{"id":59410,"no":854,"title":"Chapter 854","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eChange in Events\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“My lord, Ilmater’s bishop has fallen!” The high-ranked assassin respectfully reported to the people next to him.\u003c/p\u003e\n\u003cp\u003e“You did well!” Beside him was evidently the bishop of the God of Murder at Pirates’ Cove. At some point in time, he had come to the Baltic archipelago and hidden himself in the shadows, killing the regional bishop of the God of Suffering.\u003c/p\u003e\n\u003cp\u003e“Master, please accept this offering from your humble servant!” Seeing a broken ray of light amidst the sea of fire, the bishop of the God of Murder flushed as he knelt and began to pray. This light belonged to the church of suffering.\u003c/p\u003e\n\u003cp\u003eA pair of powerful eyes focused on this area, strong enough for even the high-ranked assassin to sense. This was the strength of the god that he believed in, of Cyric the God of Murder!\u003c/p\u003e\n\u003cp\u003eHis eyes filled with elation, and the radiance of divine force flickered into existence.\u003c/p\u003e\n\u003cp\u003e‘Grace of the Gods! It’s the grace that will raise his ranking permanently!’ The high-ranked assassin saw the light shining on the bishop’s body, as well as the increase in his aura. The bishop’s eyes burnt with more fervour as he began to pray silently, “Dear master Cyrik, you are…”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe unrestrained acts of the pirates continued for several days. The Scarlet Tigers and Barbarians acted separately, conducting surprise attacks on all of the Baltic archipelago’s ports and cities. There were also other ‘fake’ pirates mixed in, following their bosses as they wreaked havoc while robbing all that was in front of their eyes. This was a feast for pirates!\u003c/p\u003e\n\u003cp\u003eCyric’s priests seemed to be acting from the shadows in these outrageous events, apparently with the God of Murder’s divine force mixed in. It made it seem like there really was a conspiracy afoot.\u003c/p\u003e\n\u003cp\u003eIt was even said that the chaos and massacre here had attracted the attention of demons and devils from the abyss. Someone had personally witnessed their marks on the ruined corpses from the calamity.\u003c/p\u003e\n\u003cp\u003eThis immediately caused concern in the Dambrath Kingdom. An investigation team formed of elite priests and paladins of the God of Justice Tyr swore to find the main culprit and punish them.\u003c/p\u003e\n\u003cp\u003eAccompanying the investigative team was a special envoy sent by the king, responsible to confirm the survival of the descendants of the Golden Thornblossom family, as well as the cause of Marquis Louis’ death. Of course, that was all a front. What truly attracted one’s attention was the Baltic archipelago and the fertile territories on the seas.\u003c/p\u003e\n\u003cp\u003eIt was a pity that they were destined to be disappointed. After the pirate attack, the Baltic archipelago had lost over 50% of its population and much of its amassed wealth. The other ports and cities were burnt to nothing, turning into dead regions no merchants were willing to go to.\u003c/p\u003e\n\u003cp\u003eTrading in the outer seas had begun to shift towards other noble families’ islands. The Faulen Island obviously got the most out of it, and began to develop rapidly. It even began to try taking over the spaces that Marquis Louis had left behind, laying its hands on the slave trade.\u003c/p\u003e\n\u003cp\u003eLeylin had now assembled his subordinates on the Scarlet Tiger ship, announcing a decision.\u003c/p\u003e\n\u003cp\u003e“I plan to leave for a while, I plan to travel the continent.” Leylin looked solemn as he saw his trusted aides in the captain’s room. This was a decision he had made after careful deliberations.\u003c/p\u003e\n\u003cp\u003eThere was no way around it. He had gone too far this time, and it was necessary that he hide it out for a while. In addition, the outer seas were now gaining even more attention from even the gods. It was truly an unsuitable area for him to continue keeping a low profile.\u003c/p\u003e\n\u003cp\u003e“After I leave, the Scarlet Pirates will be under Isabel’s command. You must listen to her as you do me, is that understood?” After all the members left, Leylin made Isabel stay behind.\u003c/p\u003e\n\u003cp\u003e“Are you really leaving?” Isabel gazed at Leylin’s handsome face, looking reluctant.\u003c/p\u003e\n\u003cp\u003e“I’ve no choice! While everything might seem great with us now, we still need to be cautious!” Leylin’s eyes were on Isabel as he began to instruct her, “I’ve already completely broken off relations between the Scarlet Tiger pirates and the family. I’ve even killed off all the disloyal ones, so it should be fine for you to take over. As long as neither of us are caught, it’s impossible to get real evidence!”\u003c/p\u003e\n\u003cp\u003eThe only connection between the Faulen Family and the Scarlet Tigers was Leylin. Without him there, the investigators could only watch helplessly. The churches and the kingdom naturally still needed evidence to act openly.\u003c/p\u003e\n\u003cp\u003e“And though the Barbarians have parted ways with us, I’m not worried about them. We have power on the surface!”\u003c/p\u003e\n\u003cp\u003e“Power on the surface?” Isabel looked doubtful.\u003c/p\u003e\n\u003cp\u003e“Yes. After I get back, I’ll suggest that Father build a military fleet of our own. This is something pirates will never be able to do.” Leylin’s eyes flickered with extraordinary intelligence.\u003c/p\u003e\n\u003cp\u003e“There are only two sides of the outer sea, the light and the dark. In the dark, there’s the Scarlet Tiger pirates contending with them, but they can’t do anything against us in broad daylight. After all, commerce will never be able to match up to the power of nobility! With this advantage, we’ll definitely be able to suppress them, turning into the next Marquis Louis and gaining supremacy in the outer seas!”\u003c/p\u003e\n\u003cp\u003eLeylin shared his complete development strategy, “Do you understand what I’m saying?”\u003c/p\u003e\n\u003cp\u003e“We just have to make our foundations stable?” Isabel was intelligent.\u003c/p\u003e\n\u003cp\u003e“Yes, it’s all about stability! Once we completely take over the outer seas, the churches won’t be able to do anything even if they know about our actions.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Isabel was astonished.\u003c/p\u003e\n\u003cp\u003e“It’s power!” Leylin waved his hands, “As long as the outer seas are under our control, the churches can’t put us on trial even if they know we’ve sinned. They have to spread their own faith as well.”\u003c/p\u003e\n\u003cp\u003eWith his abundant life experience, what could Leylin not see through?\u003c/p\u003e\n\u003cp\u003e“Look. Even if Marquis Louis was involved in the sinful slave trade, with his hands dipped in blood, he had control over the profits in the outer seas and had close relations with the kingdom. Even a priest of the God of Justice couldn’t put him on trial!”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes blazed with ambition, “As long as we’re superior on the outer seas, those churches will only be able to lower their heads to us!”\u003c/p\u003e\n\u003cp\u003eObviously, Leylin had failed to mention something. At the beginning, they could learn to do what Marquis Louis had, but after that, there had to be changes. He already had a plan for that.\u003c/p\u003e\n\u003cp\u003eIn order to control the outer seas, his own strength was also vital. He believed they needed a Legend in charge at the minimum, but if everything went according to plan it was still feasible. By the time his family had gotten to that point, he’d have become a Legend himself.\u003c/p\u003e\n\u003cp\u003eThis was the realm of Legends, people who had a say in the entire World of Gods! After all, the gods couldn’t descend to the prime material plane in their own bodies, only able to do so through incarnations that weren’t much stronger than high-ranked Legends.\u003c/p\u003e\n\u003cp\u003eOf course, Leylin only had the guts to do this in the outer seas, where the gods’ organisations were frail. Otherwise, he would just be seeking his death!\u003c/p\u003e\n\u003cp\u003e“With those pirates in the middle being scapegoats for us, the churches won’t go after us right away. Our Scarlet Tiger pirates must be aware of this!” Leylin estimated that the Barbarians would not grow hostile to them right away. Instead, they would absorb the surrounding pirates and increase their strength.\u003c/p\u003e\n\u003cp\u003eFor this reason, however, they would attract even more attention, and unknowingly take the brunt of it from the Scarlet Tigers. Meanwhile, the Scarlet Tigers would keep a low profile and amass more power, waiting for an opportunity to rise.\u003c/p\u003e\n\u003cp\u003eOnly after his plans were completely explained did Leylin leave, feeling at ease. Seeing Leylin’s figure flying in the horizon and turning into a black spot that eventally disappeared, Isabel turned with an icy look on her face.\u003c/p\u003e\n\u003cp\u003e“Gather all the leaders. We are to hide in the deep seas for a period of time!”\u003c/p\u003e\n\u003cp\u003e“Understood!” Ronald shrank back. He had a feeling that after the head left, the “Scarlet Witch” that struck the outer seas with terror would return.\u003c/p\u003e\n\u003cp\u003eRonald was aware that she would not make allowances for anyone else, destroying anyone she caught. He did not dare complain and jogged away from the deck.\u003c/p\u003e\n\u003cp\u003eWith Isabel pressurising them, the Scarlet Tigers pirates carried out Leylin’s plans exceedingly well, hiding in the deep sea.\u003c/p\u003e\n\u003cp\u003eDambrath only held a small portion of the outer seas, and the further out one went the more dangerous it was. It was rumoured that there was a country of aboriginals at the depths of the sea, protected by the gods. Of course, this was just a rumour.\u003c/p\u003e\n\u003cp\u003eThe Scarlet Tigers’ actions wisely allowed them to evade a round of unrest. The organisations of the outer sea and the enraged nobles of the Dambrath Kingdom combined forces with the church, beginning a new round of purging the outer sea pirates. Even the navy was employed.\u003c/p\u003e\n\u003cp\u003eThe priests and paladins of the God of Justice could be seen roaming around at this point. The pirates that had just started to get arrogant were put in a tough spot as they were stabilising themselves. Many were exterminated, and even the Barbarians suffered huge losses with no choice but to do things on the sly.\u003c/p\u003e\n\u003cp\u003eWhatever it was, the sea was vast. The Dambrath Kingdom had no way to maintain the huge expenses of the navy, and this could only terrorise the region for a while. After the navy left, this would still be the pirates’ territory!\u003c/p\u003e\n\u003cp\u003eThe reshuffling from this new round continued. The Faulen Family would make use of their status as nobility, trading their two profitable goods into becoming the hub of the outer seas. Of course, that was all in the future.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-853\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-855\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-854","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
