{"id":59411,"no":855,"title":"Chapter 855","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eEmon City\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eEmon was a port city along the coast of the Dambrath Kingdom. It relied on the flourishing trade of the outer seas to develop, and at one point had over ten thousand free citizens making up its society. The lights never went out at night, and it created the image of prosperity.\u003c/p\u003e\n\u003cp\u003eHowever, the Pirates’ Tide in the outer seas, especially after the ransacking of the Baltic archipelago, stopped the sea trade for a while. Many small merchants had even committed suicide in the sea out of bankruptcy, leading to a further decline in prosperity.\u003c/p\u003e\n\u003cp\u003eThis was all until one day, when a young man in grey robes came to the city gates.\u003c/p\u003e\n\u003cp\u003e“Entry fee is a copper coin!” As they had been standing guard here for a long time, the two guards had developed great insight. Noticing that this young man was not to be messed with, they did not create much trouble. After handing over the fee, the young man entered Emon City.\u003c/p\u003e\n\u003cp\u003eThe city’s roads were desolate, with guards patrolling everywhere. Since this was a port on the sea, there was a theoretical chance of pirate attacks, and those timid aristocrats and nobles were scared stupid by the Pirates’ Tide, increasing the city’s security. Most of them had probably hidden themselves further inside the mainland by now.\u003c/p\u003e\n\u003cp\u003e“I’ll probably need to go the Mercenary Guild later!” After finding an inn, the young man slipped his hood off, revealing curly hair that was as dazzling as gold and a handsome face.\u003c/p\u003e\n\u003cp\u003eThis was obviously Leylin. After taking care of all the matters and handing over all sorts of materials to Ernest, causing him to go giddy in his ecstacy and begin construction of a wizard’s tower, Leylin openly left Faulen Island, taking a ship to the continent.\u003c/p\u003e\n\u003cp\u003eOf course, this was in the name of travel and learning, something that was a matter of course for wizards. He currently held a recommendation letter from Ernest in his lap, something that would allow him to train in the capital’s Wizards’ Guild for a while.\u003c/p\u003e\n\u003cp\u003eLeylin had intended this trip for a while, there was nothing that Ernest could teach him anymore. And with Boruj’s bag of holding, he could now move about with more ease. 10 cubic metres of space was huge, and he could put his tent, rations, and essentials inside it, making things less difficult for him.\u003c/p\u003e\n\u003cp\u003eAfter getting on the coast, Leylin was like a drop of water that disappeared into the river of people. Things were rather sensitive right now, and he did not want to cause any trouble.\u003c/p\u003e\n\u003cp\u003eTravelling at this point was a very troublesome matter. If he lacked proof of free citizenship from the city hall or some other documents like that, he’d be treated like a runaway slave or indentured farmer. The rest of his life would be spent in jail or bankruptcy.\u003c/p\u003e\n\u003cp\u003eOf course, if he showed his proof of nobility, all cities would leave their doors wide open for him. But he wasn’t foolish enough to do that.\u003c/p\u003e\n\u003cp\u003eIf he became a mercenary, he would be able to move about with no obstruction in most areas, though the guards would roll their eyes at him. Mercenaries who broke order were one of the most headache-inducing issues for security officials.\u003c/p\u003e\n\u003cp\u003eThe Mercenary Guild was located by the Warriors’ Guild, one of their requirements was that one was a Professional.\u003c/p\u003e\n\u003cp\u003eOf course, this wasn’t too hard. If he trained for many years, could use a few weapons proficiently and had a certain amount of experience, he could easily be certified as a rank 1 fighter.\u003c/p\u003e\n\u003cp\u003eLeylin entered the Warriors’ Guild that was guarded by two burly warriors, in the distance seeing shrines to the gods of warriors and war. There were even a few resident priests in the guild, overseeing everything. They were in charge of healing injuries, even though it obviously came with a price.\u003c/p\u003e\n\u003cp\u003eBehind the Warriors’ Guild were a few bigshots. Without their support both on the surface and in the shadows, it would have had no chance to spread throughout the continent. Since warriors were the most common Professionals amongst the many races, becoming one did not require much talent.\u003c/p\u003e\n\u003cp\u003e“Is this Mister’s first time here?” After seeing Leylin’s entrance, a maid welcomed him while watching him with a strange look.\u003c/p\u003e\n\u003cp\u003eAfter all, most warriors were muscled, and it was rare to see people like Leylin.\u003c/p\u003e\n\u003cp\u003e“Yes. I would like to apply for the fighter test!” Though the Wizards’ Guild was more suitable for him, and being a wizard would gain him more respect, Leylin was here to stay out of trouble. He naturally wouldn’t do that. He was not even planning to use the recommendation letter Ernest had given him.\u003c/p\u003e\n\u003cp\u003e“Please come with me!” The maid brought Leylin to the second level of the guild. There were many little rings here, where warriors were fighting hand-to-hand or battling it out. While they were using wooden swords, people would still get injured.\u003c/p\u003e\n\u003cp\u003eAt this moment, a priest that had been waiting at the side would be useful.\u003c/p\u003e\n\u003cp\u003e“Please register first. May I know which rank would you like to take the test for?”\u003c/p\u003e\n\u003cp\u003eAs if afraid that Leylin did not understand well and because of his face, the maid explained to him enthusiastically, “Our tests here are conducted based on varying levels of strength. You’ll need to fight against a similarly-ranked or two lower-ranked opponents for a period of time to be able to pass the test, and there are often casualties…”\u003c/p\u003e\n\u003cp\u003e“Thank you for your good intentions. I’ll do what I can!” Leylin came to a counter and put in his particulars, filling up the form.\u003c/p\u003e\n\u003cp\u003e“Let’s see. Your name is Ley, you’re 18, and you want to take the test for a rank 5 warrior?” Sitting at the counter was a withered old man. He lifted his glasses and looked at Leylin, who was outside, “Young man, don’t try to push yourself too far. A rank 5 warrior can already use their qi, and some have even grasped battle techniques. You could maybe try rank 3…”\u003c/p\u003e\n\u003cp\u003e“What? You’re choosing the rank 5 test?” The maid looked astonished, her sharp voice causing surrounding people to gather around and watch.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you listen to me?” The maid stamped her feet, pretty flushes appearing on her cheeks.\u003c/p\u003e\n\u003cp\u003e“I’ve already made up my mind, I’ll do this!” Leylin furrowed his brows. While he had lied about his age, this was still shocking.\u003c/p\u003e\n\u003cp\u003eOf course, it wasn’t that bad. It was much better than being a 16 year old rank 10 wizard, and he then nodded, “Please accept this application.”\u003c/p\u003e\n\u003cp\u003e“The application fee is 10 copper coins!” After Leylin paid up, the old man sighed helplessly, “Teenagers these days…”\u003c/p\u003e\n\u003cp\u003e“Interesting! I haven’t seen such an interesting kid for a long time! Let me be his opponent!” A forthright voice sounded out, and immediately after a burly man who was two heads taller than average pushed the crowd away as he walked over. His upper body was naked, the muscles solid like granite. There were several scabs from blades on his face, emanating red light that made him seem more menacing.\u003c/p\u003e\n\u003cp\u003e“It’s the Bone Shatterer, Fafnir. This guy’s in for it!”\u003c/p\u003e\n\u003cp\u003e“It’s rumoured that he’s a savage person who likes to pinch and shatter his opponent’s bones. Why’s he suddenly causing trouble for a kid?”\u003c/p\u003e\n\u003cp\u003e“It should be for a woman, right? He’s been interested in Nina for a long time!” This immediately caused the maid to blush beet red, “Fafnir, what are you doing?”\u003c/p\u003e\n\u003cp\u003e“Nothing much. I’m a rank 5 warrior anyway, so isn’t it normal for me to be an examiner? Am I wrong?” Fafnir watched Leylin, a malicious smile on his face.\u003c/p\u003e\n\u003cp\u003e“What about it?” He looked at the old man at the counter.\u003c/p\u003e\n\u003cp\u003e“You can give up on this test and come back tomorrow,” The old man sighed. He probably did not want to see a young man like Leylin having such a great setback.\u003c/p\u003e\n\u003cp\u003eLeylin was speechless inside. He hadn’t expected to meet such a vulgar person.\u003c/p\u003e\n\u003cp\u003e“It’s fine, he’ll do.” Wait till tomorrow? He didn’t have that much time to waste.\u003c/p\u003e\n\u003cp\u003e“I won’t worry about you anymore!” This nonchalant attitude resulted in Nina leaving while fuming in anger. Meanwhile, a crisp explosion could be heard produced from Fafnir’s hands.\u003c/p\u003e\n\u003cp\u003e“Kid, you’re dead meat. I want to pinch and shatter all the bones in your body bit by bit. Hope that you won’t hurt bad enough to call for your mother…” While brushing past him, Fafnir looked at Leylin and made a gesture as if slitting his throat.\u003c/p\u003e\n\u003cp\u003e“Don’t worry. Isn’t there a priest? I actually hope you brought enough money…” Leylin rolled his shoulders and picked up the long sword used for the testing.\u003c/p\u003e\n\u003cp\u003eAs it was wooden, the handle was very light. However, there was a layer of metal on the blade that made it seem more durable.\u003c/p\u003e\n\u003cp\u003eThe two slowly walked into the ring, and the judge then waved his right arm downwards. “Ready? Begin!”\u003c/p\u003e\n\u003cp\u003e“Destroy him, Bone Shatterer!”\u003c/p\u003e\n\u003cp\u003e“I’m supporting you, kid. Hang on!” The other bored warriors immediately began to jeer, and a few got the bets going, on how many moves Leylin could take from Fafnir.\u003c/p\u003e\n\u003cp\u003eNina reappeared in the audience, watching the centre of the site anxiously.\u003c/p\u003e\n\u003cp\u003e“Kid, repent in hell!” Fafnir yelled as he charged.\u003c/p\u003e\n\u003cp\u003eThis speed and technique was far from what Jacob had at the beginning, and Leylin could only shake his head inside. However, he did need to conceal his strength too, and he only dodged ‘by a hair’s breadth’, sword swinging onto his opponent’s shoulder.\u003c/p\u003e\n\u003cp\u003e“Stop wasting time! I’ve things to do!” A faint layer of qi emanated from Leylin’s body.\u003c/p\u003e\n\u003cp\u003e“It’s qi! This guy’s already activated qi!!” The onlookers exclaimed.\u003c/p\u003e\n\u003cp\u003e“This kid’s not bad!” Fafnir immediately began to get serious, and he wrapped himself up in these rays as well. An opponent who had already activated qi was not so easily defeated.\u003c/p\u003e\n\u003cp\u003e“Battle technique: Shatter Bones!” He accelerated, charging towards Leylin.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-854\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-856\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-855","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
