{"id":59412,"no":856,"title":"Chapter 856","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eMercenary\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Fafnir actually used a battle technique!” The audience all exclaimed.\u003c/p\u003e\n\u003cp\u003e“How boring!” Leylin slipped past the opponent’s slashing while his wooden sword pierced forward.\u003c/p\u003e\n\u003cp\u003e“Battle technique: Charge!” An immense force struck Fafnir, causing his huge body to fly like a sandbag. However, Leylin’s attack hadn’t ended yet. He seemed to turn into a gust of wind, sticking close to the hulking man who was in mid-air.\u003c/p\u003e\n\u003cp\u003e*Crack!* *Crash!* Terrifying sounds of bones shattering were heard. When Fafnir fell, his arms and legs were all twisted at strange angles, and he even fainted.\u003c/p\u003e\n\u003cp\u003e“How is it? Did I pass?” Leylin looked at the judge, who seemed dazed.\u003c/p\u003e\n\u003cp\u003e“Oh. I announce that Ley has passed this test!” He finally said, as if he’d woken from a dream. The surrounding crowd began to make a ruckus.\u003c/p\u003e\n\u003cp\u003eLeylin cared little about this, and he went to the counter. This time the crowd opened up a path automatically, respecting the strong.\u003c/p\u003e\n\u003cp\u003eThe old man chuckled as he asked, “Hehe… I don’t often make mistakes! Kid, any interest in learning here for a period of time?”\u003c/p\u003e\n\u003cp\u003e“No thanks. I still have something urgent to do!” Leylin had seen that this old man was about rank 10 as a warrior. This was pretty good, but he’d almost killed a dozen high-ranked warriors himself on the outer seas.\u003c/p\u003e\n\u003cp\u003e“Alright! Sigh, young people these days…” The old man lethargically flung a copper badge to Leylin, as well as a piece of parchment, “Take it. This is your warrior badge and verification. That’ll be two silver kronas.”\u003c/p\u003e\n\u003cp\u003eThis was slightly too expensive and seemed to be on purpose. However, since he was very efficient, Leylin paid the bill and quickly left.\u003c/p\u003e\n\u003cp\u003eAfter walking out of the warrior guild, Leylin went to the Mercenary Guild next door. The gold behind the counter revealed a professional smile, “Welcome. May I know if you are here to issue a mission or to apply for remuneration?”\u003c/p\u003e\n\u003cp\u003e“I’m here to apply to be a mercenary!” Leylin stated his purpose.\u003c/p\u003e\n\u003cp\u003e“Please go to counter number 3!” Applying to become a mercenary was very simple, and only required proof of one’s Profession. After seeing Leylin’s rank 5 fighter badge, the person in charge of counter 3 happily helped him with the proof of being one.\u003c/p\u003e\n\u003cp\u003eAs a newbie, Leylin had no choice but to become a copper-grade mercenary, which was the lowest rank. Only after completing multiple missions could he advance. However, being verified as a mercenary and Professional. He would be able to enter the large cities in the future.\u003c/p\u003e\n\u003cp\u003eFor Leylin, who looked towards becoming a god, focusing on raising his mercenary ranking was a joke.\u003c/p\u003e\n\u003cp\u003e‘Since my path is now decided, next is go to the Dambrath Kingdom and study at the Wizards’ Guild… Or should I go to another country… It’s said that Moonlight City in the north has a whole set of information on magic. The city owner might even be someone chosen by the Goddess of the Weave, and many of their advanced wizard spells can be compared with the elves. I can consider training there for a while…’\u003c/p\u003e\n\u003cp\u003eInformation on high-ranked spells in this world was highly confidential, and if Leylin wanted to gain this knowledge he would have to enter some large organisations to be acknowledged.\u003c/p\u003e\n\u003cp\u003eOf course, he could also ignore that and focus on raising his wizard ranking first. However, his battle might would then be pitiful. If a high-ranked wizard only grasped a few spells, that would be a disgrace to all of the same rank as him.\u003c/p\u003e\n\u003cp\u003e‘Come to think of it, I wonder if the spell models of varying ranks in the Magus World can be modified to be used in the World of Gods? But the amount of time required for that would be too terrifying…’\u003c/p\u003e\n\u003cp\u003eLeylin had a tentative plan to make the path of Magi available to the World of Gods. It was an all-inclusive path that centered around the truth, and of all the paths to power it was very flexible and adaptable.\u003c/p\u003e\n\u003cp\u003eIt was plausible to conduct research into producing Magi in the World of Gods, people who could cast spells without the Weave. However, that would require a great deal of processing power. Most of the A.I. Chip’s resources were focused on the analysis of the Weave, and in a situation where it had no spare time to run simulations in this area he could only shelve his plans for now.\u003c/p\u003e\n\u003cp\u003e‘Research on casting spells without the Weave is definitely a huge taboo in the World of Gods. I’m afraid I’ll only be able to do something in that field after I become a Legend.’\u003c/p\u003e\n\u003cp\u003eLeylin stroked his chin, ‘But if I’m able to get information on this, even if incomplete, the A.I. Chip’s rate of analysis will be increased by a great amount… I’m sure there were many Magi participating in the Ancient War who had the same thoughts as I do now…’\u003c/p\u003e\n\u003cp\u003eWhile thinking this, Leylin entered the mission hall in the Mercenary Guild. Numerous large fireplaces were blazing in the place, making the hall seem cozy. The many mercenaries were split into their own cliques. Some were drinking and making merry, while others were gazing at the huge mission board at the centre of the hall, discussing things amongst themselves occasionally.\u003c/p\u003e\n\u003cp\u003eThe aroma of strong rum, coupled with that of roasted meat and bread, lingered in Leylin’s nose.\u003c/p\u003e\n\u003cp\u003e“High-grade mission: Purging ogres! Only mercenary groups that are gold-ranked and above may take this on.” This mission was on the top of the board, written in huge bold font. The great rewards caused many mercenaries to drool at the sight, but few dared to go forward.\u003c/p\u003e\n\u003cp\u003e“Yeah! I heard that a bunch of ogres migrated towards one of the main paths to the capital. They’ve already attacked numerous caravans and passersby, it’s no wonder that the rewards are so plentiful!”\u003c/p\u003e\n\u003cp\u003eHearing the surrouding mercenaries whispering amongst themselves, Leylin had a better understanding of the mission.\u003c/p\u003e\n\u003cp\u003e‘An ogre tribe? No wonder it’s a high-ranked mission!’ Leylin nodded inside. The classification of mercenaries was very simple. The lowest was copper, followed by silver and gold. Gold mercenaries were already high-grade and possessed immense experience, and were usually powerful Professionals.\u003c/p\u003e\n\u003cp\u003eAbove gold-rank, was said to be Mithril and Platinum. However, in general, they would not be in such people a small city like Emon City.\u003c/p\u003e\n\u003cp\u003eGold-ranked mercenary groups were powerful troops with numerous gold-ranked mercenaries. Only this level of strength would be effective against an ogre tribe.\u003c/p\u003e\n\u003cp\u003eLeylin looked at the bottom of the mission board. There were many missions to clear ogres out here and there, from the lowest ranked to powerful ogre shamans. All that one was required to do was bring back their ears as proof, and the difficulty was lower. Once in a while, a few mercenaries would go over to discuss before taking on the missions.\u003c/p\u003e\n\u003cp\u003e“A large-scale ogre tribe has more than 200 ogres. The shamans will have bloodlines, with abilities similar to magic. On top of that, the ogres themselves are resistant to magic…” Leylin muttered to himself.\u003c/p\u003e\n\u003cp\u003e“I won’t be able to handle this myself unless I take the long route. However, that’ll consume a lot of time, and I’ll need to pass through a few dangerous regions, and the danger isn’t all that different from the ogre tribes. There are even drake tribes there…”\u003c/p\u003e\n\u003cp\u003e“Seems like I’ll have to wait for some large-scaled mercenary groups to complete missions or join some caravan…” Leylin mumbled to himself. He was preparing to go the capital, and even without Ernest’s recommendation letter, he had enough power to enter the Wizards’ Guild. Over there, he would be able to obtain the newest intel and the like.\u003c/p\u003e\n\u003cp\u003e“On top of that, even if I were to prepare to travel to the north to train, I’ll definitely need to pass through the Dambrath Kingdom…” Leylin sighed. He went to the front desk counter near him belonging to the guild, “Give me cider. Are there any missions soon that will take me to the capital? The best would be those with large groups. I want something safe!”\u003c/p\u003e\n\u003cp\u003eAs he said this, a silver krona appeared in his hand, emitting a tempting light in the air.\u003c/p\u003e\n\u003cp\u003e“Do you have urgent matters to attend to in the capital? That’s no problem at all. A large caravan is going there soon, and they’re recruiting people because of those wretched ogres!” Seeing the light in Leylin’s hands, the attendant gulped and then responded. A tyrant like Leylin obviously gained more abundant and specific details.\u003c/p\u003e\n\u003cp\u003eAfter setting a time with the attendant, Leylin headed to the entrance of the Mercenary Guild. The streets of Emon City were very desolate, probably having to do with the double blow with the sea trade and the ogres.\u003c/p\u003e\n\u003cp\u003eSeeing the many stores that were closed, Leylin was about to return to meditate in his inn when a grey-robed person blocked his way.\u003c/p\u003e\n\u003cp\u003e“Mister, please whip me ruthlessly!” In front of Leylin was a young female in grey robes. She was pretty and was clad in coarse sackcloth clothing, and there were also many scars at her neck and cuffs.\u003c/p\u003e\n\u003cp\u003eCurrently, she was standing in front of him with a look of anticipation, two hands holding a thorny whip. The numerous tiny thorns looked extremely sinister on it.\u003c/p\u003e\n\u003cp\u003eShe looked pure and holy, ready to die for a just cause, and had a resoluteness that only belonged to crazed followers. There was even a hint of anticipation.\u003c/p\u003e\n\u003cp\u003e“What’s with this… a trap?” Leylin’s eyes went past the crazy woman and landed on a little girl next to her. She was holding a donation box of the church, and after noticing his attention was on her, she especially shook the box such that the coins inside made sharp and crisp noises.\u003c/p\u003e\n\u003cp\u003eLeylin saw a strange holy emblem at the little girl’s chest.\u003c/p\u003e\n\u003cp\u003e“So you’re a priest of the Mistress of the Whip!” Thankfully, Leylin had seen much in the world and recognised her identity.\u003c/p\u003e\n\u003cp\u003e“Yes! Please help with our praying ritual and allow my soul to obtain redemption through suffering!” The female answered seriously, and then thrust the whip into his hands.\u003c/p\u003e\n\u003cp\u003e“I… I… I…” Leylin was completely speechless now. He wanted to escape, but the passersby thought nothing of it. Some even looked over with knowing smiles.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-855\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-857\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-856","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
