{"id":59430,"no":874,"title":"Chapter 874","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eTruename\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAfter much consideration, Tim still gave the command. “Let him in!” He met Leylin with a solemn and tragic expression on his face, and was startled by the youthful face before him.\u003c/p\u003e\n\u003cp\u003e“This is the first time we have met, Viscount Tim. However, we have already made many deals in the past. I’m Leylin, Leylin Faulen. Pleased to meet you.”\u003c/p\u003e\n\u003cp\u003e“Get out, all of you!” Tim rudely chased his subordinates out, and fiercely shut the door and windows. Leylin was even considerate enough to add a magical protective screen.\u003c/p\u003e\n\u003cp\u003e“I’ve already done as you requested. Why have you still come here?” Tim asked in a rage, but Leylin could still see the fear and weakness under his tough and unyielding expression.\u003c/p\u003e\n\u003cp\u003e“Don’t take offense, alright? After all, we had a really pleasant time working together before, didn’t we Viscount Tim?” Leylin said with a light smile.\u003c/p\u003e\n\u003cp\u003e“You damn bandit, you absolute savage…” The veins on Tim’s face bulged grotesquely, “Aren’t you afraid I’ll inform on you to the king and the church?”\u003c/p\u003e\n\u003cp\u003e“What do I have to be afraid of?” Leylin laughed exaggeratedly, then whispered next to Tim’s ear, “After all, the person who killed the old marquis wasn’t me!”\u003c/p\u003e\n\u003cp\u003eOnce the words left Leylin’s mouth, Tim immediately curled up on his seat and started crying bitterly, as though his spine had been ripped out of him. “It’s you guys! You guys forced me…”\u003c/p\u003e\n\u003cp\u003e“No one forced you… If you came clean to the old marquis, both of you could have fled before the pirates came…” Leylin sneered. “Also, you don’t have to make yourself look pitiful in front of me. You really should hire a new acting teacher.”\u003c/p\u003e\n\u003cp\u003eThe cold look in Leylin’s eyes told Tim that the wizard had seen through him.\u003c/p\u003e\n\u003cp\u003e“If that’s the case, then why did you still come and look for me?” Tim took out a napkin to wipe the tears on his face. He calmed down in an instant, and his expression was even gloomy.\u003c/p\u003e\n\u003cp\u003e“Haha… Good! That’s the person I want to negotiate with!” Leylin clapped his hands, “Of course, the same as last time. A deal!”\u003c/p\u003e\n\u003cp\u003e“A deal? Speak!” Tim wasn’t even half as timid as earlier.\u003c/p\u003e\n\u003cp\u003e“I will help you obtain your title and territory, and in exchange you will end all suspicion on me.” Leylin was very direct. Tim was the key person in his plan to cleanse himself of suspicion. After all, if even the victim proved Leylin to be innocent, what else could anyone say?\u003c/p\u003e\n\u003cp\u003e“End all suspicion? Tsk tsk... Seems like the investigation team of the God of Justice is giving you trouble!” Tim folded his arms in front of his chest.\u003c/p\u003e\n\u003cp\u003e“Just a little, but you can forget about haggling. I have many other options as well, just that things would become a bit more troublesome. But the only person in the entire imperial capital who can support you in your obtaining a title of nobility is me!” Leylin appeared extremely enigmatic.\u003c/p\u003e\n\u003cp\u003e“I need to see what you’re capable of,” Tim did not agree at once. The Faulen Family’s head was just a baron after all, and Tim did not believe that his influence would extend beyond the outer seas.\u003c/p\u003e\n\u003cp\u003e“You’ll soon see!” With an indifferent smile, Leylin got up to leave.\u003c/p\u003e\n\u003cp\u003eNow was the time to utilise the devil network. Leylin made turns here and there in the imperial capital, as though he was just strolling around, and finally arrived at an entertainment club.\u003c/p\u003e\n\u003cp\u003e“Young master, we are not open yet…” The doorman said awkwardly. Leylin examined his surroundings. This place was evidently a street filled with the entertainment facilities of the imperial capital. There were similar buildings all around, just that the streets were rather deserted; after all, not every noble was so idle as to come over to play around in the day.\u003c/p\u003e\n\u003cp\u003e“I know…” Leylin stretched his right hand open in front of the doorman. A bizarre magic pattern appeared in the centre of his palm: a thorny rose. The colour of its petals changed continuously as time elapsed.\u003c/p\u003e\n\u003cp\u003eThe doorman’s face changed drastically upon seeing this mark. “Come in with me!” he said as his aura changed, and his languid gaze brightened up greatly. After vigilantly glancing around Leylin’s surroundings, he opened the main door and let Leylin in.\u003c/p\u003e\n\u003cp\u003ePink veils greeted him everywhere when he entered through the main door. There was a strong scent of perfume here, and wine bottles and scented handkerchiefs were strewn across the floor. A smooth arm or sleek thigh would peek out from the cracks of the doors from time to time. The entire place was filled with an exotic atmosphere.\u003c/p\u003e\n\u003cp\u003eThe doorman led Leylin to the deepest corner of the club straight away, into a hidden private room.\u003c/p\u003e\n\u003cp\u003e“Let me meet with the person in charge!” Leylin no longer bothered to conceal his identity. His eyes turned blood red, and he emitted traces of the aura of the devil.\u003c/p\u003e\n\u003cp\u003e“Yes, sir!” The doorman performed a ceremony exclusive to followers of the devil, and retreated respectfully. He even seemed to be trembling as he could distinctly sense the aura of a powerful devil radiating from Leylin.\u003c/p\u003e\n\u003cp\u003eThe boss arrived swiftly. The devilish undulations radiating from her made Leylin smile.\u003c/p\u003e\n\u003cp\u003e“Oh! Handsome young master, were you looking for me?” A relaxed voice said. Leylin then saw a beautiful and alluring lady enter the private room.\u003c/p\u003e\n\u003cp\u003eShe was clothed in a crimson evening gown, which revealed half of her snowy white shoulders. Her eyes were glistening as she coquettishly entered the room. With a gentle tap of her right foot, the door of the private room closed slowly. As she shut the door, the high slit in the hem of her gown inadvertently revealed her smooth thigh, as well as her pretty little feet and her toenails that were painted with daffodil juice.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t seem to be wearing anything under her luxurious clothes, and she radiated an aura which was infinitely tempting.\u003c/p\u003e\n\u003cp\u003e‘A rare creature!’ This was the first thought that came to Leylin’s mind. She was even more attractive than that fox lady, Madam Tillen, whom he had met previously. She was an already-extinct Creature that could make men go crazy.\u003c/p\u003e\n\u003cp\u003e“It’s me!” Leylin looked her up and down without even bothering to be polite. Her clean, bare feet that stood upon the carpet were especially attractive and flirtatious. However, what he said made her face change drastically in a split second. “As expected of a high-ranked pleasure devil, one that graces the beds of men…”\u003c/p\u003e\n\u003cp\u003e“A pleasure devil? Are you joking, young man?” The beautiful lady covered her mouth demurely, and even appeared a little pale. This was a natural reaction that normal people would give after hearing about a devil.\u003c/p\u003e\n\u003cp\u003e“No need for this pretense. Since I know about this place, it means that I already know everything about you that there is to know, including your real identity…” With a flick of Leylin\u0027s hand, a magical barrier formed immediately. Shadowy divine force suddenly erupted from his body.\u003c/p\u003e\n\u003cp\u003e“Master’s divine force!” This fake divine force made the attractive lady across him cry out in surprise. It was as though her fog of disguise had been pierced, revealing her true form. The amorous smile persisted, but her pupils had turned a strange burgundy. Her violet hair was topped with a curved horn characteristic of devils, and she appeared charming and adorable. Her feet had also turned into a pair of cloven hooves.\u003c/p\u003e\n\u003cp\u003eA layer of strange purple runes appeared on her body. They were like tattoos on her skin, yet they had a bizarre charm to them. Although one would recognise her as a devil with one look, she was more attractive than before.\u003c/p\u003e\n\u003cp\u003e“So you’re the divine one that appeared in Gloomwood Castle: Kukulkan!”\u003c/p\u003e\n\u003cp\u003eThe pleasure devil looked at Leylin restrainedly, fear showing on her changed appearance. As the priest in charge of the entire Dambrath Kingdom, she’d certainly paid close attention to Leylin’s appearance then. The worshippers from Gloomwood Castle wouldn’t dare hide anything from her either.\u003c/p\u003e\n\u003cp\u003eIf not caring about costs, she could receive news rapidly from across the kingdom.\u003c/p\u003e\n\u003cp\u003e“Yes, it’s me!” Leylin had his hands behind his back, and seemed extremely mysterious. His divine force was suppressing the devil opposite him.\u003c/p\u003e\n\u003cp\u003e“Are you here to add me to your party? Hehe… What a pity, but without master’s orders, I will not comply with you.” The pleasure devil watched Leylin with vigilance. As a high-ranked devil, she had personally seen Beelzebub before, and knew that he was absolutely impossible that it would bestow his divinity on other devils.\u003c/p\u003e\n\u003cp\u003e“I’m afraid that’s not for you to choose, Lady Delia! Or perhaps I should call you… Adelius Dodocrow Menjfakel Anconina…” Leylin uttered a string of complex and tongue-twisting syllables. When the pleasure devil heard this, she immediately turned wild.\u003c/p\u003e\n\u003cp\u003e“How… How did you know?” Her expression changed drastically. With a wave of her hand, a powerful magic force appeared in the private room once again, similar to a large-scale confinement spell formation.\u003c/p\u003e\n\u003cp\u003eThe reason why Lady Delia was so anxious was entirely because Leylin had just uttered her truename. A truename that was reserved for devils!\u003c/p\u003e\n\u003cp\u003eHigh-level devils had unique truenames, and these were their greatest secret. They were almost as important as their lives! Once it was divulged, even ordinary wizards would be able to easily imprison them, and enslave them or boss them around!\u003c/p\u003e\n\u003cp\u003eAs the Sovereign King of Gluttony who had control over her, it was only natural that Beelzebub knew the truename of this pleasure devil, and could cast a deadly curse on her at any time. This was the greatest form of control he had.\u003c/p\u003e\n\u003cp\u003eLeylin, who had stripped Beelzebub of everything he owned, had obtained the truenames of all the devils Beelzebub controlled from his memories. It was this trump card that he counted on.\u003c/p\u003e\n\u003cp\u003e“Why? Do you want to hit me?” Leylin smiled weakly. The rune representing Lady Delia’s truename had already flown into his palm. His terrifying divine force was like a vicious dragon, ready to smash the rune into pieces at any moment.\u003c/p\u003e\n\u003cp\u003e“No! Don’t!” The pleasure devil cried out in alarm, and knelt on the floor. “I am willing to obey your orders, master!”\u003c/p\u003e\n\u003cp\u003eAs a devil, she would of course treasure her life. As for loyalty and moral principles, they had long been fed to the dogs.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-873\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-875\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-874","bookId":1513,"creation":"Sep 10, 2019 6:41:21 AM","modification":"Sep 10, 2019 6:41:21 AM"}
