{"id":59447,"no":891,"title":"Chapter 891","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eDeliberately Making Things Difficult\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eWhile Rafiniya had a screw loose, she was still a real high-ranked knight. A hot-headed idiot like her was still useful in battle, able to take care of things on the front lines. As long as he brought up the path of knights and justice to sway her, this little lady knight would be charge forward like an enraged bull in spite of the dangers ahead.\u003c/p\u003e\n\u003cp\u003e“Well then, I’ll leave things to you!” The female knight casually spoke, making the few servants behind her turn pale.\u003c/p\u003e\n\u003cp\u003e“Miss, the master let you come out and travel, not to join the army. You’re making it hard for us to answer to the master…” the oldest servant summoned up the courage to say.\u003c/p\u003e\n\u003cp\u003e*Boom!* However, before he could finish his words, the little girl’s slender fist struck his right eye directly and he toppled. The power of a high-ranked knight was not something that a mere servant could take on.\u003c/p\u003e\n\u003cp\u003e“How shameless… Too shameless…” Rafiniya’s entire body trembled, “Such a person with no heart for justice whatsoever is my servant? That’s an insult to me!”\u003c/p\u003e\n\u003cp\u003e“How about you? Anyone against it?” Rafiniya’s metallic gloves produced sharp sounds, causing the other servants to immediately shake their heads and toss the unlucky guy on the floor aside.\u003c/p\u003e\n\u003cp\u003e“There’s no problem now!” Rafiniya clapped.\u003c/p\u003e\n\u003cp\u003e“You guys… come with me!” Leylin had a dark cloud over his head but did not say much in the end as he led the way.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIn the barracks.\u003c/p\u003e\n\u003cp\u003e“Hey, Leylin! There’s trouble…” Aulen’s anxious expression did not ease up, and she didn’t seem to notice Rafiniya who was behind him. She looked completely disheartened.\u003c/p\u003e\n\u003cp\u003e“What’s going on? Is this the mission that Cassley messed up further?”\u003c/p\u003e\n\u003cp\u003e“You know about it already? That bastard mixed blood! If not for his sorcery, it would have been impossible for him to become a high-ranked wizard even in three centuries…” Aulen cursed. Life in the army had caused the elves to lose their original elegance.\u003c/p\u003e\n\u003cp\u003e“Skill with sorcery? Bastard mixed blood? Haha… Aulen, I never knew you were good at swearing…” Leylin chuckled. The A.I. Chip had already told him Cassley had both elven and giant dragon blood in him.\u003c/p\u003e\n\u003cp\u003eWith three bloodlines, he truly was a mixed blood. Giant dragons and elves were both proficient spellcasters, and with their blood Cassley had become a high-ranked wizard before he turned two hundred. That was a classic example of relying on the heavens to succeed.\u003c/p\u003e\n\u003cp\u003e“Oh, there’s also an outsider here! My apologies!” It was only now that Aulen saw Rafiniya behind Leylin. The female knight was astonished by the profanities the elf had spouted.\u003c/p\u003e\n\u003cp\u003e“This is Rafiniya, a high-ranked knight and an old friend of mine. She wishes to join us.” Leylin introduced her to Aulen, as this was basic courtesy amongst nobles. “Rafiniya, this is Aulen. She’s not usually like this…”\u003c/p\u003e\n\u003cp\u003e“A high-ranked knight? Not bad, not bad! Is this the external help you got for this mission?” Aulen’s eyes brightened.\u003c/p\u003e\n\u003cp\u003e“No! It’s actually just a coincidence. Besides, I don’t know the contents of the mission in detail yet…” At the mention of proper business, Aulen turned grim.\u003c/p\u003e\n\u003cp\u003e“It’s an extermination mission. They want us to annihilate a camp of werecreatures, with at least five high-ranked Professionals and even possibly Malar priests. Damn it, it’s basically telling us to go on a suicide mission…” Aulen spoke aggrievedly.\u003c/p\u003e\n\u003cp\u003e“How about that elven wizard? Has he managed to get us anything?” Leylin was referring to their backer.\u003c/p\u003e\n\u003cp\u003e“He seems quite determined now. A team of theirs with powerhouses is also going on a dangerous mission, and the upper house as well as master of the city have approved it…” Aulen laughed wryly, “All that he’s obtained for us is a group of new soldiers and some supplementary items. We still have to do the mission though.”\u003c/p\u003e\n\u003cp\u003e“Never mind the new troops. They aren’t that powerful and might affect our rapport. What do you think about roping Rafiniya in?” Leylin suggested.\u003c/p\u003e\n\u003cp\u003eAulen had the same thoughts as Leylin, and she nodded, “Mm, that’s what I was thinking! As for those stupid new recruits… I know them better than you do…”\u003c/p\u003e\n\u003cp\u003e“Well then… Are you willing to enter the city guards and join my team, Miss Rafiniya?” Aulen asked seriously.\u003c/p\u003e\n\u003cp\u003e“Of course! Spreading justice and punishing evil is the reason I’m travelling around, and my lifelong path as a knight!” Rafiniya’s face seemed to glow.\u003c/p\u003e\n\u003cp\u003e“Great. Welcome! From today onwards, you are a comrade that we can rely on.” Aulen exclaimed seriously. She seemed to have a favourable impression of this female knight whose thoughts were incomparably pure. Rafiniya had always been very carefree, and that personality allowed her to integrate into the team quickly.\u003c/p\u003e\n\u003cp\u003eUpon noticing this, Leylin asked for information regarding the mission and headed out of the camp. He walked along the streets aimlessly, suddenly disappearing into a little alley.\u003c/p\u003e\n\u003cp\u003eA layer of dark magic light began to spread around Leylin’s body and completely concealed his figure.\u003c/p\u003e\n\u003cp\u003eIn a private house nearby, Leylin caught sight of Tiff.\u003c/p\u003e\n\u003cp\u003e“Young master!” Tiff had now swapped to another face and was wrapped up in a black coat, emitting a strange aura. After seeing Leylin’s arrival, he immediately bowed respectfully and set up a powerful isolating barrier.\u003c/p\u003e\n\u003cp\u003eWith his strength nearing the legendary realm, nobody would be able to see through it unless the Chosen herself decided to stalk him by intention.\u003c/p\u003e\n\u003cp\u003e‘Is he already about to break through?’ As the ‘god’ that Tiff believed in, Leylin had a great understanding of Tiff’s feelings. The energy in Tiff’s body had already almost been completely purified, and he was truly only one step away from becoming a Legend.\u003c/p\u003e\n\u003cp\u003eObserving the process of someone else becoming a Legend was a huge source of enlightenment and motivation for Leylin now.\u003c/p\u003e\n\u003cp\u003e‘The realm of Legends holds true power in the World of Gods. It’s also the beginning on one’s path to godhood, not as easy as purifying one’s power…’ While Tiff was not purely a wizard, there was still much information that Leylin could make use of. Light flashed in the depths of his eyes, and Tiff’s stats and aura undulations were accurately copied by the A.I. Chip.\u003c/p\u003e\n\u003cp\u003e“Mm. How have things been lately?” Leylin indifferently asked.\u003c/p\u003e\n\u003cp\u003e“I’ve taken in more followers, though a few organisations have begun to take notice of this… Also, news of the incoming war can no longer be hidden. It’s quickly being spread amongst the regular people, and the price of rations and weapons in the black market has been steadily rising…” Tiff reported conscientiously.\u003c/p\u003e\n\u003cp\u003eHe had initially been a loyal believer of the winged serpent god, Kukulkan. He now treated Leylin as the saint of his god and his substitute, so if his loyalty was quantified it would be at the highest possible value.\u003c/p\u003e\n\u003cp\u003eWith Tiff’s strength approaching the legendary realm, he was one of Leylin’s trump cards. Leylin sent him out to gather strength, ready to make a move at the most opportune moment. He was someone who had been able to do as he pleased for a long time due to his strength. His abilities and schemes were marvellous, and with Leylin’s financial help, the plans proceeded smoothly.\u003c/p\u003e\n\u003cp\u003eAfter reselling some rare and scarce items, he had even earned much wealth.\u003c/p\u003e\n\u003cp\u003e“The war has yet to break out, and we still have our most important mission. Once the invasion of the orcs begins, nobody will have time to watch us closely…”\u003c/p\u003e\n\u003cp\u003eLeylin rubbed his chin, “Perhaps our mighty and benevolent city master will announce something that can coincidentally rid our group of all suspicion…”\u003c/p\u003e\n\u003cp\u003eWar was comparable to allowing the people to carry arms, and demanding that they bring their own rations and take care of themselves. When the situation was dire, the city master probably would not raise too many objections against these empty promises of titles.\u003c/p\u003e\n\u003cp\u003e“Understood, young master, your will is my command.” Tiff nodded gravely to show his understanding.\u003c/p\u003e\n\u003cp\u003e“Also, there’s a large base in the dark forest. Do you remember it?” Leylin immediately produced a map used by the military and pointed at the location where the mission was to be carried out.\u003c/p\u003e\n\u003cp\u003e“This place…” Tiff’s brows furrowed, as if he had been put in a difficult position. Such an expression on Tiff’s face meant that something was abnormal, and it could even be dangerous.\u003c/p\u003e\n\u003cp\u003e“What is it?” Leylin immediately asked.\u003c/p\u003e\n\u003cp\u003e“This is a werecreature camp on the outskirts. I’ve had dealings with them before…” The people Tiff took in were obviously not good, pure people. They were the elites of the dark world, and werecreatures were included on the list.\u003c/p\u003e\n\u003cp\u003eIt was completely normal for him to have had dealings with the Moonwood or even the Blackblood tribe before.\u003c/p\u003e\n\u003cp\u003e“How powerful are they?” Something that put even a near-legendary being on the spot was naturally not easy to take care of. Even knowing that Cassley would definitely give him the most difficult mission, the difficulty it posed seemed to have surpassed Leylin’s expectations.\u003c/p\u003e\n\u003cp\u003e“There’s a being there that even I feel is dangerous. Also, they have priests of the God of the Hunt there…” A being that could make Tiff feel danger was at least on the same level as him. On top of that, if this organisation had a priest, then they would be at a completely different level than before.\u003c/p\u003e\n\u003cp\u003e“If young master must attack this base, please allow me to follow you in secret!” Evidently, Tiff was not optimistic at all about Leylin’s mission.\u003c/p\u003e\n\u003cp\u003e“Alright. Add the more powerful ones you’ve recruited as well, and have them tail us secretly.” Leylin did not try to make things hard for himself. He was merely a rank 12 wizard now, and there was quite a number of people who were more powerful than him in Silverymoon.\u003c/p\u003e\n\u003cp\u003e“However, compared to the great tide of orcs and orc Legends, as well as the god backing them, the Blackblood tribe is rather weak…” Leylin sighed.\u003c/p\u003e\n\u003cp\u003eGiven how difficult this mission was, Leylin would probably rise to the middle ranks of Silverymoon after it was completed.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-890\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-892\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-891","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
