{"id":58565,"no":9,"title":"Chapter 9","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eEntering the Plains\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\"Of course, the reason we formed this alliance was for that purpose!\"\u003c/p\u003e\n\u003cp\u003eGeorge stated loudly.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve already discussed this with the other traveling parties. We will swap positions with them so that our Furze Alliance can occupy a few carriages that are close to each other! We\u0027ve also gotten the permission from the black robes!\"\u003c/p\u003e\n\u003cp\u003e\"Furthermore, us noble males will take turns being guards to protect the carriages! Of course, this is with the caveat that we are merely assisting the black robe Knights. As for the beautiful ladies, the logistics and cleaning duties will be up to you!\"\u003c/p\u003e\n\u003cp\u003e\"As for the weapons, you guys also do not have to worry. We\u0027ve already made our preparations and even got hold of a crossbow!\"\u003c/p\u003e\n\u003cp\u003eGeorge called out his plans.\u003c/p\u003e\n\u003cp\u003eThe youths of the alliance all began\u0026nbsp;talking amongst themselves, and after some discussion, most were in favour of this plan.\u003c/p\u003e\n\u003cp\u003e\"Okay, we agree!\"\u003c/p\u003e\n\u003cp\u003eAs for the position of the captain of the guards, it was inevitable that George would take that position. Striking while the iron was hot, George began to hand out some missions.\u003c/p\u003e\n\u003cp\u003eThe feast continued afterward, but it was clear to see that most of the enthusiasm in the crowd had long since been lost.\u003c/p\u003e\n\u003cp\u003e\"Originally I had planned on giving you a cross blade, but it seems there is no longer any need now!\"\u003c/p\u003e\n\u003cp\u003eGeorge held up his cup as he walked towards Leylin, pointing at the sword hilt fastened at his waist.\u003c/p\u003e\n\u003cp\u003e\"Is it true that every single time a Magus troop enters the Great Plains, there are many deaths?\" Leylin asked.\u003c/p\u003e\n\u003cp\u003e\"Of course, the best case scenario is that only one or two will die, but there have been times where at least ten have perished!\" George shrugged his shoulders. \"Otherwise why else would I spend so much money and energy in order to establish an alliance that would be dissolved when we reach the coastline?\"\u003c/p\u003e\n\u003cp\u003e\"Wherever you plant a seed, there will be some form of profit to be had!\" Leylin laughed.\u003c/p\u003e\n\u003cp\u003eNo matter what, as long as everyone grouped together, then their odds of survival would increase. And any of the surviving acolytes would definitely hold some goodwill towards George and his family. As long as one of these acolytes were to become a Magus, then the returns would be great.\u003c/p\u003e\n\u003cp\u003eBut even if there were no survivors, it wasn\u0027t a big loss to him, either way, right?\u003c/p\u003e\n\u003cp\u003e\"Aside from your swordsmanship, your intelligence has really impressed me!\" George\u0027s eyes sparkled. \"The things I did were all things that my father told me to.\"\u003c/p\u003e\n\u003cp\u003e\"Well then, are you willing to help me?\" George extended his hand.\u003c/p\u003e\n\u003cp\u003e\"As you wish!\" Leylin laughed, linking his hand to George\u0027s.\u003c/p\u003e\n\u003cp\u003e......\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s reply to George\u0027s request wasn\u0027t an impulsive one. In fact, he had made this decision after careful deliberation.\u003c/p\u003e\n\u003cp\u003eWith regards to the hidden dangers in the plains, he wasn\u0027t very knowledgeable about it. So joining hands by cooperating would be a decent proposal.\u003c/p\u003e\n\u003cp\u003eHuuuuu\u003c/p\u003e\n\u003cp\u003eThe cold wind descended upon the group and hit them in the face like knife blades. With each breath drawn, Leylin could smell the fragrant smell of grass.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s already been 15 days since we\u0027ve entered the Great Plains of Death!\"\u003c/p\u003e\n\u003cp\u003eLooking back at the carriages, Leylin could see some traces of damage on it, causing him to feel quite gloomy.\u003c/p\u003e\n\u003cp\u003eThe marks on the carriages were three different lines linked into one as if it was created by a single claw.\u003c/p\u003e\n\u003cp\u003e\"The Great Plains of Death have dangers that even normal humans or even Preparatory Knights would have trouble with!\"\u003c/p\u003e\n\u003cp\u003eAfter entering the plains, although the black and white robed lords had increased the number of patrols, and for the acolytes to band together, there had still been some casualties.\u003c/p\u003e\n\u003cp\u003eThe marks on the carriages had been caused by a pack of plain direwolves. The very moment they had arrived, the carriages had suffered a siege.\u003c/p\u003e\n\u003cp\u003eAlthough there hadn\u0027t been any deaths, the pack of plain direwolves had nearly pushed over the carriages and damaged it, giving Leylin a deep impression of them.\u003c/p\u003e\n\u003cp\u003eFrom that moment onwards, the students didn\u0027t dare to camp outside and all tried to sleep in the carriages! But even with that, there had still been some casualties.\u003c/p\u003e\n\u003cp\u003eLeylin\u0027s face grew dark.\u003c/p\u003e\n\u003cp\u003eAlthough the black-robed Knights were guarding them, some of the youngsters still needed to go out to take care of their bodily needs. Alas, within the danger-filled Great Plains of Death, that meant danger.\u003c/p\u003e\n\u003cp\u003eOne youth had been bitten by a poisonous insect the very moment he stepped off the carriage and died.\u003c/p\u003e\n\u003cp\u003e\"According to the calculations of the A.I Chip, the poison of the insect would corrode the brain within 13 seconds. There was not enough time for medical help, and even the few white-robed Magus could only watch the youngster die...\"\u003c/p\u003e\n\u003cp\u003eAfter that incident, the students would get off the carriage only when absolutely necessary. However, due to the small size of the carriage and the sheer number of people squeezed inside, the smell within was certainly unpleasant.\u003c/p\u003e\n\u003cp\u003eFor the price of helping the black-robed Knights drive a carriage, Leylin was given the chance t get some fresh air.\u003c/p\u003e\n\u003cp\u003eAlthough being on the outside of the carriage seemed to be more dangerous, with the black robed Knight right next to him, it was actually much safer.\u003c/p\u003e\n\u003cp\u003eAs for the carriage driving skill? Leylin only had to listen to the black robed Knight for a short amount of time while the A.I chip recorded everything.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s getting dark! Everyone gather within the carriages to rest!\"\u003c/p\u003e\n\u003cp\u003eA voice called out from the front, causing every single carriage to stop.\u003c/p\u003e\n\u003cp\u003eNot only was traveling at night dangerous, but it meant the horses did not have time to rest, which could lead to their deaths, and cause even more troubles.\u003c/p\u003e\n\u003cp\u003e\"Your carriage driving skills are quite good!\" The black robed Knight looked at Leylin and spoke softly.\u003c/p\u003e\n\u003cp\u003e\"Thank you for your praise!\" Leylin nodded.\u003c/p\u003e\n\u003cp\u003eReturning to the inside of the carriage, a fierce smell hit his nose the moment he opened the door. Leylin\u0027s eyebrows creased together, but seeing the stupefied looks on the students faces, he could only sigh to himself secretly.\u003c/p\u003e\n\u003cp\u003eEver since the first casualty, none of the youths had a happy look, instead, there was a mournful atmosphere. This was another reason why Leylin did not like staying inside the carriage at all.\u003c/p\u003e\n\u003cp\u003e\"Leylin, you\u0027re back!\" A small freckled youngster forced out a smile as he greeted him.\u003c/p\u003e\n\u003cp\u003e\"Yeah!\" Leylin sat down and looked around before taking a piece of flatbread to gnaw on.\u003c/p\u003e\n\u003cp\u003eThe dry piece of flatbread was chewed up inside his mouth, feeling as if he was chewing on sand. Despite its taste, Leylin managed to swallow the bread with great difficulty, but in doing so, he felt a sudden pain in his throat, prompting him to hurriedly take out his canteen and chug down a large amount of water. After he finally finished the entire piece of bread, he heaved a sigh of relief.\u003c/p\u003e\n\u003cp\u003eAfter entering the Great Plains of Death, supplies were hard to come by. Even though the students had some gold coins, there were no merchants around. So in this situation, the gold coins were not much better than mere stones.\u003c/p\u003e\n\u003cp\u003e\"Ley....Leylin, what\u0027s the situation like? Just how many more days until we\u0027re out of this damned plains?\"\u003c/p\u003e\n\u003cp\u003eAfter Leylin had finished eating, the freckled youth asked him a question.\u003c/p\u003e\n\u003cp\u003eHis words were clearly what everyone wanted to know the answer, and drew everyone\u0027s attention as they turned to look towards Leylin.\u003c/p\u003e\n\u003cp\u003e\"While driving the carriage, I talked with the black robed Knight. We\u0027ve already traveled half the distance, so if everything goes well from here, we\u0027ll reach the coastlines in another half a month.\"\u003c/p\u003e\n\u003cp\u003e\"Eh! Good god, there\u0027s still half a month more?! What terrible days these are, I can\u0027t even stand another single day in this place!\"\u003c/p\u003e\n\u003cp\u003eThe freckled youth began to pull at his hair as he complained.\u003c/p\u003e\n\u003cp\u003e\"Hey, cheer up, Kassa. As long as you can take these 15 days, then you\u0027ll reach the coastlines. Delicious fruits, fluffy bread, not to mention a comfortable bed and a warm bathroom, all of it is waiting for you!\"\u003c/p\u003e\n\u003cp\u003eEven as a youngster tried to cheer Kassa up, the words seemed to be trying to cheer himself up even more than Kassa.\u003c/p\u003e\n\u003cp\u003eDong! Dong!\u003c/p\u003e\n\u003cp\u003eA rhythmic pattern could be heard as the doors to the carriage opened, revealing George. In his armor and carrying his long sword, George looked like a handsome Knight. \"Hey, gentleman! Ladies! Break time is here! If you need to loosen up a bit, just come outside. If you don\u0027t, then please stay inside, after all, the outside is quite dangerous....\u003c/p\u003e\n\u003cp\u003eThe carriage grew restless before a few red-faced girls looked at each other in the eye and walked out of the carriage.\u003c/p\u003e\n\u003cp\u003eLeylin shrugged his shoulders before grabbing his cross blade, \"Let\u0027s go!\"\u003c/p\u003e\n\u003cp\u003eAs a member of the guards, he needed to protect these ladies. Even though all he could do was to maintain his vigilance and call out for the black robed Knight to come help them if any trouble arose.\u003c/p\u003e\n\u003cp\u003e\"I...I won\u0027t go down this time!\" Kassa spoke out from the side as he shivered.\u003c/p\u003e\n\u003cp\u003e\"Fine then!\" Leylin gestured to the rest to follow him out the carriage.\u003c/p\u003e\n\u003cp\u003eLanding softly on the grass, Leylin couldn\u0027t help but to stretch comfortably outside. A beautiful scenery stretched far beyond what his eye could see. If it weren\u0027t for the amount of danger in here, Leylin would have loved this sight.\u003c/p\u003e\n\u003cp\u003e\"How beautiful!\" George spoke out as he watched the setting sun.\u003c/p\u003e\n\u003cp\u003e\"How beautiful indeed, but also dangerous!\" Leylin muttered.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s danger everywhere my friend! Sickness, famine, war, the world is filled with dangers like these. To us, this area is a threat to our lives, but to the white-robed Magus, this is nothing more than like the garden back home!\" George clenched at his sword.\u003c/p\u003e\n\u003cp\u003e\"Are you trying to say that as long as you have strength, then you can obtain both freedom and safety?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly! Take a look at Kassa, he has already lost his courage. On this road to power, he is lacking the spirit to face danger. Even if he were to safely arrive at the Magus academy, it is unlikely that he can become a Magus. After all, studying magic is a treacherous path that is a hundred times more difficult than this plain!\"\u003c/p\u003e\n\u003cp\u003eGeorge threw a rock far into the plains, \"It\u0027s time to protect our beautiful treasures now!\"\u003c/p\u003e\n\u003cp\u003eSeeing George walk away, Leylin had a smile on his face, \"Courage? But for those chasing the truth, prudence is also a necessity!\"\u003c/p\u003e\n\u003cp\u003e\"A.I Chip! Initialize scanning!\" Leylin thought.\u003c/p\u003e\n\u003cp\u003eFollowing the order, a three-dimensional scenery began to visualize within Leylin\u0027s head, showing off the vicinity of the nearby area.\u003c/p\u003e\n\u003cp\u003eWithin the light blue geographical image, a cluster of white stars. These stars symbolized the students; not a single one of them seemed to be hurt.\u003c/p\u003e\n\u003cp\u003eAs for the black robed Knight, he was a flashing red light. After the A.I Chip\u0027s analysis, it had recognized him as an existence that could threaten his host.\u003c/p\u003e\n\u003cp\u003eThe final few carriages had the white-robed Magus within. Leylin didn\u0027t dare to try to use his A.I Chip to scan it in case its energy was detected and cause troubles for him.\u003c/p\u003e\n\u003cp\u003eNot too long after, every single nearby source of danger appeared within Leylin\u0027s mind.\u003c/p\u003e\n\u003cp\u003e\"Even if it\u0027s a poisonous insect, they won\u0027t be able to escape the A.I Chip\u0027s scan! As of right now, this area is safe!\"\u003c/p\u003e\n\u003cp\u003eThis was a guarantee that Leylin could make.\u003c/p\u003e\n\u003cp\u003eAlthough he was a member of the guard, he would never do anything to put himself in harm\u0027s way.\u003c/p\u003e\n\u003cp\u003eWith the A.I Chip, he had a firm grasp of everything happening in a 20 li radius, and this would be the biggest guarantee to their safety.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-8\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-10\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-9","bookId":1513,"creation":"Sep 10, 2019 6:41:20 AM","modification":"Sep 10, 2019 6:41:20 AM"}
