{"id":59470,"no":914,"title":"Chapter 914","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003e Distortion\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Is this the effect of a high-ranked Magus’ radiation?” Leylin murmured, “To achieve this even after thousands of years, only someone at rank 7 or above could do such a thing…”\u003c/p\u003e\n\u003cp\u003eLeylin stood by himself in the empty and desolate passage, slowly shutting his eyes. He slowly found traces of energy from a completely different world.\u003c/p\u003e\n\u003cp\u003e“The power of distortion! As expected, it’s Distorted Shadow… Over there!” Leylin’s eyes were filled with excitement as he suddenly advanced in another direction. He had sensed a clue to the inheritance of an ancient Magus who had comprehended laws!\u003c/p\u003e\n\u003cp\u003eSuch an incredibly precious treasure was enough for him to brave the risks that surely lay ahead.\u003c/p\u003e\n\u003cp\u003e‘The ancient Distorted Shadow’s path of laws should deal with space or distortion, or something related to that. No wonder he could make so many dimensions overlap…’ As he ran, Leylin instantly thought of the fold in space he had encountered just before, ‘Legend states that Distorted Shadow was at least a rank 8 Magus, and he was a peak rank 8 who had perfected his own path!’\u003c/p\u003e\n\u003cp\u003e*Bang!* He followed his instincts to a laboratory, and a strong gust hit his face when he opened the door.\u003c/p\u003e\n\u003cp\u003eArcane Missile! Leylin’s fingers shot out a more powerful version of Magic Missile. The thing was full of arcane energy, and it smashed the metal gears that were wrapped within the strong wind to the ground, leaving behind dents in it.\u003c/p\u003e\n\u003cp\u003e“This place…” he looked around him. The room was modelled like a giant workshop, with many metal lathes and machine arms tidying and moving things back and forth. Some of the machines had a layer of green rust on them.\u003c/p\u003e\n\u003cp\u003e‘Is this some golem processing workshop?’ Leylin followed his instincts and found a trace of distortion left behind.\u003c/p\u003e\n\u003cp\u003e“Mister Leylin, save me!” Just at this moment, Leylin suddenly turned his head and he heard Helen’s voice came from his side.\u003c/p\u003e\n\u003cp\u003e“Helen?” He suddenly shouted, and several layers of protective light glowed on his body.\u003c/p\u003e\n\u003cp\u003e“Save me…” The only reply he received was her weeping.\u003c/p\u003e\n\u003cp\u003eLeylin gritted his teeth and walked towards the direction of her wails. He passed through a tall fireplace, and saw the back of a silhouette that seemed like Helen sitting in the darkness and crying. “I… I can’t get up…”\u003c/p\u003e\n\u003cp\u003e“Mm?” It was only then that Leylin discovered that the originally smooth floor had become spongy. There were several black hands spouting out of it, holding firmly onto Helen’s ankles.\u003c/p\u003e\n\u003cp\u003eA faint black shimmered in Leylin’s pupils as they widened, and he called out in the ancient Byron language. “Malicious intent? Get lost!”\u003c/p\u003e\n\u003cp\u003e“Sss…” His soul essence had already transformed into a phantom Targaryen, and it suddenly began to roar.\u003c/p\u003e\n\u003cp\u003e*Puff! Puff!* The sound reverberated in the room, and those enormous black hands suddenly swelled as sarcomas boiled out from under their skin. These tumours grew larger and larger until one could see veins within before finally exploding.\u003c/p\u003e\n\u003cp\u003e“Ah!” Helen let out a blood-curdling shriek. The giant black hands had disappeared, but a layer of skin on her ankle had been torn off as well, leaving behind a horribly infected wound. The black pus seemed to have great corrosive ability, and it ate away half of Helen’s clothes in an instant.\u003c/p\u003e\n\u003cp\u003e*Sss!* Great quantities of the black rain landed on the metal surfaces nearby, corroding everything it touched.\u003c/p\u003e\n\u003cp\u003eCure Moderate Wounds! Leylin immediately cast a healing spell and raced to Helen’s side, “Are you alright?”\u003c/p\u003e\n\u003cp\u003e“I’m… I’m alright…” Helen sluggishly turned her head, and Leylin’s eyes narrowed. What appeared before Leylin was a strangely distorted face. Her facial features were screwed into incorrect positions, and it was full of distorted veins and scars. It was more disgusting than the most disgusting monstrosity!\u003c/p\u003e\n\u003cp\u003e“What on earth are you?” Leylin immediately moved away from it, watching this freakish monster who was undulating Helen’s soul force.\u003c/p\u003e\n\u003cp\u003e“Sir Leylin, it’s… It’s me, Helen…” The monster let out a panicked voice, but its distorted face wore a malevolent expression. The huge mouth on its forehead opened, revealing sharp yellow teeth and a barbed green tongue.\u003c/p\u003e\n\u003cp\u003e‘It looks like Distorted Shadow never had the intention of leaving an inheritance behind. Perhaps he had only come here and left an evil spiritual parasite. Now that the pocket dimension is about to collapse, the evil intent has awakened…’ Leylin was startled as he thought of this possibility.\u003c/p\u003e\n\u003cp\u003eAn evil intent left behind by an ancient rank 8 Magus would put him in grave danger, and could even kill him.\u003c/p\u003e\n\u003cp\u003eFireball! Fireball! Fireball!\u003c/p\u003e\n\u003cp\u003eScorching Ray! Scorching Ray! Scorching Ray!\u003c/p\u003e\n\u003cp\u003eLeylin launched his killing move in this life or death situation. Many rank 2 and 3 fire spells combined to form a meteor shower from the sky.\u003c/p\u003e\n\u003cp\u003e“Spell Torrent!” The violent surging blaze submerged the monster in its flames. The effect of many low-ranked spells piled up on top of each other to reach near-legendary power.\u003c/p\u003e\n\u003cp\u003e*Bang!* The blazing fire melted the surrounding lathes and mechanical arms considerably, forming white-hot molten iron that slowly pooled to form a stream on the ground.\u003c/p\u003e\n\u003cp\u003eAfter the torrent of spells, Leylin saw a bare passage appear before him. The monster had already disappeared without a trace, and seemed to have been burnt to ashes.\u003c/p\u003e\n\u003cp\u003eThe molten iron was red through and through now, making the black material look even more unsightly. It hadn’t been corroded, instead bobbing up and down unsteadily.\u003c/p\u003e\n\u003cp\u003e“That’s the beast skin scroll Helen had before” Leylin was suddenly alarmed, and a stony grey hand emerged from the scroll. The black hide was stained with blood, but it did not dissolve in the molten iron. This made a strange expression appear on Leylin’s face.\u003c/p\u003e\n\u003cp\u003e“Leylin! Save me…” As the voice sounded, the hand suddenly broke through Leylin’s spell defences. A power of distortion struck Leylin’s shoulder.\u003c/p\u003e\n\u003cp\u003e*Crash!* Whether it was his robe or armour, or even his body’s own defences, everything was torn apart like paper by this hand.\u003c/p\u003e\n\u003cp\u003e“Damn it!” Leylin’s expression grew fierce, “Fuck off!” The Targaryen phantom felt the danger as well, and its vertical eyes narrowed. A formidable devouring power spread into the surroundings.\u003c/p\u003e\n\u003cp\u003eBlink! Leylin’s silhouette flickered and he arrived outside the workshop. He didn’t even bother looking back at the monster within as he broke out into a run. Several Haste spells flashed on his body as he dashed out of the exit.\u003c/p\u003e\n\u003cp\u003eAlthough Leylin would take risks to obtain a rank 8 Magus’ inheritance, he definitely wouldn’t court death for it. The moment he discovered that the danger here far exceeded the benefits he could gain, he made the prompt decision to leave.\u003c/p\u003e\n\u003cp\u003eChirps and honks sounded as a twisted laughter rang out from behind him. He felt a terrifying force pursuing him as the entire passage began to distort, like a rag being twisted to pieces.\u003c/p\u003e\n\u003cp\u003eFreeze! The torrent of spells appeared once more, and many Freeze and Create Water spells formed a mountain of ice behind him. The enormous ice mountain immediately blocked off the entire passage, and stopped the terrifying creature’s pursuit. Still, crack after crack formed on it without end.\u003c/p\u003e\n\u003cp\u003eLeylin seized the chance to suddenly rush to the exit, throwing himself outside. Furry green claws distorted as they swiped at Leylin’s back. Thankfully, he’d managed to make it out in that instant and they only managed to cut the corner of his clothes.\u003c/p\u003e\n\u003cp\u003eA loud rumble suddenly sounded. Leylin immediately jumped out of the secret entrance, and soon after it was submerged in a silver storm. The pocket dimension had already begun to collapse, and many disasters had arisen within.\u003c/p\u003e\n\u003cp\u003e“Young master!” Tiff walked over to him with a worried expression.\u003c/p\u003e\n\u003cp\u003e“I’m alright, I only ran into a storm in the plane. I was rather lucky.” Leylin smiled, a healing glow already spreading across his shoulder.\u003c/p\u003e\n\u003cp\u003e“Lord Leylin?!” He heard a woman’s voice and trembled at the sound of it.\u003c/p\u003e\n\u003cp\u003eHe turned his head rather stiffly and was greeted by the sight of Helen! Helen stood there, hale and hearty, with a concerned expression on her face.\u003c/p\u003e\n\u003cp\u003e“What? Weren’t you still in there?” Leylin’s eyes narrowed.\u003c/p\u003e\n\u003cp\u003e“What?” Helen’s astonished expression deepened, “You had me leave first after we exited the core control room, my Lord. You said you wanted to continue exploring alone…”\u003c/p\u003e\n\u003cp\u003e“I indeed saw Miss Helen arrive first!” Tiff testified for her.\u003c/p\u003e\n\u003cp\u003e‘Then the Helen I saw earlier, who was it… It even distorted my senses…’\u003c/p\u003e\n\u003cp\u003e“Then this thing? Do you recognise it?” A black blood-stained scroll made of beast skin appeared in Leylin’s palm.\u003c/p\u003e\n\u003cp\u003eHe had used various methods to verify that Helen was really made of flesh and blood. The soul undulations were the same, and she was not disguised by some evil intent.\u003c/p\u003e\n\u003cp\u003e“My scroll…” Helen exclaimed, touching the bag of holding at her hip. Her face slowly paled, “Gone! It’s gone! I had it in my bag of holding…”\u003c/p\u003e\n\u003cp\u003e‘Ha… As expected of the Distorted Shadow!’ Leylin sighed deeply, ‘Having already grasped the concepts of distortion, space, and time, he even managed to distort my senses?’\u003c/p\u003e\n\u003cp\u003e“Young master, is there an enemy?” Tiff now realised that something was wrong. He stood on alert next to Leylin, his eyes fixed on Helen. If she made the slightest wrong move, he would kill her where she stood.\u003c/p\u003e\n\u003cp\u003e“It’s nothing… Just a mishap,” Leylin waved his hand. He had experienced far stranger things than this in the Magus World, and developed some immunity to this sort of thing.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-913\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-915\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-914","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
