{"id":59487,"no":931,"title":"Chapter 931","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eAltar\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe raging flames continued to blaze. The piercing screams and wails never ended, accompanied by the roars and manic laughter of pirates.\u003c/p\u003e\n\u003cp\u003eBarbarian corpses piled up in this place one after the other, the blood splitting to form little streams. Once Leylin decided to attack this place, the Barbarian tribe was completely done for.\u003c/p\u003e\n\u003cp\u003eAs Odge had taken most of the strong and the young, all that were left behind were a bunch of frail, elderly, female or children beings. It could be said that in front of these vicious pirates, resistance was pointless.\u003c/p\u003e\n\u003cp\u003e“This barbarian tribe seems to hold some secrets…” Leylin touched his chin, a devilishly charming smile on his face as he arrived at the heart of the tribe.\u003c/p\u003e\n\u003cp\u003eThe sacrifices were made here, but it was to some unknown god. A large piece of obsidian was carved into a firm altar, on which there was a large animal skin flag and strange crimson runes.\u003c/p\u003e\n\u003cp\u003eIn front of the altar were a few struggling barbarians, all of them unbelievably old.\u003c/p\u003e\n\u003cp\u003e“You of another race, do not come here!” they exclaimed. They were so frail they looked like reeds. A few youths next to them held on to the last spears and weapons they had, trembling as they aimed at the invader with eyes full of fear.\u003c/p\u003e\n\u003cp\u003e“A barbarian priest? A sorcerer?” Leylin watched these barbarians who already had one foot in the grave and sensed the power of their bloodlines. He could not help but nod to himself.\u003c/p\u003e\n\u003cp\u003e“Scram!” Arcane spells burst forth, forming terrifying large elemental hands that tore the few sorcerers into shreds. Their stubborn resistance was futile, and such strength instantly left them at a loss.\u003c/p\u003e\n\u003cp\u003eA few arcane fireballs rumbled forth, burning the rest of the barbarians to ashes. Leylin stepped over the corpses to arrive at the altar, nothing in his way.\u003c/p\u003e\n\u003cp\u003e“Spirit? Soul? Or is it without a conscient…” As he felt around the coarse notches carved into the stone, Leylin closed his eyes.\u003c/p\u003e\n\u003cp\u003e‘Are these barbarians trying to gather divinity with the power of their community?’ With tons of experience, Leylin immediately saw through their plans. The power of faith far exceeded extraordinary force. With years of worship and sacrifice, this place had already begun to develop traces of a primal power.\u003c/p\u003e\n\u003cp\u003eThe altar had strong faith within it. There were spirits of powerful beings mixed in, those who had died over time, and the foundation was currently very firm. Just a bit more time could really have given birth to divinity.\u003c/p\u003e\n\u003cp\u003eThis was how many ancient tribal gods had been born. A high-ranked barbarian could use this bit of divinity to cross the threshold of becoming legendary. They could even become a demigod with their advance, combining that with their faith to ignite godfire.\u003c/p\u003e\n\u003cp\u003eAs he too had plans to become a god, Leylin could comprehend this thought process.\u003c/p\u003e\n\u003cp\u003e“As for the person chosen to become a god, it should be Odge, or do they have another powerful pawn? How ambitious…” Leylin stroked his chin.\u003c/p\u003e\n\u003cp\u003eThere had always been many intelligent people in this world. As the outer seas did not have the attention of too many gods yet, becoming a god in the outer seas was much less difficult than in the continent. For this reason, Odge had set his sights on this area, which coincided with Leylin’s plan.\u003c/p\u003e\n\u003cp\u003e“Is this a god of the barbarian race? With how weak the outer seas are, a demigod would immediately unify the place, making it a playground for the barbarians…”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes glinted, “Very creative, but it’s a pity that you met me.”\u003c/p\u003e\n\u003cp\u003eLeylin had long since treated the outer seas of Dambrath as his territory. While the barbarians had their own plans, he would have to disappoint them.\u003c/p\u003e\n\u003cp\u003e“The spirits are valiant, guarding the tremendous power of faith and soul origin tightly.” Leylin observed the obsidian carvings and animal skin runes, an unenthusiastic look on his face, “Seems like every barbarian that dies will return to this place…”\u003c/p\u003e\n\u003cp\u003eThis was the hope of a race! In the World of Gods, a race without protection from a god would not have a future. Mixed with their hot-bloodedness and sacrifices, it was both inspiring and tragic.\u003c/p\u003e\n\u003cp\u003eLeylin shut his eyes, and he felt like these spirits had encircled him. A tremendous malicious intent descended, “Scram! Scram!”\u003c/p\u003e\n\u003cp\u003eThis was no illusion, but the power of rejection from the altar itself.\u003c/p\u003e\n\u003cp\u003e“Tsk tsk… How powerful does the unified heart of an entire race get, with blood sacrifices urging it on?\u003c/p\u003e\n\u003cp\u003e“Such strength! I wish to defeat it. I shall strike down the ascension of your race, and crush your hopes completely!”\u003c/p\u003e\n\u003cp\u003eA deep and dark power could instantly be seen in Leylin’s eyes.\u003c/p\u003e\n\u003cp\u003e“Devour!” Leylin willed it, and the altar creaked like it couldn’t bear the weight. The ground began to shake as if there was an earthquake, creating numerous dark holes.\u003c/p\u003e\n\u003cp\u003eHeat! Lunacy! Energy that was filled with soul force surged out from the altar like a tsunami.\u003c/p\u003e\n\u003cp\u003e“Mm…” Leylin’s expression was incomparably sinister for an instant, all sorts of emotions flashing in his eyes. The barbarian spirits were extremely crazed and vengeful, launching forth with all sorts of snarls and counterattacks as they began their last struggle.\u003c/p\u003e\n\u003cp\u003eIt was a pity that this was a minor issue for Leylin. After all, he was experienced with souls.\u003c/p\u003e\n\u003cp\u003e“Hss…” The phantom of a Targaryen emerged in Leylin’s mind, and in one mouthful devoured the numerous souls and conscients. In the face of Leylin’s soul origin, the attack from these valiant souls were as weak as ants.\u003c/p\u003e\n\u003cp\u003eVaried soul force burst forth as they shattered, carrying berserk emotions and numerous memory fragments.\u003c/p\u003e\n\u003cp\u003e“A soul is a small matter. The issue is that there’s still these berserk emotions within the soul force…” Leylin sighed.\u003c/p\u003e\n\u003cp\u003eThe basic requirement to absorb divinity was that one was legendary, and this was not without reason. Those who were yet to cross that threshold wouldn’t even be able to live through the attacks of these souls.\u003c/p\u003e\n\u003cp\u003e“God… I pray that you protect our barbarian race!” “You must make the barbarians the most powerful race!” “Please ensure the survival of the barbarians…” “I want to have meat. I want meat everyday…”\u003c/p\u003e\n\u003cp\u003eSuch chaotic thoughts appeared in Leylin’s mind that they could cause a regular person to go mad. Even someone with legendary strength could acquire a mental disorder, the chaotic soul energy causing cracks in their memories.\u003c/p\u003e\n\u003cp\u003eHowever, Leylin had the A.I. Chip. He also had prior experience in this area, and his own soul origin was near rank 7. He could still take this.\u003c/p\u003e\n\u003cp\u003e“Hss…”\u003c/p\u003e\n\u003cp\u003e“I am the limitless Jörmungandr, the master that devours all things!” The Targaryen phantom appeared in Leylin’s pupils, and the power of devouring appeared, forming spirals that devoured all the chaotic soul origins at one go.\u003c/p\u003e\n\u003cp\u003eAfter being converted, the strength surged into Leylin’s sea of consciousness.\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s prompt sounded at this moment. [Beep! Host has taken in a large amount of energy, determined to be soul origin essence. Absorbed!]\u003c/p\u003e\n\u003cp\u003eLarge amounts of icy streams of air converged in Leylin’s mind, allowing his spiritual force to revolve rapidly.\u003c/p\u003e\n\u003cp\u003e[Beep! Host has absorbed soul energy. Spirit +1]\u003c/p\u003e\n\u003cp\u003eThe accumulations of the barbarian tribe over countless years had made things easy for Leylin, and even allowed him to raise his spiritual force.\u003c/p\u003e\n\u003cp\u003eLeylin looked at his hands and murmured, “My spiritual force has increased a bit. I feel like every small increase in stats past fifteen points is a huge advance.”\u003c/p\u003e\n\u003cp\u003eThe A.I. Chip’s prompts continued. [Beep! Host’s spirit has broke through, becoming rank 16 arcanist!]\u003c/p\u003e\n\u003cp\u003eAt this moment, his stats were refreshed.\u003c/p\u003e\n\u003cp\u003e[Leylin Faulen. Age: 22. Race: Human, Rank 16 Arcanist. Strength: 13. Agility: 11. Vitality: 12. Spirit: 16. Arcane energy: 160 Status: Healthy. Feats: Sturdy, Erudite, Elementary Perfect Body. Specialties: Arcane Energy Detection, Arcane Amplification.]\u003c/p\u003e\n\u003cp\u003e[Progress on Weave analysis: Level 0: 100%, Level 1: 100%, Level 2:100%, Level 3:100%, Level 4:100%, Level 5: 67.35%, Level 6:41.91%, Level 7:22.33%.]\u003c/p\u003e\n\u003cp\u003e[Spell slots available: Rank 7(2), Rank 6(5), Rank 5(7), Rank 4(???), Rank 3(???), Rank 2(???), Rank 1(???), Rank 0(???)]\u003c/p\u003e\n\u003cp\u003eThe advancement of arcanists required growth in both spiritual force and soul force, as well as the comprehension and sensing of arcane energy. However, with Leylin’s attainments in magic with his main body, he already surpassed many legendary arcanists. There was practically no bottleneck for his advance, and his spirit breaking through automatically led to a rise in his rank.\u003c/p\u003e\n\u003cp\u003e‘The barbarian tribe hasn’t formed a divinity yet. Just a bit of the power of faith mixed with soul energy can help me increase a rank? Perhaps I should focus on finding information in this area…’\u003c/p\u003e\n\u003cp\u003eIn Leylin’s eyes, the power of faith was the power of emotion, and also soul force. There had been no bottlenecks in his advancement, and all he needed was enormous energy and his ability of devouring. When all the conditions were met, he could quickly advance.\u003c/p\u003e\n\u003cp\u003eFor Leylin, this was also a shortcut to more power. As long as there were barbarian worshippers, it was possible that they had formed great soul energy like this, be it in the outer seas or various other areas in the continent.\u003c/p\u003e\n\u003cp\u003eOf course, if an altar had truly gathered divinity, Leylin would not dare devour it. If not, his own temperament could change, and that was not something trivial.\u003c/p\u003e\n\u003cp\u003eBecoming the patron saint of the barbarians would be even worse than killing himself.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-930\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-932\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-931","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
