{"id":59502,"no":946,"title":"Chapter 946","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eFleeing\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“With how powerful Magi who comprehend laws are, just a fragment should contain a portion of his conscient and memories. There might even be a chance of getting some inheritance…” Leylin muttered, “I must get that Nightmare Wizard’s inheritance!”\u003c/p\u003e\n\u003cp\u003eDreamforce had always interested Leylin. The A.I. Chip stored the progress on his work the data from his continued experiments. He’d never given up studying it.\u003c/p\u003e\n\u003cp\u003eRank 7 Magi needed to grasp powerful laws, while rank 8s needed to find their own path to fuse these laws, using a certain power as the base.\u003c/p\u003e\n\u003cp\u003eLeylin’s goal was immortality, and he had definitely considered the future properly. If possible, he definitely wanted to use the origin forces from the Magus World and World of Gods to fuse his own laws. It was a pity that this was impossible. He might alarm the two World Wills, and on top of that there were other existences that wouldn’t allow him to do so.\u003c/p\u003e\n\u003cp\u003eDreamscape was the next greatest power. It surpassed big worlds like the Purgatory and Icy Worlds, and if not for its weakening phase the two strongest worlds in ancient times would have been joined by a third.\u003c/p\u003e\n\u003cp\u003eDreamforce at its peak was the most powerful origin force beside those of the Magus World and World of Gods. Only a path that fused laws with dreamforce would stand up to Leylin’s ambition!\u003c/p\u003e\n\u003cp\u003eHowever, to completely analyse dreamforce and find ways to evade the weakening phase was still a huge and arduous task for him now. Even with help from the A.I. Chip, he estimated that it would require over ten thousand years.\u003c/p\u003e\n\u003cp\u003eInstead, a bright future was right before him. As long as he obtained the legacy of the Nightmare Wizard, then the issue with dreamforce could be immediately solved! With such a huge temptation, Leylin’s inquiring footsteps were unhindered by the great dangers within the forest.\u003c/p\u003e\n\u003cp\u003e“Captain! We’ve interrogated the prisoners. Miss Isabel was forced into this forest. Every full moon, the forest will be filled with great danger, and nobody has ever survived!” Robin Hood was extremely glum, while the knife at Ronald’s hip was stained with blood, his expression dark.\u003c/p\u003e\n\u003cp\u003e“I’m going in,” Leylin suddenly spoke.\u003c/p\u003e\n\u003cp\u003e“Captain!” “My lord, let me go!” Robin Hood and Ronald immediately persuaded him not to. From their point of view, they had already lost Isabel to a trap, and if Leylin too were to disappear within it all that awaited them would be the ire of the Faulen Family.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, I’m confident in myself. Tell the pirates not to get close to the forest and the dark red fog. It’s best they retreat close to the coastline…” Leylin waved his arms and spoke resolutely. He inspired more fear than even Isabel in the older Scarlet Tigers, and his orders were carried out decisively.\u003c/p\u003e\n\u003cp\u003e”Is this contamination from a combination of mutated dreamforce and the laws of the World of Gods?” Leylin put on his wizard robes and wore his dragonhide armour. The Red Dragon Staff in hand roared, and the cries of the dragon soul inside could somewhat be heard from the crystal grabbed by the dragon claw.\u003c/p\u003e\n\u003cp\u003eAs he had rejected the pleas of Robin Hood and the rest, he was now alone. That meant he could use his strength as he pleased. The pirates would only have been a burden in areas contaminated with dreamforce.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, begin transformation!” Standing at the side of the forest, Leylin immediately commanded.\u003c/p\u003e\n\u003cp\u003e[Beep! Transferring Dreamscape spell model, fusing with arcane spell information. Begin creation of arcane dreamforce spell model!] The A.I. Chip loyally carried out Leylin’s order.\u003c/p\u003e\n\u003cp\u003e“Arcane dreamforce spell— Eternal Light!” Leylin pointed his right index finger forward, and a milky-white flame flew from the tip of his finger. It grew with the wind, reaching the size of a pumpkin in an instant.\u003c/p\u003e\n\u003cp\u003eThe dark red fog dissipated under the pure white flames, revealing the original appearance of the forest.\u003c/p\u003e\n\u003cp\u003e“A.I. Chip, scan for energy undulations!” Leylin flipped his palm over, and the shattered alert rune appeared once more. A scan gave him the general direction, and he disappeared into the thick fog.\u003c/p\u003e\n\u003cp\u003eThe moment any dark red fog entered his surroundings, it would be engulfed by his Eternal Light spell. It formed a strange isolated area around him.\u003c/p\u003e\n\u003cp\u003eLeylin’s decision to explore the area was naturally because he was confident in himself. He could rely on arcane dreamforce spells!\u003c/p\u003e\n\u003cp\u003eWith his research in the Magus World, he possessed many spell models for dreamforce spells. Using his arcanist inheritance, he could easily convert them for use in the World of Gods. There was no issue at all given the A.I. Chip’s powerful analysis and calculation abilities.\u003c/p\u003e\n\u003cp\u003e“Dreamforce spells are the best way to deal with beings contaminated by dreamforce,” Leylin sighed.\u003c/p\u003e\n\u003cp\u003eA dark red fireball immediately burnt a strange ent up ahead to ashes. Unlike Isabel’s, his attacks left the monsters with no chance of revival.\u003c/p\u003e\n\u003cp\u003e‘I’m close… Over there!’ All of a sudden, Leylin’s brow twitched. A large pair of wings instantly sprouted from his back, allowing him to soar into the sky…\u003c/p\u003e\n\u003cp\u003eMeanwhile, Isabel’s crisis had reached its crescendo.\u003c/p\u003e\n\u003cp\u003e“Scram!” Angered cries and terrifying flames caused a large centipede to take several steps backwards.\u003c/p\u003e\n\u003cp\u003e“Keke… too weak… too weak…” Strange human faces were sticking out of this monster’s outer shell. Amongst them were those belonging to the pirates under her, their eyes emitting a red lustre as they began to snicker.\u003c/p\u003e\n\u003cp\u003eHer draconic flames left not a trace on the monster’s shell, as if it had a defensive power that made it hard to destroy.\u003c/p\u003e\n\u003cp\u003e“Become a part of me!” One of the faces opened its mouth, corrosive green liquid spraying out like rainwater.\u003c/p\u003e\n\u003cp\u003eEven the dragonscale defence sputtered upon contact, steam billowing out. The immense pain from the corrosion caused Isabel to frown hard.\u003c/p\u003e\n\u003cp\u003e“Quick, come!” Karen appeared at the side, pulling at Isabel’s arm and running.\u003c/p\u003e\n\u003cp\u003e“I never thought it would just be the two of us left. I shouldn’t have come in.” Isabel now looked regretful.\u003c/p\u003e\n\u003cp\u003e“This is not the time to worry about that. Sister Isabel, I’ve taken a look around. The dark red fog wall seems to show signs of dissipating. As long as we hang on for a while longer, we can exit this place!” Karen encouraged her.\u003c/p\u003e\n\u003cp\u003e“Leave… haha…” Isabel now looked extremely pathetic, but much of the damage was to her mind. She had never thought she would see such strange things as she had this day. It was more than she had experienced in her lifetime.\u003c/p\u003e\n\u003cp\u003eAfter she had brought her subordinates and retreated into the forest, all sorts of weird things had appeared when night fell. At the beginning, she had thought it was some sick joke, but she soon found that she had to pay for that in blood.\u003c/p\u003e\n\u003cp\u003eTrees that could walk, flowers and grass that could sing, stones that had qi, the dead being able to revive, numerous clowns… All sorts of things she could not even name attacked them in succession. They were grotesque and variegated, almost causing her to think that she had gone insane.\u003c/p\u003e\n\u003cp\u003eThe subordinates under her fell one by one, gulped down by either real or imaginary beings. Now, only she and Karen were left.\u003c/p\u003e\n\u003cp\u003e“That centipede monster is very strong and at least has legendary strength. Does that mean we can only evade… Hm? What is it, Karen? Are you hurt?”\u003c/p\u003e\n\u003cp\u003eIsabel looked at Karen beside her. The half-drow now had her back to Isabel, shoulders trembling slightly.\u003c/p\u003e\n\u003cp\u003eA palm touched Isabel’s shoulder, and her expression immediately changed, “There’s no heat. You’re not Karen!”\u003c/p\u003e\n\u003cp\u003e“Hehe… adorable little captain, if I’m not Karen, who else can I be?” Karen turned back, light shining on half her face. However, Isabel’s pupils only shrunk. Her beautiful face had now split from the middle, revealing terrifying white razor-sharp teeth, as if her face had turned into a large mouth.\u003c/p\u003e\n\u003cp\u003e“Damn it, what the hell are you?” Isabel yelled. Terrifying flames formed rings of fire that were several metres long, managing to get ‘Karen’ to back off.\u003c/p\u003e\n\u003cp\u003e“Heehee… What could I be?”\u003c/p\u003e\n\u003cp\u003e*Rumble!* The earth split, and the human-faced centipede appeared once more. Karen snickered as she dug her hands into the centipede and fused with it. At the end, the monster that looked like Karen completely disappeared, its only remnant a pale face.\u003c/p\u003e\n\u003cp\u003e*Chi! Chi!* The huge centipede let out earth-shattering cries, cold air bursting forth from its mouth. The surrounding trees and soil were covered in a layer of ice.\u003c/p\u003e\n\u003cp\u003e“It has a clone with a power of ice, and can’t die. Gods… Could this be some sort of special variant of god?” This was the only conclusion Isabel could come up with. The terrifying chilliness began to freeze her body, causing even the dragonblood in her body to still.\u003c/p\u003e\n\u003cp\u003e“No, I can’t die here!” Isabel looked resolute as the red scales on her body exploded.\u003c/p\u003e\n\u003cp\u003e“Blood Explosion!” The bloody red fog blocked the ice off, finally giving Isabel a route of escape.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-945\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-947\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-946","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
