{"id":59523,"no":967,"title":"Chapter 967","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eSkeleton Lich\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eBerserk energy from the four elements roared in a large semi-plane outside the prime material plane, causing ripples in the sky. The sky seemed to distort and shatter.\u003c/p\u003e\n\u003cp\u003eThere was no sun nor moonlight here, only a sparkling ambient light. Layers of ashen-white bones littered the ground, their height unknown. There were some little white flowers growing out of eye sockets, the most beautiful flower buds blooming. Numerous vines crawled over the bones, as if subsisting on them.\u003c/p\u003e\n\u003cp\u003eA gale blew past the area, and it was like a rain of flowers as the plants dispersed to reveal bones on the ground. This plane was actually formed of all sorts of bones piled together.\u003c/p\u003e\n\u003cp\u003eThese bones were about the same size as those of humans. Some were exceptionally small but thick, likely coming from halflings and dwarves. There were even some extremely large animal bones scattered in the area, forming little hills.\u003c/p\u003e\n\u003cp\u003eThis semi-plane was one of bones, on the verge of being smashed into pieces. It was hidden in the gaps between numerous dimensions, unvisited for a long time.\u003c/p\u003e\n\u003cp\u003e*Ka-cha! Ka-cha!* At this moment, a slight cracking sound could be heard from underground, followed by some shaking.\u003c/p\u003e\n\u003cp\u003e*Gulu! Gulu!* A hill of bones gave way, and large amounts of smoke and dust were sent flying. Meanwhile, a protruding round head rolled out of a crevice in the ground.\u003c/p\u003e\n\u003cp\u003eThis was a dazzling human skull. The eye sockets flickered with two still flames, and dead black soul force lingered around the area, emitting powerful undulations. The skull’s teeth chattered and its jaws creaked, seemingly shaking in confusion.\u003c/p\u003e\n\u003cp\u003e“I’ve been asleep for a thousand years…” The skull spoke in a desolate voice, its tone ancient. Only a scholar who had researched the past would be able to understand it.\u003c/p\u003e\n\u003cp\u003e*Crunch!* The skull meshed its teeth together and seemed to spit out something similar to parchment paper. A layer of light flickered, and letterings as well as a map were projected in the air.\u003c/p\u003e\n\u003cp\u003e“The year where the elemental tides streak through, when the black crows cry out to the blood moon… The Simoshel Canyon… east of Cygnus!” A fire blazed in the skull’s eyes as it found a few sparkling bones, slowly recreating its body.\u003c/p\u003e\n\u003cp\u003e“The floating city. The best achievement of the arcanist era, able to match up to the gods’ divine kingdoms…” The skull spoke as if it was chanting, an aura of despair from the very soul covering the area like a cloak.\u003c/p\u003e\n\u003cp\u003e“That floating city is definitely mine! The Skeleton Lich, Ilyo Paxlude!” A staff of bones automatically moved its way to the lich, a blood red gem at its top emitting crimson light.\u003c/p\u003e\n\u003cp\u003e*Roar!* The lich tapped the ground with his staff, and it split apart to reveal the head of an enormous creature.\u003c/p\u003e\n\u003cp\u003eThis creature was tens of metres tall, with large bony wings and two heads that looked abnormally sinister. A brilliant soul energy could be seen within the thing’s skull. This was evidently the necromancer’s favourite pet— A two-headed bone dragon!\u003c/p\u003e\n\u003cp\u003e“Keke… Let’s go, darling…” Strong winds blew, and the double-headed bone dragon flapped its wings, carrying the skeleton lich on its back and entering the terrifying elemental storm. The violent storm seemed to quiet under their might, forming a pitch-dark channel.\u003c/p\u003e\n\u003cp\u003eThe bone dragon roared and disappeared at the end of the plane...\u003c/p\u003e\n\u003cp\u003ePeople had gotten wind of this at several other places.\u003c/p\u003e\n\u003cp\u003e“Abnormal movements from the bone kingdom? Seems like that lich has awoken…”\u003c/p\u003e\n\u003cp\u003e“Ilyo… It’s really been a long time. I have yet to settle that grudge with him…”\u003c/p\u003e\n\u003cp\u003e“The envoy of death, the skeleton lich? How interesting…”\u003c/p\u003e\n\u003cp\u003eAll sorts of mysterious godly conscients flickered all over the world, and then all focused on the bone kingdom without prior agreement.\u003c/p\u003e\n\u003cp\u003eA few gazes seemed to have their own goals, heading towards the western desert.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eScorching sunlight fell on the sand dunes, causing heat waves that distorted the air. Practically all moisture had evaporated, and each breath one took in this place was like breathing in fire.\u003c/p\u003e\n\u003cp\u003eThe desert’s surface was reaching the limits of temperature, and could practically roast a person alive! The entire desert looked like a place disallowing of life. Even the scattered cacti around the area had disappeared, and there was not even a hint of greenery.\u003c/p\u003e\n\u003cp\u003eThe leading swordsman looked at the map in his hands, beginning to check the distance, “We’re already very deep into the desert, so we have to do our best to retain our strength. We’ll also need to plan for our items and water… What’s wrong, Allerie? Still thinking about the dream that night?”\u003c/p\u003e\n\u003cp\u003eUpon looking up, he found the wizard in his group had grown absent-minded once more, and his question revealed a slight annoyance.\u003c/p\u003e\n\u003cp\u003e“No, I’m feeling better now… it’s just this weather…” Allerie gathered hair behind her ear and felt her dry skin while sighing inside. That dream no longer disturbed her, but the terrible environment in the desert was now giving her a vivid lesson. Even with the protection of magic, she felt this difficult to endure.\u003c/p\u003e\n\u003cp\u003eSeeing this, the swordsman could only curse in his mind at the nonexistent stamina of wizards. Still, there was nothing that could be done. He encouraged her, “Hang on for a while. We’ll reach the dream oasis soon enough, so you can get some rest there…”\u003c/p\u003e\n\u003cp\u003eThe mention of the dream oasis perked up everyone in the group. They were currently deep inside the western desert, and it was exceedingly dangerous. Terrifying black sandstorms could erupt at any moment.\u003c/p\u003e\n\u003cp\u003eEven if they were near legendary adventurers, there was nothing they could do in the face of nature; there would still be dangers.\u003c/p\u003e\n\u003cp\u003eThe dream oasis was the only source of water in the depths of the western desert. It was said that this was a moving crescent lake and shrub forest, as well as the only hope for survival that lost travellers had.\u003c/p\u003e\n\u003cp\u003e“My most recent information, and this map, all indicate the dream oasis is up ahead. We can’t be wrong!” The swordsman yelled to raise the morale. With that hope, the group sped up quite a bit.\u003c/p\u003e\n\u003cp\u003eHowever, none of them realised that someone had noticed all their actions from behind them.\u003c/p\u003e\n\u003cp\u003e“The dream oasis… That place is very close to Frostfall Valley… I might not even have found it if not for these guides…” Leylin was riding a sand scorpion, a winged eyeball flapping in front of him. It showed him scenes of those people.\u003c/p\u003e\n\u003cp\u003eWith the group of adventurers showing the way, he did not need to take detours. As long as he followed the safe path they did, everything would generally be fine. With the distance limiting them, normal detection spells wouldn’t be able to find him.\u003c/p\u003e\n\u003cp\u003e“Once here… How do I say this… their value is decreasing…” Leylin stroked his chin. In his opinion, this group was the weakest wave of those eyeing the floating city. “But they seem to have a leader. I’ll just put them ahead and see what they attract…”\u003c/p\u003e\n\u003cp\u003eLeylin patted the scorpion he was riding, and the large beast immediately cried out. It’s eight legs alternating in motion as it sped up its advance through the desert…\u003c/p\u003e\n\u003cp\u003eThere was nothing to see along the way in the desert but sand, except the bones of all the monks that had died. Leylin had even noticed a withered corpse with no moisture, one that looked like a mummy.\u003c/p\u003e\n\u003cp\u003eMonks trained by toying with their lives. Without clear water, they would end up dead, and there were few who would be saved by kind-hearted merchant groups.\u003c/p\u003e\n\u003cp\u003e“But… it seems too calm…” No longer bothering with the many corpses buried by sand, Leylin urged the sand scorpion to keep moving forward.\u003c/p\u003e\n\u003cp\u003eThe western desert definitely had many dangers. However, there was a group of elite high-ranked Professionals ahead. Besides natural disasters like the black sandstorms, they could deal with anything. Their numbers hadn’t even dropped yet.\u003c/p\u003e\n\u003cp\u003eWhile it seemed normal, Leylin found something strange. The path to the floating city shouldn’t have been so clear.\u003c/p\u003e\n\u003cp\u003eIt was at this point that Leylin’s face showed a sudden understanding, ‘It appeared… I never thought that there would be natives deep within the western desert. Could these people be remnants of Netheril?’\u003c/p\u003e\n\u003cp\u003eAt this thought, he gave up his ride and cast a flight spell, soaring into the air while flapping his wings.\u003c/p\u003e\n\u003cp\u003eOnce he passed countless sand dunes, a deep green entered his eyes. In a place where the only thing on the horizon was yellow sand, there was a sparkling crescent lake and a large oasis. Seeing this in an area void of life could move someone emotionally.\u003c/p\u003e\n\u003cp\u003eHowever, there were signs of disharmony here. A vigorous fight had already begun near the oasis.\u003c/p\u003e\n\u003cp\u003e“No wonder I felt something was off. This was the place!” Leylin looked like he realised something all of a sudden.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-966\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-968\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-967","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
