{"id":59524,"no":968,"title":"Chapter 968","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eDesert Tribe\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eA gruesome massacre unfolded by the oasis. A group of men in strange clothing attacked the adventurers from camelback. They wore the trademark attire of the desert people, loose white robes with a scarf wrapped thickly around their heads to reveal nothing but a pair of wolf-like eyes.\u003c/p\u003e\n\u003cp\u003eTheir leader whistled, and the men encircled the adventurers. Some of them drew their bows.\u003c/p\u003e\n\u003cp\u003eThe expressions of these adventurers turned worse. They were already at a numerical disadvantage, and now high-grade equipment was being used against them.\u003c/p\u003e\n\u003cp\u003e“What are they saying?” Allerie asked the assassin after casting a few defensive spells on herself.\u003c/p\u003e\n\u003cp\u003e“They say we’ve intruded on their lands, and they will use our blood and lives to wash away our sins…” the leader explained in a hurry, his face dark. “We’re in deep trouble. This is a desert tribe, the western desert is their home. They also possess a strange ability to cast curses!”\u003c/p\u003e\n\u003cp\u003e“Hacaree! Hacaree!” The desert warriors shouted, some rushing forwards as others released the nocked arrows.\u003c/p\u003e\n\u003cp\u003eA few bamboo-thin warriors leapt into the sky, brandishing jewelled sabres in a beautiful arc.\u003c/p\u003e\n\u003cp\u003e“Good timing!” The assassin leader shouted, striking out with the dagger in his hand. Any icy streak felled many of the desert warriors, and the sabres in their hands shattered apart into pieces, looking like dancing butterflies.\u003c/p\u003e\n\u003cp\u003e“Captain! How could you strike first, and fatally at that?” The other adventurers looked on in disbelief at their leader.\u003c/p\u003e\n\u003cp\u003e“We don’t have a choice,” the assassin smiled wryly, “The word ‘Hacaree’ means leave none alive…”\u003c/p\u003e\n\u003cp\u003eThey didn’t have the leisure to converse for long. The desert tribe leader hopped off their camel, dashing towards the assassin. A thick, bulky sabre whistled through the air, just the wind it formed making the assassin apprehensive.\u003c/p\u003e\n\u003cp\u003e“Howling Moon Art!” the assassin howled. His dagger met the sabre with a clang as qi surged into the surroundings. Countless pits were formed in the desert sands.\u003c/p\u003e\n\u003cp\u003e“Secret technique— Dual Serpentines!” Just as the two blades were about to clash, the desert leader burst forth with a second weapon. A small dagger appeared in their hand, and it was thrust directly at the assassin’s eye.\u003c/p\u003e\n\u003cp\u003e“Captain!” The female wizard cried out. She pointed forward with her index finger, “Mage Sword!”\u003c/p\u003e\n\u003cp\u003eAn illusory blade appeared in mid air, deflecting the fatal blow from the desert leader.\u003c/p\u003e\n\u003cp\u003e“Damn it, get lost!” The assassin unleashed all his strength on the brink of life and death. The muscles in his body began to bulge, and he’d soon turned into a miniature giant. His dagger thrust forth with greater force, sending his opponent straggling backwards.\u003c/p\u003e\n\u003cp\u003eThe tribe leader cried out before hopping away like a nimble swallow.\u003c/p\u003e\n\u003cp\u003e“A woman?” This assassin felt the back of his neck tingling. The cry had been high-pitched, and his opponent’s eyes were as clear as water. In his carelessness, he’d almost had his eyes gouged out by a woman.\u003c/p\u003e\n\u003cp\u003e“What now, captain?” A rain of arrows had thrown the rest of the party into disarray.\u003c/p\u003e\n\u003cp\u003eThe assassin gave his orders. “Gather beside Awar, we’ll break through the encirclement. Allerie, concentrate. Support those who need it!”\u003c/p\u003e\n\u003cp\u003e“Hah! Berserk!” Awar was their group’s berserker, their meat shield. He grunted in a low voice, and the muscles on his body bulged.\u003c/p\u003e\n\u003cp\u003e“Bull’s Strength! Bear’s Endurance!” Allerie had cast multiple buffs on him from the side.\u003c/p\u003e\n\u003cp\u003e“Kill!” Awar seemed like a human tank in this mode, the shield in his hand causing blood to spurt as he knocked many desert warriors away.\u003c/p\u003e\n\u003cp\u003e“Wodarnike! Arberdoniya!” The female desert leader gave a few commands and directed her men in rows of defence. It seemed like she wouldn’t stop until these adventurers were dead.\u003c/p\u003e\n\u003cp\u003eThe assassin inhaled deeply, imbuing a layer of qi in his rusty dagger.\u003c/p\u003e\n\u003cp\u003e“I’m your opponent!” He was showing tenaciousness in the face of danger, choosing to engage directly with the enemy to buy time for his party.\u003c/p\u003e\n\u003cp\u003e*Shing!* The female desert warrior did not say a word. Instead, she crossed her blades and unleashed explosive force. Her body seemed to leave behind an afterimage as she dashed towards the assassin. Her attacks came from all directions, so flexible she seemed boneless.\u003c/p\u003e\n\u003cp\u003e“Hng! Scorching Gale Blade!” The assassin shouted coldly. His eyes blazed as the dagger in his hand unleashed a storm of attacks. He parried the tribe leader’s attacks with the power of a sandstorm.\u003c/p\u003e\n\u003cp\u003e“Ooh… This place actually has martial arts techniques…” Leylin leisurely watched on from the air, a layer of illusion magic around him. “The female warrior isn’t at the legendary realm yet, but her techniques are. The desert tribes do have some talents… This group of adventurers is in danger…”\u003c/p\u003e\n\u003cp\u003eLeylin’s estimates were extremely accurate. The party was in unfamiliar lands and at a numerical disadvantage. It couldn’t be made up for with just a sudden burst of strength.\u003c/p\u003e\n\u003cp\u003e*Thud! Thud!* Yellow sand flew into the sky. The desert warriors didn’t engage Awar head on, instead dragging multiple metal chains from camelback to trap him.\u003c/p\u003e\n\u003cp\u003e*Peng! Peng!* The berserker continued to roar furiously, but he was still trapped like a bug in a spiderweb, and couldn’t resist at all. His roars grew softer over time, and he turned dispirited as his body shrunk back to normal.\u003c/p\u003e\n\u003cp\u003e“Not good, his berserk mode has ended!” Looking on, Allerie went forward and shove a spiritual force potion down Awar’s throat, her face filled with worry. Even with the resolution of the assassin, he could not help but be demoralised looking at the current circumstances.\u003c/p\u003e\n\u003cp\u003e“Hmm… Without any reinforcements, these adventurers will most likely perish here…” Leylin concluded from mid-air. However, he turned solemn as he looked in another direction. Somewhat apprehensive, he distanced himself from the location, “It looks like their backup is here.”\u003c/p\u003e\n\u003cp\u003eAlthough he’d covered his tracks with illusory magic, someone at the same rank could still discover him.\u003c/p\u003e\n\u003cp\u003eA loud, hazy noise sounded from the direction Leylin was looking in. It sounded like the chirping of a thousand birds, and thunder from the sky.\u003c/p\u003e\n\u003cp\u003e*Boom!* A bright starlike object appeared in the broad daylight, forming a dazzling afterimage as it whizzed over to the location. As the object drew closer, it became clear that it was a spear. It was travelling so fast that the friction with the air had turned it bright red, as if ready to melt at any time.\u003c/p\u003e\n\u003cp\u003eLeylin could only see this because of the power of his sight. The desert warriors could only see a dazzling light shooting towards them, piercing several warriors and camels to arrive at their leader.\u003c/p\u003e\n\u003cp\u003eFacing such an attack, the tribe leader turned solemn. She withdrew both her hands, crossing the blades in front of her chest.\u003c/p\u003e\n\u003cp\u003e*Bang!* A loud explosion sounded, and steam rose from the ground. The smell of rust followed.\u003c/p\u003e\n\u003cp\u003eThe dust and sand settled to reveal the absence of the female warrior. Only broken bits of a sabre were scattered around where she’d stood.\u003c/p\u003e\n\u003cp\u003e“Uwuuu~~” As if receiving some sort of order, the desert warriors immediately turned their backs and fled, not lingering for one bit. Their retreat was quick, and none of them could be seen after a few breaths. Only the flurried tracks of their camels remained.\u003c/p\u003e\n\u003cp\u003e“It’s our Lord! He’s here!” Allerie squealed, and the assassin and other members heaved a sigh of relief.\u003c/p\u003e\n\u003cp\u003e“You guys are late!” A booming voice sounded as a giant metallic arm reached for the spear.\u003c/p\u003e\n\u003cp\u003eThe speaker had curly wine-red hair and a silvery unibrow. The expression on his face was extremely stern, commanding respect and intimidation.\u003c/p\u003e\n\u003cp\u003eThe assassin’s face turned slightly pale, and he spoke in a soft voice. “Our apologies, Lord Rogero. We met with some circumstances on the road…”\u003c/p\u003e\n\u003cp\u003e“Thank you for saving us, my Lord!” Allerie’s eyes held a tinge of adoration, but Rogero didn’t care about that in the least.\u003c/p\u003e\n\u003cp\u003e“You bunch of useless creatures! Such a simple matter and you already can’t deal with it…Moreover…” Rogero’s gaze seemed dazzling to Allerie as he looked her over from face to belly. It caused the wizard to turn red.\u003c/p\u003e\n\u003cp\u003e“You couldn’t even realise you were being followed. You group of fools!” Rogero’s puzzled look began to be replaced with rage.\u003c/p\u003e\n\u003cp\u003e“Hm? Followed? No way, I…” The female wizard looked blankly at the spear pointed at her, feeling flabbergasted.\u003c/p\u003e\n\u003cp\u003eSoon after, she looked at her hands in stupefaction. Her original jade-white skin was now covered in thick, pus-filled sarcomas. The tumours erupted, causing her to wail loudly.\u003c/p\u003e\n\u003cp\u003e*Sssii!* White smoke rose from the body of the female wizard, and her blood-curdling screams struck fear into the heart of the others. There was no wizard by the time the smoke dissipated, only a puddle of pus left on the sand.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-967\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-969\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-968","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
