{"id":59535,"no":979,"title":"Chapter 979","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eBenedict\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe orcs were the ones who’d instigated the war, and on top of that they’d committed such a huge atrocity afterwards. The elven and halfling gods would not support them much. They thought the orcs too ruthless, and developed a desire to contain them.\u003c/p\u003e\n\u003cp\u003eThis put the orc gods in a predicament. If it continued without end, they would likely only be able to find allies from the abyss or the hells.\u003c/p\u003e\n\u003cp\u003eThis was why the orcish gods went all out in their search for new blood, especially the Blackblood Tribe in the Moonwood and the God of the Hunt, Malar. Orcs and werecreatures weren’t much different, and they even looked rather similar.\u003c/p\u003e\n\u003cp\u003eOn top of that, Malar’s original form was that of a huge ape-like monster, so there was a high chance of him joining their side. With their tough situation, the orc gods would be relentless in their pursuit of this chance.\u003c/p\u003e\n\u003cp\u003eThe decision from up above ensured that the orc empire tried to befriend Blackblood Tribe. They’d only be making a din in the dark forest at most, and with the territories that the orc empire now had, it wouldn’t be too much trouble to give them that land.\u003c/p\u003e\n\u003cp\u003eWhile orcs were the majority, there were still an astounding number of humans left in the north. After all, only the human race could measure up to them in terms of their rate of reproduction. The effects of the humans’ reign over so many years were not so easily removed.\u003c/p\u003e\n\u003cp\u003eIn reality, despite the establishment of an orc empire many places weren’t under their control. There were even a few armies hidden in the corners of the north, giving Saladin a headache.\u003c/p\u003e\n\u003cp\u003eWith all the racial conflict, these rebel armies received the support of multiple organisations both in public and in the shadows. They’d won a few battles and liberated some cities, leaving the orcish armies up to the ears in work.\u003c/p\u003e\n\u003cp\u003e“While there’s a revolt from the humans in the north, this is all guerrilla warfare, and there isn’t a real leader and flag. This makes Alustriel key…”\u003c/p\u003e\n\u003cp\u003eLeylin finally understood why the church of justice would begin a plan to reclaim the kingdom now. Some time ago, the orc empire’s strength had been concentrated and been difficult to deal with. Things were different now though, since taking over land and completely occupying it were very different things.\u003c/p\u003e\n\u003cp\u003eThey were now scattered across the northern lands, making the orc army thin out. It was no wonder that just a guerrilla band could achieve victory so easily.\u003c/p\u003e\n\u003cp\u003eTens of years later, the people of the north might succumb under the government of the orcs and completely forget about Alustriel. After all, the adaptability of humans was fairly terrifying.\u003c/p\u003e\n\u003cp\u003eHaving seen this all, Leylin could not help but shake his head.\u003c/p\u003e\n\u003cp\u003e‘Tsk tsk… Even though they’ve grasped a good opportunity, it’ll be difficult to completely reclaim the kingdom.’ Based on his deductions, Alustriel being able to establish a few bases to go against the orc empire was already rather impressive.\u003c/p\u003e\n\u003cp\u003e“The church of justice will recruit legendary beings, probably not just to deal with Saladin but also the avatars of the orc gods…”\u003c/p\u003e\n\u003cp\u003eLeylin’s eyes glinted as he quickly went through the pros and cons.\u003c/p\u003e\n\u003cp\u003e“I now have too little information, so I can only consider working with them after meeting Rafiniya and other Legends…”\u003c/p\u003e\n\u003cp\u003eRubbing at his temples, Leylin pondered over his next course of action before leaving the room.\u003c/p\u003e\n\u003cp\u003e“Master…”\u003c/p\u003e\n\u003cp\u003eNext to the door, there were two pretty maids that had been waiting for a long while who quickly knelt down.\u003c/p\u003e\n\u003cp\u003eLeylin could smell the scent of a purebred Pleasure Devil on them. However, their eyes were now filled with adoration and reverence for him.\u003c/p\u003e\n\u003cp\u003eAfter all, Leylin’s soul essence was practically like half a devil archduke.\u003c/p\u003e\n\u003cp\u003eAll devils who sensed his abstruse and dark strength would naturally do all they could to get close to him. This was an instinct of devils at all times, imprinted deeply into their genes.\u003c/p\u003e\n\u003cp\u003e“Hm, not bad!”\u003c/p\u003e\n\u003cp\u003eLeylin had no plans of being a saint now and placed his arms around the beautiful female devils who were like sisters, and entered the bedroom...\u003c/p\u003e\n\u003cp\u003eThe next day, having removed his other appearance and regained his looks as a wizard, Leylin entered the outer parts of Yorkshire’s church of justice.\u003c/p\u003e\n\u003cp\u003e“I’m here to see Rafiniya. This is the token she gave me.”\u003c/p\u003e\n\u003cp\u003eLeylin passed an emblem that was gold on one side over. On the base that was like a shield, there was a cross sword and image of a rose.\u003c/p\u003e\n\u003cp\u003e“Please wait a moment. I will pass on the message for you!”\u003c/p\u003e\n\u003cp\u003eThe church guard’s eyes widened. Leylin’s aura immediately made him feel like he was seeing someone important like the king. He was also in wizard robes, and the power that signified more than shocked him. Hence, he presented himself politely.\u003c/p\u003e\n\u003cp\u003eThe guard who went in returned very quickly, though this time, he bowed so deeply that his nose practically touched the ground, “Welcome, esteemed wizard Leylin! Paladin Rafiniya is now away, but we have already informed her. We believe she will return soon… Many apologies for this. Please take a short rest in the church…”\u003c/p\u003e\n\u003cp\u003eThe guard was actually trembling inside in fear. This was a legend! The pinnacle of strength in the continent, and even a legendary wizard at that!\u003c/p\u003e\n\u003cp\u003eAs the youngest legend, and one that had become one in the most difficult path of a wizard, Leylin’s reputation had long since spread in the continent. However, there were few who had actually met him.\u003c/p\u003e\n\u003cp\u003e“Fine. Lead the way.”\u003c/p\u003e\n\u003cp\u003eLeylin entered alongside the guard, and upon entering through the doors, a few people hastened over, evidently to receive hi.\u003c/p\u003e\n\u003cp\u003e“Oh, Leylin, my friend! We finally meet…”\u003c/p\u003e\n\u003cp\u003eNext to the white-robed bishop of the God of Justice, Leylin saw another noble. His astounding memory caused Leylin to freeze for a second, and then put on a smile while going forward.\u003c/p\u003e\n\u003cp\u003e“Marquis Lancet! Long time no see…”\u003c/p\u003e\n\u003cp\u003eThe noble who had come along with the bishop to meet Leylin was the one who held power over Yorkshire, and the one that had split the territories of a few unlucky noble families, Lancet.\u003c/p\u003e\n\u003cp\u003e“After hearing the beautiful birdsong from skylarks this morning, I knew something great was going to happen. I didn’t expect it would be your arrival…”\u003c/p\u003e\n\u003cp\u003eLancet now had a sincere smile on his face. He had a vivid memory of this kid who had gotten a position as a viscount during the feast of the dividing of lands in the north. Tiff, who he was helping, seemed to be doing something strange, but that wasn’t important!\u003c/p\u003e\n\u003cp\u003eLeylin was now a legend! It was impossible to go wrong with improving their relationship. Actually, Marquis Lancet was already regretting not giving Leylin more.\u003c/p\u003e\n\u003cp\u003e“But… who would have known that he would become a legend in a few years?”\u003c/p\u003e\n\u003cp\u003eLancet observed Leylin’s young face, removing the jealousy deep in his heart with some difficulty and then smiling brightly.\u003c/p\u003e\n\u003cp\u003e“Also… this is a bishop of the God of Justice, Scholar Benedict, who’s also a friend of mine…”\u003c/p\u003e\n\u003cp\u003e“I express my deepest gratitude for Sire’s determination in offering yourself in the name of righteousness… The refugees suffering in the north will never forget your contributions…”\u003c/p\u003e\n\u003cp\u003eBenedict’s voice was kind and resolute, and there was a glint in his eyes unique to those willing to die for their cause.\u003c/p\u003e\n\u003cp\u003eLeylin had no qualms that if Benedict were to be told that his death would save the lives of all commoners of the north, he would kill himself without hesitation.\u003c/p\u003e\n\u003cp\u003eIt was pity that the people who were the most resolute were also the most troublesome...\u003c/p\u003e\n\u003cp\u003e“I’m only here because of a promise with Rafiniya. Whether I’ll make my move at the end and when I do it is my freedom…”\u003c/p\u003e\n\u003cp\u003eLeylin had no plans of being careless with this and answered, causing the atmosphere to turn cold in an instant.\u003c/p\u003e\n\u003cp\u003e“Uh… haha… Whatever it is, having Sire Leylin coming all the way here is already enough… It must have been difficult to come so far. Please get some rest, and you can meet the other comrades later tonight…”\u003c/p\u003e\n\u003cp\u003eLancet’s mind moved quickly and immediately dispelled the awkward atmosphere.\u003c/p\u003e\n\u003cp\u003e“Even though he’s the youngest legendary, has he already been corroded by reputation and power?”\u003c/p\u003e\n\u003cp\u003eAfter Leylin left, great resentment shone in Benedict’s eyes. In his eyes, all legends on the continent were the same. They only wished for power and enjoyment, and never did what they should.\u003c/p\u003e\n\u003cp\u003eThere were few willing to sacrifice themselves in the name of justice, and now this seemed to also go for the youngest to become a legend.\u003c/p\u003e\n\u003cp\u003e“But of course! He became a legendary with much difficulty and reached the peak in the continent. There are countless things for him to enjoy, so what right do you have to make him die for your sake?”\u003c/p\u003e\n\u003cp\u003eLancet snickered inside while maintaining a smile on his face, “Sire Leylin just has yet to come to terms with what’s going on yet. I’m sure with time, he’ll change his mind…”\u003c/p\u003e\n\u003cp\u003e“Sigh… I hope so! The refugees of the north can’t wait for long…”\u003c/p\u003e\n\u003cp\u003eBishop Benedict sighed, looking as if he were bemoaning the state of the universe.\u003c/p\u003e\n\u003cp\u003e“The paladins and priests of the god of justice are all lunatics…”\u003c/p\u003e\n\u003cp\u003eWhile already mentally prepared, Leylin had honestly been scared by his naivety. If the bishop was like this, then he could guess at what the clerics were like. They were definitely not people Leylin would like.\u003c/p\u003e\n\u003cp\u003e“But only a church with such a zealous ambience would attract Rafiniya and have her treat this as her final home…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-978\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/warlock-of-the-magus-world/wmw-chapter-980\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-979","bookId":1513,"creation":"Sep 10, 2019 6:41:22 AM","modification":"Sep 10, 2019 6:41:22 AM"}
