{"id":52131,"no":10,"title":"Chapter 9 - Growth of the Heroes (1)","content":"\u003cp\u003eChapter 9 - Growth of the Heroes (1)\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Magic can’t hurt m……. \u0026nbsp;Koohk!?]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt suffered under his magic before, yet it was replying with the same idiotic answer! \u0026nbsp;Of course, Artpe wouldn’t directly apply his Magic on a Skeleton, who was twice his level!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Magic appeared as if it had been pushed out from the confines of Artpe’s body, and he focused on one of the daggers embedded in the Skeleton Warrior. \u0026nbsp;He focused on the blade embedded within the elbow joint of the arm holding the shield. \u0026nbsp;The Hyper Rubbing was focused on the blade, and it was causing enormous friction! \u0026nbsp;Artpe worried the other blades would fall out from the vibration caused by the intense rubbing, so he had to concentrate his power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[A mere trick was able to damage…..]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I can’t hear you. \u0026nbsp;That trick broke your wide forehead. \u0026nbsp;\u0026nbsp;Why don’t you speak a little bit louder!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Goo-ohhhhhhhhhh!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Skeleton Warrior reacted in a violent manner, and it started to move. \u0026nbsp;Finally, Artpe got the reaction he wanted. \u0026nbsp;\u0026nbsp;The elbow joint had received an incredible amount of stimuli from the rubbing, and when the force of the violent movement was added to the mix, the bones started to let out an ominous sound. \u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA crunch was heard, and the arm was bent backwards in an odd angle!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[I’m a Skeleton! \u0026nbsp;A mere broken bone won’t….. \u0026nbsp;Koohk!?]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You keep following the same pattern in becoming surprised. \u0026nbsp;Aren’t you tired of it?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was beyond the frictional force that arose from the dagger. \u0026nbsp;The Skeleton Warrior used an enormous amount of power to move its arm. \u0026nbsp;\u0026nbsp;In the end, it exceeded the threshold of abuse that could be taken by the joint. \u0026nbsp;\u0026nbsp;The joint was completely destroyed as the heavy shield and the arm holding it fell to the Dungeon’s hallway!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koo-ahhhhhhhhh!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are amazing, Artpe!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Give me more compliments!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Amazing! \u0026nbsp;You are really incredible!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe never suspected the Hyper Rubbing could be used to cause damage to a monster! \u0026nbsp;\u0026nbsp;The fact that it could cause incredible amount of friction was no joke. \u0026nbsp;He had manifested the magic by using the weapon as a medium, and the Skeleton Warrior was unable to resist against the attacking using Mana Resistance. \u0026nbsp;Artpe had been able to attack using friction!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had learned Hyper Rubbing not too long ago, so he wasn’t proficient at using the spell. \u0026nbsp;This was why it took so long to achieve the desired effect. \u0026nbsp;However, if he became adept at using this Magic later on, he would be able to achieve ludicrous results!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Of course, I would achieve better results much faster if I learned other spells during that time!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe grumbled as he once again focused his Hyper Rubbing on a specific target \u0026nbsp;He got rid of the shield, so it was time to destroy the arm holding the sword! \u0026nbsp;He was running a bit short on Mana, but if he was able to destroy both arms, he was confident they could win against it. \u0026nbsp;Artpe didn’t hold back as he used all his reserve power to command his magic.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Goo-oooooooh…...!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs expected, the Skeleton Warrior realized what Artpe was trying to do, but it couldn’t retreat. \u0026nbsp;The rage that was blanketing its body refused to fade away. \u0026nbsp;\u0026nbsp;What should it do? \u0026nbsp;What will allow it to kill the shitty little brat?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Skeleton Warrior thought hard about its situation. \u0026nbsp;After it agonized over its options, it came up with a single answer. \u0026nbsp;\u0026nbsp;It had watched the little brat do it over and over again. \u0026nbsp;The Skeleton Warrior thought it could somewhat replicate what the brat did.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, you are doing well. \u0026nbsp;You should move that arm more…. ”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Die human!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe had been focused on using the Hyper Rubbing spell. \u0026nbsp;The Skeleton Warrior put all its anger into its roar. \u0026nbsp;At the same time, Maetel moved to knock Artpe out of the way.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Gg-oooooooooh.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koo-ahhhhhhhh! \u0026nbsp;Damn humans! \u0026nbsp;Damn humaaaaaaans!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKwahng!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAccompanying the explosive sound, a large sword was embedded into the stairway of the Dungeon’s entrance. \u0026nbsp;It was none other than the Skeleton Warrior’s bastard sword.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Koo, ah....”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Maetel?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel let out a moan. \u0026nbsp;The Skeleton Warrior had thrown the bastard sword with all its might. \u0026nbsp;The sword had grazed her back. \u0026nbsp;Her armor had been completely ripped into pieces, and to make matters worse, it left behind a wound on her back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Damn it, Maetel! \u0026nbsp;Maetel!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe never expected an enemy without the Throw skill to throw its bastard sword towards him! \u0026nbsp;He had put his complete trust in his Read All Creation ability. \u0026nbsp;His error in judgment had almost cost him his life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had shown a carelessness that was befitting his title as the weakest of the \u003c/span\u003e\u003cspan style\u003d\"\"\u003eFour Heavenly Kings! \u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"\"\u003eIf Maetel had been a bit late, Artpe would have lost his life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let me see your wound. \u0026nbsp;Hurry!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah. \u0026nbsp;Oohk…...”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe blamed his stupidity as he looked at Maetel’s wound. \u0026nbsp;A well-placed wound on the back could hamper one’s movement. \u0026nbsp;Fortunately, that wasn’t the case. \u0026nbsp;If she leveled up couple times alongside regular rest, her body would be back to a pristine state. \u0026nbsp;It seemed Maetel was also aware of this fact, so her face wasn’t clouded at all. \u0026nbsp;She had a bright smile on her face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m alright, Artpe…. \u0026nbsp;I’m just glad Artpe isn’t hurt.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You idiot…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Artpe realized Maetel hadn’t been hurt too badly, he truly felt relieved, and he also felt a weird feeling.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf she died, it would deal a very big blow to his dream of living a peaceful life. \u0026nbsp;However, the feeling he had felt was caused by something else….. \u0026nbsp;\u0026nbsp;He must be mistaken. \u0026nbsp;Artpe shook such dumb thoughts away as he raised his head.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe saw the Skeleton Warrior in front of him. \u0026nbsp;It had gone berserk from the Rage type Buff. \u0026nbsp;Its white bones had turned completely red.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe arm holding the shield was on the ground, and the other arm had also fallen off when it couldn’t withstand the shock. \u0026nbsp;The bastard raged as it threw its body forward, but there was an invisible wall blocking it. \u0026nbsp;It blocked its forward progress no matter how it tried to charge forward.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Gg-oooooooooh! \u0026nbsp;Gg-oooooooooh!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Can you move, Maetel?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf Maetel wasn’t injured, he would have finished off the Skeleton Warrior. \u0026nbsp;However, the top priority right now was to level her up, so she could recover. \u0026nbsp;Of course, Artpe had done most of the work, so not much EXP would go to Maetel. \u0026nbsp;However, this EXP was from killing a very strong opponent. \u0026nbsp;A smaller portion of the EXP would still be enough to level her up!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hoo-ooh, hoo-ooh….. \u0026nbsp;All right. \u0026nbsp;I’ll do it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel was breathing roughly as she got up. \u0026nbsp;She was about to pull out her rusted sword, but her gaze headed backwards as she looked towards the bastard sword embedded in the stairway. She hesitated before she approached the bastard sword. \u0026nbsp;She extracted it with both hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was made out of heavy metal, and magical energy had been used to manufacture the sword. \u0026nbsp;It was a very heavy sword. \u0026nbsp;However, she swung it easily.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Human…...]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m sorry. \u0026nbsp;I can’t beat you in a fair fight. \u0026nbsp;However, I’m able to kill you now, so I will kill you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe had taken the enemy’s weapon, yet she had taken complete possession of the weapon from just swinging it once or twice. \u0026nbsp;Maetel glared at the Skeleton Warrior as she spoke. \u0026nbsp;It was almost as if she was chanting her words.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll win and kill anyone to protect Artpe. \u0026nbsp;Because I’m….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe pulled the hilt of the sword towards her chest. \u0026nbsp;She kept a firm grip as she slightly bent her knees. \u0026nbsp;She leaned her upper body forward.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Skeleton Warrior raised its leg slightly to face her. \u0026nbsp;Maetel used the burning pain from her back as the starting signal. \u0026nbsp;She kicked off the ground.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Because I’m! \u0026nbsp;I’m the hero!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koo-ahhhhhhhhhhhhhhhhhhhhhhhhhhhhhh!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs she let out a short shout, the sword split the air. \u0026nbsp;\u0026nbsp;Her sword struck at the exact spot where Artpe’s dagger was embedded in its skull. \u0026nbsp;The sword cut through the skull, and she broke all its ribs.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf the Skeleton Warrior was in its normal state, it could have resisted against her attack. \u0026nbsp;However, the strike was too much for the current Skeleton Warrior. \u0026nbsp;\u0026nbsp;After its body was broken by the sword, it twitched as if it wanted to fight back. \u0026nbsp;However, the Skeleton Warrior came to a complete stop.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Gooh, ah ah…. \u0026nbsp;Ah, ah. \u0026nbsp;I...is...is that so?]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSurprisingly, the bisected Skeleton started to say something.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[The will within the unshakable blade has awoken me up from my haze…..]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mmm. \u0026nbsp;What…..?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[That’s right, young heroes. \u0026nbsp;Those who run away and never come back are called cowards. \u0026nbsp;However, the ones that come back to win in the end are heroes. \u0026nbsp;You win by fair means or foul. \u0026nbsp;\u0026nbsp;You have carried on your conviction to protect. \u0026nbsp;With my demise, I will open the entrance that will lead to the glory of the heroes.]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What the hell is the Skeleton saying…..?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe was flustered as he asked the question, but the Skeleton Warrior no longer opened its mouth. \u0026nbsp;The magical energy from its body drained out as it entered Artpe and Maetel. \u0026nbsp;Their magical energy increased, and the EXP was distributed. \u0026nbsp;The battle was over.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hey, wait a moment. \u0026nbsp;If you have something to say to us then you should talk more….. \u0026nbsp;Shit.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe urgently stood up, and he tried to look at the Skeleton Warrior with his Read All Creation ability. \u0026nbsp;At that moment, its body eroded away. \u0026nbsp;It left behind the cracked large steel shield, Red Bone gauntlet, and several bones that refused to erode away. \u0026nbsp;These bones had too much Magical energy to immediately erode away.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the truly surprising event started afterwards. \u0026nbsp;When the Skeleton Warrior was completely gone, the Dungeon started to shake in a fierce manner. After killing the Skeleton Warrior, Maetel had slowly relaxed, but now her eyes were round as she ran towards Artpe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe. \u0026nbsp;The Dungeon is…..!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wait a moment. \u0026nbsp;It isn’t collapsing. \u0026nbsp;There are times when a Dungeon goes through a change when one fulfills a specific condition. \u0026nbsp;So right now it….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe would just be beating a dead horse by repeating the fact that the Dungeon was hiding something. \u0026nbsp;Maybe, this Dungeon might be beyond Artpe’s expectation. \u0026nbsp;Something enormous might lie inside the Dungeon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf so, what should he do? \u0026nbsp;Should they back out? \u0026nbsp;Or should they move forward, while accepting the risk? \u0026nbsp;If he hadn’t seen Maetel get injured, he wouldn’t have hesitated. \u0026nbsp;He would have advanced, but Artpe couldn’t do that any more.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let’s go, Artpe.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that moment, Maetel realized he was hesitating, so she spoke to him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I want to become stronger. \u0026nbsp;If there comes a time when we have to run away, we’ll run away and win later. \u0026nbsp;However, if possible, I want to win without running away.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Maetel…...”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That is why I want to become stronger.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWas this really words spoken by a 12 year old girl? \u0026nbsp;Artpe shut his mouth from amazement, but he firmed his resolve when he saw the the unshakable light within Maetel’s eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCurrently, she wasn’t repeating words she had heard from someone else. \u0026nbsp;She wasn’t just spouting words in a childish fit. \u0026nbsp;Her experience within the Dungeon had been short, but a lot had happened during that time. \u0026nbsp;It seemed she had found some purpose, and she wanted to put it into practice. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the change that Artpe had wanted to see within her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“.....yes, let’s go. \u0026nbsp;No matter what shows up, we\u0027ll defeat it. \u0026nbsp;Let bring out everything we can gain from inside the Dungeon.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Read All Creation ability wasn’t perfect, but it was a power that was closest to perfection. \u0026nbsp;If he combined his ability with Maetel’s almost cheat-like talent, they were a perfect pair. \u0026nbsp;They had been perfect a moment ago, and they will be perfect in the future. \u0026nbsp;There was no reason why they shouldn’t go forward.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis confidence was baseless, but he was aware of this fact. Artpe didn’t hesitate. \u0026nbsp;\u0026nbsp;He roughly mussed up Maetel’s hair. \u0026nbsp;She wasn’t showing any signs of feeling pain from her wound. \u0026nbsp;Artpe once again nodded his head then he spoke.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Before we do that, let’s collect our loot.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe reward was more important than the battle! \u0026nbsp;The heroes were growing splendidly in terms of materialistic possessions.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-8\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-10\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-9","bookId":1506,"creation":"Sep 10, 2019 4:36:15 AM","modification":"Sep 10, 2019 4:36:15 AM"}
