{"id":52138,"no":17,"title":"Chapter 16 - The Link Between You and I (4)","content":"\u003cp\u003eChapter 16 - The Link Between You and I (4)\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMycenae tried her best to look pitiful as her eyes watered. \u0026nbsp;She gave a request to Artpe. \u0026nbsp;In truth, her main objective hadn’t been the \u003c/span\u003e\u003cspan style\u003d\"\"\u003eBasilisk Venom Powder. \u0026nbsp;She was here for the treasure box.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“W...will you sell the content of this box to me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll make the decision after seeing what’s in it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe gave a cold reply. \u0026nbsp;Moreover, his gaze was cold too. \u0026nbsp;He was silently pressuring her. \u0026nbsp;It was as if he was trying to tell her to quickly move her heavy body to the side! \u0026nbsp;Mycenae’s stunning beauty was on the same level as a pebble rolling around in the streets. \u0026nbsp;It held no meaning to him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Kook….. \u0026nbsp;This is the first time I’ve suffered such humiliations since I started working for the Anywhere company…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wow! \u0026nbsp;It’s a treasure chest!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAn old pair of wood framed glasses and a pair of black leather boots appeared from within the treasure box. \u0026nbsp;Mycenae\u0027s eyes once again shone with a fierce light!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Are you going to sell it to me!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll sell you only one of the two.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he spoke those words, Artpe pushed the wood framed glasses towards her. \u0026nbsp;Mycenae was able to confirm a suspicion she had.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You must possess a tremendous observation magic.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Didn’t I tell you not to pry? \u0026nbsp;Well, it is obvious at this point in time, but…. \u0026nbsp;\u0026nbsp;Well, since I’ve been pretty heavy handed up until now, I’ll sell it to you at a price where I won’t see much profit. \u0026nbsp;I want 45 gold.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“F….forty f…...!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll buy it. \u0026nbsp;Thank you very much.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe magnitude of money being exchanged had suddenly changed, and Maetel was taken aback. \u0026nbsp;However, Mycenae willingly paid the price! \u0026nbsp;Maetel’s eyes were spinning.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe had a grin on his face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“As expected, Dungeons are honey pots. \u0026nbsp;We just have to avoid being trapped and killed by the honey.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Customer. \u0026nbsp;At the Anywhere company, we offer services ranging from providing support to escorting parties. \u0026nbsp;If you need such services….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“By doing so, you plan on taking half my loot as recompense? \u0026nbsp;Dream on. \u0026nbsp;Just give me my money.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Tsk.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe wood framed glasses allowed one to probe the surroundings when the magic infused within the lenses was consumed. \u0026nbsp;As the holder of the Read All Creation ability, Artpe had no need of this item. \u0026nbsp;However, it was something all adventurers wanted when entering a Dungeon! \u0026nbsp;Since the demand was high, the price was also high.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe most unfortunate aspect of this item was the fact that it could only be used a limited number of times. \u0026nbsp;It disappeared after several uses. \u0026nbsp;This was why consumable items were priced depending on their number of uses, and this was one of the reasons why this particular item was given a high price.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMycenae had estimated the amount of Mana within the wood framed glasses, and she knew she could easily sell it for 50 to 60 golds at the minimum. \u0026nbsp;She had a satisfied expression on her face as she put away the item into her cart. \u0026nbsp;Her eyes were sparkling once again. \u0026nbsp;Then her gaze landed on the black leather boots. \u0026nbsp;They were letting out a sheen of a high grade item.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Customer. \u0026nbsp;I really want to purchase the boots…....”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m not selling you this.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe answered flatly. \u0026nbsp;He took off his worn-out shoes, and he put on the leather boots. \u0026nbsp;Maetel clapped her hands. \u0026nbsp;She said it looked good on him, but Artpe didn’t care if it looked good or not. \u0026nbsp;The only thing important to him was its performance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I never expected to find a pair of Blink Boots in this Dungeon.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe had known it was a rare item, but she never expected it to be the Blink Boots! \u0026nbsp;Mycenae grinded her teeth. \u0026nbsp;Maetel didn’t know much about magic, so she innocently tilted her head in confusion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlink was a magic that allowed one to instantly travel a short distance. \u0026nbsp;Magicians used this magic to get out of danger. \u0026nbsp;Since it was a magic spell, it had the downside of needing a long cast time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, it was a completely different story if the magic spell was contained within an artifact. \u0026nbsp;It only needed an infusion of Mana or a fulfillment of a specific condition to activate. \u0026nbsp;This was why the effectiveness of this magic increased in a single stroke!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is why boots containing Blink Magic are worth 100 gold at the very least! \u0026nbsp;It doesn’t matter if \u0026nbsp;the Mana efficiency of the item is low!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Amazing, Artpe!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ooh-ahhhhhhhh!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn top of it all, this pair of boots had an option of activating on its own during a moment of crisis. \u0026nbsp;It could be used once a day without it consuming Mana . \u0026nbsp;It was also possible to use it again by adding in more Mana. \u0026nbsp;Amongst the boots with the Blink option, it wasn’t an exaggeration to say that these ones were ranked in the highest class.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs a cherry on top, it had a low level requirement, so Artpe could equip it. \u0026nbsp;For Artpe, good things came in threes. \u0026nbsp;If he was to estimate the price of this pair of boots…. \u0026nbsp;\u0026nbsp;It would be too annoying to come up with an estimate.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe will be safe now. \u0026nbsp;I’m so happy.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What is up with this customer….?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What do you think? \u0026nbsp;She’s so innocent that she would never be able to become a merchant even after she grows up. \u0026nbsp;So….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe returned the entirety of the 45 golds he received from Mycenae.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I want one Mana potion and I want the rest to be Stamina potions.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe! \u0026nbsp;Are you using all of the money right now!? \u0026nbsp;We could have lived off of that money! \u0026nbsp;It would have lasted for our entire lifetime!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You have the ability to earn money whenever you want. \u0026nbsp;Moreover… \u0026nbsp;It is a good idea to buy items that might spare our lives”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe spoke in a calm manner. \u0026nbsp;Mycenae, who was facing him, smirked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“In many ways, I have misjudged you. \u0026nbsp;Please forgive my rudeness. \u0026nbsp;I can give you 1 mid-grade Mana potion, and 8 Stamina potions. \u0026nbsp;Will that be ok?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll be thankful if you added an additional Stamina potion on top of that.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll give you an additional Mana potion too.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mmm?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe’s eyebrows furrowed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Aren’t you being a bit too generous?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“She is being generous!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I believe you will become famous in the future. \u0026nbsp;I’m just trying to gain a little bit of favor in your eyes. \u0026nbsp;Please look kindly on the Anywhere company in the future. \u0026nbsp;Thank you in advance.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Tsk······.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMycenae laughed with unreadable eyes. \u0026nbsp;She finally regained her composure as a middleman. \u0026nbsp;Artpe didn’t like being in debt, but he was in a tight spot. \u0026nbsp;He couldn’t punt her good intentions just because he wanted to.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the end, Artpe accepted the potions without hesitation. \u0026nbsp;He took two Mana potion and one Stamina potion for himself. \u0026nbsp;After he put them away inside his robe, he put the rest in a pouch before giving it to Maetel.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You should drink it when you are extremely tired, or you can spray it on your wounds.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah-ooooooh. \u0026nbsp;These are too expensive for me to use.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The most expensive thing in this world is your life. \u0026nbsp;Will you be able to use it if I frame it that way?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Y…yes…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Maetel heard Artpe’s manly words, her cheeks turned slightly red as she meekly accepted the pouch with the potions. \u0026nbsp;Mycenae was still watching them as she smirked. \u0026nbsp;She bowed her head as a farewell.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I am Anywhere company\u0027s Mycenae. \u0026nbsp;I’ll wait for the day when we’ll meet again.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Be my guest.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Goodbye for now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMycenae disappeared alongside the same light that had appeared in the beginning. \u0026nbsp;Maetel wondered if this was all a dream, so she pinched her own cheeks. \u0026nbsp;When she realized she still had on a completely different set of items, she knew this was real. \u0026nbsp;She shook her head.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“There are too many things I still don’t know.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That is to be expected. \u0026nbsp;As recompense, your talent for battle is outstanding.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“But I want to have conversations with Artpe about a lot of different subjects….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You want to talk more than this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMatel was already not listening to Artpe’s words. Instead, she was making a firm resolve as she clenched her fists.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m going to do my best to read a lot of books from now on. \u0026nbsp;I’ll become smart, so I can be of help to Artpe. \u0026nbsp;I want to have many more conversations with Artpe….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Uh. \u0026nbsp;Mmmm. \u0026nbsp;All right. \u0026nbsp;You do your best.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe didn’t think it was a problem that could be solved by reading more books. \u0026nbsp;Still, Artpe decided to cheer her on.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Still, you should delay your plans on reading books. \u0026nbsp;We’ll be entering the 7th floor of the Dungeon soon. \u0026nbsp;The Skeletons will probably be stronger. \u0026nbsp;If we don’t prepare our heart for what is to come, we’ll suffer defeat.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I can win against anyone. \u0026nbsp;I’ll protect Artpe.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I like the fact that you are brave.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe smirked as he stroked Maetel’s head. \u0026nbsp;Then he plopped down on the floor. \u0026nbsp;She tilted her head in confusion as she looked down at him. \u0026nbsp;He announced his words in a solemn manner.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We have to sleep first before we proceed.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey roughly rolled up a straw mat. \u0026nbsp;They used it as a pillow as they laid down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if a Record Link was placed over this location, a Dungeon was a Dungeon. \u0026nbsp;After a certain amount of time, new monsters would appear once again on the 6th floor. \u0026nbsp;Of course, these monsters would be under the influence of the Record Link since the spell was still over the entire Dungeon. \u0026nbsp;If the act of killing it once could break the Record Link, Artpe wouldn’t have had so much trouble manipulating it in the first place. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStill, he was pretty sure the new monsters wouldn’t show up on the 6th floor while they slept through the night. \u0026nbsp;As a precaution, he pushed his hand forward to place Mana Threads in various locations around them. \u0026nbsp;Maetel waited for his work to be done, then she pulled herself slightly closer to Artpe. \u0026nbsp;She lay next to him. \u0026nbsp;Artpe frowned.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are too close.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I like this better, since it is warmer.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What happened to your shyness?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I buried it in my house’s backyard before I came here.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Your house doesn’t have a backyard.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel didn’t say any more words. \u0026nbsp;She just snuggled closer to him. \u0026nbsp;Since he couldn’t just push her away, he let her be. \u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heh heh.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You have a long way to go. \u0026nbsp;A long way…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe~”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel acted in a coquettish manner. \u0026nbsp;It was hard to imagine that this girl had annihilated the Skeletons using the bastard sword. Her voice was that sweet. \u0026nbsp;Artpe had made a resolve not to fall for her tricks, yet he found himself stroking her head.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe had been in battle all day, and she hadn’t had the chance to wash herself. \u0026nbsp;He couldn’t understand how she smelled so good. \u0026nbsp;Artpe wondered if it was because she was still young. \u0026nbsp;Artpe mused about such nonsensical thoughts as he closed his eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Dungeon’s 7th floor turned out to be more difficult rather than being easier than the 6th floor. \u0026nbsp;The monsters of the Dungeon had realized that Artpe had messed up the Dungeon’s test, and its rules. \u0026nbsp;They no longer acted as if they were testing the two of them. \u0026nbsp;The monsters were filled with the desire to punish them for sullying the holy testing ground. \u0026nbsp;This was why the monsters were more vicious in their attacks.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn top of that, the monsters on this floor was higher in level than the ones on the 6th floor. \u0026nbsp;They had an average level of 52, and there were about 600 Skeletons in total. \u0026nbsp;These monsters mainly targeted Artpe, so Artpe didn’t have the chance to build up his Mana.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Your existence is an insult to all the heroes, who existed before you!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[I cannot forgive you!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You won’t lay a hand on Artpe-ehhhhhhhhhhhhhhhh!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey had smashed the Skeletons for a whole day, yet they weren’t able to clear the floor. \u0026nbsp;Fortunately, their levels had increased, so they could hold out for two to four days.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf possible, Artpe didn\u0027t want Maetel to use Berserk. \u0026nbsp;He didn’t want to use the Mana Link either. \u0026nbsp;However, these weren’t foes they could beat by holding their powers back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel relied on her Berserk Skill to repel the Skeletons coming at them from all sides. \u0026nbsp;Artpe had no choice, but to provide her with Mana. \u0026nbsp;At the same time, he was using his shield. \u0026nbsp;He was getting better at using it as time passed. \u0026nbsp;He used the shield boomerang to weaken his enemies.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koo-hahhhhhhhhhhk!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe! \u0026nbsp;These gloves and boots are really good! \u0026nbsp;The Skeletons are easy to break using these items!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, yes.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Maetel]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Level - 43]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Unarmed Combat Lv1]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Strike Lv3]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Monsters! \u0026nbsp;They are cruel monsters! \u0026nbsp;They are demons!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Give me death! \u0026nbsp;I will become one with my comrades to punish you all!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll make all your comrades like you. \u0026nbsp;Then I’ll break all of you at once. \u0026nbsp;Wait a little bit!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koo-ahhhhhhhhh!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow much time had passed? \u0026nbsp;Maetel and Artpe were entirely reliant on the Berserk skill and the Mana Link. \u0026nbsp;They were barely able to beat all of the Skeletons.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe felt the burden of knowing that he was probably weakening Maetel by sharing her talent. \u0026nbsp;However, unlike his worries, all of Maetel’s skills continued to evolve at a ridiculous pace. \u0026nbsp;This was also true for Artpe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, it was impossible to last a couple of days using nothing. \u0026nbsp;They had to use most of the potions they had purchased. \u0026nbsp;Fortunately, they would once again encounter a Dungeon Merchant at the end of the 7th floor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oh my. \u0026nbsp;It has been only couple days, but we meet again.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s this ajumma again?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m not an ajumma! \u0026nbsp;….huhk. \u0026nbsp;Isn’t that the Golden Lizard’s Tailbone Great Sword!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“97 gold.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ggoo-ahhhhhhhhk!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was how the heroes were able to safely retool before they entered the 8th floor. \u0026nbsp;Still, the Dungeon remained very difficult. \u0026nbsp;Artpe wasn’t the creator of this Dungeon, so he had no idea how many floors had been separated using the Record Link.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey moved through the Dungeon’s 8th floor, 9th floor, 10th floor, 11th floor, 13th floor, 15th floor…. \u0026nbsp;\u0026nbsp;The Dungeon continued to go on and on. \u0026nbsp;The average level of the Skeletons continued to go up by a marginal amount, and at a certain point, Artpe and Maetel surpassed the level of the Skeletons.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSince they held the advantage in level, they thought they would be able to win easily from that point forward. \u0026nbsp;Right when they had this thought, powerful monsters over level 100 started to appear. \u0026nbsp;The monsters were called ghouls. \u0026nbsp;The level difference between the party and the monsters widened in the favor of the monsters, so they were put in a difficult spot once again. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, there weren’t any mountains they couldn’t overcome. \u0026nbsp;Before they even engaged in a fight, Artpe was able to find all the weaknesses of his enemies. \u0026nbsp;Then there was the the crazy talented Maetel, who could bring anything he ordered into reality!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was how a period of one year had passed, and the party reached the Dungeon’s 34th floor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How long is this Dungeon!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Group fights are fun, Artpe! \u0026nbsp;Isn’t it about time for a different type of monsters to come out?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Customer! \u0026nbsp;Please sell this to me for 200 gold just this one time! \u0026nbsp;Please!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that point, Maetel had reached level 124. \u0026nbsp;Artpe had reached level 115.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-15\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-17\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-16","bookId":1506,"creation":"Sep 10, 2019 4:36:15 AM","modification":"Sep 10, 2019 4:36:15 AM"}
