{"id":52141,"no":20,"title":"Chapter 19 - Our Sunbae-nim Did This? (3)","content":"\u003cp\u003eChapter 19 - Our Sunbae-nim Did This? (3)\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[This is ridiculous. \u0026nbsp;There is no way the curses placed on the dead will be transferred…..]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, they no longer exist, but they haven’t died yet. \u0026nbsp;You carry them on your back! \u0026nbsp;They are placed inside your chest! \u0026nbsp;Each one of them continue to live on as part of you. \u0026nbsp;Isn’t that right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn a flash, Artpe was able to apply several dozen Slowdown curse on the Death Knight \u0026nbsp;It creaked as it moved. \u0026nbsp;It was as if the Death Knight was wearing a rusted armor. \u0026nbsp;Artpe taunted it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koo-hook…..!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, it had no way of counteracting the effect. \u0026nbsp;This effect was what made the Record Link such a dangerous magic! \u0026nbsp;It prevented the death of beings that should be dead, and all their power was transferred. \u0026nbsp;Basically, they could live on within an another entity! \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is why even the weakest curse will be transferred to you. \u0026nbsp;If I want to have numerous curses placed on you…. \u0026nbsp;I just have to kill them all.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe forcefully swung his hand as the shield flew through the air. \u0026nbsp;The shield moved based on his will. \u0026nbsp;Even now, the shield was slicing through the falling Zombies and Ghouls.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIts bears repeating that the curse contained within the shield was weak. \u0026nbsp;It was able to \u0026nbsp;attach a weak slowdown effect on its target, but the effect could be stacked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs each Undead fell from the sky, Artpe cut them into pieces with his shield. \u0026nbsp;It felt as if \u0026nbsp;shackles were being placed all over the Death Knight’s body every time an Undead was killed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Kooo-ahhhhhhhhhh!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Of course, the one left behind will be the one to suffer. \u0026nbsp;This is the biggest reason why the Record Link was banned. \u0026nbsp;If you didn\u0027t know that, you should study up on it. \u0026nbsp;Well, it is too late for you to do so.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe laughed uproariously. \u0026nbsp;The Death Knight had tried to attack him, yet his efforts were in vain, since Maetel had been able to hold it back. \u0026nbsp;It had been a long long time, since he had felt this much mirth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It is rare to find a curse that can stack infinitely. \u0026nbsp;Why do you think I haven’t scrapped this lousy shield? \u0026nbsp;Why do you think I was frugal in its use?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Nooo wayyyy. \u0026nbsp;Noooooooooo waaaaaaaaaaaaaaay. \u0026nbsp;Youuuuuuuuuuu \u0026nbsp;Baaaaaaaaaa-ssssssssssssss-taaaaaaaaaaard.]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe power of the slowdown curse within the shield had a widespread effect of causing minuscule slowdown on the target’s intelligence, stamina, Mana and skills. \u0026nbsp;The Death Knight was feeling the cumulative effect of over hundred of these curses. \u0026nbsp;The speed of Death Knight’s thought process and the ability to speak had slowed down to a ridiculous degree.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes. \u0026nbsp;I, Artpe-nim, prepared for the boss battle from the beginning. \u0026nbsp;I readied all of this for this day when I would dispel the restriction I placed on the Record Link!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe sneered at the Death Knight, and he took the coolest pose he could come up with for maximum effect. \u0026nbsp;He used to be one of the Four Heavenly King of the Demon King’s army. \u0026nbsp;He was a being that acted as if his arrogance had no bounds! \u0026nbsp;He bragged whenever he gained a sliver of advantage over his enemies! \u0026nbsp;\u0026nbsp;He did this in the most spiteful and shameless manner!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe is too cool!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koooooooooh-ahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhile Artpe was busy posing, the shield tirelessly cut through the body of the falling Zombies and Ghouls.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had sharpened the edges of the shield in anticipation for this day. \u0026nbsp;There was no way its edges would dull right now. \u0026nbsp;The number of monsters killed went from several dozen to several hundred then to several thousand. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Ggoo-oooooooh, \u0026nbsp;ooooooooooooooooooooooooooh.]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this point in time, the Death Knight had for all intents and purposes became worse than a level 3 Goblin. The Undead, who tried to test the heroes, had run out of all its opportunities.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt hadn’t even been able to put up a good fight. \u0026nbsp;It hadn’t been able to use its secret technique. \u0026nbsp;It had been unable to give its cool final line nor was it able to lecture the heroes. \u0026nbsp;It had pathetically frozen in place before it was able to punish Artpe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Eh-eet.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMeanwhile, Maetel was being sensible by distancing herself from the Death Knight. \u0026nbsp;If she killed the Death Knight right now, its power would be transferred into the Zombies and Ghouls. \u0026nbsp;They would harden to a point where the they wouldn’t be able to handle them. \u0026nbsp;She had arrived at a very logical conclusion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No, Maetel!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel was patting herself on the back when Artpe gave her instructions to the contrary.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If that bastard kills itself in a suicide, our reward will become infinitely worse! \u0026nbsp;We don’t want to receive dropped items from really high level Zombies or Ghouls! \u0026nbsp;We want the dropped items of a Death Knight created from gathering all the energy through Record Link! \u0026nbsp;You have to prevent it from killing itself!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah, all right! \u0026nbsp;As expected, Artpe is smart!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWho in the world would call these wicked people as being heroes! \u0026nbsp;\u0026nbsp;They were superbly rotten to the core that even the Demon King would come study under their tutelage!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Death Knight watched Maetel break through the flood of monsters falling from the sky, and she immediately disarmed it. \u0026nbsp;\u0026nbsp;It was vexed that it couldn’t move to stop her, but Artpe had killed an excessive amount of cursed monsters. \u0026nbsp;It was hard for the Death Knight to even lift a single finger.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Cheeeeeeeeeeeeeeeeeaaaaaaaaaaaapppppppppppppppppppppppp……..]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah. \u0026nbsp;It is game over for it since the curse has stacked this much. \u0026nbsp;Maetel, you should now help me kill the others.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey had descended this Dungeon for the past year, so they were well versed in what to do now. \u0026nbsp;There were a lot of monsters tied to the Record Link right now. \u0026nbsp;It was as if someone had barfed them all up. \u0026nbsp;It was a good thing Artpe and Maetel had faced all of them before while they came down here. If not, they wouldn’t have stood a chance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Eh-eet, eh-eet.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Ooooooooohhhhhhhhhhhhng.]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Ggeeeeeeeeeeeee, ggeeeeeeeeeeeeee.]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Death Knight didn’t tie himself to so many beings so that it would die after twitching slowly across the ground like a cicada larva. \u0026nbsp;\u0026nbsp;Of course, Artpe and Maetel didn’t care about that!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel had made sure to cripple the Death Knight so it couldn’t kill itself. \u0026nbsp;Then she put away her sword as she beat the nearby monsters to death using a bone club.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe hummed as he controlled the shield. \u0026nbsp;By the time he killed all of them, the shield would become unusable. \u0026nbsp;\u0026nbsp;However, this shield was only useful for this Dungeon. \u0026nbsp;He didn’t care what happened to it after this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are really a genius, Artpe.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, I do think I\u0027m somewhat of a genius. \u0026nbsp;Maetel is also quite the genius.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Thank you! \u0026nbsp;I think I fought fairly well even if I say so myself!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two heroes kept praising each other as they cleared the Dungeon in a friendly manner. The Death Knight was rolling around on the floor like a larvae, so what could mere Zombies and Ghouls do against them! \u0026nbsp;\u0026nbsp;It was as if they were hit by lightning!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe lucky ones died immediately after they hit the floor. \u0026nbsp;The unlucky ones already had the misfortune of being Undead, yet they were in a situation where they couldn’t even move properly. \u0026nbsp;They were only able to blink their eyes until it was their turn to die.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Goo-ooooooooooooooooooooooooooooooooooooooooooh.]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was unknown as to who had created this Dungeon, but at the very least, the creator of this Dungeon probably didn’t place the Record Link expecting to see such a sight! \u0026nbsp;This wasn’t a Dungeon that was meant to grow candidates for becoming the Demon King! \u0026nbsp;This was a place built to develop heroes! \u0026nbsp;\u0026nbsp;It was the builder’s mistake in assuming that all heroes were goody two shoes pushovers.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘Ah. \u0026nbsp;Ahhhhhhhhh······.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Death Knight had lost both its arms, and it had been completely disarmed. \u0026nbsp;As it rolled around the floor, the Death Knight watched the two evil heroes clear the Zombies and Ghouls.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEvery time one of the Undead died, a minuscule amount of power was coming in towards the Death Knight. \u0026nbsp;Most of them were cursed, so it was a scary proposition where the slowdown effect was much higher than the strengthening effect. \u0026nbsp;It had lost the power to move around a long time ago, and now it was having a hard time thinking.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Death Knighted lamented over its misfortune. \u0026nbsp;It had failed to read Artpe’s outrageous abilities, so it mocked itself on its own ignorance. \u0026nbsp;It moaned at the sight of the broken Dungeon. \u0026nbsp;The Death Knight wondered if it could really entrust it all to them…...\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt decided not to think about it anymore.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFour days passed. \u0026nbsp;It took a long time even though the two were killing defenseless monsters.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the midpoint on, the records of monsters had started to overlap too much. \u0026nbsp;\u0026nbsp;From that point on, the constitution of the remaining Undead became unnecessarily high. \u0026nbsp;This was why it was taking so long. \u0026nbsp;The only danger that posed a threat to the two heroes was them becoming too tired, and falling asleep in front of the monsters.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Did we really kill all of them?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, we killed every single one of them. \u0026nbsp;We even killed the ones stuck up there.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, I also confirmed it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Dungeon was ridiculously large and deep. \u0026nbsp;It took him around 30 minutes to sweep the place for monsters that were still alive with his Read All Creation ability.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, it was all over now. \u0026nbsp;There was only one monster left in the entire Dungeon. \u0026nbsp;It was the Death Knight that was only capable of rolling around on the floor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hmmm.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe wanted to ask if it wanted have its last words, but there was no response from the Death Knight even after Artpe pounded on it. \u0026nbsp;It was acting like a normal corpse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe, you have to kill it. \u0026nbsp;Currently, my level is too high compared to yours. \u0026nbsp;We have to balance it out.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I knew you would say that.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe raised his shield. \u0026nbsp;He had killed numerous monsters with it so it was damaged and deformed. \u0026nbsp;It was hard to call it a shield now. \u0026nbsp;It was basically a lump of metal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe wondered if the Death Knight would be satisfied with being killed by a lump of metal, which was neither a weapon nor a defensive gear. \u0026nbsp;Of course, it was \u0026nbsp;no concern of his.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Koohk. \u0026nbsp;Eh-eet. \u0026nbsp;Crap. \u0026nbsp;It is so damn hard.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe diligently pounded the Death Knight with the lump of metal. \u0026nbsp;However, the Death Knight had absorbed all the records to reach its final form, so it wouldn’t die from an attack of that caliber. \u0026nbsp;Artpe had no choice, but to forcefully push his Mana into the lump of metal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If you don’t die from this, I’ll call you my teacher!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe placed the lump of metal beneath the Death Knight’s body, and he immediately used the Hyper Rubbing spell. The lump of metal rubbed against the Death Knight with a ludicrous amount of force!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt couldn\u0027t be helped. \u0026nbsp;The surface of the Death Knight’s body touching the lump of metal was starting to fracture a little bit. \u0026nbsp;It was a brutal sight! \u0026nbsp;It made one wonder if this was some new form of torture!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Go-oooooooooooooooh.]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt seemed the Death Knight wanted to say something, but its reaction had slowed down too much. \u0026nbsp;One couldn’t tell what it was trying to say. \u0026nbsp;Artpe wanted to end its misery, so he increased his Mana output. \u0026nbsp;The rubbing became more fierce, and it was accompanied by a change.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah. \u0026nbsp;The lump of metal is becoming red-hot!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s a Mana reaction. \u0026nbsp;That lump of metal used to be an Artifact. The Mana infused within it will become agitated by the Mana I injected. \u0026nbsp;It’ll cause an explosion. \u0026nbsp;The explosion caused by detonating an Artifact is much stronger than detonating a simple rock. \u0026nbsp;You should keep that in mind.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Then why did you activate the Hyper Rubbing?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I just wanted to tease that bastard…. \u0026nbsp;\u0026nbsp;Duck!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that moment, the lump of metal exploded! \u0026nbsp;The Death Knight received the entirety of the incredible force generated by the explosion. \u0026nbsp;As a result, it was able to find its eternal rest. It probably would have been much happier by the fact that it was taken out this way.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Koo-ooooooooooooooooh.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Koohp.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was obvious, but an incredible amount of EXP entered into Artpe and Maetel when the Death Knight was killed. The primary form of the completed Death Knight had been incredible already, but the Dungeon had been restored to its original form. \u0026nbsp;All the record of the monsters were gathered into a single being! \u0026nbsp;\u0026nbsp;This result was to be expected.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe. \u0026nbsp;It feels as if my head is going to split open-ahhhhh.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Don’t worry. \u0026nbsp;I feel the same way…. \u0026nbsp;Koo-heek.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven in his previous life, he had never experience such successive level ups. \u0026nbsp;Mana filled up within his body as it kept evolving. \u0026nbsp;It put a great amount of stress on his mind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ughhh, Artpe.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe was trying to hold back the urge to lose consciousness when he heard Maetel calling for him. \u0026nbsp;He raised his head to respond to her when he realized why she had called out to him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wow. \u0026nbsp;This is nuts.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ggoo-oooooooooh.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaybe, the killing of all the Monsters connected to the Record link was the impetus. \u0026nbsp;The Dungeon was once again going through a change!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf more monsters came out once again, it would have been really annoying. \u0026nbsp;Fortunately, this wasn’t the case. The Dungeon was quickly losing its size. \u0026nbsp;The square was also getting smaller, and the material making up the Dungeon was changing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is as if….. \u0026nbsp;\u0026nbsp;Ah.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe cherry on top was the fountain that appeared in the middle of the square. \u0026nbsp;Maetel’s body and mind was tired, so she was about to let out a shout of joy. \u0026nbsp;As she was about to run towards the clear water, she paused to look back at Artpe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s poisoned water, right! \u0026nbsp;Aren’t I right, Artpe!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe thought she had shown sound judgment by stopping, so Maetel let out a fake cough.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe put on a bright smile as he faced her. \u0026nbsp;He spoke to her..\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Nope, that is just regular water.”\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-18\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-20\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-19","bookId":1506,"creation":"Sep 10, 2019 4:36:15 AM","modification":"Sep 10, 2019 4:36:15 AM"}
