{"id":52148,"no":27,"title":"Chapter 26 - Yesterday\u0027s Enemy (5)","content":"\u003cp\u003eChapter 26 - Yesterday\u0027s Enemy (5)\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sun brightened the morning. \u0026nbsp;Artpe caught several fishes from the ravine, and he used the Mana String to clean them. \u0026nbsp;This magic wasn’t meant to be used this way, but he didn’t care. He was killing two birds with one stone by leveling up his Spell Level. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaybe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wow. \u0026nbsp;Artpe’s hand movements are exquisite.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m not trying to boast, but I have a knack for useless talents.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Leseti, are all magicians able to use such an odd spell?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is the first time I’ve seen such a spell. \u0026nbsp;It seems he is more special since he is a hero.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilpennon and Leseti was also watching this sight. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf spoken bluntly, they had lost their positions and their escort guards. \u0026nbsp;They were beggars now. \u0026nbsp;Artpe felt a little bit bad for just sending them away, so he decided to send them off after a meal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“So you guys didn’t bring any foods you can eat?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We did bring a lot of money. \u0026nbsp;Our kingdom specializes in manufacturing Dimensional Pouches.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m sure you know this, but I’ll say it just in case. \u0026nbsp;Don’t spend large sums of money in any old place.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Why not?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hah.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe looked away from Silpennon. \u0026nbsp;He looked at Leseti with sympathy in his eyes. \u0026nbsp;He could clearly see the difficulty she would have to endure in the future.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“······hoong.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Eh-eet.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Leseti avoided his gaze as her cheeks reddened.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn her stead, Maetel pinched Artpe’s thigh.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Huh?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat the hell? \u0026nbsp;Why were their reactions switched? \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe was bewildered as he rubbed at his thigh. \u0026nbsp;At that moment, the crown prince added a supplementary explanation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“For the past 20 years of her life, Leseti only focused on self-training and protecting me. \u0026nbsp;She is a poor woman, who has yet to date a man. \u0026nbsp;Even if you are young, she is accepting you in that fashion, because she is very thirsty.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Your highness, it has been an honor to be able to serve you until now. \u0026nbsp;Please be happy in your future endeavors.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Why are you unsheathing your sword! \u0026nbsp;I always trusted you to be by my side!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You revealed the reason why!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You aren’t using honorifics!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuch a simple method was able to eliminate her sense of loyalty. \u0026nbsp;He had a better idea now on why the Diaz Kingdom were overrun by the rebels. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe finished cleaning the fishes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe kept a small steel pot alongside his money inside the Dimensional Pouch. \u0026nbsp;Maetel brought over edible plants, and he put in spices(50 bronze) he bought from the merchant. \u0026nbsp;When the water came to a boil, he put the fishes in. \u0026nbsp;Soon, a very pleasant smell started to emanate from it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It seems you are very experienced at doing all of this.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If you fight and live in the mountains and fields, this type of skills becomes second nature to you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe four people ate the finished fish soup. \u0026nbsp;The rations supplemented the meal. \u0026nbsp;The food was eaten in a blink of an eye. \u0026nbsp;Maetel alway ate whatever Artpe made as if it was delicious. \u0026nbsp;He could give her a ball of dirt, and she would say it was delicious. \u0026nbsp;However, he had thought Silpennon would have a picky palate, since he was the crown prince. \u0026nbsp;He ate it without complaining, and he even gave Artpe a compliment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Thank you. \u0026nbsp;I enjoyed it very much.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How should I say this? \u0026nbsp;You are so polite that it is annoying.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mmm. \u0026nbsp;His competency for household chores are great….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe decided not to ask Leseti about what she was checking. \u0026nbsp;Artpe finished washing the dishes. \u0026nbsp;He stood up after he put away the pot into the Dimensional Pouch.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let’s go our own way from here on out.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is there any way we can go with you guys? \u0026nbsp;I guess this is to be expected. \u0026nbsp;My ability is pitiful compared to you guys…...”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilpennon was in low spirits. \u0026nbsp;He lowered his head as he mumbled those words. \u0026nbsp;This was the first time he had escaped the mantle of his position as the crown prince. \u0026nbsp;It was at this moment that he realized how powerless he was for the first time in his life. \u0026nbsp;His direction in life going forward would be determined on how he remedied that fact.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe had a bitter expression on his face, and he asked Silpennon a question as if he was asking it in passing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“So what do you plan on doing from here on out?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I planned on finding the heroes. \u0026nbsp;Then I wanted to achieve the merit of defeating the Demon King. \u0026nbsp;However, that plan fell into pieces, so I don’t know what….. \u0026nbsp;\u0026nbsp;I can’t go back to the castle. \u0026nbsp;In truth, \u0026nbsp;I’m at a dead end.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Leseti, do you have any other plans?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“He is an annoying human being, but he is my lord. \u0026nbsp;I will protect him until I’m able to. \u0026nbsp;That is it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Basically, you don’t have any other plans.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Koohk.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had expected her to be a little bit smarter than Silpennon, but it seemed Leseti also didn’t know much about the world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he let them go like this, they would die somewhere without anyone knowing about it. \u0026nbsp;He could only see a miserable death for them in the future.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“······ssp. I guess it can’t be helped. ”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe let out a sigh as he gave them a proposal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let’s form a temporary party.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Are you….letting us into your party!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilpennon’s eyes shone, and even Leseti had a healthy glow when she heard the news. \u0026nbsp;Maetel looked as if she was unsatisfied with something.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I like being with Artpe. \u0026nbsp;Just the two of us….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is temporary. \u0026nbsp;We’ll do this until we clear one Dungeon. \u0026nbsp;If I let this guy leave, he’ll suffer a rough fate. \u0026nbsp;I’ll give him some basic lessons. \u0026nbsp;I’ll let him become indebted to me, and I’m sure he’ll bring something back to me in the future.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Are you supposed to say that in front of the person you are talking about?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilpennon spoke as he was dumbfounded, but his face remained bright. \u0026nbsp;He now knew that Artpe cared about them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen he saw Artpe ruthlessly kill the knights, he had doubts as to whether he was a hero. \u0026nbsp;As expected, he was good at a fundamental level!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, Artpe’s intention was entirely different from what Silpennon had attributed to him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘Even if he was the crown prince, they don’t let anyone join the hero’s party. \u0026nbsp;One has to be excellent and skilled at a very basic level. \u0026nbsp;That is why the party members are able to stick around the hero without dying.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe crown prince had the talent to become a thief. He was very remarkable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he was trained properly, he’ll be able to gain fame within the kingdom within couple years. \u0026nbsp;No, his name would spread throughout the continent. \u0026nbsp;Of course, in his past life, Silpennon was locked away inside the palace for five years alongside Maetel, and the rest was history.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘If I expend a little bit of my time here, I can create a foundation he can build on. \u0026nbsp;I would be making a powerful card that I can use later against the Demon King’s army. \u0026nbsp;Moreover, he seems to have a personality of wanting to repay his debts. \u0026nbsp;In light of that fact, there isn’t much downside in doing this.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf one received a favor, it had to be paid pack. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was a reasonable sentiment. It was also true that it was hard to make good on such sentiments. \u0026nbsp;However, the crown prince in front of him might have that great quality where he would keep true to his duties.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I have a question.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilpennon hadn’t opened his mouth. \u0026nbsp;It was Leseti.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You just said a Dungeon. \u0026nbsp;You speak so lightly about it…. \u0026nbsp;Do you realize it is very hard to find a Dungeon? \u0026nbsp;At this moment, countless adventurers are looking a Dungeon in an attempt to strike it rich. \u0026nbsp;They roam the land, but they are barely able to find one after they fruitlessly search for several years. \u0026nbsp;Even if they do find one, they just suffer a dog’s death.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m already well aware of that fact.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If we want to clear a decent Dungeon, we\u0027ll have to stay together for couple years. \u0026nbsp;Is this a roundabout way of accepting us into your party?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaybe Leseti was hoping her words were true. \u0026nbsp;She had come here based on the idea that she had to save the crown prince. \u0026nbsp;However, she wasn’t talented at anything except fighting and protecting someone.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was young, yet he had ridiculous amount of power. \u0026nbsp;Moreover, he was talented in many facets. \u0026nbsp;If they were able to join Artpe’s party, she would be able to just focus on fighting and guarding the crown prince.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn top of that, if the crown prince was able to grow up splendidly and play a support role in defeating the Demon King, he would be able to return triumphantly as the scion of the Diaz family. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Well, aren’t I right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe was 20 years old, but from Artpe’s perspective, she still looked like a brat to him. \u0026nbsp;She was trying hard to appear as if she was calm. \u0026nbsp;However, there was a catch and a slight tremor in her voice that betrayed the desperation she was feeling. \u0026nbsp;Artpe let out a laugh.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You’ll see.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo days had passed. \u0026nbsp;The party stood in front of an old tree that was rotting away.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat was hiding there? \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was none other than an entrance to the Dungeon. \u0026nbsp;Artpe merely extended his Mana, and the hollow portion of the tree expanded. \u0026nbsp;It was readied itself to accept the adventurers.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No way…...”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is impossible!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLeseti had an agitated expression on her face. \u0026nbsp;Silpennon was shocked as he turned to look at Artpe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How were you able to find it so quickly…..?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Accidents and events have a way of finding heroes even if they stay put, yet we are actively searching for a Dungeon right now. \u0026nbsp;Of course, one or two Dungeons would show up.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heroes are truly amazing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s right. \u0026nbsp;Artpe is truly amazing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis is why it is convenient to have idiots around!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The magical energy I sense isn’t high or dense. \u0026nbsp;The monsters inside will be of the common variety. \u0026nbsp;Let’s go.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt wasn’t as if this was an insignificant Dungeon. \u0026nbsp;However, it couldn’t be disputed that it was a lousy Dungeon crawling with low level Slimes. \u0026nbsp;Even if it was a lousy Dungeon, it was a very large one. \u0026nbsp;This was why no adventurer was able to completely conquer this Dungeon in his past life! \u0026nbsp;This was true even at the time of his death!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Here. \u0026nbsp;You should arm yourself with this.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ooh-mmmmm.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe tossed a crappy equipment that Silpennon could arm himself with. \u0026nbsp;Silpennon took the dagger, and he spoke with an uncertain voice.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Do….do you think I can do this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who wanted an active role inside the hero’s party?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“......I did.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt Artpe’s light provocation, Silpennon answered back with a firm voice. \u0026nbsp;He nodded his head several times as if he was making a resolve. \u0026nbsp;He gripped the dagger so hard that veins started to pop out on the back of his hand.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“All right. \u0026nbsp;Since the hero plans on guiding me, I can’t turn that opportunity down. \u0026nbsp;I’ll do it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are no longer in the position of being the crown prince. \u0026nbsp;From now on, I want you to think about what position you want, and what kind of fighting style you want to fight with. \u0026nbsp;You should battle with those points in your mind.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Understood.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe started fidgeting with the short sword in one hand. \u0026nbsp;He asked a question. \u0026nbsp;It seemed his other hand was feeling empty.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Do you have another one that is similar to this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hmmm.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe act of using weapons with both hands sounded easy, but it wasn’t something he would recommend….. \u0026nbsp;Well, it would be helpful if he experienced this fact. \u0026nbsp;At his request, Artpe took out another short sword.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“All right. \u0026nbsp;The balance finally feels right. In truth, when I was bored within the palace, I used to busy my hands like this.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It must have been great. \u0026nbsp;It seem being the crown prince was a job of leisure.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilpennon was finally satisfied after he alternately swung his daggers in each hand. \u0026nbsp;At that moment, his information was updated.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Silpennon Le Diaz]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Level : 7]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Dual Wielding Lv1]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat’s right. \u0026nbsp;If seen in certain light, this guy would be considered to be a genius. \u0026nbsp;Artpe was dumbfounded as he let out a bitter laugh.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnyways, Silpennon was now ready for battle. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLeseti looked a bit disappointed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel had spend a year in a Dungeon, yet it seemed she was eager to go into another one. \u0026nbsp;She was excited.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We are doing this Dungeon exploration to grow Silpennon’s ability. \u0026nbsp;If possible, we should stay out of his way. \u0026nbsp;Even if there are traps, we won’t be telling you about it, so you should firm your resolve. \u0026nbsp;Is that clear?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“…. all right.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilpennon gulped as he nodded his head.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe party members entered the Dungeon side by side.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe first one to speak inside the Dungeon was Maetel.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe, there are a lot of something here.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“A lot? \u0026nbsp;It should be. \u0026nbsp;This Dungeon has a pretty high monster regeneration, but it is frequented by…. \u0026nbsp;Huh.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs soon as he entered the Dungeon, Artpe sensed an unusual amount of signatures. \u0026nbsp;He activated his Read All Creation ability, and he was able to see that the numerous monsters were all Slimes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA thought came to him at the same time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘When was this Dungeon became known to the humans?’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was easily able to find the answer. \u0026nbsp;In his past life, the Dungeon was first found by the hero’s party when they exited the palace. \u0026nbsp;This Dungeon was revealed to the other adventurers after it was found by them. \u0026nbsp;Of course, no one in this world knew about this place at this point in time!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah. \u0026nbsp;It seems we are the discoverers.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Discoverer? Is it something good?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Of course, it is good. \u0026nbsp;No one has touched this place, so the rewards will be great. \u0026nbsp;Since the traps are brand new, it’ll be hidden completely, so it’ll be thrilling to go through this place. \u0026nbsp;You’ll also be able to experience monsters collapsing towards you…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It sounds as if the negative outweighs the good!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe looked down towards the end of the dark and damp corridor made out of wood. \u0026nbsp;An incredibly large army of Slimes were coming towards them. \u0026nbsp;Silpennon had also caught sight of them, and his face turned pale. \u0026nbsp;Artpe let out a kind smile towards him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Cheer up. \u0026nbsp;You can do this.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wait a moment. \u0026nbsp;This is a bit different from what we’ve talked about… \u0026nbsp;Goo-ahk!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Slimes knew that the intruders were ridiculously strong by instinct. \u0026nbsp;This was why they immediately focused on Silpennon, who was the only one they had a shot of winning against.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilpennon turned pale as he was about to encounter the Slimes. \u0026nbsp;However, no one stepped forward to help him. \u0026nbsp;In the end, he was instantly buried by the group of Slimes. \u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe’s apathetic gaze turned towards Leseti. \u0026nbsp;He asked her a question.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hey, guardian knight. \u0026nbsp;What are you doing?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I trust in his highness. \u0026nbsp;Well, if he dies, it can’t be help. \u0026nbsp;\u0026nbsp;By the way, Artpe, would you accept me into your party if I’m alone?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are very forthright.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ooh-ah-roo-koo-ahh-gyah-gyah-gyahk!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt seemed Leseti’s way of thinking reached a turning point on her 20th year in life. \u0026nbsp;Silpennon was buried by the Slimes, so it was hard to tell what he was yelling.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Your highness, I have faith in in you! \u0026nbsp;Still, just to safe, you should tell me what kind of funeral you want! \u0026nbsp;You should have told me beforehand!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ooh-gahh-gyahhhhhhhhk!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter 45 minutes, Silpennon used his Dual Wielding style to kill all the Slimes. \u0026nbsp;The three people smiled at him as if they knew he would have succeeded. \u0026nbsp;He had no words for them. \u0026nbsp;He just clenched his two fists, and he made a resolve!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll become stronger… \u0026nbsp;I will become stronger at all cost!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, that’s the spirit!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ooh-ahhhhhhhhhh!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was how the hero’s party started their second Dungeon exploration.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-25\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-27\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-26","bookId":1506,"creation":"Sep 10, 2019 4:36:15 AM","modification":"Sep 10, 2019 4:36:15 AM"}
