{"id":52151,"no":30,"title":"Chapter 29 - Dungeon, Evolution and Success (3)","content":"\u003cp\u003eChapter 29 - Dungeon, Evolution and Success (3)\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That! \u0026nbsp;Give it back to me!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You can’t take back what you gave me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ooh-gooooo.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two of them now knew the value of the gem. \u0026nbsp;They still didn’t know what kind of gem it was, but at the very least, they knew that it was the main reason why men had desperately tracked them down when they ran away from the palace.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Artpe stuck out his red tongue as he teased them. \u0026nbsp;He continued to pour Mana into the Demite’s Gemstone.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Can you hear me? \u0026nbsp;No , I don’t think it can communicate yet.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demite’s Gemstone won’t show its true worth until it was refined.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, it was such an amazing gem that it could amplify one’s Mana, and it had the ability to remember magic spells. \u0026nbsp;Even at its current form, it was a remarkable item. \u0026nbsp;Artpe was satisfied with it until now.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What are you trying to do with that! \u0026nbsp;Are you perhaps going to feed it to the Slime like the rocks from before?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are mad. \u0026nbsp;If you do that, the Slime would most definitely evolve a step forward….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That is what I want.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Giant Slime was desperately looking for a power that would allow it to overpower Maetel.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAgain, the Dungeon’s 10th floor acted in concert with the Giant Slime’s struggle. \u0026nbsp;Large changes occurred once again. \u0026nbsp;The walls that divided the rooms melted away. \u0026nbsp;All the secret passageways were revealed. \u0026nbsp;The Dungeon allowed the Giant Slime to encounter the rest of the remaining Slimes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Keeeeeeee!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Gee-geek! \u0026nbsp;Gee-gee-gee!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe floor abruptly became a large plaza, and all the Slimes thrown away by the Dungeon knew what the Giant Slime intended. \u0026nbsp;They didn’t want to die in vain, so they did their best to oppose the Giant Slime.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe party was watching mere Slimes. \u0026nbsp;It would theoretically be ridiculous for them to feel any emotions for the Slimes. \u0026nbsp;However, they were faced with an impressive and overwhelming sight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Even such simple organisms fight hard to live...”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“They are no different than humans.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What kind of…. \u0026nbsp;\u0026nbsp;Humans are….!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Quiet.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe didn’t want to have a discourse about life with a brat. \u0026nbsp;Artpe let out a deep sigh, then for the last time, he injected his Mana into the Demite’s Gemstone.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis preparation was at an end.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How’s your Mana reserve, Maetel?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If it is just maintaining Berserk, I have enough. \u0026nbsp;If I use the Option…. \u0026nbsp;\u0026nbsp;I think I can use it about three times.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“All right. \u0026nbsp;You should be on standby.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe didn’t hesitate as he threw the purple colored gemstone held by his hand. \u0026nbsp;Coincidentally, one of the Slime, who had been opposing the Giant Slime, swallowed it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Gee-eeee-eeee]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It really ate it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, it didn’t matter how high the Slime’s level was. \u0026nbsp;The Demite’s Gemstone wasn’t an item that would be dissolved so easily. \u0026nbsp;The Slime, who possessed the gem, knew it had become stronger. \u0026nbsp;It coordinated with the other Slimes to attack the Giant Slime.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Goo-ohhhhhhhhhhhh!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Giant Slime ate all of them. \u0026nbsp;The Giant Slime’s wound healed easily from just eating its brethren.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Giant Slime’s anatomy was simple, so it was easy for it to heal itself. \u0026nbsp;By eating its brethren, it was able to grow immediately, and it was leveling up at a fast pace. \u0026nbsp;This was why the Giant Slime had targeted them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The number of Slimes is decreasing.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“In the beginning, there were around 5,000 of them.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I don’t know how this Dungeon was made, but the effects of Mana becomes stronger as one travels deeper into the Dungeon. \u0026nbsp;This is why this floor has stronger Slimes, and they are more numerous here.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was easier for strong monsters to spawn at location with high density of Mana. \u0026nbsp;\u0026nbsp;Even if it was Maetel and Artpe, it would have taken them several days to kill all the Slimes that came out all at once from the secret passageways. \u0026nbsp;However, the Giant Slime was killing all of them instead.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This really is like the Record Link!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It isn’t a completely closed system, so it won’t be efficient like the Record Link. \u0026nbsp;However, if one wants to see an organism ‘evolve’, this might be a better method than the Record Link.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I look forward to it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was very rare to come across such a high ranked Slime, so they would be able to look forward to the reward. \u0026nbsp;Artpe and Maetel was still conversing in a calm manner in front of such an overwhelming spectacle. \u0026nbsp;Silpennon and Leseti were taken aback by this fact, but they reached a point where they decided not to think about it any further.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah. \u0026nbsp;It went in.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Delmite’s Gemstone was inside the Giant Slime’s body. \u0026nbsp;At that moment, the numerous mana-infused stones that was within its body reacted to the Delmite’s Gemstone. \u0026nbsp;A small resonance started to occur. \u0026nbsp;Of course, this was what Artpe had been aiming for.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I see the end to the Slimes.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We really don\u0027t have much time left. \u0026nbsp;Be ready, Maetel.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, I’m ready.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere really were many varieties of Slimes nesting here. \u0026nbsp;Dungeons were something that was rare on the continent. \u0026nbsp;Maybe they were worth researching.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, he was watching a single Slime consolidating all the Slimes it had eaten.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Geeeeeeeeeeeeee!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the end, all the structures on the 10th floor were gone, and the whole floor had been turned into a wide open plaza. \u0026nbsp;If one discounted the living and breathing members of Artpe’s party, there was only one Giant Slime on the floor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had eaten everything within the Dungeon. \u0026nbsp;Everything that possessed Mana was within its body. \u0026nbsp;This was an unprecedented feat. \u0026nbsp;This being was pushing itself towards a higher Class.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Goo-ohhhhhhhhhhhhng!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My god. \u0026nbsp;It is letting out light…. \u0026nbsp;This is...”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Slime must be evolving!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“There is a higher Class that can be reached!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe’s eyes let out a strange light as he looked at the Slime letting out light from all over its body. \u0026nbsp;This was something that had never been seen before on this continent. \u0026nbsp;This moment was sweet and exciting!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe had a smile on his lips before he knew it. \u0026nbsp;He had come here in an attempt to educate Silpennon, so he had never expected to hit a jackpot here. \u0026nbsp;As expected, a Demon…. \u0026nbsp;A human should be good to other people in one’s life!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Giant Slime]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Level : 199]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen it went past level 100, it was given the name of Giant Slime. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt some point, a much bigger body appeared from within the light.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Huge Slime]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Level : 200]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe body of the Slime was letting out a rainbow light. \u0026nbsp;Its body possessed enormous amount of Mana, and its intelligence increased by another tier.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIts body was much bigger than before, but when it moved, it was more efficient in its use of energy. \u0026nbsp;Artpe immediately checked it with his Read All Creation ability, and he found out the Slime had several new skills. \u0026nbsp;These skills helped the Slime efficiently capture and digest its prey. \u0026nbsp;These needed skills were gathered in one place to strengthen the Slime.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe part that gave Artpe most joy was its name of Huge Slime. \u0026nbsp;It sounded extremely simple, but the name of this entity never existed on this continent before. \u0026nbsp;If he ranked how rare it was, it would probably be considered to be ultra rare.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“There we go.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[There we go.]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was as if Artpe and Slime had made a promise to speak at the same time. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs expected, it gained enough intelligence to be able decipher the human’s intention!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[I can eat you all!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen its body was trembling from delight, Artpe raised his voice to yell out loudly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You can attack it now, Maetel!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Understood!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[I can now eat you all!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Slime was large enough to fill the plaza. \u0026nbsp;The evolved Slime attacked the party. \u0026nbsp;However, before it could use its skills, the Sword Energy gathered at the tip of the long sword was let loose. \u0026nbsp;The golden energy traveled in a straight line to impact on the Slime!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[This isn’t enough…..!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Huge Slime was strengthened so much that Maetel’s Mana-infused attack pierced its body once before it healed its wound. \u0026nbsp;Maetel’s attack stalled the Slime for only 3 seconds!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hyper Rubbing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Artpe had completed all his preparations beforehand, so he had plenty of time to pull the trigger.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Ggoo-ooooo-ooohk!?]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Huge Slime let out a terrible scream as its body started to writhe. \u0026nbsp;The preys it had wanted to eat was right in front of it, yet it started to hit its body against the blameless Dungeon floor and walls. \u0026nbsp;It threw a fit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had gained higher intelligence, so the pain it perceived had increased dramatically. \u0026nbsp;The fact that it had been sure of its victory made the defeat a bitter pill to swallow.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I never knew magic could be used this way....”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Magicians are a scary existence!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe target of Artpe’s Hyper Rubbing were the rocks and the Delmite’s Gemstone swallowed by the Slime.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had assumed that these objects were part of its body, but they started rubbing crazily against its body as if they had a mind of its own. \u0026nbsp;There was no way it could endure the spell without losing its mind!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Goo-oooooooh······!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStill, it refused to give up. \u0026nbsp;It had broken through from the 1st floor to the 10th floor, and it had greedily eaten all the members of its race. \u0026nbsp;Mere pain wouldn’t make it give up on its objective. \u0026nbsp;Its greed was too strong for that to happen.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Tsk. \u0026nbsp;As expected, this level of attack won’t cut it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Delmite’s Gemstone boosted the power of Hyper Rubbing by a ridiculous amount, so he had hoped this attack would be able to bring down the Slime. \u0026nbsp;However, he had underestimated its willpower.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Goo-ooohhhhhh! \u0026nbsp;I’ll eat! I’ll eat! \u0026nbsp;I’ll eat! \u0026nbsp;I’ll eat!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven as its body was breaking apart from within, it moved its body to attack the party. \u0026nbsp;When Silpennon and Leseti saw the enormous body of the Slime move slowly towards them, they didn’t offer any resistance. \u0026nbsp;They just trembled in fear.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that moment, Artpe put one hand atop Maetel’s hand, which was gripping the longsword.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let’s attack it for the second time, Maetel.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Y...yes..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was physical contact initiated by Artpe. \u0026nbsp;Maetel’s heart felt as if it was on cloud nine. \u0026nbsp;She was so happy that it was difficult to maintain her Berserk skill. \u0026nbsp;If the skill was canceled, they would lose to the Slime.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe was having a hard time controlling her emotions, so her eyes started to spin. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe didn’t realize what she was feeling. \u0026nbsp;He gave her an order with a calm voice.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You just have to attack like before. \u0026nbsp;You should gather your energy and shoot it towards the Slime. \u0026nbsp;I’ll take care of the rest.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, I’ll try…...”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel worked desperately to control her heart, and she gathered her Mana at the tip of her sword. \u0026nbsp;At that moment, he used the Mana Link to provide Mana to her. \u0026nbsp;When she realized what was happening, Maetel used Record Divide, so Artpe could share more Mana with her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if it was the same skill, its power would be amplified by a lot.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Shoot it. \u0026nbsp;Mana String.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMoreover, it was possible for the two of them to share each other’s skills and options! \u0026nbsp;It was possible to combine all of them into one attack!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel felt the energy gathered inside the longsword change through magic, but she used her instinct to shoot it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were black stripes mixed in with the golden light as background. \u0026nbsp;This strange energy impacted on the Huge Slime’s body, and it pierced through….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koo-ahhhhhhhhhng!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe’s will took hold of the attack. \u0026nbsp;The trajectory changed sharply as the attack drilled deeper into its body once again!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hyper Rubbing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe attack wasn’t at an end yet. \u0026nbsp;The Mana Strings that had manifested around the beam of light were imbued with the option of Hyper Rubbing. \u0026nbsp;The energy within him manifested as friction within, and it was being delivered right into the Slime!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was a ridiculous composite spell. \u0026nbsp;The method Artpe had used possessed such a high degree of difficulty that it would have made all the other magicians on the continent feel disheartened!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“As expected, a mage is amazing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe was always amazing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“C...cool…...”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, everyone gathered in this place were idiots, so the only feedback he received was the fact that it was cool and amazing!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Koo-ohhhhhhhhhhhhhng!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Huge Slime let out a roar that contained its rage and pain. \u0026nbsp;It finally acquired the power that would enable it to eat all of its enemies. \u0026nbsp;It had been so sure, yet an unexpected attack had been used against it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt couldn’t use its power, because the stones within its body were constantly vibrating. \u0026nbsp;On top of that, an additional attack had been used against it. \u0026nbsp;It was so painful that it was driving it nuts!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[I’ll kill you at all cost! \u0026nbsp;I’ll kill and eat you! \u0026nbsp;I’ll kill you!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Are you going to ask the Dungeon for help again? \u0026nbsp;Well, the Dungeon no longer has anything hidden away that it can give you. \u0026nbsp;So what can you do?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was a cruel light in Artpe’s eyes as he looked at his struggling enemy. \u0026nbsp;The Slime extended its body to hit the wall, and it attempted to eat the weaker members of Artpe’s party. \u0026nbsp;However, all of its attempts were thwarted by the Hyper Rubbing. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was as he said. \u0026nbsp;The Dungeon had given everything it had hidden to the Huge Slime. \u0026nbsp;There were no methods available to the Huge Slime that would allow it to strengthen itself again. \u0026nbsp;Its struggle was wasted. \u0026nbsp;It was all in vain.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Uh. \u0026nbsp;The purple gem…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLeseti found herself to be pathetic, since she was trembling in front of the enemy without putting up any resistance. \u0026nbsp;She tried to right herself when she caught sight of the change that was occuring to the gem within the struggling Huge Slime. \u0026nbsp;The purple light was getting stronger as time passed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah. \u0026nbsp;As that bastard reached the high rank Class, its ability to dissolve substance also increased by a lot. \u0026nbsp;The Demite’s Gemstone is probably providing it with more power as it become more refined as time passes.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Artpe kindly gave an explanation, Leseti’s expression turned more peculiar.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You... you planned on refining the gem, while attacking your enemy….!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Isn’t it obvious? \u0026nbsp;If I wanted to kill it, I could have killed it with my modified Mana.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You…...!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe had an impudent smile on his face as he replied to her. \u0026nbsp;Leseti grinded her teeth when she saw the annoying smile of the brat. \u0026nbsp;However, she couldn’t deny she was slightly in love with that smile.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter three minutes, the Huge Slime stopped its fruitless struggles. \u0026nbsp;It meekly faced its death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA new piece of history was recorded on the continent, and it was quietly buried at that moment.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-28\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-30\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-29","bookId":1506,"creation":"Sep 10, 2019 4:36:15 AM","modification":"Sep 10, 2019 4:36:15 AM"}
