{"id":52161,"no":40,"title":"Chapter 39 - Hero VS Kingdom (1)","content":"\u003cp\u003eChapter 39 - Hero VS Kingdom (1)\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFortunately, Mycenae quickly restocked her supply of magic books after selling them in bulk to Artpe. \u0026nbsp;All of them were sold to Artpe once again. \u0026nbsp;It was a total of five books. \u0026nbsp;She was reliable in the fact that she had acquired the Cleaning magic(45 gold).\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You guys should all gather around me. \u0026nbsp;Cleaning!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I was cleaned in an instant!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My clothes are so soft and fluffy.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the moment when Artpe took a step forward in becoming a lifestyle magician. \u0026nbsp;Of course, a normal lifestyle magician couldn’t clean a large group of over 300 people at once. \u0026nbsp;Mycenae turned pale at the sight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You have a really large amount of Mana. \u0026nbsp;Are you around level 300?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I told you not to dig in too much, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe’s current level was 163. \u0026nbsp;If he went by the standard of the Read All Creation ability, his Magic Points was above 800. \u0026nbsp;It was the Magic Points he had in his previous life at level 200.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy that time, Artpe had already begun serving under the Demon King, and he had learned all the spells available. \u0026nbsp;Of course, one had to take into consideration that Demon race naturally had overwhelmingly more magical energy. \u0026nbsp;This was why the amount of magical energy he possessed right now was absurd.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had been a demon in his previous life, but that was a flimsy explanation as to why he possessed so much magical right now. \u0026nbsp;Artpe had been born with exceptional talent for magic, and it was at a level where the only plausible explanation was the fact that he was a hero.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he dwelled more on that thought, it felt as if he would become conceited by it. \u0026nbsp;Therefore, he abandoned thinking about that subject. \u0026nbsp;\u0026nbsp;Conceit was the factor that always killed the Four Heavenly Kings! \u0026nbsp;This was why he changed the subject.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What did you do with Silpennon?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Even if I’m performing a scheduled task, I couldn’t stay away when the customers I am in charge of had just cleared another Dungeon. \u0026nbsp;However…. \u0026nbsp;I’m guessing this wasn’t a run of the mill Dungeon?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“When did ajumma became in charge of us as clients….. \u0026nbsp;Well, it clearly isn’t normal.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe was a Dungeon Merchant, but this didn’t mean she had all the information regarding the Dungeon she will visit next. \u0026nbsp;The Dungeon Merchants were given permission to mobilize when a pacified Dungeon had hidden treasures.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s been awhile since the Dungeon Owner was exchanged from a monster to human. \u0026nbsp;He had the Dungeon barrier up······ Since he is dead, it should have dissipated.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMycenae looked over the children gathered in this space, and she immediately picked up on what was going on.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah-ha. \u0026nbsp;So that’s what they were aiming for….. \u0026nbsp;\u0026nbsp;Oh wow. \u0026nbsp;You were able to break it up. \u0026nbsp;I’ll have to revise my opinion of you again.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You don’t have to revise it. No, just don’t look at me at all.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are too much!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel had killed him too quickly, but the black magician was around level 100. \u0026nbsp;Normally, beginner heroes shouldn’t be able to take down a level 100 being! \u0026nbsp;Maetel had shown enough force to kill a level 200 with a single blow. \u0026nbsp;The black magician had been unlucky in facing Maetel as an opponent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, even after Maetel had defeated the black magician, the monsters and the children who could turn into demons were still present. \u0026nbsp;Mycenae was able to make her appearance only after Artpe got rid of all the potential risk factors.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Customer, you surely aren’t thinking about ending our transaction after buying the spell books? \u0026nbsp;I’m sure you are going to share in the Dungeon rewards with me, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were two types of Dungeons. \u0026nbsp;There was the naturally occurring Dungeons and the artificial Dungeons. \u0026nbsp;This Dungeon was a naturally occurring Dungeon. \u0026nbsp;The magician who took over this place was proficient at black magic, but he hadn’t been talented at Dungeon exploration. \u0026nbsp;This was why all the secret traps and rewards remained untouched.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was what Mycenae was aiming for. \u0026nbsp;Of course, since she had been able to find the items, Artpe would be able to find them too. \u0026nbsp;This was why she decided to give up on fruitlessly searching further for more items. \u0026nbsp;She wanted to immediately enter into a business transaction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, if so…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe looked at his surrounding. \u0026nbsp;The level of the black magician, who had taken over this Dungeon, had to be discounted. \u0026nbsp;It looked as if the original Dungeon boss had been a weak monster. \u0026nbsp;Still, it wasn’t as if Artpe could not find any compensation using his Read All Creation ability.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m hungry.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My stomach keeps growling.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, there was a problem that he had to deal with before he gathered the Dungeon rewards. \u0026nbsp;He looked at the children who looked as if they could drop at any moment. \u0026nbsp;Artpe sighed as he threw a gold coin towards Mycenae.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“First, I want you to give them something to eat. \u0026nbsp;The children were starved for couple days, so I want you to give them food that wouldn’t be too much of a burden on them.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oh my. \u0026nbsp;You are so kind. \u0026nbsp;As it happens, I have a consumable item that was developed by the mage tower to be used on war refugees. \u0026nbsp;However, there is a single down side…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll give you an additional gold.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“As always, thank you very much, customer!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMycenae distributed the items to the children with the help of Maetel and Aena. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSienna had experienced a sudden physical change. She was changed into an existence that didn’t get hungry much. \u0026nbsp;This was why Sienna helped out in the distribution. \u0026nbsp;Of course, Mycenae showed interest in her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oh my. \u0026nbsp;You have very pretty hair.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I want you to give me an artifact that can conceal her identity.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I was wondering why you haven’t asked me about that. \u0026nbsp;You always seems to meet people of suspect origin. \u0026nbsp;Or maybe those kinds of people are drawn to you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ha.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe snorted at Mycenae’s words as he went around the communal space. \u0026nbsp;Every time he disturbed a location a wooden box would suddenly appear out of thin air or the lichen growing in the cracks of the Dungeon’s wall would let out a strange light.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe went to four locations to gather the rewards, but as expected, they weren’t worth much.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It should be around 29 gold.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, here is your 29 gold. \u0026nbsp;Also, this is a bonus for my dear customer.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe handed off all the items, and he received a small hairpin from her. \u0026nbsp;It was a metal adornment shaped like a butterfly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This stops the magical energy reaction from leaking out. \u0026nbsp;The artifact has a very simple function, but it should be enough for the girl.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMycenae had decided this item was enough for Sienna. \u0026nbsp;Her hair and skin was unusual, but it could be dismissed as being not too out of the ordinary for a girl of her age.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I want one Crystal Ball of Blessing.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Artpe had other ideas.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You want that too!? \u0026nbsp;Is it because this child is a demon?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMycenae was shocked. \u0026nbsp;She tried to get a closer look at Sienna, but Artpe didn’t allow any further inquiry. \u0026nbsp;In the end, Mycenae pouted as she handed him a Crystal Ball of Blessing for 500 gold.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Well, this is the end to our transaction. \u0026nbsp;You should head back for now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How can you push me out so coldly every time like this? \u0026nbsp;Still, I won’t give up. \u0026nbsp;I’ll someday make you the king of the business world! \u0026nbsp;You better be prepared for it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ajumma, don’t try to steal Artpe!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I told you to stop doing that.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Mycenae made another loud commotion, he put away the Crystal Ball of Blessing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSienna stared at him as she asked him a question\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oppa, what is that for?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt seemed she had become sensitive to Mana when she was turned into a Evil Reflector. \u0026nbsp;It seemed she was very interested in the artifact.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe let out a small laugh as he stroked her head.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll tell you about it a little bit later.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA short amount of time had passed. \u0026nbsp;All the children were brought outside, and Artpe returned the children to the townspeople. \u0026nbsp;In a flash, a reunion filled with tears occurred….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mommyyyyy!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Son! \u0026nbsp;M...my son!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFortunately, most of the children taken from this particular town were all safe. \u0026nbsp;The townspeople were deeply moved by the return of the children, so they started praising Artpe and Maetel. However, Artpe gave them a warning as he looked at them with serious eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If you spread our name, I’ll put a curse on all of you. \u0026nbsp;The curse will turn you into frogs.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heek!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHeroes were always targeted by repeat Quests, and these Quests would cheapen the value of their names! \u0026nbsp;Of course, the Demon King had created a perfect recipe in the past where these repeat Quests helped along the explosive growth of the hero as an unintended consequence. \u0026nbsp;However, the current situation differed quite a lot from the past.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSince he was now aware of the fact that Demon King was hatching such a horrifying plan, they would have to move carefully. \u0026nbsp;A disguise and a mask was a must. \u0026nbsp;They also had to be prepared to bury such fake identities in the darkness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The problem is…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe gave a stern warning then he turned around. \u0026nbsp;There were still couple hundred children left.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hyung, I want to see my mom too.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“B...be quiet. \u0026nbsp;We shouldn’t cause more trouble for the magician-nim!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heeng. \u0026nbsp;Mom. \u0026nbsp;Mommy~”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had no problem with the children who were originally from this town. \u0026nbsp;However, he wondered what he should do with the children captured from the other towns.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, they would have to be returned to their own towns. \u0026nbsp;If he was like the heroes from the old stories, he wouldn’t have hesitated. \u0026nbsp;He would have personally returned the children to each town. \u0026nbsp;However, the Quest had ended, so he needed to move onto his next goal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e·····this kind of event always led to a more annoying and larger incidents. \u0026nbsp;The Demon King’s scheme always seemed to come in succession!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, the Demon King was a chef that tried to get a richer flavor by cooking an already seared meat once again….. \u0026nbsp;Artpe was well aware of the Demon King’s far-reaching recipes, so he was annoyed at being at the receiving end of it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘I have to nip this in the bud. \u0026nbsp;It would be stupid of me to be satisfied with leaving the matter as is when I know more will come from this. \u0026nbsp;Moreover….’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the end, Artpe came to a firm resolution.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he let his heart make the decision, he would have ended his association with the townspeople here. \u0026nbsp;He wanted to go rest. \u0026nbsp;However, if he didn’t tie this up right now, he knew he would become more exhausted by what stemmed from this event in the future.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You guys should move your town.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the end, a suggestion popped out of his mouth. \u0026nbsp;The townspeople became dumbfounded at his words.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You want us to move our town? \u0026nbsp;Why? \u0026nbsp;No, how?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll be going around to the towns where these children are from. \u0026nbsp;I’ll be gathering all the townspeople from there. \u0026nbsp;I want to consolidate everyone into forming a large town. \u0026nbsp;\u0026nbsp;You guys will create a small city.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“W...we can’t do that!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’ll be too hard!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We are already living a hard life here!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe expected their objections. \u0026nbsp;However, Artpe’s attitude didn’t change.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If you want your children to be stolen again, you can continue on living here. \u0026nbsp;You all have to stick together right now. \u0026nbsp;You have to stick together to grow your numbers. \u0026nbsp;You won’t be able to win against a country, but at the very least, you will have grown your own presence. \u0026nbsp;You have to be large enough where many people will become aware it if something happens to you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf enough humans were gathered in a single location, it might have an effect on other entities. \u0026nbsp;It would be hard for the Archduke to mess with them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt would also make it harder for the Demon King’s army to hatch a scheme. \u0026nbsp;They were able to gather and put a curse on the children as experiments, because they were able to steal the children in secret.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I...if we move our residences, how are we going to feed ourselves?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You already had a hard time making a living here. \u0026nbsp;Do you think much will change if you move? \u0026nbsp;You’ll either farm or hunt for game. \u0026nbsp;That isn’t my problem.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe had other things to do. \u0026nbsp;He had to ruin the Archduke. \u0026nbsp;Furthermore, he had to ruin the black magicians that were messing with the entire country.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt the climax of this Quest, couple Demons would probably make their appearances. \u0026nbsp;However, he was confident that he could kill them. \u0026nbsp;Maetel had awoken to her Innate ability. \u0026nbsp;It would be possible to do so with her help!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘I’ll have to ruin a kingdom before I kill the Demon King. \u0026nbsp;Mmmm. \u0026nbsp;All right. \u0026nbsp;I kind of feel like a Four Heavenly King again.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe couldn’t shake the feeling that something was out of joint. \u0026nbsp;However, this actually made him quite happy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel looked at him with unshakable trust, and Sienna looked up at him as if he was her idol. \u0026nbsp;Aena and the numerous children looked on with worried eyes. \u0026nbsp;The townspeople looked to be in a state of shock and fear at Artpe’s forceful order.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Well, we’ll start our city construction plan from this point on!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was at that moment when the first Quest turned into a succession of scenario Quest.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-38\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-40\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-39","bookId":1506,"creation":"Sep 10, 2019 4:36:15 AM","modification":"Sep 10, 2019 4:36:15 AM"}
