{"id":52128,"no":7,"title":"Chapter 6 - Dungeon with Death (2)","content":"\u003cp\u003eChapter 6 - Dungeon with Death (2)\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany adventures entered the dungeons with dreams of becoming rich overnight. \u0026nbsp;However, most of them were wiped out before they were able to get past the 1st floor. \u0026nbsp;The reasons varied. \u0026nbsp;They might be lacking in combat capability, or they might not have caught sight of a trap. \u0026nbsp;They might have mismanaged their equipments or they might have ran out of food. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wow, \u0026nbsp;Look! \u0026nbsp;Look at this stairway! \u0026nbsp;Does this stairway perhaps lead to the second floor?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, that’s right..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, their team’s battle capability was taken care of by the human hero Maetel. \u0026nbsp;Everything else was taken care of by the \u003c/span\u003e\u003cspan style\u003d\"\"\u003eex-Four Heavenly King\u003c/span\u003e\u003cspan style\u003d\"\"\u003e Artpe. \u0026nbsp;There was no way this two man team would face any difficulties here. \u0026nbsp;After defeating the Elite Zombie, Maetel had advanced into being a level 6. \u0026nbsp;The momentum created by Maetel allowed them to clear the 1st floor in just 6 hours. \u0026nbsp;They had cleared it at superspeed. \u0026nbsp;At the end of the 1st floor, Maetel was level 8, and Artpe somehow managed to advance into being level 5.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mmmmmmm. \u0026nbsp;Why am I progressing so fast? \u0026nbsp;Artpe is more amazing than me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It is usually like that. \u0026nbsp;Each person has a different area of expertise.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel’s growth speed was much faster than his. \u0026nbsp;He should be upset at this reality, but Artpe already knew about the growth speed displayed by the hero in his previous life. \u0026nbsp;In Artpe’s eyes, the current Maetel was progressing very slowly. \u0026nbsp;She’ll probably level up much faster when she awakens to her Innate ability.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This won’t do.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnlike Artpe, who had just accepted this fact, Maetel thought long and hard in front of the stairway \u0026nbsp;Afterwards, she resolutely nodded her head as she turned to look at Artpe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We have to match our levels.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No, we really don\u0027t need to do that. \u0026nbsp;As I said before, it’ll be safer for us if you leveled up, since you are in the front….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We have to match our levels.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe light in Maetel’s eyes was very serious. \u0026nbsp;Artpe couldn’t help help but ask the question.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What’s the reason behind this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If our level difference is too high, I’m afraid we will grow apart.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are using some pretty poetic figure of speech…..?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the point brought up by Maetel unexpectedly touched on the core of a problem faced by all parties. This was one of the main reasons why most parties broke up over time. \u0026nbsp;If one member of the party increased his level too quickly, it meant the other party member would fall behind. \u0026nbsp;As the difference in level becomes more severe, the difference in ability also widened. \u0026nbsp;At that point, it was mutually harmful for that party to remain together. \u0026nbsp;It was to be expected, since a monster’s level wasn’t fluid. \u0026nbsp;It didn’t adjusted to the level of its opponent. \u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘I’m pretty sure this dummy didn’t think that far ahead… \u0026nbsp;She simply doesn’t want a gap to form between the two of us.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe let out a bitter laugh. \u0026nbsp;He had wanted to overwhelmingly develop Maetel’s ability. \u0026nbsp;This would allow him simply stand in the back. \u0026nbsp;He had planned on eating the crumbs off her table. \u0026nbsp;However, he had no choice now, since the hero wouldn’t let go of this issue. \u0026nbsp;He had to keep step with her to a certain extent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“All right. \u0026nbsp;We’ll do that, but my growth rate is much slower than yours. \u0026nbsp;It’ll be impossible to match our levels. \u0026nbsp;How about we split the monsters evenly?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I really would like it to be the same….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel grumbled as if she didn’t like the idea, but in the end, she accepted it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Well, let’s head up then.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Why are you going up? \u0026nbsp;You should stand still.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Artpe browbeat Maetel, he extended his Mana infused hand. \u0026nbsp;He grabbed and pulled at something in the empty air. Suddenly, the stairway in front of them collapsed as a fairly large wooden chest rose up. \u0026nbsp;Maetel shouted in joy. \u0026nbsp;Artpe winked at her as he gave her an explanation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is a trap. \u0026nbsp;If you went up without discovering this box, poisoned needles would have shot out from the floor to kill you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heeeeek!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Of course, even if someone was lucky enough to find this box, they wouldn’t have known that this is a monster called Mimic. \u0026nbsp;It is pretending to be a treasure chest, and most adventurers usually die from its attack.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oooooh.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The worst part happens when one identifies and kills the Mimic. \u0026nbsp;It shoots out poisoned needles when it is killed.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I don’t like this anymore!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn truth, the level 5 zombies were to be expected inside a Dungeon near a beginner’s town. \u0026nbsp;However, they had encountered a pretty elaborate trap within the Dungeon, and that fact did surprise him. \u0026nbsp;He was also surprised at finding an Elite monster within the first room of the Dungeon!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘The past hero didn’t explore this Dungeon. \u0026nbsp;There were only shitty zombies out at the entrance, so she hadn’t even bothered to come into this Dungeon. \u0026nbsp;Since this is supposed to be a beginner’s Dungeon, I might have underestimated it…. \u0026nbsp;Maybe this Dungeon is….’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis might be a hidden treasure trove. \u0026nbsp;Artpe swallowed back the words he had almost blurted out. \u0026nbsp;A beautiful flower had its thorns. \u0026nbsp;Currently, they needed an opportunity to safely level up. They shouldn’t be putting their life on the line to earn treasures. \u0026nbsp;This couldn’t be seen as being all good news. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What should I do, Artpe?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Get back.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe was holding four long nails between his fingers. \u0026nbsp;Of course, these were the nails gathered by diligently killing the zombies. \u0026nbsp;As expected, it was a lousy weapon. \u0026nbsp;It could inflict a very weak poison effect when thrown towards an opponent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the other hand, it was an entirely different story if it was used by someone, who could infuse his Mana. \u0026nbsp;He could strengthen the items. \u0026nbsp;Its toxicity and sharpness was strengthened, but the nails would cease to exist once the Mana was exhausted. \u0026nbsp;It was a single use weapon, but it would be able to cause significant amount of damage!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, if one was skilled enough to infuse and strengthen an item, one wouldn’t usually use it on nails acquired from zombies. \u0026nbsp;It would be much better to use it on throwing weapons. Still, this method of Mana infusion was only known to those, who suffered from cold and hunger, like Artpe in the past. \u0026nbsp;It was a very sad actuality.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Eh-eet.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Artpe confirmed that Maetel had retreated behind his back, he quickly and accurately threw four nails towards the box. \u0026nbsp;The Mimic had passively stood still like a wooden box, but when the nails were about to hit, it let out a weird sound. \u0026nbsp;Then it jumped to avoid the nails…. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s a fake, \u0026nbsp;you retard!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Geeeeeeeeeee!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn a flash, the nails changed direction to pierce the wooden box. \u0026nbsp;The Mimic hung in the air, and the trap located below its original position activated. \u0026nbsp;Several dozen poison needles shot out of the ground to riddle the Mimic’s body with holes!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e[Gee-geek!]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt let a short cry before it became silent. \u0026nbsp;It had bitten its tongue in its death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel, who had stayed silent, carefully asked Artpe a question.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is it over….?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, it is over..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Mimic was one of the rare and special monsters. \u0026nbsp;Therefore, the ‘reward’ it dropped was overwhelmingly better when compared to its difficulty. \u0026nbsp;\u0026nbsp;As proof, Artpe’s EXP exploded upwards after defeating it. \u0026nbsp;He had leveled up twice, and he felt the energy within his body surge forward. \u0026nbsp;Even if he hadn’t checked it with his Read All Creation ability, the Mimic was most definitely dead.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Artpe is really amazing…. \u0026nbsp;I never expected you to kill it in such a way!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m going to get sick of hearing that soon.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe replied flatly, and he moved towards the dead Mimic. \u0026nbsp;The dead Mimic, which had its tongue out, was flipped over by Artpe. \u0026nbsp;When he shook it, coins and small daggers fell onto the floor. \u0026nbsp;When she saw this, Maetel yelled out in surprise.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I thought this monster wasn\u0027t a treasure box. \u0026nbsp;What’s going on?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It swallowed humans, who mistook it for a treasure chest. \u0026nbsp;It digested everything it could, and the rest are leftovers kept inside its body. \u0026nbsp;This is also another reason why it is easy to confuse a Mimic with a treasure chest.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Monsters are really bad….!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I wouldn’t really say they are bad….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe monsters were born this way. \u0026nbsp;Humans slaughtered and ate innocent pigs and cows. \u0026nbsp;It was the same with monsters. \u0026nbsp;They ate humans. \u0026nbsp;This couldn’t be simply be explained by the concept of good and evil. \u0026nbsp;Everyone was just struggling to live.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“However, for us to live, he have to kill all of them.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m not sure what you are trying to say, but I’ll defeat anything that torments Artpe!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen she killed the goblins for the first time, she had trembled like a leaf from the shock. \u0026nbsp;This happened only yesterday, yet she was quick to act heroic in front of him now.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor a moment, the image of the hero from the past superimposed on the current hero, and it gave him the goosebumps. \u0026nbsp;Now that he thought about it, the past hero hadn’t shown any signs of hostility towards him. \u0026nbsp;Instead, she had felt sorry and worry for him. \u0026nbsp;This truth came to him a bit late. \u0026nbsp;He kept a loose smile on his face as he collected the loot from the Mimic.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey had earned only 26 bronze coins from killing all the zombies on the first floor. \u0026nbsp;The Mimic had barfed out 138 bronze coins. \u0026nbsp;Moreover, there were a whopping three silver coins within the loot. \u0026nbsp;Each silver coin was worth a 100 times more than a bronze coin.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf one possessed 2 silver coins, one could feed a family of four for a month. \u0026nbsp;Maetel had lived her entire life in the back-country, so of course, the amount made her eyes turn round.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Amazing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is nothing compared to what you’ll experience and earn from now on.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Don’t say ‘you’, say ‘us’!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, yes..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter he roughly ruffled Maetel’s head, he threw the empty husk of the Mimic to the floor. \u0026nbsp;\u0026nbsp;The dead corpse cleanly vaporized into the air, and in its place, a book was left behind. \u0026nbsp;It was as absurd a scene as the goblins spitting out the bronze coins.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It is a book...?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Mimic is a rare monster that is very hard to encounter. \u0026nbsp;Moreover, it is very troublesome to kill. \u0026nbsp;This is why the ‘reward’ is overwhelmingly generous. \u0026nbsp;It is generous in terms of EXP and….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt didn’t matter if the content of the book was lousy. \u0026nbsp;A magic book was guaranteed to be worth 30 silver coins no matter what. \u0026nbsp;He grinned as he picked up the ‘Skill Book’.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“...items. \u0026nbsp;If one is able to safely kill the Mimic, it is the same as finding a treasure box.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Amazing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel couldn\u0027t write, but she could read a little bit. \u0026nbsp;She clapped her hands as she looked over the book.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Amazing. \u0026nbsp;It says Hyper Loving! \u0026nbsp;Love means deep affections. \u0026nbsp;Didn’t Artpe teach me that before? \u0026nbsp;This means this magic is related to love!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Uh…. \u0026nbsp;Mmm. \u0026nbsp;Nope.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eArtpe hadn’t read the name of the skill...no, he hadn’t read the name of the Spell Book yet. \u0026nbsp;When he heard Maetel’s words, his face crumpled in distress. \u0026nbsp;Why did such an item have to come out! \u0026nbsp;On the other hand, Maetel wasn’t even aware of what Artpe was thinking inside. \u0026nbsp;Her cheeks were bright red as she fidgeted in place.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“With this magic, Artpe and I… \u0026nbsp;Our l...love will….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It isn’t love. \u0026nbsp;It is rub.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What does rub mean?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Rubbing means friction.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“....huh?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel tilted her head. \u0026nbsp;However, Artpe’s expression was still crumpled in a harsh manner. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was a useless spell for him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Rubbing type spells were divided into Soft Rubbing, Rubbing, Hard Rubbing and Hyper Rubbing. \u0026nbsp;\u0026nbsp;It looked mysterious, because it was subdivided into 4 types. \u0026nbsp;However, its special effect was very simple. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt basically allowed one to rub Mana against one’s enemies!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the off chance that there was some secret meaning hidden behind the spell, Magicians had conducted research on this spell. \u0026nbsp;However, nothing much was gained from the studies. \u0026nbsp;This didn’t mean the research had been completely fruitless. \u0026nbsp;Some high ranking aristocrats, who possessed enough wealth to hire mages, found that the Rubbing magic allowed them to feel some peculiar sensations. \u0026nbsp;It opened the door to some awkward possibilities. \u0026nbsp;It was best to omit such details.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Basically, Hyper Rubbing is the same as rubbing very hard.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mmm. \u0026nbsp;Ooooooh-mmmmm…..?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf there was one advantage to this spell, the Rubbing Skill didn’t have any level restrictions. \u0026nbsp;Artpe would have no trouble learning it right now. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this point, Maetel had another question.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“So why do you have to learn such a useless magic?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“All Skill Books and Spell Books allows one to expand one’s limits, \u0026nbsp;It grows one’s abilities. \u0026nbsp;This effect occurs just from learning it. \u0026nbsp;This is why all Skill Books and Magic Books are expensive despite its content.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was one of the biggest reasons why the hero class was considered to be a cheat. \u0026nbsp;The hero could learn all Skills and Spells. \u0026nbsp;If there was a supply of Skill Books, the hero could basically learn all of them using just the base ability!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ah. \u0026nbsp;Of course, Skills or Magic can fail if you don’t completely understand what you learned. \u0026nbsp;This is why it isn’t such an overwhelming advantage to learn these Books. \u0026nbsp;\u0026nbsp;The technical term for this is called Failure effects. \u0026nbsp;You should remember that term.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Failure effects….\u0026nbsp; I memorized it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, this term was unrelated to Artpe. \u0026nbsp;He had the Read All Creation. \u0026nbsp;He was able to understand all phenomena! \u0026nbsp;Artpe immediately learned the Hyper Rubbing, and the purity of his magical energy increased. \u0026nbsp;It bolstered his body. \u0026nbsp;He felt the overwhelming magical energy fill him, and he let out a deep sigh.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hoo-oooooh.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if Rubbing was a useless magic, Hyper Rubbing was the best tier amongst the Rubbing magic. Of course, the level of magical knowledge within was high (the result was lousy), and the amount of Mana reacting to the activation of the magic was also enormous (the result was lousy). \u0026nbsp;Still, Artpe had gained almost 20 magical energy just from learning the spell. The effect was amazing!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Maybe, this might be better than learning a mediocre spell like the Fire Needle. \u0026nbsp;The Mana I can throw around will be stronger than most fireballs.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“As expected, Artpe is amazing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I knew you were going to say that. \u0026nbsp;Let’s go.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey had gathered everything that needed to be gathered. \u0026nbsp;If one looked only at the results, one could see that they were growing at ridiculous rate. \u0026nbsp;He couldn’t shake the feeling that this didn’t feel right to him. \u0026nbsp;Still, Artpe had no choice, but to move forward. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMaetel reaffirmed the fact that Artpe was amazing. \u0026nbsp;She was filled with pride for him, and she followed behind him like a puppy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe party of heroes safely entered the second floor. \u0026nbsp;Then they cleared the third floor and the fourth floor. They were moving so fast through the Dungeon that they were bringing in more supply than they were using. \u0026nbsp;They were able to gather weapons and food. \u0026nbsp;The most important resource was water, but they were able to solve the problem of acquiring water in the middle of the second floor. \u0026nbsp;They had found a spring.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the Elite Zombie, no Elite monsters had appeared. \u0026nbsp;The monsters didn’t stand a chance against Artpe’s poison nails and Maetel’s sword. \u0026nbsp;The Dungeon exploration was very easy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was how the two heroes reached the 6th floor of the Dungeon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What the hell! \u0026nbsp;How long is this Dungeon!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Dungeons are really fun! \u0026nbsp;Let’s keep going forward!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hey! \u0026nbsp;There’s a trap over there! \u0026nbsp;Stop!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this point, Maetel was level 29, and Artpe had reached level 24.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-5\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-reincarnated-for-nothing/irfn-chapter-7\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-6","bookId":1506,"creation":"Sep 10, 2019 4:36:15 AM","modification":"Sep 10, 2019 4:36:15 AM"}
