{"id":76365,"no":16,"title":"Page 16","content":"\u003cp\u003e\"I\u0027m trying not to dwell on that.\"\u003c/p\u003e\n\u003cp\u003eShe shut her eyes. \"This isn\u0027t your fault. I\u0027m sorry. I don\u0027t have a box. I don\u0027t even know what things are his.\"\u003c/p\u003e\n\u003cp\u003e\"Let it wait. His things don\u0027t have to go anywhere.\"\u003c/p\u003e\n\u003cp\u003eHer expression didn\u0027t change, but a thick tear traced its way down the base of her nose.\u003c/p\u003e\n\u003cp\u003eShe tried to stand and couldn\u0027t quite make it.\u003c/p\u003e\n\u003cp\u003eShe frowned, looked into her purse, then fished out an orange prescription bottle and stared at the label accusingly.\u003c/p\u003e\n\u003cp\u003e\"How many?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"They insisted. I broke a window.\"\u003c/p\u003e\n\u003cp\u003e\"I remember.\"\u003c/p\u003e\n\u003cp\u003e\"The doctor said the sedatives—\" She stopped, still frowning. \"Two pills. I think I took two. I don\u0027t remember.\"\u003c/p\u003e\n\u003cp\u003eShe tried to put the bottle back in her purse and dropped it on the floor instead. \"I need to go.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not doing so great. Is there anyone who could—\"\u003c/p\u003e\n\u003cp\u003e\"Take me home?\" she interrupted.\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003eShe looked up at me wearily, her expression a mixture of resentment and plea.\u003c/p\u003e\n\u003cp\u003eI suddenly realized I had just made an offer.\u003c/p\u003e\n\u003cp\u003eFIFTEEN\u003c/p\u003e\n\u003cp\u003eI had to wake Ines Brandon when we pulled in front of her house on Castano. With some effort, I extracted her from the VW, got her up the five steps, navigated her around the Big Wheel and the street chalk.\u003c/p\u003e\n\u003cp\u003eBefore I could ring the bell on the front porch, a scowling woman opened the door.\u003c/p\u003e\n\u003cp\u003e\"I tell you,\" she scolded Ines.\u003c/p\u003e\n\u003cp\u003eThe woman\u0027s arms were beefy slabs. Her upper body was stuffed into the world\u0027s largest black Papal Visit souvenir T-shirt, the faded picture of John Paul II on the front unflatteringly distorted by the bulges of the woman\u0027s breasts. Her stubby legs threatened to bust out of turquoise sweatpants and her hair was pulled back in a painfully tight bun. Her feet were bare. Her face was as brutally sculpted as a Mayan pedestal — weathered and wide and flat, designed to withstand several thousand tons. She smelled pungently of cloves. She took Ines\u0027 arm and guided her into the house.\u003c/p\u003e\n\u003cp\u003e\"This is Mr. Navarre,\" Ines mumbled. \"I didn\u0027t have a box.\"\u003c/p\u003e\n\u003cp\u003eThe woman cursed at her gently in Spanish, then looked back at me and said in a stern voice: \"Stay.\"\u003c/p\u003e\n\u003cp\u003e\"Arf,\" I said.\u003c/p\u003e\n\u003cp\u003eThe woman didn\u0027t react. She and Ines disappeared down the hallway. I heard the sounds of minor protests, chastisements, orders to take off shoes. Miniblinds were snapped shut.\u003c/p\u003e\n\u003cp\u003eThere was even less to see in the living room than there had been before. Most of the boxes were now taped closed. All the framed photographs had been removed from the end table. The broken window in the dining room had been covered with a piece of cardboard.\u003c/p\u003e\n\u003cp\u003eThe Pope-shirted woman reappeared from the hallway, wiping her palms on her turquoise pants. Her squashed, disapproving eyes zeroed in on me. \"Thank you, go.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re Paloma?\"\u003c/p\u003e\n\u003cp\u003eThe woman gave me a grudging nod, then brushed past and went to the front door. She opened it, looked at me expectantly.\u003c/p\u003e\n\u003cp\u003eI pointed down the hallway where Ines had disappeared. \"You get her to sleep all right?\"\u003c/p\u003e\n\u003cp\u003e\"No Ingles,\" Paloma suddenly decided. She glared at me obstinately.\u003c/p\u003e\n\u003cp\u003e\"No problema,\" I assured her. Then, still in Spanish, \"We had to leave Mrs. Brandon\u0027s car at UTSA. The north visitors\u0027 lot. It\u0027ll be all right for this afternoon, but someone should pick it up by tomorrow morning.\"\u003c/p\u003e\n\u003cp\u003ePaloma continued glaring at me, letting me know that nothing could have insulted her sensibilities worse than a fluent gringo.\u003c/p\u003e\n\u003cp\u003e\"Thank you, go,\" she tried again, in English.\u003c/p\u003e\n\u003cp\u003e\"I bet you\u0027re great with solicitors. Those aluminum-siding guys from Sears.\"\u003c/p\u003e\n\u003cp\u003eShe shoved the door shut, irritated. \"You won\u0027t go. Why?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m curious.\"\u003c/p\u003e\n\u003cp\u003e\"La policia.\" She scowled. \"They were curious. The reporters, tambien. No more. Senora Brandon needs sleep.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been with the family long?\"\u003c/p\u003e\n\u003cp\u003e\"Five years. Since Miguel.\"\u003c/p\u003e\n\u003cp\u003e\"Since Michael was born — their son.\"\u003c/p\u003e\n\u003cp\u003e\"Si.\"\u003c/p\u003e\n\u003cp\u003e\"Is Michael here?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eAs if on cue, a whirring toy sound wailed from one of the back bedrooms, then died. It sounded like one of those sparking ray guns.\u003c/p\u003e\n\u003cp\u003ePaloma\u0027s stone face darkened.\u003c/p\u003e\n\u003cp\u003e\"Mira, Paloma,\" I told her. \"I don\u0027t mean to pry. I\u0027ve been hired to take Dr. Brandon\u0027s job. I\u0027d like to know how he got himself killed. I don\u0027t want to follow in his footsteps.\"\u003c/p\u003e\n\u003cp\u003ePaloma\u0027s eyes drifted away from me and fixed on the fireplace. She scowled at the bullet holes in the limestone, as if remembering exactly where she had scrubbed, and how hard, and what the color of the water and the soap foam had been afterward.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re leaving this place,\" she mused. \"For now, an apartment. Maybe later, out of town.\"\u003c/p\u003e\n\u003cp\u003e\"And will that return things to normal?\"\u003c/p\u003e\n\u003cp\u003ePaloma made a sound deep in her throat, like stone grinding. \"You wish to see normal?\"\u003c/p\u003e\n\u003cp\u003eShe grabbed my wrist and tugged me down the hallway, past a closed door on the right, past an open bathroom, to a door on the left that was papered with foldout animal posters from various scholastic magazines.\u003c/p\u003e\n\u003cp\u003ePaloma pushed me into the doorway and held me there, her fingers digging into my shoulders. I was expecting to see your basic boy\u0027s room, like Jem\u0027s — buckets of Tinkertoys and Legos, miniature furniture, piles of little clothes and shoes. Everything in primary colors.\u003c/p\u003e\n\u003cp\u003eWhat I saw instead were sheets. At least ten of them — white, blue, daisy-patterned, brown — draped waist-level wall-to-wall, covering everything. The cloth sagged in canyons, rose here and there to peaks that were probably chairs underneath. Square outlines hinted of tabletops, a bed. Where the sheet corners met, they were weighted down by heavy books to keep them together. In some places they were tied off or safety-pinned. There seemed to be talcum powder everywhere — sprinkled liberally over the tops of the sheets, gathered in thick drifts where the cloth sagged, hanging in the air with a cloying scent. The room looked like it had been commandeered for a Christo art event.\u003c/p\u003e\n\u003cp\u003eThree feet from the bedroom door was a small triangular opening in the sheet tent. A toy ray gun lay on the carpet next to an empty plastic Lunchables tray and a Toys \"R\" Us circular with all the coupons cut out.\u003c/p\u003e\n\u003cp\u003ePaloma pushed past me and managed to lower herself enough to scoop up the trash.\u003c/p\u003e\n\u003cp\u003e\"Miguel,\" she grunted. \"Ahi.\"\u003c/p\u003e\n\u003cp\u003eNothing moved.\u003c/p\u003e\n\u003cp\u003eOutside the bedroom windows I could see the backyard — about twenty feet of grass, a barbecue pit, swing set, pecan tree. In the corner a wooden garage was topped with a second-story apartment. The day was sunny, but it felt miles away outside the gloom and the powder and the dust.\u003c/p\u003e\n\u003cp\u003e\"Miguel!\" Paloma called again.\u003c/p\u003e\n\u003cp\u003eThis time sheets rustled in the corner. A little spherical dent appeared in them, slid toward the entrance, then emerged at the opening as the head of a five-year-old boy.\u003c/p\u003e\n\u003cp\u003eIf I had not known he was half Latino, I never would\u0027ve guessed it. His skin was paler than mine, paler than damn near anybody\u0027s. His eyes were blue like Aaron Brandon\u0027s, his hair reddish like his mother\u0027s.\u003c/p\u003e\n\u003cp\u003eHe was wearing a T-shirt and underwear and nothing else. He peered up at me with mild curiosity.\u003c/p\u003e\n\u003cp\u003e\"Miguel,\" Paloma said, \"this is Senor Navarre. Senor Navarre is a college teacher like your papa.\"\u003c/p\u003e\n\u003cp\u003eMichael seemed to be trying to reach some conclusion about my face, as if he weren\u0027t quite sure if it was real or a pretty good mask.\u003c/p\u003e\n\u003cp\u003e\"Hey, Michael,\" I said.\u003c/p\u003e\n\u003cp\u003e\"This is my cave,\" he informed me.\u003c/p\u003e\n\u003cp\u003e\"I can see that. It\u0027s a real nice cave.\"\u003c/p\u003e\n\u003cp\u003eMichael suddenly developed a keen interest in picking the skin off his knuckle.\u003c/p\u003e\n\u003cp\u003e\"He needs to clean it up,\" Paloma grumbled, but not like she expected any action.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s with the powder?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s fog,\" Michael said to his knuckle. \"Makes you invisible.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s good,\" I said. \"But just in case they get through, you zap them, right?\"\u003c/p\u003e\n\u003cp\u003eHe snatched his ray gun, gave me an upward glance.\u003c/p\u003e\n\u003cp\u003ePaloma receded in the doorway and gestured for me to follow. I told Michael I\u0027d see him around.\u003c/p\u003e\n\u003cp\u003eThe last I saw of him he was digging the muzzle of his ray gun into his bare knee.\u003c/p\u003e\n\u003cp\u003e\"This,\" Paloma said, \"is normal.\"\u003c/p\u003e\n\u003cp\u003eIt took me a few steps before I could speak. \"Since his father\u0027s death?\"\u003c/p\u003e\n\u003cp\u003e\"Before. Since the fights. Now will you go?\"\u003c/p\u003e\n\u003cp\u003eWe stopped in the living room, Paloma once again holding the front door open for me. Her face seemed even more compressed, her eyes almost slits, her mouth flattened into a hard amber line. The irreverently stretched Holy Father smiled up at me from Paloma\u0027s shirt, one papal eye bigger than the other.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go,\" I promised. \"But the apartment in back, above the garage — is that yours?\"\u003c/p\u003e\n\u003cp\u003eShe stiffened.\u003c/p\u003e\n\u003cp\u003e\"You were the witness — the one who ID\u0027ed Zeta Sanchez for the police.\"\u003c/p\u003e\n\u003cp\u003e\"Madre de Dios, if you don\u0027t leave now—\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t make her finish the threat. I said good-bye and went out to my car. When I looked back, Paloma stood motionless in the doorway — her eyes dark, her face hard and impassive, as if she\u0027d turned back into red Texas granite. I couldn\u0027t blame her for that. Anything as soft as human flesh could never have supported the weight of the Brandon household.\u003c/p\u003e\n\u003cp\u003eSIXTEEN\u003c/p\u003e\n\u003cp\u003eSometimes necessity is the mother of invention. Sometimes necessity is just a mother.\u003c/p\u003e\n\u003cp\u003eAll the way back to the University, I brainstormed ideas for the graduate seminar, knowing I would have just enough time to stumble into the classroom with none of Brandon\u0027s backlogged papers graded and no prepared lecture notes. I kept trying to come up with some brilliant game plan to make a good first impression. At ten past one, sitting on a table in front of eight graduate students in HSS 2.0.22, I was still without that plan.\u003c/p\u003e\n\u003cp\u003e\"So.\" I tried to sound enthusiastic. \"I thought we\u0027d start by going around — tell me your names, a little about yourselves. Ask whatever you want about me.\u003c/p\u003e\n\u003cp\u003eWho wants to start?\"\u003c/p\u003e\n\u003cp\u003eNo hands shot into the air.\u003c/p\u003e\n\u003cp\u003eI waved encouragingly toward a couple of mid-fiftyish women by the door. They were crocheting from a shared bag of pink yarn.\u003c/p\u003e\n\u003cp\u003e\"You ladies?\"\u003c/p\u003e\n\u003cp\u003eThey introduced themselves as Edie and Marfa, escaped housewives. Marfa told me she wanted to read some medieval romances. Edie smiled and gave me the eye.\u003c/p\u003e\n\u003cp\u003e\"Ah-ha,\" I said. \"And you, sir?\"\u003c/p\u003e\n\u003cp\u003eThe elderly man cleared his throat. He wore a mechanic\u0027s jumpsuit and a buzz cut. \"Sergeant Irwin, USAF, retired. I\u0027m still in this class because the military is paying every penny, and so far I\u0027m damn glad of it.\"\u003c/p\u003e\n\u003cp\u003eI thanked him for sharing, then waved toward the next man — a young Anglo in a Men\u0027s Wearhouse Italian suit.\u003c/p\u003e\n\u003cp\u003eHe looked up from his organizer long enough to say, \"Brian. I run a small carpeting business and I\u0027m probably going to drop the class. Don\u0027t mind me.\"\u003c/p\u003e\n\u003cp\u003eBehind Brian was Gregory, the giant radish mail boy who delivered pipe bombs.\u003c/p\u003e\n\u003cp\u003e\"Always nice to see a familiar face,\" I told him.\u003c/p\u003e\n\u003cp\u003eGregory mumbled something. He didn\u0027t meet my eyes.\u003c/p\u003e\n\u003cp\u003eNext to him sat two guys in Nirvana T-shirts and jeans and plentiful chains clipped to their belt loops. Simon and Blake. They asked me how it was hanging. I asked them how they\u0027d come to choose a medieval literature class and they shrugged and grinned like Class? We\u0027re in class? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-king-of-texas-tres-navarre-3/page-16.html","bookId":2418,"creation":"Oct 5, 2019 10:38:40 AM","modification":"Oct 5, 2019 10:38:40 AM"}
