{"id":76367,"no":18,"title":"Page 18","content":"\u003cp\u003e\"That Ana DeLeon\u0027s just your type. And knowing that should be enough to warn you off.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re so far off base—\"\u003c/p\u003e\n\u003cp\u003e\"\u0027S\u0027okay, man.\" George flipped his aluminum foil ball. \"You like the fortress women, the unapproachable ones. You like the challenge. Try to settle for somebody who can\u0027t out-think you and beat you at arm-wrestling — you\u0027re disappointed, can\u0027t stick with it. Annie, Carolaiyn, how many others didn\u0027t make the cut since Maia Lee, man? I\u0027ve lost count.\"\u003c/p\u003e\n\u003cp\u003eThere was no bitterness in his voice, no criticism. His smile was even a little wistful.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t dignify that with a response,\" I told him.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t need to.\"\u003c/p\u003e\n\u003cp\u003eHe turned the aluminum ball in his fingers. His smile disintegrated.\u003c/p\u003e\n\u003cp\u003e\"What?\" I asked.\u003c/p\u003e\n\u003cp\u003eGeorge shook his head. \"Old Jeremiah Brandon. It\u0027s just that the more I hear about him, the stories, the way Sanchez brought him down—\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003eGeorge shook his head. \"I don\u0027t think you do, ese. What Brandon could do to the people who worked for him, the young women especially, the things he got away with — it hits me in a place I don\u0027t want to be hit. I start feeling glad somebody shot the old man, start wishing I\u0027d even been there to see it. I begin thinking of Zeta Sanchez as a hero. That scares me, ese. It scares me a lot.\" We sat listening to the water sluice into the fountain, the pigeons pecking at a potato chip under a nearby table.\u003c/p\u003e\n\u003cp\u003eI looked over at Jem, who was circling the rim of the water fountain, his arms out like an airplane, his Captain Chaos clenched in one fist.\u003c/p\u003e\n\u003cp\u003eThe sight of Jem made me smile, as it always did. Thank God for that kid. I looked over at George. He was apparently thinking the same thing.\u003c/p\u003e\n\u003cp\u003eI said, \"You bought Jem that damn figurine, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eGeorge put his fingers on his chest. \"And break Erainya\u0027s no-toy rule?\"\u003c/p\u003e\n\u003cp\u003e\"Affection-buying bastard. What can I do while you\u0027re out chasing leads?\"\u003c/p\u003e\n\u003cp\u003eGeorge smiled, a little sadness still in his eyes.\u003c/p\u003e\n\u003cp\u003e\"You can teach your classes, Professor. What else?\"\u003c/p\u003e\n\u003cp\u003eEIGHTEEN\u003c/p\u003e\n\u003cp\u003e\"Full name,\" Detective Kelsey demanded.\u003c/p\u003e\n\u003cp\u003e\"A guy hits you in the stomach,\" I said, \"and you don\u0027t remember his name?\"\u003c/p\u003e\n\u003cp\u003eThe detective pushed back from his desk. His big Irish nose turned brake-light red. \"Did I ask you here, asshole?\"\u003c/p\u003e\n\u003cp\u003e\"Jackson Navarre. You want me to spell it?\"\u003c/p\u003e\n\u003cp\u003e\"Give me your license.\"\u003c/p\u003e\n\u003cp\u003eHe propped it on his keyboard and began clacking the information into the computer, using index fingers only.\u003c/p\u003e\n\u003cp\u003eI scanned the corkboard on his cubicle wall. There were pictures of Kelsey in camouflage next to a dead ten-point buck; Kelsey in bowling clothes; Kelsey in a TCU football uniform; Kelsey in SWAT black with an H\u0026amp;K 94 carbine. Lots of pictures of Kelsey. Lots of sports equipment and guns and deceased animals.\u003c/p\u003e\n\u003cp\u003eZero other human beings.\u003c/p\u003e\n\u003cp\u003eDown the central walkway of the SAPD homicide office, foot traffic was light. It was Wednesday evening but could just as easily have been three A.M. Monday or one P.M. Friday. No windows gave away the time, no change of lighting, no clocks. To the left and right, gray walls and gray carpet and gray five-foot-high dividing walls stretched out, the colorlessness punctuated here and there by a troll doll goggling over someone\u0027s cubicle, a sad ivy plant, a buzz-cut head asking something of the buzz-cut head next door. The space was devoid of noise and smell and temperature, designed like an emotional sponge to suck all the passion out of the events the investigators handled every day.\u003c/p\u003e\n\u003cp\u003eKelsey\u0027s cubicle was not in a position of privilege. He was next to the case files closet, close to the interrogation rooms, within ear-pulling distance of Lieutenant Hernandez\u0027s office.\u003c/p\u003e\n\u003cp\u003eKelsey stopped typing. He put his index finger on my license, looked back and forth between it and the screen to make sure he got everything right. His finger hesitated over my middle name. \"Tray?\"\u003c/p\u003e\n\u003cp\u003e\"Trace. You know — Spanish. Numero tres.\"\u003c/p\u003e\n\u003cp\u003eKelsey grunted, hit RETURN. \"Statement.\"\u003c/p\u003e\n\u003cp\u003eI went through what I\u0027d seen yesterday during the apprehension of Zeta Sanchez at Hector Mara\u0027s farm. I didn\u0027t mention Kelsey\u0027s hesitation responding to Ana DeLeon\u0027s call for help. Kelsey did not type in how I had punched him in the gut. We were fast friends that way.\u003c/p\u003e\n\u003cp\u003eWhile Kelsey finished composing, I looked through the big glass window of the commander\u0027s office. Lieutenant Hernandez was having a deadly serious conversation with a well-dressed Anglo who had the reddest hair and the whitest skin I\u0027d ever seen.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s the leprechaun?\" I asked.\u003c/p\u003e\n\u003cp\u003eKelsey followed my gaze. He thought for a second, probably debating whether or not he had anything to lose by answering. \"Canright. ADA on rotation to homicide this week. Lucky us.\"\u003c/p\u003e\n\u003cp\u003eI looked again through the window. Canright was holding up gold-ringed hands and shaking them, like he was showing the size of an imaginary fish. Hernandez leaned on the edge of his desk, his hands pinched tightly under his armpits. The lieutenant\u0027s face had its usual metallic hardness.\u003c/p\u003e\n\u003cp\u003e\"So what\u0027s the argument?\" I asked.\u003c/p\u003e\n\u003cp\u003eKelsey pointed behind me with his chin. Down the side corridor, I could just see the doorway of the first interrogation room. An armed, uniformed deputy stood outside. The face of Ana DeLeon passed briefly behind the tiny one-foot-square window — mid-pace,\u0026nbsp; mid-conversation.\u003c/p\u003e\n\u003cp\u003e\"Celebrity guest,\" Kelsey said. \"Zeta Sanchez stonewalled the ATF for twelve hours yesterday. Now DeLeon\u0027s giving it a try. Guess Canright was expecting we\u0027d have a confession by now. We\u0027re holding up his political career.\"\u003c/p\u003e\n\u003cp\u003eAt that moment, the commander\u0027s door flew open. Canright stormed out, Hernandez right behind him. Their argument re-formed around the doorway, five feet away from us.\u003c/p\u003e\n\u003cp\u003eDown the other way, the interrogation room door opened too. Ana DeLeon led Zeta Sanchez out by the upper arm. The surprised guard lurched into formation behind them.\u003c/p\u003e\n\u003cp\u003eDeLeon wore a khaki Lands\u0027 End trench coat over the red dress she\u0027d had on the night before. From her eyes and makeup and hair it was clear she\u0027d never gone to bed.\u003c/p\u003e\n\u003cp\u003eSanchez was dressed in orange prison scrubs and plastic sandals. His wrists were clamped together in plastic cuffs, the kind they reserve for the most violent offenders. The side of his face was swollen from DeLeon\u0027s pistol-whipping yesterday, and he sported an even newer injury — a busted lower lip that was stitched up and oozing on the left side like a bisected caterpillar. The mustache and beard made a cursive W around his lower face, a shape mirrored by his high hairline. His eyes were calm, sleepy. The undamaged side of his mouth crept up in a little smile that made my stomach go cold.\u003c/p\u003e\n\u003cp\u003eDeLeon walked him in our direction until Hernandez and District Attorney Canright intercepted her, right in front of Kelsey\u0027s desk. Kelsey and I stood up, making the walkway mighty cozy.\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\" Canright demanded.\u003c/p\u003e\n\u003cp\u003eDeLeon raised her eyebrows. \"The bathroom.\"\u003c/p\u003e\n\u003cp\u003e\"The what?\"\u003c/p\u003e\n\u003cp\u003e\"He needs to pee, sir. You know — the little boys\u0027 room?\"\u003c/p\u003e\n\u003cp\u003eCanright\u0027s face erupted in strawberry spots. He looked at Hernandez, whose expression stayed neutral. Zeta Sanchez, for his part, had his eyes on DeLeon. He kept pushing the tip of his tongue suggestively against the busted side of his lip.\u003c/p\u003e\n\u003cp\u003e\"Detective—\" Canright started.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re crossing our legs here, sir.\" DeLeon looked at Hernandez for a green light. \"My interview, my suspect, and he really needs to pee. Okay, Lieutenant?\"\u003c/p\u003e\n\u003cp\u003eAfter a moment of silent deliberation, Lieutenant Hernandez gestured toward the exit.\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" DeLeon looked at me for the first time, dispassionately, like I was an overdue stenographer. \"Walk with us.\"\u003c/p\u003e\n\u003cp\u003eADA Canright\u0027s face turned even redder. \"Wait just a goddamn—\"\u003c/p\u003e\n\u003cp\u003eDeLeon was already pushing past.\u003c/p\u003e\n\u003cp\u003eI was almost too surprised to move but fell in line behind DeLeon and Sanchez and the deputy guard. The four of us went out the reception area of homicide, past two secretaries and a group of crying women, into the hallway. The outer corridors of the department were tiled in green, fluorescent lit, with metal rolling equipment carts abandoned here and there and windows looking into dark rooms. It reminded me of a hospital delivery ward. We walked to the end of the hall where the vending machines and rest-rooms were, our heels clacking against the tiles.\u003c/p\u003e\n\u003cp\u003eWhen we got to the men\u0027s room door, DeLeon let loose of Sanchez\u0027s arm. \"Go ahead.\"\u003c/p\u003e\n\u003cp\u003eSanchez looked from her to the door, calculating.\u003c/p\u003e\n\u003cp\u003eDeLeon asked, \"You need one of the guys to help you find it?\"\u003c/p\u003e\n\u003cp\u003eSanchez gave her a mildly surprised smile, as if the insult pleased him. He went inside.\u003c/p\u003e\n\u003cp\u003eThe deputy started to follow but DeLeon stopped him. \"That\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003eThe restroom door closed.\u003c/p\u003e\n\u003cp\u003eDeLeon leaned against the vending machine and let her posture deteriorate, her weariness have its way. She rubbed her eyes, then the back of her neck. Finally she focused her bloodshot eyes on me. \"Your job is to be silent.\"\u003c/p\u003e\n\u003cp\u003e\"Not my best role.\"\u003c/p\u003e\n\u003cp\u003e\"You visited the Brandons, didn\u0027t you? Saw that little kid and his mom?\"\u003c/p\u003e\n\u003cp\u003e\"I did.\"\u003c/p\u003e\n\u003cp\u003e\"It shows in your eyes when you look at him. The anger. Tone it down.\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t even realized it until she said it, but she was right. Two minutes in Zeta Sanchez\u0027s company had eroded any doubt that the man was a murderer, that he could have walked with smugness bordering on stupidity into Aaron Brandon\u0027s home in Alamo Heights, plugged him twice with a .45, and walked out, expecting complete impunity. Looking into Sanchez\u0027s face, I stopped wondering about motive and connections and possible frame-ups. The man was loosely packaged, industrial-grade violence.\u003c/p\u003e\n\u003cp\u003eWhen I thought about the sheet cave in Michael Brandon\u0027s room, about Ines Brandon\u0027s tears, I wanted to wipe that little smile off what was left of Sanchez\u0027s face.\u003c/p\u003e\n\u003cp\u003eThe door of the restroom opened. Sanchez came out. He looked around uncertainly, like he himself couldn\u0027t believe he hadn\u0027t tried to make a break for it. DeLeon clucked her tongue disapprovingly. \"I didn\u0027t hear water running.\"\u003c/p\u003e\n\u003cp\u003eSanchez took a moment to focus on her and register the comment. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t wash your hands.\"\u003c/p\u003e\n\u003cp\u003eThe hardness in his eyes diluted with confusion. \"What?\"\u003c/p\u003e\n\u003cp\u003eDeLeon sighed, looked at me, then back at Sanchez like a mother with strained patience. \"I might have to shake your hand later, Anthony, and I know where it\u0027s been. Go back and wash your hands.\"\u003c/p\u003e\n\u003cp\u003eHe stared at DeLeon, then at the bathroom door. Then he went back in. This time we heard water running. The shudder of pipes as the faucet shut off. The printing-press sound of the towel roll dispenser being pulled down to fresh cloth. Our deputy guard looked at the floor, shook his head, muttered something about a waste of time.\u003c/p\u003e\n\u003cp\u003eSanchez came back out. He showed DeLeon his clean hands, the webbing between his fingers still glistening with water and soap foam. He looked at DeLeon with intense curiosity, as if he was really interested in what she\u0027d say. \"Okay.\" She started to lead us back down the hall, then stopped abruptly, turned back, and almost ran into Sanchez. \"You want a Snickers?\"\u003c/p\u003e\n\u003cp\u003eSanchez hesitated, shook his head cautiously.\u003c/p\u003e\n\u003cp\u003e\"No?\" DeLeon looked at me with the same question, but her eyes were giving me a dead courtesy, an act. I shook my head.\u003c/p\u003e\n\u003cp\u003eShe tried again with Sanchez. \"Peanuts? M\u0026amp;M\u0027s? You got to be hungry.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-king-of-texas-tres-navarre-3/page-18.html","bookId":2418,"creation":"Oct 5, 2019 10:38:40 AM","modification":"Oct 5, 2019 10:38:40 AM"}
