{"id":76369,"no":20,"title":"Page 20","content":"\u003cp\u003eDeLeon said, \"I want to follow up.\"\u003c/p\u003e\n\u003cp\u003eCanright ran skinny white fingers through his red hair, shot a look at Hernandez. \"Am I not being clear? Ana, honey, am I not being clear?\"\u003c/p\u003e\n\u003cp\u003e\"My last name is DeLeon.\"\u003c/p\u003e\n\u003cp\u003eCanright made a cup with his hands. \"This guy shot an innocent man in his home, Ana. A college professor, husband, father. Then he shot a cop. I don\u0027t need a \u0027why\u0027 to nail his ass in court. You took him down. Your first homicide case — you did great. Now it\u0027s mine.\"\u003c/p\u003e\n\u003cp\u003e\"Let me explain it another way, sir.\" DeLeon took her notepad and pen from her overcoat. She wrote as she said, \"I\u0027m. Not. Done. Honey.\"\u003c/p\u003e\n\u003cp\u003eShe underlined the words, tore off the sheet, and tried to tuck it into Canright\u0027s coat.\u003c/p\u003e\n\u003cp\u003eThe ADA stepped back, brushing her hand away. \"All right, Ana. That\u0027s it. That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003e\"Mr. Canright—\"\u003c/p\u003e\n\u003cp\u003e\"Detective,\" Hernandez intervened. \"You\u0027re up for cold-case duty. Starting Monday we rotate you in for three months. Between now and then you should get some rest.\"\u003c/p\u003e\n\u003cp\u003e\"Lieutenant—\"\u003c/p\u003e\n\u003cp\u003eHernandez turned toward Kelsey, who was leaning against a nearby partition. \"Take care of what Mr. Canright needs for court. Follow up.\"\u003c/p\u003e\n\u003cp\u003eKelsey smiled. \"My pleasure.\" He drifted back toward his cubicle. Canright nodded with dry approval. He turned to say something else to DeLeon, probably something appeasing.\u003c/p\u003e\n\u003cp\u003eLieutenant Hernandez said, \"Good-bye, Mr. Canright. We\u0027ll keep you apprised.\"\u003c/p\u003e\n\u003cp\u003eCanright closed his mouth, nodded. When he got to the doorway he couldn\u0027t stand it. He turned and called, \"You did an excellent job, Ana, honey. I mean that.\"\u003c/p\u003e\n\u003cp\u003eThe homicide office sucked up the sound of his voice. Everything returned to quiet neutral gray as soon as the door swung closed.\u003c/p\u003e\n\u003cp\u003eDeLeon crumpled her note and dropped it at Hernandez\u0027s feet.\u003c/p\u003e\n\u003cp\u003e\"Ana,\" Hernandez said, \"they want a quick resolution. They smell blood. You\u0027re a district attorney, you don\u0027t see a two-plus-two case like this and beat your head against a wall trying to figure out how you can make it come up five.\"\u003c/p\u003e\n\u003cp\u003e\"God damn it, Lieutenant—\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t wait for the media to tear you apart for inaction. You prosecute.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s incomplete. Canright knows it. You know it.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s open-and-shut. Even if it wasn\u0027t — you really want to fight for a douche bag like Sanchez?\"\u003c/p\u003e\n\u003cp\u003eShe turned to go.\u003c/p\u003e\n\u003cp\u003eHernandez said, \"Wait.\"\u003c/p\u003e\n\u003cp\u003eDeLeon looked back at him icily.\u003c/p\u003e\n\u003cp\u003e\"Between now and Monday, you get no new cases. I stand by what I said — Monday it\u0027s the cold squad, before then it\u0027s some rest. That doesn\u0027t preclude wrapping up your present caseload. As long as it\u0027s low-key and quick. Not too taxing on you. I want you fresh for Monday. You understand me?\"\u003c/p\u003e\n\u003cp\u003eThe intensity in DeLeon\u0027s eyes eased up a bit. \"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Discreet. Low-key. Nothing that might give Mr. Canright apoplexy.\"\u003c/p\u003e\n\u003cp\u003eDeLeon allowed herself a tired smile. \"I understand, Lieutenant.\"\u003c/p\u003e\n\u003cp\u003eAs DeLeon walked away, Hernandez looked around to see who was watching. He met my eyes again, pretended he hadn\u0027t, then returned to his office.\u003c/p\u003e\n\u003cp\u003eI found DeLeon\u0027s cubicle at the end of the room, next to one of the sergeants\u0027 offices. The sergeant was apparently on vacation. His glass door was closed, the lights off, a woodcut GONE FISHIN\u0027 sign hung over the shade.\u003c/p\u003e\n\u003cp\u003eDeLeon was sitting in her task chair, the Lands\u0027 End trench coat shed over it like melted Swiss, her pumps kicked onto the carpet. She stared momentarily at something taped to her computer screen, then bent forward and buried her face in her forearms.\u003c/p\u003e\n\u003cp\u003eI leaned against the side of her cubicle.\u003c/p\u003e\n\u003cp\u003eThe back of DeLeon\u0027s red dress had unzipped itself about an inch at the collar. Three tiny lines of soft hair ran down her neck from the sharp wedge-cut, like jet trails.\u003c/p\u003e\n\u003cp\u003e\"Buy you some dinner?\" I asked.\u003c/p\u003e\n\u003cp\u003eShe opened the top eye and peered at me wearily. \"Don\u0027t you ever go away?\"\u003c/p\u003e\n\u003cp\u003eShe sat up, rubbed her eyes, then refocused on the thing taped to her monitor. It was a Polaroid of a stuffed longhorn doll — Bevo, the UT mascot. An anonymous white male hand was holding the muzzle of a .38 against its head. A little handwritten sign under the longhorn\u0027s chin said please MOMMY BRING THEM DOUGHNUTS OR THEY\u0027LL VENTILATE ME!! The writing was intentionally childlike and the bull\u0027s goofy cartoon grin didn\u0027t fit his predicament. On top of DeLeon\u0027s monitor, a circle of dust-free space marked the spot where the longhorn had probably sat.\u003c/p\u003e\n\u003cp\u003eDeLeon yanked the Polaroid off the computer screen. \"Bastards.\"\u003c/p\u003e\n\u003cp\u003e\"Locker-room humor.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah. Me and the boys — we\u0027re tight. We snap each other\u0027s butts with towels all the time.\"\u003c/p\u003e\n\u003cp\u003eI tried not to picture that. \"Be a lot worse if they just ignored you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re just the expert on everything, aren\u0027t you, Navarre? You and your friend Mr. Air-Force-Special-Police.\"\u003c/p\u003e\n\u003cp\u003e\"About last night—\"\u003c/p\u003e\n\u003cp\u003e\"Save it.\"\u003c/p\u003e\n\u003cp\u003eShe began shuffling papers with a vengeance, clearing her in box, taking down little stickie notes and division memos that adorned the fabric walls. As the first layer of paper came down, personal stuff was unearthed — a photo of DeLeon getting awarded her detective\u0027s shield, a framed B.S. in criminal justice from UT, a picture of her as an air force cadet.\u003c/p\u003e\n\u003cp\u003eTwo things surprised me. One was a photocopy of a Pablo Neruda love poem, \"Te Recuerdo Como Eras.\" The other was a tiny framed picture of a female police officer who looked like a heavier, lighter-skinned version of Ana DeLeon. By the color of the photo and the style of the woman\u0027s hair and uniform, I placed the photo circa 1975.\u003c/p\u003e\n\u003cp\u003e\"Your mom?\"\u003c/p\u003e\n\u003cp\u003eDeLeon glanced at it, then shoved another folder across her desk. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eShe kept sorting papers, her eyes glassy.\u003c/p\u003e\n\u003cp\u003e\"You okay?\"\u003c/p\u003e\n\u003cp\u003eShe glared at me, then pulled a color photo out of a case file and flicked it up at me with two fingers. \"This is how okay I am.\"\u003c/p\u003e\n\u003cp\u003eAll I saw in the photograph at first were glaring browns and reds. Then my mind made sense of the shapes and I pulled back, repulsed. It was a young child, African American, murdered and displayed in a way my mind comprehended but refused to process into complete thoughts.\u003c/p\u003e\n\u003cp\u003e\"Jesus.\"\u003c/p\u003e\n\u003cp\u003eShe slid the picture back into the file. \"Good thing I was called away from our wonderful evening. Between the Brandon case and a couple of other things the Night CID couldn\u0027t handle I got that lovely call. Girl was three.\"\u003c/p\u003e\n\u003cp\u003eI swallowed, closed my eyes. The image wouldn\u0027t go away.\u003c/p\u003e\n\u003cp\u003e\"No mystery,\" DeLeon said. \"What was it the lieutenant said, a two plus two? Stepdad was a crack addict. Started yelling at the mom because she was stealing his money. It went downhill from there. Young victims. That\u0027s why I got out of sex crimes. Now here I am again — otra vez.\"\u003c/p\u003e\n\u003cp\u003eDeLeon focused on her blank computer screen. \"So what am I supposed to do? I\u0027m supposed to get things in order and take a couple of days off. Simple.\"\u003c/p\u003e\n\u003cp\u003e\"Hernandez is in a tough spot. Sure you don\u0027t want to catch some dinner?\"\u003c/p\u003e\n\u003cp\u003e\"Hernandez does what he can. And yes, I\u0027m sure.\"\u003c/p\u003e\n\u003cp\u003e\"If you needed a little help on the Sanchez follow-up—\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d what? Share information with you? And every damn private investigator in town would be knocking on my door anytime he needed help. The newspapers would be screaming about how we couldn\u0027t handle our own cases. No thanks.\"\u003c/p\u003e\n\u003cp\u003e\"We want the same answers.\"\u003c/p\u003e\n\u003cp\u003e\"Great. You find out something on your own, come in and make another statement. That\u0027s all you are, Navarre: another witness with a statement.\"\u003c/p\u003e\n\u003cp\u003e\"That why you brought me into the interrogation room?\"\u003c/p\u003e\n\u003cp\u003eShe paused. \"It was a gamble.\"\u003c/p\u003e\n\u003cp\u003e\"Gamble again. I have a friend who might help. People don\u0027t like talking to cops, they might talk to my friend.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like your friend.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mean George Berton.\"\u003c/p\u003e\n\u003cp\u003e\"Neither do I. I know about Ralph Arguello.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d heard police officers speak Ralph\u0027s name many times, never lovingly, but DeLeon\u0027s tone held a lot more poison than I would\u0027ve expected.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve had the pleasure of Ralph\u0027s acquaintance?\"\u003c/p\u003e\n\u003cp\u003eShe shot me another cold look, but underneath something was crumbling, eroding. \"Will you get out of here, please?\"\u003c/p\u003e\n\u003cp\u003e\"Here\u0027s an idea. I\u0027ll ask if you\u0027re giving me a firm \u0027no\u0027 on poking around about the Brandon murder. You don\u0027t respond. I\u0027ll take that as a silent, completely off-the-record consent and we\u0027ll go from there. I\u0027ll keep you posted. So how about it — can I look around on the Brandon murder?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not getting the subtle innuendo routine, here.\"\u003c/p\u003e\n\u003cp\u003eShe raised her voice a half octave. \"Just go.\"\u003c/p\u003e\n\u003cp\u003e\"Get some sleep one of these days, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Leave.\"\u003c/p\u003e\n\u003cp\u003eI left her at her desk, shuffling through files and photos with what looked like aimlessness. A shudder went through my nervous system, the aftershock from the photo of the murdered child. I found myself reviewing lines from the Neruda love poem on DeLeon\u0027s cubicle wall, wondering how it had made its way there amid the paperwork of violence — \"I Remember You As You Were.\"\u003c/p\u003e\n\u003cp\u003eI made a beeline out of the neutral gray and the fluorescents of SAPD homicide, heading toward the outside — toward smells and color and moving time. I wanted to see if it was nighttime yet. I had a feeling it might be.\u003c/p\u003e\n\u003cp\u003eTWENTY\u003c/p\u003e\n\u003cp\u003eDrifting along the sidewalk in front of police headquarters was the usual parade of undesirables — cons, thugs, derelicts, undercovers pretending to be derelicts, derelicts pretending to be undercovers pretending to be derelicts.\u003c/p\u003e\n\u003cp\u003eThey collected here each evening for many reasons but hung around for only one. They knew as surely as those little white birds hopping around on the crocodile\u0027s back that their very proximity to the mouth of the beast made them safe.\u003c/p\u003e\n\u003cp\u003ePatrol cars were parked along West Nueva. Inside the barbed wire of the parking lot, in a circle of floodlight, five detectives in crisp white shirts and ties and side arms were having a smoke. Outside the fence a couple of cut-loose dealers were trading plea-bargain stories.\u003c/p\u003e\n\u003cp\u003eI walked across Nueva to the Dolorosa parking lot, got in the VW, and pulled onto Santa Rosa, heading north. I made the turn onto Commerce by El Mercado, then passed underneath I-10 — over the Commerce Street Bridge, into the gloomy asphalt and stucco and railroad track wasteland of the West Side. Ahead of me, the sunset faded to an afterglow behind palm trees and Spanish billboards. Turquoise and pink walls of icehouses and bail bond offices lost their color. On the broken sidewalks, men in tattered jeans and checkered shirts milled around, their faces drawn from an unsuccessful day of waiting, their eyes examining each car in the fading hope that someone might slow down and offer them work.\u003c/p\u003e\n\u003cp\u003eI turned north on Zarzamora and found the place where Jeremiah Brandon had died a mile and a half up, squatting between two muddy vacant lots just past Waverly. Patches of blue stucco had flaked off its walls, but the name was still visible in a single red floodlight — POCO MAS — stenciled between two air-conditioner units that hung precariously from the front windows.\u003c/p\u003e\n\u003cp\u003eThe building was tall in front, short in back, with side walls that dropped in sections like a ziggurat. Tejano music seeped through the hammered tin doorway.\u003c/p\u003e\n\u003cp\u003eTwo pickup trucks, a white Chevy van, and an old Ford Galaxie were parked in the gravel front lot. I pulled the VW around the side, into the mud between a Camry with flat tires and a LeBaron with a busted windshield, and hoped I hadn\u0027t just discovered the La Brea tar pit of automobiles. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-king-of-texas-tres-navarre-3/page-20.html","bookId":2418,"creation":"Oct 5, 2019 10:38:40 AM","modification":"Oct 5, 2019 10:38:40 AM"}
