{"id":76163,"no":29,"title":"Page 29","content":"\u003cp\u003e“Nothing’s wrong,” she finally managed to say in a faltering voice. “Everything is right.”\u003c/p\u003e\n\u003cp\u003eHe heaved a visible sigh of relief and touched his forehead to hers. “You nearly gave me a heart attack, baby. I thought I’d done something wrong. Or hurt you.”\u003c/p\u003e\n\u003cp\u003eShe shook her head as he wiped another trail of tears from her cheek. “I love you so much, Tate. I’ve waited so long for this. It seems like I waited for an eternity. And now we’re back. I’ve missed you—this—so much.”\u003c/p\u003e\n\u003cp\u003eHe gathered her more closely in his arms and kissed her tenderly. “You’ve always had me, Chess. I know it doesn’t seem like it. I haven’t acted like it. I haven’t given you what you need—what you deserve. But I swear all of that is going to change starting now. I don’t want to lose you. I can’t envision a future without you.”\u003c/p\u003e\n\u003cp\u003eShe snuggled into his arms, tucking her head underneath his chin. “You’ll never lose me, Tate. I don’t want to be without you either. I’m afraid you’re stuck with me.”\u003c/p\u003e\n\u003cp\u003eHe chuckled, the sound rumbling from his chest and vibrating her cheek. “I’ll suffer the inconvenience of me being stuck with you.”\u003c/p\u003e\n\u003cp\u003eTWELVE\u003c/p\u003e\n\u003cp\u003eCHESSY entered the Lux Café wearing a broad smile and with a skip in her step. Kylie was there, and as usual, excluding the last time they’d met for lunch, Joss was running late. Kylie lifted one eyebrow when Chessy all but danced up to their booth. But there was relief in her eyes when she stood to hug Chessy.\u003c/p\u003e\n\u003cp\u003e“Thank God,” Kylie said fervently. “Joss and I have been so worried, Chessy. We didn’t hear from you all weekend! Jensen swore that was a good thing but I wasn’t so sure until now. You’re positively glowing!”\u003c/p\u003e\n\u003cp\u003eThey were interrupted as Joss hurried up to the table. Like Kylie, there was concern in Joss’s eyes but as she studied a beaming Chessy, her eyes brightened and a smile lit up her face.\u003c/p\u003e\n\u003cp\u003e“You look so happy, Chessy!” Joss said in a hushed whisper.\u003c/p\u003e\n\u003cp\u003e“Let’s sit,” Chessy urged. “I don’t want the entire restaurant to hear the sordid details of my anniversary weekend!”\u003c/p\u003e\n\u003cp\u003e“Ooohh, sordid!” Kylie crowed as she pushed into the booth and then motioned for Chessy to slide into the middle from the other side so she’d be flanked by Joss and Kylie.\u003c/p\u003e\n\u003cp\u003eChessy complied and then Joss scooted in next to her.\u003c/p\u003e\n\u003cp\u003e“We’re dying to hear the down and dirty,” Joss said. “When we didn’t hear from you I knew it had to be a good sign because if things went badly you would have called us.”\u003c/p\u003e\n\u003cp\u003eChessy smiled and nodded. Then she let out a wistful sigh. “Oh you guys, it was wonderful. Just like old times. I had my Tate back.”\u003c/p\u003e\n\u003cp\u003e“So did you spill your heart?” Kylie asked. “Tell me you didn’t back down and not bring up your issues.”\u003c/p\u003e\n\u003cp\u003eChessy shook her head. “No, I didn’t back down,” she said softly. “It actually began a total disaster.”\u003c/p\u003e\n\u003cp\u003eJoss’s mouth dropped open and Kylie’s eyes narrowed.\u003c/p\u003e\n\u003cp\u003e“How was it a disaster?” Joss exclaimed.\u003c/p\u003e\n\u003cp\u003eChessy winced. “He didn’t show for our dinner. I was on my way out and I saw him in the bar with another woman.”\u003c/p\u003e\n\u003cp\u003e“Oh. My. God,” Kylie said, fury evident in her voice. “What the hell? On your anniversary?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t pretty,” Chessy admitted. “I jumped to some major conclusions and walked out. He came after me and we had it out.”\u003c/p\u003e\n\u003cp\u003e“I bet,” Joss murmured.\u003c/p\u003e\n\u003cp\u003e“But it’s okay now,” Chessy said. “I know I gave y’all an abbreviated version but I’d rather not rehash it. The woman was a potential client. He met her in the bar so he could come straight to dinner and time got away from him. When I confronted him with how unhappy I am, he was horrified. He’s apologized a million times. And he promised to put me front and center from now on.”\u003c/p\u003e\n\u003cp\u003e“Do you believe him?” Kylie asked softly.\u003c/p\u003e\n\u003cp\u003eChessy nodded. “He was so sincere. And so upset and afraid. Afraid I was going to leave him. Honestly, guys, it scared him to death. That more than anything told me that he still loves me and wants me. And well, he spent the rest of the weekend proving just that.”\u003c/p\u003e\n\u003cp\u003eColor rose in her cheeks, her skin flushed and warm.\u003c/p\u003e\n\u003cp\u003eJoss and Kylie exchanged knowing smirks.\u003c/p\u003e\n\u003cp\u003e“Did he break out the flogger?” Joss teased.\u003c/p\u003e\n\u003cp\u003eKylie looked appalled, which made Chessy laugh. Kylie couldn’t comprehend the lifestyle that both Chessy and Joss lived, but she accepted it with good nature, even if she couldn’t envision herself in such a relationship. She shook her head and shot an accusing look in Joss’s direction.\u003c/p\u003e\n\u003cp\u003e“You did that on purpose to get a reaction out of me,” Kylie said in a sour voice.\u003c/p\u003e\n\u003cp\u003eChessy laughed and Joss looked delighted.\u003c/p\u003e\n\u003cp\u003e“You’re shining today,” Joss commented. “It’s like looking at the old Chessy. I’m so glad to have you back, hon. I’ve hated seeing you so unhappy. I’m so glad you and Tate have made amends, or rather he’s making amends. Good for you for confronting him and laying it out to him. I’m not sure I’d have the courage to do something like that.”\u003c/p\u003e\n\u003cp\u003eKylie snorted. “So says the woman who told Dash off when he pulled his stupidity.”\u003c/p\u003e\n\u003cp\u003eChessy laughed again and then all three women burst into laughter. God it felt good to feel so light again. The weight of the past two years had become oppressive. Just finally being able to confront Tate with her unhappiness had been so freeing. \u003c/p\u003e","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-29.html","bookId":1781,"creation":"Oct 5, 2019 10:37:47 AM","modification":"Oct 5, 2019 10:37:47 AM"}
