{"id":76164,"no":30,"title":"Page 30","content":"\u003cp\u003e“Okay, so he didn’t break out the flogger,” Joss said, a twinkle in her eyes. “So what did he do? I want all the gory details.”\u003c/p\u003e\n\u003cp\u003eKylie rolled her eyes and then made a show of plugging both ears. “I’m too innocent to hear this.”\u003c/p\u003e\n\u003cp\u003eChessy snorted. “Oh please. Like you and Jensen don’t perform your own X-rated sex shows? Ever hear of the saying ‘doth protest too much’? Well that’s you. It’s always the quiet ones you have to watch.”\u003c/p\u003e\n\u003cp\u003eKylie blushed and Joss hooted with laughter. “You nailed her, Chessy. Look at that face. That’s the look of a cat who’s definitely gotten the cream.”\u003c/p\u003e\n\u003cp\u003eChessy choked on her drink and nearly spurted water from her nose. “Oh my God, you said cream. I’m dying over here.”\u003c/p\u003e\n\u003cp\u003eKylie groaned. “Dear Lord. You both have to stop. Is everything a sexual innuendo with you two?”\u003c/p\u003e\n\u003cp\u003e“Yes!” both Chessy and Joss said in unison.\u003c/p\u003e\n\u003cp\u003eThey immediately hushed when the waiter arrived to take their order. As soon as he left, they burst into laughter again. Tears streamed down Joss’s face and she hastily wiped her eyes with the table napkin.\u003c/p\u003e\n\u003cp\u003e“You two are incorrigible,” Kylie grumbled. “Let’s leave my sex life out of this.”\u003c/p\u003e\n\u003cp\u003e“This is a novelty,” Chessy teased. “You having a sex life, I mean. A few months ago you would have been appalled by the notion. It’s high time you got in on the action.”\u003c/p\u003e\n\u003cp\u003eKylie lowered her head and beat her forehead against the table. “What did I do to deserve this?”\u003c/p\u003e\n\u003cp\u003e“Hmmm, I’d say Jensen is very rewarding,” Joss said, a dreamy look on her face.\u003c/p\u003e\n\u003cp\u003eKylie’s smile was rueful. “I can’t argue with you there. But can we please move on to a different topic? Chessy still hasn’t filled us in with all the juicy details.”\u003c/p\u003e\n\u003cp\u003eChessy grinned. “Let’s just say that Tate and I are well on our way back to the way things used to be. At first he held back his dominance. I think he was too focused on making sure I wasn’t going anywhere. After the horridness of our anniversary night, he kicked it into high gear. He made love to me like whoa. No dominance. Just tenderness that was so sweet it made my heart ache. But at the same time I wanted his dominance. I didn’t want our relationship to change. I just wanted us back, you know?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I know,” Joss said softly.\u003c/p\u003e\n\u003cp\u003e“I get it,” Kylie admitted. “Jensen is dominant in all aspects except our sex life. There … he gives up complete control to me. But one day … One day I’d like to be able to give him control there too. We’re both going to therapy. I’m hoping it will help me trust him more. That sounds so awful. I do trust him. In my heart I know he’d never hurt me. But it’s hard. And more than me knowing he’d never hurt me, he has to believe that too.”\u003c/p\u003e\n\u003cp\u003eChessy reached for Kylie’s hand and squeezed. “I understand completely, sweetie. And you’ll get there. Rome wasn’t built in a day, you know. Jensen is so perfect for you. So patient and understanding. The fact that he’s willing to give up control in the bedroom is amazing. It proves just how much he loves you to deny that part of himself.”\u003c/p\u003e\n\u003cp\u003eKylie’s eyes became watery. “But I don’t want him to have to deny any part of himself. And that’s what bothers me. I want him to have control but I’m not there yet.”\u003c/p\u003e\n\u003cp\u003e“You’ll get there,” Joss repeated. “Give it time. You’ve only been together a short time.”\u003c/p\u003e\n\u003cp\u003e“So Tate didn’t … dominate you?” Kylie asked. The words came out strangled, as if she didn’t know what label to put on Chessy’s relationship with Tate.\u003c/p\u003e\n\u003cp\u003eChessy’s smile was gentle. She let go of Kylie’s hand as the waiter delivered their entrees. Only when he was gone did she address Kylie’s question.\u003c/p\u003e\n\u003cp\u003e“At first no. I think he didn’t think it was appropriate. In fact, he very much humbled himself. For a moment it was as if he was the submissive and I was the Dominant, which is laughable since I’m the furthest from a Dominant you can get. I think he felt awkward about just falling into our old routine. It was an apology, I think. He was so reverent and careful. It was wonderful, don’t get me wrong, but I wanted—needed—his dominance. And so after our dinner do-over, that’s when he retook control.”\u003c/p\u003e\n\u003cp\u003e“I’m glad for you,” Joss said sincerely. “I’ve hated seeing you so unhappy, Chessy. I’m sure now that you’ve let Tate know how you feel that you’ll see a change in the way he treats you.”\u003c/p\u003e\n\u003cp\u003eChessy winced. “That sounds so bad when you say it like that. Like he was abusing me or something.”\u003c/p\u003e\n\u003cp\u003e“Neglect is akin to abuse,” Kylie said softly. “You should know that better than anyone.”\u003c/p\u003e\n\u003cp\u003eChessy’s heart clenched at the subtle reminder of her childhood. Not abused, but unwanted. She wasn’t sure which was worse. Both were unforgiveable for a parent to subject a child to. She’d spent her entire childhood ignored, dismissed, unloved and a nuisance to parents who’d never wanted a child.\u003c/p\u003e\n\u003cp\u003eTate was well aware of the circumstances of her childhood. He’d been the first person she’d ever confided in. As soon as she’d turned eighteen, she’d left her home and worked her way through college. Her parents hadn’t even bothered to show up for her high school graduation much less her graduation from college.\u003c/p\u003e\n\u003cp\u003eHer phone chimed, signaling a text message. Grateful for the interruption so the conversation didn’t dissolve into a dissection of her childhood, she dug into her purse and clicked on the text. It was from Tate. \u003c/p\u003e","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-30.html","bookId":1781,"creation":"Oct 5, 2019 10:37:47 AM","modification":"Oct 5, 2019 10:37:47 AM"}
