{"id":76174,"no":40,"title":"Page 40","content":"\u003cp\u003eAfter arranging her hair to her satisfaction she traipsed back into the bedroom to put on the heels that she’d left on the ottoman in front of the comfy armchair Tate referred to as her reading nest.\u003c/p\u003e\n\u003cp\u003eShe only had five minutes until Tate was scheduled to be home and he’d requested she be in the living room waiting for him so he could put the collar around her neck. She winced inwardly. She found the meaning behind a collar to be beautiful and symbolic of their relationship but she much preferred the term choker, or even simply the mark of his possession. Collars were for pets but she supposed that some Dominants considered their submissives to be pets in the fondest of manners. She’d even heard a man at The House in the past call his submissive “my pet” and it was obvious from his tone that it was an affectionate term of endearment. Not derisive or degrading in the least. But for her personally, it didn’t work. She much preferred Tate’s “my girl” when referring to her, which was probably juvenile at best but there was no accounting for tastes. It was what it was.\u003c/p\u003e\n\u003cp\u003eShe settled on the edge of the couch to wait for Tate and within a few minutes the front door opened and he entered the living room, stopping when he got his first glimpse of her.\u003c/p\u003e\n\u003cp\u003e“Stand up,” he said huskily.\u003c/p\u003e\n\u003cp\u003eShe complied, standing to her new, more impressive height thanks to the heels.\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything for the longest time. He simply drank in her appearance. The silence went on for so long that she began to wonder if she’d messed up or if perhaps she didn’t look as good as she thought.\u003c/p\u003e\n\u003cp\u003eThen he crossed the room and tipped up her chin, which was now a lot closer to his with her added height, and he slanted his mouth over hers. He kissed her hungrily, as if he were starving for her. All doubt fled when she felt the solid evidence of his arousal through his slacks.\u003c/p\u003e\n\u003cp\u003eWhen he pulled away, his eyes were blazing with lust. “You look magnificent,” he said in a hoarse voice.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she whispered. “But you picked everything out so I’d say your taste is pretty darn impressive.”\u003c/p\u003e\n\u003cp\u003e“Baby, that dress would not make every woman look as sensational as you. It’s you. Not the dress. One hundred percent you.”\u003c/p\u003e\n\u003cp\u003eShe smiled her pleasure at his sincere compliment. Then he reached into his pocket and pulled out a velvet drawstring bag with the name of a prominent jeweler monogrammed on the front.\u003c/p\u003e\n\u003cp\u003e“Sit down,” he said, a quiet command.\u003c/p\u003e\n\u003cp\u003eShe sank onto the couch and he pulled out an intricately designed leather choker with aquamarine stones that matched her dress to perfection. She was awed by the obvious amount of time he’d devoted to pulling together her outfit for the evening. And even more impressed with the brief amount of time he’d had to work with in order to have it all ready on such short notice.\u003c/p\u003e\n\u003cp\u003eThen he turned it over to the side that would lie against her throat and burned into the leather were the words “My Girl.”\u003c/p\u003e\n\u003cp\u003eDamn it, she would not cry. She’d shed far too many tears both in sadness and joy lately. She would not ruin the evening before it ever truly began.\u003c/p\u003e\n\u003cp\u003e“It’s beautiful, Tate,” she whispered.\u003c/p\u003e\n\u003cp\u003e“You truly like it?”\u003c/p\u003e\n\u003cp\u003eShe was surprised at the vulnerability in his tone. She wouldn’t have ever imagined him worrying over her liking a gift from him. Anything he gave her was very precious to her. But the best gift of all was simply himself.\u003c/p\u003e\n\u003cp\u003eShe leaned up just a bit to kiss him and then nipped playfully at his jaw. “I don’t like it. I love it.”\u003c/p\u003e\n\u003cp\u003eHe smiled then, and perhaps it was her imagination, but his shoulders seem to relax as if in relief.\u003c/p\u003e\n\u003cp\u003e“My girl is playful tonight, I see. That’s good because I intend for us to play a lot. Let me change right quick and we’ll go.”\u003c/p\u003e\n\u003cp\u003e“I’ll be waiting,” she said.\u003c/p\u003e\n\u003cp\u003eAN hour later, Tate pulled up the winding driveway of The House that sat atop a gentle hill and looked down at grassy, green rolling landscapes. Everything about The House screamed wealth and privilege even though membership didn’t require either. However, Damon Roche, the owner of The House, was the epitome of wealth and class. And he was extremely discerning when it came to membership in his establishment.\u003c/p\u003e\n\u003cp\u003eMembers were carefully vetted and background checks were required for all prospective members. In addition to the care Damon took in screening the members, there was careful attention to security. Even in the private rooms members could avail themselves of if they didn’t want to be in the public common room, security cameras were in place and the safety of the participants was monitored at all times. While the non-public rooms offered the illusion of privacy, in fact they were all under vigilant security surveillance for the safety of all parties involved.\u003c/p\u003e\n\u003cp\u003eTate stopped the engine after pulling into a parking spot and then turned to look at Chessy. “Is my girl ready for her night to begin?”\u003c/p\u003e\n\u003cp\u003e“Oh yes,” she breathed.\u003c/p\u003e\n\u003cp\u003eHe squeezed her hand and then opened his door. She knew the drill. She waited for him to come around and open her door. He leaned in, attaching a diamond-studded leash to the loop at the back of the collar and then held out his hand to assist her in getting out.\u003c/p\u003e\n\u003cp\u003eShe stumbled at first when her heel caught a crack in the pavement and Tate immediately wrapped his arm around her waist to steady her.\u003c/p\u003e\n\u003cp\u003e“Okay?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes. Just caught my heel.”\u003c/p\u003e\n\u003cp\u003eHe led her to the entry where a man in an expensive black suit had them sign in and Tate showed ID. It had been so long since they’d last gone to The House that Chessy didn’t recognize the new doorman. But then for all she knew he could have been working here for quite some time. \u003c/p\u003e","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-40.html","bookId":1781,"creation":"Oct 5, 2019 10:37:47 AM","modification":"Oct 5, 2019 10:37:47 AM"}
