{"id":76180,"no":46,"title":"Page 46","content":"\u003cp\u003eBefore she would have appreciated his determination to save their marriage, but that was when she thought they had a viable relationship. Now, she just wanted to be away from him so she could vent her devastation, but she was just as determined that she not break down in front of him.\u003c/p\u003e\n\u003cp\u003eShe had to be strong for herself. No longer would she depend on Tate for her emotional stability. Her faith and trust had been sorely misplaced. She would have never thought him capable of what he’d done tonight. Yes, he’d put business before her for quite some time, but never in a situation that was fraught with peril and her safety was truly at risk. In her heart, she’d always known that he’d protect her when it really counted.\u003c/p\u003e\n\u003cp\u003eHow very wrong she’d been, and it broke her heart.\u003c/p\u003e\n\u003cp\u003eShe kicked open the door that was still partially ajar from their entrance just minutes before and she dragged her suitcase over the step and onto the front porch. Tate tried one last time, gently capturing her arm with his hand. Though his grip wasn’t bruising in the least, it was firm, commanding her attention.\u003c/p\u003e\n\u003cp\u003eShe stared pointedly at him and then down at his hand, silently telling him to let her go.\u003c/p\u003e\n\u003cp\u003e“Chessy, please don’t do this,” he begged softly. “Stay. Tonight at least. We’ll talk in the morning. I won’t go into work. We’ll go away if you like. Somewhere we can be afforded complete privacy. I’ll do whatever it takes for you not to go.”\u003c/p\u003e\n\u003cp\u003e“It’s too late for that. Going away won’t fix what’s wrong. It only delays the inevitable. I can’t force you to make me your priority and furthermore I wouldn’t want to try to make someone feel something for me they don’t. The truth always wins out in the end. Tonight proved that.”\u003c/p\u003e\n\u003cp\u003e“If the truth wins out in the end then I’ll get you back,” Tate vowed. “Because the truth is I love you and that’s never going away. I’ll do whatever it takes to have you back home where you belong, Chessy. So be warned. I’m not giving up and I’m not letting you walk out of my life or our marriage.”\u003c/p\u003e\n\u003cp\u003e“You already left our marriage,” she said sadly.\u003c/p\u003e\n\u003cp\u003eThen she turned and lugged her suitcase to her Mercedes and threw it in the backseat. She didn’t look back at Tate. She forced herself to open her door, slide into the driver’s seat and drive away. But as she drove away, she couldn’t help but glimpse in her rearview mirror and see Tate’s silhouette outlined by the porch light as he watched her drive away.\u003c/p\u003e\n\u003cp\u003eNINETEEN\u003c/p\u003e\n\u003cp\u003eCHESSY had no clear destination in mind as she left her neighborhood. There were three options available to her. She could check into a hotel, go to Joss’s or go to Kylie’s.\u003c/p\u003e\n\u003cp\u003eShe instantly vetoed the hotel because the very last thing she wanted was to be alone. Which left either going to Joss’s or Kylie’s. In the end she decided on Kylie because Kylie was closer and Joss was pregnant. Chessy didn’t want to cause Joss undue stress, nor did she want to keep her up all night. Besides, Joss couldn’t drink and Kylie could and right now a stiff drink was definitely in order.\u003c/p\u003e\n\u003cp\u003eShe pulled into Jensen’s driveway and parked beside Kylie’s car. She sat there a moment, trying to collect her scattered thoughts. It hit her all at once. She’d walked out on Tate. She’d left him. Her marriage was over.\u003c/p\u003e\n\u003cp\u003eTears gathered in her eyes but she gulped in air and swallowed convulsively. Then she braced herself and got out of her car. She hauled out her bags and walked up the pathway to the front door. She hadn’t even rung the doorbell when the door opened and Jensen filled the doorway, his expression one of concern. Then he took in her suitcase.\u003c/p\u003e\n\u003cp\u003e“Shit,” he murmured. “I’m going to kill him.”\u003c/p\u003e\n\u003cp\u003eShe promptly burst into tears and Jensen immediately pulled her into his arms, kicking aside her luggage and closing the door behind her.\u003c/p\u003e\n\u003cp\u003e“Come inside,” Jensen said kindly. “Let me get Kylie. She just got out of the shower.”\u003c/p\u003e\n\u003cp\u003eChessy sniffled. “Thank you. I’m sorry to burst in on you unannounced like this. I just didn’t know where else to go.”\u003c/p\u003e\n\u003cp\u003eJensen’s expression grew fierce. “You are always welcome here, Chessy. Now sit tight. Let me go get Kylie for you.”\u003c/p\u003e\n\u003cp\u003eBefore he could move, Kylie walked into the living room, her hair wrapped in a towel.\u003c/p\u003e\n\u003cp\u003e“Jensen? Was that the front door I heard …”\u003c/p\u003e\n\u003cp\u003eHer voice trailed off when she saw Chessy sitting there.\u003c/p\u003e\n\u003cp\u003e“Oh no,” Kylie whispered. She rushed over to where Chessy sat and pulled her into a hug. “What happened?”\u003c/p\u003e\n\u003cp\u003eJensen handed Chessy a tissue but Kylie took it and gently wiped at Chessy’s tears.\u003c/p\u003e\n\u003cp\u003e“It’s over,” Chessy said brokenly. “I left Tate.”\u003c/p\u003e\n\u003cp\u003eKylie exchanged shocked looks with Jensen. Jensen had a baffled expression as if he couldn’t possibly understand why Chessy was sitting in his living room telling them she’d left Tate.\u003c/p\u003e\n\u003cp\u003e“What happened?” Kylie prompted again.\u003c/p\u003e\n\u003cp\u003eChessy closed her eyes and then spilled the entire ugly tale. By the time she was finished, Jensen wore a murderous expression, rage emanating in waves from him.\u003c/p\u003e\n\u003cp\u003e“Un-fucking-believable,” Jensen swore. “I’m going to kill him,” he said, repeating the words he’d uttered in the doorway moments before. “What he did is unforgivable. How could he have let it happen?”\u003c/p\u003e\n\u003cp\u003eKylie had gone pale and she looked stricken as she stared at her friend. “Chessy, are you hurt? Do you want me and Jensen to take you to the hospital?”\u003c/p\u003e\n\u003cp\u003eChessy shook her head. “I’m fine. Okay, I’m not fine, but physically I’m okay.” \u003c/p\u003e","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-46.html","bookId":1781,"creation":"Oct 5, 2019 10:37:47 AM","modification":"Oct 5, 2019 10:37:47 AM"}
