{"id":76200,"no":66,"title":"Page 66","content":"\u003cp\u003eTWENTY-EIGHT\u003c/p\u003e\n\u003cp\u003eTHE divider between the two conference rooms had been opened up to make one huge room and it was filled nearly to capacity for the open house reception for the launch of MHL Financial Services. Tate should have been thrilled with the turnout, but his heart wasn’t in it.\u003c/p\u003e\n\u003cp\u003eHe smiled when appropriate, exchanged pleasantries and meaningless chitchat. Answered in-depth questions about why a prospective client should choose his firm over a competitor. It was going off without a hitch. So why wasn’t he more triumphant? This is what he’d been working so hard for, right?\u003c/p\u003e\n\u003cp\u003eExcept that the one person who mattered the most wasn’t here to share in his success.\u003c/p\u003e\n\u003cp\u003eWith a sigh, he politely excused himself from the couple he’d been conversing with and went in search of one of the waiters circling with glasses of wine on his tray. Tate had made sure that only the best was served. Good wine, good champagne and he’d hired an excellent catering service and spared no expense in ensuring the food was fabulous.\u003c/p\u003e\n\u003cp\u003eAs he collected a glass and brought it to his lips, he saw her. He damn near choked on the liquid in his mouth and had to cough so he didn’t aspirate it into his lungs.\u003c/p\u003e\n\u003cp\u003eChessy stood across the room so heart-stoppingly beautiful that he forgot to breathe. She positively sparkled. And he wasn’t the only one to have noticed. People stopped and openly stared, drawn to Chessy’s radiance. She wore a soft smile, her eyes filled with warmth as she searched the crowd. For him? Had she come for him? He was afraid to hope. But why else would she be here? How had she even known for that matter?\u003c/p\u003e\n\u003cp\u003eHer hair was arranged artfully atop her head, soft ringlets cascading down her slender neck. She wore the simple, yet elegant diamond earrings he’d given her for their anniversary one year, but what took his breath away was the collar she wore. The one she’d taken off and to his knowledge hadn’t worn since that fateful night at The House.\u003c/p\u003e\n\u003cp\u003eAnd the shoes. God, the shoes. He wanted to charge across the room, take her into the nearest office and f**k her senseless right on the desk. Her dress, while modest, clung to her every curve, outlining in magnificent detail her spectacular figure. His tongue was dry in his mouth and he couldn’t even swallow.\u003c/p\u003e\n\u003cp\u003eThen she found him in the crowd, their gazes locking. And she smiled. A brilliant, welcoming smile that nearly buckled his knees. She started forward, navigating her way through the crowd. Finally finding his own footing, he parted his way through the crowd, determined to meet her halfway.\u003c/p\u003e\n\u003cp\u003eWhen they drew abreast of each other, Tate simply pulled her into his arms, uncaring that they were likely causing a stir. He held on to her, closing his eyes at the simple pleasure of having her in his arms.\u003c/p\u003e\n\u003cp\u003e“I’m so glad you came,” he whispered. “But how did you know?”\u003c/p\u003e\n\u003cp\u003eShe drew away and smiled tenderly up at him. “I read about it in the paper. Why didn’t you tell me about it?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t sure you’d want to come,” he admitted.\u003c/p\u003e\n\u003cp\u003e“If it’s important to you, it’s important to me,” she said softly.\u003c/p\u003e\n\u003cp\u003eHope surged through his heart, hope that he was afraid to allow himself to feel.\u003c/p\u003e\n\u003cp\u003e“We’ll talk about it later,” she whispered. “For now, introduce me to your new partners. You have clients to court and entertain. I’ll be here when it’s over and then you can take me home so we can talk.”\u003c/p\u003e\n\u003cp\u003eHe was precariously close to breaking down and losing it right here in the middle of the crowded room. And he didn’t give one damn. Wrapping his arm around her waist, anchoring her possessively to his side, he pushed through the crowd and introduced her not only to his new partners but to several of his clients.\u003c/p\u003e\n\u003cp\u003eWatching Chessy demonstrate her natural charm and effervescence was like seeing magic. She mesmerized her captive audience and had them all eating out of the palm of her hand. Why had he ever stopped bringing her to client dinners and events? At the time he hadn’t wanted to burden her, but now he could see that she’d taken it as a rejection of her when nothing could be further from the truth.\u003c/p\u003e\n\u003cp\u003eHe was bursting with pride over her. He saw the envious stares of the other men in the room, which is why he never allowed Chessy to stray from his side. He was publicly putting his stamp on her. Mine. Hands off.\u003c/p\u003e\n\u003cp\u003eWhen the event began to wind down and guests started filtering out, Tate turned to his two partners. “You can hang around until everyone has left. I’m going home with my wife.”\u003c/p\u003e\n\u003cp\u003eNot even giving them a chance to argue, he herded Chessy to the door as fast as he could, ignoring her look of astonishment. She wasn’t used to taking precedence over business, but she damn well better start getting accustomed to it because that was the way it was going to be from now on.\u003c/p\u003e\n\u003cp\u003eThe traffic gods were on his side today and they made it home in seven minutes. Tate tucked her hand into his to make sure she didn’t change her mind and refuse to come inside the house and he hurried her in. As soon as they made it through the front door, the clothes starting coming off.\u003c/p\u003e\n\u003cp\u003eHe pulled impatiently at her dress, tearing the zipper when it didn’t immediately open. She was as impatient as he was, ripping at the buttons on his dress shirt. She yanked his tie away and sent it sailing. He tore the delicate lace of her bra and then hooked his thumbs in her panties and sent them flying down her legs.\u003c/p\u003e\n\u003cp\u003eAs soon as his dick was free of his pants, he lifted her and thrust to the hilt. Her legs wrapped solidly around his waist, anchoring her firmly against him as he walked toward the couch, buried deep in her pu**y.\u003c/p\u003e\n\u003cp\u003eHis hands underneath her ass, lifting and then allowing her to fall back down his erection, caused them both to groan with pleasure. Their need was desperate, a living, breathing entity that filled the room. Her hands clutched greedily at his shoulders, her body arching up and then back down to meet his thrusts. \u003c/p\u003e","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-66.html","bookId":1781,"creation":"Oct 5, 2019 10:37:47 AM","modification":"Oct 5, 2019 10:37:47 AM"}
