{"id":76203,"no":69,"title":"Page 69","content":"\u003cp\u003e“No one can ever accuse you of taking things slow and easy,” she teased.\u003c/p\u003e\n\u003cp\u003e“I move fast when there’s something I want. Why wait? I couldn’t take the risk that some other guy would steal you away from me.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “As if. No one else would put up with me. I’m afraid you’re stuck with me.”\u003c/p\u003e\n\u003cp\u003e“There’s no one I’d rather be stuck with than you,” he said, nearly echoing her own words.\u003c/p\u003e\n\u003cp\u003e“Thank f**k,” she said, returning his words in kind. “What was it we decided? We’ll be f**ked up together?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “That about sums it up. Hell, who else would put up with us but each other? I guess that means we’re perfect for one another.”\u003c/p\u003e\n\u003cp\u003e“Hell yes,” she said fervently.\u003c/p\u003e\n\u003cp\u003e“Don’t you think you should put the ring on now?” he asked in a teasing voice.\u003c/p\u003e\n\u003cp\u003e“Oh my God, I almost forgot the ring!”\u003c/p\u003e\n\u003cp\u003eHe pulled the ring from the velvet clasp and his hands shook as much as hers as he gently pushed it onto her ring finger.\u003c/p\u003e\n\u003cp\u003eShe stared at it in awe. “This is huge!” she whispered. “I’m afraid to wear it, Jensen. What if I lose it? Or the diamond falls out? I’ll live in terror of something happening to it.”\u003c/p\u003e\n\u003cp\u003eHe kissed her on the nose. “That’s what insurance is for.”\u003c/p\u003e\n\u003cp\u003eShe wrinkled her nose as he drew away. “They insure rings?”\u003c/p\u003e\n\u003cp\u003e“Of course. You can insure anything of value. So now you can wear it without worrying that you’ll lose it. In fact, I will not be pleased if you ever take it off. This ring signals that you’re mine.”\u003c/p\u003e\n\u003cp\u003e“I think I can live with that,” she said with a smile. “Now what can we do to celebrate?” she asked innocently.\u003c/p\u003e\n\u003cp\u003e“Oh I can think of something,” he growled.\u003c/p\u003e\n\u003cp\u003eHe swept her up and into his arms and carried her toward the bedroom, his mouth fused to hers.\u003c/p\u003e\n\u003cp\u003eTHIRTY-ONE\u003c/p\u003e\n\u003cp\u003eCHESSY hummed cheerfully as she bustled around the kitchen putting the finishing touches on dinner. Tate had called earlier to let her know he was on his way home and he should be pulling up any second.\u003c/p\u003e\n\u003cp\u003eJust as she set the pan of baked chicken out on the table, she heard the front door open and she turned to greet him as soon as he walked through the kitchen door.\u003c/p\u003e\n\u003cp\u003e“Mmm, smells delicious,” he said as he swept her into his arms, kissing her thoroughly in greeting.\u003c/p\u003e\n\u003cp\u003e“If you’re ready to eat, go ahead and sit unless you want to get changed into more comfortable clothing first,” she said.\u003c/p\u003e\n\u003cp\u003eHe simply loosened his tie and removed his coat, tossing it over one of the unused chairs at the table, and then took his seat catty corner to where Chessy would sit. She made one more trip to the stove to carry the two pots of vegetables to the table and then she sat down with Tate.\u003c/p\u003e\n\u003cp\u003eHe served up the chicken for them both and she spooned out corn onto her plate before passing it to Tate. Butter beans were next and then they both dug in.\u003c/p\u003e\n\u003cp\u003e“How was work?” she asked. “How is the new partnership going?”\u003c/p\u003e\n\u003cp\u003eTate hesitated and glanced up, his expression growing serious. Her stomach plummeted and she braced herself for what was to come. Surely not again …\u003c/p\u003e\n\u003cp\u003e“I may be late the next two days,” he said quietly. “We have a very important meeting with a large company who wants us to manage their private equity fund. It would be a huge account and if we ace this then it will set us at the forefront of financial firms. It could very well lead to more business.”\u003c/p\u003e\n\u003cp\u003eHer brow furrowed, confused by the worry she saw in his eyes.\u003c/p\u003e\n\u003cp\u003e“Tate, are you worried that I’m going to be pissed because you’re going to be late a couple of days?”\u003c/p\u003e\n\u003cp\u003eHe looked chagrinned. “You have to admit the timing sucks. I just get you to move back in and give us another chance and after only a few days I have to tell you that I’ll be late because of an important meeting.”\u003c/p\u003e\n\u003cp\u003eShe reached for his hand, hoping her sincerity showed. “I don’t expect you to sacrifice your entire career in order to kiss my ass. I understand you have to work, that you have clients and important meetings. My problem before arose from the fact that it was all the time and that when you were at home, you weren’t really here, if that makes any sense. You’d pulled away completely from me. We were like two strangers living in the same house. But it’s not like that now.”\u003c/p\u003e\n\u003cp\u003e“I hope you know it won’t be that way.”\u003c/p\u003e\n\u003cp\u003e“I do, Tate. I do.”\u003c/p\u003e\n\u003cp\u003eHis face softened with relief. The he squeezed her hand. “How are you and the little one doing?”\u003c/p\u003e\n\u003cp\u003e“We’re doing great,” she said enthusiastically. “I called to set up my first OB appointment today with the same one Joss uses. I was queasy this morning but managed not to throw up. I think I’m handling it far better than poor Joss.”\u003c/p\u003e\n\u003cp\u003e“Tell me when you appointment is,” he said seriously. “I won’t miss it for anything.”\u003c/p\u003e\n\u003cp\u003e“It’s on the thirteenth. A Wednesday.”\u003c/p\u003e\n\u003cp\u003e“I’ll mark it down on my planner. What time?”\u003c/p\u003e\n\u003cp\u003e“Ten in the morning.”\u003c/p\u003e\n\u003cp\u003e“How about I just plan to go into work after your appointment. I’ll stick around and drive you to the doctor and we’ll have lunch after.”\u003c/p\u003e\n\u003cp\u003e“That sounds wonderful,” she said with a bright smile.\u003c/p\u003e\n\u003cp\u003eHe studied her a long moment, his gaze drifting over her features. “You look happy,” he said. “I hadn’t realized how long it’s been since you truly looked happy. I’m so sorry, Chess.” \u003c/p\u003e","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-69.html","bookId":1781,"creation":"Oct 5, 2019 10:37:47 AM","modification":"Oct 5, 2019 10:37:47 AM"}
