{"id":76207,"no":73,"title":"Page 73","content":"\u003cp\u003e“Chessy, oh my God, are you all right?” Joss asked in concern.\u003c/p\u003e\n\u003cp\u003e“What happened?” Dash asked in a grim voice.\u003c/p\u003e\n\u003cp\u003eThey were interrupted when the sonogram tech came in pushing a portable sonogram machine with a wand attached. Chessy’s eyes widened when they told her they would be doing an internal sonogram since it was so early in her pregnancy.\u003c/p\u003e\n\u003cp\u003eThe fear and anxiety became too much. This was the moment where she’d discover whether or not her baby had survived her stupidity. She’d never forgive herself if she’d caused the death of her child.\u003c/p\u003e\n\u003cp\u003eShe burst into uncontrollable sobs, tears streaking down her cheeks. Her entire body shook and the pain from her arm became unbearable.\u003c/p\u003e\n\u003cp\u003eTo her utter shock, the door flew open and Tate filled the doorway, his gaze immediately seeking Chessy. He looked haggard and worried but relief flooded his features when he saw her.\u003c/p\u003e\n\u003cp\u003eBut as he registered her sobs, his look turned to one of devastation. He flew over to her side, all but pushing the others away.\u003c/p\u003e\n\u003cp\u003e“Chessy, are you all right?” he demanded. “What happened? Is the baby okay?”\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” she asked in astonishment, some of her tears abating as she took in the fact that her husband was here. Not at a meeting. He was here with her. “Tate, you can’t miss the presentation today. How did you even know I was here?”\u003c/p\u003e\n\u003cp\u003e“Dash called me,” Tate said grimly. “But you should have been the one to call me. Chessy, nothing is more important than you. Fuck the presentation. That’s what I have partners for now. If we get it we get it. If not, there will be other opportunities. But my sole priority is you and your safety and our child.”\u003c/p\u003e\n\u003cp\u003eChessy burst into tears again and Tate leaned down, carefully pulling her into his arms.\u003c/p\u003e\n\u003cp\u003e“Don’t cry, baby. Please don’t cry. It’ll be all right. I swear it. If this pregnancy doesn’t work out, we’ll have others. I’ll give you as many babies as you want.”\u003c/p\u003e\n\u003cp\u003eHer heart filled with love. Her emotions were out of control. Tate had chosen her. She hadn’t asked him to. Hadn’t expected him to leave such an important meeting. But he’d come.\u003c/p\u003e\n\u003cp\u003e“It breaks my heart that you’re so overwhelmed by the fact that I came,” Tate said, sorrow swamping his face. “But Chessy, I’ll always choose you. I know in the past I haven’t, but from now on, you are my number one priority. You should have called me but I understand why you didn’t. But from now on, I expect you to always tell me what’s going on with you. Especially when you’re hurt and in the hospital and worried that you’ve lost our baby.”\u003c/p\u003e\n\u003cp\u003e“I love you,” she whispered. “I love you so much.”\u003c/p\u003e\n\u003cp\u003e“I love you too, baby.”\u003c/p\u003e\n\u003cp\u003eThe sonogram tech cleared his throat. “If you’ll all leave the room I’ll do the sonogram and confirm whether or not the baby is still safely in her mother’s womb.”\u003c/p\u003e\n\u003cp\u003e“I’m not leaving,” Tate growled.\u003c/p\u003e\n\u003cp\u003eHe positioned himself by Chessy’s side and curled his arm underneath her so he supported her upper body.\u003c/p\u003e\n\u003cp\u003eJoss, Kylie, Jensen and Dash discreetly left the room and the sonogram tech pulled up the gown they’d changed her into and quietly explained the process of an internal sonogram.\u003c/p\u003e\n\u003cp\u003eThe wand would be inserted into her vagina and the images would show up on the screen of the sonogram machine.\u003c/p\u003e\n\u003cp\u003e“Let’s hope for the best,” the tech said with a smile. “Your spotting was minimal and it’s quite normal in the early stages of pregnancy. Chances are it had nothing to do with your fall at all.”\u003c/p\u003e\n\u003cp\u003eSilence descended as the tech began the sonogram. Tate had Chessy firmly anchored in his arms and he gripped her right hand, squeezing tightly. He was as afraid as she was. She could see the tension in his features, the fear in his eyes. Fear for her and fear for their child.\u003c/p\u003e\n\u003cp\u003e“There’s the heartbeat! Everything looks good, little mama. Your baby is still right where it needs to be.”\u003c/p\u003e\n\u003cp\u003eChessy burst into tears again. Tate touched his forehead to hers, relief etched in every facet of his face.\u003c/p\u003e\n\u003cp\u003e“Our baby is just fine,” he whispered. “But now we have to take care of you.”\u003c/p\u003e\n\u003cp\u003eHe tenderly wiped her tears away, kissing the damp trails on her cheeks.\u003c/p\u003e\n\u003cp\u003e“I’m so glad you’re here,” she said brokenly. “I wanted you here so bad but I didn’t want to mess up your presentation.”\u003c/p\u003e\n\u003cp\u003e“I’ll always be here,” he said gently. “You and our baby come first.”\u003c/p\u003e\n\u003cp\u003eHe’d chosen her.\u003c/p\u003e\n\u003cp\u003eJoy quickly replaced the sorrow and fear over the thought of losing her baby. She reached up with her uninjured arm and caressed Tate’s face.\u003c/p\u003e\n\u003cp\u003e“You chose me,” she whispered.\u003c/p\u003e\n\u003cp\u003eTears brimmed in Tate’s own eyes.\u003c/p\u003e\n\u003cp\u003e“I know I can’t erase the past, Chessy, but I can affect the future. And from now on, you come first. Always. I need you to believe that.”\u003c/p\u003e\n\u003cp\u003e“I do,” she whispered.\u003c/p\u003e\n\u003cp\u003e“I love you,” he said gravely, sincerity brimming in his tear-filled eyes. “And as soon as they release you, I’m taking you home and you’re not going to lift so much as a finger while you recover. I’m taking the rest of the week off and depending on how you’re doing, I may take off next week as well.”\u003c/p\u003e\n\u003cp\u003eShe was stunned, sure that shock registered on her face.\u003c/p\u003e\n\u003cp\u003eHe caressed her cheek, love and tenderness radiating from his eyes.\u003c/p\u003e\n\u003cp\u003e“I chose you, Chessy. I’ll always choose you.”\u003c/p\u003e\n\u003cp\u003eShe smiled, ignoring the pain in her arm. She had everything in the world that mattered to her right here and now. Her baby was safe and her husband was here. Everything was good. Finally, she was at peace. \u003c/p\u003e","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-73.html","bookId":1781,"creation":"Oct 5, 2019 10:37:47 AM","modification":"Oct 5, 2019 10:37:47 AM"}
