{"id":46326,"no":1009,"title":"Chapter 1007: A Teardrop","content":"\u003cp\u003eThe human body was still capable of reacting even under the control of a slave seal. Clearly, Du Lingfei had a tenacious determination in her heart to avoid hurting Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eWhen Bai Xiaochun felt the hand on the top of his head trembling, he opened his eyes to see Du Lingfei’s face twitching. Furthermore, the magical slave seals in her eyes were flickering dramatically…. A moment passed, and then, she moved her hand away!\u003c/p\u003e\n\u003cp\u003e“Boo….” he murmured. Off to the side, mixed emotions could be seen in the Celestial’s eyes. However, he quickly wiped them away with madness. Reaching his hand out, he pointed at his daughter.\u003c/p\u003e\n\u003cp\u003eShe shivered, and the slave seals overwhelmed any sensation of pain she felt. She went still, and then… calmly put her hand back down on Bai Xiaochun’s head.\u003c/p\u003e\n\u003cp\u003eShe looked at him with eyes that didn’t contain even a scrap of emotion, and yet, Bai Xiaochun could still sense her inner pain.\u003c/p\u003e\n\u003cp\u003eHis lips parted as if he were about to say something, but instead, he stayed silent. This time, he didn’t close his eyes. He knew that his life was nearing its end, and therefore, in that final moment before he died, he would create an eternal memory of what he was seeing.\u003c/p\u003e\n\u003cp\u003eRumbling sounds filled the necropolis as the bones melted into the spell formation. Then, an explosive force left Du Lingfei’s hand and entered Bai Xiaochun’s head.\u003c/p\u003e\n\u003cp\u003eIntense pain raged through him as his life force, cultivation base, flesh, blood, and soul all began to rush toward Du Lingfei!\u003c/p\u003e\n\u003cp\u003eIt was as if his body were being destroyed. His bones, blood, energy passageways, and everything else that made him up were being transformed into the ultimate type of life force….\u003c/p\u003e\n\u003cp\u003eThat life force was what the Celestial needed, and what was currently rushing toward Du Lingfei….\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was the undying medicine, and Du Lingfei… was the pill furnace that could live forever….\u003c/p\u003e\n\u003cp\u003eAfter that pill furnace sucked in the medicine, it would sacrifice itself, withering up into death to produce… an Undying Live Forever Pill!\u003c/p\u003e\n\u003cp\u003e“Soon,” the Celestial muttered. “Very soon now…. I\u0027ve been waiting my whole life to get this Undying Live Forever Pill….” He began chuckling loudly, his expression twisted and distorted in bizarre fashion as he watched his daughter absorbing Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was shaking violently, and was wracked with unprecedented levels of pain. He had endured much pain to cultivate the Undying Codex, but none of that could even come close to comparing to what he was feeling now.\u003c/p\u003e\n\u003cp\u003eHe was beginning to wither up. His hair was even turning dry and brittle. His Undying Blood began to fade away, and his Undying Bones were turning dull and dark. His Undying Tendons, Undying Flesh, and Undying Skin… were all melting….\u003c/p\u003e\n\u003cp\u003eHe couldn’t struggle or fight back. As he was emptied out, as his life force was sucked away, he slowly began to lose consciousness.\u003c/p\u003e\n\u003cp\u003eHe suddenly thought back to everything he had done in the Wildlands. He thought of Bai Hao, the Giant Ghost King, Mistress Red-Dust and Zhou Yixing…. Then he thought of the River-Defying Sect….\u003c/p\u003e\n\u003cp\u003eHe pictured Li Qinghou, Song Junwan, Master God-Diviner… and so many other faces. They seemed so vivid to him that he was sure he could reach out and touch them.\u003c/p\u003e\n\u003cp\u003e“The River-Defying Sect….” he murmured in a voice that only he and the dead could hear. As he weakened, his hair began to fall out, transforming into dust before it could even touch the surface of the black blood.\u003c/p\u003e\n\u003cp\u003eBy now, he was so withered that he was like a candle flickering on the verge of winking out….\u003c/p\u003e\n\u003cp\u003eHe wasn’t thinking about the River-Defying Sect anymore…. He was thinking about the eastern Lower Reaches… and the Spirit Stream Sect. It was as if all the memories of his life were flowing past him. He saw himself in front of the stone steles of plants and vegetation. He saw himself licking his lips as he eyed some spirit tail chickens….\u003c/p\u003e\n\u003cp\u003eHe saw himself with Big Fatty Zhang. He saw his Master, who had perished before even taking him as an apprentice. He saw Hou Xiaomei. He saw so many things….\u003c/p\u003e\n\u003cp\u003eBy now, he couldn’t breathe. He looked like brittle skin wrapped over dry bones. Rotting patches of death were spreading out to cover him… and his teeth began to fall out. As of this moment, he looked like a desiccated corpse that had been left in the grave for years and years….\u003c/p\u003e\n\u003cp\u003eThe hand on top of his head was like a black hole sucking away at everything that was him, and filling him with a pain that he had already grown used to.\u003c/p\u003e\n\u003cp\u003eThe Undying Codex was now eighty percent extracted from him, and it was the same with his life force. In his fading consciousness, he no longer saw the Spirit Stream Sect, but instead… Mount Hood.\u003c/p\u003e\n\u003cp\u003eOn top of the mountain was a boy who was somehow holding seven or eight axes and cleavers, all at the same time. At the top of the mountain, he tossed the weapons aside… and even as thunder crashed in the sky, he lit a stick of incense.\u003c/p\u003e\n\u003cp\u003eIt was a comical sight that made him want to smile. But he couldn\u0027t control his body, and was thus incapable. Perhaps that was a good thing, considering his current appearance. Smiling would have made him look even more horrifying.\u003c/p\u003e\n\u003cp\u003eAs his consciousness continued to fade, he was fairly certain he could sense his soul beginning to rise up from inside of him, toward an all-consuming vortex….\u003c/p\u003e\n\u003cp\u003eHe only had about ten percent of his life force left…. Cracks had begun to appear on his dried-up skin, to the point where the slightest brush of a hand would likely turn it into ash. It was the same with his five yin organs and six yang organs.\u003c/p\u003e\n\u003cp\u003eThe power of the Undying Codex was now almost completely gone. Only a tiny scrap of it remained in his bones, which caused the faintest glimmer of gold to be visible through the ragged openings in his skin….\u003c/p\u003e\n\u003cp\u003eIn that moment, he saw what would likely be the last image he ever saw…. A child crouched next to a bed, tears streaming down his face. As his parents began to breathe their last breaths, he began to weep, and then to wail….\u003c/p\u003e\n\u003cp\u003e“Xiaochun,” a weak voice murmured, “don’t be afraid….” A cold hand came to rest on his forehead. “Take this stick of incense…. Haven\u0027t you always dreamed of becoming an immortal…? Here, take it….”\u003c/p\u003e\n\u003cp\u003eThe boy looked up through his tears to take the incense. Then, the hand which had moments ago lifted the incense up to him slowly dropped down. The boy’s tears flowed even harder.\u003c/p\u003e\n\u003cp\u003eThe boy remained at the bedside in a daze. Eventually, the neighbors came into the room and carried him out. He saw many sympathetic gazes as his parents’ bodies were carried away…. The boy sat down in a corner, wrapped his arms tightly around his knees, and looked at the incense….\u003c/p\u003e\n\u003cp\u003e“Why do people die…? I… I want to live! I want all the people around me to live…. I want everyone to be happy! I want… to live forever!”\u003c/p\u003e\n\u003cp\u003eThe boy\u0027s voice echoed away into silence inside of Bai Xiaochun’s mind, a figment of eternity….\u003c/p\u003e\n\u003cp\u003eHe felt more tired than he ever had been in his entire life….\u003c/p\u003e\n\u003cp\u003eHowever, in that moment right before his consciousness disappeared… a teardrop fell down onto the parched skin of his arm. As it was absorbed into his skin, it seemed to merge into his rapidly devolving consciousness.\u003c/p\u003e\n\u003cp\u003e“A teardrop….” he murmured. He could sense the bitterness in it. Using his last scrap of energy, he opened his eyes, and could just barely make out… Du Lingfei, struggling against the slave seal. Even if it destroyed her, she was determined to remove her hand from the top of his head! Oh so slowly, her hand began to rise up!\u003c/p\u003e\n\u003cp\u003eThen she spoke in a voice laced with the utmost despair. “Daddy… I beg you….”\u003c/p\u003e\n\u003cp\u003eAlthough her words were spoken softly, they struck the Celestial like lightning. He began to tremble.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1006\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1008\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1007","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
