{"id":46329,"no":1012,"title":"Chapter 1010: Fiery Apocalypse","content":"\u003cp\u003eIt was a voice filled with the deepest faith!\u003c/p\u003e\n\u003cp\u003eIt was a voice filled with fearless madness!\u003c/p\u003e\n\u003cp\u003eIt was a voice that revealed a deep reverence for a Master, the type that could not be erased even by the destruction of the body!\u003c/p\u003e\n\u003cp\u003eHeaven and earth rumbled as flames spread out across the sky of the Wildlands. Cultivators from both sides of the conflict looked up in utter shock, with many of them gasping aloud!\u003c/p\u003e\n\u003cp\u003e“The sky… is on fire?!?!”\u003c/p\u003e\n\u003cp\u003e“The heavens are aflame! How… how could this be happening?!?!”\u003c/p\u003e\n\u003cp\u003e“Look… there’s a person inside that fire!!”\u003c/p\u003e\n\u003cp\u003eThe enormous figure which appeared inside of the flame slowly looked up, fixing his gaze on the distant Heavenspan Sea. As he did, his features became clear to the cultivators down below in the Wildlands.\u003c/p\u003e\n\u003cp\u003eSoon, the savages, soul cultivators, heavenly marquises and heavenly dukes began to cry out in astonishment.\u003c/p\u003e\n\u003cp\u003e“That’s… the Hell-Emperor!!”\u003c/p\u003e\n\u003cp\u003e“The Hell-Emperor!!”\u003c/p\u003e\n\u003cp\u003eAs everyone in the Wildlands reeled in shock, Bai Hao began to speed toward the Heavenspan Sea with mountain-toppling, sea-draining energy radiating around him in the form of the sky-wide sea of fire!\u003c/p\u003e\n\u003cp\u003eThe fire was spectacular to an indescribable degree, to the point where anyone who looked at it would assume that it could burn the entire world to a crisp.\u003c/p\u003e\n\u003cp\u003eAs for the Heavenspan Sea, the incoming fire instantly whipped it up into a frenzy, as though it wished to block its path. However, any such efforts were useless!\u003c/p\u003e\n\u003cp\u003eThe fire closed in from the direction of the Wildlands, covering the entire sky above the Heavenspan Sea. The flames, which contained Bai Hao’s will, then began to rush toward Heavenspan Island!\u003c/p\u003e\n\u003cp\u003eThe sea didn’t seem capable of standing up to the burning heat of the fire, and began to evaporate, releasing boundless energy of heaven and earth.\u003c/p\u003e\n\u003cp\u003eIt was so unprecedentedly strong that it quickly spread out into the entire world, reaching even as far as the Wildlands….\u003c/p\u003e\n\u003cp\u003ePlants suddenly sprouted, and flowers bloomed. Animals roared, and all living things were deeply shaken!\u003c/p\u003e\n\u003cp\u003eHowever, they also felt instinctively uneasy. After all, these levels of spiritual energy were clearly not a natural occurrence. They were more like when a cultivator burned his or her own soul to gain dangerous levels of power!\u003c/p\u003e\n\u003cp\u003eThe Heavenspan Sea was not without end, and as it evaporated and poured incredible spiritual energy out into the world, it did so in a way that couldn’t be replenished!\u003c/p\u003e\n\u003cp\u003eAnd yet… Bai Hao didn’t care about that. He had surpassed the limits of the world by creating twenty-two-colored flame, and had even placed his own soul on the road to sacrifice to do it.\u003c/p\u003e\n\u003cp\u003eAnd there was only one reason for all of that….\u003c/p\u003e\n\u003cp\u003eBai Hao knew that he didn’t have much time to work with!!\u003c/p\u003e\n\u003cp\u003eJust like the evaporation of the Heavenspan Sea, using his own soul to conjure twenty-two-colored flame was a path that could not be returned from. Now that his soul was aflame, it would only be a short period of time before it was burned into nothing. At that point, the twenty-two-colored flame would vanish!\u003c/p\u003e\n\u003cp\u003eTime was of the essence, and therefore, Bai Hao immediately made his move on Heavenspan Island!\u003c/p\u003e\n\u003cp\u003eIf this moment were frozen in time and depicted artistically, the sky would not be visible, nor would the Heavenspan Sea. The only thing visible would be… an endless sea of fire, descending with ultimate madness onto Heavenspan Island!\u003c/p\u003e\n\u003cp\u003eAs of this moment, Heavenspan Island did not exist within the Heavenspan Sea. Instead, it existed within heavenly flame! Its beaches melted, its lands were scorched black, and crevices ripped open everywhere!\u003c/p\u003e\n\u003cp\u003eA roar like that of a furious giant echoed out in all directions as the fire completely engulfed the entire island.\u003c/p\u003e\n\u003cp\u003eMany parts of the island began to explode, sending rock and rubble flying about, which was almost instantly transformed into ash!\u003c/p\u003e\n\u003cp\u003eIt was as if Bai Hao’s plan to save Bai Xiaochun was to simply burn Heavenspan Island completely away!\u003c/p\u003e\n\u003cp\u003eRumbling sounds filled the world as the sea of fire became a huge mouth which consumed Heavenspan Island!\u003c/p\u003e\n\u003cp\u003eThe plants on the island vanished…. Mountains turned bright red and then shattered, the resulting debris instantly becoming ash!\u003c/p\u003e\n\u003cp\u003eThere was little need to mention the beautiful buildings which filled the island. They were burned away within moments. The valuable medicinal plants that had once grown in abundance were destroyed, as was the lake of Heavenspan Sea water, and the waterfall.\u003c/p\u003e\n\u003cp\u003eThankfully, Bai Hao was by nature a kind person, and controlled the fire in a way that spared the special guards, who fled in complete astonishment.\u003c/p\u003e\n\u003cp\u003e“This… this….”\u003c/p\u003e\n\u003cp\u003e“Someone’s attacking Heavenspan Island…?”\u003c/p\u003e\n\u003cp\u003eThere were two old men among the special guards who were actually demigods! They were none other than the famed Heavenspan Island divine guards! And yet even they were completely flabbergasted by this raging fire. They couldn’t even approach the flames, and were forced to watch from a distance as the flames engulfed the island, and rushed specifically toward… the huge statue of the Celestial, his Palace of the Dao!\u003c/p\u003e\n\u003cp\u003eThe two mountains to either side turned bright red, and then exploded into ash. At the same time, the flames engulfed the statue of the Celestial.\u003c/p\u003e\n\u003cp\u003eEveryone watching could see it melt. Within a few breaths of time, the statue which had stood for so many years was reduced to a lump of slag, which then dissolved into ash….\u003c/p\u003e\n\u003cp\u003eThe entire Palace of the Dao… was wiped out of existence!\u003c/p\u003e\n\u003cp\u003eThe moment the Arch-Emperor Dynasty had been driven out of the lands of Heavenspan, this island had become a holy land…. But now, fire rained down from the heavens and wiped it out of existence….\u003c/p\u003e\n\u003cp\u003eOn what was left of the island, many of the flames converged together, revealing… an enormous flame giant, radiating an aura that caused the entire world to tremble!\u003c/p\u003e\n\u003cp\u003eThe giant wore imperial robes made of flame, and a fiery imperial crown. When he spoke, it was in a roar that caused everything in the area to shake violently.\u003c/p\u003e\n\u003cp\u003e“Master, I’m here to save you!”\u003c/p\u003e\n\u003cp\u003eThe special guards were struck to the core, and their minds began to spin out of control.\u003c/p\u003e\n\u003cp\u003eAnd yet, the burning destruction wasn’t over yet!\u003c/p\u003e\n\u003cp\u003eAs the giant roared, the rest of the sea of fire, having destroyed everything on the surface of the island, began to pour into the crevices which had opened up in it!\u003c/p\u003e\n\u003cp\u003eTheir destination was none other than the huge spell formation in the necropolis!\u003c/p\u003e\n\u003cp\u003eThe spell formation was in full operation at the moment. The bones, and the remains of the three Arch-Emperors, had fully melted, and were now part of the spell formation.\u003c/p\u003e\n\u003cp\u003eRoughly half of the black liquid was gone, having turned into countless magical symbols that crawled over Bai Xiaochun and Du Lingfei.\u003c/p\u003e\n\u003cp\u003eAs for the Celestial, he stood there, a vicious expression on his face as he kept his hands locked onto the heads of Bai Xiaochun and Du Lingfei.\u003c/p\u003e\n\u003cp\u003e“Fuse! Fuse!! Fuse, dammit!!!”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun and Du Lingfei were trembling nonstop, and seemed just on the verge… of fusing together….\u003c/p\u003e\n\u003cp\u003eAnd that was when the necropolis began to split apart. It was as if doomsday had arrived! The rock walls began to glow red, and then simply exploded, allowing torrents of fire to burst inside!\u003c/p\u003e\n\u003cp\u003eIt was as if… the world were descending into a fiery apocalypse!\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1009\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1011\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1010","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
