{"id":46338,"no":1021,"title":"Chapter 1019: The Aura Of The Arch-Ancestor!","content":"\u003cp\u003eHis left eye was golden, and his right eye was crystalline!\u003c/p\u003e\n\u003cp\u003eThey were eyes that were no longer pure and innocent!\u003c/p\u003e\n\u003cp\u003eAfter opening, heaven and earth went dim, and the entire world quaked, as if from the hatred contained therein!\u003c/p\u003e\n\u003cp\u003eAs Bai Xiaochun opened his eyes, a blast of wind filled the third level of the city, which rose higher and higher, and then erupted out into the open!\u003c/p\u003e\n\u003cp\u003eThe intensity of the fluctuations caused everyone outside… to be shaken to the core!\u003c/p\u003e\n\u003cp\u003eOn Heavenspan Island, the Blood Ancestor was still fighting the Celestial, but had been seriously injured, and was hovering on the verge of death. But when he felt those fluctuations, he suddenly began to laugh hoarsely.\u003c/p\u003e\n\u003cp\u003e“Heavenspan, you lowlife, do you feel that…?”\u003c/p\u003e\n\u003cp\u003eThe Celestial’s face had already been green and livid, and now, it turned even more unsightly. Turning to look in the direction of Arch-Emperor City, he said a single name through gritted teeth….\u003c/p\u003e\n\u003cp\u003e“Bai Xiaochun….”\u003c/p\u003e\n\u003cp\u003eIn Arch-Emperor City, the Giant Ghost King shivered. Expression flickering with disbelief, he looked down toward the ground, clearly more shaken than he had been when he had detected the death of the gravekeeper.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t the only one to react in such a way. The Spirit Advent King, Nine Serenities King and War Champion King all gasped and looked down at the ground, their expressions those of disbelief.\u003c/p\u003e\n\u003cp\u003eThe Grand Heavenmaster was also shocked, and despite the level of his willpower, couldn’t stop from uttering an exclamation.\u003c/p\u003e\n\u003cp\u003e“This aura….”\u003c/p\u003e\n\u003cp\u003eThe entire world shook as the grayness of death which filled the sky began to swirl into a huge vortex. It was as if the world, in its final death throes, was using its last bit of energy to cry out for the final time….\u003c/p\u003e\n\u003cp\u003eThe demigod patriarchs of the four riversource sects, as well as the divine guards from Heavenspan, were visibly taken aback. All six suddenly felt profoundly uneasy, a feeling which rapidly transformed into terror!\u003c/p\u003e\n\u003cp\u003ePatriarch Starry Sky was especially terrified. Glancing down at the ground in astonishment, he realized that this aura was very familiar to him.\u003c/p\u003e\n\u003cp\u003e“Bai. Xiao. Chun….”\u003c/p\u003e\n\u003cp\u003eMeanwhile, the Arch-Emperor was in the imperial palace, his eyes shining with astonishment. He could sense much better than everyone else that, deep beneath the ground, there were fluctuations… that resonated with the aura of his own blood!\u003c/p\u003e\n\u003cp\u003eIn fact, the intensity of these fluctuations surpassed his own…. To the Arch-Emperor, it seemed completely impossible, and yet… it was happening right here and now!\u003c/p\u003e\n\u003cp\u003eAs the world was shaken, winds screamed in the lower regions of Arch-Emperor City. Bai Xiaochun sat there cross-legged, his eyes open, unmoving. Instead of rising to his feet, he simply took in a long, deep breath.\u003c/p\u003e\n\u003cp\u003eWith that breath, his Undying Live Forever Technique completed the last of its fusion. His cultivation base was now in perfect condition. He was at the peak of the demigod level when it came to his fleshly body, and his cultivation base was in the early Demigod Realm. When those powers merged, his aura seemed ancient and archaic, and so powerful… that the entire world was willing to acquiesce to him!\u003c/p\u003e\n\u003cp\u003eHe felt like… the ruler of the entire world! It felt like… the entire world approved of him!\u003c/p\u003e\n\u003cp\u003eA single thought from him could cause all living things to submit. His gaze could cause mountains and rivers to rise up out of nothing!\u003c/p\u003e\n\u003cp\u003eIt was a level of power Bai Xiaochun had never experienced before. And yet, it didn’t make him happy. Instead, his complicated feelings grew even more gloomy.\u003c/p\u003e\n\u003cp\u003eThis power had come at the sacrifice of Du Lingfei and Bai Hao. In fact, countless other lives in the world had been cast away. Had he been given the choice, Bai Xiaochun would never have chosen to do this.\u003c/p\u003e\n\u003cp\u003eBut the gravekeeper made the choice for him. The gravekeeper had been willing to sacrifice anyone and everyone to accomplish his mission. Therefore, Bai Xiaochun was both grateful, and at the same time, filled with hatred. The emotions he felt were profoundly complicated and conflicted. He was grateful to the gravekeeper for saving his life, and for bestowing incredible good fortune onto him. But that gratitude could not make up for the death of Bai Hao and the misery of Du Lingfei.\u003c/p\u003e\n\u003cp\u003eAnd thus, he was filled with hatred. Hatred at his own powerlessness, and hatred toward the gravekeeper for everything he had done to accomplish his so-called mission. And yet, that hatred could not wipe away his gratitude for having his own life saved, and for being blessed with good fortune. In the end… he could only be battered by complicated and mixed emotions.\u003c/p\u003e\n\u003cp\u003eHowever, in the final analysis, it was Daoist Heavenspan who had truly orchestrated the greatest villainy. And therefore, Bai Xiaochun’s hatred for him towered to the heavens!\u003c/p\u003e\n\u003cp\u003eBai Xiaochun knew that with the gravekeeper having perished… it wouldn’t be long before the entire world crumbled. When that happened… it would truly become an enormous tomb for everyone who lived on it.\u003c/p\u003e\n\u003cp\u003eHe could sense the epic battle being fought on Heavenspan Island… and he could sense the bad condition Arch-Emperor City was in.\u003c/p\u003e\n\u003cp\u003eA long moment passed, and then he spoke in a voice that surpassed heavenly thunder in its intensity. “So many people dead…. Daoist Heavenspan, why… are you still alive?!?!?!”\u003c/p\u003e\n\u003cp\u003eEnergy surging mightily, he slowly stood up!\u003c/p\u003e\n\u003cp\u003eAs he did, the cultivators outside of Arch-Emperor City felt as though earth dragons were writhing beneath the ground. Everyone was so shocked that they didn’t dare to keep fighting; they all began to back away from each other.\u003c/p\u003e\n\u003cp\u003eThey instinctively began to feel terror and dread, regardless of the level of their cultivation base. Even the demigods felt that way!\u003c/p\u003e\n\u003cp\u003eAs the ground quaked, Bai Xiaochun took a step forward!\u003c/p\u003e\n\u003cp\u003eThe instant his foot touched the ground in front of him, he vanished, to appear… in midair above Arch-Emperor City!\u003c/p\u003e\n\u003cp\u003eIn that same moment, the vortex up above began to emit intense rumbling sounds. Even as the world seemed to be descending into the gray of death, multi-colored light erupted out from Bai Xiaochun to shine on everything around him!\u003c/p\u003e\n\u003cp\u003eThis light filled the world, deeply shaking all cultivators. Gasps could be heard as everyone looked up at Bai Xiaochun, their cultivation bases trembling, their souls shaking. Deep within the very being of everyone present, they suddenly felt something tugging at them, as if from within their blood!\u003c/p\u003e\n\u003cp\u003eIt was… reverence for the first generation Arch-Emperor!\u003c/p\u003e\n\u003cp\u003eWithin the imperial palace, the reigning Arch-Emperor trembled, and his eyes began to shine. He more than anyone else could sense that he was not looking at the same Bai Xiaochun that he had seen in the past. This Bai Xiaochun seemed like… the first generation Arch-Emperor!\u003c/p\u003e\n\u003cp\u003e“Arch-Ancestor….”\u003c/p\u003e\n\u003cp\u003eIt was a reverence and respect that came from within his blood! Because of it, the reigning Arch-Emperor immediately… dropped to his knees!\u003c/p\u003e\n\u003cp\u003eAlthough he had been turned into little more than a puppet ruler by the Grand Heavenmaster, and would never have bent the knee to the man, he was now kneeling to Bai Xiaochun! In the past, the only person he would ever have done the same thing to was… the gravekeeper!\u003c/p\u003e\n\u003cp\u003e\u003cspan id\u003d\"footnote-ref-1ce4\"\u003e\u003cspan\u003e“Kui Endao offers greetings, Arch-Ancestor!”\u0026nbsp;\u003c/span\u003e\u003ca href\u003d\"#footnote-1ce4\"\u003e[1]\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAs the Arch-Emperor dropped to his knees, other figures flew up into the air to offer enthusiastic greetings, all of them descendants of the Arch-Emperor bloodline.\u003c/p\u003e\n\u003cp\u003eTheir cries rolled out into Arch-Emperor City, to be heard by the soul cultivators, heavenly marquises, and heavenly dukes…. As they heeded the instinctual calls from their souls, they began to drop down and kowtow to Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003e“Greetings, Arch-Ancestor!”\u003c/p\u003e\n\u003cp\u003e“Greetings… Arch-Ancestor!!”\u003c/p\u003e\n\u003cp\u003eAs the fanatical cries of the soul cultivators filled the air, the Giant Ghost King and his fellow demigods, as well as the six demigods from the lands of Heavenspan, all reacted with open shock. Even they, mighty demigods, felt their souls tugging at them, telling them to do what all of the other cultivators down below were doing.\u003c/p\u003e\n\u003cp\u003eIt was something that was branded into their souls as people of this world, a mark left upon anyone and everyone from the moment they were born. As of this moment, it was telling them that Bai Xiaochun was their emperor!\u003c/p\u003e\n\u003cp\u003eThe power radiating out from Bai Xiaochun’s blood caused their hearts to fill with reverence, and left them totally shaken by the unprecedentedly powerful pressure that weighed down from him.\u003c/p\u003e\n\u003cp\u003eThe Giant Ghost King was the first to react. Bowing deeply, he said, “Greetings, Arch-Ancestor!”\u003c/p\u003e\n\u003cp\u003eNext came the Spirit Advent King, the Nine Serenities King, and then the War Champion King. After that was the Grand Heavenmaster, whose eyes were filled with profound emotion, and deep respect!\u003c/p\u003e\n\u003cp\u003eThere was even more pressure crushing down onto the six experts from the lands of Heavenspan. They trembled both from the pressure of the Celestial, and the instinctual reverence that came from their souls. All six were almost immediately overwhelmed.\u003c/p\u003e\n\u003cp\u003eThey struggled for a long moment, until Bai Xiaochun looked over at them, seemingly connecting to their souls, and filling their reeling minds with waves of shock.\u003c/p\u003e\n\u003cp\u003eAt that point, all of them, even Patriarch Starry Sky, averted their gazes… and bowed in respectful greeting!\u003c/p\u003e\n\u003cp\u003eAs they did, all of the cultivators from the Heavenspan region felt similar prompting from their souls, and began to bow…. Mighty waves of sound filled the entire Wildlands….\u003c/p\u003e\n\u003cp\u003e“Greetings… Arch-Ancestor!!”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun had long dreamed of having so many people looking at him, to have crowds worshipping his glory. But right now… these things gave him no pleasure. He looked around at the groveling masses for a moment, then turned his attention to Heavenspan Island.\u003c/p\u003e\n\u003cp\u003eAlmost immediately, his eyes turned as red as blood, and began to radiate an intense murderous aura. Ignoring everyone else, he blurred into motion, becoming a blast of wind that left even the demigods shaken as he headed toward Heavenspan Island.\u003c/p\u003e\n\u003cp\u003eAs he closed in, he spoke in a voice that battered the ears of everyone in the world, a voice filled with hatred and madness.\u003c/p\u003e\n\u003cp\u003e“Daoist Heavenspan, why… are you still alive?!?!”\u003c/p\u003e\n\u003chr\u003e\n\u003cdiv id\u003d\"footnote-1ce4\"\u003e\n \u003cp\u003e1. In this case “Kui” is the character that I translate into “Arch” in Arch-Emperor. Technically, it\u0027s supposed to be a name. When used as a name, it doesn’t make sense to translate it into \"Arch\". However, in the grand scheme of things, I didn’t want to transliterate it for use in the title and the name of the government. Otherwise we would have the Kui-Emperor, which has no meaning. There is importance in the meaning of this name, and considering that it virtually never gets used as a name, I chose early on to translate it \u003ca href\u003d\"#footnote-ref-1ce4\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1018\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1020\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1019","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
