{"id":46407,"no":1090,"title":"Chapter 1088: So, I\u0027m The Guardian","content":"\u003cp\u003eThe ripples came because Bai Xiaochun was connected to the fan, and were something that no one else but him could notice.\u003c/p\u003e\n\u003cp\u003eIn the sixth level, Li Donghao looked as confident and excited as ever. He was absolutely and completely focused on this next step. Heart filled with hope, he put his foot down!\u003c/p\u003e\n\u003cp\u003e“I\u0027ve been waiting a long time for this!” he chuckled. “All of that work and improvement is for this moment! Only by working hard can you get good results! I’ve finally done it!”\u003c/p\u003e\n\u003cp\u003eHe threw his head back and laughed uproariously, then sighed at the feeling of accomplishment after all the effort he had expended. He felt like he had experienced something completely life-changing in this sixth level, something that would make his future more wonderful than he could imagine.\u003c/p\u003e\n\u003cp\u003e“Next comes the seventh level. A lot of the other demigods are going to be quite shaken by my success. After all… I\u0027m only the second after Preceptor Seadeep to pass the sixth level!” Amidst echoing laughter, he stretched his hands out wide in anticipation of the applause he would receive after being teleported out.\u003c/p\u003e\n\u003cp\u003eHowever, his smile soon grew stiff as he realized that something strange was going on.\u003c/p\u003e\n\u003cp\u003eShocked, he looked around, and found that he was still in the sixth level. “Huh? Why haven’t I been teleported out?”\u003c/p\u003e\n\u003cp\u003eBased on everything he knew and had experienced, he should have been teleported out immediately.\u003c/p\u003e\n\u003cp\u003e“What\u0027s going on?” At this point, he looked down, and his eyes went wide as his mind was battered by massive waves of shock, and no less than 100,000 lightning bolts of astonishment.\u003c/p\u003e\n\u003cp\u003e“This… this….” To his complete and utter astonishment, he found that there was actually a tenth step in front of him!\u003c/p\u003e\n\u003cp\u003eIt looked exactly like the ninth step, and from all points of view, seemed to have always been there. And yet, Li Donghao was absolutely certain that in the past, there had only been nine. In fact, he had talked with others about this level, and it had always revolved around nine steps. But now… there was a tenth!\u003c/p\u003e\n\u003cp\u003e“Could I have discovered some mysterious aspect to this level?” Panting, his uneasy feeling was replaced with one of excitement. Perhaps what was happening wasn’t bad! Perhaps it was fate!\u003c/p\u003e\n\u003cp\u003eHowever, even as he began to get excited, his jaw dropped in utter shock!\u003c/p\u003e\n\u003cp\u003eThere, right in front of his eyes, another step appeared right after the tenth, radiating intense pressure!\u003c/p\u003e\n\u003cp\u003e11. 23. 35. 49. 67. 81…. All the way to 100!\u003c/p\u003e\n\u003cp\u003e“How could this even be possible? 100 steps!?!?” Li Donghao suddenly felt dizzy, as if he might fall over at any moment. The scene playing out in front of him was almost completely absurd, a massive staircase stretching out. Furthermore, the pressure he could sense from the final step was virtually beyond imagination.\u003c/p\u003e\n\u003cp\u003eLi Donghao was trembling, his eyes vacant, as though his mind had collapsed. He seemed completely bowled over by the sight of 100 steps.\u003c/p\u003e\n\u003cp\u003e“How… how could this be happening…?” he mumbled, his face ashen. Even as the massive pressure threatened to overwhelm him, the power of teleportation gripped him, and he was whisked out of the sixth level.\u003c/p\u003e\n\u003cp\u003eWhen he reappeared, he was back in the main square!\u003c/p\u003e\n\u003cp\u003eBecause of the massive blow he had just taken, as soon as he appeared, he coughed up a massive mouthful of blood and staggered backward, his face completely overtaken by shock and disbelief. As of this moment, his previous confidence was absolutely gone.\u003c/p\u003e\n\u003cp\u003e“This is impossible…” he murmured. “How could this be happening…? There were only nine steps before….”\u003c/p\u003e\n\u003cp\u003eHe actually didn’t believe what he had just seen, and was convinced that it was all an illusion. He even went to some of his demigod compatriots from the Vile-Emperor Dynasty to ask them their opinion.\u003c/p\u003e\n\u003cp\u003eGrabbing one of them by the arm, he asked, “Fellow Daoist Xu, um… how many steps are in the sixth level?”\u003c/p\u003e\n\u003cp\u003eWhen the man saw how bloodshot Li Donghao’s eyes were, he was quite taken aback.\u003c/p\u003e\n\u003cp\u003eThe demigod hesitated for a moment, then said, “Uh, nine. Why, what’s wrong, Li Donghao?”\u003c/p\u003e\n\u003cp\u003eLi Donghao’s mind was spinning, and he began to pant. He quickly hurried over to another demigod who was stuck in the sixth level, and asked the same question.\u003c/p\u003e\n\u003cp\u003e“Nine!”\u003c/p\u003e\n\u003cp\u003e“Um, nine. Everybody knows that, it’s not a big secret or something.”\u003c/p\u003e\n\u003cp\u003e“What are you doing, Li Donghao? Do you really need to ask things like that? Just go look for yourself!”\u003c/p\u003e\n\u003cp\u003eLi Donghao was trembling violently by now, and felt completely and utterly humiliated. At the same time, he was getting angry.\u003c/p\u003e\n\u003cp\u003e“Nine? All of you? Why…? Why do I have a hundred!?!?”\u003c/p\u003e\n\u003cp\u003eBack within the level, he had been unsure, but now he was convinced that the damaged fan hated him! And that filled him with profound despair.\u003c/p\u003e\n\u003cp\u003ePeople were shocked to hear the information from Li Donghao, and were a bit suspicious. However, most of them assumed that the levels would occasionally become more difficult for some unknown reason.\u003c/p\u003e\n\u003cp\u003e“Ah, Li Donghao got really unlucky…. The levels probably don’t change very often, he just happened to be in there when it happened.”\u003c/p\u003e\n\u003cp\u003e“We’d better hurry. You never know when those hundred steps could appear in our version….”\u003c/p\u003e\n\u003cp\u003eOff in the distance, Bai Xiaochun was listening in. Of course, he had witnessed everything firsthand. And the truth was that even Bai Xiaochun was not confident in being able to handle a hundred steps like that.\u003c/p\u003e\n\u003cp\u003eAt first, he was actually shocked by what had occurred.\u003c/p\u003e\n\u003cp\u003eBut then, his heart filled with joy!\u003c/p\u003e\n\u003cp\u003e“I… I just thought about the level getting harder, and it did! A hundred steps appeared!” His eyes began to glitter brightly at the realization that a huge door had just been opened in front of him.\u003c/p\u003e\n\u003cp\u003e“So, now that I\u0027ve successfully taken control of twenty percent of the fan, it means I can alter the first twenty levels!\u003c/p\u003e\n\u003cp\u003e“Heavens, how stupid of me! I don’t even need to think about how to pass the first twenty levels!\u003c/p\u003e\n\u003cp\u003e“Considering the powers I have to control the level of difficulty… fudge! I\u0027m like a god in this place!!\u003c/p\u003e\n\u003cp\u003e“My original goal wasn’t to make things easy for myself, it was to prevent others from passing the twentieth level. Once this trial by fire ends… I\u0027m going to come out in first place!!”\u003c/p\u003e\n\u003cp\u003eAll of a sudden, this mission to the damaged fan seemed much more interesting than it had been before.\u003c/p\u003e\n\u003cp\u003e“Hahaha! I\u0027m basically the guardian of this fan! I need to prevent everyone else from succeeding!” With his new mission having been made clear, he stuck his chin up and then sighed. Around this time, he could sense that Celestial Virūpākṣa had passed the seventeenth level.\u003c/p\u003e\n\u003cp\u003eNot even stopping, he then proceeded on to the eighteenth!\u003c/p\u003e\n\u003cp\u003e“So fast!?!?” Bai Xiaochun murmured, shocked. However, a sly smile quickly spread out on his face.\u003c/p\u003e\n\u003cp\u003e“Virūpākṣa, you villain. I absolutely hate cheaters like you. Well, if you make it past the eighteenth level, then I’ll change my name to match yours!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1087\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1089\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1088","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
