{"id":46410,"no":1093,"title":"Chapter 1091: I’ll Add Some More!","content":"\u003cp\u003eWhat was most infuriating was that Celestial Virūpākṣa had somehow figured out a way to bring Prince Ur-Demon and Reverend Devourer with him into one of the fan ribs. The three of them had teamed up to challenge the eighteenth level!\u003c/p\u003e\n\u003cp\u003eApparently, Celestial Virūpākṣa’s experiences in the fan allowed him to identify a loophole that not even Bai Xiaochun was aware of. As soon as that enormous celestial-level head appeared in the desert, they cut it down!\u003c/p\u003e\n\u003cp\u003eAfter easily passing the level, the group of three used the same method to get through the nineteenth level. As of this moment, they were already in the twentieth level!\u003c/p\u003e\n\u003cp\u003eThankfully, the twentieth level was significantly harder than the previous levels. The three celestials were fighting a type of minotaur-like monster. Whether it was in terms of speed or fleshly body strength, the minotaurs were far superior to Celestial Virūpākṣa and his companions.\u003c/p\u003e\n\u003cp\u003eIn addition, these were male minotaurs, all of them huge in size and violent in temperament!\u003c/p\u003e\n\u003cp\u003eThe vast plane that made up the twentieth level was filled with their thunderous grunts and howls.\u003c/p\u003e\n\u003cp\u003eIt went without saying that the minotaur monsters were extremely intelligent, and didn’t need to perform incantation gestures to unleash magical techniques. They were innately able to utilize various divine abilities, which manifested in the form of yellow halos of light that shot at rapid speed toward Celestial Virūpākṣa and the other celestials.\u003c/p\u003e\n\u003cp\u003eAny of them who got hit by one of the halos would be shaken all the way down to their soul.\u003c/p\u003e\n\u003cp\u003eAny demigod cultivators in this situation would be defeated instantly, and then teleported out of the level. In fact, even celestials on their own would have had trouble. Only by teaming up in a group of three were they able to hold their own.\u003c/p\u003e\n\u003cp\u003eApparently, this twentieth level was a watershed mark, and therefore, was extremely difficult. In terms of the difficulty, none of the previous levels could even come close.\u003c/p\u003e\n\u003cp\u003eThe only person who might have had a chance was Bai Xiaochun, with his incredible powers of regeneration.\u003c/p\u003e\n\u003cp\u003eAnother factor that played into it was that these monsters were things that didn’t exist in the Eternal Immortal Domains.\u003c/p\u003e\n\u003cp\u003eClearly, they were native to whatever world the owner of this fan had come from!\u003c/p\u003e\n\u003cp\u003eBecause of how difficult the level was, Celestial Virūpākṣa and his companions were not able to simply pass through the level. If they had, then Bai Xiaochun would have awoken to find them further along.\u003c/p\u003e\n\u003cp\u003eAs Bai Xiaochun watched them fighting, he came to the conclusion that it would be very dangerous if they passed this level. Besides, he had worked extremely hard to acquire some level of authority over the fan, and there was no way he would just hand it over to someone else.\u003c/p\u003e\n\u003cp\u003e“It seems I really was too kind before. Alright, Virūpākṣa, you codger. You may be dead set on cheating, but I simply can’t allow it! Trying to compete with me in cheating? Want to see how badly I’ll torment you? Fudge! Bai Xiaochun hates nothing more in life than cheaters!” Not having time to concern himself with any of the other cultivators in the various challenges, he focused all of his mental energy on the three celestials from the Vile-Emperor Dynasty.\u003c/p\u003e\n\u003cp\u003eThere really was no way that he could possibly allow them to succeed in their effort. Calling upon his connection to the fan, he sent some divine sense into the twentieth level to set the difficulty level as high as it would go!\u003c/p\u003e\n\u003cp\u003eHe held nothing back, and did not hesitate at all. Instantly, the air around the three celestials began to ripple and distort.\u003c/p\u003e\n\u003cp\u003eCelestial Virūpākṣa and his companions were in the middle of fighting ten of the minotaur monsters. The fighting was fierce, and intense booms filled the air, causing the three celestials’ eyes to flash.\u003c/p\u003e\n\u003cp\u003e“I have the feeling that if we can get past this level,” Celestial Virūpākṣa said with a growl, “then the levels after that will be much easier. As for who gets the legacy in the end, it will depend on luck!”\u003c/p\u003e\n\u003cp\u003eOne of the reasons that Celestial Virūpākṣa managed to figure out the loophole in the levels was because of his status as Top Contender. More importantly, the damaged fan was incomplete, which influenced the levels within it.\u003c/p\u003e\n\u003cp\u003eAfter figuring out the secret, he made an agreement with the other two about how to go through the levels. At the moment, Prince Ur-Demon was laughing proudly, and even the cold-faced Reverend Devourer was having a hard time concealing his excitement. Although these minotaur monsters were very strong, all three of them were sure that, in the end, they would defeat every last one of them.\u003c/p\u003e\n\u003cp\u003eAlthough their level of cooperation couldn’t be described as perfect, they had all known each other for many years, and had worked together before. Celestial Virūpākṣa acted as the muscle, Reverend Devourer provided backup with divine abilities, and Prince Ur-Demon used the power of his spell formations to defend them as a group. Although they experienced setbacks throughout the battle, they still fought with skill and efficiency.\u003c/p\u003e\n\u003cp\u003eBy now, the minotaur monsters were clearly running out of energy. Once they faltered, the three celestials would make their move and wipe them out.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun chuckled coldly. Earlier, he had been a bit nervous about adjusting the difficulty levels. But now he didn\u0027t feel nervous at all. Besides, he could sense that after his previous struggle with the spirit automaton of the fan, his own level of control had improved.\u003c/p\u003e\n\u003cp\u003eFurthermore, his divine sense was telling him that he now had the power to delay the activation of the teleportation function in the challenges….\u003c/p\u003e\n\u003cp\u003e“I wonder how long I can delay it…?” he thought, licking his lips. After a moment, he rubbed his bag of holding, and an evil glint passed through his eyes.\u003c/p\u003e\n\u003cp\u003eMeanwhile, back in the challenge, the ten minotaur monsters finally collapsed, indicating that Celestial Virūpākṣa, Reverend Devourer and Prince Ur-Demon had met the requirements and finished the challenge.\u003c/p\u003e\n\u003cp\u003e“We did it!” Celestial Virūpākṣa said, smiling. Prince Ur-Demon and Reverend Devourer were both quite excited. However, as the three of them waited to be teleported out, a great weight suddenly pressed down on them from above.\u003c/p\u003e\n\u003cp\u003e“That aura….” Celestial Virūpākṣa was the first to feel uneasy, considering what he had experienced before. Backing up, he shouted, “Something strange is going on again!”\u003c/p\u003e\n\u003cp\u003eIt was only at this point that Prince Ur-Demon and Reverend Devourer sensed the same pressure filling the twentieth level.\u003c/p\u003e\n\u003cp\u003eFaces flickering, they also started backing up. That was when rumbling sounds rolled out in all directions as monstrous figures began to materialize up above!\u003c/p\u003e\n\u003cp\u003e1.\u003c/p\u003e\n\u003cp\u003e10.\u003c/p\u003e\n\u003cp\u003e50….\u003c/p\u003e\n\u003cp\u003eSoon there were 100 minotaur monsters, all of them bursting with violence and energy as they stared at the three celestials. Then, howling, they charged forth in attack.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, the lands were shaking, and the nearby mountains were trembling. Celestial Virūpākṣa’s face fell, and both Prince Ur-Demon and Reverend Devourer were left gasping.\u003c/p\u003e\n\u003cp\u003e“Dammit, Virūpākṣa! Didn’t you say that nothing like this would happen?!”\u003c/p\u003e\n\u003cp\u003e“Ten of these minotaur monsters were exhausting enough, and now we have to deal with a hundred?!?!” It wasn’t that Prince Ur-Demon and Reverend Devourer weren’t willing to go all out in their fighting. But they had barely been able to defeat the minotaur monsters from before. And now, just when they had gotten their hopes up that things were over, they suddenly realized how wrong they had been.\u003c/p\u003e\n\u003cp\u003eAs the celestials backed up, the minotaur monsters charged through the air toward them, and Bai Xiaochun chuckled coldly.\u003c/p\u003e\n\u003cp\u003e“Think you can just run? If a hundred aren’t enough, then I’ll add some more!” Gritting his teeth, he decided that he absolutely had to kill Celestial Virūpākṣa’s momentum. Otherwise, the next time the fan’s spirit automaton came back to struggle for control, he would definitely take advantage of the moment to pass the twentieth level.\u003c/p\u003e\n\u003cp\u003eHaving made his decision, Bai Xiaochun followed through!\u003c/p\u003e\n\u003cp\u003eRumbling sounds filled the twentieth level as, to the utter shock and madness of Celestial Virūpākṣa, Reverend Devourer and Prince Ur-Demon, more minotaur monsters began to rise up from the grass around them. One after another, they howled with passion as they charged!\u003c/p\u003e\n\u003cp\u003eEven the powerful Celestial Virūpākṣa felt his scalp tingling on the verge of exploding.\u003c/p\u003e\n\u003cp\u003e“Heavens….”\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1090\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1092\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1091","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
