{"id":46421,"no":1104,"title":"Chapter 1102: He\u0027s Bai Xiaochun","content":"\u003cp\u003eJust outside of one of the main gates of the capital city….\u003c/p\u003e\n\u003cp\u003eEveryone stood dumbstruck, unable to believe their eyes. There Bai Xiaochun stood, looking like some kind of divine spirit, causing everyone to forget to breathe.\u003c/p\u003e\n\u003cp\u003eIt had been shocking enough to see his one palm knock several Nascent Soul guards down only moments ago. At that point, they had assumed that he was some wandering master. Then another palm forced the deva expert to kneel, causing them to gasp with the realization that this young man was actually a powerful expert!\u003c/p\u003e\n\u003cp\u003eSubsequently, another palm forced five devas and a host of Nascent Soul experts to kneel, and the crowd was flabbergasted. At that point, they had assumed that Bai Xiaochun was a demigod. Never could they have imagined that he was actually a celestial…. After all, celestials were not a common thing. In all of the Eternal Immortal Domains, there were only twelve!\u003c/p\u003e\n\u003cp\u003eMore shockingly, this person only needed one palm to deal with Marquis Zi Lin’s attack!\u003c/p\u003e\n\u003cp\u003eThe sight of Marquis Zi Lin and all of the other powerful experts kneeling in front of the city gate caused the onlookers’ minds to simmer on the verge of exploding. They felt like they were being struck by a million lightning bolts, until their minds went blank…. None of them dared to even think. What was happening right in front of them was so profoundly shocking that they would never forget it for the rest of their lives!\u003c/p\u003e\n\u003cp\u003eAt this point, the deva in charge of the gate muttered something, tearful words spoken as if in the ultimate despair. Because of the deathly silence that filled the air, his muttered words echoed like thunder into the ears of the already stunned audience, causing many of them to gasp.\u003c/p\u003e\n\u003cp\u003e“Ce… celestial….”\u003c/p\u003e\n\u003cp\u003eIt took only a moment for the silence to be broken, replaced by a massive commotion.\u003c/p\u003e\n\u003cp\u003e“How is this even possible!?!?”\u003c/p\u003e\n\u003cp\u003e“Am I dreaming? Is this a hallucination? Am I actually looking at a celestial?!?!”\u003c/p\u003e\n\u003cp\u003eThe gathered group of kneeling cultivators were all trembling, and some of the weaker ones, those in Core Formation, were so terrified that they simply passed out.\u003c/p\u003e\n\u003cp\u003eMarquis Zi Lin’s subordinates were so terrified their faces were as white as sheets, and they were soaked with sweat. Merely being looked at by Bai Xiaochun filled them with unprecedented levels of terror, and infinite regret.\u003c/p\u003e\n\u003cp\u003e“He’s… he’s a celestial….”\u003c/p\u003e\n\u003cp\u003e“Dammit! If he’s a celestial, why didn’t he say so earlier!? Why’d he have to do it this way!?!?”\u003c/p\u003e\n\u003cp\u003eThey all felt like they were about to go mad. However, the one who was taking it worst of all was Marquis Zi Lin. His face was currently so red it was turning magenta, and the bitterness he felt in his heart knew no end.\u003c/p\u003e\n\u003cp\u003ePerhaps some in the audience were still unconvinced, and believed Bai Xiaochun to simply be in the great circle of the Demigod Realm. But having actually been struck by Bai Xiaochun’s palm, Marquis Zi Lin was absolutely certain what level of cultivation base he was dealing with.\u003c/p\u003e\n\u003cp\u003eOnly a celestial would be able to so easily deal with a group of Nascent Soul cultivators, devas and demigods. With one casual move, he forced all of them to kneel before him on the ground!\u003c/p\u003e\n\u003cp\u003eNow that he knew the level of Bai Xiaochun\u0027s cultivation base, he didn’t even need to put any thought into the matter to figure out who he was.\u003c/p\u003e\n\u003cp\u003eAfter all, it had only been a few months since the Saint-Emperor appointed King Heavenspan, Bai Xiaochun, as the second celestial to be stationed in the second immortal domain. Furthermore, Marquis Zi Lin had personally seen all of the other celestials in the Saint-Emperor Dynasty. Bai Xiaochun was the only one he had never laid eyes on.\u003c/p\u003e\n\u003cp\u003eAfter putting all of the pieces of the puzzle together, Marquis Zi Lin’s heart nearly shattered. He felt like he had just swallowed a whole cupful of bile, making him as bitter as bitter could be, inside and out.\u003c/p\u003e\n\u003cp\u003eSmiling bitterly, he gritted his teeth and, being unable to feel or move his legs, clasped hands and said, “I, Zi Lin… offer greetings, King Heavenspan!”\u003c/p\u003e\n\u003cp\u003eAs soon as the words left his mouth, the babbling of the crowd ceased. All eyes turned to fall on Bai Xiaochun. Silence prevailed for a short moment, and then the hubbub began again.\u003c/p\u003e\n\u003cp\u003e“King Heavenspan? He’s… Bai Xiaochun!?!?”\u003c/p\u003e\n\u003cp\u003e“The eleventh celestial!? Bai Xiaochun!?”\u003c/p\u003e\n\u003cp\u003e“Bai Xiaochun from the Heavenspan Realm!?!?”\u003c/p\u003e\n\u003cp\u003eMeanwhile, Bai Xiaochun stood there looking at the people all lined up and kneeling in front of him. Inside, he sighed, thinking about how he really had a lot of progress to make in keeping a low profile.\u003c/p\u003e\n\u003cp\u003eBut these people just had to go and refuse him entry. If that had been all there was to the matter, he might have been able to accept it. But then they attacked him. That was what got him really angry.\u003c/p\u003e\n\u003cp\u003eIt was no surprise to him to hear Marquis Zi Lin saying his name out loud. In fact, Bai Xiaochun would have found it odd if the man didn’t finally realize who he was.\u003c/p\u003e\n\u003cp\u003eGlaring at the man, he said, “So, you \u003cem\u003edo\u003c/em\u003e know who I am. And you attacked me anyway? Well, you’ve certainly got some guts, don’t you, Marquis Zi Lin?” It was all thanks to this Marquis Zi Lin that his plan of keeping a low profile had been completely ruined. If only he had come a bit earlier or a bit later, then none of this would have happened.\u003c/p\u003e\n\u003cp\u003e“Please, quell your anger, King Heavenspan….” Marquis Zi Lin wanted to explain things, but he knew that in this moment, all he could do was bow his head. At the same time, hatred for Bai Xiaochun took root in his heart, although he didn’t dare to reveal that.\u003c/p\u003e\n\u003cp\u003e“You celestials…” he thought, “always toying with people like me….” Although Marquis Zi Lin felt profoundly unlucky, the deva responsible for this gate felt even more unlucky. To him, it was like the entire world had been turned upside down, and all he could do was stare pleadingly at Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eIt was at around this time that the people in the city who had received the distress messages approached. Before they even arrived, their voices rang out by the city gate.\u003c/p\u003e\n\u003cp\u003e“Who is it that wishes to die!?”\u003c/p\u003e\n\u003cp\u003e“How dare you try to invade the capital city! What outrageous gall!”\u003c/p\u003e\n\u003cp\u003e“Get on your knees immediately!!”\u003c/p\u003e\n\u003cp\u003eThere were eight in total, five men and three women, all of whom were in the great circle of the Deva Realm. When they saw the host of people kneeling on the ground, their anger burned, but soon they noticed that one of those people was Marquis Zi Lin. At that point, they each felt like a bucket of cold water had been poured on their heads. They began to tremble, and immediately lurched to a halt and backed up a bit. Eventually, they caught sight of Bai Xiaochun, whereupon the shock in their eyes grew greater.\u003c/p\u003e\n\u003cp\u003eFrowning, Bai Xiaochun looked up at the eight new arrivals, and tried to decide whether or not to drag them down and make them kneel too. Even as he pondered what to do, the eight devas shot backward, and simultaneously pulled out and crushed jade slips.\u003c/p\u003e\n\u003cp\u003eSubsequently, a massive, majestic divine sense swept out from the city.\u003c/p\u003e\n\u003cp\u003eIt was like a tempest that could shake the heavens and topple the earth, that could crush anything and everything in the area! It made the devas seem like ants, and the demigods like dogs.\u003c/p\u003e\n\u003cp\u003eAll of the cultivators in the capital city were shaken to the core, and began to tremble as their cultivation bases were suppressed.\u003c/p\u003e\n\u003cp\u003eIt was the same with everyone at the gate, including Marquis Zi Lin, who began to shake visibly. As a direct descendant of Celestial Aged Spirit, how could Marquis Zi Lin not recognize this divine sense? As for everyone else, it wasn\u0027t difficult for them to guess its origin. In the capital city, there was only one person on this level!\u003c/p\u003e\n\u003cp\u003eThe entire world shook as everyone bowed their heads.\u003c/p\u003e\n\u003cp\u003eHowever… Bai Xiaochun stood apart. He simply looked into the capital city, toward the source of the divine sense. Clearly, the person who had sent it out was not happy. Sighing, Bai Xiaochun said, “Well met, Fellow Daoist Aged Spirit.”\u003c/p\u003e\n\u003cp\u003eTen breaths of time passed. Finally, a cold voice echoed out into heaven and earth.\u003c/p\u003e\n\u003cp\u003e“Your way of making an entrance is quite out of the norm, Fellow Daoist Bai. Men, go escort King Heavenspan, Bai Xiaochun, into the city!”\u003c/p\u003e\n\u003cp\u003eEach of Celestial Aged Spirit’s words echoed like heavenly thunder, shaking the entire city. And in response, several beams of light shot up into the air.\u003c/p\u003e\n\u003cp\u003eWithin those beams were ten demigod experts stationed in the capital city, and all of them shot directly toward the city gate!\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1101\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1103\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1102","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
