{"id":46515,"no":1198,"title":"Chapter 1196: The Other Half Of The Fan","content":"\u003cp\u003eBai Xiaochi was visibly stunned. He might have taken Bai Xiaochun’s words to be mere ravings, except for the fact that his divine sense was actually connecting to the sovereign’s arm!\u003c/p\u003e \n\u003cp\u003eThat connection seemed completely and utterly inconceivable.\u003c/p\u003e \n\u003cp\u003e“He’s… he’s just a celestial! He\u0027s not even an archaean. And yet he’s actually connecting to that sovereign’s arm!!” He almost couldn’t believe his eyes. Despite the fact that he had sensed the sovereign’s aura influencing Bai Xiaochun’s cultivation over the years, he still couldn’t wrap his mind around what was happening.\u003c/p\u003e \n\u003cp\u003e“What secret is he hiding!?!?”\u003c/p\u003e \n\u003cp\u003e“Could it have something to do with the fact that he\u0027s from the Eternal Immortal Domains…? Maybe he….” Bai Xiaochi’s eyes went even wider than they had been before. He hadn’t thought much of the Eternal Immortal Domains, but as of this moment, he couldn’t help but recall… a legend that his previous master had spoken of!\u003c/p\u003e \n\u003cp\u003eEven as the spirit automaton stood there shaken, Bai Xiaochun’s divine sense connected fully to the sovereign’s arm, and he began to pour his thoughts into it.\u003c/p\u003e \n\u003cp\u003eWhat had previously been only a vague outline of the arm now became clearer, and he began to absorb it into his mind!\u003c/p\u003e \n\u003cp\u003eIt was very similar to the way that he had meditated on the face of the beast statue in the Spirit Stream Sect all those years ago.\u003c/p\u003e \n\u003cp\u003eTime began to pass. One year. Three years. Five years….\u003c/p\u003e \n\u003cp\u003eBefore long, ten years had passed!\u003c/p\u003e \n\u003cp\u003eDuring that decade, Bai Xiaochun didn’t move. He was completely immersed in his pursuit of enlightenment. Although he hadn’t fused with the sovereign’s arm completely, his understanding of it was becoming drastically more complete!\u003c/p\u003e \n\u003cp\u003eEventually, Bai Xiaochun emerged from his trance, and when he did, his eyes shone with light that struck Bai Xiaochi down to his very soul.\u003c/p\u003e \n\u003cp\u003eAs of this moment, Bai Xiaochun was emanating an aura that Bai Xiaochi could not possibly mistake for anything else, weak as it was!!\u003c/p\u003e \n\u003cp\u003e“The aura of a sovereign!!” he said with a gasp.\u003c/p\u003e \n\u003cp\u003eIgnoring Bai Xiaochi’s shock, Bai Xiaochun slowly rose to his feet and looked down at his right arm. His eyes glittered with the light of augury for a long moment, and then he clenched his hand into a fist!\u003c/p\u003e \n\u003cp\u003eAs he did, an enormous, shadowy emperor appeared behind him, clad in imperial robes and wearing an imperial crown. As for his facial features, they were an exact match for Bai Xiaochun’s!\u003c/p\u003e \n\u003cp\u003eThe Undying Emperor’s Fist!\u003c/p\u003e \n\u003cp\u003eHowever… this emperor was different from the emperors that had appeared in the past…. His right arm did not match the rest of his body. It looked… exactly like the sovereign’s wolf-like arm!!\u003c/p\u003e \n\u003cp\u003eEverything down to the bones, the flesh, and the blood were all exactly like the sovereign’s, and it radiated a sovereign aura that made it seem vastly more powerful than before!\u003c/p\u003e \n\u003cp\u003eIt was an aura that could shake celestials and archaeans alike!\u003c/p\u003e \n\u003cp\u003eThis was what Bai Xiaochun had gained after ten years of meditation. He had incorporated the sovereign’s arm into his Undying Emperor’s Fist, fusing the two together! Clenching his hand into a fist, he punched out into the air!\u003c/p\u003e \n\u003cp\u003eInstantly, the sovereign aura erupted, filling the void with dazzling light, and sending a massive tempest of wind out across the damaged fan…. Any celestial or archaean who saw this… would be shaken to the core!\u003c/p\u003e \n\u003cp\u003eThe fan itself trembled, and Bai Xiaochi’s eyes bulged on the verge of popping out of his skull.\u003c/p\u003e \n\u003cp\u003e“He actually did it….”\u003c/p\u003e \n\u003cp\u003eBai Xiaochun looked down at his new right arm, and softly said, “From now on, my Undying Emperor’s Fist is going to be called… the Undying Sovereign’s Fist!\u003c/p\u003e \n\u003cp\u003e“It combines the power of my Sutra of Former Reincarnation and my Sutra of Present Life and Death. It will be a trump card that I can use to fight archaeans!” Eyes flickering with determination, he flew off of the sovereign’s arm and back to the Daoist Tower of Life and Death. There, he sent his divine sense out, anticipation burning in his heart.\u003c/p\u003e \n\u003cp\u003eZhou Zimo and Song Junwan were still asleep. However, much of the color had been restored to their faces, indicating that much of their Life Essence had been restored. Bruiser was similarly recovering well. As for Song Que, he looked exactly the same as he had before, prompting a light sigh from Bai Xiaochun.\u003c/p\u003e \n\u003cp\u003eAt this point, his eyes flickered with cold light as he waved his hand, producing a faintly glimmering soul from his bag of holding.\u003c/p\u003e \n\u003cp\u003eIt was the Vile-Prince’s soul, which had long since lost self-awareness, and didn’t even have the power to struggle against Bai Xiaochun as he held it.\u003c/p\u003e \n\u003cp\u003e“How could I possibly allow you to die a quick death?” All of his time up to this point had been focused on reaching the late Celestial Realm and creating his Undying Sovereign’s Fist. Up to now, he hadn’t had any spare time to deal with the Vile-Prince!\u003c/p\u003e \n\u003cp\u003e“You like switching bodies, right? And puppets?” Eyes shining with merciless anger, he waved his hand, causing an array of materials to fly out from the damaged fan, which he rapidly transformed into a puppet to put the Vile-Prince’s soul in.\u003c/p\u003e \n\u003cp\u003eAt that point, the Vile-Prince regained some of his self-awareness, and after realizing that he was now trapped in a puppet body, looked up in terror at Bai Xiaochun.\u003c/p\u003e \n\u003cp\u003e“How dare you do this to me, Bai Xiaochun! My father the emperor will never let you get away with it! He\u0027s definitely going to find you!!”\u003c/p\u003e \n\u003cp\u003e“Your father the emperor? Hmph. The emperor is no longer your father. But don\u0027t worry, I\u0027m still your enemy.” Performing an incantation gesture with his right hand, he forced the puppet-form Vile-Prince to dance wildly in front of the huge tower, just as the prince’s puppets had been forced to do back in the imperial palace.\u003c/p\u003e \n\u003cp\u003eThose puppets had lost their lives to perform that dance, and the Vile-Prince had lost his soul to perform his. As he danced wildly, his terror mounted. After all, the wildness of his dance was causing his soul to slowly disperse. Clearly… he was being killed in the same way that he had tormented his own victims!\u003c/p\u003e \n\u003cp\u003e“That’s bullcrap!” he suddenly blurted. “What do you mean the emperor isn’t my father?!”\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBai Xiaochun simply snorted coldly and started walking away. He would let the Vile-Prince dance his way into death, as his soul dispersed.\u003c/p\u003e \n\u003cp\u003e“You like dancing, don’t you?” he said over his shoulder. “Dance away.”\u003c/p\u003e \n\u003cp\u003e“No! This can’t be happening. Let me go, Bai Xiaochun. I won’t ever bother you again, I promise. I guarantee it….” Unfortunately for him, his pleas fell on deaf ears. Bai Xiaochun’s hatred for him simply ran too deep.\u003c/p\u003e \n\u003cp\u003eAnd thus, the Vile-Prince danced madly for nine days. At that point, the puppet body continued to dance, but his soul was almost completely faded away. He almost had no self-awareness left. On the tenth day… he danced into death, and his soul dispersed.\u003c/p\u003e \n\u003cp\u003eAt that point, the materials which had made up his puppet body stopped moving, and then collapsed onto the ground….\u003c/p\u003e \n\u003cp\u003eBai Xiaochun watched from a distance, with Bai Xiaochi standing at his side, more terrified than ever.\u003c/p\u003e \n\u003cp\u003e“Death cannot wipe out your crimes!” Bai Xiaochun said through gritted teeth, his hatred still festering in his heart. Finally, he stood up and went over to collect the materials that had once made up the puppet body. Even as he did, Bai Xiaochi’s face suddenly flickered dramatically, and he flew up off the surface of the fan to look out into the void.\u003c/p\u003e \n\u003cp\u003eRumbling fluctuations rose up which caused the damaged fan to tremble, and suddenly change directions of its own volition.\u003c/p\u003e \n\u003cp\u003e“The other half of the fan!” Bai Xiaochi shouted excitedly. “The other half!”\u003c/p\u003e \n\u003cp\u003eJaw dropping, Bai Xiaochun left the fan face and appeared on one of the ribs. Looking out into the void, he saw a glowing light off in the distance, rushing toward them at high speed.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1195\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1197\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1196","bookId":1496,"creation":"Sep 10, 2019 2:52:11 AM","modification":"Sep 10, 2019 2:52:11 AM"}
