{"id":45525,"no":208,"title":"Chapter 206: Dazzlingly Ferocious Reputation!","content":"\u003cp\u003eBy now, evening had fallen, and the moon hung high in the sky. Outside the Blood Stream Sect, that moon appeared as white as ever, but looking at it from inside the sect, it was crimson.\u003c/p\u003e\n\u003cp\u003eBlood-colored light bathed the sect, making it look even more grim and sinister than before.\u003c/p\u003e\n\u003cp\u003eDisciples from other sects would shake in fear at such a sight, but Bai Xiaochun had been in the Blood Stream Sect for long enough that he’d grown used to it.\u003c/p\u003e\n\u003cp\u003eHe was currently walking along a moonlit mountain path. Everything around him lay in waste. The ground and trees were destroyed, the immortal\u0027s caves collapsed. However, it was very quiet. News about Bai Xiaochun’s battle during the day on Middle Peak had already begun to spread like wildfire through the rest of the sect.\u003c/p\u003e\n\u003cp\u003eIn the Blood Stream Sect, the law of the jungle prevailed, and people only showed respect to the powerful.\u003c/p\u003e\n\u003cp\u003eDuring that spectacular fight, Bai Xiaochun had showed a brutal strength, a madness, a bloodthirstiness that struck everyone deep into their hearts. He alone had stood up to dozens of Foundation Establishment cultivators, and had even killed seven or eight of them. It was a rare thing even in the Blood Stream Sect, and to many people, Bai Xiaochun had already become the stuff of nightmares.\u003c/p\u003e\n\u003cp\u003eNot a single person suspected that he wasn’t a Blood Stream Sect disciple, and if anyone had dared to make such an accusation, no one would have believed them....\u003c/p\u003e\n\u003cp\u003e“I really don’t like fighting and killing....” Bai Xiaochun thought, sighing. After returning to his immortal\u0027s cave and finding that it had been completely destroyed, he sat down off to the side and decided that tomorrow, he would go pick a new immortal\u0027s cave.\u003c/p\u003e\n\u003cp\u003eThe night passed uneventfully....\u003c/p\u003e\n\u003cp\u003eHowever, the cultivators of Middle Peak sat in the darkness, hearts pounding with fear. The events during the day were truly like a nightmare, and all of them feared that Bai Xiaochun would come for retribution. They sat restlessly in their immortal\u0027s caves, spell formations active. There were even some who fled Middle Peak altogether.\u003c/p\u003e\n\u003cp\u003eOf course, word rapidly spread about the madness on Middle Peak, and Bai Xiaochun’s violent outburst. Some of the Foundation Establishment cultivators on Lesser Marsh Peak, Nameless Peak, and Corpse Peak had personally witnessed the event, whereas others only heard about it after the fact. All of them were shocked.\u003c/p\u003e\n\u003cp\u003e“He personally fought back against dozens of Foundation Establishment cultivators?”\u003c/p\u003e\n\u003cp\u003e“He actually defied the orders of a patriarch?”\u003c/p\u003e\n\u003cp\u003e“Everyone just stood by and watched while he killed eight people?!?! The survivors were forced to hide together behind a spell formation?!”\u003c/p\u003e\n\u003cp\u003eWord spread like mad through the four mountain peaks of the Blood Stream Sect.\u003c/p\u003e\n\u003cp\u003eEven the Inner Sect disciples on the back of the hand soon caught wind of Bai Xiaochun’s actions. All of them were astonished. People had already come to view him as a bloodthirsty fiend, and now, the Inner Sect disciples could only imagine a variety of terrifying images regarding what had occurred.\u003c/p\u003e\n\u003cp\u003e“Nightcrypt is incredible! He ripped people apart, then drank their blood as he killed the other bystanders!!”\u003c/p\u003e\n\u003cp\u003e“I heard he’s not even a cultivator. He’s actually an evil, green-skinned hobgoblin in disguise!”\u003c/p\u003e\n\u003cp\u003e“He has superhuman strength! A single bump from him can shake an entire mountain!”\u003c/p\u003e\n\u003cp\u003eAll sorts of rumors began to spread. It only took a single night before countless people in the Blood Stream Sect learned about a new person that nobody could provoke, a person named Nightcrypt!\u003c/p\u003e\n\u003cp\u003eAt dawn, Bai Xiaochun opened his eyes and went to take a walk. By that time, word about him had spread throughout the sect. Even the Outer Sect disciples had heard the stories. In fact, the disciples used various methods to spread the word, and it wasn’t long before the cultivator clans in the area had heard the tales.\u003c/p\u003e\n\u003cp\u003eIt was easy to imagine how quickly the other major sects would learn of Nightcrypt’s name....\u003c/p\u003e\n\u003cp\u003eIt went without saying that the news spread faster in the Blood Stream Sect than it would have in the Spirit Stream Sect. After all, the Blood Stream Sect disciples always walked around on edge to begin with, and never had much entertainment. Coupled with the fervor they felt toward powerful experts, it ensured that they were always very interested in newly risen Chosen.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun almost immediately came to experience that himself. Whenever Foundation Establishment cultivators saw him coming, their expressions would flicker. Those who hadn’t participated in the fighting the day before would smile broadly and clasp hands in greeting.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was moved. Now that he had proven himself, he finally got the same feeling he did when he walked around in the Spirit Stream Sect. His initial reaction was to smile and nod back to them in greeting.\u003c/p\u003e\n\u003cp\u003eHowever, in response to his smile, the other Foundation Establishment cultivators’ eyes would go wide with disbelief. Many of them would even subconsciously take a few steps back, hesitant expressions on their faces.\u003c/p\u003e\n\u003cp\u003eAt first, Bai Xiaochun was shocked. But then he put on a cold demeanor and stared icily at them, and the Foundation Establishment cultivators would sigh in relief. To them, that expression seemed much more befitting of Nightcrypt.\u003c/p\u003e\n\u003cp\u003e“I’m such a good person....” Bai Xiaochun thought to himself, sighing inwardly. Having no other option, he maintained a cold, indifferent expression, glaring here and there. That earned him much more respect.\u003c/p\u003e\n\u003cp\u003eAs he walked along, his eyes started to get tired from all the glaring. Eventually, he reached the pavilion where he could select a new immortal\u0027s cave. The old man who had previously treated him with cool indifference suddenly rushed out and offered greetings.\u003c/p\u003e\n\u003cp\u003eWhen he realized that Bai Xiaochun had come to choose an immortal\u0027s cave, he was at first shocked, but then quickly changed his attitude. Eyes burning with passion, he produced a scroll map and opened it to show Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003e“Junior Brother Nightcrypt, what do you think about this one? This immortal\u0027s cave has wonderful surroundings, and the blood qi there is incredible!\u003c/p\u003e\n\u003cp\u003e“Or what about this one? A prime elder once lived there! I usually don’t point that out to anyone....\u003c/p\u003e\n\u003cp\u003e“There’s also this place? If I remember, there are a few puppets that come with that one.”\u003c/p\u003e\n\u003cp\u003eAlthough Bai Xiaochun was moved by the old man’s passionate introduction to the immortal’s cave, his face remained icy and ruthless. Eventually, he frowned. Although the open immortal\u0027s caves were better than his old destroyed one, they still weren’t as good as the ones with a lot of blood qi.\u003c/p\u003e\n\u003cp\u003eSeeing Bai Xiaochun frowning, the old man seemed like he wanted to say something, then hesitated. He looked at Bai Xiaochun for another moment, then thought about the fight from the day before.\u003c/p\u003e\n\u003cp\u003eFinally, he gritted his teeth and lowered his voice. “Junior Brother Nightcrypt, you don\u0027t need to come here to select an immortal\u0027s cave.”\u003c/p\u003e\n\u003cp\u003e“Huh?” Bai Xiaochun blinked thoughtfully.\u003c/p\u003e\n\u003cp\u003eDeciding to make things more clear, the old man lowered his voice further. “Remember, in the Blood Stream Sect, we respect the strong and powerful. Many people don’t officially select immortal\u0027s caves, they just take them. If you see one you like, kick the old owner out, and it becomes yours.”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun’s eyes began to shine brightly. The truth was that he had lived for so long in the Spirit Stream Sect that, deep inside, he wasn’t at all like the Blood Stream Sect people. Sometimes it was hard to think the way they did. Otherwise, he wouldn\u0027t have needed the old man to remind him.\u003c/p\u003e\n\u003cp\u003eClearing his throat, he maintained his icy exterior, and nodded coolly to the old man. Then he swished his sleeve and turned to leave. Inside, he was filled with the excitement that came from being able to violate a taboo.\u003c/p\u003e\n\u003cp\u003eThe old man watched Bai Xiaochun leaving, and sighed. As far as he was concerned, it was a big pity that Nightcrypt was only in Mortal-Dao Foundation Establishment. Otherwise, he might have had an extraordinary future. Of course, even though he was merely in Mortal-Dao Foundation Establishment, he was still a brutal fiend who couldn’t be provoked.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun walked along, feeling more and more excited, his heart pounding as he looked around.\u003c/p\u003e\n\u003cp\u003e“What a feeling. I can just take whatever I like? Nothing matters except that I\u0027m stronger, so I can have whatever I want....” He licked his lips in anticipation. This was something that could never happen in the Spirit Stream Sect. It was like finally being able to eat forbidden fruit. He scoured Middle Peak for half a day, and around noontime identified an immortal\u0027s cave he liked. It was rather large, and the grounds around it were covered with blood trees. It was almost like a whole world unto itself.\u003c/p\u003e\n\u003cp\u003eThe blood trees all had faces on them, and although their eyes were closed, they seemed completely sinister and bizarre, the type that would strike fear into the hearts of anyone who got near them.\u003c/p\u003e\n\u003cp\u003eIn fact, the only path leading to the door had been overrun by the sinister blood trees. Even from a distance, it was possible to see the faint blood mist that filled the area.\u003c/p\u003e\n\u003cp\u003eJust barely visible through the blood trees was a blood cistern with dense blood qi. The area was paved with limestone, and there were some refined corpses wearing suits of armor who stood guard.\u003c/p\u003e\n\u003cp\u003eNext to the cistern was the entrance to the immortal\u0027s cave, a huge white door that was carved with intricate spell formations. The spell formations were currently active, flickering with bright light that ensured that the entire area was shielded.\u003c/p\u003e\n\u003cp\u003eLooking at the scene, Bai Xiaochun licked his lips, and his eyes began to shine.\u003c/p\u003e\n\u003cp\u003e“What a great location....”\u003c/p\u003e\n\u003cp\u003eHe had secretly absorbed blood qi from this location in the past, and vaguely remembered that it was Master God-Diviner’s immortal\u0027s cave. He had asked imposter Nightcrypt, and learned that Master God-Diviner was only in the early Foundation Establishment stage, but as he was very adept at divination and augury, he was very important to the sect.\u003c/p\u003e\n\u003cp\u003eIn the Lone Hell Pocket Realm, he had reached Earthstring Foundation Establishment, but had only achieved a few Tideflows. Even still, it was enough to set him on the path to fame in the Blood Stream Sect.\u003c/p\u003e\n\u003cp\u003eTherefore, it was no surprise that he had occupied such a nice immortal\u0027s cave for such a long time.\u003c/p\u003e\n\u003cp\u003eEyes shining, Bai Xiaochun sped forward toward the immortal\u0027s cave. As he neared, faces on the blood trees opened their eyes, which shone with killing intent.\u003c/p\u003e\n\u003cp\u003eHowever, as soon as they recognized Bai Xiaochun, they began to scream in high pitched voices.\u003c/p\u003e\n\u003cp\u003e“Nightdevil is here!!”\u003c/p\u003e\n\u003cp\u003e“It’s Nightdevil!!”\u003c/p\u003e\n\u003cp\u003e“Heavens! Nightdevil is here for revenge. Master, save me!!”\u003c/p\u003e\n\u003cp\u003eInside the immortal\u0027s cave, Master God-Diviner gritted his teeth. He both hated and feared Bai Xiaochun, and when he thought about the brutal events from the previous day, he was sure that Bai Xiaochun had come to get revenge. Then he heard the voices crying out from the outside, and his eyes went wide.\u003c/p\u003e\n\u003cp\u003e“Sure enough, he’s here!!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-205\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-207\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-206","bookId":1496,"creation":"Sep 10, 2019 2:52:08 AM","modification":"Sep 10, 2019 2:52:08 AM"}
