{"id":45639,"no":322,"title":"Chapter 320: Eternal Parasol!","content":"\u003cp\u003eFeeling like he had no other choices at hand, Bai Xiaochun proceeded onward, step by step. Eventually, he lost track of exactly how many steps he’d taken. Thankfully, his cultivation base was in late Foundation Establishment, and his seventh spiritual sea was on the very cusp of being fully crystallized. Because of that, his spiritual power reserves were deep, allowing him to hold his breath for very long periods of time.\u003c/p\u003e\n\u003cp\u003eMost important of all was his powerful fleshly body. Despite the stinging sensation and the acrid odor, he was able to grit his teeth and proceed onward.\u003c/p\u003e\n\u003cp\u003e“Worst case scenario, I just wait to be saved. That old dragon might fear death, but he’ll definitely inform the patriarchs of what happened....” He couldn’t believe he was so unlucky, and at the same time, his hatred for the little turtle grew even stronger.\u003c/p\u003e\n\u003cp\u003eCursing the entire way, he proceeded deeper. Every once in awhile, he saw the corpses of various animals that were apparently difficult for the toad to digest. Some of the bones had been dissolved down until they were pitch black, but still refused to melt completely. Bai Xiaochun shuddered.\u003c/p\u003e\n\u003cp\u003e“I don’t want to become a skeleton....” he murmured, hurrying forward. He didn’t want to stay in this place for even a moment longer than necessary.\u003c/p\u003e\n\u003cp\u003eAs he walked along, the little turtle suddenly stuck his head out of his bag of holding. Looking around, he blurted, “Wow, you really ended up inside here!”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun’s eyes bulged with madness, and his hand shot down to grab him. However, the little turtle ducked his head back into the bag of holding, and Bai Xiaochun grabbed nothing but air.\u003c/p\u003e\n\u003cp\u003e“Get out from inside there!” Bai Xiaochun roared, shoving his hand into his bag of holding.\u003c/p\u003e\n\u003cp\u003eThe turtle chuckled coldly. “You think I’ll come out just because you tell me to? What do you take Lord Turtle to be, a complete blockhead? I\u0027m not going anywhere!”\u003c/p\u003e\n\u003cp\u003e“Y-y-you....” Bai Xiaochun rifled angrily through his bag of holding, but was unable to find a trace of him.\u003c/p\u003e\n\u003cp\u003eTears began to well up in his eyes. He truly couldn’t handle this situation anymore. The little turtle was just too good at causing disasters. Every time he provoked terrifying entities, Bai Xiaochun ended up feeling like he was going to get killed. “I’m sorry.... Lord Turtle... if things keep going like this, I’m going to end up dead thanks to your games.”\u003c/p\u003e\n\u003cp\u003e“Well, considering you’re being so well-behaved, Lord Turtle will give you some good fortune. You do what I tell you, and you might find something very interesting in this place.” The turtle slowly stuck its head out of the bag of holding, but only by a little bit. Bai Xiaochun almost tried to grab him, but knew that the little turtle was always completely on guard, making it difficult to succeed. Sighing, he decided to follow the little turtle’s directions. After going back and forth for awhile, they reached a wall of flesh in a very remote location.\u003c/p\u003e\n\u003cp\u003e“This is the place. Alright, come on, hurry up! This is one of the weakest spots here. Use as much strength as you can to break open a hole. This is the place I remember noticing when I was strolling around before. There’s a treasure buried here!” The little turtle immediately got excited.\u003c/p\u003e\n\u003cp\u003e“Buried treasure?” Bai Xiaochun said, a look of shock appearing on his face.\u003c/p\u003e\n\u003cp\u003e“You heard me!” the turtle said, sighing. “It\u0027s a good thing Lord Turtle had nothing better to do than get you swallowed by this big toad. It’s just too bad that you didn’t get swallowed by that golden crocodile. It had a treasure inside of it too.”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun looked dejectedly at the wall of flesh in front of him, then gritted his teeth and began to rotate his cultivation base. The power of his spiritual seas surged, and the image of a heavenly demon appeared behind him. When his cultivation base was at its highest level, he howled and then lashed his right hand out with lightning-like speed. At the same time, his thumb and index finger closed in on each other as he used the Throat Crushing Grasp.\u003c/p\u003e\n\u003cp\u003eA boom rumbled out, and a crack opened up in the spot the little turtle had indicated. The body of the toad trembled, and then twitched, causing a rain of acid to splash about inside of it.\u003c/p\u003e\n\u003cp\u003eThe acid was very powerful, and the bits that landed onto Bai Xiaochun caused white smoke to rise up into the air. It actually hurt quite a bit. The acid started to build up to the point where Bai Xiaochun wasn’t sure how much longer he could hold on. Soon it was up to his ankles, like a rising tide. Screaming, he continued to unleash powerful attacks.\u003c/p\u003e\n\u003cp\u003e“Faster, faster,” the turtle urged. “Come on!”\u003c/p\u003e\n\u003cp\u003e“You’re doing great, Bai Xiaochun. You can do it!”\u003c/p\u003e\n\u003cp\u003e“I support you!”\u003c/p\u003e\n\u003cp\u003eThe little turtle continued to shout out encouragement until Bai Xiaochun couldn’t take it anymore and yelled, “Shut up...!”\u003c/p\u003e\n\u003cp\u003eAfter unleashing quite a few attacks, the crack opened up wide enough that he was able to grab the sides with his hands and rip it open even further.\u003c/p\u003e\n\u003cp\u003eA crevice was torn open wide enough for Bai Xiaochun to fit through. There was no time for contemplation. The acid was rising dangerously high, and his entire body hurt. Without any hesitation, he dove into the crack.\u003c/p\u003e\n\u003cp\u003eHe was now in a tunnel, and surprisingly, the walls were made, not from flesh, but rather, stone. Even more surprising was that there was no acidic aroma anymore, but instead, a delicate fragrance that felt quite refreshing.\u003c/p\u003e\n\u003cp\u003eEven as he looked around in surprise, the little turtle flew out of his bag of holding, an excited expression on his face.\u003c/p\u003e\n\u003cp\u003e“Hahaha! Lord Turtle has finally dusted off the old tools of the trade. This is incredible. Come on, let’s see what treasure there is to be had....” Eyes shining, the little turtle shot down toward the end of the tunnel, which opened up into a small stone chamber!\u003c/p\u003e\n\u003cp\u003eBai Xiaochun hurried along. After entering the stone chamber, he looked around in astonishment. It was roughly 300 meters in diameter, and was surrounded by what appeared to be countless red and green vines that bored into and out of the stone itself.\u003c/p\u003e\n\u003cp\u003eThe red and green vines were very thick, and were all wriggling and writhing. Closer examination revealed that they were most likely part of the toad’s body.\u003c/p\u003e\n\u003cp\u003e“This place....” Bai Xiaochun murmured. He looked down toward the middle of the stone chamber, and noticed a stone dais, upon which was a jade slip and a black parasol. He quickly realized that the fragrant aroma was coming from the parasol.\u003c/p\u003e\n\u003cp\u003e“There really is treasure hidden here!”\u003c/p\u003e\n\u003cp\u003eBefore he could examine the area any further, the little turtle’s eyes began to shine, and he said, “Now this is impressive. Someone used a powerful divine ability to get this giant toad under control right before it reached the level of a beast king. Not only did that person manage to slow its progress toward becoming a beast king, he converged all of the toad’s nerves into this location. It\u0027s not quite a magical sealing, but it\u0027s almost the same. It brought the toad under control, and basically turned it into a mobile immortal\u0027s cave!!\u003c/p\u003e\n\u003cp\u003e“Unfortunately, that parasol is only half-completed. Some accident must have befallen the owner of this immortal\u0027s cave before he finished his work. Otherwise the toad would have eventually become a beast king. Hm, methods like these, controlling a beast king, turning it into an immortal\u0027s cave, using its life force to extend one’s own.... Those are all the methods of the ancient cultivators of the Dao of the devils!”\u003c/p\u003e\n\u003cp\u003eAs the little turtle flew excitedly around the immortal\u0027s cave looking around, Bai Xiaochun’s heart began to pound. Although he didn’t quite understand everything the little turtle was talking about, his final words were completely astonishing.\u003c/p\u003e\n\u003cp\u003e“A cultivator from ancient times? That could control a beast king...?” Bai Xiaochun wasn’t completely unfamiliar with beast kings. Bruiser was a battle beast who had the potential to become a beast king in the future. Although he wasn’t fully in the beast king level, he could already control countless other battle beasts, enough to shake an entire sect.\u003c/p\u003e\n\u003cp\u003eAs Bai Xiaochun took a breath to calm himself, the little turtle landed in front of the stone dais in the middle of the immortal\u0027s cave. As he looked at the jade slip and the black parasol, his eyes shone with an intense glow.\u003c/p\u003e\n\u003cp\u003e“Hurry up and see what\u0027s written on that jade slip, kid. It’s definitely going to explain who did all of this. Maybe there’s even a teleportation technique in there to get us out of here. If so, we can leave right now.”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun walked nervously over to the jade slip. After a bit of hesitation, he leaned over to look at it more closely, and when he was sure it was safe, he picked it up and poured some spiritual power inside. Instantly, an ancient voice spoke in his mind.\u003c/p\u003e\n\u003cp\u003e“The ancestor wisheth to wage war, and assist I shall. I will likely meet my downfall. This parasol doth be named Eternal. Were the parasol to be completed, it would be a heaven-tier spirit weapon.\u003c/p\u003e\n\u003cp\u003e“This beast is named Blueland, and it doth be a natural-born traitor. Only if thee possess the power of a Deva can thee control it. If thy cultivation base doth not suffice, use my technique to absorb the beast’s life force, and raise thine own!”\u003c/p\u003e\n\u003cp\u003eThe voice faded away, and then the technique for absorbing the beast\u0027s life force appeared in Bai Xiaochun’s mind. He put the jade slip down. Feeling a bit dazed, he looked over at the parasol, and then his eyes began to shine brightly.\u003c/p\u003e\n\u003cp\u003e“After it\u0027s complete, it will be a heaven-tier spirit weapon? A spirit weapon!? The treasures which make up the reserve powers of entire sects are called heaven-tier!?” Panting, he stepped forward and picked up the black parasol.\u003c/p\u003e\n\u003cp\u003eThe instant he touched it, the parasol began to glow with flickering light, and a blast of cold air spread out from it. Bai Xiaochun felt almost like he was being frozen in place, as though his blood were solidifying. A sensation of deadly crisis filled him, and yet, he fought it under control. However, he was unable to open the parasol. Eyes shining, he looked at it and then started laughing.\u003c/p\u003e\n\u003cp\u003eHowever, picking up the parasol had apparently opened a magical seal. Suddenly, the entire immortal\u0027s cave began to tremble, and a muffled roar could be heard outside the immortal\u0027s cave. At the same time, intense pressure began to weigh down.\u003c/p\u003e\n\u003cp\u003eApparently, the huge toad had detected what was going on, and was doing everything it could to crush the immortal\u0027s cave into dust!\u003c/p\u003e\n\u003cp\u003eMassive rumbling sounds echoed out, along with cracking sounds. The tunnel outside of the immortal\u0027s cave collapsed, and massive amounts of acid flooded in, along with a noxious odor. The immortal\u0027s cave couldn’t hold on much longer, and began to collapse. Bai Xiaochun was trembling, and the pressure weighing down on him caused his knees to tremble, and blood to ooze out of the corners of his mouth.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-319\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-321\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-320","bookId":1496,"creation":"Sep 10, 2019 2:52:09 AM","modification":"Sep 10, 2019 2:52:09 AM"}
