{"id":45641,"no":324,"title":"Chapter 322: Trifling Toad Monster","content":"\u003cp\u003eThe toad wanted to fight back, but all it could do was roar in frustration. As the gravitational force continued to suck away at its life force, it let out a miserable shriek and withered down even more....\u003c/p\u003e\n\u003cp\u003eAs that happened, Bai Xiaochun’s ninth spiritual sea reached a state of ninety percent crystallization. With ten percent more, he would reach the great circle of Foundation Establishment, a level of power vastly greater than before. It was in that moment that…\u003c/p\u003e\n\u003cp\u003eHis tenth heavenly demon fully formed!\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, the ten heavenly demons superimposed, instantly becoming a blurry field of mist.\u003c/p\u003e\n\u003cp\u003eThe mist seethed and roiled, sending out terrifying fluctuations; apparently, a completely awe-inspiring Dharma incarnation was forming!\u003c/p\u003e\n\u003cp\u003eThen, a magical halo of fire appeared within the mist, a fire that seemed to contain infinite screaming souls.\u003c/p\u003e\n\u003cp\u003eBeneath the fiery halo, two red dots appeared that looked like eyes. Only half a moment later, though, two more red eyes appeared next to the first two. Then a third pair appeared!\u003c/p\u003e\n\u003cp\u003eFrom the look of it, the figure within the mist had three heads!\u003c/p\u003e\n\u003cp\u003eWithin the following short few breaths of time, two enormous, pitch-black arms stretched out from inside the mist. However, things weren’t over yet. A second pair of arms appeared, and then a third! After that was a black suit of armor!\u003c/p\u003e\n\u003cp\u003eThe image which was forming was something that seemed powerful enough to prop up heaven and earth, a figure of incomprehensible power!\u003c/p\u003e\n\u003cp\u003eIt had three heads and six arms, and radiated terrifying might. This was none other than the manifestation of the Undying Asura Body!\u003c/p\u003e\n\u003cp\u003eBai Xiaochun shook as his fleshly body power skyrocketed. He was now vastly stronger than he had been before, and when he opened his eyes, they shone so brightly that they could surpass the light of the sun and the moon!\u003c/p\u003e\n\u003cp\u003eIt was in the moment that his eyes opened that his soul seemed to return. Pulling the Eternal Parasol out of the toad’s flesh, and thus ending the absorption of life force, he blurred into motion. Howling, he reached out, tore a huge opening in the wall, and shot out into the open!\u003c/p\u003e\n\u003cp\u003eAs he flew up into the air, he probed his cultivation base and saw that it was only a hair away from the great circle of Foundation Establishment. Then he confirmed that he had upgraded from the Heavenly Demon Body to the Asura Body, whereupon elation filled his heart.\u003c/p\u003e\n\u003cp\u003eThe huge toad was now completely emaciated and panting for breath. Before, it could have easily defeated Bai Xiaochun, but now that much of its life force had been sucked away, it could do little more than gasp and look pleadingly at Bai Xiaochun, as if begging for mercy.\u003c/p\u003e\n\u003cp\u003eFear had truly gripped its heart. Earlier, it had completely ignored Bai Xiaochun’s suggestion, and had hoped to take him by surprise and kill him, and thus completely change its own fate. But now, the only emotions in its eyes as it looked at Bai Xiaochun were supplication and terror.\u003c/p\u003e\n\u003cp\u003eThat was especially true when it looked at the black parasol he held, the mere sight of which left the toad trembling.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun felt a bit bad for the toad. Sighing, he said, “I mentioned in the beginning that we could have worked things out, but you decided to bully me. Like I said, when I attack, I frighten even myself. Still don’t believe me?”\u003c/p\u003e\n\u003cp\u003eHe shook his head and sighed even more deeply at how much of a straightforward and upright person he was. Whenever he attacked people, he always gave them a warning, but sadly, no one ever believed him.\u003c/p\u003e\n\u003cp\u003eEven as he prepared to sigh some more, several beams of light appeared off in the distance. Heart thumping, and having no time to ponder his next action, he quickly performed an incantation gesture with his right hand and then pointed his finger at the toad. Trying to look as threatening as possible, he stuck his chin up and coolly said, “How dare you, mister invincible, unsurpassable toad monster! You think you can fight with me, Bai Xiaochun? Hmmmphhh! Well, do you surrender or not!?”\u003c/p\u003e\n\u003cp\u003eIn almost the same moment, the patriarchs and legacy echelon cultivators burst onto the scene, and saw the shocking sight of the withered toad.\u003c/p\u003e\n\u003cp\u003eThe toad didn’t look huge and impressive like before. It looked almost like a mere pile of skin, lying there gasping for breath, its eyes shining with terror as it looked at the person standing in front of it....\u003c/p\u003e\n\u003cp\u003eThat look in its eyes seemed to be one of complete and utter dread.\u003c/p\u003e\n\u003cp\u003eAs for the person standing in front of the toad, it was none other than Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eWhen they heard Bai Xiaochun’s words, the newcomers exchanged dismayed, even confused, glances. They had rushed over here from distant locations with the intention of rescuing Bai Xiaochun. How could they ever have imagined that a scene like this would meet them upon their arrival?\u003c/p\u003e\n\u003cp\u003eLi Qinghou was dumbstruck, and the legacy echelon cultivators were left gasping. Even the patriarchs’ jaws had dropped.\u003c/p\u003e\n\u003cp\u003eA look of incredulous disbelief could be seen on the face of the Heavenhorn ink dragon. The sight of the emaciated toad seemed completely unbelievable, to the point where the dragon was starting to question whether it had made a mistake in judgment earlier.\u003c/p\u003e\n\u003cp\u003eAfter a moment of silence, the founding patriarch looked over at Heavenhorn. “Heavenhorn, um... are you sure this is the toad you mentioned earlier?”\u003c/p\u003e\n\u003cp\u003e“I....” mumbled the Heavenhorn ink dragon. After a moment of contemplation, it was sure that this was the same huge toad. However, the scene playing out before them seemed completely unbelievable. The dragon couldn’t help but look over at Bai Xiaochun, reverence rising up in its heart.\u003c/p\u003e\n\u003cp\u003ePretending that he’d just noticed the new arrivals, Bai Xiaochun turned his head to look at them. His veins of steel were pulsing, his murderous aura roiling out in all directions. Clasping hands and bowing, he coolly said, “Greetings, Patriarchs. I very much appreciate your expression of goodwill. However, I, Bai Xiaochun, have already vanquished this unbeatable toad monster!”\u003c/p\u003e\n\u003cp\u003eStrange looks appeared on everyone’s faces. Clearly, they knew he was showing off, and yet there was nothing they could say by way of retort. They began to smile wryly as they realized that, apparently, Bai Xiaochun was never going to truly grow up.\u003c/p\u003e\n\u003cp\u003e“How did you do this?” the founding patriarch asked. He could see that the toad’s cultivation base really was at the late Nascent Soul stage, perhaps even in the great circle. It was actually very close to being in the Deva Realm.\u003c/p\u003e\n\u003cp\u003e“I was born with the power of the gods,” Bai Xiaochun replied, clasping his hands behind his back and sticking his chin up. “As someone who has reached Heavenstring Foundation Establishment, I can shake the heavens. I called countless bolts of Heaven-Dao lightning down upon this creature, seriously injuring it. The only reason I showed it mercy in the end was because I pitied it.” His casual tone mixed with the words he spoke caused everyone present to wish they could give him a good smack across the face.\u003c/p\u003e\n\u003cp\u003eEven Li Qinghou felt the same way. Seeing Bai Xiaochun show off like this left him chuckling wryly inside.\u003c/p\u003e\n\u003cp\u003e“Patriarchs and other Fellow Daoists, thank you for coming to save me. I was injured in the process, and yet single-handedly defeated this unsurpassable monster. Even still, your expression of friendship will forever be inscribed upon my heart. To return the favor, allow me to present this monster as a gift to the sect!” With that he flicked his sleeve.\u003c/p\u003e\n\u003cp\u003e“After all, with the snap of a finger, I, Bai Xiaochun, can reduce any kind of beast to ashes....”\u003c/p\u003e\n\u003cp\u003eThe founding patriarch’s cheek twitched. He really couldn’t take any more of this. With a final glare at Bai Xiaochun, he looked over at the toad. Inside, he was delighted. Waving his hand, he collected the toad into his bag of holding. Although the toad’s vital energy had been seriously damaged, with time and rest, it would recover, and could prove to be another powerful spirit beast guardian for the Spirit Stream Sect.\u003c/p\u003e\n\u003cp\u003eThere was even a bit of beast king aura left on the toad. The patriarchs were delighted. They could sense its life force had recently been drained away, but they didn\u0027t say anything.\u003c/p\u003e\n\u003cp\u003eAlthough they had their suspicions, they kept them to themselves. As for the legacy echelon cultivators, they all approved. When a disciple acquired good fortune, it belonged to that disciple. If others in the sect tried to steal it away, it would lead to discord within the sect.\u003c/p\u003e\n\u003cp\u003eBesides, Bai Xiaochun was the junior patriarch. Not even Nascent Soul masters would go overboard in dealing with a person like that.\u003c/p\u003e\n\u003cp\u003eSoon, the group was on their way back, and Bai Xiaochun was in their midst looking exactly like a lonely hero. Of course, inside, he was bursting with joy!\u003c/p\u003e\n\u003cp\u003e“So,” he thought, “this place really did turn out to have some good fortune. Excellent. Very excellent. I guess I won’t get rid of the little turtle after all. Perhaps he will lead to more good fortune in the future.” Although he felt completely pleased, he suddenly recalled what the Heavenhorn ink dragon had done, and looked over at it with a glare.\u003c/p\u003e\n\u003cp\u003eHeavenhorn’s heart trembled. It had been able to tell earlier that ninety percent of the toad’s life force had been drained away, and that fact left the dragon trembling in fear. It wasn\u0027t sure what secret method Bai Xiaochun had used to accomplish such a task. Regardless, it was a terrifying thing. Now, an ingratiating expression could be seen on its face when it looked at Bai Xiaochun. Actually, its behavior earlier was quite similar to how Bai Xiaochun himself would have acted....\u003c/p\u003e\n\u003cp\u003eBai Xiaochun nodded magnanimously at the dragon. It was in that fashion that the group returned to the entrance, flew through the vortex, and found themselves back in the Spirit Stream Sect.\u003c/p\u003e\n\u003cp\u003eAfter everyone emerged, the vortex vanished, and the Heavenhorn ink dragon sank back down into the chasm to stand guard.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-321\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-323\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-322","bookId":1496,"creation":"Sep 10, 2019 2:52:09 AM","modification":"Sep 10, 2019 2:52:09 AM"}
