{"id":45671,"no":354,"title":"Chapter 352: Come On In, Elder Brother Bai","content":"\u003cp\u003e\u003cstrong\u003eChapter 352: Come On In, Elder Brother Bai\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBai Xiaochun looked over at Xu Baocai, and could see that he was clearly a bit irritated. Bai Xiaochun blinked a few times, then glanced at Big Fatty Zhang, whose eyes were glowing with admiration. Big Fatty Zhang even reached out and clasped Bai Xiaochun’s shoulder.\u003c/p\u003e\n\u003cp\u003e“Go on, Xiaochun. Afterward, you’ll truly have grown up....”\u003c/p\u003e\n\u003cp\u003eCoughing dryly, Bai Xiaochun tossed the handkerchief into his bag of holding, then swished his sleeve and grandly announced, “You think I’ll go just because she wants me to? Hell no!”\u003c/p\u003e\n\u003cp\u003eThat only seemed to make all the surrounding onlookers admire him even more. However, what no one noticed was that, even as he threw the handkerchief into his bag of holding, a profound light flickered deep in his eyes.\u003c/p\u003e\n\u003cp\u003eXu Baocai was in a bad mood for the rest of the day. Sometime in the afternoon, after Bai Xiaochun returned to his immortal\u0027s cave, Xu Baocai finally started to spread the news about Chen Manyao’s amorous date proposal to Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eThe gossip spread even faster than before, like a tempest that swept through all four divisions. The matter with the love letters was like a mere ticking timebomb, whereas Chen Manyao was the spark that caused it to explode.\u003c/p\u003e\n\u003cp\u003eThe four divisions were thrown into a complete uproar. Cries of shock and astonishment filled the air everywhere.\u003c/p\u003e\n\u003cp\u003e“What!?!? I can’t believe Chen Manyao is wooing Bai Xiaochun!!”\u003c/p\u003e\n\u003cp\u003e“Th-this... this is just crazy! Who cares if all those other girls gave him love letters. Why did my beloved Junior Sister Chen have to go and do the same thing!?”\u003c/p\u003e\n\u003cp\u003e“This can’t be true!”\u003c/p\u003e\n\u003cp\u003e“What!? They’re going to ‘hang out’ in her immortal\u0027s cave tonight during the third watch? What exactly are they planning to do together?!?!”\u003c/p\u003e\n\u003cp\u003eWord spread through the entire River-Defying Sect, until even the sect leader and the Core Formation elders heard. There were also a few patriarchs who weren’t in secluded meditation at the moment who also caught wind of the matter.\u003c/p\u003e\n\u003cp\u003eHowever, whether it was the old news about the love letters, or this new development, none of them took the matter too seriously. In fact, some of them even joked about it a bit. As for Li Qinghou, he had a serious discussion with Xu Meixiang about what type of person Chen Manyao was....\u003c/p\u003e\n\u003cp\u003eTwo of the patriarchs who happened to be out of their secluded meditation were Nascent Soul patriarchs from the Pill Stream Division, and they were actually very pleased with this development.\u003c/p\u003e\n\u003cp\u003eThe Profound Stream Division Nascent Soul experts were also fairly excited. They knew how important Bai Xiaochun was to the sect; if one of the disciples from their division became Bai Xiaochun’s Daoist partner, it would be of incredible benefit to them.\u003c/p\u003e\n\u003cp\u003eHowever, the patriarchs of the Spirit Stream Division, as well as Sect Leader Zheng Yuandong, all felt headaches coming on. That was especially true of Zheng Yuandong, who knew Bai Xiaochun better than most. This new development, coupled with the way Bai Xiaochun had been strolling around the sect every day recently, accepting love letters, caused him to let out a long sigh.\u003c/p\u003e\n\u003cp\u003e“When is Xiaochun going to grow up a little bit more?” he thought. “He’s already reached Gold Core! Maybe by the time he reaches Nascent Soul he’ll be a bit better?” In the end, he simply shook his head. By this point, he had actually given up on the hope that Bai Xiaochun\u0027s personality would change much.\u003c/p\u003e\n\u003cp\u003eConsidering the entire sect was talking about the matter, it didn’t take long before Song Junwan and Hou Xiaomei heard about what was happening. Both of them immediately started to get anxious. Although they had been angered by the love letter situation, they hadn’t viewed it as a serious threat. This was different. This latest deadly intrusion by Chen Manyao left both young women filled with sensations of intense crisis.\u003c/p\u003e\n\u003cp\u003e“Slut!!”\u003c/p\u003e\n\u003cp\u003e“Completely shameless!!”\u003c/p\u003e\n\u003cp\u003eBoth of them sat in their Immortal\u0027s caves, stewing in rage. Song Junwan had an explosive temper, and Hou Xiaomei was as fiery as a hot pepper sometimes. Both of them seemed on the verge of erupting.\u003c/p\u003e\n\u003cp\u003eFor the first time ever, they dropped their differences and met together to discuss the situation. After hashing things out, they made an agreement; that very day when evening fell, they would strike!\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was currently sitting in his immortal\u0027s cave, looking at Chen Manyao’s handkerchief, a strange light flickering in his eyes as he thought about the situation. Suddenly, his face fell as he detected a killing aura just outside of his immortal\u0027s cave. Looking over his shoulder, he realized that Song Junwan and Hou Xiaomei were standing outside.\u003c/p\u003e\n\u003cp\u003eShivering with fear, he quickly put the handkerchief away, then opened the door, a warm smile on his face.\u003c/p\u003e\n\u003cp\u003e“Big Sis Song, Xiaomei, what are you two doing here? The two of you have completely occupied my thoughts lately! I’ve missed you so much....”\u003c/p\u003e\n\u003cp\u003eSong Junwan’s eyes went wide, and she snorted coldly. Completely ignoring Bai Xiaochun, she stalked into the immortal\u0027s cave and inspected every inch of it. Then she gave Bai Xiaochun another glare before leaving.\u003c/p\u003e\n\u003cp\u003eEven as Bai Xiaochun’s jaw dropped in surprise, Hou Xiaomei stepped forward and grabbed him by the arm.\u003c/p\u003e\n\u003cp\u003e“I\u0027ve missed you too, Big Bro Xiaochun. I\u0027m going to stay here with you tonight!”\u003c/p\u003e\n\u003cp\u003e“Huh?” Bai Xiaochun said, stunned.\u003c/p\u003e\n\u003cp\u003e“What’s wrong, Big Bro Xiaochun?” she said, tears welling up in her eyes as she looked up at him. “You don’t want to spend time with me?”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun shook his head. Slapping his chest, he said, “Of course I want to spend time with you. How about--”\u003c/p\u003e\n\u003cp\u003eBefore he could finish speaking, Hou Xiaomei smiled and dragged him into the immortal\u0027s cave. Once inside, she sat down and started talking, and didn’t stop for the entire night. Bai Xiaochun could only watch as time passed by. When the third watch came, he let out a long sigh.\u003c/p\u003e\n\u003cp\u003eHou Xiaomei’s eyes narrowed. “What’s wrong, Big Bro Xiaochun? Are you thinking about your date with Elder Sister Chen Manyao that I heard about?”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun’s heart trembled. Making himself the picture of righteousness, he said, “Who cares if she asked me on a date!? I’m not going to go just because she wants me to. I\u0027m Bai Xiaochun, the junior patriarch of the sect. No way would I go!”\u003c/p\u003e\n\u003cp\u003eThe following morning at dawn, Hou Xiaomei left, and Bai Xiaochun finally breathed a sigh of relief. But then, Song Junwan arrived. And that was how the next day and night went.\u003c/p\u003e\n\u003cp\u003eFor the following month, Song Junwan and Hou Xiaomei took turns standing guard over Bai Xiaochun, giving him no chance to accept any love letters and no chance to go on any dates....\u003c/p\u003e\n\u003cp\u003eThankfully for Bai Xiaochun, the sect had just been established, and there were many tasks at hand. Eventually, both Hou Xiaomei and Song Junwan were called away on various assignments. At long last, he was able to breathe a sigh of relief.\u003c/p\u003e\n\u003cp\u003eHowever, during the month which had passed, the matter of the love letter, as well as the situation with Chen Manyao, had become a thing of the past. Furthermore, the actions of Song Junwan and Hou Xiaomei had put an end to the aspirations of the other female disciples.\u003c/p\u003e\n\u003cp\u003eBy the time Bai Xiaochun was finally free to walk around in the sect, he was very disappointed to discover that not a single person approached to hand him a love letter.\u003c/p\u003e\n\u003cp\u003e“I should have known this would happen....” he thought, crestfallen. Not willing to accept the situation, he strolled around the entire sect a few times over the following days, until he was completely convinced that there were no love letters to be had.\u003c/p\u003e\n\u003cp\u003eSighing dejectedly, he returned to his immortal\u0027s cave where he slumped in a daze. Finally, late in the night, he looked out at the darkness and his eyes narrowed.\u003c/p\u003e\n\u003cp\u003e“As the junior patriarch of the sect, it wouldn\u0027t be very appropriate to simply ignore Chen Manyao’s request for a date. I think I should go over and see exactly what she has planned!” Eyes flickering, he decided that he really had to make a decision based on the overall situation, especially considering his status in the sect. Clearing his throat, he cautiously made his way through the sect, being careful to avoid notice. Soon, he found himself outside of Chen Manyao’s immortal\u0027s cave.\u003c/p\u003e\n\u003cp\u003eThe mountains of the Pill Stream Division were quiet this night. Bai Xiaochun scouted the immediate vicinity to make sure there was nobody lying in wait, and then, he inspected the area surrounding the cave. He even went so far as to use his Heavenspan Dharma Eye, which allowed him to see the form of a young woman sitting in meditation inside the cave.\u003c/p\u003e\n\u003cp\u003eSeeing that there didn’t appear to be any traps, Bai Xiaochun finally felt a bit more at ease.\u003c/p\u003e\n\u003cp\u003eIt was a very quiet and peaceful location. A narrow path led up to the immortal\u0027s cave, next to which was a small cistern filled with lotuses. Milky moonlight cascaded down onto the violet lotuses, which cast a lovely fragrance out into the night.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun clasped his hands behind his back, looked up at the moon, and then cleared his throat.\u003c/p\u003e\n\u003cp\u003e“Junior Sister Chen, are you asleep? It’s me, the junior patriarch. I\u0027ve come for our date.”\u003c/p\u003e\n\u003cp\u003eAlmost instantly, a shocked voice responded from within the immortal\u0027s cave.\u003c/p\u003e\n\u003cp\u003e“Is that you, Elder Brother Bai?” Even as Chen Manyao’s soft voice could be heard, the door to the immortal\u0027s cave swung open, and she appeared in the open. She was wearing a tight-fitting blouse that completely revealed her curvaceous figure, and looked especially attractive because of the moonlight.\u003c/p\u003e\n\u003cp\u003e“Elder Brother Bai, please come in,” she said, flashing a smile that made flowers look dull. She turned and gestured for him to enter.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun looked her up and down, but didn’t take a step forward. An enigmatic smile appeared on his face, as well as something fierce and a bit domineering!\u003c/p\u003e\n\u003cp\u003e--\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTranslator:\u003c/strong\u003e Deathblade.\u003cstrong\u003e Chinese language consultant:\u003c/strong\u003e ASI a.k.a. Beerblade. \u003cstrong\u003eEditor:\u003c/strong\u003e GNE. \u003cstrong\u003eMemes:\u003c/strong\u003e Logan. \u003cstrong\u003e\u003ca href\u003d\"http://forum.wuxiaworld.com/discussion/6650/awe-meme-archive#latest\"\u003eMeme archives:\u003c/a\u003e\u003c/strong\u003e Tocsin. \u003cstrong\u003eTranscendent Patrons:\u003c/strong\u003e Daoist Elder N, BLE, ttre208. \u003cstrong\u003e\u003ca href\u003d\"http://www.wuxiaworld.com/awe-index/awe-glossary/\"\u003eAWE Glossary\u003c/a\u003e\u003c/strong\u003e. \u003cstrong\u003e\u003ca href\u003d\"https://shop.spreadshirt.com/deathbladesimmortalscave/\" rel\u003d\"noopener\" target\u003d\"_blank\"\u003eXianxia-inspired T-shirts\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-351\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-353\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-352","bookId":1496,"creation":"Sep 10, 2019 2:52:09 AM","modification":"Sep 10, 2019 2:52:09 AM"}
