{"id":45710,"no":393,"title":"Chapter 391: Are You Fellow Daoist Zhang Dahai?","content":"\u003cp\u003e\u003cstrong\u003eChapter 391: Are You Fellow Daoist Zhang Dahai?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEven as the words escaped the lips of the cultivator who had spoken them, he felt more frigid qi wrap around him, making it impossible for him to move. As for all of the other cultivators outside in the main area of the immortal\u0027s cave, including those from the Azure Dragon Society and the Celestial Sky Society, they were completely and utterly shaken.\u003c/p\u003e\n\u003cp\u003e“What!?!?”\u003c/p\u003e\n\u003cp\u003e“Core Formation? Heavens! The boss of the Azure Dragon Society is actually at Core Formation!?!?”\u003c/p\u003e\n\u003cp\u003e“There are only a few Core Formation experts in all of Sky City! Shouldn’t he be in the rainbow district!?!?”\u003c/p\u003e\n\u003cp\u003e“Dammit! I’ve never seen a Core Formation cultivator so bored as to forsake missions and merit points just to make a profit with business!!” The Foundation Establishment cultivators from the Celestial Sky Society had expressions of complete shock on their faces as they began to flee.\u003c/p\u003e\n\u003cp\u003eEven if they had more people on their side, they wouldn’t be able to win in a fight against a Core Formation expert. The only thing they could think about now was escaping the area as quickly as possible.\u003c/p\u003e\n\u003cp\u003eBut how could Bai Xiaochun simply let them get away? A cold snort echoed out like thunder from his room, crashing into the ears of all of the Celestial Sky Society cultivators in the area.\u003c/p\u003e\n\u003cp\u003eAgonized shrieks rang out as those cultivators began to tremble, and their cultivation bases destabilized. Having lost the ability to even move, they fell down out of midair to be immediately captured by the excited cultivators of the Azure Dragon Society.\u003c/p\u003e\n\u003cp\u003eThe fact that a mere snort could do that to such a powerful group of cultivators was dumbfounding. Of course, the Foundation Establishment cultivators who had just been captured had encountered Core Formation experts before. But from what they could tell, Bai Xiaochun was far, far more terrifying than any such people that they had met.\u003c/p\u003e\n\u003cp\u003eHe hadn’t even stepped out of his room; he had simply tossed the quasi-Core cultivators out.\u003c/p\u003e\n\u003cp\u003eHowever, that simple action had a profound effect on the Azure Dragon Society cultivators. Their boss was now even more mysterious and unfathomable than before, shocking to a heaven-shaking, earth-shattering degree. As for the people from the Celestial Sky Society, their hearts overflowed with indescribable astonishment and terror.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun felt more than pleased about everything, and didn’t feel at all like he was a Gold Core expert bullying Foundation Establishment cultivators. In fact, he felt quite the opposite.\u003c/p\u003e\n\u003cp\u003e“I didn’t go looking to cause problems for them,” he thought. “They came looking for trouble.” Of course, he was also aware that what had just occurred could never be kept a secret; it wouldn’t be long before news about him being in the Core Formation stage would fill all of Sky City.\u003c/p\u003e\n\u003cp\u003e“Well, that’s fine,” he thought. “I was going to reveal myself soon anyway. To do it this way will make the Azure Dragon Society’s expansion go even smoother.” Marveling at his own command of strategy, and also at his impressive display of might, he chuckled complacently and then closed his eyes again to continue meditating.\u003c/p\u003e\n\u003cp\u003eNaturally, Master God-Diviner and Xu Baocai took care of everything outside. After taking all of the Celestial Sky Society cultivators into custody, they quickly began to plan what to do next.\u003c/p\u003e\n\u003cp\u003eThe following day, rumors began spreading through all districts of the city. Furthermore, the stories being told were so vivid and lifelike that everyone could visualize them as if they had been present.\u003c/p\u003e\n\u003cp\u003e“Did you hear? Last night, the Celestial Sky Society sent ten quasi-Core cultivators, dozens of people in the great circle of Foundation Establishment, and countless late Foundation Establishment cultivators to attack the Azure Dragon Society. However, they were totally routed! In fact, the Azure Dragon Society captured them all!”\u003c/p\u003e\n\u003cp\u003e“How is that possible...?”\u003c/p\u003e\n\u003cp\u003e“How is it \u003cem\u003enot\u0026nbsp;\u003c/em\u003epossible? Guess what? The boss of the Azure Dragon Society is actually a Core Formation cultivator!!” It didn’t take long for the rumors to fill the city, until everyone was talking about the matter.\u003c/p\u003e\n\u003cp\u003eAfter all, Core Formation cultivators were somewhat of a rarity in Sky City. Normally speaking, they would be completely focused on doing missions to earn merit points, not engaging in idle activities with the organizations and gangs in the city.\u003c/p\u003e\n\u003cp\u003eThe four cities at the base of the waterfall were essentially considered to be outside of the Starry Sky Dao Polarity Sect, like the outer sects of most other sects. As such, everyone desired to leave them as quickly as possible.\u003c/p\u003e\n\u003cp\u003eAs the gossip proliferated, the Azure Dragon Society’s reputation grew more and more exaggerated. At the same time, the Celestial Sky Society was shaken to its core. As for the leaders in their headquarters, they were enraged to the limit. After a few days passed, they eventually sent an emissary to the Azure Dragon Society and paid a hefty ransom of merit points to get their cultivators back.\u003c/p\u003e\n\u003cp\u003eThe Celestial Sky Society quieted down, and thus ended the first stage of the conflict. It wasn’t that Bai Xiaochun hadn’t considered completely wiping them out and being done with it. After all, the Celestial Sky Society didn’t have any Core Formation cultivators at all. However, having been in Sky City for so long, he had come to an even deeper understanding of the background of the Celestial Sky Society.\u003c/p\u003e\n\u003cp\u003eThe truth was that, in terms of manpower, they didn’t really count for much. He really could wipe them out single-handedly if he wanted to. However, the leadership of the organization were all servants in a deva clan. After finding that out, Bai Xiaochun abandoned any ideas of wiping them out.\u003c/p\u003e\n\u003cp\u003eAs things continued to ferment in the Celestial Sky Society, the Azure Dragon Society continued to expand and become more famous.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun’s Fantasy Pills continued to rise in popularity in all five of the city’s districts. Eventually, the Azure Dragon Society reached a terrifying level of power.\u003c/p\u003e\n\u003cp\u003eTheir merit point reserves also continued to grow, and more cultivators sought the security that came from being part of their ranks. There were even some smaller cultivator clans and minor organizations that officially joined the Azure Dragon Society.\u003c/p\u003e\n\u003cp\u003eThey had tons of merit points, and a boss in the Core Formation stage. Because of that, it only took one year for them to grow from a small gang into Sky City’s second largest organization!\u003c/p\u003e\n\u003cp\u003eBy that point, they had long since moved their headquarters from the original immortal\u0027s cave to the very best area in the north district. Were it not for the fact that people couldn\u0027t actually own property in Sky City, they would likely have bought all of the real estate in the area and rented it out.\u003c/p\u003e\n\u003cp\u003eIn addition, Bai Xiaochun wasn’t busy at all anymore. He had hired a huge team of apothecaries to concoct medicine for him. Of course, he kept the pill formula a secret.\u003c/p\u003e\n\u003cp\u003eIn contrast, Master God-Diviner and Xu Baocai were both very busy handling the affairs of the organization. Eventually, Bai Xiaochun thought about his other Dao Protectors, and wondered whether or not they had heard about his recent accomplishments....\u003c/p\u003e\n\u003cp\u003e“Song Que is definitely out doing missions, so he probably doesn’t know. But Eldest Brother has surely caught wind of the situation. Why hasn’t he come looking for me?”\u003c/p\u003e\n\u003cp\u003eEven as he contemplated the matter, Chen Manyao showed up. She simply walked through the entrance of the immortal’s cave and said that she was Madam Bai, the Daoist partner of the Azure Dragon Society’s boss. Considering that the boss of the Azure Dragon Society was like the sun in the noonday sky, that made Chen Manyao extremely important as well. No one was willing to offend her, and they quickly escorted her to see Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eAfter listening to her explanation about why she’d left and then come back, Bai Xiaochun felt a bit of a headache coming on. Realizing that he couldn\u0027t send her away, he sighed and agreed to let her stay.\u003c/p\u003e\n\u003cp\u003eBecause she continued to claim to be Bai Xiaochun’s Daoist partner, everyone in the Azure Dragon Society treated her with extreme respect. Bai Xiaochun didn’t feel like dealing with the matter, so he focused on Big Fatty Zhang. Worried that he might be in some sort of danger, he passed down orders that the entire Azure Dragon Society was to be on the lookout for him. Of course, in the orders, he didn\u0027t use the nickname Big Fatty Zhang, but rather his friend’s true name, Zhang Dahai.\u003c/p\u003e\n\u003cp\u003eThe Azure Dragon Society was a huge, powerful group, so tracking down a single person was not a very difficult task. That was especially true considering that the orders had come from the boss himself. In fact, to many cultivators, it was an opportunity to make a name for themselves in the organization, and so soon, everyone was looking for Big Fatty Zhang.\u003c/p\u003e\n\u003cp\u003eIt was impossible to prevent the Celestial Sky Society from hearing about the matter, and they also began a search for Big Fatty Zhang. There was nothing that could be done about the matter, and Bai Xiaochun knew that, so he also sent people to keep watch over the Celestial Sky Society.\u003c/p\u003e\n\u003cp\u003eAs the search went on for Big Fatty Zhang....\u003c/p\u003e\n\u003cp\u003eThere was a small cultivator clan in the west district whose clan chief had just recently joined the Azure Dragon Society and had quickly risen to the rank of sub-boss. He had just been given the notice handed down to look for Big Fatty Zhang, and as soon as he saw the picture of the subject of the search, beads of sweat popped out on his forehead.\u003c/p\u003e\n\u003cp\u003eFor some reason, the person the boss was looking for looked very much like a spirit enhancer who had accidentally destroyed one of his magical items about six months before in a failed spirit enhancement attempt. That young spirit enhancer had claimed to be surnamed \u003cem\u003eZhang\u003c/em\u003e. In his fury, this sub-boss had imprisoned the spirit enhancer and forced him to perform spirit enhancements day and night to make up for the loss.\u003c/p\u003e\n\u003cp\u003eSomething like that didn\u0027t involve killing, so the Starry Sky Dao Polarity Sect didn’t care about it. Eventually, the sub-boss had forgotten about the lone spirit enhancer, but now that he suddenly came to mind, the man started trembling.\u003c/p\u003e\n\u003cp\u003eHe thought back to when he\u0027d apprehended the spirit enhancer, and remembered thinking that as long as the young man didn’t die, he could use him to perform spirit enhancements in the future. Regret and nervousness gripped him as he realized that it was possible the young man very well could have died since then. Without any hesitation, he began to rush toward the clan’s spirit enhancement workstation.\u003c/p\u003e\n\u003cp\u003eEven from a distance, he could make out the gaunt and shriveled Big Fatty Zhang, his eyes listless as he weakly held a flying sword out in front of him. Off to the side, one of the clan servants was berating him loudly.\u003c/p\u003e\n\u003cp\u003e“Hurry it up! If you destroy another flying sword, then I’m gonna--”\u003c/p\u003e\n\u003cp\u003eBefore the servant could finish speaking, he saw the clan chief rushing over, and immediately put on a fawning expression. Just when he was going to clasp hands in greeting, the clan chief slapped him across the side of the face, sending him spinning through the air with a squawk to land about 30 meters away.\u003c/p\u003e\n\u003cp\u003e“Dammit! I can’t believe you were being so rude to my honored guest!”\u003c/p\u003e\n\u003cp\u003eWhen Big Fatty Zhang saw this happen, he shivered and looked over nervously at the clan chief.\u003c/p\u003e\n\u003cp\u003eHowever, the clan chief was even more nervous than him. Hurriedly helping Big Fatty Zhang to his feet, he cautiously asked, “Are you Fellow Daoist Zhang Dahai?”\u003c/p\u003e\n\u003cp\u003e--\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTranslator:\u003c/strong\u003e Deathblade. (Follow me on \u003ca href\u003d\"https://twitter.com/deathbladeISSTH\" rel\u003d\"noopener\" target\u003d\"_blank\"\u003eTwitter\u003c/a\u003e, \u003ca href\u003d\"https://www.facebook.com/deathbladexianxia/\" rel\u003d\"noopener\" target\u003d\"_blank\"\u003eFacebook\u003c/a\u003e, \u003ca href\u003d\"https://www.instagram.com/issthdeathblade/\" rel\u003d\"noopener\" target\u003d\"_blank\"\u003eInstagram\u003c/a\u003e, \u003ca href\u003d\"https://plus.google.com/+DeathbladeDeathblade\" rel\u003d\"noopener\" target\u003d\"_blank\"\u003eGoogle+\u003c/a\u003e, \u003ca href\u003d\"https://www.youtube.com/deathblade\" rel\u003d\"noopener\" target\u003d\"_blank\"\u003eYouTube\u003c/a\u003e, \u003ca href\u003d\"https://www.pinterest.com/mrbaibaoding/xianxia-wuxia-martial-arts-and-fantasy/\" rel\u003d\"noopener\" target\u003d\"_blank\"\u003ePinterest\u003c/a\u003e)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEditor:\u003c/strong\u003e GNE. \u003cstrong\u003eMemes:\u003c/strong\u003e Logan. \u003cstrong\u003e\u003ca href\u003d\"http://forum.wuxiaworld.com/discussion/6650/awe-meme-archive#latest\"\u003eMeme archives:\u003c/a\u003e\u003c/strong\u003e Tocsin. \u003cstrong\u003eChinese language consultant:\u003c/strong\u003e ASI a.k.a. Beerblade. \u003cstrong\u003eTranscendent Patrons:\u003c/strong\u003e Daoist Elder N, BLE, ttre208. \u003cstrong\u003e\u003ca href\u003d\"http://www.wuxiaworld.com/awe-index/awe-glossary/\"\u003eAWE Glossary\u003c/a\u003e\u003c/strong\u003e. \u003cstrong\u003e\u003ca href\u003d\"https://shop.spreadshirt.com/deathbladesimmortalscave/\" rel\u003d\"noopener\" target\u003d\"_blank\"\u003eXianxia-inspired T-shirts\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-390\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-392\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-391","bookId":1496,"creation":"Sep 10, 2019 2:52:09 AM","modification":"Sep 10, 2019 2:52:09 AM"}
