{"id":45321,"no":4,"title":"Chapter 2: The Ovens","content":"\u003cp\u003eThe Spirit Stream Sect was located in the Eastwood Continent on the lower branch of the Heavenspan River, and was divided between the north and south banks. Its history stretched back countless years, and was very famous in the area.\u003c/p\u003e\n\u003cp\u003eEight enormous cloud-wreathed mountains towered over the Heavenspan River. Four of those mountains were located on the north bank of the river, whereas three were on the south bank. Shockingly, one mountain, the most majestic of them all, rose up from the middle of the river itself.\u003c/p\u003e\n\u003cp\u003eThe entire top half of that mountain was covered with brilliant white snow, and rose up so high that the peak of the mountain wasn’t even visible. The middle of the mountain had been hollowed out, allowing the golden river water to flow right through it, and causing the mountain itself to somewhat resemble a bridge.\u003c/p\u003e\n\u003cp\u003eCurrently, a beam of light was speeding along near the south bank of the Spirit Stream Sect. It was none other than Li Qinghou and Bai Xiaochun. As they raced into the servants’ quarters beneath the third peak, it was just possible to hear Bai Xiaochun shouting out in fear.\u003c/p\u003e\n\u003cp\u003eHe was scared to death from all the flying. They had passed over countless mountains, and the entire time, he had felt like he was losing his grip on Li Qinghou’s leg.\u003c/p\u003e\n\u003cp\u003eEventually, everything turned into a blur. When everything finally became clear again, he realized that they had landed just outside of a building. He stood there, legs trembling, looking around at a scene that was very different from what he was used to back at the village.\u003c/p\u003e\n\u003cp\u003eTowering up in front of the building was a huge stone, upon which three characters were written in flamboyant calligraphy.\u003c/p\u003e\n\u003cp\u003eDepartment of Servant Affairs.\u003c/p\u003e\n\u003cp\u003eSitting next to the stone was a pock-faced woman. As soon as she caught sight of Li Qinghou, she rose to her feet and clasped hands in greeting.\u003c/p\u003e\n\u003cp\u003e“Send this kid to the Ovens,” Li Qinghou said. Without another word, and paying no further heed to Bai Xiaochun, he then transformed into a beam of light that shot off into the distance.\u003c/p\u003e\n\u003cp\u003eWhen the pock-faced woman heard him mention the Ovens, she stared in shock. She looked Bai Xiaochun over, then handed him a bag which contained a servant’s uniform and other items. Face expressionless, led him away from the building toward a nearby path, simultaneously explaining some of the basic sect rules and customs. The path was paved with green limestone, and wound through numerous buildings and courtyards. The fragrant aroma of plants and flowers filled the air, and the entire place seemed like a celestial paradise. As he looked around, Bai Xiaochun’s heart began to thump with excitement, and his previous nervousness and anxiety began to fade.\u003c/p\u003e\n\u003cp\u003e“This place is awesome,” he thought. “It\u0027s way better than the village!” His eyes shone with anticipation as he followed the woman along. The scenery only continued to get more and more spectacular. He even saw some beautiful women along the way, which instantly caused his heart to surge with delight.\u003c/p\u003e\n\u003cp\u003eSoon, Bai Xiaochun got even more excited. That was because he caught sight of what appeared to be their destination; at the end of the path was a seven-story building that sparkled like crystal. There were even celestial cranes soaring in the air above it.\u003c/p\u003e\n\u003cp\u003e“Are we there yet, Elder Sister?” Bai Xiaochun asked excitedly.\u003c/p\u003e\n\u003cp\u003e“Yes,” she replied coolly, her face as expressionless as ever. She pointed to a small path off to the side. “That’s where we’re going.”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun looked in the direction she was pointing, heart bursting with anticipation. But then, his entire body went stiff, and he rubbed his eyes. He looked again, a bit more closely, and saw a gravel path lined by haphazardly-constructed thatch-roofed huts that looked like they might disintegrate at any moment. A strange aroma wafted out from the area.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun wanted to cry, but no tears would come. Still clinging to a scrap of hope, he asked the pock-faced woman another question.\u003c/p\u003e\n\u003cp\u003e“Elder Sister, did you point in the wrong direction just now?”\u003c/p\u003e\n\u003cp\u003e“Nope,” she replied coolly, stepping onto the gravel path. When Bai Xiaochun heard her response, all of the beauty of the place seemed to disappear. A bitter expression appeared on his face as he continued to follow her.\u003c/p\u003e\n\u003cp\u003e\u003cspan id\u003d\"footnote-ref-2731\"\u003e\u003cspan\u003eBefore long, he caught sight of the end of the decrepit path, where he saw several huge black woks running around. After a moment, he realized that the woks were actually attached to the backs of several incredibly fat young men. These young men were so obese that it seemed like squeezing them would cause pure fat to ooze out. One of them was even fatter than the others, so fat that he looked like a mountain of flesh. Bai Xiaochun was even worried that the man might explode from being so fat. \u003c/span\u003e\u003ca href\u003d\"#footnote-2731\"\u003e[1]\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe entire area was filled with hundreds of huge cooking woks, within which fat men were boiling rice.\u003c/p\u003e\n\u003cp\u003eSensing that someone had approached, the young men looked up and saw the pock-faced woman. The fattest of the young men, the one who looked like a mountain of flesh, hefted his ladle and hurried over. The ground trembled as he walked, and his fat bounced and jiggled in a way that made Bai Xiaochun stare in shock. Without even thinking about it, he began to feel around for an axe.\u003c/p\u003e\n\u003cp\u003e“The magpies were singing especially beautiful songs this morning, and now I know why,” the mountain of flesh cried out as he ran over. His eyes flickered with a lustful gleam. “It was all because you were coming, big sis. Could it be that you’ve changed your mind? You finally realized how talented I am, and want to take advantage of this auspicious day to formally become my Daoist partner?”\u003c/p\u003e\n\u003cp\u003eThe pock-faced woman looked at the mountain of flesh with both disgust and anger.\u003c/p\u003e\n\u003cp\u003e“I’m just here to deliver this kid to the Ovens,” she said. “Task accomplished. I’ll take my leave now!” Then she hurried off.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun gasped. He had taken the time to check out the woman on their way here, and she really looked like a freak. He couldn’t help but wonder what kind of taste this fat man had. Apparently even someone with a face like hers got him all hot and bothered.\u003c/p\u003e\n\u003cp\u003eBefore Bai Xiaochun could consider the matter any more, the mountain of flesh was suddenly standing in front of him, panting a bit. The young man was so huge that Bai Xiaochun found himself completely covered by his shadow.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun looked up at the enormous young man and his quivering rolls of flesh, and swallowed hard. This was actually his first time ever seeing someone so fat.\u003c/p\u003e\n\u003cp\u003eThe mountain of flesh glanced resentfully at the pock-faced woman, who was making her way back up the gravel path, then looked back at Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003e“Well well, we have a newcomer. We’d left a spot open for Xu Baocai to join, so this complicates matters.”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun felt nervous just looking at the young man’s enormity, and subconsciously took a few steps back. “Elder Brother, I am your humble... er, humble servant Bai Xiaochun....”\u003c/p\u003e\n\u003cp\u003e“Bai Xiaochun? Hmm.... White skin, slender and dainty. You look pretty innocent. Excellent, excellent. Your name really fits my taste.” The mountain of flesh looked him over, then clapped Bai Xiaochun on the shoulder, which very nearly sent Bai Xiaochun flying off to the side.\u003c/p\u003e\n\u003cp\u003e“Uh, what’s your name, Elder Brother?” Bai Xiaochun took a deep breath and looked up thoughtfully as he prepared to make fun of the young man’s name.\u003c/p\u003e\n\u003cp\u003eThe mountain of flesh chuckled and slapped his chest, causing the fat to ripple back and forth. “I\u0027m Big Fatty Zhang. That’s Second Fatty Huang, and that’s Third Fatty Hei...”\u003c/p\u003e\n\u003cp\u003eAs soon as Bai Xiaochun heard these incredibly stirring names, he abandoned any plans to make fun of them.\u003c/p\u003e\n\u003cp\u003e“As for you,” Big Fatty Zhang continued, “from now on, you’ll be Ninth Fatty Bai! Er.... Wait a second, Junior Brother. You’re way too skinny! If you go around looking like that, you’ll lose face for the Ovens! Well, I guess that doesn’t matter for now. Don\u0027t worry. After a few years, you’ll get fat too. Then we’ll call you Ninth Fatty Bai.”\u003c/p\u003e\n\u003cp\u003eWhen Bai Xiaochun heard the nickname Ninth Fatty Bai, he grimaced.\u003c/p\u003e\n\u003cp\u003e“Well, since you\u0027re already our Ninth Junior Brother, you don\u0027t count as an outsider any more. Here in the Ovens, we have a long-standing tradition of carrying woks on our backs. See this wok here on my back?” He slapped the wok and continued boastfully: “It’s the king of woks, forged from the highest quality iron and engraved with an earthflame spell formation. When you use this wok to cook up spirit rice, the flavor is far, far better than the rice cooked in any other wok. By the way, you’ll have to choose a wok to carry on your back, too. Then you’ll look really impressive.”\u003c/p\u003e\n\u003cp\u003eGlancing at Big Fatty Zhang’s wok, and realizing that everyone else in the Ovens was similarly adorned, Bai Xiaochun suddenly got an image of himself walking around in such a fashion.\u003c/p\u003e\n\u003cp\u003e“Elder Brother,” he blurted, “is it possible to opt out of the wok-carrying thing...?”\u003c/p\u003e\n\u003cp\u003e“Are you kidding me? Wok-carrying is an important tradition in the Ovens! Later on when you’re out in the sect, people will see the wok on your back and instantly recognize that you’re from the Ovens! Once they know that, they won’t dare to pick on you. The Ovens has a lot of influence around here, you know!” Big Fatty Zhang winked at Bai Xiaochun. Allowing no further discussion of the matter, he led Bai Xiaochun to one of the thatch-roofed huts, within which were stacks of thousands of woks, most of which were covered in layers of dust. Clearly, no one had been in here for quite some time.\u003c/p\u003e\n\u003cp\u003e“Go ahead and pick one, Ninth Junior Brother, then come on over and help tend to the rice. If the rice burns, then the Outer Sect disciples will make a scene again.” With that Big Fatty Zhang turned and ran back to join the other fat men as they hustled and bustled among the more than one hundred cooking woks.\u003c/p\u003e\n\u003cp\u003eSighing in despair, Bai Xiaochun looked over the woks, and was agonizing over which one to pick when he suddenly noticed one particular wok off in the corner, buried under a big pile.\u003c/p\u003e\n\u003cp\u003eIt was a unique wok that, instead of being circular, was shaped like an oval. It almost didn’t even look like an oval, but rather, like a turtle shell. There were also some faint markings visible on its surface.\u003c/p\u003e\n\u003cp\u003e“Eee?” Bai Xiaochun’s eyes brightened, and he quickly walked over and squatted down to look at the wok more closely. After dragging it out and examining it further, his eyes began to shine with satisfaction.\u003c/p\u003e\n\u003cp\u003eHe had been fond of turtles ever since he was young, mostly because they represented longevity. Considering that he had come to learn about immortal cultivation for the purposes of living forever, as soon as his saw the turtle-shell wok, he knew that it was an auspicious sign, a good omen.\u003c/p\u003e\n\u003cp\u003eAfter he emerged with the wok, Big Fatty Zhang caught sight of him and hurried over, ladle in hand.\u003c/p\u003e\n\u003cp\u003e“Ninth Junior Brother, why did you pick that one?” he asked sincerely, rubbing his ample belly. “That wok has been in there for years, and nobody has ever used it, mainly because it looks like a turtle shell and people don’t want to put it on their backs. Umm... are you sure, Ninth Junior Brother?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m sure.” Bai Xiaochun said resolutely, looking fondly at the wok. “This is the wok for me.”\u003c/p\u003e\n\u003cp\u003eBig Fatty Zhang tried to dissuade him some more, but eventually realized that Bai Xiaochun had made up his mind. Finally, he gave him a strange look and stopped trying. After assigning him one of the Ovens’ thatch-roofed huts for housing, he went back to work.\u003c/p\u003e\n\u003cp\u003eSoon, dusk had fallen. Bai Xiaochun sat in his thatch-roofed hut, examining the turtle-shaped wok. One thing that stuck out to him were the designs traced on the back of the wok, which were so faint that you wouldn’t see them unless you looked closely.\u003c/p\u003e\n\u003cp\u003eHe could instantly tell that this was no ordinary wok. Carefully putting it on the stove, he looked around the little hut. It was very simple. In addition to the stove, it had a bed, a desk, and an ordinary copper mirror hanging on the wall. As Bai Xiaochun had his head turned to look around, the seemingly-ordinary wok behind him suddenly emitted a flash of violet light!\u003c/p\u003e\n\u003cp\u003eAs far as Bai Xiaochun was concerned, this had been a day packed with all sorts of momentous events. He had finally arrived in the land of his dreams, a world of immortals. At the moment, he was still in a bit of a daze.\u003c/p\u003e\n\u003cp\u003eAfter a bit of time passed, he took a deep breath, and his eyes began to shine with anticipation.\u003c/p\u003e\n\u003cp\u003e“I\u0027m gonna live forever!” As he sat there, he pulled out the bag which the pock-faced woman had given him.\u003c/p\u003e\n\u003cp\u003eInside the bag was a medicinal pill, a wooden sword, some incense, a servant’s uniform, and a command medallion. Finally, there was a bamboo scroll with several small characters written on the cover.\u003c/p\u003e\n\u003cp\u003e“Violet Qi Cauldron Control Art. Qi Condensation Manual.”\u003c/p\u003e\n\u003cp\u003eIt was evening, and Big Fatty Zhang and the others in the Ovens were bustling about. Meanwhile, Bai Xiaochun was looking at the bamboo scroll, eyes shining with anticipation. He had come here in order to learn how to live forever, and he held the key to achieving that goal in his hands right now. After taking a deep breath, he opened the scroll.\u003c/p\u003e\n\u003cp\u003eMoments later, his eyes were gleaming with excitement. The bamboo scroll had three pictures, and accompanying text that described how cultivation was divided into two stages of Qi Condensation and Foundation Establishment. As far as the Violet Qi Cauldron Control Art, it was divided into ten levels, each of which corresponded to the ten levels of Qi Condensation.\u003c/p\u003e\n\u003cp\u003eBy practicing cultivation to a given level, it was possible to exercise control over physical objects. After reaching the third level, you could control half of a small cauldron. At the sixth level, it became half of a large cauldron. At the ninth level, it was a full cauldron. As for the final full circle, you could actually control two full cauldrons.\u003c/p\u003e\n\u003cp\u003eUnfortunately, this scroll only described up to the third level of the art, with no further information about the subsequent levels. The key to the whole thing was cultivation, using a prescribed set of breathing techniques to develop the Violet Qi Cauldron Control Art.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun cleared his mind and began to regulate his breathing. Then he closed his eyes and imitated the posture depicted in the first picture in the bamboo scroll. He was able to hold on for three breaths of time before intense pain filled him. Finally, he let out a shout and gave up. From what he could tell, using this breathing technique actually sucked all the air out of him, making it impossible to actually breathe.\u003c/p\u003e\n\u003cp\u003e“This is way too hard,” he thought. “According to the description under the picture, when you practice this kind of cultivation, you should be able to sense a strand of qi flowing through you. Just now, though, the only thing I felt was intense pain.” He was starting to get frustrated. However, for the sake of living forever, he gritted his teeth and tried again. He repeated the process over and over again until it was the middle of the night. During that entire time, he never once sensed any sort of qi in his body.\u003c/p\u003e\n\u003cp\u003eHe had no way of knowing it, but even someone with exceptional latent talent who tried to cultivate the first level of the Violet Qi Cauldron Control Art would need at least a month to succeed, unless they had some outside help. Considering that, it was simply impossible that he could have succeeded after only a few hours.\u003c/p\u003e\n\u003cp\u003eBody aching painfully, Bai Xiaochun finally stretched, and was about to go wash his face when, all of a sudden, he heard a commotion outside. He stuck his head out of the window and immediately caught sight of a sallow-faced young man standing in the door of the main courtyard of the Ovens. He looked angry.\u003c/p\u003e\n\u003cp\u003e“I’m Xu Baocai! Whoever it was that took my spot here, get the hell out here right now!”\u003c/p\u003e\n\u003cdiv id\u003d\"footnote-2731\"\u003e\n \u003cp\u003e1. This situation is pretty funny because “to carry a black wok on the back” is an expression which means “to be made a scapegoat” or “be unjustly blamed.” \u003ca href\u003d\"http://www.wuxiaworld.com/wp-content/uploads/2016/12/c83d70cf3bc79f3d47ed2dc9bca1cd11728b293f.jpg\" target\u003d\"_blank\"\u003eHere\u0027s a little clipart\u003c/a\u003e I found on the Chinese internet that depicts the phrase \u003ca href\u003d\"#footnote-ref-2731\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-3\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-2","bookId":1496,"creation":"Sep 10, 2019 2:52:08 AM","modification":"Sep 10, 2019 2:52:08 AM"}
