{"id":45740,"no":423,"title":"Chapter 421: How Warm!","content":"\u003cp\u003eSome of the roaring, struggling beasts were stronger than the others, and managed to make their way far off into the distance, where a mirror-like object was visible, into which they disappeared!\u003c/p\u003e\n\u003cp\u003eBai Xiaochun looked around at everything that was happening, and then reviewed some of the information he had gathered in recent days.\u003c/p\u003e\n\u003cp\u003e“The ranking system of the Starry Sky Dao Polarity Superstars is divided into different colors, seven in total. The first level of the trial by fire is the red level, and is the simplest of all. You have to get through this sea of flames. As long as you get thirty percent into the sea itself, your personal star will rise up in the rankings!\u003c/p\u003e\n\u003cp\u003e“The key is how far you can get; that determines your final ranking. After a certain point, you can go right to the next trial by fire. The number of people who actually reach the very end of the red trial is very small....”\u003c/p\u003e\n\u003cp\u003eSighing softly, he looked at all of the countless beasts rushing out into the sea of flames, their miserable shrieks echoing out as they died. As of this moment, he was more impressed than ever by the Starry Sky Dao Polarity Superstars.\u003c/p\u003e\n\u003cp\u003e“No wonder people go so crazy over the rankings. I’ve never seen anything like this. So, to get through this first level, you’re supposed to use one of those beasts!” With that, he patted his bag of holding to produce a seven-colored jade pendant, which he had purchased earlier for a few merit points. This jade pendant was designed specifically for the Starry Sky Dao Polarity Superstars trials by fire, and by crushing it, the owner would be safely teleported out of the trial by fire in the blink of an eye. It would also keep a record of the person\u0027s accomplishments and how far they had proceeded.\u003c/p\u003e\n\u003cp\u003eOf course, throughout the years, there were always people who didn’t crush the jade pendant fast enough, and ended up dying.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun stepped closer to the edge of the cliff. He could tell that flight was prohibited in this area, leaving him with no choice but to leap down and try to land on one of the beasts flying out from the base of the cliff. After looking down for a moment, he jumped out and began to speed down toward a crimson anaconda that was just flying out over the lava.\u003c/p\u003e\n\u003cp\u003eWhen Bai Xiaochun slammed onto the flame anaconda, it twisted back and forth in an attempt to hurl him off of its back. However, Bai Xiaochun stamped his right foot down, sending out a burst of power that instantly cowed it. Eyes shining with madness, it continued to speed along.\u003c/p\u003e\n\u003cp\u003eAll the beasts in this place knew that as long as they could reach the final destination, they would have their freedom.\u003c/p\u003e\n\u003cp\u003eFor them, this red trial by fire was actually a prison!\u003c/p\u003e\n\u003cp\u003e“Alright, be a good little snake and go a bit faster....”\u003c/p\u003e\n\u003cp\u003eBai Xiaochun nervously maintained his position on the flame anaconda as it sped along for about the time it takes half an incense stick to burn. As he proceeded along, he noticed that not only did the sea down below grow choppier, but also, that he wasn’t alone. He saw about seven or eight other cultivators, some of whom attempted to switch mounts midflight to be able to get further along into the sea.\u003c/p\u003e\n\u003cp\u003eThere were even two of them who cast covetous gazes at Bai Xiaochun’s mount. After all, he was riding a flame-type beast, which could last longer than other beasts in these intensely hot conditions.\u003c/p\u003e\n\u003cp\u003e“That\u0027s a flame anaconda!”\u003c/p\u003e\n\u003cp\u003e“Flame-type beasts aren’t very common here....” Both of those cultivators quickly steered their own mounts in Bai Xiaochun’s direction, clearly hoping to snatch his beast.\u003c/p\u003e\n\u003cp\u003e“What are you people doing?!” Bai Xiaochun shouted angrily.\u003c/p\u003e\n\u003cp\u003eBoth of the cultivators were in the mid Core Formation stage. None of them said anything, and in fact, after eyeing him for a moment, they both unleashed attacks upon the sea of flames below, causing a huge wave of lava to suddenly roll in his direction.\u003c/p\u003e\n\u003cp\u003eThere was no time for Bai Xiaochun to get angry. As the heat surged toward him, he suddenly realized that he was probably on the verge of being burned to a crisp. Screaming, he dodged to the side, and yet still managed to get splashed.\u003c/p\u003e\n\u003cp\u003eA moment later, he suddenly stopped screaming, and looked down in surprise at his arm. Although some holes had been burned into his garment, the skin beneath hadn’t been harmed at all.\u003c/p\u003e\n\u003cp\u003e“Eee?” Bai Xiaochun blinked a few times, which was when some more drops of burning lava filled the air around him. Instead of trying to avoid them, he let them land on him, whereupon they burned through his clothing down to his skin.\u003c/p\u003e\n\u003cp\u003eHowever, all he felt was a bit of a warm sensation, not the scalding pain he had anticipated. At that point, his eyes lit up. Not too far off, the two cultivators who had been closing in on him with ill intentions looked on with incredulous expressions on their faces.\u003c/p\u003e\n\u003cp\u003e“He... he wasn’t hurt?”\u003c/p\u003e\n\u003cp\u003e“Does he have some sort of magical item protecting him? Wait, that’s impossible. Magical items aren’t allowed in this trial!” Even as they looked on in shock, Bai Xiaochun reached his right hand down into the lava below, and even swept it back and forth a few times.\u003c/p\u003e\n\u003cp\u003e“So nice and warm....” he said excitedly.\u003c/p\u003e\n\u003cp\u003eWhen the other two cultivators saw that, their eyes nearly popped out of their skulls.\u003c/p\u003e\n\u003cp\u003e“Impossible!!”\u003c/p\u003e\n\u003cp\u003e“Heavens! He... he actually stuck his hand into the lava!!”\u003c/p\u003e\n\u003cp\u003e“What the....”\u003c/p\u003e\n\u003cp\u003eAs for Bai Xiaochun, he couldn’t have been more excited, and immediately threw his head back and laughed uproariously.\u003c/p\u003e\n\u003cp\u003e“What kind of a sea of lava is this? I thought it was supposed to be scary!” Looking very pleased with himself, Bai Xiaochun stepped off of the flame anaconda and dropped down into the lava. Almost immediately, his clothing burned away, revealing his body beneath, absolutely unharmed in any way. He even seemed to be enjoying himself.\u003c/p\u003e\n\u003cp\u003e“Not bad. Not bad at all....” Then he looked up at the two cultivators who had been on the verge of attacking him, and were now staring back at him with faces as white as sheets. Before Bai Xiaochun could do or say anything against them, they pulled out their seven-colored jade pendants, crushed them, and faded away.\u003c/p\u003e\n\u003cp\u003eClearly, they had been worried that Bai Xiaochun might try to get back at them by unleashing some sort of deadly attack.\u003c/p\u003e\n\u003cp\u003e“Cowards!” he shouted smugly. “Get back here! Come down and have some fun in the lava with me....” With that, he turned and began to swim forward through the lava. Soon, he caught sight of other cultivators in the trial, and when they saw him, they immediately let out cries of shock and disbelief.\u003c/p\u003e\n\u003cp\u003e“What’s... what\u0027s that...?”\u003c/p\u003e\n\u003cp\u003e“Is that... is that a person!?!?”\u003c/p\u003e\n\u003cp\u003e“Heavens! There’s actually someone swimming through the lava! That lava is hot enough to melt unfathomantium metals!!”\u003c/p\u003e\n\u003cp\u003e“Could that thing be some sort of beast in human form?!?!”\u003c/p\u003e\n\u003cp\u003eAs such cries filled the air, Bai Xiaochun swam along casually, feeling very proud of himself. He even took the time to wave to some of the other cultivators. “Why don’t you come down and join me. It\u0027s very nice and warm....”\u003c/p\u003e\n\u003cp\u003eSoon, he had swum thirty percent into the sea of lava, which was the requisite point to make the rankings. That was when, all of a sudden, a new star lit up on the crimson portion of the rainbow outside.\u003c/p\u003e\n\u003cp\u003eOf course, the crimson part of the rainbow was filled with countless stars, so the appearance of a new one wasn’t necessarily something very incredible. However, every time a star appeared for the first time, it would shine more brightly than normal to attract the attention, and envy, of those looking on.\u003c/p\u003e\n\u003cp\u003e“Hey look, a new star! Someone got promoted!”\u003c/p\u003e\n\u003cp\u003e“Let’s see who it is. Hmm. Bai Xiaochun? I’ve never heard of him.”\u003c/p\u003e\n\u003cp\u003eNormally speaking, there would have been more discussion about the topic, but considering that Zhao Yidong was in the middle of making an important run, most people were focused on his star.\u003c/p\u003e\n\u003cp\u003eIn fact, there were even some people who had special types of command medallions with which they could watch the competitors inside of the trials. Obviously, such medallions were extremely expensive, so people wouldn’t waste them on a cultivator who hadn’t made it into the top 1,000.\u003c/p\u003e\n\u003cp\u003eBecause no one would ever think to use such a method to observe Bai Xiaochun, nobody on the outside knew that he was swimming through the lava.\u003c/p\u003e\n\u003cp\u003eHowever, many people in the trial by fire itself saw him, and their cries of shock continued to ring out ceaselessly.\u003c/p\u003e\n\u003cp\u003eFurthermore, Bai Xiaochun could achieve quite a bit of speed while swimming, such that he was actually faster than a lot of the flying beasts.\u003c/p\u003e\n\u003cp\u003eHe even started humming a little tune as he picked up speed. Any time he started to feel uncomfortably hot, he would release some frigid qi. Because of that, he always felt wonderful as he headed toward the bank of the sea.\u003c/p\u003e\n\u003cp\u003e“This trial by fire is way too simple,” he thought. Clearing his throat, he thought about what a pity it was that more people didn’t realize he was swimming through the sea of lava.\u003c/p\u003e\n\u003cp\u003e“Once I get out, I’ll be able to tell people about this, and they’ll definitely think I\u0027m super awesome.” Excited, he continued to pick up speed until the bank of the sea was just up ahead.\u003c/p\u003e\n\u003cp\u003eMeanwhile, back outside, a few of the spectators happened to notice that one of the stars on the red portion of the rainbow was rising at an unusually fast speed. In fact, it was already approaching the border of the red part of the rainbow.\u003c/p\u003e\n\u003cp\u003e“So fast! Who is that? Bai Xiaochun? That’s the same guy who just appeared for the first time!”\u003c/p\u003e\n\u003cp\u003e“What’s going on? His star just appeared on the rainbow, and he’s already reached the end of the red portion?!” One of the disciples with one of the special command medallions decided to focus it on Bai Xiaochun’s star, to see what type of beast he was using....\u003c/p\u003e\n\u003cp\u003eWithin the space of a few breaths of time, his eyes had grown as wide as saucers. His jaw dropped, and then he cried out, “How... how could this be happening?!?!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-420\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-422\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-421","bookId":1496,"creation":"Sep 10, 2019 2:52:09 AM","modification":"Sep 10, 2019 2:52:09 AM"}
