{"id":45369,"no":52,"title":"Chapter 50: Bizarre Courtyard","content":"\u003cp\u003eThe courtyard gate opened, and Du Lingfei, Feng Yan and Bai Xiaochun were completely on guard as they peered inside. Bai Xiaochun was so nervous that he started slapping paper talismans all over himself.\u003c/p\u003e\n\u003cp\u003eThe figure which had just appeared held a lantern in its hand, and stood in the opened gate, wreathed in shadows as it gazed at the three of them.\u003c/p\u003e\n\u003cp\u003e“Why, might I ask, have the three of you come to the Luochen Clan on this dark evening?”\u003c/p\u003e\n\u003cp\u003eThe flickering light of the lantern just barely revealed a young man, standing there looking at them calmly. He wore a long, green robe, and his face was pale and devoid of any color of blood.\u003c/p\u003e\n\u003cp\u003eAfter seeing that it was a person who had appeared, Feng Yan and Du Lingfei breathed sighs of relief. Somehow, the creepy feeling they had experienced moments ago had subsided a bit.\u003c/p\u003e\n\u003cp\u003eFeng Yan clasped hands and said, “Hello, Fellow Daoist. We are disciples of the Spirit Stream Sect, paying a visit to ask a few questions.”\u003c/p\u003e\n\u003cp\u003eBy this point, Du Lingfei had noticed the numerous shields which were flickering around Bai Xiaochun, and her brow furrowed in response.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun didn’t notice Du Lingfei’s look. For some reason, the fact that a young man had appeared hadn’t caused his sensation of intense danger to lessen at all.\u003c/p\u003e\n\u003cp\u003e“Ah, Fellow Daoists from the Spirit Stream Sect,” the young man said. “Please, come in, and we can discuss matters....” The flickering of the lantern cast shadows on the young man’s face, making it difficult to see him clearly as he turned and walked off.\u003c/p\u003e\n\u003cp\u003eThe courtyard gate then opened wide to allow the three disciples to enter.\u003c/p\u003e\n\u003cp\u003eFeng Yan hesitated for a moment, then walked through the gate. Du Lingfei followed along behind him. As for Bai Xiaochun, he looked around for a moment before gritting his teeth and cautiously entering the courtyard.\u003c/p\u003e\n\u003cp\u003eEven as the large gate closed behind them, the two stone lions beneath the lanterns outside suddenly turned to look in the direction of the gate, their eyes flickering with a blood-colored light.\u003c/p\u003e\n\u003cp\u003eInside the courtyard was a green limestone path that wound through various plants and decorative rocks. Faint moonlight shone down, casting everything into partial shadow. The only light came from the lantern, which swayed back and forth in the young man’s hand.\u003c/p\u003e\n\u003cp\u003eThe four of them walked along the path, surrounded by gloomy silence. This place almost seemed like a different world than the one beyond the gate.\u003c/p\u003e\n\u003cp\u003eOn the right-hand side of the path were several fruit trees, laden with red fruit. Strangely, despite a lack of any breeze within the courtyard, the leaves on those trees suddenly rustled.\u003c/p\u003e\n\u003cp\u003eDu Lingfei and Feng Yan seemed more on guard than ever, and Bai Xiaochun, who was last in line, looked around cautiously in all directions. For some reason, those rustling fruit trees seemed very bizarre.\u003c/p\u003e\n\u003cp\u003eGradually, a smell like that of fresh blood rose up, faint, but simultaneously distinct.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun’s heart began to thump, and he was just about to say something when, all of a sudden, fruit began to fall off of the fruit trees, landing on the ground and rolling toward Bai Xiaochun and the others. Strangely, faces could be seen on the fruit, child-like faces with broad smiles that almost seemed to have been painted on.\u003c/p\u003e\n\u003cp\u003e“La la la! Hello!”\u003c/p\u003e\n\u003cp\u003eArms and legs sprouted out of the fruit, and as they ran toward Bai Xiaochun and the others, they clasped hands and then began to skip in circles around the shocked group of three.\u003c/p\u003e\n\u003cp\u003eAt the same time, the fruits began to cry out in excited voices: “Auntie said to be good and not cry! We can only laugh! Ripe fruit is the best fruit!”\u003c/p\u003e\n\u003cp\u003eTheir voices were very charming and sweet as they danced around and began to sing children’s lullabies. Now that they were so close, it was possible to smell a sweet fragrance wafting about. It was so sickly sweet, in fact, that upon inhaling it, Bai Xiaochun and the others felt as if they were about to puke their guts out.\u003c/p\u003e\n\u003cp\u003eWhen the fruit got too close to the young man with the lantern, he completely ignored them, and even stepped on some of them, crushing them. However, the crushed fruits simply crawled back to their feet, smiling as they continued to dance and sing.\u003c/p\u003e\n\u003cp\u003e“What the hell are these things?!” Feng Yan exclaimed, eyes flickering. He waved his sleeve, causing a gust of wind to kick up and send some of the fruits flying away. After splatting onto the ground, they lurched back to their feet and re-joined the circle, laughing just as loudly as before.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun felt goosebumps rising up all over him, and by this point he was fully surrounded by flickering shields.\u003c/p\u003e\n\u003cp\u003eDu Lingfei looked at the fruits all holding hands and singing, and her facial expression flickered with fear. Pushing down the disgust in her heart, she gritted her teeth, and her phoenix-like eyes flashed with anger. She was just about to perform an incantation gesture when suddenly, the fruits’ faces fell in terror.\u003c/p\u003e\n\u003cp\u003e“Auntie’s coming!!” they cried, running pell-mell back to the tree and leaping up into their original positions. Soon, their laughter and singing had faded away, and they looked like nothing more than ordinary fruit.\u003c/p\u003e\n\u003cp\u003eThe young man from the Luochen Clan didn\u0027t look back at them, but they could hear his voice as he said, “Those are some spirit fruits the patriarch brought back from the depths of the Fallenstar Mountains. What do you think of their singing, Fellow Daoists? They love to sing.”\u003c/p\u003e\n\u003cp\u003eUnsightly expressions appeared on the faces of Feng Yan and Du Lingfei as they followed along.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was still in the very back. Suddenly, the cold feeling of fear rose up inside of him as he realized that... another set of footsteps could be heard!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eStep, step, step....\u0026nbsp;\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eIt was impossible to determine when exactly this development had occurred, but as of this moment... there were clearly five people walking along the path!\u003c/p\u003e\n\u003cp\u003ePerhaps those footsteps had been mingled in with theirs from the moment they had entered the courtyard, and they hadn’t noticed because of the strange fruits. But now, in the silence that followed the fruits’ outburst, the sound of the additional footsteps was extremely conspicuous.\u003c/p\u003e\n\u003cp\u003eThe echoing footfalls caused Bai Xiaochun to shiver. What was most frightening was that the footsteps were coming from right behind him. Suddenly, an icy breeze seemed to run down his back, as if someone were behind him, breathing on him.\u003c/p\u003e\n\u003cp\u003e“Hey guys…” he said, “did any of you realize... there’s another set of footsteps!?” As the hairs on the back of Bai Xiaochun’s neck rose up, Feng Yan’s face flickered as he also detected the footsteps.\u003c/p\u003e\n\u003cp\u003eDu Lingfei’s pupils constricted, and she began to pant.\u003c/p\u003e\n\u003cp\u003eThe three of them suddenly stopped walking, and as they did, the sound of the other footsteps vanished.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun’s heart was pounding. Gritting his teeth, he slowly turned his head to find himself staring into the eyes of a young woman wearing a red robe!\u003c/p\u003e\n\u003cp\u003eHer robes swayed gently, and her face was as ashen, as if she were dead. She smiled oddly at Bai Xiaochun for a moment before her lips twitched, and she said, “This fire won’t do, help me.”\u003c/p\u003e\n\u003cp\u003eThe suddenness of what had just occurred caused Bai Xiaochun to leap into the air and scream. The red-robed young woman suddenly transformed into a streak of light that vanished in the blink of an eye.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun’s face was pale white as he looked around, but nothing was there... except for the echoing sound of his own scream.\u003c/p\u003e\n\u003cp\u003eDu Lingfei and Feng Yan looked around in fright. Although they didn\u0027t see any unusual figure like Bai Xiaochun did, their hearts were still pounding.\u003c/p\u003e\n\u003cp\u003eThen, a woman’s voice suddenly rang out, singing a song. The lyrics drifted throughout the courtyard, strange and mysterious, almost like a lullaby being sung to soothe a baby. The mere sound of it caused the darkness to seem even more spine-tingling than before.\u003c/p\u003e\n\u003cp\u003e“Good little baby, it\u0027s time to sleep; the wind is blowing and the flames do leap; don’t you weep and don’t make a peep....”\u003c/p\u003e\n\u003cp\u003e“Enough with the parlor tricks!” Feng Yan blurted, clearly nervous. He instantly performed an incantation gesture, summoning a flying sword, which began to swirl around him.\u003c/p\u003e\n\u003cp\u003eSimultaneously, the young man with the lantern turned around to look at them. The flickering light from the lantern made him appear stranger than ever.\u003c/p\u003e\n\u003cp\u003e“What are you standing there for? Come on, let\u0027s keep going.” He smiled, a smile that was somehow very abnormal.\u003c/p\u003e\n\u003cp\u003eFeng Yan took a deep breath, and then his eyes glinted with a fierce light as he said, “No, we’re not going anywhere. Look, we’re here to investigate the disappearance of one of our fellow disciples. Fellow Daoist, do you happen to remember anyone like us coming around here about five months ago?”\u003c/p\u003e\n\u003cp\u003eDu Lingfei had already pulled out a magical device, and her eyes were shining in concentration.\u003c/p\u003e\n\u003cp\u003e“No, I don’t think so,” replied the young man. His softly spoken words floated out into the air and seemed to harmonize with the woman’s singing voice.\u003c/p\u003e\n\u003cp\u003e“Fellow Daoist,” Du Lingfei suddenly said, “how come none of your fellow clan members are around?”\u003c/p\u003e\n\u003cp\u003eThe young man’s smile widened to the point of looking unnatural. “Oh they\u0027re out on business. Are you done with your questions?”\u003c/p\u003e\n\u003cp\u003e“Yes, we’re done here,” said Feng Yan. “We’ll take our leave now.” With that, he turned to walk the other way back down the path. Du Lingfei followed suit, and as for Bai Xiaochun, he had long since taken to flight, and was further on ahead of them.\u003c/p\u003e\n\u003cp\u003eThe young man’s smile was now so wide that the sides of his mouth began to rip open, almost as if his head were about to be torn in half! “If you don’t want to go any further, the least you could do is stay behind... stay behind to keep us company....”\u003c/p\u003e\n\u003cp\u003eThe lantern suddenly turned a greenish color, making the entire courtyard even darker than before. Even as the words left the young man’s mouth, he began to float through the air toward Feng Yan.\u003c/p\u003e\n\u003cp\u003eFeng Yan’s face fell, and he performed an incantation gesture and pointed out, sending his flying sword speeding toward the young man. A boom rang out as the young man let the sword stab through him. Then, his smile widened even further as he shot toward Feng Yan.\u003c/p\u003e\n\u003cp\u003ePanting, Feng Yan fell back, simultaneously pulling out a black medicinal pill, which he threw down onto the ground. A rattling boom echoed out as the pill then exploded.\u003c/p\u003e\n\u003cp\u003eThe charging young man was hit by the blast and sent tumbling backward, his body riddled with wounds. However, he apparently didn’t feel any pain whatsoever. Smiling the same as ever, he arced through the air as fast as a kite on a windy day, to once again charge toward Feng Yan.\u003c/p\u003e\n\u003cp\u003eIn the spot where the medicinal pill had exploded, numerous glowing lines were now visible, all of which emanated a strong aura of death as they began to form together, as if they were repairing themselves.\u003c/p\u003e\n\u003cp\u003eAs soon as he saw the designs on the ground, Feng Yan cried out in alarm, “There’s a spell formation here! It\u0027s a Shadowhell Formation!!”\u003c/p\u003e\n\u003cp\u003eAt the same time, the green limestone beneath Du Lingfei’s feet began to vibrate, and then eyes popped open upon them. Emaciated, corpse-like arms as skinny as twigs stretched out. Just beneath the surface of the skin of those arms were countless, worm-like creatures, wriggling and writhing. Those arms… grabbed Du Lingfei’s right leg.\u003c/p\u003e\n\u003cp\u003eVoices rose up from the green limestone, sinister, fear-inspiring voices.\u003c/p\u003e\n\u003cp\u003e“It hurts when you step on us....”\u003c/p\u003e\n\u003cp\u003e“Come. Come be with us....”\u003c/p\u003e\n\u003cp\u003eDu Lingfei’s face was ashen. She quickly performed an incantation gesture and pointed out, causing a flag to fly out from her bag of holding. It instantly transformed into two mist beasts, which swirled around her defensively. Simultaneously, a flying sword appeared, and the sword light that shimmered out severed the hands which had grabbed onto her leg, allowing her to fall back.\u003c/p\u003e\n\u003cp\u003eAs for Bai Xiaochun, the woman’s singing suddenly grew louder in his ears.\u003c/p\u003e\n\u003cp\u003e“Don’t you weep and don’t make a peep....”\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-49\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-51\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-50","bookId":1496,"creation":"Sep 10, 2019 2:52:08 AM","modification":"Sep 10, 2019 2:52:08 AM"}
