{"id":45873,"no":556,"title":"Chapter 554: Profoundly Mysterious!","content":"\u003cp\u003eWhen Bai Xiaochun’s soul entered the trial by fire dimension inside of the stone stele, none of the other people participating in the trials could see.\u003c/p\u003e\n\u003cp\u003eHowever, Zhou Yixing still hadn’t selected which trial by fire to enter. At one point, he got a strange feeling, and looked over to find that one of the glowing spheres off in the distance was growing brighter.\u003c/p\u003e\n\u003cp\u003eAt that point, his jaw dropped as he realized that he was looking at Bai Xiaochun sitting there, his mask having fallen off of his face.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun’s glowing sphere was much brighter than it was before, and from the look of it, appeared to already be among the 500 brightest spheres.\u003c/p\u003e\n\u003cp\u003e“So, it turns out he really is Bai Xiaochun! How could he be going so fast!? What trial by fire did he pick?!” Unconvinced that Bai Xiaochun could possibly be advancing so quickly, he took a deep breath and tore his gaze away, determined to focus solely on his own trial by fire.\u003c/p\u003e\n\u003cp\u003eMeanwhile, back in the private spirit enhancement workshop, the turtle-wok was absorbing the eleven-colored flame, and Bai Xiaochun was looking on in anticipation as the leaf began to shine brightly.\u003c/p\u003e\n\u003cp\u003eThe light was far more dazzling than that from the previous ten enhancements, causing silver to flood the area. But then, as Bai Xiaochun looked on with wide eyes, the ten silver designs overlapped, transforming into a single golden design!\u003c/p\u003e\n\u003cp\u003e“So, it really does work that way!” At this point, Bai Xiaochun assumed the process was concluded. However, in a sudden, unexpected turn of events, the instant the golden design appeared, the leaf wriggled, and began to turn green!\u003c/p\u003e\n\u003cp\u003eAfter it was completely green, life force could be sensed inside of it, leaving Bai Xiaochun thunderstruck.\u003c/p\u003e\n\u003cp\u003e“How... how is this possible?!?!” he exclaimed. Even as he looked on, the leaf stalk began to grow out, turning into a branch that had even more leaves on it. Shockingly, even those leaves began to grow out into larger branches....\u003c/p\u003e\n\u003cp\u003eBai Xiaochun forgot to breathe as he watched a small tree trunk form, and more branches spread out. As of this moment, the turtle-wok actually contained a small tree!!\u003c/p\u003e\n\u003cp\u003eThe tree brimmed with life force, and seemed completely corporeal. A dazzling golden design could be seen on its surface. Furthermore, the incredible transformations had completely wiped away Bai Xiaochun’s own mark.\u003c/p\u003e\n\u003cp\u003e“With an elevenfold spirit enhancement, that one leaf turned into an entire tree!\u003c/p\u003e\n\u003cp\u003e“The elevenfold enhancement even erased my branding mark....\u003c/p\u003e\n\u003cp\u003e“And the silver design transformed into a golden one!” However, after looking more closely at the tree, Bai Xiaochun could tell that it wasn’t completely stable. Occasionally, it would blur, as though it existed somewhere in between the level of a leaf and a tree.\u003c/p\u003e\n\u003cp\u003eThat was the same characteristic shared by the fire soul arrow.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was completely shaken by the precious spirit enhancement he had performed. As of this moment, he had a much deeper understanding of how spirit enhancements worked. With that, he performed an incantation gesture with his right hand and pointed out, hoping that he could brand his mark onto the little tree to make it his own.\u003c/p\u003e\n\u003cp\u003eAs soon as the mark settled onto the tree, Bai Xiaochun confirmed that even elevenfold spirit enhanced items could also be branded to a master.\u003c/p\u003e\n\u003cp\u003e“So,” he thought, gnawing his lip, “when a treasure receives an elevenfold spirit enhancement, it transforms on a fundamental level. It doesn’t matter who it belonged to before, anyone who leaves a branding mark on it will become its new master....” By this point, he had completely forgotten about his goal of taking 1st place in the trial by fire. All of his interest was focused on the spirit enhancements.\u003c/p\u003e\n\u003cp\u003e“The first ten enhancements left silver designs. Could it be that the next ten all leave golden designs? But what about after that? What kind of designs will appear then?” Bai Xiaochun’s eyes shone with unprecedented brightness as he looked over at the stone dais, upon which another flame was taking form. Without the slightest hesitation, he began to perform more spirit enhancements.\u003c/p\u003e\n\u003cp\u003eTwelvefold. Thirteenfold. Fourteenfold!\u003c/p\u003e\n\u003cp\u003eMore golden designs appeared on the surface of the little tree, until there were four. At the same time, the tree grew more healthy and strong. The trunk became thicker, and more branches spread out, each of which was covered with numerous leaves. Also, a strong pressure began to radiate out from the tree.\u003c/p\u003e\n\u003cp\u003eWhen Bai Xiaochun sensed the increasingly powerful pressure coming from the tree, his excitement grew. By now, he was completely entranced with spirit enhancing, and kept his eyes glued to the tree as he grabbed the fifteen-colored flame and started another enhancement.\u003c/p\u003e\n\u003cp\u003eIn the instant that the spirit enhancement was completed, the turtle-wok began to tremble in unprecedented fashion. This was a reaction Bai Xiaochun had never witnessed before; the golden light which shone out of the wok was so intense it was almost completely blinding.\u003c/p\u003e\n\u003cp\u003eAs of this moment, Bai Xiaochun realized that a fifteenfold enhancement must be a point at which drastic transformations occurred.\u003c/p\u003e\n\u003cp\u003e“What transformation, though...?” Bai Xiaochun murmured, gnawing excitedly on his lip. Soon, the golden design on the turtle-wok faded, and the tree grew bigger. At the same time, it began to pulse faintly with the power of a deva!!\u003c/p\u003e\n\u003cp\u003e“Deva!” Bai Xiaochun blurted, his expression one of complete incredulity. Although he hadn’t interacted with devas very many times, he had done so enough to recognize the fluctuations of the Deva Realm.\u003c/p\u003e\n\u003cp\u003eAfter looking carefully at the tree, he reached out to touch it, and when he did, he suddenly felt as if he were connected to the heavens.\u003c/p\u003e\n\u003cp\u003e“I can\u0027t believe that spirit enhancement is so profoundly mysterious!” Expression flickering, he took a few steps back. Then, seemingly entranced, he grabbed the next tongue of flame off of the stone dais and began another spirit enhancement\u003c/p\u003e\n\u003cp\u003eRUMBLE!\u003c/p\u003e\n\u003cp\u003eSixteenfold. Seventeenfold. Eighteenfold. Nineteenfold. Twentyfold....\u003c/p\u003e\n\u003cp\u003eHe performed five spirit enhancements in a row, causing the tree to grow larger and larger. By now, it seemed to fill most of the workshop, and even seemed like it might break through the walls to continue its growth. Upon looking up, Bai Xiaochun couldn’t even see the top of the tree. Thankfully, there was still some room inside of the turtle-wok to continue performing spirit enhancements.\u003c/p\u003e\n\u003cp\u003eTen golden designs covered the surface of the tree, dazzling and eye-catching. Furthermore, the deva power the tree radiated caused Bai Xiaochun to tremble physically.\u003c/p\u003e\n\u003cp\u003eTo him, it almost felt like there was an actual deva standing in front of him, a deva far more powerful than either Chen Hetian or Mistress Red-Dust.\u003c/p\u003e\n\u003cp\u003eApparently, this level of power was the peak of the Deva Realm!\u003c/p\u003e\n\u003cp\u003eIt was like a brooding thunderstorm that, if it touched Bai Xiaochun, would kill him in body and soul, regardless of how powerful his fleshly body was. In fact, Bai Xiaochun was fairly certain that it was even strong enough to render Chen Hetian and Mistress Red-Dust completely powerless!\u003c/p\u003e\n\u003cp\u003eEven more exciting to Bai Xiaochun was the fact that the tree still had his mark on it. With a single thought and the wave of a finger, he could make it into a magical item of his own possession.\u003c/p\u003e\n\u003cp\u003eWith a magical item like that, he was completely confident in being able to dominate Chen Hetian or Mistress Red-Dust.\u003c/p\u003e\n\u003cp\u003e“I... I created this treasure because of my turtle-wok. I wonder if there are any other precious treasures in the world that have twentyfold spirit enhancements?!?!\u003c/p\u003e\n\u003cp\u003e“If... if I can take this tree with me, then I’ve definitely struck gold! I... I could go back to the River-Defying Sect immediately!” However, his excitement quickly devolved into concern of what was at stake. Considering how powerful the tree was, he couldn’t imagine that he would actually be able to take it out of this place. Therefore, he reached out to the newest tongue of flame and put it into the turtle-wok.\u003c/p\u003e\n\u003cp\u003e“Twenty-onefold!”\u003c/p\u003e\n\u003cp\u003eMeanwhile, on the outside, Zhou Yixing felt his hair standing on end. Earlier, he had decided which trial by fire to select, and was just about to enter it, when Bai Xiaochun’s glowing sphere began to shine even more brightly.\u003c/p\u003e\n\u003cp\u003eThe truth was that Bai Xiaochun’s sphere really was increasing in brightness far too quickly. Zhou Yixing’s eyes went wide as he watched it rapidly surpass almost all of the other glowing spheres in the area!!\u003c/p\u003e\n\u003cp\u003eAll of the people in those spheres had arrived in this area before Bai Xiaochun, and yet now, didn’t measure up to him at all. He was even catching up to Mistress Red-Dust, who had once been the clear leader!\u003c/p\u003e\n\u003cp\u003eAlthough he hadn’t caught up yet, from the way the light of his sphere emanated boundless brightness, it didn\u0027t seem impossible for him to catch up to Mistress Red-Dust.\u003c/p\u003e\n\u003cp\u003eZhou Yixing’s eyes couldn’t have been wider, and his mind was spinning. Convinced he must be seeing things, he rubbed his eyes, and yet, upon opening them, nothing had changed.\u003c/p\u003e\n\u003cp\u003e“How could this be happening?!?!” he muttered through angrily gritted teeth, his jealousy rising. “Dammit, don’t tell me he’s actually going to take 1st place?”\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-553\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-555\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-554","bookId":1496,"creation":"Sep 10, 2019 2:52:09 AM","modification":"Sep 10, 2019 2:52:09 AM"}
