{"id":45951,"no":634,"title":"Chapter 632: Once The Heavens Change","content":"\u003cp\u003eAs soon as Bai Xiaochun heard the message, his eyes turned even more bloodshot than before. If Zhou Yixing had merely been involved in a deadly fight, it would have been more acceptable, but to hear that someone was trying to steal his souls was a different matter....\u003c/p\u003e\n\u003cp\u003eRight now, Bai Xiaochun wanted souls more than just about everything else. And considering that none of the shops in the city had any souls to spare, Zhou Yixing was his last hope.\u003c/p\u003e\n\u003cp\u003e“I only need to practice five more times and I’ll be able to conjure fourteen-colored flame. As of this moment, anyone who tries to steal souls from me is my enemy!” Enraged, and having no time to argue with the two crown princes, he rushed out and headed in the direction of the teleportation portal.\u003c/p\u003e\n\u003cp\u003eAs soon as he was out in the open, he flew up into the air and hung his Devil Penitentiary command medallion around his neck. Although flying was prohibited in the city, when the patrolling city guards saw his medallion and realized who he was, they simply pretended not to notice him.\u003c/p\u003e\n\u003cp\u003eHe was already relatively close to the teleportation portal, so coupled with the fact that he was flying, it only took him a few breaths of time to reach his destination.\u003c/p\u003e\n\u003cp\u003eAs he rumbled through the air in a beam of light, he attracted quite a bit of attention. Even before he landed, he could see Zhou Yixing to the east of the teleportation portal, a look of desperation on his face as he struggled with a group of a dozen or so cultivators. One of the cultivators in that group... was the very same chief of the Bai Clan whom Bai Xiaochun had captured when fleeing the clan!\u003c/p\u003e\n\u003cp\u003eMadam Cai was also there, accompanied by a contingent of followers, most of whom were members of the Bai Clan. There were two other soul cultivators present who, based on their clothing, were obviously from two of the other great clans.\u003c/p\u003e\n\u003cp\u003eAs Bai Xiaochun closed in, the clan chief thrust his hand out, causing a black wind to swirl around Zhou Yixing, locking him in place and making it impossible for him to flee.\u003c/p\u003e\n\u003cp\u003eSeeing Zhou Yixing in such danger, Bai Xiaochun roared, “How dare you, Bai Clan lowlife!!”\u003c/p\u003e\n\u003cp\u003eAs his voice echoed out like heavenly thunder, the group from the Bai Clan turned to see who was approaching. When Madam Cai recognized who it was, she shrieked, “Bai Hao!”\u003c/p\u003e\n\u003cp\u003eBai Hao’s father, the clan chief, looked up and began to tremble. As thoughts flashed through his mind regarding how he had been kidnapped, he gritted his teeth and growled, “Bai Hao!!”\u003c/p\u003e\n\u003cp\u003eThe other members of the Bai Clan were all shocked, and were immediately reminded of all the humiliation which had been heaped onto their heads because of Bai Hao.\u003c/p\u003e\n\u003cp\u003e“It’s Bai Hao!!”\u003c/p\u003e\n\u003cp\u003e“The patriarch wasn’t able to kill him back then, and he ended up getting taken away by the Giant Ghost King....”\u003c/p\u003e\n\u003cp\u003eZhou Yixing was on the verge of tears, his heart gripped by a sensation of imminent crisis. “Help me, milord....”\u003c/p\u003e\n\u003cp\u003eThe clan chief’s eyes burned with rage; a later investigation regarding the murdersoul spikes had led him to Zhou Yixing, and he quickly realized that he was working with Bai Xiaochun. Therefore, after laying eyes on him during this visit to the city, he had immediately attempted to kidnap him.\u003c/p\u003e\n\u003cp\u003eHowever, now that Bai Xiaochun had appeared, the clan chief changed his plan. Instead of trying to kidnap Zhou Yixing, he would try to kill him! Snorting coldly, he reached out and made a grasping motion in Zhou Yixing’s direction, causing the black wind to transform into a wind blade.\u003c/p\u003e\n\u003cp\u003e“We might not be able to touch you because of your status in Giant Ghost City,” he growled, “but that doesn’t mean I can’t kill your follower!!”\u003c/p\u003e\n\u003cp\u003eHope had just appeared in front of Zhou Yixing, only to be replaced by the black wind blade, which now slashed down toward him, filling his heart with despair. Although all of these things take some time to describe, they happened in the time it takes a spark to fly off of a piece of flint. Seeing what was happening, Bai Xiaochun’s eyes narrowed, and he burst forward with greater speed than ever!\u003c/p\u003e\n\u003cp\u003eHe wasn’t using the Mountain Shaking Bash, he was using... the Undying Hex!!\u003c/p\u003e\n\u003cp\u003eAnyone observing him would see him become a blur, while to him, his surroundings suddenly slowed down. Then he vanished. Meanwhile, the wind blade was slashing down toward Zhou Yixing, and he was wailing miserably. But then a screaming sound could be heard as Bai Xiaochun suddenly appeared right in front of Zhou Yixing.\u003c/p\u003e\n\u003cp\u003eThere, he reached out and smacked the wind blade.\u003c/p\u003e\n\u003cp\u003eBOOOOOOOOOMMM!\u003c/p\u003e\n\u003cp\u003eThe wind blade shattered into countless pieces which spun out in all directions. At the same time, the Bai Clan cultivators all stepped back.\u003c/p\u003e\n\u003cp\u003ePupils constricting, the clan chief took a step forward, performing an incantation gesture with his right hand as he said, “Feeling suicidal, Bai Hao?!”\u003c/p\u003e\n\u003cp\u003eInstantly, the wails of ghosts and wolves could be heard as he used his distinctive Bai Clan secret magic, causing his divine sense to transform into countless shadow ghosts that pounced toward Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003e“I beat you once before, are you really crazy enough to try again?!” Bai Xiaochun shot backward, slamming into the shocked Zhou Yixing to send him tumbling away.\u003c/p\u003e\n\u003cp\u003eThen, Bai Xiaochun glared at the clan chief as several afterimages appeared, which were none other than his four clones. Even as they appeared out in the open, they simultaneously unleashed a fist strike onto the clan chief!\u003c/p\u003e\n\u003cp\u003eA huge boom rolled out to fill nearly half of Giant Ghost City. Instantly, numerous beams of light began to shoot in their direction.\u003c/p\u003e\n\u003cp\u003e“Magical combat is prohibited in Giant Ghost City. Stay your hands immediately!”\u003c/p\u003e\n\u003cp\u003e“Stop right there!” Voices rang out from the huge giant ghost statue in the middle of the city, as well as streams of shocking divine sense.\u003c/p\u003e\n\u003cp\u003eSimultaneously, Bai Xiaochun and his clones slammed into the clan chief, after which all of them staggered backward. As for the clan chief, blood was oozing out of his mouth, and he was panting as he glared angrily at Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was also backing up, but wasn\u0027t hurt. It was even as he pondered the advantages and disadvantages of fighting the Bai Clan inside of Giant Ghost City that the voices and divine sense of the city guards appeared, much to his relief.\u003c/p\u003e\n\u003cp\u003eWithout any hesitation, Bai Xiaochun shouted, “How dare you ambush someone from Devil Penitentiary, old man Bai! This is Giant Ghost City, not your Bai Clan! Brothers from the city guard, I\u0027m Bai Hao from Devil Penitentiary. These people are violating local law. Not only are they ganging up on me, they’re intentionally disrespecting Giant Ghost City!” With that, he grabbed Zhou Yixing and prepared to leave.\u003c/p\u003e\n\u003cp\u003eSeeing that Bai Xiaochun was getting away, Madam Cai completely ignored the city guards and shrieked, “Bai Clan cultivators, kill him immediately!!”\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe venom in Madam Cai’s eyes couldn’t have been more evident. Her hatred for Bai Xiaochun had reached unimaginable heights. However, the other members of the Bai Clan hesitated, fully conscious of the razor-sharp gazes of the city guards.\u003c/p\u003e\n\u003cp\u003eSeeing that the Bai Clan cultivators weren’t giving chase, Madam Cai screamed, “Get moving, all of you! Kill him!!”\u003c/p\u003e\n\u003cp\u003eThen she turned to the nearby Cai Clan cultivator, and was about to say something, when the Bai Clan chief growled, “Shut up!”\u003c/p\u003e\n\u003cp\u003eIt was a mere growl, but it echoed like thunder, causing Madam Cai to shake visibly as she turned to stare at her husband.\u003c/p\u003e\n\u003cp\u003eExpression very grim, he said, “Giant Ghost King bequeathed that scum with a title. If the deva patriarch had to give him up, then what do you think we can do? Besides, killing is prohibited within the city limits....”\u003c/p\u003e\n\u003cp\u003eMadam Cai didn’t seem inclined to agree, but had no choice. However, the rage in her heart was so intense that she was shaking violently.\u003c/p\u003e\n\u003cp\u003eAs for the city guards, when they saw that the Bai Clan was standing down, and that Bai Xiaochun was already leaving, they looked around vigilantly for a bit, then left.\u003c/p\u003e\n\u003cp\u003eBefore long, the street had calmed down. The Bai Clan cultivators exchanged awkward glances, and Madam Cai was gnashing her teeth.\u003c/p\u003e\n\u003cp\u003eGlancing grimly at the fleeing Bai Xiaochun, the clan chief turned to Madam Cai and quietly said, “Just wait a bit longer. Once the heavens change, we’ll have our chance.”\u003c/p\u003e\n\u003cp\u003eMadam Cai was taken aback, but quickly realized what the clan chief was talking about....\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-631\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-633\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-632","bookId":1496,"creation":"Sep 10, 2019 2:52:09 AM","modification":"Sep 10, 2019 2:52:09 AM"}
