{"id":46103,"no":786,"title":"Chapter 784: Raging Murderous Aura","content":"\u003cp\u003eThere was no possible way that Bai Xiaochun could have been prepared for the sudden and unexpected severing of his connection to his apprentice.\u003c/p\u003e\n\u003cp\u003e“Hao’er!!” he shouted, leaping to his feet, mind reeling with a sense of deep foreboding.\u003c/p\u003e\n\u003cp\u003eThere was clearly no time to ponder the situation. All of the joy about becoming an earthly necromancer was cast deep into the back of his mind, which was now filled with only one subject: Bai Hao!\u003c/p\u003e\n\u003cp\u003eWithout pausing for even a moment, he walked out of his secluded meditation chamber, flew up into the air above the Inspections Manor, and then shot with lightning-like speed in the direction he knew Bai Hao to have been in moments ago.\u003c/p\u003e\n\u003cp\u003eHe even resorted to teleportations, moving with dramatic speed that caused whistling sounds to echo about. He vanished in the blink of an eye, and when he reappeared, he was on a crowded street near the edge of the borough that was home to the Inspections Manor, which was right in the middle of the city center!\u003c/p\u003e\n\u003cp\u003eIt was a bustling street with many stores, and countless pedestrians walking every which way. Nothing seemed out of the ordinary about the area, but Bai Xiaochun’s sudden appearance, accompanied by intense rumbling sounds, caused countless people to look over in shock. Many even backed away reflexively.\u003c/p\u003e\n\u003cp\u003e“It’s Bai Hao!!”\u003c/p\u003e\n\u003cp\u003e“What’s he doing here…?”\u003c/p\u003e\n\u003cp\u003eAs soon as people realized who it was, they started to get nervous. After all, everyone had been talking about Bai Hao recently.\u003c/p\u003e\n\u003cp\u003eEven more unsettling than his mere presence was the fact that his expression was profoundly grim, and he was even trembling physically, as if from rage. As soon as he arrived, his divine sense spread out to fill the area, and the killing intent present within it was like an angry wave that swept out in all directions.\u003c/p\u003e\n\u003cp\u003eIn response, countless faces fell, and many people even gasped.\u003c/p\u003e\n\u003cp\u003e“What’s wrong with Bai Hao?!?!”\u003c/p\u003e\n\u003cp\u003e“Heavens, what is he going to do?!?!”\u003c/p\u003e\n\u003cp\u003e“What happened?!?!” Everyone was shaken by the murderous aura radiating off of Bai Xiaochun, and many of them immediately felt as if they were in danger!\u003c/p\u003e\n\u003cp\u003eIt was a rare thing to see him like this; at the moment, he almost seemed out of control. His heart overflowed with anxiety, concern, and self-blame, a combination which pushed him into utter madness. He looked like he was ready to unleash a bloodbath!!\u003c/p\u003e\n\u003cp\u003eIt was with bloodshot eyes that he scanned the street, his gaze soon coming to rest on one particular shop that specialized in selling souls. However, he couldn’t detect any evidence of fighting in the area, not even the fluctuations of magical techniques.\u003c/p\u003e\n\u003cp\u003eThere were absolutely no clues present, and yet, Bai Xiaochun was certain that this was the area from which Bai Hao had messaged him urgently! As for the one hundred corpse troopers who had been assigned to protect Bai Hao, they were not harmed in any way. However, they appeared to have been tampered with in some way, as they simply stood in place unmoving.\u003c/p\u003e\n\u003cp\u003eAt this point, Bai Xiaochun threw his head back and let loose a howl that shook all creation. It was a hoarse cry filled with fury and madness, that swept out like a mad tempest.\u003c/p\u003e\n\u003cp\u003e“Corpse troopers!!”\u003c/p\u003e\n\u003cp\u003eInstantly, the corpse troopers back in the Inspections Manor all shivered, and then shot toward Bai Xiaochun in beams of light, their murderous auras raging like vortexes around them.\u003c/p\u003e\n\u003cp\u003eDramatic rumbling sounds filled heaven and earth as 3,000 corpse troopers converged on Bai Xiaochun’s location.\u003c/p\u003e\n\u003cp\u003e“Lock down this entire area! Search every person, every shop, every alley. Search everything!! Find my soul slave!!” The 3,000 corpse troopers’ eyes began to shine with red light, and their murderous auras grew more intense as they fanned out and began to follow the orders Bai Xiaochun had just issued.\u003c/p\u003e\n\u003cp\u003eThey even began to magically seal the entire area, including the soul cultivators, regardless of the level of their cultivation base, their background, or their status.\u003c/p\u003e\n\u003cp\u003eThey searched the shops, and searched the cultivators, even their bags of holding. The shop Bai Xiaochun had identified as Bai Hao’s last known location was of particular focus in the investigation.\u003c/p\u003e\n\u003cp\u003eOf course, everyone was infuriated, and some began to angrily protest, and even refused to cooperate.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun remained in place, unmoving, seemingly not possessing any aura at all, only an intense, frigid coldness that caused frost to start to build up in the area.\u003c/p\u003e\n\u003cp\u003eHis face almost looked like that of a corpse, his eyes growing more bloodshot by the moment, until they were almost pure red.\u003c/p\u003e\n\u003cp\u003eCoupled with his disheveled hair, he looked like a devilish god. Furthermore, the murderous feeling of the icy coldness made it seem like, if this person went crazy, he could eradicate worlds!!\u003c/p\u003e\n\u003cp\u003eHe seemed completely oblivious to the commotion, immune to the shouting. In fact, he didn’t even see anything around him. He was completely wrapped up in memories.\u003c/p\u003e\n\u003cp\u003eFirst was an image of himself teleporting into the Wildlands and finding Bai Hao’s corpse.\u003c/p\u003e\n\u003cp\u003eSecond was when he assumed Bai Hao’s identity, went to the Bai Clan, and found Bai Hao’s notes written on the floor of his hut….\u003c/p\u003e\n\u003cp\u003eThird was the Necromancer Kettle, when he actually found Bai Hao’s soul….\u003c/p\u003e\n\u003cp\u003eFourth was when Bai Hao awoke, then kowtowed and called him Master.\u003c/p\u003e\n\u003cp\u003eFifth was in the spirit enhancement shop, where the two of them had relied upon each other for survival, with Bai Hao constantly giving him advice….\u003c/p\u003e\n\u003cp\u003eThere was a sixth and a seventh….\u003c/p\u003e\n\u003cp\u003eWhen he finally reached the last of the memories, his heart was as black as the night, and Bai Hao\u0027s voice rang in his ears….\u003c/p\u003e\n\u003cp\u003e“Master, help m--”\u003c/p\u003e\n\u003cp\u003eAs he stood there with a blank look in his eyes, his corpse troopers were causing a huge scene as they searched the area. The commotion was growing more and more intense.\u003c/p\u003e\n\u003cp\u003e“What are you doing? Do you know who I am?!?!”\u003c/p\u003e\n\u003cp\u003e“Dammit! Even if you are the inspections commissioner, you don’t have the power to do this! I come from Heavenly Duke Situ’s clan! How dare you search me!!”\u003c/p\u003e\n\u003cp\u003eAt one point, an old man furiously made his way through the crowd to stand in front of Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003e“Bai Hao, I\u0027m an honor guard from Heavenmaster Manor! If you want to go crazy, fine. I can’t believe you’re using your corpse trooper army like this all because of a soul slave. I\u0027m definitely going to report this to the Grand Heavenmaster. Let me go immediately so that I can return to Heavenmaster Manor!” Other people feared the Inspections Manor, but this old man was a member of the Heavenmaster Manor. As far as he was concerned, the Inspections Manor was nothing more than an attack dog used by the grand heavenmaster.\u003c/p\u003e\n\u003cp\u003eHeavenmaster Manor was indeed a very special place. It was actually the clan of the Grand Heavenmaster, and this so-called honor guard was essentially a personal attendant of the Grand Heavenmaster.\u003c/p\u003e\n\u003cp\u003eEven as the old man was yelling angrily, Bai Xiaochun looked up, and without saying even a single word, stepped forward and punched him right in the chest!\u003c/p\u003e\n\u003cp\u003eIt happened so quickly and suddenly that the old man couldn’t even react. Bai Xiaochun possessed battle prowess equivalent to a half-deva, power which completely overwhelmed this honor guard from Heavenmaster Manor.\u003c/p\u003e\n\u003cp\u003eA miserable shriek erupted from his mouth, followed by a stream of blood. He flew backward like a kite with its string cut, and before he could even land, the power of the fist strike caused him to explode into bits! A rain of blood and gore then descended onto the city….\u003c/p\u003e\n\u003cp\u003eEveryone was completely shocked by the sight, and looked over incredulously at Bai Xiaochun. That old man had been from the Heavenmaster Manor…\u003c/p\u003e\n\u003cp\u003eAnd yet Bai Xiaochun had killed him without uttering a single word!\u003c/p\u003e\n\u003cp\u003e“If anyone resists, kill them immediately!” he said in a hoarse, cold voice that echoed out for everyone to hear.\u003c/p\u003e\n\u003cp\u003eNo one dared to offer any further resistance. It was at this point that Zhou Yixing finally arrived, just in time to see the old man getting killed. Then he looked around at the army of corpse troopers, and finally at Bai Xiaochun. The expression on Bai Xiaochun’s face instantly struck fear into his heart; he had never seen him like this before.\u003c/p\u003e\n\u003cp\u003e“Milord--” he began.\u003c/p\u003e\n\u003cp\u003eBefore he could say anything else, Bai Xiaochun looked over and cut him off. “Find my soul slave!”\u003c/p\u003e\n\u003cp\u003eHis gaze caused Zhou Yixing’s mind to reel, and even fill him with intense coldness. Without any hesitation, he joined the search effort.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-783\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-785\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-784","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
