{"id":46115,"no":798,"title":"Chapter 796: Fighting Into The Zhou Clan!","content":"\u003cp\u003e“Zhou Wudao!” The coldness in Bai Xiaochun’s eyes was such that the entire private chamber suddenly seemed as frigid as the dead of winter!\u003c/p\u003e \n\u003cp\u003eAlthough he didn’t fully understand the reason Bai Hao had gone missing, he now had a general idea. A patriarch in Miao Lin’er’s clan was a necromancer at the peak of the celestial rank, who planned to use Bai Hao’s soul in a flame conjuring to achieve a breakthrough!\u003c/p\u003e \n\u003cp\u003eOut of fear of Bai Xiaochun, he had allied with thirteen other clans, and had also somehow called upon the aid of the Nine Serenities King. That was how they had managed to snatch Bai Hao the previous month without leaving a single trace of evidence behind!\u003c/p\u003e \n\u003cp\u003eAfterward, the Miao Clan patriarch had gone into hiding in one of the clans, a clan where no one would think to look. After all, when it came to the heavenly marquises of the Arch-Emperor Dynasty, Zhou Wudao was neither among the ten most powerful, nor among the ten weakest. He was somewhere in the middle. He wasn’t a very well-spoken person, and thus didn’t have many dealings with others. He was basically the quiet type.\u003c/p\u003e \n\u003cp\u003eHe was one of the people in the dynastic court who almost never spoke. If he was ever forced to speak, he would always go along with the majority. He was so unassuming that many people even forgot he existed.\u003c/p\u003e \n\u003cp\u003eBai Xiaochun had never heard of him before the Proclamation of Universal Grace. However, it was a bastard son of Zhou Wudao who secretly sent the critical information. Never could Bai Xiaochun have guessed that Bai Hao would be in that clan!\u003c/p\u003e \n\u003cp\u003eOf course, Zhou Wudao’s clan was one of the thirteen who had helped the Miao Clan. As for who the other twelve clans were, Bai Xiaochun had still not yet unearthed any clues.\u003c/p\u003e \n\u003cp\u003eHowever, he wasn’t very concerned with that information. All of his efforts during the past month had been focused on finding Bai Hao.\u003c/p\u003e \n\u003cp\u003eAs far as what he had just learned, he had no intention of reporting it to the Grand Heavenmaster. \u003c/p\u003e \n\u003cp\u003eThe matter was simply too important, and he couldn\u0027t risk the chance that the Grand Heavenmaster would refuse him the right to act. If word leaked out, and if his enemies were alerted, then it might very well become impossible to track Bai Hao down again.\u003c/p\u003e \n\u003cp\u003eHe couldn’t gamble when it came to something this vital!\u003c/p\u003e \n\u003cp\u003eAs he rose to his feet, his murderous aura grew stronger. The time had come to vent all of the madness which had been building up over the last month. The time had come to do some killing!\u003c/p\u003e \n\u003cp\u003eWithout the slightest hesitation, he sent a message to Zhou Yixing with certain instructions. Then he strode out into the open and flew up into the air above the Inspections Manor. With the wave of a sleeve, he sent some divine sense out, and then headed at top speed toward the location of Zhou Wudao’s clan.\u003c/p\u003e \n\u003cp\u003eAt the same time, rumbling sounds could be heard as countless corpse troopers flew up to follow him. In this case, he didn’t take 5,000, but rather, 4,000!\u003c/p\u003e \n\u003cp\u003eThe other 1,000 were in Zhou Yixing’s hands to handle other matters!\u003c/p\u003e \n\u003cp\u003eBai Xiaochun plus 4,000 beams of light shot through the air, surrounded by a black vortex that was the most powerful of murderous auras. The sky rippled, and a screaming wind kicked up, attracting the shocked attention of numerous individuals in Arch-Emperor City.\u003c/p\u003e \n\u003cp\u003eBai Xiaochun ignored all of the gazes which came to focus on him, nor did he attempt to prevent his eyes from being completely bloodshot. He looked completely mad, and engulfed by a shocking killing intent.\u003c/p\u003e \n\u003cp\u003eHis veins of steel pulsed explosively, as though he had become a devilish god!\u003c/p\u003e \n\u003cp\u003eAs he raced along, the anxiety in his heart mounted. He felt guilt, frenzy, nervousness, apprehension, and all sorts of other emotions, all of which shoved him deeper into madness!\u003c/p\u003e \n\u003cp\u003eVery rarely in Bai Xiaochun’s life did he ever wish to kill people, but in this situation, he had been pushed too far. He had just spent a month searching for clues, and now that he had a target, it was impossible for him to dispel that killing intent.\u003c/p\u003e \n\u003cp\u003eOf course, through it all, he reminded himself that his main goal right now was not revenge; it was to save Bai Hao.\u003c/p\u003e \n\u003cp\u003eHe and his 4,000 corpse troopers sailed over dozens of boroughs until they closed in on Borough 61, where a heavenly marquis pagoda rose high into the air. When Bai Xiaochun saw it, his eyes flashed with sharp light.\u003c/p\u003e \n\u003cp\u003eThis place was the Zhou Clan!\u003c/p\u003e \n\u003cp\u003eAfter scanning the place with divine sense but finding nothing, he turned and transmitted a message to his silver-armored corpse trooper. “Can you detect a hidden chamber anywhere in the Zhou Clan? A chamber containing a celestial necromancer?!”\u003c/p\u003e \n\u003cp\u003eThe silver-armored corpse-trooper’s eyes flashed, and he studied the Zhou Clan. After a moment, he shook his head. “There must be some unique secret magic at work that defies divine sense….”\u003c/p\u003e \n\u003cp\u003eBai Xiaochun’s eyes narrowed, and yet he didn’t hesitate. As soon as he was outside the Zhou Clan, he loudly said, “I want 2,000 corpse troopers to form a perimeter. No one is allowed to enter this clan from the air or the ground. Nor may anyone leave!!” Instantly, 2,000 of the corpse troopers flew out and formed ranks, locking down everything around the Zhou Clan!\u003c/p\u003e \n\u003cp\u003eThey… were completely surrounded!\u003c/p\u003e \n\u003cp\u003eThe 2,000 corpse troopers quickly created a spell formation which caused black smoke to roil out and cover the entire Zhou Clan, sealing it completely!\u003c/p\u003e \n\u003cp\u003eCries of alarm rang up from inside the clan, especially from the appointed successor in the clan. As for the marquis himself, he looked up angrily at the corpse trooper army, at the seal locking down the clan, and at Bai Xiaochun with his murderous aura.\u003c/p\u003e \n\u003cp\u003eIt only took a moment for the heavenly marquis to realize what was happening. He was one of the very few people in the clan who knew that Miao Lin’er’s grandfather was hiding amongst them, and that his clan had been one of the people involved in the abduction of the inspections commissioner’s soul slave.\u003c/p\u003e \n\u003cp\u003eTherefore, his anger regarding the Proclamation of Universal Grace had mostly been a mask to cover his anxiety.\u003c/p\u003e \n\u003cp\u003eThe fact that Bai Xiaochun had suddenly shown up caused his face to fall and his mind to reel with the realization that… he knew the truth!!\u003c/p\u003e \n\u003cp\u003e“Activate the formation!” he said. Then he bit down on his tongue and spit out a mouthful of blood. That blood was a key aspect needed to activate the clan’s spell formation. A moment later, a huge blood-colored shield sprang up, instantly spreading out to protect the clan.\u003c/p\u003e \n\u003cp\u003eThat was the exact moment in which Bai Xiaochun and his 2,000 corpse troopers arrived. Without the slightest hesitation, he immediately had the corpse troopers violently attack the shield!\u003c/p\u003e \n\u003cp\u003eMost shocking of all though, were not the brutal corpse troopers, but Bai Xiaochun, who had a vicious snarl on his face as he attacked with the explosive violence of an erupting volcano.\u003c/p\u003e \n\u003cp\u003eRUUUUUUUUMBLE!\u003c/p\u003e \n\u003cp\u003eHeaven and earth shook violently, and a huge shockwave blasted out in all directions, causing many nearby structures to rock back and forth.\u003c/p\u003e \n\u003cp\u003eThe blood-colored shield immediately began to twist and distort, and then, after only a few breaths of time passed, it shattered into countless fragments that rained down onto the clan below.\u003c/p\u003e \n\u003cp\u003eThe clan was thrown into a huge commotion, with many cultivators coughing up blood and looking up with incredulity. Some even began to cry out.\u003c/p\u003e \n\u003cp\u003e“What are you doing, Bai Hao?!?!”\u003c/p\u003e \n\u003cp\u003e“Our clan didn’t break any rules, nor did we offend you! What are you doing!?!?”\u003c/p\u003e \n\u003cp\u003eThe heir apparent of the clan was also present. Eyes flashing with anger, he shouted, “This is an abuse of power, Bai Hao! You’re using your public office to get revenge for personal matters! The Grand Heavenmaster is going to find out about this, and the rest of the nobility and aristocracy too! Nobody will be able to protect you then. You’ll die for sure!! Fellow clan members! Join forces! If we stand against him for long enough, someone will definitely come to rescue us!!” \u003c/p\u003e \n\u003cp\u003eHowever, even as he spoke these words, he fled in the direction of his heavenly marquis pagoda!\u003c/p\u003e \n\u003cp\u003eAlthough not everyone in the clan leaped to obey the orders of the heir apparent, many of the senior generation flew angrily up into the sky toward Bai Xiaochun. Even some of the most loyal of the clan servants joined them.\u003c/p\u003e \n\u003cp\u003eThere were more than a thousand in total. And yet, as soon as they met Bai Xiaochun’s advancing corpse troopers, fierce fighting broke out, along with agonized shrieks.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-795\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-797\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-796","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
