{"id":46214,"no":897,"title":"Chapter 895: Breaking The Shackle","content":"\u003cp\u003eBai Xiaochun had finally resolved all of the crises facing the River-Defying Sect. He himself was now a deva patriarch of the Starry Sky Dao Polarity Sect, and had put the River-Defying Sect in the position of being the absolute overlord of the Middle Reaches cultivation world.\u003c/p\u003e\n\u003cp\u003eOn top of that, he had successfully concocted a Deva Pill for the extremely long-lived Patriarch Spirit Stream, giving him a very good chance of reaching the Deva Realm. Bai Xiaochun was very satisfied with everything.\u003c/p\u003e\n\u003cp\u003eAt the moment, he stood outside of his immortal\u0027s cave, petting Bruiser’s head and looking around at the sect. The disciples were still busy with the renovation work, and were in very high spirits.\u003c/p\u003e\n\u003cp\u003e\u003cspan id\u003d\"footnote-ref-73de\"\u003e\u003cspan\u003eFeeling more than wonderful, he flicked his sleeve, stuck his chin up and murmured, “I\u0027m happy. Everybody’s happy. I\u0027m strong. The sect is strong…. Ah, Bruiser, you know I’m the kind of person who likes the limelight. Who could ever have imagined that fate would lead me here… a patriarch at such a young age…. I\u0027m not old at all!” He shook his head and sighed, feeling more proud of himself than ever.\u0026nbsp;\u003c/span\u003e\u003ca href\u003d\"#footnote-73de\"\u003e[1]\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“I never wanted to go back to the Starry Sky Dao Polarity Sect, but as you saw, the demigod patriarch personally asked me to go. What a headache!\u003c/p\u003e\n\u003cp\u003e“I\u0027m also an elder in the Hall of Steel Veins, which is a really rare thing. I guess I have no choice in the matter. All my old friends and war buddies are there. I really just have to accept my status.\u003c/p\u003e\n\u003cp\u003e“What do you think, Bruiser…? Why am I just such a genius? Ai….” A scowl of helplessness slowly spread out across his face.\u003c/p\u003e\n\u003cp\u003eBruiser blinked a few times and looked around, only to find that they were alone, prompting him to snort quietly. After all, Bai Xiaochun usually only acted depressed like this when he knew people were around to see him.\u003c/p\u003e\n\u003cp\u003eWhen Bai Xiaochun saw the reaction he was getting, he cleared his throat and then bopped Bruiser on the head.\u003c/p\u003e\n\u003cp\u003e“Play along!” he said with a glare. “You know what that means? From now on, whenever you hear me talking like this, you need to \u003cem\u003eplay along\u003c/em\u003e. That’ll make me like you even more, alright?”\u003c/p\u003e\n\u003cp\u003eAt first Bruiser whimpered, but then he quickly changed his expression to match Bai Xiaochun’s. When Bai Xiaochun saw how depressed he looked, he frowned and added a few more words.\u003c/p\u003e\n\u003cp\u003e“No, that’s not the right expression. Listen, when you hear me say things like I just said, you need to look excited! Sigh deeply and with meaning! Make it seem like you’re resigning yourself to a truly bitter fate!” After receiving a few more pointers, Bruiser finally got the right expression onto his face. With that, Bai Xiaochun started over with his act, and Bruiser played along.\u003c/p\u003e\n\u003cp\u003e“Hahaha! Great job, Bruiser. Alright, come along with dad as I take a walk. Remember, when you hear me say those things, put that expression on your face immediately!” In very high spirits, Bai Xiaochun led Bruiser on a stroll through the sect. Wherever they went, the people they encountered would offer respectful formal greetings.\u003c/p\u003e\n\u003cp\u003eWhenever there was a big enough of a crowd, Bai Xiaochun would sigh and monologue a bit. The disciples who didn’t know much about him would be shocked. The ones who knew him, though, would simply sigh; this was not their first time seeing him act in a way like this.\u003c/p\u003e\n\u003cp\u003eBruiser played along perfectly, and worked very hard at it. As Bai Xiaochun sighed, he would wail and wrap himself around Bai Xiaochun’s leg, eyes shining with a look of comfort. It was as if he were saying to Bai Xiaochun…\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eIt’s simply your fate to be such a genius….\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThose who saw this happening were shocked, and many a strange expression could be seen. As for Bai Xiaochun, his delight mounted, and he dragged Bruiser from one place to another for an entire day. The more people who called out greetings to him as a patriarch, the more strange expressions could be seen.\u003c/p\u003e\n\u003cp\u003e“Uh… how come the patriarch is acting so strange…?”\u003c/p\u003e\n\u003cp\u003e“Maybe all devas are like this?”\u003c/p\u003e\n\u003cp\u003e“Oh, you guys have no idea…. Bai Xiaochun, er… Patriarch Bai was always like this. Um… you just need to get used to it, that’s all.”\u003c/p\u003e\n\u003cp\u003eTalk like that followed Bai Xiaochun wherever he went in the sect…. The next day, his enthusiasm had not yet waned, and the same scene played out again….\u003c/p\u003e\n\u003cp\u003eHe went to see Beihan Lie three times, nearly driving him mad. Beihan Lie would always greet him with the utmost respect, and then be forced to listen to Bai Xiaochun’s endless sighs. On the second day, Beihan Lie chose to go into secluded meditation.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was a bit saddened by that, but then he went to find Shangguan Tianyou…. In fact, he went to see all of the people he knew in the Spirit Stream Division. After that, he went to the Blood Stream Division….\u003c/p\u003e\n\u003cp\u003eIt was in that fashion that three whole days passed, until everyone in the River-Defying Sect came to fully understand Bai Xiaochun’s personality. Wry smiles could be seen everywhere, and many people began to avoid him as soon as they saw him off in the distance. After all, he didn’t seem anything like a deva patriarch in person.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun did not get discouraged. Actually, he became more focused. In fact, he had just decided to go look into the specifics of why Beihan Lie was in secluded meditation when Song Junwan finally had enough. Rushing over angrily, she rebuked him up and down until he finally rubbed his nose and gave up on acting like a patriarch.\u003c/p\u003e\n\u003cp\u003e“All I was doing was sighing and saying a few things…. Ah, whatever. I guess if I’m not even allowed to sigh, I’ll just go into secluded meditation.” After all, he would be in the Starry Sky Dao Polarity Sect soon, and nobody there would care if he went around sighing.\u003c/p\u003e\n\u003cp\u003eFilled with aspirations for what was to come, he went into meditation.\u003c/p\u003e\n\u003cp\u003eFor one thing, he needed to wait until Patriarch Spirit Stream achieved his breakthrough. And also, he had still not yet stabilized his cultivation base after his recent breakthrough. And then there was the Undying Codex. Having mastered the Undying Bones, and having achieved a breakthrough, he was now in the position… to break through the fourth shackle of the human body!\u003c/p\u003e\n\u003cp\u003eOnce that happened, he knew that his fleshly body power would increase. Most importantly… he would be able to cultivate the final part of the Undying Codex….\u003c/p\u003e\n\u003cp\u003eThe Undying Blood!!\u003c/p\u003e\n\u003cp\u003e“The Undying Blood is the true essence of the Undying Codex. If I succeed with that… I won’t necessarily be truly undying, but… I definitely won’t be dying anytime soon!” With that thought on his mind, he got to work.\u003c/p\u003e\n\u003cp\u003eAfter sitting down cross-legged, he cast his senses inward to the shocking spiritual power of heaven and earth that flowed through him constantly. It almost made him feel as if he were a part of the world around him!\u003c/p\u003e\n\u003cp\u003eEvery move he made could be filled with heavenly might, and every breath he took could rumble like thunder!\u003c/p\u003e\n\u003cp\u003e“So this is what it’s like to be a deva…. It’s totally different from the Nascent Soul stage. A complete transformation!” The more he probed his cultivation base, the more excited he got. Furthermore, he could tell that after becoming a deva, his longevity had grown vastly more vigorous.\u003c/p\u003e\n\u003cp\u003e“I wonder if… I could live for 5,000 years now?” The thought excited him, and he began to do some calculations, but was soon disappointed to realize that he probably couldn’t reach 5,000….\u003c/p\u003e\n\u003cp\u003e“Ai. I\u0027m still very far away from my goal of being able to live forever.” After examining his cultivation base for a bit longer, he sank into a trance and began to work on his fleshly body power.\u003c/p\u003e\n\u003cp\u003eCracking sounds could be heard inside of him, which came from his bones. The power of his qi and blood erupted out, causing the air in his secluded meditation chamber to twist and distort as a vortex sprang up around him.\u003c/p\u003e\n\u003cp\u003eBased on the fluctuations, Bai Xiaochun was sure that he could sense… the fourth shackle!\u003c/p\u003e\n\u003cp\u003eIt felt much the same as the previous three shackles. Although the sensation wasn’t particularly clear, he was sure that something like an enormous mountain was weighing down on him with profound heaviness.\u003c/p\u003e\n\u003cp\u003eAll of a sudden, he felt the impulse to smash into that mountain!!\u003c/p\u003e\n\u003cp\u003eEyes widening, he shouted, “It\u0027s time to break the fourth shackle!”\u003c/p\u003e\n\u003cdiv id\u003d\"footnote-73de\"\u003e\n \u003cp\u003e1. I’m not quite sure if it’s supposed to be a play on words or not, but the word for patriarch in Chinese has the character “old” in it….\u003ca href\u003d\"#footnote-ref-73de\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-894\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-896\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-895","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
