{"id":45408,"no":91,"title":"Chapter 89: Just Concede","content":"\u003cp\u003eAs Bai Xiaochun looked up, one of the north bank’s five great Chosen, Beihan Lie, suddenly smiled. He was handsome to begin with, but his smile made him even more attractive to the countless female disciples who adored him.\u003c/p\u003e\n\u003cp\u003ePatting the ferocious Nightstalker Beast which lounged next to him, he took a step forward. The Nightstalker Beast slowly rose to its feet, eyes shining with mysterious light.\u003c/p\u003e\n\u003cp\u003eAlmost as soon as the huge dog began to move, numerous north bank disciples began to cheer.\u003c/p\u003e\n\u003cp\u003eThe Nightstalker Beast was roughly three meters tall, heavily muscled, and brimming with seemingly endless power. Its head was huge, and the enormous fangs which protruded from its mouth dripped with saliva. Its long black fur made it seem even more fierce.\u003c/p\u003e\n\u003cp\u003eIts legs were about as thick as an entire person, and had bone spurs sticking out all over them. It crouched down for a moment, then leaped out into the arena, where it threw its head back and roared.\u003c/p\u003e\n\u003cp\u003eThe roar became a sound wave that rolled out in all directions. Many beasts belonging to other north bank disciples began to tremble and bow their heads, as if they were in the presence of royalty.\u003c/p\u003e\n\u003cp\u003eAll smiles, Beihan Lie walked out and scanned the crowd from the south bank.\u003c/p\u003e\n\u003cp\u003e“Beihan Lie of the north bank. I wonder which fellow disciple I’ll be fighting today?”\u003c/p\u003e\n\u003cp\u003eAt the same time, the huge dog’s saliva splashed down onto the ground, and it looked around with cold, brutal eyes. Its fangs even seemed to grow longer all of a sudden. Anyone who faced such a dog would surely lose their fighting spirit instantly, especially when it licked its lips, which made it look even more ferocious than before.\u003c/p\u003e\n\u003cp\u003eThe crowd from the south bank was completely silent as they looked at the group up front, waiting for someone to step out and fight. Bai Xiaochun glanced at Beihan Lie and then the huge dog. After looking up thoughtfully for a moment, an odd expression appeared on his face. Clearing his throat, he proudly took a step forward.\u003c/p\u003e\n\u003cp\u003eAlmost immediately, the eyes of numerous south bank disciples came to be fixed on him, and they shone with anticipation. The huge Nightstalker Beast’s shining green eyes also locked onto him.\u003c/p\u003e\n\u003cp\u003eLooking like a powerful hero, Bai Xiaochun stuck his chin up and strode out into the arena. Up above, Elder Zhou’s bird looked down attentively.\u003c/p\u003e\n\u003cp\u003e“Bai Xiaochun of the south bank!” As soon as Bai Xiaochun announced himself, the Nightstalker Beast threw its head back and howled, the brutal gleam in its eyes transforming into a murderous aura directed solely at Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eBeihan Lie took one look at Bai Xiaochun’s getup, and did nothing to conceal the derision in his eyes. “Bai Xiaochun? I heard you took first place in the south bank qualifying round, is that right?”\u003c/p\u003e\n\u003cp\u003eAlthough Bai Xiaochun’s heart trembled under the murderous gaze of the huge dog, he continued to hold himself like a powerful master, as lofty as a cloud floating in the sky. “You’re Beihan Lie, right? I’ll give you one chance to concede!”\u003c/p\u003e\n\u003cp\u003eBeihan Lie’s jaw dropped. “Concede?”\u003c/p\u003e\n\u003cp\u003eHe threw his head back and laughed uproariously, as if he had just heard the funniest joke in the world. However, a murderous gleam could be seen in his eyes.\u003c/p\u003e\n\u003cp\u003e“Very funny. In all the years, you’re the first Outer Sect disciple who has ever dared to utter such words to me.” Next, he extended his right hand and performed an incantation gesture, taking control of his Nightstalker Beast.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun sighed. Looking like a lonely hero, he gazed sadly at Beihan Lie and said, “Beihan Lie, this is your last chance to concede. When I attack, I frighten even myself. I\u0027m telling you... the best thing would be to not force my hand.”\u003c/p\u003e\n\u003cp\u003eThe crowd from the south bank was struck mute. They stared, first at Bai Xiaochun, then at Beihan Lie, and then at the huge, ferocious dog. No matter which way they looked at the situation, Beihan Lie seemed to be far more powerful.\u003c/p\u003e\n\u003cp\u003eHowever, Bai Xiaochun’s words at least put a seed of hope into the hearts of the south bank disciples. And yet, they couldn’t help but remember the unsavory record of his past dealings, which filled their hearts with consternation.\u003c/p\u003e\n\u003cp\u003eAs for the north bank audience, they roared with laughter and made all sorts of taunting statements.\u003c/p\u003e\n\u003cp\u003e“Is this guy a moron or what? Elder Brother Beihan is one of the five great Chosen. Although he might not be on the same level as Ghostfang, even Elder Brother Ghostfang has to admit that he’s strong. Who does this Bai Xiaochun think he is? How arrogant!”\u003c/p\u003e\n\u003cp\u003e“Not only is Elder Brother Beihan strong, his Nightstalker Beast has been praised by the elders. It’s the king of beasts, with a powerful fleshly body and boundless energy. Even its howl is enough to shock most people into a daze. Look at this Bai Xiaochun... he’s so dainty the Nightstalker Beast will probably bite his leg off with a single bite!”\u003c/p\u003e\n\u003cp\u003e“Elder Brother Beihan will definitely win this one!”\u003c/p\u003e\n\u003cp\u003eBeihan Lie appeared to be highly amused by Bai Xiaochun. Eyes flashing coldly, he decided that he would teach him a hard, painful lesson. If he didn’t kill him, he would shred his skin off. With that, he performed an incantation gesture to begin the fight.\u003c/p\u003e\n\u003cp\u003e“I’m serious, my attacks frighten even me,” Bai Xiaochun said. Sighing, he slapped his bag of holding to produce two medicinal pills.\u003c/p\u003e\n\u003cp\u003eAs that happened, Beihan Lie smiled viciously and finished his incantation gesture. Instantly, the eager Nightstalker Beast howled and began to charge toward Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eBeihan Lie also burst into motion, flying along, the sun mark on his forehead radiating bright light as he flew toward Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eHowever, even as the man and the dog flew toward him, Bai Xiaochun jumped up into the air and sent one of the medicinal pills flying toward the Nightstalker Beast.\u003c/p\u003e\n\u003cp\u003eThe Nightstalker Beast’s eyes gleamed as it roared through the air. It obviously could have avoided the medicinal pill, but instead, its expression flickered, and it grabbed the pill and swallowed it down.\u003c/p\u003e\n\u003cp\u003eInstantly, a tremor ran through the huge dog, and its eyes went bloodshot. Rumbling sounds echoed out as it began to grow larger and more muscular.\u003c/p\u003e\n\u003cp\u003eShockingly, its bone spurs and fangs also grew longer!\u003c/p\u003e\n\u003cp\u003eIt began to salivate, and also, something rod-like... bulged out between its legs!\u003c/p\u003e\n\u003cp\u003eOverall, it looked so ferocious and terrifying that it was difficult to put into words.\u003c/p\u003e\n\u003cp\u003eIts eyes became violet, and it began to pant. Mind muddled, it dug its claws into the ground, threw its head back, and let out a shocking howl, the sound of which caused the south bank disciples in the audience to gasp.\u003c/p\u003e\n\u003cp\u003e“What... what kind of medicinal pill was that!?!?”\u003c/p\u003e\n\u003cp\u003e“Hold on, why does that dog’s posture seem so familiar...?”\u003c/p\u003e\n\u003cp\u003eThe disciples on the north bank were looking on with wide eyes. The changes in the Nightstalker Beast were obvious, and somehow, it now seemed even more terrifying than before. Not only was it stronger in terms of its fleshly body, it also seemed even more maddened than before. The north bank disciples were greatly shocked.\u003c/p\u003e\n\u003cp\u003e“That medicinal pill is so effective!”\u003c/p\u003e\n\u003cp\u003e“It can actually make wild beasts even more wild!!”\u003c/p\u003e\n\u003cp\u003eThe audience was astonished, and so was Beihan Lie, who was unsure of exactly what was happening. Although the Nightstalker Beast was obviously a lot more powerful than before, he had the sinking feeling that something was wrong.\u003c/p\u003e\n\u003cp\u003e“I’ll warn you one more time,” Bai Xiaochun said coolly, sticking his jaw out. “Concede.”\u003c/p\u003e\n\u003cp\u003eBeihan Lie’s eyes shone with murderous light. “I’d only planned to break one of your arms, but since you’re trying to act so mysterious, I think I’ll break all of your limbs instead!”\u003c/p\u003e\n\u003cp\u003eAlthough taking lives was prohibited in the Chosen battles, serious injuries were often unavoidable. Even as the words left his mouth, he continued his charge toward Bai Xiaochun.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun sighed and waved his right hand, sending one of his Pheromone Pills out toward Beihan Lie.\u003c/p\u003e\n\u003cp\u003eAfterward, he fell back at top speed until he was at the edge of the arena, where he stood nervously, looking at Beihan Lie.\u003c/p\u003e\n\u003cp\u003eBeihan Lie’s pupils constricted, and just when he was about to dodge out of the way, the pill detonated, transforming into a powder that filled the area. Even though he tried to avoid it, some of it happened to get on him.\u003c/p\u003e\n\u003cp\u003eHis expression flickered. Assuming it was a poison pill, he fell back and quickly examined himself. However, he found nothing out of the ordinary except for a somewhat pleasant aroma.\u003c/p\u003e\n\u003cp\u003eA frown appeared on his face. The situation only seemed to be getting stranger and stranger. Just when he was going to attempt to end the battle once and for all, a howl split the air.\u003c/p\u003e\n\u003cp\u003eIt was none other than the Nightstalker Beast, which turned toward Beihan Lie, panting, its eyes shining bright red.\u003c/p\u003e\n\u003cp\u003eBeihan Lie’s heart began to pound, and just when he was about to try to exert control over the dog, a terrifying roar shook everything, and the Nightstalker Beast began to charge in his direction. Its speed was incredible, giving Beihan Lie absolutely no time to dodge. Instantly, the Nightstalker Beast pounced on him.\u003c/p\u003e\n\u003cp\u003e“Dammit, are you crazy!?!? What are you doing?!” Beihan Lie’s face darkened, and he roared in fury, but the huge dog had him pinned tight. Because of the maddened Nightstalker Beast, Beihan Lie couldn’t move a muscle. Furthermore, he suddenly had a very terrifying premonition, and his face went pale.\u003c/p\u003e\n\u003cp\u003eAt the same time, the Outer Sect disciples in the audience couldn’t help but crane their necks to see what was happening. Even the peak lords and elders were watching closely, and the divine sense belonging to the prime elders was focused intently on the scene.\u003c/p\u003e\n\u003cp\u003eNext, everyone gasped as... Beihan Lie began to let out miserable shrieks!\u003c/p\u003e\n\u003cp\u003e“No... NO... YOU!! AIIIEEE!!!” Beihan Lie’s bloodcurdling screams could shake heaven and earth. His expression was that of pain and confusion, as though he couldn\u0027t believe what was happening. Trembling, he could do nothing but scream.\u003c/p\u003e\n\u003cp\u003eThe north bank disciples were in an uproar, and could hardly believe what they were seeing. Panting, their eyes filled with unprecedented fear and terror.\u003c/p\u003e\n\u003cp\u003e“Heavens!! What medicinal pill is that? It isn’t turning the dog crazy, it’s turning the dog... on!”\u003c/p\u003e\n\u003cp\u003e“Th-this... this....”\u003c/p\u003e\n\u003cp\u003e“Elder Brother Beihan is... being done by his battle beast?!”\u003c/p\u003e\n\u003cp\u003eBeihan Lie struggled frantically, and let out constant, desperate screams. What was happening now would become a legend the likes of which had never existed in the Spirit Stream Sect.\u003c/p\u003e\n\u003cp\u003eEven Ghostfang was watching with wide eyes, trembling in utter disbelief.\u003c/p\u003e\n\u003cp\u003eAs for the south bank disciples, their minds were spinning, and they could hardly think straight. Shangguan Tianyou stared blankly, suddenly feeling as if the world were a much darker place than before. Zhou Xinqi, on the other hand, was blushing fiercely.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun stood off to the side, just as shaken as everyone else. This was his first time using his Aphrodisiac Pill in battle, and he had never imagined that the results would be so astonishing.... As he watched the screaming Beihan Lie, he couldn’t hold back from sighing.\u003c/p\u003e\n\u003cp\u003eSounding very innocent, he said, “Like I said, even I am frightened by my attacks. I told you several times, but you... just insisted on doing things your way.”\u003c/p\u003e\n\u003cp\u003eIt was at this point that an enraged roar filled the air as Beihan Lie’s Master finally intervened. “Bai Xiaochun!!”\u003c/p\u003e\n\u003cp\u003eMurderous aura raging, he leaped forward, flicking his sleeve to send the Nightstalker Beast spinning away off into the distance. Then he picked up Beihan Lie, who by this point had absolutely no face left. The Master almost felt as if what had just occurred wasn\u0027t even real. Too embarrassed to stay, he glared angrily at Bai Xiaochun and then departed.\u003c/p\u003e\n\u003cp\u003eAs for Beihan Lie, the mental and physical injuries he had sustained caused him to close his eyes and lapse into a coma. It was impossible to say when he would have the face to appear in public again. The pain he was in was like a living nightmare.\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-88\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-90\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-89","bookId":1496,"creation":"Sep 10, 2019 2:52:08 AM","modification":"Sep 10, 2019 2:52:08 AM"}
