{"id":46230,"no":913,"title":"Chapter 911: Doubts!","content":"\u003cp\u003eThe Starry Sky Dao Polarity Sect had been plunged into chaos. Thankfully, the black smoke only affected the rainbow, and not the cities on the ground. The sudden sharp contrast between the two areas caused the disciples down below to stare up in complete astonishment.\u003c/p\u003e\n\u003cp\u003eAs of this moment, the Starry Sky Dao Polarity Sect seemed to be covered with an obscuring darkness filled with cries and shouts of alarm.\u003c/p\u003e\n\u003cp\u003eThe disciples down below were left feeling very unsettled.\u003c/p\u003e\n\u003cp\u003e“What’s…. that?”\u003c/p\u003e\n\u003cp\u003e“Heavens! What divine ability is that?!?!”\u003c/p\u003e\n\u003cp\u003eThe crowds in the four big cities down below were all gasping in shock. However, there were a few hundred people in Sky City who were frightened, but at the same time, rejoicing. They even began to express their gratitude verbally to two other disciples who stood in their midst. Big Fatty Zhang and Xu Baocai.\u003c/p\u003e\n\u003cp\u003e“Brother Zhang, I have only you to thank for this. You have my complete and utter gratitude!”\u003c/p\u003e\n\u003cp\u003e“Brother Baocai, words can\u0027t express how thankful I am. If you ever have any problems in the future, come look for me, and I’ll be sure to find a way to repay you!”\u003c/p\u003e\n\u003cp\u003eXu Baocai and Big Fatty Zhang were trembling in fear just like everyone else was. They knew Bai Xiaochun far too well, and when they had learned earlier that he was concocting medicine, they had immediately fled in fear. After all, when Bai Xiaochun made up his mind, it was impossible to dissuade him, and therefore, the best option was to just leave.\u003c/p\u003e\n\u003cp\u003eNeither of them had felt that staying on the rainbow was safe, and therefore, they had gritted their teeth and gone all the way down to Sky City. Only then did they finally feel safe.\u003c/p\u003e\n\u003cp\u003eOf course, they couldn’t bear to leave all of the people they had recruited into their faction behind, and had therefore sent messages warning them that something big was about to happen, and that the safest thing was to temporarily move down to Sky City.\u003c/p\u003e\n\u003cp\u003eSome had assumed that they were making a mountain out of a molehill, and had ignored them…. Others had been a bit hesitant, but still came down anyway.\u003c/p\u003e\n\u003cp\u003eAfter seeing the black smoke completely covering the rainbow structure, the group who had heeded the warnings couldn’t help but rejoice at their good fortune.\u003c/p\u003e\n\u003cp\u003e“We’re all bros here,” Big Fatty Zhang said, his face still pale from fear, “so don\u0027t even mention it. Like I told you before, when Elder Bai concocts medicine, even gods and ghosts will run for cover!”\u003c/p\u003e\n\u003cp\u003eXu Baocai took a deep breath, frowned in concentration, and then said, “Furthermore, you listen to me. Based on what I know about Elder Bai, and the things I\u0027ve experienced… I can tell you that things aren’t over yet. You absolutely, positively must not go back up there yet!”\u003c/p\u003e\n\u003cp\u003eBack up on the rainbow, the disciples were all descending into madness. As for Bai Xiaochun, he flew up to hover in the air above the blue rainbow, where he looked around anxiously at all the black smoke.\u003c/p\u003e\n\u003cp\u003e“I\u0027m a deva, whose will can surpass that of the heavens. And yet I can’t do anything about the smoke from some exploding pill furnaces…. Something seems off about this!” He really couldn’t stop wondering about the whole thing. He had been working very hard to control the situation, and yet had been powerless against the smoke.\u003c/p\u003e\n\u003cp\u003e“You know, it\u0027s been like that ever since I started this concocting session…. I\u0027m a deva, and yet I haven’t been in control at all. It doesn’t make sense. Even if something unexpected occurred, I should have been able to prevent anything bad from happening. And yet… the bad stuff just keeps happening.” He couldn’t come up with any answers, something that he found hard to accept.\u003c/p\u003e\n\u003cp\u003e\u003cspan id\u003d\"footnote-ref-ed70\"\u003e\u003cspan\u003e\u003cspan id\u003d\"footnote-ref-6013\"\u003e\u003cspan\u003e“And that’s not even mentioning the fact that my skill in the Dao of medicine has improved a lot….” There was no answer. It was just like how the Will he had begun to develop in the Gold Core stage had vanished without a trace when he formed his Heaven-Dao Nascent Soul…. There was absolutely no explanation he could think of.\u0026nbsp;\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003ca href\u003d\"#footnote-ed70\"\u003e[1]\u003c/a\u003e\u003cspan\u003e\u003ca href\u003d\"#footnote-d68a\"\u003e\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“Ah, whatever. I caused the problem, but I fixed it. I guess I should be happy.” With his divine sense, he could confirm that all of the disciples who had been affected by the uncaring fruit were showing no symptoms at all thanks to the black smoke.\u003c/p\u003e\n\u003cp\u003eAs for any disciples who had not absorbed any of the aura of the uncaring fruit, he had planned for that as well, and made sure that they wouldn’t even feel the slightest discomfort.\u003c/p\u003e\n\u003cp\u003e“That black smoke doesn’t have even an ounce of poison in it!” As the smoke began to dissipate, a smile broke out on Bai Xiaochun’s face. He had already decided that, for as long as he couldn’t identify the source of the problem and fix it, he wouldn’t concoct any more medicine.\u003c/p\u003e\n\u003cp\u003eIt was around this time that three beams of light suddenly shot through the air toward Bai Xiaochun. They were none other than Li Xiandao, Bai Zhentian, and the deva patriarch from the Hall of Steel Veins.\u003c/p\u003e\n\u003cp\u003eLi Xiandao and Bai Zhentian both had very grim expressions on their faces. Originally, they hadn’t planned to interfere at all, but the matter had reached the point of affecting the entire sect, leaving them no other choice. As for Patriarch Steel Veins, he had a relatively good relationship with Bai Xiaochun, and yet, still had a wry smile on his face as he approached.\u003c/p\u003e\n\u003cp\u003e“Bai, old pal, didn’t you say there wouldn’t be another time…?”\u003c/p\u003e\n\u003cp\u003eNow that the danger had passed, Bai Xiaochun once again bore the demeanor of a deva as he replied, “I\u0027m really sorry, my friend. You see, last time there was an accident that infected some of the disciples with a dangerous substance. Because I was so worried about that, I intentionally sent this smoke out to deliver the antidote to them. If you don’t believe me, just watch. None of the people who the smoke touched will even get uncomfortable.”\u003c/p\u003e\n\u003cp\u003eSmiling faintly, he gestured out at the crowds below.\u003c/p\u003e\n\u003cp\u003eThe three other devas looked down, and immediately saw that Bai Xiaochun was telling the truth. Although most of the disciples were muttering curses and complaints, none of them seemed harmed in the least.\u003c/p\u003e\n\u003cp\u003eThe three devas breathed sighs of relief. After all, if some problems had occurred, then all of them would have been in trouble when the demigod patriarch returned.\u003c/p\u003e\n\u003cp\u003e\u003cspan id\u003d\"footnote-ref-c0ed\"\u003e\u003cspan\u003e\u003cspan id\u003d\"footnote-ref-d68a\"\u003e\u003cspan\u003e“Don’t worry. See? The smoke is vanishing. If you’re still worried, then just relax here for the time it takes an incense stick to burn. Afterward, the entire sect will be completely back to normal!” Apparently, Bai Xiaochun had prepared for a situation like this in advance; he waved his sleeve, summoning a tea table, as well as an incense stick. Sitting down, he gestured for the other devas to join him.\u0026nbsp;\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003ca href\u003d\"#footnote-c0ed\"\u003e[2]\u003c/a\u003e\u003cspan\u003e\u003ca href\u003d\"#footnote-6013\"\u003e\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eBai Zhentian was hesitant, but Li Xiandao and Patriarch Steel Veins sat down and began to chat. Seeing that, Bai Zhentian steeled himself and also sat down.\u003c/p\u003e\n\u003cp\u003ePatriarch Steel Veins was a fellow prime elder, and had helped Bai Xiaochun back in the River-Defying Sect. Therefore, the two of them were actually rather close, so it was only natural that he wanted to make sure the incident with the smoke was smoothed out. “Bai, old pal, your Dao of medicine is shocking. You’ve really shown me a new world today!”\u003c/p\u003e\n\u003cp\u003eFeeling a bit guilty, Bai Xiaochun gave a dry laugh and said, “Oh, I\u0027m just an amateur. My skill isn’t even worth mentioning.”\u003c/p\u003e\n\u003cp\u003eLi Xiandao chuckled and said, “Amateur? Are you kidding? You’re so skilled you can transform the Dao of medicine itself! Brother Bai, you really are incredible.”\u003c/p\u003e\n\u003cp\u003eBai Zhentian was the only one who didn\u0027t say anything. As the group chatted, the incense stick continued to burn down until only about a third of it was left….\u003c/p\u003e\n\u003cp\u003eBy now, much of the smoke had dissipated, revealing the buildings and cultivators beneath. It was at this point that Bai Xiaochun’s expression flickered; something seemed off. Unable to believe what he was seeing, he rubbed his eyes vigorously and then looked around again.\u003c/p\u003e\n\u003cp\u003eHe wasn’t the only one to react in such a way. The other three devas all stared blankly at the areas being revealed by the dissipating smoke.\u003c/p\u003e\n\u003cp\u003eAlthough there was almost no smoke left at all…. The blue rainbow… from top to bottom, was now… black!\u003c/p\u003e\n\u003cp\u003eBeads of sweat popped out on Bai Xiaochun’s head, and the other devas gasped.\u003c/p\u003e\n\u003cp\u003e“Calm down. There’s no need to get antsy here. We still have some time left. Trust me, everything will be fine.” In no mood to drink tea, Bai Xiaochun rose to his feet, trembling. The smoke continued to dissipate, and as it did, the seven rainbows, which had all been very colorful in the past…. were now completely black. Bai Xiaochun’s mind began to reel.\u003c/p\u003e\n\u003cp\u003eRed, Orange, Yellow, Green, Cyan, Blue, Violet…. Before, the seven rainbows that made up the rainbow structure had been seven colors…. But now, they were completely black, buildings and all…. The Starry Sky Dao Polarity Sect was now as black as night!\u003c/p\u003e\n\u003cp\u003eIt was around this time that the disciples began to notice that they were standing on black ground. Jaws dropped, and cries of alarm filled the air.\u003c/p\u003e\n\u003cp\u003e“Why… why is it black?!?!”\u003c/p\u003e\n\u003cp\u003e“Heavens! This is supposed to be a rainbow! Where did the color go?!”\u003c/p\u003e\n\u003cp\u003e“Don’t tell me it got poisoned!!”\u003c/p\u003e\n\u003cp\u003e“Something big is about to happen!!!”\u003c/p\u003e\n\u003cdiv id\u003d\"footnote-6013\"\u003e\n \u003cbr\u003e\n\u003c/div\u003e\n\u003cdiv id\u003d\"footnote-ed70\"\u003e\n \u003cp\u003e1. The part about Willpower and the Gold Core stage came up in \u003ca href\u003d\"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-505\"\u003echapter 505\u003c/a\u003e. Don’t worry, this Willpower thing has not been forgotten. And I want to take this opportunity to point out that Will with a capital W is different from the ordinary \u0027will\u0027 that you hear a lot regarding the will of the heavens and the will of devas. In Chinese, they are two different characters with basically the same general meaning. Uniquely in AWE, they are being used as separate things. \u0026nbsp;\u003ca href\u003d\"#footnote-ref-ed70\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id\u003d\"footnote-c0ed\"\u003e\n \u003cp\u003e2. \u003cspan style\u003d\"color: rgb(0, 0, 0); font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; float: none; display: inline !important\"\u003eChinese tea tables generally\u0026nbsp;\u003c/span\u003e\u003ca href\u003d\"https://cdn.wuxiaworld.com/uploads/deathblade/a-will-eternal/images/l1e1efqd.kph.jpg\" rel\u003d\"noopener noreferrer\" style\u003d\"color: rgb(54, 169, 225); text-decoration: none; background-color: rgb(255, 255, 255); font-family: -apple-system, BlinkMacSystemFont, \u0026quot;Segoe UI\u0026quot;, Roboto, \u0026quot;Helvetica Neue\u0026quot;, Arial, sans-serif, \u0026quot;Apple Color Emoji\u0026quot;, \u0026quot;Segoe UI Emoji\u0026quot;, \u0026quot;Segoe UI Symbol\u0026quot;; font-size: 14px; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px\" target\u003d\"_blank\"\u003elook like this\u003c/a\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; float: none; display: inline !important\"\u003e, with a tea set in the middle, a host seat, and then guest seats located around the table. Of course, there are all sorts of designs, and considering this is a xianxia story, I personally think the tea table would look something\u0026nbsp;\u003c/span\u003e\u003ca href\u003d\"https://cdn.wuxiaworld.com/uploads/deathblade/a-will-eternal/images/ynt3cjnk.ovs.jpg\" rel\u003d\"noopener noreferrer\" style\u003d\"color: rgb(54, 169, 225); text-decoration: none; background-color: rgb(255, 255, 255); font-family: -apple-system, BlinkMacSystemFont, \u0026quot;Segoe UI\u0026quot;, Roboto, \u0026quot;Helvetica Neue\u0026quot;, Arial, sans-serif, \u0026quot;Apple Color Emoji\u0026quot;, \u0026quot;Segoe UI Emoji\u0026quot;, \u0026quot;Segoe UI Symbol\u0026quot;; font-size: 14px; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px\" target\u003d\"_blank\"\u003emore like this\u003c/a\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; float: none; display: inline !important\"\u003e.\u003c/span\u003e\u0026nbsp; \u003ca href\u003d\"#footnote-ref-c0ed\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-910\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-912\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-911","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
