{"id":46258,"no":941,"title":"Chapter 939: Split Them Up!","content":"\u003cp\u003eWhen Bai Xiaochun saw the two enormous faces of the twin Master Cloud Lightnings up in the sky, his heart began to pound. He had already tangled with them more than once in this trial by fire, and now here they were together. It had the potential to be a big problem, and therefore, he immediately sent Sun Wu, Big Fatty Zhang and Song Que away.\u003c/p\u003e\n\u003cp\u003e“This time, you’re \u003cem\u003edead\u003c/em\u003e, Bai Xiaochun!” howled the faces up above, their voices echoing like heavenly thunder. Subsequently, one of them shot toward Bai Xiaochun, and the other headed in the direction of Big Fatty Zhang, Sun Wu and Song Que.\u003c/p\u003e\n\u003cp\u003eObviously, they didn\u0027t just plan to kill Bai Xiaochun, but also the people under his protection.\u003c/p\u003e\n\u003cp\u003eThis new development occurred in the time it takes a spark to fly off of a piece of flint. When Bai Xiaochun realized what was happening, his anxiety spiked. Knowing that his three companions would never be able to escape, he swished his sleeve to gather them into his bag of holding.\u003c/p\u003e\n\u003cp\u003eAs he did, cold gleams flickered through the eyes of the faces high in the sky. Clearly, their hatred for Bai Xiaochun ran very strong and deep!\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t matter that Bai Xiaochun had used his Godkiller technique on Master Cloud Lightning. Now that his two halves were able to team up, they were more confident and prepared than ever. Therefore, it was without the slightest hesitation that they attacked.\u003c/p\u003e\n\u003cp\u003eThe younger brother of the two was adept in matters of speed, so he shot through the air toward Bai Xiaochun. As for the older brother, he was at the peak of the mid Deva Realm, and his attack consisted of countless bolts of lightning that transformed into a shocking hand which reached out toward Bai Xiaochun as if to grab him!\u003c/p\u003e\n\u003cp\u003e“DIE!!” they howled simultaneously.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun was feeling quite nervous, and could tell that the situation was already very dangerous. There was no time for thought or planning. As he backed up, he performed an incantation gesture with both hands, and then waved them out in front of him.\u003c/p\u003e\n\u003cp\u003e“Waterswamp!!” he shouted. Instantly, water vapor roiled out across the plain, turning it into an enormous swamp.\u003c/p\u003e\n\u003cp\u003e“Kingdom!!”\u003c/p\u003e\n\u003cp\u003eIt sounded as if the world were being ripped open. The twin Master Cloud Lightnings’ faces both flickered. Considering that both of them had fought Bai Xiaochun before, they had assumed that they had already seen all of his techniques. Never could they have imagined that they would encounter another unfamiliar move.\u003c/p\u003e\n\u003cp\u003eFurthermore, the watery swamp around them filled them with a sensation of profound danger. Rumbling sounds echoed out as a row of spikes rose up from below. Mountain-toppling, sea-draining force roiled out as the spikes transformed into claws, which were attached to a huge hand. At this point, a shocking howl erupted into the air.\u003c/p\u003e\n\u003cp\u003eThe energy shaking the area made the sky quiver, seemingly on the verge of collapse. The twin Master Cloud Lightnings were both stunned. Because of his speed, the younger brother was a bit closer, and bore the initial brunt of the blow. Blood sprayed from his mouth as he was sent tumbling backward. Meanwhile, the other half of Master Cloud Lightning went all out with his lightning attack. In the blink of an eye, his lightning hand made contact with the claws.\u003c/p\u003e\n\u003cp\u003eThe sky shook and the lands quaked as the lightning palm shattered in the face of the all-powerful Waterswamp Kingdom’s claws. However, this opponent of Bai Xiaochun’s surpassed Chen Hetian and the other devas he had fought in the Starry Sky Dao Polarity Sect. Therefore, the Waterswamp Kingdom rapidly faded away.\u003c/p\u003e\n\u003cp\u003eAs it did, Bai Xiaochun retreated with lightning speed. After all, he knew that he would never be able to win against the combined force of both Master Cloud Lightnings, especially considering that he couldn’t control his Godkiller.\u003c/p\u003e\n\u003cp\u003eTaking advantage of the moments in which the Waterswamp Kingdom was still fading away, Bai Xiaochun fled, and was soon heading toward the horizon.\u003c/p\u003e\n\u003cp\u003e“Now we’ll make \u003cem\u003ehim\u003c/em\u003e enjoy the bitterness of being chased!” The twin Master Cloud Lightnings gritted their teeth. Eyes shining with killing intent, they became bright beams of light that shot after Bai Xiaochun, thunderous sound waves rolling off of them in all directions.\u003c/p\u003e\n\u003cp\u003eFrom a distance, it almost looked like they had combined with each other, but closer examination would reveal that the process was not complete yet. However, even their current level enabled them to surpass the limits of the mid Deva Realm, and achieve speed… comparable to the late realm!\u003c/p\u003e\n\u003cp\u003eWhat made Bai Xiaochun even more nervous was that the twin Master Cloud Lightnings were continuing to merge together, and as they did, the resulting aura contained power that caused his scalp to tingle with fear.\u003c/p\u003e\n\u003cp\u003e“What complete bullying! They bullied me in the staring contest, but couldn’t beat me in a fight, so now they\u0027re ganging up! The Nine Heavens Cloud Lightning Sect is full of bullies!” Heart pounding, he called upon the Undying Hex for a burst of speed. Behind him, rumbling sounds echoed out as the twin Master Cloud Lightnings continued to merge, and also send attacks his way.\u003c/p\u003e\n\u003cp\u003eFrom a distance, it was possible to see lightning bolts slamming repeatedly into Bai Xiaochun, with the resulting explosions sending black smoke billowing out around him, which would reduce his speed. And with every moment that passed, the twin Master Cloud Lightnings got closer.\u003c/p\u003e\n\u003cp\u003eFeeling very nervous, Bai Xiaochun called out, “Uh… Fellow Daoists Cloud Lightning, don’t push things too far, okay? I have a trump card designed specifically for you two. Even I\u0027m afraid of what will happen if I use it.”\u003c/p\u003e\n\u003cp\u003eThe twin Master Cloud Lightnings snorted coldly and continued to close in, their murderous auras raging. Bai Xiaochun was a blur as he used his Mountain Shaking Bash to avoid the lightning attacks, and the Undying Hex to buy speed.\u003c/p\u003e\n\u003cp\u003eUnfortunately, his anxiety only continued to mount. When he had used the Waterswamp Kingdom moments ago, he had clearly seen how incredibly powerful the twin Master Cloud Lightnings would be if they fully combined. And that was now happening as he watched!\u003c/p\u003e\n\u003cp\u003e“I can’t let things go on like this. I need to prevent them from combining…. Damnation! What technique can actually split a person in two? I need to prevent them from getting together… I need to split them up… hey!”\u003c/p\u003e\n\u003cp\u003eIn that critical moment, an idea struck him without any warning.\u003c/p\u003e\n\u003cp\u003e“Split them up?!” he thought excitedly. Maintaining full speed, he secretly pulled out a Breakup Pill, and at the same time, produced his flying shuttle. After using a secret magic to conceal the pill inside the shuttle, he hurled it back at the twin Master Cloud Lightnings.\u003c/p\u003e\n\u003cp\u003e“Eee? Fellow Daoists Cloud Lightning, that’s your flying shuttle, right? Aiya, I randomly happened across it a while back, and based on the aura, I can tell it\u0027s yours. Alright, just take it back!” Both of the twin Master Cloud Lightnings were visibly taken aback by his words.\u003c/p\u003e\n\u003cp\u003eNever could they have imagined that Bai Xiaochun, who had previously acted so imperious and disdainful, would go and say something like this.\u003c/p\u003e\n\u003cp\u003eHowever, before they could do anything other than be surprised, Bai Xiaochun performed an incantation gesture and shouted, “Detonate!”\u003c/p\u003e\n\u003cp\u003eThe flying shuttle exploded, sending out a shockwave that completely enveloped the twin Master Cloud Lightnings.\u003c/p\u003e\n\u003cp\u003eThe detonation also burst the Breakup Pill, sending a black mist roiling out in all directions.\u003c/p\u003e\n\u003cp\u003eBai Xiaochun didn\u0027t bother to even look back at the result, and simply picked up more speed. As he did, a violet bolt of lightning shot out from the black mist and the fragments of the flying shuttle.\u003c/p\u003e\n\u003cp\u003eThat lightning bolt was none other than the twin Master Cloud Lightnings, their expressions unsightly and their murderous auras boiling.\u003c/p\u003e\n\u003cp\u003e“A hidden poison pill? You think trash like that can hurt me? In my combined state, I\u0027m impervious to all poisons!” Both of the twin Master Cloud Lightnings spoke at the same time, their voices combining in bizarre fashion. It was at this point that Bai Xiaochun realized there were soul fluctuations within the voice that gave a bit of insight into the twin Master Cloud Lightnings’ current state. Clearly, they were not yet fully combined, and needed more time to complete the process.\u003c/p\u003e\n\u003cp\u003e“The Breakup Pill didn’t work?” he thought, disappointed. “Don’t tell me that it only works between men and women? Or was the dose too weak?”\u003c/p\u003e\n\u003cp\u003eHe considered turning to fight, but also had the feeling that if there were any major weaknesses because of their partially-combined state, the twin Master Cloud Lightnings wouldn’t be pursuing him so aggressively.\u003c/p\u003e\n\u003cp\u003e“They must be trying to trick me!” he thought. Not willing to risk it, he gritted his teeth and continued onward.\u003c/p\u003e\n\u003cp\u003eThe twin Master Cloud Lightnings frowned and exchanged a glance. Yet again, they found Bai Xiaochun’s behavior to be incongruous. In their estimation, the fact that the combining process was not complete should have prompted Bai Xiaochun to turn and fight. Of course, the truth was that… they could finish combining with each other at any time they wished.\u003c/p\u003e\n\u003cp\u003eThe only downside was that their combined state would only last for a short time. Therefore, they hoped to wait until close-quarters fighting actually broke out before starting the clock.\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter if this Bai Xiaochun is clever. He\u0027s going to die beyond the shadow of a doubt!” Snorting coldly, the twin Master Cloud Lightnings picked up speed, and began to close the distance.\u003c/p\u003e\n\u003cp\u003eAnd thus the true chase began….\u003c/p\u003e\n\u003cp\u003eThe day passed, then the night…. Bai Xiaochun had a powerful fleshly body, and incredible restorative powers. Therefore, he could maintain top speed for a long time. Occasionally, he would toss out some Breakup Pills, although it wasn’t possible for him to hit Master Cloud Lightning directly….\u003c/p\u003e\n\u003cp\u003e“Fudge! I refuse to believe that my Breakup Pills aren’t working!” Unwilling to accept defeat, he continued to throw out pills….\u003c/p\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-938\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/a-will-eternal/awe-chapter-940\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-939","bookId":1496,"creation":"Sep 10, 2019 2:52:10 AM","modification":"Sep 10, 2019 2:52:10 AM"}
