{"id":20464,"no":36,"title":"CHAPTER XXXVI. A LAST ESCAPE.","content":"Death frees his body, but his soul\n\u003cbr\u003e Goes on to its predestined state:—\n\u003cbr\u003e But who are we that we should judge—\n\u003cbr\u003e Or name an erring brother\u0027s fate;\n\u003cbr\u003e \n\u003cbr\u003e The wheels of the law moved slowly but steadily forward until but one short day remained before the extradition of the nameless prisoner to the legal guardianship of his native country. Much interest had been excited in his case and great scope given the imagination of the curious regarding his identity, but all to no avail. The cloud upon his birth pursued him and now that Dr. Seward was dead there seemed little fear of its ever being lifted.\n\u003cbr\u003e \n\u003cbr\u003e None but the idly inquisitive seekers after morbid sensations called upon him in his prison home[Pg 227] until the day before his anticipated departure, when a Mongolian, wearing the full regalia of his country, begged a brief audience with the carefully guarded man.\n\u003cbr\u003e \n\u003cbr\u003e No one knew what was said during that short interview as the conversation baffled the linguistic ability of the Irish guard, but when it was over he was promptly ushered out by the son of Erin who had listened with open mouthed astonishment to their unintelligible chatterings.\n\u003cbr\u003e \n\u003cbr\u003e It was only a brief five minutes that the guard remained away, but when he returned to his post, after seeing the Celestial visitor safely outside the building, he thought he detected an unusual odor, and going immediately to his prisoner\u0027s door demanded to know \"what koind of shmell the grasy yaller shkin had lift behoind him, to be shure!\"\n\u003cbr\u003e \n\u003cbr\u003e But there was no answer to his inquiry and promptly opening the door he was horrified to find that in spite of all his vigilance his prisoner had escaped him. Not by disappearance of body, for the still cold form remained, but by flight of soul, instantaneous and complete, while the sickish odor of some unknown drug spoke only too plainly of the method employed for his escape from earthly bondage.\n\u003cbr\u003e \n\u003cbr\u003e For a moment the horrified guard was speechless with concern, then closing the door silently, he repaired to the warden\u0027s office, and in a few short hours all New York was ringing with the news of the mysterious death and clamoring wildly for the capture of the prisoner\u0027s only visitor.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2720/74795.html","bookId":1421,"creation":"Aug 2, 2019 11:46:09 AM","modification":"Aug 2, 2019 11:46:09 AM"}
