{"id":76070,"no":10,"title":"Page 10","content":"\u003cp\u003eWe are standing on his balcony. The sky is liquid black and sprinkled with shining stars. The wind blows through my hair and makes my skin tingle. I hold on to the banister and take a deep breath of sea air.\u003c/p\u003e\n\u003cp\u003e“Nice out here, huh?” he asks.\u003c/p\u003e\n\u003cp\u003e“It’s amazing.”\u003c/p\u003e\n\u003cp\u003eHe puts his arm around my shoulders. “So,” he says.\u003c/p\u003e\n\u003cp\u003e“So,” I respond. I turn back toward him. Here it is. My chance. All I have to do is not chicken out.\u003c/p\u003e\n\u003cp\u003eHis face inches closer to me. And closer. I’m breathing his salty smell. I can almost taste him.\u003c/p\u003e\n\u003cp\u003eAnd then…we’re kissing.\u003c/p\u003e\n\u003cp\u003eWe’re kissing!\u003c/p\u003e\n\u003cp\u003eYay!\u003c/p\u003e\n\u003cp\u003eHe kisses me harder. He runs his fingers through my hair. He lowers his hand to the small of my back and pulls me into him. He stops kissing me only to tell me how beautiful I am, which is so nice. He’s so nice.\u003c/p\u003e\n\u003cp\u003eOh my. What am I doing? Can I go through with this?\u003c/p\u003e\n\u003cp\u003eI don’t know. I feel sick.\u003c/p\u003e\n\u003cp\u003eI don’t think I can do this.\u003c/p\u003e\n\u003cp\u003eI can’t do this.\u003c/p\u003e\n\u003cp\u003eI pull back.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, James. I mean Jay. I mean…” I have to get out of here. “I thought I could do this. But I can’t.”\u003c/p\u003e\n\u003cp\u003e“Huh?” he says, startled, eyes blinking open.\u003c/p\u003e\n\u003cp\u003e“I have to go. Now. Trust me.”\u003c/p\u003e\n\u003cp\u003e“But, but…” He grips my shoulders. “We’re not done.”\u003c/p\u003e\n\u003cp\u003eExcuse me?\u003c/p\u003e\n\u003cp\u003e“You can’t lead me on like that and then not finish what you started,” he says, his voice low and rumbly.\u003c/p\u003e\n\u003cp\u003e“I don’t think that’s the way it works,” I tell him.\u003c/p\u003e\n\u003cp\u003e“I think it is,” he says, pulling me back toward him.\u003c/p\u003e\n\u003cp\u003e“No, it really isn’t. I’m not ready.”\u003c/p\u003e\n\u003cp\u003e“You seem ready to me.”\u003c/p\u003e\n\u003cp\u003eMaybe he’s right. Maybe I am ready. I try to relax. I take a deep breath. This is what I want. He certainly deserves to be my first.\u003c/p\u003e\n\u003cp\u003e“Hmm,” I say, taking a deep breath. I kiss the edge of his lips. And then his cheek. And then I nibble on his ear. Carefully. And then I move down to the top of his neck. He just smells so delicious. Tasty. The real Parfum de Vie—scent of life. Hungry, I kiss his neck. Lick his neck. Lick off the aftershave. Yum.\u003c/p\u003e\n\u003cp\u003e“That feels so good,” he murmurs.\u003c/p\u003e\n\u003cp\u003eI open my mouth wider. Here it comes. I’m ready. I can do this. Be fearless.\u003c/p\u003e\n\u003cp\u003eI sink my teeth into his neck.\u003c/p\u003e\n\u003cp\u003e“Hey!” he screams. “That hurts.” He tries to pull back.\u003c/p\u003e\n\u003cp\u003eNow it’s too late to go back. It’s time. I pull him back toward me, steady his face between my cold hands, and bite him again.\u003c/p\u003e\n\u003cp\u003eLiz was right. This isn’t that hard.\u003c/p\u003e\n\u003cp\u003eAs he pointlessly struggles to get away, he asks, “Why are you doing this to me?”\u003c/p\u003e\n\u003cp\u003eBecause I’m thirsty, I think but don’t say. I’m too busy drinking.\u003c/p\u003e\n\u003cp\u003e“What…are you?” he mumbles just before he passes out.\u003c/p\u003e\n\u003cp\u003eI swallow a mouthful of blood. Much better than a Bloody Mary. “I’m a vampire,” I explain, and then finish him off.\u003c/p\u003e\n\u003cp\u003eI did it. I did it!\u003c/p\u003e\n\u003cp\u003eMy first time. I have to admit, I’m kind of proud of myself.\u003c/p\u003e\n\u003cp\u003eOnce I’ve drained his body, I heave it over the railing and watch him disappear into the blackness below.\u003c/p\u003e\n\u003cp\u003eAfter I hear a soft splash, I let myself out.\u003c/p\u003e\n\u003cp\u003eI find Hailey and Liz alone on the pool deck.\u003c/p\u003e\n\u003cp\u003eHailey is lying across a lounge chair, her eyes wide open, her arms and legs trembling.\u003c/p\u003e\n\u003cp\u003e“Yay, you did it!” Liz says. “Full?”\u003c/p\u003e\n\u003cp\u003e“Stuffed,” I say. “Extra delicious. Fantabulous. Even better than Checker Boy, or the old bartender, or hot tub girl.”\u003c/p\u003e\n\u003cp\u003e“Fresh is always better than leftovers.”\u003c/p\u003e\n\u003cp\u003e“You are absolutely right.”\u003c/p\u003e\n\u003cp\u003e“Although you didn’t taste Ali or Carly,” Liz says. “They were pretty tasty.”\u003c/p\u003e\n\u003cp\u003eI look down at Hailey, who’s staring into the sky, still trembling. “I thought she’d be overboard by now. You decided to change her instead?”\u003c/p\u003e\n\u003cp\u003eLiz nods. “Yeah. You don’t mind, do you? I like her. I think she’ll be fun. I gave her the choice, of course. She said she was up for something new. She doubts her mom will even notice she’s different.”\u003c/p\u003e\n\u003cp\u003eLaughter wafts from the other end of the deck. We look up. Two college guys are walking over to us. One of the guys is wearing a Yankees hat.\u003c/p\u003e\n\u003cp\u003eHailey pushes herself up on her elbows.\u003c/p\u003e\n\u003cp\u003e“You okay?” I ask.\u003c/p\u003e\n\u003cp\u003eShe nods, and then, her hand no longer shaking, points to the guy in the hat and whispers, “Dibs.”\u003c/p\u003e\n\u003cp\u003eI Don’t Like Your Girlfriend \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-10.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
