{"id":76077,"no":17,"title":"Page 17","content":"\u003cp\u003eBeing a bitch was one thing. Actually misusing the Craft to force someone to fall in love with her—that was something else altogether. That was serious. That was bad. Maybe it wasn’t as awful as murder, but Cecily had been brought up to believe that subverting someone’s will was more or less in the same general category.\u003c/p\u003e\n\u003cp\u003eThat would explain why Kathleen had skipped the afternoon coven meeting too—the enchantment on Scott would’ve been a powerful one, so much so that traces of it might have lingered and affected the coven’s work. Kathleen’s cover would have been blown, and all the other witches would’ve known what a horrible thing she’d done.\u003c/p\u003e\n\u003cp\u003eThe thought of Kathleen publicly shamed gave Cecily a little thrill of satisfaction, and almost instantly she felt ashamed.\u003c/p\u003e\n\u003cp\u003eIf you really thought she’d done it, you wouldn’t be happy, Cecily told herself. You’d be horrified, and worried about Scott. But you don’t really think Kathleen’s that wicked. You just enjoy thinking that she could be, because it’s easier than thinking that Scott might actually be in love with her for real. Which he obviously is. So get over it.\u003c/p\u003e\n\u003cp\u003eBut the idea wouldn’t quite go away.\u003c/p\u003e\n\u003cp\u003eFinally, Cecily decided that she’d prove to herself how ridiculous her theory was. Quickly she pulled her Craft supplies from beneath the bed and grabbed a small plastic spray bottle from her luggage. On hot days at the beach she filled the bottle with water so she could cool down while remaining in the sun; obviously, she wouldn’t be needing it for that anytime soon.\u003c/p\u003e\n\u003cp\u003eA simple solution would be best. Something she didn’t have to cook up. Thinking fast, Cecily realized that a couple of the elixirs from this morning might do the trick if she poured them together in the right proportions. It was difficult without a measuring cup, but she managed to get it close.\u003c/p\u003e\n\u003cp\u003eFirst she tested the solution, tiptoeing into Theo’s room. Cecily determinedly didn’t look at Scott’s things on the bottom bunk; instead, she took the Game Boy she’d used for the spyglass spell. After glancing down the hall to make sure that nobody was watching, she squirted the bottle over the Game Boy.\u003c/p\u003e\n\u003cp\u003eThe mist of liquid turned briefly brilliant pink—proving the Game Boy had been the subject of a spell or enchantment in the recent past.\u003c/p\u003e\n\u003cp\u003eCecily nodded, satisfied. If nothing else, at least she’d learned how to work up a spell-detection elixir on short notice.\u003c/p\u003e\n\u003cp\u003eAre you actually going to spray this on Scott? she asked herself. What are you going to do when nothing happens? Remember, he’ll also think you’re a complete weirdo who goes around stalking guys with squirt bottles of pink crap.\u003c/p\u003e\n\u003cp\u003e“Hey, everybody!” Mr. Silverberg called. “Who wants to go out for pizza?”\u003c/p\u003e\n\u003cp\u003e“Thank god!” shouted another of the dads, and everyone laughed. Cecily wasn’t the only one who had cabin fever, apparently.\u003c/p\u003e\n\u003cp\u003eAnd if they were all headed outside that gave Cecily her chance. Nobody would notice a few drops of water in the middle of a driving rainstorm.\u003c/p\u003e\n\u003cp\u003eShe tucked the spray bottle in the pocket of her jean jacket as everybody got ready to go. Theo, always restless, ran out into the rain before anybody else, and Mom had to chase after him with an umbrella. Kathleen hurried out next, her own umbrella in hand, whining about what the humidity was doing to her hair. Scott was about to follow her, but Cecily grabbed his arm at the door. “Oh, Scott—” she said casually. “Did you happen to see Theo’s Game Boy? We should really take it along tonight so he won’t get bored.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I think I saw that in our room.” Scott smiled at her. “You’re a good sister, you know?”\u003c/p\u003e\n\u003cp\u003eAs Scott jogged inside to search their room, Cecily took her own sweet time slipping into her sandals. After she had fastened the last buckle, the only people left in the house were she and Scott.\u003c/p\u003e\n\u003cp\u003e“Come on, you two!” Dad shouted through the cracked-open window of their rental car.\u003c/p\u003e\n\u003cp\u003eScott emerged, Game Boy in hand. They both dashed out into the rain, and Cecily made sure to be a few steps behind him so that nobody would be able to see what she was about to do. Quickly she took the spray bottle, reminded herself that this was slightly nuts, and squeezed the trigger.\u003c/p\u003e\n\u003cp\u003eThe mist turned pink, sparkling for one moment before it vanished.\u003c/p\u003e\n\u003cp\u003eCecily froze. For a moment she simply stood there, rain pouring down on her; in her shock, she couldn’t feel anything.\u003c/p\u003e\n\u003cp\u003eKathleen had done it. She actually had done it. She had broken one of the Craft’s strongest laws.\u003c/p\u003e\n\u003cp\u003eScott doesn’t really love her.\u003c/p\u003e\n\u003cp\u003e“Cecily!” Dad yelled. “What are you doing?”\u003c/p\u003e\n\u003cp\u003eHaltingly Cecily managed to make her way to the car and get inside. By the time she shut the door behind her, she was sopping wet. “Ugh. Honestly,” Kathleen huffed. She sat in the center of the backseat curled next to Scott, who was smiling at her sort of vacantly. “Stop dripping on me, Cecily.” \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-17.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
