{"id":76083,"no":23,"title":"Page 23","content":"\u003cp\u003eCecily was pretty sure she’d get in some quality gloating later, but the shock of it all was too new for that. “All that smoke, the boom—Dad has to have seen it.”\u003c/p\u003e\n\u003cp\u003e“We told the guys the Jacuzzi shorted out. No more hot-tubbing on this trip, I’m afraid.”\u003c/p\u003e\n\u003cp\u003eIt would be a long time before Cecily could look at a Jacuzzi the same way again, so no loss there. “And Scott?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t know what hit him. Or care, I think.”\u003c/p\u003e\n\u003cp\u003eThey looked together toward Ocean’s Heaven. Scott sat with Theo on the front steps that led to the sand. He chugged half a can of root beer then belched Theo’s name, which made Theo laugh and applaud. Cecily sighed.\u003c/p\u003e\n\u003cp\u003eMom said, “You tried to warn me about Kathleen last night. I should have heard you out. In future I will.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Mom.”\u003c/p\u003e\n\u003cp\u003e“Which means you will never again have any excuse for laying hands on my Book of Shadows without my permission.”\u003c/p\u003e\n\u003cp\u003e“Understood.”\u003c/p\u003e\n\u003cp\u003eMom tugged fondly at the end of Cecily’s ponytail. “You took a big risk, you know—and not just attempting the spell on your own. If Scott were any more—let’s say inquisitive, he would have realized that he had been under an enchantment. He would have realized that magic is real. Covering our tracks at that point would’ve been hard work. That you couldn’t have done alone.”\u003c/p\u003e\n\u003cp\u003e“Why do we have to lie to them? Don’t you ever wish Dad knew the truth? Don’t you think he’d love you even more when he realized what an amazing witch you are?”\u003c/p\u003e\n\u003cp\u003eFor a moment Mom was silent. The only sound was the roar of the ocean. At last she said, “Today of all days I’d think you would understand the importance of obeying the rules.”\u003c/p\u003e\n\u003cp\u003eThat wasn’t an answer, but Cecily knew it was as close as she would get. She hugged Mom before jogging down to the shoreline. The waves were cold and foamy against her toes.\u003c/p\u003e\n\u003cp\u003eSomeday, Cecily thought. Someday I’ll find a guy who can live with the truth. Just because that’s not Scott doesn’t mean a guy like that isn’t out there.\u003c/p\u003e\n\u003cp\u003eAt least her summer vacation wasn’t entirely ruined. Cecily had a few days left to enjoy herself, which she felt she richly deserved.\u003c/p\u003e\n\u003cp\u003eSELF-IMPROVEMENT GOALS: REVISED\u003c/p\u003e\n\u003cp\u003eDuring my remaining vacation time I will:\u003c/p\u003e\n\u003cp\u003eresist gloating over Kathleen’s downfall, at least while there are witnesses around\u003c/p\u003e\n\u003cp\u003eswim for at least two hours a day\u003c/p\u003e\n\u003cp\u003esee if the moms now respect me enough to teach me some serious Craft mojo\u003c/p\u003e\n\u003cp\u003ebeat Theo at foosball just once for the sake of my personal dignity\u003c/p\u003e\n\u003cp\u003ewalk three miles on the beach each morning\u003c/p\u003e\n\u003cp\u003esee about tennis lessons\u003c/p\u003e\n\u003cp\u003esee about horseback riding lessons\u003c/p\u003e\n\u003cp\u003ebasically, stay outdoors as much as humanly possible\u003c/p\u003e\n\u003cp\u003eThen thunder rolled in the distance, and raindrops began to spatter onto the sand.\u003c/p\u003e\n\u003cp\u003eCecily groaned as she ran for shelter. Well, maybe next year.\u003c/p\u003e\n\u003cp\u003eThe Law of Suspects\u003c/p\u003e\n\u003cp\u003eMAUREEN JOHNSON\u003c/p\u003e\n\u003cp\u003e“I hate vacation,” I said.\u003c/p\u003e\n\u003cp\u003eMy sister, Marylou, was in the rocking chair by the window, twisting her short, rust-colored hair around her finger absently, her DSM-IV open in front of her. The DSM-IV, in case you’ve never heard of it, is The Diagnostic and Statistical Manual of Mental Health Disorders (Fourth Edition). Marylou had just finished her first year as a psychology major, which meant that her favorite time waster was diagnosing me with every ailment in the book—literally. So it was a mistake saying this kind of thing to her.\u003c/p\u003e\n\u003cp\u003e“Lack of interest in things normal people find enjoyable,” she said. “That’s depression, Charlie.”\u003c/p\u003e\n\u003cp\u003e“‘Normal people’?” I repeated.\u003c/p\u003e\n\u003cp\u003e“Well, that’s not the term we like to use, actually….” she said, even though she had just used it.\u003c/p\u003e\n\u003cp\u003e“Who is this we?”\u003c/p\u003e\n\u003cp\u003e“Mental health professionals.”\u003c/p\u003e\n\u003cp\u003eThe last thing Marylou was was a mental health professional. She was a barista with two semesters of intro psych under her belt.\u003c/p\u003e\n\u003cp\u003e“I see,” I said. “A mental health professional. You also serve lattes. So are you also the president of Starbucks? Is that what that means?”\u003c/p\u003e\n\u003cp\u003e“Shut up, Charlie.”\u003c/p\u003e\n\u003cp\u003ePage flip, page flip, page flip.\u003c/p\u003e\n\u003cp\u003e“And why are you so busy trying to diagnose me?” I asked, swatting away a fly that kept trying to land on my nose. “You were reading that on the plane when that guy next to me tried to stab me with his fork. You didn’t give him a label.”\u003c/p\u003e\n\u003cp\u003e“That’s because he didn’t try to stab you,” she said placidly. “You were lying.” \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-23.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
