{"id":76087,"no":27,"title":"Page 27","content":"\u003cp\u003e“Sorry,” I said. “I don’t speak—”\u003c/p\u003e\n\u003cp\u003e“Oh,” he said quickly. “You are English? American?”\u003c/p\u003e\n\u003cp\u003e“American,” I said.\u003c/p\u003e\n\u003cp\u003eThe man’s English was perfect, though he was clearly French. His accent was light—it just tweaked the ends of his words.\u003c/p\u003e\n\u003cp\u003e“My dog,” he said. “I’m looking for my dog. He often goes out hunting rabbits, but he has been gone for hours now. Have you seen a dog?”\u003c/p\u003e\n\u003cp\u003e“No,” I said. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eHe bit his lower lip thoughtfully and stared at the trees again.\u003c/p\u003e\n\u003cp\u003e“I am afraid he may have gotten stuck in a hole or hurt,” he said. “I call and call, but he does not come.”\u003c/p\u003e\n\u003cp\u003eHe sucked the last of the cigarette down to the butt and dropped it to the grass, still burning. It snuffed itself out.\u003c/p\u003e\n\u003cp\u003e“You are visiting?” he said.\u003c/p\u003e\n\u003cp\u003e“Yeah…my sister and I…we’re at the cottage up the road, and our cousin—”\u003c/p\u003e\n\u003cp\u003e“I know the cottage,” he said.\u003c/p\u003e\n\u003cp\u003e“I’m trying to make a phone call. Our cell phones don’t work out here. No reception.”\u003c/p\u003e\n\u003cp\u003e“Cell phones? Ah…mobiles. Yes, they do not work here. I’m sorry. I have no other phone. My name is Henri. And yours?”\u003c/p\u003e\n\u003cp\u003e“Char—” Everyone calls me Charlie. But it seemed like I should use my real name in France, to forge my new, Frenchier identity. “—lotte.”\u003c/p\u003e\n\u003cp\u003e“Charlotte. But you are thirsty? It is very warm. Would you like a drink?”\u003c/p\u003e\n\u003cp\u003eHe waved me indoors without waiting for my answer, picking up the basket as we went inside.\u003c/p\u003e\n\u003cp\u003e“Did you grow those?” I asked.\u003c/p\u003e\n\u003cp\u003eHe looked down at the basket. It seemed like he had forgotten he was holding it.\u003c/p\u003e\n\u003cp\u003e“Yes,” he said distractedly. “We have a very good garden.”\u003c/p\u003e\n\u003cp\u003eThe door opened directly into a large farmhouse kitchen with a rough-hewn wood floor, dried bundles of herbs hanging from the ceiling, and a huge red stove with massive, flat burners covered by heavy lids. The basket went onto the table.\u003c/p\u003e\n\u003cp\u003e“I have lemonade,” he said. “It is very nice.”\u003c/p\u003e\n\u003cp\u003eI thanked him, and he poured me a glass. It was certainly very authentic—so tart that I almost started weeping. But I felt like I had to get through it somehow, just to be polite.\u003c/p\u003e\n\u003cp\u003e“You are here with your family?” he asked.\u003c/p\u003e\n\u003cp\u003eAgain, he said it vacantly, picking up another cigarette from the pack on the table, lighting it, and sucking it quickly.\u003c/p\u003e\n\u003cp\u003e“Just my sister, Marylou,” I reminded him. “Well, actually Marie-Louise.”\u003c/p\u003e\n\u003cp\u003eHenri’s eyes came fully into focus, like he was seeing me for the first time. He slowed down on the smoking, taking an easy drag and setting the cigarette down in an ashtray.\u003c/p\u003e\n\u003cp\u003e“Your names are quite funny,” he said. “Very historical.”\u003c/p\u003e\n\u003cp\u003e“They are?”\u003c/p\u003e\n\u003cp\u003e“Do you know much about the French Revolution?” he asked.\u003c/p\u003e\n\u003cp\u003e“A little,” I said. And by “a little,” I meant almost nothing, but it looked like he was prepared to do most of the talking, so I was okay.\u003c/p\u003e\n\u003cp\u003e“Well, as I am sure you know, the people overthrew the king and queen and killed off most of the aristocracy. There was a period called the Terror, where thousands of people were killed. Then there was the Law of Suspects. It meant that any citizen determined to be an enemy of the people could be locked up at once or executed. I suppose now we would call them terrorists…. Anyone could be accused. Anyone could be killed. Anyone could be capable.”\u003c/p\u003e\n\u003cp\u003eI was nodding away, wondering where this was heading, but mostly I was trying to figure out how to drink the lemonade without getting it on the part of my tongue that really reacted to the sourness.\u003c/p\u003e\n\u003cp\u003e“Marie-Louise was the name of the Princesse de Lamballe, the confidant of Marie Antoinette. She was killed in the September Massacres in 1792. Do you know what they did to her?”\u003c/p\u003e\n\u003cp\u003e“No,” I said.\u003c/p\u003e\n\u003cp\u003e“They dragged her from the prison at La Force. A mob descended on her, ripping her to shreds. They sliced her head from her body and took it to a hairdresser to have it…how would you say it…styled? Then they put it on a pike and carried it to Marie Antoinette’s window and stuck it inside, like a puppet. And Charlotte…that is the name of the most famous murderess in all of France. Charlotte Corday. She stabbed Jean-Paul Marat in the bathtub. There is a very famous painting of this.”\u003c/p\u003e\n\u003cp\u003e“Right,” I said. “But our names are kind of common.”\u003c/p\u003e\n\u003cp\u003e“They are, of course. This is true.”\u003c/p\u003e\n\u003cp\u003eHe lit up another cigarette, and I noticed that Henri was a bit on the twitchy side. He had to work his way through four matches before he could get it lit. I sort of knew what he was talking about, but now I was ready for him to be done. This was maybe more than I had bargained for, conversation-wise, and I was done with the lemonade. I still had no cell phone signal, and I was going to have to hurry back if I was going to make it on time for Bob l’éponge. \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-27.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
