{"id":76089,"no":29,"title":"Page 29","content":"\u003cp\u003e“Come on,” she said. “Eat. It’s not that bad here. Try this.”\u003c/p\u003e\n\u003cp\u003eShe tore off some of the chicken with a fork and cut me a hunk of the cheese and bread. It was all delicious—the crisp chicken studded with thyme, the cheese with the pretty purple flecks of lavender. I think I should have felt content and French, safe and snug inside, with the wind whistling outside. But I didn’t. I felt just slightly sick.\u003c/p\u003e\n\u003cp\u003e“What is with you?” she asked.\u003c/p\u003e\n\u003cp\u003e“It was that guy and his weird-ass story.”\u003c/p\u003e\n\u003cp\u003e“All right,” she said, spreading cheese thick on a piece of bread. “What did he say that freaked you out so much?”\u003c/p\u003e\n\u003cp\u003eSo I told her everything I could remember about Henri’s story, going to great lengths to stick to the facts exactly as I’d heard them. When I finished, Marylou just shook her head.\u003c/p\u003e\n\u003cp\u003e“So he likes history,” she said. “And he’s a little morbid. You can’t just write him off as crazy, Charlie.”\u003c/p\u003e\n\u003cp\u003e“That’s not the word we like to use,” I corrected her.\u003c/p\u003e\n\u003cp\u003eMarylou laughed at this. I felt a little better once I’d gotten the story out. The wind didn’t seem so blustery. I took a big piece of chicken, and we talked about other things for a while, like the fact that Marylou had found a set of Ping-Pong paddles and balls when I was gone and how we could convert our table into a Ping-Pong paradise. We were just finishing up when we were startled by a knock at the door. Marylou jumped to answer it.\u003c/p\u003e\n\u003cp\u003eIt wasn’t Claude, as we’d both been hoping. The news was actually a bit better than that. It was a guy, maybe Marylou’s age. He was tall and lanky, with dark curly hair cut short but uneven. He was wearing a threadbare Led Zeppelin T-shirt and ragged jeans chopped off at the knee. He had a sprig of green something or other in his hair, something off one of the many forms of plant life around us. And he was sweating profusely. All of that aside, he was pretty good looking. Well, very, actually.\u003c/p\u003e\n\u003cp\u003eHe opened his mouth to speak, but I got there first, just to get it out of the way.\u003c/p\u003e\n\u003cp\u003e“Sorry,” I said. “We don’t speak French.”\u003c/p\u003e\n\u003cp\u003e“My English is so-so,” he said, coming into the room shyly and looking around our little Shire kitchen. “I am Gerard. I live in the village. I saw you earlier, walking the path. I thought I would come, say hello.”\u003c/p\u003e\n\u003cp\u003eWe gazed at him stupidly. Turns out, if you’re stuck in a French cabin for days on end and a guy shows up, you basically lose your mind. Socials skills right out the window.\u003c/p\u003e\n\u003cp\u003e“Hello,” Marylou finally said. “Do you want…um…some chicken? Or cheese or…”\u003c/p\u003e\n\u003cp\u003eShe pointed at the picked-apart chicken carcass on the table and the mostly eaten cheese and the remains of the bread.\u003c/p\u003e\n\u003cp\u003e“A drink!” I said, remembering the earlier hospitality. “We have Orangina!”\u003c/p\u003e\n\u003cp\u003e“A drink. Thank you.”\u003c/p\u003e\n\u003cp\u003eI poured Gerard some Orangina, and he sat at the table with us. He looked down at the glass shyly. He was a strapping boy, the kind who looked like he had been raised in these glorious fields, developing strong muscles through cheese-rolling or whatever it was you did when you were a tall French guy who grew up in a lovely village in the middle of nowhere.\u003c/p\u003e\n\u003cp\u003e“You are?” he asked.\u003c/p\u003e\n\u003cp\u003e“I’m Charlie. Charlotte.”\u003c/p\u003e\n\u003cp\u003e“Charlie Charlotte?”\u003c/p\u003e\n\u003cp\u003e“Either one,” I mumbled.\u003c/p\u003e\n\u003cp\u003e“And I’m Marylou,” my sister added. She had seen my fumble, and she wasn’t going the French-name route.\u003c/p\u003e\n\u003cp\u003e“What are you doing ’ere?” he asked.\u003c/p\u003e\n\u003cp\u003eI got in ahead of Marylou and started telling Gerard the story of Mr. 56E, Claude, the little suits of armor, Erique, the tiny frogs, all the way through Henri and his tale of woe, doom, and weirdness. This last bit seemed to catch Gerard’s attention, because he looked up at me the entire time I was talking, his bright brown eyes looking right into mine.\u003c/p\u003e\n\u003cp\u003e“Henri likes ’istory,” he said, but he certainly didn’t sound happy about it. I gathered Henri made a habit of talking death and mayhem and history to anyone who got near. Gerard just had that look on his face like he’d heard it all before.\u003c/p\u003e\n\u003cp\u003e“What do you do?” Marylou asked.\u003c/p\u003e\n\u003cp\u003e“I go to university in Lyon. I study psychology.”\u003c/p\u003e\n\u003cp\u003eOh, the joy on Marylou’s face. A kindred spirit. She started rambling on about all the good times she’d had in the psych lab tormenting other students for eight dollars an hour. Gerard nodded and occasionally added a comment. I gathered that he was nineteen, had been at university for a year, and wasn’t as excited about being a psych major as Marylou. (No one could be, really.) He listened for a good solid hour, but I noticed that he looked at me a lot more than at Marylou. \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-29.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
