{"id":76063,"no":3,"title":"Page 3","content":"\u003cp\u003eI’m just about to drift off when a shadow crosses my path.\u003c/p\u003e\n\u003cp\u003eI open one eye to see what’s going on and the other one promptly pops open.\u003c/p\u003e\n\u003cp\u003eHi there.\u003c/p\u003e\n\u003cp\u003eIt’s a guy. A cute guy, my age, maybe seventeen. Standing between my recently pedicured feet and the pool. He’s wearing checkered black and gray bathing trunks, has cropped blond hair, and sexy sculpted arms.\u003c/p\u003e\n\u003cp\u003eCould he be the one?\u003c/p\u003e\n\u003cp\u003eWith a smooth motion he dives into the water, leaving my side without even a splash to cool me down.\u003c/p\u003e\n\u003cp\u003eWhere’s he going? Come back, Checker Boy, come back!\u003c/p\u003e\n\u003cp\u003e“Dive in,” Liz tells me, pushing herself up on her elbows.\u003c/p\u003e\n\u003cp\u003e“What?” I ask, slightly panicked.\u003c/p\u003e\n\u003cp\u003e“You like him, don’t you? He’s kind of yummy-looking, huh?”\u003c/p\u003e\n\u003cp\u003e“Ick. I don’t even know him!” I say.\u003c/p\u003e\n\u003cp\u003e“You like what you see, right?”\u003c/p\u003e\n\u003cp\u003e“I guess,” I say.\u003c/p\u003e\n\u003cp\u003e“Then dive in.”\u003c/p\u003e\n\u003cp\u003eI hesitate. What if when I dive in I swallow a couple hundred gallons of chlorinated water and then lose my bikini top?\u003c/p\u003e\n\u003cp\u003e“If you want someone, you have to go after him.”\u003c/p\u003e\n\u003cp\u003e“I know, but…”\u003c/p\u003e\n\u003cp\u003eHailey looks up from her paper and eyes Checker Boy in the pool now doing laps. “He is cute, Kristin,” she says. “Go for it.”\u003c/p\u003e\n\u003cp\u003eLiz smiles at me as if to say, “See, even the girl we just met thinks you should.”\u003c/p\u003e\n\u003cp\u003eI sigh. She’s right. I know she’s right. Unlike me she knows what she’s doing. Unlike me she’s done this before. Many, many times.\u003c/p\u003e\n\u003cp\u003eBut…I don’t want to look like an idiot. What if he blows me off? What if he has a girlfriend? What if he has a wife? What if he has children? Okay, he looks a little young to have a wife and children, but what if—\u003c/p\u003e\n\u003cp\u003eLiz sighs. “Kristin, watch how it’s done.” In a fluid motion she removes her sunglasses, wrap, and iPod and dives, rippleless, into the deep end.\u003c/p\u003e\n\u003cp\u003eShe surfaces like a supermodel, hair glistening and shoulders pulled back to show off her oh-so-tiny bikini top. She is directly blocking Checker Boy’s path.\u003c/p\u003e\n\u003cp\u003eHe swims right into her. He pulls his head back, treading water and coughing.\u003c/p\u003e\n\u003cp\u003e“So sorry,” Liz purrs. “Do you need mouth-to-mouth?”\u003c/p\u003e\n\u003cp\u003eHailey laughs.\u003c/p\u003e\n\u003cp\u003eThe look on Checker Boy’s face says he would love some mouth-to-mouth, thank you very much. “Sorry about that,” he says. “I have to learn to look where I’m going.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if I can accept your apology,” she drawls. “You may have to buy me a drink to make it up to me.”\u003c/p\u003e\n\u003cp\u003e“I’ll do whatever it takes,” Checker Boy says, eyes blinking rapidly, not believing his luck. They swim toward the pool bar.\u003c/p\u003e\n\u003cp\u003e“Wow,” Hailey says.\u003c/p\u003e\n\u003cp\u003e“She’s a master,” I respond.\u003c/p\u003e\n\u003cp\u003e“But she’s not twenty-one! How can she drink?”\u003c/p\u003e\n\u003cp\u003e“She has her ways.”\u003c/p\u003e\n\u003cp\u003e“She stole your guy. You should have called dibs.”\u003c/p\u003e\n\u003cp\u003eI shrug. “There are other fish on the boat.”\u003c/p\u003e\n\u003cp\u003eAn hour later Liz sashays back to our chairs.\u003c/p\u003e\n\u003cp\u003e“What’s he like?” I ask.\u003c/p\u003e\n\u003cp\u003eShe runs her fingers through her damp hair. “Who, Jarred? Not bad. He offered to buy me lunch. I told him we’d catch up with him later maybe.”\u003c/p\u003e\n\u003cp\u003e“Does he have any cute friends?” Hailey asks.\u003c/p\u003e\n\u003cp\u003e“I didn’t ask, but this one’s our priority this weekend,” Liz says, pointing to me. “She needs to take care of a problem.”\u003c/p\u003e\n\u003cp\u003e“What kind of problem?”\u003c/p\u003e\n\u003cp\u003eMy face heats up, and it’s not from the sun.\u003c/p\u003e\n\u003cp\u003e“Her virginity,” Liz says with a half smile.\u003c/p\u003e\n\u003cp\u003e“Oh, don’t do it,” Hailey says. “I wish I would have waited. I lost it last fall, beginning of junior year, to a total idiot. He told the entire school.”\u003c/p\u003e\n\u003cp\u003e“Jerk,” I say.\u003c/p\u003e\n\u003cp\u003e“So trust me, don’t rush,” she says. “Wait for someone you’re madly in love with.”\u003c/p\u003e\n\u003cp\u003e“Do not listen to her,” Liz says. “It will be too scary to do it with someone you’re madly in love with.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Hailey says, hesitating. “At least if you do it with some random stranger, it won’t matter who he tells. It’s not like you’ll know the same people. Have you ever come close to losing it?”\u003c/p\u003e\n\u003cp\u003e“Once,” I admit.\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eI hesitate. “It was with a guy named Tom. I thought it was going to happen. I was in his room. His parents weren’t home. And I was just about to when…” \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-3.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
