{"id":76100,"no":40,"title":"Page 40","content":"\u003cp\u003e“What are you doing?” he asked.\u003c/p\u003e\n\u003cp\u003eIf there was ever a moment to lie, this was it.\u003c/p\u003e\n\u003cp\u003e“God,” I said. “I tripped and fell on this. I tripped over his leg! God. This is so messed up!”\u003c/p\u003e\n\u003cp\u003eI staggered away, the gun still in my hands, but I continued making noises of general upset and confusion. It helped that Marylou was still screaming away.\u003c/p\u003e\n\u003cp\u003e“You should give me that,” Gerard said quietly.\u003c/p\u003e\n\u003cp\u003eI stepped over Henri and put my back up against the cellar door, pointing the gun at him.\u003c/p\u003e\n\u003cp\u003e“I can’t,” I said. “Please, Gerard. Don’t make me hurt you.”\u003c/p\u003e\n\u003cp\u003e“Charlie? What are you…”\u003c/p\u003e\n\u003cp\u003eHe sounded so confused, his little French accent peaking on my name. Like he was struggling with something inside himself.\u003c/p\u003e\n\u003cp\u003e“He told you the story,” I said. “When you were in the chair. Didn’t he? You couldn’t help it. You couldn’t get away.”\u003c/p\u003e\n\u003cp\u003e“Eet gets only one person,” he replied. “Eet has your sister.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t have my sister. It has you. You know it. Please, Gerard.”\u003c/p\u003e\n\u003cp\u003eHe stepped closer.\u003c/p\u003e\n\u003cp\u003e“I have been hunting rabbits all my life,” he said. “I can shoot very well. Give eet to me. I will protect both of us.”\u003c/p\u003e\n\u003cp\u003eIn the dark my fingers were feverishly trying to find the safety. I didn’t even want them to. They looked for it on their own. Gerard stepped forward and put his hand over the barrel.\u003c/p\u003e\n\u003cp\u003e“Charlie,” he said. “Eet is me. Eet is Gerard. Do not shoot me. Don’t listen to eet.”\u003c/p\u003e\n\u003cp\u003e“It hasn’t got me, Gerard! I never heard the end of the story! Now back off….”\u003c/p\u003e\n\u003cp\u003eAnd then my fingers found the safety. And I fired. And Gerard fell.\u003c/p\u003e\n\u003cp\u003e“Oh wait,” I said to myself. “He did mention a guillotine. How did I forget that?”\u003c/p\u003e\n\u003cp\u003eHere’s the thing….\u003c/p\u003e\n\u003cp\u003eGod. It’s hard to explain. I get so confused now. I start talking and I just forget what I’m saying halfway through. I think it’s all the meds I’m on. I pop pills all day long. They try all different combinations. Some work better than others. Today is one of the better days. I’m clear enough that they let me use the computer. The computer is usually way off-limits. I think they think I’m going to try to eat the keyboard or something.\u003c/p\u003e\n\u003cp\u003eThey tell me it’s been three months since I got here, since it all happened. It feels like two weeks or something, but I just looked out the window and all the leaves are off the trees. There’s a splattered pumpkin at the end of the long drive, so I guess Halloween is either coming or it’s already come and gone.\u003c/p\u003e\n\u003cp\u003eSo I guess you want to know what happened?\u003c/p\u003e\n\u003cp\u003eAs I remember it, I shot Gerard, and then a second or two later there was this massive cracking noise, like thunder, coming from inside my head. Everything went dark. According to the reports, if Gerard hadn’t put his hand over the stupid barrel he probably would have been fine, but as it was I blew it off. I dropped the gun. He managed to keep himself together long enough to pick it up and club me with it with his remaining hand.\u003c/p\u003e\n\u003cp\u003eI woke up in the hospital. Marylou was there, holding my hand and telling me it would all be okay. Then I passed out again. I was unconscious a lot. Awake a bit in the hospital in France. Awake for a moment or two in the wheelchair at the airport. I do remember Gerard coming to see me before I left. His handless arm was in a sling. I was pretty out of it at the time, but he didn’t look angry. I think he even stroked my hair.\u003c/p\u003e\n\u003cp\u003eThe coroner determined that Henri actually did kill himself (powder on his hands or something). They found the rest of his wife’s body exactly where Gerard said it was, along with ample evidence that Henri was the one who killed her. The dog was buried with her. This left the slightly more baffling problem of why one boy from the village and two American tourists ended up in a bloody confrontation in his house: one bound in the basement, another with no hand, a third unconscious on the kitchen floor. That this happened three days after a gruesome murder-suicide was even more troubling.\u003c/p\u003e\n\u003cp\u003eThe final analysis was: Gerard was the hero, the one who noticed the disappearance of Henri’s wife and kept watch over the house to see if anything suspicious was going on. When the two American tourists (us) came stumbling by, Gerard moved in to protect us. Flooded with guilt, Henri took his own life. And I, conveniently, lost my mind.\u003c/p\u003e\n\u003cp\u003eAs to why this all happened at the same exact time, the local police had no idea—but several psychologists took a crack at figuring it out.\u003c/p\u003e\n\u003cp\u003eBased on my lying about Gerard attacking me, beating my sister over the head with a DVD player, shooting Gerard…it was determined that I had had a psychotic break. I wound up in a mental hospital just outside of Boston. (“That’s not what we like to call it,” said Marylou. “It’s a psychological rehabilitation facility.”) \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-40.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
