{"id":76065,"no":5,"title":"Page 5","content":"\u003cp\u003e“I can see that,” she says. “Wipe your chin. You drooled.”\u003c/p\u003e\n\u003cp\u003e“Where, where? Show me him!” Hailey says, jumping in place.\u003c/p\u003e\n\u003cp\u003e“Don’t be too obvious,” I warn her, flipping my hair in my most nonchalant way. “Look over at the blackjack table.”\u003c/p\u003e\n\u003cp\u003eShe oh-so-casually spins a hundred and eighty degrees. “Ooooh. He’s hot. Go for him!”\u003c/p\u003e\n\u003cp\u003eI fidget with my dress. “How? What do I do?”\u003c/p\u003e\n\u003cp\u003eHailey turns to Liz. “Yeah, tell us what to do. How did you know what to do to get that swimmer at the pool? Where is he anyway? Are you meeting up with him?”\u003c/p\u003e\n\u003cp\u003eLiz shrugs. “Nah. It’s over. He was boring.”\u003c/p\u003e\n\u003cp\u003eHailey laughs. “I guess you already found someone new. Tell us your secrets so we can follow in your footsteps, will you?\u003c/p\u003e\n\u003cp\u003eShe motions us closer. “It’s all about the attitude. He should know that you think you’re all that. If you think you’re all that, he’ll think you’re all that. But being all that doesn’t mean ‘I’m better than you.’ It means, ‘I’m fantabulous and you seem like you are too, so maybe we deserve each other.’”\u003c/p\u003e\n\u003cp\u003e“Fantabulous?” I repeat.\u003c/p\u003e\n\u003cp\u003e“Yes.” She nods emphatically. “Absolutely fantabulous.”\u003c/p\u003e\n\u003cp\u003e“I can do that,” Hailey says. “I can be absolutely fantabulous. What else?”\u003c/p\u003e\n\u003cp\u003e“That’s it.”\u003c/p\u003e\n\u003cp\u003e“That’s all it takes to find a boyfriend?” Hailey asks.\u003c/p\u003e\n\u003cp\u003eLiz grins. “Boyfriend? Who wants a boyfriend? That was how to score a hook-up.” She rubs my shoulders again. “So are you ready?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I say while shaking my head no.\u003c/p\u003e\n\u003cp\u003e“Go play next to him. There’s a seat open.”\u003c/p\u003e\n\u003cp\u003e“But I don’t know how,” I whimper.\u003c/p\u003e\n\u003cp\u003eShe tosses me a black chip. “Aim for twenty-one.”\u003c/p\u003e\n\u003cp\u003e“Er, twenty-one what?”\u003c/p\u003e\n\u003cp\u003eWhen she laughs, I take a deep breath and head over to the empty stool. I can do this. “This seat taken?” I ask in an unfortunately nasal voice.\u003c/p\u003e\n\u003cp\u003eHe tilts his head to the side and gives me a blinding smile. “Nope. All yours.”\u003c/p\u003e\n\u003cp\u003eI gingerly place one chip on the felt table.\u003c/p\u003e\n\u003cp\u003e“Having a good night?” I ask, attempting to sound a wee bit more sophisticated and seductive. In other words I sound like I have strep.\u003c/p\u003e\n\u003cp\u003e“Yeah. My friend just got married in the dining room,” he says. “I was all danced out, so I snuck in here for a break.”\u003c/p\u003e\n\u003cp\u003eThat explains the tux. “Fantabulous,” I say.\u003c/p\u003e\n\u003cp\u003e“Sorry?”\u003c/p\u003e\n\u003cp\u003e“Oh, um…happy wedding. You look too young to have a friend getting married.”\u003c/p\u003e\n\u003cp\u003e“Oh, he’s crazy. College buddy. You know how it is. What college do you go to?”\u003c/p\u003e\n\u003cp\u003e“NYU,” I lie instantly. Why not? It’s not like he’ll ever know the difference.\u003c/p\u003e\n\u003cp\u003eHe nods, buying it. “I’m at Penn. Hey,” he says, leaning closer to me and putting his hand on my arm.\u003c/p\u003e\n\u003cp\u003eA jolt of static runs through my body. He’s so close I can smell the aftershave on his neck.\u003c/p\u003e\n\u003cp\u003e“You have the coolest eyes,” he says slowly as I watch his mouth forming the words.\u003c/p\u003e\n\u003cp\u003e“Thanks,” I say, barely breathing.\u003c/p\u003e\n\u003cp\u003eThe dealer interrupts us by distributing two rounds of cards to the four of us at his table.\u003c/p\u003e\n\u003cp\u003eJames Bond lets go of my arm and settles back onto his seat.\u003c/p\u003e\n\u003cp\u003eSigh.\u003c/p\u003e\n\u003cp\u003eI stare down at my cards. An eight and a jack. I have no idea what that means. I try to smile at James, but he seems to be over me and my eyes and is now enthralled by his cards.\u003c/p\u003e\n\u003cp\u003e“Miss?” the dealer asks me.\u003c/p\u003e\n\u003cp\u003e“Yes?” I ask back.\u003c/p\u003e\n\u003cp\u003e“What would you like to do?”\u003c/p\u003e\n\u003cp\u003eI look at my hand. I have no idea. “Get a card?”\u003c/p\u003e\n\u003cp\u003eMr. Bond looks at me in shock. “What? Why?”\u003c/p\u003e\n\u003cp\u003eToo late. The dealer hands me the four of spades and declares me out.\u003c/p\u003e\n\u003cp\u003eWhoops.\u003c/p\u003e\n\u003cp\u003eNot feeling that fantabulous right now. More like moronic.\u003c/p\u003e\n\u003cp\u003e“What happened?” Liz cries when I return empty-handed in all senses of the word. No chips, no boy.\u003c/p\u003e\n\u003cp\u003e“I lost all my chips. I had no idea what I was doing!”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you ask him for help?”\u003c/p\u003e\n\u003cp\u003e“How does one ask for help when one is trying to appear fantabulous?”\u003c/p\u003e\n\u003cp\u003eShe tosses her hair behind her shoulder. “You can still be fantabulous and not know how to play blackjack.”\u003c/p\u003e\n\u003cp\u003e“Well, the dealer got an ace and a jack so apparently he won. And before—”\u003c/p\u003e\n\u003cp\u003eLiz squeezes my arm. “But what happened to the boy?” \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-5.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
