{"id":76126,"no":66,"title":"Page 66","content":"\u003cp\u003e“Where are those kids?” Baz said, looking around.\u003c/p\u003e\n\u003cp\u003e“Gone,” I said. “Just like we need to be.”\u003c/p\u003e\n\u003cp\u003eWe followed the crumbs back to the village, pausing at the protective stone wall. We’d been gone a while. Early dusk was settling in. I could see some of the villagers in the lanes, sweeping, greeting neighbors, closing up shop, business as usual.\u003c/p\u003e\n\u003cp\u003e“We can’t let them know that we know,” I whispered to the others. “We go back to the inn, pack up our stuff, and once it’s quiet, we grab our flashlights and head back down to the train station, even if we have to walk all night.”\u003c/p\u003e\n\u003cp\u003e“What about the bridge?” Baz asked.\u003c/p\u003e\n\u003cp\u003e“We don’t know if they’re telling us the truth or not. We’ll deal with that when we get there.”\u003c/p\u003e\n\u003cp\u003eIsabel slipped her arm through mine like it was the first day of school all over again. “What about Mariana and Vasul and the others? We should warn them.”\u003c/p\u003e\n\u003cp\u003e“I’m not staying,” John said. He looked at Isabel. “Let’s get out of here.”\u003c/p\u003e\n\u003cp\u003eMy gut said cut and run, but not warning Mariana and Vasul seemed like we might as well be committing murder. “We warn them. Then we run.”\u003c/p\u003e\n\u003cp\u003eWe slipped back in by way of the church and stepped out casually, just tourists taking an evening stroll. Everything looked different. Ominous. The lanterns on their hooks. The scarecrows in the fields. The evil-eye pendants dangling in the wind. The stars twinkling into early-evening existence. Nothing felt right anymore.\u003c/p\u003e\n\u003cp\u003eThe old woman who’d let us in, the town’s gatekeeper, was making her nightly rounds. When she got to the wall, though, she dropped her box of salt and started squawking, crying. The protective ring was completely gone, and in its place was a thin strip of charred earth. Vasul came running over, his traveling bag still on his shoulder. He soothed her until she calmed down.\u003c/p\u003e\n\u003cp\u003e“What happened?” I asked, but I didn’t look him in the eye.\u003c/p\u003e\n\u003cp\u003e“She thinks it’s a sign the seal has been breached and the vengeful spirits of the dead can enter.” He shook his head. “I told her it was the rain and the ground was corroded by all that salt. I told her not to worry.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m sure that’s it,” Baz said, his sarcasm barely concealing his fear.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” Vasul asked.\u003c/p\u003e\n\u003cp\u003e“What if she should worry?” This time I did look him in the eyes. “What if there’s something out there?”\u003c/p\u003e\n\u003cp\u003eVasul raised an eyebrow. “Don’t tell me you’re starting to catch the village superstition.”\u003c/p\u003e\n\u003cp\u003e“No,” I lied.\u003c/p\u003e\n\u003cp\u003e“Good. Because tomorrow’s festival is going to be fantastic! You should see everything Mariana and I brought back. We, my American friend, are going to feast till we puke.”\u003c/p\u003e\n\u003cp\u003eI shoved my hands in my pockets. “Actually, um, we’re not gonna be able to make the festival. We have to leave a day early if we want to see Prague before we head back to the states.”\u003c/p\u003e\n\u003cp\u003eVasul crossed his arms and smirked, and I felt like the biggest chickenshit in the world. “So…you’re telling me you took a fifteen-hour train ride from Munich followed by another fifteen miles of torture-by-wagon up the mountain just so you could come to the festival and tell all your friends back home about it, and now you’re not even going to stay to see it?”\u003c/p\u003e\n\u003cp\u003eIn my mind I could see those dead kids rising from the lake. I could see the girl’s body turning to maggots.\u003c/p\u003e\n\u003cp\u003e“Vasul,” I started, hoping I could finish. “What if the sacrifices to Satan…what if they’re starting them again?”\u003c/p\u003e\n\u003cp\u003eHe nodded mock seriously. “Riiiight.”\u003c/p\u003e\n\u003cp\u003e“It’s true!” Isabel said. “They’re up to something.”\u003c/p\u003e\n\u003cp\u003eVasul laughed, but when he saw how scared we all looked, his smile faltered and was replaced by a hurt expression. “You know, I’ve seen real evil. Bodies lying in the streets. Mangled steel. Bombs exploding.” He shook his head like he was trying to clear our words from it. “But these people? They are old and harmless and on their way to being obsolete. They’re not doing anything except what they’ve always done: farm, make bread, have families. They cannot even stop a power plant from taking over their village. I thought better of you people.”\u003c/p\u003e\n\u003cp\u003eWhat he said made me feel like a Grade A jerk. But what about what had happened to us in the forest? What we’d seen?\u003c/p\u003e\n\u003cp\u003e“Dude, we need to tell—” Baz started.\u003c/p\u003e\n\u003cp\u003e“Hey, there you are!” Mariana walked across the square smiling. She looked different. “They’re roasting the lamb. It smells wonderful in there. I can’t wait to—” \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-66.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
