{"id":76127,"no":67,"title":"Page 67","content":"\u003cp\u003e“You got a haircut,” I said suddenly.\u003c/p\u003e\n\u003cp\u003e“Yeah.” She turned around, modeling it. “My mother did it for me. She insisted, actually. Said it was too long for my face. Mothers,” she said, rolling her eyes. “What do you think?”\u003c/p\u003e\n\u003cp\u003eIn my mind I could see only that awful braid attached to the goat’s head. “Your mother…cut your hair,” I repeated numbly.\u003c/p\u003e\n\u003cp\u003e“Yes. I mean, it’s not a fancy salon in Paris, but I can’t afford that anyway, and she’s pretty good with the scissors if you sit straight and don’t fidget.”\u003c/p\u003e\n\u003cp\u003eThey had Mariana’s hair.\u003c/p\u003e\n\u003cp\u003e“My grandmother gave me a little trim this morning too.” Vasul ran his hand across the top of his head. “Want to be at our best for the festival, you know.”\u003c/p\u003e\n\u003cp\u003eHadn’t I seen the old-timers rushing to the church? Hadn’t I seen a red robe?\u003c/p\u003e\n\u003cp\u003eOne of the younger kids, a chubby-cheeked boy, ran up to Mariana and said something. She stroked his head and cooed an answer. The boy gave us a quick look and smiled before running back to his pals.\u003c/p\u003e\n\u003cp\u003e“What was that?” I asked.\u003c/p\u003e\n\u003cp\u003e“He wanted to know if you would play their game with them. I told him maybe later,” Mariana explained. “What’s the matter? You seem upset.”\u003c/p\u003e\n\u003cp\u003e“There’s something we should tell you,” I heard myself say. “Meet us in our room as soon as you can.”\u003c/p\u003e\n\u003cp\u003eA few feet away the kids started up their game again. The outer circle descended on the kids clumped together on the inside. And they all fell down, laughing hard.\u003c/p\u003e\n\u003cp\u003eTen minutes later Mariana and Vasul joined us in our room at the tavern, and Baz quickly bolted the door behind them.\u003c/p\u003e\n\u003cp\u003eMariana searched our faces. “What’s going on?”\u003c/p\u003e\n\u003cp\u003e“We went to the forest,” I started.\u003c/p\u003e\n\u003cp\u003eMariana’s eyes widened. “You what? Poe, you shouldn’t have done that. You could have been hurt. There are old rusted traps and deep holes and probably rabid bats.”\u003c/p\u003e\n\u003cp\u003e“You forgot ghosts,” I said.\u003c/p\u003e\n\u003cp\u003eVasul held up his hands. “Not this again.”\u003c/p\u003e\n\u003cp\u003e“Just listen, please,” I begged. “What if there really is a reason they don’t want you to go into the forest? What if they don’t want Necuratul to die? What if they’re planning to do something about it, like make another sacrifice?”\u003c/p\u003e\n\u003cp\u003eMariana and Vasul exchanged glances.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Vasul asked.\u003c/p\u003e\n\u003cp\u003eI told them everything. The lost children. The visions. The warning.\u003c/p\u003e\n\u003cp\u003e“I know it sounds crazy, but before I came on this trip, this fortune-teller told me I’d be tested. That this was a test of some kind. What if she was right?”\u003c/p\u003e\n\u003cp\u003eBaz licked his lips nervously and lowered his voice. “They cut your hair. That was always the first part of the ritual, right? Cut the hair and weave it into a braid to show your intent, your loyalty to Satan.”\u003c/p\u003e\n\u003cp\u003e“Then say the incantation and drown them in the lake,” Isabel finished. “Right?”\u003c/p\u003e\n\u003cp\u003e“Mariana, you said it yourself in the church: superstitions have power. That’s why they’re hard to root out,” John added. He was pacing.\u003c/p\u003e\n\u003cp\u003e“I think they’ve decided to go back to the old ways,” I said. “The really old, bad ways. Today I swear I saw someone wearing a red robe in the church—”\u003c/p\u003e\n\u003cp\u003eVasul shook his head. “No one wears red in this village anymore. Not since the old days. It’s considered bad luck, like tempting the devil.”\u003c/p\u003e\n\u003cp\u003e“I saw it,” I insisted, but now I wasn’t so sure. I was accusing Mariana’s mother of something awful, and I half hoped I was right so I wasn’t crazy, and I half hoped I was wrong because it was a terrible thing to imagine.\u003c/p\u003e\n\u003cp\u003e“Poe’s not the only one. We were all there. Those kids—” Isabel stumbled over the word. “Whatever they are—they were warning us!”\u003c/p\u003e\n\u003cp\u003eVasul and Mariana huddled together, whispering in their own language. I couldn’t read their expressions. Were they frightened? Upset? Angry? Did they even believe me? They hugged, and then Mariana turned back to us. Her eyes were as dark as the evening shadows glooming up the room. “If what you’re telling us is true, we have to leave as soon as possible. We have to gather the children…”\u003c/p\u003e\n\u003cp\u003e“I didn’t survive the London School of Economics to end up in a lake,” Vasul tried to joke, but his smile was a ghost.\u003c/p\u003e\n\u003cp\u003e“Mariana, did your mother give anybody else haircuts?” I asked.\u003c/p\u003e\n\u003cp\u003e“All of us. All of the children,” she whispered.\u003c/p\u003e\n\u003cp\u003e“We have to warn the others,” Vasul said softly to her. \u003c/p\u003e","sourceLink":"https://allnovel.net/vacations-from-hell/page-67.html","bookId":2716,"creation":"Oct 5, 2019 10:37:20 AM","modification":"Oct 5, 2019 10:37:20 AM"}
