{"id":4166,"no":5,"title":"Part 1 CHapter 4 The Hospital","content":"\u003cp\u003eThe hospital was nothing more nor less than a partitioned portion of the lower deck, filched from the space allotted to the soldiers. It ran fore and aft, coming close to the stern windows, and was, in fact, a sort of artificial stern cabin. At a pinch, it might have held a dozen men.\u003c/p\u003e \n\u003cp\u003eThough not so hot as in the prison, the atmosphere of the lower deck was close and unhealthy, and the girl, pausing to listen to the subdued hum of conversation coming from the soldiers’ berths, turned strangely sick and giddy. She drew herself up, however, and held out her hand to a man who came rapidly across the misshapen shadows, thrown by the sulkily swinging lantern, to meet her. It was the young soldier who had been that day sentry at the convict gangway.\u003c/p\u003e \n\u003cp\u003e“Well, miss,” he said, “I am here, yer see, waiting for yer.”\u003c/p\u003e \n\u003cp\u003e“You are a good boy, Miles; but don’t you think I’m worth waiting for?”\u003c/p\u003e \n\u003cp\u003eMiles grinned from ear to ear.\u003c/p\u003e \n\u003cp\u003e“Indeed you be,” said he.\u003c/p\u003e \n\u003cp\u003eSarah Purfoy frowned, and then smiled.\u003c/p\u003e \n\u003cp\u003e“Come here, Miles; I’ve got something for you.”\u003c/p\u003e \n\u003cp\u003eMiles came forward, grinning harder.\u003c/p\u003e \n\u003cp\u003eThe girl produced a small object from the pocket of her dress. If Mrs. Vickers had seen it she would probably have been angry, for it was nothing less than the captain’s brandy-flask.\u003c/p\u003e \n\u003cp\u003e“Drink,” said she. “It’s the same as they have upstairs, so it won’t hurt you.”\u003c/p\u003e \n\u003cp\u003eThe fellow needed no pressing. He took off half the contents of the bottle at a gulp, and then, fetching a long breath, stood staring at her.\u003c/p\u003e \n\u003cp\u003e“That’s prime!”\u003c/p\u003e \n\u003cp\u003e“Is it? I dare say it is.” She had been looking at him with unaffected disgust as he drank. “Brandy is all you men understand.” Miles — still sucking in his breath — came a pace closer.\u003c/p\u003e \n\u003cp\u003e“Not it,” said he, with a twinkle in his little pig’s eyes. “I understand something else, miss, I can tell yer.”\u003c/p\u003e \n\u003cp\u003eThe tone of the sentence seemed to awaken and remind her of her errand in that place. She laughed as loudly and as merrily as she dared, and laid her hand on the speaker’s arm. The boy — for he was but a boy, one of those many ill-reared country louts who leave the plough-tail for the musket, and, for a shilling a day, experience all the “pomp and circumstance of glorious war”— reddened to the roots of his closely-cropped hair.\u003c/p\u003e \n\u003cp\u003e“There, that’s quite close enough. You’re only a common soldier, Miles, and you mustn’t make love to me.”\u003c/p\u003e \n\u003cp\u003e“Not make love to yer!” says Miles. “What did yer tell me to meet yer here for then?”\u003c/p\u003e \n\u003cp\u003eShe laughed again.\u003c/p\u003e \n\u003cp\u003e“What a practical animal you are! Suppose I had something to say to you?”\u003c/p\u003e \n\u003cp\u003eMiles devoured her with his eyes.\u003c/p\u003e \n\u003cp\u003e“It’s hard to marry a soldier,” he said, with a recruit’s proud intonation of the word; “but yer might do worse, miss, and I’ll work for yer like a slave, I will.”\u003c/p\u003e \n\u003cp\u003eShe looked at him with curiosity and pleasure. Though her time was evidently precious, she could not resist the temptation of listening to praises of herself.\u003c/p\u003e \n\u003cp\u003e“I know you’re above me, Miss Sarah. You’re a lady, but I love yer, I do, and you drives me wild with yer tricks.”\u003c/p\u003e \n\u003cp\u003e“Do I?”\u003c/p\u003e \n\u003cp\u003e“Do yer? Yes, yer do. What did yer come an’ make up to me for, and then go sweetheartin’ with them others?”\u003c/p\u003e \n\u003cp\u003e“What others?”\u003c/p\u003e \n\u003cp\u003e“Why, the cuddy folk — the skipper, and the parson, and that Frere. I see yer walkin’ the deck wi’ un o’ nights. Dom ’um, I’d put a bullet through his red head as soon as look at un.”\u003c/p\u003e \n\u003cp\u003e“Hush! Miles dear — they’ll hear you.”\u003c/p\u003e \n\u003cp\u003eHer face was all aglow, and her expanded nostrils throbbed. Beautiful as the face was, it had a tigerish look about it at that moment.\u003c/p\u003e \n\u003cp\u003eEncouraged by the epithet, Miles put his arm round her slim waist, just as Blunt had done, but she did not resent it so abruptly. Miles had promised more.\u003c/p\u003e \n\u003cp\u003e“Hush!” she whispered, with admirably-acted surprise —“I heard a noise!” and as the soldier started back, she smoothed her dress complacently.\u003c/p\u003e \n\u003cp\u003e“There is no one!” cried he.\u003c/p\u003e \n\u003cp\u003e“Isn’t there? My mistake, then. Now come here, Miles.”\u003c/p\u003e \n\u003cp\u003eMiles obeyed.\u003c/p\u003e \n\u003cp\u003e“Who is in the hospital?”\u003c/p\u003e \n\u003cp\u003e“I dunno.”\u003c/p\u003e \n\u003cp\u003e“Well, I want to go in.”\u003c/p\u003e \n\u003cp\u003eMiles scratched his head, and grinned.\u003c/p\u003e \n\u003cp\u003e“Yer carn’t.”\u003c/p\u003e \n\u003cp\u003e“Why not? You’ve let me in before.” “Against the doctor’s orders. He told me special to let no one in but himself.”\u003c/p\u003e \n\u003cp\u003e“Nonsense.”\u003c/p\u003e \n\u003cp\u003e“It ain’t nonsense. There was a convict brought in to-night, and nobody’s to go near him.”\u003c/p\u003e \n\u003cp\u003e“A convict!” She grew more interested. “What’s the matter with him?”\u003c/p\u003e \n\u003cp\u003e“Dunno. But he’s to be kep’ quiet until old Pine comes down.”\u003c/p\u003e \n\u003cp\u003eShe became authoritative.\u003c/p\u003e \n\u003cp\u003e“Come, Miles, let me go in.”\u003c/p\u003e \n\u003cp\u003e“Don’t ask me, miss. It’s against orders, and —”\u003c/p\u003e \n\u003cp\u003e“Against orders? Why, you were blustering about shooting people just now.”\u003c/p\u003e \n\u003cp\u003eThe badgered Miles grew angry. “Was I? Bluster or no bluster, you don’t go in.” She turned away. “Oh, very well. If this is all the thanks I get for wasting my time down here, I shall go on deck again.”\u003c/p\u003e \n\u003cp\u003eMiles became uneasy.\u003c/p\u003e \n\u003cp\u003e“There are plenty of agreeable people there.”\u003c/p\u003e \n\u003cp\u003eMiles took a step after her.\u003c/p\u003e \n\u003cp\u003e“Mr. Frere will let me go in, I dare say, if I ask him.”\u003c/p\u003e \n\u003cp\u003eMiles swore under his breath.\u003c/p\u003e \n\u003cp\u003e“Dom Mr. Frere! Go in if yer like,” he said. “I won’t stop yer, but remember what I’m doin’ of.”\u003c/p\u003e \n\u003cp\u003eShe turned again at the foot of the ladder, and came quickly back.\u003c/p\u003e \n\u003cp\u003e“That’s a good lad. I knew you would not refuse me”; and smiling at the poor lad she was befooling, she passed into the cabin.\u003c/p\u003e \n\u003cp\u003eThere was no lantern, and from the partially-blocked stern windows came only a dim, vaporous light. The dull ripple of the water as the ship rocked on the slow swell of the sea made a melancholy sound, and the sick man’s heavy breathing seemed to fill the air. The slight noise made by the opening door roused him; he rose on his elbow and began to mutter. Sarah Purfoy paused in the doorway to listen, but she could make nothing of the low, uneasy murmuring. Raising her arm, conspicuous by its white sleeve in the gloom, she beckoned Miles.\u003c/p\u003e \n\u003cp\u003e“The lantern,” she whispered, “bring me the lantern!”\u003c/p\u003e \n\u003cp\u003eHe unhooked it from the rope where it swung, and brought it towards her. At that moment the man in the bunk sat up erect, and twisted himself towards the light. “Sarah!” he cried, in shrill sharp tones. “Sarah!” and swooped with a lean arm through the dusk, as though to seize her.\u003c/p\u003e \n\u003cp\u003eThe girl leapt out of the cabin like a panther, struck the lantern out of her lover’s hand, and was back at the bunk-head in a moment. The convict was a young man of about four-and-twenty. His hands — clutched convulsively now on the blankets — were small and well-shaped, and the unshaven chin bristled with promise of a strong beard. His wild black eyes glared with all the fire of delirium, and as he gasped for breath, the sweat stood in beads on his sallow forehead.\u003c/p\u003e \n\u003cp\u003eThe aspect of the man was sufficiently ghastly, and Miles, drawing back with an oath, did not wonder at the terror which had seized Mrs. Vickers’s maid. With open mouth and agonized face, she stood in the centre of the cabin, lantern in hand, like one turned to stone, gazing at the man on the bed.\u003c/p\u003e \n\u003cp\u003e“Ecod, he be a sight!” says Miles, at length. “Come away, miss, and shut the door. He’s raving, I tell yer.”\u003c/p\u003e \n\u003cp\u003eThe sound of his voice recalled her.\u003c/p\u003e \n\u003cp\u003eShe dropped the lantern, and rushed to the bed.\u003c/p\u003e \n\u003cp\u003e“You fool; he’s choking, can’t you see? Water! give me water!”\u003c/p\u003e \n\u003cp\u003eAnd wreathing her arms around the man’s head, she pulled it down on her bosom, rocking it there, half savagely, to and fro.\u003c/p\u003e \n\u003cp\u003eAwed into obedience by her voice, Miles dipped a pannikin into a small puncheon, cleated in the corner of the cabin, and gave it her; and, without thanking him, she placed it to the sick prisoner’s lips. He drank greedily, and closed his eyes with a grateful sigh.\u003c/p\u003e \n\u003cp\u003eJust then the quick ears of Miles heard the jingle of arms. “Here’s the doctor coming, miss!” he cried. “I hear the sentry saluting. Come away! Quick!”\u003c/p\u003e \n\u003cp\u003eShe seized the lantern, and, opening the horn slide, extinguished it.\u003c/p\u003e \n\u003cp\u003e“Say it went out,” she said in a fierce whisper, “and hold your tongue. Leave me to manage.”\u003c/p\u003e \n\u003cp\u003eShe bent over the convict as if to arrange his pillow, and then glided out of the cabin, just as Pine descended the hatchway.\u003c/p\u003e \n\u003cp\u003e“Hallo!” cried he, stumbling, as he missed his footing; “where’s the light?”\u003c/p\u003e \n\u003cp\u003e“Here, sir,” says Miles, fumbling with the lantern. “It’s all right, sir. It went out, sir.”\u003c/p\u003e \n\u003cp\u003e“Went out! What did you let it go out for, you blockhead!” growled the unsuspecting Pine. “Just like you boobies! What is the use of a light if it ‘goes out’, eh?” As he groped his way, with outstretched arms, in the darkness, Sarah Purfoy slipped past him unnoticed, and gained the upper deck.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/799/583.html","bookId":144,"creation":"Aug 1, 2019 5:10:15 AM","modification":"Aug 1, 2019 5:10:15 AM"}
