{"id":8538,"no":19,"title":"CHAPTER XIX. A MISSOURI TAVERN.","content":"\u0026nbsp;The next day Tom started on his way. His new companion, Donald Ferguson, was a sedate Scotchman, and a thoroughly reliable[150] man. He was possessed to the full of the frugality characteristic of the race to which he belonged, and, being more accustomed to traveling than Tom, saved our hero something in the matter of expense. He was always ready to talk of Scotland, which he evidently thought the finest country in the world. He admitted that Glasgow was not as large a city as London, but that it was more attractive. As for New York, that city bore no comparison to the chief city of Scotland. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must go to Scotland some time, Tom,\" he said. \"If you can\u0027t visit but one country in the Old World, go to Scotland.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Privately Tom was of opinion that he should prefer to visit England; but he did not venture to hurt the feelings of his fellow-traveler by saying so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder, Mr. Ferguson,\" he could not help saying one day, \"that you should have been willing to leave Scotland, since you so much prefer it to America.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll tell you, my lad,\" answered the Scotchman. \"I would rather live in Scotland than anywhere else on God\u0027s footstool; but I won\u0027t be denying that it is a poor place for a man to[151] make money, if compared with a new country like this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There are no gold-mines, I suppose, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; and the land is not as rich as the land here. It is rich in historical associations; but a man, you know, can\u0027t live on those,\" he added shrewdly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I should think not,\" said Tom. \"It would be pretty dry diet. How long have you been in the country, Mr. Ferguson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A matter of three months only, my lad. It\u0027s the gold-mines that brought me over. I read of them in the papers at home, and I took the first ship across the Atlantic.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you a family, Mr. Ferguson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve got an old mother at home, my lad, who looks to me for support. I left fifty pounds with her when I came away. It\u0027ll last her, I\u0027m thinkin\u0027, till I can send her some from California.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then Mr. Ferguson, you are like me,\" said Tom. \"I am going to California to work for my father and mother. Father is poor, and I have brothers and sisters at home to provide for. I hope I shall succeed, for their sake.\"[152]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will, my lad,\" said the Scotchman, in a tone of calm confidence. \"It is a noble purpose, and if you keep to it God will bless you in your undertaking, and give you a good fortune.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope we shall both be fortunate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no fear. I put my trust in the Lord, who is always ready to help those who are working for him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom found that Mr. Ferguson, though his manner was dry and unattractive, was a religious man, and he respected and esteemed him for his excellent traits. He was not a man to inspire warm affection, but no one could fail to respect him. He felt that he was fortunate in having such a man for his companion, and he was glad that Mr. Ferguson appeared to like him in turn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He also found that the Scotchman, though a man of peace, and very much averse to quarreling, was by no means deficient in the trait of personal courage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One evening they arrived at a small tavern in a Missouri town. Neither Tom nor his companion particularly liked the appearance of the place nor its frequenters, but it appeared[153] to be the only place of entertainment in the settlement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The barroom, which was the only public room set apart for the use of the guests, was the resort of a party of drunken roisterers, who were playing poker in the corner, and betting on the game. At the elbow of each player was set a glass of whisky, and the end of each game was marked by a fresh glass all around.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom and Mr. Ferguson took a walk after supper, and then sat down quietly at a little distance from the card-players, attracting at first but little attention from them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently, at the close of a game, glasses were ordered for the party, at the expense of those who had suffered defeat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027ll you have, strangers?\" inquired a tipsy fellow, with an Indian complexion and long black hair, staggering toward Ferguson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir,\" said the Scotchman; \"but I don\u0027t drink.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t drink!\" exclaimed the former, in evident surprise. \"What sort of a man, pray, may you be?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am a temperance man,\" said Ferguson,[154] adding indiscreetly, \"and it would be well for you all if you would shun the vile liquor which is destroying soul and body.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"—— your impudence!\" ejaculated the other, in a rage. \"Do you dare to insult gentlemen like us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never insult anybody,\" said the Scotchman calmly. \"What I have said is for your good, and you would admit it if you were sober.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you dare to say I\u0027m drunk?\" demanded the man, in a fury.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Ferguson,\" said Tom, in a low voice, \"I wouldn\u0027t provoke him if I were you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the Scotchman was no coward, and, though generally prudent, he was too fond of argument to yield the point.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course, you\u0027re drunk,\" he said calmly. \"If you will reflect, you show all the signs of a man that has taken too much liquor. Your face is flushed, your hand is unsteady, and——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was interrupted by a volley of execrations from the man whom he was coolly describing, and the latter, in a fit of fury, struck the Scotchman in the face. Had the blow been[155] well directed it would, for the time, have marred the small share of personal beauty with which nature had endowed Mr. Ferguson; but it glanced aside and just struck him on his prominent cheek-bone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A ring! a ring!\" shouted the men in the corner, jumping to their feet in excitement. \"Let Jim and the Scotchman fight it out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gentlemen,\" said Mr. Ferguson, \"I don\u0027t wish to fight with your friend. He is drunk, as you can see plainly enough. I don\u0027t wish to fight with a drunken man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who says I am drunk?\" demanded the champion of whisky. \"Let me get at him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But his friends were now holding him back. They wanted to see a square fight, according to rule. It would prove, in their opinion, a pleasant little excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I meant no offense,\" said Ferguson; \"I only told the truth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a —— liar!\" exclaimed the man, known as Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not heed the words of a man in your condition,\" said the Scotchman calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pull his nose, Jim! Make him fight!\" exclaimed[156] the friends of the bully. \"We\u0027ll back you!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The hint was taken. Jim staggered forward, and, seizing the Scotchman\u0027s prominent nose, gave it a violent tweak.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now there are few men, with or without self-respect, who can calmly submit to an insult like this. Certainly Mr. Donald Ferguson was not one of them. The color mantled his high cheek-bones, and anger gained dominion over him. He sprang to his feet, grasped the bully in his strong arms, dashed him backward upon the floor of the barroom, and, turning to the companions of the fallen man, he said, \"Now come on, if you want to fight. I\u0027ll take you one by one, and fight the whole of you, if you like.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instead of being angry, they applauded his pluck. They cared little for the fate of their champion, but were impressed by the evident strength of the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stranger,\" said one of them, \"you\u0027ve proved that you\u0027re a man of honor. We thought you were a coward. It\u0027s a pity you don\u0027t drink. What may your name be?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Donald Ferguson.\"[157]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, boys, here\u0027s to the health of Mr. Ferguson. He\u0027s a bully boy, and no coward.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gentlemen,\" said the Scotchman, \"it\u0027s a compliment you mean, no doubt, and I\u0027m suitably thankful. If you\u0027ll allow me, I\u0027ll drink your health in a liquor which will not injure any one. I\u0027ll wish you health and prosperity in a glass of cold water, if the barkeeper happens to have any of that beverage handy. Tom, join with me in the toast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom did so, and the speech was well received.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As for this gentleman,\" said Mr. Ferguson, addressing Jim, who had struggled to his feet, and was surveying the scene in rather a bewildered way, \"I hope he won\u0027t harbor malice; I\u0027ve only got even with him. We may as well forgive and forget.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s the talk! Jim, drink the stranger\u0027s health!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jim looked a little doubtful, but when a glass of whisky was put into his hand he could not resist the seductive draft, and tossed it down.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now shake hands!\" said one of the players.[158]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With all my heart,\" said Ferguson, and the two shook hands, to the great delight of the company.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You got off pretty well, Mr. Ferguson,\" said Tom, when they retired for the night.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, my lad, better than I expected. I thought once I would have to fight the whole pack. Poor fellows! I pity them. They are but slaves to their appetites. I hope, my lad, you\u0027ll never yield to a like temptation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No fear for me, Mr. Ferguson. I feel as you do on the subject.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The journey continued till one day, about noon, they reached the town of St, Joseph, popularly called St. Joe.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3011/83172.html","bookId":280,"creation":"Aug 1, 2019 8:37:13 AM","modification":"Aug 1, 2019 8:37:13 AM"}
