{"id":8542,"no":23,"title":"CHAPTER XXIII. MR. PEABODY\u0027S TROUBLES.","content":"\u0026nbsp;When the party camped for the night the custom was to arrange the baggage wagons in a semicircle, and provide a resting-place for the women and children inside. As they were passing through a country occupied by Indians it was necessary to post one or more sentinels to keep watch through the night, and give notice of any who might be seen lurking near the camp. Fortunately, however, an Indian attack was seldom made at night. The time generally selected was in the morning, when the party were preparing to start on their day\u0027s march. Tom, as a boy, would have been excused taking his turn; but this did not suit him. He requested as a favor, that he might stand watch with the rest. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can he be relied upon? Is he not too young?\" asked Fletcher, the leader, of Mr. Ferguson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can depend upon him,\" said the[185] Scotchman confidently. \"There\u0027s more manliness in Tom than in many men of twice his years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I will put his name on the list,\" said Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s right. I\u0027ll answer for him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But there was one of the travelers who was by no means eager to stand on watch. This was Lawrence Peabody, the young man from Boston. He sought an interview with Fletcher, and asked to be excused.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On what grounds, Mr. Peabody?\" asked Fletcher, surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It doesn\u0027t agree with me to lose my night\u0027s sleep,\" said Peabody. \"I am naturally delicate, and——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your excuse is not satisfactory, Mr. Peabody. We are banded together in a little community, having mutual rights and mutual obligations. In the arrangements made for the common safety it is your duty to bear your part.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am willing to provide a substitute,\" said Peabody eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where will you find a substitute?\"[186]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have been talking with Tom Nelson. He says he is willing to serve in my turn.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He will serve when his own turn comes; that will be all we can expect of him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But he is only a boy. Why should he be expected to take his turn?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he is old enough to be a substitute, he is old enough to stand watch for himself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, Mr. Fletcher, I am very delicate,\" protested Lawrence Peabody. \"I must have my regular sleep, or I shall be sick.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We must take our chances of that, Mr. Peabody.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be very likely to go to sleep on my post.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t advise you to,\" said Fletcher seriously. \"It might be dangerous.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dangerous!\" ejaculated Peabody nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Precisely. If a lurking Indian should surprise you, you might wake up to find yourself scalped.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good gracious!\" exclaimed the Bostonian, his teeth chattering, for he was not of the stuff of which heroes are made. \"Do you—think there is any danger of that?\"[187]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Considerable, if you neglect your duty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But perhaps I can\u0027t help falling asleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Peabody,\" said Fletcher sternly, \"you must keep awake. Not only your own safety, but that of the whole camp, may depend upon your vigilance. If you choose to risk your own life, I don\u0027t complain of that, but you shall not imperil ours. I therefore give you notice, that if you fall asleep on guard you will be drummed out of camp, and left to shift for yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I couldn\u0027t find my way on the prairie,\" said Peabody, very much alarmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had better think of that when you are tempted to close your eyes, Mr. Peabody,\" replied Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lawrence Peabody walked off, feeling very much disconcerted. Fervently he wished himself back in Boston, where there are no Indians, and a man might sleep from one week\u0027s end to another without any danger of losing his scalp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter, Mr. Peabody?\" asked Tom, observing his melancholy appearance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think I shall ever live to see California,\" answered Mr. Peabody plaintively.[188]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, what\u0027s the matter now?\" asked Tom, checking an inclination to laugh; \"are you sick?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t feel very well, Tom. I\u0027m very delicate, and this journey is almost too much for my strength.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, cheer up, Mr. Peabody! Think of the gold that awaits you at the end of the journey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s all that keeps me up, I do assure you. But I am afraid I shall never live to get there,\" said Peabody, with a groan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t think of such things, Mr. Peabody. Of course none of us is sure of living, but the chances are, that we shall reach California in health, make our fortunes, and go home rich. At any rate, that\u0027s what I am looking forward to.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t mind so much but for one thing, Tom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fletcher insists that I shall take my turn in standing guard. If I were not so delicate I wouldn\u0027t mind; but I know I can\u0027t stand it. I\u0027ll give you two dollars to take my place, every time my turn comes.\"[189]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am willing, if Mr. Fletcher is,\" said Tom, who was by no means averse to making a little extra money.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But he isn\u0027t. I proposed it to him, for I was sure I could arrange with you; but he refused.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose,\" said Tom slyly, \"he thought I couldn\u0027t fill your place. You are a brave, resolute man, and I am only a boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom—I—I don\u0027t mind telling you; but I am afraid I am not brave.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, nonsense, Mr. Peabody! that is only your modesty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I assure you,\" said the young Bostonian earnestly, \"I am speaking the truth. If I should see an Indian crawling near the camp I\u0027m really afraid I should faint.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You won\u0027t know how brave you are till you are put to the test.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But do you think there is any chance of my being put to the test? Do you think there are any Indians near?\" asked Lawrence Peabody, wiping the damp perspiration from his brow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course there must be,\" said Tom.[190] \"We are passing through their hunting-grounds, you know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why did I ever leave Boston?\" said Mr. Peabody sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You came, as I did, to make your fortune, Mr. Peabody.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m afraid I can\u0027t keep awake, Tom; Mr. Fletcher tells me, if I don\u0027t, that he will turn me adrift on the prairie. Isn\u0027t that hard?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid it is a necessary regulation. But you won\u0027t fall asleep. Your turn will only come about once in two weeks, and that isn\u0027t much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The nights will seem very long.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think so. I think it\u0027ll be fun, for my part.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But suppose—when you are watching—you should all at once see an Indian, Tom?\" said Peabody, with a shiver.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it would be rather unlucky for the Indian,\" said Tom coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a strange boy, Tom,\" said Mr. Peabody.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What makes you think so?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t seem to care anything about the danger of being scalped.\"[191]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t believe I should like being scalped any more than you do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You might have got off from standing watch; but you asked to be allowed to.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is quite true, Mr. Peabody. I want to meet my fair share of danger and fatigue.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can stand it, for you are strong and tough. You have not my delicacy of constitution.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps that\u0027s it,\" said Tom, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you mind speaking to Fletcher, and telling him you are willing to take my place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will do it, if you wish me to, Mr. Peabody.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Tom; you are a true friend;\" and Mr. Peabody wrung the hand of his young companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom was as good as his word. He spoke to Fletcher on the subject; but the leader of the expedition was obdurate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t consent, my boy,\" he said. \"It is enough for you to take your turn. That young dandy from Boston needs some discipline to make a man of him. He will never do anything in a country like California unless he[192] has more grit than he shows at present. I shall do him a favor by not excusing him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom reported the answer to Peabody, who groaned in spirit, and nervously waited for the night when he was to stand watch.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3011/83176.html","bookId":280,"creation":"Aug 1, 2019 8:37:24 AM","modification":"Aug 1, 2019 8:37:24 AM"}
