{"id":8543,"no":24,"title":"CHAPTER XXIV. A SAD SIGHT.","content":"\u0026nbsp;A day later, while the wagon-train was slowly winding through a mountain defile, they encountered a sight which made even the stout-hearted leader look grave. Stretched out stiff and stark were two figures, cold in death. They were men of middle age, apparently. From each the scalp had been removed, thus betraying that the murderers were Indians. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like to come across the red devils who did this,\" said Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What would you do with them?\" asked Ferguson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shoot them down like dogs, or if I could take them captive they should dangle upon the boughs of yonder tree.\"[193]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I shall be ready to die when my time comes,\" said Ferguson; \"but I want it to be in a Christian bed, and not at the hands of a dirty savage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then Lawrence Peabody came up. He had been lagging in the rear, as usual.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What have you found?\" he inquired, not seeing the bodies at first, on account of the party surrounding them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come here, and see for yourself, Peabody,\" said one of the company.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lawrence Peabody peered at the dead men—he was rather near-sighted—and turned very pale.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it the Indians?\" he faltered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it\u0027s those devils. You can tell their work when you see it. Don\u0027t you see that they are scalped?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe I shall faint,\" said Peabody, his face becoming of a greenish hue. \"Tom, let me lean on your shoulder. Do—do you think it has been done lately?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yesterday, probably,\" said Ferguson. \"The bodies look fresh.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then the Indians that did it must be near here?\"[194]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Probably.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"These men were either traveling by themselves, or had strayed away from their party,\" said Fletcher. \"It shows how necessary it is for us to keep together. In union there is strength.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The bodies were examined. In the pocket of one was found a letter addressed to James Collins, dated at some town in Maine. The writer appeared to be his wife. She spoke of longing for the time when he should return with money enough to redeem their farm from a heavy mortgage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Poor woman!\" said Ferguson. \"She will wait for her husband in vain. The mortgage will never be paid through his exertions.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom looked sober, as he glanced compassionately at the poor emigrant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He came on the same errand that I did,\" he said. \"I hope my journey will have a happier ending.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Always hope for the best, Tom,\" said his Scotch friend. \"You will live happier while you do live, and, if the worst comes, it will be time enough to submit to it when you must.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is good philosophy, Mr. Ferguson.\"[195]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed it is, my lad. Don\u0027t borrow trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We must bury these poor men,\" said Fletcher. \"We can\u0027t leave them out here, possibly to be devoured by wild beasts. Who will volunteer for the service?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come, Peabody,\" said John Miles, a broad-shouldered giant, who had a good-natured contempt for the young man from Boston. \"Suppose you and I volunteer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lawrence Peabody shrank back in dismay at the unwelcome proposition.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t do it,\" he said, shivering. \"I never touched a dead body in my life. I am so delicate that I couldn\u0027t do it, I assure you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s lucky we are not all delicate,\" said Miles, \"or the poor fellows would be left unburied. I suppose if anything happens to you, Peabody, you will expect us to bury you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, don\u0027t mention such a thing, Mr. Miles,\" entreated Peabody, showing symptoms of becoming hysterical. \"I really can\u0027t bear it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s my belief that nature has made a mistake, and Peabody was meant for a woman,\" said Miles, shrugging his shoulders.[196]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will assist you, my friend,\" said the Scotchman. \"It\u0027s all that remains for us to do for the poor fellows.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not quite all,\" said Tom. \"Somebody ought to write to the poor wife. We have her address in the letter you took from the pocket.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well thought of, my lad,\" said Fletcher. \"Will you undertake it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you think I can do it properly,\" said Tom modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027ll be grievous news, whoever writes it. You can do it as well as another.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In due time Mrs. Collins received a letter revealing the sad fate of her husband, accompanied with a few simple words of sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Over the grave a rude cross was planted, fashioned of two boards, with the name of James Collins, cut out with a jack-knife, upon them. This inscription was the work of Miles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Somebody may see it who knows Collins,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It happened that, on the second night after the discovery of Collins and his unfortunate companion, Lawrence Peabody\u0027s turn came to stand watch. He was very uneasy and nervous[197] through the day. In the hope of escaping the ordeal he so much dreaded he bound a handkerchief round his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter, Mr. Peabody?\" asked Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve got a fearful headache,\" groaned Peabody. \"It seems to me as if it would split open.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me feel of it,\" said Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It doesn\u0027t feel hot; it doesn\u0027t throb,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It aches terribly,\" said Peabody. \"I\u0027m very subject to headache. It is the effect of a delicate constitution.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The fellow is shamming,\" said Fletcher to himself; and he felt disgust rather than sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a little curious, Mr. Peabody, that this headache should not come upon you till the day you are to stand on watch,\" remarked the leader, with a sarcasm which even the young man from Boston detected.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it\u0027s strange,\" he admitted, \"and very unlucky, for of course you won\u0027t expect a sick man to watch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t look at it in the right light, Mr.[198] Peabody. I regard it as rather lucky than otherwise.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lawrence Peabody stared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t understand you, Mr. Fletcher,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you have the headache, it will prevent you from going to sleep, and you remember you expressed yourself as afraid that you might. If you were quite well, I might feel rather afraid of leaving the camp in your charge. Now, I am sure you won\u0027t fall asleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Peabody listened in dismay. The very plan to which he had resorted in the hope of evading duty was likely to fasten that duty upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027ll be well before night,\" thought Fletcher shrewdly; and he privately imparted the joke to the rest of the party. The result was that Mr. Peabody became an object of general attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In half an hour the young man from Boston removed his handkerchief from his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you feeling better, Mr. Peabody?\" asked Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very much better,\" said Peabody.[199]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your headache seems to pass off suddenly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it always does,\" said the young Bostonian. \"I am like mother in that. She had a delicate constitution, just like mine. One minute she would have a headache as if her head would split open, and half an hour afterward she would feel as well as usual.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very fortunate. I was afraid your headache would make it uncomfortable for you to watch to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it would; but, as the captain said, it would have kept me awake. Now I don\u0027t believe I can keep from sleeping on my post.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you tell Fletcher so?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you tell him, Tom? He might pay more attention to it if you told him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Mr. Peabody. You are certainly the most suitable person to speak to him. What makes you think he would pay more attention to me, who am only a boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He seems to like you, Tom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope he does, but really, Mr. Peabody, you must attend to your own business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fletcher was at the head of the train, walking beside the first wagon. Hearing hurried[200] steps, he turned, and saw Mr. Lawrence Peabody, panting for breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you got over your headache, Mr. Peabody?\" he asked, with a quiet smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Mr. Fletcher, it\u0027s all gone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to hear it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would have kept me awake to-night, as you remarked,\" said Peabody. \"Now, I am really afraid that I shall fall asleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That would be bad for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why so?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You remember those two poor fellows whom we found scalped the other day?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall never forget them,\" said Lawrence Peabody, with a shudder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Better think of them to-night. If you go to sleep on watch, those very Indians may serve you in the same way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, good gracious!\" ejaculated Peabody, turning pale.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They or some of their tribe are, no doubt, near at hand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you think you could excuse me, Mr. Fletcher?\" stammered Peabody, panic-stricken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No!\" thundered Fletcher, so sternly that[201] the unhappy Bostonian shrank back in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For the credit of Boston, it may be said that John Miles—a broad-shouldered young giant, who did not know what fear was—more honorably represented the same city.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3011/83177.html","bookId":280,"creation":"Aug 1, 2019 8:37:27 AM","modification":"Aug 1, 2019 8:37:27 AM"}
