{"id":8523,"no":4,"title":"CHAPTER IV. TOM ASKS LEAVE OF ABSENCE.","content":"\u0026nbsp;Tom walked home slowly, but the distance seemed short, for he was absorbed in thought. In a way very unexpected he seemed to be likely to realize what he had regarded as a very pleasant, but impossible, dream. Would his father consent to the squire\u0027s proposal, and, if so, ought Tom to consent to expose him to the risk of losing so considerable a sum of money? If he had been older and more cautious he would probably have decided in the negative; but Tom was hopeful and sanguine, and the stories he had heard of California had dazzled him. There was, of course, an element of uncertainty in his calculations, but the fact[26] that there seemed to be no prospect before him in his native village had an important influence in shaping his decision. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To ask his father the momentous question, however, was not easy, and he delayed it, hoping for a favorable opportunity of introducing the subject. His thoughtful manner excited attention, and secured him the opportunity he sought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You seem deep in thought, Tom,\" said his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, mother, I have a good deal to think about.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Anybody would think Tom overwhelmed with business,\" said Walter, next to Tom in age, with good-humored banter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am,\" said Tom gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you take me in partnership, then?\" asked Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think I could do that,\" he answered. \"Not to keep you waiting, Squire Hudson has made me a business proposal this afternoon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All were surprised and looked to Tom for an explanation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He offers to advance me two hundred dollars[27] for a year, to help me out to California.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Squire Hudson makes this offer to a boy of your age?\" said his father slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, or rather he makes the offer to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you will think me selfish for even mentioning it,\" said Tom rapidly, in a hurry to explain fully now that the ice was broken. \"He will advance the money, on condition that you increase the mortgage on the farm to twenty-two hundred dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Nelson looked blank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know, Tom,\" he said, \"how hard I find it now to pay the interest on the mortgage, and how hopeless I am of ever paying it off?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know all that, father; but I want to help you. If I keep my health, and have a chance, I think I can help you. There\u0027s no chance for me here, and there is a chance in California. You remember what we have read in the Weekly Messenger about the gold-fields, and what large sums have been realized by miners.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They are men, and you are a boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s true,\" said Tom, \"but,\" he added, with natural pride, \"I am pretty strong for a boy. I am willing to work, and I don\u0027t see[28] why I can\u0027t dig gold as well as a man. I may not make as much, but if I only do half as well as some that we have read about, I can do a good deal for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How far off is California?\" asked Mrs. Nelson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Over three thousand miles, across the continent,\" answered her husband. \"By sea it is a good deal more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, it is as far off as Europe,\" said Walter, who was fresh from his lesson in geography.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is farther than some parts of Europe—England, for example,\" said his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And a wild, unsettled region,\" said Mrs. Nelson soberly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think so much of that,\" said Mark Nelson. \"Tom is no baby. He is a boy of good sense, not heedless, like some of his age, and I should feel considerable confidence in his getting along well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, Mark, are you in favor of his going so far—a boy who has never been away from home in his life?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know what to say. I have not had time to consider the matter, as it has come upon me suddenly. I have a good deal of confidence[29] in Tom, but there is one difficulty in my mind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is that, father?\" asked Tom anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The expense of getting to California, and the method of raising the money; I don\u0027t like to increase the mortgage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you are right, father,\" said Tom slowly. \"I know it is more than I have any right to ask. I wouldn\u0027t even have mentioned it if I hadn\u0027t hoped to help you to pay it back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is understood, Tom,\" said his father kindly. \"I know you mean what you say, and that you would redeem your promise if fortune, or rather Providence, permitted. It is a serious matter, however, and not to be decided in a hurry. We will speak of it again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nothing more was said about Tom\u0027s plan till after the children had gone to bed. Then, as Mark Nelson and his wife sat before the fire in the open fireplace, the subject was taken up anew.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mary,\" said Mark, \"I am beginning to think favorably of Tom\u0027s proposal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How can you say so, Mark?\" interrupted his wife. \"It seems like madness to send a young boy so far away.\"[30]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom can\u0027t be called a young boy; he is now sixteen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But he has never been away from home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He must go some time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If it were only to Boston or New York; but to go more than three thousand miles away!\" and the mother shuddered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There are dangers as great in Boston or New York as in California, Mary, to a boy of Tom\u0027s age. He can\u0027t always be surrounded by home influences.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish we could find employment for him in town,\" said Mrs. Nelson uneasily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is a mother\u0027s thought, and it would be pleasant for all of us; but I doubt if it would be better for Tom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A boy who is thrown upon his own guardianship and his own resources develops manliness and self-reliance sooner than at home. But we need not take that into consideration; there is nothing to do here, nor is there likely to be. He must go away from home to find employment. To obtain a place in Boston or New York requires influence and friends in those places; and we can hope for neither. In California he will become his own employer.[31] The gold-mines are open to all, and he may earn in a year as much as he could in five years in the East.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you favor his going, then, Mark?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not against your will, Mary. Indeed, I should not feel justified in increasing the mortgage upon our little property against your wish. That concerns us all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think so much of that. I am so afraid Tom would get sick in California. What would become of the poor boy in that case?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is a mother\u0027s thought. I think Tom would find friends, who would not let him suffer. He is a manly, attractive boy, though he is ours, and I think he is well calculated to make his way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That he is,\" said his mother proudly. \"No one can help liking Tom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you see he is likely to find friends. Were he such a boy as Sinclair Hudson, I should feel afraid that he would fare badly, if he stood in need of help from others. Sinclair is certainly a very disagreeable boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he is; and he isn\u0027t half as smart as Tom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A mother\u0027s vanity,\" said Mark Nelson,[32] smiling. \"However, you are right there. I should consider it a misfortune to have such a cross-grained, selfish son as Sinclair. Squire Hudson, with all his wealth, is not fortunate in his only child. There is considerable resemblance between father and son. I often wish that some one else than the squire held the mortgage on our farm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t think he would take advantage of you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think he would be very lenient to me if I failed to pay interest promptly. He has a grudge against me, you know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is nonsense,\" said Mrs. Nelson, blushing, for she understood the allusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad he doesn\u0027t ask me to give him a mortgage on you, Mary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has forgotten all that,\" said Mrs. Nelson. \"I am no longer young and pretty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you more attractive than ever,\" said the husband.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because you are foolish,\" said his wife; but she was well pleased, nevertheless. Poor as her husband was, she had never dreamed of regretting her choice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Be it so; but about this affair of Tom—what shall I say to him in the morning?\"[33]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Nelson recovered her gravity instantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Decide as you think right, Mark,\" she said. \"If you judge that Tom had better go I will do my best to become reconciled to his absence, and set about getting him ready.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a great responsibility, Mary,\" said Mark slowly; \"but I accept it. Let the boy go, if he wishes. He will leave our care, but we can trust him to the care of his heavenly Father, who will be as near to him in California as at home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus Tom\u0027s future was decided. His father and mother retired to bed, but not to sleep. They were parting already in imagination with their first-born, and the thought of that parting was sad indeed.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3011/83157.html","bookId":280,"creation":"Aug 1, 2019 8:36:39 AM","modification":"Aug 1, 2019 8:36:39 AM"}
