{"id":8524,"no":5,"title":"CHAPTER V. TOM RAISES THE MONEY.","content":"\u0026nbsp;Tom got up early the next morning—in fact, he was up first in the house—and attended to his usual \"chores.\" He was splitting wood when his father passed him on the[34] way to the barn with the milk-pail in his hand. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are up early, Tom,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom could not help wondering whether his father had come to any decision about letting him go to California; but he did not like to ask. In due time he would learn, of course. He felt that he should like to have it decided one way or the other. While his plans were in doubt he felt unsettled and nervous.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At an early hour the family gathered about the breakfast table. Tom noticed that his father and mother looked grave, and spoke in a subdued tone, as if they had something on their minds; but he did not know what to infer from this, except that they had his prospects still in consideration.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When breakfast was over, Mark Nelson pushed back his chair, and said: \"How soon can you get Tom ready to start, Mary?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Am I going, father?\" asked Tom, his heart giving an eager bound.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is Tom really going?\" asked the younger children, with scarcely less eagerness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If Squire Hudson doesn\u0027t go back on his[35] promise. Tom, you can go with me to the squire\u0027s.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How soon?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In about an hour. He doesn\u0027t breakfast as early as we do. I think he will be ready to receive us in about an hour.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, father,\" said Tom. \"You are doing a great deal for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t do much for you, my boy. I can probably get you to California, and then you will be thrown upon your own exertions.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean to work very hard. I think I shall succeed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope so, at least, Tom. When the time comes to start the other boys, I shall be glad to have your help in doing it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom was pleased to hear this, though it placed upon his shoulders a new and heavy responsibility. He was assuming the responsibility not only for his own future, but for that of his brothers. But it made him feel more manly, as if the period of his dependent boyhood were over, and he had become a young man all at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I sha\u0027n\u0027t disappoint you, father,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you do, I don\u0027t think it will be your[36] fault, Tom,\" said his father kindly. \"Fortune may be against you, but we must take the risk of that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know what to think about it, Tom,\" said his mother, in a tone of doubt and mental disturbance. \"I feel as if you were too young to go out in the wide world to seek your fortune.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not so very young, mother. I am old enough to make my way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So your father says, and I have yielded to his judgment; but, Tom, I don\u0027t know how to let you go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There were tears in Mrs. Nelson\u0027s eyes as she spoke. Tom was moved, and if he needed anything to strengthen him in the good resolutions he had formed, his mother\u0027s emotion supplied it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You sha\u0027n\u0027t regret giving your consent, mother,\" he said manfully, and, rising from his seat, he went to his mother and kissed her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mary,\" said Mr. Nelson, \"you haven\u0027t answered my question. How long will it take to get Tom ready? If he is to go, he may as well start as soon as possible.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me see,\" said Mrs. Nelson, \"how many shirts have you got, Tom?\"[37]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are they all in good order?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe one needs mending.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know whether that will be enough,\" said Mrs. Nelson doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mary,\" said her husband, \"don\u0027t provide too large a supply of clothing. Tom may find it a burden. Remember, in California, he will have to travel on foot and carry his own baggage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I think he is already pretty well provided. But some of his clothes may need mending. That won\u0027t take long, and I will attend to it at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps Squire Hudson will go back on you, after all,\" said Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom\u0027s face was overcast. That would be a disappointment he could not easily bear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall soon know,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n An hour later Tom and his father set out for Squire Hudson\u0027s residence. Tom felt nervous; he could not well help it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom,\" said his father, \"this is an important visit for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are feeling nervous, I see. Try to[38] take it coolly, and don\u0027t feel too low-spirited if things don\u0027t turn out as you hope.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will try to follow your advice, father, but I am not sure as I can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you are disappointed, try to think it is for the best. A boy of your age had made all arrangements to visit Europe with a party of friends. The day before starting something happened which made it impossible for him to go. For weeks he had been looking forward with eager anticipation to his journey, and now it was indefinitely postponed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a terrible disappointment!\" said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it seemed so, but mark the issue. The steamer was lost, and all on board were drowned. The disappointment saved his life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It might not always turn out so,\" objected Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, that is true. Still, if we are willing to think that our disappointments are not always misfortunes, we shall go through life with more cheerfulness and content.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Still, I hope I shall not be disappointed in this,\" said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are perhaps too young to be philosophical,\" said his father.[39]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark Nelson had enjoyed only the usual advantages of education afforded by a common school; but he was a man of good natural capacity, and more thoughtful than many in his vocation. From him Tom inherited good natural abilities and industrious habits. It would not be fair, however, to give all the credit to his father. Mrs. Nelson was a superior woman, and all her children were well endowed by nature.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As they turned into Squire Hudson\u0027s gravel-path, the squire himself opened the front door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Were you coming to see me?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We would like to speak with you a few minutes, squire, if you can spare the time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, I have nothing pressing on hand,\" said the squire, with unusual affability. \"Walk in, Mr. Nelson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He led the way into the room where Tom had had his interview with him the day before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your son did me a good turn yesterday,\" he said graciously. \"He behaved in a very creditable manner.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He told me that he found your pocketbook, Squire Hudson.\"[40]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; it contained a large sum of money. Some boys would have kept it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"None of my boys would,\" said Mark Nelson proudly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course not. They\u0027re too well brought up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom told me that you offered to advance money enough to get him to California,\" said Mr. Nelson, coming to business.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On satisfactory security,\" added the squire cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You proposed to increase the mortgage on my place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said the squire. \"I wouldn\u0027t have done it, though, Neighbor Nelson, but for the good turn the boy did me. I am not at all particular about increasing the amount of the mortgage, but, if by so doing it I can promote Tom\u0027s views, I won\u0027t object.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir,\" said Tom gratefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a serious step for me to take,\" continued Mr. Nelson, \"for I feel the incumbrance to be a heavy one already. In fact, it is with difficulty that I pay the interest. But the time has come when Tom should start in life, and in this village there seems to be no opening.\"[41]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"None whatever,\" said the squire, in a tone of decision.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you think of the prospects in California?\" asked Mark Nelson. \"You are a man of business, and can judge better than I. Are the stories we hear of fortunes made in a short time to be relied upon?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As to that,\" said the squire deliberately, \"I suppose we can\u0027t believe all we hear; we must make some allowances. But, after all, there\u0027s no doubt of the existence of gold in large quantities; I am satisfied of that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then about the wisdom of sending out a boy like Tom, alone; do you think it best?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It depends altogether on the boy,\" responded the squire. \"If he is honest, industrious, and energetic, he will make his way. You know your own boy better than I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is all you say, Squire Hudson. I have a great deal of confidence in Tom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom looked at his father gratefully. Sometimes it does a boy good to learn that the older people have confidence in him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then let him go,\" said the squire. \"I stand ready to furnish the money. I think you said you needed two hundred dollars.\"[42]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This question was put to Tom, and the boy answered in the affirmative.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well,\" said the squire. \"As soon as the necessary writings are made out, the money shall be ready.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s all settled!\" thought Tom triumphantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At that moment Sinclair Hudson, the squire\u0027s only son, opened the door and looked into the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hello, Tom Nelson,\" said he, rather rudely. \"What brings you here?\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3011/83158.html","bookId":280,"creation":"Aug 1, 2019 8:36:41 AM","modification":"Aug 1, 2019 8:36:41 AM"}
