{"id":8528,"no":9,"title":"CHAPTER IX. THE \"RIVER BELLE.\"","content":"\u0026nbsp;As Tom took his place at the breakfast table, he mechanically lifted his eyes and glanced at his neighbors. Directly opposite him sat the gentleman whom he had brought home the evening before. Now he looked sober and respectable. Indeed, he looked as if he might be a person of some prominence. He met Tom\u0027s glance, and recognized him. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you are the boy who came home with me last evening,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" answered Tom, rather embarrassed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid I was not quite myself,\" continued the stout gentleman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not quite, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I ought to be ashamed of myself, and I am. I don\u0027t often allow myself to be caught in that way. You did me a good service.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are quite welcome, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had a good deal of money with me, and,[69] if I had drank any more, I should probably have been robbed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why did you run such a risk, sir?\" Tom could not help asking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I was a fool,\" said the other bluntly. \"I have taste for drink, but when I am at home I keep it under control.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you don\u0027t live in Pittsburg, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. My home is in one of the river towns in Ohio. I came to Pittsburg to collect money due me for produce, and but for you should probably have carried none of it home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am very glad to be of service to you,\" said our hero sincerely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are your plans, my young friend? I suppose you are only a visitor in this city.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am on my way to California. I expect to sail in the River Belle at nine o\u0027clock.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then we shall be fellow passengers, and I shall have a chance to become better acquainted with you. You are young to go to California alone. You are alone—are you not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They went down to the boat together, and on the way Tom told his story. He learned that his acquaintance was Mr. Nicholas Waterbury;[70] that he had been a member of the Ohio Legislature, and, as he inferred, was a prominent citizen of the town in which he lived.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should be very much ashamed to have them hear at home how I had forgotten myself,\" said Mr. Waterbury.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It need not be known,\" said Tom. \"I shall not mention it to any one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" said Mr. Waterbury. \"I would rather you did not, as the news might reach my home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where do you live, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In Marietta. I shall be glad to have you leave the boat there, and stay a day or two with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir, but I am in a hurry to reach California, on my father\u0027s account. I want to send back as soon as possible the money he raised to pay my expenses out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is very commendable; I can enter into your feelings. I should like to show my obligation to you in some way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not worth thinking about, sir,\" said Tom modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Permit me to disagree with you. Why, my young friend, how much money do you think I had with me?\"[71]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Upward of six hundred dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Mr. Waterbury uttered these words, a young man, very dark, with narrow black whiskers, passed them. He darted a quick glance at the speaker, and walked rapidly on. Tom noticed him, but not with attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is a good deal of money, sir,\" he remarked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would have been a good deal to lose,\" said Mr. Waterbury, \"and I have no doubt I should have lost it if it had not been for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t so much money as you, but I came near losing it last night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How was that?\" asked Tom\u0027s new acquaintance, with curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom explained the attempt of his roommate to rob him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would have been a serious loss to you, my young friend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would have broken up all my plans, and I should have had to work my way home, greatly disappointed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will need to be careful about forming acquaintances. There are exceptions, however. I am a new acquaintance; but I don\u0027t think you need fear me.\"[72]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir,\" said Tom, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"While I have received a great service from you, who are a new acquaintance. But here we are at the steamer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The River Belle lay at her pier. Tom and his companion went on board. Both secured tickets, and Tom provided himself with a stateroom, for he expected to remain on board till they reached Cincinnati. Freight of various kinds was being busily stowed away below. It was a busy and animated scene, and Tom looked on with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you ever been on a steamboat before?\" asked Mr. Waterbury.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir. I have never traveled any to speak of before leaving home on this journey,\" replied Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will be a pleasant variety for you, then, though the scenery is tame. However, some of the river towns are pretty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sure I shall like it, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I were going all the way with you—I mean as far as Cincinnati,\" said Mr. Waterbury.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish you were, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have a great mind to do it,\" said the[73] gentleman musingly. \"I should have to go very soon on business, at any rate, and I can attend to it now just as well as later.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be very glad if you can make it convenient, sir. We might occupy the same stateroom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you not afraid that I shall follow the example of your Pittsburg roommate?\" asked Mr. Waterbury.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have less to lose than you,\" answered Tom. \"Besides, I shall have to have a roommate, as there are two berths.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Precisely, and I might be safer than some. I have a great mind to keep on. I shall see some one on the pier in Marietta by whom I can send word to my family. By the way, I have a son about your age, and a daughter two years younger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you, sir?\" asked Tom, with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like you to meet them. Perhaps you may some day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I may,\" said Tom politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am a manufacturer,\" continued Mr. Waterbury, \"and sell my goods chiefly in Pittsburg and Cincinnati. From these places they are forwarded farther east and west.\"[74]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose that\u0027s a pretty good business, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sometimes; but there are intervals of depression. However, I have no right to complain. I began a poor boy, and now I am moderately rich.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Were you as poor as I am?\" inquired Tom, beginning to feel a personal interest in his companion\u0027s career.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite so, I fancy. At the age of sixteen I couldn\u0027t call myself the owner of five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you have become rich?\" said Tom, feeling very much encouraged.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Moderately so. I am probably worth fifty thousand dollars, and am just fifty years of age.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That seems to me very rich,\" said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should have said the same thing at your age. Our views change as we get older. Still, I regard myself as very well off, and, with prudent management, I need not fear reverses.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should think not,\" said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t know how easy it is to lose[75] money, my boy. I am not referring to robbery, but to mismanagement.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your success encourages me, Mr. Waterbury,\" said Tom. \"I am willing to work hard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you will succeed. You look like a boy of good habits. Energy, industry, and good habits can accomplish wonders. But I think we are on the point of starting.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just before the gangplank was drawn in, two persons hastily crossed it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One was the dark young man who had passed them on the way down to the boat; the other was Milton Graham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Waterbury,\" said Tom hurriedly, \"do you see that man?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is the man that tried to rob me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We must be on our guard, then. He may be up to more mischief.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3011/83162.html","bookId":280,"creation":"Aug 1, 2019 8:36:50 AM","modification":"Aug 1, 2019 8:36:50 AM"}
