{"id":62581,"no":13,"title":"Page 13","content":"\u003cp\u003eEvening fell.\u003c/p\u003e\n\u003cp\u003eCaesar finally dismissed his legates and high-ranking centurions. On his own, he sighed and buried his head in his hands, his elbows resting upon a make-shift map unfurled upon the table. He closed his eyes and massaged his temples. Not even Servilia was this exhausting, he joked to himself. The encampment was fortified though and supplies sufficient, for now. Yet a prospective shortage of food and the absence of his cavalry meant that he could not make further inroads into Britain and satisfy his ambitions. He sighed again and screwed up his face in disdain as he thought of how he would have to court and win over some of the local tribal chieftains. It should have been that they needed to court and win him over. Perhaps he should make an example of one of the tribes\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;and the rest might fall into line. Yet such an action could galvanise them against him. Yet they already seemed to have allied themselves against him. Original intelligence had suggested that factional in-fighting would prevent a grand alliance. Was it the case that the Roman agent on these shores was not just recruiting soldiers for Gaul, but conspiring with the tribes here to defeat him?\u003c/p\u003e\n\u003cp\u003eCaesar briefly turned his thoughts to his new centurion and wondered how he was progressing. He had fought well in the shallows upon the beach; Caesar envisioned that he would fare equally well upon being thrown in at the deep end. One of the legates had approached him that day, saying that one of Oppius\u0027 comrades, one Roscius, said that he would be willing to be sent out to help the centurion with his mission. Caesar admired the centurion for the loyalty and friendship he had inspired but he refused the request. At the very least he hoped that Oppius would be able to kill the traitor. Joseph had asked him the other evening that if the centurion returned and said that he had completed his mission and murdered the agent how would he know if he was telling the truth?\u003c/p\u003e\n\u003cp\u003e\"Soldiers are honest souls Joseph - it\u0027s a politician who you need to distrust when he promises you something.\"\u003c/p\u003e\n\u003cp\u003eCaesar next turned his attention to some of the correspondence on his table. Letters from Brutus, Pompey and Balbus all needed responding to. Yet the first letters he replied to were that of Julia, his daughter, and Octavius, his young nephew. He smiled upon reading Julia\u0027s letter when she mentioned overhearing Cicero at a party.\u003c/p\u003e\n\u003cp\u003e\"Do you know any man, even if he has concentrated on the art of oratory to the exclusion of all else, who can speak better than Caesar? Or anyone who makes so many witty remarks? Or whose vocabulary is so varied and yet so exact?\"\u003c/p\u003e\n\u003cp\u003eHe smiled, partly because Cicero was the sole person who Caesar would have said the above in relation to as well. Although he did not always share his politics, Caesar was constant in his admiration for the former consul. He thought of how he would try to introduce Octavius to the great writer and statesman when he was next in Rome.\u003c/p\u003e\n\u003cp\u003eCaesar heard someone approach and he wiped the expression of fatigue off his face, as if he were wiping away a film of sweat. As it was Joseph however who entered Caesar soon wore tiredness\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;and warmth\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;in his features. He could not help but yawn though.\u003c/p\u003e\n\u003cp\u003e\"You should get some sleep,\" the old Jewish servant remarked, in a spirit of both fussiness and concern.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got too much on my mind. I\u0027m finding it difficult to sleep.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps I could make boring you to sleep part of my official duties.\"\u003c/p\u003e\n\u003cp\u003e\"And how would you go about fulfilling such a duty?\"\u003c/p\u003e\n\u003cp\u003e\"Hmm, I could either recite some of Cato\u0027s speeches\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;or tell you about the most interesting dish British cuisine has to offer.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/standard-bearer-sword-of-rome-1/page-13.html","bookId":1521,"creation":"Oct 5, 2019 9:43:45 AM","modification":"Oct 5, 2019 9:43:45 AM"}
