{"id":74639,"no":14,"title":"Page 14","content":"\u003cp\u003e“And…?” Eddie said just before they reached the kitchen.\u003c/p\u003e\n\u003cp\u003eWhen Gabrielle shook her head, Eddie hung his and gave each niece a pat on the back. “It was a good thing you did for your young man, Katarina.”\u003c/p\u003e\n\u003cp\u003eKat was fairly certain that Uncle Eddie was the smartest person she’d ever known, but right then she was equally certain he was wrong. He hadn’t seen the look in Hale’s eyes. He hadn’t heard the fury in his voice. Eddie didn’t know what Kat had spent the past twelve hours fearing—that she had flown all the way to London only to lose something she could never, ever steal back.\u003c/p\u003e\n\u003cp\u003eKat wanted to tell him, beg him to explain to her exactly how she could go back in time and do it all differently. But she didn’t bother. Even Uncle Eddie couldn’t con the clock.\u003c/p\u003e\n\u003cp\u003eShe just sat quietly as her uncle headed upstairs; but when he reached the door, he gave one last backward wave toward the table.\u003c/p\u003e\n\u003cp\u003e“Something came for you, Katarina.”\u003c/p\u003e\n\u003cp\u003eThere was a letter on the table. As soon as Kat touched it, she knew it was important. The paper was heavy cotton, and her name was printed on the front in gold embossment. She turned over the envelope and ran her hand along the raised letters that read GENESIS.\u003c/p\u003e\n\u003cp\u003eKat took a paring knife and slit the envelope open in one smooth gesture, then pulled out a card and looked down at the words You are cordially invited to witness the beginning.\u003c/p\u003e\n\u003cp\u003eThere was the address of Hale Industries and a date and time for the following afternoon. But the thing that made her heart beat faster was the handwritten line at the bottom of the card.\u003c/p\u003e\n\u003cp\u003ePlease come. Use the back door.\u003c/p\u003e\n\u003cp\u003e“What is it?” her cousin asked.\u003c/p\u003e\n\u003cp\u003e“I’m not sure,” Kat said, turning the card over and over in her hands. “Some kind of invitation.”\u003c/p\u003e\n\u003cp\u003eBut to what, she didn’t have a clue.\u003c/p\u003e\n\u003cp\u003eChapter 20\u003c/p\u003e\n\u003cp\u003eAt half past noon the next day, Kat found herself in the narrow alley behind Hale Industries’ world headquarters, staring at a locked door. It seemed utterly wrong to stand at the service entrance with an invitation and not a tool belt, and part of Kat wanted to flee the scene. Run. Disappear into the midtown traffic. But before she could move, a shadow appeared on the wall just over her shoulder, and a vaguely familiar voice said, “Well, hello there.”\u003c/p\u003e\n\u003cp\u003eKat looked at the man coming up the alley behind her. Immediately, she recognized the white hair and bulging belly. But there was something different about the man whom she’d met at the funeral. This time, he wasn’t in mourning. This time, he was…nervous.\u003c/p\u003e\n\u003cp\u003e“Hi, Mr. Foster,” Kat said.\u003c/p\u003e\n\u003cp\u003eSilas nodded, impressed. “That’s a good memory you have there.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” Kat said. “I try.”\u003c/p\u003e\n\u003cp\u003e“Allow me.” Silas swiped his ID badge across an electronic pad beside the door, and Kat gave a soft sigh.\u003c/p\u003e\n\u003cp\u003e“The McClintock Three-sixty,” she whispered when the light flashed from red to green.\u003c/p\u003e\n\u003cp\u003e“What was that?” he asked.\u003c/p\u003e\n\u003cp\u003e“That lock is really nifty,” Kat hurried to add, then smiled and bounced on the balls of her feet. She must have looked far more innocent than she felt, because the old man opened the door wide and gestured for her to go ahead.\u003c/p\u003e\n\u003cp\u003e“Come on in,” he told her. “I’ll show you the way.”\u003c/p\u003e\n\u003cp\u003eKat had never been inside the Hale Industries headquarters before, but she didn’t pause to consider the irony. She was there. Hale had invited her. And the fact that he’d sent her through the back door might not have meant anything at all.\u003c/p\u003e\n\u003cp\u003e“Come along, Miss Bishop. I believe the party is upstairs.”\u003c/p\u003e\n\u003cp\u003eMr. Foster pushed the elevator call button, and a moment later, Kat was inside, achingly aware of the silence that filled the shiny car.\u003c/p\u003e\n\u003cp\u003e“I’m so glad to see you here,” Silas told her. “It’s a big day for us.”\u003c/p\u003e\n\u003cp\u003e“What is today, if you don’t mind my asking?”\u003c/p\u003e\n\u003cp\u003e“Well, before Hazel died, she and I were working on a new project. Today we unveil it for the board of directors. The real party is next week—a gala, I believe they’re calling it. You should come to that, too. It’s going to be quite the big to-do.”\u003c/p\u003e\n\u003cp\u003e“Sounds exciting,” Kat said, and laughed a little at the old-fashioned phrase.\u003c/p\u003e\n\u003cp\u003e“It is,” Silas said. “I’m only sad Hazel won’t be here to see it.”\u003c/p\u003e\n\u003cp\u003eThe elevator made a ding and came to a stop.\u003c/p\u003e\n\u003cp\u003e“Allow me.” Silas held open the doors and gestured for Kat to step out into a corridor lined with paintings. There was something eerily familiar about them all, and Kat was just starting to wonder what it was when Silas said, “Miss Bishop, allow me to introduce the Hale men.”\u003c/p\u003e\n\u003cp\u003eHe gestured to an old oil painting of a man in uniform. “That’s Mr. Hale the First. He was something of a character, I’m told. A big brute of a man. Powerful.” Silas puffed up his chest as if to prove the point. “He served in the military with one of the British princes. Saved his life, even, if the stories are true. And was rewarded handsomely for it.”\u003c/p\u003e\n\u003cp\u003eThe next painting showed a man on a factory line, surrounded by crates and machinery.\u003c/p\u003e\n\u003cp\u003e“Mr. Hale the Second,” Silas said. “He was the first to come to this country, I believe. A bright man, by all accounts. Greedy. But bright.”\u003c/p\u003e\n\u003cp\u003eThey took a few more steps, and Kat came even with two matching portraits.\u003c/p\u003e\n\u003cp\u003e“W. W. the Third is on your left,” Silas said. “And that’s his little brother Reginald on the right.”\u003c/p\u003e\n\u003cp\u003e“W. W. the Third was Hazel’s husband?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“He was. He commissioned this building in 1969.” Silas smiled a little with the memory, then lowered his voice. “But make no mistake about it, my dear, this is the house that Hazel built.”\u003c/p\u003e\n\u003cp\u003eSilas eased down the long hall, to the last portrait hanging in the row. It was the same image that had run in the paper, and Kat looked at the original, wishing she’d known the woman behind it.\u003c/p\u003e\n\u003cp\u003e“As much as the Hales understand money, Hazel understood people,” Silas said. “None of these old boys would say so, but this place changed when she came on board.” He leaned close to Kat and whispered, “For the better.”\u003c/p\u003e\n\u003cp\u003eKat couldn’t pry her gaze away from the portrait. She wished more than anything that she could ask that woman for advice.\u003c/p\u003e\n\u003cp\u003e“Are you okay, my dear?” Silas Foster asked. Something in the way he looked at her made Kat forget herself for a moment. He seemed so wise and sage and trustworthy, and Kat wanted to tell him everything—about Hazel and Marianne, the will and the trustee’s trip to London.\u003c/p\u003e\n\u003cp\u003eAnd Hale.\u003c/p\u003e\n\u003cp\u003eKat wanted to tell Silas that her boyfriend wasn’t her boyfriend anymore, and beg him to go down to his lab and create a device that would make everything okay.\u003c/p\u003e\n\u003cp\u003e“Kat?” he asked again. “Are you all right?”\u003c/p\u003e\n\u003cp\u003e“Yes. I’m just a little…” Kat began, but she didn’t know how to continue. So instead she asked the question that had been on her mind for hours. “Mr. Foster, what is Genesis?”\u003c/p\u003e\n\u003cp\u003eSilas gave a knowing smile. “I guess we’re getting ready to find out.”\u003c/p\u003e\n\u003cp\u003eThen she watched the man push open a set of double doors, unsure what she was going to find on the other side, totally not expecting what she saw.\u003c/p\u003e\n\u003cp\u003eHale. What Kat saw was Hale.\u003c/p\u003e\n\u003cp\u003eAnd he was angry.\u003c/p\u003e\n\u003cp\u003eKat knew it the second his gaze met hers. His eyes narrowed and his face flushed. He seemed so much older than sixteen, as though the paintings in the hall had come to life and there he stood—a future tycoon being groomed for greatness. But instead of his father’s blank, professional stare, Hale’s face was full of rage; and as he headed her way, Kat had every reason to be shaking.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?”\u003c/p\u003e\n\u003cp\u003eHe was the person she knew best, trusted most, and in spite of all that, she recoiled from his touch. “You invited me,” she said.\u003c/p\u003e\n\u003cp\u003e“No. I didn’t.”\u003c/p\u003e\n\u003cp\u003e“But…” Kat began, then let the words trail off.\u003c/p\u003e\n\u003cp\u003e“Look, Kat. It’s not personal. It’s just that this isn’t really a public thing.”\u003c/p\u003e\n\u003cp\u003e“I didn’t realize I was the public.”\u003c/p\u003e\n\u003cp\u003e“You need to leave, Kat. You just…” And then the most naturally gifted inside man that Kat had ever seen was stumbling for words. “I just… Who invited you?”\u003c/p\u003e\n\u003cp\u003e“I did.” Kat felt Silas’s hand at her back. “Genesis isn’t for my generation—it’s for yours. Thought it wouldn’t hurt to have an extra set of young eyes on it.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Hale forced a smile at Silas and then shifted his gaze to Kat. “I see.”\u003c/p\u003e\n\u003cp\u003eKat wanted to feel her blood boiling, to find the strength to yell, but everything was going cold instead.\u003c/p\u003e\n\u003cp\u003e“Now, you two have fun.” Silas gave them a wink and crossed the room.\u003c/p\u003e\n\u003cp\u003eMarcus was there, floating through the crowd with a tray of champagne. She recognized several people from the funeral—members of the board, Kat assumed. Hale’s mother stood alone in the corner. And something about it all made Kat feel small, inconsequential. Even with Hale beside her, she had never felt more alone in her life.\u003c/p\u003e\n\u003cp\u003e“Hale, can I talk to you for a second?”\u003c/p\u003e\n\u003cp\u003e“Son?” Senior was walking toward them, looking right through Kat as if she didn’t exist at all.\u003c/p\u003e\n\u003cp\u003e“I’ve got to go, Kat,” Hale said, but all Kat heard was her cousin’s voice whispering the words secret girlfriend.…\u003c/p\u003e\n\u003cp\u003eAnd then a different set of words flashed through her mind: I don’t have a girlfriend anymore.…\u003c/p\u003e\n\u003cp\u003e“Hale”—she pulled him close—“we need to talk.”\u003c/p\u003e\n\u003cp\u003eBut Hale just brushed her aside. “I’m through talking.”\u003c/p\u003e\n\u003cp\u003eKat didn’t want to make a scene—it went against her upbringing, her DNA. So she let him leave. And even though he never looked back, Kat could feel somebody watching, staring.\u003c/p\u003e\n\u003cp\u003eShe turned, taking in the room, and there he was, on the other side of the lab. At least a dozen people stood between them, and yet Kat knew that Garrett was looking right at her. Not blinking. Not smiling.\u003c/p\u003e\n\u003cp\u003eA good job was nothing more than a play, Kat believed. And right then she couldn’t forget that she was backstage at someone else’s con. Kat wanted to shout and point at Garrett, tell everyone what he’d done. She felt the words bubbling up inside her, but before they could break free, Silas moved to the center of the room.\u003c/p\u003e\n\u003cp\u003e“If I can have your attention, please,” he called to the men and women assembled. He looked and sounded almost like a preacher when he said, “Thank you for joining us today. As everyone in this room knows, we’re here because Hazel wanted a new beginning for Hale Industries. A fresh start. A Genesis, if you will.”\u003c/p\u003e\n\u003cp\u003eSilas walked to a wall safe in the corner of the room. It was an excellent model, and Kat was impressed. She had no idea what kind of scientist the man was, but at least he had good taste in safes.\u003c/p\u003e\n\u003cp\u003e“Hazel came to this very room several years ago, and together we talked about the future. Of Hale Industries. Of the Hale family. And—not to put too fine a point on it—the world. Hazel knew she wasn’t going to live forever—none of us will. But she wanted to build something that would last for generations—something that would alter everything we touch. Something every man and woman could carry in the palm of their hand and be better for it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-scoundrels-heist-society-3/page-14.html","bookId":2406,"creation":"Oct 5, 2019 10:32:06 AM","modification":"Oct 5, 2019 10:32:06 AM"}
