{"id":74652,"no":27,"title":"Page 27","content":"\u003cp\u003e“Reginald!” Bobby yelled, chasing after Uncle Eddie. “Reginald, we talked about how the cold is bad for your leg.” Bobby reached for Eddie’s arm, but Eddie jerked away.\u003c/p\u003e\n\u003cp\u003e“Can’t you see my family is here, doc?” Eddie glanced at Garrett, who stood wordless amid the throng. “All except that one. I don’t have a clue about that one.”\u003c/p\u003e\n\u003cp\u003e“I see that, Reg,” Bobby said. “And I’m very much looking forward to meeting everyone…inside.”\u003c/p\u003e\n\u003cp\u003e“I don’t know why,” Eddie said. “Bunch of worthless freeloaders. Never showed up before…” He spoke under his breath, the ramblings of a crazy man.\u003c/p\u003e\n\u003cp\u003e“Come on, Reg.” Bobby gestured for the door. “Let’s go in.”\u003c/p\u003e\n\u003cp\u003eSlowly, the group made their way onto the rickety porch and through the big front doors. The stairs creaked. The floor moaned. And Kat’s father just kept smiling, clipboard in hand.\u003c/p\u003e\n\u003cp\u003e“Now, Reginald, won’t you introduce me to your friends?” Bobby asked.\u003c/p\u003e\n\u003cp\u003e“They’re not my friends. They’re my family.”\u003c/p\u003e\n\u003cp\u003eBobby gave a hearty laugh. “Oh, Reg, you are the life of the party.”\u003c/p\u003e\n\u003cp\u003eA nurse walked by, and Eddie winked at her. The expression on his face was exactly like the one Reginald had worn in the family movies, and Kat must not have been the only one to see the similarities.\u003c/p\u003e\n\u003cp\u003e“Hello, Reginald,” Hale’s aunt said very, very slowly. “I’m Elizabeth. I am Hazel’s daughter. That makes me your niece.”\u003c/p\u003e\n\u003cp\u003e“I’m crazy, Liz,” Reginald said. “Doesn’t mean I’m stupid.”\u003c/p\u003e\n\u003cp\u003e“No. No.” Bobby gave a hearty laugh. “As you’ll see, your uncle is in very good health for a man with his history.”\u003c/p\u003e\n\u003cp\u003e“And who are you, exactly?” Hale’s father puffed out his chest and looked skeptically at Bobby, who never wavered.\u003c/p\u003e\n\u003cp\u003eHe just held out his hand and said, “Sorry about that. I’m Dr. Nathaniel Jones. I’m your uncle’s primary physician.”\u003c/p\u003e\n\u003cp\u003eIn the dim, quiet room upstairs, Kat whispered to Simon, “And the real Dr. Jones…”\u003c/p\u003e\n\u003cp\u003e“Has a Ph.D. from Harvard and an M.D. from Johns Hopkins, but recently decided to retire on a blissfully quiet beach in Belize.”\u003c/p\u003e\n\u003cp\u003e“Perfect,” Kat said, and kept her eyes glued to the screens.\u003c/p\u003e\n\u003cp\u003eSenior was walking through the foyer, staring at hastily patched walls and out-of-date fixtures. “What is this place?” he asked.\u003c/p\u003e\n\u003cp\u003e“This is your uncle’s home.” Bobby looked at W. W. Hale the Fourth as if he didn’t know how a man could be so insensitive. “In fact, we’re home for dozens of people like Reginald. People who have special needs. People for whom life in mainstream society might be stressful or even dangerous. For our residents, this isn’t just a house—it’s a haven.”\u003c/p\u003e\n\u003cp\u003e“So it’s an institution?” Senior said.\u003c/p\u003e\n\u003cp\u003e“Well…” Bobby hesitated, but then finally admitted, “that term is appropriate, but we do not prefer it.”\u003c/p\u003e\n\u003cp\u003e“I would have preferred not to think my uncle was dead for five decades, but no one asked me.”\u003c/p\u003e\n\u003cp\u003e“Would you like a tour?” Bobby asked, sweeping the clipboard out wide.\u003c/p\u003e\n\u003cp\u003e“I want some questions answered.” Hale’s uncle stepped forward. Kat watched the way his eyes cut around the room, taking everything in. “Such as, why hasn’t our family physician ever heard of you or your facility?”\u003c/p\u003e\n\u003cp\u003e“Oh, well”—Bobby gave a throaty laugh—“we cater to patients who, shall we say, place a premium on discretion.”\u003c/p\u003e\n\u003cp\u003e“What does that—” Senior started, but Hale cut him off.\u003c/p\u003e\n\u003cp\u003e“He means rich people.” Hale looked at Bobby. “Isn’t that what you’re saying? This is where the über-rich send their über-embarrassing, über-crazy branches of the family tree?”\u003c/p\u003e\n\u003cp\u003eBobby lowered his gaze. “We’ve been entrusted with the care of some very special patients through the years. And we guard their privacy as ardently as we’ve guarded your uncle’s.”\u003c/p\u003e\n\u003cp\u003eBobby gave a glance toward a series of photographs lining the walls. Bobby with a retired, reclusive senator. A member of the royal family playing dominoes with Uncle Eddie in the game room.\u003c/p\u003e\n\u003cp\u003e“Uncle Charlie forged those?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” Simon nodded, but Kat didn’t feel any better.\u003c/p\u003e\n\u003cp\u003e“They’re not buying it.” She watched Garrett, who was still silent, almost bored, going through the paces of someone else’s con. “He’s going to squeal on us,” Kat said.\u003c/p\u003e\n\u003cp\u003e“If he were going to squeal, he would have done it by now,” Simon said. “He doesn’t care about this. He just wants to sell his prototype and disappear. Now be quiet.”\u003c/p\u003e\n\u003cp\u003eThe tiny room that Simon had transformed into the communications base felt crowded, and Kat finally knew what was harder than running the long con: sitting on the sidelines and watching your long con go on without you.\u003c/p\u003e\n\u003cp\u003e“I’m hot. It’s hot in here.” She was all nerves and sweat, and spoke rapid-fire, fanning herself with an old magazine. “Is the computer room always so hot?”\u003c/p\u003e\n\u003cp\u003e“Sometimes the computer room is in an outhouse. In Mexico. In July. So, stop squirming.”\u003c/p\u003e\n\u003cp\u003eKat did as she was told. She didn’t say a word when Simon picked up a microphone and said, “Uncle Felix, it’s time.”\u003c/p\u003e\n\u003cp\u003eSomewhere in the depths of the building, there was a cry, and then a very old, very naked man ran down the hall.\u003c/p\u003e\n\u003cp\u003e“Was it just me, or did we agree on underwear?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“You know Felix,” Simon said with a shrug. “He likes to improvise.”\u003c/p\u003e\n\u003cp\u003eDownstairs, Felix was running circles around the Hale family, and Bobby was yelling, “Orderly!”\u003c/p\u003e\n\u003cp\u003e“On it!” Angus said, chasing after Felix with a robe.\u003c/p\u003e\n\u003cp\u003e“Sorry about that, folks,” Bobby told his guests. “Never a dull moment around here, I can assure you. Now, where were we?”\u003c/p\u003e\n\u003cp\u003e“My brother and sister were trying to explain to you that this is quite a shock,” Senior told Bobby.\u003c/p\u003e\n\u003cp\u003e“Oh, Felix? Don’t worry about him. He’s harmless. He just thinks the Nazis are tracking him through his clothes, or so he says. Really, he just likes being naked.”\u003c/p\u003e\n\u003cp\u003e“Not…that.” Hale’s father gestured at the wrinkly blur that flashed across the end of the hall. “My uncle was dead, doctor. He was dead and gone, and now we are supposed to believe that he…isn’t.”\u003c/p\u003e\n\u003cp\u003e“I see how that could be quite a shock.” Bobby nodded gravely. “Reginald has been with us for a long time, and—”\u003c/p\u003e\n\u003cp\u003e“How long?” Elizabeth wanted to know.\u003c/p\u003e\n\u003cp\u003e“Well, I’m afraid Reginald’s medical records are private.”\u003c/p\u003e\n\u003cp\u003e“I’m the man’s next of kin—if he is who he says he is,” Senior spat. “I demand to know.”\u003c/p\u003e\n\u003cp\u003e“Reginald,” Bobby asked, “what do you say to that?”\u003c/p\u003e\n\u003cp\u003e“Tell them what they want to know.” Eddie eased closer to Hale’s mother. “Your eyes look like K2 at sunrise.”\u003c/p\u003e\n\u003cp\u003e“Oh, thank you,” she said.\u003c/p\u003e\n\u003cp\u003e“Doctor,” Senior said, trying to regain control.\u003c/p\u003e\n\u003cp\u003e“He’s been here longer than I have. As you know, your uncle was quite the explorer. When he was thirty-five, he was in a terrible plane crash. It shattered his leg and left him near death for many months.”\u003c/p\u003e\n\u003cp\u003e“That’s why he has that limp?” Senior asked.\u003c/p\u003e\n\u003cp\u003eBobby nodded. “It is. The crash was in a very rural area. Local doctors did their best, but the leg never properly healed, and…” Bobby trailed off, looked at the floor. His voice softened. “And, in many ways, your uncle never truly recovered.”\u003c/p\u003e\n\u003cp\u003e“The ladies love a limp,” Eddie said with a wink.\u003c/p\u003e\n\u003cp\u003e“Yes they do, Reg. Yes they do.” Bobby patted Eddie on the back. “We’re very fond of your uncle, Mr. Hale. He’s been here for a very long time, but don’t make the mistake of thinking that he has been among strangers. Sometimes, people make their own family.”\u003c/p\u003e\n\u003cp\u003eKat didn’t want to read too much into things, but she couldn’t help thinking that her father was speaking about her Hale. Her family.\u003c/p\u003e\n\u003cp\u003e“Do you know, doctor…” Hale’s father paused and then began again. “Do you know who this man is? Who he claims he is? And what those claims would mean?”\u003c/p\u003e\n\u003cp\u003e“Oh.” Bobby laughed. “Reg has claimed to be a lot of people through the years. Haven’t you, Reg? Let’s see…sometimes he says he’s descended from a duke. Then he’ll tell anyone who will listen that he was the first American to scale K2. Why, just last week he told me he discovered a tribe in the Amazon—”\u003c/p\u003e\n\u003cp\u003e“That’s true,” Hale said, whispering. “All those things are true.”\u003c/p\u003e\n\u003cp\u003e“You don’t say?” Bobby asked, then looked at Eddie like he was seeing the man for the very first time.\u003c/p\u003e\n\u003cp\u003e“A name!” Senior spat. “Did you know his name?”\u003c/p\u003e\n\u003cp\u003e“Of course. He said his name was Reginald Hale.”\u003c/p\u003e\n\u003cp\u003e“And you didn’t think it was odd that Reginald Hale is supposed to be dead?” Hale’s aunt asked.\u003c/p\u003e\n\u003cp\u003eBobby tilted his head. “To tell you the truth, I was under the impression that the family knew Reginald was here.”\u003c/p\u003e\n\u003cp\u003e“Why would you say that?” Senior asked.\u003c/p\u003e\n\u003cp\u003e“Why…” Bobby’s eyes went wide in disbelief. In the dark, quiet room, Kat felt herself hold her breath. “Because of the checks, of course.”\u003c/p\u003e\n\u003cp\u003eThey’d reached a set of double doors, and Bobby pointed to the gold plaque beside them, stating that they were about to enter the Hazel Hale Recreation Room.\u003c/p\u003e\n\u003cp\u003eThe Hale family stood speechless.\u003c/p\u003e\n\u003cp\u003e“I was very sorry to hear of her passing,” Bobby told the family.\u003c/p\u003e\n\u003cp\u003e“Why…” Senior stumbled over the thought. “Why are you contacting us now? My uncle has been gone for half a century. Why didn’t he stay gone?”\u003c/p\u003e\n\u003cp\u003eBobby removed his glasses, and when he spoke, he couldn’t hide the guilt in his voice. “I guess that’s because the checks…stopped.”\u003c/p\u003e\n\u003cp\u003e“If he is who he says he is, he’ll have to prove it,” Senior told them.\u003c/p\u003e\n\u003cp\u003eBobby looked at Eddie. “I’m sure Reginald wouldn’t mind. Would you, Reg?”\u003c/p\u003e\n\u003cp\u003e“I climbed K2,” Eddie said in response.\u003c/p\u003e\n\u003cp\u003e“So he has no family?” Hale’s uncle asked.\u003c/p\u003e\n\u003cp\u003eBobby looked confused. “I thought you were his family.”\u003c/p\u003e\n\u003cp\u003e“He means heirs,” Hale said. “What about it, Reg? When you die, who’s going to get your half?”\u003c/p\u003e\n\u003cp\u003e“Scooter!” Elizabeth said, feigning offense. “But I wonder, Uncle Reg, do you have any children?”\u003c/p\u003e\n\u003cp\u003eEddie took her in. “Maybe I’ll adopt you.”\u003c/p\u003e\n\u003cp\u003e“If you’d like us to perform a DNA test, I can recommend a very good facility not too far—” Bobby said, but Hale’s father’s laugh cut him off.\u003c/p\u003e\n\u003cp\u003e“A billion-dollar corporation is on the line,” Senior said. “We’ll find our own lab, thank you very much.” Then he spoke to the lawyer. “You’ll take care of that, won’t you, Garrett?” \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-scoundrels-heist-society-3/page-27.html","bookId":2406,"creation":"Oct 5, 2019 10:32:06 AM","modification":"Oct 5, 2019 10:32:06 AM"}
