{"id":74656,"no":31,"title":"Page 31","content":"\u003cp\u003e“Okay. The maid gets ten million. And that’s it?” He looked at Kat as if she were some rare species of human being. “You’re not going to try to save your boyfriend’s family business?”\u003c/p\u003e\n\u003cp\u003e“No, Mr. Garrett.” Kat slipped on her jacket and crossed the room. “I’m trying to save my boyfriend.”\u003c/p\u003e\n\u003cp\u003eWalking to the door, Kat knew she should have felt at ease. It was over. Almost. But something tugged at her, a lingering doubt she couldn’t silence, a steady whisper in her ear.\u003c/p\u003e\n\u003cp\u003e“Just one more thing.” Kat suddenly stopped. “Hale never sees you—or your daughter—again.”\u003c/p\u003e\n\u003cp\u003eA condescending smile spread across Garrett’s face.\u003c/p\u003e\n\u003cp\u003e“Anything else?”\u003c/p\u003e\n\u003cp\u003e“Do we have a deal, Mr. Garrett?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Deal.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow at noon. Grand Central Station. I’ll expect you there in person.”\u003c/p\u003e\n\u003cp\u003e“And have you show up with the authorities? I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“Fine,” Kat conceded. “We’ll do it in…Niagara Falls. On the Canadian side. Far out of New York jurisdiction. How does that sound?”\u003c/p\u003e\n\u003cp\u003e“I didn’t peg you for a tourist.”\u003c/p\u003e\n\u003cp\u003e“Let’s just say I’m a girl who appreciates a crowd. There’s a scenic overlook a mile past the border. Bring ten million in untraceable bonds and don’t be late. If you are, I will personally make sure every member of my family knows there’s a price on your head. You’d be surprised how many of them are good at stealing people.”\u003c/p\u003e\n\u003cp\u003eThe man smiled and held out his hand. “It’s a pleasure doing business with you.”\u003c/p\u003e\n\u003cp\u003e“Forgive me if I can’t say the same.”\u003c/p\u003e\n\u003cp\u003eChapter 42\u003c/p\u003e\n\u003cp\u003eIt didn’t matter how close Kat sat to the fire in Uncle Eddie’s drawing room; she still couldn’t get warm. She kept seeing Garrett’s cold smile, his black eyes. And she kept wondering if Hale would ever forgive her, knowing he was the one person whom she could never, ever con into forgetting her mistakes.\u003c/p\u003e\n\u003cp\u003e“Out of the frying pan…” she said to herself, unable to shake the feeling that it was just a matter of time until she got burned.\u003c/p\u003e\n\u003cp\u003e“You didn’t eat.” Uncle Eddie’s voice was gruff and sleepy as he came into the room. “Come, Katarina. I’ll make you something.”\u003c/p\u003e\n\u003cp\u003e“I’m not hungry,” she told him, and the old man shrugged.\u003c/p\u003e\n\u003cp\u003e“That’s a pity.” He dropped into a chair not far away. “My hands.” He looked down, held them against the light of the fire. “I don’t know what to do with them. It would have been nice to have a task.”\u003c/p\u003e\n\u003cp\u003e“Sorry. I wish I could be more help.”\u003c/p\u003e\n\u003cp\u003eHe gave a shrug as if to say he’d grown used to disappointment, then propped a foot up on the coffee table, which was covered with photos and albums, the prep materials that nobody really needed anymore.\u003c/p\u003e\n\u003cp\u003e“I wish I’d known her.” Kat picked up the album that showed an image of Hale’s grandmother on her wedding day, standing between Reginald and her new husband.\u003c/p\u003e\n\u003cp\u003e“Have the boys found him?” Eddie asked, and Kat shook her head. The old man drew a deep breath then leaned back in his chair. “Your young man will be fine, Katarina.”\u003c/p\u003e\n\u003cp\u003e“I know,” Kat said.\u003c/p\u003e\n\u003cp\u003e“All young men must find their way. Yours is just a little off course at the moment.”\u003c/p\u003e\n\u003cp\u003e“He misses Hazel.”\u003c/p\u003e\n\u003cp\u003eEddie nodded slowly. “I’m sure he does.”\u003c/p\u003e\n\u003cp\u003eAnd then Eddie struggled to his feet. Kat hated those moments—the seconds, really, where his hands would shake or his knees subtly refused to bear his weight. There was nothing as painful to Katarina Bishop as the gentle reminders that she was not the only member of her family who was growing older, that someday she too would be left with nothing but a book full of pictures and memories.\u003c/p\u003e\n\u003cp\u003e“If I lost you…” Kat’s voice broke. She couldn’t meet his eyes, so she stared down at the flames.\u003c/p\u003e\n\u003cp\u003e“You’re not going to lose me, Katarina.”\u003c/p\u003e\n\u003cp\u003e“Promise?”\u003c/p\u003e\n\u003cp\u003eEddie gave her shoulder a squeeze. “Would I lie?”\u003c/p\u003e\n\u003cp\u003eShe wanted to believe him, to know that it was true. But there were some things even the great Uncle Eddie couldn’t stop—and fate, as it turned out, was one of them.\u003c/p\u003e\n\u003cp\u003e“Go to sleep, Katarina. This thing we do tomorrow…it is not an easy thing.”\u003c/p\u003e\n\u003cp\u003e“Is it the right thing?” she asked.\u003c/p\u003e\n\u003cp\u003eHe nodded. “It is the best thing. And that is all any grifter can hope for.”\u003c/p\u003e\n\u003cp\u003eShe heard him shuffle down the hall. A moment later, a door opened and closed, and Kat was left alone with her thoughts and the fire and the spinning earth that was slowly making its way toward tomorrow.\u003c/p\u003e\n\u003cp\u003eChapter 43\u003c/p\u003e\n\u003cp\u003eAnything that can go wrong…will. It was the law of the grift, the rule of the con. If the mark is told to come alone, he won’t. If you’re supposed to have three exit routes, you’ll be lucky to get one. And never, ever believe a weatherman when he says it isn’t going to rain.\u003c/p\u003e\n\u003cp\u003eSo Kat was more than a little surprised to see the sun so bright and clear overhead as she stepped out onto the wide scenic area overlooking the falls. Mist clung to the air, and a rainbow formed over the waters below, and it was beautiful, there at the top of the world. She might have actually enjoyed it if her whole body hadn’t been trembling.\u003c/p\u003e\n\u003cp\u003e“Deep breaths, Katarina,” Uncle Eddie said. “It steadies the nerves.”\u003c/p\u003e\n\u003cp\u003eAs was her habit, she took her uncle’s advice.\u003c/p\u003e\n\u003cp\u003eAt least two dozen tourists were already there, posing for pictures with the falls at their back, plugging quarters into the big old-fashioned machines that could let a person see right down onto the rocky shores. Kat counted ten cars and one school bus, but none of them belonged to the man who had completely ruined her May.\u003c/p\u003e\n\u003cp\u003e“Maybe he’s not coming,” she said, jamming her gloved hands deeper into her pockets.\u003c/p\u003e\n\u003cp\u003e“He’ll be here,” Eddie said. He sounded so certain, so sure, so at home there at the end of a job.\u003c/p\u003e\n\u003cp\u003e“What if this is the wrong call?”\u003c/p\u003e\n\u003cp\u003e“It is the only call, Katarina.” He gave her a long look that she’d never seen before. He sounded different, not like he was talking to his niece, but like he was talking to a peer. “This is how it ends.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” Kat reached out and took his hands. “Thank for doing this. Thank you for always being there for me.”\u003c/p\u003e\n\u003cp\u003e“That, Katarina, is my job.” He looked out over the horizon. “And my pleasure.”\u003c/p\u003e\n\u003cp\u003eShe stood on her tiptoes and kissed his cheek.\u003c/p\u003e\n\u003cp\u003e“Kat?” Simon’s voice was in her head.\u003c/p\u003e\n\u003cp\u003e“Blasted contraptions.” Eddie flinched and poked a finger in his ear, but Kat stopped him before he could pull the earbud out.\u003c/p\u003e\n\u003cp\u003e“What is it, Simon?” Kat said.\u003c/p\u003e\n\u003cp\u003e“Our guy is heading your way.”\u003c/p\u003e\n\u003cp\u003eShe looked at Uncle Eddie. “It’s showtime.”\u003c/p\u003e\n\u003cp\u003eThe two of them stepped away from the road and watched a black SUV pull into the overlook, its big tires crunching in the gravel. Kat stood waiting for her first sight of Garrett, but instead, the driver’s-side door opened, and the goon from the night before stepped out.\u003c/p\u003e\n\u003cp\u003e“Hands up,” the hired thug said, and Kat had to laugh a little. The thug, however, didn’t see what was funny.\u003c/p\u003e\n\u003cp\u003e“Old man. Teenage girl.” Kat pointed between her uncle and herself, but the goon didn’t seem to know that, for all their skills, neither Eddie nor Kat were really known for their physical prowess, so he patted them down just the same.\u003c/p\u003e\n\u003cp\u003e“They’re clean,” he yelled, and only then did the back door open.\u003c/p\u003e\n\u003cp\u003e“Yay,” Kat said when Garrett emerged. “You’re here.”\u003c/p\u003e\n\u003cp\u003e“You’ve got a smart mouth,” he told her.\u003c/p\u003e\n\u003cp\u003eEddie shrugged. “It runs in the family.”\u003c/p\u003e\n\u003cp\u003e“Oh yes,” Garrett said, stepping slowly around them. “Uncle Reginald. Or is it Edward? It’s so good to see you again.”\u003c/p\u003e\n\u003cp\u003e“Can we get this over with?” Kat asked.\u003c/p\u003e\n\u003cp\u003eGarrett held his hands out wide. “You’re the boss.”\u003c/p\u003e\n\u003cp\u003e“Did you bring it?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“You’ll get your money.”\u003c/p\u003e\n\u003cp\u003e“It’s not for me,” Kat said again. “It’s for—”\u003c/p\u003e\n\u003cp\u003e“The maid,” Garrett cut her off. “I know. I know. You’re…noble.”\u003c/p\u003e\n\u003cp\u003e“Yeah. You should try it sometime,” Kat said.\u003c/p\u003e\n\u003cp\u003eGarrett looked at the goon and commanded, “Give me the case.”\u003c/p\u003e\n\u003cp\u003eThe man walked to the SUV and pulled out a silver briefcase. He handed it to Garrett, who held it like it was precious, gripping it too tightly for Kat’s liking.\u003c/p\u003e\n\u003cp\u003e“Are you going to hand that over nicely or do we need to have a talk about honor among thieves?” she asked, but before the man could answer, a car pulled into the overlook.\u003c/p\u003e\n\u003cp\u003eIt was different from the minivans and tour buses. Black and sleek, and driven by a chauffer named Marcus.\u003c/p\u003e\n\u003cp\u003e“Oh, no,” Kat said, but Hale was already out of the car and moving toward her.\u003c/p\u003e\n\u003cp\u003e“Kat?” His voice was too soft somehow. It scared her. “Kat, what is going on? What are you doing here…with him?”\u003c/p\u003e\n\u003cp\u003e“It’s okay, Hale.” Kat moved gingerly toward him. “Why don’t you go wait in the car and I’ll explain in a little—”\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” He looked between Kat and Eddie and then finally to the man with the silver case.\u003c/p\u003e\n\u003cp\u003e“Hale, wait. It’s not what it—”\u003c/p\u003e\n\u003cp\u003e“What? Looks like? Sounds like? What’s in the case, Kat?”\u003c/p\u003e\n\u003cp\u003e“He’s going to pay Marianne. We’re going to be able to take care of her.”\u003c/p\u003e\n\u003cp\u003e“So you’re here to make a deal with the man who killed my grandmother? I’m so glad I didn’t jump to any conclusions.”\u003c/p\u003e\n\u003cp\u003e“Hale…” Kat lunged to block his way. “Hale, calm down.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to calm down!” he shouted, and it felt to Kat like the whole mountain trembled. She half feared an avalanche. Tourists stared. School groups snapped pictures. But she couldn’t do a thing to stop him.\u003c/p\u003e\n\u003cp\u003e“You killed Hazel,” Hale said. “You!”\u003c/p\u003e\n\u003cp\u003eHale lunged toward Garrett. He might have reached him, too—might have killed him—had the goon not been there. He reached for Hale and held him back, squeezed his arms against his side. Garrett looked at the boy.\u003c/p\u003e\n\u003cp\u003e“You never learned your place, Scooter.” He pulled back a fist.\u003c/p\u003e\n\u003cp\u003e“No!” Kat shouted, but Eddie was rushing forward, far faster than Kat had ever imagined he could move. The goon let Hale go and raced for his boss, but he was too late. In a flash, Eddie was on the lawyer, and the lawyer was spinning, striking the old man across the head with the metal briefcase. Blood rushed from Eddie’s mouth and he stumbled, disoriented, too close to the edge.\u003c/p\u003e\n\u003cp\u003e“No!” Kat yelled again, but she didn’t hear the word. She heard nothing at all. Not the crunch of the rocks. Not the breaking of the barrier as it crumbled at her uncle’s back. And Kat didn’t hear the screaming that came with the fall—fading with the sound of the water and the cries of the people who stared over the edge. \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-scoundrels-heist-society-3/page-31.html","bookId":2406,"creation":"Oct 5, 2019 10:32:06 AM","modification":"Oct 5, 2019 10:32:06 AM"}
