{"id":74632,"no":7,"title":"Page 7","content":"\u003cp\u003e“Like I wasn’t a black sheep enough before, now I’m the kid who stole their inheritance. They can’t even look at me. My aunts and my uncle… My own parents hate me.”\u003c/p\u003e\n\u003cp\u003e“I’m sure they don’t hate you.”\u003c/p\u003e\n\u003cp\u003eHe shook his head as if she were the most naive girl in the world. “Of course they do.”\u003c/p\u003e\n\u003cp\u003eIt’s not about you, Kat started to say. She wanted to tell him that there might be something wrong—that if she was right, then he was just a small piece in a much, much larger puzzle. She was opening her mouth to speak—the words were almost out—when a broad smile stretched across Hale’s face.\u003c/p\u003e\n\u003cp\u003e“But do you want to know the crazy part, Kat?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I don’t care.” He laughed a little. “There was only one person in my family I ever trusted. Turns out, I’m the person she trusted, too.”\u003c/p\u003e\n\u003cp\u003eAnd then Kat’s words disappeared. They evaporated into the cold air that blew through the broken window, and she couldn’t bring herself to tell him that Hazel’s grand, final gesture might be nothing more than a lie.\u003c/p\u003e\n\u003cp\u003e“My grandmother loved me, Kat.” He smiled wider. “She chose me.”\u003c/p\u003e\n\u003cp\u003eThere Kat was, in the center of her world, and she tried to imagine what it would be like to never be respected, accepted. Loved. Kat had always belonged in Uncle Eddie’s kitchen, and she tried to wrap her mind around what it would be like to be the boy who had never been given a place at his family’s table.\u003c/p\u003e\n\u003cp\u003e“I’m sorry.” Hale took her hand. “You wanted to tell me something?”\u003c/p\u003e\n\u003cp\u003eShe did want to tell him something—so many things. But the words didn’t come. So she rose and walked around the table, brought her hand to his face, and kissed him.\u003c/p\u003e\n\u003cp\u003e“Why shouldn’t she choose you?” Kat forced a smile. “I did.”\u003c/p\u003e\n\u003cp\u003eAfter he’d closed the door and disappeared down the dark street, Kat was left alone in the sleeping house, wondering if she’d made the right decision. It wasn’t until she turned and started for the stairs that she realized that, no, she wasn’t alone after all.\u003c/p\u003e\n\u003cp\u003e“Tell me everything.” Gabrielle crossed her arms and blocked the way. “Tell me everything, now.”\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003e“Hello, Marianne,” Kat said the following morning.\u003c/p\u003e\n\u003cp\u003eThe tiny yard was wet with dew and the sun was still low, the house shrouded in the shadows of the woods. But as soon as the woman opened the door, Kat knew she hadn’t been sleeping. Marianne’s eyes were bright and clear as she regarded the two girls who stood on her stoop, mulling over the consequences of asking them inside.\u003c/p\u003e\n\u003cp\u003e“Marcus isn’t here,” she told them.\u003c/p\u003e\n\u003cp\u003e“That’s fine,” Kat said. “This is my cousin Gabrielle. If it’s okay, we’d like to talk to you.” But the woman didn’t speak or move. “Please, Marianne. We think that maybe Marcus is right. And we think maybe you’re not the only one who was affected.”\u003c/p\u003e\n\u003cp\u003eKat watched her weigh the words, consider her options, then slowly push the door open and gesture for them to follow.\u003c/p\u003e\n\u003cp\u003eKat and Gabrielle sat on the floral sofa while Marianne went to the kitchen and made tea. It was a simple house, but lovely. And Kat imagined that within those twelve hundred square feet, the brother and sister could pretend they’d never really left England.\u003c/p\u003e\n\u003cp\u003e“I’m sorry I’m such a mess,” Marianne said when she returned. She placed the tray on a low table in the center of the room. From where Kat sat, she couldn’t see a single hair out of place on the woman’s head, but Marianne patted at them just the same. “I’ve worked every day since I was fourteen. I’m not quite myself without a job to do.”\u003c/p\u003e\n\u003cp\u003eKat nodded. “I know the feeling.”\u003c/p\u003e\n\u003cp\u003e“Yes, miss,” Marianne said. “I don’t doubt it.”\u003c/p\u003e\n\u003cp\u003e“Where is Marcus?” Gabrielle asked.\u003c/p\u003e\n\u003cp\u003e“He’s back with young Mr. Hale today. Marcus offered to stay with me, but I told him that he should go. That boy will be needing Marcus now more than ever.”\u003c/p\u003e\n\u003cp\u003e“So you know…” Kat said.\u003c/p\u003e\n\u003cp\u003e“That young Mr. Hale inherited the company?” the woman filled in. “Yes. I heard.” She smiled. “I was very happy to hear that. His grandmother loved him so.”\u003c/p\u003e\n\u003cp\u003e“Did that surprise you, Marianne?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“Oh, I suppose I had just assumed it was going to be divided among her children, but…” She trailed off and brought a hand to her lips. “I just don’t know. He’s so young.”\u003c/p\u003e\n\u003cp\u003eKat nodded. “There will have to be a trustee to oversee things until he turns twenty-five.”\u003c/p\u003e\n\u003cp\u003eThe woman furrowed her brow and asked, “Who?”\u003c/p\u003e\n\u003cp\u003e“Garrett. The lawyer.”\u003c/p\u003e\n\u003cp\u003eTry as she might, Kat couldn’t quite decipher the look that crossed Marianne’s face. There was something there, though—a flash so fleeting that a normal person would have never seen it—and Kat thought for a moment that Marianne might have made a most excellent grifter.\u003c/p\u003e\n\u003cp\u003e“What is it, Marianne?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“Nothing,” she said, pulling her shawl more tightly around her shoulders.\u003c/p\u003e\n\u003cp\u003e“Oh, I think there’s something,” Gabrielle said, her voice cold.\u003c/p\u003e\n\u003cp\u003e“Gab,” Kat warned, but Gabrielle had her sights set on the woman.\u003c/p\u003e\n\u003cp\u003e“Marianne, you worked for Hazel for half a century, and now you know something. Don’t try to deny it. You know something, don’t you?” Gabrielle asked. But the woman didn’t answer.\u003c/p\u003e\n\u003cp\u003e“Marianne?” Kat asked softly. “What is it?”\u003c/p\u003e\n\u003cp\u003eMarianne recoiled and shook her head. “It’s nothing. A crazy notion. You wouldn’t believe me if I told you.”\u003c/p\u003e\n\u003cp\u003eKat and Gabrielle leaned closer and, in unison, said, “Try us.”\u003c/p\u003e\n\u003cp\u003e“I just can’t imagine that Mrs. Hale would name Garrett as the trustee. That’s all.”\u003c/p\u003e\n\u003cp\u003e“Didn’t she like him?” Gabrielle asked.\u003c/p\u003e\n\u003cp\u003e“No.” Marianne laughed. “Hazel wasn’t one to gossip, but I could tell she couldn’t stand the man. In fact, I thought she was going to fire him.”\u003c/p\u003e\n\u003cp\u003e“Then why didn’t she?” Gabrielle asked.\u003c/p\u003e\n\u003cp\u003eMarianne’s eyes grew moist. When she spoke again, her voice was almost a whisper. “She died.”\u003c/p\u003e\n\u003cp\u003e“It’s okay,” Gabrielle said. “Just tell us what happened.”\u003c/p\u003e\n\u003cp\u003eMarianne drew a deep breath and spoke softly. “A week or so ago, Mrs. Hale asked me to call the office and schedule a meeting with Mr. Garrett and a few members of the board. I did as she asked, but that night she grew ill, and then…well, she never made it.”\u003c/p\u003e\n\u003cp\u003e“Marcus said that he thought there was another will,” Kat said. “One that contradicts the one they read yesterday.”\u003c/p\u003e\n\u003cp\u003e“He thinks so,” Marianne said. “And maybe there is. I don’t know anything for certain.” For the first time, Marianne smiled. “Mrs. Hale was a bit of a pack rat. And a worrier. People who enter this world with nothing always are. If there was another will, she probably would have kept a file for herself.”\u003c/p\u003e\n\u003cp\u003e“Where?” Kat asked. “If it exists, where do you think it would be?”\u003c/p\u003e\n\u003cp\u003e“Did she have a safety deposit box?” Gabrielle tried. “A safe, somewhere? Maybe a—”\u003c/p\u003e\n\u003cp\u003e“It’s in her desk,” Marianne said suddenly, cutting Gabrielle off. “If she has another will, it would be in her desk in London.”\u003c/p\u003e\n\u003cp\u003e“Cheerio, Kitty Kat,” Gabrielle said in her best Cockney accent, but her smile faded as soon as she read the expression on her cousin’s face. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“It’s just that…if we were running this con”—Kat cut her eyes at Marianne—“which we aren’t. But if we were, the first thing I’d do is destroy any copies of the old will. I want you to know that, odds are, whoever is behind this has already done just that.”\u003c/p\u003e\n\u003cp\u003e“Oh, I wouldn’t be so certain.”\u003c/p\u003e\n\u003cp\u003e“Why?” Kat prompted.\u003c/p\u003e\n\u003cp\u003eThe woman smiled. “Because the desk where Mrs. Hale stored her most important papers was made by Alexander Petrovich.”\u003c/p\u003e\n\u003cp\u003e“It’s a Petrovich puzzle desk?” Kat asked.\u003c/p\u003e\n\u003cp\u003eMarianne gave a wide, knowing grin. “Someone could empty every drawer in it and still miss the hidden compartments. If the will exists, there’s a good chance a copy of it is still there.”\u003c/p\u003e\n\u003cp\u003eNeither girl spoke on the long drive back to Brooklyn. It was midday and the sun was bright. Spring flowers dotted green fields beneath a bright blue sky. It was almost like a painting. Kat was half tempted to steal it. But when they reached the brownstone’s stoop, their shadows fell across the door, and it was like a spell was broken. They could no longer pretend that nothing was wrong—that they didn’t have work to do. And when Kat opened the door, she wasn’t surprised to hear her uncle’s deep voice echoing through the house.\u003c/p\u003e\n\u003cp\u003e“Katarina! Gabrielle! Come in here.”\u003c/p\u003e\n\u003cp\u003eFor a moment, Kat was certain she was in trouble. She glanced at Gabrielle, and together the two said, “Yes, Uncle Eddie?”\u003c/p\u003e\n\u003cp\u003e“Sit down,” he said, pointing toward the old mismatched chairs. “We need to talk about Katarina’s young man.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry about the window, Uncle Eddie. I’ll get it—”\u003c/p\u003e\n\u003cp\u003e“The window can be fixed, Katarina. I’m far more concerned about him.”\u003c/p\u003e\n\u003cp\u003e“I know.” Kat nodded solemnly. “Me too.”\u003c/p\u003e\n\u003cp\u003e“So…” There was a pile of potatoes on the counter, and Eddie took a knife and began to peel. “It seems there is a great deal of mystery surrounding why the late Mrs. Hale would leave a billion-dollar corporation to a teenager and nothing to her oldest, dearest friend.”\u003c/p\u003e\n\u003cp\u003e“How did you know that?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“I hear things,” Eddie told her.\u003c/p\u003e\n\u003cp\u003eBut Kat knew better. Kat knew Eddie heard everything.\u003c/p\u003e\n\u003cp\u003e“If the butler is correct, then this is a most impressive con.”\u003c/p\u003e\n\u003cp\u003e“We know,” Gabrielle said, and Eddie talked on.\u003c/p\u003e\n\u003cp\u003e“It would have to be an inside job. Simple, but not easy.”\u003c/p\u003e\n\u003cp\u003e“We know,” Gab said again, but Eddie acted like he hadn’t even heard her. Kat couldn’t tell if he was frightened or impressed, and she felt a little bit of both as she sat silently watching her uncle peel potatoes, stripping away the skins.\u003c/p\u003e\n\u003cp\u003e“What did the maid say?” Eddie asked.\u003c/p\u003e\n\u003cp\u003e“There might be another will in London. Maybe.” Gabrielle gave a shrug.\u003c/p\u003e\n\u003cp\u003e“You will try to retrieve it?” Eddie looked directly at Kat, but she felt anything but certain.\u003c/p\u003e\n\u003cp\u003eA thousand doubts swarmed inside her mind. What if Hale found out? What if Marianne was wrong? And, worse, what if Marianne was right? And what if Hale never forgave her for proving it?\u003c/p\u003e\n\u003cp\u003eSo Kat twisted her hands and told her uncle, “It might be a wild-goose chase.”\u003c/p\u003e\n\u003cp\u003e“I’ve chased more for less,” her uncle said.\u003c/p\u003e\n\u003cp\u003e“Marcus could be wrong about everything.”\u003c/p\u003e\n\u003cp\u003e“He is not the sort of man who makes mistakes.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003eHer uncle’s hand came down, cutting her off, as he asked, “You do a great many things for strangers, Katarina. What are you willing to do for your friends?” \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-scoundrels-heist-society-3/page-7.html","bookId":2406,"creation":"Oct 5, 2019 10:32:06 AM","modification":"Oct 5, 2019 10:32:06 AM"}
