{"id":89734,"no":16,"title":"Page 16","content":"\u003cp\u003eThat there were no missing persons reports continued to bother me. Were the werewolves only killing transients? I had a hard time accepting that.\u003c/p\u003e\n\u003cp\u003eIn wolf form, werewolves were hunters, like me. When presented with a weaker entity, they attacked.\u003c/p\u003e\n\u003cp\u003eThey might posses human level intelligence, but I\u0027d never known them to be able to pound back the bloodlust.\u003c/p\u003e\n\u003cp\u003eThey saw people in the woods and they killed them. Plain, simple, to the point. I doubt they stopped long enough to ask for a resume.\u003c/p\u003e\n\u003cp\u003eI put the thought aside and headed to my apartment. I had more pressing concerns.\u003c/p\u003e\n\u003cp\u003eThe route into the woods was as familiar as the array of cars surrounding the tavern and the wail of jazz through the open windows.\u003c/p\u003e\n\u003cp\u003eI glanced at my watch. Coming up on 5:00 a.m. Did anyone ever go home around here?\u003c/p\u003e\n\u003cp\u003eI retrieved a spare .22 from my glove compartment and shoved the smaller gun into the waistband of my jeans. They were too tight to hide the thing, but I wasn\u0027t going anywhere without a silver bullet-firing weapon again. I might be slow, but eventually I caught on.\u003c/p\u003e\n\u003cp\u003eDirty, hungry, tired, I needed a shower, food, and bed in that order. But before I climbed the steps to my lonely room, I wanted to check behind the Dumpster one last time. Maybe the gun had fallen into a hole or something.\u003c/p\u003e\n\u003cp\u003eI was grasping. Pretty much anyone could have taken the gun while I\u0027d been inside the tavern. Of course he\u0027d have to have been watching me hide the thing... a fact I didn\u0027t want to examine too closely.\u003c/p\u003e\n\u003cp\u003eAs I approached the garbage bin, a fat raccoon shot a glare in my direction and waddled away. Better than a rat, though I bet a few of them made regular visits here as well. I wasn\u0027t afraid of animals. How could I be? But rats made me shudder. What was with those hairless tails anyway?\u003c/p\u003e\n\u003cp\u003eI\u0027d brought the flashlight from my car, and I shone the beam back and forth across the front of the Dumpster, across the paper-strewn ground, then behind. Not a single gleam of gunmetal made my life any easier. It was bad enough I\u0027d have to admit taking Damien\u0027s gun; I didn\u0027t want to tell him I\u0027d lost it, too.\u003c/p\u003e\n\u003cp\u003eKneeling next to the wall, I reached into the crack between the building and the steel container.\u003c/p\u003e\n\u003cp\u003eSomething skittered out the other side and ran away.\u003c/p\u003e\n\u003cp\u003e\"I did not hear that,\" I assured myself.\u003c/p\u003e\n\u003cp\u003eI continued to feel around but came up with nothing.\u003c/p\u003e\n\u003cp\u003eThe shriek of a dying animal shot my heart straight into my throat. Whatever had run from me had slammed straight into something else. Bummer for him.\u003c/p\u003e\n\u003cp\u003eI retrieved my hand, sat back on my heels, scowled at the scum under my nails. A growl rumbled along my spine like sandpaper. Slowly I straightened, then turned.\u003c/p\u003e\n\u003cp\u003e\"One, two, three, four, five. Shitty odds,\" I muttered, and drew the gun.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know how many bullets I had. Not enough. Who\u0027d have thought I\u0027d need more than a clip\u0027s worth to get from my car to the house?\u003c/p\u003e\n\u003cp\u003eThe wolves advanced, legs stiff, hackles raised. My first bullet kicked up dirt in front of the lead animal.\u003c/p\u003e\n\u003cp\u003eHis lip curled; then he threw up his head as if laughing at me.\u003c/p\u003e\n\u003cp\u003eI shot a glance toward the staircase that led to my apartment. A wolf sat on the bottom step, tongue lolling as he panted like a great big dog.\u003c/p\u003e\n\u003cp\u003eI could shoot him and try to get to my apartment, but there were five - I looked back just as several shadows detached themselves from the trees and crossed the parking lot - make that ten wolves behind me. Thank God none of them were white. Still, I was in serious trouble.\u003c/p\u003e\n\u003cp\u003eThe main wolf pack was between me and the tavern. I could yell for help, but the music was too loud.\u003c/p\u003e\n\u003cp\u003eThey\u0027d never hear me.\u003c/p\u003e\n\u003cp\u003eMy mind raced as fast as my heart. I cast a glance toward Damien\u0027s cabin. Nothing between it and me but grass. That building was the only chance I had.\u003c/p\u003e\n\u003cp\u003eI fired another shot, actually hit one of them this time. The flames, the stench of burning flesh and fur, the howi of the dying distracted the others long enough for me to achieve a small lead.\u003c/p\u003e\n\u003cp\u003eI\u0027d take what I could get. They were going to catch me. There was no way I could outrun close to a dozen wolves. Hell, I couldn\u0027t outrun one, but I had to try.\u003c/p\u003e\n\u003cp\u003eA chorus of howls rose behind me, so loud I flinched, stumbled, and nearly fell. Their footsteps echoed mine. The warmth of their breath brushed my calves. The scent of predator after prey cascaded through the night - a sharp and gamy aroma reminiscent of fear and death.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t recall if I\u0027d locked Damien\u0027s door after I\u0027d picked it. If I had, I was dead or soon to be furry.\u003c/p\u003e\n\u003cp\u003eEither way, I\u0027d take a few of them with me.\u003c/p\u003e\n\u003cp\u003eI reached for the knob, but the door swung open. I smashed into Damien\u0027s chest.\u003c/p\u003e\n\u003cp\u003e\"Oomph,\" he said, and caught me.\u003c/p\u003e\n\u003cp\u003eMy momentum propelled us inside the cabin.\u003c/p\u003e\n\u003cp\u003e\"Shut it! Shut it!\" I shouted, kicking back, managing to catch the door with my heel.\u003c/p\u003e\n\u003cp\u003eI tensed, expecting bodies to thud against the other side. Glancing at the window, I waited for the shadow, the crash, death.\u003c/p\u003e\n\u003cp\u003eNothing happened.\u003c/p\u003e\n\u003cp\u003eI pulled free of Damien\u0027s arms, ran to the glass. The first rays of sun lightened the eastern horizon, threw streams of pink and gray across the hauntingly empty clearing.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\"\u003c/p\u003e\n\u003cp\u003eI ignored him, stepping to the door, yanking it open, and sticking my gun outside. The wind blew a leaf end over end across the threshold.\u003c/p\u003e\n\u003cp\u003e\"Did you see them?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Couldn\u0027t you hear them?\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t answer and I turned. Gently he removed the gun from my shaking hand. \"There\u0027s nothing there, Leigh.\"\u003c/p\u003e\n\u003cp\u003e\"Ten. Maybe more. They howled. Chased me. You had to see them.\"\u003c/p\u003e\n\u003cp\u003e\"All I saw was you.\"\u003c/p\u003e\n\u003cp\u003eMy head jerked up. Our eyes met and something passed between us that had nothing to do with the situation. We both remembered the last time we\u0027d been together. Remembered it and wanted more.\u003c/p\u003e\n\u003cp\u003eHe was the first to look away. We\u0027d been gazing at each other so intently, the loss of that contact was like a physical break. I took a single step toward him before I caught myself. Now was not the time.\u003c/p\u003e\n\u003cp\u003eHe crossed the short distance to the kitchen table and laid the gun on top. He wore his usual outfit -\u003c/p\u003e\n\u003cp\u003eblack on black - his feet were bare, but his shirt was buttoned. For reasons beyond my understanding, I was more turned on by his pale, long feet than I\u0027d ever been by his smooth, muscled chest.\u003c/p\u003e\n\u003cp\u003eI was dizzy from the adrenaline; fear-induced sweat chilled my skin. I needed to sit down, so I did. On the floor at his feet. Bad idea. I was reaching to run a thumb along the lilting arch before I knew what I was doing.\u003c/p\u003e\n\u003cp\u003eHe fell to his knees beside me. I yanked my hand back and held it still in my lap as he put a palm to my forehead. \"You\u0027re sick.\"\u003c/p\u003e\n\u003cp\u003e/ must be if I\u0027m thinking about how your feet would feel all tangled up with mine.\u003c/p\u003e\n\u003cp\u003eI turned my head, afraid if he kept touching me I\u0027d beg. I wanted him, but not like this. Not when I was sweaty, smelly, not quite certain of my sanity.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t see them?\" I asked again.\u003c/p\u003e\n\u003cp\u003e\"Them who?\"\u003c/p\u003e\n\u003cp\u003e\"The wolves.\"\u003c/p\u003e\n\u003cp\u003e\"Wolves?\" He glanced out the door, which I\u0027d left wide open. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"Shit.\" I rubbed a hand over my face. My palm came away wet. With sweat or tears I wasn\u0027t sure, and that scared me almost as much as the wolves had.\u003c/p\u003e\n\u003cp\u003e\"I heard some howls. They - \" He stopped.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"They came from the woods. I didn\u0027t think anything of it. Wolves howl all the time. I like the sound.\" He shrugged. \"Makes me feel less alone.\"\u003c/p\u003e\n\u003cp\u003eI snorted. Better to be alone forever than to have company like that.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know what to think. Had the werewolves run into the woods instead of chasing me? Why? I\u0027d never known them to give up on a sure thing. I didn\u0027t like to think what it meant if they had.\u003c/p\u003e\n\u003cp\u003eThe only other explanation was that they\u0027d never been there at all. I liked that idea even less.\u003c/p\u003e\n\u003cp\u003e\"I have to go.\"\u003c/p\u003e\n\u003cp\u003eI got to my feet. So did he.\u003c/p\u003e\n\u003cp\u003eI knew I should stay. I needed to question him.\u003c/p\u003e\n\u003cp\u003eWho the hell are you? Why are you here?\u003c/p\u003e\n\u003cp\u003eBut right now I wasn\u0027t capable of it. I had to get away from Damien. Be by myself. Get a grip.\u003c/p\u003e\n\u003cp\u003eI looked out the door. The white wolf stood at the edge of the forest, waiting for me.\u003c/p\u003e\n\u003cp\u003eI blinked and he was gone.\u003c/p\u003e\n\u003cp\u003eThere was no way I could go out there.\u003c/p\u003e\n\u003cp\u003eDamien must have mistook my hesitation for something else. He came up behind me, shut the door, locked it. Then he put his hands on my shoulders. His breath brushed the bare skin of my neck, and I shivered again for an entirely different reason.\u003c/p\u003e\n\u003cp\u003eWhat the hell?\u0026nbsp;\u0026nbsp;I thought. I couldn\u0027t go back to my room. I might as well stay here. In the past I\u0027d tried drinking and drugs to make me forget the damned white wolf. They hadn\u0027t worked. There was one vice I\u0027d neglected.\u003c/p\u003e\n\u003cp\u003eI bet Damien could make me forget... everything.\u003c/p\u003e\n\u003cp\u003eI turned and offered my mouth to his. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2/page-16.html","bookId":2089,"creation":"Oct 5, 2019 5:38:18 PM","modification":"Oct 5, 2019 5:38:18 PM"}
