{"id":89735,"no":17,"title":"Page 17","content":"\u003cp\u003eDamien went still. \"This is a bad idea, Leigh.\"\u003c/p\u003e\n\u003cp\u003eI went on tiptoe, brushed my lips back and forth across his chin, then reached up and licked his bottom lip.\u003c/p\u003e\n\u003cp\u003e\"Fuck me,\" I whispered. \"You know you want to.\"\u003c/p\u003e\n\u003cp\u003eHe reared back, staring at me as if I\u0027d lost my mind. But I already knew that I had.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said.\u003c/p\u003e\n\u003cp\u003eI reached down and cupped him. He was hard and heavy against my palm. \"No?\" I drew a fingertip up his length.\u003c/p\u003e\n\u003cp\u003eHe caught his breath, closed his eyes. I slipped my hand into his pants, closed my fingers around him, and pumped.\u003c/p\u003e\n\u003cp\u003eCursing, he grabbed my wrist. I managed to rub my thumb over his tip; moisture beaded between our skin. I wanted to taste him.\u003c/p\u003e\n\u003cp\u003e\"Leigh,\" he ground out.\u003c/p\u003e\n\u003cp\u003eMaybe later.\u003c/p\u003e\n\u003cp\u003e\"Stop talking.\"\u003c/p\u003e\n\u003cp\u003eI kissed him the way he\u0027d kissed me earlier. Nothing gentle about it. No giving, only taking. If he kept yapping, I\u0027d lose my nerve, and I didn\u0027t want that. I wanted him.\u003c/p\u003e\n\u003cp\u003eHe gave in with a furious rumble from deep in his chest. Suddenly his hands were everywhere, touching everything. His mouth was right behind them.\u003c/p\u003e\n\u003cp\u003eI fumbled with his shirt. Why now, of all times, had he buttoned the damn thing? I lost my patience and yanked. Buttons pinged against the floor. At last I could kiss the chest I\u0027d been fantasizing about.\u003c/p\u003e\n\u003cp\u003eHe tasted as good as he smelled, an enticing combination of sunshine and shadow. Salt and sweet, clean skin. I licked his soft, flat nipple. It beaded and I rolled it with my tongue, tested the tip with my teeth.\u003c/p\u003e\n\u003cp\u003eHis fingers tightened in my hair, pressing against my skull to a point just short of pain. I suckled him and his hand fell to my waist, but he didn\u0027t pull me near. Instead, he seemed to be holding me away. I didn\u0027t like it.\u003c/p\u003e\n\u003cp\u003eI reached for him, stroked gently. He leaped, grew, heated, and at last he drew me closer. It felt so good to be held. No one had touched me since Jimmy and...\u003c/p\u003e\n\u003cp\u003eMy mind shied away from the past, clung to the present.\u003c/p\u003e\n\u003cp\u003eThink of nothing but this, no one but him.\u003c/p\u003e\n\u003cp\u003eMy hand increased the pressure, the speed. My name erupted like a curse from his lips as he tugged at my clothes. He didn\u0027t have much luck. They were too tight to get rid of easily.\u003c/p\u003e\n\u003cp\u003eI was afraid he\u0027d call a stop again, and if he did, I\u0027d listen to the voice I\u0027d stifled, the one that kept screaming, Are you insane?\u003c/p\u003e\n\u003cp\u003eMaybe. Oh well, nothing I hadn\u0027t been before.\u003c/p\u003e\n\u003cp\u003eTo stifle the voice, I yanked my tank top over my head, lost the boots, the socks, the knife, then shimmied out of my jeans. By undressing myself, I could control the situation, control what he saw, what I hid.\u003c/p\u003e\n\u003cp\u003eI straightened, standing naked and exposed. Suddenly the room wasn\u0027t so hot; it was downright chilly.\u003c/p\u003e\n\u003cp\u003eThe gray light of dawn cast a shadow over his face, making his eyes darker than I remembered, closer to brown than hazel. His hair was mussed, the lack of sun hiding the streaks of red amid the chestnut strands. His jaw was dark with stubble. I wanted to feel the scrape against my thighs, my belly, my breasts.\u003c/p\u003e\n\u003cp\u003eHis shirt hung loose, the black accenting his pale, smooth skin. His trousers rode low on his hips. He was slim but toned, every inch honed to perfection. I wanted to see all of him, touch him, too.\u003c/p\u003e\n\u003cp\u003eI eased the shirt from his shoulders. He shrugged and it fluttered to the ground. He seemed unaffected by my nearness, my nakedness. Standing completely still, he didn\u0027t reach out. Did he find me unappealing?\u003c/p\u003e\n\u003cp\u003eThe thought made me frown. I hadn\u0027t looked at a man with any interest in over two years, but not because no one had looked at me.\u003c/p\u003e\n\u003cp\u003eSmall, petite, blond - almost. I was flat chested, true, but there were plenty of men who didn\u0027t mind, who, in fact, preferred a boyish shape to a voluptuous one. However, Damien might not be one of them.\u003c/p\u003e\n\u003cp\u003eI stepped forward and laid my palm against his chest, felt his heart pounding like the wings of a bird that had been startled from the trees. He might appear unaffected, but his body couldn\u0027t lie. He wanted me.\u003c/p\u003e\n\u003cp\u003eI hooked my thumbs in his pants, shifted them down his hips, over his erection, then let them fall to the floor. He grabbed me by the shoulders, his touch no longer gentle.\u003c/p\u003e\n\u003cp\u003eHis mouth on mine re-ignited the lust. Everything about him aroused me - his skin, his hair, his scent. My fingers fluttered everywhere, stroking, kneading, discovering.\u003c/p\u003e\n\u003cp\u003eHis bed was across the room. A lifetime away. I was tempted to opt for the kitchen table, but would that label me an overeager slut? Probably.\u003c/p\u003e\n\u003cp\u003eDid I care? Not really.\u003c/p\u003e\n\u003cp\u003eThe decision was taken out of my hands when he lifted me into his arms and headed for the bed. I didn\u0027t argue. Not even when he fell onto his back, letting me sprawl all over him. I felt exposed, naked.\u003c/p\u003e\n\u003cp\u003eOops, I was.\u003c/p\u003e\n\u003cp\u003eI tried to shimmy off, so I could press my back against the mattress. He couldn\u0027t see me, couldn\u0027t touch me, where no one had touched me since. Panic pulsed in a hot, oily mass at the base of my throat. Then he grabbed my thighs, opened my legs, and arched.\u003c/p\u003e\n\u003cp\u003eI forgot all about what I wanted to hide as his erection slid against me just right. He kept his palms on my hips; his thumbs glided up and down the sensitive area where my thighs connected to my body.\u003c/p\u003e\n\u003cp\u003eGooseflesh broke out, making the light sheen of sweat on my skin tingle. I felt alive in a way I hadn\u0027t felt since I\u0027d begun courting death.\u003c/p\u003e\n\u003cp\u003eHe pushed me toward the edge. I didn\u0027t want to go. Not so fast, not like this. I wanted him inside me. I needed him to fill the eternal emptiness, assuage the burning, aching abyss that was Leigh.\u003c/p\u003e\n\u003cp\u003eTightening my legs, I lifted myself, searching for fulfillment. It wasn\u0027t hard to find. He slid inside just a bit.\u003c/p\u003e\n\u003cp\u003eSuddenly I was on my back, his body flush with mine, his hands pinning my wrists to the mattress as I fought him.\u003c/p\u003e\n\u003cp\u003e\"Dammit, Leigh.\" His forehead pressed against mine. \"Wait a second.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to wait.\"\u003c/p\u003e\n\u003cp\u003eIf I waited, I\u0027d think, and thinking was bad. Right now all I needed was him. I wasn\u0027t remembering or missing anyone else.\u003c/p\u003e\n\u003cp\u003e\"Neither do I,\" he muttered, and reached over the side of the bed.\u003c/p\u003e\n\u003cp\u003eI tensed, uncertain what he was doing. But when his hand became visible again, I understood.\u003c/p\u003e\n\u003cp\u003eI was much, much dumber than I looked.\u003c/p\u003e\n\u003cp\u003eHe rolled away and in a quick, practiced move sheathed himself in a condom. Watching his clever fingers play over his own skin excited me.\u003c/p\u003e\n\u003cp\u003eEven if I\u0027d been able to think clearly, I had no time for recriminations. He was back in an instant, sliding between my thighs, stroking my waist.\u003c/p\u003e\n\u003cp\u003e\"No more waiting,\" he murmured, lips drifting from my ear, to my neck, then back to my mouth.\u003c/p\u003e\n\u003cp\u003eI wrapped my legs around him and he filled me in a single, driving thrust. He was too gentle; I wanted it rough.\u003c/p\u003e\n\u003cp\u003eAs I urged him with my hands, my hips, my teeth, he caught the rhythm and swept me away - from him, from Crow Valley, but, most important, from myself.\u003c/p\u003e\n\u003cp\u003eHe knew which buttons to push. At least on me. When I was near the edge, panting, gasping, he slowed, then went still.\u003c/p\u003e\n\u003cp\u003eCircling both my wrists with one of his hands, the scrape of his rough ringers enticed me. He held me captive so I couldn\u0027t touch him or hasten him on. Then he let his mouth do amazing things wherever it could reach. My breasts were small, but that only meant they were more sensitive. Having him hard and still inside me while he suckled and bit and played with my nipples made me come in a deep, pulsing wave, but it wasn\u0027t enough.\u003c/p\u003e\n\u003cp\u003e\"Again,\" he muttered, slowly drawing himself out to the tip, then pushing in as deep as he could.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t,\" I murmured, even as I wrapped my legs around his back and pulled him closer.\u003c/p\u003e\n\u003cp\u003eHe teased me until my skin was slick with sweat and my mind was spinning along with my body. This time when I went over, he came, too, the pulsing ejaculation an added sensation that had me tightening around him, drawing out the moment as long as I could.\u003c/p\u003e\n\u003cp\u003eBut sooner or later all good things must end. There were technicalities to take care of. He went to the bathroom. Water ran; the toilet flushed. The world rushed back like a flood. What had I done?\u003c/p\u003e\n\u003cp\u003eScrewed a stranger. Big deal. These days everyone was a stranger. What did I expect, that I\u0027d go without sex for the rest of my life?\u003c/p\u003e\n\u003cp\u003eHe\u0027d been good. Make that great. Even if I hadn\u0027t been with a man in two years, Damien would still have been amazing.\u003c/p\u003e\n\u003cp\u003eAnd why not? He was gorgeous, built, skilled. Of course he was the best fuck I\u0027d ever had. I should have been dancing for joy. Instead I felt like crying.\u003c/p\u003e\n\u003cp\u003e\"Do you have a cigarette?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Leigh.\" His hand covered mine. I stared at the ceiling as if it were the most fascinating entity on the planet. \"Sex isn\u0027t going to help.\"\u003c/p\u003e\n\u003cp\u003eMy gaze flew to his. \"Help what?\"\u003c/p\u003e\n\u003cp\u003eHis smile was both gentle and sad. Darnien\u0027s smile. \"Help you to forget.\"\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed. \"Forget what?\"\u003c/p\u003e\n\u003cp\u003e\"Leigh,\" he said again, and touched my hair.\u003c/p\u003e\n\u003cp\u003eMy chest ached. My eyes burned. I had to stop him from being nice to me before I cried. I turned my back, then realized what I\u0027d done and slammed my shoulders flat to the bed.\u003c/p\u003e\n\u003cp\u003eI glanced at his face.\u003c/p\u003e\n\u003cp\u003eToo late. He\u0027d already seen. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2/page-17.html","bookId":2089,"creation":"Oct 5, 2019 5:38:18 PM","modification":"Oct 5, 2019 5:38:18 PM"}
