{"id":89750,"no":32,"title":"Page 32","content":"\u003cp\u003e\"Fuck me,\" I muttered.\u003c/p\u003e\n\u003cp\u003e\"I think that\u0027s what he has in mind.\"\u003c/p\u003e\n\u003cp\u003e\"Now what?\" I asked, which seemed to be the question of the week.\u003c/p\u003e\n\u003cp\u003e\"Now we keep blasting wolves whenever the opportunity presents itself, search for their lair, keep an eye out for Hector night and day, and dig, dig, dig some more for a way to end this before the moon gets full.\"\u003c/p\u003e\n\u003cp\u003e\"Because if we don\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"You get to do the dirty in front of every werewolf in town.\"\u003c/p\u003e\n\u003cp\u003eI wanted to say something flippant, but my voice betrayed me. All I could do was move my mouth. No sound came out.\u003c/p\u003e\n\u003cp\u003eJessie appeared concerned. She moved closer and patted me on the back, hard enough to make me choke, then cough. At least it was something.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m OK,\" I managed.\u003c/p\u003e\n\u003cp\u003e\"Will wants to go back to Cora\u0027s. Borrow some of her books. Wanna come?\"\u003c/p\u003e\n\u003cp\u003eShe was babysitting me. I wasn\u0027t going to let her.\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027ve got things to do.\"\u003c/p\u003e\n\u003cp\u003eJessie frowned. \"But - \"\u003c/p\u003e\n\u003cp\u003e\"If what you say is true, I\u0027m safe until the full moon. If it\u0027s even Hector.\"\u003c/p\u003e\n\u003cp\u003e\"We both know it\u0027s Hector, Leigh.\"\u003c/p\u003e\n\u003cp\u003eI shifted my shoulders. Pain flashed across my skin. Yeah, we did.\u003c/p\u003e\n\u003cp\u003e\"I need some sleep,\" I said. \"Why don\u0027t you come back here with the books. I\u0027ll order pizza. We\u0027ll brainstorm, then go out and kill things. It\u0027ll be a girls\u0027 night out.\"\u003c/p\u003e\n\u003cp\u003eShe hesitated. \"You promise you\u0027ll stay inside until we get back?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Mother.\"\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed, but she got off the couch and moved toward the door. She seemed to have no ill effects from her own shoulder wound. I was glad.\u003c/p\u003e\n\u003cp\u003eJessie paused with her hand on the doorknob. \"We know what they\u0027re up to, Leigh. That means we\u0027re one step ahead of them. I\u0027ve got a good feeling about this.\"\u003c/p\u003e\n\u003cp\u003e\"Well then, everything\u0027s gonna be all right.\"\u003c/p\u003e\n\u003cp\u003eHer lips twitched. She almost laughed. \"Keep on being a smart guy. You know how I love that.\"\u003c/p\u003e\n\u003cp\u003eThe door shut behind her. I looked around the rented room, took in my bag and my laptop. I had no address but .com, no closet but a suitcase. I was suddenly sick of having nowhere to call home. When had that happened?\u003c/p\u003e\n\u003cp\u003eI lay down, tried to sleep. Drifted in and out. But every time I closed my eyes I saw the mine, those human bones. There was something weird about that. They were almost like a warning.\u003c/p\u003e\n\u003cp\u003eI sat bolt upright in my bed. We\u0027d never gone past those bones and suddenly I wanted to.\u003c/p\u003e\n\u003cp\u003eI glanced at the window. Night was falling. I must have drifted further than I\u0027d thought.\u003c/p\u003e\n\u003cp\u003eI\u0027d promised Jessie I wouldn\u0027t go outside, definitely shouldn\u0027t at this time of night. Oh well, I\u0027d never been very good at keeping promises. Remember the one I\u0027d made to Jimmy?\u003c/p\u003e\n\u003cp\u003eI got dressed, grabbed a few guns, some ammo, then walked downstairs.\u003c/p\u003e\n\u003cp\u003eDamien\u0027s cabin was dark. However, the bar was lit up like a major-league baseball field during the seventh-inning stretch.\u003c/p\u003e\n\u003cp\u003eI headed in that direction. Even Jessie couldn\u0027t get mad at me for investigating with Damien at my side.\u003c/p\u003e\n\u003cp\u003eWhat better backup than a werewolf? Too bad I couldn\u0027t tell her that.\u003c/p\u003e\n\u003cp\u003eStepping inside the tavern, I frowned. The place was empty, except for the shoes, wallets, purses, keys, and little piles of clothing.\u003c/p\u003e\n\u003cp\u003eMy fingers tightened on my rifle. Their lair had been here all the time.\u003c/p\u003e\n\u003cp\u003eDamien had to have known. Why hadn\u0027t he told me?\u003c/p\u003e\n\u003cp\u003eOf course, I hadn\u0027t asked. Who\u0027d have suspected they were changing right underneath my nose? Talk about hiding in plain sight.\u003c/p\u003e\n\u003cp\u003eMy plans changed. I\u0027d just sit down and wait for them to come back.\u003c/p\u003e\n\u003cp\u003eI thought of how many I\u0027d kill tonight. Maybe even Hector, though I doubted it. He wouldn\u0027t be dumb enough to show his face here.\u003c/p\u003e\n\u003cp\u003eSo why was my scar burning as if it were a fresh, new wound?\u003c/p\u003e\n\u003cp\u003e\"Waitin\u0027 for someone?\"\u003c/p\u003e\n\u003cp\u003eI gasped and spun toward the bar. Cowboy stood on top, leering, snarling, or whatever the hell it was he did with his lip.\u003c/p\u003e\n\u003cp\u003e\"Uh, yeah, well, I was looking for Damien.\"\u003c/p\u003e\n\u003cp\u003eCowboy narrowed his eyes. \"He ain\u0027t around.\"\u003c/p\u003e\n\u003cp\u003e\"I see that.\"\u003c/p\u003e\n\u003cp\u003e\"Yer not gonna ask why everyone\u0027s clothes are all over the floor?\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eHe snorted. \"You know why.\"\u003c/p\u003e\n\u003cp\u003eCowboy jumped off the bar, his boots clicking on the wood floor as he meandered toward me. I kept my hands on my guns, my eyes on his face. I\u0027d crossed him off as a werewolf long ago, but maybe that hadn\u0027t been such a bright idea. I\u0027d figured if he was a shifter he\u0027d have cured whatever ailment had made him a midget in the first place. But maybe he hadn\u0027t. Maybe he liked being small. Maybe it got him ignored.\u003c/p\u003e\n\u003cp\u003eHe stopped only a foot away from me. \"I got some-thin\u0027 to show you.\"\u003c/p\u003e\n\u003cp\u003eHe began to unbutton his shirt. I backed toward the door. \"Uh, no thanks.\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"You don\u0027t mind seeing Damien\u0027s chest, but you don\u0027t want to see mine?\"\u003c/p\u003e\n\u003cp\u003e\"That about sums it up.\"\u003c/p\u003e\n\u003cp\u003e\"Believe me, Leigh, you\u0027re gonna want to see this.\"\u003c/p\u003e\n\u003cp\u003eSomehow I doubted that. I reached for the doorknob. My hand touched the brass just as Cowboy\u0027s shirt fell open.\u003c/p\u003e\n\u003cp\u003eThe pentagram tattoo on his breastbone gleamed black against his pale, smooth skin. I couldn\u0027t move.\u003c/p\u003e\n\u003cp\u003eCouldn\u0027t breathe.\u003c/p\u003e\n\u003cp\u003eI lifted my gaze from his chest to his face. His eyes were weird - water flowing under dark ice. I stood there staring as Cowboy\u0027s black irises turned blue.\u003c/p\u003e\n\u003cp\u003e\"Oh, God,\" I whispered.\u003c/p\u003e\n\u003cp\u003eHis face was flowing now, the skin rippling like Silly Putty. I could see another face beneath, fighting to get out.\u003c/p\u003e\n\u003cp\u003eWas he getting taller? Broader? When had Cowboy grown a goatee?\u003c/p\u003e\n\u003cp\u003eThe tavern spun. Tiny black spots flickered in front of my eyes. I fought the weakness, but it didn\u0027t do any good.\u003c/p\u003e\n\u003cp\u003e\"Querida,\"\u0026nbsp;\u0026nbsp;he murmured. \"I\u0027ve missed you.\"\u003c/p\u003e\n\u003cp\u003eI passed out cold at the toe of itty-bitty boots, which had suddenly burst open at the seams. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2/page-32.html","bookId":2089,"creation":"Oct 5, 2019 5:38:18 PM","modification":"Oct 5, 2019 5:38:18 PM"}
