{"id":89753,"no":35,"title":"Page 35","content":"\u003cp\u003e\"I\u0027ve got to go,\" I said.\u003c/p\u003e\n\u003cp\u003eI took one step toward the door and fell to my knees as the room became a forest again. Damp earth seeped through my pants legs, chilling my skin. The air was musty. I smelled moss. In the distance a wolf howled. I lifted my mouth to call out...\u003c/p\u003e\n\u003cp\u003eAnd ended up coughing, choking, in Damien\u0027s arms.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you\u0027re going anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"Stop me.\"\u003c/p\u003e\n\u003cp\u003e\"No problem.\"\u003c/p\u003e\n\u003cp\u003eHe scooped me up again and took me into the bathroom, where he dumped me onto the toilet seat.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m cleaning that wound, and I\u0027m calling a doctor.\"\u003c/p\u003e\n\u003cp\u003e\"Damien, it won\u0027t do any good. You and I both know that.\"\u003c/p\u003e\n\u003cp\u003eHe hung his head. \"Just let me clean it then. OK?\"\u003c/p\u003e\n\u003cp\u003e\"If I do, will you let me find Jessie?\"\u003c/p\u003e\n\u003cp\u003e\"No. But I will.\"\u003c/p\u003e\n\u003cp\u003eI glanced into his eyes. This was the best deal I was going to get.\u003c/p\u003e\n\u003cp\u003eI yanked the pillowcase bandage off my arm. \"Knock yourself out.\"\u003c/p\u003e\n\u003cp\u003eHis smile was the same smile I\u0027d come to love. Sweet, sad, infinitely beautiful. I was going to miss him.\u003c/p\u003e\n\u003cp\u003eMy arm was bloody and gaping, made me nauseous just to look at it. I turned away, and he dampened a cloth and began to wash away the gore.\u003c/p\u003e\n\u003cp\u003eAfter a few minutes Damien made an impatient sound. \"This isn\u0027t going to do any good, Leigh. It just keeps bleeding.\"\u003c/p\u003e\n\u003cp\u003eI resisted the urge to say, Told you so.\u003c/p\u003e\n\u003cp\u003e\"Bandage me up again.\"\u003c/p\u003e\n\u003cp\u003e\"You need stitches.\"\u003c/p\u003e\n\u003cp\u003e\"Stitch me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll make a mess, a scar.\"\u003c/p\u003e\n\u003cp\u003eI lifted a brow. \"A scar? Oh, no. I shiver. I shudder. That would be such a shame.\"\u003c/p\u003e\n\u003cp\u003eHe ran a hand over his face, leaving a trail of my blood across his cheek.\u003c/p\u003e\n\u003cp\u003e\"Forget it,\" I said. \"It\u0027s not going to make a difference in another day anyway.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\" He straightened. \"You\u0027ll heal.\"\u003c/p\u003e\n\u003cp\u003eI wouldn\u0027t. But once again, he didn\u0027t need to know that.\u003c/p\u003e\n\u003cp\u003e\"Which reminds me, why doesn\u0027t Hector\u0027s tattoo heal?\"\u003c/p\u003e\n\u003cp\u003e\"He has a tattoo? Like Cowboy?\"\u003c/p\u003e\n\u003cp\u003e\"Obviously, since they\u0027re the same person.\"\u003c/p\u003e\n\u003cp\u003e\"Which makes no sense.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d be surprised.\" I didn\u0027t have the energy or the time to explain super-duper shape-shifting powers, even if I could.\u003c/p\u003e\n\u003cp\u003e\"But the wolf morphing into the crow made no sense, either,\" he murmured.\u003c/p\u003e\n\u003cp\u003e\"Getting back to the tattoo?\" I reminded him as he used a towel to bind my arm.\u003c/p\u003e\n\u003cp\u003e\"What? Oh. That\u0027s easy. You stay the way you were when you were made a wolf. If... Was it Hector?\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"If he had a tattoo when he became a werewolf, he\u0027ll have one forever. Any injury after that will heal.\"\u003c/p\u003e\n\u003cp\u003eDamien pointed to his thigh and I remembered the thin white scar that marred his nearly perfect flesh. \"I got that as a kid. It\u0027ll never go away.\"\u003c/p\u003e\n\u003cp\u003eThis was all news to me. Why didn\u0027t we know this in the J-S society? Because we didn\u0027t stop to ask questions before we shot them, and maybe that wasn\u0027t so bright.\u003c/p\u003e\n\u003cp\u003e\"But what about this?\" I lifted my bandaged arm. \"Happened before I became a werewolf.\"\u003c/p\u003e\n\u003cp\u003e\"The wound that infected you with the virus will heal.\"\u003c/p\u003e\n\u003cp\u003e\"Convenient.\"\u003c/p\u003e\n\u003cp\u003e\"Can you imagine people walking around with their throats ripped out? It isn\u0027t pretty.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d wondered when I first became a Jager-Sucher how people with kill wounds could heal. There was a simple, disgusting explanation. People were food. If a werewolf ate you, you died. If he nibbled but didn\u0027t snack, you got to be one of them.\u003c/p\u003e\n\u003cp\u003e\"What about diseases?\" I pressed.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll heal, because you still have them after you\u0027re a werewolf. At least until you shift the first time.\"\u003c/p\u003e\n\u003cp\u003e\"But not scars?\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, Leigh.\"\u003c/p\u003e\n\u003cp\u003eHe thought I was worried about my back. I hadn\u0027t even considered it. Guess I got to keep the scar. Oh, boy.\u003c/p\u003e\n\u003cp\u003e\"Who is Hector?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Cowboy.\"\u003c/p\u003e\n\u003cp\u003e\"No, who is he to you?\"\u003c/p\u003e\n\u003cp\u003eI lifted my eyes. Sympathy shone in his, caring, under-standing, love. How could he love me? Because he didn\u0027t know.\u003c/p\u003e\n\u003cp\u003e\"I had sex with him,\" I blurted. \"I saw him, wanted him, took him. Then he sacrificed everyone I loved so he could become like you.\"\u003c/p\u003e\n\u003cp\u003eDamien frowned. I waited for the recriminations, the disgust. Instead he murmured, \"Interesting.\"\u003c/p\u003e\n\u003cp\u003e\"Interesting? Is that all you can say?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know someone could become a werewolf without being bitten.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d be surprised what you don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eThe door to my apartment banged open. Jessie and Will spilled into the room, Jessie shouting my name and cursing.\u003c/p\u003e\n\u003cp\u003eI was so damn glad to see them alive, I didn\u0027t hear what they were saying. I got off the toilet and inched past Damien. As I went by, his palm slid along my good arm in a gentle, reassuring touch. My fingers clung to his for just an instant and it was good.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here,\" I said.\u003c/p\u003e\n\u003cp\u003eThey both went silent as if I\u0027d thrown a switch, staring at me as if I were a ghost.\u003c/p\u003e\n\u003cp\u003e\"Thank God,\" she breathed. \"I thought we were too late.\"\u003c/p\u003e\n\u003cp\u003e\"Too late for what?\"\u003c/p\u003e\n\u003cp\u003e\"We talked to Cora. He has to - \"\u003c/p\u003e\n\u003cp\u003e\"Make me a werewolf before the full moon.\"\u003c/p\u003e\n\u003cp\u003eJessie shut her mouth, tilted her head. \"How did you know that?\"\u003c/p\u003e\n\u003cp\u003e\"He told me.\" I lifted my bandaged arm.\u003c/p\u003e\n\u003cp\u003eShe drew her gun and pointed it at my head. I smiled. \"I knew you were the best friend I ever had.\"\u003c/p\u003e\n\u003cp\u003eDamien barreled out of the bathroom and shoved me behind him. My hero.\u003c/p\u003e\n\u003cp\u003e\"What the hell?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Get lost,\" Jessie snapped.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think I will. This is murder, Sheriff.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s none of your business, Fitzgerald. Get out of my way.\"\u003c/p\u003e\n\u003cp\u003e\"Jess.\" Will spoke for the first time. \"Maybe you should call in before you make any rash decisions.\"\u003c/p\u003e\n\u003cp\u003eIndecision flickered over her face.\u003c/p\u003e\n\u003cp\u003e\"You can always shoot her after she grows a tail,\" Damien murmured.\u003c/p\u003e\n\u003cp\u003eI kicked him in the leg. He ignored me.\u003c/p\u003e\n\u003cp\u003e\"You told him?\" Jessie demanded.\u003c/p\u003e\n\u003cp\u003eI shrugged and didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003e\"Jeez, Leigh, he\u0027s a civilian.\"\u003c/p\u003e\n\u003cp\u003e\"So was Cadotte, once upon a time.\"\u003c/p\u003e\n\u003cp\u003e\"Got you there,\" Will said.\u003c/p\u003e\n\u003cp\u003e\"Shut up.\"\u003c/p\u003e\n\u003cp\u003eJessie\u0027s answer to everything. She still pointed her gun at Damien. I didn\u0027t like it. She had silver in that gun. I tried to slide around him, but he shoved me right back.\u003c/p\u003e\n\u003cp\u003e\"Without her, he can\u0027t become the supreme alpha,\" Jessie argued. \"Wolves mate for life.\"\u003c/p\u003e\n\u003cp\u003e\"What does that have to do with anything?\" Damien asked.\u003c/p\u003e\n\u003cp\u003e\"Thought you knew it all.\"\u003c/p\u003e\n\u003cp\u003e\"I know werewolves exist. I haven\u0027t gotten the details on what you\u0027re up against.\"\u003c/p\u003e\n\u003cp\u003eWill filled him in as I fought a sudden craving for raw steak.\u003c/p\u003e\n\u003cp\u003e\"It seems to me,\" Damien murmured, \"that you have Hector at a disadvantage.\"\u003c/p\u003e\n\u003cp\u003e\"How so?\" Jessie asked.\u003c/p\u003e\n\u003cp\u003e\"Leigh can get close to him. He\u0027ll trust her.\"\u003c/p\u003e\n\u003cp\u003eJessie and Will both turned to me. \"He\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eJessie holstered her gun. \"I guess I can always shoot you later.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, look at the bright side.\" I pushed past Damien and moved farther into the room. \"Hector plans to use Damien for his sacrifice.\"\u003c/p\u003e\n\u003cp\u003eDamien frowned, blinked, then shrugged. \"Let him try.\"\u003c/p\u003e\n\u003cp\u003e\"You need to protect him, Jessie.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need anyone to protect me,\" Damien protested. \"I can take care of myself.\"\u003c/p\u003e\n\u003cp\u003eJessie ignored him. \"We could always shoot him before they kill him.\"\u003c/p\u003e\n\u003cp\u003e\"Would you quit with the shooting?\" I said. \"Sacrifice is sacrifice. He doesn\u0027t necessarily need Damien.\u003c/p\u003e\n\u003cp\u003eHe just wants him.\"\u003c/p\u003e\n\u003cp\u003e\"Because?\"\u003c/p\u003e\n\u003cp\u003e\"He touched me.\"\u003c/p\u003e\n\u003cp\u003eJessie glanced at Damien.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s worth it,\" he said.\u003c/p\u003e\n\u003cp\u003eHer gaze went shrewd, and she turned her attention to me with a lift of her brow.\u003c/p\u003e\n\u003cp\u003eI shook my head. I wasn\u0027t going to discuss my feelings for Damien. Not now. F\u0027robably not ever.\u003c/p\u003e\n\u003cp\u003e\"Hector told me you and Will wouldn\u0027t make it back from Cora\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"We almost didn\u0027t,\" Will muttered.\u003c/p\u003e\n\u003cp\u003e\"What happened?\"\u003c/p\u003e\n\u003cp\u003e\"My car is kind of like yours now.\"\u003c/p\u003e\n\u003cp\u003e\"They attacked.\"\u003c/p\u003e\n\u003cp\u003e\"When we were halfway between Cora\u0027s and home. Thankfully Jessie brought a lot of guns and even more ammo.\"\u003c/p\u003e\n\u003cp\u003eShe patted her Magnum. \"Pays to be prepared.\"\u003c/p\u003e\n\u003cp\u003e\"A regular Boy Scout,\" I agreed.\u003c/p\u003e\n\u003cp\u003e\"We left quite a few dead ones behind.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t burn them?\"\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t want to get out of the car. There were more waiting.\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Did you happen to see a crow?\"\u003c/p\u003e\n\u003cp\u003eWill frowned. \"It settled on the kills. Started pecking. Scavenger.\"\u003c/p\u003e\n\u003cp\u003e\"That was Hector.\"\u003c/p\u003e\n\u003cp\u003eJessie and Will exchanged glances.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d better tell us everything,\" he urged.\u003c/p\u003e\n\u003cp\u003eWhen I was through, Will murmured, \"Not good.\" He spread his hands. \"But hey, if this job were easy, everyone would do it.\"\u003c/p\u003e\n\u003cp\u003eThat startled a laugh out of me.\u003c/p\u003e\n\u003cp\u003e\"Mandenauer?\"\u003c/p\u003e\n\u003cp\u003eMy head whipped around. Jessie held the cell phone to her ear.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d better get to Crow Valley. Leigh\u0027s been bitten.\"\u003c/p\u003e\n\u003cp\u003eShe listened for an instant, then hung up.\u003c/p\u003e\n\u003cp\u003e\"Dammit, Jessie, you\u0027ll only upset him. What can he do?\"\u003c/p\u003e\n\u003cp\u003e\"I guess we\u0027re gonna find out. Because he\u0027s on his way, and he\u0027s bringing Dr. Hanover.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2/page-35.html","bookId":2089,"creation":"Oct 5, 2019 5:38:18 PM","modification":"Oct 5, 2019 5:38:18 PM"}
