{"id":89758,"no":40,"title":"Page 40","content":"\u003cp\u003eThe hunter\u0027s moon had set. The sun had risen. Elise had returned with the moon and more serum.\u003c/p\u003e\n\u003cp\u003e\"Just because the cure worked on Leigh before she changed doesn\u0027t mean it will work on Damien,\" she cautioned. \"It could very well kill him.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a chance I\u0027m willing to take,\" Damien said. \"Just do it.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said.\u003c/p\u003e\n\u003cp\u003eEveryone looked at me.\u003c/p\u003e\n\u003cp\u003e\"Leigh,\" Edward patted my back, still scared, thank you very much. No magic cure for me. \"Let Elise do her job. She has researched every cure ever written, every method even whispered. None work. This is the only way.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want him dead.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d rather he was furry?\" Jessie asked.\u003c/p\u003e\n\u003cp\u003e\"Damn straight. I seem to recall your saying you wouldn\u0027t have cared if Cadotte was a werewolf.\"\u003c/p\u003e\n\u003cp\u003eWill glanced at Jessie. \"You say the sweetest things,\" he murmured.\u003c/p\u003e\n\u003cp\u003e\"Shut up, Slick. I was out of my head at the time.\" She turned to me. \"Think about what you\u0027re saying, Leigh. That\u0027s no kind of life.\"\u003c/p\u003e\n\u003cp\u003eI moved closer to Damien, took his hand, held on when he would have pulled away. \"It\u0027s no kind of life without him.\" I tightened my fingers. \"Don\u0027t leave me. I need you.\"\u003c/p\u003e\n\u003cp\u003eHe sighed and closed his eyes. \"Leigh, I have to try.\"\u003c/p\u003e\n\u003cp\u003eI guess I had to let him.\u003c/p\u003e\n\u003cp\u003eElise, her hands covered with protective, plastic gloves - I guess I couldn\u0027t blame her for being cautious - stuck the needle into Damien\u0027s arm, then released the serum into his veins.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s supposed to happen?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I have no idea. Why don\u0027t you step outside and see how you feel.\"\u003c/p\u003e\n\u003cp\u003eElise had insisted on waiting until the moon was high in the sky before attempting the cure. That way we\u0027d know immediately if it had worked or not.\u003c/p\u003e\n\u003cp\u003eI followed Damien out of my apartment and down the steps to the ground. The tavern was deserted, all of Hector\u0027s werewolves fled to parts unknown. Crow Valley was awful deserted, too. It was amazing how many residents had been secretly fanged and furry.\u003c/p\u003e\n\u003cp\u003eDamien kissed my forehead, touched my cheek. \"I love you, too, you know.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" I whispered.\u003c/p\u003e\n\u003cp\u003eHe turned his face up to the moon and he changed.\u003c/p\u003e\n\u003cp\u003eHours later I waited alone. Elise had returned to Montana with Edward. She had a lot of work to do, since it appeared her cure only worked before the initial change of the just bitten. She seemed more upset about that than I would have thought.\u003c/p\u003e\n\u003cp\u003eEveryone had given me their advice. Elise wanted Damien to be her guinea pig. Edward had offered him a job. Having a werewolf as a werewolf hunter wasn\u0027t a bad idea. Jessie and Will agreed. They thought we should be a tag team J-S unit.\u003c/p\u003e\n\u003cp\u003eI\u0027d pretended to listen to them all while my eyes scanned the trees searching for Damien. Nothing mattered unless he came back.\u003c/p\u003e\n\u003cp\u003eThe door opened. I could smell him - woods, wind, water - the man I loved.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care what you are,\" I said. \"All I care about is who we can be together.\"\u003c/p\u003e\n\u003cp\u003e\"We can never be parents, Leigh.\"\u003c/p\u003e\n\u003cp\u003e\"Never is a long time. Give Elise a chance.\"\u003c/p\u003e\n\u003cp\u003e\"What if she can\u0027t find a cure? What if I\u0027m always a werewolf?\"\u003c/p\u003e\n\u003cp\u003e\"Wolves and werewolves do one thing right. They mate for life. We can, too.\"\u003c/p\u003e\n\u003cp\u003e\"Having a family, a home, that white picket fence - it was your dream.\"\u003c/p\u003e\n\u003cp\u003e\"Now you are.\"\u003c/p\u003e\n\u003cp\u003eI looked at him then, opened my palm, showed him the ring he\u0027d worn, the one I\u0027d taken and never given to anyone else,\u003c/p\u003e\n\u003cp\u003e\"Marry me?\" I asked. \"Be mine forever.\"\u003c/p\u003e\n\u003cp\u003eHe stared at the ring, then lifted his eyes to mine. \"Forever means something different to me. Like this I\u0027ll never die, Leigh. And you will.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d thought of that, and I didn\u0027t care. In fact, I was glad. He\u0027d be damn hard to kill - unlike everyone else I\u0027d ever loved.\u003c/p\u003e\n\u003cp\u003eBesides, I\u0027d learned something at last.\u003c/p\u003e\n\u003cp\u003e\"We need to live for now, because tomorrow everything, hell, everyone, could change. If I have a day, a month, a century, I want to spend it with you.\"\u003c/p\u003e\n\u003cp\u003eHe reached for the shiny circlet, lifted it to the waning silver night. I held my breath, half-afraid he\u0027d take the ring and leave me behind.\u003c/p\u003e\n\u003cp\u003e\"The werewolf and the werewolf hunter,\" he murmured, \"we\u0027re going to have quite an adventure.\"\u003c/p\u003e\n\u003cp\u003e\"I thought we already did.\"\u003c/p\u003e\n\u003cp\u003eDamien slipped his mother\u0027s ring onto my finger. \"This is only the beginning.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2/page-40.html","bookId":2089,"creation":"Oct 5, 2019 5:38:18 PM","modification":"Oct 5, 2019 5:38:18 PM"}
