{"id":99049,"no":2,"title":"Page 2","content":"\u003cp\u003eKnowing there was an all-clear on getting down did have its bennies, but Tanner didn’t look too into it.\u003c/p\u003e\n\u003cp\u003e“Kyler,” the blonde crooned in my ear as she wiggled her ass. “You don’t seem happy to see me. I’m happy to see you again.”\u003c/p\u003e\n\u003cp\u003eAnd apparently I wasn’t too into it, either. Taking a long drink, I knew I had to proceed with wise caution. Supposedly I knew this girl—like knew her, knew her—but I couldn’t place her face or her ass, which was all kinds of messed up. How could I not know her when I’d most definitely slept with her at some point?\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eSometimes I was sick with myself.\u003c/p\u003e\n\u003cp\u003eShe leaned in, pressing her breasts right up under my chin. Okay. I wasn’t that sick with myself. “Honey,” I said, fingering the bottle. “I’m going to need to breathe at some point.”\u003c/p\u003e\n\u003cp\u003eGiggling, she leaned back far enough that I could sneak another drink. She ran her hands through my hair, tugging it off my forehead. I fought the urge to knock her hands away. “You gonna play your guitar for me later?”\u003c/p\u003e\n\u003cp\u003eMy brows rose. “I played the guitar for you?”\u003c/p\u003e\n\u003cp\u003eTanner choked on a laugh.\u003c/p\u003e\n\u003cp\u003eThe girl—and damn, I hoped her friend said her name real soon—frowned. “Yes!” She smacked my chest playfully. “You played it with those awesome, talented fingers of yours, and then you played something else.”\u003c/p\u003e\n\u003cp\u003eOh.\u003c/p\u003e\n\u003cp\u003eTanner leaned back in his chair. “Look at you and your awesome fingers.”\u003c/p\u003e\n\u003cp\u003e“My awesome, talented fingers,” I corrected him.\u003c/p\u003e\n\u003cp\u003eShaking his head, he looked away as the brunette leaned over, tracing the edge of the tattoo that popped out from under his rolled-up sleeves.\u003c/p\u003e\n\u003cp\u003e“You don’t remember?” She stuck out a glossy lower lip. “My feelings are hurt.”\u003c/p\u003e\n\u003cp\u003eI snorted and took another drink, my eyes scanning the now-packed bar. Sometimes I had no idea how I ended up in situations like this. Okay. That was a bald-faced lie. What was between my legs was how I ended up in situations like this.\u003c/p\u003e\n\u003cp\u003eBut it was more than that.\u003c/p\u003e\n\u003cp\u003eIt had always been more than that.\u003c/p\u003e\n\u003cp\u003e“Kyler,” the girl whined.\u003c/p\u003e\n\u003cp\u003eI took a deep breath and turn back to her, giving the girl my most charming smile. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“You gonna share?”\u003c/p\u003e\n\u003cp\u003eBefore I could respond, she took the bottle from my hand and downed damn near close to the whole thing. My brows shot up. Damn. That was sort of impressive… and gross.\u003c/p\u003e\n\u003cp\u003eHer friend giggled. “Jesus, Mindy, take it slow tonight. I am so not carrying your drunk ass back to the dorm.”\u003c/p\u003e\n\u003cp\u003eAha! Her name was Mindy! I felt a little better about this.\u003c/p\u003e\n\u003cp\u003eMindy just shrugged as she turned back to me. She leaned in and when she spoke, all I could smell was beer. “You’re so incredibly sexy. Have you ever been told that?”\u003c/p\u003e\n\u003cp\u003e“A time or two,” I replied, wishing for another beer.\u003c/p\u003e\n\u003cp\u003eAndrea appeared at the table, two beers in hand. One was for her and the other for Tanner, so that sucked. She looked at me and huffed. “Like Kyler needs his ego stroked.”\u003c/p\u003e\n\u003cp\u003e“Kyler needs something else stroked,” Mindy murmured, pushing down with her hips.\u003c/p\u003e\n\u003cp\u003eA look of disgust crossed Andrea’s face as she sat on the other side of Tanner. The look didn’t bother me. Now if it were someone else? “Have you seen Syd?” I asked.\u003c/p\u003e\n\u003cp\u003eAndrea eyed me over the rim of her bottle, eyes narrowed. She didn’t say anything.\u003c/p\u003e\n\u003cp\u003eI sat back in the chair, sighing. “I invited her.”\u003c/p\u003e\n\u003cp\u003eTanner arched a brow. “You know damn well Syd’s in her dorm, packing for our trip. Actually, she’s probably repacking for our trip.”\u003c/p\u003e\n\u003cp\u003eA smile pulled at my lips. She probably was retentively going over what to bring.\u003c/p\u003e\n\u003cp\u003e“Who cares about her?” Mindy folded her arms, which made her breasts even bigger. Impossible. She looked at her friend. “I need another drink.”\u003c/p\u003e\n\u003cp\u003e“So do I,” I said, bouncing my knees so she’d get off. She didn’t take the hint. I sighed. “Since you drank mine, why don’t you go get us a refill?”\u003c/p\u003e\n\u003cp\u003eAnother pout graced Mindy’s lips. “Have you seen how packed the bar is? It will take forever.”\u003c/p\u003e\n\u003cp\u003e“You could always get up,” Andrea suggested.\u003c/p\u003e\n\u003cp\u003eI looked over my shoulder at the bar. The damn thing was packed. Shit. Half of the University appeared to be here.\u003c/p\u003e\n\u003cp\u003eMindy’s beer-soaked breath brushed my cheek. “You should go get us a drink, babe. I love Jell-O shooters.”\u003c/p\u003e\n\u003cp\u003e“I’m not your babe.” My gaze traveled over the people at the bar. Was that Paul? He didn’t come here regularly, only if Syd actually showed up here. Wait a sec… I leaned to the side to get a look around some huge dude. Was that Syd at the bar? With Paul?\u003c/p\u003e\n\u003cp\u003eA hand ended up in my hair again. “You were my babe a couple of weeks ago.”\u003c/p\u003e\n\u003cp\u003e“Interesting,” I murmured. The dude moved away, beers in hand, and holy shit, it was Syd. Her long, black hair was down and her feet were crossed at the ankles. She looked so damn tiny sitting there, I was surprised she’d even gotten served.\u003c/p\u003e\n\u003cp\u003eI was also surprised that she was at the bar, without me and with Paul.\u003c/p\u003e\n\u003cp\u003eWhat the fuck was wrong with this picture?\u003c/p\u003e\n\u003cp\u003eTurning back around, I pinned Andrea with a look. “When did she get here?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “Dunno.”\u003c/p\u003e\n\u003cp\u003eMy irritation spiked. “She shouldn’t be at the bar by herself.”\u003c/p\u003e\n\u003cp\u003eMindy said something, but I wasn’t listening. I had this wonderful selective hearing thing going on right now.\u003c/p\u003e\n\u003cp\u003eAndrea shared a look with Tanner, a look I ignored. Therefore, the look never happened. “She’s not by herself,” she said sweetly.\u003c/p\u003e\n\u003cp\u003e“That’s the point.” I gripped Mindy’s hips. An excited look crossed her pretty face. Too bad I was about to burst her horny bubble. Lifting her out of my lap, I deposited her on her feet. “I’ll be back.”\u003c/p\u003e\n\u003cp\u003eMindy’s jaw unhinged. “Kyler!”\u003c/p\u003e\n\u003cp\u003eI ignored her. I also ignored Andrea’s smirk and the eye roll Tanner gave me as I stood and pivoted around.\u003c/p\u003e\n\u003cp\u003eSyd really shouldn’t be at the bar by herself. Being with Paul didn’t count. She needed someone to look out for her, to keep an eye on things, because Syd…well, she had this naїveté about her that drew dickheads in by the masses.\u003c/p\u003e\n\u003cp\u003eDickheads like Paul and other guys like me who pretty much did nothing but get a girl on her back. But I was different, way different when it came to Sydney Bell. And it had been my job since I could remember to keep her out of trouble. Right now was no different than any other time.\u003c/p\u003e\n\u003cp\u003eYep, that was exactly the reason I was about to break up this little conversation.\u003c/p\u003e\n\u003cp\u003eChapter 2\u003c/p\u003e\n\u003cp\u003eSydney\u003c/p\u003e\n\u003cp\u003e“Hey,” Paul said, sliding into the spot Andrea had occupied. “I didn’t know you were coming out. You didn’t say anything in class today.”\u003c/p\u003e\n\u003cp\u003e“Last minute decision.” I took a sip of my rum and Coke. It was already watered down. “How was the final?”\u003c/p\u003e\n\u003cp\u003e“I think it went well. You?”\u003c/p\u003e\n\u003cp\u003eI shrugged. “I think I passed.”\u003c/p\u003e\n\u003cp\u003e“You probably aced the damn thing.” He stopped, ordering a Sam Adams when the bartender came around. “Are you all packed for the trip tomorrow?”\u003c/p\u003e\n\u003cp\u003eWe were leaving on our annual ski trip to Snowshoe Mountain tomorrow. This was Paul’s first time, but Kyler and I had been going up to his mom’s ski house since we were kids. This was Andrea’s and Tanner’s second year, and some of Kyler’s other friends would be there, too. We usually had a big group going.\u003c/p\u003e\n\u003cp\u003e“I was packed last weekend.” I giggled. “I’m anal like that.”\u003c/p\u003e\n\u003cp\u003eHis easy grin spread. “I still need to pack. By the way, thanks for inviting me. I’ve never been up to Snowshoe.”\u003c/p\u003e\n\u003cp\u003eSurprising since he’d grown up in the neighboring town, and I figured everyone who lived in Maryland had been to Snowshoe at some point. “No problem. You said you liked skiing and stuff, so it made sense. Kyler will be out on the slopes all day and night, so you’ll definitely have someone to ski with.”\u003c/p\u003e\n\u003cp\u003ePaul’s blue eyes drifted toward the table they sat at. “I don’t know about that.”\u003c/p\u003e\n\u003cp\u003eI frowned and totally refused to see what was happening at the table of sin and sex. They were probably making babies. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I don’t get the impression that Kyler’s a big fan of mine.” His gaze settled on me once more and he shrugged. “Anyway, you’re heading back home after you leave Snowshoe?”\u003c/p\u003e\n\u003cp\u003eI nodded. “Yep, doing Christmas with the family and staying there until spring semester starts back up. You?”\u003c/p\u003e\n\u003cp\u003e“I’ll be in Bethesda part of the time and then Winchester with my mom.” He scratched at the label on his bottle, his brows knit. “Parents divorced a few years back, so I go between houses.”\u003c/p\u003e\n\u003cp\u003eI hadn’t known that. “Sorry to hear that.”\u003c/p\u003e\n\u003cp\u003eA small smile appeared. “It’s no big deal. I still get to do the whole two Christmases thing, so I’m not complaining.”\u003c/p\u003e\n\u003cp\u003eTaking another quick sip, I placed my glass down. “Double the presents.”\u003c/p\u003e\n\u003cp\u003e“Double the fun.” His gaze fell to his beer. Half the label was gone. “Look. I thought we could do—”\u003c/p\u003e\n\u003cp\u003eStrong arms wrapped around my waist from behind. I was pulled off the stool, and my surprised shriek was cut off when my back hit an immoveable wall of muscle. I was enveloped in a bear hug that smelled of the outdoors and light cologne.\u003c/p\u003e\n\u003cp\u003eOnly one person in this world gave me hugs like this or felt that hard…that good.\u003c/p\u003e\n\u003cp\u003eKyler’s deep voice rumbled through my body. “When did you get here?”\u003c/p\u003e\n\u003cp\u003eMy feet still weren’t touching the floor. “A little bit ago,” I gasped out, gripping his forearms through his sweater.\u003c/p\u003e\n\u003cp\u003e“What the hell? Have you been hiding from me?”\u003c/p\u003e\n\u003cp\u003ePaul leaned back against the bar and grinned, but it was strained. Not that I could blame him. Kyler always kind of burst in and took over every situation. “I haven’t been hiding,” I told him, flushing when my eyes met Paul’s. “And can you put me down?”\u003c/p\u003e\n\u003cp\u003e“What if I don’t?” he teased. “You’re so little I could put you in my pocket.”\u003c/p\u003e\n\u003cp\u003e“What?” I laughed. “Put me down, you idiot. I was having a conversation.”\u003c/p\u003e\n\u003cp\u003e“Sorry, Paul, I’m stealing her.” Kyler wasn’t sorry at all. He backed away, giving me no choice, because there was no way I was breaking his hold. He turned, dropping into a chair nowhere near the table he’d been at and pulling me into his lap so I was sitting sideways. He looped his arms around my waist. “I’m not happy with you, Syd.”\u003c/p\u003e\n\u003cp\u003eI arched a brow as my heart rate picked up. He was the only person who called me Syd—well, the only person I let call me that without kicking them in the shin. “Really? Over what?”\u003c/p\u003e\n\u003cp\u003e“You’re talking to that douche.”\u003c/p\u003e\n\u003cp\u003e“What douche?”\u003c/p\u003e\n\u003cp\u003eHe leaned in, resting his forehead against mine, and my breath stalled in my chest. Why must he always get so damn close? And he really, truly, always did. “Paul.”\u003c/p\u003e\n\u003cp\u003e“What about him?” I put my hands on his shoulders to push back, but his arms tightened, holding me in place. “Are you drunk?” \u003c/p\u003e","sourceLink":"https://allnovel.net/frigid-frigid-1/page-2.html","bookId":2005,"creation":"Oct 5, 2019 6:39:39 PM","modification":"Oct 5, 2019 6:39:39 PM"}
