{"id":99070,"no":23,"title":"Page 23","content":"\u003cp\u003e“You don’t feel ‘okay.’” I wiggled my behind, and he groaned. A smile pulled at my lips. “See?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I see and I feel.”\u003c/p\u003e\n\u003cp\u003eI tipped my head back so I could see him and I bit down on my lip, hoping my next question wouldn’t sound incredibly lame. “Don’t you want to?”\u003c/p\u003e\n\u003cp\u003e“Don’t I want to?” Disbelief colored his voice. A hand fell to my waist as he pushed his hips forward, grinding against my rear in a way that had me aching all over again. “I want nothing more than to get inside of you and stay there.”\u003c/p\u003e\n\u003cp\u003eA shudder worked its way down my spine. “Then why aren’t you?”\u003c/p\u003e\n\u003cp\u003eHe smoothed my hair off my cheek, tucking it back behind my ear. “I wanted to do that for you and I…well, I usually don’t do that with other girls.”\u003c/p\u003e\n\u003cp\u003eMy stomach soured at the mention of other girls, but I ignored it. “Are you blushing?”\u003c/p\u003e\n\u003cp\u003e“No,” he huffed. “I don’t blush.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh, must be the shadows, then.” I folded my arms across my chest. “So you don’t do that? Because it felt like you really had a lot of experience with that.”\u003c/p\u003e\n\u003cp\u003eHe laughed again as he sat up, reaching for a blanket. He pulled it over us, tucking it around me. “I didn’t say I never did it.”\u003c/p\u003e\n\u003cp\u003eI considered that. There were a few girls over the years that he had hung out with for a while. I could imagine that he must’ve done that for them, but that still didn’t answer why he hadn’t gone further with me. I wished my brain would shut up because it was really starting to get on my nerves.\u003c/p\u003e\n\u003cp\u003eKyler’s hand slid around my waist. “I want to, Syd. I really do. So don’t start filling your head up with bullshit. I just wanted to do that for you.” He paused, pressing his lips against my cheek. “And there’s the fact that the condoms are upstairs and walking is going to be difficult for me right now.”\u003c/p\u003e\n\u003cp\u003eI giggled, unable to help myself. “I’m on the pill.”\u003c/p\u003e\n\u003cp\u003eHe groaned. “You’re so not helping.”\u003c/p\u003e\n\u003cp\u003e“You always use condoms, right? Please tell me you’ve used condoms.”\u003c/p\u003e\n\u003cp\u003e“I’ve never not used a condom.”\u003c/p\u003e\n\u003cp\u003eRelief washed over me. “So…”\u003c/p\u003e\n\u003cp\u003e“Syd, baby, you are killing me.”\u003c/p\u003e\n\u003cp\u003eI grinned as I rolled onto my back. “There’re other things I can do, you know. I’ve done other stuff.”\u003c/p\u003e\n\u003cp\u003eHis chest rose sharply and he stilled. “You don’t owe it to me, Syd. That’s not why I did that.”\u003c/p\u003e\n\u003cp\u003eI thought about the few times I’d given head or hand jobs. All of them had been with Nate throughout those years in high school and whatnot. I’d done it because I’d felt like I had to or Nate would’ve moved on. Such a stupid thing to worry about, and I honestly would’ve been better off if he had, but all that was beside the point. I wasn’t sure if I’d do it as well as everyone else, but it wasn’t because I owed Kyler.\u003c/p\u003e\n\u003cp\u003eWiggling onto my side, I tipped my head back and met his gaze. The blanket slipped past my shoulders, but I barely even noticed. “I want to do it. Not because I feel like I need to, but because I want to.”\u003c/p\u003e\n\u003cp\u003eA muscle ticked in his jaw as he lifted himself up on one arm, and I thought he might run away. Taking a deep breath and mustering up my courage before I lost it, I placed my hand between his legs and cupped him. His entire body jerked as if he’d been shocked. I forced my eyes up, meeting his. “Are you going to tell me no?”\u003c/p\u003e\n\u003cp\u003eHis eyes looked almost black, and what felt like forever passed before he reached down, placing his hand over mine. He didn’t say anything, but he rocked his hips forward, pressing himself into my hand.\u003c/p\u003e\n\u003cp\u003eThat was answer enough for me.\u003c/p\u003e\n\u003cp\u003eChapter 15\u003c/p\u003e\n\u003cp\u003eKyler\u003c/p\u003e\n\u003cp\u003eHonest to God, this hadn’t been my intention when I started this. Hell, I wasn’t sure I even knew what I was starting when I’d kissed her, except that I wanted to and I wanted her to stop crying, to understand that she deserved so much more than what she’d been asking for.\u003c/p\u003e\n\u003cp\u003eBut now?\u003c/p\u003e\n\u003cp\u003eYeah, all thoughts of pleasing her, and then going to sleep—albeit uncomfortably—jumped right out the window the second she gripped me in her small hand. Even with my hand over hers, I knew I shouldn’t let her do this. I’d lost count of how many times I’d gotten a hand job and it seemed to go against nature to refuse one, but Syd…?\u003c/p\u003e\n\u003cp\u003eIt was like my wildest fantasies coming true all over again, and with her taste still lingering in my mouth, I’d never been harder in my life. No one, no girl I’d ever known, compared to how she felt around my finger and against my mouth.\u003c/p\u003e\n\u003cp\u003eBut this was Sydney, beautiful-as-fuck Syd.\u003c/p\u003e\n\u003cp\u003eShe peered up at me through those dark lashes and, aw hell, I was always a sucker for those big blue eyes of hers. A small, tentative grin appeared on her swollen lips. “I’ll take that as a yes?”\u003c/p\u003e\n\u003cp\u003eThe eagerness in her gaze was my undoing, and my self-control broke faster than an egg hitting the floor.\u003c/p\u003e\n\u003cp\u003eProbably made me the biggest asshole in the country, but fuck the whole gentlemanly thing. I was seconds away from coming already and I still had my sweats on. How awkward would that be?\u003c/p\u003e\n\u003cp\u003eI removed my hand from hers. “Take it however you want, baby.”\u003c/p\u003e\n\u003cp\u003eHer grin spread into a smile that was so bright it was almost too hard to look at. Pressure clamped down on my chest, unexpected and intense. I moved to stop her, but then her hand slid down the length of me and…and yeah, she had me. I was all hers.\u003c/p\u003e\n\u003cp\u003eIn reality, even though I’d been with everyone else, I’d always been Syd’s.\u003c/p\u003e\n\u003cp\u003ePutting my weight on my shoulders, I lifted up so she could tug off my sweats. I figured she’d hesitate with the boxers, so I wasn’t surprised when she stopped, her fingers wrapped around the band.\u003c/p\u003e\n\u003cp\u003eShe glanced up, brows raised. “Christmas elves?”\u003c/p\u003e\n\u003cp\u003eI gave a lopsided shrug. “I’m sticking with a theme.”\u003c/p\u003e\n\u003cp\u003e“I can tell.” She bit down on that damn lip, and that made me want to kiss her again, but then she pulled my boxers down carefully, freeing me, and the air punched out of my lungs. She didn’t stop until they joined my sweats, and then she sat up, the blanket pooling around her waist.\u003c/p\u003e\n\u003cp\u003eDamn.\u003c/p\u003e\n\u003cp\u003eStaring at her, my entire body twitched. Damn it, she was sexy as hell with her dark hair tumbling over her shoulders, partially obscuring her breasts. Whoever said men were visual creatures was totally on point with that.\u003c/p\u003e\n\u003cp\u003eReaching up, I brushed the heavy locks over her shoulder, baring one of her perky breasts. She stilled, looking incredibly adorable as she squirmed. I could watch her forever and a day.\u003c/p\u003e\n\u003cp\u003eShe ducked her head and her hair fell back on her shoulder as she wrapped her fingers around my base and holy shit. My back bowed as her hand slowly slid up and then back down. I squeezed my eyes shut because I knew if I kept staring at her I’d lose it in seconds.\u003c/p\u003e\n\u003cp\u003eNot that I was far away from doing so anyway.\u003c/p\u003e\n\u003cp\u003eHer hand moved in slow, determined strokes, the movements a little clumsy, but there was something even sexier about that. She was unsure of herself, but that hadn’t stopped her. Nothing stopped Sydney, and I bet if I opened my eyes, that little jaw of hers would be set in concentration.\u003c/p\u003e\n\u003cp\u003eI had to see, and damn if I wasn’t right. My entire body tightened as her grip became more confident and faster. “Uh, baby, I’m not…”\u003c/p\u003e\n\u003cp\u003eShe looked up, her lips slightly parted and cheeks flushed. Her chest moved rapidly, and pleasure built at the top of my spine, about to power down. “Am I—”\u003c/p\u003e\n\u003cp\u003e“You’re fucking perfect—too perfect.”\u003c/p\u003e\n\u003cp\u003eShe smiled again, and I had to close my damn eyes again, because if I fell into her eyes, I’d never resurface. Her hand slowed at the top, her thumb crested the head, and I groaned as my legs stiffened. I wasn’t—\u003c/p\u003e\n\u003cp\u003eHoly hell!\u003c/p\u003e\n\u003cp\u003eThe hot, wet warmth of her mouth closed around me and that sent me right over the edge. My back jackknifed. I tried to pull her away, but she was latched onto me and not going anywhere. I kicked my head back, my fingers clenching in her hair. The explosion rolled down my spine and there was no stopping it. The release shook me from the inside, and she stayed there, her mouth and hand working until I stopped pulsing. I was utterly destroyed in a way I’d never been before—that amazing, perfect kind of way.\u003c/p\u003e\n\u003cp\u003eBreathing raggedly, I gripped her by her upper arms. I pulled her up over me, laying her across my chest. Our legs tangled, and her weight was nothing on me, but I felt her in every bone.\u003c/p\u003e\n\u003cp\u003eAn unexpected tremor got me as she rested her cheek just above my heart. I wrapped my arms around her, holding her close. I knew she’d get cold soon, but I was too much of a selfish bastard to let her go long enough to find that damn blanket.\u003c/p\u003e\n\u003cp\u003eFeeling her softness all around me, I held her until my heart slowed, until I could open my eyes again, and that felt like forever.\u003c/p\u003e\n\u003cp\u003eA languid peace invaded my body, but I didn’t fall asleep easily. There was a part of me that didn’t want to fall asleep, because I didn’t want to miss a second of her soft breaths. She’d passed out atop me and, with a smile pulling at my lips, I placed her on her side and nestled her against my chest with the covers pulled snug over us. The fire would last until the morning, but a chill had already seeped into the room.\u003c/p\u003e\n\u003cp\u003eI’d never slept with a girl before, like, shared the same bed or even the same blanket after sex. The other girls usually left, and if they fell asleep afterward, I’d slept wherever they weren’t. Syd had always been the only female that I’d ever spent an entire night with, so I wasn’t surprised that it didn’t feel weird to do so now, even though everything was different between us.\u003c/p\u003e\n\u003cp\u003eStarting with the fact she was curled up against me—completely, beautifully naked. Her bare back rested against my chest and the fantastic curve of her ass pressed against me. I hadn’t put any clothes back on, so I was hard. Actually, I don’t think I’d lost the hard-on.\u003c/p\u003e\n\u003cp\u003eI was propped up on my elbow, cheek against my fist. I’d been like that for at least an hour, watching her. She had the thickest lashes I’d ever seen. Not the cosmetically enhanced kind that were clumpy or spidery. They fanned the tops of her cheeks—cheeks lightly dusted with pale freckles. Her lips were slightly parted and plump. Swollen from my kisses. A surge of male pride came over me, and I leaned down, pressing a kiss to her temple.\u003c/p\u003e\n\u003cp\u003eSyd murmured something and shifted. My hand stilled against her stomach. I’d been tracing circles around her belly button, but every time she’d move that sweet ass, it antagonized what hung between my legs.\u003c/p\u003e\n\u003cp\u003eShe settled down pretty quickly, not waking at all.\u003c/p\u003e\n\u003cp\u003eMy gaze traveled over her face. There was no need to commit each delicate, beautifully-crafted line to memory, because I already had ages ago.\u003c/p\u003e\n\u003cp\u003eThe blanket had slipped off her shoulder, and I pulled it back up. In her sleep, a smile graced her lips, and my chest tightened.\u003c/p\u003e\n\u003cp\u003eSighing, I stretched out beside her and tightened my hold, repositioning Syd so her head fit under mine. Didn’t take long to drift off to sleep. I might’ve only slept a couple of hours before a noise woke me, but it was the best damn sleep I ever had.\u003c/p\u003e\n\u003cp\u003eMy eyes snapped open. Pale gray light slipped in through the gap in the curtains, and the fire was almost out. Immediately on guard, I held my breath as I listened. The noise came again—a deep howling of wind. I released my breath slowly. I hated being jumpy as fuck, but after everything that had happened, I would rather be paranoid. \u003c/p\u003e","sourceLink":"https://allnovel.net/frigid-frigid-1/page-23.html","bookId":2005,"creation":"Oct 5, 2019 6:39:39 PM","modification":"Oct 5, 2019 6:39:39 PM"}
