{"id":99056,"no":9,"title":"Page 9","content":"\u003cp\u003e“You’re standing by yourself talking about tits?” Kyler asked from behind me.\u003c/p\u003e\n\u003cp\u003eI gave a little shriek and spun around. “God…”\u003c/p\u003e\n\u003cp\u003eA sexy half-grin appeared. “I need to keep a better eye on you, if that’s what you talk about when you’re alone.”\u003c/p\u003e\n\u003cp\u003eCould I just crawl under a bar stool and die? “It’s Andrea.”\u003c/p\u003e\n\u003cp\u003eHe cocked his head to the side. “You’re talking about Andrea’s tits?”\u003c/p\u003e\n\u003cp\u003e“No. My tits.”\u003c/p\u003e\n\u003cp\u003eInterest flared in his eyes, darkening the hue. “Well, this keeps getting better.”\u003c/p\u003e\n\u003cp\u003eI clamped my mouth shut, wanting to physically hurt myself. “No—never mind. I have to go.”\u003c/p\u003e\n\u003cp\u003e“Go where?” He caught my arm as I brushed past him, bringing me to an unexpected stop. In the cramped hallway, our thighs brushed. He lowered his head, eyes narrowing. A slow grin split his lips. “You’re drunk.”\u003c/p\u003e\n\u003cp\u003e“I am only a little tipsy.” I tried to pull my arm free, but he held on. “I have to get back to Zach. We were dancing. And he said I was incredibly hot, so I would like to dance with him more.”\u003c/p\u003e\n\u003cp\u003e“Come again?” he said, eyes widening.\u003c/p\u003e\n\u003cp\u003e“He said I was hot.” I stared up at him. “What? Does that sound so hard to believe?”\u003c/p\u003e\n\u003cp\u003eWith his free hand, Kyler reached over and tugged my sweater down past my waistline. I squirmed further away. “I’m not saying that. Sasha knows him. Said he’s a creep and I have to agree.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I started laughing. “Does Sasha know him? How?”\u003c/p\u003e\n\u003cp\u003eKyler frowned. “Because Sasha is from here and yes, they used to date or something, Syd. I told you I knew her.”\u003c/p\u003e\n\u003cp\u003e“I bet you know her, know her.”\u003c/p\u003e\n\u003cp\u003eHis lips pursed and he didn’t respond for a few seconds. “Not like that, Syd. Sasha and I aren’t like that.”\u003c/p\u003e\n\u003cp\u003eHe hadn’t had sex with Sasha? Wow, we must be the last two women on the face of the Earth. “Well, you should get back to Sasha. I will get back to the creep.”\u003c/p\u003e\n\u003cp\u003eHe sighed and tipped his head back. With his hair falling back from his face like that, he looked like an angel staring up at the heavens.\u003c/p\u003e\n\u003cp\u003eAll right. Quite possibly I was really drunk.\u003c/p\u003e\n\u003cp\u003e“Why don’t you come over and sit with me?” He tugged me closer, and for a moment I stopped trying getting away. My thighs bounced off his legs, and I was staring at his chest again. Unfortunately, he was wearing his hoodie.\u003c/p\u003e\n\u003cp\u003eI leaned in, pressing my cheek against his chest. He smelled amazing. I closed my eyes and breathed him in.\u003c/p\u003e\n\u003cp\u003eKyler chuckled softly. “How much did you drink, baby?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I mumbled. “A couple.”\u003c/p\u003e\n\u003cp\u003eHe let go of my arm and dropped his over my shoulders. “What were you taking shots of?”\u003c/p\u003e\n\u003cp\u003e“Tequila.” I sighed.\u003c/p\u003e\n\u003cp\u003eHe let out a surprised laugh. “Ta-kill-ya? Oh, shit.”\u003c/p\u003e\n\u003cp\u003eI giggled. “It’s not that bad. Kind of burned, but ya know, now I don’t feel anything at all.”\u003c/p\u003e\n\u003cp\u003eKyler laughed again. “I bet you don’t.”\u003c/p\u003e\n\u003cp\u003e“Mmm…”\u003c/p\u003e\n\u003cp\u003eHe got a hand between his chest and my face, placing his fingers on the tip of my chin. He lifted my head up. “Are you going to come back and sit with Sasha and me?”\u003c/p\u003e\n\u003cp\u003eI jerked away and stumbled back a step. He had me right up until the whole “Sasha and me” bit. Disappointment seeped in, threatening to kill my buzz. I knew I shouldn’t feel bad—or feel anything at all—but I did.\u003c/p\u003e\n\u003cp\u003e“I’m going to dance some more. See ya.”\u003c/p\u003e\n\u003cp\u003eKyler’s atrocity of curse words were lost in the pounding of my heart. As soon as I exited the hallway, Zach was there, grabbing my hand. “I thought you’d gotten lost.”\u003c/p\u003e\n\u003cp\u003e“Nah,” I said, letting him pull me toward the dance floor. “I was—”\u003c/p\u003e\n\u003cp\u003eAn arm snaked around my waist, pulling me to a stop. For the first time in my life I was literally stuck between two boys. Huh. And here I thought it would be more fun than this.\u003c/p\u003e\n\u003cp\u003e“Hey now.” Kyler’s breath stirred the hair around my temple. “Where do you think you’re going?”\u003c/p\u003e\n\u003cp\u003eGood question.\u003c/p\u003e\n\u003cp\u003eZach turned around, frowning when he saw Kyler. “And I was having such a good night. What do you think you’re doing?”\u003c/p\u003e\n\u003cp\u003e“It’s not really any of your business.” Kyler’s arm tightened around my waist.\u003c/p\u003e\n\u003cp\u003eOh dear…\u003c/p\u003e\n\u003cp\u003eZach’s grip was firm. “Well, nice to see you again, but we’re about to go dancing.”\u003c/p\u003e\n\u003cp\u003e“I think she needs to sit down.” Kyler stepped around, so that he partially blocked me. “All right?”\u003c/p\u003e\n\u003cp\u003eIndignation rose. “I don’t need to sit down.”\u003c/p\u003e\n\u003cp\u003e“Well, you heard your friend,” Zach replied, tugging me forward. “She doesn’t want to sit down, so I think you should just let her do what she wants.”\u003c/p\u003e\n\u003cp\u003eKyler laughed—a cold, nasty laugh that warned trouble as he caught my other arm, holding me in place. “Yeah, I don’t give a fuck what you think, and I’m sure you already know that, but I can tell you right now, what’s on your mind is not going to happen.”\u003c/p\u003e\n\u003cp\u003eWhoa. This was weird. For two people who barely knew each other, there was a lot of hostility here.\u003c/p\u003e\n\u003cp\u003e“Excuse me?” Zach said, eyes narrowing.\u003c/p\u003e\n\u003cp\u003e“Yeah, you heard me just right.”\u003c/p\u003e\n\u003cp\u003eI don’t know what happened next. Zach’s grip on my hand tightened, and I yelped out of surprise. The next thing I knew, Kyler had let go of my arm and his hands had slammed into Zack’s chest, knocking him back several steps.\u003c/p\u003e\n\u003cp\u003e“You don’t touch her,” Kyler growled. “You get that? Not now. Not ever.”\u003c/p\u003e\n\u003cp\u003eI was pretty positive Kyler was overreacting.\u003c/p\u003e\n\u003cp\u003e“You don’t know who the fuck you’re dealing with,” Zach warned, taking a step forward.\u003c/p\u003e\n\u003cp\u003e“He’s a ski instructor,” I felt the need to explain. Yep. Fountain of helpful knowledge right here.\u003c/p\u003e\n\u003cp\u003eKyler got right up in Zach’s face. Well, he was much taller, so he pretty much looked down his nose at the dude. “I know exactly who I’m fucking with, buddy.”\u003c/p\u003e\n\u003cp\u003e“Is that so?” Zach started forward, but Kyler was too fast. He caught the ski instructor by the shoulder and pushed him back into the paneled wall. The checkered dartboard rattled around the nail it hung from.\u003c/p\u003e\n\u003cp\u003e“Better think again,” Kyler said. “I have no problem with wiping the floor with your face.”\u003c/p\u003e\n\u003cp\u003eI tugged on the back of his sweater. “Kyler, come on. Let’s go.”\u003c/p\u003e\n\u003cp\u003eKyler ignored me.\u003c/p\u003e\n\u003cp\u003e“You think you little rich fucks can come up here and push people around? Yeah, not happening.” Zach’s eyes flicked over Kyler’s shoulder. “That goes for little cock-teases, too. Seems like your taste in females is the same.”\u003c/p\u003e\n\u003cp\u003e“What?” Now pissed off for a whole different reason, I tried to get around Kyler. “I am not a cock-tease, you ass-hat.”\u003c/p\u003e\n\u003cp\u003e“Whatever.” Zach shrugged off Kyler’s hand and edged around him, about to tuck tail and run, but not before he threw out a, “You two have a great time up here.”\u003c/p\u003e\n\u003cp\u003eKyler looked like he was about to follow him across the bar, but the unfriendly faces that had started paying attention—probably locals—had him thinking otherwise. “God, where do you find these creeps, Syd?”\u003c/p\u003e\n\u003cp\u003e“Hey!” I smacked his back. “He wasn’t a creep until you got involved.”\u003c/p\u003e\n\u003cp\u003e“Whatever. You don’t know him.” He reached down and took my hand. The weight felt different and about a thousand other things I couldn’t figure out. “Come on. Let’s go back to the house.”\u003c/p\u003e\n\u003cp\u003eHis tone carried no room for arguing. Stopping by the table, he said his goodbyes to a pouty Sexy Sasha and then we headed to the door. A whole group of big dudes were doing the evil-glare-thing from the corner, Zach among them, but Kyler didn’t notice. And the evil-glare-thing from a group of big dudes born and raised in West “by golly” Virginia could be a pretty frightful thing. Brought up images of long and dark backwoods and graves in hastily covered ditches.\u003c/p\u003e\n\u003cp\u003eShuddering, I realized I was freaking myself out.\u003c/p\u003e\n\u003cp\u003eAs soon as we stepped outside, harsh wind smacked me in the face. I gasped. “Holy crap, it’s cold as balls out here!”\u003c/p\u003e\n\u003cp\u003e“Balls are not cold, Syd. Trust me,” said Kyler. “Didn’t I say you should wear a coat?”\u003c/p\u003e\n\u003cp\u003e“Bah!” I pulled free and started stomping through the fresh snow that had fallen since we’d gone in. It was only a couple of inches, but I was kicking it up everywhere. “We should have driven down here.”\u003c/p\u003e\n\u003cp\u003e“You wanted to walk.” He pulled his hoodie over his head and off. “Here—put this on.”\u003c/p\u003e\n\u003cp\u003eI shook my head and started down the hill, but Kyler sighed as he stepped in front of me, his jaw set in a determined line. “Lift your arms.”\u003c/p\u003e\n\u003cp\u003e“What if I say no?”\u003c/p\u003e\n\u003cp\u003eHis lips twitched as he held his hoodie out. “I’ll hold you down and dress you.”\u003c/p\u003e\n\u003cp\u003eThat kind of sounded like it would be fun. Actually, Kyler holding me down and undressing me sounded even better. I sighed, completely lost in the fantasy. We could be like snow bunnies getting it on.\u003c/p\u003e\n\u003cp\u003eKyler stepped closer, tipping his chin down. “What are you thinking about?”\u003c/p\u003e\n\u003cp\u003e“Snow bunnies,” I replied.\u003c/p\u003e\n\u003cp\u003eHe let out a deep laugh. “Come on, lift your arms and tell me why you drank so much. Please?”\u003c/p\u003e\n\u003cp\u003e“Since you said please…” I lifted my arms and felt him step forward. He slipped the opening over my head and then moved onto the arms. “I just wanted to have fun.”\u003c/p\u003e\n\u003cp\u003e“Nothing wrong with that.” He got my left arm into the sleeve and then he started working on the right arm, his brows furrowed in concentration. “But you’ve had fun before without drinking so much.”\u003c/p\u003e\n\u003cp\u003e“So?” I balled my fist, and he sighed, trying to work the sleeve around it. I giggled as I straightened out my hand. “What’s the big deal?”\u003c/p\u003e\n\u003cp\u003e“There isn’t one.” He tugged the hoodie down and it swamped me, ending just above my knees. “There you go.”\u003c/p\u003e\n\u003cp\u003eWhen I looked up, he’d stepped back and he had this strange look on his face—like approval. “Aren’t you cold?” I asked.\u003c/p\u003e\n\u003cp\u003eHe shrugged, stretching the material of the black thermal he’d had on under the hoodie. “I’ll be fine.”\u003c/p\u003e\n\u003cp\u003eI opened my mouth to say okay, but something totally different came out. “I don’t want to be boring anymore.”\u003c/p\u003e\n\u003cp\u003e“What? Shit.” Kyler thrust his fingers through his hair. “Baby, you’re not boring.”\u003c/p\u003e\n\u003cp\u003e“Yes. I am.”\u003c/p\u003e\n\u003cp\u003eHis eyes pinched at the corners. “Sydney, you are so far from that. I shouldn’t have said that shit in the car. You’re perfect—”\u003c/p\u003e\n\u003cp\u003e“Just the way I am?” I finished for him. “Isn’t that from Bridget Jones?”\u003c/p\u003e\n\u003cp\u003e“Maybe.” One side of his lips tipped up.\u003c/p\u003e\n\u003cp\u003e“You are such a vagina.”\u003c/p\u003e\n\u003cp\u003eKyler nudged me. “But seriously, Syd—”\u003c/p\u003e\n\u003cp\u003e“I don’t want to talk.” I was suddenly about a million times uncomfortable. Walking again, I heard him keep pace with me a few steps behind. “Talk. Talk. Talk,” I muttered. \u003c/p\u003e","sourceLink":"https://allnovel.net/frigid-frigid-1/page-9.html","bookId":2005,"creation":"Oct 5, 2019 6:39:39 PM","modification":"Oct 5, 2019 6:39:39 PM"}
