{"id":99357,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMab cleared her throat.\u003c/p\u003e\n\u003cp\u003e“Well, not all the time in the world,” Dad amended, “but enough. To make a start, anyway.” Dad fell silent as a couple of young mothers pushed strollers toward us. They stopped, staring at the falcon—he was an unusual sight, even when he wasn’t talking—and changed their course, hurrying off in the other direction.\u003c/p\u003e\n\u003cp\u003eWhen they were out of earshot, Dad said, “Anne, let’s find a place where we can speak without gawkers. I know a quiet corner.” The falcon launched into the sky, circled once, then landed again. “Will you follow me?” he asked.\u003c/p\u003e\n\u003cp\u003eMom brushed the rose petals with her fingers. “Of course I will.”\u003c/p\u003e\n\u003cp\u003eDad let out a very falcon-like squawk and took off again. Watching the sky, Mom set out across the park. She walked quickly, stumbling here and there on the uneven ground. But she never took her eyes off the falcon that flew before her.\u003c/p\u003e\n\u003cp\u003eMab still sat on the bench. I plopped down beside her, feeling like a tangled heap of limp noodles. “That was exhausting,” I said. “But I think it went well, don’t you?”\u003c/p\u003e\n\u003cp\u003e“I do. Anne is in a bit of shock, as may be expected. I felt the same when the falcon first spoke to me. She’s probably wondering when she’ll wake up.” She smiled her thin smile. “Becoming reacquainted may well be more difficult than either of them anticipates, but I do believe they’ll work out their differences.”\u003c/p\u003e\n\u003cp\u003eAn inactive shapeshifter who’d been widowed ten years ago, and her long-dead husband in the form of a man-falcon hybrid. Yeah, those were some differences to work out. But I agreed with Mab. If anyone could overcome differences like that, it was my parents.\u003c/p\u003e\n\u003cp\u003eThe warm glow of that thought snuffed out as I wondered again about the differences that stood between Kane and me. I shoved the thought aside. I couldn’t figure out the answer by myself, and anyway I was too tired to try.\u003c/p\u003e\n\u003cp\u003eThe warm May sunshine played over my skin, making me drowsy. “Do you mind if I stretch out on the grass and take a nap?” I asked. “It’s past my bedtime.” Not that I had a normal bedtime, although like most of Deadtown I was up at night and slept during the day.\u003c/p\u003e\n\u003cp\u003e“Of course, milady. You sleep. I’ll watch over you.”\u003c/p\u003e\n\u003cp\u003eHad she called me lady again? Maybe I’d misheard her. I suddenly felt too sleepy to worry about it. The grass was soft and fragrant with new growth. I took off my jacket—the day was warm enough that I didn’t need it—and rolled it up to use as a pillow. I lay on my back, an arm thrown over my eyes. It was good to feel the solid earth support my body, to let the stress drain from my limbs. To let go of the tension that propelled me through my days and nights. To know Mab was here, watching over me. Sleep crept into the edges of my consciousness, and I let it take me.\u003c/p\u003e\n\u003cp\u003e“AUNT VICKY? IS THAT YOU?”\u003c/p\u003e\n\u003cp\u003eA girl’s voice snatched away the warm blanket of sleep. I blinked and sat up, looking around.\u003c/p\u003e\n\u003cp\u003eMaria straddled her bicycle on a path about ten feet from where I’d been lying. Her blue eyes squinted at me from under her pink bike helmet.\u003c/p\u003e\n\u003cp\u003e“It is you!” She took off her helmet and shook out her long blonde hair. “What are you doing here? Are you coming over to our house? Where’s Grandma?”\u003c/p\u003e\n\u003cp\u003eI shaded my eyes with my hand. “Shouldn’t you be in school?”\u003c/p\u003e\n\u003cp\u003eShe shook her head and rolled her eyes simultaneously. I wondered if the maneuver took practice. “It’s Saturday.”\u003c/p\u003e\n\u003cp\u003e“Is it? Guess I lost track.” One of the hazards of having a job with no regular hours. I stood, brushing grass from my jeans. I retrieved my wrinkled jacket and shook it out.\u003c/p\u003e\n\u003cp\u003e“Why are you sleeping in the park?”\u003c/p\u003e\n\u003cp\u003e“Because I was tired.” That earned me another eye roll. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“Looking for Grandma. It was weird this morning. She was talking on the phone, and then she said she had to go to the park. I wanted to come with her, but she wouldn’t let me. She said, ‘Maybe later.’ I figured it was later.” Maria got off her bike and wheeled it over the grass. Suddenly she stopped, looking past me. “Do I know you?”\u003c/p\u003e\n\u003cp\u003eMy heart nearly quit beating. Mab, sitting on the bench. In my disorientation, I’d forgotten she was there.\u003c/p\u003e\n\u003cp\u003e“Hello, Maria. I’m Aunt Mab.”\u003c/p\u003e\n\u003cp\u003e“I thought so!” Maria dropped her bike and stood there, her eyes going from Mab to me and back again to Mab. “I recognize you from my dream.”\u003c/p\u003e\n\u003cp\u003eOnce, Maria had allowed Mab to pass through her dreamscape and into Boston. Doing so had saved my life. But since then Gwen had told Mab to stay away from her daughter. Other than that single encounter, Maria didn’t know Mab at all.\u003c/p\u003e\n\u003cp\u003e“I’m very pleased to meet you in person at last,” Mab said, extending her hand.\u003c/p\u003e\n\u003cp\u003eMaria glanced at me. Then she stepped forward and took Mab’s hand, standing very straight as she pumped it up and down. “Pleased to meet you, too,” she said in her best grown-up voice. She let go, and her forehead wrinkled. “Why doesn’t Mom want me to talk to you?”\u003c/p\u003e\n\u003cp\u003eMab raised her eyebrows at me, then turned to Maria. “Your mother won’t explain, and she made it clear it wasn’t my place to weigh in. Lately it seemed like she was softening up a little, and I hoped—”\u003c/p\u003e\n\u003cp\u003e“Mom? Softening up? Please.”\u003c/p\u003e\n\u003cp\u003e“You must be patient with your mother, young lady. Many years ago, more than twenty now, she had a serious fright. It troubled her deeply, and I’m sad to say it led to a misunderstanding between her and me. We’ve made some progress in resolving it, but Gwen remains hurt and confused.”\u003c/p\u003e\n\u003cp\u003e“After twenty years? That’s longer than I’ve been alive. Why can’t she just get over it already?”\u003c/p\u003e\n\u003cp\u003e“Maria.” The sharpness in my own voice reminded me of Mab. “Don’t be unkind.”\u003c/p\u003e\n\u003cp\u003e“Sorry. But it’s not fair to keep me away from my own great-aunt and not even tell me why.”\u003c/p\u003e\n\u003cp\u003eThe kid had a point. Yet I had no right to interfere with Gwen’s parenting. Gwen had her blind spots, but she was a good mom.\u003c/p\u003e\n\u003cp\u003eMaria sat down on the bench beside Mab. “I thought you live in Wales.”\u003c/p\u003e\n\u003cp\u003e“I do. I’ve come to Boston to help Vicky with a project.”\u003c/p\u003e\n\u003cp\u003e“A project? You make it sound like arts and crafts. But it’s not, I bet. It’s about demons, right?”\u003c/p\u003e\n\u003cp\u003e“Among other things.”\u003c/p\u003e\n\u003cp\u003e“That’s my job, Maria,” I said. “You know that.”\u003c/p\u003e\n\u003cp\u003eBut Maria couldn’t take her eyes off Mab. “You’re a shapeshifter, too?”\u003c/p\u003e\n\u003cp\u003e“I am. I understand you’re well on your way to joining us.”\u003c/p\u003e\n\u003cp\u003eMaria nodded solemnly. “I’ve had shifting dreams, where I become a bird or a fish or something. And I get that false face thing, when it feels like my face has turned halfway into an animal’s, a couple of times a week. Oh, and Aunt Vicky taught me how to make my dreamscape into anything I want it to be. We talk on the dream phone sometimes. Don’t we, Aunt Vicky?”\u003c/p\u003e\n\u003cp\u003eI nodded, but Mab was the one who spoke. “It won’t be long before you’re able to change your shape. How do you feel about that?”\u003c/p\u003e\n\u003cp\u003e“Scared, a little.” Maria bit her lip. “If I become a shapeshifter, do I have to fight demons?”\u003c/p\u003e\n\u003cp\u003e“No, Maria,” I said putting a hand on her hair. “You don’t have to do anything you don’t want to. If you want to learn about demons, I’ll teach you. If not, well, shapeshifting can be fun.”\u003c/p\u003e\n\u003cp\u003e“What kind of animal would you like to try out first?” asked Mab.\u003c/p\u003e\n\u003cp\u003e“I’ve been thinking about that,” said Maria. “A seagull. I want to soar out over the ocean and see the waves from above.” She looked up at the sky, then back at Mab. “Or maybe a cat. They’re so graceful.” She began a cat stretch and then spun it into a pirouette.\u003c/p\u003e\n\u003cp\u003e“Maria’s a dancer,” I told Mab.\u003c/p\u003e\n\u003cp\u003e“My friend Kelsey has a cat, and sometimes when I watch him, like when he jumps up onto a table by the window, I think he’d make a good dancer. I’d like to be able to move like that.”\u003c/p\u003e\n\u003cp\u003e“Well, you decide,” Mab said. “And once you have, let Vicky know.”\u003c/p\u003e\n\u003cp\u003e“We’ll spend some time together in your dreamscape so you can practice being that animal in your dreams,” I said. “That makes things easier when it’s time to shift for real.”\u003c/p\u003e\n\u003cp\u003eMaria nodded but turned a shade paler. “What if shifting sneaks up on me and I’m not ready?”\u003c/p\u003e\n\u003cp\u003e“We won’t let that happen,” I said. “We’ll try shifting on purpose. It won’t happen for a while, but trying means when it does happen, it’ll be under your control. Once you’ve decided, we’ll tell your mom which animal you’re focusing on. That way, on the off-chance that you start to shift when I’m not around, she’ll be able to help.”\u003c/p\u003e\n\u003cp\u003e“So first practice in my dreams and then start trying for real. That makes sense, I guess.” Letting the subject drop, she looked around. “Where’s Grandma? Did you see her?” Her eyes widened with comprehension. “Oh! She must have come here to see Great-Aunt Mab. Because Mom would never let her invite Mab home.” She stopped and covered her mouth with both hands, as if worried she’d said something rude.\u003c/p\u003e\n\u003cp\u003e“It’s all right, child,” said Mab. “You’re quite correct.”\u003c/p\u003e\n\u003cp\u003e“But Grandma likes you. And Aunt Vicky likes you, so I wish—”\u003c/p\u003e\n\u003cp\u003eMaria never got to express her wish, because at that moment a car horn sounded from the street. She and I both spotted Gwen’s minivan at the same time.\u003c/p\u003e\n\u003cp\u003e“Oh, no!” said Maria. “It’s Mom. Quick, run!”\u003c/p\u003e\n\u003cp\u003eShe sprinted over to where her bike lay on the grass and was halfway on it when I caught up with her. “Don’t run, Maria. It would only make your mom angrier. Come back, and we’ll talk to her like grown-ups.”\u003c/p\u003e\n\u003cp\u003eUsually Maria liked being referred to as a grown-up, but not when it meant facing her mother’s wrath. “I’m just a kid,” she muttered, but she didn’t get on the bike. With me beside her, she wheeled it to where Mab sat. \u003c/p\u003e","sourceLink":"https://allnovel.net/hellhound-deadtown-5/page-35.html","bookId":2613,"creation":"Oct 5, 2019 6:42:11 PM","modification":"Oct 5, 2019 6:42:11 PM"}
