{"id":99326,"no":4,"title":"Page 4","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You’re right,” I told him. “It sure as hell looks like Malone was killed by the Morfran.”\u003c/p\u003e\n\u003cp\u003eA Morfran attack has three stages. First, the attacking spirit gouges out chunks of flesh and enters the victim, causing pressure to build inside the head. As this screaming headache grows, more Morfran enters the body and feeds. The pressure in the head increases, filling the entire body with agonizing pain. Finally, the pressure becomes too much, and—kaboom!—the victim explodes. Leaving exactly the kind of mess now gunking up Lincoln Street.\u003c/p\u003e\n\u003cp\u003eWe walked back to the scene perimeter, away from the slime and the smell. Daniel removed his mask and stuck it in his pocket.\u003c/p\u003e\n\u003cp\u003eSomething was bothering me. “You remember the stages of a Morfran attack, right?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Entry, feeding, explosion.”\u003c/p\u003e\n\u003cp\u003e“You said two of the witnesses heard crows. Did anyone say anything about seeing crows attack Malone? You know, materialized Morfran.”\u003c/p\u003e\n\u003cp\u003e“I asked. No one saw anything like that.”\u003c/p\u003e\n\u003cp\u003e“Then what about wounds spontaneously opening up on Malone’s body, like he was being slashed by an invisible knife? The Morfran doesn’t always materialize when it attacks.”\u003c/p\u003e\n\u003cp\u003e“All they said was what I told you. Malone dropped to his knees, clutched his head, and then . . .” Daniel gestured toward the zombie’s remains. “I see what you mean, though. Unless the witnesses left something out, it doesn’t follow the pattern.” He ran a hand through his hair, then shrugged.\u003c/p\u003e\n\u003cp\u003e“I need to interview the zombie witnesses,” I said.\u003c/p\u003e\n\u003cp\u003eDaniel gave me a half smile. “Does that mean you want the job?”\u003c/p\u003e\n\u003cp\u003e“What job?” a man’s voice asked from behind me. “Costello, what’s this paranormal doing outside DA-1? The code level’s at red, you know.”\u003c/p\u003e\n\u003cp\u003e“Shit,” muttered Daniel. Then he raised his voice. “So, Foster, you finally decided to answer your phone?”\u003c/p\u003e\n\u003cp\u003eI turned to see the bald head and perpetual scowl of Daniel’s partner. Daniel believed they’d been put together because he, Daniel, was thought to be too sympathetic to paranormals. Foster, who had no such scruples, had reported Daniel several times for violating department policies regarding those of us whose DNA reads something other than “human.” Those department policies had been created by Commissioner Hampson, who’d like nothing better than to send in the wrecking balls and knock Deadtown off the map.\u003c/p\u003e\n\u003cp\u003eFoster kept his beady eyes on me. “My phone battery died. Now, are you going to keep violating the Code Red, or are you going to call some uniforms to escort this . . . creature back to DA-1?”\u003c/p\u003e\n\u003cp\u003eCreature. My demon mark blew up like a firecracker, and I had to grab my own right arm to stop myself from hauling off and punching that scowl off his ugly face. Give him something to spice up his goddamn report.\u003c/p\u003e\n\u003cp\u003eDaniel laid his hand on my shoulder. “Vicky’s on the exceptions list. You’d know that if you’d bother to check.”\u003c/p\u003e\n\u003cp\u003eFoster continued his stare-down like he was daring me to start something.\u003c/p\u003e\n\u003cp\u003e“She’s on a list of approved consultants,” Daniel went on. “An expert on demons. She’s worked with us in that capacity before.”\u003c/p\u003e\n\u003cp\u003eThat was true. If you define “working with” as being dragged out of bed by the Goon Squad and marched to their headquarters for questioning. At least this time Daniel had picked up the phone and called me.\u003c/p\u003e\n\u003cp\u003e“Vicky.” Daniel turned to me, and I broke eye contact with Foster. “We need your help on this.” He named a per diem rate. “Save receipts for any expenses that come up. You’ll get reimbursed. And you shouldn’t have any more trouble getting through the checkpoints. Once this goes through, you’ll be on the permanent ‘clear’ list.”\u003c/p\u003e\n\u003cp\u003e“And that means?”\u003c/p\u003e\n\u003cp\u003e“Your approved status remains the same, no matter what the code level.”\u003c/p\u003e\n\u003cp\u003e“Until revoked,” Foster added, savoring the words.\u003c/p\u003e\n\u003cp\u003e“Yes, until revoked,” Daniel snapped. “Just like your detective’s shield is good until it’s revoked.”\u003c/p\u003e\n\u003cp\u003eFoster’s snorty laugh showed how little he feared that happening.\u003c/p\u003e\n\u003cp\u003eDaniel lightly touched my arm, turning me away from Foster. We started walking toward Deadtown. “I’ll see you back to the checkpoint, then start on the paperwork right away. I’d like you to come out and interview the witnesses tonight, as soon as it’s dark.”\u003c/p\u003e\n\u003cp\u003eBehind us, Foster snorted out another laugh. I turned to glare at him. The detective’s eyes gleamed, as though he was seeing a vision of Daniel wrapped like a mummy in miles and miles of red tape.\u003c/p\u003e\n\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003eAFTER SUNRISE, DEADTOWN BECOMES A GHOST TOWN. (Well, not literally—ghosts are one of the few paranormal beings you won’t find here. Arawn, lord of the dead, does a pretty good job of keeping the shades of the departed within the boundaries of his realm.) But today, even though the sun had been up for more than an hour, the streets were crowded. And the mood wasn’t what you’d call festive.\u003c/p\u003e\n\u003cp\u003eZombies gathered in small groups, some listening to street-corner orators, others looking like they were ready for trouble the moment somebody else started it. Most were bundled up against the skin-damaging sunlight, wearing wide-brimmed hats, sunglasses, scarves or bandanas, coats, gloves. They looked more ready for a polar expedition than a political protest.\u003c/p\u003e\n\u003cp\u003eBut protest was in the air. Deadtown residents were beyond fed up. And they were getting ready to do something about it.\u003c/p\u003e\n\u003cp\u003eSnatches of speeches faded in and out as I passed:\u003c/p\u003e\n\u003cp\u003e“. . . Previously Deceased Humans. Hear that? Humans. Unlike some others around here, we’re human, and we deserve the same rights we had before the plague . . .”\u003c/p\u003e\n\u003cp\u003e“. . . no longer willing to play the scapegoat for every crisis in Boston . . .”\u003c/p\u003e\n\u003cp\u003e“. . . take back what’s ours! Before the plague, I owned my own business and two homes. Now? By law I can’t own anything. I work as a manual laborer. How ’bout you? How many here have similar stories?”\u003c/p\u003e\n\u003cp\u003eA zombie turned to watch me walk by, then nudged another standing next to him. Their heads moved as they tracked me; even with their eyes hidden behind sunglasses, the hostility was palpable. I stopped. Putting my fists on my hips, I faced them, returning their stares. It wasn’t a challenge, simply a message that I would not be hurried on my way by a couple of zombies who didn’t like the looks of someone like me in their neighborhood.\u003c/p\u003e\n\u003cp\u003eI can’t help it if I look like a human. Most of the time.\u003c/p\u003e\n\u003cp\u003eAfter ten or twelve long seconds, the second zombie turned back to the speaker. The other watched me for another heartbeat or two. Then he also turned around.\u003c/p\u003e\n\u003cp\u003eI let out the breath I hadn’t realized I was holding. Then I continued down the block.\u003c/p\u003e\n\u003cp\u003eAt the intersection, I paused. If I turned left here, a few minutes’ walk would take me to Kane’s town house. Kane, the monster I loved . . . or thought I did. Like many werewolves who held professional jobs, he worked norm hours. Usually he’d be at his office by now. But that office was near Government Center in the human part of town, and Deadtown was locked down tighter than a maximum security prison. Kane wasn’t on any Code Red exceptions list. As a high-profile lawyer working to secure civil rights for paranormals, he had too many enemies in the Police Commissioner’s Office. So right now, he was either working from home or making his own street-corner speech, one urging calm and using the courts—not violence—to redress grievances.\u003c/p\u003e\n\u003cp\u003eI wanted to see him. Five minutes and I could be there. I’d go up to the front door and pull out my key . . . I sighed. No, I wouldn’t. Even though Kane had given me a key to his place months ago, I wouldn’t use it. I’d ring the bell. And the reason why was the same reason I stood on this corner, unable to make my feet move in the direction I wanted to go.\u003c/p\u003e\n\u003cp\u003eAfter years of on-again, off-again dating, Kane had told me he loved me. That he wanted to take our relationship to the next level. And I, world champion of commitment-phobes, had managed to admit I felt the same way. So why wasn’t I running to be with him now?\u003c/p\u003e\n\u003cp\u003eWhy, indeed.\u003c/p\u003e\n\u003cp\u003eA couple of weeks ago, I’d followed Pryce into the Darklands, the realm of the dead, to try to stop him from recreating his lost shadow demon and reclaiming his power. I’d failed. Not only did Pryce have a shadow demon again, that shadow demon was the biggest, nastiest Hellion I’d ever had the misfortune to encounter. Although I’d killed Difethwr, the Destroyer, Pryce had managed to resurrect the Hellion, binding himself to it in the process. The Destroyer and I went way back—more than ten years ago, the Hellion placed its mark on me, the mark that made me want to smash things when I didn’t keep it under control. When Pryce brought the Destroyer back to life—bigger and nastier than ever—my little anger-management problem boiled over.\u003c/p\u003e\n\u003cp\u003eThese days, dating me was on a par with dating an active volcano. Any little thing could trigger an explosion, like when I’d surveyed the destruction in the New Combat Zone and wanted to join in. But the Destroyer’s claim on me wasn’t the worst of it.\u003c/p\u003e\n\u003cp\u003eWhen I’d disappeared into the Darklands, Kane followed me there, determined to bring me home. But the realm of the dead doesn’t issue tourist visas. To get in, he’d made a bargain with Mallt-y-Nos, aka the Night Hag, a psychopomp who drives wandering spirits of the recently departed into the Darklands. Mallt-y-Nos is a hunter. She loves nothing more than to chase terrified, disoriented souls through the night, her pack of hellhounds snapping at their heels. As his price of admission to the Darklands, Kane agreed to serve the Night Hag as one of those hellhounds for a year and a day.\u003c/p\u003e\n\u003cp\u003eWhen he made the deal, Kane had no way of knowing what he was getting into.\u003c/p\u003e\n\u003cp\u003eHe knew better now.\u003c/p\u003e\n\u003cp\u003eThe Night Hag’s hellhounds are creatures made of pain. Fiery, agonizing pain miles beyond anything imaginable. The burning drives the frantic hounds onward—running, running from the pain—but no relief ever comes. The hag intensifies the torture to force the hounds to obey her commands. It’s the kind of pain that pushes everything out—thoughts, judgments, even sanity—consuming all. I knew, because I’d experienced it. To enter the Darklands, I’d made my own bargain with the Night Hag. She’d forced me to shift into a hellhound and then run me across the border. \u003c/p\u003e","sourceLink":"https://allnovel.net/hellhound-deadtown-5/page-4.html","bookId":2613,"creation":"Oct 5, 2019 6:42:11 PM","modification":"Oct 5, 2019 6:42:11 PM"}
