{"id":99379,"no":58,"title":"Page 58","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHellflame blazed hotter. Difethwr turned its massive head. Fire streamed from its eyes, knocking Pryce to the ground and pinning him there. The demi-demon screamed and writhed. The Destroyer held him in the flames. It moved toward him. Each step shook the ground. Pryce’s screams escalated, clawing the night air. I wanted to cover my ears against the sound, but my right arm remained obstinately limp.\u003c/p\u003e\n\u003cp\u003eWithin minutes, Pryce fell silent.\u003c/p\u003e\n\u003cp\u003eThe Destroyer bent over Pryce, poked at his torso with a clawed foot. No response. Difethwr straightened to its full height, looking once more into the eyes of my upper perspective.\u003c/p\u003e\n\u003cp\u003e“Know this,” the Destroyer said. “The shapeshifter is mine.” And with a puff of sulfurous smoke, the Hellion vanished.\u003c/p\u003e\n\u003cp\u003e37\u003c/p\u003e\n\u003cp\u003ePRYCE WAS . . . DEAD?\u003c/p\u003e\n\u003cp\u003eI couldn’t believe it. I’d seen his fallen body on the ground before, after he’d infected himself with the zombie virus, but still he’d come back. Now, I mimicked the Destroyer, nudging his body with my foot. No response.\u003c/p\u003e\n\u003cp\u003eMab would know. I turned to my aunt, only to find her kneeling before me as she had that day at my apartment.\u003c/p\u003e\n\u003cp\u003e“Lady,” she said, bowing low and placing a hand on her chest.\u003c/p\u003e\n\u003cp\u003eI was going to tell her to knock it off, to remind her of her promise. But when I opened my mouth, a voice I didn’t recognize came out.\u003c/p\u003e\n\u003cp\u003e“You have served me faithfully,” the voice said. “I am well pleased.”\u003c/p\u003e\n\u003cp\u003eThat was not how I talk to my aunt. But I couldn’t articulate the apology I wanted to issue.\u003c/p\u003e\n\u003cp\u003e“Lady,” Mab said. “If I may be so bold, one who deserves punishment is fleeing.” She flicked her eyes toward the northeast corner of the field.\u003c/p\u003e\n\u003cp\u003eWith my normal vision, I could see nothing in the darkness. With my higher, keener vision, I saw the Night Hag creeping away.\u003c/p\u003e\n\u003cp\u003e“Mallt-y-Nos!” The voice that issued from my throat had more authority than I’d ever felt in my life. The Night Hag froze. “Tyrd!” the voice commanded. Come. The same word the hag had used to call the falcon.\u003c/p\u003e\n\u003cp\u003eSlowly, fighting every movement, the Night Hag turned and lurched toward me. For the first time in all my encounters with her, her appearance didn’t change. She was the dried-out corpse of someone who’d died centuries ago: yellow skin, thin and wrinkled, sunken eyes, a few strands of hair still clinging to the scalp. When she was within ten feet of me, she kneeled, looking as though every downward inch cost her a thousand years.\u003c/p\u003e\n\u003cp\u003e“My lady,” her voice croaked through long-decayed lips.\u003c/p\u003e\n\u003cp\u003e“You have overstepped your bounds,” I said. Except it wasn’t me. The strange voice continued to speak through me. “On what authority do you hunt one whose time has not come?”\u003c/p\u003e\n\u003cp\u003eThe Night Hag whimpered instead of answering.\u003c/p\u003e\n\u003cp\u003e“On what authority do you hunt the one chosen by me?”\u003c/p\u003e\n\u003cp\u003e“I didn’t know.”\u003c/p\u003e\n\u003cp\u003e“That does not matter. You have abused your power. You will learn how it feels to be abused.”\u003c/p\u003e\n\u003cp\u003eMy right hand—working again—stretched itself forward. As the Night Hag cowered, energy streamed through my pointing finger. I didn’t know the intention of the power that worked through me. I simply watched.\u003c/p\u003e\n\u003cp\u003eThe limbs of Mallt-y-Nos contorted. She howled as her arms lengthened and her legs thinned. Her neck grew shorter and thicker. Her ears swiveled to the top of her head, becoming black triangles. Her chin and nose merged and stretched into a muzzle.\u003c/p\u003e\n\u003cp\u003eEnergy blasted out, so intense I had to shield my eyes. When I could look again, I could see what the Night Hag had become.\u003c/p\u003e\n\u003cp\u003eA hellhound.\u003c/p\u003e\n\u003cp\u003eHer howling turned to baying, then shortened to a yelp as I, or the power working through me, jolted powerful energy into her. “Run, hound!” my voice ordered. The new hellhound took off and disappeared into the night.\u003c/p\u003e\n\u003cp\u003e“Run to hell,” I muttered, watching it go.\u003c/p\u003e\n\u003cp\u003eA sound, a throat clearing, caught my attention. Mab still knelt in front of me, her hands crossed on her chest. Again, I wanted to tell her to stop it, to get up and be Aunt Mab again. But that other voice pushed its way past mine.\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003e“Lady,” Mab said, her eyes on the ground. “There is one who requires your assistance. My niece would ask it of you.” Still keeping her head down, she gestured across the field.\u003c/p\u003e\n\u003cp\u003eToward Kane.\u003c/p\u003e\n\u003cp\u003eYes! The thought swelled in my mind. If this entity that had taken over my body—it was Ceridwen, it had to be—could help Kane, she needed to get on it now. I tried to direct my (our?) feet toward where he lay on the field, but they didn’t budge. Slowly, seemingly of its own accord, my head turned the way Mab had pointed.\u003c/p\u003e\n\u003cp\u003eHelp Kane! I thought. I let you in. You owe me.\u003c/p\u003e\n\u003cp\u003e“We need to have a talk, I think, about who owes whom.” Yet as her words issued from my own mouth, my feet started to work. I (we?) walked across the field.\u003c/p\u003e\n\u003cp\u003eKane lay as I’d left him. My heart clenched to see him there, curled tight against the final agony of his burning, his skin seared and scorched. It was too late. Goddess or not, there was nothing Ceridwen could do for him. Nothing anyone could do.\u003c/p\u003e\n\u003cp\u003eMy heart was a hollow ball of pain, but the tears that pressed my eyes wouldn’t flow. She wouldn’t let them.\u003c/p\u003e\n\u003cp\u003e“You underestimate our power,” my own voice scolded. “But you shall see.”\u003c/p\u003e\n\u003cp\u003ePower rose through me and sizzled in my fingertips. My knees bent themselves until I knelt beside Kane. Moving of their own accord, my hands touched two places on his body: between his eyes and over his heart. Unfamiliar words of some unknown language issued from my lips. Energy rose from the earth, flowed from the sky. It passed through me and poured into him.\u003c/p\u003e\n\u003cp\u003eBeneath my hand, Kane twitched.\u003c/p\u003e\n\u003cp\u003eI added my will to Ceridwen’s, calling energy and directing it to him. But I infused that energy with love. I visualized it swirling through my heart and absorbing everything I felt for Kane, everything I wanted for him. For us.\u003c/p\u003e\n\u003cp\u003eCome back to me.\u003c/p\u003e\n\u003cp\u003eHis eyelids fluttered.\u003c/p\u003e\n\u003cp\u003eMy body jerked to its feet, and my legs sprinted down the field. An energy blast like I’d never seen flashed through the stadium. It knocked me face forward onto the grass. My ears rang from the boom! Fighting Ceridwen’s will to stay down, I struggled to my knees and turned to look at Kane.\u003c/p\u003e\n\u003cp\u003eFizzling energy lit a circle of scorched earth twenty feet in diameter. In its center stood a wolf.\u003c/p\u003e\n\u003cp\u003eNot a hellhound, a wolf. His silver fur glowed in the moonlight.\u003c/p\u003e\n\u003cp\u003eIs he . . . ? I wanted to ask the question out loud, but my voice wasn’t my own.\u003c/p\u003e\n\u003cp\u003e“He’s no longer a hellhound,” came Ceridwen’s answer in my voice. “Nor shall he be one again.”\u003c/p\u003e\n\u003cp\u003eCeridwen relaxed her grip on my body, allowing me to stand. I held out my hand. My left one, the one not marked by a demon or coated with glitter. The wolf trotted over to me and sniffed. The gray eyes that searched me were Kane’s. He sat, remaining perfectly still as I dropped again to my knees. I threw my arms around him and buried my face in his ruff. His heart beat free and strong. I could smell his scent of pine woods and cool air.\u003c/p\u003e\n\u003cp\u003eThank you, goddess.\u003c/p\u003e\n\u003cp\u003eI don’t know why—maybe she was moved enough to let us have our moment—but Ceridwen answered in my mind instead of through my mouth. I restored his life, she said. But breaking the curse, that was your doing. Out of love for you, he bargained away his freedom. Your love has returned it to him.\u003c/p\u003e\n\u003cp\u003eAnd then Ceridwen receded. She relinquished control of my body and shrank into a tiny spark that settled somewhere in the back of my brain. I felt almost myself again. Enough that I pushed Ceridwen aside to worry about later and turned all my attention to holding Kane.\u003c/p\u003e\n\u003cp\u003eAnd that’s exactly what I did. Right up until the moment when the stadium floodlights blazed on and the police told us we were surrounded.\u003c/p\u003e\n\u003cp\u003eAT LEAST THEY DIDN’T COME IN FIRING. THAT HAD TO BE A good sign, right?\u003c/p\u003e\n\u003cp\u003e“Help me!” I whispered to Ceridwen. No response. I could feel that spark of her presence, but it was muted, silent. Great time to take a nap. Maybe she didn’t care if the shapeshifter she’d chosen to inhabit got her ass hauled off to that underground paranormal prison.\u003c/p\u003e\n\u003cp\u003eFigures in body armor kept rifles trained on us as, step by step, they approached. Kane growled. “Shh,” I said, stroking his fur. An attacking werewolf would be shot full of silver bullets, no matter who he was the other twenty-eight days of the month. Kane’s muscles trembled as though longing to spring, but he stayed seated beside me.\u003c/p\u003e\n\u003cp\u003eUntil a dart thwacked into his side. Kane jumped to his feet, but his legs buckled under him. He toppled forward, his muzzle hitting the dirt first, as the tranquilizer took full effect.\u003c/p\u003e\n\u003cp\u003ePer bullhorned instructions, I lay on my front with my hands on the back of my head. I expected frisking, handcuffing, the works. But it didn’t happen. Minutes passed. I didn’t move. Finally, a voice—Daniel’s—told me I could get up. He even reached down a hand to help.\u003c/p\u003e\n\u003cp\u003eA quick glance around the field showed me the situation. Two dozen cops had herded the zombies into a group. An ambulance crew tended Mab. And Kane . . . Kane slept inside a werewolf cage with silver-plated bars.\u003c/p\u003e\n\u003cp\u003eShit. Leaving the retreat during a full moon could be a death sentence for a werewolf.\u003c/p\u003e\n\u003cp\u003e“Kane didn’t leave Princeton of his own will,” I said. “He was forced.” As quickly as I could, I explained about the Night Hag.\u003c/p\u003e\n\u003cp\u003eDaniel looked skeptical. “So far, there have been no reports of werewolf attacks in the city tonight. As long as it stays that way, I’ll make sure he’s returned to the retreat.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I’m in homicide. It’s not my job to police werewolves. Not unless one of them kills somebody.”\u003c/p\u003e\n\u003cp\u003eWhich made yesterday’s events come crashing back. As in me, armed and dangerous and wanted for murder.\u003c/p\u003e\n\u003cp\u003e“Um, not that I’m suggesting it or anything, but how come I’m not under arrest?”\u003c/p\u003e\n\u003cp\u003eDaniel’s expression darkened. “Why didn’t you call me? I’ve been trying to get in touch with you since yesterday afternoon.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t I? Does ‘armed and dangerous’ ring a bell?”\u003c/p\u003e\n\u003cp\u003e“That was Commissioner Hampson’s doing,” Daniel’s new partner, Ramón, said as he approached from the left. “We knew you tried to protect the SWAT team, but Hampson . . .” He lifted his hands in a what-can-you-say gesture. \u003c/p\u003e","sourceLink":"https://allnovel.net/hellhound-deadtown-5/page-58.html","bookId":2613,"creation":"Oct 5, 2019 6:42:11 PM","modification":"Oct 5, 2019 6:42:11 PM"}
