{"id":17382,"no":5,"title":"Chapter V The Shadow in the Cave","content":"\u0026nbsp;We ate heartily, the pair of us, that evening. The effect on me was comforting and humanising. I felt well disposed to my fellow man—and woman, and inclined to sanguine expectations. Miss Ottley, however, was, as usual, impenetrable. She belonged of right to the age of iron. A female anachronism. To cheer her I suggested a game of chess. She consented, and mated me in fourteen moves. We played again, and once more she beat me. My outspoken admiration of her skill—I rather fancy my own play at chess—left her perfectly imperturbable. In the third game she predicted my defeat at the eleventh move on making her own fourth. I did my best, but her prophecy was fulfilled. \"Enough!\" said I, and retiring to the door way, I lighted a cigarette. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hassan Ali, our dragoman, should be here to-morrow,\" she presently remarked, \"with troops.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They will never catch our rascal Arabs,\" I replied. \"With five clear days\u0027 start those beggars might be anywhere.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 43]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so,\" said she, \"but they will be of some use none the less—if only to drag that sarcophagus out of the temple.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Eh!\" I exclaimed—and looked at her sharply. \"What is the matter with the thing—here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She shrugged her shoulders, then of a sudden smiled. \"Do you wish to be amused?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of all things.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then prepare to laugh at me. While you slept this afternoon——\" She paused.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father awoke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And conversed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good,\" I murmured. \"He was sensible.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not know. He seemed so. But he did not speak to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You said that he conversed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ay—but with a shadow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Ottley compressed her lips and looked at me defiantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A shadow,\" she repeated. \"I saw it distinctly. It moved across the room and stood beside the cot. It was the shadow of a man. But you are not laughing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not yet,\" said I. \"Had this shadow a voice?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did your father say to it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He implored it to be patient.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 44]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And the shadow?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Vanished.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I told myself I dreamed. I tried not to die of terror, and succeeded.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why did you not wake me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wished to, but the shadow intervened.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It reappeared?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For a second that reduced me to a state of trembling imbecility.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That infernal perfume has simply shattered your nerves,\" I commented cheerfully. \"You\u0027ll be better after a good rest. Overstrain and anxiety of course are to a degree responsible. Indeed, they might be held accountable for the hallucination alone. But I blame the perfume to a great extent, because it similarly affected me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What!\" she cried, \"you saw a shadow, too?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I laughed softly. \"My own—no other. But its appearance shocked me horribly. In my opinion that coffin perfume works powerfully upon the optic nerve. How are you feeling now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As well as ever in my life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No fears?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"None. But I admit a distrust of that sarcophagus—or rather of the perfume it contains. Are you sure that you stopped up the chisel hole securely?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite. But pardon me, Miss Ottley, you are looking weary. Take my advice and retire now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 45]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thanks. I shall,\" she said, and with a cool bow she went into the inner chamber. An hour later Sir Robert awoke. He was quite sensible and appeared much better. I fed him and we exchanged a few cheerful remarks. He declared that he had turned the corner and expressed a strong desire to be up and about his work again. He also asked after his daughter, and thanked me warmly for my services. Soon afterwards he dropped off into a tranquil slumber, and I spent the remainder of my watch reading a Review. As I was not very tired I gave Miss Ottley grace, and it was a quarter to one when I awakened her. She came out looking as fresh as a rose, her cheeks scarlet from their plunge in cool water and consequent towelling. She invited me to use her couch, but I declined, and sought my accustomed corner. I slept like the dead—for (I subsequently discovered) just about an hour. But then I awoke choking and gasping for breath. I had an abominable sensation of strong fingers clutched about my throat. At first all was dark before me. But struggling afoot, the shadows receded from my eyes, and I saw the lamp—a second afterwards, Miss Ottley. She stood with her back against the further wall of the chamber, her hands outstretched as if to repel an impetuous opponent; and her face was cast in an expression of unutterable terror.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Ottley!\" I cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She uttered a strangled scream, then staggered[Pg 46] towards me. \"Oh! thank God—you were too strong—for him,\" she gasped. \"He tried to kill you—and I could not move nor cry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who?\" I demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The—the shadow.\" She caught my arms and gripped them with hysterical vigour.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I forced her to sit down and hurried to her father. He was sleeping like a babe. I thought of the asphyxiating sensation I had experienced and stepped gently to my sleeping corner. Kneeling down, I struck a match. The flame burned steadily. Not carbonic acid gas then at all events; but I tried the whole room to make sure, also the interior of the sarcophagus, but without result. So far baffled, I stood up and thought. What agency had been at work to disturb us? I made a tour of the walls and examined the stones of their construction one by one. It seemed just possible that there might be a secret entrance to the chamber; and some robber Arab acquainted with it might be employing it for evil ends. But I was forced to abandon that idea like the other. And no one had entered through the pylon, for the dust about the doorway was absolutely impressionless. What then? I turned to Miss Ottley. She was watching me with evidently painful expectation, her hands tightly clasped.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made you think the shadow wished to kill me?\" I inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I saw its face.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 47]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh! it has a face now, eh?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The face of a devil; and long thin hands. It fastened them about your throat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear girl.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be a fool,\" she retorted stormily; \"what aroused you? Did you hear me call?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I was confounded. \"Very good,\" I said, \"I admit the hands at least, for the nonce, for truly I was half strangled. But what do you infer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can human creatures make themselves invisible at will?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My good Miss Ottley, no. But they can run away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you want to see the shadow\u0027s face?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then look on the lid of the sarcophagus and see its portrait in a gentle mood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ptahmes!\" I cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ay, Ptahmes,\" she said slowly. \"We are haunted by his spirit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I sat down on the edge of the sarcophagus and lit a cigarette.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am quite at a present loss to explain my throttling,\" I observed, \"but that is the only mystery. I reject your shadow with the contempt that it deserves. What you saw was some wandering Arab who hopped in here without troubling to tread through the dust in the doorway and who departed in the same fashion. Pish! There, too, is the mystery of my throttling solved.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps,\" said she, \"indeed I hope so.\" She was still trembling in spasms.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you minded for the experiment?\" I asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish to drive this foolish fancy from your mind.\" I took out my revolver and showed it to her. \"Spirits are said to love the dark best. Let us put out the lamp. It\u0027s their element. How, then, can we better tempt old Ptahmes from his tomb?\" I wound up with a laugh. \"I can promise him a warm reception.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Ottley shivered and grew if possible paler than before. But her pride was equal to the challenge. \"Very well,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I drew up a stool near hers, put out the lamp and sat down. When my cigarette had burned out the darkness was blacker than the blackest ebony.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"An idea runs in my head that spirits respond most surely to silent wooers,\" I murmured. \"But I have no experience. Have you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"N-no,\" said Miss Ottley.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The poor girl was shivering with fear and too proud to admit it. I sought about for a pretext to comfort her and found one presently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t they join hands at a séance?\" I inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I—t-think so,\" said Miss Ottley.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hands encountered. Hers was pitifully cold. I enclosed it firmly in my left and held it on my knee. She sighed but ever so softly, trying to [Pg 49]prevent my hearing it. Thereafter we were silent for very long, listening to the sick man\u0027s quiet breathing. No other sound was to be heard. But soon Miss Ottley\u0027s hand grew warm, and the fingers twined around mine. It felt a nice good little hand. It was very small, yet firm and silken-smooth, and it possessed a strange electric quality. It made mine tingle—a distinctly pleasurable sensation. I fell into a dreamy mood and I think I must have indulged in forty winks, when all of a sudden Miss Ottley\u0027s hand aroused me. Her fingers were gripping mine with the force of a vice. She was breathing hard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\" I whispered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is some—presence in the room,\" she gasped. \"Don\u0027t you feel it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Three paces off a man\u0027s face glowered at us\n\u003c/div\u003e \n\u003cdiv\u003e\n And as I live, I did. I struck a match and sprang afoot. Three paces off a man\u0027s face glowered at us in the fitful glimmer of the lucifer. Its characteristics were so unusual that it is not possible ever to forget them. The eyes were large, dark and singularly dull. They were set at an extraordinary distance apart in the skull, six inches, I should say, at least. But the head, though abnormally broad thereabouts, tapered to a point in the chin and was cone-shaped above the wide receding temples. The cheek bones were high and prominent. They shone in the match light almost white in contrast with the dark skin of the more shaded portions of the countenance. The nose was long[Pg 50] and aquiline, but the nostrils were broad and compressed at the base, pointing at negroid ancestry. The mouth, wide and thin-lipped, was tightly shut. The chin was long, sharp and hairless. The ears were bat-shaped.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Recovering from my first shock of amazement, I addressed the intruder in Arabic.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you doing here? What do you want?\" I cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not answer. Enraged, I started forward and hit out from the shoulder. Striking air. The match went out. I lit another. The man had vanished. I relighted the lamp and carefully examined the chamber. But our visitor had not left the slightest sign of his intrusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I shook my head and went over to Miss Ottley. She was leaning against the wall with her eyes shut, her bosom heaving painfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I touched her and she started—suppressing a shriek. Her lips were trickling blood where she had bitten them. Her face was ghastly and she seemed about to swoon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pish!\" I cried, \"there is nothing to be frightened of. A rascally Arab—knows some secret way of entering this cavern, that is all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She swayed towards me. I caught her as she fell and bore her to a stool. But though quite overcome she was not unconscious. Yet her fortitude was broken down at last and she was helpless. She could not even sit up unassisted. Placing her[Pg 51] on the floor a while, I made her drink some spirit and then, lifting her upon my knee, I rocked her in my arms like a child and did my best to soothe her fears. Heavens, how she cried! My handkerchief was soon as wet as if I had soused it in a basin of water, and yet she still cried on. I spoke to her all the time. I told her that I would answer for her safety with my life, and all sorts of things. And thinking of her as a poor little child, I called her \"dear\" continually and \"darling\"—and I let her weep herself into an exhausted sleep upon my breast. And when that happened I did not need anyone to tell me that science was no longer the mistress of my fate or that I, a comparative pauper, had committed the unutterable folly of falling in love with the daughter of a millionaire—whose religion was Pride with a capital P. I held her so till dawn, staring dumbly at her face, and thus when her eyes opened they looked straight into mine. She did not move, and half-unwillingly my arms tightened round her. \"The bad dream is over, little girl,\" I whispered. \"See—the golden sunlight.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May—May,\" said Sir Robert\u0027s voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She started up, her face aflame. I followed her to the bedside. The patient was awake, and strong and hungry. Also querulous. He complained of the pain of the wound and ordered me to dress it. He had seen nothing. But I knew Miss Ottley would not forgive me on that account. I read it in[Pg 52] her eyes. After I had dressed the patient\u0027s wound and we had fed him, she followed me to the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had no right to let me sleep—like that,\" she said imperiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was nothing for it but to insult her or to prove myself an adventurer. I had no mind for the latter course. \"Quite right,\" I returned, \"when you behaved like an idiot I should have treated you as such and left you to recover from your own silly terror instead of acting the soft fool and losing my own rest in serving you. I\u0027ll do it, too—next time. What will you have for breakfast?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She swung on her heel and left me.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2942/80834.html","bookId":1087,"creation":"Aug 2, 2019 8:32:43 AM","modification":"Aug 2, 2019 8:32:43 AM"}
