{"id":1005,"no":31,"title":"Part 2 Chapter 13","content":"\u003cp\u003eHow can I begin?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBe a light unto the world, and hurt it not. Seek to build, not to destroy.\u003c/p\u003e \n\u003cp\u003eBring My people home.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBy your shining example. Seek only Godliness. Speak only in truthfulness. Act only in love.\u003c/p\u003e \n\u003cp\u003eLive the Law of Love now and forevermore. Give everything, require nothing.\u003c/p\u003e \n\u003cp\u003eAvoid the mundane.\u003c/p\u003e \n\u003cp\u003eDo not accept the unacceptable.\u003c/p\u003e \n\u003cp\u003eTeach all who seek to learn of Me.\u003c/p\u003e \n\u003cp\u003eMake every moment of your life an outpouring of love.\u003c/p\u003e \n\u003cp\u003eUse every moment to think the highest thought, say the highest word, do the highest deed. In this, glorify your Holy Self, and thus, too, glorify Me.\u003c/p\u003e \n\u003cp\u003eBring peace to the Earth by bringing peace to all those whose lives you touch.\u003c/p\u003e \n\u003cp\u003eBe peace.\u003c/p\u003e \n\u003cp\u003eFeel and express in every moment your Divine Connection with the All, and with every person, place, and thing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eEmbrace every circumstance, own every fault, share every joy, contemplate every mystery, walk in every man’s shoes, forgive every offense (including your own), heal every heart, honor every person’s truth, adore every person’s God, protect every person’s rights, preserve every person’s dignity, promote every person’s interests, provide every person’s needs, pre-sume every person’s holiness, present every person’s greatest gifts, produce every person’s blessing, and pronounce every person’s future secure in the assured love of God.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBe a living, breathing example of the Highest Truth that resides within you.\u003c/p\u003e \n\u003cp\u003eSpeak humbly of yourself, lest someone mistake your Highest Truth for a boast.\u003c/p\u003e \n\u003cp\u003eSpeak softly, lest someone think you are merely calling for attention.\u003c/p\u003e \n\u003cp\u003eSpeak gently, that all might know of Love.\u003c/p\u003e \n\u003cp\u003eSpeak openly, lest anyone think you have something to hide.\u003c/p\u003e \n\u003cp\u003eSpeak candidly, so you cannot be mistaken.\u003c/p\u003e \n\u003cp\u003eSpeak often, so that your word may truly go forth.\u003c/p\u003e \n\u003cp\u003eSpeak respectfully, that no one be dishonored.\u003c/p\u003e \n\u003cp\u003eSpeak lovingly, that every syllable may heal.\u003c/p\u003e \n\u003cp\u003eSpeak of Me with every utterance.\u003c/p\u003e \n\u003cp\u003eMake of your life a gift. Remember always, you are the gift!\u003c/p\u003e \n\u003cp\u003eBe a gift to everyone who enters your life, and to everyone whose life you enter. Be careful not to enter another’s life if you cannot be a gift.\u003c/p\u003e \n\u003cp\u003e(You can always be a gift, because you always are the gift—yet sometimes you don’t let yourself know that.)\u003c/p\u003e \n\u003cp\u003eWhen someone enters your life unexpectedly, look for the gift that person has come to receive from you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat an extraordinary way of putting it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhy else do you think a person has come to you?\u003c/p\u003e \n\u003cp\u003eI tell you this: every person who has ever come to you has come to receive a gift from you. In so doing, he gives a gift to you—the gift of your experiencing and fulfilling Who You Are.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhen you see this simple truth, when you under-stand it, you see the greatest truth of all:\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI HAVE SENT YOU\u003c/p\u003e \n\u003cp\u003eNOTHING BUT ANGELS.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/243/613.html","bookId":36,"creation":"Aug 1, 2019 2:45:39 AM","modification":"Aug 1, 2019 2:45:39 AM"}
