{"id":1008,"no":34,"title":"Part 2 Chapter 16","content":"\u003cp\u003eSince we are discussing larger aspects of life on a planetary scale, as well as reviewing some of the elements of our individ-ual lives which were explored initially in Book 1, I would like to ask You about the environment.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat do you want to know?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIs it really being destroyed, as some environmentalists claim, or are these people simply wild-eyed radicals, el-pinko liberal Commies, all of whom graduated from Berkeley and smoke dope?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes to both questions.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhaaa—???\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eJust kidding. Okay, yes to the first question, no to the second.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe ozone layer is depleted? The rain forests are being decimated?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. But it is not just about such obvious things. There are matters less obvious about which you should be concerned.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHelp me out here.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, for instance, there is rapidly developing a soil shortage on your planet. That is, you are running out of good soil in which to grow your food. This is because soil needs time to reconstitute itself, and your corporate farmers have no time. They want land that is producing, producing, producing. So the age-old practice of alter-nating growing fields from season to season is being abandoned or shortened. To make up for the loss of time, chemicals are being dumped into the land in order to render it fertile faster. Yet in this, as with all things, you cannot develop an artificial substitute for Mother Nature which comes even close to providing what She provides.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe result is that you are eroding, down to a few inches really, in some places, the available nutritive topsoil reserve. In other words, you are growing more and more food in soil which has less and less nutritional content. No irons. No minerals. Nothing which you count on the soil to provide. Worse yet, you are eating foods filled with chemicals which have been poured into the soil in a desperate attempt to reconstitute it. While causing no apparent damage to the body in the short term, you will discover to your sadness that in the long run these trace chemicals, which remain in the body, are not health producing.\u003c/p\u003e \n\u003cp\u003eThis problem of soil erosion through rapid growing-field turnover is not something of which most of your people may be aware, nor is the dwindling growable soil reserve a fantasy made up by yuppie environmentalists looking for their next fashionable cause. Ask any Earth scientist about it and you will hear plenty. It is a problem of epidemic proportions; it is worldwide, and it is serious.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis is just one example of the many ways you are damaging and depleting your Mother, the Earth, the giver of all life, out ofa complete disregard for her needs and natural processes.\u003c/p\u003e \n\u003cp\u003eYou are concerned about little on your planet ex-cept the satisfying of your own passions, the meeting of your own immediate (and mostly bloated) needs, and quenching the endless human desire for Bigger, Better, More. Yet you might do well as a species to ask, when is enough enough?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhy do we not listen to our environmentalists? Why do we not heed their warnings?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIn this, as in all really important matters affecting the quality and style of life on your planet, there is a pattern which is easily discernable. You have coined a phrase in your world which answers the question perfectly. “Follow the money trail.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow can we ever begin to hope to solve these problems when fighting something as massive and insidious as that?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSimple. Eliminate money.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eEliminate money?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. Or at the very least, eliminate its invisibility.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI don’t understand.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMost people hide the things they are ashamed of or don’t want other people to know about. That is why the largest number of you hide your sexuality, and that is why nearly all of you hide your money. That is to say, you are not open about it. You consider your money to be a very private matter. And therein lies the prob-lem.\u003c/p\u003e \n\u003cp\u003eIf everyone knew everything about everybody’s money situation, there would be an uprising in your country and on your planet, the likes of which you have never seen. And in the aftermath of that there would be fairness and equity, honesty and true for-the-good-of-all priority in the conduct of human affairs.\u003c/p\u003e \n\u003cp\u003eIt is now not possible to bring fairness or equity, honesty, or the common good to the marketplace because money is so easy to hide. You can actually, physically, take it and hide it. There are also all manner of means by which creative accountants can cause corporate money to be “hidden” or to “disappear.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSince money can be hidden, there is no way for anyone to know exactly how much anyone else has or what they are doing with it. This makes it possible for a plethora of inequity, if not to say double-dealing, to exist. Corporations can pay two people vastly different wages for doing the same job, for instance. They can pay one person $57,000 a year while paying the other $42,000 a year, for performing the exactly identical function, giving one employee more than the other simply because the first employee has something the second employee does not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat’s that?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eA penis.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. Oh, indeed.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut You don’t understand. Having a penis makes the first employee more valuable than the second; quicker witted, smarter by half, and, obviously, more capable.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHmmm. I don’t remember constructing you that way. I mean, so unequal in abilities.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, You did, and I’m surprised You don’t know it. Every-one on this planet knows it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWe’d better stop this now, or people will think we’re really serious.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou mean You’re not? Well, we are! The people on this planet are. That’s why women can’t be Roman Catholic or Mormon priests, or show up on the wrong side of the Wailing Wall in Jerusalem, or climb to the top job in Fortune 500 companies, or pilot airliners, or—\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, we get the point. And My point is that pay discrimination, at least, would be much more difficult to get away with if all money transactions were made visible, instead of hidden. Can you imagine what would happen in every workplace on the globe if all companies were forced to publish all the salaries of all the employees? Not the salary ranges for particular job classifications, but the actual compensation awarded to each individual.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, there goes “playing two ends against the middle,” right out the window.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYup.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd there goes, “What he doesn’t know won’t hurt him.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYup.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd there goes, “Hey, if we can get her for a third less, why should we pay more?”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUh-huh.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd there goes apple polishing, and kissing up to the boss, and the “inside track,” and company politics, and—\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd much, much more would disappear from the workplace, and from the world, through the simple expedient of uncovering the money trail.\u003c/p\u003e \n\u003cp\u003eThink of it. If you knew exactly how much money each of you holds and the real earnings of all of your industries and corporations and each of their executives—as well as how each person and corporation is using the money it has—don’t you think that would change things?\u003c/p\u003e \n\u003cp\u003eThink about this. In what ways do you think things would change?\u003c/p\u003e \n\u003cp\u003eThe plain fact is that people would never put up with 90 percent of what is going on in the world if they knew what was going on. Society would never sanction the extraordinarily disproportionate distribution of wealth, much less the means by which it is gained, or the manner in which it is used to gain more, were these facts known, specifically and immediately, by all people everywhere.\u003c/p\u003e \n\u003cp\u003eNothing breeds appropriate behavior faster than ex-posure to the light of public scrutiny. That is why your so-called Sunshine Laws have done so much good in clearing away some of the awful mess of your political and governance system. Public hearings and public account-ability has gone far toward eliminating the kinds of back-room antics that went on in the twenties, thirties, forties, and fifties in your town halls and school boards and political precincts—and national government as well.\u003c/p\u003e \n\u003cp\u003eNow it is time to bring some “sunshine” to the way you deal with compensation for goods and services on your planet.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat are You suggesting?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis is not a suggestion, it is a dare. I dare you to throw out all your money, all your papers and coins and individual national currencies, and start over. Develop an international monetary system that is wide open, totally visible, immediately traceable, completely ac-countable. Establish a Worldwide Compensation Sys-tem by which people would be given Credits for services rendered and products produced, and Debits for services used and products consumed.\u003c/p\u003e \n\u003cp\u003eEverything would be on the system of Credits and Debits. Returns on investments, inheritances, winnings of wagers, salaries and wages, tips and gratuities, every-thing. And nothing could be purchased without Credits. There would be no other negotiable currency. And everyone’s records would be open to everyone else.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt has been said, show me a man’s bank account, and I’ll show you the man. This system comes close to that scenario. People would, or at least could, know a great deal more about you than they know now. But not only would you know more about each other; you would know more about everything. More about what corporations are paying and spending—and what their cost is on an item, as well as their price. (Can you imagine what corporations would do if they had to put two figures on every price tag—the price and their cost? Would that bring prices down, or what! Would that increase competition, and boost fair trade? You can’t even imagine the consequences of such a thing.)\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnder the new Worldwide Compensation System, WCS, the transfer of Debits and Credits would be immediate and totally visible. That is, anybody and everybody could inspect the account of any other person or organization at any time. Nothing would be kept secret, nothing would be “private.”\u003c/p\u003e \n\u003cp\u003eThe WCS would deduct 10 percent of all earnings each year from the incomes of those voluntarily request-ing such a deduction. There would be no income tax, no forms to file, no deductions to figure, no “escape hatch” to construct or obfuscation to manufacture! Since all records would be open, everyone in the society would be able to observe who was choosing to offer the 10 percent for the general good of all, and who was not. This voluntary deduction would go toward support of all the programs and services of the govern-ment, as voted on by the people.\u003c/p\u003e \n\u003cp\u003eThe whole system would be all very simple, all very visible.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe world would never agree to such a thing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOf course not. And do you know why? Because such a system would make it impossible for anyone to do anything they didn’t want someone else to know about. Yet why would you want to do something like that anyway? I’ll tell you why. Because currently you live within an interactive social system based on “taking advantage,” “getting the edge,” “making the most,” and “the survival of the so-called fittest.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhen the chief aim and goal of your society (as it is in all truly enlightened societies) is the survival of all; the benefit, equally, of all; the providing of a good life for all, then your need for secrecy and quiet dealings and under the table maneuverings and money which can be hidden will disappear.\u003c/p\u003e \n\u003cp\u003eDo you realize how much good old-fashioned cor-ruption, to say nothing of lesser unfairnesses and inequi-ties, would be eliminated through the implementation of such a system?\u003c/p\u003e \n\u003cp\u003eThe secret here, the watchword here, is visibility.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWow. What a concept. What an idea. Absolute visibility in the conduct of our monetary affairs. I keep trying to find a reason why that would be “wrong,” why that would not be “okay,” but I can’t find one.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOf course you can’t, because you’ve got nothing to hide. But can you imagine what the people of money and power in the world would do, and how they would scream, if they thought that every move, every pur-chase, every sale, every dealing, every corporate action and pricing choice and wage negotiation, every deci-sion whatsoever could be reviewed by anyone simply looking at the bottom line?\u003c/p\u003e \n\u003cp\u003eI tell you this: nothing breeds fairness faster than visibility.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eVisibility is simply another word for truth.\u003c/p\u003e \n\u003cp\u003eKnow the truth, and the truth shall set you free.\u003c/p\u003e \n\u003cp\u003eGovernments, corporations, people of power know that, which is why they will never allow the truth—the plain and simple truth—to be the basis of any political, social, or economic system they would devise.\u003c/p\u003e \n\u003cp\u003eIn enlightened societies there are no secrets. Every-one knows what everyone else has, what everyone else earns, what everyone else pays in wages and taxes and benefits, what every other corporation charges and buys and sells and for how much and for what profit and everything. EVERYFHING.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDo you know why this is possible only in enlightened societies? Because no one in enlightened societies is willing to get anything, or have anything, at someone else’s expense.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat is a radical way to live.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt seems radical in primitive societies, yes. In enlight-ened societies it seems obviously appropriate.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am intrigued by this concept of “visibility.” Could it extend beyond monetary affairs? Might it be a watchword for our personal relationships as well?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOne would hope so.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd yet it isn’t.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAs a rule, no. Not yet on your planet. Most people still have too much to hide.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhy? What’s that about?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIn personal relationships (and in all relationships, re-ally) it’s about loss. It’s about being afraid of what one might lose or fail to gain. Yet the best personal relation-ships, and certainly the best romantic ones, are relation-ships in which everyone knows everything; in which visibility is not only the watchword, but the only word; in which there simply are no secrets. In these relationships nothing is withheld, nothing is shaded or colored or hidden or disguised. Nothing is left out or unspoken. There is no guesswork, there is no game playing; no one is “doing a dance,” “running a number,” or “shining you on.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut if everyone knew everything we were thinking—\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHold it. This isn’t about having no mental privacy, no safe space in which to move through your personal process. That’s not what I’m talking about here.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis is about simply being open and honest in your dealings with another. This is about simply telling the truth when you speak, and about withholding no truth when you know it should be spoken. This is about never again lying, or shading, or verbally or mentally manipu-lating, or twisting your truth into the hundred and one other contortions which typify the largest number of human communications.\u003c/p\u003e \n\u003cp\u003eThis is about coming clean, telling it like it is, giving it to them straight. This is about ensuring that all indi-viduals have all the data and know everything they need to know on a subject. This is about fairness and open-ness and, well . . .. . . visibility.\u003c/p\u003e \n\u003cp\u003eYet this does not mean that every single thought, every private fear, every darkest memory, every fleeting judgment, opinion, or reaction must be placed on the table for discussion and examination. That is not visibil-ity, that is insanity, and it will make you crazy.\u003c/p\u003e \n\u003cp\u003eWe are talking here about simple, direct, straightfor-ward, open, honest, complete communication. Yeteven at that, it is a striking concept, and a little-used one.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou can say that again.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYet even at that, it is a striking concept, and a little-used one.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou should have been in vaudeville.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAre you kidding? I am.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut seriously, this is a magnificent idea. Imagine, an entire society built around the Principle of Visibility. Are You sure it would work?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’ll tell you something. Half the world’s ills would go away tomorrow. Half the world’s worries, half the world’s conflicts, half the world’s anger, half the world’s frustration . . .. .\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh, there would be anger and frustration at first, make no mistake about that. When it was finally discov-ered just how much the average person is being played like a fiddle, used like a disposable commodity, ma-nipulated, lied to, and downright cheated, there would be plenty of frustration and anger. But “visibility” would clean most of that up within 60 days; make it go away.\u003c/p\u003e \n\u003cp\u003eLet me invite you again—just think about it.\u003c/p\u003e \n\u003cp\u003eDo you think you could live a life like this? No more secrets? Absolute visibility?\u003c/p\u003e \n\u003cp\u003eIf not, why not?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat are you keeping from others that you don’t want them to know?\u003c/p\u003e \n\u003cp\u003eWhat are you saying to someone that isn’t true?\u003c/p\u003e \n\u003cp\u003eWhat are you not saying to someone that is?\u003c/p\u003e \n\u003cp\u003eHas lying by omission or commission brought your world where you really want it to be? Has manipulation (of the marketplace, of a particular situation, or simply of a person) through silence and secrecy really bene-fited us? Is “privacy” really what makes our governmen-tal, corporate, and individual lives work?\u003c/p\u003e \n\u003cp\u003eWhat would happen if everybody could see everything?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNow there is an irony here. Don’t you see that this is the one thing you fear about your first meeting with God? Don’t you get that what you’ve been afraid of is that the gig is up, the game is over, the tap dance is finished, the shadow boxing is done, and the long, long trail of deceits, big and small, has come to—quite literally—a dead end?\u003c/p\u003e \n\u003cp\u003eYet the good news is that there is no reason for fear, no cause to be scared. No one is going to judge you, no one is going to make you “wrong,” no one is going to throw you into the everlasting fires of hell.\u003c/p\u003e \n\u003cp\u003e(And to you Roman Catholics, no, you won’t even go to purgatory.)\u003c/p\u003e \n\u003cp\u003e(And to you Mormons, no, you won’t be trapped forever in the lowest heaven, unable to get to “highest heaven,” nor will you be labeled Sons of Perdition and banished forever to realms unknown.)\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e(And to you...)\u003c/p\u003e \n\u003cp\u003eWell, you get the picture. Each of you has con-structed, within the framework of your own particular theology, some idea, some concept of God’s Worst Punishment. And I hate to tell you this, because I see the fun you’re having with the drama of it all, but, well . . . just ain’t no such thing.\u003c/p\u003e \n\u003cp\u003ePerhaps when you lose the fear of having your life become totally visible at the moment of your death, you can get over the fear of having your life become totally visible while you are living it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWouldn’t that be something...\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, wouldn’t it, though? So here’s the formula to help you get started. Turn back to the very beginning of this book and review again the Five Levels of Truth Telling. Determine to memorize this model and imple-ment it. Seek the truth, say the truth, live the truth every day. Do this with yourself and with every person whose life you touch.\u003c/p\u003e \n\u003cp\u003eThen get ready to be naked. Stand by for visibility.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis feels scary. This feels real scary.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eLook to see what you are afraid of.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m afraid everyone will leave the room. I’m afraid no one will like me any more.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI see. You feel you have to lie to get people to like you?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNot lie, exactly. Just not tell them everything.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eRemember what I said before. This is not about blurting out every little feeling, thought, idea, fear, memory, confession, or whatever. This is simply about always speaking the truth, showing yourself completely.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWith your dearest loved one you can be physically naked, can you not?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThen why not be emotionally naked as well?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe second is much harder than the first.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI understand that. That does not fail to recommend it, however, for the rewards are great.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, You’ve certainly brought up some interesting ideas. Abolish hidden agendas, build a society on visibility, tell the truth all the time to everyone about everything. Whew!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOn these few concepts entire societies have been constructed. Enlightened societies.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI haven’t found any.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI wasn’t speaking of your planet.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOr even your solar system.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOH.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut you don’t have to leave the planet or even leave your house to begin experiencing what such a New Thought system would be like. Start in your own family, in your own home. If you own a business, start in your own company. Tell everyone in your firm exactly what you make, what the company is making and spending, and what each and every employee makes. You will shock the hell out of them. I mean that quite literally. You will shock the hell right out of them. If everyone who owned a company did this, work would no longer be a living hell for so many because a greater sense of equity, fair play, and appropriate compensation would automatically come to the workplace.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTell your customers exactly what a product or serv-ice costs you to provide. Put those two numbers on your price tag: your cost and your price. Can you still be proud of what you are asking? Do you encounter any fear that someone will think you are “ripping them off” should they know your cost/price ratio? If so, look to see what kind of adjustment you want to make in your pricing to bring it back down into the realm of basic fairness, rather than “get what you can while the gettin’s good.”\u003c/p\u003e \n\u003cp\u003eI dare you to do this. I dare you.\u003c/p\u003e \n\u003cp\u003eIt will require a complete change in your thinking. You will have to be just as concerned with your custom-ers or clients as you are with yourself.\u003c/p\u003e \n\u003cp\u003eYes, you can begin to build this New Society right now, right here, today. The choice is yours. You can continue to support the old system, the present para-digm, or you can blaze the trail and show your world a new way.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou can be that new way. In everything. Not just in business, not just in your personal relationships, not just in politics or economics or religion or this aspect or that of the overall life experience, but in everything.\u003c/p\u003e \n\u003cp\u003eBe the new way. Be the higher way. Be the grandest way. Then you can truly say, I am the way and the life. Follow me.\u003c/p\u003e \n\u003cp\u003eIf the whole world followed you, would you be pleased with where you took it?\u003c/p\u003e \n\u003cp\u003eLet that be your question for the day.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/243/616.html","bookId":36,"creation":"Aug 1, 2019 2:45:44 AM","modification":"Aug 1, 2019 2:45:44 AM"}
