{"id":1026,"no":52,"title":"Part 3 Chapter 12","content":"\u003cp\u003eI am filled with awe and reverence at the reading of those words. Thank You for being here with me in this way. Thank You for being here with all of us. For millions have read the words in these dialogues, and millions more will yet do so. And we are breathlessly gifted by the coming of You to our hearts.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMy dearest beings—I have always been in your hearts. I am only glad you can now actually feel Me there. I have always been with you. I have never left you.\u003c/p\u003e \n\u003cp\u003eI am you, and you are Me, and We shall never be sepa-rated, ever, because that is not possible.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYet on some days I feel so terribly alone. At some moments I feel that I am fighting this battle by myself.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat’s because you have left Me, My child. You have abandoned your awareness of Me. Yet where there is awareness of Me, you can never be alone.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow can I stay in my awareness?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBring your awareness to others. Not by proselytizing, but by example. Be the source of the love which I Am in the lives of all others. For that which you give to others, you give to yourself. Because there is only One of Us.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThank You. Yes, You have given me that clue before. Be the source. Whatever you want to experience in yourself, You have said, be the source of it in the lives of others.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. This is the great secret. This is the sacred wis-dom. Do unto others as you would have it done unto you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAll of your problems, all of your conflicts, all of your difficulties in creating a life on your planet of peace and joy are based in your failure to understand this simple instruction, and to follow it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI get it. Once more You have said it so plainly, so clearly, that I get it. I will try never to “lose it” again.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou cannot ‘lose” that which you give away. Always remember that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThank You. May I ask You a few more questions now about the soul?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI have one more general comment to make about life as you’re living it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003ePlease.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou just said that there are times when you feel as though you’re fighting this battle by yourself.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat battle?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt was a figure of speech.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI think not. I think it was a real indicator of how you (and many people) really think of life.\u003c/p\u003e \n\u003cp\u003eYou have it in your head that it’s a “battle”—that there is some kind of struggle going on here.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, it’s seemed that way to me sometimes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt is not that way inherently, and it doesn’t have to seem that way, ever.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou’ll forgive me, but that’s hard for me to believe.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhich is exactly why it hasn’t been your reality. For you will make real what you believe is real. Yet I tell you this: Your life was never meant to be a struggle, and doesn’t have to be, now or ever.\u003c/p\u003e \n\u003cp\u003eI have given you the tools with which to create the grandest reality. You have simply chosen not to use them. Or, to be more accurate, you have misused them.\u003c/p\u003e \n\u003cp\u003eThe tools lam referring to here are the three tools of creation. We have talked about them much in our on-going dialogue. Do you know what they are?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThought, word, and action.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood. You’ve remembered. I once inspired Mil-dred Hinckley, a spiritual teacher of Mine, to say, “You were born with the creative power of the universe at the tip of your tongue.”\u003c/p\u003e \n\u003cp\u003eThat is a statement of astonishing implications. As is this truth, from another of My teachers:\u003c/p\u003e \n\u003cp\u003e“As thou has believed, so be it done unto you.”\u003c/p\u003e \n\u003cp\u003eThese two statements have to do with thought and word. Another of My teachers had this to say, about ac-tion:\u003c/p\u003e \n\u003cp\u003e“The beginning is God. The end is action. Action is God creating—or Cod experienced.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou said that, in Book 1.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBook 1 was brought through by you, My son, just as all great teachings have been inspired by Me, and brought through human forms. Those who allow such inspirations to move them, and who fearlessly share them publicly, are My greatest teachers.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am not sure that I would put myself in that category.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe words you have been inspired to share have touched millions.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMillions, My son.\u003c/p\u003e \n\u003cp\u003eThey have been translated into 24 languages. They have reached around the world.\u003c/p\u003e \n\u003cp\u003eBy what measure would you grant the status of great teacher?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBy the measure of one’s actions, not one’s words.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat is a very wise answer.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd my actions in this lifetime do not speak well of me, and certainly do not qualify me as a teacher.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou’ve just written off half the teachers who have ever lived.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat are You saying?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m saying what I said through Judith Schucman in A Course in Miracles: You teach what you have to learn.\u003c/p\u003e \n\u003cp\u003eDo you believe that you must be demonstrating per-fection before you can teach how to reach it?\u003c/p\u003e \n\u003cp\u003eAnd while you have made your share of what you would call mistakes—\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e—more than my share—\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e—you have also shown great courage in bringing this conversation with Me forward.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOr great foolhardiness.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhy do you insist on putting yourself down like that? You all do it! Every one of you! You deny your own greatness as you deny the existence of Me in you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNot me! I have never denied that!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, not recently...\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI tell you, before the cock crows, you will deny Me three times.\u003c/p\u003e \n\u003cp\u003eEvery thought of your Self as smaller than you really are is a denial of Me.\u003c/p\u003e \n\u003cp\u003eEvery word about your Self that puts you down is a denial of Me.\u003c/p\u003e \n\u003cp\u003eEvery action flowing through your Self that plays out a role of “not-good-enough,” or lack, or insufficiency of any kind, is a denial indeed. Not just in thought, not just in word, but in deed.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI really—\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e—Do not allow your life to represent anything but the grandest version of the greatest vision you ever had about Who You Are.\u003c/p\u003e \n\u003cp\u003eNow, what is the greatest vision you’ve ever had for your Self? Is it not that you would one day be a great teacher?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell...\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIsn’t it?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThen so be it. And so it is. Until you once again deny it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI won’t deny it again.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou won’t?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eProve it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eProve it?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eProve it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSay, right now, “I am a great teacher.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUh...\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eCo ahead, say it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am .. . . you see, the problem is, all of this is going to be pub-lished. I am aware that everything I am writing on this legal pad is going to appear in print somewhere. People in Peoria are go-ing to be reading this.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003ePeoria! Ha! Try Beijing!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOkay, China, too. That’s my point. People have been asking me—bugging me—about Book 3 since the month after Book 2 came out! I’ve tried to explain why it’s taken so long. I’ve tried to get them to understand what it’s like having this dialogue when you know the whole world is watching, waiting. It’s not like it was with Book 1 and Book 2. Both of those were dialogues con-ducted in a void. I never even knew they would be books.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, you did. In your heart of hearts you did.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, maybe I hoped they’d be. But now I know, and it’s dif-ferent writing on this legal pad.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBecause now you know everyone will be reading every word you write.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. And now You want me to say that I’m a great teacher. And it’s difficult in front of all these people.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou want I should ask you to declare yourself in pri-vate? Is that how you think you empower yourself?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI asked you to declare Who You Are in public pre-cisely because you are in public here. The whole idea was to get you to say it in public.\u003c/p\u003e \n\u003cp\u003ePublic declaration is the highest form of visioning.\u003c/p\u003e \n\u003cp\u003eLive the grandest version of the greatest vision you\u003c/p\u003e \n\u003cp\u003eever had about Who You Are. Begin the living of it by declaring it.\u003c/p\u003e \n\u003cp\u003ePublicly.\u003c/p\u003e \n\u003cp\u003eThe first step in making it so is saying it is so.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut what of modesty? What of decorum? Is it seemly to de-clare our grandest idea about ourselves to everyone we see?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eEvery great master has done so.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, but not arrogantly.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow “arrogant” is “I am the life and the way”? Is that arrogant enough for you?\u003c/p\u003e \n\u003cp\u003eNow you said you would never deny Me again, yet you’ve spent the last ten minutes trying to justify doing so.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m not denying You. We are talking here about my greatest vision of me.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYour greatest vision of you is Me! That is Who lAm!\u003c/p\u003e \n\u003cp\u003eWhen you deny the greatest part of you, you deny Me. And I tell you, before the dawn tomorrow you will do this three times.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless I don’t.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless you don’t. That is right. And only you can de-cide. Only you can choose.\u003c/p\u003e \n\u003cp\u003eNow, do you know of any great teacher who was ever a great teacher in private? The Buddha, jesus, Krishna—all were teachers in public, no?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. But there are great teachers who are not widely known. My mother was one. You just said so earlier. It is not necessary to be widely known to be a great teacher.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYour mother was a harbinger. A messenger. A pre-parer of the way. She prepared you for the way, by showing you the way. Yet you, too, are a teacher.\u003c/p\u003e \n\u003cp\u003eAnd as good a teacher as you know your mother to be, she apparently did not teach you never to deny yourself. Yet this you will teach others.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh, I want to so badly! That is what I want to do!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDo not “want to.” You may not have what you “want.” You merely declare that you are in “want” of it, and that’s where you will be left—you will be left want-ing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAll right! Okay! I don’t “want” to, I choose to!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat’s better. That’s much better. Now what do you choose?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI choose to teach others never to deny themselves.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood, and what else do you choose to teach?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI choose to teach others never to deny You—God. Because to deny You is to deny themselves, and to deny themselves is to deny You.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood. And do you choose to teach this haphaz-ardly, almost “by chance”? Or do you choose to teach this grandly, as if on purpose?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI choose to teach it on purpose. Grandly. As my mother did. My mother did teach me never to deny my Self. She taught it to me every day. She was the greatest encourager I ever had. She taught me to have faith in myself, and in You. I should be such a teacher. I choose to be such a teacher of all the great wisdoms my Mom taught me. She made her whole life a teaching, not just her words. That’s what makes a great teacher.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou are right, your mother was a great teacher. And you were right in your larger truth. A person does not have to be widely known to be a great teacher.\u003c/p\u003e \n\u003cp\u003eI was “testing” you. I wanted to see where you’d go with this.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd did I “go” where I was “supposed to go”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou went where all great teachers go. To your own wisdom. To your own truth. That is the place to which you must always go, for it is the place you must turn around and come from as you teach the world.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI know. This I know.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd what is your own deepest truth about Who You Are?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am...\u003c/p\u003e \n\u003cp\u003e...\u003c/p\u003e \n\u003cp\u003e. . . a great teacher.\u003c/p\u003e \n\u003cp\u003eA great teacher of eternal truth.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere you have it. Calmly said, softly spoken. There you have it. You know the truth of it in your heart, and you have only spoken your heart.\u003c/p\u003e \n\u003cp\u003eYou are not boasting, and no one will hear it as boasting. You are not bragging, and no one will hear it as bragging. You are not beating your chest, you are opening your heart, and there’s a big difference.\u003c/p\u003e \n\u003cp\u003eEveryone knows Who They Are in their heart. They are a great ballerina, or a great lawyer, or a great actor, or a great first baseman. They are a great detective, or a great salesperson, or a great parent, or a great architect; a great poet or a great leader, a great builder or a great healer. And they are, each and every one, a great per-son.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eEveryone knows Who They Are in their heart. If they open their heart, if they share with others their heart’s desire, if they live their heartfelt truth, they fill their world with magnificence.\u003c/p\u003e \n\u003cp\u003eYou are a great teacher. And where do you suppose that gift comes from?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd so, when you declare yourself to be Who You Are, you are merely declaring who I Am. Always declare Me as Source, and no one will mind you declaring your -self as great.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYet You’ve always urged me to declare myself as Source.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou are the Source—of everything I Am. The great teacher with whom you are most familiar in your life said, “I am the life and the way.”\u003c/p\u003e \n\u003cp\u003eHe also said, “All these things come to Me from the Father. Without the Father, I am nothing.”\u003c/p\u003e \n\u003cp\u003eAnd he also said, “I and the Father are One.”\u003c/p\u003e \n\u003cp\u003eDo you understand?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere is only One of us.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExactly.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhich brings us back to the human soul. Can I now ask some more questions about the soul?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eCo.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOkay. How many souls are there?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOne.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, in the largest sense. But how many “individuations” of the One That Is All are there?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSay, I like that word there. I like the way you’ve used\u003c/p\u003e \n\u003cp\u003ethat word. The One Energy that is All Energy individu-ates Itself into many different parts. I like that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m glad. So how many individuations did You create? How many souls are there?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI cannot answer that in terms you would under-stand.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTry me. Is it a constant number? A changing number? An in-finite number? Have You created “new souls” since the “origi-nal batch”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, it is a constant number. Yes, it is a changing number. Yes, it is an infinite number. Yes, I have cre-ated new souls, and no, I have not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI don’t understand.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI know.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo help me.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDid you actually say that?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSay what?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e“So help me, God?”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAh, clever. Okay, I am going to understand this if it is the last thing I do, so help me, God.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI will. You are very determined, so I will help you—although I warn you that it is difficult to grasp or understand the infinite from a perspective that is finite. We will nevertheless give it a whirl.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eCoolness!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, coolness. Well, let’s begin by noticing that your questions infer that a reality exists called time. In truth, there is no such reality. There is only one moment, and that is the eternal moment of Now.\u003c/p\u003e \n\u003cp\u003eAll things that have ever happened, are happening Now, and ever will happen, are occurring in this mo-ment. Nothing has happened “before,” because there is no before. Nothing will happen “after,” because there is no after. It is always and only Right Now.\u003c/p\u003e \n\u003cp\u003eIn the Right Now of things, I am constantly chang-ing. The number of ways in which I “individuate” (I like your word!) is therefore always different, and always the same. Given that there is only Now, the number of souls is always constant. But given that you like to think of Now in terms of now and then, it is always changing. We touched on this earlier when we spoke of reincarna-tion, and lower life forms, and how souls “come back.”\u003c/p\u003e \n\u003cp\u003eSince I am always changing, the number of souls is infinite. Yet at any given “point in time” it appears to be finite.\u003c/p\u003e \n\u003cp\u003eAnd yes, there are “new souls” in the sense that they have allowed themselves, having reached ultimate awareness and unified with ultimate reality, to volun-tarily “forget” everything and “start over”—they have decided to move to a new place on the Cosmic Wheel, and some have chosen to be “young souls” again. Yet all souls are part of the original batch, since all are being created (were created, will be created) in the Only Mo-ment of Now.\u003c/p\u003e \n\u003cp\u003eSo the number is finite and infinite, changing and unchanged, depending on how you look at it.\u003c/p\u003e \n\u003cp\u003eBecause of this characteristic of ultimate reality, I am often called The Unmoved Mover. I am that which is Always Moving, and has Never Moved, is Always Changing and has Never Changed.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOkay. I get it. Nothing is absolute with You.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExcept that everything is absolute.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless it’s not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExactly. Precisely. You do “get it!” Bravo.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, the truth is, I think I have always understood this stuff.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExcept when I haven’t.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat’s right.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless it’s not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExactly.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWho’s on first.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo, What’s on first. Who’s on second.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTa-da! So You’re Abbott and I’m Costello, and it’s all just a cosmic vaudeville show.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExcept when it’s not. There are moments and events you may want to take very seriously.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless I don’t.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless you don’t.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo, returning once again to the subject of souls...\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBoy, that’s a great book title there . . . . The Subject of Souls.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMaybe we’ll do that one.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAre you kidding? We already have.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless we haven’t.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat’s true.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless it’s not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou never know.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExcept when you do.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou see? You are getting this. You’re remembering now how it really is, and you’re having fun with it! You’re returning now to “living lightly.” You’re lighten-ing up. This is what is meant by enlightenment.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eCool.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eVery cool. Which means you’re hot!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYup. That’s called “living within the contradiction.” You’ve talked about it many times. Now, getting back to the subject of souls; what’s the difference between an old soul and a young soul?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eA body of energy (that is to say, a part of Me) can conceive of itself as “young” or “old,” depending upon what it chooses after it reaches ultimate awareness.\u003c/p\u003e \n\u003cp\u003eWhen they return to the Cosmic Wheel, some souls choose to be old souls, and some choose to be “young.”\u003c/p\u003e \n\u003cp\u003eIndeed, if the experience called “young” did not ex-ist, neither could the experience called “old.” So some souls have “volunteered” to be called “young,” and some to be called “old,” so that the One Soul, which is really All There Is, could know itself completely.\u003c/p\u003e \n\u003cp\u003eSimilarly, some souls have chosen to be called “good,” and some “bad,” for exactly the same reason. And this is why no soul is ever punished. For why would the One Soul want to punish a Part of Itself for being a portion of the Whole?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis is all beautifully explained in the children’s storybook The Little Soul and The Sun, which lays it out simply, for a child to understand.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have a way of putting things so eloquently, of articulat-ing terribly complex concepts so clearly, that even a child can understand.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThank you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo here comes another question about souls. Are there such things as “soul partners”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, but not the way you think of them.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat’s different?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have romanticized “soul partner” to mean the “other half of you.” In truth, the human soul—the part of Me that “individuates”—is much larger than you have imagined.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIn other words, what I call the soul is bigger than I think.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMuch bigger. It is not the air in one room. It is the air in one entire house. And that house has many rooms. The “soul” is not limited to one identity. It is not the ~ in the dining room. Nor does the soul “split” into two individuals who are called soul partners. It is not the “air in the living room-dining room combination. It is the “air” in the whole mansion.\u003c/p\u003e \n\u003cp\u003eAnd in My kingdom there are many mansions. And while it is the same air flowing around, in, and through every mansion, the air of the rooms in one mansion may feel “closer.” You might walk into those rooms and say, “It feels ‘close’ in there.”\u003c/p\u003e \n\u003cp\u003eSo that you understand, then—there is only One Soul. Yet what you call the individuated soul is huge, hoveringover, in, and through hundreds of physical forms.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAt the same time?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere is no such thing as time. I can only answer this by saying, “Yes, and no.” Some of the physical forms en-veloped by your soul are “living now,” in your under-standing. Others individuated in forms that are now what you would call “dead.” And some have enveloped forms that live in what you call the “future.” It’s all hap-pening right now, of course, and yet, your contrivance called time serves as a tool, allowing you a greater sense of the realized experience.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo, these hundreds of physical bodies my soul has “envel-oped”—that’s an interesting word You’ve used—are all my “soul partners”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat’s closer to being accurate than the way you have been using the term, yes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd some of my soul partners have lived before?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. As you would describe it, yes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhoa. Hold it! I think I just got something here! Are these parts of me that have lived “before” what I would now describe as my “former lives”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood thinking! You are getting it! Yesl Some of these are the “other lives” you’ve lived “before.” And some are not. And other parts of your soul are envelop-ing bodies that will be alive in what you call your future. And still others are embodied in different forms living on your planet right now.\u003c/p\u003e \n\u003cp\u003eWhen you run into one of these, you may feel an immediate sense of affinity. Sometimes you may even say, “We must have spent a ‘past life’ together.” And you will be right. You have spent a “past life” together. Either as the same physical form, or as two forms in the same Space-Time Continuum.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis is fabulous! This explains everything! Yes, it does.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExcept one thing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat’s that?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow about when I just know that I’ve spent a “past life” with someone—I just know it; I feel it in my bones—and yet, when I mention this to them, they feel none of this at all? What’s that about?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt’s about your confusingthe “past” with the “future.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHuh?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have spent another life with them—it’s just not a past life.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt’s a “future life”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003ePrecisely. It’s all happening in the Eternal Moment of Now, and you have an awareness of what, in a sense, has not yet happened.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThen why don’t they “remember” the future, too?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThese are very subtle vibrations, and some of you are more sensitive to them than others. Also, from per-son to person it is different. You may be more “sensi-tive” to your “past” or “future” experience with one person than another. This usually means you’ve spent that other time as the part of your very huge soul envel-oping the same body, whereas when there is still that sensation of “having met before,” but just not as strong of one, it may mean that you shared the same “time” to-gether, but not the same body. Perhaps you were (or will be) husband and wife, brother and sister, parent and child, lover and beloved.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThese are strong bonds, and it is natural that you would feel them when you “meet again” for the “first time” in “this” life.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIf what You are saying is true, it would account for a phenomenon for which I have never before been able to ac-count—the phenomenon of more than one person in this “life-time” claiming to have memories of being Joan of Arc. Or Mozart. Or some other famous person from the “past.” I have always thought this was proof for those who say that reincarna-tion is a false doctrine, for how could more than one person claim to have been the same person before? But now I see how this is possible! All that has happened is that several of the sen-tient beings now being enveloped by one soul are “re-membering” (becoming members once again with) the part of their single soul which was (is now) Joan of Arc.\u003c/p\u003e \n\u003cp\u003eGood heavens, this blows the lid off all limitations, and makes all things possible. The minute I catch myself, in the fu-ture, saying “that’s impossible,” I’ll know that all I’m doing is demonstrating that there’s a great deal I don’t know.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat is a good thing to remember. A very good thing to remember.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd, if we can have more than one “soul partner,” that would explain how it is possible for us to experience those in-tense “soul partner feelings” with more than one person a life-time—and even more than one person at a time!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIndeed.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThen it is possible to love more than one person at a time.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOf course.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo, no. I mean, with the kind of intense, personal love that we usually reserve for one person—or, at least, one person at a time!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhy would you ever want to “reserve” love? Why would you want to hold it “in reserve”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBecause it’s not right to love more than one person “that way.” It’s a betrayal.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWho told you that?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eEverybody. Everybody tells me that. My parents told me that. My religion told me that. My society tells me that. Every-body tells me that!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThese are some of those “sins of the father” being passed onto the son.\u003c/p\u003e \n\u003cp\u003eYour own experience teaches you one thing—that loving everyone full out is the most joyful thing you can do. Yet your parents, teachers, ministers tell you something else—that you may only love one person at a time “that way.” And we’re not just talking about sex here. If you consider one person as special as another in anyway, you are often made to feel that you have betrayed that other.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eRight! Exactly! That’s how we’ve got it set up!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThen you are not expressing true love, but some counterfeit variety.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTo what extent will true love be allowed to express itself within the framework of the human experience? What limits shall we—indeed, some would say must we—place on that ex-pression? If all social and sexual energies were to be unleashed without restriction, what would be the result? Is complete so-cial and sexual freedom the abdication of all responsibility, or the absolute height of it?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAny attempt to restrict the natural expressions of love is a denial of the experience of freedom—and thus a denial of the soul itself. For the soul is freedom personified. God is freedom, by definition—for God is limitless and without restriction of any kind. The soul is God, miniaturized. Therefore, the soul rebels at any im-position of limitation, and dies a new death each time it accepts boundaries from without.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIn this sense, birth itself is a death, and death a birth. For in birth, the soul finds itself constricted within the awful limitations of a body, and at death escapes those constrictions again. It does the same thing during sleep.\u003c/p\u003e \n\u003cp\u003eBack to freedom the soul flies—and rejoices once again with the expression and experience of its true nature.\u003c/p\u003e \n\u003cp\u003eYet can its true nature be expressed and experi-enced while with the body?\u003c/p\u003e \n\u003cp\u003eThat is the question you ask—and it drives to the very reason and purpose of life itself. For if life with the body is nothing more than a prison or a limitation, then what good can come of it, and what can be its function, much less its justification?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I suppose that is what I am asking. And I ask it on behalf of all beings everywhere who have felt the awful constrictions of the human experience. And I am not speaking now of physi-cal limitations—\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e—I know you are not—\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e—but emotional and psychological ones.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I know. I understand. Yet your concerns all re-late to the same larger question.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, all right. Still, let me finish. All my life I have been deeply frustrated by the world’s inability to let me love every -one in exactly the way I’ve wanted to.\u003c/p\u003e \n\u003cp\u003eWhen I was young, it was about not talking to strangers, not saying things inappropriately. I remember once, walking down a street with my father, we came across a poor man, begging for coins. I immediately felt sorry for the man and wanted to give him some of the pennies in my pocket. My father stopped me, and brushed me past. “Trash,” he said. “That’s just trash.” That was my father’s label for all those who did not live up to his definitions of what it meant to be humans of worth.\u003c/p\u003e \n\u003cp\u003eLater, I remember an experience of my older brother, who was no longer living with us, not being allowed into the house on Christmas Eve because of some argument he’d had with my father. I loved my brother and wanted him to be with us that night, but my father stopped him on the front porch and barred him from entering the home. My mother was devastated (it was her son from a previous marriage), and I was simply mystified. How could we not love or want my brother on Christmas Eve simply because of an argument?\u003c/p\u003e \n\u003cp\u003eWhat kind of disagreement could be so bad that it would be allowed to ruin Christmas, when even wars were suspended for a 24-hour truce? This, my little seven-year-old heart begged to know.\u003c/p\u003e \n\u003cp\u003eAs I grew older, I learned that it was not just anger that stopped the love from flowing, but also fear. This was why we oughtn’t talk to strangers—but not just when we were defense-less children. Also when we were adults. I learned that it was just not okay to openly and eagerly meet and greet strangers, and that there was a certain etiquette to be followed with peo-ple to whom you’ve just been introduced—none of which made sense to me. I wanted to know everything about that new person and I wanted them to know everything about me! But no. The rules said we had to wait.\u003c/p\u003e \n\u003cp\u003eAnd now, in my adult life, when sexuality enters into it, I’ve learned that the rules are even more rigid and limiting. And I still don’t get it.\u003c/p\u003e \n\u003cp\u003eI find that I just want to love and be loved—that I just want to love everyone in whatever way feels natural to me, in what-ever way feels good. Yet society has its rules and regulations about all this—and so rigid are they that even if the other person who is involved agrees to an experience, if society doesn’t agree, those two lovers are called “wrong,” and are thus doomed.\u003c/p\u003e \n\u003cp\u003eWhat is that? What is that all about?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, you’ve said it yourself. Fear.\u003c/p\u003e \n\u003cp\u003eIt’s all about fear.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, but are these fears justified? Aren’t these restrictions and constrictions only appropriate, given the behaviors of our race? A man meets a younger woman, falls in love (or “in lust”) with her, and leaves his wife, for instance. I use only one exam-ple. So there she is, left with the kids and no employment skills at thirty-nine or forty-three-—or, worse yet, left high and dry at sixty-four by a sixty-eight-year-old man who’s become enam-ored of a woman younger than his daughter.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIs it your supposing that the man you describe has ceased to love his sixty-four-year-old wife?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, he sure acts like it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo. It is not his wife he does not love, and seeks to escape. It is the limitations he feels placed on him.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh, nonsense. It’s lust, pure and simple. It’s an old geezer simply trying to recapture his youth, wanting to be with a younger woman, unable to curb his childish appetites and keep his promise to the partner who has remained with him through all the tough and lean years.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOf course. You’ve described it perfectly. Yet noth-ing you have said has changed a thing that I have said. In virtually every case, this man has not stopped loving his wife. It is the limitations his wife places on him, or those placed on him by the younger woman who will have nothing to do with him if he stays with his wife, that cre-ates the rebellion.\u003c/p\u003e \n\u003cp\u003eThe point I am trying to make is that the soul will al-ways rebel at limitation. Of any kind. That is what has sparked every revolution in the history of humankind, not just the revolution which causes a man to leave his wife—or a wife to suddenly leave her husband. (Which, by the way, also happens.)\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSurely You are not arguing for the complete abolition of behavioral limitations of any kind! That would be behavioral anarchy. Social chaos. Surely You are not advo-cating people having “affairs”—or, take my breath away, open marriage!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI do not advocate, or fail to advocate, anything. I am not “for” or “against” anything. The human race keeps trying to make me a “for” or “against” kind of God, and I am not that.\u003c/p\u003e \n\u003cp\u003eI merely observe what is so. I simply watch you cre-ate your own systems of right and wrong, for and against, and I look to see whether your current ideas about that serve you, given what you say you choose and desire as a species, and as individuals.\u003c/p\u003e \n\u003cp\u003eNow, to the question of “open marriage.”\u003c/p\u003e \n\u003cp\u003eI am not for or against “open marriage.” Whether you are or not depends upon what you decide you want in, and out of, your marriage. And your decision about that creates Who You Are with regard to the ex-perience you call “marriage.” For it is as I have told you:\u003c/p\u003e \n\u003cp\u003eEvery act is an act of self-definition.\u003c/p\u003e \n\u003cp\u003eWhen making any decision, it is important to make sure the right question is being answered. The question with regard to so-called “open marriage,” for instance, is not “shall we have an open marriage where sexual contact by both parties with persons outside the mar-riage is allowed?” The question is “Who Am I—and Who Are We—with regard to the experience called marriage?”\u003c/p\u003e \n\u003cp\u003eThe answer to that question will be found in the an-swer to life’s largest question: Who Am I—period—with regard to anything, in relationship to anything; Who Am I, and Who Do I Choose to Be?\u003c/p\u003e \n\u003cp\u003eAs I have said repeatedly throughout this dialogue, the answer to that question is the answer to every ques-tion.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGod, that frustrates me. Because the answer to that question is so broad and so general that it answers no other question at all.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh, really? Then what is your answer to that ques-tion?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAccording to these books—according to what You seem to be saying in this dialogue—I am “love.” That is Who I Really Am.\u003c/p\u003e \n\u003cp\u003eExcellent! You have learned! That is correct. You are love. Love is all there is. So you are love, I am love, and there is nothing which is not love.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat about fear?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eFear is that which you are not. Fear is False Evidence Appearing Real. Fear is the opposite of love, which you have created in your reality so that you may know expe-rientially That Which You Are.\u003c/p\u003e \n\u003cp\u003eThis is what is true in the relative world of your exis-tence: In the absence of that which you are not, that which you are . . .\u0026nbsp; is not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, yes, we’ve been through this a number of times now in our dialogue. But it feels as though You have evaded my complaint. I said that the answer to the question of Who We Are (which is love) is so broad as to render it a nonanswer—it is no answer at all—to almost any other question. You say it is the answer to every question, and I say it is not the answer to any—much less to one as specific as “Should our marriage be an open mar-riage?”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIf that is true for you, it is because you do not know what love is.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDoes anybody? The human race has been trying to figure that one out since the beginning of time.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhich does not exist.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhich does not exist, yes, yes, I know. It’s a figure of speech.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eLet me see if I can find, using your “figures of speech,” some words and some ways to explain what love is.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSuper. That’d be great.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe first word that comes to mind is unlimited. That which is love is unlimited.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, we’re right where we were when we opened this sub-ject. We’re going around in circles.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eCircles are good. Don’t berate them. Keep circling; keep circling around the question. Circling is okay. Re-peating is okay. Revisiting, restating is okay.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI sometimes get impatient.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSometimes? That’s pretty funny.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOkay, okay, go on with what You were saying.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eLove is that which is unlimited. There is no begin-ning and no end to it. No before and no after. Love al-ways was, always is, and always will be.\u003c/p\u003e \n\u003cp\u003eSo love is also always. It’s the always reality.\u003c/p\u003e \n\u003cp\u003eNow we get back to another word we used be-fore—freedom. For if love is unlimited, and always, then love is. . . free. Love is that which is perfectly free.\u003c/p\u003e \n\u003cp\u003eNow in the human reality, you will find that you al-ways seek to love, and to be loved. You will find that you will always yearn for that love to be unlimited. And you will find that you will always wish you could be free to express it.\u003c/p\u003e \n\u003cp\u003eYou will seek freedom, unlimitedness, and eternal-ity in every experience of love. You may not always get it, but that is what you will seek. You will seek this be-cause this is what love is, and at some deep place you know that, because you are love, and through the ex-pression of love you are seeking to know and to experi-ence Who and What You Are.\u003c/p\u003e \n\u003cp\u003eYou are life expressing life, love expressing love, God expressing God.\u003c/p\u003e \n\u003cp\u003eAll these words are therefore synonymous. Think of them as the same thing:\u003c/p\u003e \n\u003cp\u003eGod\u003c/p\u003e \n\u003cp\u003eLife\u003c/p\u003e \n\u003cp\u003eLove\u003c/p\u003e \n\u003cp\u003eUnlimited\u003c/p\u003e \n\u003cp\u003eEternal\u003c/p\u003e \n\u003cp\u003eFree\u003c/p\u003e \n\u003cp\u003eAnything which is not one of these things is not any of these things.\u003c/p\u003e \n\u003cp\u003eYou are all of those things, and you will seek to expe-rience yourself as all of these things sooner or later.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat does that mean, “sooner or later”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt depends on when you get over your fear. As I’ve said, fear is False Evidence Appearing Real. It is that which you are not.\u003c/p\u003e \n\u003cp\u003eYou will seek to experience That Which You Are when you are through experiencing that which you are not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWho wants to experience fear?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNobody wants to; you are taught to.\u003c/p\u003e \n\u003cp\u003eA child experiences no fear. He thinks he can do anything. Nor does a child experience lack of freedom. She thinks she can love anyone. Nor does a child expe-rience lack of life. Children believe they will live for-ever—and people who act like children think nothing can hurt them. Nor does a child know any ungodly things—until that child is taught ungodly things by grownups.\u003c/p\u003e \n\u003cp\u003eAnd so, children run around naked and hug every-one, thinking nothing of it. If adults could only do the same thing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, children do so with the beauty of innocence. Adults cannot get back to that innocence, because when adults “get naked” there is always that sex thing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. And, of course, God forbid that “that sex thing” be innocent and freely experienced.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eActually, God did forbid it. Adam and Eve were perfectly happy running around naked in the Garden of Eden until Eve ate of the fruit of the tree—the Knowledge of Good and Evil. Then You condemned us to our present state, for we are all guilty of that original sin.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI did no such thing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI know. But I had to give organized religion a shot here.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTry to avoid that if you can.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I should. Organized religionists have very little sense of humor.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere you go again.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSorry.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI was saying.. . you will strive as a species to experi-ence a love that is unlimited, eternal, and free. The in-stitution of marriage has been your attempt at creating eternality. With it, you agreed to become partners for life. But this did little to produce a love which was “un-limited” and “free.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhy not? If the marriage is freely chosen, isn’t it an expres-sion of freedom? And to say that you are going to demonstrate your love sexually with no one else but your spouse is not a limitation, it’s a choice. And a choice is not a limitation, it is the exercise of freedom.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo long as that continues to be the choice, yes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, it has to be. That was the promise.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes—and that’s where the trouble begins.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHelp me here.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eLook, there may come a time when you want to experience a high degree of specialness in a relation-ship. Not that one person is more special to you than another, but that the way you choose to demonstrate with one person the depth of love you have for all people—and for life itself—is unique to that person alone.\u003c/p\u003e \n\u003cp\u003eIndeed, the way you now demonstrate love to each person you do love is unique. You demonstrate your love to no two people in exactly the same way. Because you are a creature and a creator of originality, every-thing you create is original. It is not possible for any thought, word, or action to be duplicative. You cannot duplicate, you can only originate.\u003c/p\u003e \n\u003cp\u003eDo you know why no two snowflakes are alike? Be-cause it is impossible for them to be. “Creation” is not “duplication,” and the Creator can only create.\u003c/p\u003e \n\u003cp\u003eThat is why no two snowflakes are alike, no two people are alike, no two thoughts are alike, no two rela-tionships are alike, and no two of anything are alike.\u003c/p\u003e \n\u003cp\u003eThe universe-and every thing in it—exists in singu-lar form, and there truly is nothing else like it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis is the Divine Dichotomy again. Everything is singular, yet everything is One.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eExactly. Each finger on your hand is different, yet it is all the same hand. The air in your house is the air that is everywhere, yet the air from room to room is not the same, but feels markedly different.\u003c/p\u003e \n\u003cp\u003eIt is the same with people. All people are One, yet no two people are alike. You could not, therefore, love two people in the same way even if you tried—and you would never want to, because love is a unique response to that which is unique.\u003c/p\u003e \n\u003cp\u003eSo when you demonstrate your love for one person, you are doing so in a way in which you cannot do so with another. Your thoughts, words, and actions—your responses—are literally impossible to duplicate—one of a kind . . .\u0026nbsp; . . . just as is the person for whom you have these feelings.\u003c/p\u003e \n\u003cp\u003eIf the time has come when you have desired this special demonstration with one person alone, then choose it, as you say. Announce it, and declare it. Yet make your declaration an announcement moment-to-moment of your freedom, not your ongoing obligation. For true love is always free, and obligation cannot exist in the space of love.\u003c/p\u003e \n\u003cp\u003eIf you see your decision to express your love in a particular way with only one particular other as a sacred promise, never to be broken, the day may come when you will experience that promise as an obligation—and you will resent it. Yet if you see this decision not as a promise, made only once, but as a free choice, made over and over, that day of resentment will never come.\u003c/p\u003e \n\u003cp\u003eRemember this: There is only one sacred prom-ise-and that is to tell and live your truth. All other promises are forfeitures of freedom, and that can never be sacred. For freedom is Who You Are. If you forfeit freedom, you forfeit your Self. And that is not a sacra-ment, that is a blasphemy.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/243/634.html","bookId":36,"creation":"Aug 1, 2019 2:46:35 AM","modification":"Aug 1, 2019 2:46:35 AM"}
