{"id":1028,"no":54,"title":"Part 3 Chapter 14","content":"\u003cp\u003eI am filled with awe and reverence at the reading of those words. Thank You for being here with me in this way. Thank You for being here with all of us. For millions have read the words in these dialogues, and millions more will yet do so. And we are breathlessly gifted by the coming of You to our hearts.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMy dearest beings—I have always been in your hearts. I am only glad you can now actually feel Me there.\u003c/p\u003e \n\u003cp\u003eI have always been with you. I have never left you. I am you, and you are Me, and We shall never be sepa-rated, ever, because that is not possible.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHey, wait a minute! This feels like déj? vu. Didn’t we just say all of these words before?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOf course! Read the beginning of Chapter 12. Only now they mean even more than they meant the first time.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWouldn’t it be neat if déj? vu was real, and that we really are sometimes experiencing something “over again” so that we can get more meaning out of it?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat do you think?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI think that’s exactly what’s sometimes happening!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless it’s not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUnless it’s not!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood. Bravo again. You are moving so rapidly, so quickly, to massive new understandings that it is getting scary.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, isn’t it—? Now, I have something serious I need to dis-cuss with You.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I know. Go ahead.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhen does the soul join the body?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhen do you think?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhen it chooses to.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut people want a more definitive answer. They want to know when life begins. Life as they know it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI understand.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo what is the signal? Is it the emergence of the body from the womb—the physical birth? Is it the moment of conception, the physical joining of the elements of physical life?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eLife has no beginning, because life has no end. Life merely extends; creates new forms.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt must be like that gloppy material in those heated lava lamps that were so popular in the Sixties. The globs would lay in big, soft, round balls at the bottom, then rise from the heat, separating and forming new globs, shaping themselves as they rose, rejoining each other at the top, cascading together to form even larger globs of the all, and starting all over again. There were never any “new” globs in the tube. It was all the same stuff reforming itself into what “looked like” new and different stuff The varieties were endless, and it was fascinating to watch the process unfold over and over again.\u003c/p\u003e \n\u003cp\u003eThat’s a great metaphor. That’s how it is with souls. The One Soul—which is really All There Is-reforms It-self into smaller and smaller parts of Itself. All the “parts” were there at the beginning. There are no “new” parts, merely portions of the All That Always Was, reforming Itself into what “looks like” new and different parts.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere’s a brilliant pop song written and performed by Joan Osborne that asks, “What if God was one of us? Just a slob like one of us?” I’m going to have to ask her to change the lyric line to: “What if God was one of us? Just a glob like one of us?”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHa! That’s very good. And you know, her song was a brilliant song. It pushed people’s buttons all over the place. People couldn’t stand the thought that I am no better than one of them.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat reaction is an interesting comment, not so much on God, but on the human race. If we consider it a blasphemy for God to be compared to one of us, what does that say about us?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat, indeed?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYet You are “one of us.” That’s exactly what You’re saying here. So Joan was right.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eShe certainly was. Profoundly right.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI want to get back to my question. Can You tell us anything about when life as we know it starts? At what point does the soul enter the body?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe soul doesn’t enter the body. The body is enve-loped by the soul. Remember what I said before? The body does not house the soul. It is the other way around.\u003c/p\u003e \n\u003cp\u003eEverything is always alive. There is no such thing as “dead.” There is no such state of being.\u003c/p\u003e \n\u003cp\u003eThat Which Is Always Alive simply shapes itself into a new form—a new physical form. That form is charged with living energy, the energy of life, always.\u003c/p\u003e \n\u003cp\u003eLife—if you are calling life the energy that I Am—is always there. It is never not there. Life never ends, so how can there be a point when life begins?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eC’mon, help me out here. You know what I’m trying to get at.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I do. You want Me to enter the abortion debate.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I do! I admit it! I mean, I’ve got God here, and I have a chance to ask the monumental question. When does life begin?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd the answer is so monumental, you can’t hear it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTry me again.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt never begins. Life never “begins,” because life never ends. You want to get into biological technicali-ties so that you can make up a “rule” based on what you want to call “God’s law” about how people should be-have-then punish them if they do not behave that way.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat’s wrong with that? That would allow us to kill doc-tors in the parking lots of clinics with impunity.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I understand. You have used Me, and what you have declared to be My laws, as justification for all sorts of things through the years.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh, come on! Why won’t You just say that terminating a pregnancy is murder!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou cannot kill anyone or anything.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo. But you can end its “individuation”! And in our lan-guage, that’s killing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou cannot stop the process wherein which a part of Me individually expresses in a certain way without the part of Me that is expressing in that way agreeing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat? What are You saying?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am saying that nothing happens against the will of God.\u003c/p\u003e \n\u003cp\u003eLife, and all that is occurring, is an expression of God’s will—read that, your will—made manifest.\u003c/p\u003e \n\u003cp\u003eI have said in this dialogue, your will is My will. That is because there is only One of Us.\u003c/p\u003e \n\u003cp\u003eLife is God’s will, expressing perfectly. If something was happening against God’s will, it couldn’t happen. By definition of Who and What God Is, it couldn’t hap-pen. Do you believe that one soul can somehow decide something for another? Do you believe that, as indi-viduals, you can affect each other in ways in which the other does not want to be affected? Such a belief would have to be based on the idea that you are separate from each other.\u003c/p\u003e \n\u003cp\u003eDo you believe that you can somehow affect life in a way in which God does not want life to be affected? Such a belief would have to be based on an idea that you are separate from Me.\u003c/p\u003e \n\u003cp\u003eBoth ideas are false.\u003c/p\u003e \n\u003cp\u003eIt is arrogant beyond measure for you to believe that you can affect the universe in a way with which the uni-verse does not agree.\u003c/p\u003e \n\u003cp\u003eYou are dealing with mighty forces here, and some of you believe that you are mightier than the mightiest force. Yet you are not. Nor are you less mighty than the mightiest force.\u003c/p\u003e \n\u003cp\u003eYou are the mightiest force. No more, no less. So let the force be with you!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAre You saying that I can’t kill anybody without his or her permission? Are You telling me that, at some higher level, everyone who has ever been killed has agreed to be killed?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou are looking at things in earthly terms and think-ing of things in earthly terms, and none of this is going to make sense to you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI can’t help thinking in “earthly terms.” I am here, right now, on the Earth!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI tell you this: You are “in this world, but not of it.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo my earthly reality is not reality at all?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDid you really think it was?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI don’t know.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou’ve never thought, “There’s something larger going on here”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, yes, sure I have.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell this is what’s going on. I’m explaining it to you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOkay. I got it. So I guess I can just go out now and kill any-body, because I couldn’t have done it anyway if they hadn’t agreed!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIn fact, the human race acts that way. It’s interesting that you’re having such a hard time with this, yet you’re going around acting as if it were true anyway.\u003c/p\u003e \n\u003cp\u003eOr, worse yet, you are killing people against their will, as if it didn’t matter!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, of course it matters! It’s just that what we want mat-ters more. Don’t You get it? In the moment we humans kill somebody, we are not saying that the fact that we’ve done that doesn’t matter. Why, it would be flippant to think that. It’s just that what we want matters more.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI see. So it’s easier for you to accept that it’s okay to kill others against their will. This you can do with impunity. It’s doing it because it is their will that you feel is wrong.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI never said that. That’s not how humans think.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt isn’t? Let Me show you how hypocritical some of you are. You say it is okay to kill somebody against their will so long as you have a good and sufficient reason for wanting them dead, as in war, for instance, or an execu-tion—or a doctor in the parking lot of an abortion clinic. Yet if the other person feels they have a good and suffi-cient reason for wanting themselves dead, you may not help them die. That would be “assisted suicide,” and that would be wrong!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou are making mock of me.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo, you are making mock of Me. You are saying that I would condone your killing someone against his will, and that I would condemn your killing someone in ac-cordance with his will.\u003c/p\u003e \n\u003cp\u003eThis is insane.\u003c/p\u003e \n\u003cp\u003eStill, you not only fail to see the insanity, you actually claim that those who point out the insanity are the ones who are crazy. You are the ones who have your head on straight, and they are just troublemakers.\u003c/p\u003e \n\u003cp\u003eAnd this is the kind of tortured logic with which you construct entire lives and complete theologies.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’ve never looked at it quite that way.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI tell you this: The time has come for you to look at things a new way. This is the moment of your rebirth, as an individual and as a society. You must re-create your world now, before you destroy it with your insanities.\u003c/p\u003e \n\u003cp\u003eNow listen to Me.\u003c/p\u003e \n\u003cp\u003eWe are All One.\u003c/p\u003e \n\u003cp\u003eThere is only One of Us.\u003c/p\u003e \n\u003cp\u003eYou are not separate from Me, and you are not separate from each other.\u003c/p\u003e \n\u003cp\u003eEverything We are doing, We are doing in concert with each other. Our reality is a co-created reality. If you terminate a pregnancy, We terminate a pregnancy. Your will is My will.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo individual aspect of Divinity has power over any other aspect of Divinity. It is not possible for one soul to affect another against its will. There are no victims and there are no villains.\u003c/p\u003e \n\u003cp\u003eYou cannot understand this from your limited per-spective; but I am telling you it is so.\u003c/p\u003e \n\u003cp\u003eThere is only one reason to be, do, or have any-thing—as a direct statement of Who You Are. If Who You Are, as an individual and as a society, is who you choose and desire to be, there is no reason to change anything. If, on the other hand, you believe there is a grander experience waiting to be had—an even greater expression of Divinity than the one currently manifest-ing—then move into that truth.\u003c/p\u003e \n\u003cp\u003eSince all of Us are co-creating, it may serve Us to do what we can to show others the way that some parts of Us wish to go. You can be a way-show-er, demonstrat-ing the life that you’d like to create, and inviting others to follow your example. You might even say, “I am the life and the way. Follow me.” But be careful. Some peo-ple have been crucified for making such statements.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThank You. I’ll heed the warning. I’ll keep a low profile.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI can see that you’re doing a real good job of that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, when you say you’re having a conversation with God, it’s not easy to keep a low profile.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAs others have discovered.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhich might be a good reason to keep my mouth shut.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt’s a little late for that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, whose fault is that?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI see what you mean.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt’s okay. I forgive You.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou do?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow can you forgive Me?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBecause I can understand why You did it. I understand why You came to me, and started this dialogue. And when I under-stand why something was done, I can forgive all the complica-tions that it may have caused or created.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHmmm. Now that’s interesting. Would that you could think of God as being so magnificent as you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTouché.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have an unusual relationship with Me. In some ways you think you could never be as magnificent as Me, and in other ways you think I cannot be as magnifi-cent as you.\u003c/p\u003e \n\u003cp\u003eDon’t you find that interesting?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eFascinating.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt’s because you think We are separated. These imaginings would leave you if you thought that We were One.\u003c/p\u003e \n\u003cp\u003eThis is the main difference between your cul-ture—which is a ‘taby” culture, really; a primitive cul-ture—and the highly evolved cultures of the universe. The most significant difference is that in highly evolved cultures, all sentient beings are clear that there is no separation between themselves and what you call “God.”\u003c/p\u003e \n\u003cp\u003eThey are also clear that there is no separation be-tween themselves and others. They know that they are each having an individual experience of the whole.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh, good. Now You’re going to get into the highly evolved societies of the universe. I’ve been waiting for this.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I think it’s time we explored that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut before we do, I simply must return one last time to the abortion issue. You’re not saying here that, because nothing can happen to the human soul against its will, it’s okay to kill people, are You? You’re not condoning abortion, or giving us a “way out” on this issue, are You?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am neither condoning nor condemning abortion, any more than I condone or condemn war.\u003c/p\u003e \n\u003cp\u003eThe people of every country think I condone the war they are fighting, and condemn the war that their opponent is fighting. The people of every nation be-lieve they have “God on their side.” Every cause as-sumes the same thing. Indeed, every person feels the same thing—or at least hopes it is true whenever any decision or choice is made.\u003c/p\u003e \n\u003cp\u003eAnd do you know why all creatures believe God is on their side? Because I am. And all creatures have an intuitive knowing of this.\u003c/p\u003e \n\u003cp\u003eThis is just another way of saying, “Your will for you is My will for you.” And that is just another way of say-ing, I have given you all free will.\u003c/p\u003e \n\u003cp\u003eThere is no free will if to exercise it in certain ways produces punishment. That makes a mockery of free will and renders it counterfeit.\u003c/p\u003e \n\u003cp\u003eSo with regard to abortion or war, buying that car or marrying that person, having sex or not having sex, “doing your duty” or not “doing your duty,” there is no such thing as right and wrong, and I have no preference in the matter.\u003c/p\u003e \n\u003cp\u003eYou are all in the process of defining yourselves. Every act is an act of self-definition.\u003c/p\u003e \n\u003cp\u003eIf you are pleased with how you have created your-self, if it serves you, you will continue doing so in thatway. If you are not, you will stop. This is called evolution.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe process is slow because, as you evolve, you keep changing your ideas about what really serves you; you keep changing your concepts of “pleasure.”\u003c/p\u003e \n\u003cp\u003eRemember what I said earlier. You can tell how highly a person or society has evolved by what that be-ing or society calls “pleasure.” And I will add here, by what it declares to serve it.\u003c/p\u003e \n\u003cp\u003eIf it serves you to go to war and kill other beings, you will do so. If it serves you to terminate a pregnancy, you will do so. The only thing that changes as you evolve is your idea of what serves you. And that is based on what you think you are trying to do.\u003c/p\u003e \n\u003cp\u003eIf you are trying to get to Seattle, it will not serve you to head toward San Jose. It is not “morally wrong” to go to San Jose—it simply doesn’t serve you.\u003c/p\u003e \n\u003cp\u003eThe question of what you are trying to do, then, be-comes a question of prime importance. Not just in your life in general, but in every moment of your life specifi-cally. Because it is in the moments of life that a life itself is created.\u003c/p\u003e \n\u003cp\u003eAll of this was covered in great detail in the begin-ning of our holy dialogue, which you have come to call Book 1. I am repeating it here because you seem to need a reminder, or you would never have asked Me your question on abortion.\u003c/p\u003e \n\u003cp\u003eWhen you are preparing to have your abortion, therefore, or when you are preparing to smoke that cigarette, or when you are preparing to fry and eat that animal, and when you are preparing to cut that man off in traffic—whether the matter is large or small, whether the choice is major or minor, there is only one question to consider: Is this Who I Really Am? Is this who I now choose to be?\u003c/p\u003e \n\u003cp\u003eAnd understand this: No matter is inconsequential. There is a consequence to everything. The conse-quence is who and what you are.\u003c/p\u003e \n\u003cp\u003eYou are in the act of defining your Self right now.\u003c/p\u003e \n\u003cp\u003eThat is your answer to the abortion question. That is your answer to the war question. That is your answer to the smoking question and the meat-eating question and to every question about behavior you’ve ever had.\u003c/p\u003e \n\u003cp\u003eEvery act is an act of self-definition. Everything you think, say, and do declares, “This is Who I Am.”\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/243/636.html","bookId":36,"creation":"Aug 1, 2019 2:46:42 AM","modification":"Aug 1, 2019 2:46:42 AM"}
