{"id":1034,"no":60,"title":"Part 3 Chapter 20","content":"\u003cp\u003eWait! Hold it! You can’t quit now! I have more questions about E.T.s! Are they someday going to appear on Earth to “save us”? Will they rescue us from our own madness by bring-ing us new technologies to control the planet’s polarities, clean our atmosphere, harness our sun’s energy, regulate our weather, cure all disease, and bring us a better quality of life in our own little nirvana?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou may not want that to happen. “HEBs” know this. They know that such an intervention would only subjugate you to them, making them your gods, rather than the gods to whom you now claim to be subju-gated.\u003c/p\u003e \n\u003cp\u003eThe truth is, you are subjugated to no one, and this is what the beings from highly advanced cultures would have you understand. If, therefore, they would share with you some technologies, these would be given in a way, and at a rate, which would allow you to recognize your own powers and potentials, not those of another.\u003c/p\u003e \n\u003cp\u003eSimilarly, if HEBs were to share with you some teachings, these, too, would be shared in a way, and at a rate, that would allow you to see greater truths, and your own powers and potentials, and not make gods of your teachers.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eToo late. We’ve already done that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I’ve noticed.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhich brings us to one of our greatest teachers, the man called Jesus. Even those who did not make him a god have rec-ognized the greatness of his teachings.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTeachings which have been largely distorted.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWas Jesus one of these “HEBs”—highly evolved beings?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDo you think he was highly evolved?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. As was the Buddha, Lord Krishna, Moses, Babaji, Sai Baba, and Paramahansa Yogananda, for that matter.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIndeed. And many others you have not mentioned.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, in Book 2 You “hinted” that Jesus and these other teachers may have come from “outer space,” that they may have been visitors here, sharing with us the teachings and wisdoms of highly evolved beings. So it’s time to let the other shoe fall. Was Jesus a “spaceman”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou are all “spacemen.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat does that mean?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou are not natives of this planet you now call home.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWe aren’t?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo. The “genetic stuff” of which you are made was placed on your planet, deliberately. It didn’t just “show up” there by accident. The elements that have formed your life didn’t combine themselves through some pro-cess of biological serendipity. There was a plan in-volved. There is something much larger going on here. Do you imagine that the billion and one biochemical reactions it has taken to cause life as you know it to ap-pear on your planet all occurred haphazardly? Do you see this outcome as simply a fortuitous chain of random events, producing a happy result by chance?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo, of course not. I agree that there was a plan. God’s plan.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood. Because you are right. It was all My idea, and it was all My plan, and My process.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo what, then—are You saying that You are a “spaceman”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhere have you traditionally looked when you’ve imagined yourself to be talking to Me?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eUp. I’ve looked up.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhy not down?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI don’t know. Everybody always looks up—to the “heav-ens.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eFrom where I come?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI guess—yes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDoes that make Me a spaceman?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI don’t know, does it?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd if I am a spaceman, would that make Me any less a God?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBased on what most of us say You can do, no. I guess not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd if I am a God, does that make Me any less a spaceman?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt would all depend on our definitions, I guess.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat if I am not a “man” at all, but rather, a Force, an “Energy” in the universe, that IS the universe, and that is, in fact, All That Is. What if I am The Collective?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, that is, in fact, what You’ve said that You are. In this dialogue, You’ve said that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIndeed, I have. And do you believe it?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I think I do. At least in the sense that I think God is All That Is.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood. Now, do you think there are such things as what you call “spacemen”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou mean, beings from outer space?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I do. I think I’ve always believed that, and now, here, You’ve told me there are, so I surely believe it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd are these “beings from outer space” part of “All That Is”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, yes, of course.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd if I am All That Is, wouldn’t that make Me a spaceman?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell yes . . . but by that definition, You are also me.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBingo.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, but You’ve danced away from my question. I asked You if Jesus was a spaceman. And I think You know what I mean. I mean, was he a being from outer space, or was he born here, on Earth?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYour question once again assumes “either/or.” Think outside the box. Reject “either/or” and consider “both/and.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAre you saying Jesus was born on Earth, but has “spaceman blood,” so to speak?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWho was Jesus’ father?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eJoseph.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, but who is said to have conceived him?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSome people believe that it was an immaculate conception. They say that the Virgin Mary was visited by an archangel. Je-sus was “conceived by the Holy Ghost, born of the Virgin Mary.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDo you believe this?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI don’t know what to believe about that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, if Mary was visited by an archangel, from where do you imagine the angel would have come?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eFrom heaven.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDid you say “from the heavens”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI said, from heaven. From another realm. From God.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI see. And did we not just agree that God is a space-man?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNot exactly. We agreed that God is everything, and that since spacemen are part of “everything,” God is a spaceman, in the same sense that God is us. All of us. God is Everything. God is the collective.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood. So this archangel who visited Mary came from another realm. A heavenly realm.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eA realm deep within your Self, because heaven is within you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI didn’t say that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, then, a realm within the inner space of the universe.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo, I wouldn’t say that either, because I don’t know what hat means.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThen from where? A realm in outer space?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e(Long pause)\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou’re playing with words now.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m doing the best I can. I’m using words, in spite of their awful limitations, to get as close as I can to an idea, a concept of things, which, in truth, cannot be de-scribed in the limited vocabulary of your language, or understood within the limitations of your present level of perception.\u003c/p\u003e \n\u003cp\u003eI am seeking to open you to new perceptions by us-ing your language in a new way.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOkay. So, You’re saying that Jesus was fathered by a highly evolved being from some other realm, and thus he was a hu-man, but also a HEB?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere have been many highly evolved beings walk-ing your planet—and there are many today.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou mean there are “aliens among us”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI can see that your work in newspapers, radio talk shows, and television has served you well.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow do You mean?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou can find a way to sensationalize anything. I didn’t call highly evolved beings “aliens,” and I didn’t call Jesus an “alien.”\u003c/p\u003e \n\u003cp\u003eThere is nothing “alien” about God. There are no “aliens” on Earth.\u003c/p\u003e \n\u003cp\u003eWe Are All One. If We Are All One, no individua-tion of Us is alien to itself.\u003c/p\u003e \n\u003cp\u003eSome individuation of Us—that is, some individual beings-remember more than others. The process of remembering (re-uniting with God, or becoming, once again, One with the All, with the collective) is a process you call evolution. You are all evolving beings. Some of you are highly evolved. That is, you re-member more. You know Who You Really Are. Jesus knew it, and de-clared it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOkay, so I get that we’re going to do a word dance on the Je-sus thing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNot at all. I will tell you outright. The spirit of that hu-man you call Jesus was not of this Earth. That spirit sim-ply filled a human body, allowed itself to learn as a child, become a man, and self-realized. He was not the only one to have done this. All spirits are “not of this Earth.” All souls come from another realm, then enter the body. Yet not all souls self-realize in a particular “lifetime.” Jesus did. He was a highly evolved being. (What some of you have called a god), and he came to you for a purpose, on a mission.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTo save our souls.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIn a sense, yes. But not from everlasting damna-tion. There is no such thing as you have conceived it. His mission was—is-to save you from not knowing and never experiencing Who You Really Are. His in-tention was to demonstrate that by showing you what you can become. Indeed, what you are—if you will only accept it.\u003c/p\u003e \n\u003cp\u003eJesus sought to lead by example. That is why he said, “I am the way and the life. Follow me.” He didn’t mean “follow me” in the sense that you would all become his “followers,” but in the sense that you would all follow his example and become one with God. He said, “I and the Father are One, and ye are my brethren.” He couldn’t have put it more plainly.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo, Jesus did not come from God, he came from outer pace.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYour mistake is in separating the two. You keep in-sisting on making a distinction, just as you insist on mak-ing a separation and a distinction between humans and God. And I tell you, there is no distinction.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHmmm. Okay. Can You tell me a few final things about bei-ngs from other worlds before we end? What do they wear? How do they communicate? And please don’t say this is still all bout idle curiosity. I think I have demonstrated that there may e something we can learn here.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAll right. Briefly, then.\u003c/p\u003e \n\u003cp\u003eIn highly evolved cultures, beings see no need to be clothed, except when some kind of covering is required to protect them from elements or conditions over which they have no control, or when ornaments are used to indicate some “rank” or honor.\u003c/p\u003e \n\u003cp\u003eA HEB would not understand why you wear total body coverings when you do not have to—she certainly wouldn’t understand the concept of “shame” or “mod-esty”—and could never relate to the idea of coverings to make oneself “prettier.” To a HEB, there could be nothing more beautiful than the naked body itself, and so the concept of wearing something on top of it to somehow render it more pleasing or attractive would be utterly incomprehensible.\u003c/p\u003e \n\u003cp\u003eEqually incomprehensible would be the idea of liv-ing—spending most of one’s time—in boxes. . . which you call “buildings” and “houses.” HEBs live in the natural environment, and would only stay inside a box if their environment became inhospitable—which it rarely does, since highly evolved civilizations create, control, and care for their environments.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHEBs also understand that they are One with their environment, that they share more than space with their environments, but also share a mutually depend-ent relationship. A HEB could never understand why you would damage or destroy that which is supporting you, and so can only conclude that you do not under-stand that it is your environment which supports you; that you are beings of very limited observational skills.\u003c/p\u003e \n\u003cp\u003eAs for communication, a HEB uses as his first level of communication the aspect of his being which you would call feelings. HEBs are aware of their feelings and the feelings of others, and no attempt is ever made by anyone to hide feelings. HEBs would find it self-defeating, and therefore incomprehensible, to hide feelings, and then complain that no one understands how they feel.\u003c/p\u003e \n\u003cp\u003eFeelings are the language of the soul, and highly evolved beings understand this. It is the purpose of communication in a society of HEBs to know each other in truth. A HEB, therefore, cannot, and could never, understand your human concept called “lying.”\u003c/p\u003e \n\u003cp\u003eTo be successful in getting one’s way by communi-cating an untruth would be for a HEB a victory so hol-low as to render it not a victory at all, but a staggering defeat.\u003c/p\u003e \n\u003cp\u003eHEBs do not “tell” the truth, HEBs are the truth. Their whole beingness comes from “what is so,” and “what works,” and HEBs learned long ago, in a time be-yond memory when communication was still accom-plished through guttural utterances, that untruth does not work. You have not yet learned this in your society.\u003c/p\u003e \n\u003cp\u003eOn your planet, much of society is based on se-crecy. Many of you believe it is what you keep from each other, not what you tell to each other, that makes life work. Secrecy has thus become your social code, your code of ethics. It is truly your Secret Code.\u003c/p\u003e \n\u003cp\u003eThis is not true of all of you. Your ancient cultures, for instance, and your indigenous people do not live by such a code. And many individuals in your present soci-ety have refused to adopt these behaviors.\u003c/p\u003e \n\u003cp\u003eYet your government runs by this code, your busi-nesses adopt it, and many of your relationships reflect it. Lyi ng—about things large and small—has become so accepted by so many that they even lie about lying. Thus, you have developed a secret code about your Se-cret Code. Like the fact that the emperor is wearing no clothes, everybody knows it, but nobody’s talking about it. You even try to pretend its not so-and in this you are lying to yourself.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou’ve made this point before.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am repeating in this dialogue the essential points, the main points, you must “get” if you truly are to change things, as you say you wish to do.\u003c/p\u003e \n\u003cp\u003eAnd so I will say it again: The differences between human cultures and highly evolved cultures is that highly evolved beings:\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e1. Observe fully\u003c/p\u003e \n\u003cp\u003e2. Communicate truthfully\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThey see “what works” and say “what’s so.” This is another tiny, but profound, change which would im-measurably improve life on your planet.\u003c/p\u003e \n\u003cp\u003eAnd this is not, by the way, a question of morals. There are no “moral imperatives” in a HEB society, and that would be a concept equally as puzzling as lying. It is simply a matter of what is functional, of what brings benefit.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHEBs have no morals?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNot as you understand them. The idea of some group devising a set of values by which individual HEBs are called upon to live would violate their understand-ing of “what works,” which is that each individual is the sole and final arbiter of what is, and is not, appropriate behavior for them.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThe discussion is always around what works for a HEB society—what is functional and produces benefit for all—not around what humans would call “right” and “wrong.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut isn’t that the same thing? Haven’t we simply called what works “right,” and what doesn’t work for us, “wrong”?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have attached guilt and shame to those la-bels—concepts equally foreign to HFBs—and you have labeled an astonishing number of things “wrong,” not because they “don’t work,” but simply because you imagine them to be “inappropriate”—sometimes not even in your eyes, but in the “eyes of God.” You have thus constructed artificial definitions of “what works” and what doesn’t—definitions having nothing to do with “what’s really so.”\u003c/p\u003e \n\u003cp\u003eHonestly expressing one’s feelings, for example, is often deemed by human society as “wrong.” Such a conclusion could never be arrived at by a HEB, since precise awareness of feelings facilitates life in any com-munity or cluster. So, as I said, a HEB would never hide feelings, or find it “socially correct” to do so.\u003c/p\u003e \n\u003cp\u003eIt would be impossible in any event, because a HEB receives “vibes”—actual vibrations—from other be-ings, which make their feelings plain enough. just as you can sometimes “feel the air” when you walk into a room, a HEB can feel what another HEB is thinking and experiencing.\u003c/p\u003e \n\u003cp\u003eActual utterances-what you would call “words”—are rarely, if ever, used. This “telepathic communication” occurs between all highly evolved sentient beings. Indeed, it could be said that the degree to which a species—or a relationship between mem-bers of the same species-has evolved is demonstrated by the degree to which beings require the use of “words” to convey feelings, desires, or information.\u003c/p\u003e \n\u003cp\u003eAnd before you ask the question, yes, human beings can develop, and some have developed, the same\u003c/p\u003e \n\u003cp\u003ecapacity. Thousands of years ago, in fact, it was normal. You have since regressed to the use of primal utter-ances—” noises,” actually—to communicate. But many of you are returning to a cleaner form of communica-tion, more accurate and more elegant. This is especially true between loved ones—emphasizing a major truth: Caring creates communication.\u003c/p\u003e \n\u003cp\u003eWhere there is deep love, words are virtually un-necessary. The reverse of this axiom is also true: The more words you have to use with each other, the less time you must be taking to care for each other, because caring creates communication.\u003c/p\u003e \n\u003cp\u003eUltimately, all real communication is about truth. And ultimately, the only real truth is love. That is why, when love is present, so is communication. And when communication is difficult, it is a sign that love is not fully present.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat is beautifully put. I might say, beautifully communica-ted.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThank you. To summarize, then, the model for life in a highly evolved society:\u003c/p\u003e \n\u003cp\u003eBeings live in clusters, or what you would call small intentional communities. These clusters are not further organized into cities, states, or nations, but each inter-acts with the others on a co-equal basis.\u003c/p\u003e \n\u003cp\u003eThere are no governments as you would understand them, and no laws. There are councils, or conclaves. Usually of elders. And there are what could best be translated into your language as “mutual agreements.” These have been reduced to a Triangular Code: Aware-ness, Honesty, Responsibility.\u003c/p\u003e \n\u003cp\u003eHighly evolved beings have decided long ago that this is how they choose to live together. They’ve made this choice based not on a moral structure or spiritual revelation that some other being or group has brought forth, but, rather, on a simple observation of what is so, and what works.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd there truly are no wars and/or conflicts?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo, mainly because a highly evolved being shares everything he has, and would give you anything you sought to take by force. He does this out of his aware-ness that everything belongs to everyone anyway, and that he can always create more of what he “gave away if he really desires it.\u003c/p\u003e \n\u003cp\u003eThere is no concept of “ownership” or “loss” in a so-ciety of HEBs, who understand that they are not physi-cal beings, but beings being physical. They also understand that all beings proceed from the same source, and thus, We Are All One.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI know You said this before . . . but even if someone was threatening a HEB with his life, there would still be no con-flict?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere would be no argument. He would simply lay down his body—literally leaving the body there for you. He would then create another body if he chose to, by coming into physicality again as a fully formed being, or by returning as the newly conceived offspring of a lov-ing pair of other beings.\u003c/p\u003e \n\u003cp\u003eThis is by far the preferred method of reentry into physicality, because no one is more honored in highly evolved societies than newly created offspring, and the opportunities for growth are unparalleled.\u003c/p\u003e \n\u003cp\u003eHEBs have no fear of what your culture calls “death,” because H EBs know that they live forever, and it is just a matter of what form they are going to take. HEBs can live in a physical body usually indefinitely, be-cause a HEB has learned to take care of the body, and the environment. If for some reason having to do with the physical laws a HEB’s body is no longer functional, the HEB simply leaves it, joyfully returning its physical matter to the All of Everything for “recycling.” (What you understand as “dust into dust.”)\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eLet me go back a bit. I know You said there are no “laws,” as uch. But what if someone does not behave according to the Triangular Code”? Then what? Ka-boom?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo. No “ka-boom.” There is no “trial” or “punish-ment,” just a simple observation of “what’s so,” and ‘~ works.”\u003c/p\u003e \n\u003cp\u003eIt is carefully explained that “what’s so”—what the being has done-is now at variance with “what works,” and that when something does not work for the group, it ultimately will not work for the individual, because the individual is the group, and the group is the individ-ual. All HEBs “get” this very quickly, usually early in what you would call youth, and so it is extremely rare that a mature HEB is found to act in a way which pro-duces a “what’s so” that is not “what works.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut when one does?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHe is simply allowed to correct his mistake. Using the Triangular Code, he is first made aware of all the outcomes related to something he has thought or said or done. Then he is allowed to assess and declare his role in producing those outcomes. Finally, he is given an opportunity to take responsibility for those out-comes by putting corrective or remedial or healing measures into place.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat if he refuses to do so?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eA highly evolved being would never refuse to do so. It is inconceivable. He would then not be a highly evolved being, and you are now talking about a differ-ent level of sentient being altogether.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhere does a HEB learn all this stuff? In school?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere is no “school system” in a HEB society, merely a process of education by which offspring are reminded of “what’s so,” and “what works.” Offspring are raised by elders, not by those who conceive them, though they are not necessarily separated from their “parents” during the process, who may be with them whenever they wish, and spend as much time with them as they choose.\u003c/p\u003e \n\u003cp\u003eIn what you would call “school” (actually, best trans-lated as “learning time”), offspring set their own “cur-riculum,” choosing which skills they would like to acquire, rather than being told what they are going to have to learn. Motivation is thus at its highest level, and life skills are acquired quickly, easily, and joyfully.\u003c/p\u003e \n\u003cp\u003eThe Triangular Code (these are not really codified “rules,” but this is the best term one can find in your lan-guages) is not something which is “pounded into” the young HEB, but something which is acquired—almost by osmosis—through the behaviors modeled for the “child” by “adults.”\u003c/p\u003e \n\u003cp\u003eUnlike your society, in which adults model behav-iors opposite to those which they want their children to learn, in highly evolved cultures adults understand that children do what they see others doing.\u003c/p\u003e \n\u003cp\u003eIt would never occur to HEBs to place their offspring for many hours in front of a device that shows pictures of behaviors they’d like their offspring to avoid. Such a decision would be, to a HEB, incomprehensible.\u003c/p\u003e \n\u003cp\u003eIt would be equally incomprehensible, if a HEB did do this, to then deny that the pictures had anything to do with their offspring’s suddenly aberrant behaviors.\u003c/p\u003e \n\u003cp\u003eI will say again that the difference between HEB so-ciety and human society breaks down to one really very simple element, which we shall call truthful observa-tion.\u003c/p\u003e \n\u003cp\u003eIn HEB societies, beings acknowledge everything they see. In human societies, many deny what they see.\u003c/p\u003e \n\u003cp\u003eThey see television ruining their children, and they ignore it. They see violence and “losing” used as “enter-tainment,” and deny the contradiction. They observe that tobacco harms the body, and pretend it does not. They see a father who is drunken and abusive, and the whole family denies it, letting no one say a word about it.\u003c/p\u003e \n\u003cp\u003eThey observe that over thousands of years their relig-ions have failed utterly to change mass behaviors, and deny this, too. They see clearly that their governments do more to oppress than to assist, and they ignore it.\u003c/p\u003e \n\u003cp\u003eThey see a health-care system that is really a dis-ease-care system, spending one-tenth of its resources on preventing disease, and nine-tenths on managing it, and deny that profit motive is what stops any real prog-ress on educating people in how to act and eat and live in a way which promotes good health.\u003c/p\u003e \n\u003cp\u003eThey see that eating the flesh of animals that have been slaughtered after having been force-fed chemical-laden foods is not doing their health any good, yet they deny what they see.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThey do more than that. They try to sue talk show hosts who dare even discuss the subject. You know, there’s a won-derful book that explores this whole food topic with exqui-site insight. It’s called Diet for a New America, by John Robbins.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003ePeople will read that book and deny, deny, deny that it makes any sense. And that is the point. Much of your race lives in denial. They deny not just the pain-fully obvious observations of everyone around them, but the observations of their own eyes. They deny their personal feelings, and, eventually, their own truth.\u003c/p\u003e \n\u003cp\u003eHighly evolved beings—which some of you are be-coming—deny nothing. They observe “what’s so.” They see clearly “what works.” Using these simple tools, life becomes simple. “The Process” is honored.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, but how does “The Process” work?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTo answer that I have to make a point that I have made before—repeatedly, in fact—in this dialogue.\u003c/p\u003e \n\u003cp\u003eEverything depends on who you think you are, and what you are trying to do.\u003c/p\u003e \n\u003cp\u003eIf your objective is to live a life of peace, joy, and love, violence does not work. This has already been demonstrated.\u003c/p\u003e \n\u003cp\u003eIf your objective is to live a life of good health and great longevity, consuming dead flesh, smoking known carcinogens, and drinking volumes of nerve-deadening, brain-frying liquids does not work. This has already been demonstrated.\u003c/p\u003e \n\u003cp\u003eIf your objective is to raise offspring free of violence and rage, putting them directly in front of vivid depic-tions of violence and rage for years does not work. This has already been demonstrated.\u003c/p\u003e \n\u003cp\u003eIf your objective is to care for Earth, and wisely hus-band her resources, acting as if those resources are limitless does not work. This has already been demon-strated.\u003c/p\u003e \n\u003cp\u003eIf your objective is to discover and cultivate a rela-tionship with a loving God, so that religion can make a difference in the affairs of humans, then teaching of a god of punishment and terrible retribution does not work. This, too, has already been demonstrated.\u003c/p\u003e \n\u003cp\u003eMotive is everything. Objectives determine out-comes. Life proceeds out of your intention. Your true intention is revealed in your actions, and your actions are determined by your true intention. As with every-thing in life (and life itself), it is a circle.\u003c/p\u003e \n\u003cp\u003eHEBs see the circle. Humans do not.\u003c/p\u003e \n\u003cp\u003eHEBs respond to what is so; humans ignore it.\u003c/p\u003e \n\u003cp\u003eHEBs tell the truth, always. Humans too often lie, to themselves as well as others.\u003c/p\u003e \n\u003cp\u003eHEBs say one thing, and do what they say. Humans say one thing and do another.\u003c/p\u003e \n\u003cp\u003eDeep down you know that something is wrong—that you intended to “go to Seattle,” but you are in “San Jose.” You see the contradictions in your be-haviors, and you are truly ready now to abandon them. You see clearly both what is so, and what works, and you are becoming unwilling any further to support divi-sions between the two.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYours is a race awakening. Your time of fulfillment is at hand.\u003c/p\u003e \n\u003cp\u003eYou need not be discouraged by what you have heard here, for the groundwork has been laid for a new experience, a larger reality, and all this was merely prepa-ration for it. You are ready now to step through the door.\u003c/p\u003e \n\u003cp\u003eThis dialogue, in particular, has been intended to throw open that door. First, to point to it. See? There it is! For the light of truth will forever show the way. And the light of truth is what you have been given here.\u003c/p\u003e \n\u003cp\u003eTake this truth now, and live it. Hold this truth now, and share it. Embrace this truth now, and treasure it for-ever more.\u003c/p\u003e \n\u003cp\u003eFor in these three books—the Conversations with God trilogy—have I spoken to you again of what is so.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere is no need to go further. There is no need to ask more questions or hear more answers or satisfy more curiosities or provide more examples or offer more observations. All you need in order to create the life you desire, you have found here, in this trilogy as presented so far. There is no need to go further.\u003c/p\u003e \n\u003cp\u003eYes, you have more questions. Yes, you have more “but-what-ifs.” Yes, you are not “done” yet with this ex-ploration we have enjoyed. Because you are never done with any exploration.\u003c/p\u003e \n\u003cp\u003eIt is clear then that this book could go on forever. And it will not. Your conversation with God will, but this book will not. For the answer to any other question you could ask will be found here, in this now complete tril-ogy. All we can do now is repeat, re-amplify, return to the same wisdom over and over again. Even this trilogy was an exercise in that. There is nothing new here, but simply ancient wisdom revisited.\u003c/p\u003e \n\u003cp\u003eIt is good to revisit, It is good to become familiar once again. This is the process of remembrance of which I have so often spoken. You have nothing to learn. You have only to remember....\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo revisit this trilogy often; turn to its pages time and time again.\u003c/p\u003e \n\u003cp\u003eWhen you have a question that you feel has not been answered here, read the pages over again. You will find that your question has been answered. Yet if you really feel it has not, then seek your own answers. Have your own conversation. Create your own truth.\u003c/p\u003e \n\u003cp\u003eIn this will you experience Who You Really Are.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/243/642.html","bookId":36,"creation":"Aug 1, 2019 2:47:00 AM","modification":"Aug 1, 2019 2:47:00 AM"}
