{"id":1035,"no":61,"title":"Part 3 Chapter 21","content":"\u003cp\u003eI don’t want You to go!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m not going anywhere. I am always with you. All ways.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003ePlease, before we stop, just a few more questions. Some fi-1, closing inquiries.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou do understand, don’t you, that you may go within at any time, return to the Seat of Eternal Wis-dom, and find your answers there?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, I understand that, and I am grateful to the bottom of y heart that it is this way, that life has been created this way, t at I have that resource always. But this has been working for e. This dialogue has been a great gift. Can’t I just ask a few last questions?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOf course.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIs our world really in danger? Is our species flirting with s lf-destruction—with actual extinction?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. And unless you consider the very real possibility of that, you cannot avoid it. For what you resist, persists. Only what you hold can disappear.\u003c/p\u003e \n\u003cp\u003eRemember, also, what I told you about time and events. All the events you could possibly imagine—In-deed, have imagined—are taking place right now, in the Eternal Moment. This is the Holy Instant. This is the Moment that precedes your awareness. It is what is happening before the Light gets to you. This is the pre-sent moment, sent to you, created by you, before you even know it! You call this the “present.” And it IS a “present.” It is the greatest gift given to you by God.\u003c/p\u003e \n\u003cp\u003eYou have the ability to choose which, of all the ex-periences you\u0027 ve ever Imagined, you choose to experi-ence now.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou’ve said it, and I am now beginning, even in my limited perception, to understand it. None of this is really “real,” is it?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo. You are living an illusion. This is a big magic show. And you are pretending that you don’t know the tricks—even though you are the magician.\u003c/p\u003e \n\u003cp\u003eIt is important to remember this, otherwise you will make everything very real.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut what I see, feel, smell, touch, does seem very real. If that isn’t “reality,” what is?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eKeep in mind that what you are looking at, you are not really “seeing.”\u003c/p\u003e \n\u003cp\u003eYour brain is not the source of your intelligence. It is simply a data processor. It takes in data through recep-tors called your senses. It interprets this energy in for-mation according to its previous data on the subject. It tells you what it perceives, not what really is. Based on these perceptions, you think you know the truth about something, when, actually, you do not know the half of it. In reality, you are creating the truth that you know.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIncluding this entire dialogue with You.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMost assuredly.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m afraid that will only give fuel to those who are saying, “He’s not talking to God. He’s making it all up.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eTell them gently that they might try thinking “out-side the box.” They are thinking “either/or.” They might try thinking “both/and.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou cannot comprehend God if you are thinking in-side your current values, concepts, and understand-ings, If you wish to comprehend God, you must be willing to accept that you currently have limited data, rather than asserting that you know all there is to know on this subject.\u003c/p\u003e \n\u003cp\u003eI draw your attention to the words of Werner Erhard, who declared that true clarity can come only when someone is willing to notice:\u003c/p\u003e \n\u003cp\u003eThere is something I do not know, the knowing of which could change everything.\u003c/p\u003e \n\u003cp\u003eIt is just possible that you are both “talking to God” and “making it all up.”\u003c/p\u003e \n\u003cp\u003eIndeed, here is the grandest truth: You are making everything up.\u003c/p\u003e \n\u003cp\u003eLife is The Process by which everything is being cre-ated. God is the energy—the pure, raw energy—which you call life. By this awareness we come to a new truth.\u003c/p\u003e \n\u003cp\u003eGod is a Process.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI thought You said God was a Collective, that God is The ALL.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI did. And God is. God is also The Process by which All is created, and experiences Itself.\u003c/p\u003e \n\u003cp\u003eI have revealed this to you before.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. Yes. You gave me that wisdom when I was writing a booklet called Re-creating Yourself\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIndeed. And now I say it here, for a much larger audience to receive.\u003c/p\u003e \n\u003cp\u003eGod is a Process.\u003c/p\u003e \n\u003cp\u003eGod is not a person, place, or thing. God is exactly what you have always thought—but not understood.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAgain?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have always thought that God is the Supreme Being.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd you have been right about that. I am exactly that. A BEING. Notice that “being” is nota thing, it is a process.\u003c/p\u003e \n\u003cp\u003eI am the Supreme Being. That is, the Supreme, comma, being.\u003c/p\u003e \n\u003cp\u003eI am not the result of a process; I am The Process It-self. I am the Creator, and I am The Process by which I am created.\u003c/p\u003e \n\u003cp\u003eEverything you see in the heavens and the earth is Me, being created. The Process of Creation is never over. It is never complete. I am never “done.” This is an-other way of saying everything is forever changing. Nothing stands still. Nothing—nothing—is without mo-tion. Everything is energy, in motion. In your earthly shorthand, you have called this “E-motion!”\u003c/p\u003e \n\u003cp\u003eYou are God’s highest emotion!\u003c/p\u003e \n\u003cp\u003eWhen you look at a thing, you are not looking at a static “something” that is “standing there” in time and space. No! You are witnessing an event. Because every-thing is moving, changing, evolving. Everything.\u003c/p\u003e \n\u003cp\u003eIt was Buckminster Fuller who said, “I seem to be a verb.” He was right.\u003c/p\u003e \n\u003cp\u003eGod is an event. You have called that event life. Life is a Process. That Process is observable, knowable, pre-dictable. The more you observe, the more you know, and the more you can predict.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat’s a tough one for me. I always thought that God is the Unchangeable. The One Constant. The Unmoved Mover. It was within this inscrutable absolute truth about God that I found my security.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut that IS the truth! The One Unchanging Truth is that God is always changing. That is the truth—and you can’t do anything to change it. The one thing that never changes is that everything is always changing.\u003c/p\u003e \n\u003cp\u003eLife is change. God is life.\u003c/p\u003e \n\u003cp\u003eTherefore, God is change.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut I want to believe that the one thing that never changes is God’s love for us.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMy love for you is always changing, because you are always changing, and I love you just the way you are. For Me to love you just the way you are, My idea of what is “lovable” must change as your idea of Who You Are changes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou mean You find me lovable even if I decide that Who I Am is a murderer?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWe’ve been through this all before.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI know, but I just can’t get it!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNobody does anything inappropriate, given their model of the world. I love you always—all ways. There is no “way” you can be that could cause Me not to love you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut You will punish us, right? You will lovingly punish us. You will send us to everlasting torment, with love in Your heart, and sadness that You had to do it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo. I have no sadness, ever, because there is noth-ing I “have to do.” Who would make Me “have to do it”?\u003c/p\u003e \n\u003cp\u003eI will never punish you, although you may choose to punish yourself in this life or another, until you don’t anymore. I will not punish you because I have not been hurt or damaged—nor can you hurt or damage any Part of Me, which all of you are.\u003c/p\u003e \n\u003cp\u003eOne of you may choose to feel hurt or damaged, yet when you return to the eternal realm, you will see that you have not been damaged in any way. In this mo-ment will you forgive those you imagined to have dam-aged you, for you will have understood the larger plan.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat is the larger plan?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDo you remember the parable of The Little Soul and the Sun that I gave you in Book 1?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThere is a second half to that parable. Here it is:\u003c/p\u003e \n\u003cp\u003e“You may choose to be any Part of God you wish to be,” I said to the Little Soul. “You are Absolute Divinity, experiencing Itself. What Aspect of Divinity do you now wish to experience as You?”\u003c/p\u003e \n\u003cp\u003e“You mean I have a choice?” asked the Little Soul. And I answered, “Yes. You may choose to experience any Aspect of Divinity in, as, and through you.”\u003c/p\u003e \n\u003cp\u003e“Okay,” said the Little Soul, “then I choose Forgive-ness. I want to experience my Self as that Aspect of God called Complete Forgiveness.”\u003c/p\u003e \n\u003cp\u003eWell, this created a little challenge, as you can imagine.\u003c/p\u003e \n\u003cp\u003eThere was no one to forgive. All I have created is Per-fection and Love.\u003c/p\u003e \n\u003cp\u003e“No one to forgive?” asked the Little Soul, some-what incredulously.\u003c/p\u003e \n\u003cp\u003e“No one,” I repeated. “Look around you. Do you see any souls less perfect, less wonderful than you?”\u003c/p\u003e \n\u003cp\u003eAt this the Little Soul twirled around, and was sur-prised to see himself surrounded by all the souls in heaven. They had come from far and wide throughout the Kingdom, because they heard that the Little Soul was having an extraordinary conversation with God.\u003c/p\u003e \n\u003cp\u003e“I see none less perfect than I!” the Little Soul ex-claimed. “Who, then, shall I have to forgive?”\u003c/p\u003e \n\u003cp\u003eJust then, another soul stepped forward from the crowd. “You may forgive me,” said this Friendly Soul.\u003c/p\u003e \n\u003cp\u003e“For what?” the Little Soul asked.\u003c/p\u003e \n\u003cp\u003e“I will come into your next physical lifetime and do something for you to forgive,” replied the Friendly Soul.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e“But what? What could you, a being of such Perfect Light, do to make me want to forgive you?” the Little Soul wanted to know.\u003c/p\u003e \n\u003cp\u003e“Oh,” smiled the Friendly Soul, “I’m sure we can think of something.”\u003c/p\u003e \n\u003cp\u003e“But why would you want to do this?” The Little Soul could not figure out why a being of such perfection would want to slow down its vibration so much that it could actually do something “bad.”\u003c/p\u003e \n\u003cp\u003e“Simple,” the Friendly Soul explained, “I would do it be-cause I love you. You want to experience your Self as Forgiv-ing, don’t you? Besides, you’ve done the same for me.”\u003c/p\u003e \n\u003cp\u003e“I have?” asked the Little Soul.\u003c/p\u003e \n\u003cp\u003e“Of course. Don’t you remember? We’ve been All Of It, you and I. We’ve been the Up and the Down of it, and the Left and the Right of it. We’ve been the Here and the There of it, and the Now and the Then of it. We’ve been the Big and the Small of it, the Male and the Female of it, the Good and the Bad of it. We’ve all been the All of It.\u003c/p\u003e \n\u003cp\u003e“And we’ve done it by agreement, so that each of us might experience ourselves as The Grandest Part of God. For we have understood that. ...\u003c/p\u003e \n\u003cp\u003e“In the absence of that which You Are Not, that Which You ARE, is NOT.\u003c/p\u003e \n\u003cp\u003e“In the absence of ‘cold,’ you cannot be ‘warm.’ In the absence of ‘sad,’ you cannot be ‘happy,’ without a thing called ‘evil,’ the experience you call ‘good’ can-not exist.\u003c/p\u003e \n\u003cp\u003eIf you choose to be a thing, something or someone opposite to that has to show up somewhere in your uni-verse to make that possible.”\u003c/p\u003e \n\u003cp\u003eThe Friendly Soul then explained that those people are God’s Special Angels, and these conditions God’s Gifts.\u003c/p\u003e \n\u003cp\u003e“I ask only one thing in return,” the Friendly Soul de-clared.\u003c/p\u003e \n\u003cp\u003e“Anything! Anything,’ the Little Soul cried. He was excited now to know that he could experience every Divine Aspect of God. He understood, now, The Plan.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e“In the moment that I strike you and smite you,” said the Friendly Soul, “in the moment that I do the worst to you that you could ever imagine—in that self-same moment.., remember Who I Really Am.’\u003c/p\u003e \n\u003cp\u003e“Oh, I won’t forget!” promised the Little Soul. “I will see you in the perfection with which I hold you now, and I will remember Who You Are, always.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat is... that is an extraordinary story, an incredible par-able.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd the promise of the Little Soul is the promise I make to you. That is what is unchanging. Yet have you, My Little Soul, kept this promise to others?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo. I’m sad to say I have not.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eDo not be sad. Be happy to notice what is true, and be joyous in your decision to live a new truth.\u003c/p\u003e \n\u003cp\u003eFor God is a work in progress, and so are you. And remember this always:\u003c/p\u003e \n\u003cp\u003eIf you saw you as God sees you, you would smile a lot.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo go, now, and see each other as Who You Really Are.\u003c/p\u003e \n\u003cp\u003eObserve. Observe. OBSERVE.\u003c/p\u003e \n\u003cp\u003eI have told you—the major difference between you and highly evolved beings is that highly evolved beings observe more.\u003c/p\u003e \n\u003cp\u003eIf you wish to increase the speed with which you are evolving, seek to observe more.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat in itself is a wonderful observation.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd I would have you now observe that you, too, are an event. You are a human, comma, being. You are a process. And you are, in any given “moment,” the product of your process.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou are the Creator and the Created. I am saying these things to you over and over again, in these last few moments we have together. I am repeating them so that you will hear them, understand them\u003c/p\u003e \n\u003cp\u003eNow, this process that you and I are is eternal. It al-ways was, is now, and always will be occurring. It needs no “help” from you in order to occur. It happens “automatically.” And, when left alone, it happens per-fectly.\u003c/p\u003e \n\u003cp\u003eThere is another saying that has been placed into your culture by Werner Erhard—life resolves itself in the process of life itself.\u003c/p\u003e \n\u003cp\u003eThis is understood by some spiritual movements as “let go and let God.” That is a good understanding.\u003c/p\u003e \n\u003cp\u003eIf you will just let go, you will have gotten yourself out of the “way.” The “way” is The Process—which is called life itself. This is why all masters have said, “I am the life and the way.” They have understood what I have said here perfectly. They are the life, and they are the way—the event in progress, The Process.\u003c/p\u003e \n\u003cp\u003eAll wisdom asks you to do is trust The Process. That is, trust God. Or, if you wish, trust yourself, for Thou Art God.\u003c/p\u003e \n\u003cp\u003eRemember, We Are All One.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow can I “trust the process” when the “pro-cess”—life—keeps bringing me things I don’t like?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eLike the things life keeps bringing you!\u003c/p\u003e \n\u003cp\u003eKnow and understand that you are bringing it to your Self.\u003c/p\u003e \n\u003cp\u003eSEE THE PERFECTION.\u003c/p\u003e \n\u003cp\u003eSee it in everything, not just in things that you call perfect. I have carefully explained to you in this trilogy why things happen the way they happen, and how. You do not need to read that material again here—although it might do you benefit to review it often, until you un-derstand it thoroughly.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003ePlease—just on this one point—a summarizing insight. Please. How can I “see the perfection” of something that I ex-perience as not perfect at all?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo one can create your experience of anything.\u003c/p\u003e \n\u003cp\u003eOther beings can, and do, co-create the exterior cir-cumstances and events of the life you live in common, but the one thing that no one else can do is cause you to have an experience of ANYTH INC you do not choose to experience.\u003c/p\u003e \n\u003cp\u003eIn this, you are a Supreme being. And no one—NO ONE—can tell you “how to be.”\u003c/p\u003e \n\u003cp\u003eThe world can present you with circumstances, but only you decide what those circumstances mean.\u003c/p\u003e \n\u003cp\u003eRemember the truth I gave you long ago.\u003c/p\u003e \n\u003cp\u003eNothing matters.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. I’m not sure I fully understood it then. That came to me in an out-of-body experience in 1980. I recall it vividly.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd what do you remember of it?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat I was confused at first. How could “nothing matter”? Where would the world be, where would I be, if nothing mat-tered at all?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat answer did you find to that very good ques-tion?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI “got” that nothing mattered intrinsically, in and of itself, but that I was adding meaning to events, and so, causing them to matter. I got this at a very high metaphysical level as well, giving me a huge insight about the Process of Creation itself.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd the insight?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI “got” that all is energy, and that energy turns into “mat-ter”—that is, physical “stuff” and “occurrences”—according to how I thought about them. I understood, then, that “nothing matters” means that nothing turns into matter except as we choose for it to. Then I forgot that insight for over ten years, until You brought it to me again earlier in this dialogue.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eEverything I have brought you in this dialogue you have known before. I have given it to you before, all of it, through others whom I have sent you, or to whose teachings I have brought you. There is nothing new here, and you have nothing to learn. You have only to remember.\u003c/p\u003e \n\u003cp\u003eYour understanding of the wisdom “nothing mat-ters” is rich and deep, and serves you well.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m sorry. I cannot let this dialogue end without pointing out a glaring contradiction.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhich is—?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have taught me over and over again that what we call “evil” exists so that we may have a context within which to expe-rience “good.” You have said that What I Am cannot be experi-enced if there is no such thing as What I Am Not. In other words, no “warm” without “cold,” no “up” without “down,” and so on.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat’s right.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have even used this to explain to me how I could see every “problem” as a blessing, and every perpetrator as an angel.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eCorrect again.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThen how come every description of the life of highly evolved beings contains virtually no “evil”? All you’ve de-scribed is paradise!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh, good. Very good. You are really thinking about all this.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eActually, Nancy pointed this out. She was listening to me read some of the material out loud to her and she said, “I think you need to ask about this before the dialogue is over. How do HEBs experience themselves as Who They Really Are if they’ve eliminated all the negative stuff from their lives?” I thought it was a good question. In fact, it stopped me cold. And I know You just said we didn’t need any more questions, but I think You need to address this one.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOkay. One for Nancy, then. As it happens, it’s one of the best questions in the book.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e(Ahem.)\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, it is. . . . I’m surprised you didn’t catch this when we were talking about HEBs. I’m surprised you didn’t think of it.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI did.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou did?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWe are all One, aren’t we? Well, the part of me which is Nancy thought of it!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAh, excellent! And, of course, true.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo, Your answer?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI will return to My original statement.\u003c/p\u003e \n\u003cp\u003eIn the absence of that which you are not, that which you are, is not.\u003c/p\u003e \n\u003cp\u003eThat is, in the absence of cold, you cannot know the experience called warmth. In the absence of up, the idea of “down” is an empty, meaningless concept.\u003c/p\u003e \n\u003cp\u003eThis is a truth of the universe. Indeed, it explains why the universe is the way it is, with its cold and its warmth, its ups and downs, and, yes, its “good” and its “evil.”\u003c/p\u003e \n\u003cp\u003eYet know this: You are making it all up. You are de-ciding what is “cold” and what is “warm,” what is “up” and what is “down.” (Get out in space and watch your definitions disappear!) You are deciding what is “good” and what is “evil.” And your ideas about all these things have changed through the years—indeed, even through the seasons. On a summer day you would call 420F “cold.” In the middle of winter, however, you would say, “Boy, what a warm day!”\u003c/p\u003e \n\u003cp\u003eThe universe merely provides you with a field of ex-perience-what might be called a range of objective phenomena. You decide what to label them.\u003c/p\u003e \n\u003cp\u003eThe universe is a whole system of such physical phe-nomena. And the universe is enormous. Vast. Unfa-thomably huge. Endless, in fact.\u003c/p\u003e \n\u003cp\u003eNow here is a great secret: It is not necessary for an opposite condition to exist right next to you in order to provide a contextual field within which the reality that you choose may be experienced.\u003c/p\u003e \n\u003cp\u003eThe distance between contrasts is irrelevant. The entire universe provides the contextual field within which all contrasting elements exist, and all experi-ences are thus made possible. That is the purpose of the universe. That is its function.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut if I’ve never experienced “cold” in person, but merely see that it is “cold” somewhere else, very far away from me, how do I know what “cold” is?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou have experienced “cold.” You have experi-enced all of it. If not in this lifetime, then in the last. Or the one before that. Or one of the many others. You have experienced “cold.” And “big” and “small” and “up” and “down” and “here” and “there” and every contrasting element that there is. And these are burned into your memory.\u003c/p\u003e \n\u003cp\u003eYou do not have to experience them again if you don’t want to. You need merely remember them—know that they exist—in order to invoke the universal law of rela-tivity.\u003c/p\u003e \n\u003cp\u003eAll of you. All of you have experienced everything. That goes for all beings in the universe, not only hu-mans.\u003c/p\u003e \n\u003cp\u003eYou have all not only experienced everything, you are everything. You are ALL OF IT.\u003c/p\u003e \n\u003cp\u003eYou are that which you are experiencing. Indeed, you are causing the experience.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m not sure I fully understand that.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am about to explain it to you, in mechanical terms. What I want you now to understand is that what you are doing now is simply remembering everything you are, and choosing the portion of that which you prefer to ex-perience in this moment, in this lifetime, on this planet, in this physical form.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMy God, you make it sound so simple!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt is simple. You have separated your Self from the body of Cod, from the All, from the Collective, and you are becoming a member of that body once again. This is The Process called “re-membering.”\u003c/p\u003e \n\u003cp\u003eAs you re-member, you give your Self once again all the experiences of Who You Are. This is a cycle. You do this over and over again, and call this “evolution.” You say that you “evolve.” Actually, you RE-volve! Just as the Earth revolves around the sun. just as the galaxy re-volves around its center.\u003c/p\u003e \n\u003cp\u003eEverything revolves.\u003c/p\u003e \n\u003cp\u003eRevolution is the basic movement of all of life. Life energy revolves. That is what it does. You are in a truly revolutionary movement.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHow do You do that? How do You keep finding words that make everything so clear?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt is you who are making it clear. You have done this by clearing up your “receiver.” You’ve tuned out the static. You’ve entered into a new willingness to know. This new willingness will change everything, for you and for your species. For in your new willingness, you have become a true revolutionary—and your planet’s greatest spiritual revolution has just begun.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt had better hurry. We need a new spirituality, now. We are c eating incredible misery all around us.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat is because, even though all beings have already lived through all contrasting experiences, some do not know it. They have forgotten, and have not yet moved into full remembering.\u003c/p\u003e \n\u003cp\u003eWith highly evolved beings this is not so. It is not necessary to have “negativity” right in front of them, in their own world, for them to know how “positive” their civilization is. They are “positively aware” of Who They Are without having to create negativity to prove it. HEBs merely notice who they are not by observing it else-where in the contextual field.\u003c/p\u003e \n\u003cp\u003eYour own planet, in fact, is one to which highly evolved beings look if they seek a contrasting field.\u003c/p\u003e \n\u003cp\u003eAs they do so, they are reminded of how it was when they experienced what you are now experienc-ing, and they thus form an ongoing frame of reference through which they may know and understand what they are now experiencing.\u003c/p\u003e \n\u003cp\u003eDo you now understand why HEBs do not require “evil” or “negativity” in their own society?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. But then why do we require it in ours?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou DO NOT. That is what I have been telling you throughout this whole dialogue.\u003c/p\u003e \n\u003cp\u003eYou do have to live within a contextual field within which That Which You Are Not exists, in order for you to experience That Which You Are. This is the Universal Law, and you cannot avoid it. Yet you are living in such a field, right now. You do not have to create one. The con-textual field in which you are living is called the universe.\u003c/p\u003e \n\u003cp\u003eYou do not have to create a smaller contextual field in your own backyard.\u003c/p\u003e \n\u003cp\u003eThis means that you can change life on your planet right now, and eliminate all that you are not, without endangering in any way your ability to know and expe-rience That Which You Are.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWow! This is the greatest revelation in the book! What a way to end it! So I don’t have to keep calling forth the opposite in order to create and experience the next grandest version of the greatest vision I’ve ever had of Who I Am!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat is right. That is what I have been telling you from the very beginning.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut You didn’t explain it in this way!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou would not have understood it until now.\u003c/p\u003e \n\u003cp\u003eYou do not have to create the opposite of Who You Are and What You Choose in order to experience it. You merely need to observe that it has already been created—elsewhere. You need only remember that it exists. This is the “knowledge of the fruit of the Tree of Good and Evil” which I’ve already explained to you was not a curse, not the original sin, but what Matthew Fox has called Original Blessing.\u003c/p\u003e \n\u003cp\u003eAnd to remember that it exists, to remember that you have experienced it all before—everything that is—in physical form\u0026nbsp; . . .\u0026nbsp; . all you have to do is look up.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou mean “look within.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eNo, I mean just what I said. LOOK UP. Look to the stars. Look to the heavens. OBSERVE THE CONTEX-TUAL FIELD.\u003c/p\u003e \n\u003cp\u003eI have told you before, all you need to do to become highly evolved beings is to increase your observational skills. See “what’s so,” and then do “what works.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSo, by looking elsewhere in the universe, I can see how things are in other places, and I can use those contrasting\u003c/p\u003e \n\u003cp\u003eelements to form an understanding of Who I Am right here, right now.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes. This is called “remembering.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWell, not exactly. It is called “observing.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat do you think you are observing?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eLife on other planets. In other solar systems, other galaxies. I suppose if we gathered sufficient technology, this is what we might observe. This is what I assume the HEBs have the ability to observe right now, given their advanced technology. You said Yourself that they are observing us, right here on Earth. So that is what we would be observing.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eBut what is it, actually, that you would be observing?\u003c/p\u003e \n\u003cp\u003eI don’t understand the question.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThen I will give you the answer.\u003c/p\u003e \n\u003cp\u003eYou are observing your own past.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhat???\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhen you look up, you see the stars—as they were hundreds, thousands, millions of light-years ago. What you are seeing is not actually there. You are seeing what was there. You are seeing the past. And it is a past in which you participated.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eSay again???\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou were there, experiencing those things, doing those things.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI was?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHave I not told you that you have lived many lives?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, but . . . . . but what if I were to travel to one of these places so many light-years away? What if I had the ability to actually go there? To be there “right now,” in the very mo-ment that I am not able to “see” on Earth for hundreds of light-years? What would I see then? Two “me’s”? Are You say-ing that I would then see my Self, existing in two places at once?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOf course! And you would discover what I have told you all along—that time does not exist, and that you are not seeing “the past” at all! That is it all happening NOW.\u003c/p\u003e \n\u003cp\u003eYou are also, “right now,” living lives in what in Earth time, would be your future. It is the distance between your many “Selves” that allows “you” to experience dis-creet identities, and “moments in time.”\u003c/p\u003e \n\u003cp\u003eThus, the “past” that you re-member and the future that you would see, is the “now” that simply IS.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhoa. That’s incredible.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYes, and it is true on another level as well. It is as I have told you before: there is only One of us. So when you look up at the stars you are seeing what you would call OUR PAST.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI can’t keep up with this!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHang on. There’s one thing more I have to tell you.\u003c/p\u003e \n\u003cp\u003eYou are always seeing what by your terms you would define as the “past,” even when you are looking at what is right in front of you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI am?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt is impossible to see The Present. The Present “happens,” then turns into a burst of light, formed by energy dispersing, and that light reaches your receptors, your eyes, and it takes time for it to do that.\u003c/p\u003e \n\u003cp\u003eAll the while that light is reaching you, life is going on, moving forward. The next event is happening while the light from the last event is reaching you.\u003c/p\u003e \n\u003cp\u003eThe energy burst reaches your eyes, your receptors send that signal to your brain, which interprets the data and tells you what you are seeing. Yet that is not what is now in front of you at all. It is what you think you are seeing. That is, you are thinking about what you have seen, telling yourself what it is, and deciding what you are going to call it, while what is happening “now” is preceding your process, and awaiting it.\u003c/p\u003e \n\u003cp\u003eTo put this simply, I am always one step ahead of you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMy God, this is unbelievable\u003c/p\u003e \n\u003cp\u003eNow listen. The more distance you place between your Self and the physical location of any event, the fur-ther into the “past” that event recedes. Place yourself a few light-years back, and what you are looking at hap-pened very, very long ago, indeed.\u003c/p\u003e \n\u003cp\u003eYet it did not happen “long ago.” It is merely physi-cal distance which has created the illusion of “time,” and allowed you to experience your Self as being both “here, now” all the while you are being “there, then”!\u003c/p\u003e \n\u003cp\u003eOne day you will see that what you call time and space are the same thing.\u003c/p\u003e \n\u003cp\u003eThen you will see that everything is happening right here, right now.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis is... this is... wild. I mean, I don’t know what to make of all this.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhen you understand what I have told you, you will understand that nothing you see is real. You are seeing the image of what was once an event, yet even that im-age, that energy burst, is something you are interpret-ing. Your personal interpretation of that image is called your image-ination.\u003c/p\u003e \n\u003cp\u003eAnd you can use your imagination to create any-thing. Because-and here is the greatest secret of all—your image-ination works both ways.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003ePlease?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou not only interpret energy, you create it. Imagi-nation is a function of your mind, which is one-third of your three-part being. In your mind you image some-thing, and it begins to take physical form. The longer you image it (and the more OF you who image it), the more physical that form becomes, until the increasing energy you have given it literally bursts into light, flash-ing an image of itself into what you call your reality.\u003c/p\u003e \n\u003cp\u003eYou then “see” the image, and once again decide what it is. Thus, the cycle continues. This is what I have called The Process.\u003c/p\u003e \n\u003cp\u003eThis is what YOU ARE. You ARE this Process.\u003c/p\u003e \n\u003cp\u003eThis is what Cod IS. God IS this Process.\u003c/p\u003e \n\u003cp\u003eThis is what I have meant when I have said, you are both the Creator and the Created.\u003c/p\u003e \n\u003cp\u003eI have now brought it all together for you. We are concluding this dialogue, and I have explained to you the mechanics of the universe, the secret of all life.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI’m ... bowled over. I’m . . . . flabbergasted. Now I want to find a way to apply all this in my daily life.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eYou are applying it in your daily life. You cannot help but apply it. This is what is happening. The only question will be whether you apply it consciously or unconsciously, whether you are at the effect of The Process, or are the cause of it. In everything, be cause.\u003c/p\u003e \n\u003cp\u003eChildren understand this perfectly. Ask a child, “Why did you do that?” and a child will tell you. “Just because.”\u003c/p\u003e \n\u003cp\u003eThat is the only reason to do anything.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis is astounding. This is an astounding rush to an as-tounding ending to this astounding dialogue.\u003c/p\u003e \n\u003cp\u003eThe most significant way in which you may con-sciously apply your New Understanding is to be the cause of your experience, not at the effect of it. And know that you do not have to create the opposite of Who You Are in your personal space or personal experi-ence in order to know and experience Who You Really Are, and Who You Choose To Be.\u003c/p\u003e \n\u003cp\u003eArmed with this knowledge, you can change your life, and you can change your world.\u003c/p\u003e \n\u003cp\u003eAnd this is the truth I have come to share with all of you.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eWhoa! Wow! I got it. I got it!\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGood. Now know that there are three basic wisdoms that run through the entire dialogue. These are:\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e1.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; We Are All One.\u003c/p\u003e \n\u003cp\u003e2.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; There’s Enough.\u003c/p\u003e \n\u003cp\u003e3.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; There’s Nothing We Have To Do.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIf you decided that “we are all one,” you would cease treating each other the way you do.\u003c/p\u003e \n\u003cp\u003eIf you decided that “there’s enough,” you would share everything with everyone.\u003c/p\u003e \n\u003cp\u003eIf you decided that “there’s nothing we have to do,” you would stop trying to use “doingness” to solve your problems, but rather, move to, and come from, a state of being which would cause your experience of those “problems” to disappear, and the conditions them-selves to thus evaporate.\u003c/p\u003e \n\u003cp\u003eThis is perhaps the most important truth of all for you to understand at this stage in your evolution, and it is a good place to end this dialogue. Remember this al-ways, and make it your mantra:\u003c/p\u003e \n\u003cp\u003eThere’s nothing I have to have, there’s nothing I have to do, and there’s nothing I have to be, except exactly what I’m being right now.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis does not mean that “having” and “doing” will be eliminated from your life. It means that what you experience yourself having or doing will spring from your being—not lead you to it.\u003c/p\u003e \n\u003cp\u003eWhen you come from “happiness,” you do certain things because you are happy—as opposed to the old paradigm in which you did things that you hoped would make you happy.\u003c/p\u003e \n\u003cp\u003eWhen you come from “wisdom,” you do certain things because you are wise, not because you are trying to get to wisdom.\u003c/p\u003e \n\u003cp\u003eWhen you come from “love,” you do certain things because you are love, not because you want to have love.\u003c/p\u003e \n\u003cp\u003eEverything changes; everything turns around, when you come from “being,” rather than seeking to “be.” You cannot “do” your way to “being.” Whether you are trying to “be” happy, be wise, be love—or be God—you cannot “get there” by doing. And yet, it is true that you will be doing wonderful things once you “get there.”\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eHere is the Divine Dichotomy. The way to “get there” is to “be there.” just be where you choose to get! It’s that simple. There’s nothing you have to do. You want to be happy? Be happy. You want to be wise? Be wise. You want to be love? Be love.\u003c/p\u003e \n\u003cp\u003eThat is Who You Are in any event.\u003c/p\u003e \n\u003cp\u003eYou are My Beloved.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eOh! I just lost my breath! You have such a wondrous way of putting things.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIt is the truth that is eloquent. Truth has an elegance that startles the heart to its own reawakening.\u003c/p\u003e \n\u003cp\u003eThat is what these Conversations with God have done. They have touched the heart of the human race, and reawakened it.\u003c/p\u003e \n\u003cp\u003eNow they lead you to a critical question. It is a ques-tion all of humanity must ask itself. Can, and will, you create a new cultural story? Can and will you devise a new First Cultural Myth, upon which all other myths are based?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIs the human race inherently good, or inherently evil?\u003c/p\u003e \n\u003cp\u003eThis is the crossroads to which you have come. The future of the human race depends on which way you go.\u003c/p\u003e \n\u003cp\u003eIf you and your society believe you are inherently good, you will make decisions and laws that are life af-firming and constructive. If you and your society be-lieve that you are inherently evil, you will make decisions and laws that are life denying and destructive.\u003c/p\u003e \n\u003cp\u003eLaws that are life affirming are laws that allow you to be, do, and have what you wish. Laws that are life deny-ing are laws that stop you from being, doing, and having what you wish.\u003c/p\u003e \n\u003cp\u003eThose who believe in Original Sin, and that the in-herent nature of man is evil, claim that Cod has created laws which stop you from doing as you wish—and pro-mote human laws (an endless number of them) that seek to do the same.\u003c/p\u003e \n\u003cp\u003eThose who believe in Original Blessing, and that the inherent nature of man is good, proclaim that Cod has created natural laws which allow you to do as you wish—and promote human laws that seek to do the same.\u003c/p\u003e \n\u003cp\u003eWhat is your viewpoint of the human race? What is your viewpoint of your Self? Left entirely to your own devices, do you see yourself as being able to be trusted? In everything? How about others? How do you view them? Until they reveal themselves to you, one way or the other, what is your basic assumption?\u003c/p\u003e \n\u003cp\u003eNow, answer this. Do your assumptions further your society in breaking down, or breaking through?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eI see my Self as trustworthy. I never did before, but now I do.\u0026nbsp;\u0026nbsp;\u0026nbsp; I have become trustworthy, because I have changed my ideas on the kind of person I am. I am also clear now on what God wants, and what God doesn’t want. lam clear about You.\u003c/p\u003e \n\u003cp\u003eThese Conversations with God have played a huge role in t at change, in making that shift possible. And I now see in soci-ety what I see in myself—not something that is breaking down, but something that is breaking through. I see a human culture that is at last awakening to its divine heritage, aware of its divine purpose, and increasingly conscious of its divine Self.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eIf that is what you see, that is what you will create. Once you were lost, but now you are found. You were blind, but now you see. And this has been an amazing grace.\u003c/p\u003e \n\u003cp\u003eYou have sometimes been apart from Me in your heart, but now We are whole again, and We can be for-ever. For what you have joined together, no one but you can put asunder.\u003c/p\u003e \n\u003cp\u003eRemember this: You are always a part, because you are never apart. You are always a part OF Cod, because\u003c/p\u003e \n\u003cp\u003eyou are never apart FROM Cod.\u003c/p\u003e \n\u003cp\u003eThis is the truth of your being. We are whole. So now you know the whole truth.\u003c/p\u003e \n\u003cp\u003eThis truth has been food for the hungry soul. Take, and eat of it. The world has thirsted for this joy. Take, and drink of it. Do this in re-membrance of Me.\u003c/p\u003e \n\u003cp\u003eFor truth is the body, and joy is the blood, of Cod, who is love.\u003c/p\u003e \n\u003cp\u003eTruth.\u003c/p\u003e \n\u003cp\u003eJoy.\u003c/p\u003e \n\u003cp\u003eLove.\u003c/p\u003e \n\u003cp\u003eThese three are interchangeable. One leads to the other, and it matters not in which order they appear. All lead to Me. All are Me.\u003c/p\u003e \n\u003cp\u003eAnd so I end this dialogue as it began. As with life it-self, it comes full circle. You have been given truth here. You have been given joy. You have been given love. You have been given here the answers to the largest mysteries of life. There is now only one question re-maining. It is the question with which we began.\u003c/p\u003e \n\u003cp\u003eThe question is not, to whom do I talk, but who lis-tens?\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThank You. Thank You for talking to all of us. We have heard You, and we will listen. I love You. And as this dialogue ends, lam filled with truth, joy, and love. I am filled with You. I feel my Oneness with God.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThat place of Oneness is heaven.\u003c/p\u003e \n\u003cp\u003eYou are there now.\u003c/p\u003e \n\u003cp\u003eYou are never not there, because you are never not One with Me.\u003c/p\u003e \n\u003cp\u003eThis is what I would have you know. This is what I would have you take, at last, from this conversation.\u003c/p\u003e \n\u003cp\u003eAnd here is My message, the message I would seek to leave with the world:\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eMy Children, who art in Heaven, hallowed is your name. Your kingdom is come, and your will is done, on Earth as it is in Heaven.\u003c/p\u003e \n\u003cp\u003eYou are given this day your daily bread, and you are forgiven your debts, and your trespasses, exactly to the degree that you have forgiven those who trespass against you.\u003c/p\u003e \n\u003cp\u003eLead your Self not into temptation, but deliver your Self from the evils you have created.\u003c/p\u003e \n\u003cp\u003eFor thine is the Kingdom, and the Power, and the Glory, forever.\u003c/p\u003e \n\u003cp\u003eAmen.\u003c/p\u003e \n\u003cp\u003eAnd amen.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGo now, and change your world. Go now, and be your Highest Self. You understand now all that you need to understand. You know now all that you need to know. You are now all that you need to be.\u003c/p\u003e \n\u003cp\u003eYou never were anything less. You simply did not know this. You did not remember it.\u003c/p\u003e \n\u003cp\u003eNow you remember. Seek to carry this remem-brance with you always. Seek to share it with all those whose lives you touch. For yours is a destiny grander than you might ever have imagined.\u003c/p\u003e \n\u003cp\u003eYou have come to the room to heal the room. You have come to the space to heal the space.\u003c/p\u003e \n\u003cp\u003eThere is no other reason for you to be here.\u003c/p\u003e \n\u003cp\u003eAnd know this: I love you. My love is always yours, both now, and even forever more.\u003c/p\u003e \n\u003cp\u003eI am with you always.\u003c/p\u003e \n\u003cp\u003eAll ways.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eGoodbye, God. Thank You for this dialogue. Thank You, thank You, thank You.\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eAnd you, My wonderful creation. Thank you. For you have given Cod a voice again—and a place in your heart. And that is all either of Us have ever really wanted.\u003c/p\u003e \n\u003cp\u003eWe are together again. And it is very good.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/243/643.html","bookId":36,"creation":"Aug 1, 2019 2:47:03 AM","modification":"Aug 1, 2019 2:47:03 AM"}
