{"id":69293,"no":106,"title":"Page 106","content":"\u003cp\u003e\"Well, what about a drink? It\u0027s not that late.\" I check the nonexistent watch again. \"I\u0027ve gotta stop doing that.\"\u003c/p\u003e\n\u003cp\u003e\"It actually is getting late,\" she says. \"I should get to sleep.\"\u003c/p\u003e\n\u003cp\u003e\"You want to come by my room? For a drink?\" I ask, following her as she walks away from the railing. \"I have an unopened fruit basket in my room that we can share. I\u0027ll be on my best behavior.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s very sweet, Victor,\" she says. \"But I\u0027m tired.\"\u003c/p\u003e\n\u003cp\u003e\"I want to come to Paris,\" I say suddenly.\u003c/p\u003e\n\u003cp\u003eMarina stops walking and turns to me. \"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Can I?\" I ask. \"I mean, we don\u0027t have to stay at the same place but can I like travel with you?\"\u003c/p\u003e\n\u003cp\u003e\"What about London?\"\u003c/p\u003e\n\u003cp\u003e\"London can wait.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re being impulsive,\" she says apprehensively, resuming walking.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s one of my many really really great qualities.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, let\u0027s just...\" She sighs. \"Let\u0027s just see how things go.\"\u003c/p\u003e\n\u003cp\u003e\"Things are going fine,\" I say. \"Things can only get better. Look, I\u0027m embarrassed to admit this, but\u003c/p\u003e\n\u003cp\u003eI\u0027ve just spent the last hour gazing at you and and and now I want to come to Paris.\"\u003c/p\u003e\n\u003cp\u003e\"What do you want me to say to that?\"\u003c/p\u003e\n\u003cp\u003e\"Just say yeah, cool, hip. just say, \u0027Yes, Victor, you can come to Paris with me,\"\u0027 I tell her and then, mock-seriously: \"You know, I don\u0027t need an invitation, baby- I can just simply follow you.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027d be, um, like stalking me through Paris?\"\u003c/p\u003e\n\u003cp\u003e\"Just say, \u0027Victor, you may come with me-I give you my permission,\u0027 and then I\u0027ll bow and kiss your feet and-\"\u003c/p\u003e\n\u003cp\u003e\"But I don\u0027t know if I can say that yet.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m saving you the embarrassment of admitting what you really want to express.\"\u003c/p\u003e\n\u003cp\u003e\"You have no idea what I want to express.\"\u003c/p\u003e\n\u003cp\u003e\"But I know all about you now.\"\u003c/p\u003e\n\u003cp\u003e\"But I don\u0027t know anything about you.\"\u003c/p\u003e\n\u003cp\u003e\"Hey.\" I stop walking, spread my arms out wide. \"This is all you need to know.\"\u003c/p\u003e\n\u003cp\u003eShe stares, smiling. I stare back until I have to look away.\u003c/p\u003e\n\u003cp\u003e\"Will you at least join me for dinner tomorrow night?\" I ask \"bashfully.\"\u003c/p\u003e\n\u003cp\u003e\"That would be...\" She stops, considering something.\u003c/p\u003e\n\u003cp\u003e\"Um, babe? I\u0027m waiting.\"\u003c/p\u003e\n\u003cp\u003e\"That would be...\" She pauses again, looking out past me at all that blackness.\u003c/p\u003e\n\u003cp\u003eI start chewing a nail, then check my pockets for Kleenex, a cigarette, Mentos, any prop to keep me occupied.\u003c/p\u003e\n\u003cp\u003e\"That would be... nice.\"\u003c/p\u003e\n\u003cp\u003eI let out a great sigh of relief and hold my hand over my heart as if I\u0027ve just recovered from an enormous blow. We aren\u0027t miked anymore when we say good night and the crew\u0027s been waved away and there\u0027s another kiss and in that kiss I can\u0027t help but sense some kind of pattern being revealed, and then departure.\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eWhile I\u0027m getting dressed to meet Marina at the Queen\u0027s Grill Lounge at 7:30 before dinner with the Wallaces, the captain makes an announcement over the intercom, something about a distress signal emanating from a shipping vessel that the QE2 will be intercepting around 9 in order to pick up a diabetic crewman who ran out of insulin, and walking to the lounge I\u0027m passing dozens of worried old people asking if this unscheduled stop is going to delay the arrival time at Southampton and the exceedingly patient ship directors, harried but sincere, assure them it will not and I\u0027m wondering what if it f**king does? You\u0027re old. If I was a ship director my answer would\u0027ve been, \"It doesn\u0027t matter, you\u0027ll be dead before we dock this boat.\"\u003c/p\u003e\n\u003cp\u003eTonight my hair\u0027s slicked back, I used a tiny splash of cologne, I\u0027m wearing the Comme des Garqons tuxedo-freshly pressed-and I\u0027m feeling semi-retro. When I called Marina this morning and suggested maybe lunch she said she planned to spend the day pampering herself out of her funk-facial, massage, yoga, aromatherapy, palm reading-and since I already felt linked to her I didn\u0027t have to be told to spend the day basically keeping to myself, bumming around, goofing off in the gym, replaying imaginary conversations with her while on the StairMaster, rehearsing the words I\u0027d use during sex.\u003c/p\u003e\n\u003cp\u003eI order a martini, positioning myself on a plush antique couch by the bar where a steward lights my cigarette and 7:30 turns into 8:00 rather suddenly and I\u0027ve ordered another martini and smoked two more Marlboro Lights, staring at the extras. It\u0027s a formal night on the ship and men are wearing tuxedos (I actually don\u0027t spot a single decent one) and cheesy sequined gowns hang off old women, everyone passing by on their way to various dining rooms, chattering incessantly about absolutely nothing. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-106.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
