{"id":69297,"no":110,"title":"Page 110","content":"\u003cp\u003e\"I have to leave,\" she says, starting to get up.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m coming too,\" I say, holding on to her arm. \"I\u0027ll pretend I\u0027m sick.\"\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s not possible,\" she says. \"Let go.\"\u003c/p\u003e\n\u003cp\u003e\"Baby, come on-\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s imperative that you call me immediately after dinner,\" she says, pulling away from the table. \"Do you know what \u0027imperative\u0027 means?\"\u003c/p\u003e\n\u003cp\u003e\"That I\"-I squint up at her-\"that I... have to call you after dinner?\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" she says, semi-relieved.\u003c/p\u003e\n\u003cp\u003e\"Baby, what\u0027s happening?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no time to go into it now.\"\u003c/p\u003e\n\u003cp\u003eThe Wallaces start heading back along with most of the other passengers, murmurs of disappointment floating around the dining room about what-that they didn\u0027t catch a glimpse of a diabetic seaman? I am so lost.\u003c/p\u003e\n\u003cp\u003e\"Baby,\" I start. \"I\u0027m not comprehending this-\"\u003c/p\u003e\n\u003cp\u003e\"Tell them good night for me,\" Marina says, walking quickly out of the restaurant.\u003c/p\u003e\n\u003cp\u003eI watch as she disappears down a corridor, then notice a nearby waiter who takes in the expression on my face and shrugs sadly, sympathizing with me.\u003c/p\u003e\n\u003cp\u003e\"Too bloody foggy,\" Stephen says, pulling Lorrie\u0027s chair out.\u003c/p\u003e\n\u003cp\u003e\"Where did your friend go?\" Lorrie asks, sitting down.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" I sigh. \"She\u0027s freaking out about something.\"\u003c/p\u003e\n\u003cp\u003e\"I hope we didn\u0027t upset her,\" Lorrie says.\u003c/p\u003e\n\u003cp\u003e\"Darling, eat your caviar,\" Stephen says.\u003c/p\u003e\n\u003cp\u003eLater the Wallaces insist I join them at a karaoke party in Club Lido but I\u0027m drunk and the details surrounding me are swimming out of focus in front of my eyes and before I bolt for my cabin the camera moves in on dessert: a gold-rimmed plate, raspberries, blueberries, two scoops of vanilla mousse bordering a chocolate bonsai tree.\u003c/p\u003e\n\u003cp\u003eChapter Eleven\u003c/p\u003e\n\u003cp\u003eBack in my room pretty much totally sloshed I dial Marina Gibson\u0027s cabin but there\u0027s no answer. When I ask the operator to make sure she\u0027s ringing the right room, she pitches a snotty reply and I hang up on her and then scrounge around the minibar for a split of champagne, drinking it out of the bottle, foam cascading out of the head all over my hands which I wipe off on my complimentary QE2 bathrobe. I look for a copy of the script, can\u0027t find it, give up, tumble around the room, light cigarettes, the view from the prow of the ship on the TV screen almost totally obscured by fog. The phone rings.\u003c/p\u003e\n\u003cp\u003e\"Victor?\" Marina sounds as if she\u0027s been crying.\u003c/p\u003e\n\u003cp\u003e\"Hey baby,\" I say soothingly. \"Did like Gavin call? What\u0027s the story? You sound bummed.\"\u003c/p\u003e\n\u003cp\u003e\"We have to talk.\"\u003c/p\u003e\n\u003cp\u003e\"Great,\" I say, sitting up. \"How about my room?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay,\" I say, then, guessing, \"How about... your room?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think it\u0027s safe,\" she whispers.\u003c/p\u003e\n\u003cp\u003eI pause, considering this. \"Marina,\" I say softly. \"I have condoms.\"\u003c/p\u003e\n\u003cp\u003eShe hangs up.\u003c/p\u003e\n\u003cp\u003eI immediately dial her room back.\u003c/p\u003e\n\u003cp\u003eShe picks up midway through the first ring.\u003c/p\u003e\n\u003cp\u003e\"Hey baby, it\u0027s me,\" I say.\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t going to work,\" she mutters to herself, sounding vaguely panicked.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" I\u0027m asking. \"Do... you have condoms?\"\u003c/p\u003e\n\u003cp\u003e\"That isn\u0027t what I\u0027m talking about!\" she shouts.\u003c/p\u003e\n\u003cp\u003e\"Whoa, baby,\" I start, holding the phone away, then bringing it back to my ear. \"What isn\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"Victor, something\u0027s happening that needs to be explained to you.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, I\u0027m sorry I\u0027m rushing things,\" I apologize. \"I\u0027ll read the rest of the script, we\u0027ll get to know each other, whatever.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re in f**king danger, Victor,\" she cries.\u003c/p\u003e\n\u003cp\u003e\"Now don\u0027t go psycho on me, baby-\"\u003c/p\u003e\n\u003cp\u003e\"Victor, did anyone give you something to bring with you to London?\" she asks breathlessly.\u003c/p\u003e\n\u003cp\u003e\"What do you mean, baby?\" I\u0027m checking my hair in the mirror above the dressing table.\u003c/p\u003e\n\u003cp\u003e\"Did anyone tell you to bring something-a package, an envelope, anything-to London?\" she asks again, straining to calm down.\u003c/p\u003e\n\u003cp\u003e\"Like what?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" she moans. \"A gift or something. Something to bring someone.\"\u003c/p\u003e\n\u003cp\u003e\"Oh yeah, right,\" I say, as if it\u0027s slowly dawning on me.\u003c/p\u003e\n\u003cp\u003e\"What? What was it?\" she asks in a rush.\u003c/p\u003e\n\u003cp\u003eI pause before giggling. \"Just my beautiful self, baby.\"\u003c/p\u003e\n\u003cp\u003e\"Damnit, Victor,\" Marina shouts. \"Are you sure? Think carefully.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-110.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
