{"id":69305,"no":118,"title":"Page 118","content":"\u003cp\u003eA businessman strides by the Bono look-alike, frowning while he studies the front page of the Evening Standard, a pipe gripped firmly in his mouth, and the Bono look-alike walks past a fairly mod nanny wheeling a designer baby carriage and then the nanny passes two art students sharing a bag of brightly colored candy and staring at the mannequins in a store window.\u003c/p\u003e\n\u003cp\u003eA Japanese tourist videotapes posters, girls strolling out of Starbucks, the black Lab being walked by the Bono look-alike, the mod nanny, who has stopped wheeling the designer baby carriage since, apparently, the baby needs inspecting. The guy on the motorbike still sits at the light, waiting.\u003c/p\u003e\n\u003cp\u003ePulp turns into an ominous Oasis track and everyone seems to be wearing Nikes and people aren\u0027t moving casually enough-they look coordinated, almost programmed, and umbrellas are opened because the sky above the street in Notting Hill is a chilly Dior gray, promising impending rain, or so people are told.\u003c/p\u003e\n\u003cp\u003eOver a significant period of time the following occurs:\u003c/p\u003e\n\u003cp\u003eJamie Fields emerges on the street in Notting Hill, running out of an alley, desperately waving her arms, yelling garbled warnings at people, an anguished expression ruining (or adding to?) the beauty of her face, which is covered with brown streaks of grime.\u003c/p\u003e\n\u003cp\u003eA cab moving slowly down the street in Notting Hill almost slams into Jamie Fields and she throws herself, screaming, against it, and the driver, appropriately petrified, rolls up his window and speeds away, swerving past the guy on the motorbike, and the black Lab begins barking wildly and the two art students turn away from the mannequins and the fairly mod nanny starts wheeling the carriage in the opposite direction and the nanny bumps into the businessman, knocking the pipe from his mouth, and he turns around, miffed, mouthing What the hell? And then buildings start exploding.\u003c/p\u003e\n\u003cp\u003eFirst the Crunch gym, seconds later the Gap and immediately after that the Starbucks evaporate and then, finally, the McDonald\u0027s. Each of the four separate explosions generates a giant cumulus cloud of roaring flames and smokc that rises up into the gray sky and since the carefully planted bombs have caused the buildings to burst apart outward onto the walkways bodies either disappear into the flames or fly across the street as if on strings, their flight interrupted by their smashing into parked BMWs, and umbrellas knocked out of hands are lifted up by the explosions, some on fire, swinging across the gray sky before landing gently on piles of rubble.\u003c/p\u003e\n\u003cp\u003eAlarms are going off in every direction and the sky is lit up orange, colored by two small subsequent explosions, the ground continually vibrating, hidden people yelling out commands. Then, at last, silence, but only for maybe fifteen seconds, before people start screaming.\u003c/p\u003e\n\u003cp\u003eThe group of teenagers: incinerated. The businessman: blown in half by the Starbucks explosion.\u003c/p\u003e\n\u003cp\u003eThere is no sign of the Japanese tourist except for the camcorder, which is in pristine condition.\u003c/p\u003e\n\u003cp\u003eThe guy on the motorbike waiting at the stoplight: a charred skeleton hopelessly tangled in the wreckage of the motorbike, which he has now melded into.\u003c/p\u003e\n\u003cp\u003eThe fairly mod nanny is dead and the designer baby carriage she was wheeling looks like it was smashed flat by some kind of giant hand.\u003c/p\u003e\n\u003cp\u003eThe black Lab has survived but the Bono look-alike isn\u0027t around. His hand-blown off at the wrist-still clutches the leash, and the dog, covered in ash and gore, freaked out, dashes madly toward a camera its trainer is standing behind.\u003c/p\u003e\n\u003cp\u003eAnd on the street in Notting Hill, a dazed Jamie Fields falls slowly to her knees while gazing up at the gray sky and bows her head guiltily, convulsing in horror and pain as a strange wind blows smoke away, revealing more rubble, more body parts, bathroom products from the Gap, hundreds of blackened plastic Starbucks cups, melted Crunch gym membership cards, even fitness equipment-StairMasters, rowing machines, a stationary bike, all smoldering.\u003c/p\u003e\n\u003cp\u003eThe initial damage behind Jamie Fields seems terrible but after a certain amount of time has passed the street really doesn\u0027t look destroyed-just sort of vaguely wrecked. Only two BMWs have toppled over-corpses hanging out of the shattered windshields-and where mangled bodies lie, the gore surrounding them looks inauthentic, as if someone had dumped barrels containing smashed tomatoes across sidewalks, splattered this mixture on top of body parts and mannequins still standing behind decimated storefront windows-the blood and flesh of the art students-and it just seems too red. But later I will find out that this particular color looks more real than I could ever have imagined standing on the street in Notting Hill.\u003c/p\u003e\n\u003cp\u003eIf you\u0027re looking at Jamie Fields right now, you\u0027ll notice that she\u0027s laughing as if relieved, even though she\u0027s surrounded by disconnected heads and arms and legs, but these body parts are made of foam and soon crew members are picking them up effortlessly. A director has already yelled \"Cut\" and someone is wrapping a blanket around Jamie and whispering something soothing in her ear, but Jamie seems okay and as she bows the sound of applause takes over, rising up to dominate the scene that played itself out on the street in Notting Hill on this Wednesday morning. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-118.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
