{"id":69199,"no":12,"title":"Page 12","content":"\u003cp\u003e\"Why, Alison? Why did you have to attack me at a movie premiere?\" I wail.\u003c/p\u003e\n\u003cp\u003e\"It takes two, you naughty boy.\"\u003c/p\u003e\n\u003cp\u003e\"Not when you\u0027ve knocked me unconscious and are sitting on my face.\"\u003c/p\u003e\n\u003cp\u003e\"If I was sitting on your face no one will ever know it was you.\" She shrugs, gets up, grabs the coconut. \"And then we\u0027ll all be saved-la la la la.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not when the picture was taken, baby.\" I follow her into the bathroom, where she punches four holes in the coconut with the screwdriver and then leans over the Vivienne Tam-designed sink and pours the milk from the shell over her head.\u003c/p\u003e\n\u003cp\u003e\"I know, I agree.\" She tosses the husk into a wastebasket and massages the milk into her scalp. \"Damien finds out and you\u0027ll be working in a White Castle.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027ll be paying for your own abortions, so spare me.\" I raise my arms helplessly. \"Why do I always have to remind you that we shouldn\u0027t be seeing each other? If this photo gets printed it\u0027ll be time for us to wake up.\"\u003c/p\u003e\n\u003cp\u003e\"If this picture gets printed we\u0027ll just say it was a weak moment.\" She whips her head back and wraps her hair in a towel. \"Doesn\u0027t that sound good.\u003c/p\u003e\n\u003cp\u003e\"Jesus, baby, you\u0027ve got people out there watching your apartment.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" She beams into the mirror. \"Isn\u0027t it cute?\"\u003c/p\u003e\n\u003cp\u003e\"Why do I always need to remind you that I\u0027m basically still with, y\u0027know, Chloe and you\u0027re still with Damien?\"\u003c/p\u003e\n\u003cp\u003eShe turns away from the mirror and leans against the sink. \"If you dump me, baby, you\u0027ll be in a lot more trouble.\" She heads toward the closet.\u003c/p\u003e\n\u003cp\u003e\"Why is that?\" I ask, following her. \"What do you mean, Alison?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, let\u0027s just say rumor has it that you\u0027re looking at a new space.\" She pauses, holds up a pair of shoes. \"And we both know that if Damien knew that you were even contemplating your own pathetic club-slash-eatery while you\u0027re currently being paid to run Damien\u0027s own pathetic club-slash-eatery, therefore insulting Damien\u0027s warped sense of loyalty, the term `you\u0027re f**ked\u0027 comes vaguely to mind.\" She drops the shoes, leaves the closet.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not,\" I insist, following her. \"I swear I\u0027m not. Oh my god, who told you that?\"\u003c/p\u003e\n\u003cp\u003e\"Are you denying it?\"\u003c/p\u003e\n\u003cp\u003e\"N-no. I mean, I am denying it. I mean...\" I stand there.\u003c/p\u003e\n\u003cp\u003e\"Oh never mind.\" Alison drops the robe and puts on some panties. \"Three o\u0027clock tomorrow?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m swamped tomorrow, baby, so spare me,\" I stammer. \"Now, who told you I\u0027m looking at a new space?\"\u003c/p\u003e\n\u003cp\u003e\"Okay-three o\u0027clock on Monday.\"\u003c/p\u003e\n\u003cp\u003e\"Why three o\u0027clock? Why Monday?\"\u003c/p\u003e\n\u003cp\u003e\"Damien\u0027s having his unit cleaned.\" She tosses on a blouse.\u003c/p\u003e\n\u003cp\u003e\"His unit?\"\u003c/p\u003e\n\u003cp\u003e\"His\"-she whispers-\"extensions.\"\u003c/p\u003e\n\u003cp\u003e\"Damien has-extensions?\" I ask. \"He\u0027s the grossest guy, baby. He is so evil.\"\u003c/p\u003e\n\u003cp\u003eShe strides over to the armoire, sifts through a giant box of earrings. \"Oh baby, I saw Tina Brown at 44 today at lunch and she\u0027s coming tomorrow sans Harry and so is Nick Scotti, who-I know, I know-is a has-been but just looks great.\"\u003c/p\u003e\n\u003cp\u003eI move slowly back toward the frost-covered window, peer past the venetian blinds at the Jeep on Park.\u003c/p\u003e\n\u003cp\u003e\"I talked to Winona too. She is coming. Wait.\" Alison pushes two earrings into one ear, three into another, and is now pulling them out. \"Is Johnny coming?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" I murmur. \"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Johnny Depp,\" she shouts, throwing a shoe at me.\u003c/p\u003e\n\u003cp\u003e\"I guess,\" I say vaguely. \"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Goody,\" I hear her say. \"Rumor has it that Davey\u0027s very friendly with heroin-ooh, don\u0027t let Chloe get too close to Davey-and I also hear that Winona might go back to Johnny if Kate Moss disappears into thin air or a smallish tornado hurls her back to Auschwitz, which we\u0027re all hoping for.\" She notices the half-smoked cigarette floating in the Snapple bottle, then turns around, holding the bottle out to me accusingly, mentioning something about how Mrs. Chow loves kiwi-flavored Snapple. I\u0027m slouching in a giant Vivienne Tam armchair.\u003c/p\u003e\n\u003cp\u003e\"God, Victor,\" Alison says, hushed. \"In this light\"-she stops, genuinely moved-\"you look gorgeous.\"\u003c/p\u003e\n\u003cp\u003eGaining the strength to squint at her, I say, finally, \"The better you look, the more you see.\"\u003c/p\u003e\n\u003cp\u003eChapter Two\u003c/p\u003e\n\u003cp\u003eBack at my place downtown getting dressed to meet Chloe at Bowery Bar by 10 I\u0027m moving around my apartment cell phone in hand on hold to my agent at CAA. I\u0027m lighting citrus-scented votive candles to help mellow the room out, ease the tension, plus it\u0027s so freezing in my apartment it\u0027s like an igloo. Black turtleneck, white jeans, Matsuda jacket, slippers, simple and cool. Music playing is low-volume Weezer. TV\u0027s on-no sound-with highlights from the shows today at Bryant Park, Chloe everywhere. Finally a click, a sigh, muffled voices in the background, Bill sighing again. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-12.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
