{"id":69311,"no":124,"title":"Page 124","content":"\u003cp\u003e\"No, Victor,\" she says, shaking her head. \"Contrary to popular opinion, that is most definitely not a good thing.\"\u003c/p\u003e\n\u003cp\u003e\"Hey baby, why not?\"\u003c/p\u003e\n\u003cp\u003e\"Because it brings back our college years and I, for one, have no desire to relive them.\"\u003c/p\u003e\n\u003cp\u003e\"Oh come on, baby-you had fun at Camden. Admit it,\" I say. \"And don\u0027t look at me like I\u0027m insane.\"\u003c/p\u003e\n\u003cp\u003e\"Fun?\" she asks, appalled. \"Don\u0027t you remember Rupert Guest? Hanging out with him was fun?\"\u003c/p\u003e\n\u003cp\u003e\"He was a drug dealer, baby,\" I say. \"He wasn\u0027t even enrolled.\"\u003c/p\u003e\n\u003cp\u003e\"He wasn\u0027t?\" she asks, confused, then, remembering something both private and horrific, groans, \"Oh god.\"\u003c/p\u003e\n\u003cp\u003e\"I remember Roxanne Forest, however,\" I say, teasing her. \"And some really good times with that Swedish chick-Katrina Svenson.\"\u003c/p\u003e\n\u003cp\u003e\"Oh gross,\" she sighs, then she quickly recovers and decides to play along. \"Do you remember David Van Pelt? Mitchell Allen? Those were my good times.\"\u003c/p\u003e\n\u003cp\u003eA considerable pause. \"In that case-not friends of mine, baby.\"\u003c/p\u003e\n\u003cp\u003eI recognize the current expression on Jamie\u0027s face-time to taunt-and then she throws me a name, but I\u0027m staring at the black floor beneath us, trying to remember David Van Pelt or Mitchell Allen, momentarily zoning out, and I don\u0027t hear the name Jamie just mentioned. I ask her to repeat it.\u003c/p\u003e\n\u003cp\u003e\"Lauren Hynde?\" Jamie says, in a certain tone of voice. \"Do you remember her?\"\u003c/p\u003e\n\u003cp\u003e\"Um, no, not really,\" I say casually, reacting to her tone.\u003c/p\u003e\n\u003cp\u003e\"You must remember Lauren, Victor.\" She says this sighing, looking away. \"Lauren Hynde?\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t ring a bell,\" I say blankly. \"Why? Should it?\"\u003c/p\u003e\n\u003cp\u003e\"You left me for her.\"\u003c/p\u003e\n\u003cp\u003eAfter a long silence, trying to remember the particular sequence of events during any given term, I end up saying, \"No.\"\u003c/p\u003e\n\u003cp\u003e\"Oh Jesus, this might\u0027ve been a mistake.\" Jamie\u0027s moving around in her chair, uncomfortably, as if she\u0027s trying to unstick herself from the seat.\u003c/p\u003e\n\u003cp\u003e\"No, I remember her,\" I say, looking directly at Jamie. \"But I also remember that I\u0027d taken a term off and when I came back in December you weren\u0027t around-\"\u003c/p\u003e\n\u003cp\u003e\"I also had taken the term off, Victor,\" she counters.\u003c/p\u003e\n\u003cp\u003e\"Baby, the point is...\" Defeated, knowing there never was a point, that there never would be anything that could wrap this up neatly, I just ask quietly, \"Are you still pissed?\"\u003c/p\u003e\n\u003cp\u003e\"Oh yeah, it destroyed me,\" she says, rolling her eyes. \"I had to move to Europe to get over the genius.\"\u003c/p\u003e\n\u003cp\u003e\"Have you really lived here that long?\" I\u0027m asking, mystified. \"That\u0027s... impossible.\"\u003c/p\u003e\n\u003cp\u003e\"I live in New York, dodo,\" she says. \"I work in New York.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t we ever see each other?\"\u003c/p\u003e\n\u003cp\u003e\"I think the combination of your self-absorption and my fear of just about everyone in Manhattan conspires against us.\"\u003c/p\u003e\n\u003cp\u003e\"Oh baby, you\u0027re so tough,\" I\u0027m telling her. \"Nobody scares you.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know Alison Poole?\" she asks.\u003c/p\u003e\n\u003cp\u003e\"Um.\" I cough lightly and then mutter, \"I\u0027ll pass on that one.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not what I heard-\"\u003c/p\u003e\n\u003cp\u003e\"Hey, when\u0027s the last time you saw me?\" I ask, cutting her off. \"Because the Klonopin I\u0027m on affects long-term memory.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" she starts, \"I saw photos of you at the shows in WWD last week.\"\u003c/p\u003e\n\u003cp\u003e\"You mean the Todd Oldham show?\" I\u0027m asking. \"Do you still have that issue?\"\u003c/p\u003e\n\u003cp\u003e\"No, you were at the Calvin Klein show,\" she says.\u003c/p\u003e\n\u003cp\u003e\"Oh yeah,\" I say vacantly. \"Yeah, that\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"I guess I became aware of you-and that I wasn\u0027t going to be able to escape you-when I saw a Gap ad you did a couple years ago,\" she says. \"It was a pretty decent black-and-white photo of just your head and it said something like \u0027Even Victor Ward Wears Khakis\u0027 or whatever. It gave off the impression that you wore those khakis rather proudly, Victor. I was damn impressed.\"\u003c/p\u003e\n\u003cp\u003e\"Did we-\" I start, then shake my head. \"Forget it.\"\u003c/p\u003e\n\u003cp\u003e\"What? Did we end up hating each other? Did we end up the way we thought we always knew we would? Did I end up wearing khakis because of that f**king ad?\"\u003c/p\u003e\n\u003cp\u003e\"No, did we... ever do a fashion shoot for GQ together?\"\u003c/p\u003e\n\u003cp\u003eA long pause. She stares disconcertingly at my near-empty martini glass. \"How many of those have you had?\" Another pause. \"Boy-I think you need to get off the Klonopin, guy.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-124.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
