{"id":69313,"no":126,"title":"Page 126","content":"\u003cp\u003eMusic is melodic trip-hop on the level where Jamie and I have staked out a small lime-green couch below a massive steel staircase, white flowers surrounding us everywhere, a giant digital clock face glows in the dark, projected yards above us on the ceiling, and we\u0027re doing mellow coke Jamie scored effortlessly and because she stole a Waring blender from one of the kitchens we\u0027re drinking bright-orange slushy tequila punches and sometime during all of this Jamie changed into black Jil Sander, and unimportant paparazzi try to snap some shots but jamie\u0027s weary and I\u0027m looking a little too wired to be camera-ready so I push them away, snarling, \"Hey, she needs her privacy. Jesus-we\u0027re just people,\" and someone else floats by, taking up their interest, and I watch, a little disappointed, as the paparazzi follow, leaving us behind. Shadows are being taken aside and whispered to. We light each other\u0027s cigarettes.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Victor,\" Jamie says, exhaling. \"You didn\u0027t need to be that, um, firm, but I\u0027m glad you\u0027re feeling so... protective.\u003c/p\u003e\n\u003cp\u003e\"Everyone\u0027s so thin and gorgeous, baby,\" I\u0027m gushing, the cocaine flowing through me. \"And their teeth are, like, white. It\u0027s not exactly how I remember London, baby.\"\u003c/p\u003e\n\u003cp\u003e\"Well, since most of the people here are Americans I wouldn\u0027t worry about your memory.\"\u003c/p\u003e\n\u003cp\u003e\"This is the coolest party,\" I\u0027m gushing.\u003c/p\u003e\n\u003cp\u003e\"I thought you\u0027d be impressed,\" she sighs.\u003c/p\u003e\n\u003cp\u003e\"What do you think of this place?\" I ask, moving closer to her on the lime-green couch.\u003c/p\u003e\n\u003cp\u003e\"Well,\" she says, looking around, \"I think it looks a little too much like a new Philippe Starck hotel.\"\u003c/p\u003e\n\u003cp\u003e\"Too much?\" I\u0027m asking, confused. \"I think it\u0027s multi-useful, but baby, I don\u0027t want to talk about interior design, baby.\"\u003c/p\u003e\n\u003cp\u003e\"Well, what do you want to talk about?\" she says. \"Besides yourself\u003c/p\u003e\n\u003cp\u003e\"No, baby, I wanna talk about you.\" Pause. \"Well, you and me.\"\u003c/p\u003e\n\u003cp\u003eAnother pause. \"But let\u0027s start with you. Can I have the coke?\"\u003c/p\u003e\n\u003cp\u003eShe slips the vial into my hand. \"Let me guess-you want to be one of those guys whose ex-girlfriends never get over them, right?\"\u003c/p\u003e\n\u003cp\u003eI turn to the wall, do a few quick blasts and offer my nose for inspection. She nods her head, meaning it\u0027s fine, then I slip the vial back to her while she waves over to some guy in a gray three-button Prada suit who\u0027s talking to Oliver Payton. The guy in the suit waves back somewhat semi-pretentiously, I feel. They are both holding pythons.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s that?\" I\u0027m asking.\u003c/p\u003e\n\u003cp\u003e\"Someone who did the legs in that new Tommy Hilfiger ad,\" Jamie says.\u003c/p\u003e\n\u003cp\u003e\"This is the coolest party, baby,\" I\u0027m gushing.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re feeling great and looking even better, right?\"\u003c/p\u003e\n\u003cp\u003eI\u0027m nodding. \"The better you look, the more you see.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m seeing Emily Lloyd maintaining remarkable poise while eating a giant grilled shrimp,\" Jamie yawns, opening the vial, turning away.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so exhausted.\"\u003c/p\u003e\n\u003cp\u003e\"Hey look, there\u0027s Lulu Guinness-she made your bag,\" I\u0027m saying, totally wired. \"Hey, and there\u0027s Jared Leto-he\u0027s supposed to play me in the movie they\u0027re making of my life.\"\u003c/p\u003e\n\u003cp\u003eJamie flinches and turns back to me, wiping her nose and taking a large gulp of tequila punch. \"You need someone to teach you important life lessons, Victor.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, yeah, baby, exactly,\" I\u0027m saying. \"But I think you\u0027re just having a hard time dealing with my hypermasculine vibe.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be a wuss, baby,\" she warns.\u003c/p\u003e\n\u003cp\u003e\"Hey, if you didn\u0027t come to party, don\u0027t bother knocking on my door.\" I scoot closer to her, our thighs touching.\u003c/p\u003e\n\u003cp\u003e\"Yeah, that\u0027s me.\" She lights a cigarette, smiling. \"Little Miss Trouble.\"\u003c/p\u003e\n\u003cp\u003e\"\\Vhat happened to us at Camden, baby?\" I\u0027m asking. \"Because for the life of me I cannot remember.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I think what happened was that first we established that you were an idiot,\" she says casually, exhaling.\u003c/p\u003e\n\u003cp\u003e\"Uh-huh, uh-huh, but I think I have major credibility now-\"\u003c/p\u003e\n\u003cp\u003e\"You also had gigantic intimacy problems that I doubt you\u0027ve overcome.\u003c/p\u003e\n\u003cp\u003e\"Oh spare me, spare me.\" I\u0027m giggling. \"Come on, baby.\" Leaning into her, I open my arms wide. \"What could have possibly been wrong with me?\"\u003c/p\u003e\n\u003cp\u003e\"Besides not knowing your place?\" she asks. \"And that you liked to f**k complete strangers?\"\u003c/p\u003e\n\u003cp\u003e\"Hey, I thought you were the slutty one, baby,\" I say. \"I also think that I\u0027ve, er, evolved.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-126.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
