{"id":69338,"no":151,"title":"Page 151","content":"\u003cp\u003e\"Patience-hey, you\u0027re only twenty-three, what\u0027s the rush?\" Bentley asks, patting Brad\u0027s thigh, giving it a tight squeeze, which relaxes Brad, causes him to look down, blush slightly. \"It\u0027ll take me twenty minutes at most,\" Bentley promises, bending the cigarette into an ashtray. He stands up.\u003c/p\u003e\n\u003cp\u003e\"How do I know you\u0027ll come back?\" Brad asks, looking up at him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll leave this,\" Bentley says, hefting the Prada bag into Brad\u0027s lap. \"Just hold on to it.\"\u003c/p\u003e\n\u003cp\u003e\"Will you please hurry?\" Brad says, grinning. \"We\u0027re in dire need of stimulants.\"\u003c/p\u003e\n\u003cp\u003e\"You look just like Jon Bon Jovi,\" Bentley tells him.\u003c/p\u003e\n\u003cp\u003e\"So I\u0027ve been told.\" Brad smiles proudly.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what makes you so cool.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s that ABBA coming from?\" Dean asks, twisting around in his chair.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be back,\" Bentley says, brushing dots of confetti off Brad\u0027s shoulder. \"I\u0027ll be back.\" The Arnold Schwarzenegger impersonation doesn\u0027t work a second time and Bentley, who actually doesn\u0027t think Brad is half bad, silently cringes.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" Bentley asks, having noticed the crude drawing of what looks like a leaf and a number Brad is doodling on a napkin.\u003c/p\u003e\n\u003cp\u003e\"A design for a tattoo I want to get.\"\u003c/p\u003e\n\u003cp\u003e\"Why the number four?\" Bentley asks, squinting.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my favorite number.\"\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s nice you have one.\"\u003c/p\u003e\n\u003cp\u003e\"And see?\" Brad asks. \"That\u0027s a leaf.\"\u003c/p\u003e\n\u003cp\u003eBut it\u0027s time for Bentley to go, there are cues, signals given across the boulevard, emanating from various cars and vans, strategically parked, cameras whirring.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re gorgeous, baby,\" Brad says, kissing Bentley lightly on the mouth.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t lose that,\" Bentley says, pointing at the Prada bag.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll hold on to it, don\u0027t worry, just get the stuff,\" Brad says impatiently, urging Bentley to go, tightly clutching the Prada bag.\u003c/p\u003e\n\u003cp\u003eBentley walks away, disappearing into the crowd wandering the sidewalk tonight. \"He has the coolest apartment\" is the last thing Bentley ever hears Brad say.\u003c/p\u003e\n\u003cp\u003eAfter walking a block Bentley cuts across Boulevard Saint-Germain and hops into the black Citroen waiting at the curb, and as he smiles a shadow Crosses his face.\u003c/p\u003e\n\u003cp\u003eA telephoto lens slowly moves in on the Prada backpack sitting on Brad\u0027s lap.\u003c/p\u003e\n\u003cp\u003eThe force of the first explosion propels Brad into the air. A leg is blown off from the thigh down and a ten-inch hole is ripped open in his abdomen and his mangled body ends up lying in the curb on Boulevard Saint-Germain, splashing around in its own blood, writhing into its death throes. The second bomb in the Prada backpack is now activated.\u003c/p\u003e\n\u003cp\u003eDean and Eric, both spattered with Brad\u0027s flesh and bleeding profusely from their own wounds, manage to stumble over to where Brad has been thrown, screaming blindly for help, and then, seconds later, the other blast occurs.\u003c/p\u003e\n\u003cp\u003eThis bomb is much stronger than the first and the damage it causes is more widespread, creating a crater thirty feet wide in front of Cafe Flore.\u003c/p\u003e\n\u003cp\u003eTwo passing taxis are knocked over, simultaneously bursting into flame.\u003c/p\u003e\n\u003cp\u003eWhat\u0027s left of Brad\u0027s corpse is hurled through a giant Calvin Klein poster on a scaffolding across the street, splattering it with blood, viscera, bone.\u003c/p\u003e\n\u003cp\u003eEric is blown through the window of the Emporio Armani boutique across the street.\u003c/p\u003e\n\u003cp\u003eDean\u0027s body is spun onto a spiked railing that separates the sidewalk from the boulevard and hangs there, jackknifed.\u003c/p\u003e\n\u003cp\u003eShrapnel spreads out in all directions, hitting a middle-aged woman sitting inside the cafe, spraying into her neck, face and chest, killing her within moments.\u003c/p\u003e\n\u003cp\u003eA Japanese woman who had been sitting next to Brad\u0027s table stumbles, dazed, out of the smoke, both arms blown off at the elbow, before collapsing into the debris on the sidewalk.\u003c/p\u003e\n\u003cp\u003eA young Armenian lies half on the street, half on the sidewalk, his head blown apart, his moped still between his legs.\u003c/p\u003e\n\u003cp\u003eA severed arm dangles from the edge of the white overhang and large clumps of flesh are splattered across the Cafe Flore sign.\u003c/p\u003e\n\u003cp\u003eFrom behind the cameras on rooftops and inside various vans so much of it is the usual: bleeding people running out of thick black smoke, the screams of the wounded and dying, a man crawling along the boulevard vomiting blood, gasping for air, charred bodies hanging out of cars that happened to pass by Cafe Flore in the instant the bombs went off, shopping bags standing in blood outside the entrance. The shock, the sirens, a hundred wounded-it\u0027s all so familiar. The director is relying on a top-notch editor to put the footage together and he tells the crew it\u0027s time to move on. As the Range Rover drives quickly past the scene, crossing in front of the black Citroen, Bentley briefly notices a woman lying on the sidewalk screaming, her thigh torn open, and while lighting a cigarette he tells the director, \"Take me back to Les Bains, s\u0027il vous plait,\" where he listens to Jeanne Tripplehorn blab away about the cheese puffs at Taillevent for an hour and Bentley tells her he disapproves of interracial relationships. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-151.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
