{"id":69349,"no":162,"title":"Page 162","content":"\u003cp\u003e\"It\u0027s cold,\" she says, shivering.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I\u0027m saying. \"You need to stay warm.\u003c/p\u003e\n\u003cp\u003e\"I suppose so,\" she says abstractly. \"I\u0027m sorry about last night.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Bruce?\" I ask. \"What\u0027s the story, baby?\"\u003c/p\u003e\n\u003cp\u003e\"Oh Victor, please don\u0027t,\" Tammy sighs. \"He went to Athens. I don\u0027t ever want him to come between us again. I\u0027ll tell him everything when he gets back. Everything. I promise.\"\u003c/p\u003e\n\u003cp\u003e\"He already suspects,\" I say. \"It doesn\u0027t matter.\"\u003c/p\u003e\n\u003cp\u003e\"If I could only turn back time,\" she says, but not at all wistfully.\u003c/p\u003e\n\u003cp\u003e\"Can I believe the magic in your sighs?\" I lean in for a kiss.\u003c/p\u003e\n\u003cp\u003e\"You know you can.\" This is said too indifferently.\u003c/p\u003e\n\u003cp\u003eThe director calls \"Cut.\" He walks over and kneels down next to Tammy again. \"Baby?\" he asks. \"Are we all right?\"\u003c/p\u003e\n\u003cp\u003eTammy\u0027s unable to even nod, just keeps scratching a point on her back that she can\u0027t quite reach.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all about a light touch, baby,\" he\u0027s saying, lowering his sunglasses.\u003c/p\u003e\n\u003cp\u003eTammy sniffs, says \"I know\" but she doesn\u0027t and she\u0027s shivering too hard for the scene to continue, so the director takes her aside and as they walk away from the crew Tammy keeps shaking her head, trying to pull away. Freezing, I light a cigarette, squint at the Seine, the smell of shit everywhere, the Louvre sitting behind us long and boring, then I imagine a Saab with a poodle in the passenger seat driving by. My foot has fallen asleep.\u003c/p\u003e\n\u003cp\u003eTammy keeps looking back at me, making sure I\u0027m aware of the schedule, but I\u0027m already checking the face of the watch I was given last night by a member of the French film crew.\u003c/p\u003e\n\u003cp\u003eIn digital numbers it reads 9:57.\u003c/p\u003e\n\u003cp\u003eSomeone from the French film crew Rollerblades by, then slows down, making sure I notice him before he nods and glides off.\u003c/p\u003e\n\u003cp\u003eI stand up, flicking the cigarette away, and walk over to the director\u0027s chair and pick up a black Prada backpack sitting beneath it.\u003c/p\u003e\n\u003cp\u003e\"I have to use the rest room,\" I tell a PA.\u003c/p\u003e\n\u003cp\u003e\"Cool.\" He shrugs, inspecting a tattoo, a staff of musical notes, emblazoned on his bicep. \"It\u0027s your life.\"\u003c/p\u003e\n\u003cp\u003eI take the bag and wait at the museum\u0027s entrance until the watch hits 10:00 exactly.\u003c/p\u003e\n\u003cp\u003eAs instructed, I place the headphones of a Walkman over my ears, adjusting the volume while securing it to a clip attached to the belt I\u0027m wearing.\u003c/p\u003e\n\u003cp\u003eI press Play.\u003c/p\u003e\n\u003cp\u003eThe beginning of Ravel\u0027s \"Bolero\" starts booming through the headphones.\u003c/p\u003e\n\u003cp\u003eI\u0027m stepping onto an escalator. The black Prada backpack must be placed next to one of three pay phones in the carousel at the bottom of the Allee de Rivoli escalator.\u003c/p\u003e\n\u003cp\u003eFrom the opening strains of \"Bolero\" until its final crashing cymbals: 12 minutes and 38 seconds.\u003c/p\u003e\n\u003cp\u003eAt 10:01 the bomb is officially activated.\u003c/p\u003e\n\u003cp\u003eI\u0027m unfolding a map directing me where to go.\u003c/p\u003e\n\u003cp\u003eAt the bottom of the escalator six of the French film crew, including its director, are waiting, grim-faced, all in black.\u003c/p\u003e\n\u003cp\u003eThe director nods encouragingly from behind the Steadicam operator. The director wants this sequence done in one continuous shot. The director motions for me to remove the sunglasses that I forgot to take off while I was moving down the escalator.\u003c/p\u003e\n\u003cp\u003eWalking slowly through the Hall Napoleon, \"Bolero\" blaring, gathering momentum, I try not to walk sporadically, keeping a steady rhythm by counting the steps I\u0027m taking, by focusing my eyes on the floor, by making a wish.\u003c/p\u003e\n\u003cp\u003eAt 10:04 1 spot the phones.\u003c/p\u003e\n\u003cp\u003eAt 10:05 1 place the Prada bag at my feet. I pretend to make a call at the phone that takes credit cards.\u003c/p\u003e\n\u003cp\u003eI check my watch at 10:06.\u003c/p\u003e\n\u003cp\u003eI move away from the phone bank, the film crew walking alongside me.\u003c/p\u003e\n\u003cp\u003eI\u0027m supposed to stop and buy a Coke from a concession stand, which I do, taking a single sip before dumping it in a nearby trash bin.\u003c/p\u003e\n\u003cp\u003eI\u0027m moving back into the hall, the film crew walking alongside me, the Steadicam operator moving in front of me. 10:08. \"Bolero\" grows more insistent, moving at a faster pitch.\u003c/p\u003e\n\u003cp\u003eBut suddenly the crew is slowing down, causing me to slow down also.\u003c/p\u003e\n\u003cp\u003eGlancing up, I notice their stunned faces.\u003c/p\u003e\n\u003cp\u003eThe Steadicam operator stops moving, lifts his head away from the viewfinder.\u003c/p\u003e\n\u003cp\u003eSomeone touches my arm.\u003c/p\u003e\n\u003cp\u003eI rip the Walkman off my head and whirl around, panicked.\u003c/p\u003e\n\u003cp\u003eIt\u0027s a PA from the American film crew.\u003c/p\u003e\n\u003cp\u003eA young girl who looks like Heather Graham. The concerned expression on her face melds oddly into relief She\u0027s panting, smiling uneasily now.\u003c/p\u003e\n\u003cp\u003e\"You left this at the phone booth,\" she says. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-162.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
