{"id":69351,"no":164,"title":"Page 164","content":"\u003cp\u003e\"It\u0027s all pretty dim,\" I concur, shivering.\u003c/p\u003e\n\u003cp\u003e\"Oh, you\u0027re so ruthless,\" she sighs, twirling the parasol, dancing away, stranding me. I have been standing in the same position for so long that my leg has fallen asleep.\u0027\u003c/p\u003e\n\u003cp\u003eA trimmer Edgar Cameron-a minor, fleeting acquaintance from New York I haven\u0027t seen since last Christmas and whose girlfriend, Julia, is a reasonably fashionable vacuum I f**ked after I first started dating Chloe-has nodded at me several times since he entered the party and now, since I\u0027m standing alone, holding a glass of champagne, trying not to seem too bereft, I am a prime candidate for a visit. Julia told me that Edgar owns a hairless cat and is such a drunk that he once ate a squirrel he found in an alley off Mercer Street \"on a dare.\" I used to kiss Julia like I really cared, like I was going to stick around.\u003c/p\u003e\n\u003cp\u003e\"I owe you money, Victor,\" Edgar says apologetically, once he makes his way over. \"I know, I know. I owe you-what? Oh let\u0027s just make it an even two hundred.\" He pauses worriedly. \"Will you take francs?\"\u003c/p\u003e\n\u003cp\u003e\"Edgar, you don\u0027t owe me any money,\" I say softly, staring over at Jamie posing for a photographer.\u003c/p\u003e\n\u003cp\u003e\"Victor, that\u0027s very cool of you but I would\u0027ve picked up my part of the tab at Balthazar the other night if only I\u0027d-\"\u003c/p\u003e\n\u003cp\u003e\"Edgar, what are you talking about?\" I sigh, interrupting him.\u003c/p\u003e\n\u003cp\u003e\"Last week?\" Edgar says, vaguely waving to someone. \"At Balthazar. In New York. When you picked up the check. You put it on your card.\"\u003c/p\u003e\n\u003cp\u003ePause. \"I wasn\u0027t at Balthazar last week, Edgar,\" I say carefully. \"I haven\u0027t been in New York in...\" My voice trails off, something tiny and hard in me starts unfolding.\u003c/p\u003e\n\u003cp\u003eBut Edgar\u0027s laughing. \"You seemed to be in a much better mood the other night. Paris bumming you out? Oh look, there\u0027s Mouna Al-Rashid.\"\u003c/p\u003e\n\u003cp\u003e\"You could say that,\" I whisper. \"Edgar... when did we have dinner?\"\u003c/p\u003e\n\u003cp\u003e\"Last Tuesday,\" Edgar says, not laughing anymore, his smile fading. \"At Balthazar. A whole bunch of us. You put it on your card. Everyone gave you cash...\" Pause. Edgar stares at me as if I\u0027d suddenly fallen asleep. \"Except me. I offered to go to a cash machine but-\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t there, Edgar,\" I say softly, my eyes watering. \"That wasn\u0027t me.\u003c/p\u003e\n\u003cp\u003e\"But we went dancing afterwards, Vic,\" Edgar says. \"You were celebrating.\" He pantomimes someone having a good time. \"B-list models all night, a booth at Cheetah, the works.\"\u003c/p\u003e\n\u003cp\u003eI wipe away a tear that spills out of one eye, trying to smile. \"Oh man.\u003c/p\u003e\n\u003cp\u003e\"Victor, I mean, I don\u0027t...\" He tries to laugh. \"I mean, I called you at your apartment the next day. I left a message. I offered to take you to lunch.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t remember any of this, Edgar,\" I choke.\u003c/p\u003e\n\u003cp\u003e\"Well, you seemed very upbeat,\" he says, trying to convince me. \"You were talking about going back to school, to Columbia or NYU.\" Pause. \"You weren\u0027t smashed, Victor. In fact I don\u0027t even think you were drinking.\" Another pause. \"Are you... okay?\" Again, a pause. \"Do you have any pot?\"\u003c/p\u003e\n\u003cp\u003e\"Are you okay, Edgar?\" I ask back. \"Maybe you were really drunk, maybe-\"\u003c/p\u003e\n\u003cp\u003e\"Victor, my girlfriend, you know, Julia? Well \"No, not really.\"\u003c/p\u003e\n\u003cp\u003e\"Well, she said she ran into you at the Gap the next day,\" Edgar says, frowning. \"The one on Fifth Avenue? Downtown?\" Pause. \"She said you were buying sunscreen and looked, um, fairly cheerful.\"\u003c/p\u003e\n\u003cp\u003e\"Wait-who else was with us?\" I ask. \"At Balthazar?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it was me and Julia and-oh god, Victor, is this a joke?\" \"Just tell me,\" I say, wiping another tear that races down my cheek.\u003c/p\u003e\n\u003cp\u003e\"Please?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it was me and Julia and Rande Gerber, Mira Sorvino, someone from Demi Moore\u0027s production company, Ronnie Newhouse, someone from the Cardigans, and of course Damien and Lauren Hynde.\"\u003c/p\u003e\n\u003cp\u003eVery carefully I hand the champagne glass I\u0027m holding to Edgar, who tentatively takes it from me, mystified.\u003c/p\u003e\n\u003cp\u003e\"Victor, you were actually quite enchanting that night,\" Edgar says. \"Really. There\u0027s no need to cry. My god, you and Damien patched things up, the club\u0027s a resounding success and -\"\u003c/p\u003e\n\u003cp\u003e\"Edgar, please don\u0027t.\" Adrenaline rushing through me, I fumble around in my jacket pocket, find two Xanax, throw them in my mouth, toss my head back. I take the glass of champagne out of Edgar\u0027s hand and down it so quickly I start coughing.\u003c/p\u003e\n\u003cp\u003e\"You and Damien were talking about opening another place,\" Edgar says. \"In TriBeCa, I believe.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-164.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
