{"id":69363,"no":176,"title":"Page 176","content":"\u003cp\u003eI start weeping with relief \"I can be useful,\" I say. \"I can be, I can be really useful-\"\u003c/p\u003e\n\u003cp\u003e\"Bruce left a bag here. He forgot it.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" I\u0027m pressing the phone closer to my ear, wiping my nose with the sleeve of my jacket. \"What, man?\"\u003c/p\u003e\n\u003cp\u003e\"He left a Gucci tote bag behind,\" Felix says. \"I suppose you could come by and pick it up. That is, if you can be bothered, Victor-\"\u003c/p\u003e\n\u003cp\u003e\"Felix, wait-you\u0027ve got to get rid of that bag,\" I say, suddenly nauseous with adrenaline. \"Don\u0027t get near that bag.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll leave it with the concierge,\" Felix says, annoyed. \"I have no y intention of seeing you.\"\u003c/p\u003e\n\u003cp\u003e\"Felix,\" I shout. \"Don\u0027t get near that bag. Get everyone out of the hotel-\"\u003c/p\u003e\n\u003cp\u003e\"And do not try contacting us,\" Felix says over me. \"We\u0027ve shut down the production office in New York.\"\u003c/p\u003e\n\u003cp\u003e\"Felix, get out of the hotel-\"\u003c/p\u003e\n\u003cp\u003e\"Nice working with you,\" Felix says. \"But not really.\"\u003c/p\u003e\n\u003cp\u003e\"Felix,\" I\u0027m screaming.\u003c/p\u003e\n\u003cp\u003e(On the opposite side of Place Vendome, twenty technicians are at various lookout points and the director is studying a video playback monitor of the footage shot earlier today of Bruce Rhinebeck leaving the hotel, a toothpick in his teeth, Bruce posing for paparazzi, Bruce laughing mildly, Bruce hopping into a limousine with bulletproof windows. By now the French film crew has been outfitted with car protection for when the demolition team begins detonating the bombs.)\u003c/p\u003e\n\u003cp\u003eI start racing toward the Ritz.\u003c/p\u003e\n\u003cp\u003e(In a pale-pink room, Felix hangs up the phone. The suite Felix occupies is in fairly close proximity to the center of the hotel, which ensures that the explosion will cause as much structural damage as possible.\u003c/p\u003e\n\u003cp\u003eThe Gucci tote bag sits on the bed.\u003c/p\u003e\n\u003cp\u003eIt\u0027s so cold in the room that Felix\u0027s breath steams.\u003c/p\u003e\n\u003cp\u003eA fly lands on his hand.\u003c/p\u003e\n\u003cp\u003eFelix unzips the tote bag.\u003c/p\u003e\n\u003cp\u003eHe stares into it, quizzically.\u003c/p\u003e\n\u003cp\u003eIt\u0027s filled with red and black confetti.\u003c/p\u003e\n\u003cp\u003eHe brushes the confetti away.\u003c/p\u003e\n\u003cp\u003eSomething reveals itself.\u003c/p\u003e\n\u003cp\u003e\"No,\" Felix says.\u003c/p\u003e\n\u003cp\u003eThe bomb swallows Felix up, vaporizing him instantly. He literally disappears. There\u0027s nothing left.\u003c/p\u003e\n\u003cp\u003e24\u003c/p\u003e\n\u003cp\u003eA thundering sound.\u003c/p\u003e\n\u003cp\u003eImmediately, in the 1st arrondissement, all electricity goes dead.\u003c/p\u003e\n\u003cp\u003eThe blast shatters the Ritz from the center-almost front to back-weakening its structure as the pulse spreads to both sides of the hotel.\u003c/p\u003e\n\u003cp\u003eThe windows flex, then shatter, imploding.\u003c/p\u003e\n\u003cp\u003eA gigantic wall of concrete and glass rushes toward the tourists in the Place Vendome.\u003c/p\u003e\n\u003cp\u003eA ball of fire boils toward them.\u003c/p\u003e\n\u003cp\u003eA huge mass of black smoke, multilayered, irregular, rises up over Paris.\u003c/p\u003e\n\u003cp\u003eThe shock wave lifts the Ritz up, unhinging nearly all the support beams. The building starts sliding into the Place Vendome, its collapse accompanied by a whooshing roar.\u003c/p\u003e\n\u003cp\u003eThen another deafening roar.\u003c/p\u003e\n\u003cp\u003eChunks of debris keep falling, walls keep cracking apart, and there\u0027s so much dust the Place Vend6me looks as if a sandstorm has struck.\u003c/p\u003e\n\u003cp\u003eThe explosion is followed by the customary \"stunned silence.\"\u003c/p\u003e\n\u003cp\u003eThe sound of glass continuing to shatter is an introduction to the screaming.\u003c/p\u003e\n\u003cp\u003eBoulders of concrete litter the streets surrounding the Ritz and you have to climb over them to get into the Place Vendome, where people are running around covered in blood and screaming into cell phones, the sky above them overcast with smoke. The entire face of the hotel has been blown off, rubber roofing is flapping in the wind and several cars, mostly BMWs, are burning. Two limousines lie overturned and the smell of burned tar is everywhere, the streets and sidewalks entirely scorched.\u003c/p\u003e\n\u003cp\u003eThe body of a Japanese man dangles from the third story, caught between floors, drenched with blood, a huge shard of glass embedded in his neck, and another body hangs tangled in a mass of steel girders, its face frozen in anguish, and I\u0027m limping past piles of rubble with arms sticking out of them and past Louis XV furniture, a candelabra ten feet high, antique chests, and people keep staggering past me, some of them naked, tripping over plaster and insulation, and I pass a girl whose face is cut in half, the lower part of her body torn away, and the leg lying nearby is completely embedded with screws and nails, and another woman, blackened and writhing, one hand blown off, is screaming, dying, and a Japanese woman in the bloody tatters of a Chanel suit collapses in front of me, both her jugular vein and her carotid artery sliced open by flying glass, causing every breath she takes to gurgle blood.\u003c/p\u003e\n\u003cp\u003eStaggering toward a giant slab of concrete angled directly in front of the hotel, I see four men try to pull a woman out from beneath it and her leg comes off-detaches effortlessly-from what\u0027s left of her body, which is surrounded by unrecognizable chunks of flesh from which bones protrude. A man whose nose was slashed off by a shard of glass and a sobbing teenage girl lie next to each other in a widening pool of blood, her eyes burned out of their sockets, and the closer you move to what\u0027s left of the main entrance, the number of arms and legs scattered everywhere doubles and the skin sandblasted from bodies sits everywhere in giant, papery clumps, along with the occasional dead-body dummy. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-176.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
