{"id":69381,"no":194,"title":"Page 194","content":"\u003cp\u003e\"That\u0027s impossible,\" Bobby says crisply. \"I\u0027m starving.\"\u003c/p\u003e\n\u003cp\u003e\"Victor, it\u0027s really okay,\" Chloe says. \"I have to go anyway. I\u0027m totally jet-lagged. I came straight here from the airport.\"\u003c/p\u003e\n\u003cp\u003e\"Can I see you tomorrow?\" I ask.\u003c/p\u003e\n\u003cp\u003eA pause. For some reason she glances over at Bobby. \"Sure,\" Chloe says. \"Call me.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" I glance nervously at Bobby. \"I will.\"\u003c/p\u003e\n\u003cp\u003eChloe reaches over and wipes a smudge of lipstick off my cheek. She kisses me, she disappears.\u003c/p\u003e\n\u003cp\u003eThe three of us look on as the party swallows her up.\u003c/p\u003e\n\u003cp\u003e\"Come on, Victor,\" Bobby says.\u003c/p\u003e\n\u003cp\u003e\"No,\" I say, not getting up from the bench.\u003c/p\u003e\n\u003cp\u003e\"Ooh, he\u0027s being a little skittish,\" Bentley says.\u003c/p\u003e\n\u003cp\u003eBobby tugs \"playfully\" at my sleeve.\u003c/p\u003e\n\u003cp\u003e\"Come on. It\u0027s time to revel.\"\u003c/p\u003e\n\u003cp\u003eI slowly raise myself but it\u0027s really Bobby lifting up my entire weight with just one arm, pulling me off the bench. It\u0027s slippery walking down the staircase because the record store is encased in ice, and gold confetti streams down over us hideously, flies swarming everywhere.\u003c/p\u003e\n\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eOutside the Virgin megastore a limousine is waiting, an immense carnival surrounds us, bouncers fend off people way too hopeful of getting in. Tormented, I throw up twice beside the limo while Bobby lights a cigar.\u003c/p\u003e\n\u003cp\u003e\"Time to depart, Victor,\" Bentley says grimly. \"Get your ass up.\"\u003c/p\u003e\n\u003cp\u003e\"And do what?\" I croak. \"Stick it in your face?\"\u003c/p\u003e\n\u003cp\u003e\"Promises, promises,\" Bentley sighs, mock-wearily. \"Just get the f**k up. That\u0027s a boy.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re just making noise,\" I say, standing up.\u003c/p\u003e\n\u003cp\u003eOn the sidewalk Bertrand stares at me and I\u0027m staring back hatefully and then I break away from Bentley and Bobby and rush toward him, my fist raised high above my head, but Bobby ends up holding me back. Bertrand just smiles smugly, within inches of my reach. Slouching away, Bertrand curses in French, something I can\u0027t understand.\u003c/p\u003e\n\u003cp\u003e15\u003c/p\u003e\n\u003cp\u003eIn the limousine moving back to the house I\u0027m sitting between Bentley and Bobby.\u003c/p\u003e\n\u003cp\u003e\"Chloe Byrnes,\" Bobby\u0027s saying. \"How... intriguing.\"\u003c/p\u003e\n\u003cp\u003eMy head is resting on my knees and I\u0027m swallowing back dry heaves, breathing deeply.\u003c/p\u003e\n\u003cp\u003e\"I like Chloe Byrnes,\" Bobby says. \"She\u0027s not afraid to embrace her sensuality,\" he murmurs. \"Amazing body.\" Pause. \"Quite... distracting.\" He laughs darkly.\u003c/p\u003e\n\u003cp\u003e\"If you ever touch her, Bobby, I swear to god I will f**king kill you, I swear to god,\" I say, enunciating each word.\u003c/p\u003e\n\u003cp\u003e\"Ooh, how confrontational,\" Bentley giggles.\u003c/p\u003e\n\u003cp\u003e\"Shut up, you faggot,\" I mutter.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the pot calling the kettle black,\" Bentley says. \"Or so I hear.\"\u003c/p\u003e\n\u003cp\u003eBobby starts giggling too. \"Boys, boys.\"\u003c/p\u003e\n\u003cp\u003e\"Did you hear me, Bobby?\" I ask.\u003c/p\u003e\n\u003cp\u003eBobby keeps giggling and then, in a very tight voice, squeezing my thigh, says, \"You have neither the clout nor the experience to make a threat like that, Victor.\"\u003c/p\u003e\n\u003cp\u003e14\u003c/p\u003e\n\u003cp\u003eIn my bedroom at the house in the 8th or the 16th, sleeplessness is interrupted by the occasional unbearable dream-chased by raptors down hotel corridors, the word \"beyond\" appearing repeatedly, something wet keeps flying across the upper corner of the frame, making slapping noises, I\u0027m always brushing my hair, trying to find the most accurate way possible to create a part, and I\u0027m canceling dream appointments, keeping things loose, tumbling down steep flights of stairs that are too narrow to navigate and I\u0027m always over water and everyone I run across has a face resembling mine. Waking up, I realize: you\u0027re just someone waiting casually in the dark for a rustling outside your door and there\u0027s a shadow in the hall.\u003c/p\u003e\n\u003cp\u003eI open the door. The director from the French film crew is waiting.\u003c/p\u003e\n\u003cp\u003eHe seems nervous. He\u0027s holding a videotape, expectantly. He\u0027s wearing an expensive parka.\u003c/p\u003e\n\u003cp\u003eWithout being invited in, he slips past me, closes the door. Then he locks it.\u003c/p\u003e\n\u003cp\u003e\"What do you want?\" I ask, moving back to the bed.\u003c/p\u003e\n\u003cp\u003e\"I know we haven\u0027t talked much during the shoot, Victor,\" he starts apologetically, without the accent I expected.\u003c/p\u003e\n\u003cp\u003e\"I have nothing to say to you,\" I mutter.\u003c/p\u003e\n\u003cp\u003e\"And I understand,\" he says. \"In fact I think I understand why even more now.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay because I don\u0027t care, I have my own problems,\" I say, and then, yawning, \"What time is it?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s light out,\" he offers.\u003c/p\u003e\n\u003cp\u003eI reach over to the nightstand and swallow two Xanax. I tip a bottle of Evian to my mouth. I stare at the director hatefully. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-194.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
