{"id":69395,"no":208,"title":"Page 208","content":"\u003cp\u003eA thick, ripping sound. A mist of blood.\u003c/p\u003e\n\u003cp\u003eBentley\u0027s body jumps.\u003c/p\u003e\n\u003cp\u003eThe arm skids along the floor, the hand still clenching and unclenching itself\u003c/p\u003e\n\u003cp\u003eAnd then he starts screaming, deafeningly.\u003c/p\u003e\n\u003cp\u003eBlood pours out of the stump at his shoulder like water gushing from a hose and it just keeps splashing out, fanning across the terrazzo floor and under the bed.\u003c/p\u003e\n\u003cp\u003eBentley\u0027s mouth opens in a frozen scream and he starts gasping.\u003c/p\u003e\n\u003cp\u003eI\u0027m grimacing, shouting out, \"No no no no.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s a special effect, I\u0027m telling myself. It\u0027s makeup. Bentley is just a prop, something spasming wildly beneath me, his head whipping furiously from side to side, his eyes snapped open with pain, his voice just gurgling sounds now.\u003c/p\u003e\n\u003cp\u003eThe sharp smell of gunpowder wraps around us.\u003c/p\u003e\n\u003cp\u003eI\u0027m trying not to faint and I pull the gun up and, crouching down, hold it against the rope attached to his other arm.\u003c/p\u003e\n\u003cp\u003e\"Shoot it,\" he gasps. \"Shoot it.\"\u003c/p\u003e\n\u003cp\u003eI push it into the coil of rope and chain and pull the trigger.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eBentley\u0027s whining, pulling against his restraints.\u003c/p\u003e\n\u003cp\u003eI pull the trigger again.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eThe gun isn\u0027t loaded.\u003c/p\u003e\n\u003cp\u003eIn the flashlight\u0027s glare the color of Bentley\u0027s face is gray verging on white as blood keeps draining out of him, and his mouth keeps opening, making wheezing sounds.\u003c/p\u003e\n\u003cp\u003eForcing my hands to steady themselves I start uselessly tearing at the ropes and chain, trying to unknot them, and outside the wind keeps rising up, howling.\u003c/p\u003e\n\u003cp\u003eAnother terrible moment.\u003c/p\u003e\n\u003cp\u003eAnother clicking noise. This one at his left leg.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003etch tch tch tch\u003c/p\u003e\n\u003cp\u003eThen the whirring sound.\u003c/p\u003e\n\u003cp\u003eBentley understands what is happening and starts shrieking even before the device goes off and I\u0027m urinating in my pants and I whirl away, screaming with him, as the device makes its whoompf sound.\u003c/p\u003e\n\u003cp\u003eA horrible crunching noise.\u003c/p\u003e\n\u003cp\u003eThe device shreds his leg at the knee and when I turn around I see his leg slide across the floor and watch it knock into a wall with a hard thud, splattering it with blood, and I\u0027m crying out in revulsion.\u003c/p\u003e\n\u003cp\u003eBentley starts going in and out of shock.\u003c/p\u003e\n\u003cp\u003eI close my eyes.\u003c/p\u003e\n\u003cp\u003eThe device on the other leg goes off.\u003c/p\u003e\n\u003cp\u003e\"Shoot me!\" he\u0027s screaming, eyes bulging, swollen with pain, blood gushing out of him.\u003c/p\u003e\n\u003cp\u003eDesperately I try to unknot the rope wrapped around the device on his chest, my heartbeat thumping wildly in my ears.\u003c/p\u003e\n\u003cp\u003e\"Shoot me!\" he keeps screaming.\u003c/p\u003e\n\u003cp\u003eThe timer makes its characteristic noises.\u003c/p\u003e\n\u003cp\u003eI uselessly hold the Walther against his head and keep pulling the trigger and it keeps snapping hollowly.\u003c/p\u003e\n\u003cp\u003eThe other arm is blown off and blood splatters across the wall above the bed, splashing over another pentagram. Bentley\u0027s tongue is jutting out of his mouth and as he starts going into his death throes he bites it off.\u003c/p\u003e\n\u003cp\u003eThe device on his chest makes a whirring noise.\u003c/p\u003e\n\u003cp\u003eIt opens him up.\u003c/p\u003e\n\u003cp\u003eHis chest isn\u0027t there anymore.\u003c/p\u003e\n\u003cp\u003eIntestines spiral up out of him. A giant splat of blood hits the ceiling and it smells like meat in this room-it\u0027s sweet and rank and horrible-and since it\u0027s so cold, steam pours out of his wounds, gusts of it rising over the blood and chunks of flesh scattered across the floor and my legs are stiff from crouching so long and I stagger away and outside the wind keeps moaning.\u003c/p\u003e\n\u003cp\u003eI\u0027m backing into the hallway and there are dripping sounds as flesh slides down walls and bright lines of it are streaked across Bentley\u0027s twitching face, his mouth hanging open, and he\u0027s lying on a shiny mat of blood and clumps of flesh that covers the entire floor and I\u0027m walking out of the\u0027 room, one hand gripping the flashlight, the other hand smearing blood on anything I touch, wherever I have to steady myself.\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eI race to a bathroom, panting, keeping my head down, eyes on the floor even as I\u0027m turning corners, and in the bathroom mirror it looks like someone has painted my face red and the front of my shirt is matted thick with blood and flesh and I\u0027m pulling my clothes off screaming and then I fall into the shower and I\u0027m hitting my chest and pulling my hair, my eyes squeezed shut, tilting forward, falling against a tiled wall, my hands held out in front of me.\u003c/p\u003e\n\u003cp\u003eI find clothes in Bobby\u0027s room and dizzily just pull them on, dressing quickly, keeping my eyes on the bedroom door. Numb and singing softly to myself while crying, I quickly tie the laces on a pair of Sperry deck shoes I slipped on.\u003c/p\u003e\n\u003cp\u003eAs I stagger through the upstairs hallway I run past Bentley\u0027s room because I can\u0027t bear to see what\u0027s in it and I\u0027m sobbing but then I suddenly stop when I realize there\u0027s a new odor filling the house, overpowering the aroma of shit that hung in it before. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-208.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
