{"id":69399,"no":212,"title":"Page 212","content":"\u003cp\u003e\"Who was here?\" I\u0027m asking, flinging open the bathroom door.\u003c/p\u003e\n\u003cp\u003e\"Victor, calm down,\" Chloe says.\u003c/p\u003e\n\u003cp\u003e\"Where is he?\" I\u0027m asking, opening a closet door, slamming it shut. \"Who was here?\"\u003c/p\u003e\n\u003cp\u003e\"Bobby Hughes came over,\" she says, shivering, sitting down on a high-back chair in front of a desk where she was writing something in a large spiral notebook. She crosses her legs and stares at me sternly.\u003c/p\u003e\n\u003cp\u003e\"What did he want?\" I ask, calming down.\u003c/p\u003e\n\u003cp\u003e\"He just wanted to talk.\" She shrugs. \"He wanted to know where you were-\"\u003c/p\u003e\n\u003cp\u003e\"What did he say?\"\u003c/p\u003e\n\u003cp\u003e\"Victor-\"\u003c/p\u003e\n\u003cp\u003e\"Just answer me, goddamnit. What did he say?\"\u003c/p\u003e\n\u003cp\u003e\"He wanted to talk,\" she says, shocked. \"He wanted to have some champagne. He brought some by. He said it was to patch things up with you-whatever that means. I said no thank you, of course, and-\"\u003c/p\u003e\n\u003cp\u003e\"Did you really?\"\u003c/p\u003e\n\u003cp\u003eA long pause. \"I just had half a glass.\" She sighs. \"He wanted me to save it for you. It\u0027s over there in the ice bucket.\"\u003c/p\u003e\n\u003cp\u003e\"And\"-I breathe in-\"what else?\" Relief washes over me so hard that tears blur my vision.\u003c/p\u003e\n\u003cp\u003e\"Nothing. It was fine. He was celebrating-what, I don\u0027t know.\" She pauses, signifying something. \"He was sorry he missed you-\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I bet,\" I mutter.\u003c/p\u003e\n\u003cp\u003e\"Victor, he\u0027s...\" She sighs, then decides to go with it. \"He\u0027s worried about you.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care,\" I say.\u003c/p\u003e\n\u003cp\u003e\"I said he\u0027s worried about you,\" she exclaims.\u003c/p\u003e\n\u003cp\u003e\"Where is he?\"\u003c/p\u003e\n\u003cp\u003e\"He had to go,\" she says, clutching herself, shivering again.\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, Victor,\" she says. \"There was a party somewhere. There was another party somewhere;\"\u003c/p\u003e\n\u003cp\u003e\"What party? Where?\" I ask. \"It\u0027s very important, Chloe.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know where he went,\" she says. \"Listen, we had some champagne, we chatted briefly and then he went off to a party. What\u0027s wrong with you? Why are you so frightened?\"\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e\"Who was he with, baby?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"He was with a friend,\" she says. \"Someone who looked like Bruce Rhinebeck but I don\u0027t think it was Bruce.\"\u003c/p\u003e\n\u003cp\u003eA long pause. I\u0027m just standing in the middle of the suite, my arms at my sides. \"Bruce Rhinebeck?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, it was weird. He kind of looked like Bruce. But something was off about the guy. The hair was different or something.\" She grimaces, rubs her stomach. \"The guy said his name was Bruce but he didn\u0027t give a last name, so who knows, right?\"\u003c/p\u003e\n\u003cp\u003eI\u0027m just standing there.\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t happening,\" I murmur.\u003c/p\u003e\n\u003cp\u003eBruce Rhinebeck is dead.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s not happening?\" she asks, annoyed.\u003c/p\u003e\n\u003cp\u003eBruce Rhinebeck was defusing a bomb in an apartment on Quai de Bethune, and Bruce Rhinebeck is dead.\u003c/p\u003e\n\u003cp\u003e\"That wasn\u0027t Bruce Rhinebeck, baby.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it looked like Bruce Rhinebeck,\" Chloe says. This sounds too harsh and she moves into a gentler mode. \"That\u0027s all I\u0027m saying, okay? Victor, just calm down.\" She grimaces again.\u003c/p\u003e\n\u003cp\u003eI start pulling luggage out of the closet.\u003c/p\u003e\n\u003cp\u003eShe turns around. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re getting out of here,\" I say, throwing the Gucci luggage on the bed. \"Now.\"\u003c/p\u003e\n\u003cp\u003e\"Out of where, Victor?\" Chloe asks impatiently, shifting around in the chair.\u003c/p\u003e\n\u003cp\u003e\"Out of Paris,\" I say. \"We\u0027re going back to New York.\"\u003c/p\u003e\n\u003cp\u003e\"Victor, I have shows tomor-\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care,\" I shout. \"We\u0027re getting the hell out of here.\"\u003c/p\u003e\n\u003cp\u003e\"Victor, I\u0027m worried about you too,\" she says. \"Sit down for a minute. I want to talk.\"\u003c/p\u003e\n\u003cp\u003e\"No, no-I don\u0027t want to talk,\" I\u0027m saying. \"I just want to get out of here.\"\u003c/p\u003e\n\u003cp\u003e\"Stop it,\" she says, doubling over. \"Just sit down.\"\u003c/p\u003e\n\u003cp\u003e\"Chloe-\"\u003c/p\u003e\n\u003cp\u003e\"I have to use the bathroom,\" she says. \"But don\u0027t pack anything. I want to talk to you.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t feel well,\" she mutters.\u003c/p\u003e\n\u003cp\u003e\"Did you eat anything?\" I ask, suddenly concerned.\u003c/p\u003e\n\u003cp\u003e\"No, I just had that champagne.\"\u003c/p\u003e\n\u003cp\u003eI glance over at the ice bucket, at the bottle of Cristal lodged in it, the empty champagne flute sitting on the desk.\u003c/p\u003e\n\u003cp\u003eShe gets up from the desk. I watch her.\u003c/p\u003e\n\u003cp\u003eShe brushes past me.\u003c/p\u003e\n\u003cp\u003eI\u0027m staring at the glass and then I\u0027m moving toward it. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-212.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
