{"id":69400,"no":213,"title":"Page 213","content":"\u003cp\u003eLooking down into the glass, I notice granules of some kind.\u003c/p\u003e\n\u003cp\u003eAnd then I\u0027m looking down at something else.\u003c/p\u003e\n\u003cp\u003eOn the chair where Chloe was sitting is a huge bloodstain.\u003c/p\u003e\n\u003cp\u003eI\u0027m staring at it.\u003c/p\u003e\n\u003cp\u003eAnd then I\u0027m saying, \"Chloe?\"\u003c/p\u003e\n\u003cp\u003eShe turns around and says, \"Yeah?\"\u003c/p\u003e\n\u003cp\u003eAnd I don\u0027t want her to see how scared I suddenly am but then she sees where my gaze is directed.\u003c/p\u003e\n\u003cp\u003eShe starts breathing harshly. She looks down at herself\u003c/p\u003e\n\u003cp\u003eThe entire bottom half of her robe is soaked dark red with blood.\u003c/p\u003e\n\u003cp\u003e\"Chloe... \" I say again.\u003c/p\u003e\n\u003cp\u003eShe staggers over to the bathroom door and grabs the edge of it to balance herself and blood starts running down her legs in thin rivulets and when she lifts up the robe we both can see her underwear soaked with blood and she pulls it off, panicking, and suddenly a huge gush of blood expels itself from beneath the robe, splashing all over the bathroom floor.\u003c/p\u003e\n\u003cp\u003eShe gasps, a thick noise comes out of her throat and she doubles over, grabbing her stomach, then she screams. Looking surprised and still clutching her stomach, she vomits while staggering backward, collapsing onto the bathroom floor. There are strands of tissue hanging out of her.\u003c/p\u003e\n\u003cp\u003e\"Chloe,\" I scream.\u003c/p\u003e\n\u003cp\u003eShe starts scrambling across the bathroom floor, leaving a trail, a drag mark of dark red blood.\u003c/p\u003e\n\u003cp\u003eI\u0027m crawling with her in the bathroom and she\u0027s making harsh panting sounds, sliding across the tiles toward the bathtub.\u003c/p\u003e\n\u003cp\u003eAnother spray of blood comes out of her, along with a horrible ripping sound. She raises up a hand, screaming, and I\u0027m holding on to her and I can feel the screams buzzing through her, followed by another squelching, ripping noise.\u003c/p\u003e\n\u003cp\u003eIn the bathroom I grab the phone and push zero.\u003c/p\u003e\n\u003cp\u003e\"Help us,\" I\u0027m screaming. \"Someone\u0027s dying up here. I\u0027m in Chloe Byrnes\u0027 room and you\u0027ve got to send an ambulance. She\u0027s bleeding to death-oh f**king god she\u0027s bleeding to death-\"\u003c/p\u003e\n\u003cp\u003eSilence and then a voice asks, \"Mr. Ward?\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s the director\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"Mr. Ward?\" it asks again.\u003c/p\u003e\n\u003cp\u003e\"No! No! No!\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be right up, Mr. Ward.\"\u003c/p\u003e\n\u003cp\u003eThe line goes dead.\u003c/p\u003e\n\u003cp\u003eBursting into tears, I hurl the phone away from me.\u003c/p\u003e\n\u003cp\u003eI run out of the bathroom but on the phone by the bed there\u0027s no dial tone.\u003c/p\u003e\n\u003cp\u003eChloe\u0027s calling my name.\u003c/p\u003e\n\u003cp\u003eFrom where I\u0027m standing the entire bathroom floor seems washed with blood, as if something within her had liquefied.\u003c/p\u003e\n\u003cp\u003eBlood keeps fanning out from between her legs and some of it looks sandy, granular. A thick ring of flesh slides across the floor as Chloe cries out in pain and she keeps crying as I hold her and then she bursts into a series of hysterical, exhausted sobs and I\u0027m telling her everything will be okay, tears pouring from my eyes. Another long crooked rope of flesh falls out of her.\u003c/p\u003e\n\u003cp\u003e\"Victor! Victor!\" she screams madly, her skin yellowing, her screams turning liquid, her mouth opening and closing.\u003c/p\u003e\n\u003cp\u003eI press a towel against her vagina, trying to stem the bleeding, but the towel is drenched in a matter of seconds. She keeps making harsh panting sounds, then defecates loudly, arching her back, another piece of flesh lurching out of her, followed by another rush of blood that splashes onto the floor.\u003c/p\u003e\n\u003cp\u003eThere is warm blood all over my hands and I\u0027m yelling out, \"Baby please it\u0027s okay baby please it\u0027s okay baby-\"\u003c/p\u003e\n\u003cp\u003eAnother explosion of blood pours from between her legs, sickeningly hot, her eyes bulging, another giant intake of breath, and I can actually hear the horrible sounds coming from inside her body. Another harsh, startling yell.\u003c/p\u003e\n\u003cp\u003e\"Make it stop oh god make it stop,\" she screams, begging me, and I\u0027m sobbing, hysterical too.\u003c/p\u003e\n\u003cp\u003eAnother chunk of flesh, white and milky, spews out. After the next flash of pain cuts through her she can\u0027t even form words anymore.\u003c/p\u003e\n\u003cp\u003eShe\u0027s finally relaxing, trying to smile at me, but she\u0027s grimacing, her teeth stained with blood, the entire inside of her mouth coated violet, and she\u0027s whispering things, one hand tightly clasping mine while the other pounds spastically against the tiled floor, and the bathroom reeks powerfully of her blood, and as I\u0027m holding Chloe, her eyes fix on mine and I\u0027m sobbing, \"I\u0027m sorry baby I\u0027m so sorry baby,\" and there is surprise in those eyes as she realizes how imminent her death actually is and I\u0027m lapsing in and out of focus, disappearing, and she starts making animal noises and she\u0027s sagging in my arms and then her eyes roll back and she dies and her face turns white very quickly and slackens and the world retires from me and I quit everything as water the color of lavender keeps streaming out of her. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-213.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
