{"id":69401,"no":214,"title":"Page 214","content":"\u003cp\u003eI shut my eyes and clap my hands over my ears as the film crew rushes into the room.\u003c/p\u003e\n\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003eWe\u0027re on a motorway. In a large van. We\u0027re heading toward the airport. The driver is the best boy from the French film crew. I\u0027m catatonic, lying on the floor of the van surrounded by camera equipment, the legs of my pants sticky with Chloe\u0027s blood, and sometimes what\u0027s outside the windows of the van is just blackness, and other times it\u0027s a desert, maybe somewhere outside L.A., and other times it\u0027s a matte screen, sometimes electric blue, sometimes blinding white. Sometimes the van stops, then revs up and starts accelerating. Sometimes technicians are shouting orders into walkie-talkies.\u003c/p\u003e\n\u003cp\u003eThe director sits in the front passenger seat, going over call sheets.\u003c/p\u003e\n\u003cp\u003eOn the dashboard is an Uzi submachine gun.\u003c/p\u003e\n\u003cp\u003eThere\u0027s one interlude that plays itself out very quickly on the ride to the airport.\u003c/p\u003e\n\u003cp\u003eIt starts with a warning call from the driver, who is glancing anxiously into the rearview mirror.\u003c/p\u003e\n\u003cp\u003eA black truck is following us on the motorway.\u003c/p\u003e\n\u003cp\u003eThe first AD and the gaffer crouch down by the rear windows, both of them holding Uzis.\u003c/p\u003e\n\u003cp\u003eThey take aim.\u003c/p\u003e\n\u003cp\u003eThe black truck revs up and starts pounding down on us.\u003c/p\u003e\n\u003cp\u003eThe air inside the van suddenly feels radioactive.\u003c/p\u003e\n\u003cp\u003eThe van shudders violently as it\u0027s hit by bullets.\u003c/p\u003e\n\u003cp\u003eTiny rapid flashes of light exit the barrels of the Uzis the first AD and the gaffer are aiming at the black truck, which keeps racing defiantly toward us.\u003c/p\u003e\n\u003cp\u003eI try to balance myself as the van lurches forward.\u003c/p\u003e\n\u003cp\u003eThe black truck\u0027s windshield shatters, crumples.\u003c/p\u003e\n\u003cp\u003eThe truck veers to the right and collides with several cars.\u003c/p\u003e\n\u003cp\u003eThe black truck quietly careens off the motorway and overturns.\u003c/p\u003e\n\u003cp\u003eThe van guns its engine, racing away.\u003c/p\u003e\n\u003cp\u003eTwo seconds later a large fireball appears behind us.\u003c/p\u003e\n\u003cp\u003eI\u0027m lying on the floor, panting, until the property master and a PA lift me up so that I\u0027m facing the director.\u003c/p\u003e\n\u003cp\u003eOutside, it\u0027s a desert again and I\u0027m moaning.\u003c/p\u003e\n\u003cp\u003eThe van swerves into another lane.\u003c/p\u003e\n\u003cp\u003eThe director pulls a pistol from inside his jacket.\u003c/p\u003e\n\u003cp\u003eI just stare at it.\u003c/p\u003e\n\u003cp\u003eThe only thing that wakes me is the director saying, \"We know where Bobby Hughes is.\"\u003c/p\u003e\n\u003cp\u003eAnd then I\u0027m lunging for the gun, grabbing it, checking to see if it\u0027s loaded, but the PA pulls me back and I\u0027m told to calm down and the director takes the gun from my hands.\u003c/p\u003e\n\u003cp\u003e\"Bobby Hughes is trying to kill you,\" the director is saying.\u003c/p\u003e\n\u003cp\u003eThe property master is securing a knife sheath around my calf. A large silver blade with a black handle is slipped into it. The Prada slacks I\u0027m wearing are pulled down over the sheath.\u003c/p\u003e\n\u003cp\u003eThe director is telling me they would like to see Bobby Hughes dead. I\u0027m being asked if this is a \"possibility.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m nodding mindlessly. I keep moaning with anticipation.\u003c/p\u003e\n\u003cp\u003eAnd then we can smell the jet-fuel fumes everywhere and the driver brakes the van to a hard stop, tires screeching, jerking us all forward.\u003c/p\u003e\n\u003cp\u003e\"He needs to be stopped, Victor,\" the director says.\u003c/p\u003e\n\u003cp\u003eAfter the gun is slipped into my jacket I\u0027m sliding out of the van and the crew is following me, cameras rolling, and we\u0027re racing into the airport. Over the sound track: the noise of planes taking off.\u003c/p\u003e\n\u003cp\u003e2\u003c/p\u003e\n\u003cp\u003eThe crew direct me to a men\u0027s room on the first concourse and I\u0027m running toward the door, slamming against it with my shoulder, and the door flies open and I stumble inside. The men\u0027s room has already been lit, but not for the scene Bobby was expecting.\u003c/p\u003e\n\u003cp\u003eBobby\u0027s standing at a sink, inspecting his face in a mirror.\u003c/p\u003e\n\u003cp\u003eI\u0027m screaming as I run toward him at full sprint, my fist raised, the gun in it.\u003c/p\u003e\n\u003cp\u003eBobby turns, sees me, sees the crew following me, and his face seizes with shock and he screams, enraged, \"You f**ks!\" and raising his voice even higher, yells again. \"You total f**ks!\"\u003c/p\u003e\n\u003cp\u003eHe pulls out a gun that I knock out of his hand and it slides across the tiled floor under a sink, and Bobby\u0027s ducking instinctively as I throw myself forward into him, grabbing at his face, screaming.\u003c/p\u003e\n\u003cp\u003eHe reaches out and pulls my head back and slams into me so hard I\u0027m lifted off the ground and thrown against a tiled wall and then I\u0027m sliding to the floor, coughing.\u003c/p\u003e\n\u003cp\u003eBobby staggers back, then reaches out and grabs the lower part of my face.\u003c/p\u003e\n\u003cp\u003eI suddenly raise an arm, slamming my hand into his mouth, and he reels backward, turning a corner, skidding.\u003c/p\u003e\n\u003cp\u003eI lurch forward and slam him into a wall. I push the gun into his face, screaming, \"I\u0027m going to kill you!\"\u003c/p\u003e\n\u003cp\u003eHe swipes at the gun.\u003c/p\u003e\n\u003cp\u003eI pull the trigger-a bullet opens up a giant hole in the tiled wall behind him. I fire again-four, five, six times, until the gun is empty and the wall is blown apart. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-214.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
