{"id":69404,"no":217,"title":"Page 217","content":"\u003cp\u003eThe extras playing passengers are streaming out of the plane and they\u0027re congratulating the commandos and shaking hands with Delta and Crater, and paparazzi have arrived at the gate, snapping photos of these men who saved the plane. And when I notice Bertrand Ripleis playing one of the commandos in the background of a shot I start breathing harder.\u003c/p\u003e\n\u003cp\u003e\"No,\" I\u0027m saying, realizing something. \"No, no, this is wrong.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" the director asks, distracted. \"What do you mean? What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003eBertrand Ripleis is smiling, looking straight into the camera, almost as if he knows I\u0027m watching this. He\u0027s anticipating my surprise and the moans that start emanating from within me.\u003c/p\u003e\n\u003cp\u003eI know who you are and I know what you\u0027re doing\u003c/p\u003e\n\u003cp\u003e\"The bomb isn\u0027t on that plane,\" I\u0027m saying.\u003c/p\u003e\n\u003cp\u003eI glance down at the WINGS printout, crumpled in my hands.\u003c/p\u003e\n\u003cp\u003eBAND ON THE RUN\u003c/p\u003e\n\u003cp\u003e1985\u003c/p\u003e\n\u003cp\u003e511\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a song...,\" I\u0027m saying.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" the director asks.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a song,\" I\u0027m saying. \"It\u0027s not a flight.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s a song?\"\u003c/p\u003e\n\u003cp\u003e\"The song,\" I\u0027m saying. \"It\u0027s a song called \u00271985.\u0027\" \"It\u0027s a song?\" the director asks. He doesn\u0027t understand.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s on a Wings album,\" I\u0027m saying. \"It\u0027s on the Band on the Run album.\"\u003c/p\u003e\n\u003cp\u003e\"And?\" the director asks, confused.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a flight number,\" I\u0027m saying.\u003c/p\u003e\n\u003cp\u003e\"What isn\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"Five-one-one,\" I say.\u003c/p\u003e\n\u003cp\u003e\"Five-one-one isn\u0027t the flight number?\" the director asks. \"But this is it.\" The director gestures toward the video screen. \"That\u0027s flight five-one-one.\u003c/p\u003e\n\u003cp\u003e\"No,\" I\u0027m saying. \"It\u0027s how long the song is.\" I take in a deep breath, exhaling shakily. \"That song is five minutes and eleven seconds long. It\u0027s not a flight number.\"\u003c/p\u003e\n\u003cp\u003eAnd in another sky, another plane is reaching cruising altitude.\u003c/p\u003e\n\u003cp\u003e0\u003c/p\u003e\n\u003cp\u003eNight over France, and a giant shadow, a monstrous backdrop, is forming itself in the sky as the 747 approaches 17,000 feet, climbing to cruising altitude. The camera moves in on an airmail parcel bearing a Georgetown address, in which a Toshiba cassette player has been packed. The device will be activated as the opening piano notes to the song \"1985\" by Paul McCartney and Wings (Band on the Run; Apple Records; 1973) start playing. The bomb will detonate on the final crashing cymbal of the song-five minutes and eleven seconds after it began. A relatively simple microchip timer and strips of Remform equaling twenty ounces are in the Toshiba cassette player, and the parcel has been placed near the skin of the plane, where it will break through the fuselage, weakening the frame, causing the plane to break apart with greater ease. The plane is traveling at 3 5 0 miles an hour and is now at an altitude of 14,500 feet.\u003c/p\u003e\n\u003cp\u003eA giant crunching sound interrupts the pilot\u0027s conversation over the cockpit recording.\u003c/p\u003e\n\u003cp\u003eA violent noise, a distinct crashing sound, is followed by massive creaking, which rapidly starts repeating itself.\u003c/p\u003e\n\u003cp\u003eSmoke immediately starts pouring into the main cabin.\u003c/p\u003e\n\u003cp\u003eThe front end of the 747-including the cockpit and part of the first-class cabin-breaks away, plunging toward earth as the rest of the plane hurtles forward, propelled by the still intact engines. A complete row near the explosion-the people strapped in those seats screaming-is sucked out of the aircraft.\u003c/p\u003e\n\u003cp\u003eThis goes on for thirty seconds, until the plane starts breaking apart, a huge section of ceiling ripping away to reveal a wide vista of black sky.\u003c/p\u003e\n\u003cp\u003eAnd with its engines still running, the plane keeps flying but then drops three thousand feet.\u003c/p\u003e\n\u003cp\u003eThe noise the air makes is like a siren.\u003c/p\u003e\n\u003cp\u003eBottles of liquor, utensils, food from the kitchen-all fly backward into the business-class and coach cabins.\u003c/p\u003e\n\u003cp\u003eAnd the dying comes in waves.\u003c/p\u003e\n\u003cp\u003ePeople are rammed backward, bent in half, pulled up out of their seats, teeth are knocked out of heads, people are blinded, their bodies thrown through the air into the ceiling and then hurled into the back of the plane, smashing into other screaming passengers, as shards of aluminum keep breaking off the fuselage, spinning into the packed plane and shearing off limbs, and blood\u0027s whirling everywhere, people getting soaked with it, spitting it out of their mouths, trying to blink it out of their eyes, and then a huge chunk of metal flies into the cabin and scalps an entire row of passengers, shearing off the tops of their skulls, as another shard flies into the face of a young woman, halving her head but not killing her yet.\u003c/p\u003e\n\u003cp\u003eThe problem is that so many people are not ready to die, and they start vomiting with panic and fear as the plane drops another thousand feet. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-217.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
