{"id":69408,"no":221,"title":"Page 221","content":"\u003cp\u003e\"Baby, I was a model for many years,\" I say. \"I did. I have.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, don\u0027t be so flippant,\" she moans.\u003c/p\u003e\n\u003cp\u003e\"Alison,\" I say, sitting up a little. \"They also want to protect fruits and vegetables, okay?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong with that?\" she asks. \"It\u0027s eco-friendly.\"\u003c/p\u003e\n\u003cp\u003e\"Baby, peaches don\u0027t have mothers.\"\u003c/p\u003e\n\u003cp\u003e\"They have skin, Victor, and they have flesh.\"\u003c/p\u003e\n\u003cp\u003e\"I just think you\u0027re reality-challenged.\"\u003c/p\u003e\n\u003cp\u003e\"Who isn\u0027t?\" She waves me away. \"Animals need as much love and respect and care as we give people.\"\u003c/p\u003e\n\u003cp\u003eI consider this. I think about all the things I\u0027ve seen and done, and I consider this.\u003c/p\u003e\n\u003cp\u003e\"I think they\u0027re better off without that, baby,\" I say. \"In fact I think they\u0027re doing okay.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m hard again and I roll on top of her.\u003c/p\u003e\n\u003cp\u003eLater, afterwards, Alison asks me something. \"Did Europe change you, Victor?\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" I ask sleepily.\u003c/p\u003e\n\u003cp\u003e\"Because you seem different,\" she says softly. \"Did it?\"\u003c/p\u003e\n\u003cp\u003e\"I guess,\" I say after a long pause.\u003c/p\u003e\n\u003cp\u003e\"How?\" she asks.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m less...\" I stop. \"I\u0027m less... I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"What happened over there, Victor?\"\u003c/p\u003e\n\u003cp\u003eCarefully, I ask her, \"What do you mean?\"\u003c/p\u003e\n\u003cp\u003eShe whispers back, \"What happened over there?\"\u003c/p\u003e\n\u003cp\u003eI\u0027m silent, contemplating an answer, petting the chows. One licks my hand.\u003c/p\u003e\n\u003cp\u003e\"What happened to Chloe over there, Victor?\" Alison whispers.\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eAt Industria for the George magazine photo shoot I can\u0027t fathom why the press is making such a big deal about this. Simple before-and-after shots. Before: I\u0027m holding a Bass Ale, wearing Prada, a goatee pasted on my face, a grungy expression, eyes slits. After: I\u0027m carrying a stack of lawbooks and wearing a Brooks Brothers seersucker suit, a bottle of Diet Coke in my left hand, Oliver Peoples wireframes. THE TRANSFORMATION OF VICTOR WARD (UH, WE MEAN JOHNSON) is the headline on the cover for the January issue. The photo shoot was supposed to be outside St. Albans in Washington, D.C.-a school I had sampled briefly before being expelled-but Dad nixed it. He has that kind of clout. The Dalai Lama shows up at Industria, and I\u0027m shaking hands with Chris Rock, and one of Harrison Ford\u0027s sons-an intern at George-is milling about, along with various people who resigned from the Clinton administration, and MTV\u0027s covering the shoot for \"The Week in Rock\" and a VJ\u0027s asking me questions about the Impersonators\u0027 new huge contract with DreamWorks and how I feel about not being in the band anymore and I give a cute sound bite by saying, \"Law school\u0027s easier than being in that band,\" and it\u0027s all very Eyes of Laura Mars but it\u0027s also faux-subdued because everyone\u0027s very respectful of what happened to Chloe.\u003c/p\u003e\n\u003cp\u003eJohn F. Kennedy, Jr., who\u0027s really just another gorgeous goon, is shaking my hand and he\u0027s saying things like \"I\u0027m a big fan of your dad\u0027s\" and I\u0027m saying \"Yeah?\" and though I\u0027m basically calm and amused, there\u0027s one awkward moment when someone who went to Camden accosts me and I simply can\u0027t place him. But I\u0027m vague enough that he can\u0027t become suspicious and then he simply slouches away, giving up.\u003c/p\u003e\n\u003cp\u003e\"Hey!\" An assistant with a cell phone rushes over to where I\u0027m standing. \"Someone wants to talk to you.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"Chelsea Clinton wants to say hi,\" the assistant pants.\u003c/p\u003e\n\u003cp\u003eI take the phone from the assistant. Over static I hear Chelsea ask, \"Is it really you?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" I\u0027m grinning \"sheepishly.\" I\u0027m blushing, \"red-faced.\"\u003c/p\u003e\n\u003cp\u003eA Eureka moment handled suavely.\u003c/p\u003e\n\u003cp\u003eI find it a little difficult to relax once the photo session starts.\u003c/p\u003e\n\u003cp\u003eThe photographer says, \"Hey, don\u0027t worry-it\u0027s hard to be yourself.\"\u003c/p\u003e\n\u003cp\u003eI start smiling secretly, thinking secret things.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it!\" the photographer shouts.\u003c/p\u003e\n\u003cp\u003eFlashes of light keep going off as I stand perfectly still.\u003c/p\u003e\n\u003cp\u003eOn my way out I\u0027m handed an invitation by a nervous groupie to a party for PETA tomorrow night that the Gap is sponsoring at a new restaurant in Morgan\u0027s Hotel.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know if I can make it,\" I tell a supermodel who\u0027s standing nearby.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the outgoing type,\" the supermodel says. I read recently that she just broke up with her boyfriend, an ex-model who runs a new and very fashionable club called Ecch! She smiles flirtatiously as I start heading out.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" I ask, flirting back. \"How do you know?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-221.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
