{"id":69413,"no":226,"title":"Page 226","content":"\u003cp\u003eI order a premium cold sake and tell Eva that I got the part in Flatliners II. Eva says she\u0027s very happy for me.\u003c/p\u003e\n\u003cp\u003e\"So where\u0027s your boyfriend tonight?\" I ask, smiling.\u003c/p\u003e\n\u003cp\u003e\"A certain guy is out of town,\" Eva says evasively.\u003c/p\u003e\n\u003cp\u003e\"Where is he?\" I ask, teasing her.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s actually at the Fuji Rock Festival,\" she says, rolling her eyes, sipping the green tea.\u003c/p\u003e\n\u003cp\u003e\"I know someone who went to that.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe they went together.\"\u003c/p\u003e\n\u003cp\u003e\"Who knows?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she says, opening a menu. \"Who knows?\"\u003c/p\u003e\n\u003cp\u003e\"The point is: you don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, that is the point.\"\u003c/p\u003e\n\u003cp\u003e\"You look beautiful.\"\u003c/p\u003e\n\u003cp\u003eShe doesn\u0027t say anything.\u003c/p\u003e\n\u003cp\u003e\"Did you hear me?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"Nice suit,\" she says without looking up.\u003c/p\u003e\n\u003cp\u003e\"Are we making shoptalk?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re getting quite the press these days,\" Eva says, tapping the copy of the Observer. \"Wherever you seem to go there\u0027s a paparazzi alert.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not all sunglasses and autographs, baby.\"\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t these people ridiculous?\" I ask, vaguely gesturing.\u003c/p\u003e\n\u003cp\u003e\"Oh, I don\u0027t know,\" she says. \"The simplicity is almost soothing. It\u0027s like being back in high school.\"\u003c/p\u003e\n\u003cp\u003e\"Why is it like that?\"\u003c/p\u003e\n\u003cp\u003e\"Because you realize that hanging out with dumb people makes you feel much smarter,\" she says. \"At least that\u0027s how I viewed high school.\"\u003c/p\u003e\n\u003cp\u003e\"Where were you while we were getting high?\" I murmur to myself, concentrating on avoiding eye contact with anyone in the room.\u003c/p\u003e\n\u003cp\u003e\"Pardon?\"\u003c/p\u003e\n\u003cp\u003e\"My mind is definitely expanding,\" I say, clearing my throat.\u003c/p\u003e\n\u003cp\u003e\"Without us this is all just trash,\" she agrees.\u003c/p\u003e\n\u003cp\u003eI\u0027m reaching for the edamame.\u003c/p\u003e\n\u003cp\u003e\"Speaking of,\" Eva starts. \"How\u0027s Alison Poole?\"\u003c/p\u003e\n\u003cp\u003e\"I have a feeling I\u0027m breaking her heart.\"\u003c/p\u003e\n\u003cp\u003e\"I have a feeling you\u0027re good at breaking hearts,\" Eva says.\u003c/p\u003e\n\u003cp\u003e\"She keeps asking questions about Chloe Byrnes,\" I murmur.\u003c/p\u003e\n\u003cp\u003eEva doesn\u0027t say anything. Soon she\u0027s sipping a Stolichnaya Limonnaya vodka and I\u0027m picking at a plate of hijiki.\u003c/p\u003e\n\u003cp\u003e\"What did you do today?\" I ask before realizing I\u0027m not particularly interested, even though I\u0027m squeezing Eva\u0027s thigh beneath the table.\u003c/p\u003e\n\u003cp\u003e\"I had a photo shoot. I had lunch with Salt-n-Pepa. I avoided certain people. I contacted the people I didn\u0027t avoid.\" Eva breathes in. \"My life right now is actually simpler than I thought it was going to be.\" She sighs, but not unhappily. \"If there are some things I\u0027m not used to yet, it\u0027s still sweet.\"\u003c/p\u003e\n\u003cp\u003e\"I dig it,\" I say. \"I hear where you\u0027re coming from, baby,\" I say, mimicking a robot.\u003c/p\u003e\n\u003cp\u003eEva giggles, says my name, lets me squeeze her thigh harder.\u003c/p\u003e\n\u003cp\u003eBut then I\u0027m looking away and things get difficult. I down another cup of sake.\u003c/p\u003e\n\u003cp\u003e\"You seem distracted,\" Eva says.\u003c/p\u003e\n\u003cp\u003e\"Something happened last night,\" I murmur.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eI tell her, whispering.\u003c/p\u003e\n\u003cp\u003e\"We need to be careful,\" Eva says.\u003c/p\u003e\n\u003cp\u003eSuddenly a couple is looming over us and I hear someone exclaim, \"Victor? Hey man, what\u0027s up.\"\u003c/p\u003e\n\u003cp\u003eBreathing in, I look up with a practiced smile.\u003c/p\u003e\n\u003cp\u003e\"Oh, hi,\" I say, reaching out a hand.\u003c/p\u003e\n\u003cp\u003eA fairly hip couple, our age. The guy-who I don\u0027t recognize-grabs my hand and shakes it with a firm grip that says \"please remember me because you\u0027re so cool,\" and the girl he\u0027s with is bouncing up and down in the crush of the restaurant and she offers a little wave and Eva nods, offers a little wave back.\u003c/p\u003e\n\u003cp\u003e\"Hey Corrine,\" the guy says, \"this is Victor Ward-oh, sorry\"-the guy catches himself-\"I mean Victor Johnson. Victor, this is Corrine.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, nice to meet you,\" I say, taking Corrine\u0027s hand.\u003c/p\u003e\n\u003cp\u003e\"And this is Lauren Hynde,\" the guy says, gesturing toward Eva, who keeps smiling, sitting perfectly still.\u003c/p\u003e\n\u003cp\u003e\"Hi, Lauren, I think we met already,\" Corrine says. \"At that Kevyn Aucoin benefit? At the Chelsea Piers? Alexander McQueen introduced us. You were being interviewed by MTV. It was a screening of that movie?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, right, right, of course,\" Eva says. \"Yeah. Right. Corrine.\"\u003c/p\u003e\n\u003cp\u003eHey, Lauren,\" the guy says, a little too shyly.\u003c/p\u003e\n\u003cp\u003e\"Hi, Maxwell,\" Eva says with an undercurrent of sexiness.\u003c/p\u003e\n\u003cp\u003e\"How do you guys know each other?\" I ask, looking first at Maxwell and then at Eva. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-226.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
