{"id":69415,"no":228,"title":"Page 228","content":"\u003cp\u003eChapter Twenty-One\u003c/p\u003e\n\u003cp\u003e1\u003c/p\u003e\n\u003cp\u003eThe next day production assistants from the French film crew feed me heroin as they fly me into Milan on a private jet someone named Mr. Leisure has supplied, which is piloted by two Japanese men. The plane lands at Linate airport and the PAs check me into the Principe di Savoia on a quiet Friday afternoon in the off-season. I stay locked in a suite, guarded by a twenty-three-year-old Italian named Davide, an Uzi strapped across his chest. The film crew is reportedly staying in the Brera section of town but no one provides me with a phone number or an address and only the director makes contact, every three days or so. One night Davide moves me to the Hotel Diana and the following morning I\u0027m moved back to the Principe di Savoia. I\u0027m told that the crew is now filming exteriors outside La Posta Vecchia. I\u0027m told that they will be leaving Milan within the week. I\u0027m told to relax, to stay beautiful.\u003c/p\u003e\n\u003cp\u003e2\u003c/p\u003e\n\u003cp\u003eI call my sister in Washington, D.C.\u003c/p\u003e\n\u003cp\u003eThe first time, her machine picks up. I don\u0027t leave a message.\u003c/p\u003e\n\u003cp\u003eThe second time I call, she answers, but it\u0027s the middle of the night there.\u003c/p\u003e\n\u003cp\u003e\"Sally?\" I whisper.\u003c/p\u003e\n\u003cp\u003e\"Hello?\"\u003c/p\u003e\n\u003cp\u003e\"Sally?\" I whisper. \"It\u0027s me. It\u0027s Victor.\"\u003c/p\u003e\n\u003cp\u003e\"Victor?\" she asks, groaning.\u003c/p\u003e\n\u003cp\u003e\"What time is it?\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t know what to say so I hang up.\u003c/p\u003e\n\u003cp\u003eLater, when I call again, it\u0027s morning in Georgetown.\u003c/p\u003e\n\u003cp\u003e\"Hello?\" she answers.\u003c/p\u003e\n\u003cp\u003e\"Sally, it\u0027s me again,\" I say.\u003c/p\u003e\n\u003cp\u003e\"Why are you whispering?\" she asks, annoyed. \"Where are you?\"\u003c/p\u003e\n\u003cp\u003eHearing her voice, I start crying.\u003c/p\u003e\n\u003cp\u003e\"Victor?\" she asks.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in Milan,\" I whisper between sobs.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re where?\" she asks.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in Italy.\"\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e\"Victor?\" she starts.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" I say, wiping my face.\u003c/p\u003e\n\u003cp\u003e\"Is this a joke?\"\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027m in Milan... I need your help.\"\u003c/p\u003e\n\u003cp\u003eShe barely pauses before her voice changes and she\u0027s asking, \"Whoever this is, I\u0027ve gotta go.\"\u003c/p\u003e\n\u003cp\u003e\"No no no no-wait, Sally-\"\u003c/p\u003e\n\u003cp\u003e\"Victor, I\u0027m seeing you for lunch at one, okay?\" Sally says. \"What in the hell are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Sally,\" I whisper.\u003c/p\u003e\n\u003cp\u003e\"Whoever this is, don\u0027t call back.\"\u003c/p\u003e\n\u003cp\u003e\"Wait, Sally-\"\u003c/p\u003e\n\u003cp\u003eShe hangs up.\u003c/p\u003e\n\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003eDavide is from Legnano, an industrial suburb northwest of Milan, and he has black and golden hair and he keeps eating peppermint candies from a green paper bag as he sits in a little gold chair in the suite at the Principe di Savoia. He tells me he used to be a champagne delivery boy, that he has ties to the Mafia, that his girlfriend is the Italian Winona Ryder. He flares his nostrils and offers penetrating looks. He smokes Newport Lights and sometimes wears a scarf and sometimes doesn\u0027t. Sometimes he lets slip that his real name is Marco. Today he\u0027s wearing a cashmere turtleneck in avocado green. Today he\u0027s playing with a Ping-Pong ball. His lips are so thick it looks as if he were born making out. He plays a computer game, occasionally looking over at the music videos flashing by on MTV Italia. I gaze at him restlessly from my bed as he keeps posing in place. He makes spit bubbles. Rain outside thrashes against the window and Davide sighs. The ceiling: a blue dome.\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eAnother day. Outside, rain pours down continuously, the wrong kind of weather. I\u0027m eating an omelette that Davide ordered up but it has no taste. Davide tells me that his favorite TV newscaster is Simona Ventura and that he met her once at L\u0027Isola. In the suite next to ours a Saudi prince is behaving badly with a beautiful married woman. The director from the French film crew calls. It has been a week since we last spoke.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Palakon?\" I automatically ask.\u003c/p\u003e\n\u003cp\u003e\"Ah,\" the director sighs. \"There\u0027s that name again, Victor.\"\u003c/p\u003e\n\u003cp\u003e\"Where is he?\" I\u0027m gasping.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve been through this a hundred times,\" the director says. \"There is no Palakon. I\u0027ve never heard that name.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s just too heavy for me to accept at this point.\"\u003c/p\u003e\n\u003cp\u003e\"Well, lighten up,\" the director says. \"I don\u0027t know what else to tell you.\"\u003c/p\u003e\n\u003cp\u003e\"I want to go back,\" I\u0027m weeping. \"I want to go home.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s always that possibility, Victor,\" the director says. \"Don\u0027t discount it.\"\u003c/p\u003e\n\u003cp\u003e\"Why aren\u0027t you paying attention to me anymore?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t called in a week.\"\u003c/p\u003e\n\u003cp\u003e\"Plans are forming,\" is all the director says. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-228.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
