{"id":69417,"no":230,"title":"Page 230","content":"\u003cp\u003eHis cell phone rings.\u003c/p\u003e\n\u003cp\u003eDavide answers it, dulled out, eyes empty.\u003c/p\u003e\n\u003cp\u003eHe speaks quickly in Italian. Then he listens. Then he speaks quickly again before clicking off.\u003c/p\u003e\n\u003cp\u003e\"Someone\u0027s coming,\" Davide says. \"To see us.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m humming listen to the wind blow, watch the sun rise.\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eA knock on the door.\u003c/p\u003e\n\u003cp\u003eDavide opens it.\u003c/p\u003e\n\u003cp\u003eA beautiful young girl enters the room. Davide and the girl embrace and chat amiably in Italian while I stare, dazed, from the bed. The girl is holding an envelope and in the envelope is a videocassette. Without being introduced, she hands it to me.\u003c/p\u003e\n\u003cp\u003eI stare at it dumbly, then Davide impatiently yanks it out of my hand and slips it into the VCR beneath the television set.\u003c/p\u003e\n\u003cp\u003eDavide and the girl move over to another room in the suite as the tape starts playing.\u003c/p\u003e\n\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eIt\u0027s an episode of \"60 Minutes\" but without the sound.\u003c/p\u003e\n\u003cp\u003eDan Rather introduces a segment. Behind him a mock-up of a magazine story. My father\u0027s face. And below that, half in shadow, is my face.\u003c/p\u003e\n\u003cp\u003eAzaleas. At the home of Pamela Digby Churchill Hayward Harriman. A dinner party for Samuel Johnson. A fund-raiser for his presidential bid. The guests: Ruth Hotte and Ed Huling and Deborah Gore Dean and Barbara Raskin and Deborah Tannen and Donna Shalala and Hillary Clinton and Muffy Jeepson Stout. There\u0027s Ben Bradlee and Bill Seidman and Malcolm Endicott Peabody. There\u0027s Clayton Fritcheys and Brice Clagett and Ed Burling and Sam Nunn. There\u0027s Marisa Tomei and Kara Kennedy and Warren Christopher and Katharine Graham and Esther Coopersmith.\u003c/p\u003e\n\u003cp\u003eAnd Dad\u0027s standing with a woman in her mid-forties wearing a Bill Blass cocktail dress. I glimpse her only briefly.\u003c/p\u003e\n\u003cp\u003eNow Dan Rather\u0027s interviewing my father in his office.\u003c/p\u003e\n\u003cp\u003eDad has obviously had a face-lift and his upper-lip-to-nose area has been shortened, droopy lids have been lifted and his teeth are bleached. He\u0027s laughing, relaxed.\u003c/p\u003e\n\u003cp\u003eThen a series of photos flash by. Dad with Mort Zuckerman. Dad with Shelby Bryan. Dad with Strom Thurmond. Dad with Andrea Mitchell.\u003c/p\u003e\n\u003cp\u003eSuddenly: file footage. An interview with my mother from the mid- 1980s. A clip of my father and mother at the White House, standing with Ronald and Nancy Reagan.\u003c/p\u003e\n\u003cp\u003eDan Rather interviewing my father again.\u003c/p\u003e\n\u003cp\u003eA montage: Brooks Brothers, Ann Taylor, Tommy Hilfiger.\u003c/p\u003e\n\u003cp\u003eAnd then I\u0027m walking along Dupont Circle being interviewed by Dan Rather.\u003c/p\u003e\n\u003cp\u003eThis is suddenly intercut with footage that the \"Entertainment Tonight\" crew shot last fall of me working out with Reed at his gym.\u003c/p\u003e\n\u003cp\u003eVarious shots from my portfolio: Versace, CK One, an outtake from Madonna\u0027s Sex. Paparazzi shots of me leaving a nightclub called Crush. A shot of me leaving the Jockey Club.\u003c/p\u003e\n\u003cp\u003eI\u0027m being interviewed by Dan Rather downstairs at Red Sage.\u003c/p\u003e\n\u003cp\u003eI\u0027m laughing, relaxed, wearing wire-rimmed glasses. I\u0027m dressed preppily in a Brooks Brothers suit. I\u0027m nodding at everything that is being asked of me.\u003c/p\u003e\n\u003cp\u003eDan Rather shows me a photo from a Vogue layout where I\u0027m wearing Calvin Klein boxer-briefs and painting Christy Turlington\u0027s toenails. Dan Rather is gesturing, making comments about my physical attractiveness.\u003c/p\u003e\n\u003cp\u003eI keep nodding my head as if ashamed.\u003c/p\u003e\n\u003cp\u003eAnd then: a photo of Chloe Byrnes, followed by various magazine covers.\u003c/p\u003e\n\u003cp\u003eA shot of Hotel Costes in Paris.\u003c/p\u003e\n\u003cp\u003eA montage of her funeral in New York.\u003c/p\u003e\n\u003cp\u003eI\u0027m sitting in the front row, crying, Alison Poole and Baxter Priestly both offering comfort.\u003c/p\u003e\n\u003cp\u003eInterviews with Fred Thompson and then Grover Norquist and then Peter Mandelson.\u003c/p\u003e\n\u003cp\u003eShots of me walking through Washington Square Park.\u003c/p\u003e\n\u003cp\u003eDad again. He\u0027s walking out of the Palm with that woman in her mid-forties, dark hair, pretty but also plain enough not to be intimidating. They\u0027re holding hands\u003c/p\u003e\n\u003cp\u003eOutside the Bombay Club she\u0027s there again, kissing him lightly on the cheek.\u003c/p\u003e\n\u003cp\u003eI recognize this woman.\u003c/p\u003e\n\u003cp\u003eThis woman is Lorrie Wallace.\u003c/p\u003e\n\u003cp\u003eThe Englishwoman who ran into me on the QE2.\u003c/p\u003e\n\u003cp\u003eThe woman married to Stephen Wallace.\u003c/p\u003e\n\u003cp\u003eThe woman who wanted me to go to England.\u003c/p\u003e\n\u003cp\u003eThe woman who recognized Marina.\u003c/p\u003e\n\u003cp\u003eI lunge for the TV, trying to turn up the volume while Lorrie Wallace is being interviewed. But there\u0027s no sound, just static.\u003c/p\u003e\n\u003cp\u003eFinally Dad and Lorrie Wallace at Carol Laxalt\u0027s annual Christmas party. Dad\u0027s standing by a poinsettia. He\u0027s shaking John Warner\u0027s hand.\u003c/p\u003e\n\u003cp\u003eAnd in the background, sipping punch from a tiny glass cup, is F. Fred Palakon, a giant Christmas tree twinkling behind him.\u003c/p\u003e\n\u003cp\u003eI hold a hand over my mouth to stop the screaming.\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eI\u0027m calling my sister again.\u003c/p\u003e\n\u003cp\u003eIt rings three, four, five times.\u003c/p\u003e\n\u003cp\u003eShe picks up. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-230.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
