{"id":69218,"no":31,"title":"Page 31","content":"\u003cp\u003e\"Wait a minute, wait a minute.\" I hold my hands up in front of me. \"If you think for one second I\u0027d share Chloe-Chloe Byrnes-with that pipsqueak... oh baby, spare me.\"\u003c/p\u003e\n\u003cp\u003e\"Who said you\u0027re sharing anybody, Victor?\" someone asks.\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"Who said it was your idea?\" David asks. \"Who said you were happy about it?\"\u003c/p\u003e\n\u003cp\u003e\"How can I not be happy about something that\u0027s not happening?\" I glare.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re just telling you what\u0027s out on the street.\"\u003c/p\u003e\n\u003cp\u003e\"What street? What street do you live on, David?\"\u003c/p\u003e\n\u003cp\u003e\"Uh... Ludlow.\"\u003c/p\u003e\n\u003cp\u003e\"Uh... Ludlow,\" I mimic without trying.\u003c/p\u003e\n\u003cp\u003e\"Victor, how can we believe you about anything?\" Rick asks. \"You say you weren\u0027t at the CK show, but there you were. Now you say you\u0027re not involved in a heavy menage with Baxter and Chloe, yet word around town-\"\u003c/p\u003e\n\u003cp\u003e\"What else have you f**king heard?\" I snap, waving a light meter out of my face. \"I dare you, come on, I dare you.\"\u003c/p\u003e\n\u003cp\u003e\"That you\u0027re f**king Alison Poole?\" David shrugs.\u003c/p\u003e\n\u003cp\u003eI just stare for a couple seconds. \"Enough, enough. I\u0027m not seeing Alison Poole.\"\u003c/p\u003e\n\u003cp\u003e\"The straight face is impressive, dude.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m gonna ignore that because I don\u0027t fight with girls,\" I tell David. \"Besides, that\u0027s a dangerous rumor for you to spread. Dangerous for her. Dangerous for me. Dangerous for-\"\u003c/p\u003e\n\u003cp\u003e\"Just go with it, Victor,\" David sighs. \"Like I really even care.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be folding twenty-dollar sweaters at the Gap soon enough anyway,\" I mutter.\u003c/p\u003e\n\u003cp\u003e\"My little minnows,\" Didier calls out. \"It\u0027s time.\"\u003c/p\u003e\n\u003cp\u003e\"Say, shouldn\u0027t David have like some beach moss or some kind of sand covering his face?\"\u003c/p\u003e\n\u003cp\u003e\"Okay, Victor,\" Didier calls out from behind the camera. \"I\u0027m looking at you like you\u0027re naked, baby.\"\u003c/p\u003e\n\u003cp\u003e\"Didier?\" one of the twins says. \"I am naked.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m looking at you like you\u0027re naked, Victor, and you love it.\" A longish pause while Didier studies the twin, then he decides something. \"Make me chase you.\"\u003c/p\u003e\n\u003cp\u003e\"Uh, Didier?\" I call out. \"I\u0027m Victor.\"\u003c/p\u003e\n\u003cp\u003e\"Dance around and yell `pussy.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Pussy,\" we all mumble.\u003c/p\u003e\n\u003cp\u003e\"Louder!\" Didier shouts.\u003c/p\u003e\n\u003cp\u003e\"Pussy!\"\u003c/p\u003e\n\u003cp\u003e\"Louder!\"\u003c/p\u003e\n\u003cp\u003e\"Pussy!\"\u003c/p\u003e\n\u003cp\u003e\"Fantastic yet not so good.\"\u003c/p\u003e\n\u003cp\u003eSpeedos after Bermudas, baseball caps are positioned backward, lollipops are handed out, Urge Overkill is played, Didier hides the Polaroid, then sells it to the highest bidder lurking in the shadows, who writes a check for it with a quill pen. One of the boys has an anxiety attack and another drinks too much Taittinger and admits he\u0027s from Appalachia, which causes someone to call out for a Klonopin. Didier insist we cup our balls and finally incorporates the camera crew from \"Fashion File\" into the photo shoot and then everyone except me and the guy who fainted go off for an early lunch at a new spot in SoHo called Regulation.\u003c/p\u003e\n\u003cp\u003e23\u003c/p\u003e\n\u003cp\u003eMoving fast through autumn light up the stairs toward the offices at the top of the club, Rollerblades slung over my shoulder, a camera crew on the third floor from (unfortunately) VH 1 interviewing power-florist Robert Isabell and the way everyone dresses makes you realize that lime and Campbell\u0027s-soup orange are the most conspicuous new colors of the season and ultra-lounge music from the band I, Swinger floats around through the air like confetti saying \"it\u0027s spring\" and \"time to come dancing\" and violets and tulips and dandelions are everywhere and the whole enterprise is shaping up into everything one wants: cool without trying. In the office photos of pecs and tanned abs and thighs and bone-white butts are plastered over an entire wall along with an occasional face-everyone from Joel West to Hurley Thompson to Marky Mark to Justin Lazard to Kirk Cameron (for god\u0027s sake) to Freedom Williams to body parts that could or could not be mine-here in JD and Beau\u0027s inner sanctum, and though it seems like I\u0027m tearing down Joey Lawrence 8 x 10s on a daily basis, they\u0027re always replaced, all the guys so similar-looking it\u0027s getting tougher and tougher to tell them apart. Eleven publicists will work this party tonight. I bitch to Beau about croutons for seven minutes. Finally JD walks in with E-mail printouts, hundreds of faxes, nineteen requests for interviews.\u003c/p\u003e\n\u003cp\u003e\"Has my agent called?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"What do you think?\" JD snorts, and then, \"Agent for what?\"\u003c/p\u003e\n\u003cp\u003e\"Loved that piece you wrote for Young Homo, JD,\" I tell him, going over the newly revised 10:45 guest list. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-31.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
