{"id":69219,"no":32,"title":"Page 32","content":"\u003cp\u003e\"Which one was that, Victor?\" JD sighs, flipping through faxes.\u003c/p\u003e\n\u003cp\u003e\"The one called `Help! I\u0027m Addicted to Guys!\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Point being?\" Beau asks.\u003c/p\u003e\n\u003cp\u003e\"Just that you are both very unheterosexual,\" I say, stretching.\u003c/p\u003e\n\u003cp\u003e\"I might be a homo, Victor.\" JD yawns. \"But I\u0027m still a man-a man with feelings.\"\u003c/p\u003e\n\u003cp\u003e\"You are a homo, JD, and I don\u0027t want to hear another word about it.\" I\u0027m shaking my head at the new pinups-of Keanu, Tom Cruise, various Bruce Weber shots, Andrea Boccaletti, Emery Roberts, Jason Priestley, Johnny Depp, my nemesis Chris O\u0027Donnell-covering the wall above their desk. \"Jesus, it takes nothing to get you little mos turned on. A good bod, a nice face-Christ.\"\u003c/p\u003e\n\u003cp\u003e\"Victor,\" Beau says, handing me a fax. \"I know for a fact that you\u0027ve slept with guys in the past.\"\u003c/p\u003e\n\u003cp\u003eI move into my office, looking for some Snapple or a joint. \"I dealt with that whole hip bi thing for about three hours back in college.\" I shrug. \"Big deal. But now it\u0027s strictly the furburger era for me.\"\u003c/p\u003e\n\u003cp\u003e\"Like that plastic vagina Alison Poole\u0027s a big improvement over-who?-Keanu Reeves?\" JD says, following me.\u003c/p\u003e\n\u003cp\u003e\"Dude, Keanu and I have never gotten it on,\" I say, moving over to the stereo. \"We\u0027re just `good friends.\u0027\" I\u0027m scanning my CD rack: Elastica, Garbage, Filter, Coolio, Pulp. I slip Blur in. \"Did you know that Keanu in Hawaiian means `cool ocean breeze\u0027 and he won the Japanese Oscar for his role as the FBI agent turned surfer in Point Break?\" I preprogram tracks 2, 3 and 10. \"Jesus-and we\u0027re afraid of the Japanese?\"\u003c/p\u003e\n\u003cp\u003e\"You have got to stop having sex with Damien\u0027s girlfriend, Victor,\" Beau blurts out, whimpering. \"It makes us new-\"\u003c/p\u003e\n\u003cp\u003e\"Oh shit,\" I groan, throwing a CD case at him.\u003c/p\u003e\n\u003cp\u003e\"If Damien finds out he will kill us, Victor.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll kill you if he finds out I\u0027m really opening up my own club,\" I say carefully. \"You will be implicated no matter what. Just, um, slide into it.\"\u003c/p\u003e\n\u003cp\u003e\"Oh Victor, your nonchalance is so cool.\"\u003c/p\u003e\n\u003cp\u003e\"First of all I don\u0027t understand why you little mos think I\u0027d be f**king Damien\u0027s girlfriend in the first-\"\u003c/p\u003e\n\u003cp\u003e\"And you lie so well too.\"\u003c/p\u003e\n\u003cp\u003e\"Hey-who the hell\u0027s been listening to ABBA Gold? Oh wait-let me guess.\"\u003c/p\u003e\n\u003cp\u003e\"Victor, we don\u0027t trust Damien,\" Beau says. \"Or Digby or Duke.\"\u003c/p\u003e\n\u003cp\u003e\"Shhh,\" I say, holding a finger up to my lips. \"This place could be bugged.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not funny, Victor,\" JD says grimly. \"It could be.\"\u003c/p\u003e\n\u003cp\u003e\"How many times do I have to tell you guys that this town is filled with horrible human beings?\" I groan. \"Get-used-to-it\"\u003c/p\u003e\n\u003cp\u003e\"Digby and Duke are cute, Victor, but so wasted on steroids that it would make them quite happy to beat the living shit out of you,\" Beau says, then adds, \"As if you didn\u0027t need it.\"\u003c/p\u003e\n\u003cp\u003eI check my watch. \"My father\u0027s gonna do that to me in about fifteen minutes, so spare me,\" I sigh, flopping onto the couch. \"Listen, Digby and Duke are just Damien\u0027s, er, friends. They\u0027re like bouncers-What?\"\u003c/p\u003e\n\u003cp\u003e\"Mob, baby,\" JD says.\u003c/p\u003e\n\u003cp\u003e\"Oh Jesus,\" I moan. \"The mob? For who? Banana Republic?\"\u003c/p\u003e\n\u003cp\u003e\"Mob, Victor.\" Beau nods in agreement.\u003c/p\u003e\n\u003cp\u003e\"Oh hell, they\u0027re bouncers, guys.\" I sit up. \"Feel sorry for them. Imagine dealing with cokeheads and tourists for a living. Pity them.\"\u003c/p\u003e\n\u003cp\u003eBeau loses it. \"Pity you, Victor, once Damien sees that goddamn photo of you-ouch!\"\u003c/p\u003e\n\u003cp\u003e\"I saw you step on Beau\u0027s foot,\" I say to JD very carefully, staring over at them.\u003c/p\u003e\n\u003cp\u003e\"Who are you protecting, JD?\" Beau gasps. \"He should know. It\u0027s true. It\u0027s gonna happen.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m up off the couch. \"I thought this was all taken care of, JD.\"\u003c/p\u003e\n\u003cp\u003e\"Victor, Victor-\" JD holds his hands up.\u003c/p\u003e\n\u003cp\u003e\"Tell me now. What, where, when, who?\"\u003c/p\u003e\n\u003cp\u003e\"Did anyone catch that he didn\u0027t ask the most important question: why?\"\u003c/p\u003e\n\u003cp\u003e\"Who told you there\u0027s a photo? Richard? Khoi? Reba?\"\u003c/p\u003e\n\u003cp\u003e\"Reba?\" JD asks. \"Who in the f**k is Reba?\"\u003c/p\u003e\n\u003cp\u003e\"Who was it, JD?\" I slap at one of his hands.\u003c/p\u003e\n\u003cp\u003e\"It was Buddy. Get away from me.\"\u003c/p\u003e\n\u003cp\u003e\"At the News?\"\u003c/p\u003e\n\u003cp\u003eBeau nods solemnly. \"Buddy at the News.\"\u003c/p\u003e\n\u003cp\u003e\"And Buddy says...\"\u003c/p\u003e\n\u003cp\u003eI motion for him to go on.\u003c/p\u003e\n\u003cp\u003e\"Um, your fears about a certain photo are, um, `intact\u0027 and the, um...\" JD squints at Beau. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-32.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
