{"id":69223,"no":36,"title":"Page 36","content":"\u003cp\u003e\"Shannen Doherty is coming with Rob Weiss.\"\u003c/p\u003e\n\u003cp\u003e\"A special couple.\" I\u0027m nodding like a baby.\u003c/p\u003e\n\u003cp\u003e\"Cameron Diaz.\"\u003c/p\u003e\n\u003cp\u003e\"What about Michael DeLuca?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Great. Let\u0027s move on to the Ss.\"\u003c/p\u003e\n\u003cp\u003e\"Alicia Silverstone is a yes.\"\u003c/p\u003e\n\u003cp\u003e\"Fan-fucking-tastic.\"\u003c/p\u003e\n\u003cp\u003e\"Sharon Stone is a maybe, though it `looks likely.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"On and on and on-\"\u003c/p\u003e\n\u003cp\u003e\"Greta Scacchi, Elizabeth Saltzman, Susan Sarandon-\"\u003c/p\u003e\n\u003cp\u003e\"Tim Robbins too?\"\u003c/p\u003e\n\u003cp\u003e\"Let me cross-reference-um, wait, wait-yes.\"\u003c/p\u003e\n\u003cp\u003e\"Faster.\"\u003c/p\u003e\n\u003cp\u003e\"Ethan Steifel, Brooke Shields, John Stamos, Stephanie Seymour, Jenny Shimuzu-\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay-\"\u003c/p\u003e\n\u003cp\u003e\"David Salle, Nick Scotti-\"\u003c/p\u003e\n\u003cp\u003e\"More, more, more-\"\u003c/p\u003e\n\u003cp\u003e\"Sage Stallone.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t we just invite the f**king Energizer bunny? Go on.\"\u003c/p\u003e\n\u003cp\u003e\"Markus Schenkenberg, Jon Stuart, Adam Sandler-\"\u003c/p\u003e\n\u003cp\u003e\"But not David Spade.\"\u003c/p\u003e\n\u003cp\u003e\"Wesley Snipes and Lisa Stansfield.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, my man.\"\u003c/p\u003e\n\u003cp\u003e\"Antonio Sabato, Jr., Ione Skye-\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s bringing the ghost of River Phoenix with her,\" Beau adds. \"I\u0027m serious. She demanded that it be put on the list.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s so f**king hip I want it faxed to the News immediately.\"\u003c/p\u003e\n\u003cp\u003e\"Michael Stipe-\"\u003c/p\u003e\n\u003cp\u003e\"Only if he doesn\u0027t keep flashing that damn hernia scar.\"\u003c/p\u003e\n\u003cp\u003e\"Oliver Stone, Don Simpson, Tabitha Soren-\"\u003c/p\u003e\n\u003cp\u003e\"Oh boy, we\u0027re in the hot zone now.\"\u003c/p\u003e\n\u003cp\u003e\"G. E. Smith, Anna Sui, Tanya Sama, Andrew Shue-\"\u003c/p\u003e\n\u003cp\u003e\"And Elisabeth Shue?\"\u003c/p\u003e\n\u003cp\u003e\"And Elisabeth Shue.\"\u003c/p\u003e\n\u003cp\u003e\"Great. Okay, what are we playing during cocktails?\" Beau asks as I start walking out the door.\u003c/p\u003e\n\u003cp\u003e\"Start with something mellow. An Ennio Morricone soundtrack or Stereolab or even something ambient. Get the idea? Burt Bacharach. Then let\u0027s move on to something more aggressive but unobtrusive, though not elevator music.\"\u003c/p\u003e\n\u003cp\u003e\"Space-age bachelor-pad Muzak?\"\u003c/p\u003e\n\u003cp\u003e\"Mood sounds?\" I\u0027m flying down to the fourth floor.\u003c/p\u003e\n\u003cp\u003e\"Some Polynesia tiki-tiki or crime jazz.\" JD flies after me.\u003c/p\u003e\n\u003cp\u003e\"Basically an ultralounge cocktail mix.\"\u003c/p\u003e\n\u003cp\u003e\"Remember, you have a meeting with DJ X at Fashion Cafe,\" Beau calls down. \"At five!\"\u003c/p\u003e\n\u003cp\u003e\"Any news from Mica?\" I call up from the third floor, where it\u0027s freezing and a couple of flies merrily buzz past.\u003c/p\u003e\n\u003cp\u003e\"No. But Fashion Cafe at five o\u0027clock, Victor!\" Beau shouts out.\u003c/p\u003e\n\u003cp\u003e\"Why hasn\u0027t anyone found Mica yet?\" I shout, moving farther down into the club.\u003c/p\u003e\n\u003cp\u003e\"Victor,\" JD shouts from behind me. \"Can you tell the difference between a platitude and a platypus?\"\u003c/p\u003e\n\u003cp\u003e\"One\u0027s a... beaver?\"\u003c/p\u003e\n\u003cp\u003e\"Which one?\"\u003c/p\u003e\n\u003cp\u003e\"Oh god, this is hard,\" I moan. \"Where\u0027s my publicist?\"\u003c/p\u003e\n\u003cp\u003e22\u003c/p\u003e\n\u003cp\u003eMy father sent a car to \"insure my presence\" at lunch, so I\u0027m now in the backseat of a Lincoln Town Car trying to get Buddy at the News on my cell phone, the driver traversing noontime traffic on Broadway, sometimes stuck in place, heading down to Nobu, passing another poster of Chloe in a bus shelter, an ad for some kind of Estee Lauder light-diffusing makeup, and the sun glints so hard off the trunk of a limousine in front of us that it traumatizes my eyes with a hollow pink burn and even through the tinted windows I have to slip on a pair of Matsuda sunglasses, passing the new Gap on Houston, adults playing hopscotch, somewhere Alanis Morissette sings sweetly, two girls drifting along the sidewalk wave at the Town Car in slow motion and I\u0027m offering the peace sign, too afraid to turn around to see if Duke and Digby are following. I light a cigarette, then adjust a microphone that\u0027s hidden beneath the collar of my shirt.\u003c/p\u003e\n\u003cp\u003e\"Hey, no smoking,\" the driver says.\u003c/p\u003e\n\u003cp\u003e\"What are you gonna do? Just keep driving. Jesus.\"\u003c/p\u003e\n\u003cp\u003eHe sighs, keeps driving.\u003c/p\u003e\n\u003cp\u003eFinally Buddy clicks on, sounds like accidentally.\u003c/p\u003e\n\u003cp\u003e\"Buddy-Victor. What\u0027s the story?\"\u003c/p\u003e\n\u003cp\u003e\"Confirm this rumor for me: Are you dating Stephen Dorff?\"\u003c/p\u003e\n\u003cp\u003e\"Spare me, Buddy,\" I groan. \"Let\u0027s make a deal.\"\u003c/p\u003e\n\u003cp\u003e\"Shoot,\" he sighs.\u003c/p\u003e\n\u003cp\u003eI pause. \"Wait. I just, um, hope I\u0027m still not on your guys-I-wanna- f**k list.\"\u003c/p\u003e\n\u003cp\u003e\"No, you already have a boyfriend.\"\u003c/p\u003e\n\u003cp\u003e\"Stephen Dorff is not my goddamn boyfriend,\" I shout.\u003c/p\u003e\n\u003cp\u003eThe driver eyes me in the rearview mirror. I lean forward and bang on the back of his seat. \"Is there like a divider or partition or something that separates me from you?\" The driver shakes his head. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-36.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
