{"id":69253,"no":66,"title":"Page 66","content":"\u003cp\u003e\"It\u0027s cool,\" I say.\u003c/p\u003e\n\u003cp\u003e\"Victor, what are you doing here?\"\u003c/p\u003e\n\u003cp\u003eI hold up the hat.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" he asks. \"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Hey, I heard about Junior Vasquez DJ\u0027ing tonight,\" I say, elegantly changing the subject.\u003c/p\u003e\n\u003cp\u003eDamien sighs tiredly. \"Great. Isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"How did that happen?\"\u003c/p\u003e\n\u003cp\u003e\"On the record?\"\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e\"Some special-events impresario called,\" Damien says. \"And-voila.\"\u003c/p\u003e\n\u003cp\u003e\"Can I ask you a question?\" I start, feeling daring.\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Where did you guys meet? I mean, you and Lauren.\"\u003c/p\u003e\n\u003cp\u003eHe downs the tequila, gently places the glass back on the bar and frowns.\u003c/p\u003e\n\u003cp\u003e\"I met her while we were both having dinner with the world\u0027s richest people.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not allowed to give out these names.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027d know them\", Damien says. \"You wouldn\u0027t be surprised.\"\u003c/p\u003e\n\u003cp\u003e\"Cool.\"\u003c/p\u003e\n\u003cp\u003e\"Hint: they just spent the weekend at Neverland Ranch.\"\u003c/p\u003e\n\u003cp\u003e\"Would you like a Mentos?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"I need a favor, Victor.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d do anything for you, man.\"\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t grovel.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Will you take Lauren with you to the opening tonight?\" Damien asks. \"She won\u0027t come otherwise. Or if she does she\u0027s threatening to come with f**king Skeet Ulrich or Olivier Martinez or Mickey Hardt or Daniel Day-fucking-Lewis.\"\u003c/p\u003e\n\u003cp\u003e\"That would be cool\", I consider. \"I mean if we could get Daniel Day-Lewis-\"\u003c/p\u003e\n\u003cp\u003e\"Hey\", he snaps. \"Watch it.\"\u003c/p\u003e\n\u003cp\u003e\"Oh yeah. My apologies.\"\u003c/p\u003e\n\u003cp\u003eDamien still has traces of this morning\u0027s mud mask next to his right ear. I reach out and flick a speck gently away.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" he asks, flinching.\u003c/p\u003e\n\u003cp\u003e\"Mud?\" I guess.\u003c/p\u003e\n\u003cp\u003eHe sighs. \"It\u0027s shit, Victor. It\u0027s all shit.\"\u003c/p\u003e\n\u003cp\u003eI pause. \"You had... shit on your face?\" I ask. \"Whoa, dude. Don\u0027t go there.\"\u003c/p\u003e\n\u003cp\u003e\"No. My life, Victor. My whole f**king life. It\u0027s all shit.\"\u003c/p\u003e\n\u003cp\u003e\"Why, guy?\" I ask. \"When did this massive dumping occur?\"\u003c/p\u003e\n\u003cp\u003e\"I have a girlfriend, Victor,\" Damien says, staring straight at me.\u003c/p\u003e\n\u003cp\u003e\"Yeah-\" I stop, confused. \"Alison?\"\u003c/p\u003e\n\u003cp\u003e\"No. Alison\u0027s my fiancee. Lauren\u0027s the girlfriend.\"\u003c/p\u003e\n\u003cp\u003e\"You guys are engaged?\" I gasp involuntarily and when I try to hide the gasp, I gasp again. \"Oh, I knew that, dude. Um, I knew that.\"\u003c/p\u003e\n\u003cp\u003eDamien\u0027s face hardens. \"How did you know that?\" he asks. \"Nobody knows that.\"\u003c/p\u003e\n\u003cp\u003ePause, then semi-effortlessly, in a tight voice while holding my breath, out comes: \"Man oh man this town, guy.\"\u003c/p\u003e\n\u003cp\u003eDamien seems too depressed to not accept this. A long pause.\u003c/p\u003e\n\u003cp\u003e\"You mean,\" I start, \"like getting-married engaged?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s usually what it means.\"\u003c/p\u003e\n\u003cp\u003e\"So I\u0027ve heard,\" I murmur.\u003c/p\u003e\n\u003cp\u003e\"When did you and Lauren get so close?\" he asks suddenly.\u003c/p\u003e\n\u003cp\u003e\"I really don\u0027t know her at all, Damien,\" I say, squeezing the hat. \"She\u0027s a friend of Chloe\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"She said she went to school with you,\" he mutters. \"She said you were-and don\u0027t take this the wrong way-a total ass**le.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t take that the wrong way.\"\u003c/p\u003e\n\u003cp\u003e\"I can see that your self-esteem is pretty high today, huh?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s funny-I thought she went to school with you, man.\" I chuckle lamely to myself, bowing a little, eyes half-closed. \"Didn\u0027t you guys go to school together, m-man?\"\u003c/p\u003e\n\u003cp\u003e\"Victor, I\u0027ve got a f**king migraine. Just, y\u0027know, don\u0027t.\" He closes his eyes, reaches for the Patron, stops himself. \"So-will you do it? Will you take her?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m... taking Chloe.\"\u003c/p\u003e\n\u003cp\u003e\"Just take Lauren with you guys.\" His beeper goes off. He checks it. \"Shit. It\u0027s Alison. I\u0027ve gotta go. Tell Lauren goodbye. And I\u0027ll see you at the club.\"\u003c/p\u003e\n\u003cp\u003e\"Tonight\u0027s the night,\" I say.\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027ll work,\" he says. \"I think it won\u0027t be a disaster.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see, man.\" Damien reaches out his hand. Instinctively I shake it. Then he\u0027s gone.\u003c/p\u003e\n\u003cp\u003eI\u0027m standing in the living room, taking a long time to notice Lauren leaning in the doorway.\u003c/p\u003e\n\u003cp\u003e\"I heard everything,\" she murmurs.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s probably more than I heard,\" I murmur back. \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-66.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
