{"id":69257,"no":70,"title":"Page 70","content":"\u003cp\u003eMutt just kind of smiles at me and it\u0027s freezing in the apartment and I\u0027m slouching in a big pile of white satin pillows that the crew brought and some Japanese guy is filming the interview that MTV will be filming and another Japanese guy is taking photographs of the video crew and I start throwing out names of bands they should play over the segment when it airs: Supergrass, Menswear, Offspring, Phish, Liz Phair (\"Supernova\"), maybe Pearl Jam or Rage Against the Machine or even Imperial Teen. I\u0027m so lost that I don\u0027t even notice Mutt standing over me until he snaps his fingers twice right under my nose and I purse my lips and wink at him and wonder how cool I look in other people\u0027s eyes.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to smoke a big Cohiba during the interview,\" I tell Mutt.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to look like a big ass**le during the interview.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, don\u0027t forget who you\u0027re talking to.\"\u003c/p\u003e\n\u003cp\u003e\"MTV policy. No smoking. Advertisers don\u0027t like it.\"\u003c/p\u003e\n\u003cp\u003e\"Yet you sell Trent Reznor\u0027s hate to millions of unsuspecting youth. Tch-tch-tch.\"\u003c/p\u003e\n\u003cp\u003e\"I want to get out of here, so let\u0027s start this thing.\"\u003c/p\u003e\n\u003cp\u003e\"I was chased through SoHo earlier tonight.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not that popular, Victor.\"\u003c/p\u003e\n\u003cp\u003eI buzz JD on my cell phone. \"JD-find out who just chased me through SoHo.\" I click off and since I\u0027m in my element I\u0027m all smiles so I call out to the really muscular girl with the clip-on nose ring, \"Hey pu**ycat, you could hail a cab with that ass.\"\u003c/p\u003e\n\u003cp\u003e\"My name\u0027s David,\" he says. \"Not Pussycat.\"\u003c/p\u003e\n\u003cp\u003e\"Whoa-you got that whole boy/girl thing going down,\" I say, shivering.\u003c/p\u003e\n\u003cp\u003e\"Who is this clown?\" David asks the room.\u003c/p\u003e\n\u003cp\u003e\"The same old story,\" Mutt sighs. \"Nobody, up-and-comer, star, has-been. Not necessarily in that order.\"\u003c/p\u003e\n\u003cp\u003eHey, keep the vibe alive,\" I say halfheartedly to nobody and then the makeup girl brushes my sideburns teasingly and I snarl \"Don\u0027t touch those\" and then, in a more vacant mode, \"Can somebody get me a Snapple?\" It\u0027s at this precise moment I finally notice the thing that\u0027s totally lacking in my apartment: Cindy. \"Wait, wait a minute-where\u0027s Cindy?\"\u003c/p\u003e\n\u003cp\u003e\"Cindy\u0027s not conducting the interview,\" Mutt says. \"She\u0027s just introducing it, in her own faux-inimitable style.\"\u003c/p\u003e\n\u003cp\u003e\"That sucks pretty majorly if you ask me,\" I say, stunned.\u003c/p\u003e\n\u003cp\u003e\"Does it?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t be sitting here now if I knew this earlier.\"\u003c/p\u003e\n\u003cp\u003e\"I doubt that.\"\u003c/p\u003e\n\u003cp\u003e\"Where the f**k is she?\"\u003c/p\u003e\n\u003cp\u003e\"In Beirut, at the opening of a new Planet Hollywood.\"\u003c/p\u003e\n\u003cp\u003e\"This is seriously demeaning.\"\u003c/p\u003e\n\u003cp\u003e\"Tough shit, you big baby.\"\u003c/p\u003e\n\u003cp\u003e\"That-gosh, Mutt-that really shocks me,\" I say, tears welling up. \"That really shocks me that you would talk that way to me.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh.\" Mutt closes his eyes, holds a viewfinder up to his ear. \"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a minute, so wait...\" I look over at the VJ on his cell phone underneath a giant Nan Goldin that Chloe gave me for a Christmas present. \"That pederast over there\u0027s going to do it?\" I\u0027m asking, appalled. \"That fag pederast?\"\u003c/p\u003e\n\u003cp\u003e\"Hey, what\u0027s your life? A G-rated movie?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to be interviewed by someone who is known in this business as a big fag pederast.\"\u003c/p\u003e\n\u003cp\u003e\"You ever sleep with a guy, Victor?\"\u003c/p\u003e\n\u003cp\u003eRemembering MTV\u0027s new all-consuming the-entire-world-is-full-of-homos mentality, I smirk and semi-nod and choke out \"Maybe\" and then compose myself to add, \"But now I am a strict heterosexual.\" Long pause. \"Devout, in fact.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll alert the media.\"\u003c/p\u003e\n\u003cp\u003e\"You are the media, Mutt,\" I exclaim. \"You and the fag pederast VJ are the media.\"\u003c/p\u003e\n\u003cp\u003e\"Ever sleep with a fifteen-year-old?\" Mutt asks tiredly.\u003c/p\u003e\n\u003cp\u003e\"Girl?\" Pause. \"Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003eTrying to decipher what Mutt\u0027s getting at, I pause, squinting, then yelp out, \"What the f**k does that mean, bozo? Are you trying to make a point? Because it\u0027s like, um, eluding me.\"\u003c/p\u003e\n\u003cp\u003eThe VJ comes over, all boyish smiles and Versace.\u003c/p\u003e\n\u003cp\u003e\"He dates Chloe Byrnes,\" Mutt says. \"That\u0027s all you really need to know.\"\u003c/p\u003e\n\u003cp\u003e\"Super,\" the VJ says. \"Can we work it in?\"\u003c/p\u003e\n\u003cp\u003e\"You will work it in,\" I answer for Mutt. \"And no questions about my father.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re shooting from the hip,\" the VJ says. \"And I like it.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027m camera ready.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-70.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
