{"id":69281,"no":94,"title":"Page 94","content":"\u003cp\u003e\"Do you have any cash?\" I asked her.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t overdo it, baby,\" she warned, lowering her sunglasses, scanning the room.\u003c/p\u003e\n\u003cp\u003eI took my sunglasses off and checked my reflection in the lenses.\u003c/p\u003e\n\u003cp\u003eShe snapped her fingers at me. \"Hey, why don\u0027t you just start chewing with your mouth open. Why don\u0027t you just start licking your fingers after meals.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t intend to take you anywhere nice,\" I told her.\u003c/p\u003e\n\u003cp\u003e\"Nice butt,\" she murmured, ogling a Brazilian guy she hadn\u0027t f**ked yet but would a week later as he passed by, bouncing a soccer ball on his knee as he crossed the length of the room while eating a bagel, his jeans perfectly ripped, wearing a tank top with a gym logo on it.\u003c/p\u003e\n\u003cp\u003eI agreed, teasingly.\u003c/p\u003e\n\u003cp\u003e\"You fag,\" she yawned, taking the last swallow of Molson.\u003c/p\u003e\n\u003cp\u003e\"He wears socks with sandals,\" I pointed out. \"He still wears his high-school graduation ring.\"\u003c/p\u003e\n\u003cp\u003e\"You, too, are in dire need of a maturity alert, my friend,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t wear Members Only jackets.\"\u003c/p\u003e\n\u003cp\u003e\"Contrary to popular opinion this is not enough to not make you evil,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Evil?\" I faux-gasped. \"Black light posters are in. Bongos are in.\u003c/p\u003e\n\u003cp\u003e\"Pervert,\" she said gleefully. \"You have potential.\"\u003c/p\u003e\n\u003cp\u003eSean Bateman, whom she had f**ked, joined us, offered a distracted smile, nodding even though no one had said anything that required a nod. He wondered aloud if any of us had pot, mentioned something about Rupert getting arrested in Albany late last night or early this morning. Sean pulled a beer out of the \u0027acket he had just taken off and handed it to Jamie, who opened it with her teeth. I noticed how nice Bateman\u0027s forearms were and someone was sadly strumming Led Zeppelin-I think it was \"Thank You\"-on a guitar and any light that had been streaming through the window we were all sitting next to disappeared and Sean whispered in my ear, \"All the boys think she\u0027s a spy...\"\u003c/p\u003e\n\u003cp\u003eI nodded and managed to smile.\u003c/p\u003e\n\u003cp\u003eJamie was eyeing me carefully.\u003c/p\u003e\n\u003cp\u003e\"What?\" I asked, confused.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re easy to unfold,\" she said to me in front of Sean.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the story, baby?\" I was asking, worried, blank-faced.\u003c/p\u003e\n\u003cp\u003e\"You have potential,\" Jamie said, grinning. \"You definitely have potential.\"\u003c/p\u003e\n\u003cp\u003e0\u003c/p\u003e\n\u003cp\u003eThe camera slowly pans around my apartment, Smashing Pumpkins\u0027 \"Stumbleine\" pours out over the sound track: a vintage industrial fan, an empty fish tank, dried flowers, a candelabra, a bicycle, a kitchen custom-made from several kinds of stone, a glass-door refrigerator, a food processor unwashed and stained with the grain and pulp from a health shake, a set of martini glasses. In the bathroom there\u0027s a poster of Diana Rigg in \"The Avengers\" and candles from Agnes b. and in the bedroom there\u0027s a down comforter lying on a futon that was handcarved in a Japanese forest and the original poster for La Dolce Vita that Chloe gave me for a birthday hangs over it and in the closet in that bedroom is a black Paul Smith suit, a black turtleneck, jeans and white shirts, vests, an open-weave pullover sweater, a pair of brightly colored Hush Puppies, black desert boots. On my desk: free drink tickets, a Cohiba cigar still in its container, a Clash CD-Sandinista!-unopened, a check to Save the Rainforest returned because of insufficient funds, last year\u0027s Social Register, a Baggie of psilocybin mushrooms, a half-empty Snapple, a roll of Mentos, an ad ripped from a magazine of Tyson promoting a new lip balm and the dragon tattoo etched on his bicep has a Chinese inscription on it that translated means \"don\u0027t trust anyone\" and an old fax machine and falling out of the fax machine at this moment is a slip of fax paper that I pick up and read.\u003c/p\u003e\n\u003cp\u003eOn it:\u003c/p\u003e\n\u003cp\u003enie Marais, Christopher Lambert, Tommy Lee, Lauren Hutton, Claire\u003c/p\u003e\n\u003cp\u003eDanes, Patty Hearst, Richard Grieco, Pino Luongo, Steffi Graf\u003c/p\u003e\n\u003cp\u003eMichael J. Fox, Billy Crudup, Marc Jacobs, Marc Audibet, the\u003c/p\u003e\n\u003cp\u003eButthole Surfers, George Clinton, Henry Rollins, Nike, Kim Deal,\u003c/p\u003e\n\u003cp\u003eBeavis and Butt-head, Anita Hill, Jeff Koons, Nicole Kidman, Howard\u003c/p\u003e\n\u003cp\u003eStem, Jim Shaw, Mark Romanek, Stussy, Whit Stillman, Isabella\u003c/p\u003e\n\u003cp\u003eRossellini, Christian Francis Roth, Vanessa Williams, Larry Clark, Rob\u003c/p\u003e\n\u003cp\u003eMorrow, Robin Wright, Jennifer Connelly, RuPaul, Chelsea Clinton,\u003c/p\u003e\n\u003cp\u003ePenelope Spheeris, Glenn Close, Mandie Erickson, Mark Kostabi,\u003c/p\u003e\n\u003cp\u003eRend Russo, Yasmen, Robert Rodriguez, Dr. Dre, Craig Kallman,\u003c/p\u003e\n\u003cp\u003eRosie Perez, Campion Platt, lane Pratt, Natasha Richardson, Scott\u003c/p\u003e\n\u003cp\u003eWolf, Yohji Yamamoto, L7, Donna Tartt, Spike Jonze, Sara Gilbert,\u003c/p\u003e\n\u003cp\u003eSam Bayer, Margaret Cho, Steve Albini, Kevin Smith, Jim Rome, Rick \u003c/p\u003e","sourceLink":"https://allnovel.net/glamorama/page-94.html","bookId":2683,"creation":"Oct 5, 2019 10:13:02 AM","modification":"Oct 5, 2019 10:13:02 AM"}
