{"id":12103,"no":131,"title":"CHAPTER CXXVIII. TODD\u0027S TRIAL CONTINUES, AND GOES ALL AGAINST HIM.","content":"\u0026nbsp;The Attorney-General sat down. \n\u003cdiv\u003e\n It was quite clear now to the most superficial observer, that the case against Todd had been just picked out for convenience sake, and was one among many. From the moment that the Attorney-General had mentioned what facts he could prove, the fate of the murderer was certain to the minds of all. They looked upon him in every respect as a doomed man.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course the remarks of the Attorney-General occupied a much greater space than we have felt that, in justice to the other portion of our story, we could give to them; but what we have presented to the reader was the essential portion of what he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n All eyes were turned upon Todd, to note how he took the statement for the prosecution; but there was little to be gleaned from his face. His eyes seemed to be wandering over the sea of faces in the court, as if he were in search of some one whom he was disappointed in not seeing. There was a pause of some few moments duration, and then the Attorney-General called his first witness, who was examined by the Junior Counsel for the prosecution.\n\u003c/div\u003e \n\u003cdiv\u003e\n This witness\u0027s deposition was very simple and concise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was master of the ship, Star,\" he said, \"and arrived in the Port of London on the day named in the indictment against the prisoner at the bar. Mr. Francis Thornhill had mentioned to me and to Colonel Jeffery that he had a valuable String of Pearls to take to a young lady, named Johanna Oakley, and he left the ship with his dog, Hector, to deliver them. I never saw him again from that hour to this. I was anxious about him, and called at the barber\u0027s shop in Fleet Street, kept by the prisoner at the bar. The prisoner readily admitted that such a person had been shaved at his shop, and then had left it, but why the dog remained he could not tell. The dog named Hector was at the door of the prisoner\u0027s house. He had a hat with him. My name is Arthur Rose Fletcher, and I am forty two years of age.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this the hat that you saw with the dog in Fleet Street?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The hat was produced.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, that is the hat. I will swear to it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whose hat is it, or was it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It belonged to Mr. Thornhill, who wore it on the day he left the ship to go into the city with the String of Pearls.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is all then, Mr. Fletcher, that we need trouble you with at present.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The judge now interposed; and in a mild voice addressing Todd, he said—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not too late for you to consent to the appointment of counsel to watch your case. I dare say some gentleman of the bar will volunteer to do so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With the prisoner\u0027s consent,\" said a counsel, who was sitting at the table below the judge, \"I will attend to the case.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Be it so,\" said Todd, gloomily.\n\u003c/div\u003e \n\u003cdiv\u003e\n Upon this the counsel rose, and addressing the captain of the ship, who had not yet left the witness-box, he said to him—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Fletcher, how is it that you can so positively identify this hat of the alleged murdered Mr. Thornhill, after such a space of time?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By a remarkable flaw in the rim of it, sir. An accident occurred on board the ship, by which Mr. Thornhill\u0027s hat was burnt, and this is the same hat. When he left the ship we joked him about it, and he said that perhaps he would buy a new one in the City.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed. Then he might have sold this one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He might, certainly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And so the dog seeing it left at some place where it was sold or given away, and not comprehending such transaction, might have taken possession of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of that I can say nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, Mr. Fletcher. I don\u0027t think I need trouble you any further. This affair of the hat seems to fall to the ground most completely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The Attorney-General did not say a word aloud, but he whispered something to the junior, who nodded in reply. The next witness called, was John Figgs, the groom at the coach office, who had rescued Hector from Todd\u0027s malevolence. His testimony was as follows:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I saw a crowd of people round the door of Todd\u0027s shop, and I went over to see what it was all about. The dog as I calls Pison, but as everybody else calls Hector, was trying to get into the shop. Some one opened the door, and then he came out with a hat in his mouth, after rummaging all over the shop and upsetting no end of things. I tried to coax him away, but he would not come by no means. At last, the next day I found him very bad, and that he had been pisoned, and so I calls him Pison, and took him to the stables and got him over it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it he says he calls the dog?\" asked the judge, with a very perplexed look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pison, my lord.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But what is Pison?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He means Poison.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, is that it; then why don\u0027t he say Poison? It\u0027s very absurd for anybody to say Pison, when they mean Poison all the while.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s all the same,\" said the groom. \"Pison is my way, and the t\u0027other is yourn, that\u0027s all!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What became of the hat?\" asked the junior counsel for the prosecution.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know. When I found the dog, in a wery bad state indeed, it was gone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, John Figgs,\" said Todd\u0027s counsel, \"could you identify that hat again among five hundred hats like it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five hundred?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, or a thousand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I should say not. It wouldn\u0027t be an easy matter to do that, I take it. I could tell you a particular horse among any lot, but I ain\u0027t so well known in the way of hats.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this the hat? Can you deliberately swear that this is the hat in question?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shouldn\u0027t like to swear it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, that will do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n John Figgs was permitted to go down upon this, and it was quite evident that some faint hope was beginning to quicken in the eye of Sweeney Todd, as he found that his self-appointed counsel began to make so light of the evidence of the hat. For the moment he quite forgot what proofs were still to come to fix the deed of murder upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Colonel Jeffery was now called. He deposed clearly and distinctly as follows:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I knew Mr. Thornhill, and much regretted his loss. In company with Mr. Fletcher I went to Todd\u0027s shop to make some inquiry about him, to the effect that he had been shaved there, and had then left. I did not feel satisfied, and when Mr. Fletcher was found to be in London, I got the assistance of a friend of mine, named Rathbone, and together we prosecuted what inquiries we could. I picked up a hat from Todd\u0027s passage, and after putting myself into communication with Sir Richard Blunt, I delivered the hat to him. I have been in constant communication with Sir Richard Blunt upon the subject of this inquiry for a long time. We found that the prisoner at the bar had a sort of apprentice or errand boy in his shop, named Tobias Ragg, and we endeavoured to get some disclosures from that boy, when he suddenly disappeared. I found him again on a doorstep in the City, and he has made certain disclosures which he will repeat in evidence to the court to-day. On the 4th of last month I accompanied Sir Richard Blunt to a cellar beneath Todd\u0027s shop, and he showed me a contrivance in the roof by which any one could be let down. We took workmen with us and made certain alterations. I afterwards accompanied Doctor Steers of the ship Star to the vaults of St. Dunstan\u0027s, and I saw Doctor Steers take a bone from there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pray look at that hat, Colonel Jeffery. Is it the same you found at Todd\u0027s door?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you mark the bone that Doctor Steers took from the vaults of St. Dunstan\u0027s?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did, and I may state to save trouble, that I placed upon the hat a private mark by which I am enabled to swear to it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd\u0027s counsel rose, and in a very respectful voice, he said—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you ever see this String of Pearls, about which so much fuss is made, colonel?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; Mr. Thornhill showed it to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh. Do you know a young lady named Johanna Oakley?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had that pleasure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had? Have you not now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have the honour of her acquaintance since her marriage; she is now Mrs. Ingestrie.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The counsel seemed to be a little staggered by this answer, but after a moment or two, he resumed saying—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know a young lady named Arabella Wilmot?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, colonel, did again? Is she married?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; that young lady is now Mrs. Jeffery, my wife.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The counsel had evidently intended to make some point against the colonel\u0027s evidence, which was completely destroyed by the fact of the two marriages. But he resumed the attack by changing his ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Colonel,\" he said, \"do you know a boy named Tobias Ragg?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do. He is a resident in my house.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you take upon your self to swear that that boy, or lad, or whatever he may be called, is in his right senses?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you swear that he was never confined in a lunatic asylum, from which he made his escape raving mad, and that since then you have not kept him to listen to his wild conjectures and dreamy charges against the prisoner at the bar?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will swear that he is not mad, and—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come, sir, I want an answer, yes or no.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you will not get one. Your question involves three or four propositions, some of which may be answered in the negative, and some in the affirmative; so how can you get a reply of yes or no?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come—come, sir. Remember where you are. We want no roundabout speeches here, but direct answers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is impossible to give a direct answer to such a speech as you made. Nothing but ignorance or trickery could induce you to ask such a thing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We cannot allow such language here, sir. I call upon the court for its protection against the insolence of this witness.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The court does not think proper to interfere,\" said the judge, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, very well. Then I am done.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I am not,\" said the colonel. \"I can inform you, and all whom it may concern, that the proprietor of the lunatic asylum, in which the boy, Ragg, was so unjustly confined, is now in Newgate, awaiting his trial for that and other offences, and that I have succeeded in completely breaking up the establishment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The counsel did not think proper to say anything more to the colonel, who was permitted, after firing this last shot at the enemy, to quit the witness-box.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir Richard Blunt was the next witness called, and as his evidence was expected to be very important indeed, all attention was paid to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was that buzz of expectation throughout the court, which is always to be heard upon such occasions, when anything very important is about to take place, and every one shifted his place, in order the more correctly to hear what was going on.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Attorney-General himself arose to pursue the examination of Sir Richard Blunt.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was evident that the appearance of this witness roused Sweeney Todd more than anything else had done since the commencement of the proceedings. His eye lighted up, and setting his teeth hard, he prepared himself, with his left hand up to his ear, to catch every word that should fall from the lips of the man who had been his great enemy, and who had wound around him the web in which he had been caught at last.\n\u003c/div\u003e \n\u003cdiv\u003e\n The appearance of Sir Richard Blunt was very attractive. There was always about him an air of great candour, and the expression of his features denoted generosity and boldness in a most astonishing degree.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3276/89688.html","bookId":510,"creation":"Aug 2, 2019 4:27:03 AM","modification":"Aug 2, 2019 4:27:03 AM"}
