{"id":12137,"no":165,"title":"CHAPTER CLXI. THE POLICE-GALLEY\u0027S FATE.","content":"\u0026nbsp;Todd, when he heard that voice, quite sank down into the bottom of the boat, and felt as though his last hour were come. \n\u003cdiv\u003e\n \"Don\u0027t answer,\" said the old man. \"Pull away for the pile-driving barge as hard as you can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, pull—pull!\" cried Todd. \"Save me!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you make that noise,\" added the old man, \"we may as well be off at once, for the river, when it is as smooth as it is now, carries voices well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Boat a-hoi!\" cried the voice again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We must answer them now,\" said the old waterman. \"Ay, ay! Is it here? Boat a-hoi!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ay, ay!\" came the voice from the police-galley.\n\u003c/div\u003e \n\u003cdiv\u003e\n At that moment the two watermen succeeded in reaching the broad stern of the barge, in which was centred the pile-driving machinery, and the young man said to Todd—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now clamber in, and good luck attend you. If we don\u0027t come to you in the course of an hour, don\u0027t expect us, that\u0027s all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd was not very young and supple in his joints, but the sense of present and serious danger has an effect upon every one, and in a moment he seized the side of the pile-driving barge, and drew himself in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right,\" said the old man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes—yes,\" said Todd, as he crouched down with his chin touching the side of the barge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-night, then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-night! You will come for me if you can?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but don\u0027t expect us. Pull, now, as hard as you can, and get out into the stream. Pull! pull!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n By the strenuous united exertions of the two men, the boat shot along at good speed, and soon got to a considerable distance from the barge in which Todd had taken refuge. It was then that the police-galley hoisted a strong light that shed a bright glare through the rain, and over the surface of the river.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Am I saved?\" said Todd. \"Am I saved, or am I not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He sank quite down into the body of the barge. There was a sort of platform over one-half of it, and upon that platform he felt the mass of iron, weighing about a couple of hundredweight, or more, which was used for driving piles into the bed of the river, and which, when liberated from a height, and allowed to fall upon the end of the pile, comes with a most tremendous force.\n\u003c/div\u003e \n\u003cdiv\u003e\n That piece of metal so used is called \"the monkey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They come—they come!\" said Todd. \"Oh, if they only chanced to see the boat place me here, I am lost. Quite lost! What will become of me, then, with nothing but the cold, cold river all round me? Death, indeed, now stares me in the face!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Truly, the situation of Todd now was rather a critical one. There was no saying how far the men on board the police-galley might not think themselves justified in boarding any craft that was moored upon the river; and, indeed, if they were searching for him, and had really any idea that he was trying an escape by the Thames, it was highly improbable that they would omit to have a good look in the barge where he was. There was another great danger, too, that suddenly flashed across his mind, and drove him nearly mad.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If the police, when they overtake the wherry,\" he thought, \"should mention who it is they are in pursuit of, may not the two watermen at once, upon finding that their sympathy has been excited for me, declare where I am, and even aid in my apprehension?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This idea, either because it was the last one that came into his head, or because it really was the one that seemed most full of real dangers, clung to him with desperation; and more than once the thought of ending all his miseries by a plunge into the river, crossed his mind. But it is not such men as Sweeney Todd who commit suicide.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They come—they come!\" was all he could now say.\n\u003c/div\u003e \n\u003cdiv\u003e\n The light from the police was, by the aid of a revolving reflector, capable of being cast pretty strongly in any direction that those who had the care and control of it chose; and for a moment it rested upon the barge where Todd was. He felt as if, at that moment, he could have crept right through the bottom of the barge, and taken refuge in the Thames.\n\u003c/div\u003e \n\u003cdiv\u003e\n The broad beam of light was then shifted off the barge on to the little wherry, which was at rest upon the water waiting for the approach of the police-galley.\n\u003c/div\u003e \n\u003cdiv\u003e\n And now, with vigorous sweeps of its six oars, that galley made its way right past the barge. Oh! what a relief it was that it went past! It did not follow that all danger was gone because the police-barge had gone past; but it was a sufficient proof that the glare of light they had sent in that direction, by the aid of the reflector, had not had the effect of discovering him to them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is something,\" muttered Todd.\n\u003c/div\u003e \n\u003cdiv\u003e\n He then slowly permitted his eyes to peer over the side of the barge in order, as far as he could, to watch the interview that was about to take place between the police and the two watermen in the wherry where he had been so lately a passenger. Upon that interview, now, he thought that his fate depended.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hilloa!\" cried one of the police. \"Why did you not wait for us when we first called to you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We did,\" said the old man, \"as soon as we saw your light, and knew what you were; but there are so many jokes played off upon the river, that if we were to rest-oars to everybody who call—\u0027Boat a-hoi,\u0027 we should have enough to do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who are you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A couple of regestered watermen. Here we are. You can overhaul us at once, if you like.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have no passenger?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. I only wish we had. Times are very bad.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, it\u0027s all right. But we are placed here by the orders of Sir Richard Blunt the magistrate, who suspects that the notorious murderer, Sweeney Todd, may try to escape by the Thames.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sweeney Todd!\" cried the young waterman in a tone of horror. \"What, the fellow that killed all the people in Fleet Street, and made them into pies?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The same.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s coming now,\" thought Todd. \"It\u0027s coming now. They will tell him where I am.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The next words that were spoken, were uttered in a tone of voice that did not reach his ears. It was the old man who had spoken, and he did not utter his words so clearly as his younger companion; and although he tried his utmost to hear what he said, he could not possibly make it out, and he remained in a perfect agony of apprehension.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well,\" said the officer in the police-barge, who had conducted the brief conversation. \"It is a miserable night. Give way, my men. Steady there. Put the light out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n In an instant the light was lowered and extinguished, and the darkness that reigned upon the surface of the Thames was like a darkness that could be felt. It was difficult to conceive that it was not really tangible.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are they coming back?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n That was the question that Todd asked of himself, as he grasped, to steady himself, the heavy piece of iron that belonged to the pile-driving machine. He listened most intently, until it was positively painful to do so, and he began to fancy all sorts of strange noises in the air and from the water. In a few moments, though, an actual splashing sound put to route all imaginary noises, and he felt convinced that the boat with the police was slowly returning towards the barge in which he was concealed.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was, to be sure, still a hope that they would pass it; but it was only a hope.\n\u003c/div\u003e \n\u003cdiv\u003e\n Oh, how awfully full of apprehension was each passing moment now. It might be that the police-galley was only going quietly back to its proper station, after overtaking the wherry; but then it might be quite otherwise, and the doubt was terrific. While that doubt lasted, it was worse than the reality of danger.\n\u003c/div\u003e \n\u003cdiv\u003e\n And now it was quite evident to the perception of Todd that the police-boat was close to the barge, and he heard a voice say—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that the pile-driving barge?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" replied some one.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And they leave it, I suppose, as usual?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, pull alongside, and a couple of you jump in and see if all is right. People leave their property exposed to all sorts of depredations, and then blame us for not looking after it. Mind how you go, my men. Don\u0027t run foul of the barge.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir. All\u0027s right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n From the moment that this conversation had begun, Todd had remained crouching down in the barge, like a man changed to stone. He heard every word—those words upon which hung, or seemed to hang, his life, and his grasp upon the massive piece of iron tightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n The police-boat gradually advanced, and finally just grated against the side of the barge.\n\u003c/div\u003e \n\u003cdiv\u003e\n A sudden thought took possession of Todd. With a yell, like that of a mad-man, he, with preternatural strength, moved the heavy mass of iron, and in one moment toppled it over the edge of the barge.\n\u003c/div\u003e \n\u003cdiv\u003e\n Crash it went into the police-galley. There was then a shriek, and the men were struggling in the water. The piece of iron had gone right through the boat, staving to pieces. It filled and sank.\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd And The Police Galley.\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd And The Police Galley.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Help—help!\" cried a voice, and then all was still as the grave for a few moments.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is done,\" said Todd.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Help! mercy!\" said a voice again, and a dark figure rose up by the side of the barge, clinging to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd drew one of his pistols. He levelled it at the head of the figure. He was upon the point of pulling the trigger, when it struck him that the flash and the report might be seen and heard from the shore. The pistol was heavily mounted with brass at the butt-end of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Down!\" said Todd. \"Down!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He struck the clambering, half-drowned man upon the head, and with a shriek he fell backwards into the water and disappeared. In another moment Todd felt a pair of arms twining round him, and a voice cried—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Murderer, I have you now! You cannot shake me off!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd made an effort, but, in truth, those wet and clinging arms held to him like fate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fool,\" he said. \"You will find drowning the easiest death for you to meet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The Murder On The Thames—Todd\u0027s Narrow Escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Murder On The Thames—Todd\u0027s Narrow Escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Help—help! murder!\" shouted his assailant.\n\u003c/div\u003e \n\u003cdiv\u003e\n The pistol was still in Todd\u0027s grasp. With a devilish ingenuity, he thrust the barrel of it under his arm and felt that it touched his assailant. He pulled the trigger, and then he and the man who held him fell to the bottom of the barge together.\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd kicked and plunged until he got uppermost, and then he felt for the throat of the other, and when he got a clutch of it he held it with a gripe of iron.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fool,\" he said. \"Did you think that one driven to such desperation as I am, would be conquered so easily?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no reply. Todd lifted up the head of the man, and it hung limply and flaccidly from the neck. He was quite dead. The pistol-bullet had gone through his heart, and death was instantaneous.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Another one,\" said Todd, as he sprang to his feet and stood upon the dead body. \"Another one sacrificed to my vengeance. Let those only interfere with me who are tired of life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He placed his hand to his ear now, to listen if there were any indications of others of the boat\u0027s crew stirring; but all was still. No sound, save the lazy ripple of the tide past the old barge on which he was, met his ears.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is over,\" he said. \"It is quite over now. That one great danger is past now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The rain began to fall quicker, and splashed upon the half deck of the barge. Todd felt that he was thoroughly wet through; but all minor ills he could now laugh at, that he had escaped the one great peril of capture. He felt that his life had hung upon a thread, and that only the recent accident had saved him; for to be captured, was to him equivalent to death.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All gone!\" he whispered. \"They are all gone! Well—well! They would have dragged me to a prison, and then to a scaffold! Self-defence is a sound principle, and for that I have fought!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n A sudden gust of wind got up at that moment, and came howling past Todd, and ruffling upon the surface of the river; but all was still around the barge. There was now no cry for mercy—no shout for help—no bubbling shriek of some swimmer, who was yet sinking to death, as the waters closed over him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Todd, as his long hair blew out like snakes in the wind, \"I am alone here now. They are all dead, and I could do it again if it had to be done.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3276/89722.html","bookId":510,"creation":"Aug 2, 2019 4:28:36 AM","modification":"Aug 2, 2019 4:28:36 AM"}
