{"id":12147,"no":175,"title":"CHAPTER CLXXI. A RATHER IMPORTANT DISCOVERY IS MADE.","content":"\u0026nbsp;The man, who appeared to be the only one at all—dead or alive—who was preserved from the wreck of the ship off the coast of Sussex, was carried to the house where all our friends were staying, and being taken into the kitchen, was there placed in the care of a couple of medical men, who were hastily sent for, and who quickly restored animation to the seemingly drowned person. It was reported to Ingestrie that the stranger was all right, and as he himself had by that time thoroughly recovered, and had changed his saturated apparel for a dry suit, the news gave him the liveliest satisfaction. \n\u003cdiv\u003e\n \"Well,\" he said, \"it is something that I have not gone through that tremendous surf in vain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Mark,\" said Johanna, with the tears starting to her eyes, \"but we must, indeed, get away from the sea-coast, and then you cannot be tempted to expose your life in such adventures. Only think of what might be the consequences!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said the colonel. \"It is hardly fair, although, at the moment, one cannot help admiring the heroism of the act.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know how it can be avoided,\" said Ingestrie. \"If you see a poor fellow struggling for his life, and you feel that you may save him at a little risk to yourself, it seems a strange thing not to do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It does,\" said old Mr. Oakley, \"and I should be the last to say no to the noble impulse; only if there are to be many storms off his coast, I shall second the resolution of Johanna that you ought to live somewhere else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And so shall I,\" said Arabella.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I,\" said Tobias.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s better, they say,\" cried Ben, popping his head into the room. \"The doctors say he is better, and that, after he has had a sleep, he will be all right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The sailor belonging to the ship you mean?\" said the colonel, \"What sort of a person is he, Ben?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Haven\u0027t seen him yet, so can\u0027t tell; but they have made up a good fire in the back kitchen, and he is lying on a sofa there, and going to sleep, and the doctor says it will do him no good to disturb him, or bother him by talking.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It certainly will not,\" said Ingestrie. \"It matters very little to us who he is, poor fellow. He is saved—that is the principal thing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Johanna, \"that is everything; and, at all events, Mark, there is one human being who through life, let his position and prospects be what they may, must look upon you as his friend and preserver.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah!\" said poor Tobias, \"We should all be very happy if Sweeney Todd were but in the hands of justice. It is very strange why I tremble so to-day at the thought of him; and I did not tremble yesterday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have no occasion to tremble to-day, nor yesterday either, Tobias,\" said Arabella. \"Remember how surrounded you are by your best friends, and remember, likewise, that, after all, Todd is but a man, and by this time he must be but a poor, weak, dispirited one, and much more intent upon devising means for his own safety, than in carrying out his revenges.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If, indeed, he lives,\" said the colonel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so,\" said Ingestrie. \"My opinion will very much incline to the idea that he is dead, if Sir Richard Blunt does not very shortly get some news of him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will be a pity,\" said Tobias, \"unless it can be proved past all dispute, for while it continues only a likely thing, the dread of him will still cling to my heart, and I shall never be happy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nay, Tobias,\" said the colonel, \"you must pluck up a spirit. The probability is now, that Sweeney Todd, let him be where he may, is much more afraid of meeting you than you can possibly be of meeting him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I thought so,\" said Tobias. \"But only look now how sweetly the sun is peeping out on the water after the storm there. This is very beautiful.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Tobias walked to the window; and his praise of the beauty of the morning caused the breakfast-table to be, in a very few minutes, completely deserted. To be sure, the praise that the imaginative boy had lavished upon the young day, was by no means misapplied; for a more lovely day than that which broke over Brighton, after that terrific gale in the Channel, could not be conceived. It seemed as if the good genii of earth, sea, and sky, were striving to banish from the minds of all the inhabitants of that place the recollections of the frightful storm that had made the world dismal and terrific.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed, it is lovely,\" said Johanna, \"Who, now, to look at that placid sheet of water, with scarce a ripple upon its surface to reflect the sunbeams, would think that only a few hours ago, it presented a scene of such fury that it was a shuddering terror to look upon it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And yet,\" said Ingestrie, \"it is these varieties that make the great world beautiful.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not a doubt of it; but they require more stern minds than mine, Mark, to stand them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The party now, finding that the day was so delightful, sallied out to the beach to make some inquiry among the sailors and boatmen, concerning the damage that the gale had done. The moment Mark Ingestrie appeared with his friends, he was recognised as the person who had performed the gallant exploit of going through the surf to the rescue of the shipwrecked man, and he became immediately the observed of all observers.\n\u003c/div\u003e \n\u003cdiv\u003e\n This sort of homage was at once flattering and embarrassing to Johanna. She felt proud that it was her husband who was entitled to so much popular consideration and respect, and yet, with her natural timidity of disposition, she shrank from sharing it with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Some eager inquiries were made of Ingestrie now, regarding the man he had saved, and it was a great gratification to him to be enabled to state that he was doing well, although he had not himself seen him since he grappled with him in the water, and brought him to the beach.\n\u003c/div\u003e \n\u003cdiv\u003e\n A few fragments only of the wreck had been washed to the shore, but nothing that could in any way enable them to identify the vessel; so that that was a species of information that must come from the man who had been saved, whenever he should be able to go through the fatigue of an interview with his friend and his deliverer.\n\u003c/div\u003e \n\u003cdiv\u003e\n After an hour\u0027s stroll upon the beach, the party, at a slow pace, returned to the house they had hired during their stay at Brighton. The moment they got to the door, the colonel\u0027s servant appeared with his horse, which he had ordered to be ready for him at twelve o\u0027clock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just walk him up and down,\" said the colonel, to the man; \"I shall be ready in a few minutes. Hilloa! my friend, Hector, are you here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The dog was with the horse, and the man said, touching his hat—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We were half a mind, sir, to let Hector loose last night during the storm, for he is a famous fellow in the water; but knowing how much you valued him, we were afraid to do so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad you didn\u0027t,\" said the colonel. \"You were quite right to keep him shut up. I would not have him come to any mischief for any money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The colonel entered the house, and when he and all his friends had got into the drawing-room, they sent for a servant to inquire how the poor wrecked man was getting on; and after a little time, one of the domestics of the house came to say that he was up and sitting, dressed, in the front kitchen, and would be happy to see, and to thank those who had saved him from death in the raging sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall we have him up here?\" said the colonel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, if you please,\" said Ingestrie; \"and, I daresay, a glass of wine won\u0027t hurt him, while he tells us the name of his ship, poor fellow, and who and what he is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly not,\" said Mr. Oakley. \"I will get out the decanter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Allow me, my dear,\" said Mrs. Oakley. \"You know you always break every glass that you interfere with.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, stuff!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I say, Mr. Oakley, that you do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Easy does it,\" said Ben, in his deepest bass voice. \"Easy does it, I say—Easy!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How cold I am,\" said Tobias.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Cold, Tobias!\" said Ingestrie. \"My good fellow, we will have a fire if you are cold.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no—no. Not on my account, Mr. Ingestrie, I shall be better soon; but I feel as if something were going to happen. My heart beats so fearfully, and at the same time, I shake as if—as if—I know not what.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give him a glass of wine,\" said Ingestrie to Johanna.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tobias took the glass of wine, and it evidently did him some good; but yet he looked ill and uneasy. Orders were given that the shipwrecked man should be shown up to the drawing-room, for they were all curious to know to what ship he had belonged, and how many had fallen victims to the frightful gale that had made the vessel such a complete wreck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is coming, poor fellow,\" said the colonel. \"I hear his footsteps on the stairs. He comes slowly. No doubt he is weak yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Poor fellow!\" sighed Johanna. \"Have the wine ready to give him at once, mother. It will put some heart into him. What must be his feelings towards you, Mark?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come now,\" said Ingestrie; \"don\u0027t plague him, any of you, about his being saved by me, and all that sort of thing. Just say nothing about it. Sailors are no great orators, at the best of times, and if he begins to make a speech about his gratitude, you may depend he will never get to the end of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but he ought to know,\" said Mrs. Oakley, \"who he owes his life to, under providence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hem!\" said Ben. He never liked to hear Mrs. Oakley begin to use religious phrases, as they had a tendency to remind him of the late Mr. Lupin.\n\u003c/div\u003e \n\u003cdiv\u003e\n The door of the drawing-room opened, and all eyes were eagerly bent in that direction. A servant came in, and said—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The poor man is here, if you please. Is he to come in, now? He seems rather timid.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes,\" said Ingestrie, \"let him come in, by all manner of means, poor fellow. He and I made acquaintance in the sea, and we ought to be good friends, now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n A tall, gigantic figure marched three paces into the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Todd!\" shouted Tobias. \"It is Todd!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It was Sweeney Todd! With one glance round the room, he recognised an enemy in every face. With a perfect yell of fear and rage, he turned, and dashed down the staircase. The servant who had conducted him up to the drawing-room, and whom he met in his way, he knocked down with one blow, and in another moment he was in the street. The colonel\u0027s horse was close to the door. Todd felled the man who held it by a blow on the top of the head, that took him so suddenly, he could not guard against it, and then springing upon the horse, the murderer raised another wild unearthly kind of shout, and set off at a gallop.\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd Seizes The Colonel\u0027s Horse, Mounts, And Makes Another Escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n Todd Seizes The Colonel\u0027s Horse, Mounts, And Makes Another Escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n So sudden—so totally unexpected, and so appalling had been the presence of Todd in the drawing-room, that if a spectre had appeared among the people there assembled, and they had had no possible means of escaping from the belief that it was a spectre, they could not have been more confounded than they were upon this occasion.\n\u003c/div\u003e \n\u003cdiv\u003e\n Poor Tobias, after uttering the exclamation that we have recorded, fell flat upon the floor. Ben swung backwards in his chair, and went with a tremendous crash right away into a corner. Ingestrie and the colonel rose together, and impeded each other in their efforts to follow Todd. Johanna, shrieking, clung to Ingestrie, and Arabella made a vain attempt to delay the colonel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By Heaven he is off!\" cried the colonel, as he heard the clatter of the horse\u0027s feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No!\" shouted Ingestrie; \"it cannot be!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Easy does it,\" said Ben, from the corner into which he had fallen. \"Easy—Easy!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Johanna, unhand me, I implore you,\" cried Mark Ingestrie. \"Do you wish the murderer to be lost sight of? Come on, colonel—you and I must engage in this pursuit. God of Heaven! the idea of me saving Todd from the waves!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The colonel and Ingestrie seized their hats, and rushed down the stairs, tumbling over the servant in the hall. The next object they came across was the groom who had had charge of the horse. They found him sitting on the pavement, looking as confused as possible.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Which way has he gone?\" cried the colonel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The—the man. Round that corner, and Hector has gone after him, like mad, sir. Oh, dear!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hector? Then he will be taken, for I will back Hector to hang upon him like grim death. Come with me to the nearest stable, Ingestrie, and let us get horses! Come—come!\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3276/89732.html","bookId":510,"creation":"Aug 2, 2019 4:29:04 AM","modification":"Aug 2, 2019 4:29:04 AM"}
