{"id":12039,"no":67,"title":"CHAPTER LXV. A MOONLIGHT VISIT TO ST. DUNSTAN\u0027S VAULTS.","content":"\u0026nbsp;For the remainder of that day Todd was scarcely visible, so we will leave him to his occupation, which was that of packing up valuables, while we take a peep at a very solemn hour indeed at old St. Dunstan\u0027s Church. The two figures on the outside of the ancient edifice had struck with their clubs the sonorous metal, and the hour of two had been proclaimed to such of the inhabitants of the vicinity who had the misfortune to be awake to hear it. The watchman at the gate of the Temple woke up and said \"past six,\" while another watchman, who was snugly ensconced in a box at the corner of Chancery Lane, answered that it was \"four o\u0027clock and a rainy morning.\" Now it was neither four o\u0027clock nor a rainy morning—for the sky, although by no means entirely destitute of clouds, was of that speckled clearness which allows the little stars to pass out at all sorts of odd crevices, like young beauties through the jalousies of some Spanish Castle. The moon, too, had, considering all things, a pretty good time of it, for the clouds were not dense enough to hide her face, and when behind them, she only looked like some young bride, with the faint covering of bashful blonde before her radiant countenance. And at times, too, she would peep out at some break in that veil with such a blaze of silvery beauty as was dazzling to behold, and quite stopped the few passengers who were in the streets at that lone hour. \n\u003cdiv\u003e\n \"Look,\" said one of four gentlemen, who were walking towards Temple Bar from the Strand. \"Look! Is not that lovely?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said another. \"A million fires are out in London now, and one can see the blue sky as it was seen when—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wild in the woods the painted savage ran.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, after all,\" said another, \"I prefer good broad cloth to red ochre. What say you, Sir Richard?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am of your lordship\u0027s opinion,\" said Sir Richard Blunt, who was one of the party of four: \"I certainly think we have gained something by not being Ancient Britons any longer than was absolutely necessary. This is, in truth, a most splendid night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is—it is,\" they all said.\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time, strolling along in an independent sort of fashion, they had reached Temple Bar, and then Sir Richard, bowing to the one who had not yet made any sort of remark, said—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Villimay, you have not forgotten the keys?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh no, Sir Richard; oh no.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, gentlemen, we are very near our place of destination. It will be advisable that we look about us, and use the utmost precaution, to be sure that we are not watched by any one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes—yes,\" said the other. \"You will be the best judge of that Sir Richard; with your tact, you will be able to come to a conclusion upon that subject much better than we can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir Richard Blunt made a slight kind of bow in acknowledgment of the compliment to his tact, and then, while what we may call the main body waited under the arch of Temple Bar, he advanced alone into Fleet Street. After advancing for a short distance, he took from his pocket a small silver whistle, and produced upon it a peculiar thrilling note. In a moment a tall man, with a great coat on him, merged from behind a column that lent its support to a door-way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here you is,\" said the man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is all right, Crotchet?\" said Sir Richard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; everything is quiet enough. Not a blessed mouse hasn\u0027t wagged his tail or smoothened his whiskers for the last half hour or so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very good, Crotchet. I\u0027m afraid, though, I cannot dismiss you just yet, as the business is very important.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the odds,\" said Crotchet, \"as long as you are happy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir Richard Blunt smiled, as he added—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Crotchet, you deserve, and you shall have an ample reward for the services you are doing and have done, in this affair. I and some gentlemen will go into the church, and I wish you to remain at the porch, and if you find occasion to give any warning, I think your whistle will be quite shrill enough to reach my ears.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not a doubt on it, Sir Richard. If what they calls the last trumpet is only half as loud as my last whistle, it will wake up the coves, and no mistake.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very good, Crotchet. Only don\u0027t make any profane allusions in the hearing of the gentlemen with me, for one of them is the Under Secretary of State, and the other two are men of account. We have to meet some one else in the church.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he hasn\u0027t come.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s awkward. The Lord Mayor was to meet us. Ah! who is this?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n A private carriage stopped on the other side of the way, and some one alighted, and a voice cried—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go home now, Samuel, and put up the horses. I shall not want you any more to-night. Go home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shan\u0027t we call anywhere for you, my lord?\" said Samuel, the coachman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No—no, I say. Go away at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s the Lord Mayor,\" said Sir Richard. \"He is pretty true to his time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke, Sir Richard crossed the road, and addressed the chief magistrate of the city, saying—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A fine night, my lord.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Sir Richard, is that you? Well, I am very glad to meet with you so soon. If I were to tell you the difficulty I have had to get here, you would not believe me. Indeed you could not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, my lord.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. You must know, Sir Richard, between you and I, and—and\"—Here the Lord Mayor, who did not like to say post, looked about him, and his eyes falling upon Temple Bar, added—\"Bar, I say; between you and me and the Bar, the Lady Mayoress, although a most excellent woman—indeed I may say an admirable woman—has at times her little faults of temper. You understand?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is without?\" said Sir Richard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah, who indeed—who indeed, Sir Richard. That is a very sensible remark of yours. Who is without? as you justly enough say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The Lord Mayor!\" said Sir Richard, who had been gradually leading his lordship to Temple Bar, and now announced his arrival to the three gentlemen who were there in waiting.\n\u003c/div\u003e \n\u003cdiv\u003e\n The three gentlemen professed themselves to be quite delighted to see the Lord Mayor, and the Lord Mayor professed to be quite in raptures to see the three gentlemen, so that a pleasanter party than they all made, could not have been imagined.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" said Sir Richard Blunt, \"I think, with all deference, gentlemen, that the sooner we proceed to business the better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, yes,\" said Mr. Villimay, who was the senior churchwarden. \"Oh, yes—certainly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And yet,\" said the Lord Mayor, \"we must be very cautious.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, very—very cautious,\" cried Villimay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But a bold front is the best,\" remarked Sir Richard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. As you say, sir, there\u0027s nothing like a bold front,\" cried Villimay.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir Richard, with a quiet smile, said to the under secretary—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A very obliging person, you perceive, Mr. Villimay is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, very,\" laughed the secretary.\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceded now by the churchwarden, they all made their way towards the church, but the watchman at the corner of Chancery Lane must have had something upon his mind, he was so very wakeful, for after they had all passed but Crotchet, he looked out of his box, and said—\"Thieves!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s that to you?\" said Crotchet, facing him with a look of defiance, \"eh? Can\u0027t you be quiet when you is told?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Murder!\" said the watchman, as he began to fumble for his rattle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hark ye, old pump,\" said Crotchet. \"I\u0027ve settled eight watchmen atween this here and Charing Cross, and you\u0027ll make nine, if you opens your mouth again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The appalled watchman shrank back into his box.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Eight, did you say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Crotchet took the lantern off its hook in front of the box, and smashed it upon the head of the guardian of the night, whereupon the aforesaid guardian shrank completely down to the bottom of the box, with the fragments of the lantern hanging about him, and said not another word.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I rather think,\" said Mr. Crotchet to himself, \"as I\u0027ve settled that old fellow comfortable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n With this conviction upon his mind—the amiability or the non-amiability of which we shall not stop to discuss—Mr. Crotchet ran hastily after the rest of the party, and stationed himself by the church porch, according to orders. By this time, Mr. Villimay, the churchwarden, had produced a little gothic-looking key, and proceeding to a small side door, he, after some rattling, partly consequent upon the lock being in a state of desuetude, and partly from personal nervousness, he did succeed in turning the rusty wards, and then, with an ominous groan, the door yielded. Sir Richard Blunt had quite satisfied himself that there were no eaves-droppers at hand, so he was anxious to get the party housed—perhaps in this instance churched would be a more appropriate expression.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gentlemen,\" he said, \"the night is stealing past, and we have much to do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is true, Sir Richard,\" said the secretary. \"Come on, Donkin, and let us get through it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The Lord Mayor shook a little as he passed through the little door, last, having, although king of the city, given the pas to every one of his companions, upon that most mysterious mission to old St. Dunstan\u0027s church at such an hour. Perhaps he had a faint hope that they might leave him entirely behind, and shut the door precipitately, so that he could not get in. If he had any such hope, however, it was doomed, like too many human hopes, to bitter disappointment, for Sir Richard Blunt held the door open for him, saying blandly—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, my lord. We could not get on without you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, thank you—thank you. You are very good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The Lord Mayor crossed the threshold, and then Mr. Villimay, who had occupied a remote and mysterious position at the back of the door, closed it, and locked it on the inside.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If—if you were to lose the key, Mr. Villimay?\" said the Lord Mayor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, then,\" interposed Sir Richard Blunt, \"I\u0027m afraid we should have to stay there until Sunday, unless some couple kindly got married in the meantime.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The Lord Mayor gave a very odd kind of cough, as he said—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What would the Lady Mayoress say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The air without had been cold, but what was that compared with the coldness within? At least, the street breeze had been dry, but in the church there was such a fearful dampness pervading the narrow passage in which the party found itself, that every one felt as though his very marrow was cold.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This passage,\" said Mr. Villimay, \"hasn\u0027t been opened for many a long day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed!\" said the secretary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, my lord, it has not: and it\u0027s only a wonder that, after a good hunt in the vestry cupboard, I at all found the key of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fortunate that you did,\" said Sir Richard Blunt, who was all this time making exertions to procure a light, which were as often defeated by the dampness of the air. At length he was successful in igniting a piece of wax candle, and he said—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gentlemen, this will show us our way through the church to the vestry, where we can get lanthorns.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said the Lord Mayor, who was getting so nervous that he thought himself called upon to make some reply to anything and anybody. \"Yes, lanthorns in the vestry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" said the secretary, \"my Lord Mayor, your mayoralty will be distinguished by this dreadful affair for all time to come.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Many thanks to your lordship, it will.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The secretary smiled as he whispered to his friend Donkin—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The city magistrate don\u0027t seem happy, Donkin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Far from it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n At the end of the little narrow, damp, gloomy, cobwebby passage in which they were, was another little door, the upper half of which was of highly ornamented iron fret work, the side of which next to the church interior being gilt. This door likewise yielded to a key which Mr. Villimay produced, and then they found themselves at once in the western aisle of the church.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The stench don\u0027t seem so bad,\" said Sir Richard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir,\" said Villimay. \"We have got all the windows open far up above there, and there\u0027s quite a current of air, too, right up the belfry.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3276/89624.html","bookId":510,"creation":"Aug 2, 2019 4:24:12 AM","modification":"Aug 2, 2019 4:24:12 AM"}
