{"id":95261,"no":18,"title":"Page 18","content":"\u003cp\u003eI was always late for everything--dinner, school, even movies--but tonight I was early, as I arrived at the Mansion at 6:45. Alexander opened the door himself and kissed me politely on the cheek. I was as shocked as he at his sudden display of affection.\u003c/p\u003e\n\u003cp\u003e\"That never happened when Jameson opened the door!\" I said.\u003c/p\u003e\n\u003cp\u003e\"Well, you better tell me if it does. We have a rule, you know. I don\u0027t kiss his girls and he doesn\u0027t kiss mine!\" Alexander glowed even more than he had that night I\u0027d snuck in and he had extended the hand with the spider ring. He was growing confident. He led me up the grand staircase to the family room. It was filled with modern art pieces--flowered paintings, an Andy Warhol print of Campbell\u0027s soup cans, Barbie doll sculptures, and flashy, furry, wild rugs. There was a black leather couch, a big-screen TV, and a glass table with a giant tub of movie popcorn, SnoCaps, Dots, Sprees, Good \u0026amp; Plenty, and two neon-green glasses filled with pop.\u003c/p\u003e\n\u003cp\u003e\"I wanted to make you feel like you\u0027re at the movies,\" he explained.\u003c/p\u003e\n\u003cp\u003eHe put in the DVD and turned out the lights, and we snuggled together in the darkness. I picked SnoCaps and he chose a pack of Sprees. The popcorn rested between us on the couch.\u003c/p\u003e\n\u003cp\u003eDracula was getting ready to take a bite out of Lucy when Alexander gently pulled my face away from the screen.\u003c/p\u003e\n\u003cp\u003eHe stared me at with his deep midnight eyes. He leaned toward me. And he kissed me. With passion. He kissed me! He finally kissed me! Right there in front of Bela Lugosi!\u003c/p\u003e\n\u003cp\u003eHe kissed me as if he were drinking me in and filling my heart and veins with love. As I took a breath, he began kissing my ears and gently nibbling them. I giggled like crazy. His lips and teeth made their way down my neck, his mouth filling me with total passion. His soft biting on my neck tickled. I was so into his spell, I stretched my legs out clumsily on the coffee table, spilling Alexander\u0027s glass and then the popcorn over him. Alexander, startled, sunk his teeth into my neck so hard I screamed.\u003c/p\u003e\n\u003cp\u003e\"Oh, no! I\u0027m sorry!\" he apologized.\u003c/p\u003e\n\u003cp\u003ePopcorn was scattered everywhere and I held my neck, which was pulsing like my heart.\u003c/p\u003e\n\u003cp\u003e\"Raven, are you okay?\"\u003c/p\u003e\n\u003cp\u003eThe blood rushed from my brain, and the room began to turn one way then another, and my stomach felt nauseated. I did what any overexcited, sappy girl would do. I fainted dead away. It seemed like hours later, but it was only seconds. I awoke to Alexander calling my name. Dracula was still in Lucy\u0027s room. The only difference was the lights were on.\u003c/p\u003e\n\u003cp\u003e\"Raven? Raven?\"\u003c/p\u003e\n\u003cp\u003e\"What happened?\"\u003c/p\u003e\n\u003cp\u003e\"You fainted! I thought that only happened in old movies!\"\u003c/p\u003e\n\u003cp\u003e\"Here, drink this.\" He put my glass to my lips, like I was a baby.\u003c/p\u003e\n\u003cp\u003eAlexander\u0027s pale face was even paler. He took some ice that had spilled on the table and placed it on my neck. \"I\u0027m so sorry! I never meant to--\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s cold!\" I cried.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve ruined everything,\" he said, holding the dripping ice on my neck.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t say that. This happens all the time.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me skeptically.\u003c/p\u003e\n\u003cp\u003e\"Well, just with you.\"\u003c/p\u003e\n\u003cp\u003e\"I never meant to hurt you.\"\u003c/p\u003e\n\u003cp\u003eI could feel his fingers tracing the wound. \"It\u0027s just a flesh wound. I didn\u0027t break the skin.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t?\" I asked, almost disappointed.\u003c/p\u003e\n\u003cp\u003e\"This is bigger than the mosquito bite. You\u0027ll have one major hickey!\"\u003c/p\u003e\n\u003cp\u003e\"Bela would be proud,\" I said, hanging on Alexander\u0027s reaction.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said. \"I guess he would.\" \"I want to ask you something,\" I said nervously, as he walked me to my door. I was running out of chances to invite him to the dance, and I realized if I didn\u0027t ask him now, I never would.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t want to hang out anymore? Listen, Raven--\"\u003c/p\u003e\n\u003cp\u003e\"No, I mean...I just wanted to say...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Umm...I found a place to dance,\" I began.\u003c/p\u003e\n\u003cp\u003e\"To dance? In this town?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Is it cool?\"\u003c/p\u003e\n\u003cp\u003e\"No, but--\"\u003c/p\u003e\n\u003cp\u003e\"But if you go there, it must be the trendiest place in the world.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my school.\"\u003c/p\u003e\n\u003cp\u003e\"School?\"\u003c/p\u003e\n\u003cp\u003e\"I thought you would think it was totally lame. I shouldn\u0027t have mentioned it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never been to a school dance before.\"\u003c/p\u003e\n\u003cp\u003e\"Really? Me neither.\"\u003c/p\u003e\n\u003cp\u003e\"Then it\u0027ll be the first time for both of us,\" he said with a sexy and suddenly confident grin.\u003c/p\u003e\n\u003cp\u003e\"I guess it will. It\u0027s called the Snow Ball. I can wear a woolen scarf to cover my bite,\" I joked. \"I\u0027m sorry--it was an accident.\"\u003c/p\u003e\n\u003cp\u003e\"It was the best accident that ever happened to me!\"\u003c/p\u003e\n\u003cp\u003eHe leaned in to kiss me and stopped suddenly. \"I better not.\"\u003c/p\u003e\n\u003cp\u003e\"You better!\"\u003c/p\u003e\n\u003cp\u003eHe leaned in again, and this time our lips melted together, his strong hand gently holding my chin.\u003c/p\u003e\n\u003cp\u003e\"Until we meet again,\" he said, kissing me one last time. He blew me a final kiss when he reached the car.\u003c/p\u003e\n\u003cp\u003eI touched the mark where he had bitten me. I knew I was already changing. But I wanted to look in the mirror to see for sure.\u003c/p\u003e\n\u003cp\u003eThe following day Becky and I went to Evans Park immediately after school. We opened our backpacks in a darkened corner of the empty rec center. My camera, my journal, and a compact mirror lay before us. Finally Becky placed a Tupperware bowl that held a clove of garlic and a cross wrapped in a leather pouch on the floor.\u003c/p\u003e\n\u003cp\u003e\"Ready to see the bite?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Is it gross?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my love wound,\" I said and carefully unwrapped the black scarf I\u0027d been wearing all day.\u003c/p\u003e\n\u003cp\u003e\"Wow! He has a big mouth!\" she said, wide-eyed.\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t it cool?\"\u003c/p\u003e\n\u003cp\u003e\"I can see teeth marks. A few scrapes, but I don\u0027t think he punctured the skin. Does it hurt?\" \"Not at all. It\u0027s like getting your ears pierced--it stings at first, but the pain quickly goes away.\"\u003c/p\u003e\n\u003cp\u003e\"Did you faint when you got your ears pierced, too?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get smart!\"\u003c/p\u003e\n\u003cp\u003e\"And the mark will go away, too, won\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what we\u0027re here to find out. Get the camera.\"\u003c/p\u003e\n\u003cp\u003eBecky took pictures of my wound, front and side. We laid the Polaroids on the cement floor as they developed.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re showing up,\" Becky stated.\u003c/p\u003e\n\u003cp\u003e\"Okay. Now the mirror,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Are you sure?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But if you are--you know, if you\u0027re really a...this could hurt.\"\u003c/p\u003e\n\u003cp\u003e\"Becky, we don\u0027t have all day.\"\u003c/p\u003e\n\u003cp\u003eI took off my sunglasses.\u003c/p\u003e\n\u003cp\u003e\"Ready?\" she asked, holding the compact.\u003c/p\u003e\n\u003cp\u003e\"Ready.\"\u003c/p\u003e\n\u003cp\u003eShe opened the compact and pushed it against my nose.\u003c/p\u003e\n\u003cp\u003e\"Ouch!\"\u003c/p\u003e\n\u003cp\u003e\"Oh, no!\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not supposed to hit me with it! Give that to me!\" I grabbed the compact with trembling hands and stared hard. Nothing--or rather, everything. I was still reflecting. \"Try the garlic!\" I ordered, tossing the mirror aside.\u003c/p\u003e\n\u003cp\u003eBecky opened the Tupperware bowl and cut the clove in half.\u003c/p\u003e\n\u003cp\u003e\"Now?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Now.\"\u003c/p\u003e\n\u003cp\u003eI could smell the garlic already. She held the clove under my nose. I took a deep whiff. And coughed wildly.\u003c/p\u003e\n\u003cp\u003e\"Are you okay?\"\u003c/p\u003e\n\u003cp\u003e\"Man, that\u0027s strong! Gross! Put it away!\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s fresh--that\u0027s why.\"\u003c/p\u003e\n\u003cp\u003e\"Put it away!\" I said.\u003c/p\u003e\n\u003cp\u003e\"I like the smell. It clears my sinuses.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s not supposed to relieve me of nasal congestion. It\u0027s supposed to send me into a revolting frenzy.\"\u003c/p\u003e\n\u003cp\u003e\"We have one more shot left.\"\u003c/p\u003e\n\u003cp\u003eShe opened the leather pouch. \"Ready?\"\u003c/p\u003e\n\u003cp\u003eI took a deep breath. \"Go for it!\"\u003c/p\u003e\n\u003cp\u003eShe pulled out a jeweled cross on a gold chain.\u003c/p\u003e\n\u003cp\u003e\"Wow, that\u0027s cool,\" I said. \"It looks very special.\"\u003c/p\u003e\n\u003cp\u003e\"Does it bother you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it bothers me. It bothers me that I was so foolish!\"\u003c/p\u003e\n\u003cp\u003eWe stepped into the sunshine--blinding for both of us. \"It\u0027s very glary after sitting in the dark,\" Becky commented as she put on her sunglasses. She looked up at me, relieved. \"I don\u0027t think you\u0027re a vampire.\"\u003c/p\u003e\n\u003cp\u003e\"What was I thinking? Alexander is so special. Why am I acting like Trevor?\"\u003c/p\u003e\n\u003cp\u003eWe both stared into the sunshine.\u003c/p\u003e\n\u003cp\u003e\"I had gotten totally caught up in the rumor mill. Just like all the Dullsvillians. I\u0027m no better than they are, am I? We wear different clothes, but I\u0027m just as shallow as they are,\" I said, disappointed in myself.\u003c/p\u003e\n\u003cp\u003e\"But you wanted him to be a vampire because you like vampires!\"\u003c/p\u003e\n\u003cp\u003e\"Thanks. Maybe I\u0027m supposed to give it twenty-four hours,\" I said as we started to walk home.\u003c/p\u003e\n\u003cp\u003eI awoke to another sunny day. Not only didn\u0027t the sun burn my skin on contact, but its warmth actually felt good against my flesh. Not only didn\u0027t mirrors shatter like they did for Gary Oldman in Bram Stoker\u0027s Dracula, but my reflection looked like it did every day--a pale girl in all black. And the only thing I was thirsty for was a chocolate soda from Shirley\u0027s Bakery.\u003c/p\u003e\n\u003cp\u003eStill, my heart raced when my mother served linguini with garlic for dinner that night. Everyone stared at me as I played with my food, smelling and taking deep breaths.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s with you?\" Billy Boy asked. \"You\u0027re acting strange, even for you.\"\u003c/p\u003e\n\u003cp\u003eI twirled some pasta on my fork and raised it slowly to my mouth. \"Here goes,\" I said. My patents looked at me like I was an alien. The noodles touched my tongue and I chewed and chewed and took a huge swallow.\u003c/p\u003e\n\u003cp\u003e\"Here goes what?\" my mother asked.\u003c/p\u003e\n\u003cp\u003eI took a breath. I expected my throat to burn and my skin to crawl. I expected to choke and gasp at the first taste of garlic. And then it happened. Nothing. Nothing is what happened.\u003c/p\u003e\n\u003cp\u003e\"Here\u0027s to what?\" my mother repeated.\u003c/p\u003e\n\u003cp\u003e\"Here\u0027s to...here\u0027s to another Sarah Madison gourmet dinner!\"\u003c/p\u003e\n\u003cp\u003eThough I wasn\u0027t melting in the sun, shattering mirrors, or cringing from the sent of garlic, I was feeling Alexander\u0027s power in different ways. I was walking on air, as if I could fly like a bat. I couldn\u0027t possibly sleep at night, my mind was racing, dreaming of him, replaying his kisses over and over. I doodled our names surrounded by hearts in all my notebooks during class. I wanted to be with him every moment, because whatever he was, he was my Alexander. My funny, intelligent, caring, lonely, gorgeous, dreamy Alexander. He was more incredible and exceptional than I had ever imagined.\u003c/p\u003e\n\u003cp\u003eAnd I was glad I was changing, and not in the way I had fantasized about for so long. I was happy to see my mirrors didn\u0027t shatter, because now I saw a reflection of a girl in love, glowing with happiness. Why should I want to live in a cemetery for eternity, when it might be possible to live in Alexander\u0027s attic room? I didn\u0027t want to cringe from the sunlight but watch Hawaiian sunsets with him. I didn\u0027t want to drink blood but sip pop from Alexander\u0027s neon-green glasses. I wanted to enjoy the things I had always enjoyed--ice cream, horror movies, swings after dark--but now I wanted to share them with him. \"I heard you\u0027re hanging with the vampire,\" Trevor said the day before the Snow Ball as Becky and I walked through the hall after lunch. Signs for the dance hung from the ceiling and were plastered on the walls. \"Isn\u0027t it enough that you\u0027re a freak and Becky is a troll? Now you have to date a lunatic? Don\u0027t you know that the Mansion is haunted?\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know anything! You\u0027ve never even met Alexander.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Alexander. The monster has a name. I thought you just called him Frankenstein. If I do ever meet him, I\u0027ll kick his ass and run him out of town. We need to know that we can walk the streets safely at night!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll kick your ass if you ever even come near him. If you ever even look at him.\"\u003c/p\u003e\n\u003cp\u003e\"If he looks anything like you, I\u0027ll need sunglasses to guard against the blinding ugliness.\"\u003c/p\u003e\n\u003cp\u003ePrincipal Smith walked by. \"I hope everything is okay with you two. We haven\u0027t received a budget for new lockers.\" Then he put his arm around the jerk and said, \"I heard you kicked the winning goal in yesterday\u0027s game, Trevor.\"\u003c/p\u003e\n\u003cp\u003eThey turned away, Principal Smith engaging the reluctant Trevor in jock conversation.\u003c/p\u003e\n\u003cp\u003e\"How did he know I\u0027m seeing Alexander?\" I asked Becky, puzzled.\u003c/p\u003e\n\u003cp\u003e\"Uh, I guess people...you know how people talk in this town.\"\u003c/p\u003e\n\u003cp\u003e\"Well, people in this town are stupid.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, Raven, I have something to tell you,\" she began in a nervous voice that was even more nervous than her normal nervous voice. But I was distracted by the signs for the dance, TICKETS ON SALE NOW. SAVE FIVE DOLLARS IF YOU PRE-PURCHASE.\u003c/p\u003e\n\u003cp\u003e\"Tickets? Frig! I didn\u0027t know I needed tickets! Do I get them at TicketMaster? Charge by phone?\" I laughed. \"That\u0027s what happens when you\u0027re on the outside, you know?\"\u003c/p\u003e\n\u003cp\u003e\"I totally know. The outside gets worse and worse each day.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe they\u0027ll be sold out and we\u0027ll have to dance on the school lawn,\" I joked.\u003c/p\u003e\n\u003cp\u003eBut Becky wasn\u0027t laughing.\u003c/p\u003e\n\u003cp\u003e\"Maybe it\u0027s best you and Alexander have a private dance at the Mansion.\"\u003c/p\u003e\n\u003cp\u003e\"And miss seeing Trevor\u0027s face when I walk in with Alexander?\"\u003c/p\u003e\n\u003cp\u003e\"Trevor knows a lot, Raven,\" she said oddly.\u003c/p\u003e\n\u003cp\u003e\"Fine, so he\u0027ll get into a good college. What do I care?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid of Trevor. His father owns half our farm.\"\u003c/p\u003e\n\u003cp\u003e\"The corn or the sugar?\"\u003c/p\u003e\n\u003cp\u003e\"I have a confession--\"\u003c/p\u003e\n\u003cp\u003e\"Save it for Sunday. Forget about Trevor. He\u0027s just a bully.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not strong like you. I never was. You\u0027re my best friend, but Trevor has a way of making people say things they don\u0027t want to. But please-- don\u0027t go to the dance,\" she said, grabbing my arm.\u003c/p\u003e\n\u003cp\u003eSuddenly the bell rang. \"I\u0027ve gotta go. I can\u0027t get another detention or I\u0027ll be banned from the dance.\"\u003c/p\u003e\n\u003cp\u003e\"But Raven--\" \"Don\u0027t be afraid, girlie, I\u0027ll protect you from the monsters.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-kisses-vampire-kisses-1/page-18.html","bookId":2137,"creation":"Oct 5, 2019 6:13:52 PM","modification":"Oct 5, 2019 6:13:52 PM"}
