{"id":95246,"no":3,"title":"Page 3","content":"\u003cp\u003eMy Sweet Sixteenth birthday. Shouldn\u0027t all birthdays be sweet? Why should sixteen be any sweeter? It seemed like a lot of hype to me!\u003c/p\u003e\n\u003cp\u003eIn Dullsville, they celebrate today, my sixteenth birthday, as any other day.\u003c/p\u003e\n\u003cp\u003eIt all started with Nerd Boy\u0027s shouting at me. \"Get up, Raven. You don\u0027t want to be late. It\u0027s time for school!\"\u003c/p\u003e\n\u003cp\u003eHow could two kids come from the same parents and be so different? Maybe there is something to that theory about the mailman. But in Nerd Boy\u0027s case my mother must have had an affair with the librarian.\u003c/p\u003e\n\u003cp\u003eI dragged myself out of bed and put on a black, cotton sleeveless dress and black hiking boots, and outlined my full lips with black lipstick.\u003c/p\u003e\n\u003cp\u003eTwo white-flowered cakes, one in the shape of a 1 and the other in the shape of a 6, awaited me on the kitchen table.\u003c/p\u003e\n\u003cp\u003eI grazed the 6 cake with my index finger and licked the icing off.\u003c/p\u003e\n\u003cp\u003e\"Happy birthday!\" my mom said, kissing me. \"That\u0027s for tonight, but you can have this now,\" she said handing me a package.\u003c/p\u003e\n\u003cp\u003e\"Happy birthday, Rave,\" my dad said, also giving me a kiss on the cheek.\u003c/p\u003e\n\u003cp\u003e\"I bet you have no idea what you\u0027re giving me,\" I teased my dad as I held the package.\u003c/p\u003e\n\u003cp\u003e\"No. But I\u0027m sure it cost a lot.\"\u003c/p\u003e\n\u003cp\u003eI shook the light package in my hand and heard a rattle. I stared at the Happy Birthday wrapping paper. It could be the keys to a car-- my very own Batmobile! After all, it was my sixteenth birthday. \"I wanted to buy you something special,\" my mom said, smiling.\u003c/p\u003e\n\u003cp\u003eI ripped the package open excitedly and lifted the jewelry box lid. A string of shiny white pearls stared back at me.\u003c/p\u003e\n\u003cp\u003e\"Every girl should have a pearl necklace for special occasions.\" My mom gleamed.\u003c/p\u003e\n\u003cp\u003eThis was my mom\u0027s corporate version of hippie love beads. I forced a crooked smile as I tried to hide my disappointment. \"Thanks,\" I said, hugging them both. I began to put the necklace back in the box, but my parents glared at me, so I reluctantly modeled it for them.\u003c/p\u003e\n\u003cp\u003e\"It looks gorgeous on you.\" My mom glowed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll save them for something really special,\" I replied, putting them back in the box.\u003c/p\u003e\n\u003cp\u003eThe doorbell rang, and Becky came in with a small black gift bag.\u003c/p\u003e\n\u003cp\u003e\"Happy birthday!\" she shouted as we went into the living room.\u003c/p\u003e\n\u003cp\u003e\"Thanks. You didn\u0027t have to get me anything.\"\u003c/p\u003e\n\u003cp\u003e\"You say that every year,\" she teased and handed me the bag. \"By the way, I saw a moving van last night outside the Mansion!\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"No way! Someone finally moved in?\"\u003c/p\u003e\n\u003cp\u003e\"Guess so. But all I saw were the movers carrying in oak desks, grandfather clocks, and huge crates marked \u0027Soil.\u0027 And they have a teenage son.\"\u003c/p\u003e\n\u003cp\u003e\"He was probably born wearing khaki pants. And I\u0027m sure his parents are some boring Ivy Leaguers,\" I replied. \"I hope they don\u0027t remodel it and chase out all the spiders.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. And tear down the gate and put up a white picket fence.\" \"And a plastic goose on the front lawn.\"\u003c/p\u003e\n\u003cp\u003eWe both giggled like mad as I stuck my hand into the bag.\u003c/p\u003e\n\u003cp\u003e\"I wanted to buy you something special, since you\u0027re sixteen.\"\u003c/p\u003e\n\u003cp\u003eI pulled out a black leather necklace with a pewter charm. The charm was a bat!\u003c/p\u003e\n\u003cp\u003e\"I love it!\" I screamed, putting it on.\u003c/p\u003e\n\u003cp\u003eMy mom leered at me from the kitchen.\u003c/p\u003e\n\u003cp\u003e\"Next time we\u0027ll give her money,\" I heard her tell my father.\u003c/p\u003e\n\u003cp\u003e\"Pearls!\" I whispered to Becky as we left the house.\u003c/p\u003e\n\u003cp\u003eI was in gym class wearing a black shirt, shorts, and combat boots instead of the required white-on-white and gym shoes. Really, what\u0027s the point? I thought. Does a white ensemble make a student a better athlete?\u003c/p\u003e\n\u003cp\u003e\"Raven, I don\u0027t feel like sending you to the office today. Why don\u0027t you just give me a break for once and wear what you\u0027re supposed to wear?\" Mr. Harris, the gym teacher, whined.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my birthday. Maybe you could give me a break this once!\"\u003c/p\u003e\n\u003cp\u003eHe stared at me, not knowing what to say. \"Just today,\" he finally agreed. \"And not because it\u0027s your birthday, but because I\u0027m not in the mood to send you to the office.\"\u003c/p\u003e\n\u003cp\u003eBecky and I giggled as we went off toward the bleachers where the class was waiting.\u003c/p\u003e\n\u003cp\u003eTrevor Mitchell, my kindergarten nemesis, and his shuffling sidekick, Matt Wells, followed us. They were perfectly combed, conservative, rich soccer snobs. They knew they were great looking, and it made me sick that they were so cocky.\u003c/p\u003e\n\u003cp\u003e\"Sweet sixteen!\" Trevor said, obviously having overheard my chat with Mr. Harris. \"How lovely! Just ripe for love, don\u0027t you think, Matt?\" They were close on our heels.\u003c/p\u003e\n\u003cp\u003e\"Yeah, dude,\" Matt agreed.\u003c/p\u003e\n\u003cp\u003e\"But maybe there\u0027s a reason she doesn\u0027t wear white--white is for virgins, right, Raven?\"\u003c/p\u003e\n\u003cp\u003eHe was gorgeous, no doubt about it. His blue eyes were beautiful, and his hair looked as perfect as a model\u0027s. He had a girl for every day of the week. He was a bad boy, but he was a rich bad boy, which made him very boring.\u003c/p\u003e\n\u003cp\u003e\"Hey, I\u0027m not the one wearing white underwear, am I?\" I asked. \"You\u0027re right--there\u0027s a reason I wear black. Maybe you\u0027re the one who oughta get out more. \"\u003c/p\u003e\n\u003cp\u003eBecky and I sat on the far end of the bleachers, leaving Trevor and Matt standing on the track.\u003c/p\u003e\n\u003cp\u003e\"So how are you spending your birthday?\" Trevor shouted, sitting with the rest of the class, loud enough for everyone to hear. \"You and farmer Becky sitting home on a Friday night, watching Friday the Thirteenth? Maybe placing some personal ads? \u0027Sixteen- year-old single white monster girl seeks mate to bond with for eternity.\u0027\"\u003c/p\u003e\n\u003cp\u003eThe whole class laughed.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t like it when Trevor teased me, but I liked it even less when he teased Becky.\u003c/p\u003e\n\u003cp\u003e\"No, we were thinking of crashing Matt\u0027s party tonight. Otherwise there won\u0027t be anyone interesting there.\" Everyone was shocked, and Becky rolled her eyes, as if to say, What are you dragging me into now? We had never been to one of Matt\u0027s highly publicized parties. We were never invited, and we wouldn\u0027t have gone if we were. At least I wouldn\u0027t.\u003c/p\u003e\n\u003cp\u003eThe whole class waited for Trevor\u0027s reaction.\u003c/p\u003e\n\u003cp\u003e\"Sure, you and Igor can come...but remember, we drink beer, not blood!\" The whole class laughed again, and Trevor high-fived Matt.\u003c/p\u003e\n\u003cp\u003eJust then Mr. Harris blew his whistle, signaling us to hightail it off the bleachers and run like greyhounds around the track.\u003c/p\u003e\n\u003cp\u003eBut Becky and I walked, indifferent to our sweating classmates.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t go to Matt\u0027s party,\" Becky said. \"Who knows what they\u0027ll do to us?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see what they do. Or what we\u0027ll do. It\u0027s my Sweet Sixteenth, remember? A birthday to never forget!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-kisses-vampire-kisses-1/page-3.html","bookId":2137,"creation":"Oct 5, 2019 6:13:52 PM","modification":"Oct 5, 2019 6:13:52 PM"}
