{"id":95249,"no":6,"title":"Page 6","content":"\u003cp\u003eThe story of Naked Trevor spread immediately through Dullsville High. Some students said he stumbled into Matt\u0027s house in a trash-bag diaper; others said he was found passed out naked on the back lawn. No one had a clue I was involved. Only Trevor Boy knew the real story. Apparently he tried to pass it off to his buddies as an encounter with a cheerleader. Either way, everyone got a laugh.\u003c/p\u003e\n\u003cp\u003eTrevor left me alone. He wouldn\u0027t even make eye contact with me. Gothic Girl had finally gotten the goods on the popular Soccer Snob. But I didn\u0027t want him to accuse me of theft. I had to give his clothes back, right?\u003c/p\u003e\n\u003cp\u003eFirst there was the shoe. I think it was the left. I strung it on the outside of my locker. At first no one seemed to notice the hanging loafer. Those who finally did looked at it and walked on. But the next morning it was gone. One person had noticed it. Now it was time for others to take notice besides good ol\u0027 Trevor.\u003c/p\u003e\n\u003cp\u003eThe right brown loafer was strung up in the same fashion. But next to it was a sign: MISSING SOMETHING, TREVOR? This time I heard giggles as students passed. They didn\u0027t realize whose locker it was. But they\u0027d soon be catching on.\u003c/p\u003e\n\u003cp\u003eEach day a sock would hang out, or a T-shirt. I started noticing Snob Girls who would never talk to me suddenly looking over in algebra with smiling approval. They had been Trevor Tree Girls, promised everything, with nothing to show for it. Well, I had plenty to show.\u003c/p\u003e\n\u003cp\u003eBy the time his khaki pants were hung out, complete with grass stains and dirt, everyone knew whose locker it was. Now kids in the hall were grinning at me. Guys weren\u0027t exactly asking me out, but I was suddenly popular--in a quiet kind of way.\u003c/p\u003e\n\u003cp\u003eExcept, of course, with Trevor. But I felt safe. Now that everyone knew whose locker it was, he would be the prime suspect if anything happened to me.\u003c/p\u003e\n\u003cp\u003eBut he did make the odd threat.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll kick your ass, Monster,\" he said one day. He grabbed my jaw in his hands when Becky and I were starting to walk home.\u003c/p\u003e\n\u003cp\u003e\"Combat boots hurt more than loafers, Neanderthal,\" I shot back. My face was pressed between his hands.\u003c/p\u003e\n\u003cp\u003e\"Let her go,\" Matt said, pulling him away. I could see even Matt had enjoyed my prank. I\u0027m sure he got tired of the Trevor attitude sometimes. After all, he was stuck being Trevor\u0027s best friend.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll never be anything more than a freak!\" Trevor shouted. Fortunately Matt pulled him away again. I didn\u0027t feel like going to battle after a long day at school.\u003c/p\u003e\n\u003cp\u003e\"You just wait! You just wait!\" he called back to me.\u003c/p\u003e\n\u003cp\u003e\"Talk to my lawyer!\" I yelled, secretly hoping I wasn\u0027t going to need a plastic surgeon instead. Time for the grand finale. Lots of students were gathered around my locker. I even saw a freshman taking pictures.\u003c/p\u003e\n\u003cp\u003eIt was the climax everyone had been waiting for: Trevor\u0027s white Calvin Klein underwear hot-glued to my locker. The sign underneath read: WHITE IS FOR VIRGINS, RIGHT TREVOR?\u003c/p\u003e\n\u003cp\u003eIt would be up there for a while. Everyone saw it. I mean everyone!\u003c/p\u003e\n\u003cp\u003e\"Raven, you defaced school property,\" Principal Smith scolded me later that day. I had been in Principal Smith\u0027s office so many times, it was like seeing an old friend.\u003c/p\u003e\n\u003cp\u003e\"Those lockers have been here forever, Frank,\" I replied. \"Maybe it\u0027s time you tell the school board we need new ones.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you see the seriousness involved here, Raven. You ruined a locker and embarrassed an honors student.\"\u003c/p\u003e\n\u003cp\u003e\"What honor? Ask your straight-A cheerleaders and half the drill team how many times he\u0027s embarrassed them!\"\u003c/p\u003e\n\u003cp\u003ePrincipal Smith rattled his pencil in frustration.\u003c/p\u003e\n\u003cp\u003e\"We need to get you involved in something, Raven. Some club you can belong to, something that will help you make friends.\"\u003c/p\u003e\n\u003cp\u003e\"The chess club have any openings? Or how about the math club?\" I asked sarcastically.\u003c/p\u003e\n\u003cp\u003e\"There are other activities.\"\u003c/p\u003e\n\u003cp\u003e\"Can you guarantee me a spot on the cheerleading squad? Of course, I\u0027d have to wear a black pleated skirt.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s one you have to try out for. But I bet you\u0027d be great.\" \"Obviously honors students, like Trevor, really respect cheerleaders.\"\u003c/p\u003e\n\u003cp\u003e\"Raven, high school is hard for most kids. That\u0027s just the way it is. Even the people who look as though they belong usually don\u0027t feel they belong. But you have so much going for you. You\u0027re imaginative. You\u0027re smart. You\u0027ll figure it out. Just don\u0027t damage any more lockers while you\u0027re trying to find the answers.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, Frank,\" I said, taking the detention slip. \"See you soon.\"\u003c/p\u003e\n\u003cp\u003e\"Not too soon, okay, Raven?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll try not to work you too hard,\" I said and closed the door.\u003c/p\u003e\n\u003cp\u003eThe next day I noticed something on my locker that I hadn\u0027t put up. In black paint was written: RAVEN IS A HORROR!\u003c/p\u003e\n\u003cp\u003eI smiled. Very clever, Trevor. Very clever. I felt warm inside. It was the first time he had ever complimented me. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-kisses-vampire-kisses-1/page-6.html","bookId":2137,"creation":"Oct 5, 2019 6:13:52 PM","modification":"Oct 5, 2019 6:13:52 PM"}
