{"id":103588,"no":26,"title":"Page 26","content":"\u003cp\u003e“See what you’ve done?”\u003c/p\u003e\n\u003cp\u003eA moment later, Nina surprised me by appearing at the table to take our orders herself. Harry stood, bussed her cheek, and called her “lovely Nina,” which I found irritating, then introduced her around. Finnegan shook her hand, said he was delighted to meet her, and asked, “Is it true that this place is haunted?”\u003c/p\u003e\n\u003cp\u003e“Uh-oh,” Harry said as he took his seat.\u003c/p\u003e\n\u003cp\u003eI was tempted to look away, but it was like a traffic accident—you just have to watch.\u003c/p\u003e\n\u003cp\u003eNina raised an eyebrow and smiled. Trust me when I say there was no mirth in it. “Do you believe in ghosts, Mr. Finnegan?” she asked.\u003c/p\u003e\n\u003cp\u003e“Not necessarily,” Finnegan said. “The TV show…”\u003c/p\u003e\n\u003cp\u003eThe TV program in question followed a team of self-described ghost hunters as they purportedly investigated paranormal activity around the country. Erica invited them to Rickie’s without Nina’s knowledge or permission. I suspect she was just trying to annoy her mother, who tended to take a flat-earth philosophy toward things like ghosts, ESP, UFOs, and government conspiracies.\u003c/p\u003e\n\u003cp\u003e“TV show?” Nina said. “What else forms your worldview, Mr. Finnegan? Fringe? Lost? X-Files? True freaking Blood? The Vampire Diaries?”\u003c/p\u003e\n\u003cp\u003e“I just—”\u003c/p\u003e\n\u003cp\u003e“Is this what the United States Justice Department has come to—getting its information from basic cable?”\u003c/p\u003e\n\u003cp\u003eFinnegan didn’t answer, so Nina turned toward me as if I were somehow the cause of her frustration. I didn’t so much as smile—I like excitement as much as the next guy, but I’m not suicidal. I pointed at Finnegan.\u003c/p\u003e\n\u003cp\u003e“Give him the bill,” I said.\u003c/p\u003e\n\u003cp\u003eShe did, too, or rather Jenness Crawford did. Nina remained out of sight. It occurred to me that it was no coincidence that the morning after the TV program’s camera crew arrived at Rickie’s, Erica flew off to New Orleans.\u003c/p\u003e\n\u003cp\u003eThe moment Nina left, Finnegan said, “I don’t know about ghosts, but clearly she—”\u003c/p\u003e\n\u003cp\u003eI raised my index finger in warning and cleared my throat. Finnegan glanced at Harry, who was shaking his head slowly from side to side, an expression of dire warning on his face.\u003c/p\u003e\n\u003cp\u003e“Yes, well, a very nice club,” Finnegan said. “I hear the music is sensational.”\u003c/p\u003e\n\u003cp\u003e“So is the food,” Harry said.\u003c/p\u003e\n\u003cp\u003eFinnegan took a deep breath and exhaled slowly. He didn’t smile. I doubted he had much of a sense of humor—he had the look of a man who decided long ago life was a very serious proposition. He began speaking in that earnest, sincere way career politicians have.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” he said. “It’s just McKenzie, correct? Not Mr. McKenzie?”\u003c/p\u003e\n\u003cp\u003e“McKenzie will do.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, normally I would attempt to appeal to your altruistic nature. I would tell you about all the people who will suffer if we don’t get those guns off the border, the men and women—and children—who will be hurt or killed. I would tell you how the damage done to the Justice Department’s reputation would make it more difficult for us to do our work, how it would compromise our ability to secure our borders and protect our citizens. However, I’m informed that Special Agents Bullert and Wilson have already addressed that argument.”\u003c/p\u003e\n\u003cp\u003eEveryone nodded in agreement.\u003c/p\u003e\n\u003cp\u003e“Next, I would make threats. I would refer to that rather lengthy document we’ve compiled on you and your many, should I say, indecorous actions?”\u003c/p\u003e\n\u003cp\u003eOh, let’s, my inner voice said. Indecorous—my, my, my.\u003c/p\u003e\n\u003cp\u003e“I have been assured, however, that you are not a man who is easily intimidated,” Finnegan said. “I am also aware that you and your investment counselor—H. B. Sutton, I believe is her name—have grown the reward you accepted to nearly five million, so a bribe is certainly out of the question.”\u003c/p\u003e\n\u003cp\u003e“Sounds like an impasse to me,” I said.\u003c/p\u003e\n\u003cp\u003e“On the other hand, perhaps you might be enticed by the age-old system of barter. That is your preferred method of exchange, is it not—favor for favor?”\u003c/p\u003e\n\u003cp\u003e“What do you have to trade?”\u003c/p\u003e\n\u003cp\u003eFinnegan took a business card from his pocket and slid the card, faceup, across the table to me. The top listed his name, title, and assorted means of contact under the crest of the U.S. Department of Justice. I turned it over and found the word “allegation” written there.\u003c/p\u003e\n\u003cp\u003eI repeated it out loud, and Finnegan grinned. “I love that word,” he said. “What was it that the Reverend Jesse Jackson once said? ‘I not only deny the allegation, I deny the alligator.’”\u003c/p\u003e\n\u003cp\u003e“What does this mean exactly?” I asked.\u003c/p\u003e\n\u003cp\u003e“Call my office day or night, use the code word, and the next voice you hear will be mine.”\u003c/p\u003e\n\u003cp\u003e“I don’t get it.”\u003c/p\u003e\n\u003cp\u003e“It’s a get-out-of-jail-free card,” Harry said.\u003c/p\u003e\n\u003cp\u003e“Let’s face it,” Bullert said, “the way you live your life, sooner or later you’re going to need it.”\u003c/p\u003e\n\u003cp\u003e“Your buddy Governor Barrett is not running for reelection,” Harry reminded me.\u003c/p\u003e\n\u003cp\u003e“So?” I said.\u003c/p\u003e\n\u003cp\u003e“So now we’re your friends in high places,” Finnegan said. “And a man like you can never have too many friends.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-26.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
