{"id":103589,"no":27,"title":"Page 27","content":"\u003cp\u003e“I made myself clear to Finnegan,” I told Bullert over the cell phone. “I’m in until the bullets start flying. I’m in as long as no one gets hurt. If these guys shoot someone…”\u003c/p\u003e\n\u003cp\u003e“Let’s hope for an uneventful criminal enterprise, then,” he said.\u003c/p\u003e\n\u003cp\u003e“Christ.”\u003c/p\u003e\n\u003cp\u003e“In the meantime, we’ll check out this Roy Cepek. Could be he got the guns through a military connection, an army buddy turned merc, maybe.”\u003c/p\u003e\n\u003cp\u003eI ended the call, erased Bullert’s number from the log just in case, deactivated the phone, and returned it to my pocket. Shortly after, my hands filled with cardboard coffee cups, I opened the café door with my shoulder and stepped into the parking lot. The Corolla was still there; the elderly man still inside, although Roy Clark had been swapped for Loretta Lynn—I guessed this was what amounted to Golden Oldies in Silver Bay. I returned to the Jeep Cherokee and handed Skarda his coffee through the open passenger window.\u003c/p\u003e\n\u003cp\u003e“You were gone so long,” he said. “I was starting to get worried.”\u003c/p\u003e\n\u003cp\u003e“I took a minute to use the john,” I said. I circled the SUV and entered through the driver’s door. “Anything interesting happening?”\u003c/p\u003e\n\u003cp\u003e“Just the armored car.”\u003c/p\u003e\n\u003cp\u003e“What armored car?”\u003c/p\u003e\n\u003cp\u003eSkarda handed me the binoculars, and I studied the blue vehicle, the name Mesabi Security printed on its side. It was a decidedly old armored truck with streaks of rust along the wheel wells and rocker panels. The driver sat in the cab, the window rolled down, his elbow propped on the door frame. A second guard exited the supermarket carrying a nylon bag. He set it on the ground behind the truck where the driver couldn’t possibly have seen him, opened the rear compartment, tossed the bag inside, and then climbed in after it.\u003c/p\u003e\n\u003cp\u003e“Very, very sloppy,” I said.\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003e“The armored car guards. I could take those clowns with a slingshot. Okay, look—you had better contact Josie and have her call off the job.”\u003c/p\u003e\n\u003cp\u003e“I can’t. I don’t have a cell phone. What happened to the one we bought yesterday?”\u003c/p\u003e\n\u003cp\u003e“I tossed it. Look, we have to head them off somehow.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because there’s no money to steal. The armored car guys just drove off with it.”\u003c/p\u003e\n\u003cp\u003e“No…”\u003c/p\u003e\n\u003cp\u003e“What do you think they were here for? To buy Milky Ways and Slushies?”\u003c/p\u003e\n\u003cp\u003e“No…”\u003c/p\u003e\n\u003cp\u003e“Stop saying that.”\u003c/p\u003e\n\u003cp\u003e“Look.”\u003c/p\u003e\n\u003cp\u003eSkarda pointed. I followed his finger to a car that pulled to a stop directly in front of the grocery store. Jill was driving. Jimmy got out of the car. His jacket was hanging open as he nonchalantly walked into the store, pausing for a moment while a woman pushed a loaded shopping cart past him. Exactly seven minutes later a second vehicle approached from the opposite direction. The old man was driving. Roy stepped out holding his AK-47 in the port position again and scanned the parking lot like a hunter searching for game. Josie—the way she was dressed she looked to me like a woman who was trying hard not to look like a woman, not unlike the feminists who marched for the Equal Rights Amendment when I was a kid. She was carrying a shotgun when she emerged from the passenger side. Together, she and Roy entered the supermarket.\u003c/p\u003e\n\u003cp\u003eThe sky suddenly seemed to grow dark and ominous to me, even though it remained bright blue with puffy white clouds to everyone else. I rested my head against the top of the steering wheel.\u003c/p\u003e\n\u003cp\u003e“Well, this is an unfortunate turn of events,” I said.\u003c/p\u003e\n\u003cp\u003e“If everything is going according to plan, Jimmy has his gun on the store manager and is forcing him to open the safe.”\u003c/p\u003e\n\u003cp\u003e“Which is empty, now.”\u003c/p\u003e\n\u003cp\u003e“Roy is guarding the door while Josie moves from cash register to cash register, forcing the cashiers to empty their drawers into a grocery bag.”\u003c/p\u003e\n\u003cp\u003eI rotated in my seat and gazed out the window toward the Silver Bay Police Department. I saw no movement, but that didn’t mean anything. More likely the department’s patrol cars had all received the 911 by now and were converging on this very spot with the greatest possible dispatch. I started the Cherokee just in case.\u003c/p\u003e\n\u003cp\u003eSeconds seemed like minutes, and minutes—it felt like I was sitting through Avatar again. I listened intently, for what I wasn’t sure. Terrified screams, I suppose. Gunfire.\u003c/p\u003e\n\u003cp\u003e“Here they come.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-27.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
