{"id":103605,"no":43,"title":"Page 43","content":"\u003cp\u003e“How did she and Jimmy—”\u003c/p\u003e\n\u003cp\u003e“How did they meet? They met in a strip club, of course. Jimmy saw her and…” She paused and shook her head as if the words necessary to finish the sentence were too dismal to speak. “That’s not even the half of it. Claire got pregnant and told Jimmy he was the father. Jimmy agreed to marry her. The family demanded that she take a paternity test. Turned out the child wasn’t Jimmy’s. He insists on marrying her anyway. Actually put money down on a townhouse. I begged him not to. He did it anyway. He’s already underwater and they haven’t even closed yet.”\u003c/p\u003e\n\u003cp\u003e“Who’s Brian?”\u003c/p\u003e\n\u003cp\u003e“Brian T. Fenelon. Her manager, boyfriend, pimp, I don’t know what, except that he’s a creep. Why?”\u003c/p\u003e\n\u003cp\u003e“I think he’s headed this way.”\u003c/p\u003e\n\u003cp\u003eJosie turned in her stool to see a short man with thin hair wearing a rumpled sports jacket over a colored T-shirt as if he were channeling Miami Vice reruns. He moved toward us with the swagger of an athlete who had let himself go, who believed he could still play the game despite the fat that settled around his middle. Claire was a head taller than he was, yet she draped herself on his arm in a way that made me regard her planned marriage to Jimmy as wishful thinking on his part.\u003c/p\u003e\n\u003cp\u003e“You Dyson?” he asked. His voice reminded me of the high-pitched yap of a fox terrier. “I thought you’d be taller.”\u003c/p\u003e\n\u003cp\u003e“How the hell does everyone know I’m here?”\u003c/p\u003e\n\u003cp\u003e“Shhhh,” Josie said.\u003c/p\u003e\n\u003cp\u003eI glared at her. “Why? Someone’s maiden aunt in International Falls hasn’t heard yet?”\u003c/p\u003e\n\u003cp\u003e“Whoa, big fella,” Fenelon said.\u003c/p\u003e\n\u003cp\u003eHe rested his hand on my shoulder. I didn’t know if it was meant to be friendly or intimidating. I jerked my shoulder free and gave him my best “don’t touch” scowl just the same. He swiveled his head and decided that too many people were watching.\u003c/p\u003e\n\u003cp\u003e“Let’s grab a booth.”\u003c/p\u003e\n\u003cp\u003eWe sat, Claire and he on one side of the wooden booth, Josie and I on the other. I finished my Sam Adams and set the empty bottle on the table in front of me. Fenelon spit on his hands and rubbed them together before leaning forward across the table.\u003c/p\u003e\n\u003cp\u003e“I don’t want to waste your time,” he said.\u003c/p\u003e\n\u003cp\u003e“I appreciate that,” I told him.\u003c/p\u003e\n\u003cp\u003e“I know what you’re planning. I want in.”\u003c/p\u003e\n\u003cp\u003e“Sorry, I don’t know what you’re talking about.”\u003c/p\u003e\n\u003cp\u003e“Don’t be like that. I can help you.”\u003c/p\u003e\n\u003cp\u003e“Help me what?”\u003c/p\u003e\n\u003cp\u003eFenelon leaned in closer and whispered. “Help you rob an armored truck.”\u003c/p\u003e\n\u003cp\u003eI glared at Josie again. “We need another meeting,” I told her.\u003c/p\u003e\n\u003cp\u003e“I know everybody in the county,” Fenelon added. “Everybody. I can be a big help to you.” He glanced around to see if anyone was listening before whispering some more. “You and me, we could run this town.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that what the Emperor told Darth Vader before they started building the Death Star?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Sorry, I’ve had Star Wars on the brain lately. Listen. Brian, your name’s Brian? I don’t know what you’ve heard—”\u003c/p\u003e\n\u003cp\u003e“Jimmy told us everything, and I’m telling you, whatever you need, I can get it for you.”\u003c/p\u003e\n\u003cp\u003e“Whatever Jimmy told you, it’s just talk. It doesn’t amount to anything.”\u003c/p\u003e\n\u003cp\u003e“Then why are you still in town where anyone who knows your name could drop a dime on you?”\u003c/p\u003e\n\u003cp\u003e“That sounds like a threat.” I turned to Josie. “Does that sound like a threat to you?” I turned back to Fenelon. “Did you really mean to threaten me, Brian?”\u003c/p\u003e\n\u003cp\u003e“No, no, no, of course not. I’m just saying, I can help you—or I can hurt you.”\u003c/p\u003e\n\u003cp\u003e“Ahh, you can hurt me. As long as we have that settled.”\u003c/p\u003e\n\u003cp\u003e“Brian,” Josie said. She didn’t have the chance to finish her thought before Fenelon cut her off.\u003c/p\u003e\n\u003cp\u003e“Shut the fuck up, bitch,” he said. “No one is talking to you.”\u003c/p\u003e\n\u003cp\u003eI picked up the beer bottle by the neck and smacked Fenelon on his balding head. I hit him hard. Not hard enough to kill him, just hard enough to demonstrate my displeasure—the bottle didn’t even shatter. There was a satisfying thud against his skull that sounded like a rock landing in soft dirt, and Fenelon jerked back against the wall of the booth before slipping out onto the floor. His falling out of the booth was what caused people to stare. I carefully set the bottle back on the table. Josie’s eyes widened as if she had just discovered that one of the Seven Wonders of the Ancient World was parked in her front yard.\u003c/p\u003e\n\u003cp\u003e“He was harshing my mellow,” I said in my defense. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-43.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
