{"id":103610,"no":48,"title":"Page 48","content":"\u003cp\u003e“Oh no,” the man said. “Oh no.”\u003c/p\u003e\n\u003cp\u003eIt was the first time I got a good look at him. It was the bartender I had met at Buckman’s roadhouse the night before. Skarda came close and shouted a few obscenities at the bartender. I thought he might kick him a few times while he was down, but he didn’t.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” the bartender said.\u003c/p\u003e\n\u003cp\u003e“Yes, you are,” I said.\u003c/p\u003e\n\u003cp\u003e“He was going to turn me in,” Skarda said. “He was watching the place hoping I’d show up so he could turn me in.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I gathered that. I don’t know why, though.”\u003c/p\u003e\n\u003cp\u003e“For the reward.”\u003c/p\u003e\n\u003cp\u003e“There is no reward, Dave. The Minnesota Department of Corrections has over two hundred and seventy fugitives in the wind, and they haven’t offered a reward for any of them. The only people who offer rewards are bail bondsmen looking to protect their investment. Have you posted bond?”\u003c/p\u003e\n\u003cp\u003e“I never got the chance.”\u003c/p\u003e\n\u003cp\u003e“So there is no reward.”\u003c/p\u003e\n\u003cp\u003eI tossed the lighter in the bartender’s lap so he’d know what a putz he’d been.\u003c/p\u003e\n\u003cp\u003e“Oh no,” he said.\u003c/p\u003e\n\u003cp\u003e“Turning on your own people for money—tsk, tsk, tsk. What would Josie say?”\u003c/p\u003e\n\u003cp\u003e“I was hoping she’d never know it was me.”\u003c/p\u003e\n\u003cp\u003eI checked the SIG. It was loaded, all right. I parked in the chair next to the bartender. He looked at me, the gun, then back at me again.\u003c/p\u003e\n\u003cp\u003e“What are we going to do with him?” Skarda asked.\u003c/p\u003e\n\u003cp\u003e“Shoot him and bury his body in the woods behind your house,” I said.\u003c/p\u003e\n\u003cp\u003e“No.” Skarda and the bartender spoke the word in unison.\u003c/p\u003e\n\u003cp\u003e“Are you sure, Dave? I know why this guy doesn’t like the idea…”\u003c/p\u003e\n\u003cp\u003e“No,” Skarda repeated.\u003c/p\u003e\n\u003cp\u003eI turned to the bartender. “Listen—what’s your name, anyway?”\u003c/p\u003e\n\u003cp\u003e“Scott,” the bartender said.\u003c/p\u003e\n\u003cp\u003e“Listen, Scott—how much money do you need?”\u003c/p\u003e\n\u003cp\u003e“Only five thousand dollars…”\u003c/p\u003e\n\u003cp\u003e“Only five thousand dollars,” Skarda repeated.\u003c/p\u003e\n\u003cp\u003e“It’s the tourist season, and I always do well. I just need some money to tide me over, to pay my suppliers. I’m COD with some of ’em. Five thousand and I’ll be good.”\u003c/p\u003e\n\u003cp\u003e“All right. I’ll pay you the money, but you’re going to earn it.”\u003c/p\u003e\n\u003cp\u003eScott gazed into Skarda’s eyes for a few beats. They both seemed confused.\u003c/p\u003e\n\u003cp\u003e“What do I need to do?” the bartender asked.\u003c/p\u003e\n\u003cp\u003e“Whatever I tell you, when I tell you. You can start by getting some Summit Ale in that dive you own. I’ll be in later tonight.”\u003c/p\u003e\n\u003cp\u003e“When—when will I get the money?”\u003c/p\u003e\n\u003cp\u003e“When the job is over.”\u003c/p\u003e\n\u003cp\u003e“What job?”\u003c/p\u003e\n\u003cp\u003e“The other thing you can do is keep your ears open. I want to know the gossip. I want to know what people are talking about, especially Brian Fenelon and what’s-her-name, Claire de Lune.”\u003c/p\u003e\n\u003cp\u003e“You’re not going to tell me what the job is?”\u003c/p\u003e\n\u003cp\u003e“I could, Scott, but then I really would have to kill you.”\u003c/p\u003e\n\u003cp\u003eFrom his expression, he didn’t like that idea at all. He kept looking at Skarda as if he expected Dave to help him. As usual, Skarda just looked confused.\u003c/p\u003e\n\u003cp\u003eI stood and offered the bartender my hand. He took it and I helped him up. “See you later,” I said.\u003c/p\u003e\n\u003cp\u003eHe watched my eyes for a second. “When I leave—when I leave,” the bartender said, “you’re going to shoot me in the back.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry. If I shoot you, you’ll see it coming. Now get out of here. And don’t forget; when I call, you had better do exactly what I say. Okay?”\u003c/p\u003e\n\u003cp\u003eHe nodded, then looked over at Skarda. “Sorry, Dave,” he said. The bartender started for the door, then stopped and turned around. “Please don’t tell Josie.”\u003c/p\u003e\n\u003cp\u003e“I’ll think about it,” I said.\u003c/p\u003e\n\u003cp\u003e“Can I have my gun back?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eThe bartender left the house in a hurry.\u003c/p\u003e\n\u003cp\u003e“Why did you let him go?” Skarda asked.\u003c/p\u003e\n\u003cp\u003e“Because you didn’t want to shoot him. What else were we going to do? Chain him to a post in your basement? Besides, there’s an old saying—keep your friends close and your enemies closer.”\u003c/p\u003e\n\u003cp\u003e“Who said that?”\u003c/p\u003e\n\u003cp\u003e“Al Pacino in Godfather Part II.”\u003c/p\u003e\n\u003cp\u003eWe returned to the cabin on Lake Carl about a half hour later. The old man was asleep on one of the sofas, and we tried not to wake him. I had rarely seen a man go through a day so quickly—it wasn’t even one in the afternoon yet. There was a stack of old paperbacks on the floor next to him and I sorted through them. They were all romance novels written by authors I had never heard of—Helen Carter, Violet Winspear, Catherine Coulter, Heidi Strasser, Roumelia Lane …\u003c/p\u003e\n\u003cp\u003e“The old man reads these?” I asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-48.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
