{"id":103569,"no":6,"title":"Page 6","content":"\u003cp\u003e“Upset that you took him the way you did. I explained that we couldn’t let him in on the scam for fear that he might give it away, but that we would tell his boss he agreed to cooperate with us so he won’t be embarrassed.”\u003c/p\u003e\n\u003cp\u003eI took Chad’s wallet and stood up so Skarda could see me rifling through it. I pulled cash out and tossed the wallet away.\u003c/p\u003e\n\u003cp\u003e“Lousy hundred and eighty-seven bucks,” I said. “What a schmuck.”\u003c/p\u003e\n\u003cp\u003eSkarda was watching me closely, looking as if he wanted to run away very fast. I bent down again, and he moved to the door of the SUV, slid behind the wheel, and reached for the ignition. I stood up again, this time dangling Chad’s car keys from a ring around my pinky.\u003c/p\u003e\n\u003cp\u003e“Hey, Dave?” I said. “Going somewhere?”\u003c/p\u003e\n\u003cp\u003e“I was just—I was getting ready. We should leave.”\u003c/p\u003e\n\u003cp\u003e“Yes, we should.”\u003c/p\u003e\n\u003cp\u003eI glanced down at Chad, and he winked at me. I climbed out of the ditch, crossed the gravel road, and moved to the Explorer.\u003c/p\u003e\n\u003cp\u003e“I’ll drive,” I said.\u003c/p\u003e\n\u003cp\u003eSkarda scrambled out of the SUV and went around to the passenger side. When he was safely inside, I told him to lock the loose cuff around the handle above the window.\u003c/p\u003e\n\u003cp\u003e“Why?” he asked.\u003c/p\u003e\n\u003cp\u003e“Good handcuffs make good neighbors.”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“One of Robert Frost’s lesser-known works. Do it.”\u003c/p\u003e\n\u003cp\u003eHe did.\u003c/p\u003e\n\u003cp\u003eI fired up the Explorer, put it into gear, and headed down the road.\u003c/p\u003e\n\u003cp\u003e“Where are we going?” Skarda asked.\u003c/p\u003e\n\u003cp\u003e“To see a girl,” I said.\u003c/p\u003e\n\u003cp\u003eTWO\u003c/p\u003e\n\u003cp\u003eThe girl lived in White Bear Lake, not far from the former church that now housed the Lakeshore Players Community Theater. The city used to be a popular haven for the well-to-do who would travel twenty miles by train from St. Paul to vacation on the scenic lake that gave it its name. F. Scott Fitzgerald wrote about it; James J. Hill stayed there, and so did Pretty Boy Floyd and Ma Barker. Eventually the rich went elsewhere. Apparently they didn’t care to rub shoulders with the many middle-class citizens who moved to White Bear Lake once the roads improved and car ownership became common. To reach it, we made our way down to Sandstone and crossed I-35 again, this time going from east to west. From there I drove south. Skarda wondered why we didn’t take 35. I preferred to drive the succession of county roads that followed the original route of U.S. Highway 61, the legendary roadway that was made more or less obsolete between Duluth and St. Paul when I-35 was built. It was so much classier, although I didn’t tell him that. Instead, I told him it was safer.\u003c/p\u003e\n\u003cp\u003e“The Minnesota Highway Patrol might be monitoring the traffic on 35,” I said.\u003c/p\u003e\n\u003cp\u003eIt wasn’t the only question Skarda asked. The man seemed incapable of being quiet for more than a few minutes at a time. He wanted to know what I had been busted for, why I was being transferred to Grand Rapids, if I had done time, where I was from, and so on and so on. I refused to answer. Nor did I ask any question of him, which was part of the plan. Still, when he wondered if the girl we were going to visit was the blonde who drove the red Honda Accord, I told him, “Actually, she’s a brunette, only there’s no disguising those legs, know what I mean?”\u003c/p\u003e\n\u003cp\u003eSkarda said he did, yet I suspected he was only being polite because a moment later he asked if “the girl” was “my girl,” the same one Chad had slept with. I told him it was.\u003c/p\u003e\n\u003cp\u003e“Are you going to kill her?”\u003c/p\u003e\n\u003cp\u003e“What the hell, Dave,” I said. “Do I look like a homicidal maniac to you?”\u003c/p\u003e\n\u003cp\u003eHe assured me that I didn’t, and I thanked him. Just the same, by the time we reached the White Bear Lake city limits, I was humming “Delia’s Gone,” one of the last great songs recorded by Johnny Cash before he passed—the one where he claims if he hadn’t shot poor Delia he’d have had her for his wife. If Skarda hadn’t been cuffed to the handle above the door, I have no doubt that he would have jumped out of the car at the first stoplight.\u003c/p\u003e\n\u003cp\u003eWe drove through what amounted to downtown White Bear Lake, reaching Stewart Avenue and driving south some more. I told Skarda what to look for—a white Colonial with an old-fashioned porch on the left side of the street. As we passed it, I said, “Sonuvabitch,” and tightly gripped the steering wheel.\u003c/p\u003e\n\u003cp\u003e“What?” Skarda asked.\u003c/p\u003e\n\u003cp\u003e“Cops.”\u003c/p\u003e\n\u003cp\u003e“Where? I didn’t see anything?”\u003c/p\u003e\n\u003cp\u003e“That’s because you were looking at the house when you should have been looking at the street.”\u003c/p\u003e\n\u003cp\u003eSkarda turned in his seat and looked behind us.\u003c/p\u003e\n\u003cp\u003e“Don’t,” I said, and then, “Too late.”\u003c/p\u003e\n\u003cp\u003eI stomped on the accelerator. The Ford Explorer surged forward. I pushed it up to fifty and took a hard left down a residential street. I did it the way they do in Hollywood movies and on TV—badly. I accelerated into the turn and braked to keep from losing control, which caused the back end of the Explorer to slide sideways and fishtail as I accelerated again. It was terribly inefficient but looked cool—that’s why they do it in the movies—and gave Skarda the impression of desperate flight. I blasted through a right-hand turn and then another left, actually making the tires squeal. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-6.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
