{"id":103623,"no":63,"title":"Page 63","content":"\u003cp\u003eTo find out, we carefully followed the road—without actually stepping on it—to the banks of what I thought was a river. Roy explained my mistake.\u003c/p\u003e\n\u003cp\u003e“More like a creek,” he said. “I don’t even think it has a name. It winds down from Lake Vermilion.”\u003c/p\u003e\n\u003cp\u003eIt was about twenty feet wide.\u003c/p\u003e\n\u003cp\u003e“How deep is it?” I asked.\u003c/p\u003e\n\u003cp\u003eRoy didn’t know, so I walked into it. The creek was knee-deep near the bank and sloped until it came to my waist at the center; the water saturated the hem of the dark blue Minnesota Timberwolves sweatshirt I had borrowed from Dave Skarda. I cursed silently when I realized I had forgotten the cell phone in my pocket. Unfortunately, there was nothing I could do about it without Roy seeing. I followed the creek toward Lake Vermilion. There were no obstructions that I could find. I stood at the mouth of the creek where it opened onto Pike Bay. Beyond the bay, the forty-mile-long lake with its 365 islands beckoned.\u003c/p\u003e\n\u003cp\u003e“What do you see?” Roy asked.\u003c/p\u003e\n\u003cp\u003e“A lot of places to hide.”\u003c/p\u003e\n\u003cp\u003eHe didn’t know what I was talking about, and I didn’t elaborate, mostly because I wasn’t sure I knew what I was talking about, either. We made our way back to the remote vault, eventually returning to the perch where we had hidden earlier. The sun was warm; however, the shadows of the trees kept my jeans and shoes from drying. I was as uncomfortable as hell yet said nothing for fear Roy would make fun of me. My biggest concern was for the cell phone.\u003c/p\u003e\n\u003cp\u003eMost of the employees were back in place by 6:00 P.M. At 6:25, the first armored truck returned from its rounds, joined by the second truck ten minutes later. They both departed, one after another, at about 7:00 P.M. We waited until the third truck arrived at 7:20 P.M. It lingered almost forty-five minutes before leaving. I put all that in my notebook, too. A few minutes later, the place was deserted. The sun set at 9:03 by my watch. We waited until 9:30 before leaving. It was while I was lying on the ground in the forest waiting for night to fall that my inner voice began talking to me, as it often did.\u003c/p\u003e\n\u003cp\u003eYou’re out of your mind, it told me. Do you seriously think you could pull this off?\u003c/p\u003e\n\u003cp\u003eOf course not, I told myself. Robbing a bank—that would be wrong. On the other hand …\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003eNothing. Forget it.\u003c/p\u003e\n\u003cp\u003eSpit it out.\u003c/p\u003e\n\u003cp\u003eI know how it could be done.\u003c/p\u003e\n\u003cp\u003eYou’re certifiable.\u003c/p\u003e\n\u003cp\u003eA short time later, Roy led me through the woods until we reached his car, parked discreetly off Glenmare Drive. It wasn’t until we were safely in the car and making our way toward Tower that he asked, “How the hell are we going to get in there?”\u003c/p\u003e\n\u003cp\u003e“Getting in isn’t the problem,” I told him. “It’s getting out that worries me.”\u003c/p\u003e\n\u003cp\u003eWe passed through Tower and quickly approached Ely. The Chocolate Moose wasn’t far from the intersection where we turned south toward Krueger, and I told Roy to stop.\u003c/p\u003e\n\u003cp\u003e“What for?”\u003c/p\u003e\n\u003cp\u003e“So I can use the restroom and you can buy your wife a strawberry-rhubarb pie.”\u003c/p\u003e\n\u003cp\u003eHe thought that was a helluva good idea. “Jill’s still a little miffed at me,” he said.\u003c/p\u003e\n\u003cp\u003e“Can’t say I blame her.”\u003c/p\u003e\n\u003cp\u003eWe parked on Sheridan Street. The Chocolate Moose was inside a building made to look like a lakeside cabin and was surrounded on two sides by a wide porch. We climbed the wooden stairs and went inside. Roy stepped up to the counter to place his order. I was directed to the restroom the restaurant shared with Piragis Northwoods Company, a camping outfitter. I locked myself inside the restroom and removed the top of the toilet tank. A sealed plastic bag was taped to the bottom of the cover. It contained $2,500 in cash. Next, I checked the cell phone and sighed audibly in relief when I discovered that it still worked. I took the cell and the bag and stashed both in my pocket. After finishing my business—my pants were still damp and my legs were chilled—I returned to the Chocolate Moose. Roy was waiting for me. The pie was in a box that he held with both hands.\u003c/p\u003e\n\u003cp\u003e“Now where?” he asked.\u003c/p\u003e\n\u003cp\u003e“Let’s stop at Buckman’s Roadhouse for a quick beer before heading back to the cabin.”\u003c/p\u003e\n\u003cp\u003eRoy liked that idea, too.\u003c/p\u003e\n\u003cp\u003eIt was 10:40 P.M. when we arrived, and Buckman’s was surprisingly busy—at least I was surprised, given what the bartender told me about his business earlier. We sat at the bar and ordered Sam Adams because the bartender still hadn’t laid in a supply of Summit Ale. Halfway through the beer, Roy excused himself as I had hoped he would, and I waved the bartender over. He asked me what I wanted, and I answered by slipping him the plastic bag filled with cash as unobtrusively as I could. His eyes bulged a little in his head.\u003c/p\u003e\n\u003cp\u003e“What’s this?” he asked.\u003c/p\u003e\n\u003cp\u003e“Half of what I promised. You’ll get the rest later.”\u003c/p\u003e\n\u003cp\u003eHe pushed the money down deep into his pocket and produced a couple of fresh beers. “On the house,” he said.\u003c/p\u003e\n\u003cp\u003e“Anything going on I should know about?”\u003c/p\u003e\n\u003cp\u003e“I haven’t heard anything,” the bartender said. “Fenelon was in earlier. He waited until Brand arrived, and then they left together. Brand might have had someone else with him, only I can’t be sure. That was a couple hours ago.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-63.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
