{"id":103629,"no":69,"title":"Page 69","content":"\u003cp\u003e“Yeah, you do that.”\u003c/p\u003e\n\u003cp\u003eJosie stood and started pulling off her scoop-neck shirt to reveal a bikini top. I averted my eyes but not before I noticed that her face wasn’t the only place that had freckles. All the while my inner voice chanted, She plays ball in a different league, she plays ball in a different league …\u003c/p\u003e\n\u003cp\u003eForty-five minutes later I was clean, shaved, and dressed. Josie was sitting at the kitchen table. Her hair was damp and clung to her neck and shoulders; her bottom was wrapped in a beach towel, but her top was exposed. Again I tried not to stare. She took a sip from her coffee mug.\u003c/p\u003e\n\u003cp\u003e“How do you make such good coffee?” she asked. “You use the same ingredients I do, yet your coffee tastes so much better than mine.”\u003c/p\u003e\n\u003cp\u003e“It’s a gift,” I said. I filled my own mug and joined her at the table. “I’m awake, I’m dressed, my gun’s in the bedroom—what worries you, JoEllen?”\u003c/p\u003e\n\u003cp\u003e“John Brand worries me.”\u003c/p\u003e\n\u003cp\u003e“As well he should.”\u003c/p\u003e\n\u003cp\u003e“You don’t trust him, do you?”\u003c/p\u003e\n\u003cp\u003e“About as far as I could throw this cabin.”\u003c/p\u003e\n\u003cp\u003e“Are you really going to give him a million dollars.”\u003c/p\u003e\n\u003cp\u003e“I didn’t promise him a million dollars. I promised him a third of the take. I expect it to be closer to half a million.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“No need to tell him that, though, is there?”\u003c/p\u003e\n\u003cp\u003e“No. No, I guess not. What if…”\u003c/p\u003e\n\u003cp\u003e“He tries to rip us off?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it. I have it covered.”\u003c/p\u003e\n\u003cp\u003e“Something else.”\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003e“The sheriff deputies—Dyson, how did they know where we would be when they pulled us over the other day? You don’t think it was a coincidence, do you?”\u003c/p\u003e\n\u003cp\u003e“I don’t believe in coincidences. On the other hand, they do happen. They happen all the time.”\u003c/p\u003e\n\u003cp\u003e“What does that mean?”\u003c/p\u003e\n\u003cp\u003e“Don’t be paranoid.”\u003c/p\u003e\n\u003cp\u003e“There’s a spy, Dyson. Someone in my family. Or Claire—I don’t think of her as a member of the family. Someone, anyway, someone who was in the cabin when we left. Someone who—”\u003c/p\u003e\n\u003cp\u003e“That’s what I mean by paranoid.”\u003c/p\u003e\n\u003cp\u003e“Are you saying it’s not true?”\u003c/p\u003e\n\u003cp\u003e“Sweetie, even the bartender at Buckman’s knows I’m here. You don’t think the deputies knew? They probably were on the lookout for me, waiting for a chance to have a private conversation.” I quoted the word “private” with my fingers. “If they rousted me in front of witnesses, they’d have to bring me in, and they didn’t want to do that. Too much paperwork. They saw us on the road, and there you go. Simple.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003eHell no, my inner voice said. I wasn’t sure—nowhere close to it. The very last thing I needed, though, was for the Iron Range Bandits to start pointing fingers at each other. When the time came, I would do all the pointing that was necessary.\u003c/p\u003e\n\u003cp\u003e“Yes, I am,” I said aloud.\u003c/p\u003e\n\u003cp\u003eShe stared at her coffee mug for a few beats. “Don’t call me sweetie,” she said.\u003c/p\u003e\n\u003cp\u003e“My mistake.”\u003c/p\u003e\n\u003cp\u003e“I like that you call me JoEllen, though.”\u003c/p\u003e\n\u003cp\u003e“So you said.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t—you should be careful about calling me that when other people are around.”\u003c/p\u003e\n\u003cp\u003e“Why, if you like it?”\u003c/p\u003e\n\u003cp\u003e“That’s what my ex-fiancé sometimes called me, and people might get the wrong impression.”\u003c/p\u003e\n\u003cp\u003e“Are you afraid they might think that you and I are … Wait a minute. Ex-fiancé?” I saw it then, the look in her eyes. It was like when you catch someone watching you at a party and they quickly look away, pretending that they weren’t watching at all. “You lied to me. You’re not gay. Or even bi, for that matter. Are you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“What the hell?”\u003c/p\u003e\n\u003cp\u003e“You were getting all anxious and concerned and, I don’t know, guyish.”\u003c/p\u003e\n\u003cp\u003e“Guyish?”\u003c/p\u003e\n\u003cp\u003e“You know what I mean, the way guys behave when they’re around women.”\u003c/p\u003e\n\u003cp\u003e“Oh, for God’s sake.”\u003c/p\u003e\n\u003cp\u003e“Admit it, you were being guyish.”\u003c/p\u003e\n\u003cp\u003e“I don’t admit it, and even if I was—so?”\u003c/p\u003e\n\u003cp\u003e“I thought it would be best if I took it off the table, given the stakes and everything.”\u003c/p\u003e\n\u003cp\u003e“Tell me—given the stakes and everything, why are you putting it back on the table now?” She didn’t answer the question, so I did. “You’re the one behaving guyish, girlish, whatever, not me.”\u003c/p\u003e\n\u003cp\u003e“Am I?”\u003c/p\u003e\n\u003cp\u003e“Put your shirt back on.”\u003c/p\u003e\n\u003cp\u003eShe glanced down at her chest and back up at me. “Why?”\u003c/p\u003e\n\u003cp\u003e“You know damn well why.”\u003c/p\u003e\n\u003cp\u003e“Explain it to me.”\u003c/p\u003e\n\u003cp\u003e“No. No. This is not happening. This cannot happen. Remember what I told you before? Double it.”\u003c/p\u003e\n\u003cp\u003e“You mean about wanting a slice of Dyson pie?”\u003c/p\u003e\n\u003cp\u003eI was standing next to the door of the cabin with no idea how I had gotten there. “Stop it,” I said. “C’mon, now.”\u003c/p\u003e\n\u003cp\u003e“I like you, Dyson. It’s as simple as that. Do you like me?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“For a macho professional thief, you sure are a terrible liar.”\u003c/p\u003e\n\u003cp\u003e“JoEllen…”\u003c/p\u003e\n\u003cp\u003eShe smiled at the sound of her own name. “Nick,” she said. “We’re both adults.”\u003c/p\u003e\n\u003cp\u003e“Who says?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-69.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
