{"id":103632,"no":72,"title":"Page 72","content":"\u003cp\u003e“?Qué pasa?” he asked.\u003c/p\u003e\n\u003cp\u003e“Perdone que lo interrumpa.”\u003c/p\u003e\n\u003cp\u003e“?Qué quieres? Los bailes no comienzan hasta las cuatro.” In case I didn’t get it, the bartender gestured at a table tent on the bar that announced that the dances began at 4 P.M.\u003c/p\u003e\n\u003cp\u003e“Estoy buscando a Brian Fenelon,” I told him.\u003c/p\u003e\n\u003cp\u003eHe pointed toward a booth next to an open doorway. The neon sign above the door flashed VIP ROOM.\u003c/p\u003e\n\u003cp\u003e“Gracias,” I said.\u003c/p\u003e\n\u003cp\u003e“Fenelon speaks lousy Spanish,” the bartender said.\u003c/p\u003e\n\u003cp\u003e“I’ll talk slowly, then.”\u003c/p\u003e\n\u003cp\u003eFenelon sat in the center of the booth. There were two empty shot glasses in front of him and a half-filled beer mug. He held a third shot glass filled with bourbon between his fingers and turned it slowly, expanding a circle of condensation on the tabletop.\u003c/p\u003e\n\u003cp\u003e“Hi, Brian,” I said.\u003c/p\u003e\n\u003cp\u003eHe looked up at me. I could see the cut lip and the bruised chin even in the joint’s dim light.\u003c/p\u003e\n\u003cp\u003e“What do you want?” he asked.\u003c/p\u003e\n\u003cp\u003e“Looks like you had a long night.”\u003c/p\u003e\n\u003cp\u003e“Fuck you.”\u003c/p\u003e\n\u003cp\u003eI sat down without being asked. “I’m guessing you and your boss had a falling-out.”\u003c/p\u003e\n\u003cp\u003e“Why couldn’t you keep your big mouth shut? Why did you have to tell him what I said?”\u003c/p\u003e\n\u003cp\u003e“So he wouldn’t think I was conspiring with you to screw him over.”\u003c/p\u003e\n\u003cp\u003eFenelon brought the shot glass to his lips but did not drink. Instead, he set the glass back on the table and fixed my eyes with his. “What the hell is that supposed to mean?” he asked.\u003c/p\u003e\n\u003cp\u003e“Let me tell you what’s going to happen. After I risk life and limb to rob three armored trucks, Brand is going to rip me off. He’ll give me the guns as promised. When it comes time to divvy up the swag, though, he’s going to take it all for himself. Then he’ll have Deputies James and Williams arrest Dave Skarda and me on fugitive warrants so he won’t have to worry about retaliation. As far as Jimmy and Josie and the rest are concerned, there won’t be a helluva lot they’ll be able to do about it, will there?”\u003c/p\u003e\n\u003cp\u003e“I don’t know why you don’t just get the fuck outta here. Go up to Canada like you said.”\u003c/p\u003e\n\u003cp\u003e“Good question. I have one for you. Do you like it here, Brian?”\u003c/p\u003e\n\u003cp\u003e“Whaddaya mean?”\u003c/p\u003e\n\u003cp\u003e“Do you like it here? Up here in the frickin’ nowhere northland. Would you rather be in the Cities? Chicago? New York? Would you like to take Claire somewhere nice? Get her away from that nitwit Jimmy?”\u003c/p\u003e\n\u003cp\u003e“She loves him.”\u003c/p\u003e\n\u003cp\u003e“Seriously?”\u003c/p\u003e\n\u003cp\u003e“You sound surprised.”\u003c/p\u003e\n\u003cp\u003e“I am surprised. I thought—”\u003c/p\u003e\n\u003cp\u003e“You thought she was my girl like everyone else. Well, she’s not and she never was.”\u003c/p\u003e\n\u003cp\u003e“You sound unhappy about that.” The hard glare in his eyes told me he was very unhappy about that. “I know what he sees in her. What does she see in him?”\u003c/p\u003e\n\u003cp\u003e“Who knows?” Fenelon said. “Her own lost youth, maybe. Stability for her kid. How the hell should I know?”\u003c/p\u003e\n\u003cp\u003eI shrugged at that because I didn’t know what else to do.\u003c/p\u003e\n\u003cp\u003e“Why are you here, Dyson?”\u003c/p\u003e\n\u003cp\u003e“I want nothing to do with John Brand. You’re the one who brought him in on this. By the way, you shouldn’t have done that. When I whacked you, remember, I said I needed someone who knew his way around. I meant you, not him.”\u003c/p\u003e\n\u003cp\u003e“You got it wrong, Dyson. I didn’t tell Brand anything. If I had told him”—he tilted his face to give me a good look at it in the dim light—“do you think he would have done this? Brand’s the one brought me to the cabin, not the other way ’round. He didn’t know we talked, that we were working together, until you told him last night.”\u003c/p\u003e\n\u003cp\u003e“Dammit. I thought…”\u003c/p\u003e\n\u003cp\u003e“You thought I ratted you out.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Well, I didn’t. Now I’m paying the price for it. Way to go, Dyson. Doubt Brand will ever trust me again.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Fine, you’re sorry. That means a whole helluva lot.”\u003c/p\u003e\n\u003cp\u003eFenelon closed his eyes and rested his head against the back of the booth. He looked utterly defeated. I called his name, and his eyes snapped open again.\u003c/p\u003e\n\u003cp\u003e“That’s another reason to get out of Dodge,” I said.\u003c/p\u003e\n\u003cp\u003e“What are you talking about, Dyson?”\u003c/p\u003e\n\u003cp\u003e“How much of the money is Brand going to give you? James and Williams will get a nice taste. What about you?”\u003c/p\u003e\n\u003cp\u003e“I doubt I’ll get anything.”\u003c/p\u003e\n\u003cp\u003e“A quarter of a million dollars, Brian. How far do you think you can go on a quarter of a million dollars?”\u003c/p\u003e\n\u003cp\u003eBrand had not been impressed when I dropped that number on the table the night before. Fenelon clearly was.\u003c/p\u003e\n\u003cp\u003e“You’re gonna give me two hundred and fifty thousand dollars?”\u003c/p\u003e\n\u003cp\u003e“Yes, I am.”\u003c/p\u003e\n\u003cp\u003e“What would I have to do?” Before I could answer, Fenelon held up his hand. “I won’t go up against Brand. I’m not that stupid.”\u003c/p\u003e\n\u003cp\u003e“No, I wouldn’t put you on the spot like that.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about, then? The Mexicans?”\u003c/p\u003e\n\u003cp\u003e“What the hell do I care about the Mexicans? I want James and Williams.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-72.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
