{"id":103637,"no":77,"title":"Page 77","content":"\u003cp\u003e“Why don’t you?”\u003c/p\u003e\n\u003cp\u003eStay in character, stay in character, my inner voice chanted.\u003c/p\u003e\n\u003cp\u003e“I have nowhere else to go,” I said aloud. “You do. Right now, this minute, you can go anywhere and do anything without a worry—”\u003c/p\u003e\n\u003cp\u003e“Except how to pay for it.”\u003c/p\u003e\n\u003cp\u003e“In a few days you won’t have that option.”\u003c/p\u003e\n\u003cp\u003e“Why are you telling me this?”\u003c/p\u003e\n\u003cp\u003e“Because you’re right. I like you. I don’t want you and your family to end up like me, hoping to make a big score so you’ll have money enough to hide on.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to hide. Once I get my share, I’m going to live.”\u003c/p\u003e\n\u003cp\u003eWell, you tried.\u003c/p\u003e\n\u003cp\u003e“Call your father,” I said. “Tell him we’re on our way back. Tell him that we’re going to stop at Buckman’s for a quick beer before we go home.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“So he doesn’t get bent out of shape like he did the last time I kept you out late.”\u003c/p\u003e\n\u003cp\u003eJosie fluttered her long eyelashes at me. “Are you going to keep me out late?” she asked.\u003c/p\u003e\n\u003cp\u003e“I liked you better when I thought you were gay.”\u003c/p\u003e\n\u003cp\u003eDespite the best efforts of daylight savings time to keep it at bay, night engulfed us long before we approached Buckman’s, which made the lightbar on the sheriff’s department cruiser all the more brilliant.\u003c/p\u003e\n\u003cp\u003eJosie saw the lights at the same moment I did. “What should I do?” she asked.\u003c/p\u003e\n\u003cp\u003e“Pull over slowly, put the car in park—they’ll see your taillights and know what you’re doing. Keep your hands on top of the steering wheel. No sudden movements. The cruiser has a high-powered spotlight, so the deputies can see everything. Don’t look directly into it. Don’t speak, not even when spoken to.”\u003c/p\u003e\n\u003cp\u003eJosie did what I told her. A moment later Deputies James and Williams approached exactly as they had before. Because of the spot, they were half bathed in light and half lost to darkness. James leaned against the car and looked through the open driver’s window. Williams was on the passenger side, looking back. They spoke to each other across the front seat of the car.\u003c/p\u003e\n\u003cp\u003e“Beautiful evening, isn’t it?” James said.\u003c/p\u003e\n\u003cp\u003e“Certainly is,” Williams said. “I’m surprised that the honey is driving, though. Kinda hard to have her head in your lap if she’s behind the wheel, ain’t it?”\u003c/p\u003e\n\u003cp\u003e“You kiss your mother with that mouth, Deputy?” I said.\u003c/p\u003e\n\u003cp\u003eWilliams didn’t like the remark. He abruptly pulled open the car door; the dome light flicked on, giving me a good look at the half of his angry face that wasn’t illuminated by the spotlight. I was wondering if he had his brass knuckles when James intervened.\u003c/p\u003e\n\u003cp\u003e“Personally, I didn’t have a mother,” he said. “We were too poor.”\u003c/p\u003e\n\u003cp\u003e“That’s sad,” Williams said.\u003c/p\u003e\n\u003cp\u003e“I might buy one, though, with my end of the heist. What about you?”\u003c/p\u003e\n\u003cp\u003eWilliams slammed the door shut. “Nah,” he said. “She’d just complain that I don’t call enough.”\u003c/p\u003e\n\u003cp\u003e“Mr. Brand wants to see you,” James said.\u003c/p\u003e\n\u003cp\u003e“I’m going to guess that you and he have come to some kind of arrangement,” I said.\u003c/p\u003e\n\u003cp\u003e“That’s right,” Williams said.\u003c/p\u003e\n\u003cp\u003e“Kinda sucks to be you, though, doesn’t it? I was going to give you half. What is Brand offering?”\u003c/p\u003e\n\u003cp\u003e“Not as much,” James said.\u003c/p\u003e\n\u003cp\u003e“Seems unfair.”\u003c/p\u003e\n\u003cp\u003e“Sometimes you have to make sacrifices. Go along to get along.”\u003c/p\u003e\n\u003cp\u003e“Brand gave us the greater-good speech, too.”\u003c/p\u003e\n\u003cp\u003e“We’re all striving for Sir Thomas More’s utopian society,” Williams said.\u003c/p\u003e\n\u003cp\u003eThe remark so surprised me that I damn near gave myself whiplash turning toward him.\u003c/p\u003e\n\u003cp\u003e“Deputy Williams,” I said. “You read. I’m impressed.”\u003c/p\u003e\n\u003cp\u003eWilliams actually smiled, but James’s laughter wiped it from his face.\u003c/p\u003e\n\u003cp\u003e“He got that offa Jeopardy!” James said.\u003c/p\u003e\n\u003cp\u003e“Nonetheless,” I said. “Where is Brand?”\u003c/p\u003e\n\u003cp\u003e“He’s waiting at Buckman’s,” Williams said.\u003c/p\u003e\n\u003cp\u003e“What a coincidence. We were just headed that way.”\u003c/p\u003e\n\u003cp\u003e“We know,” James said. “We just wanted to make sure you didn’t get lost.”\u003c/p\u003e\n\u003cp\u003e“We’ll be right behind you,” Williams said.\u003c/p\u003e\n\u003cp\u003e“That’s comforting,” I said.\u003c/p\u003e\n\u003cp\u003e“Think of us as guardian angels,” James said.\u003c/p\u003e\n\u003cp\u003e“Or cherubim, if you prefer,” Williams said.\u003c/p\u003e\n\u003cp\u003eJames stared at Williams across the front seat of the Taurus. “Now you’re just showing off,” he said.\u003c/p\u003e\n\u003cp\u003eWe waited until the deputies were back in their cruiser and the spotlight was extinguished before pulling off the shoulder and back onto the county blacktop. The deputies followed close behind. Josie spent more time watching them in the rearview mirror than the road in front of her. Her fingers grasped the steering wheel, and she was breathing hard through her nose.\u003c/p\u003e\n\u003cp\u003e“Do you have something to say?” I asked.\u003c/p\u003e\n\u003cp\u003e“What, I get to talk now?”\u003c/p\u003e\n\u003cp\u003e“Josie…”\u003c/p\u003e\n\u003cp\u003e“This is bullshit. No way the deputies are working with Brand for less than half. If they’re working with Brand, that means they plan to take all the money and split it between them.”\u003c/p\u003e\n\u003cp\u003e“I was wrong, what I said the other day. You just might have a future in this business after all.”\u003c/p\u003e\n\u003cp\u003e“Well?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-77.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
