{"id":103571,"no":8,"title":"Page 8","content":"\u003cp\u003e“Check the glove compartment, see if there’s something to write with.”\u003c/p\u003e\n\u003cp\u003eSkarda opened the glove compartment with one hand—the other was still cuffed to the handle above the door—and found a pencil and a small notebook. I took them, returned to the Cherokee, and carefully wrote down the vehicle identification number that I read off of the metal strip attached to the corner of the dashboard. When I returned to the Explorer, Skarda said, “Now what?”\u003c/p\u003e\n\u003cp\u003e“Watch and learn,” I said.\u003c/p\u003e\n\u003cp\u003eNot far from the Maplewood Mall was a community of new and used car dealerships. I found one that sold Jeep Cherokees and pulled into the lot. I left Skarda waiting in the Explorer while I walked inside. I went to the parts and service desk and told the mechanic that yet again I had locked my one and only key—along with my wallet containing my ID—inside my Jeep Cherokee. I asked if they could contact the manufacturer, give them the VIN, ask for the specs, and cut a duplicate key. They said that they could, that it would take half an hour. Fifty minutes and fifty dollars later, I walked out of the dealership with a new key. That’s the part I told a visibly relived Skarda when I returned to the Ford Explorer. The part I didn’t tell him was that the dealership had demanded proof of ownership before they cut the key, which I was able to supply with a call to the Minnesota Department of Driver and Vehicle Services because, well, I actually did own the Jeep Cherokee.\u003c/p\u003e\n\u003cp\u003eWe drove back to the mall, parked the Explorer, unlocked the Cherokee, slipped inside, and started the engine. Yes, I again locked Skarda’s handcuff around the door handle before we drove off. Despite that, Skarda was impressed.\u003c/p\u003e\n\u003cp\u003e“That was the slickest bit of car stealing I’ve ever heard of,” he said. “I didn’t know it was so easy.”\u003c/p\u003e\n\u003cp\u003e“Like most things worth doing, it requires audacity. In any case, it beats the hell out of pulling ignition wires and breaking steering column locks. And look, we have a full tank of gas. So, where are we going?”\u003c/p\u003e\n\u003cp\u003e“Why ask me?”\u003c/p\u003e\n\u003cp\u003e“Hey, pal. You’re Plan B, remember. I deliver you to your crew and your crew pays me fifty thousand dollars.”\u003c/p\u003e\n\u003cp\u003e“Yeah…”\u003c/p\u003e\n\u003cp\u003e“You’re not reneging on your part of the agreement, are you, Dave?”\u003c/p\u003e\n\u003cp\u003e“No, no, of course not. It’s just … fifty thousand dollars.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it,” I said. “I’ll settle for half; take it in cash. I’ll scoot up to Canada and lay low until things cool down a bit, give it maybe a couple months just to be on the safe side, then come back for my money.”\u003c/p\u003e\n\u003cp\u003e“Ummm.”\u003c/p\u003e\n\u003cp\u003e“You had better not be messing with me, Dave. We had a deal.”\u003c/p\u003e\n\u003cp\u003e“I’m not, I’m not messing with you, it’s just…”\u003c/p\u003e\n\u003cp\u003e“You might not know this about me, pal, but I have a volatile personality.”\u003c/p\u003e\n\u003cp\u003e“It’s just that I need to make a phone call first, that’s all.”\u003c/p\u003e\n\u003cp\u003e“Once we get out of the Cities we’ll find a pay phone,” I said. “Do they still have pay phones?”\u003c/p\u003e\n\u003cp\u003eThey did. We found one in the lobby of Tobies Restaurant and Bakery in Hinckley, about halfway between the Twin Cities and Duluth. Because of its location, Hinckley had been a popular tourist trap since World War II. Travelers traditionally stopped there for a pee break, to purchase petroleum by-products, stretch their legs, or grab a quick bite. Since ’48, Tobies had been the main beneficiary of this tradition, at least until the fast-food chains set up franchises across the street. It was crowded—it was always crowded. Admittedly, the food wasn’t all that memorable, the service was what you would expect in a tourist town, and the congestion was exasperating at best. On the other hand, Tobies bakery served astonishing caramel rolls; they were so light, sticky, and sweet that I swear to God, they could kill a diabetic in thirty seconds flat.\u003c/p\u003e\n\u003cp\u003eI had to remove Skarda’s handcuffs before we went inside. After I did, I showed him the Glock that I concealed beneath my shirt and reminded him that I was an exceedingly desperate man.\u003c/p\u003e\n\u003cp\u003e“You don’t need to worry about me, Dyson,” he said.\u003c/p\u003e\n\u003cp\u003e“Then I won’t,” I said, although I didn’t mean it.\u003c/p\u003e\n\u003cp\u003eTobies had a bakery, restaurant, coffeehouse, and lounge, plus banquet and meeting facilities in different buildings that seemed to be connected by Velcro. We entered through the bakery. I exchanged bills for change and found the telephone. Skarda pumped the quarters in, but I stopped him before he could dial.\u003c/p\u003e\n\u003cp\u003e“Who are you calling?” I asked.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Are you calling your family? Because that’s the first place the cops’ll look for you. They might already have a tap in place.”\u003c/p\u003e\n\u003cp\u003e“We have prepaid cell phones. We only use them for business and then we toss them away.” Skarda grinned. “I really do have a crew. We really do know what we’re doing.”\u003c/p\u003e\n\u003cp\u003e“How did you get caught, then?”\u003c/p\u003e\n\u003cp\u003e“How did you?”\u003c/p\u003e\n\u003cp\u003eHe had me there.\u003c/p\u003e\n\u003cp\u003e“We’re just a couple of John Dillingers, we are,” I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-8.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
