{"id":103646,"no":86,"title":"Page 86","content":"\u003cp\u003eIs she late, my inner voice asked, or are you early?\u003c/p\u003e\n\u003cp\u003eI silently reviewed the schedule of comings and goings I had noted while Roy and I were watching the remote vault, even though I had gone over it ad nauseam the evening before. The employees left the vault at about 2:15 P.M., not long after the third armored truck departed on its daily run. They were back in place at 6:00 P.M., approximately one half hour before the first and second armored trucks returned from their routes. That gave them a three-hour-plus window to do what—eat, go to the movies, go fishing, do their laundry, shack up in one of the motels along Highway 1?\u003c/p\u003e\n\u003cp\u003eI glanced at the watch face again: 2:58 P.M. with the vault only thirty minutes away if you obeyed all the traffic signs.\u003c/p\u003e\n\u003cp\u003eShe is late, my inner voice said again. Or you’re in the wrong spot.\u003c/p\u003e\n\u003cp\u003eHelluva time for second-guessing, I told myself, yet that’s exactly what I was doing, reexamining in my head the sheaf of papers that I had obtained from Shelby. The report with the paper clip in the center is the one you want, she had said. I didn’t even bother to look at the others. There was no need. I recognized the woman by her driver’s license photo. Or did I?\u003c/p\u003e\n\u003cp\u003eStop it.\u003c/p\u003e\n\u003cp\u003eI have been known to not always consider the consequences of my actions, only now I couldn’t afford mistakes, none; not with Daniel studying my every move. He hadn’t displayed any special interest in what I was doing—didn’t so much as grunt back at the cabin when I pulled the cheap sneakers out from under the sofa and put them on—he just watched. He seemed to blink only once in a while and kind of deliberately, like an owl. I was amazed I was able to sneak out of the cabin last night and back in again without waking him. He was sitting next to me now in the Cherokee, his hands resting in his lap, perfectly relaxed. Jimmy and Roy in the backseat, not so much.\u003c/p\u003e\n\u003cp\u003e“How long are we going to sit here?” Jimmy wanted to know.\u003c/p\u003e\n\u003cp\u003e“As long as it takes,” I said.\u003c/p\u003e\n\u003cp\u003e“How long is that?”\u003c/p\u003e\n\u003cp\u003e“Is this the right house?” Roy asked. “It looks kind of abandoned to me. The grass needs mowing.”\u003c/p\u003e\n\u003cp\u003e“We should change the plan,” Jimmy said. “I never liked the plan. I still think my idea was better.”\u003c/p\u003e\n\u003cp\u003e“I like the plan,” Roy said. “On the other hand, just sitting here…”\u003c/p\u003e\n\u003cp\u003e“How ’bout from now on no one speaks unless something actually goes wrong,” I said, “and not even then.”\u003c/p\u003e\n\u003cp\u003e“How much time will we have in the vault again?” Jimmy asked.\u003c/p\u003e\n\u003cp\u003e“That’s what I mean.”\u003c/p\u003e\n\u003cp\u003e“How much?”\u003c/p\u003e\n\u003cp\u003e“According to MapQuest, it’s exactly 24.08 miles from the sheriff’s department substation in Ely to the mouth of the dirt road. Get the call, get the car, get out of the city onto the highway, estimate a top speed of eighty miles per hour—think a nineteen-minute response time. Probably it’s longer. Even so, we’ll go with fifteen minutes. The road itself is 1.8 miles long. The average jogger will cover six miles per hour. The cops won’t be jogging, though. Not with equipment, not when approaching a possible hostage-barricade situation. Their first move will be to locate and contain unless shots are fired, and we won’t be shooting anyone, right? Right?”\u003c/p\u003e\n\u003cp\u003e“Right,” Jimmy said. Roy mumbled something. Daniel didn’t say a word.\u003c/p\u003e\n\u003cp\u003e“It’s possible the cops’ll camp out on the road and wait for backup, except we won’t make that assumption. Instead, we’re betting they’ll be walking carefully up the road at approximately three miles per hour. That’s another forty minutes, call it thirty to be on the safe side. We should have forty-five minutes from the moment the alarm is triggered. I plan to get in and out in half that time.”\u003c/p\u003e\n\u003cp\u003e“You could have just said so,” Roy told me.\u003c/p\u003e\n\u003cp\u003e“I didn’t want you to think I was making this up as I went along.”\u003c/p\u003e\n\u003cp\u003e“Wait a sec,” Jimmy said. “Why would the police walk up the road? Why wouldn’t they drive?”\u003c/p\u003e\n\u003cp\u003eI glanced at him through my rearview mirror. “Were you paying any attention at all last night?”\u003c/p\u003e\n\u003cp\u003eI repeated my admonishment that everyone should keep quiet, yet I couldn’t shut up myself. Nerves, I guess. After a few moments I said, “An old piece of verse I learned in high school keeps repeating in my head. Worse than a song you can’t get rid of.”\u003c/p\u003e\n\u003cp\u003e“What?” Roy asked.\u003c/p\u003e\n\u003cp\u003e“Beware the Jabberwock, my son! The jaws that bite, the claws that catch!”\u003c/p\u003e\n\u003cp\u003eDaniel’s smile seemed positively joyful, yet it came and went so quickly that it was almost as if it had never appeared at all.\u003c/p\u003e\n\u003cp\u003e“Shun the frumious Bandersnatch,” he said.\u003c/p\u003e\n\u003cp\u003e“Words of wisdom,” I told him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-86.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
