{"id":103572,"no":9,"title":"Page 9","content":"\u003cp\u003eSkarda placed his call. I positioned myself next to him so I could hear what was spoken through the receiver.\u003c/p\u003e\n\u003cp\u003e“Hello,” a male voice said.\u003c/p\u003e\n\u003cp\u003e“Hello, Dad?” Skarda said. “It’s Dave.”\u003c/p\u003e\n\u003cp\u003e“Dave?”\u003c/p\u003e\n\u003cp\u003e“Yeah, Dave.”\u003c/p\u003e\n\u003cp\u003e“Dave’s not here.”\u003c/p\u003e\n\u003cp\u003eThe exchange made me laugh so loudly that people passing through the lobby turned to look, which is exactly what you want when you’re the object of a police manhunt, people staring at you.\u003c/p\u003e\n\u003cp\u003e“Dammit, Dad, this is your son David speaking,” Skarda said. “You know what, let me talk to Josie.”\u003c/p\u003e\n\u003cp\u003e“Josie’s not here.”\u003c/p\u003e\n\u003cp\u003e“Who the hell is there?”\u003c/p\u003e\n\u003cp\u003e“Everyone’s laying low. You’re in trouble, boy.”\u003c/p\u003e\n\u003cp\u003e“Tell me about it.”\u003c/p\u003e\n\u003cp\u003e“The escape was on the TV. The Star Tribune got a story up on its Web site. They say this fella you’re with, this Dyson, Nick Dyson, they say he’s dangerous, a career criminal, that he’s robbed banks and armored cars and shit.” Skarda glanced at me out of the corner of his eye. “I don’t think they care that much ’bout you, but they sure want this Dyson fella. If you ain’t done it yet, you gotta get shy of him, boy. Get as far away from that psycho as you can.”\u003c/p\u003e\n\u003cp\u003eSkarda took a deep breath and said, “Dad, the man is standing right next to me. He’s listening to every word you say.”\u003c/p\u003e\n\u003cp\u003eThere was a long pause on the other end of the line before Skarda’s old man spoke again. “Well, you shoulda said somethin’ cuz now I feel bad.”\u003c/p\u003e\n\u003cp\u003e“Dad, I’m bringing him to the cabin.”\u003c/p\u003e\n\u003cp\u003e“The cabin?”\u003c/p\u003e\n\u003cp\u003e“You know, the cabin.”\u003c/p\u003e\n\u003cp\u003e“Oh, oh yeah—the cabin.”\u003c/p\u003e\n\u003cp\u003e“Tell Josie. Tell her that I owe the man some money. Will you do that?”\u003c/p\u003e\n\u003cp\u003e“Josie?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Josie’s not here.”\u003c/p\u003e\n\u003cp\u003e“Dad, I’m going to hang up. Tell Josie I’ll call later.”\u003c/p\u003e\n\u003cp\u003eSkarda hung up the phone.\u003c/p\u003e\n\u003cp\u003e“My dad,” he said. “He’s…” Skarda shook his head.\u003c/p\u003e\n\u003cp\u003e“Crazy?” I said.\u003c/p\u003e\n\u003cp\u003e“Old.”\u003c/p\u003e\n\u003cp\u003e“I think I’d rather be crazy. Let’s go.”\u003c/p\u003e\n\u003cp\u003eMy intention was to get back on the road as soon as possible—keep moving, my inner voice chanted—but the aromas wafting up from the bakery were too enticing.\u003c/p\u003e\n\u003cp\u003e“I haven’t eaten all day,” Skarda said. “How ’bout you?”\u003c/p\u003e\n\u003cp\u003e“Well, if you’re going to insist, we could grab something and take it with us.”\u003c/p\u003e\n\u003cp\u003e“Or we could eat here.” Skarda gestured at the café on the other side of the bakery. It had a cozy, hometown feel to it, as if it were trying to channel the corner drugstore where Judy Garland and Mickey Rooney once shared a soda. It might have managed it, too, if not for all the damn hanging plants.\u003c/p\u003e\n\u003cp\u003e“Quickly,” I said.\u003c/p\u003e\n\u003cp\u003eWe bellied up to the rounded glass display cases and started searching for bakery. I was thinking something simple, like a crispy elephant ear. I bent to take a good look at it. Plain or filled, I debated. That’s when the deputy from the Pine County Sheriff’s Department walked in. I saw his brown and tan uniform reflected in the glass before I saw him. He called out the name of the cashier, which I didn’t get. She called his name in return. “Pat.” I rose slowly and casually stepped aside, giving him room to search the glass case.\u003c/p\u003e\n\u003cp\u003eSkarda didn’t notice the deputy at all until he nudged him while examining the cake donuts.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” the deputy said.\u003c/p\u003e\n\u003cp\u003e“S’okay,” Skarda said. Then he saw the uniform, saw the badge, saw the gun in the black holster. He stood upright and still, a look of alarm across his face. I was terrified that he would do something stupid, like run, or worse, just stand there with that idiot expression until the deputy noticed and asked what his problem was, so I attempted to distract the cop.\u003c/p\u003e\n\u003cp\u003e“I always thought that thing about cops and donuts was a myth,” I said.\u003c/p\u003e\n\u003cp\u003eThe deputy kept looking through the glass, answering as if he had heard the remark a thousand times before.\u003c/p\u003e\n\u003cp\u003e“It started because for a long time the only places that were open past 10 P.M. besides bars were donut shops,” he said. “So that’s where officers working the third shift went on their breaks. Plus, they tend to be located in centralized areas, the donut shops, so they can be used for briefings.” The deputy turned and smiled at me. It was a nice smile; made me want to contribute to the Police Benevolent Association. “Besides, who doesn’t like a fresh donut?”\u003c/p\u003e\n\u003cp\u003e“No true God-fearing American, that’s for sure,” I said.\u003c/p\u003e\n\u003cp\u003eI watched Skarda over the deputy’s shoulder. He took a step backward and swiveled his head back and forth as if he were searching for an exit. If I could have slapped him, I would have.\u003c/p\u003e\n\u003cp\u003e“What’ll you have, Pat?” the cashier asked.\u003c/p\u003e\n\u003cp\u003e“Gimme a couple of fudge cake donuts and a café hazelnut.”\u003c/p\u003e\n\u003cp\u003e“Coming up.”\u003c/p\u003e\n\u003cp\u003eThe cashier put the donuts in a small white bag with the name Tobies printed on the side and poured the coffee while the deputy reached in his pocket for his wallet. It was then that I noticed the name tag above his pocket read GARRETT.\u003c/p\u003e\n\u003cp\u003e“You know what,” I said. “I got this.” I put my hand in my own pocket and produced what was left of Chad’s $187. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-9.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
