{"id":103651,"no":91,"title":"Page 91","content":"\u003cp\u003eRoy gestured toward the monitors. Looking from one to another I was able to follow Skarda’s progress as he drove an ATV along the outside of the fence, circling the vault until he reached the area near the abandoned road Roy and I had found earlier. He hopped off the vehicle and started cutting a hole in the fence large enough to drive through.\u003c/p\u003e\n\u003cp\u003eI went to my watch. 7:19 P.M. I pulled the phone out of my pocket and dialed the number of the cell I had fastened to the tree. The cell was set to vibrate. The vibrator sent a low-amp charge through the wires that was boosted by the double-A batteries. It provided enough energy to trigger the blasting cap that set off the C-4. I heard the explosion through the walls of the vault, and in my mind’s eye I could picture the huge tree falling across the dirt road, effectively blocking all motorized traffic.\u003c/p\u003e\n\u003cp\u003eA moment later I forced the guard to join the others at the cafeteria tables. I asked Roy to remain where he was.\u003c/p\u003e\n\u003cp\u003e“I don’t expect trouble,” I said. “Keep an eye on the monitors just the same. Let me know once our friend cuts through.”\u003c/p\u003e\n\u003cp\u003eDaniel was standing between the captives and me. His head swiveled from one to the other, although he seemed most interested in what I was doing. I gestured for him to join me. We moved around the armored truck. The back door was open. Inside were two thick canvas bags big enough to hold a hockey player’s equipment. Daniel hopped inside the truck and tried to lift a bag by the handle. He managed it, but it required both hands and a grunt.\u003c/p\u003e\n\u003cp\u003e“Damn thing must weigh eighty pounds,” he said.\u003c/p\u003e\n\u003cp\u003e“I certainly hope so.”\u003c/p\u003e\n\u003cp\u003e“What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“A bill weighs about one gram. There are four hundred and fifty-four grams in a pound. Obviously, the heavier the bags, the more cash they contain.”\u003c/p\u003e\n\u003cp\u003e“Let’s hope they’re not all ones and fives.”\u003c/p\u003e\n\u003cp\u003e“Or nickels and quarters from the casino’s slot machines. Leave the bags for now. Come with me.”\u003c/p\u003e\n\u003cp\u003eIf Daniel disliked the way I ordered him about, he didn’t show it. Instead, he followed me from the truck to the cafeteria tables. A bag identical to the two in the armored truck sat open near the platform. I turned to our prisoners. They were standing in a line against the wall. We hadn’t put them in a line; it just worked out that way.\u003c/p\u003e\n\u003cp\u003e“Which one of you is Jer?” I asked. A middle-aged man reluctantly stepped forward. “Are you Jer?” He nodded. I pointed at the woman standing next to him. “Ms. Rooney.” She stepped forward. “Both of you come here.”\u003c/p\u003e\n\u003cp\u003eThe couple moved across the vault. They were not happy to be singled out. I handed the bag to Jer.\u003c/p\u003e\n\u003cp\u003e“Fill it up,” I told him.\u003c/p\u003e\n\u003cp\u003e“You’re never going to get away with this,” Jer said.\u003c/p\u003e\n\u003cp\u003e“So I’ve been told.”\u003c/p\u003e\n\u003cp\u003eJer and Rooney moved to the head of the first row of cafeteria tables, set the bag on top, and started filling it with the piles of cash, pulling the bag along the tables as they went. Jimmy kept turning his head to watch, and I had to warn him—twice—to remember where we were and what we were doing. After finishing with the first row of tables, Jer and Rooney carried the bag to the second row—it took both of them.\u003c/p\u003e\n\u003cp\u003eRoy called to me from the monitors. “The fence is down.”\u003c/p\u003e\n\u003cp\u003eJer and Rooney finished packing the bag with cash. I told them to seal it and carry the bag to the employee door—I didn’t want to bother with the bandit trap. It took a lot of effort; Rooney’s end sagged more than Jer’s.\u003c/p\u003e\n\u003cp\u003e“Where is he?” I called.\u003c/p\u003e\n\u003cp\u003e“He’s at the door,” Roy answered.\u003c/p\u003e\n\u003cp\u003e“Okay. You and your friend grab the bags off the truck and bring them here.” Roy and Daniel did what I asked, carrying the money bags over their shoulders like they were sacks of cement. Roy muttered something under his breath that I didn’t hear. Whatever it was didn’t seem to faze Daniel one bit.\u003c/p\u003e\n\u003cp\u003eI told Jer to open the door.\u003c/p\u003e\n\u003cp\u003e“The alarm will sound,” he said.\u003c/p\u003e\n\u003cp\u003e“I think we’re past worrying about that.”\u003c/p\u003e\n\u003cp\u003eJer opened the door and the tocsin went off—it sounded like one of those high-pitched horns the National Weather Center uses to warn people about tornadoes. Rooney covered her ears, so she probably didn’t hear me when I said, “We’re having some fun now, aren’t we?”\u003c/p\u003e\n\u003cp\u003eI shouted at Jer, “We’ll be leaving now. If this or any other door opens before we’re gone, I’ll assume it’s because you’re trying to stop us, in which case I’ll spray the place with machine-gun fire. It’s not your job to catch us. Let the cops do it. Understand?” He nodded. “Tell the others.”\u003c/p\u003e\n\u003cp\u003eI shooed Jer back against the wall but kept Rooney near me as Roy and Daniel carried the heavy sacks of cash out the door and loaded them onto the ATV. When they finished I waved Jimmy off the platform and through the door. Once he was outside, I spoke into Rooney’s ear.\u003c/p\u003e\n\u003cp\u003e“I’m sorry about all this, I really am. I didn’t know what else to do.” Her nod told me that she heard. “For the record, I think you’re much prettier as a brunette than a blonde. Although…”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“I’d pay real money to see you in the short skirt and high heels you wore when you got me away from the sheriff’s deputy.”\u003c/p\u003e\n\u003cp\u003e“Luck,” she said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-91.html","bookId":2217,"creation":"Oct 5, 2019 10:30:15 PM","modification":"Oct 5, 2019 10:30:15 PM"}
