{"id":80687,"no":35,"title":"Page 35","content":"\u003cp\u003eThe environment suit was better than Miller was used to. He\u0027d only done a couple walks outside during his years on Ceres, and the Star Helix equipment had been old back then: thick corrugated joints, separable air-supply unit, gloves that left his hands thirty degrees colder than the rest of his body. The Rocinante\u0027s suits were military and recent, no bulkier than standard riot gear, with integrated life support that could probably keep fingers warm after a hand got shot off. Miller floated, one hand on a strap in the airlock, and flexed his fingers, watching the sharkskin pattern of the knuckle joints.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t feel like enough.\u003c/p\u003e\n\u003cp\u003e\"All right, Alex,\" Holden said. \"We\u0027re in place. Have the Roci knock for us.\"\u003c/p\u003e\n\u003cp\u003eA deep, rumbling vibration shook them. Naomi put a hand against the airlock\u0027s curved wall to steady herself. Amos shifted forward to take point, a reactionless automatic rifle in his hands. When he bent his neck, Miller could hear the vertebrae cracking through his radio. It was the only way he could have heard it; they were already in vacuum.\u003c/p\u003e\n\u003cp\u003e\"Okay, Captain,\" Alex said. \"I\u0027ve got a seal. The standard security override isn\u0027t working, so give me a second... to... \"\u003c/p\u003e\n\u003cp\u003e\"Problem?\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"Got it. I\u0027ve got it. We have a connection,\" Alex said. Then, a moment later: \"Ah. It doesn\u0027t look like there\u0027s much to breathe over there.\"\u003c/p\u003e\n\u003cp\u003e\"Anything?\" Holden asked.\u003c/p\u003e\n\u003cp\u003e\"Nope. Hard vacuum,\" Alex said. \"Both her lock doors are open.\"\u003c/p\u003e\n\u003cp\u003e\"All right, folks,\" Holden said, \"keep an eye on your air supply. Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eMiller took a long breath. The external airlock went from soft red to soft green. Holden slid it open, and Amos launched forward, the captain just behind him. Miller gestured to Naomi with a nod. Ladies first.\u003c/p\u003e\n\u003cp\u003eThe connecting gantry was reinforced, ready to deflect enemy lasers or slow down slugs. Amos landed on the other ship as the hatch to the Rocinante closed behind them. Miller had a moment\u0027s vertigo, the ship before them suddenly clicking from ahead to down in his perception, as if they were falling into something.\u003c/p\u003e\n\u003cp\u003e\"You all right?\" Naomi asked.\u003c/p\u003e\n\u003cp\u003eMiller nodded, and Amos passed into the other ship\u0027s hatch. One by one, they went in.\u003c/p\u003e\n\u003cp\u003eThe ship was dead. The lights coming off their environment suits played over the soft, almost streamlined curves of the bulkheads, the cushioned walls, the gray suit lockers. One locker was bent out of shape, like someone or something had forced its way out from within. Amos pushed off slow. Under normal circumstances, hard vacuum would have been assurance enough that nothing was about to jump out at them. Right now, Miller figured it was only even money.\u003c/p\u003e\n\u003cp\u003e\"Whole place is shut down,\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"Might be backups in the engine room,\" Amos said.\u003c/p\u003e\n\u003cp\u003e\"So the ass end of the ship from here,\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"Pretty much.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s be careful,\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m heading up to ops,\" Naomi said. \"If there\u0027s anything running off battery, I can - \"\u003c/p\u003e\n\u003cp\u003e\"No, you aren\u0027t,\" Holden said. \"We aren\u0027t splitting up the group until we know what we\u0027re looking at. Stay together.\"\u003c/p\u003e\n\u003cp\u003eAmos moved down, sinking into the darkness. Holden pushed off after him. Miller followed. He couldn\u0027t tell from Naomi\u0027s body language whether she was annoyed or relieved.\u003c/p\u003e\n\u003cp\u003eThe galley was empty, but signs of struggle showed here and there. A chair with a bent leg. A long, jagged scratch down the wall where something sharp had flaked the paint. Two bullet holes set high along one bulkhead where a shot had gone wide. Miller put a hand out, grabbed one of the tables, and swung slowly.\u003c/p\u003e\n\u003cp\u003e\"Miller?\" Holden said. \"Are you coming?\"\u003c/p\u003e\n\u003cp\u003e\"Look at this,\" Miller said.\u003c/p\u003e\n\u003cp\u003eThe dark spill was the color of amber, flaky and shining like glass in his flashlight beam. Holden hovered closer.\u003c/p\u003e\n\u003cp\u003e\"Zombie vomit?\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"Think so.\"\u003c/p\u003e\n\u003cp\u003e\"Well. I guess we\u0027re on the right ship. For some value of right.\"\u003c/p\u003e\n\u003cp\u003eThe crew quarters hung silent and empty. They went through each of them, but there were no personal markings - no terminals, no pictures, no clues to the names of the men and women who had lived and breathed and presumably died on the ship. Even the captain\u0027s cabin was indicated only by a slightly larger bunk and the face of a locked safe.\u003c/p\u003e\n\u003cp\u003eThere was a massive central compartment as high and wide as the hull of the Rocinante, the darkness dominated by twelve huge cylinders encrusted with narrow catwalks and scaffolds. Miller saw Naomi\u0027s expression harden.\u003c/p\u003e\n\u003cp\u003e\"What are they?\" Miller asked.\u003c/p\u003e\n\u003cp\u003e\"Torpedo tubes,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Torpedo tubes?\" he said. \"Jesus Christ, how many are they packing? A million?\"\u003c/p\u003e\n\u003cp\u003e\"Twelve,\" she said. \"Just twelve.\"\u003c/p\u003e\n\u003cp\u003e\"Capital-ship busters,\" Amos said. \"Built to pretty much kill whatever you\u0027re aiming at with the first shot.\"\u003c/p\u003e\n\u003cp\u003e\"Something like the Donnager?\" Miller asked.\u003c/p\u003e\n\u003cp\u003eHolden looked back at him, the glow of his heads-up display lighting his features.\u003c/p\u003e\n\u003cp\u003e\"Or the Canterbury,\" he said.\u003c/p\u003e\n\u003cp\u003eThe four of them passed between the wide black tubes in silence.\u003c/p\u003e\n\u003cp\u003eIn the machine and fabrication shops, the signs of violence were more pronounced. There was blood on the floor and walls, along with wide swaths of the glassy gold resin that had once been vomit. A uniform lay in a ball. The cloth had been wadded and soaked in something before the cold of space had frozen it. Habits formed from years of walking through crime scenes put a dozen small things in place: the pattern of scratches on the floor and lift doors, the spatter of blood and vomit, the footprints. They all told the story.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re in engineering,\" Miller said.\u003c/p\u003e\n\u003cp\u003e\"Who?\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"The crew. Whoever was on the ship. All except that one,\" he said, gesturing at half a footprint that led toward the lift. \"You see how her footprints are over the top of everything else. And there, where she stepped in that blood, it was already dry. Flaked instead of smearing.\"\u003c/p\u003e\n\u003cp\u003e\"How you know it was a girl?\" Holden asked.\u003c/p\u003e\n\u003cp\u003e\"Because it was Julie,\" Miller said.\u003c/p\u003e\n\u003cp\u003e\"Well, whoever\u0027s in there, they\u0027ve been sucking vacuum for a long time,\" Amos said. \"Want to go see?\"\u003c/p\u003e\n\u003cp\u003eNo one said yes, but they all floated forward. The hatch stood open. If the darkness beyond it seemed more solid, more ominous, more personal than the rest of the dead ship had, it was only Miller\u0027s imagination playing tricks. He hesitated, trying to summon up the image of Julie, but she wouldn\u0027t come.\u003c/p\u003e\n\u003cp\u003eFloating into the engineering deck was like swimming into a cave. Miller saw the other flashlights playing over walls and panels, looking for live controls, or else controls that could come alive. He aimed his own beam into the body of the room, the dark swallowing it.\u003c/p\u003e\n\u003cp\u003e\"We got batteries, Cap\u0027n,\" Amos said. \"And... looks like the reactor got shut down. Intentional.\"\u003c/p\u003e\n\u003cp\u003e\"Think you can get it back up?\"\u003c/p\u003e\n\u003cp\u003e\"Want to run some diagnostics,\" Amos said. \"There could be a reason they shut it off, and I don\u0027t want to find out the hard way.\"\u003c/p\u003e\n\u003cp\u003e\"Good point.\"\u003c/p\u003e\n\u003cp\u003e\"But I can at least get us... some... come on, you bastard.\"\u003c/p\u003e\n\u003cp\u003eAll around the deck, blue-white lights flared up. The sudden brilliance blinded Miller for a half second. His vision returned with a sense of growing confusion. Naomi gasped, and Holden yelped. Something in the back of Miller\u0027s own mind started to shriek, and he forced it into silence. It was just a crime scene. They were only bodies.\u003c/p\u003e\n\u003cp\u003eExcept they weren\u0027t.\u003c/p\u003e\n\u003cp\u003eThe reactor stood before him, quiescent and dead. All around it, a layer of human flesh. He could pick out arms, hands with fingers splayed so wide they hurt to look at. The long snake of a spine curved, ribs fanning out like the legs of some perverse insect. He tried to make what he was seeing make sense. He\u0027d seen men eviscerated before. He knew that the long, ropy swirl to the left of the thing were intestines. He could see where the small bowel widened to become a colon. The familiar shape of a skull looked out at him.\u003c/p\u003e\n\u003cp\u003eBut then, among the familiar anatomy of death and dismemberment, there were other things: nautilus spirals, wide swaths of soft black filament, a pale expanse of something that might have been skin cut by a dozen gill-like vents, a half-formed limb that looked equally like an insect and a fetus without being either one. The frozen, dead flesh surrounded the reactor like the skin of an orange. The crew of the stealth ship. Maybe of the Scopuli as well.\u003c/p\u003e\n\u003cp\u003eAll but Julie.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Amos said. \"This could take a little longer than I was thinking, Cap.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" Holden said. His voice on the radio sounded shaky. \"You don\u0027t have to.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s no trouble. As long as none of that freaky shit broke the containment, reactor should boot up just fine.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t mind being around... it?\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"Honest, Cap\u0027n, I\u0027m not thinking about it. Give me twenty minutes, I\u0027ll tell you if we got power or if we have to patch a line over from the Roci.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" Holden said. And then again, his voice more solid: \"Okay, but don\u0027t touch any of that.\"\u003c/p\u003e\n\u003cp\u003e\"Wasn\u0027t going to,\" Amos said.\u003c/p\u003e\n\u003cp\u003eThey floated back out through the hatch, Holden and Naomi and Miller coming last.\u003c/p\u003e\n\u003cp\u003e\"Is that... \" Naomi said, then coughed and started again. \"Is that what\u0027s happening on Eros?\"\u003c/p\u003e\n\u003cp\u003e\"Probably,\" Miller said.\u003c/p\u003e\n\u003cp\u003e\"Amos,\" Holden said. \"Do you have enough battery power to light up the computers?\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. Miller took a deep breath, the plastic-and-ozone scent of the suit\u0027s air system filling his nose.\u003c/p\u003e\n\u003cp\u003e\"I think so,\" Amos said dubiously. \"But if we can get the reactor up first... \"\u003c/p\u003e\n\u003cp\u003e\"Bring up the computers.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the captain, Cap\u0027n,\" Amos said. \"Have it to you in five.\"\u003c/p\u003e\n\u003cp\u003eIn silence, they floated up - back - to the airlock, and past it to the operations deck. Miller hung back, watching the way Holden\u0027s trajectory kept him near Naomi and then away from her.\u003c/p\u003e\n\u003cp\u003eProtective and head-shy both, Miller thought. Bad combination.\u003c/p\u003e\n\u003cp\u003eJulie was waiting in the airlock. Not at first, of course. Miller slid back into the space, his mind churning through everything he\u0027d seen, just like it was a case. A normal case. His gaze drifted toward the broken locker. There was no suit in it. For a moment, he was back on Eros, in the apartment where Julie had died. There had been an environment suit there. And then Julie was there with him, pushing her way out of the locker.\u003c/p\u003e\n\u003cp\u003eWhat were you doing there? he thought.\u003c/p\u003e\n\u003cp\u003e\"No brig,\" he said.\u003c/p\u003e\n\u003cp\u003e\"What?\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"I just noticed,\" Miller said. \"Ship\u0027s got no brig. They aren\u0027t built to carry prisoners.\"\u003c/p\u003e\n\u003cp\u003eHolden made a low agreeing grunt.\u003c/p\u003e\n\u003cp\u003e\"Makes you wonder what they were planning to do with the crew of the Scopuli,\" Naomi said. The tone of her voice meant she didn\u0027t wonder at all.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think they were,\" Miller said slowly. \"This whole thing... they were improvising.\"\u003c/p\u003e\n\u003cp\u003e\"Improvising?\" Naomi said.\u003c/p\u003e\n\u003cp\u003e\"Ship was carrying an infectious something or other without enough containment to contain it. Taking on prisoners without a brig to hold \u0027em in. They were making this up as they went along.\"\u003c/p\u003e\n\u003cp\u003e\"Or they had to hurry,\" Holden said. \"Something happened that made them hurry. But what they did on Eros must have taken months to arrange. Maybe years. So maybe something happened at the last minute?\"\u003c/p\u003e\n\u003cp\u003e\"Be interesting to know what,\" Miller said.\u003c/p\u003e\n\u003cp\u003eCompared to the rest of the ship, the ops deck looked peaceful. Normal. The computers had finished their diagnostics, screens glowing placidly. Naomi went to one, holding the back of the chair with one hand so the gentle touch of her fingers against the screen wouldn\u0027t push her backward.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll do what I can here,\" she said. \"You can check the bridge.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause that carried weight.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be fine,\" Naomi said.\u003c/p\u003e\n\u003cp\u003e\"All right. I know you\u0027ll... I... C\u0027mon, Miller.\"\u003c/p\u003e\n\u003cp\u003eMiller let the captain float ahead into the bridge. The screens there were spooling through diagnostics so standard Miller recognized them. It was a wider space than he\u0027d imagined, with five stations with crash couches customized for other people\u0027s bodies. Holden strapped in at one. Miller took a slow turn around the deck. Nothing seemed out of place here - no blood, no broken chairs or torn padding. When it happened, the fight had been down near the reactor. He wasn\u0027t sure yet what that meant. He sat at what, under a standard layout, would have been the security station, and opened a private channel to Holden.\u003c/p\u003e\n\u003cp\u003e\"Anything you\u0027re looking for in particular?\"\u003c/p\u003e\n\u003cp\u003e\"Briefings. Overviews,\" Holden said shortly. \"Whatever\u0027s useful. You?\"\u003c/p\u003e\n\u003cp\u003e\"See if I can get into the internal monitors.\"\u003c/p\u003e\n\u003cp\u003e\"Hoping to find...?\"\u003c/p\u003e\n\u003cp\u003e\"What Julie found,\" Miller said.\u003c/p\u003e\n\u003cp\u003eThe security assumed that anyone sitting at the console had access to the low-level feeds. It still took half an hour to parse the command structure and query interface. Once Miller had that down, it wasn\u0027t hard. The time stamp on the log listed the feed as the day the Scopuli had gone missing. The security camera in the airlock bay showed the crew - Belters, most of them - being escorted in. Their captors were in armor, with faceplates lowered. Miller wondered if they\u0027d meant to keep their identities secret. That would almost have suggested they were planning to keep the crew alive. Or maybe they were just wary of some last-minute resistance. The crew of the Scopuli weren\u0027t wearing environment suits or armor. A couple of them weren\u0027t even wearing uniforms.\u003c/p\u003e\n\u003cp\u003eBut Julie was.\u003c/p\u003e\n\u003cp\u003eIt was strange, watching her move. With a sense of dislocation, Miller realized that he\u0027d never actually seen her in motion. All the pictures he\u0027d had in his file back on Ceres had been stills. Now here she was, floating with her chosen compatriots, her hair back out of her eyes, her jaw clamped. She looked very small surrounded by her crew and the men in armor. The little rich girl who\u0027d turned her back on wealth and status to be with the downtrodden Belt. The girl who\u0027d told her mother to sell the Razorback - the ship she\u0027d loved - rather than give in to emotional blackmail. In motion, she looked a little different from the imaginary version he\u0027d built of her - the way she pulled her shoulders back, the habit of reaching her toes toward the floor even in null g - but the basic image was the same. He felt like he was filling in blanks with the new details rather than reimagining the woman.\u003c/p\u003e\n\u003cp\u003eThe guards said something - the security feed\u0027s audio was playing to vacuum - and the Scopuli crew looked aghast. Then, hesitantly, the captain started taking his uniform off. They were stripping the prisoners. Miller shook his head.\u003c/p\u003e\n\u003cp\u003e\"Bad plan.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Holden said.\u003c/p\u003e\n\u003cp\u003e\"Nothing. Sorry.\"\u003c/p\u003e\n\u003cp\u003eJulie wasn\u0027t moving. One of the guards moved toward her, his legs braced on the wall. Julie, who\u0027d lived through being raped, maybe, or something as bad. Who\u0027d studied jiu jitsu to feel safe afterward. Maybe they thought she was just being modest. Maybe they were afraid she was hiding a weapon under her clothes. Either way, they tried to force the point. One of the guards pushed her, and she latched on to his arm like her life depended on it. Miller winced when he saw the man\u0027s elbow bend the wrong way, but he also smiled.\u003c/p\u003e\n\u003cp\u003eThat\u0027s my girl, he thought. Give \u0027em hell.\u003c/p\u003e\n\u003cp\u003eAnd she did. For almost forty seconds, the airlock bay was a battleground. Even some of the cowed Scopuli crew tried to join in. But then Julie didn\u0027t see a thick-shouldered man launch from behind her. Miller felt it when the gauntleted hand hammered Julie\u0027s temple. She wasn\u0027t out, but she was groggy. The men with guns stripped her with a cold efficiency, and when there were no weapons or comm devices, they handed her a jumpsuit and shoved her in a locker. The others, they led down into the ship. Miller matched time stamps and switched feeds.\u003c/p\u003e\n\u003cp\u003eThe prisoners were taken to the galley, then bound to the tables. One of the guards spent a minute or so talking, but with his faceplate down, the only clues Miller had to the content of the sermon were the reactions of the crew - wide-eyed disbelief, confusion, outrage, and fear. The guard could have been saying anything.\u003c/p\u003e\n\u003cp\u003eMiller started skipping. A few hours, then a few more. The ship was under thrust, the prisoners actually sitting at the tables instead of floating near them. He flipped to other parts of the ship. Julie\u0027s locker was still closed. If he hadn\u0027t known better, he\u0027d have assumed she was dead.\u003c/p\u003e\n\u003cp\u003eHe skipped ahead.\u003c/p\u003e\n\u003cp\u003eOne hundred and thirty-two hours later, the crew of the Scopuli grew a pair. Miller saw it in their bodies even before the violence started. He\u0027d seen holding cells rise up before, and the prisoners had the same sullen-but-excited look. The feed showed the stretch of wall where he\u0027d seen the bullet holes. They weren\u0027t there yet. They would be. A man came into the picture with a tray of food rations.\u003c/p\u003e\n\u003cp\u003eHere it comes, Miller thought.\u003c/p\u003e\n\u003cp\u003eThe fight was short and brutal. The prisoners didn\u0027t stand a chance. Miller watched as they hauled one of them - a sandy-haired man - to the airlock and spaced him. The others were put in heavy restraints. Some wept. Some screamed. Miller skipped ahead.\u003c/p\u003e\n\u003cp\u003eIt had to be in there someplace. The moment when it - whatever it was - got loose. But either it had happened in some unmonitored crew quarters or it had been there from the beginning. Almost exactly one hundred and sixty hours after Julie had gone into the locker, a man in a white jumper, eyes glassy and stance unsure, lurched out of the crew quarters and vomited on one of the guards.\u003c/p\u003e\n\u003cp\u003e\"Fuck!\" Amos shouted.\u003c/p\u003e\n\u003cp\u003eMiller was out of his chair before he knew what had happened. Holden was up too.\u003c/p\u003e\n\u003cp\u003e\"Amos?\" Holden said. \"Talk to me.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on,\" Amos said. \"Yeah, it\u0027s okay, Cap\u0027n. It\u0027s just these fuckers stripped off a bunch of the reactor shielding. We\u0027ve got her up, but I sucked down a few more rads than I\u0027d have picked.\"\u003c/p\u003e\n\u003cp\u003e\"Get back to the Roci,\" Holden said. Miller steadied himself against a wall, pushing back down toward the control stations.\u003c/p\u003e\n\u003cp\u003e\"No offense, sir, but it ain\u0027t like I\u0027m about to start pissing blood or anything fun like that,\" Amos said. \"I got surprised more than anything. I start feeling itchy, I\u0027ll head back over, but I can get some atmosphere for us by working out of the machine shop if you give me a few more minutes.\"\u003c/p\u003e\n\u003cp\u003eMiller watched Holden\u0027s face as the man struggled. He could make it an order; he could leave it be.\u003c/p\u003e\n\u003cp\u003e\"Okay, Amos. But you start getting light-headed or anything - I mean anything - and you get over to the sick bay.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, aye,\" Amos said.\u003c/p\u003e\n\u003cp\u003e\"Alex, keep an eye on Amos\u0027 biomed feed from over there. Give us a heads-up if you see a problem,\" Holden said on the general channel.\u003c/p\u003e\n\u003cp\u003e\"Roger,\" came Alex\u0027s lazy drawl.\u003c/p\u003e\n\u003cp\u003e\"You finding anything?\" Holden asked Miller on their private channel.\u003c/p\u003e\n\u003cp\u003e\"Nothing unexpected,\" Miller said. \"You?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, actually. Take a look.\"\u003c/p\u003e\n\u003cp\u003eMiller pushed himself to the screen Holden had been working. Holden pulled himself back into the station and started pulling up feeds.\u003c/p\u003e\n\u003cp\u003e\"I was thinking that someone had to go last,\" Holden said. \"I mean, there had to be someone who was the least sick when whatever it was got loose. So I went through the directory to see what activity was going on before the system went dead.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a whole bunch of activity that looks like it happened a couple days before the system shutdown, and then nothing for two solid days. And then a little spike. A lot of accessed files and system diagnostics. Then someone hacked the override codes to blow atmosphere.\"\u003c/p\u003e\n\u003cp\u003e\"It was Julie, then.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I was thinking,\" Holden said. \"But one of the feeds she accessed was... Shit, where is it? It was right... Oh. Here. Watch this.\"\u003c/p\u003e\n\u003cp\u003eThe screen blinked, controls dropping to standby, and a high-res emblem, green and gold, came up. The corporate logo of Protogen, with a slogan Miller hadn\u0027t seen before. First. Fastest. Furthest.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the time stamp on the file?\" Miller asked.\u003c/p\u003e\n\u003cp\u003e\"The original was created about two years ago,\" Holden said. \"This copy was burned eight months ago.\"\u003c/p\u003e\n\u003cp\u003eThe emblem faded, and a pleasant-faced man sitting at a desk took its place. He had dark hair, with just a scattering of gray at the temples, and lips that seemed used to smiling. He nodded at the camera. The smile didn\u0027t reach his eyes, which were as empty as a shark\u0027s.\u003c/p\u003e\n\u003cp\u003eSociopath, Miller thought.\u003c/p\u003e\n\u003cp\u003eThe man\u0027s lips began moving soundlessly. Holden said, \"Shit,\" and hit a switch to have the audio transmitted to their suits. He rewound the video feed and started it over.\u003c/p\u003e\n\u003cp\u003e\"Mr. Dresden,\" the man said. \"I would like to thank you and the members of the board for taking the time to review this information. Your support, both financial and otherwise, has been absolutely essential to the incredible discoveries we\u0027ve seen on this project. While my team has been point man, as it were, Protogen\u0027s tireless commitment to the advancement of science has made our work possible.\u003c/p\u003e\n\u003cp\u003e\"Gentlemen, I will be frank. The Phoebe protomolecule has exceeded all our expectations. I believe it represents a genuinely game-changing technological breakthrough. I know that these kinds of corporate presentations are prone to hyperbole. Please understand that I have thought about this carefully and chosen my words: Protogen can become the most important and powerful entity in the history of the human race. But it will require initiative, ambition, and bold action.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s talking about killing people,\" Miller said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve seen this already?\" Holden said.\u003c/p\u003e\n\u003cp\u003eMiller shook his head. The feed changed. The man faded out, and an animation took his place. A graphic representation of the solar system. Orbits marked in wide swaths of color showed the plane of the ecliptic. The virtual camera swirled out from the inner planets, where Mr. Dresden and board members presumably were, and out toward the gas giants.\u003c/p\u003e\n\u003cp\u003e\"For those of you on the board unfamiliar with the project, eight years ago, the first manned landing was made on Phoebe,\" the sociopath said.\u003c/p\u003e\n\u003cp\u003eThe animation zoomed in toward Saturn, rings and planet flying past in a triumph of graphic design over accuracy.\u003c/p\u003e\n\u003cp\u003e\"A small ice moon, the assumption was that Phoebe would eventually be mined for water, much like the rings themselves. The Martian government commissioned a scientific survey more out of a sense of bureaucratic completeness than from expectation of economic gain. Core samples were taken, and when silicate anomalies raised flags, Protogen was approached as cosponsor of a long-term research facility.\"\u003c/p\u003e\n\u003cp\u003eThe moon itself - Phoebe - filled the frame, turning slowly to show all sides like a prostitute at a cheap brothel. It was a crater-marked lump, indistinguishable from a thousand other asteroids and planetesimals Miller had seen.\u003c/p\u003e\n\u003cp\u003e\"Given Phoebe\u0027s extra-ecliptical orbit,\" the sociopath went on, \"one theory has been that it was a body that originated in the Kuiper belt and had been captured by Saturn when it happened to pass through the solar system. The existence of complex silicon structures within the interior ice, along with suggestions of impact-resistant structures within the architecture of the body itself, have forced us to reevaluate this.\u003c/p\u003e\n\u003cp\u003e\"Using analyses proprietary to Protogen and not yet shared with the Martian team, we have determined beyond any credible doubt that what you are seeing now is not a naturally formed planetesimal, but a weapon. Specifically, a weapon designed to carry its payload through the depths of interplanetary space and deliver it safely onto Earth two and one third billion years ago, when life itself was in its earliest stages. And the payload, gentlemen, is this.\"\u003c/p\u003e\n\u003cp\u003eThe display clicked to a graphic that Miller couldn\u0027t quite parse. It looked like the medical text of a virus, but with wide, looping structures that were at once beautiful and improbable.\u003c/p\u003e\n\u003cp\u003e\"The protomolecule first caught our interest for its ability to maintain its primary structure in a wide variety of conditions through secondary and tertiary changes. It also showed an affinity for carbon and silicon structures. Its activity suggested it was not in itself a living thing, but a set of free-floating instructions designed to adapt to and guide other replicating systems. Animal experiments suggest that its effects are not exclusive to simple replicators, but are, in fact, scalable.\"\u003c/p\u003e\n\u003cp\u003e\"Animal tests,\" Miller said. \"What, they dumped it on a cat?\"\u003c/p\u003e\n\u003cp\u003e\"The initial implication of this,\" the sociopath went on, \"is that a larger biosphere exists, of which our solar system is only a part, and that the protomolecule is an artifact of that environment. That alone, I think you must agree, would revolutionize human understanding of the universe. Let me assure you, it\u0027s small beer. If accidents of orbital mechanics had not captured Phoebe, life as we know it would not presently exist. But something else would. The earliest cellular life on Earth would have been hijacked. Reprogrammed along lines contained within the structure of the protomolecule.\"\u003c/p\u003e\n\u003cp\u003eThe sociopath reappeared. For the first time, smile lines appeared around his eyes, like a parody of themselves. Miller felt a visceral hatred growing in his gut and knew himself well enough to recognize it for what it was. Fear.\u003c/p\u003e\n\u003cp\u003e\"Protogen is in a position to take sole possession of not only the first technology of genuinely extraterrestrial origin, but also a prefabricated mechanism for the manipulation of living systems and the first clues as to the nature of the larger - I will call it galactic - biosphere. Directed by human hands, the applications of this are limitless. I believe that the opportunity now facing not only us but life itself is as profound and transformative as anything that has ever happened. And, further, the control of this technology will represent the base of all political and economic power from now on.\u003c/p\u003e\n\u003cp\u003e\"I urge you to consider the technical details I have outlined in the attached. Moving quickly to understand the programming, mechanism, and intent of the protomolecule, as well as its direct application to human beings, will mark the difference between a Protogen-led future and being left behind. I urge immediate and decisive action to take exclusive control of the protomolecule and move forward with large-scale testing.\u003c/p\u003e\n\u003cp\u003e\"Thank you for your time and attention.\"\u003c/p\u003e\n\u003cp\u003eThe sociopath smiled again, and the corporate logo reappeared. First. Fastest. Furthest. Miller\u0027s heart was racing.\u003c/p\u003e\n\u003cp\u003e\"Okay. All right,\" he said. And then: \"Fuck me.\"\u003c/p\u003e\n\u003cp\u003e\"Protogen, protomolecule,\" Holden said. \"They had no idea what it does, but they slapped their label on it like they\u0027d made it. They found an alien weapon, and all they could think to do was brand it.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s reason to think these boys are pretty impressed with themselves,\" Miller replied with a nod.\u003c/p\u003e\n\u003cp\u003e\"Now, I\u0027m not a scientist or anything,\" Holden said, \"but it seems to me like taking an alien supervirus and dropping it into a space station would be a bad idea.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been two years,\" Miller said. \"They\u0027ve been doing tests. They\u0027ve been... I don\u0027t know what the hell they\u0027ve been doing. But Eros is what they decided on. And everyone knows what happened on Eros. The other side did it. No research and recovery ships because they\u0027re all fighting each other or guarding something. The war? It\u0027s a distraction.\"\u003c/p\u003e\n\u003cp\u003e\"And Protogen is doing... what?\"\u003c/p\u003e\n\u003cp\u003e\"Seeing what their toy does when you take it out for a spin is my guess,\" Miller said.\u003c/p\u003e\n\u003cp\u003eThey were silent for a long moment. Holden spoke first.\u003c/p\u003e\n\u003cp\u003e\"So you take a company that seems to be lacking an institutional conscience, that has enough government research contracts to almost be a privately run branch of the military. How far will they go for the holy grail?\"\u003c/p\u003e\n\u003cp\u003e\"First, fastest, furthest,\" Miller replied.\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Guys,\" Naomi said, \"you should come down here. I think I\u0027ve got something.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/leviathan-wakes-expanse-1/page-35.html","bookId":2454,"creation":"Oct 5, 2019 4:28:39 PM","modification":"Oct 5, 2019 4:28:39 PM"}
