{"id":90445,"no":2,"title":"Page 2","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe forgot his father completely. He also forgot the danger—and the fact that he was being used.\u003c/p\u003e\n\u003cp\u003e“All right,” he said. Now his voice was flat-out hoarse. “We’ll go by the tunnel.”\u003c/p\u003e\n\u003cp\u003eShe smiled. She rose up on her toes and brought her lips to his and did things with her tongue that nearly made him climax on the spot. Then she stepped back. “That was a little promise of things to come!”\u003c/p\u003e\n\u003cp\u003eHe nodded. He couldn’t speak.\u003c/p\u003e\n\u003cp\u003eHe turned around. On the screen, Dianna Breen was screaming. She was being chased by the Egyptian robe-clad murderer, who was forcing her deeper and deeper into the museum.\u003c/p\u003e\n\u003cp\u003eAlistair stumbled through the audience chairs to the back. He entered the old lobby, where wine and beer were sold, along with various forms of high-end movie snack food. To the far left of the lobby were a few offices and conference rooms, and at the back of his father’s favorite little meeting room was a door, nominally hidden by a movie poster.\u003c/p\u003e\n\u003cp\u003e“Oooh, this is like a high-tech spy adventure!” she said.\u003c/p\u003e\n\u003cp\u003e“There’s nothing high-tech about it,” he said as guilt clashed with the near-desperate desire she elicited. “It’s a movie poster covering a door.”\u003c/p\u003e\n\u003cp\u003eShe was pressed to his back. Desire won out over guilt.\u003c/p\u003e\n\u003cp\u003eAlistair swept the canvas poster to the side, dug in his pocket and twisted the key in the lock, fumbling for a moment as he did so.\u003c/p\u003e\n\u003cp\u003eThere were auxiliary lights set into the steps that led down to the tunnel; on the days that the small museum was open, before and after movies were screened, the stairway and the landing would be ablaze with light. But tonight, no one was expected.\u003c/p\u003e\n\u003cp\u003e“Be careful,” he warned Jenny.\u003c/p\u003e\n\u003cp\u003e“Of course!” she said.\u003c/p\u003e\n\u003cp\u003eAlistair walked slowly down the steps, ever aware of her sweet-smelling presence behind him. He reached the landing. He’d never been here before when there was no illumination except the emergency lighting. It changed the entire appearance of the place.\u003c/p\u003e\n\u003cp\u003eThe museum’s first scene was from The Maltese Falcon. Humphrey Bogart sat at his desk while femme fatale Mary Astor leaned toward him and a creepy Peter Lorre hovered off to the side. They were all caught in shadow, and even Bogie looked dangerous, ready to strangle Mary Astor. Across from that tableau, Orson Welles as the title character in Citizen Kane stood by the breakfast table, angry after ignoring Ruth Warrick, who played his first wife. The old mannequins, created in the mid-50s by the previous owner’s special-effects studio, had been works of love, and in the dim red light and shadows, Alistair could almost believe that Orson Welles was about to speak angrily, his patience finally snapping him from the ennui of his marriage. Alan Ladd and Veronica Lake were together next, in a scene from The Glass Key, and then there were Dana Andrews, Vincent Price and Gene Tierney in Laura. The hall was long, and the exhibits were plentiful. A slim wooden barrier separated the walkway from the exhibits, and visitors could push buttons, which would let them hear the audio from the scene they were witnessing, along with information about the actors, producers, writers and directors. That night, to Alistair, all the characters looked as if they could speak without benefit of electronics.\u003c/p\u003e\n\u003cp\u003eBogie made another appearance, with Ingrid Bergman in Casablanca; he was saying goodbye in front of the plane that would take her away. Bogie gripped Ingrid by the shoulders, and the emotion between them—and the greater good of the war effort, the sacrifice required—seemed palpable.\u003c/p\u003e\n\u003cp\u003eToward the end of the hallway, Alistair stopped.\u003c/p\u003e\n\u003cp\u003eThe scene was taken from the movie he had been watching that night, Sam Stone and the Curious Case of the Egyptian Museum.\u003c/p\u003e\n\u003cp\u003eThere was hard-boiled Sam Stone, played by the ill-fated Jon de la Torre, arriving just a little too late in the fictional museum’s “Hall of the Pharaohs.” And there was the empty sarcophagus, and nearby, the man clad in the robes, his hands around the throat of femme fatale Dianna Breen, played by the equally ill-fated Audrey Grant. Snakes—Egyptian cobras—abounded on the floor, and Sam would have to make his way through them if he was to have any chance of saving Dianna.\u003c/p\u003e\n\u003cp\u003eAlistair stared at the scene and blinked; he could have sworn he saw one of the snakes move.\u003c/p\u003e\n\u003cp\u003e“Hey,” Jenny said, pushing against his back.\u003c/p\u003e\n\u003cp\u003e“What?” Alistair asked, distracted. He kept staring at the tableau.\u003c/p\u003e\n\u003cp\u003e“The door is open. The door to the studio is open!” she told him, speaking softly.\u003c/p\u003e\n\u003cp\u003eHe turned to look down to the end of the hallway. The door into the basement of the special-effects studio stood ajar. He frowned; it should have been locked. His father and upper-level management were adamant about the rules when it came to lockdown.\u003c/p\u003e\n\u003cp\u003eHe glanced at Jenny. For a moment she seemed to look like every femme fatale who had ever graced a movie screen. There was something wrong here. He was being played, he thought, really played. Perhaps punked. There could be cameras somewhere that he didn’t know about and other people ready to break into laughter. Yes, he was a fool, ready to do anything for a woman’s touch. And, as in so many film noir scenarios, the woman was luring him to his doom. At least that was how it felt in his fearful and overheated imagination.\u003c/p\u003e\n\u003cp\u003eBut there was something else about the night, the way the tableau seemed alive. Something that sent a chill raking his bones.\u003c/p\u003e\n\u003cp\u003eHe warned Jenny with a glance that he was wise to the situation.\u003c/p\u003e\n\u003cp\u003eBut when he started through the door to the studio he heard Jenny scream.\u003c/p\u003e\n\u003cp\u003eWhen he turned around, he was so stunned that at first his jaw just dropped.\u003c/p\u003e\n\u003cp\u003eThe robed killer—the evil priest, Amun Mopat—had come down from the Sam Stone tableau. The thing seemed to have no face. There was only blackness where a face should have been. He, it, stood behind Jenny, and seemed to be staring at him, but it had no eyes….\u003c/p\u003e\n\u003cp\u003e“Hey!” He wanted to scream. The sound came out like a croak.\u003c/p\u003e\n\u003cp\u003eAn act. It had to be part of an act.\u003c/p\u003e\n\u003cp\u003eA hand appeared, brandishing a long knife.\u003c/p\u003e\n\u003cp\u003eIt was a special-effects studio, for God’s sake! Someone was playing a game, he told himself, maybe even at his father’s request. Maybe his dad had suspected him of doing something like this, hoping for a hot night with his girlfriend….\u003c/p\u003e\n\u003cp\u003eThe knife looked very real.\u003c/p\u003e\n\u003cp\u003e“Hey, enough! Let her go!” Alistair said, willing his feet to move toward Jenny and her costumed attacker.\u003c/p\u003e\n\u003cp\u003eJenny was no movie femme fatale. She implored him, her blue eyes wide and filled with terror. “Alistair!” His name was a shriek of panic.\u003c/p\u003e\n\u003cp\u003e“Enough!” he roared again.\u003c/p\u003e\n\u003cp\u003eThen he stood dead still. The thing attacked and, with a hard, quick motion, drew the blade across Jenny’s throat. Blood didn’t merely leak from the wound; it spurted. Her scream died in choking sounds that accompanied the blood, and it was cut off within seconds.\u003c/p\u003e\n\u003cp\u003eThere was a scent in the air. Hot and tinny and fetid.\u003c/p\u003e\n\u003cp\u003eBecause it wasn’t stage blood being spewed.\u003c/p\u003e\n\u003cp\u003eThe costumed form dropped Jenny and moved toward Alistair.\u003c/p\u003e\n\u003cp\u003eHe’d spent his life among the creepy and the macabre, the greatest movie heroes and most terrifying villains. Monsters, vampires, ghosts, alien slime…\u003c/p\u003e\n\u003cp\u003eBut something within him—logic, reason—turned off, his terror was so great.\u003c/p\u003e\n\u003cp\u003eAnd he fell toward the floor as blackness seemed to overwhelm his vision.\u003c/p\u003e\n\u003cp\u003eHe fell into a pool of blood. And he knew, from its smell, that no, it wasn’t part of any special effect.\u003c/p\u003e\n\u003cp\u003eIt was Jenny’s death, all bloody. Bloody, and real.\u003c/p\u003e\n\u003cp\u003eVengeance.\u003c/p\u003e\n\u003cp\u003eIn Hollywood, every character needed a name.\u003c/p\u003e\n\u003cp\u003eVengeance was a good name.\u003c/p\u003e\n\u003cp\u003eAnd so Vengeance stood hidden, watching, feeling such a sense of glee, it was almost frightening. The scent of blood remained; the first few minutes after the scene were all but imprinted on the moving reels of memory.\u003c/p\u003e\n\u003cp\u003eMost people would consider the act, and Vengeance, crazy. Stone-cold crazy. But that wasn’t the case. Crazy could not have worked out all the technicalities and the precise timing that had been necessary.\u003c/p\u003e\n\u003cp\u003eCrazy could not have figured out everything that was needed to pull off the stunt.\u003c/p\u003e\n\u003cp\u003eCrazy could never act it all out, as it must now be acted out….\u003c/p\u003e\n\u003cp\u003eBut it had gone better than could possibly be imagined. The girl…the blood.\u003c/p\u003e\n\u003cp\u003eAnd Alistair Archer, slipping, falling, knocking himself out.\u003c/p\u003e\n\u003cp\u003eThen waking, screaming…racing to the guard station.\u003c/p\u003e\n\u003cp\u003eAnd now…the blare of sirens in the street.\u003c/p\u003e\n\u003cp\u003eCops would soon be crawling all over the place. But the cops would never suspect. Because the cops didn’t know the studio, and the cops didn’t know the past, and the cops would never recognize the brilliance that was bringing it all to fruition.\u003c/p\u003e\n\u003cp\u003eAh, tomorrow!\u003c/p\u003e\n\u003cp\u003eTomorrow…\u003c/p\u003e\n\u003cp\u003eTomorrow, Vengeance would become normal, ordinary, once again. Vengeance would throw off the assumption of superpersonality, sympathize, go about day-to-day business….\u003c/p\u003e\n\u003cp\u003eAnd no one would ever, ever know.\u003c/p\u003e\n\u003cp\u003eNot in this lifetime.\u003c/p\u003e\n\u003cp\u003eVengeance smiled, and Vengeance actually laughed aloud in the night; no matter, because Vengeance couldn’t be heard.\u003c/p\u003e\n\u003cp\u003eIt was all too good to be true….\u003c/p\u003e\n\u003cp\u003eTime to move, but Vengeance needed to savor the moment. Alone in the dark, watching…\u003c/p\u003e\n\u003cp\u003eVengeance was good, and vengeance was sweet.\u003c/p\u003e\n\u003cp\u003eAnd Vengeance had just begun.\u003c/p\u003e\n\u003cp\u003e1\u003c/p\u003e\n\u003cp\u003eMadison Darvil wasn’t really awake when the phone rang. She was in that delightful stage of half sleep, when the alarm had gone off…but the snooze button was on and she had a few minutes to lie lazily in the comfort of her bed before rising. Her phone was loud and strident. She rolled over groping for it, swearing softly as it dropped to the floor and she had to lean down to get it, banging her head on the bedside table.\u003c/p\u003e\n\u003cp\u003e“Shit!” she muttered, and was further humiliated when she realized she’d hit Answer as she’d picked up the phone—and the caller had heard her.\u003c/p\u003e\n\u003cp\u003e“Hello?” she said frowning. Seven thirty-three. Who was calling this early?\u003c/p\u003e\n\u003cp\u003eShe could hear a soft chuckle, and then someone clearing his throat. “Madison?”\u003c/p\u003e\n\u003cp\u003eInwardly, she groaned.\u003c/p\u003e\n\u003cp\u003e“Yes, Alfie?” Alfie Longdale was her assistant at the studio. She loved the fact that she had an assistant and she loved Alfie. One day, he was going to rule the world, his eye for detail was so exceptional. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unholy-krewe-of-hunters-6/page-2.html","bookId":2280,"creation":"Oct 5, 2019 5:43:02 PM","modification":"Oct 5, 2019 5:43:02 PM"}
