{"id":90465,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe disappeared into the kitchen and then popped her head back out, continuing with “…a questionable red wine and an Irish beer in bottles.”\u003c/p\u003e\n\u003cp\u003e“Sounds like a pretty good bar to me,” he said. “I’ll take an Irish beer.”\u003c/p\u003e\n\u003cp\u003eHe heard her in the kitchen, despite the fact that the television was on.\u003c/p\u003e\n\u003cp\u003e“Have a seat,” she called to him.\u003c/p\u003e\n\u003cp\u003eHe did. The second he was seated, a ball of fur leaped up beside him and gazed at him with mammoth cat eyes. “Hey, it’s cool, I like cats,” he said in a low voice.\u003c/p\u003e\n\u003cp\u003e“Don’t mind Ichabod!” she called.\u003c/p\u003e\n\u003cp\u003e“I like animals!” he assured her, speaking more loudly.\u003c/p\u003e\n\u003cp\u003eBut as he stroked the cat, he felt an odd presence. He turned and realized he was right.\u003c/p\u003e\n\u003cp\u003eMadison was not residing in the bungalow by herself—and it wasn’t just the cat who was residing with her.\u003c/p\u003e\n\u003cp\u003eThere was a man seated at the far end of the sofa, watching him gravely.\u003c/p\u003e\n\u003cp\u003e“I Love Lucy,” the man said. “Love that show. The physical comedy is exceptional. Ah, Lucille! She had some major talent.”\u003c/p\u003e\n\u003cp\u003eSean just nodded, incredulous. “Bogie?” he whispered.\u003c/p\u003e\n\u003cp\u003eShe wasn’t alone. He hadn’t merely dropped her off—he was inside the house with her!\u003c/p\u003e\n\u003cp\u003eVengeance was irritated. Sean Cameron. Everyone hero-worshipped the bastard.\u003c/p\u003e\n\u003cp\u003eCould have been a movie star, excellent leader and team player, brilliant, artistic, talented…\u003c/p\u003e\n\u003cp\u003eFBI?\u003c/p\u003e\n\u003cp\u003eVengeance was thoughtful; it was said that Cameron had left because a friend was dying. A woman. Although they’d been apart, she’d been the love of his life. So he’d gone home to Texas. Texas. Cowboys and guns and ranches…\u003c/p\u003e\n\u003cp\u003eThen he’d joined the FBI. But he was back.\u003c/p\u003e\n\u003cp\u003ePanic set in. No, just stick to the plan—with Madison now part of the scenario. It was very film noir. She wasn’t the love of Cameron’s life, but…\u003c/p\u003e\n\u003cp\u003eIt made vengeance all the sweeter.\u003c/p\u003e\n\u003cp\u003eLet him know….\u003c/p\u003e\n\u003cp\u003eLet him know that another woman, Madison Darvil, had died.\u003c/p\u003e\n\u003cp\u003eA woman he’d brought in on the case. Or, better still…one Eddie Archer had brought in.\u003c/p\u003e\n\u003cp\u003eYes, she must die.\u003c/p\u003e\n\u003cp\u003eVengeance wasn’t sure that vengeance could wait.\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eWhy hadn’t she said NO? One gigantic NO, that would’ve done it. She could have explained that she didn’t bring people to her house, that work was separate from her private life, even when it came to saving Alistair Archer and finding a murderer. They could have gone somewhere else.\u003c/p\u003e\n\u003cp\u003eAnywhere else! She wasn’t against being with him—not at all. Under other circumstances, she would’ve loved to have had him in her house. Every moment she spent with Sean seemed to draw her closer to him, draw her further into the web of fascination he created for her. She liked being next to him, feeling the warmth he seemed to exude, feeling she wanted to come closer and closer….\u003c/p\u003e\n\u003cp\u003eThey were just working together; she was a studio guide for him, and a guide into the lives of those around Eddie, the people she might know better than he did.\u003c/p\u003e\n\u003cp\u003eAnd she really didn’t need him here! Not when Bogie was bound to tease her and cause trouble. It was going to be hard to behave normally, to pretend that the ghost of a classic film star wasn’t sitting on her sofa or leaning nonchalantly against a wall.\u003c/p\u003e\n\u003cp\u003eBut she’d tried to remain casual. She’d been nonchalant. Sure, what the hell, let’s go to my house.\u003c/p\u003e\n\u003cp\u003eBogie would behave. Bogie knew that a murder had taken place. This wasn’t like trying to destroy an evening because she was dating someone he considered a jerk. This was different. Sure, the television was on. Lots of people left their TVs on. No big deal. It was all going to be fine.\u003c/p\u003e\n\u003cp\u003eMadison dug around in her refrigerator and produced a beer for Agent Cameron. Luckily, she was so close to the studio that she brought her coworkers home for weekend evenings fairly often—and Bogie always behaved then. She was well-supplied with snack food and a decent selections of drinks—alcoholic and non. Beer. Beer was easy. She had a case of Guinness her assistant had brought last Friday. Nice cold Irish beer in bottles. What about her? Hmm. Maybe she’d have something a bit harder. Like Scotch or whiskey. She looked around on the counter. She had both. A whiskey and ginger ale. Yeah.\u003c/p\u003e\n\u003cp\u003eShe poured whiskey into a glass with ice.\u003c/p\u003e\n\u003cp\u003eShe didn’t add the ginger ale. She knocked the drink back in a swallow, felt the burn and coughed. That was good. Okay, no problem. She poured herself another shot and added the ginger ale. She shook back her hair and managed to call out calmly, “It’s Guinness. You want a glass?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eShe picked up her glass and his beer and tried to sail smoothly back into the living room. Agent Cameron was seated on the couch, left side.\u003c/p\u003e\n\u003cp\u003eBogie was on the right side.\u003c/p\u003e\n\u003cp\u003eBogie offered her his charming half smile. She returned it with a warning frown.\u003c/p\u003e\n\u003cp\u003e“Here you go.” She handed Sean the beer, and took a seat in the large upholstered chair.\u003c/p\u003e\n\u003cp\u003e“Thanks,” he told her.\u003c/p\u003e\n\u003cp\u003eShe nodded. “So when does your crew get in?” she asked.\u003c/p\u003e\n\u003cp\u003e“The rest of my unit arrives tonight.”\u003c/p\u003e\n\u003cp\u003eWhy did casual conversation have to be so damned hard?\u003c/p\u003e\n\u003cp\u003eBecause she’d brought him to her house. After a trip to the morgue.\u003c/p\u003e\n\u003cp\u003eShe was insane. Totally insane.\u003c/p\u003e\n\u003cp\u003eAnd it was all worse than she’d imagined. He was staring at her. Just watching her. As if he knew something she didn’t know…\u003c/p\u003e\n\u003cp\u003eShe gave him her best effort at an expectant smile, as if she was waiting for him to tell her where they were going from here.\u003c/p\u003e\n\u003cp\u003eBut, at first, he didn’t speak.\u003c/p\u003e\n\u003cp\u003eAnd she was completely unnerved.\u003c/p\u003e\n\u003cp\u003eShe looked at her glass. She didn’t remember having gulped down the second drink.\u003c/p\u003e\n\u003cp\u003e“Wow,” she murmured.\u003c/p\u003e\n\u003cp\u003e“First trip to a morgue isn’t easy,” he said.\u003c/p\u003e\n\u003cp\u003e“No. I mean, people don’t usually drop in on the morgue,” she said.\u003c/p\u003e\n\u003cp\u003e“Of course not,” he agreed.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” Madison said, standing again and hurrying back to the kitchen. She really had to stop. She didn’t normally slurp down three shots in ten minutes. But one more…\u003c/p\u003e\n\u003cp\u003eShe made herself another drink. She would sip it, she promised herself.\u003c/p\u003e\n\u003cp\u003eOnce again, she sat in the big chair diagonally across from him. Bogie was shaking his head in some kind of warning.\u003c/p\u003e\n\u003cp\u003eShe ignored him, looking at Sean Cameron.\u003c/p\u003e\n\u003cp\u003eAnd he looked back at her.\u003c/p\u003e\n\u003cp\u003e“So, about Texas,” she said. She felt as if she was awkwardly trying to speed-date. They weren’t at a speed-dating event. They were working on a murder case. She was an artist. She could create wonderful special effects and work on her own designs and the designs of others; she was a fabricator, accustomed to fabric and foam and latex and other materials with which marvelous things could be fashioned. She knew nothing about morgues and murders.\u003c/p\u003e\n\u003cp\u003e“Texas, yes,” he said pleasantly.\u003c/p\u003e\n\u003cp\u003e“Nice state. Big state. Lots of horses, cowboys…all that.” Oh, God, she sounded like she was doing horrendously at a very bad speed-dating event.\u003c/p\u003e\n\u003cp\u003e“Yes, Texas is a big state,” he said. He seemed amused, even charmed, by her desperate rambling.\u003c/p\u003e\n\u003cp\u003eBut before she could make some other inane remark, he asked, “What did you get from the morgue? Really. Seriously.”\u003c/p\u003e\n\u003cp\u003eMadison frowned. “I got the same thing you got. Exactly what the medical examiner said. Her killer caught up with her from behind. Held her tight and slit her throat, the stroke going from left to right.”\u003c/p\u003e\n\u003cp\u003e“And?” he persisted.\u003c/p\u003e\n\u003cp\u003eShe forced herself to meet his eyes. “If he had any other facts, I didn’t hear him say so,” she said primly.\u003c/p\u003e\n\u003cp\u003eHe smiled, then looked at her again. “I want to know what Jenny Henderson said to you. If there was something I didn’t hear. She did see you, and she did speak to you. I want to know if I missed anything she said, anything at all. You never know what can help until you weigh the words of the deceased.”\u003c/p\u003e\n\u003cp\u003eHer jaw must have dropped to her feet.\u003c/p\u003e\n\u003cp\u003eHe actually reached over to tap it shut with his hand.\u003c/p\u003e\n\u003cp\u003e“Madison!” He said her name softly but firmly. “Madison, this isn’t the time to be shy about your abilities. We’ve got to get this all out in the open, now, here—and make use of everything we can throughout this case. We need whatever help there is. All the help we can get—from the living…and the dead.”\u003c/p\u003e\n\u003cp\u003eShe was still staring at him. At least her mouth was no longer gaping. But she couldn’t seem to speak.\u003c/p\u003e\n\u003cp\u003e“Please,” he said. “Eddie told me you speak with the dead. And Bogie told me he hangs around here because he loved the time he lived here—and because you’re the only one he’s come across who sees him and responds to him. He really likes you, too. But he’d haunt those he loved during his lifetime if he could.”\u003c/p\u003e\n\u003cp\u003eHer jaw dropped again. And once more, he gently tapped it shut.\u003c/p\u003e\n\u003cp\u003eShe glanced at Bogie, who was watching her gravely, and then turned back to Sean Cameron with total shock.\u003c/p\u003e\n\u003cp\u003e“I don’t know what you’re talking about,” she said harshly.\u003c/p\u003e\n\u003cp\u003e“It’s all right, kid,” Bogie said. “He sees me.”\u003c/p\u003e\n\u003cp\u003eIn torment, Madison looked from her ghost to Sean Cameron. He was studying her with his deep green eyes. Eyes that seemed to accept nothing but the truth. Challenging eyes, defying her to contradict him.\u003c/p\u003e\n\u003cp\u003eMadison couldn’t help herself; she sat rigidly silent. She didn’t want to hurt other people with what she saw, nor did she relish being ridiculed. In her entire life, she’d never come across anyone else who admitted to seeing the dead.\u003c/p\u003e\n\u003cp\u003e“You can’t begin to know how lucky you are,” Sean said, looking at Bogie with awe. “Sir, you were magic on the screen. Magic. And from everything I’ve read, you were an all-right guy, as well.”\u003c/p\u003e\n\u003cp\u003e“I had my spats with a few folks.” Bogie shrugged in that characteristic Bogie way.\u003c/p\u003e\n\u003cp\u003e“We all do,” Sean said. “Every life includes some dark spots and hard times. But, sir, the totality of your life, on-screen and off…it’s fantastic.” He suddenly turned to Madison. “Really! You can’t imagine how lucky you are to be haunted by such a legend!” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unholy-krewe-of-hunters-6/page-22.html","bookId":2280,"creation":"Oct 5, 2019 5:43:02 PM","modification":"Oct 5, 2019 5:43:02 PM"}
