{"id":90486,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLogan had been writing as Sean spoke. “I say it’s time we had her brought in. I’ll call Knox. We’ll meet them at the station.”\u003c/p\u003e\n\u003cp\u003eSean nodded. “Los Angeles may be a city of millions, but there’s been nepotism in this industry since the beginning. We may come across more people with connections to the movie.”\u003c/p\u003e\n\u003cp\u003e“We’ve got a woman with a potential motive and no real alibi,” Logan said. “We’ll talk to her. Sean, you, Kelsey and I will go. Tyler, get some sleep. If this turns into an all-nighter, you’ll be with Kat and Jane at the studio tomorrow. And Madison…” he said thoughtfully.\u003c/p\u003e\n\u003cp\u003e“Madison comes with us. I don’t want her alone.”\u003c/p\u003e\n\u003cp\u003e“I think he’s saying women aren’t tough enough,” Jane told Kat.\u003c/p\u003e\n\u003cp\u003eSean shook his head. “I am worried, and I have perfect faith in every member of this team. But I’ll feel better if Madison is with us. Besides, her take on what Benita has to say could be useful.” He looked directly at Madison. Is that okay with you?”\u003c/p\u003e\n\u003cp\u003eShe nodded but then she remembered what else she’d wanted to tell them. “Benita’s got the blood connection,” she said, “but I was just thinking about something else Oliver said. He was talking about a day Helena came in. Apparently she had her hands all over Eddie—as in, maybe dipping into his pockets.”\u003c/p\u003e\n\u003cp\u003e“Dipping into his pockets—to steal a key? Have a copy made and then replace it?” Sean asked.\u003c/p\u003e\n\u003cp\u003e“That’s how it sounds to me.”\u003c/p\u003e\n\u003cp\u003e“Let’s start with Benita,” Logan said. “I hadn’t expected to get anywhere until tomorrow, so we’ll be ahead of the game.” He paused. “Call Eddie’s house. See if you can talk to his houseman and find out if Helena is there. Make sure she’s not out and about and that we’ll be able to speak with her tomorrow. If she is there, just lie. Say you’re calling to ask how she and Eddie are doing. We won’t tell her we need to speak with her again. I don’t want to spook her.”\u003c/p\u003e\n\u003cp\u003eSean made the call, waiting as Pierce went to check on Mr. and Mrs. Archer. Then he hung up. “Pierce said that both Archers retired soon after Eddie got home. They had a quiet dinner and went to bed.”\u003c/p\u003e\n\u003cp\u003e“Let’s go talk to Benita,” Logan said.\u003c/p\u003e\n\u003cp\u003eBenita Lowe was at the police station when they arrived; she’d come in just minutes after Knox had called her.\u003c/p\u003e\n\u003cp\u003eSean spoke with the detective before going in to question her. He’d been assigned the task, since the interview would seem the friendliest and least threatening if he were to do it.\u003c/p\u003e\n\u003cp\u003eWhen he sat across from her at the table, she raised her brows and a smile slowly curved her lips.\u003c/p\u003e\n\u003cp\u003e“Am I a suspect now?” she asked him.\u003c/p\u003e\n\u003cp\u003e“Not really or no more so than anyone else at the moment,” he said, settling into his chair. “It’s just that some interesting information has come up—regarding you.”\u003c/p\u003e\n\u003cp\u003eShe leaned toward him. With her catlike grace, Benita could be extremely sensual and charming when she wanted, and her amusement seemed real.\u003c/p\u003e\n\u003cp\u003e“What, exactly?” she asked him. “The fact that I’m bisexual, or that my great-grandfather was Pete Krakowski? I’m sure you’ve discovered that by now.”\u003c/p\u003e\n\u003cp\u003e“I’m embarrassed to say we just discovered it tonight. I’m surprised more people don’t know,” Sean told her.\u003c/p\u003e\n\u003cp\u003eShe shrugged elegantly. “Why would that be? I couldn’t see how it would benefit me to advertise that I’m distantly related to some minor actor who ran around all over the place, drank like a fish and wound up dead on a set, electrocuted. Frankly, it’s something I’d just as soon not have out there, you know? And I doubt anyone cares. I’m assuming other people can hear this conversation, so…” She paused, waving to whoever might be standing behind the two-way mirror that separated them from the police observers. “Hey, you guys! That’s not for the news—not until I’m really rich and famous, all right?”\u003c/p\u003e\n\u003cp\u003e“These conversations aren’t for public consumption, Benita,” Sean assured her.\u003c/p\u003e\n\u003cp\u003eShe smiled. “You know what, Sean? I really do care about Eddie. And, believe it or not, I honestly thought we’d make a go of our marriage. Granted, there are certain little idiosyncrasies about me…if you choose to see it that way. Personally, I consider myself a freethinker and a freewheeler, and the world is my oyster. Leave it to Eddie! The majority of men would give their eyeteeth to be in a threesome. Not Eddie. I love him, Sean. I really love him. And I care about Alistair, which is more than I can say for Helena.”\u003c/p\u003e\n\u003cp\u003e“But you and Helena are friends.”\u003c/p\u003e\n\u003cp\u003e“We were friends, once,” Benita said. “Now she’s afraid of me, threatened by me. Look, I swear to you—I wouldn’t hurt Eddie, and I wouldn’t hurt Alistair, and I never even met Jenny Henderson. Come on, Sean. You know me.”\u003c/p\u003e\n\u003cp\u003e“I know pretty much everyone involved with the studio,” he told her. “And I’m not accusing you of anything. I’m asking you to help me.”\u003c/p\u003e\n\u003cp\u003e“People don’t always mean to, but they talk.” She leaned close to him again, as if they were conspirators. “I understand you’ve been prowling around in the basement at the studio. Can you imagine me in the basement, Sean? Seriously?”\u003c/p\u003e\n\u003cp\u003e“It’s what we least imagine that often proves to be true.”\u003c/p\u003e\n\u003cp\u003eShe shook her head vehemently. “Me—in dirty, dusty places filled with spiderwebs? Not in this lifetime.”\u003c/p\u003e\n\u003cp\u003e“Maybe that’s not characteristic of what you’d do, Benita, but revenge could be a factor here,” Sean said. “Revenge for Pete Krakowski’s death. And maybe there’s more than one person involved in this—one person to do the deed and another to work on cleanup or alibis or—”\u003c/p\u003e\n\u003cp\u003e“Well, that’s a great theory, Sean,” she broke in. “Except what I heard from my grandmother is that Pete Krakowski was a drunk who gave nothing to his family and cheated on his wife from here to eternity—when he wasn’t knocking the crap out of her. The best thing he ever did was die on that set and leave his wife a nice settlement. And…” She drew the pad and pencil that lay on the table toward her. “I’m giving you two names. Two. They’re both my alibi.” She looked into his eyes. “We were together all night. You’re welcome to verify my alibis for Sunday night—just do it discreetly, huh? Some people prefer to keep their private lives private.”\u003c/p\u003e\n\u003cp\u003eSean wasn’t sure if he was relieved by the conversation and Benita’s easy assurance that she had an alibi, or disappointed. Relieved, he decided. He liked her, with all her brash—and perhaps honest—ways.\u003c/p\u003e\n\u003cp\u003eGut instinct. He believed her. But…she was an actress.\u003c/p\u003e\n\u003cp\u003e“Thank you for coming in, Benita, and thank you for providing these names. We’ll be discreet, I promise.”\u003c/p\u003e\n\u003cp\u003eShe rose to leave. When she walked out, she saw Madison waiting with Logan and Kelsey.\u003c/p\u003e\n\u003cp\u003eShe smiled, and glanced back at Sean. “I guess you two have a lot in common,” she said, “what with the special effects and all.” She paused, saying good-night to Knox, Kelsey and Logan. “If you need me, you know where to find me.”\u003c/p\u003e\n\u003cp\u003eWhen she’d left, Knox turned to Sean, perplexed. “Sure as hell sounded as if she was telling the truth. So, you want the current wife brought in tomorrow?”\u003c/p\u003e\n\u003cp\u003e“Yes. We’ll just tell her it’s important we speak with her, and that we’re hoping she can fill in some details we need about other people. With luck, that’ll get her in here without calling her lawyer and making things difficult,” Sean said.\u003c/p\u003e\n\u003cp\u003e“Tomorrow.” Knox yawned. “I’m used to putting in some serious time, but we do have other shifts. You people are dedicated, not to mention workaholics.”\u003c/p\u003e\n\u003cp\u003e“Only on a case like this,” Logan said. “Yeah, we’re the first shift, the second and the third.”\u003c/p\u003e\n\u003cp\u003eAs Logan drove them back to the hotel, Madison asked Sean, who sat in the back with her, “Do you really think that two people were involved?”\u003c/p\u003e\n\u003cp\u003e“Maybe. I don’t understand why time was erased on the security footage, unless it was done just to throw us off.”\u003c/p\u003e\n\u003cp\u003e“I think we might have one psycho ready to kill—and one with another agenda,” Logan said. “Or is one simply using the other? I don’t know. Or perhaps they both stand to gain from the killing.”\u003c/p\u003e\n\u003cp\u003eSean met Logan’s eyes in the rearview mirror.\u003c/p\u003e\n\u003cp\u003e“I can’t imagine one person close to Eddie being guilty, much less two,” Madison was saying. “But suppose you’re right. You mean that one person did the actual killing and someone else made it possible? Maybe someone just hired a killer.”\u003c/p\u003e\n\u003cp\u003eSean shook his head. “I don’t think so. It was too carefully orchestrated. The tunnel, the robe, the catacombs, the basement—as we’ve said all along, it had to be someone with real knowledge of the studio. And even hiring someone… That someone had to know how to get around the place and have a good alibi.” He sighed. “Those two missing minutes are still driving me crazy. I’m convinced the killer always planned to use the tunnels, and I’m beginning to believe the security footage was erased to send us in the wrong direction.”\u003c/p\u003e\n\u003cp\u003eThey stopped for takeout along the way; when they returned they met briefly in the center room to divide up the food. Bogie was still with Jenny Henderson, both reclining on the suite’s sofa across from the TV. Jenny seemed…almost alive.\u003c/p\u003e\n\u003cp\u003e“Bogie’s been telling me the most fantastic Hollywood tales!” she told them.\u003c/p\u003e\n\u003cp\u003e“That’s great, Jenny,” Madison said, smiling.\u003c/p\u003e\n\u003cp\u003e“And we’ve been thinking, of course. Trying to come up with anything else that might help,” Jenny said.\u003c/p\u003e\n\u003cp\u003eThe television was on. They were watching a rerun of The Danny Thomas Show.\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, and watching television,” Bogie said.\u003c/p\u003e\n\u003cp\u003eSean grinned. “That’s okay.”\u003c/p\u003e\n\u003cp\u003e“Did you get anything?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unholy-krewe-of-hunters-6/page-43.html","bookId":2280,"creation":"Oct 5, 2019 5:43:02 PM","modification":"Oct 5, 2019 5:43:02 PM"}
