{"id":90489,"no":47,"title":"Page 47","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSean studied the chapel. Once upon a time, it had been consecrated as St. Bartholomew’s. But the parishioners had long outgrown the building and the area; St. Bartholomew’s was closer to downtown L.A. now and the chapel here was nondenominational. Eddie allowed them to use the building rent-free, as a place for services to be held or for mourners to say their prayers.\u003c/p\u003e\n\u003cp\u003eSean had been inside once, years before, accompanying a friend to a funeral service. It was larger than the typical funeral chapel, but then it had begun life as a real church. The main aisle led up to a raised altar, while side aisles converged at the back, where the one-time choir might gather before entering. There were monuments above the walls. The pastor who had first reigned over the old congregation had originally been buried beneath the altar but his remains had been relocated, along with the congregation.\u003c/p\u003e\n\u003cp\u003eWhen he entered by the main doors, Sean thought it had been and still was a beautiful place, with just the right poignancy in the decor. The pews were hardwood with dark crimson cushions for kneeling in prayer, and the walls were divided into eight panels, which held Tiffany windows of clear glass with images etched into them—doves, lambs, olive branches and, closest to the altar, looking across at each other, a pair of angels.\u003c/p\u003e\n\u003cp\u003eSean walked down the aisle to the altar. He paused for a minute, turning to get a feel for the size and scope of the chapel, and its relationship to the studio and the Black Box Cinema. It was possible that tunnels stretched from the chapel to the other buildings.\u003c/p\u003e\n\u003cp\u003eThere was nothing to be seen in the empty church so he went around to the left-side aisle and through a door. He noted that in the rear of the church—where one might enter without being seen by the congregation—was a door.\u003c/p\u003e\n\u003cp\u003eThe staging area for the chapel was in darkness. There weren’t huge cut-glass windows here to let in the sunlight. Two wall lamps were aglow, one on his side and one on the other side. The rear of the chapel was apparently used by the cemetery maintenance workers; several wheelbarrows were lined up against the back wall, a pile of sod waiting to be laid, and shelves holding vases. There were cones that advised Construction Area on the far side of the room. He walked over, trying to see what the construction might be, but nothing gave him a real indication. The place was old and well-maintained, but earthquakes, big and little, had shaken the area over the years, and old foundations always needed to be shored up.\u003c/p\u003e\n\u003cp\u003eHe looked around, waiting for his eyes to get accustomed to the light.\u003c/p\u003e\n\u003cp\u003eOnce they did, he saw a shelf near the pile of sod, and a number of old wooden signs piled up beside it. He dug through them. Several advertised restrooms in one way or another. Ladies, Gentlemen, Men’s, Women’s. He saw two doors on the right side, one with a large W and the other a large M. He opened both doors to assure himself that the rooms were indeed for the purpose advertised.\u003c/p\u003e\n\u003cp\u003eBack at the shelf, he dug deeper. At last he found one that read Crypt.\u003c/p\u003e\n\u003cp\u003eHe took a second to look around again; he saw no stairs, and nothing that indicated a crypt.\u003c/p\u003e\n\u003cp\u003eFrustrated, he returned to the rooms with the large W and the large M.\u003c/p\u003e\n\u003cp\u003eNothing, except that when he stood outside, he realized that the depth of the rooms didn’t match up with the distance between them.\u003c/p\u003e\n\u003cp\u003e“This place is full of false walls,” he muttered aloud. He studied the wall, tapped on it and shook his head. The crypt stairs had been covered over long ago.\u003c/p\u003e\n\u003cp\u003eHe went into the women’s toilet. There was an old dressing table with a mirror behind it. He shoved aside the table and the mirror, uncovering an old pocket door. A large sign read Danger! No Entry.\u003c/p\u003e\n\u003cp\u003eSean slid the door open.\u003c/p\u003e\n\u003cp\u003eA set of dark stairs led downward, into the darkness of the crypt.\u003c/p\u003e\n\u003cp\u003eMadison stood and smiled at Lucas Claymore. She lifted a hand in greeting, and walked slowly toward him, afraid he would disappear.\u003c/p\u003e\n\u003cp\u003e“Mr. Claymore!” she greeted him quietly. “Good morning, sir.”\u003c/p\u003e\n\u003cp\u003eClaymore didn’t run. He watched her sadly as she approached, then he looked over her shoulder at Logan Raintree. “You work at my studio,” he said to Madison. “What used to be my studio, I should say.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“Something terrible has happened,” Claymore said.\u003c/p\u003e\n\u003cp\u003e“Yes, sir.” Logan nodded.\u003c/p\u003e\n\u003cp\u003eFor a moment, Claymore became sheer, and almost disappeared in the breeze that moved softly around them.\u003c/p\u003e\n\u003cp\u003e“We’re trying to discover the truth, Mr. Claymore,” Madison said.\u003c/p\u003e\n\u003cp\u003e“I don’t have the truth to give you.” Claymore sounded sad, even distressed. “People come and people go. There are lights, there are noises, but…”\u003c/p\u003e\n\u003cp\u003e“Mr. Claymore, hundreds of bodies are buried in the catacombs that stretch out from the studio and the cinema,” Logan said.\u003c/p\u003e\n\u003cp\u003e“Yes, of course.”\u003c/p\u003e\n\u003cp\u003e“Of course?”\u003c/p\u003e\n\u003cp\u003e“That was long ago, so long ago,” Claymore said. “But I don’t know everything. The property was really my father’s, and he died…oh, years past. People were flocking here, you know.” He sighed. “And then the Depression came. Followed by the war. Most of the burials are very old. Back in the thirties, when there was no social security…no assistance for the poor. My father was a good man. When he could no longer help the living, he helped the dead. He wasn’t alone in what he did.”\u003c/p\u003e\n\u003cp\u003e“Who helped him?” Madison asked Claymore.\u003c/p\u003e\n\u003cp\u003e“Why, the Reverend Parker. He was over at St. Bartholomew’s. He’s been dead for years, too.”\u003c/p\u003e\n\u003cp\u003eLogan turned to Madison. “There’s where the tunnels begin,” he said. “The church.”\u003c/p\u003e\n\u003cp\u003e“Ah, well, those tunnels have been closed up forever.” Lucas Claymore sighed again. “You couldn’t have people wandering from a film noir movie into a graveyard now, could you? And Reverend Parker lived a very long life. When he felt it coming to an end, we had the crypt closed off. No one goes down there now. Trust me, I had power in my day. I saw to it that the crypts were kept closed, and that even if the church opened them, there was no access to the studio. Everyone was careful not to let the truth be known. If people had found out, they would have come in. They would’ve dragged up the dead, who might have ended up in museums, in drawers, like all the specimens they have at the Smithsonian,” he said, staring at them as if trying to make sure they understood.\u003c/p\u003e\n\u003cp\u003e“I think that someone who’s very much alive has discovered the secret of the tunnels, Mr. Claymore.”\u003c/p\u003e\n\u003cp\u003eClaymore made a strange sound that, if he’d been living, would have been a disdainful sniff. “That one!” he said, shaking his head.\u003c/p\u003e\n\u003cp\u003e“That one—who?” Madison asked.\u003c/p\u003e\n\u003cp\u003eClaymore said, “I saw Eddie Archer with you, young lady. I was glad. He’s done the studio proud. But…that one he’s married to now. She came here. She traipsed around. She lit a cigarette in my vault and crushed it out on the floor. She was always waiting for someone here. And she’d be on the phone, yakking away. She was up to something, you mark my words.”\u003c/p\u003e\n\u003cp\u003e“Have you ever seen her in the chapel, Mr. Claymore?” Logan asked.\u003c/p\u003e\n\u003cp\u003eClaymore shook his head. “I don’t stand around here all day, young man. I don’t watch people endlessly. Sometimes I come because it’s beautiful and peaceful, and I love this land. I can’t tell you more than that.”\u003c/p\u003e\n\u003cp\u003eLogan was already tugging at her arm. “Let’s go,” he said. He pulled his phone from his pocket and started dialing.\u003c/p\u003e\n\u003cp\u003e“Thank you, Mr. Claymore!” Madison called back.\u003c/p\u003e\n\u003cp\u003e“Thank you, yes, thank you so much!” Logan said. “Damn!” he muttered as they hurried across the cemetery.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Sean isn’t answering,” he told her. “He’s got to be out of contact. The wretched things worked in the tunnels by the studio, but…”\u003c/p\u003e\n\u003cp\u003eFear instantly wrapped icy fingers around her heart. “He’s here—you said he’s here, in the cemetery somewhere. Why haven’t we seen him, Logan? Why hasn’t he answered?”\u003c/p\u003e\n\u003cp\u003e“He’s probably in the chapel. I know he was here. Maybe he thought a chapel that was once a church might have a crypt. And that chapel’s a very old building. There might be something blocking cell phone reception. But don’t worry—we’ll find him. He’s a well-trained agent, and he’s going to be fine. Now, you, on the other hand, stay close to me.”\u003c/p\u003e\n\u003cp\u003eShe didn’t intend to do anything foolish. Logan Raintree was tall and long-legged and he kept up with her easily as she ran through the cemetery. When she nearly tripped over a gravestone, he was there to catch her.\u003c/p\u003e\n\u003cp\u003e“Madison, I’m sure Sean’s fine,” he said.\u003c/p\u003e\n\u003cp\u003e“Yes, I am, too.”\u003c/p\u003e\n\u003cp\u003eHe smiled, holding her arm. “We’ll walk quickly—but we walk, okay?”\u003c/p\u003e\n\u003cp\u003eShe nodded, feeling chastised but knowing he was right.\u003c/p\u003e\n\u003cp\u003eWhen they got close to the chapel, she drew ahead again, calling Sean’s name as they hurried in. Entering the building, she heard the echo of her voice against the old stone walls. Sean didn’t answer.\u003c/p\u003e\n\u003cp\u003e“Come around here,” Logan said, moving past her down the aisle.\u003c/p\u003e\n\u003cp\u003eShe followed him and then entered the sacristy, or staging area, for the church. “Watch it! There are lights, but it’s dangerous back here.”\u003c/p\u003e\n\u003cp\u003e“We didn’t ask Lucas where to find the crypt!” Madison said.\u003c/p\u003e\n\u003cp\u003eShe walked around and saw a maintenance area. Some of the flooring had been roped off.\u003c/p\u003e\n\u003cp\u003e“I wonder what happened here, or what they’re doing.”\u003c/p\u003e\n\u003cp\u003eLogan joined her. “It doesn’t look like they’re doing anything yet. Someone who works here might have realized that the flooring is treacherous. They’ve probably asked for a structural engineer to come in.\u003c/p\u003e\n\u003cp\u003eMadison walked over to the area that had been roped off. “The ground looks damp. Maybe they had a leak,” she said.\u003c/p\u003e\n\u003cp\u003e“Maybe. I heard it was bizarrely wet last month, lots of rain. But that’s good. It’ll help keep the fires down this summer.” Logan was trying his phone. “Doesn’t work in here, either,” he muttered. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unholy-krewe-of-hunters-6/page-47.html","bookId":2280,"creation":"Oct 5, 2019 5:43:02 PM","modification":"Oct 5, 2019 5:43:02 PM"}
