{"id":90492,"no":50,"title":"Page 50","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I think she was involved. How involved, I don’t know.”\u003c/p\u003e\n\u003cp\u003eHe stopped at the cars and looked back at Mike. “You’re going to manage, keeping the studio open?”\u003c/p\u003e\n\u003cp\u003e“As long as Andy and Eddie tell me to, I’ll manage. Somehow. And, of course, as long as the police let me. Will they close us down again, do you suppose?”\u003c/p\u003e\n\u003cp\u003e“They’ve closed the cemetery for the day, and a couple of cops—as well as my team—will hang around there. This particular investigation could go on for a while, so I don’t expect that anyone will ask you to close, not for the next few days, anyhow. If at all.”\u003c/p\u003e\n\u003cp\u003e“Then I’m going back to work,” Mike said. “See you later, Sean. Thanks for becoming—whatever it is you’ve become in the FBI.”\u003c/p\u003e\n\u003cp\u003eSean watched him go. He remembered working for Mike Greenwood, a steady guy who never raised his voice. He was pretty sure Madison felt the same way. He waved to Mike as Mike revved his car, murmuring, “I always was what I am now, Mike. I always was.”\u003c/p\u003e\n\u003cp\u003eHe slid back into the Prius and eased into traffic.\u003c/p\u003e\n\u003cp\u003eAs he drove, a call from Jane advised him that Logan had arranged for a meeting with Oliver Marshall at the police station as soon as Oliver was finished shooting for the day. He expected to be available in about four hours.\u003c/p\u003e\n\u003cp\u003eSean mused that Oliver Marshall was heading into the glare of major stardom. Why would he be involved in a case like this?\u003c/p\u003e\n\u003cp\u003eBut who ever really knew what drove another human being? Who could tell what perceived slights and wrongs motivated acts of vengeance or bitterness? And if Oliver wasn’t involved, he still might know something they didn’t.\u003c/p\u003e\n\u003cp\u003eHow well had Oliver Marshall been acquainted with Helena LaRoux?\u003c/p\u003e\n\u003cp\u003eHe hoped they were going to find out. But for the time being, he planned to get back down to those tunnels.\u003c/p\u003e\n\u003cp\u003eThey were connected to the studio. He wanted to figure out just how and where. It was becoming evident to him that the killer had used the tunnels, certainly to make his escape.\u003c/p\u003e\n\u003cp\u003eThe killer had known the studio backward and forward and had some connection to it. Helena had managed to get the basement key for the killer and she’d probably been the one to reveal that Alistair would be at the Black Box Cinema—and that Jenny would join him. Sean didn’t just need to know who was familiar with the studio and the Black Box; now he also needed to know who’d been privy to the information about Peace Cemetery.\u003c/p\u003e\n\u003cp\u003ePeople were, naturally enough, tense. But whether anyone had tried to hush up the news about the discovery of Helena’s body, Madison had no idea. She did notice that she wasn’t included in most of the whispering among her coworkers. As they day wore on, she often caught them staring at her, and then quickly looking away.\u003c/p\u003e\n\u003cp\u003eShe couldn’t help being aware of them as she worked on Oliver Marshall’s costume with Alfie. He was holding the rubber shield in place on the shirt material while she stitched it in. Simple task, but because of the type of fabric and the need for perfect positioning so that Oliver and his stunt double could rip up his clothing and be clad as an Egyptian warrior, the work required two people.\u003c/p\u003e\n\u003cp\u003e“Everyone’s staring at you,” Alfie told her.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“They think you’re in the know,” Alfie said, “and, of course, you are. Scary. I would’ve died! You found her—ugh. Weird. Do you have, like, corpse radar or something?”\u003c/p\u003e\n\u003cp\u003e“Alfie, I fell through bad flooring!”\u003c/p\u003e\n\u003cp\u003e“How weird! She left a suicide note in her car, then took herself down to some hidden crypts to kill herself. On the other hand, she never did seem really normal. No, wait, for Hollywood, she was normal, trying to play the climb-up-the-ladder game. I just don’t get it, though. Can you imagine how she must have done this? Oh, but wait, she’d definitely know Alistair’s and Eddie’s habits, what they were up to and stuff like that. She’d know how to use the security equipment…maybe. I never thought of her as a technical genius. Actually, I never thought of her as a genius at all.”\u003c/p\u003e\n\u003cp\u003e“I guess we’ll never know now, will we, Alfie?” she asked, looking up at him.\u003c/p\u003e\n\u003cp\u003e“So, you think it’s going to end? I mean, they’re keeping the studio open. First, one corpse, and Alistair is arrested. Then Helena winds up dead! Of course, she was found in the cemetery, so that doesn’t affect the studio, but it does affect Eddie. Wow. Who’d a’ thunk?”\u003c/p\u003e\n\u003cp\u003e“To the best of my knowledge, it’s been decided that the studio will stay open for the next few days while they explore beneath the church. After that, I’m not sure. At least we’re open for now, so let’s get this done.”\u003c/p\u003e\n\u003cp\u003e“Yep. And there are still cops in the studio,” he said, lowering his voice. “They’re guarding the elevator shaft. And Bailey’s guarding the building entrance and marching around like a dictator, spying on everyone.”\u003c/p\u003e\n\u003cp\u003e“Well, they’re here. Makes you feel safe, right?” Madison asked.\u003c/p\u003e\n\u003cp\u003e“Madison, come on, give! You’re sleeping with the FBI, for God’s sake, you gotta know something that’s going on!”\u003c/p\u003e\n\u003cp\u003eShe glanced up at him, not really startled, but curious about how he’d figured it out.\u003c/p\u003e\n\u003cp\u003eHe just grinned at her, as pleased as the Cheshire cat.\u003c/p\u003e\n\u003cp\u003e“Alfie, the FBI keeps a lot of things silent,” she said. “Personal…relationships are irrelevant. I don’t know what’s going on, and you keep easing up on the rubber and the fabric. Hold it tight, will you?”\u003c/p\u003e\n\u003cp\u003e“Sure.” He was quiet for a few minutes. “Can we eat soon? Maybe send out for pizza?”\u003c/p\u003e\n\u003cp\u003e“Yes, Alfie, we can eat soon.”\u003c/p\u003e\n\u003cp\u003eBy the time he returned to the cemetery, the body of Helena LaRoux had been removed and was on its way to the morgue. The crime scene techs were finishing up. No one currently with the studio was still at the site. After Kelsey had driven Madison to the hotel to change and then to work, Logan had sent her over to the hospital to stay with Eddie and Alistair. Logan himself had gone back to the cemetery. Jane remained at the police station, Kat was heading to the morgue and Tyler was at the studio keeping watch.\u003c/p\u003e\n\u003cp\u003eThe cemetery director was beside himself; he’d known about the crypts, but there hadn’t been a burial or entombment there for fifty years. They hadn’t sealed off access because the supporting structure might need to be repaired or reinforced at some point. Earthquake construction codes had been strengthened since the chapel was built. The managing offices for the cemetery weren’t on the grounds but across the street. Police regularly patrolled the cemetery, which was closed to the public at dusk. They’d had a few instances of vandalism but, perhaps thanks to the studio and the Black Box being where they were, they didn’t even get a lot of kids breaking in to play pranks, and they’d never had a case of grave-robbing.\u003c/p\u003e\n\u003cp\u003eSince the young cemetery manager was an emotional wreck, he was allowed to go back to work—or home for a tranquilizer.\u003c/p\u003e\n\u003cp\u003eLogan and Sean waited, observing the crime scene techs going in and out, doing their last sweeps and bearing bags of dirt, twigs, possible footprints, fibers—minute specks of anything that might lead to the truth.\u003c/p\u003e\n\u003cp\u003eAs they watched, Logan asked, “She didn’t speak to you, did she? Helena LaRoux, I mean. Was there any sign of her…still being here with us?”\u003c/p\u003e\n\u003cp\u003eSean shook his head. “Nothing. Doesn’t mean she isn’t, but…”\u003c/p\u003e\n\u003cp\u003e“Sometimes they don’t stay.” Logan shrugged. “Sometimes they do.”\u003c/p\u003e\n\u003cp\u003e“We’ll take a trip to the morgue later,” Sean said. “I really want to go into those tunnels, though. I’m anxious.”\u003c/p\u003e\n\u003cp\u003e“Looks like we’re getting the opportunity soon,” Logan said as the lead investigator emerged.\u003c/p\u003e\n\u003cp\u003eArmed with his flashlight, Sean moved forward. Knox stood just outside the church. “I’ll keep two men on duty out here,” he said. He offered Sean a radio. “I don’t think any corpses are going to rise up and attack you, but hell, these days… This radio should work anywhere in the region of the tunnels, the cemetery, the studio.”\u003c/p\u003e\n\u003cp\u003eSean accepted it. “Thanks, Detective.”\u003c/p\u003e\n\u003cp\u003e“You want to get in there before they bring in the engineers, right?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Sean said. “Are you okay with that?”\u003c/p\u003e\n\u003cp\u003e“Well, you’ve shaken the tree, that’s for sure,” Knox said. “And LaRoux’s note proves the kid wasn’t guilty—or crazy. I say go for it. But if any of those crypts cave in, it’ll be on your head, not mine—no pun intended.”\u003c/p\u003e\n\u003cp\u003eSean gave Knox a grim smile, and he and Logan entered the church again, hurried to the rear and down to the tunnels.\u003c/p\u003e\n\u003cp\u003eThey took the stairs, pausing to study the false crypts that connected with the area where Helena had been found.\u003c/p\u003e\n\u003cp\u003e“I’ll lead. I’m getting accustomed to the spiderwebs and crypt dust,” Sean told Logan.\u003c/p\u003e\n\u003cp\u003e“Be my guest,” Logan said.\u003c/p\u003e\n\u003cp\u003e“We’re assuming that our killer entered the cinema from down here and exited the same way. So we have to find the path that goes toward the Black Box,” Sean said thoughtfully.\u003c/p\u003e\n\u003cp\u003e“There’s only one path.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so, but let’s follow this route for a while. And keep an eye on the walls. I think we’ll discover other false fronts—walls of tomb ‘shelves’ that are really doors to other corridors. This was a major undertaking. What they were doing, or so I understand, was providing services for the poor and for illegal aliens. From what I’ve heard, the old pastor really cared about people. I’m sure he gave the family members a lot of solace.”\u003c/p\u003e\n\u003cp\u003eThey’d traveled carefully for almost an hour when Sean was startled by a voice on the radio. “It’s Knox. Oliver Marshall is on his way to the station. Do you want me to interview him, or are you two coming in?”\u003c/p\u003e\n\u003cp\u003e“One of us needs to go,” Sean said.\u003c/p\u003e\n\u003cp\u003e“And no one should be alone down here. It’s far scarier than any house of horrors ever devised by a master of illusion.”\u003c/p\u003e\n\u003cp\u003eSean grinned wryly. “That’s what the Claymores were—masters of illusion.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unholy-krewe-of-hunters-6/page-50.html","bookId":2280,"creation":"Oct 5, 2019 5:43:02 PM","modification":"Oct 5, 2019 5:43:02 PM"}
