{"id":66908,"no":15,"title":"Page 15","content":"\u003cp\u003eChapter Twenty-nine\u003c/p\u003e\n\u003cp\u003eIt was after hours and we were with Sylvester. Jones T. Jones was chain smoking. Wet rings circled his armpits. For the ninth time, I told him to breathe and not to get his hopes up.\u003c/p\u003e\n\u003cp\u003e\"This feels right,\" he said for the tenth time.\u003c/p\u003e\n\u003cp\u003eIf I had told him that I suspected Sly was really a woman and I had proof that her name was Bertha, Jones would have said the same thing: this feels right.\u003c/p\u003e\n\u003cp\u003e\"Well, don\u0027t get your hopes up,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Too late, they\u0027re up. Way up. Besides, I\u0027ve lived my whole life with my hopes up. I\u0027m not afraid to get them dashed every now and then. Getting your hopes dashed builds character.\"\u003c/p\u003e\n\u003cp\u003e\"Then this might be a character-building exercise.\"\u003c/p\u003e\n\u003cp\u003e\"So be it,\" he said. \"I enjoy living life with my hopes up. Keeps me out of therapy and off of the mood-enhancers.\"\u003c/p\u003e\n\u003cp\u003eIt was after eight p.m. The store was closed for the night, and most of the lights were out. I was keenly aware that I was currently being watched by about two dozen shrunken heads. Rubber, granted. But shrunken nonetheless. And I was keenly aware that I was standing in front of a very dead man. One of the deadest men I had ever seen. Hell, if I wasn\u0027t so tough, I might have been nervous.\u003c/p\u003e\n\u003cp\u003e\"This store gets creepy at night, huh?\" said Jones. Perhaps he was a mind reader. Or perhaps he saw me look nervously over my shoulder.\u003c/p\u003e\n\u003cp\u003e\"Hadn\u0027t noticed,\" I said.\u003c/p\u003e\n\u003cp\u003e\"We hear voices at night, you know. And sometimes we show up in the morning and the displays are knocked over.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe it\u0027s mice.\"\u003c/p\u003e\n\u003cp\u003eJones wasn\u0027t listening. \"Say, do you investigate the paranormal as well?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Too bad, I could have thrown some more work your way.\"\u003c/p\u003e\n\u003cp\u003e\"More publicity for the store?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Sure,\" he said. Jones was shameless. \"I\u0027ll do whatever it takes to get more customers in through those doors.\"\u003c/p\u003e\n\u003cp\u003e\"Even make up ghost stories.\"\u003c/p\u003e\n\u003cp\u003e\"If I have to,\" he said. \"But these are real.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I said. \"Now help me move this.\"\u003c/p\u003e\n\u003cp\u003eAnd so we spent the next few minutes turning the display case away from the back wall. Soon, Jones was gasping for air, which was funny since I was the one doing all the work.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s good,\" I said.\u003c/p\u003e\n\u003cp\u003eJones\u0027s skinny body was crowding me. I glanced at him over my shoulder.\u003c/p\u003e\n\u003cp\u003e\"Sorry.\" He took a step back, but I could still feel his hot breath on my neck, which smelled a little like chicken wings and tobacco.\u003c/p\u003e\n\u003cp\u003eFor some reason, my stomach growled.\u003c/p\u003e\n\u003cp\u003eJones jumped. \"You hear that?\"\u003c/p\u003e\n\u003cp\u003e\"That was my stomach,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Oh,\" he said, but inched closer to me anyway.\u003c/p\u003e\n\u003cp\u003eWe had already moved the heavy Plexiglas case away from the wall. Ignoring Jones, I stepped around the case and examined Sly with a handy pen flashlight I kept on my key chain.\u003c/p\u003e\n\u003cp\u003eBefore me, the dead man\u0027s back looked like the surface of some bizarre, distant world, complete with gullies and basins and arroyos. The splotchy skin, which looked shrink-wrapped to his bones, rippled in corrugated waves, giving the impression of perpetual motion, which was kind of ironic for a man frozen in place for all eternity.\u003c/p\u003e\n\u003cp\u003eI stepped closer, raised the flashlight up to Sly\u0027s shoulder.\u003c/p\u003e\n\u003cp\u003eMy breath fogged on the glass before me. Next to me, Jones\u0027s own breath came quicker and faster. He was either going to climax or have a heart attack. I wasn\u0027t sure which would be worse.\u003c/p\u003e\n\u003cp\u003eExposure to the elements had caused many irregularities in Sly\u0027s skin. One such irregularity was near his left shoulder blade. It was about an inch long. A tear in his mummified flesh.\u003c/p\u003e\n\u003cp\u003eNo, not a tear. It was a clean cut.\u003c/p\u003e\n\u003cp\u003eAn unhealed knife wound.\u003c/p\u003e\n\u003cp\u003eI stepped carefully around the display case and looked the dead man in the eyes, or what was left of his eyes.\u003c/p\u003e\n\u003cp\u003e\"Howdy, Boonie,\" I whispered. \"It\u0027s been a long time.\"\u003c/p\u003e\n\u003cp\u003eChapter Thirty\u003c/p\u003e\n\u003cp\u003eI returned from my two-hour lunch break in time to see three men kick open my office door. Actually, one of them was doing the kicking; the other two hung back, crowding the upstairs iron railing. All were wearing stylish cowboy hats with the brims rolled into uselessness. Two of them were holding pistols.\u003c/p\u003e\n\u003cp\u003eTheir backs were to me. I had been climbing the exterior stairs, coming up along the side of the building. My building is L-shaped. My office is located on the top floor in the nook of the L. They hadn\u0027t seen me, and to keep it that way, I strategically stopped climbing.\u003c/p\u003e\n\u003cp\u003eNow with the door kicked open, they looked a little confused. Maybe they thought I had been hiding inside, cowering with fear. The one doing the kicking stuck his head inside the door. He popped back out and motioned the others to follow. As they spilled into my office, I climbed the rest of the stairs two at a time and removed my pistol and entered behind them.\u003c/p\u003e\n\u003cp\u003eThey were all big men, broad shouldered, wearing jeans and tee shirts. I glanced down. My doorjamb was demolished.\u003c/p\u003e\n\u003cp\u003e\"Turn around and I\u0027ll shoot,\" I said.\u003c/p\u003e\n\u003cp\u003eThey flinched, and one considered turning. I drew a bead on him. But then he thought better of it and froze. Best decision of his life.\u003c/p\u003e\n\u003cp\u003e\"Good boys. Now the two goons are to bend down slowly and set their guns on my office carpet. Ignore the sorry condition of the carpet. And, yes, that\u0027s a bloodstain in the center of the room. Don\u0027t ask.\"\u003c/p\u003e\n\u003cp\u003eThey did as they were told. And they didn\u0027t ask.\u003c/p\u003e\n\u003cp\u003e\"Okay, this next part could get tricky, and really depends on how coordinated the goons are. I want them to sort of kick their guns back to me without turning.\"\u003c/p\u003e\n\u003cp\u003eThey were both coordinated enough, kicking back their guns with their first try, although the one on the right stumbled a bit. The guns skittered to a stop next to me, and I kicked them into the far corner of the office. Actually, considering the size of my office, the far corner really wasn\u0027t that far.\u003c/p\u003e\n\u003cp\u003eI stepped around the three men and slid into my leather chair behind my desk. I held my gun loosely in front of me.\u003c/p\u003e\n\u003cp\u003e\"Everyone empty your wallets,\" I said.\u003c/p\u003e\n\u003cp\u003e\"What?\" said the third man. He was quite a bit older than the two goons. Not to mention he looked vaguely familiar. He\u0027d recently had some plastic surgery done. His cheeks were as taut as two Samoan war drums.\u003c/p\u003e\n\u003cp\u003e\"I need some cash to fix my door,\" I said. \"Unless you would prefer I call the police?\"\u003c/p\u003e\n\u003cp\u003eThey started for their wallets.\u003c/p\u003e\n\u003cp\u003e\"Not so fast. One at a time. You, on the left.\"\u003c/p\u003e\n\u003cp\u003e\"Me?\"\u003c/p\u003e\n\u003cp\u003e\"No, my left.\"\u003c/p\u003e\n\u003cp\u003e\"Who, me?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, you. You first. Nice and slow.\"\u003c/p\u003e\n\u003cp\u003eHe reached back and slowly removed a fat wallet.\u003c/p\u003e\n\u003cp\u003e\"Good, now drop it on my desk.\"\u003c/p\u003e\n\u003cp\u003eHe did so, and I went through this routine with the others. I next removed a total of two hundred and eight-two dollars. Then, using my scanner, I made copies of all three of their licenses. \"For my records,\" I said, grinning.\u003c/p\u003e\n\u003cp\u003eI tossed back the wallets and studied the photocopied licenses before me. The two young thugs were brothers; the older man was the father.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re running for a House seat,\" I said, recognizing the name.\u003c/p\u003e\n\u003cp\u003eTafford Barron looked sick to his stomach, sweat running down his too-smooth face. His sons\u0027 names were Jack and Bartholomew. Both were just a little older than I was, although certainly not as handsome.\u003c/p\u003e\n\u003cp\u003e\"Which one\u0027s Bartholomew?\" I asked.\u003c/p\u003e\n\u003cp\u003eThe one on the right - my right - nodded. \"I am.\"\u003c/p\u003e\n\u003cp\u003e\"What do you think of your parents naming you Bartholomew?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Don\u0027t mind it so much.\"\u003c/p\u003e\n\u003cp\u003eTafford said, \"Look, can we get on with this, I have things to do today.\"\u003c/p\u003e\n\u003cp\u003eI looked at the older Barron. \"Like putting together a campaign to run for Congress?\" I asked. \"Or more breaking and entering?\"\u003c/p\u003e\n\u003cp\u003e\"We weren\u0027t going to hurt you,\" he said, shrugging. \"We just wanted to talk.\"\u003c/p\u003e\n\u003cp\u003e\"So talk,\" I said.\u003c/p\u003e\n\u003cp\u003e\"We want you to back off the case,\" he said sheepishly. \"Of course, it was supposed to sound a little more menacing than that.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m hard to menace,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I gather that.\"\u003c/p\u003e\n\u003cp\u003e\"So why should I back off this case?\"\u003c/p\u003e\n\u003cp\u003e\"You mind if I sit?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I mind.\"\u003c/p\u003e\n\u003cp\u003eHe inhaled and continued standing. \"Because I\u0027ll pay you ten grand to drop the case.\"\u003c/p\u003e\n\u003cp\u003e\"Does that come out of your election fund?\"\u003c/p\u003e\n\u003cp\u003e\"Look, pal, this is serious business, and I don\u0027t want you sticking your nose where it doesn\u0027t belong.\"\u003c/p\u003e\n\u003cp\u003e\"I make a decent living sticking my nose where it doesn\u0027t belong.\"\u003c/p\u003e\n\u003cp\u003e\"Decent? Look at this dump. Take the money and get yourself a respectable office.\" He paused. His too-tight face was flushed with heat.\u003c/p\u003e\n\u003cp\u003e\"Will you also include a cowboy hat like yours?\"\u003c/p\u003e\n\u003cp\u003eHe blinked. \"Sure.\"\u003c/p\u003e\n\u003cp\u003e\"And the name of your plastic surgeon. He\u0027s done a marvelous job.\"\u003c/p\u003e\n\u003cp\u003eHe inhaled. \"Will you take the money and go away?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eHe was furious. Tafford was used to having his way. His sons were agitated, shifting from foot to foot. They were used to their father having his way.\u003c/p\u003e\n\u003cp\u003e\"Taff, did you have one of your boys ambush me in the desert a week ago?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" he said. \"I don\u0027t need any more dead bodies in my town, and I certainly don\u0027t need any more bad publicity.\"\u003c/p\u003e\n\u003cp\u003eStrangely, I believed him. Didn\u0027t seem his style to set me up in the desert, or to ambush me. He was more of the in-your-face, you\u0027ve-been-warned type.\u003c/p\u003e\n\u003cp\u003e\"Of course, getting arrested for breaking and entering wouldn\u0027t help my public image much.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Pretty stupid, in fact,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Yep,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Christ, what was I thinking?\"\u003c/p\u003e\n\u003cp\u003e\"You weren\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"We just wanted to scare you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m terrified.\"\u003c/p\u003e\n\u003cp\u003eHe shifted where he stood and looked at his open palms. He looked like a man waking from a bad nightmare. His two sons hadn\u0027t stopped staring at me. Perhaps they were soaking in what a real man should look like.\u003c/p\u003e\n\u003cp\u003eI said, \"Taff, this mess isn\u0027t going to go away by paying me off. Someone killed Willie Clarke, and someone tried to kill me. You have a killer loose in your town.\"\u003c/p\u003e\n\u003cp\u003eNow he looked just plain sick. I almost shoved my trashcan over to him in case he was going to lose his lunch.\u003c/p\u003e\n\u003cp\u003e\"Tell you what,\" he said. \"You find the killer and I\u0027ll give you the money.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like a job,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Consider it one.\"\u003c/p\u003e\n\u003cp\u003e\"When it\u0027s over, I\u0027ll send you a bill.\"\u003c/p\u003e\n\u003cp\u003eTafford nodded. \"Can we go now?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said.\u003c/p\u003e\n\u003cp\u003eAnd they did, although I kept their money. Consider it a retainer. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mummy-case-jim-knighthorse-2/page-15.html","bookId":2352,"creation":"Oct 5, 2019 10:02:49 AM","modification":"Oct 5, 2019 10:02:49 AM"}
