{"id":66915,"no":22,"title":"Page 22","content":"\u003cp\u003eChapter Forty-three\u003c/p\u003e\n\u003cp\u003eI was on my back doing crunches behind my desk when the cell rang. Not missing a beat, I reached inside my pocket, removed the phone and flipped it open.\u003c/p\u003e\n\u003cp\u003e\"Knighthorse.\"\u003c/p\u003e\n\u003cp\u003e\"What the hell\u0027s wrong with you?\" said Sherbet.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m doing crunches.\"\u003c/p\u003e\n\u003cp\u003e\"Crunches?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not easy being beautiful.\"\u003c/p\u003e\n\u003cp\u003eHe ignored me. \"We got the search warrant.\"\u003c/p\u003e\n\u003cp\u003eI stopped crunching, lay flat on the floor. \"Go on.\"\u003c/p\u003e\n\u003cp\u003e\"Jarred\u0027s prints were all over that goddamn gas cap, not to mention along the center console.\"\u003c/p\u003e\n\u003cp\u003e\"Where the cell phone might have been located.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly.\"\u003c/p\u003e\n\u003cp\u003e\"So when are you going in?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Tonight, when he gets home. He needs to be there for the search to be valid.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"But you knew that,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry. I forget some private dicks know their shit.\"\u003c/p\u003e\n\u003cp\u003e\"This one does.\"\u003c/p\u003e\n\u003cp\u003eHe was quiet. I waited. I could hear him breathing.\u003c/p\u003e\n\u003cp\u003e\"And Knighthorse?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Please tell me we won\u0027t find your prints at the condo.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t find my prints at the condo.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Have you been there?\"\u003c/p\u003e\n\u003cp\u003e\"In passing.\"\u003c/p\u003e\n\u003cp\u003eSherbet paused. If I listened closely enough I could hear his mustache lifting and falling with each breath. \"In your expert opinion, Knighthorse, is there anywhere in particular we should look once we get there?\"\u003c/p\u003e\n\u003cp\u003e\"If I were conducting the search, I would focus on the garage. Of course, that\u0027s just my expert opinion.\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" he said. \"Anything else?\"\u003c/p\u003e\n\u003cp\u003e\"I figure if he siphoned the gas, he would need a hose, and if he stole the water jugs, he would need somewhere to stash them.\"\u003c/p\u003e\n\u003cp\u003e\"Like a bag?\"\u003c/p\u003e\n\u003cp\u003e\"Would be my guess.\"\u003c/p\u003e\n\u003cp\u003eChapter Forty-four\u003c/p\u003e\n\u003cp\u003eSanchez, Jesus and I were at a Baskin Robbins near Anaheim Stadium, or whatever the stadium is called these days. I had printed out three free child scoop coupons from the internet, courtesy of a major web page celebrating its fifth anniversary. We waited twenty minutes in line along with dozens of other customers, each holding similarly printed coupons. Sanchez folded his up and put it in his pocket. I think he was embarrassed. I didn\u0027t care. Free ice cream!\u003c/p\u003e\n\u003cp\u003eAfterward, sitting at a heavily dented metallic table, Sanchez examined his child scoop of rocky road, holding the cone daintily between his thumb and forefinger. \"We spent twenty minutes in line for this?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I said, \"Isn\u0027t it great?\"\u003c/p\u003e\n\u003cp\u003eSanchez snorted.\u003c/p\u003e\n\u003cp\u003eJesus said, \"I think it\u0027s cool.\"\u003c/p\u003e\n\u003cp\u003e\"Good kid,\" I said. \"Besides, beggars can\u0027t be choosers.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a beggar,\" said Sanchez. \"I happen to have a real job with a steady income.\"\u003c/p\u003e\n\u003cp\u003e\"Steady income is overrated. Where\u0027s the adventure?\"\u003c/p\u003e\n\u003cp\u003eSanchez shook his head. \"The kid moved.\"\u003c/p\u003e\n\u003cp\u003e\"Which kid?\"\u003c/p\u003e\n\u003cp\u003e\"The last kid on the list.\"\u003c/p\u003e\n\u003cp\u003e\"But we saw him just last week at church.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, now he lives in Florida with his grandparents.\"\u003c/p\u003e\n\u003cp\u003eI looked at Jesus, who was just finishing off his single mint and chip child scoop. \"So you ran him out of town,\" I said to him.\u003c/p\u003e\n\u003cp\u003eJesus shrugged. He was concentrating on the last of his ice cream. \"I still owe him. He can run but he can\u0027t hide.\"\u003c/p\u003e\n\u003cp\u003eI said to Sanchez, \"Are we buying plane tickets to Florida?\"\u003c/p\u003e\n\u003cp\u003e\"No. We\u0027re going to let this one slide.\"\u003c/p\u003e\n\u003cp\u003e\"Big of you,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I still owe him,\" said Jesus.\u003c/p\u003e\n\u003cp\u003e\"Not so big of him,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Hey, I\u0027m only twelve.\"\u003c/p\u003e\n\u003cp\u003e\"And what have you learned from all of this?\" I asked.\u003c/p\u003e\n\u003cp\u003eJesus shrugged, and started crunching on the waffle cone. I had finished mine in precisely three bites, as had Sanchez, who dropped his big hand on his kid\u0027s shoulders. \"Answer him.\"\u003c/p\u003e\n\u003cp\u003e\"One girlfriend at a time,\" said Jesus. He sounded as if this were a terrible punishment.\u003c/p\u003e\n\u003cp\u003eI said, \"You do realize there are some guys who go their entire junior high and high school years without having a single girlfriend?\"\u003c/p\u003e\n\u003cp\u003e\"I know. I feel sorry for them.\" Jesus looked at me, grinning. \"I mean, I feel sorry for you.\"\u003c/p\u003e\n\u003cp\u003eI looked at Sanchez. \"You told him?\"\u003c/p\u003e\n\u003cp\u003e\"Hey, I was trying to make the same point. You just happened to come up.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, I used you because the kid happens to look up to you,\" said Sanchez. \"Why, I\u0027ll never know.\"\u003c/p\u003e\n\u003cp\u003eJesus said, \"You really never had a single girlfriend?\"\u003c/p\u003e\n\u003cp\u003e\"Girls are trouble,\" I said. \"Besides, I had plenty in college.\"\u003c/p\u003e\n\u003cp\u003e\"But I think girls are fun - \"\u003c/p\u003e\n\u003cp\u003e\"Not too much fun,\" said Sanchez, looking at his kid.\u003c/p\u003e\n\u003cp\u003e\"No, dad.\"\u003c/p\u003e\n\u003cp\u003e\"I was busy in high school,\" I said.\u003c/p\u003e\n\u003cp\u003e\"What could be more important than girls?\"\u003c/p\u003e\n\u003cp\u003e\"Football.\"\u003c/p\u003e\n\u003cp\u003e\"I played football in high school, too,\" said Sanchez, shrugging. \"And I had girlfriends. No big deal.\"\u003c/p\u003e\n\u003cp\u003e\"I took football seriously.\"\u003c/p\u003e\n\u003cp\u003e\"So did I.\"\u003c/p\u003e\n\u003cp\u003e\"I wanted to play in the pros,\" I said. \"I had a plan. Girls would just get in the way.\"\u003c/p\u003e\n\u003cp\u003e\"But that\u0027s the idea,\" said Sanchez. \"Girls are made to get in the way. Sometimes it\u0027s nice when they get in the way.\"\u003c/p\u003e\n\u003cp\u003e\"Right on, dad,\" said Jesus. He raised his hand. \"High five.\"\u003c/p\u003e\n\u003cp\u003eSanchez left him hanging. \"But you made an exception for Cindy.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Cindy just happened to be the most special girl in the world.\"\u003c/p\u003e\n\u003cp\u003e\"I think Cindy\u0027s hot,\" said Jesus, and Sanchez elbowed his kid hard enough to nearly knock him out of his seat.\u003c/p\u003e\n\u003cp\u003e\"So do I,\" I said. \"So do I.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mummy-case-jim-knighthorse-2/page-22.html","bookId":2352,"creation":"Oct 5, 2019 10:02:49 AM","modification":"Oct 5, 2019 10:02:49 AM"}
