{"id":66900,"no":7,"title":"Page 7","content":"\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003eI am not mechanically inclined by nature. I am more of the warrior/lover/artist type. But I do know the basics of car maintenance. So before I headed out into the desert, I topped off the Mustang\u0027s water, checked the oil, tire pressure, air filter and anything else that crossed my mind. A few years back I had the engine rebuilt. Since then, the car ran smooth as hell, which was the way I preferred. More than anything, the car was paid off. A key factor to any struggling detective.\u003c/p\u003e\n\u003cp\u003eI drove north along Highway 15, the main artery into Las Vegas from southern California. Needless to say, I sat in some traffic. With some time on my hands, and being one of the few who didn\u0027t have gambling on the brain, I was able to relax and enjoy a good book on tape. The book was about things called hobbits and a very important ring.\u003c/p\u003e\n\u003cp\u003eAn hour later I was in the Mojave Desert, passing through cities called Hesperia and Victorville. I wondered if there was a Jimville somewhere. And if there wasn\u0027t, there should be.\u003c/p\u003e\n\u003cp\u003eThe Mojave Desert is famous for its kangaroo rats and Joshua trees. Stephen King once set a story out here, about a Cadillac. Always liked that story.\u003c/p\u003e\n\u003cp\u003eI wondered if there were any Jim trees.\u003c/p\u003e\n\u003cp\u003eThe heat was intense and uncomfortable. My windows were down, my only air conditioning. Sweat soaked through the back of my shirt and was probably puddling on my leather seat. Nice.\u003c/p\u003e\n\u003cp\u003eEvery now and then someone spotted my cool car and gave me a thumbs-up gesture. I accepted the gesture with a gentle nod of my head. Every now and then someone spotted the cool driver driving the cool car, and gave me a smile. As these were mostly women, I returned the smile. Cindy would have been jealous. Luckily, Cindy wasn\u0027t in the car. Smiles are not cheating. Smiles, in my book, are okay. Unless she\u0027s smiling at other men. Then it\u0027s not okay.\u003c/p\u003e\n\u003cp\u003eHypocrite.\u003c/p\u003e\n\u003cp\u003eI headed off Highway 15 onto a much smaller, one-laned highway. I drove alone for many miles.\u003c/p\u003e\n\u003cp\u003eLuckily, I had hobbits to entertain me. Unfortunately, the little guys were in a fair bit of trouble, as there seemed to be a lot of interest in this ring.\u003c/p\u003e\n\u003cp\u003eI checked my temperature gauge. All was okay.\u003c/p\u003e\n\u003cp\u003eThe road was flat, surrounded by a lot of stark, rocky protrusions that were too big for hills and too small for mountains. I racked my brain for all words associated with mountains, but could think of only crags and hillocks. I decided on smallish mountains.\u003c/p\u003e\n\u003cp\u003eAt any rate these smallish mountains were bare and lifeless and would have been equally at home on Mars or Venus - where, as legend has it, men and women are from. Except these burning rocks weren\u0027t barren and empty. Life flourished here, to a degree. Snakes lived in holes. Kangaroo rats avoided the holes with the snakes. Plants clung to life in ways that made sense to evolutionary biologists but seemed remarkable to the rest of us.\u003c/p\u003e\n\u003cp\u003eA car was coming about a half-mile away. The first car in 20 miles. I was giddy with anticipation. A man was driving. A woman was looking down at a map spread across the dashboard. The backseat was piled with suitcases and clothing. They never saw me waving.\u003c/p\u003e\n\u003cp\u003eThe hobbits escaped the clutches of some very wicked creatures. This was followed by a lot of history of a land called Middle Earth. I almost went to sleep, but persevered, and was rewarded by some more history of Middle Earth. I turned the tape off, for now.\u003c/p\u003e\n\u003cp\u003eMy timing couldn\u0027t have been better.\u003c/p\u003e\n\u003cp\u003eNearly two hours after leaving Orange County, as I crested a sort of rise in the road, Rawhide Ghost Town appeared before me.\u003c/p\u003e\n\u003cp\u003eHowdy partner.\u003c/p\u003e\n\u003cp\u003eChapter Fourteen\u003c/p\u003e\n\u003cp\u003eRawhide Ghost Town was nestled in a narrow valley between high sun-baked cliffs dotted with mine shafts. Consisting mostly of shops lining a single dirt road and much smaller than its cousin up north, Calico Ghost Town, Rawhide looked more like a Western-themed strip mall.\u003c/p\u003e\n\u003cp\u003eI parked in front of the first store that grabbed my eye, Huck\u0027s Saloon. For good measure, should anyone show up on a horse, a hitching post still ran the length of the town. Currently, no horses were hitched. Although a handful of cars and trucks were parked in front of various stores, the town appeared mostly empty, a true ghost town.\u003c/p\u003e\n\u003cp\u003eA hot wind swept down Main Street, moaning like the damned and pushing dust before it. Probably the dust was hot, too. No trees or shade. No relief from the sun unless you went inside somewhere.\u003c/p\u003e\n\u003cp\u003eSo I decided to go inside somewhere, and I chose the saloon. No surprise there.\u003c/p\u003e\n\u003cp\u003eI pushed my way through a pair of swinging doors. Always wanted to do that. And not even a squeak after all these years....\u003c/p\u003e\n\u003cp\u003eThe saloon was empty. No cowboys knocking back a few. No barroom fights in progress. No bartender cowering behind the bar because word had spread that Big Bad Jim Knighthorse was coming to town. I tipped my Anaheim Angels hat at the empty room, stuck my thumbs in my pockets, and moseyed on into the saloon.\u003c/p\u003e\n\u003cp\u003eIt was a real saloon, so far as I could tell. There was even a stage for the dancing girls and a player piano on the floor beneath it. Sadly, no dancing girls. I sat at the wraparound bar. Before me was a huge mirror. There were some bottles of not-so-authentic liquor stacked in front of the mirror. I smiled at the handsome man in the mirror. He smiled back, and we played that game for perhaps another two seconds.\u003c/p\u003e\n\u003cp\u003eA woman appeared from the back of the bar, spurs jangling, carrying a case of Bud Light. She was wearing a cowboy hat, and a bright smile. I have the effect on people.\u003c/p\u003e\n\u003cp\u003e\"Howdy, partner,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Howdy ma\u0027am,\" I said. \"Is this where I tip my hat?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe if you were wearing a cowboy hat.\" She put the case into a glass refrigerator. I noticed in passing her arms were roped with muscle. \"Were you waiting long?\"\u003c/p\u003e\n\u003cp\u003e\"Just sat down.\"\u003c/p\u003e\n\u003cp\u003e\"Good. What can I get you?\"\u003c/p\u003e\n\u003cp\u003e\"Rolling Rock, no glass. And some information, no glass.\"\u003c/p\u003e\n\u003cp\u003eShe opened the refrigerator door again, grabbed a green bottle and placed it on top of a little square napkin to protect the deeply rutted counter top. Her work done for the morning, she leaned a curved hip on the bar. Her dark hair was pulled back in a ponytail. She crossed her arms under her chest. The long sleeves of her red-checkered flannel were rolled up to her elbows. Veins crossed her forearms, just under the skin. She looked like she could kick Calamity Jane\u0027s ass.\u003c/p\u003e\n\u003cp\u003e\"So what kind of information are you looking for?\" She was smiling at me. I think she thought I was cute. Stranger things have happened.\u003c/p\u003e\n\u003cp\u003eI showed her my P.I. license. She leaned forward and studied it. \"Wow, a real live private investigator. In a ghost town, no less.\"\u003c/p\u003e\n\u003cp\u003e\"Ironic, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Very,\" she said. \"Nice picture.\"\u003c/p\u003e\n\u003cp\u003e\"My girlfriend says I look urbane and dashing.\"\u003c/p\u003e\n\u003cp\u003e\"Girlfriend?\"\u003c/p\u003e\n\u003cp\u003e\"Yup.\"\u003c/p\u003e\n\u003cp\u003e\"The good ones are always taken.\"\u003c/p\u003e\n\u003cp\u003e\"This one is, alas.\"\u003c/p\u003e\n\u003cp\u003e\"Knighthorse sounds Native American,\" she said.\u003c/p\u003e\n\u003cp\u003e\"My great great grandfather was Apache.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, we could play cowboys and Indians.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds naughty,\" I said.\u003c/p\u003e\n\u003cp\u003eShe grinned. \"So what\u0027s a detective doing all the way out here?\"\u003c/p\u003e\n\u003cp\u003eI told her about the case.\u003c/p\u003e\n\u003cp\u003e\"Willie Clarke,\" she said, thinking. \"The guy they found dead in the desert?\"\u003c/p\u003e\n\u003cp\u003e\"One in the same.\"\u003c/p\u003e\n\u003cp\u003eShe bit her lip, frowned. Re-crossed her arms. \"But I thought they ruled his death an accident.\"\u003c/p\u003e\n\u003cp\u003e\"So they did.\"\u003c/p\u003e\n\u003cp\u003e\"But you think different?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m being paid to think different.\"\u003c/p\u003e\n\u003cp\u003e\"Paid by whom?\"\u003c/p\u003e\n\u003cp\u003eI shook my head.\u003c/p\u003e\n\u003cp\u003e\"Top secret,\" I said. \"Did you ever meet Willie Clarke?\"\u003c/p\u003e\n\u003cp\u003e\"Once. He came into the bar and we chatted. He told me he was here to look into the identity of Sylvester. You know Sylvester? Wait, of course you do, you\u0027re an ace detective.\"\u003c/p\u003e\n\u003cp\u003eI winked and shot her a blank with my forefinger.\u003c/p\u003e\n\u003cp\u003e\"Willie was a young guy,\" she continued, \"said he was just out of college.\"\u003c/p\u003e\n\u003cp\u003e\"What was your impression of him?\"\u003c/p\u003e\n\u003cp\u003e\"Smart, funny. Sort of rugged, too.\"\u003c/p\u003e\n\u003cp\u003e\"Did he seem like the type who could take care of himself?\"\u003c/p\u003e\n\u003cp\u003eShe was nodding as I asked the question. Her eyes narrowed and she frowned a little. \"Yeah, definitely. He didn\u0027t look like a historian.\"\u003c/p\u003e\n\u003cp\u003e\"More manly than me?\"\u003c/p\u003e\n\u003cp\u003eShe winked. \"Almost, but not quite.\"\u003c/p\u003e\n\u003cp\u003e\"Did he seem the type who would get lost in the desert and run out of gas?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s asking a lot, he only came in for a Diet Coke. But, if I had to answer....\"\u003c/p\u003e\n\u003cp\u003e\"And you do,\" I added.\u003c/p\u003e\n\u003cp\u003e\"I would say he seemed the type to have a map on hand, but keep in mind I only met the guy for ten minutes.\"\u003c/p\u003e\n\u003cp\u003e\"They say he ran out of gas,\" I said. \"And I\u0027m willing to bet he\u0027s also the type to make sure he topped off his gas before heading out into the desert. Would be stupid not to, and everyone seems to agree Willie was pretty smart.\"\u003c/p\u003e\n\u003cp\u003eShe was nodding. \"Maybe he ran out of gas while looking for a way out.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" I said.\u003c/p\u003e\n\u003cp\u003e\"But you don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"His truck was found close to the site. Which suggests he ran out shortly after leaving the others,\" I said. \"Did the two of you talk about anything else?\"\u003c/p\u003e\n\u003cp\u003eShe bit her lip. \"He mentioned he\u0027d been hired to look into Sylvester\u0027s identity, and I asked if he had spoken to Jarred.\"\u003c/p\u003e\n\u003cp\u003eThere he was again. Jarred, Rawhide\u0027s official town historian, and curator of the Rawhide Museum.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because Jarred thinks of himself as the world\u0027s greatest expert on Sylvester the Mummy.\"\u003c/p\u003e\n\u003cp\u003e\"And had Willie?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"He said Jarred was being rude and unhelpful at best. Which sounds like Jarred. He takes his work entirely too seriously. Now he\u0027s working on his magnum opus.\"\u003c/p\u003e\n\u003cp\u003e\"Magnum opus?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the history of Rawhide. Jarred thinks it will help establish him as a serious historian. You know, make a name for him. That\u0027s pretty important to Jarred.\"\u003c/p\u003e\n\u003cp\u003e\"And he picked Rawhide to make his name?\"\u003c/p\u003e\n\u003cp\u003eShe nodded, grinning. She picked up a towel and started wiping something behind the bar, below my eyesight. It was a habit all bartenders have: just wiping the hell out of things.\u003c/p\u003e\n\u003cp\u003e\"He says Rawhide is untapped material. He\u0027s going to put it on the map, so to speak.\"\u003c/p\u003e\n\u003cp\u003e\"Rawhide is on the map.\"\u003c/p\u003e\n\u003cp\u003eShe giggled.\u003c/p\u003e\n\u003cp\u003eI finished the rest of my beer in one swallow. I wanted eleven more for an even dozen. \"Thank you for your time, you\u0027ve been very helpful.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t want another beer?\"\u003c/p\u003e\n\u003cp\u003e\"Duty calls.\"\u003c/p\u003e\n\u003cp\u003eShe looked sad. The bar was empty. I was her only entertainment. \"So where you headed now?\"\u003c/p\u003e\n\u003cp\u003e\"Figure I might as well talk to Jarred before he goes making a name for himself and thinks he\u0027s too important to talk to me.\"\u003c/p\u003e\n\u003cp\u003eShe grinned. \"He\u0027s four stores down. The adobe building.\"\u003c/p\u003e\n\u003cp\u003eI tipped my hat. \"Ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003eLuckily, the swinging doors were just as much fun going as coming. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mummy-case-jim-knighthorse-2/page-7.html","bookId":2352,"creation":"Oct 5, 2019 10:02:49 AM","modification":"Oct 5, 2019 10:02:49 AM"}
