{"id":80129,"no":25,"title":"Page 25","content":"\u003cp\u003eNine of us left. Me, Trev, Meths, Elephant, Stagger Lee, Tyler, Seez, the other Muslim boy and the Indian. As we run, twisting through corridors, I try to remember how many of us there were to begin with, but I can\u0027t. I\u0027ve already forgotten the names and faces of the dead. I\u0027m sure, if I sat down for five minutes, I\u0027d be able to recall them. But right now they\u0027re vaguely remembered ghosts.\u003c/p\u003e\n\u003cp\u003eSounds behind us again. The zombies must have overcome their fear of the light. The chase has resumed.\u003c/p\u003e\n\u003cp\u003e\"Hold on,\" Trev pants, coming to a stop. \"Where are we? I don\u0027t know if we\u0027re heading back towards the gym or close to the front.\"\u003c/p\u003e\n\u003cp\u003eWe gaze around. There are classrooms on both sides but I don\u0027t recognize them. All of the corridors have started to look the same. I\u0027m as lost as Trev. By the blank stares of the others, I know that they are too.\u003c/p\u003e\n\u003cp\u003eTyler coughs shyly and points. \"The front\u0027s that way.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sure?\" Trev asks.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" he says with a small smile. \"I\u0027m good at directions, me.\"\u003c/p\u003e\n\u003cp\u003e\"Then let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eWe head the way Tyler pointed. He\u0027d better be right. If he\u0027s not, I\u0027ll kill him before the zombies can.\u003c/p\u003e\n\u003cp\u003eWe turn a corner and I run into a boy my own size. We collide, bounce off each other and fall. Sitting up and rubbing my head, I realize it\u0027s Pox and I burst into a smile.\u003c/p\u003e\n\u003cp\u003e\"Pox! I thought you were...\"\u003c/p\u003e\n\u003cp\u003eI stop. Pox is staring at me with a hungry look. I remember that the last time I saw him, he was dining on Dunglop\u0027s brain. My eyes flash to the fingers of his left hand and I see a light green moss running along the bite marks. Bones jut nastily from the ruined tips of his fingers.\u003c/p\u003e\n\u003cp\u003eRick\u0027s just behind Pox. He\u0027s limping, dragging one leg. His foot\u0027s missing. Pox or another zombie must have chewed it off before he turned. But there\u0027s not much blood.\u003c/p\u003e\n\u003cp\u003ePox scuttles after me. Dunglop\u0027s brain obviously wasn\u0027t enough to satisfy his appetite. Like Meths, poor old Dunglop never was the brightest of sparks, so he must have made for no more than a snack.\u003c/p\u003e\n\u003cp\u003eI kick at Pox\u0027s face, driving him back. As I try to scramble to my feet, Meths wades in and kicks Pox harder. Rick hops towards Meths, arms wide, fingers flexed like a cat\u0027s claws. Meths slips. Rick ducks in for the kill -\u003c/p\u003e\n\u003cp\u003e- then there\u0027s an unnatural roar and the zombie flies backwards, stomach ripped to shreds, blood spattering the wall and floor behind him.\u003c/p\u003e\n\u003cp\u003ePox gets up and snarls. Goes for me again. There\u0027s another roar and his head explodes. Somebody\u0027s firing bullets. Someone has a gun.\u003c/p\u003e\n\u003cp\u003eBloody yes, mate!\u003c/p\u003e\n\u003cp\u003e\"His head!\" I roar as Rick hobbles forward, guts spilling down his legs. \"Shoot him in the head! That\u0027s the only way to stop them!\"\u003c/p\u003e\n\u003cp\u003eThe gun fires again and Rick\u0027s temple cracks open. He drops in a lifeless heap.\u003c/p\u003e\n\u003cp\u003eI turn to face the gunman. The others have all turned too, jaws slack, hardly able to believe that this is real. I\u0027m hoping for a squadron of soldiers but it\u0027s just a normal-looking guy with a rifle. He hasn\u0027t lowered it and is staring grimly down the barrel at me.\u003c/p\u003e\n\u003cp\u003e\"Were you bitten?\" he growls.\u003c/p\u003e\n\u003cp\u003e\"No!\" I scream.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t lie. I saw it attack you. Stand back!\" he barks at the others.\u003c/p\u003e\n\u003cp\u003eI gape at the man with the gun. This is so unfair. To survive the zombies, only to be finished off by an idiot who won\u0027t listen. I\u0027d love to knock some sense into his thick head. But it doesn\u0027t look like I\u0027ll have a chance, because he\u0027s aiming at the middle of my face. Any second now he\u0027s gonna -\u003c/p\u003e\n\u003cp\u003e\"Stop!\" another man roars. \"Don\u0027t shoot! That\u0027s my daughter!\"\u003c/p\u003e\n\u003cp\u003e\"But I saw - \" the man with the rifle begins.\u003c/p\u003e\n\u003cp\u003eThe rest of what he says is lost to me. Because suddenly Dad is there, pushing past the idiot with the gun, spreading his arms wide, stooping to hug me.\u003c/p\u003e\n\u003cp\u003e\"Dad!\" I cry with a rush of relief.\u003c/p\u003e\n\u003cp\u003e\"Becky!\" he moans, wrapping his arms around me and hugging me tight. \"My girl! My girl!\"\u003c/p\u003e\n\u003cp\u003eThen he\u0027s kissing me and hugging me, and I don\u0027t care how many zombies or idiots with trigger-happy fingers there are. They can\u0027t hurt me. They don\u0027t matter anymore. Dad loves me. He risked his life to find me. Everything will be all right now. Dad will save me. He\u0027ll save us all. He\u0027s a bloody hero! \u003c/p\u003e","sourceLink":"https://allnovel.net/zom-b-zom-b-1/page-25.html","bookId":2450,"creation":"Oct 5, 2019 4:23:45 PM","modification":"Oct 5, 2019 4:23:45 PM"}
