{"id":34413,"no":3,"title":"CHAPTER III. GRIPP\u0027S CLOTHING STORE.","content":"\u0026nbsp;Nathan Gripp\u0027s clothing store was located about a quarter of a mile from the City Hall, on Chatham street. Not many customers from Fifth avenue owned him as their tailor, and he had no reputation up town. His prices were undeniably low, though his clothes were dear enough in the end. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His patrons were in general from the rural districts, or city residents of easy tastes and limited means.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The interior of the store was ill-lighted, and looked like a dark cavern. But nearly half the stock was displayed at the door, or on the sidewalk, Mr. Gripp himself, or his leading salesman, standing in the door-way with keen, black eyes, trying to select from the moving crowds possible customers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the whole Gripp was making money. He sold his clothes cheap, but they cost him little. He paid the lowest prices for work, and whenever told that his wages would not keep body and soul together, he simply remarked:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s nothing to me, my good woman. If you don\u0027t like the pay, leave the work for somebody else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 25]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But unfortunately those who worked for Mr. Gripp could not afford to leave the work for somebody else. Half wages were better than none, and they patiently kept on wearing out their strength that Nathan might wax rich, and live in good style up town.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Gripp himself was standing in the door-way when Dan, with the bundle of vests under his arm, stopped in front of the store. Mr. Gripp was a little doubtful whether our hero wished to become a customer, but a glance at the bundle dispelled his uncertainty, and revealed the nature of his errand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve brought home half a dozen vests,\" said Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who from?\" asked Gripp, abruptly, for he never lavished any of the suavity, which was a valuable part of his stock in trade, on his work people.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mrs. Mordaunt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take them into the store. Here, Samuel, take the boy\u0027s bundle, and see if the work is well done.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was on the tip of Dan\u0027s tongue to resent the doubt which these words implied, but he prudently remained silent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The clerk, a callow youth, with long tow-colored locks, made sleek with bear\u0027s grease, stopped picking his teeth, and motioned to Dan to come forward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here, young feller,\" he said, \"hand over your bundle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There it is, young feller!\" retorted Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 26]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The clerk surveyed the boy with a look of disapproval in his fishy eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No impudence, young feller!\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where\u0027s the impudence?\" demanded Dan. \"I don\u0027t see it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you call me a young feller?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve called me one twice, but I ain\u0027t at all particular. I\u0027d just as lief call you an old feller,\" said Dan, affably.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here, young chap, I don\u0027t like your manners,\" said the clerk, with an irritating consciousness that he was getting the worst of the verbal encounter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m sorry for that,\" answered Dan, \"because they\u0027re the best I\u0027ve got.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you make these vests yourself?\" asked the salesman, with a feeble attempt at humor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" was Dan\u0027s unexpected rejoinder. \"That\u0027s the way I amuse my leisure hours.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Humph!\" muttered the tallow-faced young man, \"I\u0027ll take a look at them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened the bundle, and examined the vests with an evident desire to find something wrong.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He couldn\u0027t find any defect, but that didn\u0027t prevent his saying:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They ain\u0027t over-well made.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 27]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, they won\u0027t be over-well paid,\" retorted Dan. \"So we\u0027re even.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know if we ought to pay for them at all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Honesty is the best policy, young feller,\" said Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No more of your impudence!\" said the clerk, sharply. \"Wait here a minute till I speak to Mr. Gripp.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He kept Dan before the counter, and approached the proprietor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, what is it, Samuel?\" asked Mr. Gripp, stroking his jet-black whiskers. \"Are the vests all right?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pretty well, sir, but the boy is impudent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ha! how is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He keeps calling me \u0027young feller.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Anything more?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He don\u0027t seem to have any respect for me—or you,\" he added, shrewdly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nathan Gripp frowned. He cared very little about his clerk, but he resented any want of respect to himself. He felt that the balance at his bankers was large enough to insure him a high degree of consideration from his work-people at least.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How many vests are there?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Half a dozen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And the boy wants his pay, I suppose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 28]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He hasn\u0027t asked for it, but he will. They always do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell him we only pay when a full dozen are finished and brought in. We\u0027ll credit him, or his mother, with these.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027ll pay them off,\" thought the astute clothing merchant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Samuel received this order with inward satisfaction, and went back smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, young feller,\" said he, \"it\u0027s all right. The vests ain\u0027t over-well done, but we\u0027ll keep \u0027em. Now you can go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Dan did not move.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to me you\u0027ve forgotten something,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You haven\u0027t paid me for the work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s all right. We\u0027ll pay when the next half dozen are brought in. Will you take \u0027em now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan was disagreeably surprised. This was entirely out of the usual course, and he knew very well that the delay would be a great inconvenience.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We\u0027ve always been paid when we brought in work,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We\u0027ve changed our rule,\" said the clerk, nonchalantly. \"We only pay when a full dozen are brought in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 29]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What difference does it make to you? We need the money, and can\u0027t wait.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s my orders, young feller. It\u0027s what Mr. Gripp just told me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll speak to him,\" said Dan, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just as you like.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan approached the proprietor of the establishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Gripp,\" said he, \"I\u0027ve just brought in half a dozen vests, but your clerk here won\u0027t pay me for them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will get your pay, young man, when you bring in another half dozen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, Mr. Gripp, we need the money. We haven\u0027t got a big bank account. Our rent is due to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it, indeed? I don\u0027t see how that concerns me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you pay me to-night as a favor?\" pleaded Dan, humbling himself for his mother\u0027s sake.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t break over my rule,\" said Nathan Gripp. \"Besides, Samuel says the work isn\u0027t very well done.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he lies!\" exclaimed Dan, provoked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you hear that, Mr. Gripp?\" ejaculated the angry Samuel, his tallowy complexion putting on a faint flush. \"Didn\u0027t I tell you he was impudent?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nathan Gripp\u0027s small black eyes snapped viciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Boy,\" said he, \"leave my store directly. How[Pg 30] dare you address me in such a way, you young tramp?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m no more a tramp than yourself,\" retorted Dan, now thoroughly angry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Samuel, come here, and put out this boy!\" exclaimed Nathan, too dignified to attempt the task himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Samuel advanced, nothing loth, his fishy eyes gleaming with pleasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Get out, you vagabond!\" he exclaimed, in the tone of authority.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re a couple of swindlers!\" exclaimed Dan. \"You won\u0027t pay for honest work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Out with him, Samuel!\" ordered Gripp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Samuel seized Dan by the shoulder, and attempted to obey orders, but our hero doubled him up with a blow from his fist, and the luckless clerk, faint and gasping, staggered and nearly fell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan stepped out on the sidewalk, and raising his hat, said, with mock politeness, \"Good-morning, gentlemen!\" and walked away, leaving Gripp and his assistant speechless with anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n You\u0027re a couple of swindlers, exclaimed Dan\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re a couple of swindlers!\" exclaimed Dan. \"You won\u0027t\n\u003c/div\u003e \n\u003cdiv\u003e\n pay for honest work.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2960/81427.html","bookId":429,"creation":"Aug 5, 2019 5:39:35 AM","modification":"Aug 5, 2019 5:39:35 AM"}
