{"id":34443,"no":33,"title":"CHAPTER XXXIII. ALTHEA BECOMES KATY DONOVAN.","content":"\u0026nbsp;The sleeping potion which had been administered to Althea kept her in sound sleep till eight o\u0027clock the next morning. When her eyes opened, and she became conscious of her surroundings, she looked about her in surprise. Then she sat up in bed and gazed wildly at the torn wall paper and dirty and shabby furniture. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where am I?\" she asked herself, in alarm. \"Mamma, mamma!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The door opened, and the red and inflamed face of Mrs. Hugh Donovan peered in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it yer want?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want mamma,\" answered the child, still more frightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure I\u0027m your ma, child.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, you are not,\" said Althea. \"I never saw you before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you, now? Maybe you\u0027ve forgotten. I sent you away to board, but you\u0027ve come home to live with your ma.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 238]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are telling stories. You are a bad woman,\" returned the child, ready to cry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a purty thing for a child to tell her ma she\u0027s lyin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re not my ma. You\u0027re an ugly woman. My ma hasn\u0027t got a red face.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hear till her now!\" exclaimed Mrs. Donovan, indignantly. \"Don\u0027t you go on talkin\u0027 that way, but get right up, or you sha\u0027n\u0027t have any breakfast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, send me back to my mother and Dan!\" implored Althea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dress yourself, and I\u0027ll see about it,\" said Mrs. Donovan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea looked for her clothes, but could not find them. In their place she found a faded calico dress and some ragged undergarments, which had once belonged to a daughter of Mrs. Donovan, now at service.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Those clothes are not mine,\" said Althea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure they are. What are yer talkin\u0027 about?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had a pretty pink dress and a nice new skirt. Oh, where are they?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure you\u0027re dramin\u0027. These was the clothes you took off last night,\" said Mrs. Donovan, with unblushing falsehood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t put this dress on,\" said the child, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 239]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you\u0027ll have to lay abed all day, and won\u0027t get nothing to eat,\" said the woman. \"Maybe you\u0027ll like that now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is your name?\" asked Althea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure you\u0027re a quare child to ask your own mother\u0027s name. I\u0027m Mrs. Donovan, and you\u0027re my Katy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not Katy. My name is Althea.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s a quare name intirely. Who put it into your head. I\u0027m afraid you\u0027re gone crazy, Katy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea was bewildered. Was it possible that she could be Katy Donovan, and that this red-faced woman was her mother? She began to doubt her own identity. She could not remember this woman, but was it possible that there was any connection between them?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are we in New York?\" she asked, timidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, we are in Brooklyn.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I used to live in New York with Mamma Mordaunt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, you\u0027re livin\u0027 in Brooklyn now with Mamma Donovan.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never saw you before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure I shouldn\u0027t have sent you away from me to have you come home and deny your own mother.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you let me go to New York and see Mamma Mordaunt?\" asked Althea, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 240]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you\u0027re a good girl, perhaps I will. Now get up, and I\u0027ll give you some breakfast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With a shudder of dislike Althea arrayed herself in the dirty garments of the real Katy Donovan, and looked at her image in the cracked mirror with a disgust which she could not repress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hartley had suggested that her own garments should be taken away in order to make her escape less feasible.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She opened the door, and entered the room in which Mrs. Donovan had set the table for breakfast.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As she came in at one door, Hugh Donovan entered at another.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come here, little gal,\" he said, with a grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea looked at him with real terror. Certainly Hugh Donovan was not a man to attract a child.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea at once thought of an ogre whom Dan had described to her in a fairy story, and half fancied that she was in the power of such a creature.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want to,\" said the child, trembling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go to your father, Katy,\" said Mrs. Donovan. \"He won\u0027t hurt you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This her father! Althea shuddered at the idea, and she gazed as if fascinated at his one eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, come to your pa,\" said Donovan, jeeringly. \"I like little gals—\u0027specially when they\u0027re my own.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not your child!\" said Althea, alarmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 241]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, you be, and don\u0027t you deny it. Come and give your father a kiss.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The little girl began to cry in nervous terror, and Donovan laughed, thinking it a good joke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, it\u0027ll do after breakfast,\" he said. \"Sit up, child, and we\u0027ll see what the ould woman has got for us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Donovan did not excel as a cook, but Althea managed to eat a little bread and butter, for neither of which articles the lady of the house was responsible. When the meal was over she said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, will you take me back to New York?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are not going back at all,\" said Hugh. \"You are our little girl, and you are going to live with us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea looked from one to the other in terror. Was it possible they could be in earnest? She was forced to believe it, and was overwhelmed at the prospect. She burst into a tempest of sobs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Men are less tolerant of tears than women.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hugh Donovan\u0027s face darkened, and his anger was kindled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stop that howlin\u0027 now!\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea continued to cry hysterically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stop it now, if you know what\u0027s best for yourself!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea was terrified, but she could not at once control her emotion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 242]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Old woman, get the whip!\" said Hugh, hoarsely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n From a drawer Mrs. Donovan drew out a riding whip. Her husband took it, and brandished it menacingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you see that, now?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Althea, trembling, stopping short, as if fascinated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you\u0027ll feel it if you don\u0027t stop your howlin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea gazed at him horror-stricken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought you\u0027d come to your senses,\" he said, in a tone of satisfaction. \"Kape her safe, old woman, till she knows how to behave.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In silent misery the little girl sat down and watched Mrs. Donovan as she cleared away the table, and washed the dishes. It was dull and hopeless work for her. She thought sorrowfully of Mrs. Mordaunt and Dan, and wished she could be with them again. Should she never, never see them? The thought so saddened her that she burst into a low moan, which at once drew the attention of Mrs. Donovan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you at it again?\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t help it,\" moaned Althea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ye can\u0027t, can\u0027t ye? See here, now,\" and the woman displayed the whip with which her husband had threatened the child. \"I\u0027ll give ye something to cry for.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 243]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, don\u0027t—don\u0027t beat me!\" entreated Althea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then kape quiet!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I go out into the street?\" asked the little girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ye want to run away,\" said Mrs. Donovan, suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t. I mean I won\u0027t unless you let me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t trust ye.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Must I stay here all the time?\" asked Althea, with her little heart sinking at the thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Katy, you may go wid me when I go to the market,\" answered Mrs. Donovan. \"Shure, if you\u0027ll be a good gal, I\u0027ll give you all the pleasure I can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea waited half an hour, and then was provided with a ragged sun-bonnet, with which, concealing her sad face, she emerged from the house, and walked to a small market, where Mrs. Donovan obtained her supplies for dinner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Troubled as she was, Althea looked about her with a child\u0027s curiosity on her way through the strange streets. It served to divert her from her sorrow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who\u0027s that little girl, Mrs. Donovan?\" asked an acquaintance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure it\u0027s my little Katy,\" said the woman, with a significant wink which prevented further questioning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Althea wished to deny this, but she did not dare to. She had become afraid of her new guardians. Oh, if[Pg 244] she could only see Dan! She felt sure that he would take her away from these wicked people, but how was Dan to know where she was. The poor child\u0027s lips quivered, and she could hardly refrain from crying.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2960/81457.html","bookId":429,"creation":"Aug 5, 2019 5:39:35 AM","modification":"Aug 5, 2019 5:39:35 AM"}
