{"id":34447,"no":37,"title":"CHAPTER XXXVII. DAN IS DISCOVERED.","content":"\u0026nbsp;Donovan had two customers. One was an Irishman, the other a German. Both had evidently drank more than was good for them. Dan looked in vain for Althea. Mrs. Donovan had taken her up stairs. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, boy, what do you want?\" asked Donovan, rather roughly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you have yer musique?\" asked Dan, uncertain whether he was talking as an Italian boy might be expected to.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I don\u0027t want to hear any fiddle-scraping.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure, let him play a little, Mister Donovan,\" said the Irishman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just as you like,\" said Donovan, carelessly, \"only I have no money for him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Faith, thin, I have. Here boy, play something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan struck up his one tune—Viva Garibaldi—but the Irishman did not seem to care for that.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, bother ould Garibaldi!\" he said. \"Can\u0027t you play something else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I could,\" thought Dan. \"Suppose I compose something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 265]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Accordingly he tried to play an air popular enough at the time, but made bad work of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stop him! stop him!\" exclaimed the German, who had a better musical ear than the Irishman. \"Here, lend me your fiddle, boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took the violin, and in spite of his inebriety, managed to play a German air upon it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure you bate the boy at his own trade,\" said the Irishman. \"You must be dhry. What\u0027ll you have now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The German indicated his preference, and the Irishman called for whisky.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027ll you have, Johnny?\" he asked, addressing Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I no drink,\" answered our hero, shaking his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure you\u0027re an Italian wonder, and it\u0027s Barnum ought to hire you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I no understand English,\" said Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you\u0027re a haythen,\" said Pat Moriarty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He gulped down the whisky, and finding it more convenient to sit than to stand, fell back upon a settee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish Althea would come in,\" thought Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At that moment a heavy fall was heard in the room overhead, and a child\u0027s shrill scream directly afterward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Something\u0027s happened to my wife,\" muttered Donovan. \"She\u0027s drunk again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 266]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He hurried up stairs, and the German followed. This gave Dan an excuse for running up, too.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Donovan had been drinking more copiously than usual. While in this condition she imprudently got upon a chair to reach a pitcher from an upper shelf. Her footing was uncertain, and she fell over, pitcher in hand, the chair sharing in the downfall.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When her husband entered the room she was lying flat on her back, grasping the handle of the pitcher, her eyes closed, and her breathing stertorious. Althea, alarmed, stood over her, crying and screaming.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The old woman\u0027s taken too much,\" said Donovan. \"Get up, you divil!\" he shouted, leaning over his matrimonial partner. \"Ain\u0027t you ashamed of yourself, now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Donovan opened her eyes, and stared at him vacantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where am I?\" she inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On your back, you old fool, where you deserve to be.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s the whisky,\" murmured the fallen lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course it is. Why can\u0027t you drink dacent like me? Shure it\u0027s a purty example you\u0027re settin\u0027 to the child. Ain\u0027t you ashamed to lie here in a hape before them gintlemen?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This called Althea\u0027s attention to the German and[Pg 267] Dan. In spite of Dan\u0027s disguise, she recognized him with a cry of joy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Dan! have you come to take me away?\" she exclaimed, dashing past Donovan, and clasping her arms round the supposed Italian.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Have you come to take me away\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Dan! Have you come to take me away?\" Althea exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hillo! what\u0027s up?\" exclaimed Donovan, looking at the two in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it\u0027s my brother Dan,\" exclaimed Althea. \"You\u0027ll take me away, won\u0027t you, Dan? How funny you look! Where did you get your fiddle?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So that\u0027s your game, my young chicken, is it?\" demanded Donovan, seizing our hero roughly by the shoulder. Then pulling off Dan\u0027s hat, he added: \"You\u0027re no more Italian than I am.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan saw that it would be useless to keep up the deceit any longer. He looked Donovan full in the face, and said, firmly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right, Mr. Donovan, I have come here for my sister.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2960/81461.html","bookId":429,"creation":"Aug 5, 2019 5:39:35 AM","modification":"Aug 5, 2019 5:39:35 AM"}
