{"id":93393,"no":39,"title":"Page 39","content":"\u003cp\u003eLawrence had insisted he drive, and as they made their way along the dark curvy highway, Schuyler couldn\u0027t help but notice the tiny, flickering lights against the hillside and how beautiful they were.\u003c/p\u003e\n\u003cp\u003e\"Yeah, but they\u0027re probably from the slums, which means the electricity infrastructure wasn\u0027t set up correctly. And is a potential fire hazard,\" Oliver pointed out.\u003c/p\u003e\n\u003cp\u003eSchuyler sighed. The city was rich in juxtapositions: poverty and wealth, crime and tourism in a heady, dizzying mix. It was impossible to admire the beauty without also noticing the ugliness.\u003c/p\u003e\n\u003cp\u003eThey rounded a particularly sharp corner when Lawrence suddenly pulled the car to the side of the road and slumped forward in his seat.\u003c/p\u003e\n\u003cp\u003e\"Grandfather!\" she cried, alarmed. She saw his eyes begin to dart back and forth, as if he were asleep but not asleep. He was receiving a sending.\u003c/p\u003e\n\u003cp\u003eWhen it ended, his face was ashen. For a moment Schuyler thought he was going to faint.\u003c/p\u003e\n\u003cp\u003e\"What happened? What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003eHer grandfather shook out his handkerchief and pressed it to his forehead. \"That was Edmund Oelrich before he passed. The entire Conclave. Massacred. Those who were not burned were taken.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re all dead?\" Schuyler gasped. \"But how? Why...?\" She clutched his arm. \"What do you mean, they\u0027re all dead?\"\u003c/p\u003e\n\u003cp\u003eIn the backseat she turned to Oliver for help. But he was shocked into silence, his face a mask of helpless confusion.\u003c/p\u003e\n\u003cp\u003e\"The Almeidas were Silver Bloods,\" Lawrence said, stammering uncharacteristically. \"They showed their hand tonight. I had suspected it, which is why I stayed in Rio for longer than I intended, but Alfonso had passed the test. He did not have the Mark. I was deceived.\" Lawrence was shaking. \"But they had help. Edmund said Nan Cutler was one of them.\"\u003c/p\u003e\n\u003cp\u003eSchuyler bit her lip.\u003c/p\u003e\n\u003cp\u003e\"Nan Cutler!\" Lawrence sounded crushingly wounded. \"During the crisis in Rome she had been integral to the Silver Blood defeat. I was blinded by her years of loyalty to the Conclave. This is my fault, I was overconfident and trusting when I should have been guarded and wary.\" Abruptly Lawrence turned the car around, causing the car in the opposite direction to swerve wildly to get out of his way. \"Kingsley was right - I put too much faith on old allegiances,\" he said as he floored the pedal and the car shot forward.\u003c/p\u003e\n\u003cp\u003e\"Where are we going?\"\u003c/p\u003e\n\u003cp\u003e\"To Corcovado.\"\u003c/p\u003e\n\u003cp\u003e\"Now? Why?\"\u003c/p\u003e\n\u003cp\u003eLawrence gripped the wheel tightly. \"The attack on the Conclave can only mean one thing: the Silver Bloods are planning to free Leviathan.\"\u003c/p\u003e\n\u003cp\u003eThey parked at the base of the entrance to the Statue of the Redeemer and ran out of the car. The parking lot was empty and quiet, and they could see the statue lit up by floodlights from below. \"Disguise yourself,\" Lawrence ordered Schuyler. \"And you, stay here,\" he told Oliver.\u003c/p\u003e\n\u003cp\u003eOliver began to protest, but one look from Lawrence silenced him.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t,\" Schuyler confessed to her grandfather. \"I can\u0027t perform the mutatio.\"\u003c/p\u003e\n\u003cp\u003eLawrence was already in the form of the young man with the hawkish nose and imperial attitude she had first seen at the Venice Biennale. \"Of course you can,\" he said, scaling the fence easily.\u003c/p\u003e\n\u003cp\u003e\"Grandfather, I can\u0027t. I can\u0027t turn into a fog or an animal,\" she said, following his lead.\u003c/p\u003e\n\u003cp\u003e\"Who said you could?\" he asked as they flew up the series of zigzagged stairwells to the statue. Their footsteps made hardly any noise on the concrete as they ran.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Most likely you are like me. I cannot turn into a cloud or a creature either. But I can shift my features, like so, and take on a different - but human - disguise. Try it.\"\u003c/p\u003e\n\u003cp\u003eSchuyler tried. She closed her eyes and concentrated on changing her features instead of shifting her entire form. Within seconds she found she had effectively morphed into one of the rich, pumped-up Argentine patronas who were on vacation in the country.\u003c/p\u003e\n\u003cp\u003eThey reached the top of the mountain and stood underneath the statue. Nobody was there. It was quiet and peaceful.\u003c/p\u003e\n\u003cp\u003eNot for the first time that evening Schuyler wondered if her grandfather was losing it. Weren\u0027t they at the wrong place? Why had he brought them here? For what? \"Maybe we\u0027re too late. Or they\u0027re not coming. We should really head to the Almeidas and see if ...\"\u003c/p\u003e\n\u003cp\u003e\"HUSH!\" Lawrence commanded.\u003c/p\u003e\n\u003cp\u003eShe shut up.\u003c/p\u003e\n\u003cp\u003eThey walked the perimeter of the statue\u0027s base. Nothing. They were alone. Schuyler began to panic. Why were they here when their people were being killed somewhere else? They should go back; this was a big mistake.\u003c/p\u003e\n\u003cp\u003eShe walked around the northeast side, convinced Lawrence had guessed incorrectly. There was nothing to ...\u003c/p\u003e\n\u003cp\u003e\"Schuyler! WATCH OUT!\" Oliver yelled. He had crept up the mountain behind them, unwilling to be left behind.\u003c/p\u003e\n\u003cp\u003eSchuyler looked up. There was a man in a white suit standing right in front of her, with a golden sword pointed directly at her chest.\u003c/p\u003e\n\u003cp\u003eShe ducked and hit the ground hard, just as Lawrence removed his own blade from a hidden scabbard in his jacket.\u003c/p\u003e\n\u003cp\u003eThe two swords clashed, one golden and fiery, the other icy and silver, the metals ringing against each other, echoing a sound that carried to the valley below. \u003c/p\u003e","sourceLink":"https://allnovel.net/revelations-blue-bloods-3/page-39.html","bookId":2121,"creation":"Oct 5, 2019 6:02:06 PM","modification":"Oct 5, 2019 6:02:06 PM"}
