{"id":93398,"no":44,"title":"Page 44","content":"\u003cp\u003eTwo Weeks Later\u003c/p\u003e\n\u003cp\u003eSo this was their sordid little love nest. Mimi let herself into the dark apartment. She had found a key that she\u0027d never seen before in Jack\u0027s room. She had suspected where it led, and she knew he wouldn\u0027t be long in coming.\u003c/p\u003e\n\u003cp\u003eThe door opened silently, and Jack entered.\u003c/p\u003e\n\u003cp\u003eThe look on her brother\u0027s face told her all she needed to know. Mimi smiled to herself. So the little half-blood finally cut her ties.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve won,\" Jack said softly. He looked at Mimi with such fiery hatred that she almost cowered at his words. But she was no weakling. She was Azrael, and Azrael did not cower, not even to Abbadon.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve won nothing,\" Mimi replied coldly. \"Please remember that almost all of the Elders are dead, that the Dark Prince is ascendant, and what is left of the Conclave is being led by a broken man who used to be the strongest of us all. And yet all you seem to care about, my darling, is that you no longer get to play with your little love toy.\"\u003c/p\u003e\n\u003cp\u003eInstead of answering her, Jack flew across the room and slapped her hard across the face, sending her crashing to the floor. But before he could wield another blow, Mimi leaped up and slammed him against the window, knocking him completely out of breath.\u003c/p\u003e\n\u003cp\u003e\"Is this what you want?\" she hissed as she lifted him up by his shirt collar, his face turning a ghastly shade of red.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t let me destroy you,\" he sneered.\u003c/p\u003e\n\u003cp\u003e\"Just try, my sweet.\"\u003c/p\u003e\n\u003cp\u003eJack twisted out of her grasp and flipped her over, kicking her down the length of the room. She sprung up with her hands clenched, her nails sharp as claws, and fangs bared. They met halfway in the air, and Jack put a hand on her throat and began to squeeze. But she scratched at his eyes and wrenched her body so that she was rolling on top of him, her sword at his throat, with the upper hand.\u003c/p\u003e\n\u003cp\u003eSUBMIT. Mimi sent.\u003c/p\u003e\n\u003cp\u003eNEVER.\u003c/p\u003e\n\u003cp\u003eYou are mine.\u003c/p\u003e\n\u003cp\u003eYou are wrong.\u003c/p\u003e\n\u003cp\u003eMimi threw him across the room. Both of them were bruised and bloody. Mimi\u0027s blouse was ripped in half, and Jack\u0027s shirt was torn at the collar.\u003c/p\u003e\n\u003cp\u003eJack attacked again - this time pinning Mimi to the ground. His breath was hot in her ear. She could feel his body tense, rigid, and pulsing on top of hers, could almost see the red aura of his rage.\u003c/p\u003e\n\u003cp\u003e\"You want this,\" she said slyly. \"You want me.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eHe twisted her arms behind her back, pinned his knees against her hips, then tightened his grip on her wrists so that they grew purple with bruises. For weeks, the shape of his fingers would be imprinted on her flesh.\u003c/p\u003e\n\u003cp\u003eFor a moment she was truly terrified. This was Abbadon the Cruel. The Angel of Destruction. He could and would destroy her if he had to. If he felt like it. He had destroyed worlds before. He had decimated Paradise in the name of the Morningstar.\u003c/p\u003e\n\u003cp\u003eShe trembled in his grasp.\u003c/p\u003e\n\u003cp\u003eAll his gentleness, all his kindness, all the bright shining gorgeousness of his love, he had always given to someone else. He had adored Gabrielle, had worshipped her, had written her poems and sang her songs, and for Schuyler there were novels and love notes and sweet kisses and furtive tender meetings by a fireplace.\u003c/p\u003e\n\u003cp\u003eBut for his twin, Azrael, he had shown nothing but his anger and violence. His strength and destruction.\u003c/p\u003e\n\u003cp\u003eHe saved the best of himself for those who did not deserve it. Never showed his true face to those damnable Daughters of the Light.\u003c/p\u003e\n\u003cp\u003eFor Azrael, there was only darkness and annihilation.\u003c/p\u003e\n\u003cp\u003eRape and carnage.\u003c/p\u003e\n\u003cp\u003eWar and pillage.\u003c/p\u003e\n\u003cp\u003eA tear escaped from her eye and glittered in the moonlight.\u003c/p\u003e\n\u003cp\u003eBut just as Mimi thought he would destroy her forever, Jack began kissing her with such force that her lips and neck would be sore and swollen with his bites. In answer, she pulled him toward her, as hard as she could, by the roots of his hair.\u003c/p\u003e\n\u003cp\u003eLove. It\u0027s so close to hate, it\u0027s almost indistinguishable.\u003c/p\u003e\n\u003cp\u003eBut this is how it was for the two of them.\u003c/p\u003e\n\u003cp\u003eLove and hate.\u003c/p\u003e\n\u003cp\u003eLife and death.\u003c/p\u003e\n\u003cp\u003eJoy and anguish.\u003c/p\u003e\n\u003cp\u003eFinally he lay still against her, drifting into a dreamless sleep. She smoothed his hair from his brow and called his name softly. Abbadon the Unlikely. Named so because his wistful nature masked a cold and fierce rage.\u003c/p\u003e\n\u003cp\u003eThe Destroyer of Worlds, and the emperor of her own heart.\u003c/p\u003e\n\u003cp\u003eOne day he would thank her for saving his life. \u003c/p\u003e","sourceLink":"https://allnovel.net/revelations-blue-bloods-3/page-44.html","bookId":2121,"creation":"Oct 5, 2019 6:02:06 PM","modification":"Oct 5, 2019 6:02:06 PM"}
