{"id":93360,"no":6,"title":"Page 6","content":"\u003cp\u003eTheboy stepped into the light, his face illuminated by the fire. He looked the same - the same sad eyes, the same mess of black hair. He was wearing the same dirty T-shirt and jeans that Schuyler remembered him wearing the last time she\u0027d seen him.\u003c/p\u003e\n\u003cp\u003e\"Dylan! But how? What happened? Where have you been?\" She ran to hug him, an ecstatic smile on her face. Dylan! Alive! He was not expected, but he was very welcome. She had so many questions to ask him: what happened the night he disappeared? How had he escaped from the Silver Bloods? How was it possible that he survived?\u003c/p\u003e\n\u003cp\u003eYet as soon she got close to him, she realized something was very wrong. Dylan\u0027s face was grim, angry. His eyes were unfocused and bordering on hysteria.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003eLightning-fast, Dylan pushed Schuyler with his mind, a telepathic\u0026nbsp;\u0026nbsp;shove - SLAM! - but Schyler was faster and ducked the mind-blow.\u003c/p\u003e\n\u003cp\u003e\"Dylan! What are you doing?!\" She held up her hands as if to shield herself, as though she could protect herself with a physical barrier.\u003c/p\u003e\n\u003cp\u003eSLAM! Another one. This time the suggestion was to throw herself off the balcony.\u003c/p\u003e\n\u003cp\u003eSchuyler choked, her brain feeling like it might explode from the pressure it was fighting.\u003c/p\u003e\n\u003cp\u003eShe fled to the terrace, not able to stop the suggestion from taking over her senses. She looked over her shoulder. Dylan was right behind her. He looked manic and cruel, as if possessed by some malicious force.\u003c/p\u003e\n\u003cp\u003e\"Why are you doing this?\" she cried, as he sent yet another wrenching, agonizing command.\u003c/p\u003e\n\u003cp\u003eJUMP!\u003c/p\u003e\n\u003cp\u003eYes. She must comply, she must obey - JUMP! - yes, she will, but if she is not careful, and she has no time to be ... she could lose her footing...she could...Oh God, what if Lawrence is wrong? What if she isn\u0027t immortal? She is half human after all...What if she doesn\u0027t survive? What if, unlike the other Blue Bloods, the cycle of sleep and rest and reincarnation doesn\u0027t pertain to her. What if this one life is all she has? But it is much too late to worry about that now - she has no choice. JUMP! She can\u0027t see where she\u0027s going, she is flailing and scrabbling for purchase...He\u0027s right behind her, so she\u0027s going to...\u003c/p\u003e\n\u003cp\u003eShe leaps from the terrace, flying...\u003c/p\u003e\n\u003cp\u003eNo time, no time to scramble for another ledge, no time to grasp a rail...The sidewalk looming...\u003c/p\u003e\n\u003cp\u003eSchuyler braced herself for impact and landed on her feet. On her boots. THUD. Right into the middle of a stylish mob huddled in front of the Perry St. restaurant. New Yorkers abandoned to the elements because they smoked.\u003c/p\u003e\n\u003cp\u003eAnd in a flash, Dylan was right behind her. So fast, he was so very fast...\u003c/p\u003e\n\u003cp\u003eThen a powerful coercion took over: this was no mere suggestion - this was a control-lock. Crushing. This was what Lawrence had told her was the little-known fifth factor of the glom. The Consummo Alienari. Complete loss of one\u0027s mind to another.\u003c/p\u003e\n\u003cp\u003eFor the Red Bloods, alienari meant instant death. For the vampires, it wrought irrevocable paralysis - the mind taken over so that one\u0027s will was completely subsumed. Lawrence had told her that taking the blood and the memories of fellow vampires, performing the Caerimonia Osculor on their own kind, was not the only thing Silver Bloods were known for. They had many other tortures and tricks up their sleeve. They did not drain all of their victims; some of them were left to live because they were more useful to the Silver Bloods as pawns.\u003c/p\u003e\n\u003cp\u003eSchuyler felt a heaviness as the force of the alienari settled in ... she was about to succumb; so much easier to surrender rather than to fight...she felt herself weakening under its hold...What would be left of her if he succeeded? She thought of her mother, alive but not alive, would that be her fate? She was woozy on her feet, swaying; it would be over soon. But then she found something in the dark effluvium - like a tail, the tail of the glom - and she was able to isolate the signal, able to figure out which part was trying to control her, and she twisted it around, like wrestling an alligator - flipped it on its head - and soon she was taking over, and she was bending it to her will, and -\u003c/p\u003e\n\u003cp\u003eDylan is screaming - he is the one in pain - he is the one backed up against the wall, unable to move while her mind holds his in her grasp. She can feel it, can feel her dominance taking over, greedily exulting over its triumph. She is squeezing him - his entire being - with her mind. It is like a vise -\u003c/p\u003e\n\u003cp\u003eShe is killing him...\u003c/p\u003e\n\u003cp\u003eSoon he will no longer be himself...but an extension of her will...\u003c/p\u003e\n\u003cp\u003eUntil...\u003c/p\u003e\n\u003cp\u003e\"SCHUYLER! STOP!\"\u003c/p\u003e\n\u003cp\u003e\"DON\u0027T!\"\u003c/p\u003e\n\u003cp\u003e\"SCHUYLER!\" A roar.\u003c/p\u003e\n\u003cp\u003eHer name. Someone was calling her name. Oliver. Telling her to stop.\u003c/p\u003e\n\u003cp\u003eSchuyler released her hold, but not completely. She was still holding out her hand, and twenty feet away, Dylan was pinned to a wall. Held there by her mind. He was gurgling. He couldn\u0027t breathe.\u003c/p\u003e\n\u003cp\u003e\"PLEASE!\" It was a girl\u0027s voice this time. Bliss.\u003c/p\u003e\n\u003cp\u003eThere. She let go.\u003c/p\u003e\n\u003cp\u003eDylan sagged to the ground. \u003c/p\u003e","sourceLink":"https://allnovel.net/revelations-blue-bloods-3/page-6.html","bookId":2121,"creation":"Oct 5, 2019 6:02:06 PM","modification":"Oct 5, 2019 6:02:06 PM"}
