{"id":65545,"no":12,"title":"Page 12","content":"\u003cp\u003eHere the marble floors are white, with a black Candor symbol in the center of the room, and the walls are lit with rows of dim yellow lights, so the whole room glows. Every voice echoes.\u003c/p\u003e\n\u003cp\u003eMost of Candor and the remnants of Dauntless are already gathered. Some of them sit on the tiered benches that wrap around the edge of the room, but there isn’t enough space for everyone, so the rest are crowded around the Candor symbol. In the center of the symbol, between the unbalanced scales, are two empty chairs.\u003c/p\u003e\n\u003cp\u003eTobias reaches for my hand. I lace my fingers in his.\u003c/p\u003e\n\u003cp\u003eOur Dauntless guards lead us to the center of the room, where we are greeted with, at best, murmurs, and at worst, jeers. I spot Jack Kang in the front row of the tiered benches.\u003c/p\u003e\n\u003cp\u003eAn old, dark-skinned man steps forward, a black box in his hands.\u003c/p\u003e\n\u003cp\u003e“My name is Niles,” he says. “I will be your questioner. You—” He points at Tobias. “You will be going first. So if you will please step forward . . .”\u003c/p\u003e\n\u003cp\u003eTobias squeezes my hand, and then releases it, and I stand with Christina at the edge of the Candor symbol. The air in the room is warm—moist, summer air, sunset air—but I feel cold.\u003c/p\u003e\n\u003cp\u003eNiles opens the black box. It contains two needles, one for Tobias and one for me. He also takes an antiseptic wipe from his pocket and offers it to Tobias. We didn’t bother with that kind of thing in Dauntless.\u003c/p\u003e\n\u003cp\u003e“The injection site is in your neck,” Niles says.\u003c/p\u003e\n\u003cp\u003eAll I hear, as Tobias applies antiseptic to his skin, is the wind. Niles steps forward and plunges the needle into Tobias’s neck, squeezing the cloudy, bluish liquid into his veins. The last time I saw someone inject Tobias with something, it was Jeanine, putting him under a new simulation, one that was effective even on the Divergent—or so she believed. I thought, then, that he was lost to me forever.\u003c/p\u003e\n\u003cp\u003eI shudder.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWELVE\u003c/p\u003e\n\u003cp\u003e“I WILL ASK you a series of simple questions so that you can grow accustomed to the serum as it takes full effect,” says Niles. “Now. What is your name?”\u003c/p\u003e\n\u003cp\u003eTobias sits with slouched shoulders and a lowered head, like his body is too heavy for him. He scowls and squirms in the chair, and through gritted teeth says, “Four.”\u003c/p\u003e\n\u003cp\u003eMaybe it isn’t possible to lie under the truth serum, but to select which version of the truth to tell: Four is his name, but it is not his name.\u003c/p\u003e\n\u003cp\u003e“That is a nickname,” Niles says. “What is your real name?”\u003c/p\u003e\n\u003cp\u003e“Tobias,” he says.\u003c/p\u003e\n\u003cp\u003eChristina elbows me. “Did you know that?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“What are the names of your parents, Tobias?”\u003c/p\u003e\n\u003cp\u003eTobias opens his mouth to answer, and then clenches his jaw as if to stop the words from spilling out.\u003c/p\u003e\n\u003cp\u003e“Why is this relevant?” Tobias asks.\u003c/p\u003e\n\u003cp\u003eThe Candor around me mutter to each other, some of them scowling. I raise my eyebrow at Christina.\u003c/p\u003e\n\u003cp\u003e“It’s extremely difficult not to immediately answer questions while under the truth serum,” she says. “It means he has a seriously strong will. And something to hide.”\u003c/p\u003e\n\u003cp\u003e“Maybe it wasn’t relevant before, Tobias,” Niles says, “but it is now that you’ve resisted answering the question. The names of your parents, please.”\u003c/p\u003e\n\u003cp\u003eTobias closes his eyes. “Evelyn and Marcus Eaton.”\u003c/p\u003e\n\u003cp\u003eSurnames are just an additional means of identification, useful only to prevent confusion in official records. When we marry, one spouse has to take the other’s surname, or both have to take a new one. Still, while we may carry our names from family to faction, we rarely mention them.\u003c/p\u003e\n\u003cp\u003eBut everyone recognizes Marcus’s surname. I can tell by the clamor that rises in the room after Tobias speaks. The Candor all know Marcus is the most influential government official, and some of them must have read the article Jeanine released about his cruelty toward his son. It was one of the only things she said that was true. And now everyone knows that Tobias is that son.\u003c/p\u003e\n\u003cp\u003eTobias Eaton is a powerful name.\u003c/p\u003e\n\u003cp\u003eNiles waits for silence, then continues. “So you are a faction transfer, are you not?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You transferred from Abnegation to Dauntless?”\u003c/p\u003e\n\u003cp\u003e“Yes,” snaps Tobias. “Isn’t that obvious?”\u003c/p\u003e\n\u003cp\u003eI bite my lip. He should calm down; he is giving away too much. The more reluctant he is to answer a question, the more determined Niles will be to hear the answer.\u003c/p\u003e\n\u003cp\u003e“One of the purposes of this interrogation is to determine your loyalties,” says Niles, “so I must ask: Why did you transfer?”\u003c/p\u003e\n\u003cp\u003eTobias glares at Niles, and keeps his mouth shut. Seconds pass in complete silence. The longer he tries to resist the serum, the harder it seems to be for him: color fills his cheeks, and he breathes faster, heavier. My chest aches for him. The details of his childhood should stay inside him, if that’s where he wants them to be. Candor is cruel for forcing them from him, for taking away his freedom.\u003c/p\u003e\n\u003cp\u003e“This is horrible,” I say hotly to Christina. “Wrong.”\u003c/p\u003e\n\u003cp\u003e“What?” she says. “It’s a simple question.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “You don’t understand.”\u003c/p\u003e\n\u003cp\u003eChristina smiles a little at me. “You really care about him.”\u003c/p\u003e\n\u003cp\u003eI am too busy watching Tobias to respond.\u003c/p\u003e\n\u003cp\u003eNiles says, “I’ll ask again. It is important that we understand the extent of your loyalty to your chosen faction. So why did you transfer to Dauntless, Tobias?”\u003c/p\u003e\n\u003cp\u003e“To protect myself,” says Tobias. “I transferred to protect myself.”\u003c/p\u003e\n\u003cp\u003e“Protect yourself from what?”\u003c/p\u003e\n\u003cp\u003e“From my father.”\u003c/p\u003e\n\u003cp\u003eAll the conversations in the room stop, and the silence they leave in their wake is worse than the muttering was. I expect Niles to keep probing, but he doesn’t.\u003c/p\u003e\n\u003cp\u003e“Thank you for your honesty,” Niles says. The Candor repeat the phrase under their breath. All around me are the words “Thank you for your honesty” at different volumes and pitches, and my anger begins to dissolve. The whispered words seem to welcome Tobias, to embrace and then discard his darkest secret.\u003c/p\u003e\n\u003cp\u003eIt’s not cruelty, maybe, but a desire to understand, that motivates them. That doesn’t make me any less afraid of going under truth serum.\u003c/p\u003e\n\u003cp\u003e“Is your allegiance with your current faction, Tobias?” Niles says.\u003c/p\u003e\n\u003cp\u003e“My allegiance lies with anyone who does not support the attack on Abnegation,” he says.\u003c/p\u003e\n\u003cp\u003e“Speaking of which,” Niles says, “I think we should focus on what happened that day. What do you remember about being under the simulation?”\u003c/p\u003e\n\u003cp\u003e“I was not under the simulation, at first,” says Tobias. “It didn’t work.”\u003c/p\u003e\n\u003cp\u003eNiles laughs a little. “What do you mean, it didn’t work?”\u003c/p\u003e\n\u003cp\u003e“One of the defining characteristics of the Divergent is that their minds are resistant to simulations,” says Tobias. “And I am Divergent. So no, it didn’t work.”\u003c/p\u003e\n\u003cp\u003eMore mutters. Christina nudges me with her elbow.\u003c/p\u003e\n\u003cp\u003e“Are you too?” she says, close to my ear so she can stay quiet. “Is that why you were awake?”\u003c/p\u003e\n\u003cp\u003eI look at her. I have spent the past few months afraid of the word “Divergent,” terrified that anyone would discover what I am. But I won’t be able to hide it anymore. I nod.\u003c/p\u003e\n\u003cp\u003eIt’s like her eyes swell to fill their sockets; that’s how big they get. I have trouble identifying her expression. Is it shock? Fear?\u003c/p\u003e\n\u003cp\u003eAwe?\u003c/p\u003e\n\u003cp\u003e“Do you know what it means?” I say.\u003c/p\u003e\n\u003cp\u003e“I heard about it when I was young,” she says in a reverent whisper.\u003c/p\u003e\n\u003cp\u003eDefinitely awe.\u003c/p\u003e\n\u003cp\u003e“Like it was a fantasy story,” she says. “‘There are people with special powers among us!’ Like that.”\u003c/p\u003e\n\u003cp\u003e“Well, it’s not a fantasy, and it’s not that big a deal,” I say. “It’s like the fear landscape simulation—you were aware while you were in it, and you could manipulate it. Except for me, it’s like that in every simulation.”\u003c/p\u003e\n\u003cp\u003e“But Tris,” she says, setting her hand on my elbow. “That’s impossible.”\u003c/p\u003e\n\u003cp\u003eIn the center of the room, Niles has his hands up and is trying to silence the crowd, but there are too many whispers—some hostile, some terrified, and some awed, like Christina’s. Finally Niles stands and yells, “If you don’t quiet down, you will be asked to leave!”\u003c/p\u003e\n\u003cp\u003eAt last everyone quiets down. Niles sits.\u003c/p\u003e\n\u003cp\u003e“Now,” he says. “When you say ‘resistant to simulations,’ what do you mean?”\u003c/p\u003e\n\u003cp\u003e“Usually, it means we’re aware during simulations,” says Tobias. He seems to have an easier time with the truth serum when he answers factual questions instead of emotional ones. He doesn’t sound like he’s under the truth serum at all now, though his slumped posture and wandering eyes indicate otherwise. “But the attack simulation was different, using a different kind of simulation serum, one with long-range transmitters. Evidently the long-range transmitters didn’t work on the Divergent at all, because I awoke in my own mind that morning.”\u003c/p\u003e\n\u003cp\u003e“You say you weren’t under the simulation at first. Can you explain what you mean by that?”\u003c/p\u003e\n\u003cp\u003e“I mean that I was discovered and brought to Jeanine, and she injected a version of the simulation serum that specifically targeted the Divergent. I was aware during that simulation, but it didn’t do much good.”\u003c/p\u003e\n\u003cp\u003e“The video footage from the Dauntless headquarters shows you running the simulation,” Niles says darkly. “How, exactly, do you explain that?”\u003c/p\u003e\n\u003cp\u003e“When a simulation is running, your eyes still see and process the actual world, but your brain no longer comprehends them. On some level, though, your brain still knows what you’re seeing and where you are. The nature of this new simulation was that it recorded my emotional responses to outside stimuli,” Tobias says, closing his eyes for a few seconds, “and responded by altering the appearance of that stimuli. The simulation made my enemies into friends, my friends into enemies. I thought I was shutting the simulation down. Really I was receiving instructions about how to keep it running.”\u003c/p\u003e\n\u003cp\u003eChristina nods along to his words. I feel calmer when I see that most of the crowd is doing the same thing. This is the benefit of the truth serum, I realize. Tobias’s testimony is irrefutable this way.\u003c/p\u003e\n\u003cp\u003e“We have seen footage of what ultimately happened to you in the control room,” says Niles, “but it is confusing. Please describe it to us.”\u003c/p\u003e\n\u003cp\u003e“Someone entered the room, and I thought it was a Dauntless soldier, trying to stop me from destroying the simulation. I was fighting her, and . . .” Tobias scowls, struggling. “. . . and then she stopped, and I got confused. Even if I had been awake, I would have been confused. Why would she surrender? Why didn’t she just kill me?”\u003c/p\u003e\n\u003cp\u003eHis eyes search the crowd until they find my face. My heartbeat lives in my throat; lives in my cheeks.\u003c/p\u003e\n\u003cp\u003e“I still don’t understand,” he says softly, “how she knew that it would work.”\u003c/p\u003e\n\u003cp\u003eLives in my fingertips.\u003c/p\u003e\n\u003cp\u003e“I think my conflicted emotions confused the simulation,” he says. “And then I heard her voice. Somehow, that enabled me to fight the simulation.”\u003c/p\u003e\n\u003cp\u003eMy eyes burn. I have tried not to think of that moment, when I thought he was lost to me and that I would soon be dead, when all I wanted was to feel his heartbeat. I try not to think of it now; I blink the tears from my eyes.\u003c/p\u003e\n\u003cp\u003e“I recognized her, finally,” he says. “We went back into the control room and stopped the simulation.”\u003c/p\u003e\n\u003cp\u003e“What is the name of this person?”\u003c/p\u003e\n\u003cp\u003e“Tris,” he says. “Beatrice Prior, I mean.”\u003c/p\u003e\n\u003cp\u003e“Did you know her before this happened?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“How did you know her?”\u003c/p\u003e\n\u003cp\u003e“I was her instructor,” he says. “Now we’re together.”\u003c/p\u003e\n\u003cp\u003e“I have a final question,” Niles says. “Among the Candor, before a person is accepted into our community, they have to completely expose themselves. Given the dire circumstances we are in, we require the same of you. So, Tobias Eaton: what are your deepest regrets?”\u003c/p\u003e\n\u003cp\u003eI look him over, from his beat-up sneakers to his long fingers to his straight eyebrows.\u003c/p\u003e\n\u003cp\u003e“I regret . . .” Tobias tilts his head, and sighs. “I regret my choice.”\u003c/p\u003e\n\u003cp\u003e“What choice?”\u003c/p\u003e\n\u003cp\u003e“Dauntless,” he says. “I was born for Abnegation. I was planning on leaving Dauntless, and becoming factionless. But then I met her, and . . . I felt like maybe I could make something more of my decision.”\u003c/p\u003e\n\u003cp\u003eHer.\u003c/p\u003e\n\u003cp\u003eFor a moment, it’s like I’m looking at a different person, sitting in Tobias’s skin, one whose life is not as simple as I thought. He wanted to leave Dauntless, but he stayed because of me. He never told me that.\u003c/p\u003e\n\u003cp\u003e“Choosing Dauntless in order to escape my father was an act of cowardice,” he says. “I regret that cowardice. It means I am not worthy of my faction. I will always regret it.”\u003c/p\u003e\n\u003cp\u003eI expect the Dauntless to let out indignant shouts, maybe to charge the chair and beat him to a pulp. They are capable of far more erratic things than that. But they don’t. They stand in stony silence, with stony faces, staring at the young man who did not betray them, but never truly felt that he belonged to them.\u003c/p\u003e\n\u003cp\u003eFor a moment we are all silent. I don’t know who starts the whisper; it seems to originate from nothing, to come from no one. But someone whispers, “Thank you for your honesty,” and the rest of the room repeats it.\u003c/p\u003e\n\u003cp\u003e“Thank you for your honesty,” they whisper.\u003c/p\u003e\n\u003cp\u003eI don’t join in.\u003c/p\u003e\n\u003cp\u003eI am the only thing that kept him in the faction he wanted to leave. I am not worth that.\u003c/p\u003e\n\u003cp\u003eMaybe he deserves to know.\u003c/p\u003e\n\u003cp\u003eNiles stands in the center of the room with a needle in hand. The lights above him make it shine. All around me, the Dauntless and the Candor wait for me to step forward and spill my entire life before them.\u003c/p\u003e\n\u003cp\u003eThe thought occurs to me again: Maybe I can fight the serum. But I don’t know if I should try. It might be better for the people I love if I come clean. \u003c/p\u003e","sourceLink":"https://allnovel.net/insurgent-divergent-2/page-12.html","bookId":1699,"creation":"Oct 5, 2019 9:58:19 AM","modification":"Oct 5, 2019 9:58:19 AM"}
