{"id":65552,"no":19,"title":"Page 19","content":"\u003cp\u003eI tuck my wet hair behind my ears. I woke up ten minutes before the meeting was supposed to start and ran to the showers. Though I’m still exhausted, I feel more alert now.\u003c/p\u003e\n\u003cp\u003e“What seems to me to require more investigation,” Jack says, “is the Divergent.”\u003c/p\u003e\n\u003cp\u003eHe looks tired—he has dark circles under his eyes, and his short hair sticks out at random, like he’s been pulling it all night. Despite the stifling heat of the room, he wears a long-sleeved shirt that buttons at the wrists—he must have been distracted when he dressed this morning.\u003c/p\u003e\n\u003cp\u003e“If you are one of the Divergent, please step forward so that we can hear from you.”\u003c/p\u003e\n\u003cp\u003eI look sideways at Uriah. This feels dangerous. My Divergence is something I am supposed to hide. Admitting it is supposed to mean death. But there is no sense in hiding it now—they already know about me.\u003c/p\u003e\n\u003cp\u003eTobias is the first to move. He starts into the crowd, at first turning his body to wedge his way between people, and then, when they step back for him, moving straight toward Jack Kang with his shoulders back.\u003c/p\u003e\n\u003cp\u003eI move, too, muttering “Excuse me” to the people in front of me. They draw back like I just threatened to spit poison at them. A few others step forward, in Candor black and white, but not many. One of them is the girl I helped.\u003c/p\u003e\n\u003cp\u003eDespite the notoriety Tobias now has among the Dauntless, and my new title as That Girl Who Stabbed Eric, we are not the real focus of everyone’s attention. Marcus is.\u003c/p\u003e\n\u003cp\u003e“You, Marcus?” says Jack when Marcus reaches the middle of the room and stands on top of the lower scale in the floor.\u003c/p\u003e\n\u003cp\u003e“Yes,” Marcus says. “I understand that you are concerned—that you all are concerned. You had never heard of the Divergent a week ago, and now all that you know is that they are immune to something to which you are susceptible, and that is a frightening thing. But I can assure you that there is nothing to be afraid of, as far as we are concerned.”\u003c/p\u003e\n\u003cp\u003eAs he speaks, his head tilts and his eyebrows lift in sympathy, and I understand at once why some people like him. He makes you feel that if you just placed everything in his hands, he would take care of it.\u003c/p\u003e\n\u003cp\u003e“It seems clear to me,” says Jack, “that we were attacked so that the Erudite could find the Divergent. Do you know why that is?”\u003c/p\u003e\n\u003cp\u003e“No, I do not,” says Marcus. “Perhaps their intention was merely to identify us. It seems like useful information to have, if they intend to use their simulations again.”\u003c/p\u003e\n\u003cp\u003e“That was not their intention.” The words are past my lips before I decide to speak them. My voice sounds high and weak compared to Marcus’s and Jack’s, but it’s too late to stop. “They wanted to kill us. They’ve been killing us since before any of this happened.”\u003c/p\u003e\n\u003cp\u003eJack’s eyebrows draw together. I hear hundreds of tiny sounds, raindrops hitting the roof. The room darkens, as if under the gloom of what I just said.\u003c/p\u003e\n\u003cp\u003e“That sounds very much like a conspiracy theory,” Jack says. “What reason would the Erudite have to kill you?”\u003c/p\u003e\n\u003cp\u003eMy mother said people feared the Divergent because we couldn’t be controlled. That may be true, but fear of the uncontrollable is not a concrete enough reason to give Jack Kang for the Erudite wanting us dead. My heart races as I realize that I can’t answer his question.\u003c/p\u003e\n\u003cp\u003e“I . . .” I start. Tobias interrupts me.\u003c/p\u003e\n\u003cp\u003e“Obviously we don’t know,” he says, “but there are nearly a dozen mysterious deaths recorded among the Dauntless from the past six years, and there is a correlation between those people and irregular aptitude test results or initiation simulation results.”\u003c/p\u003e\n\u003cp\u003eLightning strikes, making the room glow. Jack shakes his head. “While that is intriguing, correlation does not constitute evidence.”\u003c/p\u003e\n\u003cp\u003e“A Dauntless leader shot a Candor child in the head,” I snap. “Did you get a report of that? Did it seem ‘worthy of investigation’?”\u003c/p\u003e\n\u003cp\u003e“In fact I did,” he says. “And shooting a child in cold blood is a terrible crime that cannot go unpunished. Fortunately, we have the perpetrator in custody and will be able to put him on trial. However, we must keep in mind that the Dauntless soldiers did not give any evidence of wanting to harm the majority of us, or they would have killed us while we were unconscious.”\u003c/p\u003e\n\u003cp\u003eI hear irritated murmurs all around me.\u003c/p\u003e\n\u003cp\u003e“Their peaceful invasion suggests to me that it may be possible to negotiate a peace treaty with the Erudite and the other Dauntless,” he continues. “So I will arrange a meeting with Jeanine Matthews to discuss that possibility as soon as possible.”\u003c/p\u003e\n\u003cp\u003e“Their invasion wasn’t peaceful,” I say. I can see the corner of Tobias’s mouth from where I stand, and he is smiling. I take a deep breath and begin again. “Just because they didn’t shoot you all in the head doesn’t mean their intentions were somehow honorable. Why do you think they came here? Just to run through your hallways, knock you unconscious, and leave?”\u003c/p\u003e\n\u003cp\u003e“I assume they came here for people like you,” says Jack. “And while I am concerned for your safety, I don’t think we can attack them just because they wanted to kill a fraction of our population.”\u003c/p\u003e\n\u003cp\u003e“Killing you is not the worst thing they can do to you,” I say. “Controlling you is.”\u003c/p\u003e\n\u003cp\u003eJack’s lips curl with amusement. Amusement. “Oh? And how will they manage that?”\u003c/p\u003e\n\u003cp\u003e“They shot you with needles,” Tobias says. “Needles full of simulation transmitters. Simulations control you. That’s how.”\u003c/p\u003e\n\u003cp\u003e“We know how simulations work,” says Jack. “The transmitter is not a permanent implant. If they intended to control us, they would have done it right away.”\u003c/p\u003e\n\u003cp\u003e“But—” I begin.\u003c/p\u003e\n\u003cp\u003eHe interrupts me. “I know you have been under a lot of stress, Tris,” he says quietly, “and that you have done a great service to your faction and to Abnegation. But I think your traumatic experience may have compromised your ability to be completely objective. I can’t launch an attack based on a little girl’s speculations.”\u003c/p\u003e\n\u003cp\u003eI stand statue-still, unable to believe that he could be so stupid. My face burning. Little girl, he called me. A little girl who is stressed out to the point of paranoia. That is not me, but now, it’s who the Candor think I am.\u003c/p\u003e\n\u003cp\u003e“You don’t make our decisions for us, Kang,” says Tobias.\u003c/p\u003e\n\u003cp\u003eAll around me, the Dauntless shout their assent. Someone else yells, “You are not the leader of our faction!”\u003c/p\u003e\n\u003cp\u003eJack waits for their shouts to die down and then says, “That is true. If you want to, you can feel free to storm the Erudite compound by yourselves. But you will do so without our support, and may I remind you, you are greatly outnumbered and unprepared.”\u003c/p\u003e\n\u003cp\u003eHe’s right. We can’t attack Dauntless traitors and Erudite without Candor’s numbers. It would be a bloodbath if we tried. Jack Kang has all the power. And now we all know it.\u003c/p\u003e\n\u003cp\u003e“I thought so,” he says smugly. “Very well. I will contact Jeanine Matthews, and see if we can negotiate a peace. Any objections?”\u003c/p\u003e\n\u003cp\u003eWe can’t attack without Candor, I think, unless we have the factionless.\u003c/p\u003e\n\u003cp\u003eCHAPTER NINETEEN\u003c/p\u003e\n\u003cp\u003eTHAT AFTERNOON I join a group of Candor and Dauntless cleaning up the broken windows in the lobby. I focus on the path of the broom, keeping my eyes on the dust that collects between glass fragments. My muscles remember the movement before the rest of me does, but when I look down, instead of dark marble I see plain white tile and the bottom of a light gray wall; I see strands of blond hair that my mother trimmed, and the mirror safely tucked behind its wall panel.\u003c/p\u003e\n\u003cp\u003eMy body goes weak, and I lean into the broom handle for support.\u003c/p\u003e\n\u003cp\u003eA hand touches my shoulder, and I twitch away from it. But it’s just a Candor girl—a child. She looks up at me, wide-eyed.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” she says, her voice high and indistinct.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I say. Too sharply. I hurry to amend it. “Just tired. Thank you.”\u003c/p\u003e\n\u003cp\u003e“I think you’re lying,” she says.\u003c/p\u003e\n\u003cp\u003eI notice a bandage peeking out from the end of her sleeve, probably covering the needle puncture. The idea of this little girl under a simulation nauseates me. I can’t even look at her. I turn away.\u003c/p\u003e\n\u003cp\u003eAnd I see them: outside, a traitor Dauntless man, propping up a woman with a bleeding leg. I see the gray streaks in the woman’s hair and the end of the man’s hooked nose and the blue armband of a Dauntless traitor just beneath their shoulders, and recognize them both. Tori and Zeke.\u003c/p\u003e\n\u003cp\u003eTori is trying to walk, but one of her legs drags behind her, useless. A wet, dark patch covers most of her thigh.\u003c/p\u003e\n\u003cp\u003eThe Candor stop sweeping and stare at them. The Dauntless guards standing near the elevators rush toward the entrance with their guns lifted. My fellow sweepers back up to get out of the way, but I stay where I am, heat rushing through me as Zeke and Tori approach.\u003c/p\u003e\n\u003cp\u003e“Are they even armed?” someone says.\u003c/p\u003e\n\u003cp\u003eTori and Zeke reach what used to be the doors, and he puts up one of his hands when he sees the row of Dauntless with guns. The other he keeps wrapped around Tori’s waist.\u003c/p\u003e\n\u003cp\u003e“She needs medical attention,” says Zeke. “Right now.”\u003c/p\u003e\n\u003cp\u003e“Why should we give a traitor medical attention?” a Dauntless man with wispy blond hair and a double-pierced lip asks over his gun. A patch of blue dye marks his forearm.\u003c/p\u003e\n\u003cp\u003eTori moans, and I slip between two Dauntless to reach for her. She puts her hand, which is sticky with blood, in mine. Zeke lowers her to the ground with a grunt.\u003c/p\u003e\n\u003cp\u003e“Tris,” she says, sounding dazed.\u003c/p\u003e\n\u003cp\u003e“Better step back, girl,” the blond Dauntless man says.\u003c/p\u003e\n\u003cp\u003e“No,” I say. “Put your gun down.”\u003c/p\u003e\n\u003cp\u003e“Told you the Divergent were crazy,” one of the other armed Dauntless mutters to the woman next to him.\u003c/p\u003e\n\u003cp\u003e“I don’t care if you bring her upstairs and tie her to a bed to keep her from going on a shooting spree!” says Zeke, scowling. “Don’t let her bleed to death in the lobby of Candor headquarters!”\u003c/p\u003e\n\u003cp\u003eFinally, a few Dauntless come forward and lift Tori up.\u003c/p\u003e\n\u003cp\u003e“Where should we . . . take her?” one of them asks.\u003c/p\u003e\n\u003cp\u003e“Find Helena,” Zeke says. “Dauntless nurse.”\u003c/p\u003e\n\u003cp\u003eThe men nod and carry her toward the elevators. Zeke and I meet eyes.\u003c/p\u003e\n\u003cp\u003e“What happened?” I ask him.\u003c/p\u003e\n\u003cp\u003e“The traitor Dauntless found out we were collecting information from them,” he says. “Tori tried to get away, but they shot her as she was running. I helped her get here.”\u003c/p\u003e\n\u003cp\u003e“That’s a nice story,” says the blond Dauntless man. “Want to tell it again under truth serum?”\u003c/p\u003e\n\u003cp\u003eZeke shrugs. “All right.” He puts his wrists together in front of him dramatically. “Haul me away, if you’re so desperate to.”\u003c/p\u003e\n\u003cp\u003eThen his eyes focus on something over my shoulder, and he starts walking. I turn to see Uriah jogging from the elevator bank. He is grinning.\u003c/p\u003e\n\u003cp\u003e“Heard a rumor you were a dirty traitor,” Uriah says.\u003c/p\u003e\n\u003cp\u003e“Yeah, whatever,” says Zeke.\u003c/p\u003e\n\u003cp\u003eThey collide in an embrace that looks almost painful to me, slapping each other’s backs and laughing with their fists clasped between them.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you didn’t tell us,” says Lynn, shaking her head. She sits across from me at the table, her arms crossed and one of her legs propped up.\u003c/p\u003e\n\u003cp\u003e“Oh, don’t get all huffy about it,” says Zeke. “I wasn’t even supposed to tell Shauna and Uriah. And it sort of defeats the purpose of being a spy if you tell everyone that’s what you are.”\u003c/p\u003e\n\u003cp\u003eWe sit in a room in Candor headquarters called the Gathering Place, which the Dauntless have taken to saying in a mocking way whenever they can. It is large and open, with black-and-white cloth draped on every wall, and a circle of podiums in the center of the room. Large round tables surround the podiums. Lynn told me they host monthly debates here, for entertainment, and also hold religious services here once a week. But even when no events are scheduled, the room is usually full.\u003c/p\u003e\n\u003cp\u003eZeke was cleared by the Candor an hour ago, in a short interrogation on the eighteenth floor. It was not as somber an occasion as Tobias’s and my interrogation, partly because there was no suspicious video footage implicating Zeke, and partly because Zeke is funny even when under truth serum. Maybe especially so. In any case, we came to the Gathering Place “for a ‘Hey, you’re not a dirty traitor!’ celebration,” as Uriah put it.\u003c/p\u003e\n\u003cp\u003e“Yeah, but we’ve been insulting you since the simulation attack,” Lynn says. “And now I feel like a jerk about it.”\u003c/p\u003e\n\u003cp\u003eZeke puts his arm around Shauna. “You are a jerk, Lynn. It’s part of your charm.”\u003c/p\u003e\n\u003cp\u003eLynn launches a plastic cup at him, which he deflects. Water sprays over the table, hitting him in the eye.\u003c/p\u003e\n\u003cp\u003e“Anyway, as I was saying,” says Zeke, rubbing his eye, “I was mostly working on getting Erudite defectors out safely. That’s why there’s a big group of them here, and a small group at Amity headquarters. But Tori . . . I have no idea what she was doing. She kept sneaking away for hours at a time, and whenever she was around, it was like she was about to explode. It’s no wonder she gave us away.”\u003c/p\u003e\n\u003cp\u003e“How’d you get the job?” says Lynn. “You’re not that special.”\u003c/p\u003e\n\u003cp\u003e“It was more because of where I was after the simulation attack. Smack-dab in a pack of Dauntless traitors. I decided to go with it,” he says. “Not sure about Tori, though.”\u003c/p\u003e\n\u003cp\u003e“She transferred from Erudite,” I say.\u003c/p\u003e\n\u003cp\u003eWhat I don’t say, because I’m sure she wouldn’t want everyone to know, is that Tori probably seemed explosive in Erudite headquarters because they murdered her brother for being Divergent.\u003c/p\u003e\n\u003cp\u003eShe told me once that she was waiting for an opportunity to get revenge.\u003c/p\u003e\n\u003cp\u003e“Oh,” says Zeke. “How do you know that?”\u003c/p\u003e\n\u003cp\u003e“Well, all the faction transfers have a secret club,” I say, leaning back in my chair. “We meet every third Thursday.” \u003c/p\u003e","sourceLink":"https://allnovel.net/insurgent-divergent-2/page-19.html","bookId":1699,"creation":"Oct 5, 2019 9:58:19 AM","modification":"Oct 5, 2019 9:58:19 AM"}
