{"id":65553,"no":20,"title":"Page 20","content":"\u003cp\u003eZeke snorts.\u003c/p\u003e\n\u003cp\u003e“Where’s Four?” says Uriah, checking his watch. “Should we start without him?”\u003c/p\u003e\n\u003cp\u003e“We can’t,” says Zeke. “He’s getting The Info.”\u003c/p\u003e\n\u003cp\u003eUriah nods like that means something. Then he pauses and says, “What info, again?”\u003c/p\u003e\n\u003cp\u003e“The info about Kang’s little peacemaking meeting with Jeanine,” says Zeke. “Obviously.”\u003c/p\u003e\n\u003cp\u003eAcross the room, I see Christina sitting at a table with her sister. They are both reading something.\u003c/p\u003e\n\u003cp\u003eMy entire body tenses. Cara, Will’s older sister, is walking across the room toward Christina’s table. I duck my head.\u003c/p\u003e\n\u003cp\u003e“What?” Uriah says, looking over his shoulder. I want to punch him.\u003c/p\u003e\n\u003cp\u003e“Stop it!” I say. “Could you be any more obvious?” I lean forward, folding my arms on the table. “Will’s sister is over there.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I talked to her about getting out of Erudite once, while I was there,” says Zeke. “Said she saw an Abnegation woman get killed while she was on a mission for Jeanine and couldn’t stomach it anymore.”\u003c/p\u003e\n\u003cp\u003e“Are we sure she’s not just an Erudite spy?” Lynn says.\u003c/p\u003e\n\u003cp\u003e“Lynn, she saved half our faction from this stuff,” says Marlene, tapping the bandage on her arm from where the Dauntless traitors shot her. “Well, half of half of our faction.”\u003c/p\u003e\n\u003cp\u003e“In some circles they call that a quarter, Mar,” Lynn says.\u003c/p\u003e\n\u003cp\u003e“Anyway, who cares if she is a traitor?” Zeke says. “We’re not planning anything that she can inform them about. And we certainly wouldn’t include her if we were.”\u003c/p\u003e\n\u003cp\u003e“There is plenty of information for her to gather here,” Lynn says. “How many of us there are, for example, or how many of us aren’t wired for simulations.”\u003c/p\u003e\n\u003cp\u003e“You didn’t see her when she was telling me why she left,” says Zeke. “I believe her.”\u003c/p\u003e\n\u003cp\u003eCara and Christina have gotten up, and are walking out of the room.\u003c/p\u003e\n\u003cp\u003e“I’ll be right back,” I say. “I have to go to the bathroom.”\u003c/p\u003e\n\u003cp\u003eI wait until Cara and Christina have gone through the doors, then half walk, half jog in that direction. I open one of the doors slowly, so it doesn’t make any noise, and then close it slowly behind me. I am in a dim hallway that smells like garbage—this must be where the Candor trash chute is.\u003c/p\u003e\n\u003cp\u003eI hear two female voices around the corner and creep toward the end of the hallway to hear better.\u003c/p\u003e\n\u003cp\u003e“. . . just can’t handle her being here,” one of them sobs. Christina. “I can’t stop picturing it . . . what she did. . . . I don’t understand how she could have done that!”\u003c/p\u003e\n\u003cp\u003eChristina’s sobs make me feel like I am about to crack open.\u003c/p\u003e\n\u003cp\u003eCara takes her time responding.\u003c/p\u003e\n\u003cp\u003e“Well, I do,” she says.\u003c/p\u003e\n\u003cp\u003e“What?” Christina says with a hiccup.\u003c/p\u003e\n\u003cp\u003e“You have to understand; we’re trained to see things as logically as possible,” says Cara. “So don’t think that I’m callous. But that girl was probably scared out of her mind, certainly not capable of assessing situations cleverly at the time, if she was ever able to do so.”\u003c/p\u003e\n\u003cp\u003eMy eyes fly open. What a—I run through a short list of insults in my mind before listening to her continue.\u003c/p\u003e\n\u003cp\u003e“And the simulation made her incapable of reasoning with him, so when he threatened her life, she reacted as she had been trained by the Dauntless to react: Shoot to kill.”\u003c/p\u003e\n\u003cp\u003e“So what are you saying?” says Christina bitterly. “We should just forget about it, because it makes perfect sense?”\u003c/p\u003e\n\u003cp\u003e“Of course not,” says Cara. Her voice wobbles, just a little, and she repeats herself, quietly this time. “Of course not.”\u003c/p\u003e\n\u003cp\u003eShe clears her throat. “It’s just that you have to be around her, and I want to make it easier for you. You don’t have to forgive her. Actually, I’m not sure why you were friends with her in the first place; she always seemed a bit erratic to me.”\u003c/p\u003e\n\u003cp\u003eI tense up as I wait for Christina to agree with her, but to my surprise—and relief—she doesn’t.\u003c/p\u003e\n\u003cp\u003eCara continues. “Anyway. You don’t have to forgive her, but you should try to understand that what she did was not out of malice; it was out of panic. That way, you can look at her without wanting to punch her in her exceptionally long nose.”\u003c/p\u003e\n\u003cp\u003eMy hand moves automatically to my nose. Christina laughs a little, which feels like a hard poke to the stomach. I back up through the door to the Gathering Place.\u003c/p\u003e\n\u003cp\u003eEven though Cara was rude—and the nose comment was a low blow—I am grateful for what she said.\u003c/p\u003e\n\u003cp\u003eTobias emerges from a door hidden behind a length of white cloth. He flicks the cloth out of the way irritably before coming toward us and sitting beside me at the table in the Gathering Place.\u003c/p\u003e\n\u003cp\u003e“Kang is going to meet with a representative of Jeanine Matthews at seven in the morning,” he says.\u003c/p\u003e\n\u003cp\u003e“A representative?” Zeke says. “She’s not going herself?”\u003c/p\u003e\n\u003cp\u003e“Yeah, and stand out in the open where a bunch of angry people with guns can take aim?” Uriah smirks a little. “I’d like to see her try. No, really, I would.”\u003c/p\u003e\n\u003cp\u003e“Is Kang the Brilliant taking a Dauntless escort, at least?” Lynn says.\u003c/p\u003e\n\u003cp\u003e“Yes,” Tobias says. “Some of the older members volunteered. Bud said he would keep his ears open and report back.”\u003c/p\u003e\n\u003cp\u003eI frown at him. How does he know all this information? And why, after two years of avoiding becoming a Dauntless leader at all costs, is he suddenly acting like one?\u003c/p\u003e\n\u003cp\u003e“So I guess the real question is,” says Zeke, folding his hands on the table, “if you were Erudite, what would you say at this meeting?”\u003c/p\u003e\n\u003cp\u003eThey all look at me. Expectantly.\u003c/p\u003e\n\u003cp\u003e“What?” I say.\u003c/p\u003e\n\u003cp\u003e“You’re Divergent,” Zeke replies.\u003c/p\u003e\n\u003cp\u003e“So is Tobias.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but he doesn’t have aptitude for Erudite.”\u003c/p\u003e\n\u003cp\u003e“And how do you know I do?”\u003c/p\u003e\n\u003cp\u003eZeke lifts his shoulder. “Seems likely. Doesn’t it seem likely?”\u003c/p\u003e\n\u003cp\u003eUriah and Lynn nod. Tobias’s mouth twitches, as if in a smile, but if that’s what it was, he suppresses it. I feel like a stone just dropped into my stomach.\u003c/p\u003e\n\u003cp\u003e“You all have functional brains, last time I checked,” I say. “You can think like the Erudite, too.”\u003c/p\u003e\n\u003cp\u003e“But we don’t have special Divergent brains!” says Marlene. She touches her fingertips to my scalp and squeezes lightly. “Come on, do your magic.”\u003c/p\u003e\n\u003cp\u003e“There’s no such thing as Divergent magic, Mar,” says Lynn.\u003c/p\u003e\n\u003cp\u003e“And if there is, we shouldn’t be consulting it,” says Shauna. It’s the first thing she’s said since we sat down. She doesn’t even look at me when she says it; she just scowls at her younger sister.\u003c/p\u003e\n\u003cp\u003e“Shauna—” Zeke starts.\u003c/p\u003e\n\u003cp\u003e“Don’t ‘Shauna’ me!” she says, focusing her scowl on him instead. “Don’t you think someone with the aptitude for multiple factions might have a loyalty problem? If she’s got aptitude for Erudite, how can we be sure she’s not working for Erudite?”\u003c/p\u003e\n\u003cp\u003e“Don’t be ridiculous,” says Tobias, his voice low.\u003c/p\u003e\n\u003cp\u003e“I am not being ridiculous.” She smacks the table. “I know I belong in Dauntless because everything I did in that aptitude test told me so. I’m loyal to my faction for that reason—because there’s nowhere else I could possibly be. But her? And you?” She shakes her head. “I have no idea who you’re loyal to. And I’m not going to pretend like everything’s okay.”\u003c/p\u003e\n\u003cp\u003eShe gets up, and when Zeke reaches for her, she throws his hand aside, marching toward one of the doors. I watch her until the door closes behind her and the black fabric that hangs in front of it settles.\u003c/p\u003e\n\u003cp\u003eI feel wound up, like I might scream, only Shauna isn’t here for me to scream at.\u003c/p\u003e\n\u003cp\u003e“It’s not magic,” I say hotly. “You just have to ask yourself what the most logical response to a particular situation is.”\u003c/p\u003e\n\u003cp\u003eI am greeted with blank stares.\u003c/p\u003e\n\u003cp\u003e“Seriously,” I say. “If I were in this situation, staring at a group of Dauntless guards and Jack Kang, I probably wouldn’t resort to violence, right?”\u003c/p\u003e\n\u003cp\u003e“Well, you might, if you had your own Dauntless guards. And then all it takes is one shot—bam, he’s dead, and Erudite’s better off,” says Zeke.\u003c/p\u003e\n\u003cp\u003e“Whoever they send to talk to Jack Kang isn’t going to be some random Erudite kid; it’s going to be someone important,” I say. “It would be a stupid move to fire on Jack Kang and risk losing whoever they send as Jeanine’s representative.”\u003c/p\u003e\n\u003cp\u003e“See? This is why we need you to analyze the situation,” Zeke says. “If it was me, I would kill him; it would be worth the risk.”\u003c/p\u003e\n\u003cp\u003eI pinch the bridge of my nose. I already have a headache. “Fine.”\u003c/p\u003e\n\u003cp\u003eI try to put myself in Jeanine Matthews’s place. I already know she won’t negotiate with Jack Kang. Why would she need to? He has nothing to offer her. She will use the situation to her advantage.\u003c/p\u003e\n\u003cp\u003e“I think,” I say, “that Jeanine Matthews will manipulate him. And that he will do anything to protect his faction, even if it means sacrificing the Divergent.” I pause for a moment, remembering how he held his faction’s influence over our heads at the meeting. “Or sacrificing the Dauntless. So we need to hear what they say in that meeting.”\u003c/p\u003e\n\u003cp\u003eUriah and Zeke exchange a look. Lynn smiles, but it isn’t her usual smile. It doesn’t spread to her eyes, which look more like gold than ever, with that coldness in them.\u003c/p\u003e\n\u003cp\u003e“So let’s listen in,” she says.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY\u003c/p\u003e\n\u003cp\u003eI CHECK MY watch. It is seven o’clock in the evening. Just twelve hours until we can hear what Jeanine has to say to Jack Kang. I have checked my watch at least a dozen times in the past hour, as if that will make the time go faster. I am itching to do something—anything except sit in the cafeteria with Lynn, Tobias, and Lauren, picking at my dinner and sneaking looks at Christina, who sits with her Candor family at one of the other tables.\u003c/p\u003e\n\u003cp\u003e“I wonder if we’ll be able to return to the old way after all this is over,” says Lauren. She and Tobias have been talking about Dauntless initiate training methods for at least five minutes already. It’s probably the only thing they have in common.\u003c/p\u003e\n\u003cp\u003e“If there’s a faction left after all this is over,” Lynn says, piling her mashed potatoes onto a roll.\u003c/p\u003e\n\u003cp\u003e“Don’t tell me you’re going to eat a mashed-potato sandwich,” I say to her.\u003c/p\u003e\n\u003cp\u003e“So what if I am?”\u003c/p\u003e\n\u003cp\u003eA group of Dauntless walk between our table and the one next to us. They are older than Tobias, but not by much. One of the girls has five different colors in her hair, and her arms are covered with tattoos so that I can’t see even an inch of bare skin. One of the boys leans close to Tobias, whose back is to them, and whispers, “Coward,” as he passes.\u003c/p\u003e\n\u003cp\u003eA few of the others do the same thing, hissing “coward” into Tobias’s ears and then continuing on their way. He pauses with his knife against a piece of bread, a glob of butter waiting to be spread, and stares at the table.\u003c/p\u003e\n\u003cp\u003eI wait, tense, for him to explode.\u003c/p\u003e\n\u003cp\u003e“What idiots,” says Lauren. “And the Candor, for making you spill your life story for everyone to see . . . they’re idiots too.”\u003c/p\u003e\n\u003cp\u003eTobias doesn’t answer. He puts down his knife and the piece of bread, and pushes back from the table. His eyes lift and focus on something across the room.\u003c/p\u003e\n\u003cp\u003e“This needs to stop,” he says distantly, and starts toward whatever it is he’s looking at before I figure out what it is. This can’t be good.\u003c/p\u003e\n\u003cp\u003eHe slips between the tables and the people like he’s more liquid than solid, and I stumble after him, muttering apologies as I push people aside.\u003c/p\u003e\n\u003cp\u003eAnd then I see exactly who Tobias is headed toward. Marcus. He is sitting with a few of the older Candor.\u003c/p\u003e\n\u003cp\u003eTobias reaches him and grabs him by the back of the neck, wrestling him from his seat. Marcus opens his mouth to say something, and that is a mistake, because Tobias punches him hard in the teeth. Someone shouts, but no one rushes to Marcus’s aid. We are in a room full of Dauntless, after all.\u003c/p\u003e\n\u003cp\u003eTobias shoves Marcus toward the middle of the room, where there is a space between the tables to reveal the symbol of Candor. Marcus stumbles over one of the scales, his hands covering his face so I can’t see the damage Tobias did.\u003c/p\u003e\n\u003cp\u003eTobias shoves Marcus to the ground and presses the heel of his shoe to his father’s throat. Marcus smacks at Tobias’s leg, blood streaming past his lips, but even if he was at his strongest, he still wouldn’t be as strong as his son. Tobias undoes his belt buckle and slides it from its loops.\u003c/p\u003e\n\u003cp\u003eHe lifts his foot from Marcus’s throat and draws the belt back.\u003c/p\u003e\n\u003cp\u003e“This is for your own good,” he says.\u003c/p\u003e\n\u003cp\u003eThat, I remember, is what Marcus, and his many manifestations, always says to Tobias in his fear landscape.\u003c/p\u003e\n\u003cp\u003eThen the belt flies through the air and hits Marcus in the arm. Marcus’s face is bright red, and he covers his head as the next blow falls, this one hitting his back. All around me is laughter, coming from the Dauntless tables, but I am not laughing, I cannot possibly laugh at this.\u003c/p\u003e\n\u003cp\u003eFinally I come to my senses. I run forward and grab Tobias’s shoulder.\u003c/p\u003e\n\u003cp\u003e“Stop!” I say. “Tobias, stop right now!”\u003c/p\u003e\n\u003cp\u003eI expect to see a wild look in his eyes, but when he looks at me, I do not. His face is not flushed and his breaths are steady. This was not an act performed in the heat of passion.\u003c/p\u003e\n\u003cp\u003eIt was a calculated act.\u003c/p\u003e\n\u003cp\u003eHe drops the belt and reaches into his pocket. From it he takes a silver chain with a ring dangling from it. Marcus is on his side, gasping. Tobias drops the ring onto the ground next to his father’s face. It is made of tarnished, dull metal, an Abnegation wedding band.\u003c/p\u003e\n\u003cp\u003e“My mother,” says Tobias, “says hello.”\u003c/p\u003e\n\u003cp\u003eTobias walks away, and it takes a few seconds for me to breathe again. When I do, I leave Marcus cringing on the floor and run after him. It takes me until I reach the hallway to catch up to him. \u003c/p\u003e","sourceLink":"https://allnovel.net/insurgent-divergent-2/page-20.html","bookId":1699,"creation":"Oct 5, 2019 9:58:19 AM","modification":"Oct 5, 2019 9:58:19 AM"}
