{"id":65537,"no":4,"title":"Page 4","content":"\u003cp\u003e“Hey,” I say. “Come back.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” he says, focusing on me again. “It’s just . . .”\u003c/p\u003e\n\u003cp\u003e“Fascinating. Yeah, I know. You always look like someone’s sucked the life right out of you when something fascinates you.”\u003c/p\u003e\n\u003cp\u003eHe laughs.\u003c/p\u003e\n\u003cp\u003e“Can we talk about something else, though?” I say. “There may not be any Erudite or Dauntless traitors around, but it still feels weird, talking about it in public like this.”\u003c/p\u003e\n\u003cp\u003e“All right.”\u003c/p\u003e\n\u003cp\u003eBefore he can go on, the cafeteria doors open, and a group of Abnegation come in. They wear Amity clothes, like me, but also like me, it’s obvious what faction they are really in. They are silent, but not somber—they smile at the Amity they pass, inclining their heads, a few of them stopping to exchange pleasantries.\u003c/p\u003e\n\u003cp\u003eSusan sits down next to Caleb with a small smile. Her hair is pulled back in its usual knot, but her blond hair shines like gold. She and Caleb sit just slightly closer than friends would, though they do not touch. She bobs her head to greet me.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” she says. “Did I interrupt?”\u003c/p\u003e\n\u003cp\u003e“No,” says Caleb. “How are you?”\u003c/p\u003e\n\u003cp\u003e“I’m well. How are you?”\u003c/p\u003e\n\u003cp\u003eI am just about to flee the dining hall rather than participate in careful, polite Abnegation conversation when Tobias comes in, looking harassed. He must have been working in the kitchen this morning, as part of our agreement with the Amity. I have to work in the laundry rooms tomorrow.\u003c/p\u003e\n\u003cp\u003e“What happened?” I say as he sits down next to me.\u003c/p\u003e\n\u003cp\u003e“In their enthusiasm for conflict resolution, the Amity have apparently forgotten that meddling creates more conflict,” says Tobias. “If we stay here much longer, I am going to punch someone, and it’s not going to be pretty.”\u003c/p\u003e\n\u003cp\u003eCaleb and Susan both raise their eyebrows at him. A few of the Amity at the table next to ours stop talking to stare.\u003c/p\u003e\n\u003cp\u003e“You heard me,” Tobias says to them. They all look away.\u003c/p\u003e\n\u003cp\u003e“As I said,” I say, covering my mouth to hide my smile, “what happened?”\u003c/p\u003e\n\u003cp\u003e“I’ll tell you later.”\u003c/p\u003e\n\u003cp\u003eIt must have to do with Marcus. Tobias doesn’t like the dubious looks the Abnegation give him when he refers to Marcus’s cruelty, and Susan is sitting right across from him. I clasp my hands in my lap.\u003c/p\u003e\n\u003cp\u003eThe Abnegation sit at our table, but not right next to us—a respectful distance of two seats away, though most of them still nod at us. They were my family’s friends and neighbors and coworkers, and before, their presence would have encouraged me to be quiet and self-effacing. Now it makes me want to talk louder, to be as far from that old identity and the pain that accompanies it as possible.\u003c/p\u003e\n\u003cp\u003eTobias goes completely still when a hand falls on my right shoulder, sending prickles of pain down my right arm. I clench my teeth to keep from groaning.\u003c/p\u003e\n\u003cp\u003e“She got shot in that shoulder,” Tobias says without looking at the man behind me.\u003c/p\u003e\n\u003cp\u003e“My apologies.” Marcus lifts his hand and sits down on my left. “Hello.”\u003c/p\u003e\n\u003cp\u003e“What do you want?” I say.\u003c/p\u003e\n\u003cp\u003e“Beatrice,” Susan says quietly. “There’s no need to—”\u003c/p\u003e\n\u003cp\u003e“Susan, please,” says Caleb quietly. She presses her lips into a line and looks away.\u003c/p\u003e\n\u003cp\u003eI frown at Marcus. “I asked you a question.”\u003c/p\u003e\n\u003cp\u003e“I would like to discuss something with you,” says Marcus. His expression is calm, but he’s angry—the terseness in his voice betrays him. “The other Abnegation and myself have discussed it and decided that we should not stay here. We believe that, given the inevitability of further conflict in our city, it would be selfish of us to stay here while what remains of our faction is inside that fence. We would like to request that you escort us.”\u003c/p\u003e\n\u003cp\u003eI did not expect that. Why does Marcus want to return to the city? Is it really just an Abnegation decision, or does he intend to do something there—something that has to do with whatever information the Abnegation have?\u003c/p\u003e\n\u003cp\u003eI stare at him for a few seconds and then look at Tobias. He has relaxed a little, but he keeps his eyes focused on the table. I don’t know why he acts this way around his father. No one, not even Jeanine, makes Tobias cower.\u003c/p\u003e\n\u003cp\u003e“What do you think?” I say.\u003c/p\u003e\n\u003cp\u003e“I think we should leave the day after tomorrow,” Tobias says.\u003c/p\u003e\n\u003cp\u003e“Okay. Thank you,” says Marcus. He gets up and sits at the other end of the table with the rest of the Abnegation.\u003c/p\u003e\n\u003cp\u003eI inch closer to Tobias, not sure how to comfort him without making things worse. I pick up my apple with my left hand, and grab his hand under the table with my right.\u003c/p\u003e\n\u003cp\u003eBut I can’t keep my eyes away from Marcus. I want to know more about what he said to Johanna. And sometimes, if you want the truth, you have to demand it.\u003c/p\u003e\n\u003cp\u003eCHAPTER FIVE\u003c/p\u003e\n\u003cp\u003eAFTER BREAKFAST, I tell Tobias I’m going for a walk, but instead I follow Marcus. I expect him to walk to the guests’ dormitory, but he crosses the field behind the dining hall and walks into the water-filtration building. I hesitate on the bottom step. Do I really want to do this?\u003c/p\u003e\n\u003cp\u003eI walk up the steps and through the door that Marcus just closed behind him.\u003c/p\u003e\n\u003cp\u003eThe filtration building is small, just one room with a few huge machines in it. As far as I can tell, some of the machines take in dirty water from the rest of the compound, a few of them purify it, others test it, and the last set pumps clean water back out to the compound. The piping systems are all buried except one, which runs along the ground to send water to the power plant, near the fence. The plant provides power to the entire city, using a combination of wind, water, and solar energy.\u003c/p\u003e\n\u003cp\u003eMarcus stands near the machines that filter the water. There the pipes are transparent. I can see brown-tinged water rushing through one pipe, disappearing into the machine, and emerging clear. Both of us watch the purification happen, and I wonder if he is thinking what I am: that it would be nice if life worked this way, stripping the dirt from our lives and sending us out into the world clean. But some dirt is destined to linger.\u003c/p\u003e\n\u003cp\u003eI stare at the back of Marcus’s head. I have to do this now.\u003c/p\u003e\n\u003cp\u003eNow.\u003c/p\u003e\n\u003cp\u003e“I heard you, the other day,” I blurt out.\u003c/p\u003e\n\u003cp\u003eMarcus whips his head around. “What are you doing, Beatrice?”\u003c/p\u003e\n\u003cp\u003e“I followed you here.” I fold my arms over my chest. “I heard you talking to Johanna about what motivated Jeanine’s attack on Abnegation.”\u003c/p\u003e\n\u003cp\u003e“Did the Dauntless teach you that it’s all right to invade another person’s privacy, or did you teach yourself?”\u003c/p\u003e\n\u003cp\u003e“I’m a naturally curious person. Don’t change the subject.”\u003c/p\u003e\n\u003cp\u003eMarcus’s forehead is creased, especially between the eyebrows, and there are deep lines next to his mouth. He looks like a man who has spent most of his life frowning. He might have been handsome when he was younger—perhaps he still is, to women his age, like Johanna—but all I see when I look at him are the black-pit eyes from Tobias’s fear landscape.\u003c/p\u003e\n\u003cp\u003e“If you heard me talking to Johanna, then you know that I didn’t even tell her about this. So what makes you think that I would share the information with you?”\u003c/p\u003e\n\u003cp\u003eI don’t have an answer at first. But then it comes to me.\u003c/p\u003e\n\u003cp\u003e“My father,” I say. “My father is dead.” It’s the first time I’ve said it since I told Tobias, on the train ride over, that my parents died for me. “Died” was just a fact to me then, detached from emotion. But “dead,” mingling with the churning and bubbling noises in this room, strikes a blow like a hammer to my chest, and the monster of grief awakens, clawing at my eyes and throat.\u003c/p\u003e\n\u003cp\u003eI force myself to continue.\u003c/p\u003e\n\u003cp\u003e“He may not have actually died for whatever information you were referring to,” I say. “But I want to know if it was something he risked his life for.”\u003c/p\u003e\n\u003cp\u003eMarcus’s mouth twitches.\u003c/p\u003e\n\u003cp\u003e“Yes,” he says. “It was.”\u003c/p\u003e\n\u003cp\u003eMy eyes fill with tears. I blink them away.\u003c/p\u003e\n\u003cp\u003e“Well,” I say, almost choking, “then what on earth was it? Was it something you were trying to protect? Or steal? Or what?”\u003c/p\u003e\n\u003cp\u003e“It was . . .” Marcus shakes his head. “I’m not going to tell you that.”\u003c/p\u003e\n\u003cp\u003eI step toward him. “But you want it back. And Jeanine has it.”\u003c/p\u003e\n\u003cp\u003eMarcus is a good liar—or at least, someone who is skilled at hiding secrets. He does not react. I wish I could see like Johanna sees, like the Candor see—I wish I could read his expression. He could be close to telling me the truth. If I press just hard enough, maybe he’ll crack.\u003c/p\u003e\n\u003cp\u003e“I could help you,” I say.\u003c/p\u003e\n\u003cp\u003eMarcus’s upper lip curls. “You have no idea how ridiculous that sounds.” He spits the words at me. “You may have succeeded in shutting down the attack simulation, girl, but it was by luck alone, not skill. I would die of shock if you managed to do anything useful again for a long time.”\u003c/p\u003e\n\u003cp\u003eThis is the Marcus that Tobias knows. The one who knows right where to hit to cause the most damage.\u003c/p\u003e\n\u003cp\u003eMy body shudders with anger. “Tobias is right about you,” I say. “You’re nothing but an arrogant, lying piece of garbage.”\u003c/p\u003e\n\u003cp\u003e“He said that, did he?” Marcus raises his eyebrows.\u003c/p\u003e\n\u003cp\u003e“No,” I say. “He doesn’t mention you enough to say anything like that. I figured it out all on my own.” I clench my teeth. “You’re almost nothing to him, you know. And as time goes on, you become less and less.”\u003c/p\u003e\n\u003cp\u003eMarcus doesn’t answer me. He turns back to the water purifier. I stand for a moment in my triumph, the sound of rushing water combining with the heartbeat in my ears. Then I leave the building, and it isn’t until I’m halfway across the field that I realize I didn’t win. Marcus did.\u003c/p\u003e\n\u003cp\u003eWhatever the truth is, I’ll have to get it from somewhere else, because I won’t be asking him again.\u003c/p\u003e\n\u003cp\u003eThat night I dream that I am in a field, and I encounter a flock of crows clustered on the ground. When I swat a few of them away, I realize that they are perched on top of a man, pecking at his clothes, which are Abnegation gray. Without warning, they take flight, and I realize that the man is Will.\u003c/p\u003e\n\u003cp\u003eThen I wake up.\u003c/p\u003e\n\u003cp\u003eI turn my face into the pillow and release, instead of his name, a sob that throws my body against the mattress. I feel the monster of grief again, writhing in the empty space where my heart and stomach used to be.\u003c/p\u003e\n\u003cp\u003eI gasp, pressing both palms to my chest. Now the monstrous thing has its claws around my throat, squeezing my airway. I twist and put my head between my knees, breathing until the strangled feeling leaves me.\u003c/p\u003e\n\u003cp\u003eEven though the air is warm, I shiver. I get out of bed and creep down the hallway toward Tobias’s room. My bare legs almost glow in the dark. His door creaks when I pull it open, loud enough to wake him. He stares at me for a second.\u003c/p\u003e\n\u003cp\u003e“C’mere,” he says, sluggish from sleep. He shifts back on the bed to leave space for me.\u003c/p\u003e\n\u003cp\u003eI should have thought this through. I sleep in a long T-shirt one of the Amity lent me. It comes down just past my butt, and I didn’t think to put on a pair of shorts before I came here. Tobias’s eyes skim my bare legs, making my face warm. I lie down, facing him.\u003c/p\u003e\n\u003cp\u003e“Bad dream?” he says.\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eI shake my head. I can’t tell him that I’m having nightmares about Will, or I would have to explain why. What would he think of me, if he knew what I had done? How would he look at me?\u003c/p\u003e\n\u003cp\u003eHe keeps his hand on my cheek, moving his thumb over my cheekbone idly.\u003c/p\u003e\n\u003cp\u003e“We’re all right, you know,” he says. “You and me. Okay?”\u003c/p\u003e\n\u003cp\u003eMy chest aches, and I nod.\u003c/p\u003e\n\u003cp\u003e“Nothing else is all right.” His whisper tickles my cheek. “But we are.”\u003c/p\u003e\n\u003cp\u003e“Tobias,” I say. But whatever I was about to say gets lost in my head, and I press my mouth to his, because I know that kissing him will distract me from everything.\u003c/p\u003e\n\u003cp\u003eHe kisses me back. His hand starts on my cheek, and then brushes over my side, fitting to the bend in my waist, curving over my hip, sliding to my bare leg, making me shiver. I press closer to him and wrap my leg around him. My head buzzes with nervousness, but the rest of me seems to know exactly what it’s doing, because it all pulses to the same rhythm, all wants the same thing: to escape itself and become a part of him instead.\u003c/p\u003e\n\u003cp\u003eHis mouth moves against mine, and his hand slips under the hem of the T-shirt, and I don’t stop him, though I know I should. Instead a faint sigh escapes me, and heat rushes into my cheeks, embarrassment. Either he didn’t hear me or he didn’t care, because he presses his palm to my lower back, presses me closer. His fingers move slowly up my back, tracing my spine. My shirt creeps up my body, and I don’t pull it down, even when I feel cool air on my stomach.\u003c/p\u003e\n\u003cp\u003eHe kisses my neck, and I grab his shoulder to steady myself, gathering his shirt into my fist. His hand reaches the top of my back and curls around my neck. My shirt is twisted around his arm, and our kisses become desperate. I know my hands are shaking from all the nervous energy inside me, so I tighten my grip on his shoulder so he won’t notice.\u003c/p\u003e\n\u003cp\u003eThen his fingers brush the bandage on my shoulder, and a dart of pain goes through me. It didn’t hurt much, but it brings me back to reality. I can’t be with him in that way if one of my reasons for wanting it is to distract myself from grief.\u003c/p\u003e\n\u003cp\u003eI lean back and carefully pull the hem of my shirt down so it covers me again. For a second we just lie there, our heavy breaths mixing. I don’t mean to cry—now is not a good time to cry; no, it has to stop—but I can’t get the tears out of my eyes, no matter how many times I blink.\u003c/p\u003e\n\u003cp\u003e“Sorry,” I say.\u003c/p\u003e\n\u003cp\u003eHe says almost sternly, “Don’t apologize.” He brushes the tears from my cheeks.\u003c/p\u003e\n\u003cp\u003eI know that I am birdlike, made narrow and small as if for taking flight, built straight-waisted and fragile. But when he touches me like he can’t bear to take his hand away, I don’t wish I was any different.\u003c/p\u003e\n\u003cp\u003e“I don’t mean to be such a mess,” I say, my voice cracking. “I just feel so . . .” I shake my head. \u003c/p\u003e","sourceLink":"https://allnovel.net/insurgent-divergent-2/page-4.html","bookId":1699,"creation":"Oct 5, 2019 9:58:19 AM","modification":"Oct 5, 2019 9:58:19 AM"}
