{"id":65540,"no":7,"title":"Page 7","content":"\u003cp\u003eI bring the lamp down again, and again, and again, until the hard drive cracks and pieces of it spread across the floor. Then I kick the shards under the dresser, put the lamp back, and walk into the hallway, wiping my eyes with the back of my hand.\u003c/p\u003e\n\u003cp\u003eA few minutes later, a small crowd of gray-clad men and women—and Peter—stand in the hallway, sorting through stacks of clothes.\u003c/p\u003e\n\u003cp\u003e“Tris,” says Caleb. “You’re still wearing gray.”\u003c/p\u003e\n\u003cp\u003eI pinch my father’s shirt, and hesitate.\u003c/p\u003e\n\u003cp\u003e“It’s Dad’s,” I say. If I change out of it, I will have to leave it behind. I bite my lip so that the pain will steady me. I have to get rid of it. It’s just a shirt. That’s all it is.\u003c/p\u003e\n\u003cp\u003e“I’ll put it on under mine,” Caleb says. “They’ll never see it.”\u003c/p\u003e\n\u003cp\u003eI nod and grab a red shirt from the dwindling pile of clothes. It is large enough to conceal the bulge of the gun. I duck into a nearby room to change, and hand off the gray shirt to Caleb when I get to the hallway. The door is open, and through it I see Tobias stuffing Abnegation clothes into the trash bin.\u003c/p\u003e\n\u003cp\u003e“Do you think the Amity will lie for us?” I ask him, leaning out the open doorway.\u003c/p\u003e\n\u003cp\u003e“To prevent conflict?” Tobias nods. “Absolutely.”\u003c/p\u003e\n\u003cp\u003eHe wears a red collared shirt and a pair of jeans that are fraying at the knee. The combination looks ridiculous on him.\u003c/p\u003e\n\u003cp\u003e“Nice shirt,” I say.\u003c/p\u003e\n\u003cp\u003eHe wrinkles his nose at me. “It was the only thing that covered up the neck tattoo, okay?”\u003c/p\u003e\n\u003cp\u003eI smile nervously. I forgot about my tattoos, but the shirt hides them well enough.\u003c/p\u003e\n\u003cp\u003eThe Erudite cars pull up to the compound. There are five of them, all silver with black roofs. Their engines seem to purr as the wheels bump over uneven ground. I slip just inside the building, leaving the door open behind me, and Tobias busies himself with the latch on the trash bin.\u003c/p\u003e\n\u003cp\u003eThe cars all pull to a stop, and the doors pop open, revealing at least five men and women in Erudite blue.\u003c/p\u003e\n\u003cp\u003eAnd about fifteen in Dauntless black.\u003c/p\u003e\n\u003cp\u003eWhen the Dauntless come closer, I see strips of blue fabric wrapped around their arms that can only signify their allegiance to Erudite. The faction that enslaved their minds.\u003c/p\u003e\n\u003cp\u003eTobias takes my hand and leads me into the dormitory.\u003c/p\u003e\n\u003cp\u003e“I didn’t think our faction would be that stupid,” he says. “You have the gun, right?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I say. “But there’s no guarantee I can fire it with any accuracy with my left hand.”\u003c/p\u003e\n\u003cp\u003e“You should work on that,” he says. Always an instructor.\u003c/p\u003e\n\u003cp\u003e“I will,” I say. I shake a little as I add, “If we live.”\u003c/p\u003e\n\u003cp\u003eHis hands skim my bare arms. “Just bounce a little when you walk,” he says, kissing my forehead, “and pretend you’re afraid of their guns”—another kiss between my eyebrows—“and act like the shrinking violet you could never be”—a kiss on my cheek—“and you’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I say. My hands tremble as I grip his shirt collar. I pull his mouth down to mine.\u003c/p\u003e\n\u003cp\u003eA bell sounds, once, twice, three times. It is a summons to the dining hall, where the Amity gather for less formal occasions than the meeting we attended. We join the crowd of Abnegation-turned-Amity.\u003c/p\u003e\n\u003cp\u003eI pull pins from Susan’s hair—the hairstyle is too severe for Amity. She gives me a small, grateful smile as her hair falls on her shoulders, the first time I have ever seen it that way. It softens her square jaw.\u003c/p\u003e\n\u003cp\u003eI am supposed to be braver than the Abnegation, but they don’t seem as worried as I am. They offer each other smiles and walk in silence—in too much silence. I wedge my way between them and jab one of the older women in the shoulder.\u003c/p\u003e\n\u003cp\u003e“Tell the kids to play tag,” I say to her.\u003c/p\u003e\n\u003cp\u003e“Tag?” she says.\u003c/p\u003e\n\u003cp\u003e“They’re acting respectful and . . . Stiff,” I say, cringing as I say the word that was my nickname in Dauntless. “And Amity kids would be causing a ruckus. Just do it, okay?”\u003c/p\u003e\n\u003cp\u003eThe woman touches one Abnegation child on the shoulder and whispers something to him, and a few seconds later a small group of children run down the hallway, dodging Amity feet and yelling, “I touched you! You’re it!” “No, that was my sleeve!”\u003c/p\u003e\n\u003cp\u003eCaleb catches on, jabbing Susan in the ribs so she shrieks with laughter. I try to relax, injecting a bounce into my step as Tobias suggested, letting my arms swing as I turn corners. It is amazing how pretending to be in a different faction changes everything—even the way I walk. That must be why it’s so strange that I could easily belong in three of them.\u003c/p\u003e\n\u003cp\u003eWe catch up to the Amity in front of us as we cross the courtyard to the dining hall and disperse among them. I keep Tobias in my peripheral vision, not wanting to stray too far from him. The Amity don’t ask questions; they just let us dissolve into their faction.\u003c/p\u003e\n\u003cp\u003eA pair of Dauntless traitors stand by the door to the dining hall, their guns in hand, and I stiffen. It feels real to me, suddenly, that I am unarmed and being herded into a building surrounded by Erudite and Dauntless, and if they discover me, there will be nowhere to run. They will shoot me on the spot.\u003c/p\u003e\n\u003cp\u003eI consider making a break for it. But where would I go that they could not catch me? I try to breathe normally. I am almost past them—don’t look, don’t look. A few steps away—eyes away, away.\u003c/p\u003e\n\u003cp\u003eSusan loops her arm through mine.\u003c/p\u003e\n\u003cp\u003e“I’m telling you a joke,” she says, “that you find very funny.”\u003c/p\u003e\n\u003cp\u003eI cover my mouth with my hand and force a giggle that sounds high-pitched and foreign, but judging by the smile she gives me, it was believable. We hang on each other the way Amity girls do, glancing at the Dauntless and then giggling again. I am amazed by how I manage to do it, with the leaden feeling inside me.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I mutter once we’re inside.\u003c/p\u003e\n\u003cp\u003e“You’re welcome,” she replies.\u003c/p\u003e\n\u003cp\u003eTobias sits across from me at one of the long tables, and Susan sits next to me. The rest of the Abnegation spread throughout the room, and Caleb and Peter are a few seats down from me.\u003c/p\u003e\n\u003cp\u003eI tap my fingers on my knees as we wait for something to happen. For a long time we just sit there, and I pretend to be listening to an Amity girl telling a story on my left. But every so often I look at Tobias, and he looks back at me, like we’re passing fear back and forth between us.\u003c/p\u003e\n\u003cp\u003eFinally Johanna walks in with an Erudite woman. Her bright blue shirt seems to glow against her skin, which is dark brown. She searches the room as she speaks to Johanna. I hold my breath as her eyes find me—and then let it out when she moves on without a moment’s hesitation. She did not recognize me.\u003c/p\u003e\n\u003cp\u003eAt least, not yet.\u003c/p\u003e\n\u003cp\u003eSomeone bangs on a tabletop, and the room goes quiet. This is it. This is the moment she either hands us over, or doesn’t.\u003c/p\u003e\n\u003cp\u003e“Our Erudite and Dauntless friends are looking for some people,” Johanna says. “Several members of Abnegation, three members of Dauntless, and a former Erudite initiate.” She smiles. “In the interest of full cooperation, I told them that the people they were looking for were, in fact, here, but have since moved on. They would like permission to search the premises, which means we have to vote. Does anyone object to a search?”\u003c/p\u003e\n\u003cp\u003eThe tension in her voice suggests that if anyone does object, they should keep their mouth shut. I don’t know if the Amity pick up on that kind of thing, but no one says anything. Johanna nods to the Erudite woman.\u003c/p\u003e\n\u003cp\u003e“Three of you stick around,” the woman says to the Dauntless guards clustered by the entrance. “The rest of you, search all the buildings and report back if you find anything. Go.”\u003c/p\u003e\n\u003cp\u003eThere is so much they could find. The pieces of the hard drive. Clothes I forgot to throw out. A suspicious lack of trinkets and decorations in our living spaces. I feel my pulse behind my eyes as the three Dauntless soldiers who stayed behind pace up and down the rows of tables.\u003c/p\u003e\n\u003cp\u003eThe back of my neck tingles as one of them walks behind me, his footsteps loud and heavy. Not for the first time in my life, I’m glad that I’m small and plain. I don’t draw people’s eyes to me.\u003c/p\u003e\n\u003cp\u003eBut Tobias does. He wears his pride in his posture, in the way his eyes claim everything they land on. That is not an Amity trait. It can only be a Dauntless one.\u003c/p\u003e\n\u003cp\u003eThe Dauntless woman walking toward him looks at him right away. Her eyes narrow as she walks closer, and then stops directly behind him.\u003c/p\u003e\n\u003cp\u003eI wish the collar of his shirt were higher. I wish he didn’t have so many tattoos. I wish . . .\u003c/p\u003e\n\u003cp\u003e“Your hair is pretty short for an Amity,” she says.\u003c/p\u003e\n\u003cp\u003e. . . he did not cut his hair like the Abnegation.\u003c/p\u003e\n\u003cp\u003e“It’s hot,” he says.\u003c/p\u003e\n\u003cp\u003eThe excuse might work if he knew how to deliver it, but he says it with a snap.\u003c/p\u003e\n\u003cp\u003eShe stretches out her hand and, with her index finger, pulls back the collar of his shirt to see his tattoo.\u003c/p\u003e\n\u003cp\u003eAnd Tobias moves.\u003c/p\u003e\n\u003cp\u003eHe grabs the woman’s wrist, yanking her forward so she loses her balance. She hits her head against the edge of the table and falls. Across the room, a gun goes off, someone screams, and everyone dives under the tables or crouches next to the benches.\u003c/p\u003e\n\u003cp\u003eEveryone except me. I sit where I was before the gunshot sounded, clutching the edge of the table. I know that’s where I am, but I don’t see the cafeteria anymore. I see the alley I escaped down after my mother died. I stare at the gun in my hands, at the smooth skin between Will’s eyebrows.\u003c/p\u003e\n\u003cp\u003eA small sound gurgles in my throat. It would have been a scream if my teeth had not been clamped shut. The flash of memory fades, but I still can’t move.\u003c/p\u003e\n\u003cp\u003eTobias grabs the Dauntless woman by the back of her neck and wrenches her to her feet. He has her gun in his hand. He uses her to shield him as he fires over her right shoulder at the Dauntless soldier across the room.\u003c/p\u003e\n\u003cp\u003e“Tris!” he shouts. “A little help here?”\u003c/p\u003e\n\u003cp\u003eI pull my shirt up just far enough to reach the handle of the gun, and my fingers meet metal. It feels so cold that it hurts my fingertips, but that can’t be; it’s so hot in here. A Dauntless man at the end of the aisle aims his own revolver at me. The black spot at the end of the barrel grows around me, and I can hear my heart but nothing else.\u003c/p\u003e\n\u003cp\u003eCaleb lunges forward and grabs my gun. He holds it in both hands and fires at the knees of the Dauntless man who stands just feet away from him.\u003c/p\u003e\n\u003cp\u003eThe Dauntless man screams and collapses, his hands clutching his leg, which gives Tobias the opportunity to shoot him in the head. His pain is momentary.\u003c/p\u003e\n\u003cp\u003eMy entire body is trembling and I can’t stop it. Tobias still has the Dauntless woman by the throat, but this time, he aims his gun at the Erudite woman.\u003c/p\u003e\n\u003cp\u003e“Say another word,” says Tobias, “and I’ll shoot.”\u003c/p\u003e\n\u003cp\u003eThe Erudite woman’s mouth is open, but she doesn’t speak.\u003c/p\u003e\n\u003cp\u003e“Whoever’s with us should start running,” Tobias says, his voice filling the room.\u003c/p\u003e\n\u003cp\u003eAll at once, the Abnegation rise from their places under tables and benches, and start toward the door. Caleb pulls me up from the bench. I start toward the door.\u003c/p\u003e\n\u003cp\u003eThen I see something. A twitch, a flicker of movement. The Erudite woman lifts a small gun, points it at a man in a yellow shirt in front of me. Instinct, not presence of mind, pushes me into a dive. My hands collide with the man, and the bullet hits the wall instead of him, instead of me.\u003c/p\u003e\n\u003cp\u003e“Put the gun down,” says Tobias, pointing his revolver at the Erudite woman. “I have very good aim, and I’m betting that you don’t.”\u003c/p\u003e\n\u003cp\u003eI blink a few times to get the blurriness out of my eyes. Peter stares back at me. I just saved his life. He does not thank me, and I don’t acknowledge him.\u003c/p\u003e\n\u003cp\u003eThe Erudite woman drops her gun. Together Peter and I walk toward the door. Tobias follows us, walking backward so he can keep his gun on the Erudite woman. At the last second before he passes through the threshold, he slams the door between him and her.\u003c/p\u003e\n\u003cp\u003eAnd we all run.\u003c/p\u003e\n\u003cp\u003eWe sprint down the center aisle of the orchard in a breathless pack. The night air is heavy as a blanket and smells like rain. Shouts follow us. Car doors slam. I run faster than I can possibly run, like I’m breathing adrenaline instead of air. The purr of engines chases me into the trees. Tobias’s hand closes around mine.\u003c/p\u003e\n\u003cp\u003eWe run through a cornfield in a long line. By then, the cars have caught up to us. The headlights creep through the tall stalks, illuminating a leaf here, an ear of corn there.\u003c/p\u003e\n\u003cp\u003e“Split up!” someone yells, and it sounds like Marcus.\u003c/p\u003e\n\u003cp\u003eWe divide and spread through the field like spilling water. I grab Caleb’s arm. I hear Susan gasping behind Caleb.\u003c/p\u003e\n\u003cp\u003eWe crash over cornstalks. The heavy leaves cut my cheeks and arms. I stare between Tobias’s shoulder blades as we run. I hear a heavy thump and a scream. There are screams everywhere, to my left, to my right. Gunshots. The Abnegation are dying again, dying like they were when I pretended to be under the simulation. And all I’m doing is running.\u003c/p\u003e\n\u003cp\u003eFinally we reach the fence. Tobias runs along it, pushing it until he finds a hole. He holds the chain links back so Caleb, Susan, and I can crawl through. Before we start running again, I stop and look back at the cornfield we just left. I see headlights distantly glowing. But I don’t hear anything.\u003c/p\u003e\n\u003cp\u003e“Where are the others?” whispers Susan.\u003c/p\u003e\n\u003cp\u003eI say, “Gone.”\u003c/p\u003e\n\u003cp\u003eSusan sobs. Tobias pulls me to his side roughly, and starts forward. My face burns with shallow cuts from the corn leaves, but my eyes are dry. The Abnegation deaths are just another weight I am unable to set down.\u003c/p\u003e\n\u003cp\u003eWe stay away from the dirt road the Erudite and Dauntless took to get to the Amity compound, following the train tracks toward the city. There is nowhere to hide out here, no trees or buildings that can shield us, but it doesn’t matter. The Erudite can’t drive through the fence anyway, and it will take them a while to reach the gate.\u003c/p\u003e\n\u003cp\u003e“I have to . . . stop . . .” says Susan from somewhere in the darkness behind me.\u003c/p\u003e\n\u003cp\u003eWe stop. Susan collapses to the ground, crying, and Caleb crouches next to her. Tobias and I look toward the city, which is still illuminated, because it’s not midnight yet. I want to feel something. Fear, anger, grief. But I don’t. All I feel is the need to keep moving. \u003c/p\u003e","sourceLink":"https://allnovel.net/insurgent-divergent-2/page-7.html","bookId":1699,"creation":"Oct 5, 2019 9:58:19 AM","modification":"Oct 5, 2019 9:58:19 AM"}
