{"id":65542,"no":9,"title":"Page 9","content":"\u003cp\u003e“Hello.” She walks around the table, surveying him. “You look older.”\u003c/p\u003e\n\u003cp\u003e“Yes, well. The passage of time tends to do that to a person.”\u003c/p\u003e\n\u003cp\u003eHe already knew she was alive. How long ago did he find out?\u003c/p\u003e\n\u003cp\u003eShe smiles. “So you’ve finally come—”\u003c/p\u003e\n\u003cp\u003e“Not for the reason you think,” he interrupts her. “We were running from Erudite, and the only chance of escape we had required me to tell your poorly armed lackeys my name.”\u003c/p\u003e\n\u003cp\u003eShe must have made him angry somehow. But I can’t help but think that if I discovered my mother was alive after thinking she was dead for so long, I would never speak to her the way Tobias speaks to his mother now, no matter what she had done.\u003c/p\u003e\n\u003cp\u003eThe truth of that thought makes me ache. I push it aside and focus instead on what’s in front of me. On the table behind Evelyn is a large map with markers all over it. A map of the city, obviously, but I’m not sure what the markers mean. On the wall behind her is a chalkboard with a chart on it. I can’t decipher the information in the chart; it’s written in shorthand I don’t know.\u003c/p\u003e\n\u003cp\u003e“I see.” Evelyn’s smile remains, but without its former touch of amusement. “Introduce me to your fellow refugees, then.”\u003c/p\u003e\n\u003cp\u003eHer eyes drift down to our joined hands. Tobias’s fingers spring apart. He gestures to me first. “This is Tris Prior. Her brother, Caleb. And their friend Susan Black.”\u003c/p\u003e\n\u003cp\u003e“Prior,” she says. “I know of several Priors, but none of them are named Tris. Beatrice, however . . .”\u003c/p\u003e\n\u003cp\u003e“Well,” I say, “I know of several living Eatons, but none of them are named Evelyn.”\u003c/p\u003e\n\u003cp\u003e“Evelyn Johnson is the name I prefer. Particularly among a pack of Abnegation.”\u003c/p\u003e\n\u003cp\u003e“Tris is the name I prefer,” I reply. “And we’re not Abnegation. Not all of us, anyway.”\u003c/p\u003e\n\u003cp\u003eEvelyn gives Tobias a look. “Interesting friends you’ve made.”\u003c/p\u003e\n\u003cp\u003e“Those are population counts?” says Caleb from behind me. He walks forward, his mouth open. “And . . . what? Factionless safe houses?” He points to the first line on the chart, which reads 7 . . . . . . . . . . Grn Hse. “I mean, these places, on the map? They’re safe houses, like this one, right?”\u003c/p\u003e\n\u003cp\u003e“That’s a lot of questions,” says Evelyn, arching an eyebrow. I recognize the expression. It belongs to Tobias—as does her distaste for questions. “For security purposes, I will not answer any of them. Anyway, it is time for dinner.”\u003c/p\u003e\n\u003cp\u003eShe gestures toward the door. Susan and Caleb start toward it, followed by me, and Tobias and his mother are last. We work our way through the maze of machinery again.\u003c/p\u003e\n\u003cp\u003e“I’m not stupid,” she says in a low voice. “I know you want nothing to do with me—though I still don’t quite understand why—”\u003c/p\u003e\n\u003cp\u003eTobias snorts.\u003c/p\u003e\n\u003cp\u003e“But,” she says, “I will extend my invitation again. We could use your help here, and I know you are like-minded about the faction system—”\u003c/p\u003e\n\u003cp\u003e“Evelyn,” Tobias says. “I chose Dauntless.”\u003c/p\u003e\n\u003cp\u003e“Choices can be made again.”\u003c/p\u003e\n\u003cp\u003e“What makes you think I’m interested in spending time anywhere near you?” he demands. I hear his footsteps stop, and slow down so I can hear how she responds.\u003c/p\u003e\n\u003cp\u003e“Because I’m your mother,” she says, and her voice almost breaks over the words, uncharacteristically vulnerable. “Because you’re my son.”\u003c/p\u003e\n\u003cp\u003e“You really don’t get it,” he says. “You don’t have the vaguest conception of what you’ve done to me.” He sounds breathless. “I don’t want to join up with your little band of factionless. I want to get out of here as quickly as possible.”\u003c/p\u003e\n\u003cp\u003e“My little band of factionless is twice the size of Dauntless,” says Evelyn. “You would do well to take it seriously. Its actions may determine the future of this city.”\u003c/p\u003e\n\u003cp\u003eWith that, she walks ahead of him, and ahead of me. Her words echo in my mind: Twice the size of Dauntless. When did they become so large?\u003c/p\u003e\n\u003cp\u003eTobias looks at me, eyebrows lowered.\u003c/p\u003e\n\u003cp\u003e“How long have you known?” I say.\u003c/p\u003e\n\u003cp\u003e“About a year.” He slumps against the wall and closes his eyes. “She sent a coded message to me in Dauntless, telling me to meet her at the train yard. I did, because I was curious, and there she was. Alive. It wasn’t a happy reunion, as you can probably guess.”\u003c/p\u003e\n\u003cp\u003e“Why did she leave Abnegation?”\u003c/p\u003e\n\u003cp\u003e“She had an affair.” He shakes his head. “And no wonder, since my father . . .” He shakes his head again. “Well, let’s just say Marcus wasn’t any nicer to her than he was to me.”\u003c/p\u003e\n\u003cp\u003e“Is . . . that why you’re angry with her? Because she was unfaithful to him?”\u003c/p\u003e\n\u003cp\u003e“No,” he says too sternly, his eyes opening. “No, that’s not why I’m angry.”\u003c/p\u003e\n\u003cp\u003eI walk toward him as if approaching a wild animal, each footstep careful on the cement floor. “Then why?”\u003c/p\u003e\n\u003cp\u003e“She had to leave my father, I get that,” he says. “But did she think of taking me with her?”\u003c/p\u003e\n\u003cp\u003eI purse my lips. “Oh. She left you with him.”\u003c/p\u003e\n\u003cp\u003eShe left him alone with his worst nightmare. No wonder he hates her.\u003c/p\u003e\n\u003cp\u003e“Yeah.” He kicks at the floor. “She did.”\u003c/p\u003e\n\u003cp\u003eMy fingers find his, fumbling, and he guides them into the spaces between his own. I know that’s enough questions, for now, so I let the silence linger between us until he decides to break it.\u003c/p\u003e\n\u003cp\u003e“It seems to me,” he says, “that the factionless are better friends than enemies.”\u003c/p\u003e\n\u003cp\u003e“Maybe. But what would the cost of that friendship be?” I say.\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “I don’t know. But we may not have any other option.”\u003c/p\u003e\n\u003cp\u003eCHAPTER NINE\u003c/p\u003e\n\u003cp\u003eONE OF THE factionless started a fire so we could heat up our food. Those who want to eat sit in a circle around the large metal bowl that contains the fire, first heating the cans, then passing out spoons and forks, then passing cans around so everyone can have a bite of everything. I try not to think about how many diseases could spread this way as I dip my spoon into a can of soup.\u003c/p\u003e\n\u003cp\u003eEdward drops to the ground next to me and takes the can of soup from my hands.\u003c/p\u003e\n\u003cp\u003e“So you were all Abnegation, huh?” He shovels several noodles and a piece of carrot into his mouth, and passes the can to the woman on his left.\u003c/p\u003e\n\u003cp\u003e“We were,” I say. “But obviously Tobias and I transferred, and . . .” Suddenly it occurs to me that I shouldn’t tell anyone Caleb joined Erudite. “Caleb and Susan are still Abnegation.”\u003c/p\u003e\n\u003cp\u003e“And he’s your brother. Caleb,” he says. “You ditched your family to become Dauntless?”\u003c/p\u003e\n\u003cp\u003e“You sound like the Candor,” I say irritably. “Mind keeping your judgments to yourself?”\u003c/p\u003e\n\u003cp\u003eTherese leans over. “He was Erudite first, actually. Not Candor.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I know,” I say, “I—”\u003c/p\u003e\n\u003cp\u003eShe interrupts me. “So was I. Had to leave, though.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t smart enough.” She shrugs and takes a can of beans from Edward, plunging her spoon into it. “I didn’t get a high enough score on my initiation intelligence test. So they said, ‘Spend your entire life cleaning up the research labs, or leave.’ And I left.”\u003c/p\u003e\n\u003cp\u003eShe looks down and licks her spoon clean. I take the beans from her and pass them along to Tobias, who is staring at the fire.\u003c/p\u003e\n\u003cp\u003e“Are many of you from Erudite?” I say.\u003c/p\u003e\n\u003cp\u003eTherese shakes her head. “Most are from Dauntless, actually.” She jerks her head toward Edward, who scowls. “Then Erudite, then Candor, then a handful of Amity. No one fails Abnegation initiation, though, so we have very few of those, except for a bunch who survived the simulation attack and came to us for refuge.”\u003c/p\u003e\n\u003cp\u003e“I guess I shouldn’t be surprised about Dauntless,” I say.\u003c/p\u003e\n\u003cp\u003e“Well, yeah. You’ve got one of the worst initiations, and there’s that whole old-age thing.”\u003c/p\u003e\n\u003cp\u003e“Old-age thing?” I say. I glance at Tobias. He is listening now, and he looks almost normal again, his eyes thoughtful and dark in the firelight.\u003c/p\u003e\n\u003cp\u003e“Once the Dauntless reach a certain level of physical deterioration,” he says, “they are asked to leave. In one way or another.”\u003c/p\u003e\n\u003cp\u003e“What’s the other way?” My heart pounds, like it already knows an answer I can’t face without prompting.\u003c/p\u003e\n\u003cp\u003e“Let’s just say,” says Tobias, “that for some, death is preferable to factionlessness.”\u003c/p\u003e\n\u003cp\u003e“Those people are idiots,” says Edward. “I’d rather be factionless than Dauntless.”\u003c/p\u003e\n\u003cp\u003e“How fortunate that you ended up where you did, then,” says Tobias coldly.\u003c/p\u003e\n\u003cp\u003e“Fortunate?” Edward snorts. “Yeah. I’m so fortunate, with my one eye and all.”\u003c/p\u003e\n\u003cp\u003e“I seem to recall hearing rumors that you provoked that attack,” says Tobias.\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” I say. “He was winning, that’s all, and Peter was jealous, so he just . . .”\u003c/p\u003e\n\u003cp\u003eI see the smirk on Edward’s face and stop talking. Maybe I don’t know everything about what happened during initiation.\u003c/p\u003e\n\u003cp\u003e“There was an inciting incident,” says Edward. “In which Peter did not come out the victor. But it certainly didn’t warrant a butter knife to the eye.”\u003c/p\u003e\n\u003cp\u003e“No arguments here,” says Tobias. “If it makes you feel any better, he got shot in the arm from a foot away during the simulation attack.”\u003c/p\u003e\n\u003cp\u003eAnd it does seem to make Edward feel better, because his smirk carves a deeper line into his face.\u003c/p\u003e\n\u003cp\u003e“Who did that?” he says. “You?”\u003c/p\u003e\n\u003cp\u003eTobias shakes his head. “Tris did.”\u003c/p\u003e\n\u003cp\u003e“Well done,” Edward says.\u003c/p\u003e\n\u003cp\u003eI nod, but I feel a little sick to be congratulated for that.\u003c/p\u003e\n\u003cp\u003eWell, not that sick. It was Peter, after all.\u003c/p\u003e\n\u003cp\u003eI stare at the flames wrapping around the fragments of wood that fuel them. They move and shift, like my thoughts. I remember the first time I realized I had never seen an elderly Dauntless. And when I realized my father was too old to climb the paths of the Pit. Now I understand more about that than I’d like to.\u003c/p\u003e\n\u003cp\u003e“Do you know much about how things are right now?” Tobias asks Edward. “Did all the Dauntless side with Erudite? Has Candor done anything?”\u003c/p\u003e\n\u003cp\u003e“Dauntless is split in half,” Edward says, talking around the food in his mouth. “Half at Erudite headquarters, half at Candor headquarters. What’s left of Abnegation is with us. Nothing much has happened yet. Except for whatever happened to you, I guess.”\u003c/p\u003e\n\u003cp\u003eTobias nods. I feel a little relieved to know that half of the Dauntless, at least, are not traitors.\u003c/p\u003e\n\u003cp\u003eI eat spoonful after spoonful until my stomach is full. Then Tobias gets us sleeping pallets and blankets, and I find an empty corner for us to lie down in. When he bends over to untie his shoes, I see the symbol of Amity on the small of his back, the branches curling over his spine. When he straightens, I step across the blankets and put my arms around him, brushing the tattoo with my fingers.\u003c/p\u003e\n\u003cp\u003eTobias closes his eyes. I trust the dwindling fire to disguise us as I run my hand up his back, touching each tattoo without seeing it. I imagine Erudite’s staring eye, Candor’s unbalanced scales, Abnegation’s clasped hands, and the Dauntless flames. With my other hand I find the patch of fire tattooed over his rib cage. I feel his heavy breaths against my cheek.\u003c/p\u003e\n\u003cp\u003e“I wish we were alone,” he says.\u003c/p\u003e\n\u003cp\u003e“I almost always wish that,” I say.\u003c/p\u003e\n\u003cp\u003eI drift off to sleep, carried by the sound of distant conversations. These days it’s easier for me to fall asleep when there is noise around me. I can focus on the sound instead of whatever thoughts would crawl into my head in silence. Noise and activity are the refuges of the bereaved and the guilty.\u003c/p\u003e\n\u003cp\u003eI wake when the fire is just a glow, and only a few of the factionless are still up. It takes me a few seconds to figure out why I woke up: I heard Evelyn’s and Tobias’s voices, a few feet away from me. I stay still and hope they don’t discover that I’m awake.\u003c/p\u003e\n\u003cp\u003e“You’ll have to tell me what’s going on here if you expect me to consider helping you,” he says. “Though I’m still not sure why you need me at all.”\u003c/p\u003e\n\u003cp\u003eI see Evelyn’s shadow on the wall, flickering with the fire. She is lean and strong, just like Tobias. Her fingers twist into her hair as she speaks.\u003c/p\u003e\n\u003cp\u003e“What would you like to know, exactly?”\u003c/p\u003e\n\u003cp\u003e“Tell me about the chart. And the map.”\u003c/p\u003e\n\u003cp\u003e“Your friend was correct in thinking that the map and the chart listed all of our safe houses,” she says. “He was wrong about the population counts . . . sort of. The numbers don’t document all the factionless—only certain ones. And I’ll bet you can guess which ones those are.”\u003c/p\u003e\n\u003cp\u003e“I’m not in the mood for guessing.”\u003c/p\u003e\n\u003cp\u003eShe sighs. “The Divergent. We’re documenting the Divergent.”\u003c/p\u003e\n\u003cp\u003e“How do you know who they are?”\u003c/p\u003e\n\u003cp\u003e“Before the simulation attack, part of the Abnegation aid effort involved testing the factionless for a certain genetic anomaly,” she says. “Sometimes that testing involved re-administering the aptitude test. Sometimes it was more complicated than that. But they explained to us that they suspected we might have the highest Divergent population of any group in the city.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand. Why—”\u003c/p\u003e\n\u003cp\u003e“Why would the factionless have a high Divergent population?” It sounds like she’s smirking. “Obviously those who can’t confine themselves to a particular way of thinking would be most likely to leave a faction or fail its initiation, right?”\u003c/p\u003e\n\u003cp\u003e“That’s not what I was going to ask,” he says. “I want to know why you care how many Divergent there are.”\u003c/p\u003e\n\u003cp\u003e“The Erudite are looking for manpower. They found it temporarily in Dauntless. Now they’ll be looking for more, and we’re the obvious place, unless they figure out that we’ve got more Divergent than any other group. Just in case they don’t, I want to know how many people we’ve got who are resistant to simulations.” \u003c/p\u003e","sourceLink":"https://allnovel.net/insurgent-divergent-2/page-9.html","bookId":1699,"creation":"Oct 5, 2019 9:58:19 AM","modification":"Oct 5, 2019 9:58:19 AM"}
