{"id":90896,"no":14,"title":"Page 14","content":"\u003cp\u003e\"My master will-\"\u003c/p\u003e\n\u003cp\u003e\"Shut the fuck up.\"\u003c/p\u003e\n\u003cp\u003e\"You cannot speak to-\"\u003c/p\u003e\n\u003cp\u003e\"Shut the fuck up.\"\u003c/p\u003e\n\u003cp\u003eShe leaned forward and her eyes went the color of the sky right before sunset. \"You don\u0027t wish to fight with me...Betsy.\"\u003c/p\u003e\n\u003cp\u003eOoooh, eyes that change color when she\u0027s in a snit...now I was really scared. \"You bet I do, Tootsie Roll. Bring it, cow! Let\u0027s see how you do when you\u0027re not hiding behind one of my friends.\" I must have sounded almost as angry as I felt, because she hesitated. Then she crossed her arms over her chest, doing an admirable impression of someone who hadn\u0027t been momentarily frightened, sat back, and stared out the limo window.\u003c/p\u003e\n\u003cp\u003eYep, I was back in one of Noseo\u0027s limos. It had been waiting at the mouth of the alley like a big black gas-guzzling omen of death. I snapped the antenna off, just for fun, and threw it at Tootsie Roll\u0027s head. She ducked-barely. The driver didn\u0027t say a word, just held the door for me.\u003c/p\u003e\n\u003cp\u003e\"I am Shanara.\"\u003c/p\u003e\n\u003cp\u003e\"Shut the fuck up.\" I fumbled with my pocket-stupid linen trousers, they were going to wrinkle like hell-and tossed her a ten dollar bill. \"And go buy yourself a real name.\"\u003c/p\u003e\n\u003cp\u003eShe let the bill bounce off her nonexistent chest and started tapping her long red fingernails on the armrest. She was starting to get pretty pissed but, interestingly, wasn\u0027t doing anything. Did Nostril\u0027s edict give her permission to hurt my friends, but not me? Time to find out. \"Long red slut nails are so five minutes ago,\" I informed her. \"In fact, it\u0027s more like five years ago. Just because you\u0027re dead doesn\u0027t mean you have to be a fashion eyesore.\"\u003c/p\u003e\n\u003cp\u003e\"Undead,\" she snapped.\u003c/p\u003e\n\u003cp\u003e\"Dead,\" I said implacably. \"When was the last time you had a nice steak? Or even a salad? Shit, even a piece of toast? Dead people don\u0027t eat. We don\u0027t eat. Ergo, we are dead.\"\u003c/p\u003e\n\u003cp\u003e\"We have more power than mere mortals can-\"\u003c/p\u003e\n\u003cp\u003e\"Blah, blah, blah. So, when did you die? You don\u0027t look a day over sixty.\"\u003c/p\u003e\n\u003cp\u003eHer flat bosom heaved in indignation. \"I became Gloriously Transformed in 1972.\"\u003c/p\u003e\n\u003cp\u003e\"That explains the nails and the bell bottoms.\"\u003c/p\u003e\n\u003cp\u003e\"These are in again!\" she nearly screamed, pointing to her Gap knockoffs.\u003c/p\u003e\n\u003cp\u003e\"Nope, sorry. They were trendy, but now they\u0027re out again.\" From the front I could hear a curiously muffled sound, almost like someone was strangling on their own laughter.\u003c/p\u003e\n\u003cp\u003eShaloser turned and, quick as thought, slammed her palm against the partition separating us from the driver. The glass cracked but didn\u0027t break. \"Just drive, oaf!\"\u003c/p\u003e\n\u003cp\u003e\"Touchy,\" I commented. \"Not much fun kidnapping someone who thinks you\u0027re a walking, talking, ugly-clothes-wearing-joke, is it? And by the way, Shamu, if you ever touch one of my friends again, I\u0027ll bite off all your fingers and stick them up your nose.\" I smiled pleasantly. \"And that goes for ol\u0027 Nostril, too.\" I was all talk, of course...shit, I was a secretary, not an avenger. An out of work secretary, I might add. I could type like a son of a bitch, but I\u0027d never thrown a punch.\u003c/p\u003e\n\u003cp\u003eBut I could talk. I could yak until Judgment Day, if I had to.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll pay,\" she said stonily. \"You won\u0027t be like this by this time tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Bored and pissed off? God, I hope not.\"\u003c/p\u003e\n\u003cp\u003eShe flinched like I\u0027d poked a fork toward one of her eyes. Odd, very odd. I quickly thought about what I\u0027d just said: bored? Pissed? God?\u003c/p\u003e\n\u003cp\u003e\"God,\" I said. Another flinch. \"Jesus Christ. Lord. \u0027Our Father, who art in heaven...\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Stop it, stop it!\" She was practically climbing the door, trying to get away from me. \"Don\u0027t say it, don\u0027t say Those Words!\"\u003c/p\u003e\n\u003cp\u003e\"Stop talking in capital letters and I won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"What? I don\u0027t understand you.\"\u003c/p\u003e\n\u003cp\u003e\"No one with your footwear,\" I said with a meaningful glance at her Prada knockoffs, \"ever could.\"\u003c/p\u003e\n\u003cp\u003e\"Are we there yet?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Are we there yet?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Are we there yet?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Are we there yet?\"\u003c/p\u003e\n\u003cp\u003e\"Shut up! I had to bring you to him but I should not have to listen to another word out of your mouth! Stop it stop it stop it!\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay. Say it, don\u0027t spray it.\" I waited a few seconds, then asked brightly, \"Are we there yet?\"\u003c/p\u003e\n\u003cp\u003e\"Mercifully,\" she said through gritted fangs, \"we are.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, neat trick, you\u0027re all toothy. Why? Hungry?\" She probably was. She looked ghastly. Too white, too thin, and sort of haggard. Of course, that could just be the residual effect of being trapped with me in a closed space for thirty minutes. \"Don\u0027t even think about snacking on me.\"\u003c/p\u003e\n\u003cp\u003e\"You wish.\" The limo came to a smooth stop, the door popped open, and Shanara grabbed my elbow and practically shoved me out of the car. \"Come along.\"\u003c/p\u003e\n\u003cp\u003e\"What, no cemetery?\" We were standing outside a gigantic house on Lake Minnetonka. It was three stories, dark green, with four white pillars. It looked like Tara gone bad. All the lights were out, of course. \"I thought your boss really went for the stereotypes.\"\u003c/p\u003e\n\u003cp\u003eNo answer. She just grabbed my elbow again and jerked me along. I could tell she really, really wanted to hurt me. A sensible, intelligent person would use this opportunity to keep quiet and look for escape.\u003c/p\u003e\n\u003cp\u003e\"So, Shanockers, are you this guy\u0027s retriever or what? \u0027I want Betsy, bring me Betsy...fetch!\u0027 Is it like that? Or are you just such a loser you don\u0027t have a life of your own, so you hang onto this guy\u0027s coattails? Hey, watch the suit!\" I was wearing a tan linen Anne Klein pantsuit and last year\u0027s Helene Arpel flats. I was glad I wasn\u0027t more dressed up, or wearing my good Arpels. I\u0027d hate for these assholes to think I was trying to look nice for them.\u003c/p\u003e\n\u003cp\u003eShe was pulling me through the house, which, although dark, seemed well lit to me.\u003c/p\u003e\n\u003cp\u003eShe brought me (well, dragged me) through a set of French doors, which opened to a ballroom. I looked up warily for the disco ball and was relieved not to see one. The room was full of about twenty people, all dressed (natch) in black. The women all wore lipsticks in various shades of red, and the men were all in tuxedos. Ugh! Rented suits! Is there anything more yuck-o?\u003c/p\u003e\n\u003cp\u003e\"Ahhhhhh, Elizabeth.\" Nostro stood up from a (groan!) throne. An actual throne at the far side of the ballroom. Really ugly, too, all gold-plated and shiny and gauche. At least he wasn\u0027t wearing a crown. \"Thank you for bringing her, Shanara.\"\u003c/p\u003e\n\u003cp\u003e\"Your slightest wish is my most urgent command, Master.\"\u003c/p\u003e\n\u003cp\u003eI snorted. Sha-na-na shot me a look of purest venom. Which I pointedly ignored. \"Listen, why am I here? Why\u0027d you set your dog on me?\"\u003c/p\u003e\n\u003cp\u003e\"You left too quickly last time,\" Nostro said pleasantly. As he got closer I saw he was quite a bit shorter than I was, and balding. He looked like a mean-spirited monk, the kind who tortured mice when the other monks were praying. \"I\u0027m very glad you\u0027ve chosen to return. Now we can complete the ceremony, and you can join my family.\" He swept his arm around, indicating the others in the room. \"They are most anxious to greet you.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, they look like they\u0027d be a laugh a minute. Listen, Nostro, I don\u0027t appreciate any of this. I didn\u0027t choose to come back and you know it. Your knockoff-wearing henchwhore hurt a friend of mine to get me here. And I\u0027m not participating in any ceremony. And I want you to leave me alone.\"\u003c/p\u003e\n\u003cp\u003eThere were a couple of stifled gasps at this. Nostro looked around slowly, a cobra watching for careless mice, but nobody was making eye contact. They were all staring at the floor.\u003c/p\u003e\n\u003cp\u003eNostro turned back to me and forced a smile. His pupils, I noticed for the first time, were rimmed in red. It was quite a bit scarier than the big spooky house, the dumb tux, the throne and the fake courteous mannerisms. That stuff just made me want to laugh. The thing he couldn\u0027t help-his creepy, creepy eyes-that was really scary. \"I must insist. I require your participation in the ceremony and I will not...\" \u0027Not\u0027 was screamed, actually screamed; I jumped. He continued in a perfectly mild voice. \"...tolerate you siding with Sinclair.\"\u003c/p\u003e\n\u003cp\u003e(Note to self: either being undead drove this guy crazy, or he was crazy first.)\u003c/p\u003e\n\u003cp\u003e\"Sinclair?\" I was ready to swoon with relief. \"You\u0027re worried about me siding with him? Don\u0027t sweat it, chief. I wouldn\u0027t go near him on a bet. Yuck!\"\u003c/p\u003e\n\u003cp\u003eNostro blinked slowly like a frog. \"You do not wish allegiance with my clan or Sinclair?\"\u003c/p\u003e\n\u003cp\u003e\"By jove, I think he\u0027s got it! No, I don\u0027t want to hang out with any of you. I don\u0027t want ceremonies or vamp politics or my friends getting ambushed because someone\u0027s really hot to talk to me...I don\u0027t want any of it. No offense,\" I added, seeing his expression darken.\u003c/p\u003e\n\u003cp\u003e\"None taken,\" he said with completely fake sincerity.\u003c/p\u003e\n\u003cp\u003eI tried really hard to keep the sarcasm out of my tone as I continued. \"I just want to live my death the way I lived my life.\" I looked around the room, trying to make eye contact with somebody...anybody. \"Oh, come on!\" I said loudly. \"I can\u0027t be the only one who feels like this. Don\u0027t you guys want to see your friends? Maybe find your old boss and scare the shit out of him? Show your parents you\u0027re not taking a dirt nap? Why do we have to huddle together in little undead covens?\"\u003c/p\u003e\n\u003cp\u003e\"For protection, for-\"\u003c/p\u003e\n\u003cp\u003e\"For bullshit. The stories aren\u0027t all true-we\u0027ve managed to hang onto our souls. Why can\u0027t we stay individuals? Why don\u0027t we turn the goddamned lights on? Why are you all wearing black? Why do you all look like extras from a B-movie vampire set?\"\u003c/p\u003e\n\u003cp\u003eNostro flinched at \"God,\" just like Shanara had, but other than that, he was completely unmoved by my rallying cry.\u003c/p\u003e\n\u003cp\u003e\"Enough,\" he said, because a few of the others were looking at me with surprise and not a little curiosity. \"I hate to use a cliche...\"\u003c/p\u003e\n\u003cp\u003e\"You do?\"\u003c/p\u003e\n\u003cp\u003e\"...but you\u0027re either with us, or with Sinclair. Which is it?\"\u003c/p\u003e\n\u003cp\u003e\"Neither! I think you\u0027re both creeps.\" As soon as it was out of my mouth I knew I\u0027d gone too far. He lunged for me, crossing the six or seven feet between us in a blink, his hands going to my throat, closing off my air. Which would have been a huge problem if I\u0027d needed to breathe more than a few times a minute.\u003c/p\u003e\n\u003cp\u003eOn cue, the horde descended on us. There were too many of them to do me much damage; all I really saw (and felt) was a flurry of fists. Nostro released his grip and I heard him say, \"The pit for her!\"\u003c/p\u003e\n\u003cp\u003eThe horde bore me away. I didn\u0027t try to fight-why bother? The odds were thirty-to-one. Instead I focused on keeping my feet, which was tough because they were sweeping me along so fast and furiously my toes were barely skimming the floor.\u003c/p\u003e\n\u003cp\u003eDown, down, down the stairs we went, and before I could so much as get a look at the room I was flying through the air, from darkness to more darkness. And someone came down into the darkness with me. \u003c/p\u003e","sourceLink":"https://allnovel.net/undead-and-unwed-undead-1/page-14.html","bookId":2807,"creation":"Oct 5, 2019 5:45:50 PM","modification":"Oct 5, 2019 5:45:50 PM"}
