{"id":90904,"no":22,"title":"Page 22","content":"\u003cp\u003eSo, I\u0027m the queen of the dead. And the lout I\u0027m hopelessly attracted to, yet despise, is my king. For all intents and purposes, we\u0027re stuck for the next thousand years.\u003c/p\u003e\n\u003cp\u003eA week ago my biggest problem was finding a new job. Now I had to worry about running a kingdom of vampires, keeping my hands off Sinclair (because, oh God, I still want him, would do just about anything to feel his hands and-other things-again), giving Tina the cold shoulder until I decided to forgive her, keeping Jessica and Marc from starting their new crime fighting business (HELP, Inc.), and help thousands of vampires acclimate to being in charge of their own destiny.\u003c/p\u003e\n\u003cp\u003eNot to mention finding permanent suck buddies and a paying job-I was undead and unemployed, and couldn\u0027t live off Jessica\u0027s charity forever.\u003c/p\u003e\n\u003cp\u003eWorse, my mom was completely taken with Sinclair. He really swept her off her feet when he came to take her out of harm\u0027s way. She thinks the fact that Sinclair is the king is just dandy. \"You know, Betsy, just because you\u0027re a vampire doesn\u0027t mean you can\u0027t settle down with someone. Just because you\u0027re undead doesn\u0027t mean you have to be unwed.\"\u003c/p\u003e\n\u003cp\u003eYeah, sure. I planned to stay unwed, for a thousand years to be exact. Having that sneaky Sinclair as a consort was bad enough (and what exactly was a consort, anyway?); I wasn\u0027t about to become the little woman.\u003c/p\u003e\n\u003cp\u003eNow if I could just get him to quit dropping off pairs of designer shoes. In his last card he said he would drop off a pair a day until I forgave him. I\u0027m up to fourteen pairs of Pradas, eight pairs of Manolos, and six Ferragamos.\u003c/p\u003e\n\u003cp\u003eMaybe I\u0027ll forgive him...eventually.\u003c/p\u003e\n\u003cp\u003eI\u0027m still waiting for this season\u0027s red Beverly Feldman pumps. \u003c/p\u003e","sourceLink":"https://allnovel.net/undead-and-unwed-undead-1/page-22.html","bookId":2807,"creation":"Oct 5, 2019 5:45:50 PM","modification":"Oct 5, 2019 5:45:50 PM"}
