{"id":90952,"no":49,"title":"Page 49","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“What does it mean?”\u003c/p\u003e\n\u003cp\u003e“That your kidnapper tied a natty cravat.”\u003c/p\u003e\n\u003cp\u003eAt the end of my rope, I curled my fingers into Vale’s shirt and hissed at him, hard, my bared teeth inches from his lips. He stumbled back with a look of such surprise that it was almost comical.\u003c/p\u003e\n\u003cp\u003e“Did you just hiss at me?”\u003c/p\u003e\n\u003cp\u003e“You deserved it. Now, stop being clever and explain to me what this is, why it’s important, and why this guy wanted to kidnap me in a fucking elephant. It’s . . . not subtle.”\u003c/p\u003e\n\u003cp\u003eVale held out his hand, and I dropped the button into it. He bit the edge and turned it over with one wide finger, and I noted how odd it was to see a man’s bare hand; I still wasn’t used to it. “It’s cast of solid gold, which is unusual. The symbol is not one that I have seen before, but among my people, it’s sinister. A raven’s skull is used for dark magic. Bat wings signify nighttime. The top hat is a very expensive kind, extra tall, favored only by the very wealthy men who can afford it. So whoever he was, he had money and dangerous leanings.”\u003c/p\u003e\n\u003cp\u003e“But you don’t know who he was?”\u003c/p\u003e\n\u003cp\u003e“No. But I expect that some of the daimon girls might. It’s an extraordinary man who isn’t known somewhere in Mortmartre. Especially if he has the money to buy the rare things that take his fancy.”\u003c/p\u003e\n\u003cp\u003e“Do we have a picture of him? A description? He was blond and completely forgettable.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “The gendarmes are covering it up, for some reason. I caught this little dainty before they could stuff everything in the incinerator.”\u003c/p\u003e\n\u003cp\u003e“Hmm.” I ran a finger over the design. It was pretty, if evil. “So lots of money is involved.”\u003c/p\u003e\n\u003cp\u003eHe threw back his head and laughed. “It doesn’t take a lot of money to make the gendarmes dance, bébé. But yes, judging by the fact that they were going to burn solid gold instead of keeping it, I’m guessing many francs changed hands.”\u003c/p\u003e\n\u003cp\u003eI tried to think back, but I had never really seen the kidnapper’s face, thanks to his goggles and mask.\u003c/p\u003e\n\u003cp\u003e“He said something to me. Before he died.” I paused, rolled the button back and forth on his palm. “Mal.”\u003c/p\u003e\n\u003cp\u003e“Mal?”\u003c/p\u003e\n\u003cp\u003e“That’s it.”\u003c/p\u003e\n\u003cp\u003e“What does it mean?”\u003c/p\u003e\n\u003cp\u003e“I dunno. It means nothing to me. What’s it mean to you?”\u003c/p\u003e\n\u003cp\u003eHe rubbed a finger over the dent his tooth had made in the button. “Mal means bad, evil.” But the way he rubbed his chin, his eyes shifting like moor grass . . .\u003c/p\u003e\n\u003cp\u003e“There’s something more, isn’t there?”\u003c/p\u003e\n\u003cp\u003e“Maybe. There are rumors . . .”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I’ve heard whispers of something called the Malediction Club. Its members are high up, very high, and sworn to absolute secrecy on pain of death.”\u003c/p\u003e\n\u003cp\u003e“But what is it?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, not exactly. I had always assumed it was just a party of the usual powerful men sitting around with cigars, patting one another on the back. But between this pin, your kidnapping, and the way the gendarmes are sweeping it all under the rug, I suspect the Malediction Club is real and this is their crest, their sigil.” He glanced up at the clock and then to the window, his fist curling around the pin. “Come on.”\u003c/p\u003e\n\u003cp\u003eI followed him out my door, expecting him to drag me into the sewers or through dark alleys and into Darkside. Instead, he went right across the hall to knock on the room shared by Mel, Bea, and Blaise. After a moment, Bea answered with a halting smile.\u003c/p\u003e\n\u003cp\u003e“Demi needs your help,” Vale said plainly, and Bea stepped back to let us in, her small hands blanching sky-blue against the wood.\u003c/p\u003e\n\u003cp\u003eMel lay on the wooden double bed, curled on a bright red and green blanket and reading a book, which she quickly shut and slid under a fluffy white pillow. Both girls were in simple shifts, and I noticed something that completely floored me, something I’d never noticed before.\u003c/p\u003e\n\u003cp\u003eThey had no tails.\u003c/p\u003e\n\u003cp\u003eEvery daimon I’d ever known had had a long, somewhat prehensile tail. Luc and his brother at the caravan used them for balance while doing incredible dance moves, and I had also met daimons who used them for building, painting, or self-defense. But Mademoiselle Caprice and every daimon I’d ever seen at Paradis had always been dressed in layers and layers of costume, and I had taken for granted that their tails were curled up under voluminous skirts. I caught myself staring and looked away.\u003c/p\u003e\n\u003cp\u003e“You need help, chérie?” Mel asked, and Bea sat down beside her on the bed, their hands clasping unconsciously and merging Bea’s blue with Mel’s green for a beautiful teal that made me smile.\u003c/p\u003e\n\u003cp\u003e“Are you sure—?” I started, and Vale nodded.\u003c/p\u003e\n\u003cp\u003e“What do you know about the Malediction Club?” I asked.\u003c/p\u003e\n\u003cp\u003eThe color drained out of Bea, leaving her a sickly grayish-white, her eyelids fluttering as if she might faint.\u003c/p\u003e\n\u003cp\u003eMel wrapped an arm around her and drew her close, giving me a reproachful look. “Nothing,” she said. “Nothing more than anyone. It’s a rumor, something whispered in the dark. Wealthy men who do horrible things. But no one’s ever seen it.”\u003c/p\u003e\n\u003cp\u003e“Do you recognize this, then?” Vale held out the button, and Mel took it, examining it.\u003c/p\u003e\n\u003cp\u003eWith sudden violence, Bea dashed it to the ground, where it skittered across the room.\u003c/p\u003e\n\u003cp\u003e“What’s come over you, darling?” Mel asked. “Do you know more?”\u003c/p\u003e\n\u003cp\u003eBea shook her head and hid behind her hair but wouldn’t lift her hands to sign.\u003c/p\u003e\n\u003cp\u003e“I’ve seen that symbol before,” Mel said slowly. “On a cravat, here or there. Figured it was just something the Pinkies enjoyed.”\u003c/p\u003e\n\u003cp\u003e“Do you remember any of the men who wore them?” Vale asked.\u003c/p\u003e\n\u003cp\u003eMel shrugged and gave a small, defiant smile. “Oh, la. All the Pinkies look alike to me. But it is always fancy gents—I remember that much.”\u003c/p\u003e\n\u003cp\u003e“What about the fellow who tried to kidnap Demi? Did you know anything about him?”\u003c/p\u003e\n\u003cp\u003eMel shook her head. “We couldn’t see him, with the pachyderm fallen and the gendarmes all around. Did they find that pin on his body? How wretched.”\u003c/p\u003e\n\u003cp\u003eBea’s fingers twitched in her lap, and one hand rose, shaking, to make signs. I recognized a few of the letters as she spelled something out. After the last one, her hand fell limply back to her lap, and she slumped over, drained and defeated.\u003c/p\u003e\n\u003cp\u003e“Charmant? Darling, I don’t think it’s charming at all.” Mel drew her close, stroking her hair and her back and kissing her forehead as Bea shuddered, eyes closed.\u003c/p\u003e\n\u003cp\u003e“Monsieur Charmant?” Vale asked quietly, and Bea shook with a sob.\u003c/p\u003e\n\u003cp\u003e“That’s enough,” Mel said, eyebrows drawn down defiantly. “I don’t know what you’re getting at, but she hasn’t been this bad in years. I think you need to leave now.”\u003c/p\u003e\n\u003cp\u003e“Bea, I’m so sorry—” I started.\u003c/p\u003e\n\u003cp\u003e“We’re going.” Vale took my hand and dragged me out, leaving the gold button winking on a threadbare rug.\u003c/p\u003e\n\u003cp\u003eThe last thing I saw was Bea sobbing violently, silently, in Mel’s arms.\u003c/p\u003e\n\u003cp\u003e25\u003c/p\u003e\n\u003cp\u003eBack in my room, Vale made straight for the window.\u003c/p\u003e\n\u003cp\u003e“Who is this Monsieur Charmant?” I asked, rushing to catch his sleeve before he could slip away.\u003c/p\u003e\n\u003cp\u003e“A dark daimon. An apothecary. He’s the one who buys the tails.”\u003c/p\u003e\n\u003cp\u003e“What tails?”\u003c/p\u003e\n\u003cp\u003eHe paused, one leg on either side of the sill, and sat on it like a pawing stallion. “Demi, bébé, stop playing dumb. You saw, just now. I watched it reach your eyes. When the daimons come to work in cabarets, they must have their tails amputated. The human men won’t touch them otherwise. Their magic comes from their tails; their poison, too. They go to a daimon chirurgeon to have it done and sell their tails by the pound to Monsieur Charmant.”\u003c/p\u003e\n\u003cp\u003e“What the hell does anyone want with a tail?”\u003c/p\u003e\n\u003cp\u003eHe shook his head in disgust. “Magical properties. They powder it for use in potions and draughts. Use the leather to make grimoires or charms or boots. Sell the meat as a delicacy.”\u003c/p\u003e\n\u003cp\u003eI stared at him, jaw dropped. A fly actually, literally, seriously landed on my tongue, and I coughed and hacked and danced around until I’d spit it back out. “Are you shitting me?”\u003c/p\u003e\n\u003cp\u003e“Oh, bébé. You’ve only seen the sweet side of Mortmartre, and how sweet has it been? If this is Paradis, how do you imagine life goes in Enfer? Have you ever walked through the mouth of hell? There are daimons and humans with far darker desires than you could ever dream, and if they have the coppers, they can get whatever they need to find satisfaction.”\u003c/p\u003e\n\u003cp\u003eI dragged my feet to the bed and sat down heavily. All these beautiful, seemingly carefree girls around me, and they’d all basically given up a limb to be here. From the outside, they were as pretty and bright as songbirds, but on the inside, they were crippled things, their smiles as fake as the feathers they glued to their eyelashes. I had wanted so badly to taste fame that I had ignored their suffering and simply stepped among them and sometimes on them on my way to the top. A blud tear fell on my taffeta skirt, then another and another. Vale hurried from the window to put an arm around me.\u003c/p\u003e\n\u003cp\u003e“Don’t, bébé. We all choose our paths. This is a safer place than most.”\u003c/p\u003e\n\u003cp\u003e“But Paris seems so . . . sweet and simple. So clean. You would think that when the people don’t have to eat, there wouldn’t be so much wretchedness.”\u003c/p\u003e\n\u003cp\u003e“The humans still have to eat, and the daimons need the humans. But daimons have other needs, too. Some turn to drink and gambling and get addicted to absinthe and dark magic. Every creature walking has a fire burning inside that demands to be fed. And for many of the girls here, a few pounds of flesh and magic was a small price to pay for freedom.”\u003c/p\u003e\n\u003cp\u003e“Are they paid for their tails, at least?”\u003c/p\u003e\n\u003cp\u003e“They’re paid very well. And their clients pay them. And Madame Sylvie pays them. The girls who do well will eventually have enough to leave and find new lives.”\u003c/p\u003e\n\u003cp\u003e“Promise?”\u003c/p\u003e\n\u003cp\u003eA genuine laugh surprised me. “Bébé, in just a few moments, we’re going to pass by a dollmaker’s shop, a dressmaker, a stationer. You’ll see dancing schools and open-air painting studios and tiny daimons with swishing tails carrying books wrapped with leather belts. A few years of hard work in the cabaret can buy a lifetime of comfort for an entire family, if a girl is savvy. Outside of Mortmartre, real life gets lived in Paris, I promise you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-after-midnight-blud-3/page-49.html","bookId":1599,"creation":"Oct 5, 2019 5:45:51 PM","modification":"Oct 5, 2019 5:45:51 PM"}
