{"id":90958,"no":56,"title":"Page 56","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eVale rerolled Bea’s painting, stuffed it down the back of his collar, and reached down to collect me.\u003c/p\u003e\n\u003cp\u003e“Fire’s working fast. Time to go, bébé.”\u003c/p\u003e\n\u003cp\u003eI waved him away. “I know. Get his pin first. We might need it.”\u003c/p\u003e\n\u003cp\u003eVale gave me a determined nod and snatched away the damning bit of gold from the painter’s jacket. I half expected Lenoir to bolt upright like Lestat and try to strangle the brigand to death, but there was nothing left in the shell of his body. When I held out my arms, Vale gently gathered me to his chest and hurried away from the growing fire. As he rushed down the stairs trailing my chocolate dress, I caught a last glimpse of the Siamese cats on the landing, curled together like parentheses, dead. Their downy white fur had fallen to the floor, their black lips twisted back over fangs, just like their master.\u003c/p\u003e\n\u003cp\u003eInstead of heading for the front door where I had always entered, Vale plunged into the darkness of a spare kitchen, nearly banging his head on hanging copper pots.\u003c/p\u003e\n\u003cp\u003e“Where are we going?”\u003c/p\u003e\n\u003cp\u003e“Into the alleys, the same way I came in. Trust a brigand, bébé, you don’t want to be seen stepping out a rich dead man’s front door.”\u003c/p\u003e\n\u003cp\u003eThe courtyard out back was far less fancy than the sidewalk in front, and Vale neatly sidestepped rubbish bins that rankled of turpentine and neatsfoot oil. He navigated the back alleys like a streetwise cat, keeping us entirely away from gaslights and gendarmes and conveyances, carrying me as if I weighed nothing. I tried to speak once, but he quieted me with a quick peck on the lips and a wink.\u003c/p\u003e\n\u003cp\u003e“Brigand rule two: if you don’t wish to get caught, be silent,” he whispered against my ear.\u003c/p\u003e\n\u003cp\u003eI didn’t recognize the route he took to Paradis, not until we entered the elephant’s empty courtyard.\u003c/p\u003e\n\u003cp\u003e“Vale, I can’t go in. I ran away from the prince after he’d . . .”\u003c/p\u003e\n\u003cp\u003e“Paid for you?” He gave me a dark look as he scooted sideways down a narrow alley. “I know. I watched. You were magnificent.”\u003c/p\u003e\n\u003cp\u003eI drew back, which was hard, considering he was carrying me and I was still nearly numb. “You were eavesdropping?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I was coming to your room to visit, but then I saw you dressed in that . . . scrap, pacing around like a bludrat in an oven. When he arrived, I watched to make sure he didn’t hurt you.”\u003c/p\u003e\n\u003cp\u003e“But I went out the window and didn’t see you.”\u003c/p\u003e\n\u003cp\u003e“I can be rather quick when I need to be.”\u003c/p\u003e\n\u003cp\u003ePlacing me gently to lean against the alley’s bricks, he tapped a broken edge, and to my great surprise, a knee-high door swung open on a crawlspace. I breathed in, always distrustful of small places, but all I caught was the scent of cold stone, old wood, and, oddly enough, hard liquor.\u003c/p\u003e\n\u003cp\u003e“Can you crawl?”\u003c/p\u003e\n\u003cp\u003eI flexed my arms and knees. “I think so. Blood would help.”\u003c/p\u003e\n\u003cp\u003e“Crawl to the end of the tunnel, and you can have all the blood you want.”\u003c/p\u003e\n\u003cp\u003eMy mouth watered, and I dropped to my knees and wiggled into the hole with Vale’s face pressed against my bustle.\u003c/p\u003e\n\u003cp\u003e“It’s a straight shot, bébé. There is one turn-off that goes to the main hall of Paradis, but that hatch is probably sealed. Just keep going.” I nodded, knowing he couldn’t see it, and focused on forcing my sluggish limbs to move. “Best view on Sang, and I can’t see a damn thing,” he muttered behind me.\u003c/p\u003e\n\u003cp\u003eMy muscles limbered up with movement, although my knees and skirts were suffering against the rough boards. When Vale murmured, “You should be able to stand up now,” I pulled myself up the wall and leaned for a moment, catching my breath.\u003c/p\u003e\n\u003cp\u003e“You’d better not be lying about that blood.”\u003c/p\u003e\n\u003cp\u003e“I never lie about going to the bar, bébé.”\u003c/p\u003e\n\u003cp\u003eA dim light appeared up ahead, and then I realized we were in part of the tunnel Bea had taken me through that first morning at Paradis when they had neglected to feed me. I almost drooled, thinking about the supply of blood they’d brought in once I’d proven myself a star. When I found the familiar door, I unhooked the latch and peeked into the bar and the empty theater beyond. My keen Bludman’s senses came in handy; there was no one there at all, but I could feel the warmth just beyond, the girls snoring in their beds upstairs. But one thing still bothered me.\u003c/p\u003e\n\u003cp\u003e“Why can’t I smell you?”\u003c/p\u003e\n\u003cp\u003eVale chuckled. “Magic, bébé. A brigand’s secret among telling noses. Now, drink.”\u003c/p\u003e\n\u003cp\u003eSo I finally knew how he’d managed to sneak up on me. But considering it had just saved my life, I wasn’t about to pick a fight.\u003c/p\u003e\n\u003cp\u003eBreathing deeply, I went straight to the low hum of a brand-new, still shiny blood warmer. Dozens of vials waited inside, each labeled with a fancy parchment tag showing the vintage. I couldn’t have cared less about quality and grabbed the first two, popping their corks with both thumbs and guzzling them like a baby with a bottle. It was gourmet stuff, probably taken off virgin blue bloods, and it washed away the spicy funk of magic and anise from Lenoir’s potion. I tossed the empty vials onto the counter and grabbed two more while Vale watched, bemused. I eyed the bowl of oranges I’d noticed on my first trip back here.\u003c/p\u003e\n\u003cp\u003e“Those aren’t blood oranges, are they? I could use something sweet as a chaser.”\u003c/p\u003e\n\u003cp\u003eHis grin deepened. “They aren’t oranges at all.”\u003c/p\u003e\n\u003cp\u003eI dropped the vials and stared at him.\u003c/p\u003e\n\u003cp\u003e“Wait, what?”\u003c/p\u003e\n\u003cp\u003eHe plucked an orange and held it up. When he rapped on it with his fist, the sound was hollow. He held it out to me, stem first, and I noticed a circular etching in the peel. When I pulled the stem, it revealed the orange as hollow.\u003c/p\u003e\n\u003cp\u003e“If a gentleman wishes to spend the night with a lady, he comes to the bar and buys an orange. If he offers it to a girl and she accepts it, that means she has agreed. When the deed is done, she keeps the orange and brings it back here to get paid.”\u003c/p\u003e\n\u003cp\u003e“But I’ve never seen a girl carrying an orange . . .”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Would you keep a symbol like that where anyone could see it? Or steal it? No, they mostly hide them until they cash them in in the morning. Most likely, you are still asleep when that happens.”\u003c/p\u003e\n\u003cp\u003e“How much do they cost?”\u003c/p\u003e\n\u003cp\u003eHis eyebrows rose significantly. “I wouldn’t know. I have never paid.” He jerked his chin at the pile of vials on the bar. “You have had enough?”\u003c/p\u003e\n\u003cp\u003eI stretched, cracked my neck, and gave him a wicked grin. “I could always use a little more.”\u003c/p\u003e\n\u003cp\u003e“And I would be glad to take you up on that soon. But for now, I think we must wake Bea and discover what she knows. As soon as the world understands that Lenoir is dead and his studio burned, the Malediction Club might move headquarters. Because after what Lenoir said, you agree that Cherie is there, yes?”\u003c/p\u003e\n\u003cp\u003eI could only nod.\u003c/p\u003e\n\u003cp\u003e“Come on, then. There is still time, if we hurry. Something tells me this club stays wicked long after midnight.”\u003c/p\u003e\n\u003cp\u003eI was curious about whether he knew a secret way up to the bedrooms, but we took the usual hallway and stairs.\u003c/p\u003e\n\u003cp\u003e“What about Charline and Sylvie?”\u003c/p\u003e\n\u003cp\u003e“They’re both absinthe addicts. Hence why it’s forbidden. Probably collapsed in one of their rooms next to a bottle. Sisters, you know.”\u003c/p\u003e\n\u003cp\u003eUpstairs, the low-burning gaslights revealed a new sign on the door where my own name had hung just a few short hours ago. Looked like La Goulue would get her chance to rule Paradis next, and she was welcome to it. No sounds came from Mel and Bea’s room, and I hesitated to knock, knowing that whatever Bea had to say, she was going to be even more upset than she had been earlier, when Mel had asked us to leave.\u003c/p\u003e\n\u003cp\u003eBefore I could get up my nerve, Vale knocked gently. There was rustling inside, and the door opened just a sliver.\u003c/p\u003e\n\u003cp\u003e“It’s late,” Mel said, worried eyes darting from me to Vale. “And we’re not allowed to talk to her.”\u003c/p\u003e\n\u003cp\u003e“We must speak with Bea,” Vale said. “It is imperative.”\u003c/p\u003e\n\u003cp\u003eShe chewed her green lip, still streaked with red paint. “Oh, la. I think that’s a bad idea.”\u003c/p\u003e\n\u003cp\u003e“Is Blaise with you?”\u003c/p\u003e\n\u003cp\u003e“No. He’s with Blue tonight.”\u003c/p\u003e\n\u003cp\u003eVale nodded to himself and pulled the canvas tube from his collar and unrolled it. I held out the gold pin.\u003c/p\u003e\n\u003cp\u003e“I know it is bad, Mel, and I hate to ask. But Lenoir tried to kill Demi tonight, and we killed him instead. We have only a few hours to find the Malediction Club and shut it down. Permanently.”\u003c/p\u003e\n\u003cp\u003eMel’s skin shivered over to a pale and sickly light green, her eyes going wide and scared as she stared at Lenoir’s painting of Bea. Finally, she took a shuddering breath and stood back to let us in. Bea was a blue smudge by a bedside lamp turned low, her arms spotted under a colorful afghan. Before she could sit up enough to withdraw her hands and sign anything, Vale held up the painting. She slumped to the side, pale blue against her white pillow, her shoulders heaving as she shook her head back and forth in useless negation.\u003c/p\u003e\n\u003cp\u003eMel crossed the room on bare feet and curled around Bea, stroking her gently and murmuring to her in Franchian.\u003c/p\u003e\n\u003cp\u003eVale’s voice was gentler than I’d ever heard it, as if he stood over a newborn foal, something spindly and easily snapped. “Bea, we’re so sorry, chère. We need to know about Lenoir and the Malediction Club.”\u003c/p\u003e\n\u003cp\u003eShe shook her head, her eyes squeezed shut. No no no no no.\u003c/p\u003e\n\u003cp\u003eMel caught her hands and held them up. “Yes, love. Yes. You have to. Did they do this to you?” One green finger gestured to Bea’s throat.\u003c/p\u003e\n\u003cp\u003eBea’s hands went up and clenched, and her face screwed up as if she were were caught between trying to throw up and trying to hold something in. Her teeth chattered and clacked, her eyes starting to bulge as some secret, silent battle raged in her chest.\u003c/p\u003e\n\u003cp\u003eVale exhaled hard beside me, his pale eyes filled with grief and worry. His hands went to fists at his sides, as if he could feel Bea’s pain. And then his fingers snapped open. “Wait. Let me try something.”\u003c/p\u003e\n\u003cp\u003eHe looked from Bea’s painting to her tortured face, then thrust the canvas into the banked fire in their grate, where it caught with the same blue sparks as mine had. Bea’s eyes flew open, her hands to her heart, and Mel wrapped her arms firmly around Bea’s shoulders, their skin merging into teal. \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-after-midnight-blud-3/page-56.html","bookId":1599,"creation":"Oct 5, 2019 5:45:51 PM","modification":"Oct 5, 2019 5:45:51 PM"}
