{"id":95406,"no":1,"title":"Page 1","content":"\u003cp\u003eThere was a man and he had eight sons. Apart from that, he was nothing more than a comma on the page of History. It’s sad, but that’s all you can say about some people.\u003c/p\u003e\n\u003cp\u003eBut the eighth son grew up and married and had eight sons, and because there is only one suitable profession for the eighth son of an eighth son, he became a wizard. And he became wise and powerful, or at any rate powerful, and wore a pointed hat and there it would have ended …\u003c/p\u003e\n\u003cp\u003eShould have ended …\u003c/p\u003e\n\u003cp\u003eBut against the Lore of Magic and certainly against all reason-except the reasons of the heart, which are warm and messy and, well, unreasonable - he fled the halls of magic and fell in love and got married, not necessarily in that order.\u003c/p\u003e\n\u003cp\u003eAnd he had seven sons, each one from the cradle at least as powerful as any wizard in the world.\u003c/p\u003e\n\u003cp\u003eAnd then he had an eighth son …\u003c/p\u003e\n\u003cp\u003eA wizard squared. A source of magic.\u003c/p\u003e\n\u003cp\u003eA sourcerer.\u003c/p\u003e\n\u003cp\u003eSummer thunder rolled around the sandy cliffs. Far below, the sea sucked on the shingle as noisily as an old man with one tooth who had been given a gobstopper. A few seagulls hung lazily in the updraughts, waiting for something to happen.\u003c/p\u003e\n\u003cp\u003eAnd the father of wizards sat among the thrift and rattling sea grasses at the edge of the cliff, cradling the child in his arms, staring out to sea.\u003c/p\u003e\n\u003cp\u003eThere was a roil of black cloud out there, heading inland, and the light it pushed before it had that deep syrup quality it gets before a really serious thunderstorm.\u003c/p\u003e\n\u003cp\u003eHe turned at a sudden silence behind him, and looked up through tear-reddened eyes at a tall hooded figure in a black robe.\u003c/p\u003e\n\u003cp\u003eIPSLORE THE RED? it said. The voice was as hollow as a cave, as dense as a neutron star.\u003c/p\u003e\n\u003cp\u003eIpslore grinned the terrible grin of the suddenly mad, and held up the child for Death’s inspection.\u003c/p\u003e\n\u003cp\u003e‘My son,’ he said. ‘I shall call him Coin.’\u003c/p\u003e\n\u003cp\u003eA NAME AS GOOD AS ANY OTHER, said Death politely. His empty sockets stared down at a small round face wrapped in sleep. Despite rumour, Death isn’t cruel-merely terribly, terribly good at his job.\u003c/p\u003e\n\u003cp\u003e‘You took his mother,’ said Ipslore. It was a flat statement, without apparent rancour. In the valley behind the cliffs Ipslore’s homestead was a smoking ruin, the rising wind already spreading the fragile ashes across the hissing dunes.\u003c/p\u003e\n\u003cp\u003eIT WAS A HEART ATTACK AT THE END, said Death. THERE ARE WORSE WAYS TO DIE. TAKE IT FROM ME.\u003c/p\u003e\n\u003cp\u003eIpslore looked out to sea. ‘All my magic could not save her,’ he said.\u003c/p\u003e\n\u003cp\u003eTHERE ARE PLACES WHERE EVEN MAGIC MAY NOT GO.\u003c/p\u003e\n\u003cp\u003e‘And now you have come for the child?’\u003c/p\u003e\n\u003cp\u003eNO. THE CHILD HAS HIS OWN DESTINY I HAVE COME FOR YOU.\u003c/p\u003e\n\u003cp\u003e‘Ah.’ The wizard stood up, carefully laid the sleeping baby down on the thin grass, and picked up a long staff that had been lying there. It was made of a black metal, with a meshwork of silver and gold carvings that gave it a rich and sinister tastelessness; the metal was octiron, intrinsically magical.\u003c/p\u003e\n\u003cp\u003e‘I made this, you know,’ he said. ‘They all said you couldn’t make a staff out of metal, they said they should only be of wood, but they were wrong. I put a lot of myself into it. I shall give it to him.’\u003c/p\u003e\n\u003cp\u003eHe ran his hands lovingly along the staff, which gave off a faint tone.\u003c/p\u003e\n\u003cp\u003eHe repeated, almost to himself, ‘I put a lot of myself into it.’\u003c/p\u003e\n\u003cp\u003eIT IS A GOOD STAFF, said Death.\u003c/p\u003e\n\u003cp\u003eIpslore held it in the air and looked down at his eighth son, who gave a gurgle.\u003c/p\u003e\n\u003cp\u003e‘She wanted a daughter,’ he said.\u003c/p\u003e\n\u003cp\u003eDeath shrugged. Ipslore gave him a look compounded of bewilderment and rage.\u003c/p\u003e\n\u003cp\u003e‘What is he?’\u003c/p\u003e\n\u003cp\u003eTHE EIGHTH SON OF AN EIGHTH SON OF AN EIGHTH SON, said Death, unhelpfully. The wind whipped at his robe, driving the black clouds overhead.\u003c/p\u003e\n\u003cp\u003e‘What does that make him?’\u003c/p\u003e\n\u003cp\u003eA SOURCERER, AS YOU ARE WELL AWARE.\u003c/p\u003e\n\u003cp\u003eThunder rolled, on cue.\u003c/p\u003e\n\u003cp\u003e‘What is his destiny?’ shouted Ipslore, above the rising gale.\u003c/p\u003e\n\u003cp\u003eDeath shrugged again. He was good at it.\u003c/p\u003e\n\u003cp\u003eSOURCERERS MAKE THEIR OWN DESTINY. THEY TOUCH THE EARTH LIGHTLY.\u003c/p\u003e\n\u003cp\u003eIpslore leaned on the staff, drumming on it with his fingers, apparently lost in the maze of his own thoughts. His left eyebrow twitched.\u003c/p\u003e\n\u003cp\u003e‘No,’ he said, softly, ‘no. I will make his destiny for him.’\u003c/p\u003e\n\u003cp\u003eI ADVISE AGAINST IT.\u003c/p\u003e\n\u003cp\u003e‘Be quiet! And listen when I tell you that they drove me out, with their books and their rituals and their Lore! They called themselves wizards, and they had less magic in their whole fat bodies than I have in my little finger! Banished! Me! For showing that I was human! And what would humans be without love?’\u003c/p\u003e\n\u003cp\u003eRARE, said Death. NEVERTHELESS\u003c/p\u003e\n\u003cp\u003e‘Listen! They drove us here, to the ends of the world, and that killed her! They tried to take my staff away!’ Ipslore was screaming above the noise of the wind.\u003c/p\u003e\n\u003cp\u003e‘Well, I still have some power left,’ he snarled. ‘And I say that my son shall go to Unseen University and wear the Archchancellor’s hat and the wizards of the world shall bow to him! And he shall show them what lies in their deepest hearts. Their craven, greedy hearts. He’ll show the world its true destiny, and there will be no magic greater than his.’\u003c/p\u003e\n\u003cp\u003eNO. And the strange thing about the quiet way Death spoke the word was this: it was louder than the roaring of the storm. It jerked Ipslore back to momentary sanity.\u003c/p\u003e\n\u003cp\u003eIpslore rocked back and forth uncertainly. ‘What?’ he said.\u003c/p\u003e\n\u003cp\u003eI SAID NO. NOTHING IS FINAL. NOTHING IS ABSOLUTE. EXCEPT ME, OF COURSE. SUCH TINKERING WITH DESTINY COULD MEAN THE DOWNFALL OF THE WORLD. THERE MUST BE A CHANCE, HOWEVER SMALL. THE LAWYERS OF FATE DEMAND A LOOPHOLE IN EVERY PROPHECY.\u003c/p\u003e\n\u003cp\u003eIpslore stared at Death’s implacable face.\u003c/p\u003e\n\u003cp\u003e‘I must give them a chance?’\u003c/p\u003e\n\u003cp\u003eYES.\u003c/p\u003e\n\u003cp\u003eTap, tap, tap went Ipslore’s fingers on the metal of the staff.\u003c/p\u003e\n\u003cp\u003e‘Then they shall have their chance,’ he said, ‘when hell freezes over.’\u003c/p\u003e\n\u003cp\u003eNO. I AM NOT ALLOWED TO ENLIGHTEN YOU, EVEN BY DEFAULT, ABOUT CURRENT TEMPERATURES IN THE NEXT WORLD.\u003c/p\u003e\n\u003cp\u003e‘Then,’ Ipslore hesitated, ‘then they shall have their chance when my son throws his staff away.’\u003c/p\u003e\n\u003cp\u003eNO WIZARD WOULD EVER THROW HIS STAFF AWAY, said Death. THE BOND IS TOO GREAT.\u003c/p\u003e\n\u003cp\u003e‘Yet it is possible, you must agree.’\u003c/p\u003e\n\u003cp\u003eDeath appeared to consider this. Must was not a word he was accustomed to hearing, but he seemed to concede the point.\u003c/p\u003e\n\u003cp\u003eAGREED, he said.\u003c/p\u003e\n\u003cp\u003e‘Is that a small enough chance for you?’\u003c/p\u003e\n\u003cp\u003eSUFFICIENTLY MOLECULAR.\u003c/p\u003e\n\u003cp\u003eIpslore relaxed a little. In a voice that was nearly normal, he said: ‘I don’t regret it, you know. I would do it all again. Children are our hope for the future.’\u003c/p\u003e\n\u003cp\u003eTHERE IS NO HOPE FOR THE FUTURE, said Death.\u003c/p\u003e\n\u003cp\u003e‘What does it contain, then?’\u003c/p\u003e\n\u003cp\u003eME.\u003c/p\u003e\n\u003cp\u003e‘Besides you I mean!’\u003c/p\u003e\n\u003cp\u003eDeath gave him a puzzled look. I’M SORRY?\u003c/p\u003e\n\u003cp\u003eThe storm reached its howling peak overhead. A seagull went past backwards.\u003c/p\u003e\n\u003cp\u003e‘I meant,’ said Ipslore, bitterly, ‘what is there in this world that makes living worth while?’\u003c/p\u003e\n\u003cp\u003eDeath thought about it.\u003c/p\u003e\n\u003cp\u003eCATS, he said eventually, CATS ARE NICE.\u003c/p\u003e\n\u003cp\u003e‘Curse you!’\u003c/p\u003e\n\u003cp\u003eMANY HAVE, said Death, evenly.\u003c/p\u003e\n\u003cp\u003e‘How much longer do I have?’\u003c/p\u003e\n\u003cp\u003eDeath pulled a large hourglass from the secret recesses of his robe. The two bulbs were enclosed in bars of black and gold, and the sand was nearly all in the bottom one.\u003c/p\u003e\n\u003cp\u003eOH, ABOUT NINE SECONDS.\u003c/p\u003e\n\u003cp\u003eIpslore pulled himself up to his full and still impressive height, and extended the gleaming metal staff towards the child. A hand like a little pink crab reached out from the blanket and grasped it.\u003c/p\u003e\n\u003cp\u003e‘Then let me be the first and last wizard in the history of the world to pass on his staff to his eighth son,’ he said slowly and sonorously. ‘And I charge him to use it to-’\u003c/p\u003e\n\u003cp\u003eI SHOULD HURRY UP, IF I WERE YOU . . .\u003c/p\u003e\n\u003cp\u003e‘-the full,’ said Ipslore, ‘becoming the mightiest-’\u003c/p\u003e\n\u003cp\u003eThe lightning screamed from the heart of the cloud, hit Ipslore on the point of his hat, crackled down his arm, flashed along the staff and struck the child.\u003c/p\u003e\n\u003cp\u003eThe wizard vanished in a wisp of smoke. The staff glowed green, then white, then merely red-hot. The child smiled in his sleep.\u003c/p\u003e\n\u003cp\u003eWhen the thunder had died away Death reached down slowly and picked up the boy, who opened his eyes.\u003c/p\u003e\n\u003cp\u003eThey glowed golden, from the inside. For the first time in what, for want of any better word, must be called his life, Death found himself looking at a stare that he found hard to return. The eyes seemed to be focused on a point several inches inside his skull.\u003c/p\u003e\n\u003cp\u003eI did not mean for that to happen, said the voice of Ipslore, from out of the empty air. Is he harmed?\u003c/p\u003e\n\u003cp\u003eNo. Death tore his gaze away from that fresh, knowing smile. HE CONTAINED THE POWER. HE IS A SOURCERER: NO DOUBT HE WILL SURVIVE MUCH WORSE. AND NOW -YOU WILL COME WITH ME.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eYES. YOU ARE DEAD, YOU SEE. Death looked around for Ipslore’s wavering shade, and failed to find it. WHERE ARE YOU?\u003c/p\u003e\n\u003cp\u003eIn the staff.\u003c/p\u003e\n\u003cp\u003eDeath leaned on his scythe and sighed.\u003c/p\u003e\n\u003cp\u003eFOOLISH. HOW EASILY COULD I CUT YOU LOOSE.\u003c/p\u003e\n\u003cp\u003eNot without destroying the staff, said the voice of Ipslore, and it seemed to Death that there was a new, thick, exultant quality to it. And now the child has accepted the staff you cannot destroy it without destroying him. And that you cannot do without upsetting destiny. My last magic. Rather neat, l feel.\u003c/p\u003e\n\u003cp\u003eDeath prodded the staff. It crackled, and sparks crawled obscenely along its length.\u003c/p\u003e\n\u003cp\u003eStrangely enough, he wasn’t particularly angry. Anger is an emotion, and for emotion you need glands, and Death didn’t have much truck with glands and needed a good run at it to get angry. But he was mildly annoyed. He sighed again. People were always trying this sort of thing. On the other hand, it was quite interesting to watch, and at least this was a bit more original than the usual symbolic chess game, which Death always dreaded because he could never remember how the knight was supposed to move.\u003c/p\u003e\n\u003cp\u003eYOU’RE ONLY PUTTING OFF THE INEVITABLE, he said.\u003c/p\u003e\n\u003cp\u003eThat’s what being alive is all about.\u003c/p\u003e\n\u003cp\u003eBUT WHAT PRECISELY DO YOU EXPECT TO GAIN?\u003c/p\u003e\n\u003cp\u003eI shall be by my son’s side. l shall teach him, even though he won’t know it. I shall guide his understanding. And, when he is ready, l shall guide his steps.\u003c/p\u003e\n\u003cp\u003eTELL ME, said Death, HOW DID YOU GUIDE THE STEPS OF YOUR OTHER SONS?\u003c/p\u003e\n\u003cp\u003eI drove them out. They dared to argue with me, they would not listen to what I could teach them. But this one will.\u003c/p\u003e\n\u003cp\u003eIS THIS WISE?\u003c/p\u003e\n\u003cp\u003eThe staff was silent. Beside it, the boy chuckled at the sound of a voice only he could hear.\u003c/p\u003e\n\u003cp\u003eThere was no analogy for the way in which Great A’Tuin the world turtle moved against the galactic night. When you are ten thousand miles long, your shell pocked with meteor craters and frosted with comet ice, there is absolutely nothing you can realistically be like except yourself.\u003c/p\u003e\n\u003cp\u003eSo Great A’Tuin swam slowly through the interstellar deeps like the largest turtle there has ever been, carrying on its carapace the four huge elephants that bore on their backs the vast, glittering waterfall-fringed circle of the Discworld, which exists either because of some impossible blip on the curve of probability or because the gods enjoy a joke as much as anyone.\u003c/p\u003e\n\u003cp\u003eMore than most people, in fact.\u003c/p\u003e\n\u003cp\u003eNear the shores of the Circle Sea, in the ancient, sprawling city of Ankh-Morpork, on a velvet cushion on a ledge high up in the Unseen University, was a hat. \u003c/p\u003e","sourceLink":"https://allnovel.net/sourcery-discworld-5/page-1.html","bookId":1624,"creation":"Oct 5, 2019 6:14:54 PM","modification":"Oct 5, 2019 6:14:54 PM"}
