{"id":95440,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNijel, on the other hand, felt no such pounding. All he had to drive him onwards was imagination, but he did have enough of that to float a medium-sized war galley. He looked towards the city with what would have been, but for his lack of chin, an expression of setjawed determination.\u003c/p\u003e\n\u003cp\u003eCreosote realised that he was outnumbered.\u003c/p\u003e\n\u003cp\u003e‘Do they have any drink down there?’ he said.\u003c/p\u003e\n\u003cp\u003e‘Lots,’ said Nijel.\u003c/p\u003e\n\u003cp\u003e‘That might do for a start,’ the Seriph conceded. ‘All right, lead on, O peach-breasted daughter of-’\u003c/p\u003e\n\u003cp\u003eAnd no poetry.’\u003c/p\u003e\n\u003cp\u003eThey untangled themselves from the thicket and walked down the hillside until they reached the road which, before very long, went past the aforementioned tavern or, as Creosote persisted in calling it, caravanserai.\u003c/p\u003e\n\u003cp\u003eThey hesitated about going in. It didn’t seem to welcome visitors. But Conina, who by breeding and upbringing tended to skulk around the back of buildings, found four horses tethered in the yard.\u003c/p\u003e\n\u003cp\u003eThey considered them carefully.\u003c/p\u003e\n\u003cp\u003e‘It would be stealing,’ said Nijel, slowly.\u003c/p\u003e\n\u003cp\u003eConina opened her mouth to agree and the words ‘Why not?’ slid past her lips. She shrugged.\u003c/p\u003e\n\u003cp\u003e‘Perhaps we should leave some money-’ Nijel suggested.\u003c/p\u003e\n\u003cp\u003e‘Don’t look at me,’ said Creosote.\u003c/p\u003e\n\u003cp\u003e‘- or maybe write a note and leave it under the bridle. Or something. Don’t you think?’\u003c/p\u003e\n\u003cp\u003eBy way of an answer Conina vaulted up on to the largest horse, which by the look of it belonged to a soldier. Weaponry was slung all over it.\u003c/p\u003e\n\u003cp\u003eCreosote hoisted himself uneasily on to the second horse, a rather skittish bay, and sighed.\u003c/p\u003e\n\u003cp\u003e‘She’s got that letter-box look,’ he said. ‘I should do what she says.’\u003c/p\u003e\n\u003cp\u003eNijel regarded the other two horses suspiciously. One of them was very large and extremely white, not the off-white which was all that most horses could manage, but a translucent, ivory white tone which Nijel felt an unconscious urge to describe as ’shroud’. It also gave him a distinct impression that it was more intelligent than he was.\u003c/p\u003e\n\u003cp\u003eHe selected the other one. It was a bit thin, but docile, and he managed to get on after only two tries.\u003c/p\u003e\n\u003cp\u003eThey set off.\u003c/p\u003e\n\u003cp\u003eThe sound of their hoofbeats barely penetrated the gloom inside the tavern. The innkeeper moved like someone in a dream. He knew he had customers, he’d even spoken to them, he could even see them sitting round a table by the fire, but if asked to describe who he’d talked to and what he had seen he’d have been at a loss. This is because the human brain is remarkably good at shutting out things it doesn’t want to know. His could currently have shielded a bank vault.\u003c/p\u003e\n\u003cp\u003eAnd the drinks! Most of them he’d never heard of, but strange bottles kept appearing on the shelves above the beer barrels. The trouble was that whenever he tried to think about it, his thoughts just slid away …\u003c/p\u003e\n\u003cp\u003eThe figures around the table looked up from their cards.\u003c/p\u003e\n\u003cp\u003eOne of them raised a hand. It’s stuck on the end of his arm and it’s got five fingers, the innkeeper’s mind said. It must be a hand.\u003c/p\u003e\n\u003cp\u003eOne thing the innkeeper’s brain couldn’t shut out was the sound of the voices. This one sounded as though someone was hitting a rock with a roll of sheet lead.\u003c/p\u003e\n\u003cp\u003eBAR PERSON.\u003c/p\u003e\n\u003cp\u003eThe innkeeper groaned faintly. The thermic lances of horror were melting their way steadily through the steel door of his mind.\u003c/p\u003e\n\u003cp\u003eLET ME SEE, NOW. THAT’S A - WHAT WAS IT AGAIN\u003c/p\u003e\n\u003cp\u003e‘A Bloody Mary.’ This voice made a simple drinks order sound like the opening of hostilities.\u003c/p\u003e\n\u003cp\u003eOH, YES. AND\u003c/p\u003e\n\u003cp\u003e‘Mine was a small egg none,’ said Pestilence.\u003c/p\u003e\n\u003cp\u003eAN EGG NOW.\u003c/p\u003e\n\u003cp\u003e‘With a cherry in it.’\u003c/p\u003e\n\u003cp\u003eGOOD, lied the heavy voice. AND THAT’LL BE A SMALL PORT WINE FOR ME AND, the speaker glanced across the table at the fourth member of the quartet and sighed, YOU’D BETTER BRING ANOTHER BOWL OF PEANUTS.\u003c/p\u003e\n\u003cp\u003eAbout three hundred yards down the road the horse thieves were trying to come to terms with a new experience.\u003c/p\u003e\n\u003cp\u003e‘Certainly a smooth ride,’ Nijel managed eventually.\u003c/p\u003e\n\u003cp\u003e‘And a lovely - a lovely view,’ said Creosote, his voice lost in the slipstream.\u003c/p\u003e\n\u003cp\u003e‘But I wonder,’ said Nijel, ‘if we have done exactly the right thing.’\u003c/p\u003e\n\u003cp\u003e‘We’re moving, aren’t we?’ demanded Conina. ‘Don’t be petty.’\u003c/p\u003e\n\u003cp\u003e‘It’s just that, well, looking at cumulus clouds from above is-’\u003c/p\u003e\n\u003cp\u003e‘Shut up.’\u003c/p\u003e\n\u003cp\u003e‘Sorry.’\u003c/p\u003e\n\u003cp\u003e‘Anyway, they’re stratus. Cumulus at most.’\u003c/p\u003e\n\u003cp\u003e‘Right,’ said Nijel miserably.\u003c/p\u003e\n\u003cp\u003e‘Does it make any difference?’ said Creosote, who was lying flat on his horse’s neck with his eyes shut.\u003c/p\u003e\n\u003cp\u003e‘About a thousand feet.’\u003c/p\u003e\n\u003cp\u003e‘Oh.’\u003c/p\u003e\n\u003cp\u003e‘Could be seven hundred and fifty,’ conceded Conina.\u003c/p\u003e\n\u003cp\u003e‘Ah.’\u003c/p\u003e\n\u003cp\u003eThe tower of sourcery trembled. Coloured smoke rolled through its vaulted rooms and shining corridors. In the big room at the very tip, where the air was thick and greasy and tasted of burning tin, many wizards had passed out with the sheer mental effort of the battle. But enough remained. They sat in a wide circle, locked in concentration.\u003c/p\u003e\n\u003cp\u003eIt was just possible to see the shimmering in the air as the raw sourcery swirled out of the staff in Coin’s hand and into the centre of the octogram.\u003c/p\u003e\n\u003cp\u003eOutlandish shapes appeared for a brief instant and vanished. The very fabric of reality was being put through the wringer in there.\u003c/p\u003e\n\u003cp\u003eCarding shuddered, and turned away in case he saw anything he really couldn’t ignore.\u003c/p\u003e\n\u003cp\u003eThe surviving senior wizards had a simulacrum of the Disc hovering in front of them. As Carding looked at it again the little red glow over the city of Quirm flared and went out.\u003c/p\u003e\n\u003cp\u003eThe air creaked.\u003c/p\u003e\n\u003cp\u003e‘There goes Quirm,’ murmured Carding.\u003c/p\u003e\n\u003cp\u003e‘That just leaves Al Khali,’ said one of the others.\u003c/p\u003e\n\u003cp\u003e‘There’s some clever power there.’\u003c/p\u003e\n\u003cp\u003eCarding nodded glumly. He’d quite liked Quirm, which was a -had been a pleasant little city overlooking the Rim Ocean.\u003c/p\u003e\n\u003cp\u003eHe dimly recalled being taken there, once, when he was small. For a moment he gazed sadly into the past. It had wild geraniums, he recalled, filling the sloping cobbled streets with their musky fragrance.\u003c/p\u003e\n\u003cp\u003e‘Growing out of the walls,’ he said out loud. ‘Pink. They were pink.’\u003c/p\u003e\n\u003cp\u003eThe other wizards looked at him oddly. One or two, of a particularly paranoid frame of mind even for wizards, glanced suspiciously at the walls.\u003c/p\u003e\n\u003cp\u003e‘Are you all right?’ said one of them.\u003c/p\u003e\n\u003cp\u003e‘Um?’ said Carding, ‘Oh. Yes, Sorry. Miles away.’\u003c/p\u003e\n\u003cp\u003eHe turned back to look at Coin, who was sitting off to one side of the circle with the staff across his knees. The boy appeared to be asleep. Perhaps he was. But Carding knew in the tormented pit of his soul that the staff didn’t sleep. It was watching him, testing his mind.\u003c/p\u003e\n\u003cp\u003eIt knew. It even knew about the pink geraniums.\u003c/p\u003e\n\u003cp\u003e‘I never wanted it to be like this,’ he said softly. ‘All we really wanted was a bit of respect.’\u003c/p\u003e\n\u003cp\u003e‘Are you sure you’re all right?’\u003c/p\u003e\n\u003cp\u003eCarding nodded vaguely. As his colleagues resumed their concentration he glanced sideways at them.\u003c/p\u003e\n\u003cp\u003eSomehow, all his old friends had gone. Well, not friends. A wizard never had friends, at least not friends who were wizards. It needed a different word. Ah yes, that was it. Enemies. But a very decent class of enemies. Gentlemen. The cream of their profession. Not like these people, for all that they seemed to have risen in the craft since the sourcerer had arrived.\u003c/p\u003e\n\u003cp\u003eOther things besides the cream floated to the top, he reflected sourly.\u003c/p\u003e\n\u003cp\u003eHe turned his attention to Al Khali, probing with his mind, knowing that the wizards there were almost certainly doing the same, seeking constantly for a point of weakness.\u003c/p\u003e\n\u003cp\u003eHe thought: am I a point of weakness? Spelter tried to tell me something. It was about the staff. A man should lean on his staff, not the other way around … it’s steering him, leading him … I wish I’d listened to Spelter … this is wrong, I’m a point of weakness …\u003c/p\u003e\n\u003cp\u003eHe tried again, riding the surges of power, letting them carry his mind into the enemy tower. Even Abrim was making use of sourcery, and Carding let himself modulate the wave, insinuating himself past the defences erected against him.\u003c/p\u003e\n\u003cp\u003eThe image of the interior of the Al Khali tower appeared, focused …\u003c/p\u003e\n\u003cp\u003e… the Luggage trundled along the glowing corridors. It was exceedingly angry now. It had been awoken from hibernation, it had been scorned, it had been briefly attacked by a variety of mythological and now extinct lifeforms, it had a headache and now, as it entered the Great Hall, it detected the hat. The horrible hat, the cause of everything it was currently suffering. It advanced purposefully …\u003c/p\u003e\n\u003cp\u003eCarding, testing the resistance of Abrim’s mind, felt the man’s attention waver. For a moment he saw through the enemy’s eyes, saw the squat oblong cantering across the stone. For a moment Abrim attempted to shift his concentration and then, no more able to help himself than is a cat when it sees something small and squeaky run across the floor, Carding struck.\u003c/p\u003e\n\u003cp\u003eNot much. It didn’t need much. Abrim’s mind was attempting to balance and channel huge forces, and it needed hardly any pressure to topple it from its position.\u003c/p\u003e\n\u003cp\u003eAbrim extended his hands to blast the Luggage, gave the merest beginnings of a scream, and imploded.\u003c/p\u003e\n\u003cp\u003eThe wizards around him thought they saw him grow impossibly small in a fraction of a second and vanish, leaving a black after-image …\u003c/p\u003e\n\u003cp\u003eThe more intelligent of them started to run …\u003c/p\u003e\n\u003cp\u003eAnd the magic he had been controlling surged back out and flooded free in one great, randomised burst that blew the hat to bits, took out the entire lower levels of the tower and quite a large part of what remained of the city.\u003c/p\u003e\n\u003cp\u003eSo many wizards in Ankh had been concentrating on the hall that the sympathetic resonance blew them across the room. Carding ended up on his back, his hat over his eyes.\u003c/p\u003e\n\u003cp\u003eThey hauled him out and dusted him off and carried him to Coin and the staff, amid cheers - although some of the older wizards forbore to cheer. But he didn’t seem to pay any attention.\u003c/p\u003e\n\u003cp\u003eHe stared sightlessly down at the boy, and then slowly raised his hands to his ears.\u003c/p\u003e\n\u003cp\u003e‘Can’t you hear them?’ he said.\u003c/p\u003e\n\u003cp\u003eThe wizards fell silent. Carding still had power, and the tone of his voice would have quelled a thunderstorm.\u003c/p\u003e\n\u003cp\u003eCoin’s eyes glowed.\u003c/p\u003e\n\u003cp\u003e‘I hear nothing,’ he said.\u003c/p\u003e\n\u003cp\u003eCarding turned to the rest of the wizards.\u003c/p\u003e\n\u003cp\u003e‘Can’t you hear them?’\u003c/p\u003e\n\u003cp\u003eThey shook their heads. One of them said, ‘Hear what, brother?’\u003c/p\u003e\n\u003cp\u003eCarding smiled, and it was a wide, mad smile. Even Coin took a step backwards.\u003c/p\u003e\n\u003cp\u003e‘You’ll hear them soon enough,’ he said. ‘You’ve made a beacon. You’ll all hear them. But you won’t hear them for long.’ He pushed aside the younger wizards who were holding his arms and advanced on Coin.\u003c/p\u003e\n\u003cp\u003e‘You’re pouring sourcery into the world and other things are coming with it,’ he said. ‘Others have given them a pathway but you’ve given them an avenue!’\u003c/p\u003e\n\u003cp\u003eHe sprang forward and snatched the black staff out of Coin’s hands and swung it up in the air to smash it against the wall.\u003c/p\u003e\n\u003cp\u003eCarding went rigid as the staff struck back. Then his skin began to blister … \u003c/p\u003e","sourceLink":"https://allnovel.net/sourcery-discworld-5/page-35.html","bookId":1624,"creation":"Oct 5, 2019 6:14:54 PM","modification":"Oct 5, 2019 6:14:54 PM"}
