{"id":95413,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSomething terrible is happening at the University. It is vital that we are not taken back, do you understand? You must take us to Klatch, where there is someone fit to wear me.\u003c/p\u003e\n\u003cp\u003e‘Why?’ There was something very strange about the voice, Rincewind decided. It sounded impossible to disobey, as though it was solid destiny. If it told him to walk over a cliff, he thought, he’d be halfway down before it could occur to him to disobey.\u003c/p\u003e\n\u003cp\u003eThe death of all wizardry is at hand.\u003c/p\u003e\n\u003cp\u003eRincewind looked around guiltily.\u003c/p\u003e\n\u003cp\u003e‘Why?’ he said.\u003c/p\u003e\n\u003cp\u003eThe world is going to end.\u003c/p\u003e\n\u003cp\u003e‘What, again?’\u003c/p\u003e\n\u003cp\u003eI mean it, said the hat sulkily. The triumph of the Ice Giants, the Apocralypse, the Teatime of the Gods, the whole thing.\u003c/p\u003e\n\u003cp\u003e‘Can we stop it?’\u003c/p\u003e\n\u003cp\u003eThe future is uncertain on that point.\u003c/p\u003e\n\u003cp\u003eRincewind’s expression of determined terror faded slowly.\u003c/p\u003e\n\u003cp\u003e‘Is this a riddle?’ he said.\u003c/p\u003e\n\u003cp\u003ePerhaps it would be simpler if you just did what you’re told and didn’t try to understand things, said the hat. Young woman, you will put us back in our box. A great many people will shortly be looking for us.\u003c/p\u003e\n\u003cp\u003e‘Hey, hold on,’ said Rincewind. ‘I’ve seen you around here for years and you never talked before.’\u003c/p\u003e\n\u003cp\u003eI didn’t have anything that needed to be said.\u003c/p\u003e\n\u003cp\u003eRincewind nodded. That seemed reasonable.\u003c/p\u003e\n\u003cp\u003e‘Look, just shove it in its box, and let’s get going,’ said the girl.\u003c/p\u003e\n\u003cp\u003eA bit more respect if you please, young lady,’ said Rincewind haughtily. ‘That is the symbol of ancient wizardry you happen to be addressing.’\u003c/p\u003e\n\u003cp\u003e‘You carry it, then,’ she said.\u003c/p\u003e\n\u003cp\u003e‘Hey, look,’ said Rincewind, scrambling along after her as she swept down the alleys, crossed a narrow street and entered another alley between a couple of houses that leaned together so drunkenly that their upper storeys actually touched. She stopped.\u003c/p\u003e\n\u003cp\u003e‘Well?’ she snapped.\u003c/p\u003e\n\u003cp\u003e‘You’re the mystery thief, aren’t you?’ he said, ‘Everyone’s been talking about you, how you’ve taken things even from locked rooms and everything. You’re different than I imagined…’\u003c/p\u003e\n\u003cp\u003e‘Oh?’ she said coldly. ‘How?’\u003c/p\u003e\n\u003cp\u003e‘Well, you’re … shorter.’\u003c/p\u003e\n\u003cp\u003e‘Oh, come on.’\u003c/p\u003e\n\u003cp\u003eThe street cressets, not particularly common in this part of the city in any case, gave out altogether here. There was nothing but watchful darkness ahead.\u003c/p\u003e\n\u003cp\u003e‘I said come on,’ she repeated. ‘What are you afraid of?’\u003c/p\u003e\n\u003cp\u003eRincewind took a deep breath. ‘Murderers, muggers, thieves, assassins, pickpockets, cutpurses, reevers, snigsmen, rapists and robbers,’ he said. ‘That’s the Shades you’re going into!’[8]\u003c/p\u003e\n\u003cp\u003e‘Yes, but people won’t come looking for us in here,’ she said.\u003c/p\u003e\n\u003cp\u003e‘Oh, they’ll come in all right, they just won’t come out,’ said Rincewind. ‘Nor will we. I mean, a beautiful young woman like you … it doesn’t bear thinking about … I mean, some of the people in there …’\u003c/p\u003e\n\u003cp\u003e‘But I’ll have you to protect me,’ she said.\u003c/p\u003e\n\u003cp\u003eRincewind thought he heard the sound of marching feet several streets away.\u003c/p\u003e\n\u003cp\u003e‘You know,’ he sighed, ‘I knew you’d say that.’\u003c/p\u003e\n\u003cp\u003eDown these mean streets a man must walk, he thought. And along some of them he will break into a run.\u003c/p\u003e\n\u003cp\u003eIt is so black in the Shades on this foggy spring night that it would be too dark to read about Rincewind’s progress through the eerie streets, so the descriptive passage will lift up above the level of the ornate rooftops, the forest of twisty chimneys, and admire the few twinkling stars that manage to pierce the swirling billows. It will try to ignore the sounds drifting up from below the patter of feet, the rushes, the gristly noises, the groans, the muffled screams. It could be that some wild animal is pacing through the Shades after two weeks on a starvation diet.\u003c/p\u003e\n\u003cp\u003eSomewhere near the centre of the Shades - the district has never been adequately mapped - is a small courtyard. Here at least there are torches on the walls, but the light they throw is the light of the Shades themselves: mean, reddened, dark at the core.\u003c/p\u003e\n\u003cp\u003eRincewind staggered into the yard and hung on to the wall for support. The girl stepped into the ruddy light behind him, humming to herself.\u003c/p\u003e\n\u003cp\u003e‘Are you all right?’ she said.\u003c/p\u003e\n\u003cp\u003e‘Nurrgh,’ said Rincewind.\u003c/p\u003e\n\u003cp\u003e‘Sorry?’\u003c/p\u003e\n\u003cp\u003e‘Those men,’ he bubbled, ‘I mean, the way you kicked his … when you grabbed them by the … when you stabbed that one right in … who are you?’\u003c/p\u003e\n\u003cp\u003e‘My name is Conina.’\u003c/p\u003e\n\u003cp\u003eRincewind looked at her blankly for some time.\u003c/p\u003e\n\u003cp\u003e‘Sorry,’ he said, ‘doesn’t ring a bell.’\u003c/p\u003e\n\u003cp\u003e‘I haven’t been here long,’ she said.\u003c/p\u003e\n\u003cp\u003e‘Yes, I didn’t think you were from around these parts,’ he said. ‘I would have heard.’\u003c/p\u003e\n\u003cp\u003e‘I’ve taken lodgings here. Shall we go in?’\u003c/p\u003e\n\u003cp\u003eRincewind glanced up at the dingy pole just visible in the smoky light of the spitting torches. It indicated that the hostelry behind the small dark door was the Troll’s Head.\u003c/p\u003e\n\u003cp\u003eIt might be thought that the Mended Drum, scene of unseemly scuffles only an hour ago, was a seedy disreputable tavern. In fact it was a reputable disreputable tavern. Its customers had a certain rough-hewn respectability - they might murder each other in an easygoing way, as between equals, but they didn’t do it vindictively. A child could go in for a glass of lemonade and be certain of getting nothing worse than a clip round the ear when his mother heard his expanded vocabulary. On quiet nights, and when he was certain the Librarian wasn’t going to come in, the landlord was even known to put bowls of peanuts on the bar.\u003c/p\u003e\n\u003cp\u003eThe Troll’s Head was a cesspit of a different odour. Its customers, if they reformed, tidied themselves up and generally improved their image out of all recognition might, just might, aspire to be considered the utter dregs of humanity. And in the Shades, a dreg is a dreg.\u003c/p\u003e\n\u003cp\u003eBy the way, the thing on the pole isn’t a sign. When they decided to call the place the Troll’s Head, they didn’t mess about.\u003c/p\u003e\n\u003cp\u003eFeeling sick, and clutching the grumbling hatbox to his chest, Rincewind stepped inside.\u003c/p\u003e\n\u003cp\u003eSilence. It wrapped itself around them, nearly as thickly as the smoke of a dozen substances guaranteed to turn any normal brain to cheese. Suspicious eyes peered through the smog.\u003c/p\u003e\n\u003cp\u003eA couple of dice clattered to a halt on a tabletop. They sounded very loud, and probably weren’t showing Rincewind’s lucky number.\u003c/p\u003e\n\u003cp\u003eHe was aware of the stares of several score of customers as he followed the demure and surprisingly small figure of Conina into the room. He looked sideways into the leering faces of men who would kill him sooner than think, and in fact would find it a great deal easier.\u003c/p\u003e\n\u003cp\u003eWhere a respectable tavern would have had a bar there was just a row of squat black bottles and a couple of big barrels on trestles against the wall.\u003c/p\u003e\n\u003cp\u003eThe silence tightened like a tourniquet. Any minute now, Rincewind thought.\u003c/p\u003e\n\u003cp\u003eA big fat man wearing nothing but a fur vest and a leather loincloth pushed back his stool and lurched to his feet and winked evilly at his colleagues. When his mouth opened, it was like a hole with a hem.\u003c/p\u003e\n\u003cp\u003e‘Looking for a man, little lady?’ he said.\u003c/p\u003e\n\u003cp\u003eShe looked up at him.\u003c/p\u003e\n\u003cp\u003e‘Please keep away’\u003c/p\u003e\n\u003cp\u003eA snake of laughter writhed around the room. Conina’s mouth snapped shut like a letterbox.\u003c/p\u003e\n\u003cp\u003e‘Ah,’ the big man gurgled, ‘that’s right, I likes a girl with spirit-’\u003c/p\u003e\n\u003cp\u003eConina’s hand moved. It was a pale blur, stopping here and here: after a few seconds of disbelief the man gave a little grunt and folded up, very slowly.\u003c/p\u003e\n\u003cp\u003eRincewind shrank back as every other man in the room leaned forward. His instinct was to run, and he knew it was an instinct that would get him instantly killed. It was the Shades out there. Whatever was going to happen to him next was going to happen to him here. It was not a reassuring thought.\u003c/p\u003e\n\u003cp\u003eA hand closed around his mouth. Two more grabbed the hatbox from his arms.\u003c/p\u003e\n\u003cp\u003eConina spun past him, lifting her skirt to place a neat foot on a target beside Rincewind’s waist. Someone whimpered in his ear and collapsed. As the girl pirouetted gracefully around she picked up two bottles, knocked out their bottoms on the shelf and landed with their jagged ends held out in front of her. Morpork daggers, they were called in the patois of the streets.\u003c/p\u003e\n\u003cp\u003eIn the face of them, the Troll’s Head’s clientele lost interest.\u003c/p\u003e\n\u003cp\u003e‘Someone got the hat,’ Rincewind muttered through dry lips, ‘They slipped out of the back way.’\u003c/p\u003e\n\u003cp\u003eShe glared at him and made for the door. The Head’s crowd of customers parted automatically, like sharks recognising another shark, and Rincewind darted anxiously after her before they came to any conclusion about him.\u003c/p\u003e\n\u003cp\u003eThey ran out into another alley and pounded down it. Rincewind tried to keep up with the girl; people following her tended to tread on sharp things, and he wasn’t sure she’d remember he was on her side, whatever side that was.\u003c/p\u003e\n\u003cp\u003eA thin, half-hearted drizzle was falling. And at the end of the alley was a faint blue glow.\u003c/p\u003e\n\u003cp\u003e‘Wait!’\u003c/p\u003e\n\u003cp\u003eThe terror in Rincewind’s voice was enough to slow her down.\u003c/p\u003e\n\u003cp\u003e‘What’s wrong?’\u003c/p\u003e\n\u003cp\u003e‘Why’s he stopped?’\u003c/p\u003e\n\u003cp\u003e‘I’ll ask him,’ said Conina, firmly.\u003c/p\u003e\n\u003cp\u003e‘Why’s he covered in snow?’\u003c/p\u003e\n\u003cp\u003eShe stopped and turned around, arms thrust into her sides, one foot tapping impatiently on the damp cobbles.\u003c/p\u003e\n\u003cp\u003e‘Rincewind, I’ve known you for an hour and I’m astonished you’ve lived even that long!’\u003c/p\u003e\n\u003cp\u003e‘Yes, but I have, haven’t I? I’ve got a sort of talent for it. Ask anyone. I’m an addict.’\u003c/p\u003e\n\u003cp\u003e‘Addicted to what?’\u003c/p\u003e\n\u003cp\u003e‘Life. I got hooked on it at an early age and I don’t want to give it up and take it from me, this doesn’t look right!’\u003c/p\u003e\n\u003cp\u003eConina looked back at the figure surrounded by the glowing blue aura. It seemed to be looking at something in its hands.\u003c/p\u003e\n\u003cp\u003eSnow was settling on its shoulder like really bad dandruff. Terminal dandruff. Rincewind had an instinct for these things, and he had a deep suspicion that the man had gone where shampoo would be no help at all.\u003c/p\u003e\n\u003cp\u003eThey sidled along a glistening wall.\u003c/p\u003e\n\u003cp\u003e‘There’s something very strange about him,’ she conceded.\u003c/p\u003e\n\u003cp\u003e‘You mean the way he’s got his own private blizzard?’\u003c/p\u003e\n\u003cp\u003e‘Doesn’t seem to upset him. He’s smiling.’\u003c/p\u003e\n\u003cp\u003e‘A frozen grin, I’d call it.’\u003c/p\u003e\n\u003cp\u003eThe man’s icicle-hung hands had been taking the lid off the box, and the glow from the hat’s octarines shone up into a pair of greedy eyes that were already heavily rimed with frost.\u003c/p\u003e\n\u003cp\u003e‘Know him?’ said Conina.\u003c/p\u003e\n\u003cp\u003eRincewind shrugged. ‘I’ve seen him around,’ he said. ‘He’s called Larry the Fox or Fezzy the Stoat or something. Some sort of rodent, anyway. He just steals things. He’s harmless.’\u003c/p\u003e\n\u003cp\u003e‘He looks incredibly cold.’ Conina shivered.\u003c/p\u003e\n\u003cp\u003e‘I expect he’s gone to a warmer place. Don’t you think we should shut the box?’\u003c/p\u003e\n\u003cp\u003eIt’s perfectly safe now, said the hat’s voice from inside the glow. And so perish all enemies of wizardry. \u003c/p\u003e","sourceLink":"https://allnovel.net/sourcery-discworld-5/page-8.html","bookId":1624,"creation":"Oct 5, 2019 6:14:54 PM","modification":"Oct 5, 2019 6:14:54 PM"}
