{"id":21446,"no":1,"title":"Translator’s Preface","content":"\u0026nbsp;The charming story of “Gudrun” is a romance of the old heroic period, written by some unknown poet of Austria or Bavaria in the thirteenth century. Next to the “Nibelungen Lied,” it is the most important of the German epic poems. Indeed some of the person? in “Gudrun” are found in the “Lied,” though varying in personal characteristics, probably because they were taken from different legends. The scenes of “Gudrun” are principally laid along the shores of the North Sea and in Normandy. The men and women in this poem resemble generally those in the “Lied.” The same elemental passions are depicted. The men are brave, vigorous heroes, rejoicing in battle and feats of prowess; the women are beautiful, constant, and courageous. There are many fine delineations of character in the original, as well as vigorous sketches of northern scenery. The figure of Gudrun stands out in bold relief among the maidens. There are few more beautiful characters, indeed, in the poems of the old heroic period, and it adds to the charm of the epic that she does not suffer the tragic fate of Kriemhild in the “Nibelungen Lied,” but that her constancy and devotion are rewarded by her ultimate reunion with her knightly lover, King Herwig. There are many serious passages, but from the very first there is the conviction that Gudrun and Herwig, in spite of all the dangers and vicissitudes through which they pass, will in the end be reunited. And so it happens. Gudrun’s name is always spoken by her people with reverence. “Her courage and constancy were extolled by them, and in after days her fame was as radiant as the stars in the heavens.” \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n G. P. U.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Chicago, July 1, 1906.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3223/87854.html","bookId":703,"creation":"Aug 2, 2019 1:04:03 PM","modification":"Aug 2, 2019 1:04:03 PM"}
