{"id":21454,"no":9,"title":"Chapter VIII The Reception","content":"\u0026nbsp;Soon the fleet reached the shore, and Hartmut sent messengers to his mother to bid her prepare to receive Gudrun as became her rank. Gerlinda was overjoyed when she learned that the daughter of that haughty monarch who had once offered her such an affront was with the Normans on the ships, and ordered the costliest apparel to be made ready, though rather, it must be said, to display her own riches than to fulfil the wishes of her son. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now Hartmut had a sister named Ortrun, who rejoiced in the thought that Gudrun would be a beloved sister to her, and joyfully assisted in all the preparations for the festivities. Three days were thus occupied, and on the fourth morning a splendid procession wended its way down from the royal castle to the shore. Gerlinda and Ortrun came first, mounted on white palfreys and arrayed in magnificent robes of silk interwoven with gold, while behind them rode a glittering train of knights, all sumptuously attired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 44\n\u003c/div\u003e \n\u003cdiv\u003e\n Joyous strains of music penetrated to the ships, but they fell on Gudrun’s ear like the harsh cry of the screech-owl. Soon she with her maidens was conducted to the land.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The broken-hearted royal maid\n\u003c/div\u003e \n\u003cdiv\u003e\n With tottering steps was seen—\n\u003c/div\u003e \n\u003cdiv\u003e\n Shrinking from Hartmut’s proffered aid—\n\u003c/div\u003e \n\u003cdiv\u003e\n Approach the haughty Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ortrun, impatient, longed to make\n\u003c/div\u003e \n\u003cdiv\u003e\n Her loving welcome known,\n\u003c/div\u003e \n\u003cdiv\u003e\n For to her seemed this stranger maid\n\u003c/div\u003e \n\u003cdiv\u003e\n Like sister all her own.\n\u003c/div\u003e \n\u003cdiv\u003e\n But as she joyously draws nigh,\n\u003c/div\u003e \n\u003cdiv\u003e\n With sinking heart she sees\n\u003c/div\u003e \n\u003cdiv\u003e\n In Gudrun’s eyes the bitter tears—\n\u003c/div\u003e \n\u003cdiv\u003e\n Then all her rapture flees.\n\u003c/div\u003e \n\u003cdiv\u003e\n They closely clasp each other’s hand—\n\u003c/div\u003e \n\u003cdiv\u003e\n A kiss—and then they part:\n\u003c/div\u003e \n\u003cdiv\u003e\n No words they speak, but in their eyes\n\u003c/div\u003e \n\u003cdiv\u003e\n Each reads the other’s heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Queen Gerlinda turned to her\n\u003c/div\u003e \n\u003cdiv\u003e\n With falsely flattering look\n\u003c/div\u003e \n\u003cdiv\u003e\n And would have sought a greeting kiss—\n\u003c/div\u003e \n\u003cdiv\u003e\n This Gudrun would not brook.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Approach me not!” she proudly said,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thou cause of all my woe!\n\u003c/div\u003e \n\u003cdiv\u003e\n For me to suffer thy embrace\n\u003c/div\u003e \n\u003cdiv\u003e\n Were worse than crime, I trow!”\n\u003c/div\u003e \n\u003cdiv\u003e\n 45\n\u003c/div\u003e \n\u003cdiv\u003e\n Gerlinda seemed not to hear these words, but her heart swelled within her with rage. Tents were now pitched on the green sunny meadow, and Hartmut spared no pains to please and cheer Gudrun with music and tilting, but her tears flowed unceasingly, nor could all his efforts avail to comfort her. She sat with her head on Ortrun’s shoulder, and Ortrun wept with her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Moved by her sorrow, Hartmut put an end to the games and gave the signal for departure. At the castle Gudrun found sumptuous apartments prepared for her and her maidens, but she felt as if she were entering a tomb; in truth, it would have been a welcome thought to her could she have felt that never again should she awake.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3223/87862.html","bookId":703,"creation":"Aug 2, 2019 1:04:03 PM","modification":"Aug 2, 2019 1:04:03 PM"}
